{
  "id": "topic_5465991",
  "title": "Abiky",
  "author": "Abiky",
  "created_time": "September 07, 2023, 12:10:16 PM",
  "content": "Ever since ETH adopted PoS, things have been going into the wrong direction. The network is as centralized as ever with a few big players controlling a large portion of ETH's supply. On top of that, the vast majority of nodes are running on top of Amazon Web Services (AWS). If developers don't do anything about this, ETH will become as bad as XRP in the future. My biggest concern is not only this, but also Ethereum creator Vitalik Buterin. The project is too tied around him. So if he dies (God forbid) or something bad happens to him, you expect ETH's market prices to go all the way down the drain in an instant. It's likely ETH will become worthless after this.What do you think? Is the endgame for ETH approaching? Will it be possible for ETH to become decentralized again? Or is it already too late? Your input will be greatly appreciated. Thank you.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5465991",
  "comments": [
    {
      "author": "Yogee",
      "created_time": "September 07, 2023, 12:50:24 PM",
      "body": "Quote from: Abiky on September 07, 2023, 12:10:16 PM[.....] My biggest concern is not only this, but also Ethereum creator Vitalik Buterin. The project is too tied around him. o if he dies (God forbid) or something bad happens to him, you expect ETH's market prices to go all the way down the drain in an instant. It's likely ETH will become worthless after this.I disagree. It's true that he's the only one left out of the co-founders and he remains the major face of Ethereum but there are many people in the background that will keep the chain going even after he's out of the picture. Many brands have survived such situation because they were able to build a solid community of users through the years and I think Ethereum will be the same.Quote from: Abiky on September 07, 2023, 12:10:16 PM[....]Will it be possible for ETH to become decentralized again?Back to POW? I doubt that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "masulum",
      "created_time": "September 07, 2023, 01:53:46 PM",
      "body": "Quote from: Abiky on September 07, 2023, 12:10:16 PM-snip-My biggest concern is not only this, but also Ethereum creator Vitalik Buterin. The project is too tied around him. So if he dies (God forbid) or something bad happens to him, you expect ETH's market prices to go all the way down the drain in an instant. It's likely ETH will become worthless after this.What do you think? Is the endgame for ETH approaching? Will it be possible for ETH to become decentralized again? Or is it already too late? Your input will be greatly appreciated. Thank you. We can start from a team member who has influence- Vitalik Buterin Founder & Inventor.- Mihai Alisie Founder.- Aya Miyaguchi Executive Director.If, one day, Vitalik dies, there will still be people backing up. This backup will recruit another team member to fill the Co-Founder position. This will continue continuously. Because ETH not only individuals but also an organization/company. So, when a creator dies, there will definitely be someone to take over that position. So, there's no need to worry about that. Remember Apple? Your current thoughts are exactly the same as what Apple experienced when Steve Jobs died. Apple still exists today, the idea may not be the same as when the creator was alive. Ethereum may be so, but the community can become creators to contribute brilliant ideas. IMO",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "danherbias07",
      "created_time": "September 07, 2023, 02:05:55 PM",
      "body": "There's no going back to proof of work, that would be suicide. We know how bad the transaction speed and transaction fees are when they are still in POW. I mean, that is one of the reasons why they changed it to POS. Endgame? There will always be next in kin or let's say someone near him who will continue Vitalik Buterin's legacy. I think they are better here or maybe we are just rushing things. It has not been so long since they changed to POS and the hype about it just finished so why kill it already? For me, I am giving it more time. I am invested with Ethereum but I have no worries yet. They are still the top 1 in the altcoin industry and I doubt that can easily be toppled even for maybe 5 years or more. Fingers crossed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Blitzboy",
      "created_time": "September 07, 2023, 03:38:58 PM",
      "body": "PoS was expected to provide a more energy-efficient consensus method, but it appears to have concentrated power with significant stakeholders. Yes, using Amazon Web Services (AWS) for node hosting is risky.While Vitalik Buterin has helped Ethereum succeed, I think the community's strength is its diverse and dedicated developers. Ethereum's resilience shouldnt be underestimated, even though any abrupt emergency affecting him would be sad. However, the platform's long-term viability must be assessed regularly.Regarding ETH's endgame, I think its too early to say. Blockchain technology evolves in general. Ethereum's community has been adaptable, so they may develop solutions. Every big blockchain struggles with decentralization, but I keep hoping.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TheUltraElite",
      "created_time": "September 07, 2023, 03:39:59 PM",
      "body": "They will not go back to PoW, its PoS from now on, and I think the rebellion died out because it like either take it or leave it situation. Those who remained will support the coin till their last while those who left, silenced their voices and started minding their own business, thats how debates before a decision proceed to an end or near-end.Regarding the founder, its simple enough to see that they will succeeded by another person who is like second in command. As the organization grows such people will continue to come in and that is the least of the problems at least for now. You could argue that the main innovator in any company is one person, which I would agree with, but the show has to go on.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sunsilk",
      "created_time": "September 07, 2023, 04:29:53 PM",
      "body": "While it is Vitalik who became the face of Ethereum, it's not just only him that works on it. As per Ethereum's foundation, there goes its own community and as well as the dev that will take over if then, whatever happens. I don't see the end game on it and despite that PoS isn't really what mostly like. This change has been already adopted by the majority. I can compare Litecoin's Charlie Lee that has dumped all his holdings on it and then it is still going on, alive until now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wiwo",
      "created_time": "September 07, 2023, 05:14:34 PM",
      "body": "Quote from: Abiky on September 07, 2023, 12:10:16 PM. So if he dies (God forbid) or something bad happens to him, you expect ETH's market prices to go all the way down the drain in an instant. It's likely ETH will become worthless after this.  hey mate are you scared of his death? After all Satoshi have been unavailable for God knows how long and bitcoin is steal doing fine. Death is inevitable and everyone will test death at some point,  but putting a proper system on ground os what make the project to exist e long after it creator,  and in Ethereum case,  the recent transfer of network have opened them up for a lot of things and we can't accurately say what will happen in the future. But we have to always have it at the back of our mind constantly that centralization is higher risk must, especially in technology that have high risk like crypto.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "avikz",
      "created_time": "September 07, 2023, 05:36:19 PM",
      "body": "Quote from: Abiky on September 07, 2023, 12:10:16 PMWhat do you think? Is the endgame for ETH approaching? Will it be possible for ETH to become decentralized again? Or is it already too late? Your input will be greatly appreciated. Thank you. I think really highly about this move. POS is making ETH accessible to everyone by removing the entry barrier. Now if you want to start Bitcoin mining, you need a huge investment. For ETH, you can use the staking pools to start mining with a bare minimum investment. So ETH is doing a great job by making cryptocurrency mining affordable and accessible to all. That's decentralisation!ETH is not going to end anytime soon! Rather it's on a path to grow. They will never go back to POS.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "goaldigger",
      "created_time": "September 07, 2023, 08:58:11 PM",
      "body": "Quote from: Abiky on September 07, 2023, 12:10:16 PMWhat do you think? Is the endgame for ETH approaching? Will it be possible for ETH to become decentralized again? Or is it already too late? Your input will be greatly appreciated. Thank you. It’s normal for the price to dump if the founder dies, that means a short panic as many are depending their investment decision with the founder and I’ll see this as a temporary effect. ETH as a whole project will always prevail, and yes this is not just about the founder but its more about the whole project itself. ETH might not back to a decentralized system though, their updates seems to be more centralized but still it remains as the top choice for altcoins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yazher",
      "created_time": "September 07, 2023, 10:06:27 PM",
      "body": "Well, they just don't do such things if they don't have multiple reasons and some advanced remedies in the future whatever happens after they switch to PoS. I'm sure they know what they're doing and they can actually prevent such things from happening because they have some things that the XRP doesn't have which are connections and lots of investors who trust them. As for the Owner, he is still young and surely when he passes away, someone will actually take over his place and might do something good to improve their platform.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o48o",
      "created_time": "September 07, 2023, 10:19:52 PM",
      "body": "Quote from: Abiky on September 07, 2023, 12:10:16 PMEver since ETH adopted PoS, things have been going into the wrong direction. The network is as centralized as ever with a few big players controlling a large portion of ETH's supply. On top of that, the vast majority of nodes are running on top of Amazon Web Services (AWS). If developers don't do anything about this, ETH will become as bad as XRP in the future. My biggest concern is not only this, but also Ethereum creator Vitalik Buterin. The project is too tied around him. So if he dies (God forbid) or something bad happens to him, you expect ETH's market prices to go all the way down the drain in an instant. It's likely ETH will become worthless after this.What do you think? Is the endgame for ETH approaching? Will it be possible for ETH to become decentralized again? Or is it already too late? Your input will be greatly appreciated. Thank you. I frankly think that centralization around huge mining pools was a bigger problem. And what comes to vitalik, there's no replacing him but he doesn't equal eth 2.0. People would do fine without him. Price would totally be in free fall and panic mode, because that's how markets operate. but it would be temporary. People would soon realize that there are other brilliant minds working on it. And as eth would already have market effect, price drop wouldn't really matter on anything else than the price itself. I would totally try to wait a bottom and buy it at that point.And i guess there would be forks, because right now people would be falling behind vitalik no matter what he says, others might not have that kind of charisma.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "poodle63",
      "created_time": "September 07, 2023, 10:46:30 PM",
      "body": "even if it's truly the end game for ethereum, there's nothing we can do, its already implemented all of those things mentioned and rollback doesn't seem to be possible with their current circumstance, I think if ethereum truly is doomed, then its time for another cryptocurrency to occupy the throne that ethereum has been having for so long.but I don't think it will ever come to that, I mean its completely normal occurrence that in certain commodities or an asset people are hoarding their wealth in there.same thing with ethereum, some people could be accumulating ethereum as much as they can, but it also exposes the risk of them losing their value if the asset lost the public trust and deemed to be worthless.so I guess honestly its normal.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Abiky",
      "created_time": "September 08, 2023, 12:58:30 AM",
      "body": "Quote from: Yogee on September 07, 2023, 12:50:24 PMBack to POW? I doubt that.Not PoW, but rather a hybrid consensus algorithm (PoW + PoS). That would make a divide between network consensus and block production. Stakers will only earn rewards, but they won't be able to have a say over the future direction of the network. That would make ETH decentralized again. Or Vitalik and his team could introduce a new reputation-based consensus algorithm where users get to vote who gets to produce blocks and earn rewards (like DPoS, or even RDPoS (Randomized Delegated Proof of Stake) which is even better). With Vitalik out of the picture, I doubt ETH will remain the \"innovator\" in the smart contracts space. You can see how Apple is not the same company it was once Steve Jobs died. Of course, someone else will take Vitalik's place in the future. But if the project doesn't solve its centralization issues beforehand, it will be game over for good. Who knows how ETH's market prices will react in the long term? Just my thoughts",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "wxa7115",
      "created_time": "September 08, 2023, 01:19:57 AM",
      "body": "Quote from: TheUltraElite on September 07, 2023, 03:39:59 PMThey will not go back to PoW, its PoS from now on, and I think the rebellion died out because it like either take it or leave it situation. Those who remained will support the coin till their last while those who left, silenced their voices and started minding their own business, thats how debates before a decision proceed to an end or near-end.Regarding the founder, its simple enough to see that they will succeeded by another person who is like second in command. As the organization grows such people will continue to come in and that is the least of the problems at least for now. You could argue that the main innovator in any company is one person, which I would agree with, but the show has to go on.Ethereum will keep itself on POS from now on and it is almost impossible that it will ever change, after all this is not only about what is best for ethereum but it is also about egos.If Vitalik were to admit he was wrong and that he needed for ethereum to go back to be a POW coin this will immediately call into question his leadership as years of effort would have been wasted on making the transition to POS only for the decision to be reverted, and even if this was the best move for ethereum I doubt Vitalik will have the guts to do it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GreatArkansas",
      "created_time": "September 08, 2023, 01:59:56 AM",
      "body": "Quote from: Abiky on September 07, 2023, 12:10:16 PM(...)My biggest concern is not only this, but also Ethereum creator Vitalik Buterin. The project is too tied around him. So if he dies (God forbid) or something bad happens to him, you expect ETH's market prices to go all the way down the drain in an instant. It's likely ETH will become worthless after this.(...)I don't think so. Ethereum is not only run by Vitalik Buterin, but it's also a team and it is decentralized and open-source. So for me, even Vitalik Buterin will not be here anymore, Ethereum still exist, just like Bitcoin now, Satoshi Nakamoto is gone but Bitcoin is still here, running and kicking.What I am expecting only to happen is on price of Ethereum, it will react, like dump and it will just go up. Just like before when someone spreaded fake news that Vitalik Buterin found dead.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "woez",
      "created_time": "September 08, 2023, 02:55:00 AM",
      "body": "Just an assumption I think. Even if vitalik stays in name, I'm sure there will be lots of new vitalics that will emerge and bring better ETH. I think what was planned by the founder of ETH has been thought through carefully and will not decline even though he is gone and ETH will not be the same as XRP for sure.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TravelMug",
      "created_time": "September 08, 2023, 04:08:52 AM",
      "body": "Quote from: woez on September 08, 2023, 02:55:00 AMJust an assumption I think. Even if vitalik stays in name, I'm sure there will be lots of new vitalics that will emerge and bring better ETH. I think what was planned by the founder of ETH has been thought through carefully and will not decline even though he is gone and ETH will not be the same as XRP for sure.He is just a nominal title now, but still though he has that influence to change what is needed and for sure he spearheaded PoW->PoS. So I doubt blame the developers here, it was Vitalik for me in the beginning.And I do agree that it might bring the downfall of ETH, as describe by the OP it is not very centralized as only a few control of ETH's supply and this is really bad for the market and it's investors and it's just a matter of time before it goes down very hard, in my opinion.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gurunanakji777",
      "created_time": "September 08, 2023, 09:53:46 AM",
      "body": "I have a different viewpoint from yours. While I comprehend your apprehensions, I believe that the foundation of Ethereum is exceptionally robust, and I do not foresee it nearing its conclusion. It's evident that individuals with financial resources can acquire Ethereum in any quantity, and there's no way to prevent them from doing so. Unfortunate events can occur to anyone, but I don't believe they will significantly affect Ethereum since there is always a contingency plan in place, similar to how we designate nominees in banks in case something happens to us and I don't think ETH will decentralized again.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zasad@",
      "created_time": "September 08, 2023, 10:49:20 AM",
      "body": "Quote from: Abiky on September 07, 2023, 12:10:16 PMEver since ETH adopted PoS, things have been going into the wrong direction. The network is as centralized as ever with a few big players controlling a large portion of ETH's supply. On top of that, the vast majority of nodes are running on top of Amazon Web Services (AWS). If developers don't do anything about this, ETH will become as bad as XRP in the future. My biggest concern is not only this, but also Ethereum creator Vitalik Buterin. The project is too tied around him. So if he dies (God forbid) or something bad happens to him, you expect ETH's market prices to go all the way down the drain in an instant. It's likely ETH will become worthless after this.What do you think? Is the endgame for ETH approaching? Will it be possible for ETH to become decentralized again? Or is it already too late? Your input will be greatly appreciated. Thank you. If Amazon Web Services goes down, other validators will make more money. Vitalik Buterin has already spoken on this topic, and now they are developing a solution so that the node can be run on a smartphone and will improve decentralization. There are many interests of large financial companies in Ethereum, and Vitalik’s departure does not threaten the ecosystem with collapse.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}