{
  "id": "topic_5464757",
  "title": "Thehallows",
  "author": "Thehallows",
  "created_time": "August 27, 2023, 07:47:17 PM",
  "content": "I stumbled upon a captivating news piece online titled 'Stablecoins Settled as Much Value as Visa in 2022.' It's quite intriguing. Lately, I've been engaged in discussions with my friends about the implications of the growing adoption of stablecoins as a payment option in the current global landscape. To me, it appears to be a positive trend for the world of cryptocurrenciesand us crypto users. More individuals are becoming acquainted with crypto, and it's increasingly becoming a preferred choice for many.Personally, this development brings me a lot of satisfaction, particularly because my home country's currency faces significant challenges, making stablecoins an attractive alternative for storing value. Countries grappling with high inflation rates have already embraced stablecoins for mass transactions. Moreover, the adoption of stablecoins could potentially reinforce the position of the US dollar as a global currency since usdt is still one of the leading stablecoin.Interestingly, beyond developed nations, Visa and Mastercard aren't as dominant. It seems that developing countries are embracing cryptocurrencies at a faster pace than Visa and Mastercard can penetrate. Particularly noteworthy is the utilization of stablecoins to combat local inflation. The traditional card systems rely on banks, and banks often struggle to provide services to lower-income individuals, whereas crypto presents a more suitable solution.The concept of stablecoins being a gold mine for transaction fees is fascinating. This explains why Visa, Mastercard, and even PayPal are diving headfirst into the crypto realm. The trend is clear: stablecoins are on the rise, and it's only a matter of time before they become as common as gift cards.For those seeking more information on this topic, you can check out the details through this link: [https://cryptopotato.com/stablecoins-settled-as-much-value-as-visa-in-2022-analysis/]. I'm still super excited and thrilled I can't wait to see how this affect the value of BTC and other crypto assets in the world or even better since more companies are diving into  creating more stablecoins and sooner or later another stablecoin might become more dominant that usdt or thether and we might have a non fait related stablecoin. This is a summary of the article I read created by a bot the real new is in the link above. Stablecoins have become a dominant force in the payments industry, settling over $11 trillion in value in 2022, according to a report by Brevan Howard. The report highlights that stablecoin adoption remained strong despite capital outflows from the crypto market. The majority of non-speculative activity in stablecoins is driven by fiat-backed tokens such as USDT, USDC, BUSD, and TUSD. Stablecoin volumes only fell 11% since December 2021, while weekly transactions increased by 25%. The total value settled through stablecoins last year approached that of Visa's $11.6 trillion figure. Ethereum accounts for 50% of stablecoin volume but only 3% of total transactions due to high transaction fees. Tron and Binance Smart Chain account for 75% of stablecoin transactions and 41% of volume. Tether's USDT dominates the stablecoin market, accounting for 69% of supply, 80% of weekly active addresses, and 75% of transactions.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5464757",
  "comments": [
    {
      "author": "hatshepsut93",
      "created_time": "August 27, 2023, 10:50:27 PM",
      "body": "What value stablecoins settle? Go to any supermarket in the world and you'll see people paying with Visa or Mastecard every single minute. But where are the stablecoin payments?  I never encountered a business, even a small one, that accepts stablecoins. My guess is that most of the activity on stablecoin network is speculative trading, especially by bots. If someone shut down stablecoins tomorrow, the world wouldn't notice. If someone shut down Visa tomorrow, that would be Armageddon.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Thehallows",
      "created_time": "August 28, 2023, 12:14:08 AM",
      "body": "Quote from: hatshepsut93 on August 27, 2023, 10:50:27 PMWhat value stablecoins settle? Go to any supermarket in the world and you'll see people paying with Visa or Mastecard every single minute. But where are the stablecoin payments?  I never encountered a business, even a small one, that accepts stablecoins. My guess is that most of the activity on stablecoin network is speculative trading, especially by bots. If someone shut down stablecoins tomorrow, the world wouldn't notice. If someone shut down Visa tomorrow, that would be Armageddon. Many countries are actually adopting crypto as a legal means of payment the only reason visa is still more in use is because many firms are not accepting crypto payments yet and I mean your supermarkets and other physical business that uses faits. And for now there isn't much demand for crypto payments for offline vendors. And I think you haven't read the article yet to see what I'm really talking bout",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "virasog",
      "created_time": "August 28, 2023, 03:09:13 AM",
      "body": "Quote from: Thehallows on August 28, 2023, 12:14:08 AMQuote from: hatshepsut93 on August 27, 2023, 10:50:27 PMWhat value stablecoins settle? Go to any supermarket in the world and you'll see people paying with Visa or Mastecard every single minute. But where are the stablecoin payments?  I never encountered a business, even a small one, that accepts stablecoins. My guess is that most of the activity on stablecoin network is speculative trading, especially by bots. If someone shut down stablecoins tomorrow, the world wouldn't notice. If someone shut down Visa tomorrow, that would be Armageddon. Many countries are actually adopting crypto as a legal means of payment the only reason visa is still more in use is because many firms are not accepting crypto payments yet and I mean your supermarkets and other physical business that uses faits. And for now there isn't much demand for crypto payments for offline vendors. And I think you haven't read the article yet to see what I'm really talking bout I won't agree that crypto payments are increasing globally. The USA and the SEC policies and regulations are all against crypto (bitcoin in particular) and since they know that people are not getting back from the cryptocurrencies, so they have decided to build stablecoins which are no different than fiat money except they can be digitally transmitted.The CBDC is one step in this case where every country will have its own stablecoins (which will be fully in control by the governments). Similarly, the big companies are also trying to introduce stable coins for example Paypal  PYUSD. etcThese are all the steps forcing people to leave bitcoin and keep money in centralized control stable coins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "YUriy1991",
      "created_time": "August 28, 2023, 04:08:13 AM",
      "body": "Quote from: Thehallows on August 27, 2023, 07:47:17 PMStablecoins have become a dominant force in the payments industry, settling over $11 trillion in value in 2022, according to a report by Brevan Howard. The report highlights that stablecoin adoption remained strong despite capital outflows from the crypto market. The majority of non-speculative activity in stablecoins is driven by fiat-backed tokens such as USDT, USDC, BUSD, and TUSD. Stablecoin volumes only fell 11% since December 2021, while weekly transactions increased by 25%. The total value settled through stablecoins last year approached that of Visa's $11.6 trillion figure. Ethereum accounts for 50% of stablecoin volume but only 3% of total transactions due to high transaction fees. Tron and Binance Smart Chain account for 75% of stablecoin transactions and 41% of volume. Tether's USDT dominates the stablecoin market, accounting for 69% of supply, 80% of weekly active addresses, and 75% of transactions.Stablecoin and now unstable Yes. volatile markets, with exchange rates that can fluctuate wildly during the day, and sometimes hourly meaning stablecoins are still risky cryptos.Quote from: virasog on August 28, 2023, 03:09:13 AMThe CBDC is one step in this case where every country will have its own stablecoins (which will be fully in control by the governments). Similarly, the big companies are also trying to introduce stable coins for example Paypal  PYUSD. etcThese are all the steps forcing people to leave bitcoin and keep money in centralized control stable coins.Yes. I think like you say.  CDBC is issued and its circulation is controlled by the central bank, and is used as legal tender to replace currency by the government and their assumptions. Because there are advantages offered and many countries are interested in developing CDBC and it has doubled during the pandemic. If I'm not mistaken Currently there are 9 (nine) countries that have fully implemented CDBC, namely Nigeria, Bahamas and 7 countries in the Caribbean Islands. But, I don't think that will make BTC falter as of now. Its good reputation and large user base have strengthened it as a leader till now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dothebeats",
      "created_time": "August 28, 2023, 05:23:51 AM",
      "body": "The reality is stablecoins are not being adapted the way we all wish they would be. Yes, there may be some stores and organizations supporting it as a means of payment, but in what percentage does that just fall? It is nothing compared to the dependency of people on Visa and Mastercard payments. Heck, even small boutiques post signs that state that they accept those two means of payment because they know people dominantly use it. If stable coins disappear, the majority of the world will not care about it; remove Visa and Mastercard and there will be a big problem that will lead to debates and international discussions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Solosanz",
      "created_time": "August 28, 2023, 05:29:22 AM",
      "body": "The adoption of stable coins are already big, you can check in CMC where the top 6 trading volumes are dominated by 4 stable coins, the rest is BTC and ETH. This means most people use it for trading, but I don't think it's related to crypto dominance since no one want to hold stable coins where it's centralized, not making any profit and there's a risk of the project turn to be scam. Don't forget about UST and LUNA.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kakmakr",
      "created_time": "August 28, 2023, 06:46:45 AM",
      "body": "The thing about stablecoins is this.... it was developed to mimic fiat currencies and that is it's ultimate downfall. Other Crypto coins have good volatility and that help people to make good profits, if they use Crypto currency as an investment. (A lot of them even beat inflation)The stablecoins are used to park money, when there are too much volatility and that does not increase it's utility. There are also more benefits to other Crypto currencies, like Smart contracts and side chain developments.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Thehallows",
      "created_time": "August 28, 2023, 07:07:30 AM",
      "body": "Quote from: dothebeats on August 28, 2023, 05:23:51 AMThe reality is stablecoins are not being adapted the way we all wish they would be. Yes, there may be some stores and organizations supporting it as a means of payment, but in what percentage does that just fall? It is nothing compared to the dependency of people on Visa and Mastercard payments. Heck, even small boutiques post signs that state that they accept those two means of payment because they know people dominantly use it. If stable coins disappear, the majority of the world will not care about it; remove Visa and Mastercard and there will be a big problem that will lead to debates and international discussions. Yeah i do understand your point of view about visa and Mastercard. But you said if 'stablecoins disappear nobody will care' but that's not true.  How would you sell your crypto assets . Would you take your bitcoin to a bank in exchange for fait . The entire world of crypto exchange and its value in a way or two rest upon the presence of stablecoins as a currency. Stablecoins have proven to be a very important part of the crypto ecosystem iss the only save heaven in a extreme volatile market , other crypto assets like BTC can not be used for everyday transactions because their price  fluctuations, the use of stablecoins as an exchange means has increased vastly in recent years .Stablecoins are really that important for the crypto ecosystem",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coupable",
      "created_time": "August 28, 2023, 07:14:25 AM",
      "body": "Quote from: Solosanz on August 28, 2023, 05:29:22 AMThe adoption of stable coins are already big, you can check in CMC where the top 6 trading volumes are dominated by 4 stable coins, the rest is BTC and ETH. This means most people use it for trading, but I don't think it's related to crypto dominance since no one want to hold stable coins where it's centralized, not making any profit and there's a risk of the project turn to be scam. Don't forget about UST and LUNA.What I don't understand in the OP's position is that he is trying to connect the dominance of stablecoins in the digital asset market with the dominance that crypto will have as a direct result of that. This assumes that stablecoins are considered cryptocurrencies when they are just another form of digital fiat currencies. These stable currencies derive their value from the fiat currency (mainly the dollar), and this also represents their biggest problem at the same time, since most of them are issued without sufficient dollar reserve cover.As for the uses, the most important areas of using stable currencies is in the field of trading to freeze the price in cases of a sharp decline, and I have not heard that these currencies are used in shops and commercial exchanges in general.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "noorman0",
      "created_time": "August 28, 2023, 07:35:26 AM",
      "body": "Since its introduction, crypto has been synonymous with decentralization and it should stay that way. While it is very central in nature, the presence of stablecoins actually only supports the needs of speculators for trade, they do not affect this type of financial revolution.As for dominance, I don't think there has been any change due to the fact that fiat money had dominated before the crypto era. Sablecoins are just another representation of fiat.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "_act_",
      "created_time": "August 28, 2023, 09:07:52 AM",
      "body": "If there are no stable coins, there would be increasing crypto adoption. Without any cryptocurrencues, including stable coins, there is nothing that can stop bitcoin adoption. Quote from: Thehallows on August 27, 2023, 07:47:17 PMIncrease in stable coins adoption might just be the key to crpyto dominance.Bitcoin does not depend on stable coins.Quote from: Thehallows on August 27, 2023, 07:47:17 PMI stumbled upon a captivating news piece online titled 'Stablecoins Settled as Much Value as Visa in 2022.' It's quite intriguing. Lately, I've been engaged in discussions with my friends about the implications of the growing adoption of stablecoins as a payment option in the current global landscape. To me, it appears to be a positive trend for the world of cryptocurrenciesand us crypto users. More individuals are becoming acquainted with crypto, and it's increasingly becoming a preferred choice for many.Most stable coins are pegged with United States dollar which is why some countries will not accept it. What I think would be common that is digital are CBDCs. CBDCs are also still fiat.For payment, I will prefer to use bitcoin if it is cryptocurrencies that you are talking about.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Texac",
      "created_time": "August 28, 2023, 09:52:56 AM",
      "body": "Stable coin does not represent the entire cryptocurrency industry and it is no different from currency in its digital form.  so I don't think that proves crypto dominance or that cryptocurrencies are being used more than other traditional means.  even if people use more stablecoins than fiat or banks, I don't see that having any positive effect on making bitcoin more popular. Ultimately, what is happening with stablecoin usage proves only one thing, people still prefer centralized systems and services over decentralized ones.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "davis196",
      "created_time": "August 28, 2023, 10:31:39 AM",
      "body": "Centralized companies like Paypal, VISA and Mastercard being positive towards stablecoins? I wonder why? Maybe the reason why such centralized companies are positive towards stablecoins is because the stablecoins are a centralized payment system.The issuer behind the stablecoins holds a certain reserve of fiat currency, which is backing the value of the coin. What if this reserve doesn't exist? Can a stablecoin survive without being backed by anything?Why would you use stablecoins backed by USD for buying goods and services, when you could simply use USD?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yhiaali3",
      "created_time": "August 28, 2023, 11:04:18 AM",
      "body": "Unlike you, I am not optimistic about the spread of stablecoin payments around the world. Stablecoin is no different from fiat, and may even be worse.Most of the Stablecoins are centralized and against privacy, unlike Bitcoin, so you see that governments condone them and may sometimes encourage them, as happened with the Paypal Stablecoin PYUSD recently.This is the direction that governments want people to go, moving towards centralized stablecoins and leaving Bitcoin and the decentralized privacy-preserving cryptocurrencies.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stadus",
      "created_time": "August 28, 2023, 11:35:02 AM",
      "body": "Quote from: yhiaali3 on August 28, 2023, 11:04:18 AMThis is the direction that governments want people to go, moving towards centralized stablecoins and leaving Bitcoin and the decentralized privacy-preserving cryptocurrencies.I somewhat agree with you on that point. Cryptocurrency was originally designed to be decentralized, offering genuine privacy. Unfortunately, government interventions are altering the fundamental nature of crypto through regulations. In my opinion, stablecoins should primarily be reserved for trading, while transactions outside of exchanges should involve decentralized coins, allowing us to maintain a degree of anonymity.It's difficult to determine how we can preserve the anonymity we seek, especially since exchanges are also becoming regulated. The potential for enjoying the benefits of cryptocurrency and its anonymity might only become feasible when it gains widespread acceptance. However, this raises questions about whether such acceptance can occur while governments are closely monitoring our activities.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "August 28, 2023, 12:24:21 PMLast edit: August 28, 2023, 12:34:41 PM by stompix",
      "body": "Quote from: Thehallows on August 27, 2023, 07:47:17 PM The total value settled through stablecoins last year approached that of Visa's $11.6 trillion figure. Comparing apples and socks, not even oranges!Those settlements you and the author talk about are the sum of moved coins, that's the lamest indicator of all, I can move $1000 from my exchange account to my address, then split it in $500, see a dip on the market move back to an exchange and there you have it, $2500 of volume without \"settling\" a thing.Visa is strictly for payments, you go buy a  can of soda you pay, and the money leaves one person's account and ends up in another, with coins, it can be none, even if we compare it with banking volume, which even for Europe alone stands at 800 billion a day, that's 30x all the volume of stablecoins transaction and it's still not a fair comparison.Tron has 1700000 transactions a day, Visa has 150 million a day, roughly as much as all USDT trasnctosn on eth in history!Quote from: hatshepsut93 on August 27, 2023, 10:50:27 PMWhat value stablecoins settle? Go to any supermarket in the world and you'll see people paying with Visa or Mastecard every single minute. But where are the stablecoin payments?  I never encountered a business, even a small one, that accepts stablecoins. My guess is that most of the activity on stablecoin network is speculative trading, especially by bots. If someone shut down stablecoins tomorrow, the world wouldn't notice. If someone shut down Visa tomorrow, that would be Armageddon. The funny part is that Visa shutting down would kill a ton of so-called crypto cards, including Binance, thus cutting a huge chunk of stable coins' usefulness. As for the supermarket stuff, yeah, I haven't managed to get close to 100:1 when it comes to Visa vs BTC , when it's Vis vs stablecoins is 1000:0.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ultrloa",
      "created_time": "August 28, 2023, 12:37:04 PM",
      "body": "Quote from: Thehallows on August 28, 2023, 12:14:08 AMQuote from: hatshepsut93 on August 27, 2023, 10:50:27 PMWhat value stablecoins settle? Go to any supermarket in the world and you'll see people paying with Visa or Mastecard every single minute. But where are the stablecoin payments?  I never encountered a business, even a small one, that accepts stablecoins. My guess is that most of the activity on stablecoin network is speculative trading, especially by bots. If someone shut down stablecoins tomorrow, the world wouldn't notice. If someone shut down Visa tomorrow, that would be Armageddon. Many countries are actually adopting crypto as a legal means of payment the only reason visa is still more in use is because many firms are not accepting crypto payments yet and I mean your supermarkets and other physical business that uses faits. And for now there isn't much demand for crypto payments for offline vendors. And I think you haven't read the article yet to see what I'm really talking bout Just don't expect to much about adoption since if we talk about payment terms which is more secured then banking system can offer something more reliable and trusted than those stable coins in the market. And I don't think its adoption will gain anything positive to the whole crypto since we cannot see some great price change with those type of coins. That's why we hear a lot of noise about bitcoin since it has a potential to rise up and can multiply the earnings of each holder so I guess that condition attract many people including those institutional investors adopt bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "m2017",
      "created_time": "August 28, 2023, 04:06:03 PM",
      "body": "Quote from: Thehallows on August 27, 2023, 07:47:17 PM~snipHow is your country's currency different from stablecoins? Nothing, damn it! What could be a positive trend in this for currency users? Nothing. If the currency of your country is controlled by the government (central bank), but the stablecoins are controlled by a certain company, which, in both cases, can do whatever they want with their stablecoins, whether it be endless emission, and therefore inflation. Stablecoins are a very, very poor alternative for storing value, only valid for a short period of time. Stablecoins has the same disadvantages as any money - depreciation and unsuitability for storage. Stablecoins can't help countries beat inflation in any way, even though it is better than the national currency. Here need completely different tools.The problem with stablecoins is that there are already several options on the cryptomarket, and new ones will be created. There was something similar in America, when each state had its own dollar. Which of stablecoins will win is unknown, but the losers will be useless to anyone.Make a mistake with an investment of stablecoin and you are a beggar.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tjtonmoy",
      "created_time": "August 28, 2023, 04:47:20 PM",
      "body": "Stablecoins are pegged with physical money (Mostly USD). It's the same as using that physical money. Just a fancy and more centralized way. You can somewhat cover your footprints by using physical assets. But with a stable crypto coin, you are creating more footprints. It is much more complicated than using traditional money. For this reason, I don't think stablecoins adoption alone will do a thing. Trust me, I came to know about it just because I saw your post here. It's not a major thing that will shake the whole world and start an evolution. I don't use it myself. So what should I say to you? Stick to the OG crypto. Only those will be able to start a thing. If they become accepted, others will follow no matter what. Also, crypto is not here to dominate. It's a way of making life easier, giving freedom to people, and getting the best of the future world. It doesn't need to dominate anything. It can co-exist with the existing system. That way we can get the best of both worlds. Individuals should be able to choose what they like. It's a free choice.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}