{
  "id": "topic_5451864",
  "title": "Jamala",
  "author": "Jamala",
  "created_time": "May 07, 2023, 06:12:06 PMLast edit: May 07, 2023, 08:52:11 PM by Jamala",
  "content": "Due to currency concerns, many countries banned the use of cryptocurrencies for any purpose. They now seem powerless as transactions are ongoing beyond their control. Why do they think they can censor activities beyond their sphere of influence? Bitcoin is changing the demography of wealth, giving some people an escape route from poverty, and establishing those in the middle class that keyed into it. Today, latecomers like myself are ruing lost opportunities. This is because we can attest to the economic leverage crytocurrencies especially bitcoin has given to our pairs who saw today, yesterday. We proclaimed it was a scam like MMM and other Ponzi schemes. We waited in vain to see people regret putting their finances into bitcoin, and have now decided to join them since we couldn't \"beat\" them. There were warnings from various governments about the unpredictable of Cryptos little did we know that these government agencies have persons who were already trading in the \"scam\". The government of my country was willing to take any measure to impoverish it's citizens: refusing to create jobs opportunities, complex bank loaning policies, and outright embezzlement of public funds. So, when people saw a future in cryptocurrencies that will take off government influence, those that has foresight jumped unto it. Though, it was a risk, they took it wholeheartedly and today, they are ambassadors with proven results.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5451864",
  "comments": [
    {
      "author": "Weezenhofnar",
      "created_time": "May 07, 2023, 07:23:07 PM",
      "body": "Governments that banned cryptocurrencies are now unable to stop transactions from happening, giving people a chance to escape poverty and establish themselves in the middle class. Latecomers who initially thought it was a scam are now regretting missed opportunities. Cryptocurrencies like Bitcoin offer economic leverage, and those with foresight who took the risk are now successful ambassadors with proven results.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zaguru12",
      "created_time": "May 07, 2023, 08:43:36 PM",
      "body": "Quote from: Jamala on May 07, 2023, 06:12:06 PM Bitcoin is changing the demography of wealth, giving some people an escape route from poverty, and establishing those in the middle class that keyed into it. Bitcoin has definitely been a good evolution to the countless problems experienced using the banks or trading with the fiat. It decentralization has given people the freedom to do what they want with their money. People do cross boarder transactions with other people in another country without the hassle of converting from one currency to another. With bitcoin people do have an asset that is a Currency, an ROI and also an hedge against inflation. All these and more are numerous advantages of bitcoin, but bitcoin doesn’t eradicate poverty. Many people might have had the opportunity of buying at a very low price and selling at a much higher price which has increased their financial status. But bitcoin as an investment tool still needs funds for investing and these funds are from people that already have more than enough to lose. Someone in poverty will somewhat find it hard to leave of his funds on bitcoin for a longer time because it is the only way to earn high profit from not too much capital. As for those Alticoins that people invest in with little money and see a huge return, some of these aren’t much of a difference from the Ponzi schemes you listed and as such isn’t something one needs to be happy about.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitcoinPanther",
      "created_time": "May 07, 2023, 09:48:27 PM",
      "body": "Early adopters who knows what they are doing will definitely garnish a good result.  When it comes to government trying to control Bitcoin system, they will be in a tough fight because Bitcoin is decentralized and has no focal point of operation that the government can go after to stop Bitcoin.  Anyone can support the network and keep it running thus the government limited by their jurisdiction cannot do anything about the Bitcoin system.  Their law applies only to their country but Bitcoin operation is spread out globally.QuoteToday, latecomers like myself are ruing lost opportunities. This is because we can attest to the economic leverage crytocurrencies especially bitcoin has given to our pairs who saw today, yesterday. We proclaimed it was a scam like MMM and other Ponzi schemes. We waited in vain to see people regret putting their finances into bitcoin, and have now decided to join them since we couldn't \"beat\" them. There were warnings from various governments about the unpredictable of Cryptos little did we know that these government agencies have persons who were already trading in the \"scam\".In a cyclical market, there is no late comers to take advantage of the benefits offered.  All we need to do is time the right moment to enter so that we can be able to get profit when the cycle ended and just rinse and repeat.  Btw, I never think that Bitcoin is like a ponzi scheme since it was put in an open market where everyone has the freedom to decide.  Bitcoin does not promise anything but a goal of p2p electronic transfer that does not need any third party that can challenged fiat currency that uses intermediaries for transaction.  It is clear that Bitcoin never promised profit but instead aim to give financial transaction a freedom.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jamala",
      "created_time": "May 08, 2023, 04:31:22 PM",
      "body": "Quote from: BitcoinPanther on May 07, 2023, 09:48:27 PMEarly adopters who knows what they are doing will definitely garnish a good result.  When it comes to government trying to control Bitcoin system, they will be in a tough fight because Bitcoin is decentralized and has no focal point of operation that the government can go after to stop Bitcoin.  Anyone can support the network and keep it running thus the government limited by their jurisdiction cannot do anything about the Bitcoin system.  Their law applies only to their country but Bitcoin operation is spread out globally.QuoteToday, latecomers like myself are ruing lost opportunities. This is because we can attest to the economic leverage crytocurrencies especially bitcoin has given to our pairs who saw today, yesterday. We proclaimed it was a scam like MMM and other Ponzi schemes. We waited in vain to see people regret putting their finances into bitcoin, and have now decided to join them since we couldn't \"beat\" them. There were warnings from various governments about the unpredictable of Cryptos little did we know that these government agencies have persons who were already trading in the \"scam\".In a cyclical market, there is no late comers to take advantage of the benefits offered.  All we need to do is time the right moment to enter so that we can be able to get profit when the cycle ended and just rinse and repeat.  Btw, I never think that Bitcoin is like a ponzi scheme since it was put in an open market where everyone has the freedom to decide.  Bitcoin does not promise anything but a goal of p2p electronic transfer that does not need any third party that can challenged fiat currency that uses intermediaries for transaction.  It is clear that Bitcoin never promised profit but instead aim to give financial transaction a freedom.Well, those who embraced bitcoin at it's early entrance into the market are worthy ambassadors. As it it an online currency, it can be bought and sold, thus, it has empowered early investors who bought it. I know a few.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackHatCoiner",
      "created_time": "May 08, 2023, 05:52:40 PM",
      "body": "Governments who \"banned\" bitcoin, have actually banned themselves from bitcoin. Attempting to prevent it is a very justified decision. Bitcoin cannot be confiscated, tracked, controlled, censored-- basically it's resistant to every governmental function. We should not expect from governments to comply with the most freedom preserving currency there is; especially nowadays.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mendace",
      "created_time": "May 08, 2023, 06:02:28 PM",
      "body": "It is true that many countries have decided to ban the use of cryptocurrencies, but it is equally true that these bans do not seem to be very effective.  This is because cryptocurrencies are not controlled by a central authority and are essentially decentralized, meaning that transactions can take place outside government control.  However, many governments still try to censor these activities, for example by blocking access to cryptocurrency trading websites or imposing severe penalties on those caught using these currencies.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JayTrain",
      "created_time": "May 08, 2023, 06:45:04 PM",
      "body": "The rise of cryptocurrencies, especially Bitcoin, has challenged traditional notions of financial power and control. While some governments have attempted to ban or censor their use, cryptocurrencies continue to grow in popularity and influence. The potential for economic leverage and financial freedom has attracted many individuals, particularly in countries with poor economic opportunities.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "suzanne5223",
      "created_time": "May 08, 2023, 08:11:20 PM",
      "body": "Quote from: Jamala on May 07, 2023, 06:12:06 PMDue to currency concerns, many countries banned the use of cryptocurrencies for any purpose. They now seem powerless as transactions are ongoing beyond their control. Why do they think they can censor activities beyond their sphere of influence?The reason why they believe they can control or trash a decentralized cryptocurrency like Bitcoin is that they believe it is all a joke movement that if the Fed tightens their restriction BTC will struggle and that's people like \"Jamie Dimon says Bitcoin is worthless\"Quote from: Jamala on May 07, 2023, 06:12:06 PMToday, latecomers like myself are ruing lost opportunities. You're not late comer until the whole 21 million coins are mine and like you said Bitcoin gives people the route from poverty. What will determine you being a latecomer is the decision you make never BTC present an opportunity in the market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Z-tight",
      "created_time": "May 08, 2023, 08:27:58 PM",
      "body": "Quote from: mendace on May 08, 2023, 06:02:28 PMThis is because cryptocurrencies are not controlled by a central authority and are essentially decentralizedThere are so many cryptocurrencies that are centralized and controlled by a group of people or a few whales who can censor other users. It is BTC that is censorship resistant, permissionless and not controlled by a central authority.Quote from: Weezenhofnar on May 07, 2023, 07:23:07 PMGovernments that banned cryptocurrencies are now unable to stop transactions from happening, giving people a chance to escape poverty and establish themselves in the middle class.BTC is not a means to escape poverty or to move to the middle or wealthy class, you people should stop having this kind of thought, it is the wrong one and a part of the reason why some people are spamming the network right now with inscriptions. If you are unable to use BTC, what you miss out on is using a permissionless currency, you miss out on controlling your own money or moving it the way you like. Getting rich is a probability, depending on how early you adopted BTC, how much BTC you can afford to buy and for how long you can hold the BTC safely.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JoyMarsha",
      "created_time": "May 08, 2023, 10:11:12 PM",
      "body": "Quote from: Jamala on May 07, 2023, 06:12:06 PMDue to currency concerns, many countries banned the use of cryptocurrencies for any purpose. They now seem powerless as transactions are ongoing beyond their control. Why do they think they can censor activities beyond their sphere of influence?Since some governments are unable to regulate or keep track of the usage of crypto in their country, one of the governments \"Nigeria\" that has banned crypto in all of its banks a few years ago are starting to support the use of crypto for its citizens. They are starting to rethink whether they should lift the crypto ban in place. Because in the real sense, they are yet to find the dangers it brews into society other than using it as means of payment or as a future investment tool.Quote from: Jamala on May 07, 2023, 06:12:06 PMToday, latecomers like myself are ruing lost opportunities. How can you claim that you are a latecomer and are missing out on opportunities when you have the chance to buy bitcoin now when it is still reasonably priced and hold onto it till the bull run begins? If you weren't aware, millions of people still don't know about bitcoin, but they will in the future. How will you respond to them now? You ought to begin thinking of yourself as a crypto early adopter.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "serjent05",
      "created_time": "May 08, 2023, 10:51:17 PM",
      "body": "Quote from: suzanne5223 on May 08, 2023, 08:11:20 PMQuote from: Jamala on May 07, 2023, 06:12:06 PMDue to currency concerns, many countries banned the use of cryptocurrencies for any purpose. They now seem powerless as transactions are ongoing beyond their control. Why do they think they can censor activities beyond their sphere of influence?The reason why they believe they can control or trash a decentralized cryptocurrency like Bitcoin is that they believe it is all a joke movement that if the Fed tightens their restriction BTC will struggle and that's people like \"Jamie Dimon says Bitcoin is worthless\"The thing is even FED is restricted and can only function in their jurisdiction.  The scope of Bitcoin global adoption is too huge for FED to supress.  They can try it on their area of jurisdiction but those countries that does not recognize FED will definitely will not follow its rulings.Quote from: suzanne5223 on May 08, 2023, 08:11:20 PMQuote from: Jamala on May 07, 2023, 06:12:06 PMToday, latecomers like myself are ruing lost opportunities. You're not late comer until the whole 21 million coins are mine and like you said Bitcoin gives people the route from poverty. What will determine you being a latecomer is the decision you make never BTC present an opportunity in the market.I think I agree with one of the earlier replies that there is no latecomer in Bitcoin due to the reason that it is cyclical.  There is always ups and downs, window entry for an opportunity and exit doors for those who wanted to get profit.  It will be too late if the market isn't cyclical anymore.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ndabagi01",
      "created_time": "May 08, 2023, 11:59:00 PM",
      "body": "Quote from: Jamala on May 07, 2023, 06:12:06 PMToday, latecomers like myself are ruing lost opportunities. This is because we can attest to the economic leverage crytocurrencies especially bitcoin has given to our pairs who saw today, yesterday. We proclaimed it was a scam like MMM and other Ponzi schemes. We waited in vain to see people regret putting their finances into bitcoin, and have now decided to join them since we couldn't \"beat\" them. There were warnings from various governments about the unpredictable of Cryptos little did we know that these government agencies have persons who were already trading in the \"scam\". You are not a late adopter of bitcoin, and you have never missed a chance. Realizing your first error is a good first step toward a positive course of action right now. Bitcoin is more valuable than most people realize, and it has a bright future ahead of it in the world of finance. Invest now and you’ll also reap the benefits as others when they’re reaping the fruit of their patience.QuoteThe government of my country was willing to take any measure to impoverish its citizens: refusing to create jobs opportunities, complex bank loaning policies, and outright embezzlement of public funds. So, when people saw a future in cryptocurrencies that will take off government influence, those that has foresight jumped unto it. Though, it was a risk, they took it wholeheartedly and today, they are ambassadors with proven results.Bitcoin investment have gone beyond what some people imagine it to be had. It has so far created job opportunities for youths that are unemployed and they now find a means of sustenance with it. The government is only finding a way to cripple the activity and take full control which is theoretically and practically impossible now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}