{
  "id": "topic_5460349",
  "title": "bonfire66",
  "author": "bonfire66",
  "created_time": "July 19, 2023, 04:23:56 PM",
  "content": "НЕ было никогда, и вдруг опять!       Меня в ЧЕТВЕРТЫЙ раз (за этот год) удалили с телеги Невзорова. За нападки на Религию. И опять на некоторое время. Как вы думаете, стоит ли в Пятый раз подписываться на его телегу? Или пусть ндет нахрен? Александр Глебович! Либо вы наденьте трусы, либо приструните боголюбивых клевретов-админов Вашей телеги. Раздайте звездюлей и внесите меня в ОСОБЫЙ доверенный список. Чтобы НИ ОДНА сволочь не попробовала бы меня забанить от Вашего имени. Или уже поздно действовать? А админов прогоните пинками. Тех самых, которые за веру в воображаемого «христа» готовы банить всех подряд, в том числе и меня. А я в христа не верю. Как и вы. Но я – НЕ ВЕРЮ с детства. Потому что НЕ переобувался. НИ РАЗУ. В отличии от Вас. А вы – переобувались. Когда-то верили, но потом поменяли идею. Переобулись. Но ваша идея против моей – она вторична. Я же, как меня воспитали в средней школе номер 679 г. Москвы (в Чертаново) от звонка (1 класса) до звонка (10 класса) – НИ РАЗУ  не сменил своего мнения и своей ориентации. В отличии от Вас. Бога нет – миру мир! Так было всегда, и так будет и есть! Пойду подписываться на  телегу Гиркина. Это то, что вы заслужили. И ваш народ тоже заслужил.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5460349",
  "comments": [
    {
      "author": "herzen888",
      "created_time": "January 15, 2024, 09:44:51 AM",
      "body": "Модератоты видимо такие, попробуйте написать, объяснить что да как, надеюсь поймут.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yelzin",
      "created_time": "January 25, 2024, 08:47:49 AM",
      "body": "Только ежели писать то лучше на английском, а то мало ли, люди поменялись в корне из-за событий, еще забанют.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kruella88",
      "created_time": "February 28, 2024, 08:51:41 AM",
      "body": "Нуу он мужик предвзятыйТоже имел честь побывать в бане у него, потом новый акк завел и не стал уже бурагозить",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}