{
  "id": "topic_5432152",
  "title": "bitmaster2023",
  "author": "bitmaster2023",
  "created_time": "December 28, 2022, 12:46:49 PM",
  "content": "Hi folks, Just stumbled on an interesting on-chain gambling site, you can directly bet ETH using your MetaMask wallet, without depositing funds  Shockedhttps://ethgames.fun/pokerdice.htmlhttps://ethgames.fun/twodices.htmlThey offer x50 times your initial betHave fun.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5432152",
  "comments": [
    {
      "author": "PX-Z",
      "created_time": "December 28, 2022, 12:55:19 PM",
      "body": "Is this website yours? Sounds suspicious to me, why theres no deposits required? Does it mean that your wallet will be deducted in your every bet? Sounds a no-no to me, also there no enough info on the site even the \"Rules\" page sounds confusing and the site looks like rushed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "julerz12",
      "created_time": "December 28, 2022, 12:59:31 PM",
      "body": "Web3 integration particularly to casinos such as this have been gaining popularity. Though, you should also be careful when connecting your hotwallets to any sites as potential hacks and exploits of your wallet can still happen. Make sure the site's smart contract is audited and preferably open sourced. Question is, does this new platform have those?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmaster2023",
      "created_time": "December 28, 2022, 01:00:14 PM",
      "body": "HiNo it isn't mine, and yes rules are bit confusing, probably written from non native speaker, however it seems like on-chain solution, I managed to check contracts of the games it seems that there are some funds on both contracts, also the minimum bet is 0.01 ETH https://etherscan.io/address/0xa24a8d7f67263f6c7514f4b9aa81026f7267f57chttps://etherscan.io/address/0x53745e41639d416b5fd60322df12eedce34a2afdCheers",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pixie85",
      "created_time": "December 28, 2022, 01:05:40 PM",
      "body": "Quote from: PX-Z on December 28, 2022, 12:55:19 PMIs this website yours? Sounds suspicious to me, why theres no deposits required? Does it mean that your wallet will be deducted in your every bet? Sounds a no-no to me, also there no enough info on the site even the \"Rules\" page sounds confusing and the site looks like rushed.Most likely based on \"on-chain betting system\". You can google it to learn more.In short, it works like decentralized exchanges. Once you get into a contract, in this case make a bet, the transaction is made when the bet is settled. So you don't have to deposit anything on their platform. It's better than traditional gambling because you can bet whatever you want at any moment. If you find yourself being short on funds you don't have to wait for your deposit to arrive.The bad part of this is that now compulsive gamblers can drain their wallets to 0 if they choose to, but before that they were able to do the same just with a bit more hassle.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Plaguedeath",
      "created_time": "December 28, 2022, 01:20:10 PM",
      "body": "Quote from: PX-Z on December 28, 2022, 12:55:19 PMIs this website yours? Sounds suspicious to me, why theres no deposits required? Does it mean that your wallet will be deducted in your every bet? Sounds a no-no to me, also there no enough info on the site even the \"Rules\" page sounds confusing and the site looks like rushed.I think you're not often connect your wallet to dapps or web3 site, so you're worried if they may take all of your money. Well you need to read the whole terms and request to see if this site is malicious or not. But this casino design is really crappy, has many typos and doesn't have complete information, which I think there's no way for me to gamble on this site even though if it's legit. There's so many casino much better than this.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmaster2023",
      "created_time": "December 28, 2022, 01:34:24 PM",
      "body": "I think design is crappy, because they target mobile devices, MetaMask has it's own application with integrated browser, on PC everything seem fatty, although I prefer to profit and have fun, rather than watching something shiny and getting scammed When signing with metamask you have control on what you signing on and how many fund you sending, so from my side it is perfectly safe, no one can still your money after interacting with website, only because you interacted with website, of course you have to keep you private key safe, but this is also valid for off chain games.On-chain betting is something new, probably will see some good designs in future, I remember the design of first LP for DeFi",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Eureka_07",
      "created_time": "December 28, 2022, 01:41:39 PM",
      "body": "Quote from: bitmaster2023 on December 28, 2022, 12:46:49 PM<snip>You sure that you're not the owner or any representative of this site? I'm not saying that you are lying, but in case that you're the owner or anyone from them, you can just tell us  Anyways, no deposit needed, and directly betting using Metamask... Does it mean that the winnings will also be directly credited to our Metamask Balance?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Agbe",
      "created_time": "December 28, 2022, 01:49:01 PM",
      "body": "Quote from: PX-Z on December 28, 2022, 12:55:19 PMIs this website yours? Sounds suspicious to me, why theres no deposits required? Does it mean that your wallet will be deducted in your every bet? Sounds a no-no to me, also there no enough info on the site even the \"Rules\" page sounds confusing and the site looks like rushed.You said my mind. From what he, OP said, QuoteJust stumbled on an interesting on-chain gambling site, I don't think the site belong to the OP, so OP is probably advertising someone casino site that is under development.when I checked the site, guys, I saw nothing but dice and only me radio button. Now the op is saying that, no deposit is needed then how the casino owner will make profit to maintain the site and pay winners? OP the matter just tired me.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmaster2023",
      "created_time": "December 28, 2022, 01:54:06 PMLast edit: May 20, 2023, 03:09:18 PM by Welsh",
      "body": "I don't know the owners, but I know that they are from the same country - BulgariaOn-chain basically means, that you place the bet, send transaction and if bet is a winning, the same transaction sends back the funds.For the first game - PokerDice there is no placement, you just roll the dice by pressing roll button, this executes transaction with metamask wallet and sends 0.01ETH to the contract, if you have luck you can receive back up to 0.5ETH that is 50 times on your initial betFor second game - you bet on the sum of the two dices you can bet on multiple sums in one transaction, each bet cost 0.01, and if you guess the outcome you receive back up to 0.24ETH (if you get two 6, and you bet on 12)To play the games you need to install MetaMask extension on your chrome browser, or download MetaMask app you your mobile and use the integrated browser, then you transfer some funds to your walled and play directly without depositing. https://chrome.google.com/webstore/detail/metamask/nkbihfbeogaeaoehlefnkodbefgpgknnQuote from: Agbe on December 28, 2022, 01:49:01 PMQuote from: PX-Z on December 28, 2022, 12:55:19 PMIs this website yours? Sounds suspicious to me, why theres no deposits required? Does it mean that your wallet will be deducted in your every bet? Sounds a no-no to me, also there no enough info on the site even the \"Rules\" page sounds confusing and the site looks like rushed.You said my mind. From what he, OP said, QuoteJust stumbled on an interesting on-chain gambling site, I don't think the site belong to the OP, so OP is probably advertising someone casino site that is under development.when I checked the site, guys, I saw nothing but dice and only me radio button. Now the op is saying that, no deposit is needed then how the casino owner will make profit to maintain the site and pay winners? OP the matter just tired me.Probably they playing with probabilities, for instance they taking 10 from somebody, and paying 9 to somebody else I agree that on-chain gaming is a new technology, I remember how Facebook looked like back in 2010  [Moderator note: consecutive posts merged (separated via horizontal lines)]",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "swogerino",
      "created_time": "December 28, 2022, 02:01:08 PM",
      "body": "The point which is different from others,the fact that they let you play without depositing any money but directly from the balance of your Metamask wallet is a good thing generally speaking.However when we see more deeper the risk associated with connecting your Metamask to such website are higher in my opinion,also the fact that the site has no big reviews from different user base of the forum will not let me try it,I only try new sites after they have consolidated themselves and for this they need to stand the time and make a lot of people to speak good about them just like the reputable casinos do here in the forum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ben Barubal",
      "created_time": "December 28, 2022, 02:02:41 PM",
      "body": "The style of the game is similar to the owl games casino, the only difference is that you have a lot of options in Owl games and you can also not connect the wallet here, instead you can use email, unlike here in poker dice is just a game.  Why can only one class of games be played on this platform? so it's suspicious to play and makes you doubt the truth mate. It's also scary to connect the wallet to that platform, I'm just stating the fact only as a gambler.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmaster2023",
      "created_time": "December 28, 2022, 02:17:29 PM",
      "body": "I agree, that it is scary to connect your wallet unknown sites, though. However if you create a wallet and transfer only funds that you afford to loose, it is another story.  Probably tomorrow will give it a try, and will share the experience here.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wiwo",
      "created_time": "December 28, 2022, 02:25:18 PM",
      "body": "Quote from: swogerino on December 28, 2022, 02:01:08 PMThe point which is different from others,the fact that they let you play without depositing any money but directly from the balance of your Metamask wallet is a good thing generally speaking.However when we see more deeper the risk associated with connecting your Metamask to such website are higher in my opinion,also the fact that the site has no big reviews from different user bases of the forum will not let me try it, I only try new sites after they have consolidated themselves and for this, they need to stand the time and make a lot of people to speak good about them just like the reputable casinos do here in the forum.I think most members of this forum already know the risk associated with this kind of casino and will not want to risk connecting their personal metamask wallet to the site secondly, ops is still a newbie and no one will trust his site if he is the operator but he already said he isn't the operator of the site or a representative of the casino which make it more less attractive here. If any one want to try the site connecting your wallet, you should not use your primary metamask wallet to connect to the casino rather create a throwaway wallet for this purpose but aside from that, I will not advise anyone to trust this site by connecting your wallet at all.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "robelneo",
      "created_time": "December 28, 2022, 02:29:32 PM",
      "body": "Quote from: bitmaster2023 on December 28, 2022, 01:00:14 PMHiNo it isn't mine, and yes rules are bit confusing, probably written from non native speaker, however it seems like on-chain solution, I managed to check contracts of the games it seems that there are some funds on both contracts, also the minimum bet is 0.01 ETH https://etherscan.io/address/0xa24a8d7f67263f6c7514f4b9aa81026f7267f57chttps://etherscan.io/address/0x53745e41639d416b5fd60322df12eedce34a2afdCheers Guys this platform just launched yesterday, I wonder how and where you stumble it, I would not easily trust a site that's just launched yesterday and getting shilled right away, I recommend playing with caution if you want to try this platform, I don't trust a new platform where I have to link my wallet so I can bet.https://www.whois.com/whois/ethgames.funDomain:ethgames.funRegistrar:Hostinger, UABRegistered On:2022-12-27Expires On:2023-12-27Updated On:2022-12-27Status:serverTransferProhibitedclientTransferProhibitedaddPeriodName Servers:ns2.dns-parking.comns1.dns-parking.com",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yogee",
      "created_time": "December 28, 2022, 02:42:07 PM",
      "body": "Quote from: bitmaster2023 on December 28, 2022, 02:00:29 PM....I agree that on-chain gaming is a new technology,Is it? I remember seeing those types of games last year where you can simply connect your wallet and play. It's not on Ethereum but they're still on-chain.I'm surprised nobody has brought up the issue on gas fees yet hehe. The current rate now is about $0.50 for normal transaction on Ethereum but how much is it when you interact with the game's smart contract? I'm guessing it's more than a $1.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bettercrypto",
      "created_time": "December 28, 2022, 03:17:40 PM",
      "body": "This might be a trap to any victims here in the forum, new gambling showing this kind of of promotion, verydangerous to connect the wallet of each member here in the forum to this platform actually.   Probably Op is thinking that \"No deposit\" is a good attraction to all gamblers here, but in realityit was very suspicious anyway, and no one is attract with it honestly speaking.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coin-investor",
      "created_time": "December 28, 2022, 03:27:19 PM",
      "body": "Quote from: bettercrypto on December 28, 2022, 03:17:40 PMThis might be a trap to any victims here in the forum, new gambling showing this kind of of promotion, verydangerous to connect the wallet of each member here in the forum to this platform actually. Yeah, I opened it and I got a prompt to connect to my Metamask I never do this on any platform except when trading on DEXes, much more on a new gambling platform that's barely a day old.Quote  Probably Op is thinking that \"No deposit\" is a good attraction to all gamblers here, but in realityit was very suspicious anyway, and no one is attract with it honestly speaking. No deposit sounds good but connecting my wallet is not, there's no TOS or anything only rules on how to play and connect your wallet, which looks suspicious to me.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "maydna",
      "created_time": "December 28, 2022, 03:31:52 PM",
      "body": "Quote from: bitmaster2023 on December 28, 2022, 02:17:29 PMI agree, that it is scary to connect your wallet unknown sites, though. However if you create a wallet and transfer only funds that you afford to loose, it is another story.  Probably tomorrow will give it a try, and will share the experience here.Unless you plan to install a new wallet with no coins or only the minimum amount needed to gamble, you don't risk losing the coins you have in your wallet while checking out the site. But this might be a new thing that will happen in the gambling business and may become a trend. But as I recall, some casinos allow users to connect their wallets directly to the casino site. And be careful if you still want to try the casino site, and stay within your limits, so you don't get into trouble later.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "virasog",
      "created_time": "December 28, 2022, 03:50:34 PM",
      "body": "Quote from: bitmaster2023 on December 28, 2022, 12:46:49 PMHi folks, Just stumbled on an interesting on-chain gambling site, you can directly bet ETH using your MetaMask wallet, without depositing funds  Shockedhttps://ethgames.fun/pokerdice.htmlhttps://ethgames.fun/twodices.htmlThey offer x50 times your initial betHave fun.Is this similar to direct bet (an old gambling site) where we don't need to create accounts for betting? Seems like you offer a similar service but using Ethereum.Quote from: bitmaster2023 on December 28, 2022, 02:17:29 PMI agree, that it is scary to connect your wallet unknown sites, though. However if you create a wallet and transfer only funds that you afford to loose, it is another story.  Probably tomorrow will give it a try, and will share the experience here.Not only it is scary to connect a wallet but also it is scary to bet out deposits. Why not give some free money to people so that they may check your site with free money and test your site? This way you will be able to get gamblers' reviews and it will give confidence to other players to try and play at your site  ethgames.fun",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}