{
  "id": "topic_5465026",
  "title": "Becassine",
  "author": "Becassine",
  "created_time": "August 30, 2023, 01:47:19 AM",
  "content": "If anyone knows, what are your impressions, thankshttps://www.keepser.com/",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5465026",
  "comments": [
    {
      "author": "FinneysTrueVision",
      "created_time": "August 30, 2023, 05:44:33 AM",
      "body": "I have not heard of this but it appears to be similar to Tapsigner which is made by the same company as Coldcard. For users who want a hardware wallet that is easy to use with mobile devices these wallets might be a good option. I don't find it necessary to carry a hardware wallet with me at all times so I would still prefer a traditional hardware wallet like Coldcard or Trezor.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "satscraper",
      "created_time": "August 30, 2023, 05:49:29 AMLast edit: August 30, 2023, 06:00:18 AM by satscraper",
      "body": "Quote from: Becassine on August 30, 2023, 01:47:19 AMIf anyone knows, what are your impressions, thankshttps://www.keepser.com/It appears to be a fresh name for me, never heard   about Keepser. I have run my eye over FAQs but still have a few inquiries remaining. Is Keepser an open-source platform? Can you provide information about when Keepser was introduced to the market? My impression is that this occurred approximately a year ago, is that accurate? Furthermore, which software wallets are compatible and can be paired with Keepser?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yamane_Keto",
      "created_time": "August 30, 2023, 08:24:58 AM",
      "body": "Quote from: Becassine on August 30, 2023, 01:47:19 AMIf anyone knows, what are your impressions, thankshttps://www.keepser.com/It is not a hardware wallet, but an encrypted library of functions that can be interacted with via an application and connected via NFC. On their site, they even mentioned that these functions may extend to sensitive data, passwords, bank cards, access data and essential data, including the private key, so they are most likely using some Bitcoin wallet code to generate the private key, and decrypting it with their application.The codes are closed source, and I don't like merging NFC cards with sensitive data, no matter the encryption.There is no mention of any Secure Elements, so we cannot say that it is a hardware wallet, but rather an anonymous encryption of your data. If you trust them, use them, but I see it as a useless risk, especially with the presence of better, open source alternatives.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dkbit98",
      "created_time": "August 30, 2023, 06:37:37 PM",
      "body": "Quote from: Becassine on August 30, 2023, 01:47:19 AMIf anyone knows, what are your impressions, thanksI never used Keepser wallet, but I know about it from our hardware wallet tracking topic, so it's not a new product.Concept of credit card format is cool but there are better and cheaper options available today (Coolwallet, Tangem, etc), and I wouldn't waste my money on keepser.However, I am always interested in hearing reviews from people who actually used it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "The Sceptical Chymist",
      "created_time": "September 06, 2023, 02:13:15 AMLast edit: September 06, 2023, 02:48:37 AM by The Sceptical Chymist",
      "body": "Never heard of it, but I looked at the website and immediately got frustrated by shit like this:That's the \"how does it work?\" section, obviously, but instead of just laying all the info out for you to read, you have to click on those stupid little bars--and the first one one is an astounding head-slapper: You gotta buy the wallet first!!  Derpitty-derp.Sorry, it's stuff like that that puts a bad taste in my mouth about things, especially when it comes to crypto products that might be me-too items like the Keepser appears to be.  It does look like a Tapsigner as FinneysTrueVision mentioned.OP, are you affiliated with the company that makes these by any chance?Edit: Hey, what happened to my image?  It was from TalkImg.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Becassine",
      "created_time": "September 08, 2023, 11:28:32 AM",
      "body": "Quote from: The Sceptical Chymist on September 06, 2023, 02:13:15 AMNever heard of it, but I looked at the website and immediately got frustrated by shit like this:That's the \"how does it work?\" section, obviously, but instead of just laying all the info out for you to read, you have to click on those stupid little bars--and the first one one is an astounding head-slapper: You gotta buy the wallet first!!  Derpitty-derp.Sorry, it's stuff like that that puts a bad taste in my mouth about things, especially when it comes to crypto products that might be me-too items like the Keepser appears to be.  It does look like a Tapsigner as FinneysTrueVision mentioned.OP, are you affiliated with the company that makes these by any chance?Edit: Hey, what happened to my image?  It was from TalkImg.Not at all. I send you a dm",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}