{
  "id": "topic_5435586",
  "title": "Woodrose",
  "author": "Woodrose",
  "created_time": "January 17, 2023, 03:29:06 PM",
  "content": "Quote from: bitcoin magazineN26, a $9 billion European digital bank, is launching bitcoin and cryptocurrency trading services, per a report from CNBC.N26 Crypto, the bank’s newly formed service, is set to roll out to Austrian clients over the next few weeks and initially include bitcoin and a number of cryptocurrencies. Following its initial release, N26 plans to expand its service offering to clients in other markets over the course of the next six months.However, users looking to leverage N26’s service should note that the bank does not support custodial wallet transfers, meaning users will not be able to move their bitcoin off of the platform.I know it's not a new think in cryptocurrency. Since cryptocurrency evolved a lot, from the time that no one ever believes up to the time that even banks are gradually accepting the benefits of cryptocurrency especially Bitcoin. Anyway, the only thing that I concerned here is the fee. Imagine if you will buy or sell bitcoin for all cryptocurrencies, the bank will charge up to 2.5%One more thing is that they do not support custodial wallet. Therefore, you cannot move your bitcoin once you bought it in their platform. What are your opinions about this? Reference: https://bitcoinmagazine.com/business/european-digital-bank-n26-enables-bitcoin-trading",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5435586",
  "comments": [
    {
      "author": "Nwada001",
      "created_time": "January 17, 2023, 04:09:28 PM",
      "body": "QuoteUsers cannot transfer funds off the platform due to the bank not supporting custodial wallets, but there are lower fees for bitcoin than other digital assets.This really make no Sense no matter the amount of benefits they promise to offer their clients.. If you purpose Bitcoin/crypto currency can only be transferred within the platform and can not be transfer outside the platform, it already means the purchase of Bitcoin is not achieved since everything will just be centralized and onchain transaction. If they want to accept crypto they should fully allow users to make use of it in which ever way the users want, withdraw to which ever wallet they want to, assets security should be considered individually.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "January 17, 2023, 04:19:21 PM",
      "body": "I assume that the focus of the whole story is this amount of $9 billion that this bank is supposedly worth/has, because the story itself is not overly interesting. Anyone who understands Bitcoin at all will surely wonder why they would invest in this way, when they can do it through any CEX and pay a smaller fee + withdraw that BTC to their non-custodial wallet.The end of the article reveals the real players behind everything, but in every business there are always those who have an idea, and those who only serve as logistics.QuoteThe functionality for crypto trading services is being provided by Bitpanda, an Austrian cryptocurrency and stock trading app that is backed by Peter Thiel. The partnership allows Bitpanda to pocket a commission for each trade and N26 noted it plans to expand its tradable assets in the future.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "January 17, 2023, 09:07:59 PM",
      "body": "Most investors do not understand how Bitcoin worksthey don't  and therefore keeping Bitcoin in those platforms is much better for them than withdrawing them to their wallets, and thus you will find people who trust PayPal, closed source wallets, CEXs more than hardware wallets and well-reviewed open source wallets .As for the fees, they are somewhat exorbitant, and therefore if the bank launches the appropriate promotional campaign, some beginners may be convinced of it.Therefore, It is about obtaining that liquidity.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CoinEraser",
      "created_time": "January 17, 2023, 09:19:32 PM",
      "body": "The fee is really high, but there will certainly be some customers who are happy to pay this fee because it is easy for them to buy bitcoins without knowing much about it. Either way, it's not so great that you can't cannot move the bitcoins. Certainly, for some customers this is definitely better, since they don't know their way around and could lose them through ignorance, but it doesn't make it any better. So they are nothing more than paper bitcoins, which can be traded but nothing else. That's not the real point behind bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "January 17, 2023, 11:44:18 PM",
      "body": "not being able to take bitcoin out of N26 means your not actually buying btc.. your buying fiat \"exposure\" to btc. in short you are just getting a n26 \"balance\" thats called btc without the ability to withdraw said btcalso n26 is not a traditional bank in the sense of the old boys club of fiat. it was a new tech creation of 2013 that got a banking charter to operate 'in-app' fiat accounts that are regulated and insured by the euro bank charter compensation scheme(German Deposit Protection Scheme)in 2019 the money service(better definition) had 3.5m customers with a 3.5b value meaning average users were only saving/spending ~$1k per person on it. thus it was not a big bank in the sense of storing life savings and more of a paypal/venmo affair of a convenient \"pocket money app\"in short i dont see it as a sign of institutional banks getting into bitcoin. thats more for 2025 when the BIS allows institutional Central banks to invest 2% of banks collateral/reserves into bitcoin for their internal bank investmentsand later(no date quoted) to offer out commercial/retail products to customers",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dothebeats",
      "created_time": "January 17, 2023, 11:59:22 PM",
      "body": "Iirc they already did this thing once with Paypal, and it was not refeived well. How would you market that you're allowing bitcoin trades when users can't take out what they bought from you? I don't think that they even have bitcoins that they're holding to facilitate these trading actions. At best, it may just be APIs and such that gets the price real time and then they take it from there. Entities not allowing bitcoin to be taken out of their custody after \"buying\" them aren't really selling you bitcoins but shares of worthless air. They can easily do a rug pull any time and you haven't got anything against them because you won't be able to give proof that you have your money with them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "headingnorth",
      "created_time": "January 18, 2023, 12:09:34 AM",
      "body": "How do you know you are buying anything if they won't give it to you? Reminds me of how many people buy gold and silver. All you get is a piece of paper that says you own this amount of gold. Maybe you do, maybe you don't. Why people want to buy anything that way is beyond me.They may decide to one day shut down the company and run away with all the customer money and there is nothing you can do about it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "January 18, 2023, 12:25:50 AM",
      "body": "Quote from: headingnorth on January 18, 2023, 12:09:34 AMHow do you know you are buying anything if they won't give it to you? Reminds of how many people buy gold and silver. All you get is a piece of paper that says you own this amount of gold. Maybe you do, maybe you don't. Why people want to buy anything that way is beyond me.They may decide to one day shut down the company and run away with all the customer money and there is nothing you can do about it.you \"own\" the account, thus have \"request rights\" of actions on how to trade the internal balance. however you cant remove the balance as the asset unit. it needs converting back to fiat to escape with fiat.meaning if they had a loss on the \"btc balance\" where eg a hack happened. which usually means they throw their business into administration(things like bankruptcy to shuffle value around and eventually fight in court about how much to repay people many many months-years later)because its in \"btc\" balance and not fiat, they escape the deposit protection scheme claim procedure. meaning holding 'btc balance' means their customers wont be just getting a cheque in the mail from german government the same month. EG when you go to traditional bank to invest in tesla. although you deposited fiat into bank the \"product\" you hold is not fiat. thus the euro deposit protection compensation scheme does not apply to that \"balance\"it would be better if able to(quick enough) . to \"trade\" it back to a fiat balance prior to any legal action. to then possibly be part of the fiat government deposit protection scheme.however knowing how exchanges work. they are probably going to turn off their internal trading service before publicly disclosing any shenanigans",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "January 18, 2023, 05:56:28 AM",
      "body": "Quote from: Woodrose on January 17, 2023, 03:29:06 PMAnyway, the only thing that I concerned here is the fee. Imagine if you will buy or sell bitcoin for all cryptocurrencies, the bank will charge up to 2.5%One more thing is that they do not support custodial wallet. Therefore, you cannot move your bitcoin once you bought it in their platform. Generally speaking when a centralized entity enters the scene it is rarely a good news, in this case if these two conditions are true then it is definitely a bad news not just because of the high fee that makes no sense to use this service but also because of the fact that users won't even be buying bitcoin, they are buying something virtual that does not exist but is called bitcoin since they can not withdraw actual bitcoins.That also sounds scarily like fractional banking where they can even end up selling more bitcoins that exist and if things like this get big (eg. more banks do it) it could even end up affecting bitcoin price.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "January 18, 2023, 06:13:16 AM",
      "body": "Quote from: Woodrose on January 17, 2023, 03:29:06 PMI know it's not a new think in cryptocurrency. Since cryptocurrency evolved a lot, from the time that no one ever believes up to the time that even banks are gradually accepting the benefits of cryptocurrency especially Bitcoin.Let's not get ahead of ourselves here and think that banks are suddenly now bullish on bitcoin. Because if they were, they would be buying it. It's simply the fact that bitcoin has a lot of public interest and the fact that they can monetize through trading fees hence the bitcoin trading integration.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "noorman0",
      "created_time": "January 18, 2023, 06:58:26 AM",
      "body": "Quote from: Woodrose on January 17, 2023, 03:29:06 PM-snip-I know it's not a new think in cryptocurrency. Since cryptocurrency evolved a lot, from the time that no one ever believes up to the time that even banks are gradually accepting the benefits of cryptocurrency especially Bitcoin. They do not really accept the benefits of bitcoin except from the high costs of each customer purchase.Quote from: Woodrose on January 17, 2023, 03:29:06 PM-snip-One more thing is that they do not support custodial wallet. Therefore, you cannot move your bitcoin once you bought it in their platform. A concern that is no different from other centralized services, I think they adopted the way of buying bitcoins on paypal long ago which is also non-transferable.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Blawpaw",
      "created_time": "January 18, 2023, 08:35:42 AM",
      "body": "This is great news indeed. It clearly shows that things are changing. N26 is one of the most modern digital banks out there and rhey dont want to miss out on development. This is why they are taking their stand along side cryptos. Hopefully, many will follow!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "headingnorth",
      "created_time": "January 18, 2023, 09:19:18 AMLast edit: January 18, 2023, 09:31:20 AM by headingnorth",
      "body": "Buying without the ability for self custody is the antithesis of why bitcoin was created in the first place.  It goes against everything bitcoin stands for. The crazy high fees they are charging for something you can't even have only adds insult to injury. This is reminiscent of the recent situation with other \"digital banks\" such as Blockfi and Celsius, which held your coins in return for earning interest and giving up custody. They were loaning out all their customer assets to other entities who in turn loaned it out again and so on, then someone or someones ended up defaulting causing the entire mess and house of cards to implode on itself with all the money disappearing. Hasn't anybody learned from recent history? You have to be crazy to risk going through that nightmare again.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "buwaytress",
      "created_time": "January 18, 2023, 10:24:56 AM",
      "body": "A bit misleading to say they don't offer custodial wallets, so customers can't move off Bitcoin.More accurate to say they're not offering exchanging actual Bitcoin. Not a single satoshi sits with them -- I would wager you can't even deposit Bitcoin on that platform.If I'm wrong, then I'm curious to know how it works here where I live where N26 is a licenced back (with exact same deposit guarantee protections) and if Bitcoin deposits would enjoy the same insurance.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}