{
  "id": "topic_5452853",
  "title": "mbw0i777",
  "author": "mbw0i777",
  "created_time": "May 15, 2023, 09:29:34 PM",
  "content": "Hello everyone! Lately, I've been noticing a lot of custom firmware for Whatsminer. Does anyone have any information on how this is done and if it's possible to create your own? If you have any information about this, please contact me.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5452853",
  "comments": [
    {
      "author": "BitMaxz",
      "created_time": "May 16, 2023, 03:53:00 AM",
      "body": "I never heard that there is custom firmware for any whatsminer units even Braiins, awesomeminer, and Hiveon OS do not support it.Where did you find that there is a custom firmware for whatsminer?I'm sure that's a scam or infected with a virus if it was from an unknown source.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sledge0001",
      "created_time": "May 17, 2023, 02:13:27 PM",
      "body": "I haven't seen or heard anyone either writing custom firmware for that whatsminer(s).You can however get a glimpse into their API here: https://www.whatsminer.com/file/WhatsminerAPI%20V2.0.4.pdf",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mikeywith",
      "created_time": "May 17, 2023, 10:53:42 PM",
      "body": "Unlike what the two fine gentlemen above mentioned, there are actually two known custom firmware for Whatsminer, Chipless, and Bixbit, the main problem with these firmware including everything else that might come out in the future, is there is actually no reason to run them and pay high fees.The stock firmware offers most of the features, you can overclock, underclock, set power limit, and submerge your miners using nothing but the stock firmware, and since using custom firmware requires a lot of trust, it's pretty difficult to find enough reviews from people who use those custom firmware versions, so most people are skeptical about using them especially that \"again\" there is really no use case.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "maxfunky",
      "created_time": "July 02, 2023, 10:39:15 AM",
      "body": "is there a way to control fan speed of a whatsminer ?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitMaxz",
      "created_time": "July 02, 2023, 03:09:50 PM",
      "body": "Quote from: maxfunky on July 02, 2023, 10:39:15 AMis there a way to control fan speed of a whatsminer ?No, it does not have a fan control even using their API you can't able to edit the fan speed but you can retrieve RPM speed through API using the Whatsminer tool under remote control.If you plan to reduce the fan speed maybe switching the settings to low power mode might help to reduce fan RPM.Or if you plan to cool down the miner a bit you can modify the miner's frequency through API.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "philipma1957",
      "created_time": "July 02, 2023, 03:10:49 PM",
      "body": "Quote from: maxfunky on July 02, 2023, 10:39:15 AMis there a way to control fan speed of a whatsminer ?not a good idea. I have eight units 2x m102x m304x m50all of them have hot exterior that is deliberately done.all of them are long with larger fansonly two fans that do about 310cfm eachwith the long length heat sheds to outside walls of the miner.If you want to reduce fan speed try two long heat sinks on the left and right outside of the miner.thus the ability to shed heat on those walls would lower internal heat.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mikeywith",
      "created_time": "July 03, 2023, 12:41:02 AM",
      "body": "Quote from: maxfunky on July 02, 2023, 10:39:15 AMis there a way to control fan speed of a whatsminer ?Using the stock firmware, no.however, there is really no reason to adjust the fan, after playing with hundreds of Whatsminers I released that the fan speed is handled perfectly unlike many Antminers ( the stock firmware to be exact). if the fans are running slow and you think the miner is getting hot, you are wrong, the miner is at the temps it wants to be at, and the same thing goes for the opposite side of the story, if the fans are running too fast, they are keeping the miner at the temps where they think it's safe.I understand you might want to adjust that on Anminter since based on my own experience all those s9s, T17 and S17 had some weird fan/temp ratio, but this isn't the case with Whatminers, in fact, I think even the custom firmware I mentioned above don't allow that, the fans can be unplugged and you tell the miner that it's going to dive into a tank for immersion cooling (it will stop checking for fans), or you let the miner control them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nooby_miner",
      "created_time": "October 06, 2024, 08:43:23 PM",
      "body": "I need a firmware that would make my whatsminer m50 work if the fans are removed. A guy installed 20240509.12.REL.LC this version for me and it worked fine but I recently got a new m50 but I found out that there are different versions for the m50 and the guy couldnt install the version he has on my new m50 (the new version is M50_VH75) my 2 older m50 versions are ( M50_VH84 and M50_VJ22 ) both of which are running right now without there fans (they are being cooled through immersion). The guy told me he got this version from the Whatsminer telegram group but I joined the group and couldn't find any firmwares there.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitMaxz",
      "created_time": "October 06, 2024, 08:54:59 PM",
      "body": "Quote from: nooby_miner on October 06, 2024, 08:43:23 PMI need a firmware that would make my whatsminer m50 work if the fans are removed. A guy installed 20240509.12.REL.LC this version for me and it worked fine but I recently got a new m50 but I found out that there are different versions for the m50 and the guy couldnt install the version he has on my new m50 (the new version is M50_VH75) my 2 older m50 versions are ( M50_VH84 and M50_VJ22 ) both of which are running right now without there fans (they are being cooled through immersion). The guy told me he got this version from the Whatsminer telegram group but I joined the group and couldn't find any firmwares there. That's the problem with the latest units you can't downgrade the unit to the version you want unless the firmware is newer than the current version. You can try to flash the unit through SD card flashing just make sure to check the control board first for SD card firmware compatibility. You can download the SD card firmware from their download page below and then if successful, flash it again with the \"20240509.12.REL.LC\" firmware.- https://www.whatsminer.com/src/views/firmware-download.html",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}