{
  "id": "topic_5466056",
  "title": "Volgastallion",
  "author": "Volgastallion",
  "created_time": "September 07, 2023, 09:45:27 PMLast edit: September 11, 2023, 01:44:43 PM by Volgastallion",
  "content": "Like the subject of the thread said.OXBET ITS NOT RELATED TO 1XBET or 1Xbit?I arrive to this questions because i dont really want to see again people here or from outside the forum being hooked by the same guys as allways.I remember not so long ago some ussers detect a casino naming like Coinplay or something like that who have some joints to the 1xbit bussiness, and ended up being another scams for the same guys.So my question is, are they again here with another name? The name its clearly similar and its a combination and changing the 1 for a 0. If they are new, maybe they only see the big marketing of 1xbet on SerieA for example and YT so they want to use the similarity of the name to have some good leverage.I think they are not so common here in the forum because you are not gonna choose that name with the reputation that follow them here.What do you think? Disclaimer: I am not accusing anyone. Im only here to point this and evacute a doubt. if someone is more specialized and can do more research welcome, like if they have the same certificate to operate, or the offices are in the same palce, etc.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5466056",
  "comments": [
    {
      "author": "Nwada001",
      "created_time": "September 07, 2023, 09:49:57 PM",
      "body": "This question was asked on the Oxbet Ann thread on their day of launching it, and there were answers given by either their representative or Icopress. Either way, why will even a 1xbet come back with a name that is in some ways related to them? That will be bad for them and won't make them last long. I guess Oxbet just happened to choose a name similar to an existing scam casino, but I don't see them as 1xbet scammers unless proven otherwise, at least for now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Little Mouse",
      "created_time": "September 07, 2023, 09:50:35 PM",
      "body": "Are you doubting them or vouching for them that they aren't 1xbet? At first, I thought you are vouching for them lol. Anyway, we don't have any prove that they are sister site of 0xbet. The only identical thing is the name but that doesn't guarantee that they are same. Anyone can pick this name for their casino. You know it's not easy to get a common casino url. So, they thought a bit different which is the result of 0x. I don't think it's alarming unless we have some solid proofs, links which direct us for further doubt.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zoomic",
      "created_time": "September 07, 2023, 10:06:18 PM",
      "body": "Quote from: Little Mouse on September 07, 2023, 09:50:35 PMAre you doubting them or vouching for them that they aren't 1xbet? At first, I thought you are vouching for them lol. Anyway, we don't have any prove that they are sister site of 0xbet. The only identical thing is the name but that doesn't guarantee that they are same. Anyone can pick this name for their casino. You know it's not easy to get a common casino url. So, they thought a bit different which is the result of 0x. I don't think it's alarming unless we have some solid proofs, links which direct us for further doubt.When I read the title of OP, I thought he was vouching for them but the question mark at the end of the title made me think the OP was barely asking questions. The use of punctuations is necessary for understanding of English language. I know the question of 1xbet and 0xbet being affiliated has been asked and settled. 0xbet said they have nothing to do with 1xbit. When you look at the domain  closely, you will understand that 0xbet is even more similar to 1xbet than 1xbit. The matter is that many forum members say that 1xbit and 1xbet is one.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dothebeats",
      "created_time": "September 07, 2023, 10:24:48 PM",
      "body": "Not entirely sure if the two are related to one another, but they sure as hell caught your attention because of the name. Upon reading their official thread, it seems that they are neither confirming nor denying that they are the same entity, though there isn't an explicit statement coming from them that they are the ones behind the scam site. I would, however wait for reviews from established forum members before trying to play on that site if you're someone who has limited funds and wants to get the most out of their money for gambling.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wiwo",
      "created_time": "September 07, 2023, 10:28:30 PM",
      "body": "Got attracted to this thread thinking that ops already got evidence to support the claims that both casino and related and according to the thread title,  was meant to be so but reading through the entire text I discovered that ops were just emphasizing on what we are already discussing on the 0xbet ANN thread. The truth of the matter is that time will prove everything and not going to take long before the true identity behind the 0xbet will come out, Consistency is what will reveal their true identity since there is no evidence and the 0xbet is still very well in business haven't defended themselves.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "letteredhub",
      "created_time": "September 07, 2023, 10:55:42 PM",
      "body": "The name is similar to that of 1xbet which makes the similarity a close one but it could all be a coincidence not minding that coincidence don't always just happen.buy without a concrete prove to any claims or suspicion then it's just a suspicion.  If they are a 1xbet in another title or an affiliate I am convince they won't chose a name relative to xbet cause they would have been wise to know  that will draw attention. With a little examination my instinct thinks they are a different gambling company but as we can't completely guarantee for now we' can only  allow time to unravel the truth eventually.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "logfiles",
      "created_time": "September 07, 2023, 10:57:39 PM",
      "body": "If you go to their official thread, they say that they are not affiliated to any casino linked to them, 1xbet and 1xbit in particular, and I am believing them for now. 1xbit, 1xbet and all those scam casinos we have uncovered in the past are owned by 1X Corp N.V and all of them have a common characteristic of holding onto customers' winnings and claiming they breached certain terms and conditions they never mention and the closing the account.Quote from: icopress on August 16, 2023, 06:49:50 PMAs far as I know, the name was taken from the first characters of Ethereum addresses.I also managed to find out that 0XBet Casino is part of the Casbit group, which includes other casinos such as JustBit and TrueFlip",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hispo",
      "created_time": "September 07, 2023, 11:34:22 PM",
      "body": "Quote from: Nwada001 on September 07, 2023, 09:49:57 PMThis question was asked on the Oxbet Ann thread on their day of launching it, and there were answers given by either their representative or Icopress. Either way, why will even a 1xbet come back with a name that is in some ways related to them? That will be bad for them and won't make them last long. I guess Oxbet just happened to choose a name similar to an existing scam casino, but I don't see them as 1xbet scammers unless proven otherwise, at least for now.Right, but it is rather unfortunate they have chosen to go for that name for their business, at least they could have gone through some search before picking it. There will be more people like OP Wich will likely pass from giving a try to this casino out of the small perceived posibility of having anything to do with that infamous scam of a casino. Also, I have read some months ago that 1xbit was seeking to rebrand themselves for obvious reasons, I did not assume 0xbet have anything to do with that, because obviously it would be very dumb of them going for such similar name in order to try to distract from their bad history.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "robelneo",
      "created_time": "September 07, 2023, 11:35:56 PM",
      "body": "Quote from: Little Mouse on September 07, 2023, 09:50:35 PMAre you doubting them or vouching for them that they aren't 1xbet? At first, I thought you are vouching for them lol. Anyway, we don't have any prove that they are sister site of 0xbet. The only identical thing is the name but that doesn't guarantee that they are same. Anyone can pick this name for their casino. You know it's not easy to get a common casino url. So, they thought a bit different which is the result of 0x. I don't think it's alarming unless we have some solid proofs, links which direct us for further doubt.1XBET or 1Xbit is so notorious that anything that has a hint that they have a connection to one casino will be put in question, I'm sure the bounty manager icopress has done research on the platform he already made a post about this issue if there is a piece of solid evidence that will connect them the community is ready to give them bad feedbacks and flags.I never rule out that 1XBET or 1Xbit will get a new name or a new company just to create a new brand with the same management.When your company is losing its business and reputation, it will do a makeover or a relaunch very much different from the one that has a bad reputation, until nothing proves that OXBET ITS NOT RELATED TO 1XBET or 1Xbit We have to welcome them here in the community, they are a new casino that wants to have a slice in a big gambling industry.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Volgastallion",
      "created_time": "September 07, 2023, 11:38:19 PM",
      "body": "Thanks you all for the replies.I read the ann thread, one comment im gonna quote, its why my doubts grow. And was this.Quote from: davis196 on August 17, 2023, 10:23:24 AMFrom what I see 0xbet is a brand owned by Boomerang which is a Russian casino and sportsbook. There are several other brands in Boomerang's portfolio. Am I right? Having multiple crypto casino brands seems suspicious to me, but I might be wrong.I've visited 0xbet and most of the games can't load. There's a sign that says \"something went wrong, please try again later\".Anyway, the casino looks pretty much OK and the owner has a Curacao gambling license.Good luck with this project, OP. If i dont remember bad 1xbet are also russian........I try to search more info but i dont find anything, only a few search in google that when i click they redirect me to..... a 1win casino...... more suspicious.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitcoinGirl.Club",
      "created_time": "September 11, 2023, 01:29:54 PM",
      "body": "Quote from: Volgastallion on September 07, 2023, 09:45:27 PMLike the subject of the thread said.OXBET ITS NOT RELATED TO 1XBET or 1Xbit?I arrive to this questions because i dont really want to see again people here or from outside the forum being hooked by the same guys as allways.I remember not so long ago some ussers detect a casino naming like Coinslotty or something like that who have some joints to the 1xbit bussiness, and ended up being another scams for the same guys.So my question is, are they again here with another name? The name its clearly similar and its a combination and changing the 1 for a 0. If they are new, maybe they only see the big marketing of 1xbet on SerieA for example and YT so they want to use the similarity of the name to have some good leverage.I think they are not so common here in the forum because you are not gonna choose that name with the reputation that follow them here.What do you think? Disclaimer: I am not accusing anyone. Im only here to point this and evacute a doubt. if someone is more specialized and can do more research welcome, like if they have the same certificate to operate, or the offices are in the same palce, etc.You are accusing a new brand who are trying to reach out to potential players and you are doing it without any reference? It does not look good. If you found any connection other than the similar sound name then post, it will read better, look better.Quote from: dothebeats on September 07, 2023, 10:24:48 PMbut they sure as hell caught your attention because of the name. _XBET. There are 26 English letters, 10 digits and not sure how many special characters. So when any of them will be in use we will see a new thread every time? LOL",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dimonstration",
      "created_time": "September 11, 2023, 01:43:17 PM",
      "body": "Quote from: Volgastallion on September 07, 2023, 09:45:27 PMLike the subject of the thread said.OXBET ITS NOT RELATED TO 1XBET or 1Xbit?The casino is inspired by 0x protocol and the casino design far different to the typical template of 1xbit company casino scam. It's not bad to become wary due to the name similarity but can't proved someone scam just by the name similar unless they scam already.Quote from: Volgastallion on September 07, 2023, 09:45:27 PMI remember not so long ago some ussers detect a casino naming like Coinslotty or something like that who have some joints to the 1xbit bussiness, and ended up being another scams for the same guys.At least do research before you mention the casino name because you are referring to a scam casino here. Coinplay casino is what you are referring and not coinslotty. Coinslotty is a decent startup casino that doesn't continue operating but not because they turn into scam.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Volgastallion",
      "created_time": "September 11, 2023, 01:47:23 PM",
      "body": "Well thanks for your answer, seems like some people really dont know the mean of the interrogation symbol.Im always ASKING and its a forum where i can ASK for opinions.Quote from: dimonstration on September 11, 2023, 01:43:17 PMQuote from: Volgastallion on September 07, 2023, 09:45:27 PMI remember not so long ago some ussers detect a casino naming like Coinslotty or something like that who have some joints to the 1xbit bussiness, and ended up being another scams for the same guys.At least do research before you mention the casino name because you are referring to a scam casino here. Coinplay casino is what you are referring and not coinslotty. Coinslotty is a decent startup casino that doesn't continue operating but not because they turn into scam.Here its my abd i correct that right now, you have 100% reason in that, i put bad the name. I edit the post before lock the thread to avoid missunderstanding.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}