{
  "id": "topic_5446157",
  "title": "coupable",
  "author": "coupable",
  "created_time": "March 24, 2023, 12:17:57 PMLast edit: March 25, 2023, 12:43:31 AM by coupable",
  "content": "When central banks all over the world have been working towards exploring CBDCs, The UAE had announced its digital dirham as one of the keys initiatives of its new Financial Infrastructure Transformation Program. The start of work on the project was announced a while ago, and it seems that the pace of work is faster than expected, since it was decided that the project will be ready for launch within 12 to 15 months, and that the first phase will be ready in mid-2024.QuoteAs part of the UAE's digital transformation, CBDC will help address the pain points of domestic and cross-border payments, enhance financial inclusion and the move towards a cashless society. It will further strengthen the UAE's payment infrastructure, providing additional robust payment channels, ensuring a resilient and reliable financial system. More importantly, the CBUAE aims to ensure the readiness of the UAE to integrate the payment infrastructures with the future potential tokenization world, the tokenization of the financial and non-financial activities.https://www.centralbank.ae/media/lpoilyue/cbuae-launches-the-central-bank-digital-currency-strategy-the-digital-dirham-en.pdfMr.Khaled Mohamed Balama, the Governor of the UAE Central Bank, said: “CBDC is one of the initiatives as part of the (UAE Central Bank) CBUAE’s FIT program, which will further position and solidify the UAE as a leading global financial hub. The launch of our CBDC strategy marks a key step in the evolution of money and payments in the country. CBDC will accelerate our digitalization journey and promote financial inclusion. We look forward to exploring the opportunities that CBDC will bring to the wider economy and society.”",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5446157",
  "comments": [
    {
      "author": "Husires",
      "created_time": "March 24, 2023, 01:52:03 PM",
      "body": "CBDC currencies, if adopted, will help governments a lot by getting rid of commercial banks and intermediary services such as Visa and MasterCard and connecting directly to users, which means that the banking system in its current situation is in danger because it dries up the most important source of money for it, which is the deposits of users, so I do not expect these projects to see the light quickly or within 15 months.I think UAE is talking a big step, let's see what happens.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "avikz",
      "created_time": "March 24, 2023, 02:01:23 PM",
      "body": "Nope! Banks will be a part of this CBDC network for sure. The only stakeholders getting removed are payment networks like Visa or MasterCard. This is an excellent news because these payment networks act like broker and gets a pie from each transaction they process. Now the money generated from payment processing, banks will get a cut and the overall transaction costs will be reduced. Secondly, dependency on USD will be reduced to a huge extent. Without the payment brokers, all transactions will be going from one bank to another bank and will not require USD settlements even for international payments. Good for many, bad for some!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coupable",
      "created_time": "March 24, 2023, 02:23:35 PM",
      "body": "Quote from: Husires on March 24, 2023, 01:52:03 PMCBDC currencies, if adopted, will help governments a lot by getting rid of commercial banks and intermediary services such as Visa and MasterCard and connecting directly to users, which means that the banking system in its current situation is in danger because it dries up the most important source of money for it, which is the deposits of users, so I do not expect these projects to see the light quickly or within 15 months.You have the right to believe that since there are other countries that have announced their intentions to issue their own CBDC and there has been no development since the date of announcing those intentions. The matter is a little different with the Emirates, since it is proceeding according to a strategic vision aimed at digitizing the economy and supporting new technologies, and work has already begun on this through licensing cryptocurrency exchange platforms for activity in it and working on issuing legislation regulating crypto activities.I expect that within less than a year and a half, the CBDC project can be completed, especially since this will happen in partnership with several international parties such as India and China.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Die_empty",
      "created_time": "March 24, 2023, 03:14:56 PM",
      "body": "Quote from: avikz on March 24, 2023, 02:01:23 PMNope! Banks will be a part of this CBDC network for sure. The only stakeholders getting removed are payment networks like Visa or MasterCard. This is an excellent news because these payment networks act like broker and get a pie from each transaction they process. Now the money generated from payment processing, banks will get a cut and the overall transaction costs will be reduced. Secondly, dependency on USD will be reduced to a huge extent. Without the payment brokers, all transactions will be going from one bank to another bank and will not require USD settlements even for international payments. Good for many, bad for some! Since local banks will be involved in the CBDC network it means they will still make money from the transaction charges. So the effect on them will not be too much. These middlemen such as Interswitch, Visa, and MasterCard are multinationals that prey on mostly developing nations yet they pay low taxes and create fewer employment opportunities in their host nation.I also think that CBDC prepares the people for bitcoin adoption. People tend to easily understand the concept of bitcoin if they have been exposed to CBDC. The weakness of CBDCs will make people crave better alternatives which will be bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gyfts",
      "created_time": "March 24, 2023, 06:15:05 PM",
      "body": "QuoteAs part of the UAE's digital transformation, CBDC will help address the pain points of domestic and cross-border payments, enhance financial inclusion and the move towards a cashless society. It will further strengthen the UAE's payment infrastructure, providing additional robust payment channels, ensuring a resilient and reliable financial system. More importantly, the CBUAE aims to ensure the readiness of the UAE to integrate the payment infrastructures with the future potential tokenization world, the tokenization of the financial and non-financial activities.They're right that cross-border payments are troublesome and expensive, but CBDC's aren't the answer.Banking institutions act as intermediaries between consumers and consumers are forced to adhere to the banks convoluted regulations which make it difficult to send funds internationally. Bitcoin is P2P and universal and obviously it doesn't have the same types of issues. Theoretically, CBDC could solve this problem if you're dealing with a single country but it isn't feasible to hold a dozen different types of digitalized tokens for the sake of doing business with different countries. You might as well stick to traditional banks at that point and deal with them to issue out payments for you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "siniminomorocomunisakito",
      "created_time": "March 24, 2023, 06:18:57 PM",
      "body": "I think this reflects the growing interest in CBDCs by central banks around the world, as they explore the potential benefits and challenges of digital currencies.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cabron",
      "created_time": "March 24, 2023, 06:33:22 PM",
      "body": "Small banks may not survive what the FED is doing. All that may be left are the central banks which are the ones going to launch CBDCs. Probably planned ahead of time before they were trying to shoot the life of these small banks, especially the ones that are exposed to crypto.I got a hunch that when CBDCs are deployed already, the government will ban crypto and Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husires",
      "created_time": "March 25, 2023, 01:14:37 PM",
      "body": "Quote from: coupable on March 24, 2023, 02:23:35 PMYou have the right to believe that since there are other countries that have announced their intentions to issue their own CBDC and there has been no development since the date of announcing those intentions.It took a while to modernize the paper money in the Emirates into plastic, so the completion of a currency within a year and a half was bad and the generalization of its experience to be an alternative to cash is something else, which may not happen in the next ten years.It is true that the UAE is a pioneering country, but banking frameworks are more like the Internet and need international cooperation.Only after CBDC are agreed upon between countries, especially the United States, then will we witness a real transformation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}