{
  "id": "topic_5448998",
  "title": "She shining",
  "author": "She shining",
  "created_time": "April 16, 2023, 06:43:03 AM",
  "content": "Hello everyone, I made my first post here and the words of advice were really touching(maybe it's because I am weak-hearted) and encouraging. Thank you all for making me feel at home.Now back to my question. My thoughts were that alternative(Alt) coins were created by organizations or developers to serve as a digital currency for their product or service, or improve on the shortcomings of their parent coin. I believed an alt coin with a real purpose was here to stay like Bitcoin. But reading certain threads made me realize that my thoughts might be flawed and that maybe alt coins are good for making short gains and not long since some analysts believe they are subject to pump and dump. So would like to know1. What will happen to alt coins when Bitcoin becomes a legal tender? Will they have a massive growth,or would people sell and jump into  Bitcoin?2. What would happen to alt coins when Bitcoin becomes relatively stable( when it is fully mined and will solve its problem of price volatility)? Will alt coins survive the test of time? Will new alt coins be created later? What would become of the various countries'currencies, especially the Dollar (the global reserve currency) after Bitcoin's general acceptance?3. If alt  coins survive in the next century what is the reason it would.4. Should alt coins be traded rather than HODL?I hope my questions aren't too many.Thank you for your time once again.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5448998",
  "comments": [
    {
      "author": "BlackBoss_",
      "created_time": "April 16, 2023, 06:50:16 AM",
      "body": "Quote from: She shining on April 16, 2023, 06:43:03 AMI believed an alt coin with a real purpose was here to stay like Bitcoin. Most of altcoins die with time, not here to stay like Bitcoin. How many cryptocurrencies failed?If top altcoins are not strong enough to be survivors, how do you believe in altcoins.Don't buy altcoins because they are top altcoins",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zaguru12",
      "created_time": "April 16, 2023, 06:50:28 AMLast edit: April 16, 2023, 07:01:53 AM by Zaguru12",
      "body": "Quote from: She shining on April 16, 2023, 06:43:03 AM1. What will happen to alt coins when Bitcoin becomes a legal tender? Will they have a massive growth,or would people sell and jump into  Bitcoin?Definitely when bitcoin gets attention or even a rise Altcoins also receive some kind of attention too. So in the advent of bitcoin being a legal tender( which I strongly doubt it would take longer time for it globally) then if some alts like ethereum are still in circulation many will trade in them but it depends if they would survive till then. Quote2. What would happen to alt coins when Bitcoin becomes relatively stable( when it is fully mined and will solve its problem of price volatility)? Will alt coins survive the test of time? Will new alt coins be created later? What would become of the various countries'currencies, especially the Dollar (the global reserve currency) after Bitcoin's general acceptance?It will be hard to find bitcoin stable because the market will always have the demand and supply effect even after mining has stopped but its volatility will reduce to some extent. So yes this attention will also drive some get quick towards Altcoins and this time around it could be massive since many wouldn’t be expecting much profit bitcoin. But it all depends on the longevity of themQuote3. If alt  coins survive in the next century what is the reason it would.It will simply be bitcoin dominance that is still keeping them but I strong have believe that so many will be out of the market then Quote4. Should alt coins be traded rather than HODL?If at all one needs to lay a hand on alt coins then it should be for trading only even that is regarded as a risk or gamble. But on account should one hodl them because they have no value with respect to time. Although there are some that gain profits when hodl for some months or years but it hardly surpasses 5 years and they die off or depreciate to insignificant amounts",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Upgrade00",
      "created_time": "April 16, 2023, 06:59:31 AM",
      "body": "Quote from: She shining on April 16, 2023, 06:43:03 AM1. What will happen to alt coins when Bitcoin becomes a legal tender? Will they have a massive growth,or would people sell and jump into  Bitcoin?If Bitcoin becomes legal tender. I don't see an unregulated asset being adopted globally as a legal tender, but if that happen, altcoins would still be in existence. I don't expect a massive growth, maybe a slow decline.Quote from: She shining on April 16, 2023, 06:43:03 AM2. What would happen to alt coins when Bitcoin becomes relatively stable( when it is fully mined and will solve its problem of price volatility)? Will alt coins survive the test of time? Will new alt coins be created later? What would become of the various countries'currencies, especially the Dollar (the global reserve currency) after Bitcoin's general acceptance?• Altcoins might not last long enough to when Bitcoin is relatively stable. Except of course innovation takes place and better coins are introduced later on.• I do not think they would survive the test of time, at least not the ones we are seeing now. Altcoins usually move in circles; the ones created over the past 5-9 years have mostly fizzled out, and been replaced by newer ones which would fizzle out later on.• Yes, new altcoins and tokens are being created all the time.• For Bitcoin to be generally accepted, native currencies should have become so flawed that they cannot be used snymore.Quote from: She shining on April 16, 2023, 06:43:03 AM3. If alt  coins survive in the next century what is the reason it would.4. Should alt coins be traded rather than HODL?• Newer innovation.• Neither. But if you have to, trade.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Despairo",
      "created_time": "April 16, 2023, 07:24:40 AM",
      "body": "Quote from: She shining on April 16, 2023, 06:43:03 AM1. What will happen to alt coins when Bitcoin becomes a legal tender? Will they have a massive growth,or would people sell and jump into  Bitcoin?2. What would happen to alt coins when Bitcoin becomes relatively stable( when it is fully mined and will solve its problem of price volatility)? Will alt coins survive the test of time? Will new alt coins be created later? What would become of the various countries'currencies, especially the Dollar (the global reserve currency) after Bitcoin's general acceptance?3. If alt  coins survive in the next century what is the reason it would.4. Should alt coins be traded rather than HODL?1. Bitcoin is already become a legal tender in El Salvador and Central African Republic, I don't see a massive growth, just a normal growth. They didn't sell their altcoins because you can check on CMC where altcoins market cap is still high.2. Most altcoins will not survive long enough like Bitcoin, it's still 117 years to go. Everyday there's always a new altcoins, no need to wait until Bitcoin reach it's maximum supply.3. The reason is because Bitcoin still exist and perform very well.4. Yes.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "April 16, 2023, 07:38:26 AM",
      "body": "Quote from: She shining on April 16, 2023, 06:43:03 AM1. What will happen to alt coins when Bitcoin becomes a legal tender? Will they have a massive growth,or would people sell and jump into  Bitcoin?2. What would happen to alt coins when Bitcoin becomes relatively stable( when it is fully mined and will solve its problem of price volatility)? Will alt coins survive the test of time? Will new alt coins be created later? What would become of the various countries'currencies, especially the Dollar (the global reserve currency) after Bitcoin's general acceptance?What most people get wrong is that only a very small subset of altcoins are actually trying to beat bitcoin in its own game(SoV, currency). A lot of altcoins act like stocks. Altcoins are  not like what it used to be like in 2016-2017 where every altcoin is trying to be money.Quote from: She shining on April 16, 2023, 06:43:03 AM3. If alt  coins survive in the next century what is the reason it would.People continuing to try to start experiments with protocols. That, and because people will continue to be greedy as per usual.Quote from: She shining on April 16, 2023, 06:43:03 AM4. Should alt coins be traded rather than HODL?It depends:* What altcoin?* Are you actually more better at trading than holding(or vice versa)?Always remember that there are like hundred thousands of altcoins in different categories(majority of which are scams or are generally crap projects); but you still cant clump them all up together under one umbrella.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husires",
      "created_time": "April 16, 2023, 02:20:26 PM",
      "body": "Quote from: She shining on April 16, 2023, 06:43:03 AM1. What will happen to alt coins when Bitcoin becomes a legal tender? Will they have a massive growth,or would people sell and jump into  Bitcoin?Bitcoin is a legal currency in three countries, or do you mean a specific country?Quote from: She shining on April 16, 2023, 06:43:03 AM2. What would happen to alt coins when Bitcoin becomes relatively stable( when it is fully mined and will solve its problem of price volatility)? Will alt coins survive the test of time? Will new alt coins be created later? What would become of the various countries'currencies, especially the Dollar (the global reserve currency) after Bitcoin's general acceptance?Assuming that the average age of the forum is 15 years old and that the youngest member may be 10 years old, most of us will not live to see the last bitcoins mined, and even those who live will not have the physical ability to understand their reality.Quote from: She shining on April 16, 2023, 06:43:03 AM3. If alt  coins survive in the next century what is the reason it would.This depends on the definition of any altcoin? Thousands of altcoins *died* in the first 13 years.Quote from: She shining on April 16, 2023, 06:43:03 AM4. Should alt coins be traded rather than HODL?Historical data says so.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pandu Geddon",
      "created_time": "April 16, 2023, 02:36:11 PM",
      "body": "Quote from: She shining on April 16, 2023, 06:43:03 AM3. If alt  coins survive in the next century what is the reason it would.4. Should alt coins be traded rather than HODL?simple reason, because they have a market interest. and their project is used in the long term. indeed there is no guarantee that the altcoin project will last a very long time. so I won't hold altcoins, or trade them for short term gains.when a new project produces its altcoin, there will be an increase in the number of altcoins in the future. and also some of them will disappear. when they no longer update the project and lose the market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "salad daging",
      "created_time": "April 16, 2023, 03:30:57 PM",
      "body": "Quote from: She shining on April 16, 2023, 06:43:03 AM1. What will happen to alt coins when Bitcoin becomes a legal tender? Will they have a massive growth,or would people sell and jump into  Bitcoin?If Bitcoin becomes a legal means of payment globally then the growth in altcoins will be great but behind that there must be those who take advantage of the hype moment looking for profits created in new projects but in the end altcoin tokens will die because on average their only goal is to make profits not its use, so people have to sell and prefer bitcoin.Quote from: She shining on April 16, 2023, 06:43:03 AM2. What would happen to alt coins when Bitcoin becomes relatively stable( when it is fully mined and will solve its problem of price volatility)? Will alt coins survive the test of time? Will new alt coins be created later? What would become of the various countries'currencies, especially the Dollar (the global reserve currency) after Bitcoin's general acceptance?Altcoins can survive if they can do with new innovations but I'm not sure how long altcoins will last when the relative price of bitcoin will be stable but it doesn't reduce its volatility when the market goes bad due to some negative effects.Fiat currency will still be widely used despite the general acceptance of bitcoin, but I'm not sure in the near future bitcoin will be able to do that.Quote from: She shining on April 16, 2023, 06:43:03 AM3. If alt  coins survive in the next century what is the reason it would.Altcoins will never go away, in the sense that when many altcoins die because they cannot grow there will be new projects with thousands coming.Altcoins are only a complement to the market.Quote from: She shining on April 16, 2023, 06:43:03 AM4. Should alt coins be traded rather than HODL?The average person trades for short term gains but for HODL then bitcoin is better than altcoin which has a lot of risk.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "April 16, 2023, 04:11:48 PM",
      "body": "Thats a lot of question but primarily bitcoin will never got like a centralized entity to be stable with. Even it become legal tender, the movement would might still affect altcoins in the long run. Plus not all altcoins are not meant to hold since we knew some or majority of them are premine with an end game approach when VC start selling their loads. Its proven so better pick wise your altcoins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oceat",
      "created_time": "April 16, 2023, 05:28:44 PM",
      "body": "Asking Bitcoin when to become a legal tender is like asking when will be the world peace going to happen.But on the other note for altcoins, they will eventually going to die soon while some may be forgotten and some will still continue to exist just like the ETH and other altcoins that has history. It is true that altcoins are just good for short term investment since most of them are subjected to pump and dump but there are other altcoins that depends on the Bitcoin trend so these are the best to hold for long term just like Bitcoin.And one thing, even if Bitcoin is fully mined it still won't solve the price volatility because it has nothing and can't do anything to the people trading day by day.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ndabagi01",
      "created_time": "April 16, 2023, 06:35:28 PM",
      "body": "Quote from: She shining on April 16, 2023, 06:43:03 AM1. What will happen to alt coins when Bitcoin becomes a legal tender? Will they have a massive growth,or would people sell and jump into  Bitcoin?2. What would happen to alt coins when Bitcoin becomes relatively stable( when it is fully mined and will solve its problem of price volatility)? Will alt coins survive the test of time? Will new alt coins be created later? What would become of the various countries'currencies, especially the Dollar (the global reserve currency) after Bitcoin's general acceptance?When bitcoin is fully mined, it does not have to be stable; rather, it will still experience some volatility, no matter how minor, because of supply and demand. If bitcoin becomes legal tender, the crypto market will be the primary focus in the global financial market. As a result, I believe most altcoin investors will strive to make their coins very competitive in the market and would not want the coin to exit the market after a short period of time, as we are experiencing now.Quote3. If alt  coins survive in the next century what is the reason it would.Bitcoin would be the reason they live till then, as well as how powerful the team of altcoin investors are.Quote4. Should alt coins be traded rather than HODL?It depends on your perspective; in the crypto market, there are several types of cryptocurrency, and their classification determines their place and how long they will be profitable in the market. You'll know what to do with any altcoin if you do your homework well. Overall, you should be aware that altcoins cannot be relied on in the same way that bitcoin can. So if you trade them, you are trading at risk.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BIT-BENDER",
      "created_time": "April 16, 2023, 06:48:19 PM",
      "body": "Bitcoin has influence on many other coin in the cryptocurrency space but this isn’t to say that bitcoin necessarily have to formal rights to put any Altcoin out of existence regardless of the evolution Bitcoin go through.Also what do you mean by bitcoin becoming a legal tender? Already people are using bitcoin around the world even in countries that has known disgust for crypto-currency. I don’t believe there would ever be a time the whole world would all agree Bitcoin to be a legal tender at the same time even if that happens altcoins like Ethereum with already existing utilities still Stand good chance.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cryptomultiplier",
      "created_time": "April 16, 2023, 07:20:30 PM",
      "body": "Quote from: She shining on April 16, 2023, 06:43:03 AMHello everyone, I made my first post here and the words of advice were really touching(maybe it's because I am weak-hearted) and encouraging. Thank you all for making me feel at home.Now back to my question. My thoughts were that alternative(Alt) coins were created by organizations or developers to serve as a digital currency for their product or service, or improve on the shortcomings of their parent coin. I believed an alt coin with a real purpose was here to stay like Bitcoin. But reading certain threads made me realize that my thoughts might be flawed and that maybe alt coins are good for making short gains and not long since some analysts believe they are subject to pump and dump. So would like to know1. What will happen to alt coins when Bitcoin becomes a legal tender? Will they have a massive growth,or would people sell and jump into  Bitcoin?2. What would happen to alt coins when Bitcoin becomes relatively stable( when it is fully mined and will solve its problem of price volatility)? Will alt coins survive the test of time? Will new alt coins be created later? What would become of the various countries'currencies, especially the Dollar (the global reserve currency) after Bitcoin's general acceptance?3. If alt  coins survive in the next century what is the reason it would.4. Should alt coins be traded rather than HODL?I hope my questions aren't too many.Thank you for your time once again.I don't think Bitcoin would deface the presence of alt coins even if it becomes a legal tender, because most alt coins are way cheaper and take in profits although in smaller fraction as compared to BTC. Alt coins want to get bigger too, but the fear is that it doesn't crash sooner than expected. BTC has shown to be stable over a long duration since its launch and has gained dominance along side Eth which stands strong too. Alt coins should be traded instead of being kept for long because there's no saying what might happen next. Also, if altcoins should survive the next century, it would be because of the commitment of the team behind to the success of the coin and it would also be because of good PR and service charge.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Baofeng",
      "created_time": "April 17, 2023, 03:33:55 AM",
      "body": "Quote from: She shining on April 16, 2023, 06:43:03 AM1. What will happen to alt coins when Bitcoin becomes a legal tender? Will they have a massive growth,or would people sell and jump into  Bitcoin?Nothing I guess, they will still be \"alternative\" to bitcoin regardless. You don't need to speculate at this one, so far bitcoin's dominance is around 45%-50%, with that it will continue to be the prime mover.Quote from: She shining on April 16, 2023, 06:43:03 AM2. What would happen to alt coins when Bitcoin becomes relatively stable( when it is fully mined and will solve its problem of price volatility)? Will alt coins survive the test of time? Will new alt coins be created later? What would become of the various countries'currencies, especially the Dollar (the global reserve currency) after Bitcoin's general acceptance?Bitcoin and \"stable\" does not go in one sentence, it is volatile and going to be as it is based on supply and demand. There will be thousands of altcoins going to be created, as whether it has use case or just pure hype, remains to be seen. Dollar will be challenge, but I doubt that it will simply go down. Maybe you can read this:  Analysts Weigh In on BRICS Currency as Tool to Face US Dollar-Based Sanctions  Quote from: She shining on April 16, 2023, 06:43:03 AM3. If alt  coins survive in the next century what is the reason it would.Same as Bitcoin, it should have use case and people are using it for purposes it was design.Quote from: She shining on April 16, 2023, 06:43:03 AM4. Should alt coins be traded rather than HODL?It's an asset or others may see some altcoins as Store of Value, so we don't have one size fits all answer for that. It depends on how individuals are going to look at altcoins, if they think it's will give  them good money in the future, then most likely they will HODL. But for traders, then we have exchanges as a medium to do that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Chivas Regal",
      "created_time": "April 17, 2023, 11:10:57 AM",
      "body": "As I see it an alt coin has to have a hook - something that draws the crowds to it, otherwise it is simply a clone of every other coin that has risen and failed.  Coins such as Tron are ideal as they are gateways to alts that are supported on their network unlike Ether or Binance ones that are increasingly pricing themselves out of the market with ever higher fees.  (Bitcoin is another example where even segwit pushing the data in a block down has created a new style of bidding war for transactions to be included within their blocks).Some of the major cryptos are becoming places to store wealth comparable to silver, gold and platinum over the centuries, but I can't see any one crypto (Bitcoin included) becoming a global currency.Developers and advocates need to find niche markets for their cryptos even if it's something as simple as a fast food burger chain or a coffee and doughnut stall at a local market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "April 17, 2023, 01:29:13 PM",
      "body": "When we say \"altcoins\" we are talking about a massive world that consists of a lot of different projects (a couple of categories). So we have to be clear which category we are talking about.The main category of altcoins are those that are usually referred to as \"shitcoins\". These are useless coins usually with severe flaws and exploits that are also usually centralized. In one word we can call them \"useless\".These coins will continue to exist under all circumstances because the purpose they serve is for gamblers to make bets on their prices and participate in their pump and dumps to make a quick profit. All tokens and token creation platforms are part of this category.Another category of altcoins are those that tried a different approach, like using a different mining algorithm (eg. LTC). These coins had nice ideas but none of them could solve any real problem which means they can be considered \"failed projects\". They will lose popularity over time and eventually die in the future. Again this is regardless of what happens to bitcoin.A final category could be same as the one before but coins that had some innovation and could solve some actual problem hence gain some utility (eg. XMR). These coins will remain relevant and could even grow over time. But their future heavily depends on their competition, meaning if another project comes along with better innovation that solves the issues they had (eg. scaling problems of XMR) they would easily and quickly replace the said coins.Bitcoin's mass adoption could make things harder for these coins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "348Judah",
      "created_time": "April 17, 2023, 03:22:00 PM",
      "body": "Quote from: She shining on April 16, 2023, 06:43:03 AM1. What will happen to alt coins when Bitcoin becomes a legal tender? Will they have a massive growth,or would people sell and jump into  Bitcoin?Bitcoin had already been made a legal tender in El-Savador ans Central African Republic, we cannot concluded that bitcoin will eradicate every other cryptocurrencies but can render some of them less effective since many of the altcoins have no focused agenda to being a digital currency, they ended up being trash project befau of thise behind them.Quote from: She shining on April 16, 2023, 06:43:03 AM2. What would happen to alt coins when Bitcoin becomes relatively stable( when it is fully mined and will solve its problem of price volatility)? Will alt coins survive the test of time? Will new alt coins be created later? What would become of the various countries'currencies, especially the Dollar (the global reserve currency) after Bitcoin's general acceptance?Bitcoi will likely be the global reserved currency at last, this may tarry but we can achieve it, some of the altcoins might have vanished away, bitcoin cannot be stable because it is volatile, this will remain always as it is even when the entire blocks had been mined in bitcoin.Quote from: She shining on April 16, 2023, 06:43:03 AM3. If alt  coins survive in the next century what is the reason it would.Some may survive while others may not, but not until then, every other crypto remain centralized except bitcoin, this is another reason enough.Quote from: She shining on April 16, 2023, 06:43:03 AM4. Should alt coins be traded rather than HODL?Your decision lies on that, but remember you're taking a risk that could take away all your investment asset on altcoins anytime.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "michellee",
      "created_time": "April 17, 2023, 04:46:16 PM",
      "body": "Quote from: She shining on April 16, 2023, 06:43:03 AM1. What will happen to alt coins when Bitcoin becomes a legal tender? Will they have a massive growth,or would people sell and jump into  Bitcoin?If bitcoin becomes legal tender, altcoins will experience massive growth but there may be competition between coins for entry into the top altcoins that can grow. And I think some altcoins can also be legal tender with bitcoins.Quote from: She shining on April 16, 2023, 06:43:03 AM2. What would happen to alt coins when Bitcoin becomes relatively stable( when it is fully mined and will solve its problem of price volatility)? Will alt coins survive the test of time? Will new alt coins be created later? What would become of the various countries'currencies, especially the Dollar (the global reserve currency) after Bitcoin's general acceptance?If bitcoin were to stabilize, people would seek to profit from the difference in the buying and selling prices of altcoins and price volatility issues would probably occur for altcoins. Altcoins can survive market price fluctuations. And I guess new coins will be created later to complement the existing ones.Quote from: She shining on April 16, 2023, 06:43:03 AM3. If alt  coins survive in the next century what is the reason it would.The reason is money. Every developer wants to benefit from their project and that's normal.Quote from: She shining on April 16, 2023, 06:43:03 AM4. Should alt coins be traded rather than HODL?For now, altcoins are still traded and also held by some people. You may have heard of people holding altcoins for a long time because they haven't hit their highest price yet or because there is greater potential in the future so people want to hold onto them longer.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jossiel",
      "created_time": "April 17, 2023, 05:45:28 PM",
      "body": "Quote from: She shining on April 16, 2023, 06:43:03 AM1. What will happen to alt coins when Bitcoin becomes a legal tender? Will they have a massive growth,or would people sell and jump into  Bitcoin?Nothing in general. We're just seeing the natural growth for bitcoin and its adoption.Quote from: She shining on April 16, 2023, 06:43:03 AM2. What would happen to alt coins when Bitcoin becomes relatively stable( when it is fully mined and will solve its problem of price volatility)? Will alt coins survive the test of time? Will new alt coins be created later? What would become of the various countries'currencies, especially the Dollar (the global reserve currency) after Bitcoin's general acceptance?Creation of newer altcoins won't be stopped and that is because a developer think that he's better than the others and solving their scalable problems.Quote from: She shining on April 16, 2023, 06:43:03 AM3. If alt  coins survive in the next century what is the reason it would.We will never know, we might be no longer here in this world by that time.Quote from: She shining on April 16, 2023, 06:43:03 AM4. Should alt coins be traded rather than HODL?Yeah, I guess so that most of them should be traded.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}