{
  "id": "topic_5406186",
  "title": "Queentoshi",
  "author": "Queentoshi",
  "created_time": "July 13, 2022, 09:36:30 PM",
  "content": "Its a bit weird to ask, but noticing that at a certain rank here, Forum users are permitted to add pictures to their profile, Has there been any user in the history of forum that has opted to use their personal picture as the image displayed there?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5406186",
  "comments": [
    {
      "author": "Wiwo",
      "created_time": "July 13, 2022, 09:39:54 PM",
      "body": "Quote from: Queentoshi on July 13, 2022, 09:36:30 PMHas there been any user in the history of forum that has opted to use their personal picture as the image displayed there?I don't think members of this forum will opt to use theh picture as an avatar on the forum, as that will expose their identity. Bitcointalk users are Anonymous and we are all known by our user names since we have high respect for privacy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Queentoshi",
      "created_time": "July 13, 2022, 09:55:00 PM",
      "body": "Quote from: Wiwo on July 13, 2022, 09:39:54 PM Bitcointalk users are Anonymous and we are all known by our user names since we have high respect for privacy.But why do we desperately want to remain anonymous here where some of us have public profiles on some other forum or social media platform. Or is there any where on the forum where anonymity is explicitly advised?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pokapoka124",
      "created_time": "July 13, 2022, 10:01:32 PMLast edit: July 13, 2022, 10:14:47 PM by Pokapoka124",
      "body": "Quote from: Queentoshi on July 13, 2022, 09:55:00 PMQuote from: Wiwo on July 13, 2022, 09:39:54 PM Bitcointalk users are Anonymous and we are all known by our user names since we have high respect for privacy.But why do we desperately want to remain anonymous here where some of us have public profiles on some other forum or social media platform. Or is there any where on the forum where anonymity is explicitly advised?It comes with the territory. You're in a Bitcoin forum, get used to it. Bitcoin users value their privacy. It's the same on Reddit and other crypto platforms. The common goal is to share our knowledge on Bitcoin and share our unique experience in the Bitcoin ecosystem. What good will having profile pictures do for the community?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitMaxz",
      "created_time": "July 13, 2022, 10:52:40 PM",
      "body": "I saw someone before using the real him in Avatar I don't remember the name but I remember he is a developer. Quote from: Queentoshi on July 13, 2022, 09:55:00 PMBut why do we desperately want to remain anonymous here where some of us have public profiles on some other forum or social media platform. Or is there any where on the forum where anonymity is explicitly advised?Don't compare this forum to other social media I don't think about the other forum I usually use a different avatar than my own picture as an avatar. Privacy is very important not just here on the forum but also in other forums. That is why we always see a privacy policy when accessing websites because most of people always want privacy.On social media, like Facebook, you have the option to don't upload your real picture and actually, it doesn't require you can use their website or app without uploading or sending personal data. Same here if you value your privacy then don't upload if not then anytime you can upload your real you. However, only full members above can able to wear avatars.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PowerGlove",
      "created_time": "July 13, 2022, 11:24:13 PM",
      "body": "Quote from: BitMaxz on July 13, 2022, 10:52:40 PMI saw someone before using the real him in Avatar I don't remember the name but I remember he is a developer. Maybe you're thinking of Gavin Andresen?Quote from: Queentoshi on July 13, 2022, 09:55:00 PMBut why do we desperately want to remain anonymous here where some of us have public profiles on some other forum or social media platform. Or is there any where on the forum where anonymity is explicitly advised?IMHO, the importance of privacy is underestimated by most people. If you're on the fence about it, this topic (by o_e_l_e_o) is well worth a careful read.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sunsilk",
      "created_time": "July 13, 2022, 11:24:51 PM",
      "body": "Quote from: Queentoshi on July 13, 2022, 09:36:30 PMHas there been any user in the history of forum that has opted to use their personal picture as the image displayed there?I've seen some users that has got pictures that were intended for profile pictures. But I don't know if that's them or just some grabbed photos on the web.This actually isn't a big matter, whether you use your actual picture but since this is a forum. Majority of us are unlikely going to use their real pictures due to privacy concerns.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nakamura12",
      "created_time": "July 13, 2022, 11:38:38 PM",
      "body": "Quote from: Queentoshi on July 13, 2022, 09:36:30 PMIts a bit weird to ask, but noticing that at a certain rank here, Forum users are permitted to add pictures to their profile, Has there been any user in the history of forum that has opted to use their personal picture as the image displayed there?Most people don't want to use their personal pictures to use on their profile which the purpose is to keep their privacy much like being anonymous to people. You can choose to upload your personal pictures as your avatar or you won't. It's up to you to decide if you did that or keeo your privacy. We are not here in this forum to share what we looks likr but to share knowledge and help therefore having personal pictures as your avatar is not necessary/required.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Text",
      "created_time": "July 13, 2022, 11:47:45 PM",
      "body": "I've also seen a user use his real picture here before but I don't know if he's still active. But everyone here on this forum does not use their photo because of privacy. It is better to just remain anonymous because we are in the crypto space. Even in other forums, this is also what I notice.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TelolettOm",
      "created_time": "July 13, 2022, 11:54:06 PM",
      "body": "Quote from: Queentoshi on July 13, 2022, 09:36:30 PMIts a bit weird to ask, but noticing that at a certain rank here, Forum users are permitted to add pictures to their profile, Has there been any user in the history of forum that has opted to use their personal picture as the image displayed there?What profile picture do you mean? A photo of the real user itself or a certain avatar from the certain project?If it is about a photo of the member itself, it will depend on the member itself whether they want to show up their real picture or not. But, in this Bitcoin forum, most people will nto do that. But, if this is about avatar and signature of any project or platform, yes we are here wearig the picture and signature because we are here as participants f Signature campaign.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Darker45",
      "created_time": "July 14, 2022, 05:14:30 AM",
      "body": "There were indeed users who made use of their personal photos as avatars. As mentioned, there was Gavin Andresen. But surely the most prominent of them all was the venerable Hal Finney. Hal also had his own pic as his avatar. There were probably more of them. On a side note, I was quite surprised that while Hal died in 2014 and had his last post here in 2013, his account was last active in 2017. So not only did he not hide his identity here, he probably also shared access to his account here with his family.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dimonstration",
      "created_time": "July 14, 2022, 05:34:13 AM",
      "body": "Quote from: Wiwo on July 13, 2022, 09:39:54 PMQuote from: Queentoshi on July 13, 2022, 09:36:30 PMHas there been any user in the history of forum that has opted to use their personal picture as the image displayed there?I don't think members of this forum will opt to use theh picture as an avatar on the forum, as that will expose their identity. Bitcointalk users are Anonymous and we are all known by our user names since we have high respect for privacy.There’s actually some members in the past that used there own picture for there avatar. Most of them are prominent developers or owner of business that they are promoting here in the forum, One of them is Hal Finney which you can see here: https://bitcointalk.org/index.php?action=profile;u=2436 but there’s still other member that use this forum with there identity reveal.But at the present, No one dares to use there own picture as avatar except for @cabalism31  https://bitcointalk.org/index.php?action=profile;u=1605387",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "July 14, 2022, 06:10:07 AM",
      "body": "Quote from: Queentoshi on July 13, 2022, 09:36:30 PMIts a bit weird to ask, but noticing that at a certain rank here, Forum users are permitted to add pictures to their profile, Has there been any user in the history of forum that has opted to use their personal picture as the image displayed there?Can you share those who uses their profile for their accounts. I doubt they are sharing this cause this isnt a social site where we can display photos like that for sharing. Maybe if they did then they doesnt care at all at their personal profile being exposed which isnt bad but of course we are avoiding those toj be used by scammers. Its not prohibited but not advise to do in my opinion.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "qwk",
      "created_time": "July 14, 2022, 06:22:16 AM",
      "body": "Yes, I am really a tiny roaring kitten.In fact, I know two users who used their real photos as an avatar here, but both have been absent from the forum for a few years now.No, I won't tell who they are/were.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FatFork",
      "created_time": "July 14, 2022, 11:23:06 AM",
      "body": "Quote from: Queentoshi on July 13, 2022, 09:55:00 PMQuote from: Wiwo on July 13, 2022, 09:39:54 PM Bitcointalk users are Anonymous and we are all known by our user names since we have high respect for privacy.But why do we desperately want to remain anonymous here where some of us have public profiles on some other forum or social media platform. Or is there any where on the forum where anonymity is explicitly advised?It's an individual thing. Everyone has the right to their privacy and anonymity here, but it doesn't mean they're hiding anything. It is up to each of us to decide whether we will reveal our real identities or not. The people who care a lot about their privacy will probably still keep their identities private, but those who are more comfortable with the exposure of their identities can choose whether to reveal that or not.A personal photo doesn't seem to be of any advantage on a forum profile since this isn't a dating site. Besides, no one should judge a person by their appearance.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "xSkylarx",
      "created_time": "July 14, 2022, 11:49:43 AM",
      "body": "Just like reddit, bitcointalk is a forum and usually people on forum websites wants to remain anonymous even if they use social media platforms. There is no rule pertaining that you should use a real person's picture on your account and no one will also stop you if you want to use it. It's dangerous to reveal your identity here because sometimes the topics shows what's your financial status in real life.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "notocactus",
      "created_time": "July 14, 2022, 01:22:12 PM",
      "body": "If you don't want to be doxed, let's avoid uploading your personal photos on this forum or on any site when you're using Internet.You can not erase it completely as that site has data backup as well as many scrapper and archives can work and catch your photo. In this forum, it's hard to see people using their real identity, real personal photos. I don't know anyone uses personal photo here but of course, the forum has about 3.5 million users and I can miss some cases.Anyway, it is not recommendable to upload personal photo for your user avatar. Many drama about doxing attacks.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "abel1337",
      "created_time": "July 14, 2022, 01:42:43 PM",
      "body": "Quote from: Queentoshi on July 13, 2022, 09:36:30 PMIts a bit weird to ask, but noticing that at a certain rank here, Forum users are permitted to add pictures to their profile, Has there been any user in the history of forum that has opted to use their personal picture as the image displayed there?There are some who choose to post their real identity here for their own reasons and others who we don't know if their profile picture is their real picture.  We are on this forum, It would be nice to take advantage of the anonymity that the forum provides. Most of us here remain anonymous, Even reputed and most trusted members here doesn't reveal themselves because I think there could be a problems in the future just like what happened on other people who doxed themselves on their own projects. I've seen threats over doxed crypto project owners just because of their projects downfall that is being affected by the current market scenarios.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "YOSHIE",
      "created_time": "July 14, 2022, 01:51:31 PM",
      "body": "Quote from: Queentoshi on July 13, 2022, 09:55:00 PMBut why do we desperately want to remain anonymous here where some of us have public profiles on some other forum or social media platform. Or is there any where on the forum where anonymity is explicitly advised?You don't have to worry about the forums being 'anonymous'. You only see photos of women and men on their account profiles, they remain anonymous, their identity remains hidden even though technically what you see is a private photo, who knows, many pictures you can find on the internet belong to other people.For example you, your account name is named: @Queentoshi, I can guarantee anyone who goes to your country and looks for Queentoshi no one knows, even if you post a photo that looks real (human), it's the same with those you see, even though they put up real photos that you see, they certainly can't be tracked.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "aysg76",
      "created_time": "July 14, 2022, 02:22:54 PM",
      "body": "Quote from: Queentoshi on July 13, 2022, 09:36:30 PMIts a bit weird to ask, but noticing that at a certain rank here, Forum users are permitted to add pictures to their profile, Has there been any user in the history of forum that has opted to use their personal picture as the image displayed there?Don't remember if someone has used his real image as profile or better call it Avatar on the forum as many prefer to remain anonymous but like if you have joined some signature campaign then there is rule that you have to wear signature as well as Avatar while campaign like CM allows you to have custom one so you can opt of your choice but don't think so that anyone would be using his real identity.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}