{
  "id": "topic_5417741",
  "title": "bitfex.trade",
  "author": "bitfex.trade",
  "created_time": "October 20, 2022, 09:19:05 AMLast edit: October 20, 2022, 12:06:11 PM by bitfex.trade",
  "content": "Hello,We have a special offer of listing at our crypto exchange https://BitFex.trade (no KYC) for only $2k fee. We will withdraw payment after listing will be completed. Listing will take 3 days.Advantages of listing at our crypto exchange:- No KYC- No security deposit- No minimal trading volume- Secure payment of listing fee - you don't sent a payment to a unknown wallet, but simply make a deposit to the crypto exchange in amount of listing fee- We will get listing fee only after its completion- We can use faucet to make airdrop of your token to your community- After listing we will notify our traders and investors about your token, and post info at all our advertising channels and twitter, that will increase the popularity of your coin and attract new traders and investors (at our crypto exchange more than 10k registered traders)- We give you account without trading fee for 2 months.- Friendly and responsive support service in Russian, English and Chinese.We will be happy to start our cooperation. Contact us in Telegram: @bitfex",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5417741",
  "comments": [
    {
      "author": "Crypt0Gore",
      "created_time": "October 20, 2022, 10:46:21 AM",
      "body": "This is a brand new exchange because I've not heard of that name before but your listing charges shows how bad this exchange is, 2k for listing a project is shitcoin developers dream, Azbit and P2pb2b that are king of shit exchanges charges even more.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MAAManda",
      "created_time": "October 20, 2022, 11:24:52 AM",
      "body": "Sorry in advance OP, if I might make offensive words. But after seeing your website, are you sure there will be projects that want to register their projects on your website? The UI on your website is very old looking, it's 2022 now, not 2014 which is where we saw ForkDelta back then. Hopefully this will be an input for you to do better in the future.About the type of your post, it seems irrelevant if you post it here, on this board we only discuss about Altcoins, not posting a service offer. It would be better if you move your post to the services board, which is where we usually post stuff like this.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fortunecrypto",
      "created_time": "October 20, 2022, 12:00:57 PM",
      "body": "I don't think it is worth listing to this exchange what will a coin gets on this exchange when its volume is untracked, its not popular even though this exchange is already up for 4 years, only shitcoin will list on this exchange, they claimed to have 10k traders, many people will doubt if these are real human, a good coin/token will rather trade their token on a much better exchange not on this one.https://coinmarketcap.com/exchanges/bitfex/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitfex.trade",
      "created_time": "October 20, 2022, 12:09:42 PM",
      "body": "Quote from: Crypt0Gore on October 20, 2022, 10:46:21 AMThis is a brand new exchange because I've not heard of that name before but your listing charges shows how bad this exchange is, 2k for listing a project is shitcoin developers dream, Azbit and P2pb2b that are king of shit exchanges charges even more. We don't have such large trading volumes to take for listing $500k. We are working since 2018.This is our channel, you can check it: https://bitcointalk.org/index.php?topic=4452719.0",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitfex.trade",
      "created_time": "October 20, 2022, 12:16:24 PM",
      "body": "Quote from: fortunecrypto on October 20, 2022, 12:00:57 PMI don't think it is worth listing to this exchange what will a coin gets on this exchange when its volume is untracked, its not popular even though this exchange is already up for 4 years, only shitcoin will list on this exchange, they claimed to have 10k traders, many people will doubt if these are real human, a good coin/token will rather trade their token on a much better exchange not on this one.https://coinmarketcap.com/exchanges/bitfex/In reason that our crypto exchange don't have list on CMC, listing fee is so low. It's may give chance to new coins that don't have enough money to list on major exchanges.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ryzaadit",
      "created_time": "October 20, 2022, 12:37:58 PM",
      "body": "Quote from: bitfex.trade on October 20, 2022, 12:16:24 PMIt's may give chance to new coins that don't have enough money to list on major exchanges.Decentralized Exchange is not a problem.If the project can't survive or have a good volume on a decentralized exchange, then how are they're gonna survive on your exchange with a low volume trading + member. I don't think they are not gonna survive either on your exchange.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JustEducated",
      "created_time": "October 20, 2022, 12:38:36 PM",
      "body": "Quote from: bitfex.trade on October 20, 2022, 09:19:05 AM<~snipped~>Op, it seems as if you're offering a service.I believe this isn't the right board for that, I don't know if it's allowed or not but I would suggest you move this thread to the service board so as to avoid any issue.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitfex.trade",
      "created_time": "October 20, 2022, 12:51:49 PM",
      "body": "Quote from: ryzaadit on October 20, 2022, 12:37:58 PMIf the project can't survive or have a good volume on a decentralized exchange, then how are they're gonna survive on your exchange with a low volume trading + member. I don't think they are not gonna survive either on your exchange.They can invest saved money at marketing their token and attract traders.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitfex.trade",
      "created_time": "October 20, 2022, 12:58:30 PM",
      "body": "Quote from: JustEducated on October 20, 2022, 12:38:36 PMOp, it seems as if you're offering a service.I believe this isn't the right board for that, I don't know if it's allowed or not but I would suggest you move this thread to the service board so as to avoid any issue. This topic read many altcoin owners and we think, that it's important for them to know where they can list token cheaply, without overpayments.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rhomelmabini",
      "created_time": "October 20, 2022, 01:24:43 PM",
      "body": "Quote from: bitfex.trade on October 20, 2022, 12:58:30 PMQuote from: JustEducated on October 20, 2022, 12:38:36 PMOp, it seems as if you're offering a service.I believe this isn't the right board for that, I don't know if it's allowed or not but I would suggest you move this thread to the service board so as to avoid any issue. This topic read many altcoin owners and we think, that it's important for them to know where they can list token cheaply, without overpayments.Yes, but there are people that may find your thread anyways if you post it on the right board. If it's about exchange then you should put it on Exchanges board here: https://bitcointalk.org/index.php?board=223.0, don't worry if you don't know how to move a thread, I'll report it on moderators anyway.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitfex.trade",
      "created_time": "October 20, 2022, 02:48:09 PM",
      "body": "Quote from: rhomelmabini on October 20, 2022, 01:24:43 PMYes, but there are people that may find your thread anyways if you post it on the right board. If it's about exchange then you should put it on Exchanges board here: https://bitcointalk.org/index.php?board=223.0, don't worry if you don't know how to move a thread, I'll report it on moderators anyway.You are right, I don't know how to move the thread. Let's moderators decided where discussion should go",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}