{
  "id": "topic_5401631",
  "title": "Flexystar",
  "author": "Flexystar",
  "created_time": "June 07, 2022, 03:54:50 AM",
  "content": "Since few weeks we are constantly hearing about the news regarding NY and its mining ban agenda. However, lately Blockchain association has portrayed their thoughts on how negatively this will affect the NY which is technological state and web3 capital. Blockchain association mentions bitcoin mining and it's carbon emission are far fetched topic and there is literally trace proof that if bitcoin mining is stopped then it will impact lesser carbon emission. They added, this will only put NY in bad corner because miners will simply move towards the next state where they have favourable rules and regulations in association with mining and usage of electrical energy. This does sound favourable to miners but it's up to mayors and Juri's on how to act and take the future actions. QuoteIn the wake of the New York State Senate passing a bill that imposes a two-year moratorium on any new carbon-based fuel-powered proof-of-work (PoW) cryptocurrency mining projects in the U.S. state, the ban has received a great deal of criticism from all over the industry.One of the sources of criticism is from the Blockchain Association, whose Executive Vice President Jake Chervinsky listed and explained in detail all the disadvantages of the passed bill for the crypto industry and economy in the state of New York in a Twitter thread published on June 5.The Blockchain Association is a Washington-based trade association representing companies and other organizations in the crypto industry with a mission to change the public policy toward crypto in the U.S.Indeed, the first argument that Chervinsky presented was that, despite what “the anti-Bitcoin wing of the NY political establishment” claims, the mining ban “will not help reduce carbon emissions by a single ounce.” He added, “at best, it has zero impact on emissions.”Pushing miners elsewhereAs a matter of fact, according to the Blockchain Association EVP, the mining ban will have a net negative effect, as:“All it does is push miners to build in other places where NY has no influence over them.”In his words, miners will simply move to other places outside the state with fewer or no environmental regulations.According to Chervinsky, the banning policy is dishonest and lacks detailed analysis:“Good policy requires reality-based thinking: honest analysis of costs & benefits, of opportunities & risks, of first- & second-order effects. The NY mining ban does none of that. It’s a moral victory for a few, detached from reality.”However, he doesn’t lose hope, saying that “NY had (& still has) a chance to lead the way on crypto broadly & Bitcoin mining specifically,” explaining that incentives are more productive than bans:“Good policy here would mean both carrots & sticks: at minimum, an incentive for miners to shift toward renewables is an easy win.”He also called upon Governor Kathy Hochul to veto the bill “for the sake of New York” and “at a time when keeping crypto in the US is a matter of national importance.”Finally, Chervinsky urges the state of California to learn from New York’s mistakes if it wishes to remain the technology capital of the world and the home of Web3 – at a time when it “is starting to analyze these issues under the process established by Gavin Newsom’s executive order.”Source: Blockchain Association argues New York mining ban won’t ‘reduce carbon emissions’",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5401631",
  "comments": [
    {
      "author": "pooya87",
      "created_time": "June 07, 2022, 05:00:48 AM",
      "body": "Are there really bitcoin miners operating in New York? Because from what I gathered the electricity cost in NY is very expensive and is already about 4 times higher than the average electricity price that most miners use to make their efforts profitable.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "davis196",
      "created_time": "June 07, 2022, 05:58:10 AM",
      "body": "This so called \"mining ban\" isn't a real mining ban. It's more like setting up double standards for the different kinds of businesses.AFAIK, this is a regulation, that forbids the crypto miners to use electricity, that is produced via burning coal. The cryptocurrency miners in the state of New York are allowed to mine crypto, as long as the electricity they are using is \"green\". This isn't fair, because many industries aren't required by the law to use green energy. I'm \"still waiting for the New York administration to say this to the \"brick and mortar\" businesses-\"Use green energy or we will shut you down.\" Let's see what happens then. Protests all over the state. Unfortunately, the crypto miners cannot protect themselves from this unfair treatment. The only way for them to protest is to run away from NY and go somewhere else.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "June 07, 2022, 07:08:17 AM",
      "body": "what you will see is that it creates a monopoly.small hobby miners wanting to set up residentially using random power from random power generation plants(residential circuit of national grid) wont be able to. and most hobby miners wont want to move to locations of 100% renewable.also the electric cost in NY is not the best unless you are on \"industrial\" rate contracts. so this is pretty much ruling out any small farms mining in NYhowever larger industrial mining farms if positioned right and using the right lobbying could get a licence. ..this is said because NY done this before.. outlawed bitcoin exchanging and then offered a licence to allow exchanging a short time later.(research: bit licence)in many countries if something is free to do with no laws, you cant just throw a licence requirement at it. you first have to prohibit it, to then bring it into your jurisdiction to then put terms of use on it where you will permit use of it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pmalek",
      "created_time": "June 07, 2022, 08:35:14 AM",
      "body": "I don't think this is just a matter of reallocating your mining company and setting up shop in a different state. If it comes to the point where the state of New York bans the mining of Bitcoin, I am afraid it will create a chain reaction where other states will follow. I don't even want to think about the consequences and what could happen if the majority of US states ban Bitcoin mining in a few years from now.It's sad that the focus is always on outright bans. Why not incentivize the mining industry to use affordable and clean energy instead? It's a rhetorical question because the problem is not in Bitcoin miners using fossil fuels, the problem is Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NeuroticFish",
      "created_time": "June 07, 2022, 08:44:45 AM",
      "body": "Quote from: davis196 on June 07, 2022, 05:58:10 AMThis so called \"mining ban\" isn't a real mining ban. It's more like setting up double standards for the different kinds of businesses.Exactly. With NY state being \"the largest producer of hydroelectric power east of the Rocky Mountains\" one would expect the NY miners use cleaner electricity than many others. So I really don't know what basis that (ugly) political decision has...Oh well, the miners will easily find other, more friendly places, although it'll cost them the relocation and the time they won't be hashing...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oshosondy",
      "created_time": "June 07, 2022, 08:56:00 AM",
      "body": "Quote from: NeuroticFish on June 07, 2022, 08:44:45 AMQuote from: davis196 on June 07, 2022, 05:58:10 AMThis so called \"mining ban\" isn't a real mining ban. It's more like setting up double standards for the different kinds of businesses.Exactly. With NY state being \"the largest producer of hydroelectric power east of the Rocky Mountains\" one would expect the NY miners use cleaner electricity than many others. So I really don't know what basis that (ugly) political decision has...Oh well, the miners will easily find other, more friendly places, although it'll cost them the relocation and the time they won't be hashing...That is true, hydroelectric power plants are renewable and of green energy, but we all know that politicians in New York do not like PoW, they are showing that. With what I read, it only remain just the governor of NY to sign. What I know now is that bitcoin miners are going more to use green energy even if bitcoin mining is banned in NY, also that miners in NY will find other suitable place to mine. I believe all states in US will not stop PoW mining which is the fear we have now, for other states not to follow NY.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Flexystar",
      "created_time": "June 07, 2022, 09:19:32 AM",
      "body": "Quote from: Pmalek on June 07, 2022, 08:35:14 AMI don't think this is just a matter of reallocating your mining company and setting up shop in a different state. If it comes to the point where the state of New York bans the mining of Bitcoin, I am afraid it will create a chain reaction where other states will follow. I don't even want to think about the consequences and what could happen if the majority of US states ban Bitcoin mining in a few years from now.It's sad that the focus is always on outright bans. Why not incentivize the mining industry to use affordable and clean energy instead? It's a rhetorical question because the problem is not in Bitcoin miners using fossil fuels, the problem is Bitcoin.  Ah that is good point. Though in rhetorical sense I believe it’s perfectly asked since bitcoin miners would do it way happily. We have already seen examples of how big mining corporations had their set up in country like Greenland with hydropower as main source of energy. Both Geo location and greener energy is being used and the companies are really really mega. The income definitely profitable for company and hydropower unit after they get the bills paid. In other words this only sounds like dirty politics where NY do not want miners in the vicinity at all.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ninis45",
      "created_time": "June 07, 2022, 11:31:01 AM",
      "body": "several times I found about posting a bitcoin mining ban in several countries on the grounds of an energy crisis and not being environmentally friendly, this is because bitcoin has a very rapid value and growth of course if not: maybe this will never happen, but we also can't close keep an eye on the fact by throwing the leftover pizza in the trash because bitcoin mining will also be a disaster in the future if it is not accompanied by cleaner and environmentally friendly methods to utilize environmentally friendly energy, it must be accompanied by the role of the government indirectly providing easy access to obtain all their needs and not excluding bitcoin as a contributor to global warming because many sources of electrical energy are also being drained by the industry which needs to also be looked at and reviewed by the government",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kryptqnick",
      "created_time": "June 07, 2022, 11:52:05 AM",
      "body": "It's a good point the Association makes that the ban will motivate miners to move to another state with better regulations (although the notes in the thread about expensive NY electricity and hydroelectric power deserve attention as well). Also, if they care about the ecology, why the moratorium is not on any new carbon-based businesses in general? How is it fair that carbon emmissions are free to grow and businesses are free to profit, as long as it's not crypto mining? This is the first thing that comes to my mind when hearing about such restrictive legislation, and yet it doesn't seem that this argument is used much. Why not?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dunamisx",
      "created_time": "June 07, 2022, 01:04:13 PM",
      "body": "Quote from: Flexystar on June 07, 2022, 03:54:50 AMSince few weeks we are constantly hearing about the news regarding NY and its mining ban agenda. However, lately Blockchain association has portrayed their thoughts on how negatively this will affect the NY which is technological state and web3 capital.i think this threat on bitcoin mining ban is overwhelming enough to reach a stop, there have been circulations all over that bitcoin mining pose a danger to the electric power supply rate and it carbon emission but what they needed to understand in New York is that even this was ban it cannot affect the global hashrate of bitcoin mining on a tangible reason because NY isn't the only center for such but will only make move to relocate all miners from the region to a more greener pastures just as in the case of China at worst.Quote from: Flexystar on June 07, 2022, 03:54:50 AMthere is literally trace proof that if bitcoin mining is stopped then it will impact lesser carbon emission.i think there's a distinct difference between the effect and the rate of the carbon emission from bitcoin mining and natural resources mining which we all believed to be clear enough to see, i think there's much in demand than ordinary what is been porported.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "June 07, 2022, 01:16:40 PM",
      "body": "many asic manufacturers are no longer building asics and putting them into cardboard boxes and then into shipping containers, to deliver out where the workers at the mining farm warehouse have to take delivery, open the container, pull out all the boxes, unbox them, unwrap the bubblewrap and polystyrene and then plug them in one by one.. trying to not trip over the cablinginstead.. asic manufacturers build the asics and power units and have them racked up and cabled into the shipping container(alreadt fitted and cabled ready). where all the workers at the delivery destination have to do is connect a master circuit electric cable to the shipping container power circuit unit , and hey presto. its mining. right from within the shipping container.this advantage saves a days worth of labour and also makes it easy to re-locate at a moments notice if needs be. just unplug the shipping container and lift it back onto a low bed truck and off it goes. its becoming easier to set up and relocate these days. so location is not a problem(unlike businesses like amazon warehouses where it would take weeks to take boxes off shelves and put all the stock into trucks in one go.)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "June 07, 2022, 01:30:22 PM",
      "body": "Quote from: Pmalek on June 07, 2022, 08:35:14 AMI don't think this is just a matter of reallocating your mining company and setting up shop in a different state. If it comes to the point where the state of New York bans the mining of Bitcoin, I am afraid it will create a chain reaction where other states will follow. I don't even want to think about the consequences and what could happen if the majority of US states ban Bitcoin mining in a few years from now.I think that NY is in some ways a specific part of the US when it comes to Bitcoin, so it is possible that we should not be afraid that other states will follow their example. If Texas benefits from crypto mining, it certainly won't give up because some NY bureaucrats don't have a smarter job than making up laws that don't make much sense.I would answer this second question with a counter-question - is it better for the US to become dominant in Bitcoin mining or for some (or most) federal states to ban it?Quote from: Pmalek on June 07, 2022, 08:35:14 AMIt's sad that the focus is always on outright bans. Why not incentivize the mining industry to use affordable and clean energy instead? It's a rhetorical question because the problem is not in Bitcoin miners using fossil fuels, the problem is Bitcoin.  That's right, even if Bitcoin would use 100% clean energy, opponents would find a new excuse to try to undermine it. We can already choose between agendas about Bitcoin as a way to launder money, crime of all kinds, creating waste in the form of electronic equipment, generating online scams ...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pmalek",
      "created_time": "June 07, 2022, 01:51:58 PM",
      "body": "Quote from: Lucius on June 07, 2022, 01:30:22 PMI would answer this second question with a counter-question - is it better for the US to become dominant in Bitcoin mining or for some (or most) federal states to ban it? It seems to me like you want me to say that it's better for some most states to ban it, but the answer is not that simple. I would prefer that no country dominates the mining business and that the biggest players are scattered all over the world. But I would rather have the US dominate Bitcoin mining than most of the states banning it. I want to highlight the \"most\" part. If it becomes just NY and a few others, so be it. But if it's most of the US, it's a different situation.Whether someone likes it or not, the USA is a big player in almost everything you can think of. If they decide to do something that extreme, many of the world's US ass-kissing nations will want to prove themselves and remain on the same page as the USA.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Haunebu",
      "created_time": "June 07, 2022, 02:06:17 PM",
      "body": "Nothing surprising considering the fact that NY has always been anti-crypto from a long time now. Exchanges need to purchase a specific license to actually operate in that state which is why crypto investors usually hate their government.Their mining ban would most probably not cause a dent in the cryptocurrency market if you ask me. Miners could just relocate to other places as some of the posters above mentioned.Personally, I would focus on mining in less popular states in the US for obvious reasons.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "June 07, 2022, 05:24:33 PM",
      "body": "people worry that america will do a full ban in all states..my opinion is thisNY will temp ban mining so they can then offer a monopoly on licences..TX will be open to mining. FL & CA will be open to utility of btci say this because NY is the monopoly capital of capitalism. they don't like little people competing with the financial elite.TX is the liberal state that likes to support open business competition. they love their farming and their mining so they will happily invite another (virtual) farming/mining industryFL & CA are open minded but more about the service/tourist industry. so they would be more about offering services both real world retail store business utility and also technology services like software services",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "d5000",
      "created_time": "June 07, 2022, 06:16:58 PM",
      "body": "Quote from: davis196 on June 07, 2022, 05:58:10 AMThe cryptocurrency miners in the state of New York are allowed to mine crypto, as long as the electricity they are using is \"green\". This isn't fair, because many industries aren't required by the law to use green energy. It may not be fair, but I continue to think it's a great chance for the mining industry to reinvent itself to the point the whole CO2 argument becomes obsolete.The problem is the mindset that Bitcoin is something \"useless\" which is only \"used for speculation\" by \"greedy\" hodlers. This mindset is of course unfair. But a significant part of the population thinks that. (In reality, it's more the shitcoin* community - see the \"lunatics\" led by Do Kwon, only to illustrate the weirdness of a \"decentralized\" business with \"godlike leaders\" -  which is leading to that mindset.)But once miners demonstrate that they can do their business with green energy (like a lot of NY miners are already doing - those using hydropower 100% should already be compliant with the new law!), this mindset will hopefully begin to erode. On the other hand, if significant parts of the Bitcoin community stay stubborn about their desire to use the cheapest, dirtiest energy for mining, it will take longer.Quote from: Pmalek on June 07, 2022, 08:35:14 AMI don't think this is just a matter of reallocating your mining company and setting up shop in a different state. If it comes to the point where the state of New York bans the mining of Bitcoin, I am afraid it will create a chain reaction where other states will follow.First, again, it isn't an outright ban. It's a ban on mining with fossil fuel-based energy. I think to have read it only applies to industrial-scale mining, but I may be wrong with that.The \"chain reaction\" phenomenon however may become true indeed, but again, I think this is not a bad thing. If increasingly more US states (and later, other countries) restrict fossil fuel-based mining then the cost for miners to be compliant - using \"green\" energy - will be lower compared to the cost and risk to try to find a state to relocate to, where they could be sure to not be banned to use fossil fuels for a long time.Even Russia, which has currently no shortage of fossil fuels, is considering restrictions for miners. So the current \"find the cheapest energy, even if it's the dirtiest\" business model will come to an end.*as \"shitcoin\" I don't classify all altcoins, but those that are not solving real problems, are centralized and characterized by this toxic \"pump and dump\" mentality",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "June 07, 2022, 07:11:03 PM",
      "body": "each state of the US. and each country have different plans for transitioning to renewables.by assessing the strategy of transitioning to renewable. you can probably gauge if a state is going to be new industry friendly or not.. imagine that 4 regions are initially fossil based powered with say 100GW capacity and 70GW local demand each right now. (random numbers i plucked out of my head for easy demo)1st region may assess that the renewable production requires a new plant capacity of 200GW for future proofing population growth,where by as soon as the facility is built. they can just switch off the fossil fuel plant the same day. and be 100% renewable. with 130GW spare to offer as excess for new industry to buy up on day one, instead of 30GW excess2nd region may build the same as 1. but instead of switching off the fossil fuel plants, they start offering renewable excess on the grid market to neighbouring regions along side fossil fuel excess. and slowly reduce the fossil fuel amount over years when they start offering certain utility companies in the area x% where by less demand is there for the fossil contracts.(some states enjoy keeping coal miners employed so wont want to see a mass exodus of the coal/oil mining industry instantly)whereby they can have 230GW excess to sell on the markets initially by keeping fossil plants running. meaning alot of potential profit aswell as keeping coal miners employed3rd region, may want to keep initial build costs low. and so only build a 100GW renewable plant. whereby it keeps the capacity to 100GW by switching off fossil fuel to 0GW on first day of operation, (1:1 swap, no future plan) meaning 70GW demand with only 30GW spare, which they dont want to offer out as excess. but are now 0% carbon4th region, same as 3 (100GW) whereby at the moment of operating it, they can reduce the fossil fuel to say 35GW fossil fuel(50% carbon/carbon free), meaning if needed.. upto 65GW fossil fuel excess plus 65GW renewable excess. (changes capacity from 100GW to 200GW meaning excess of upto 130GW if needed which they can offer out as excess contracts. and slowly bring the fossil fuel number down further if not needed.  to only be 100GW (if they dont expand more plants over the generations)each plan has different merits..EG difference between 3 and 4 is that. 3 transitions to 0% carbon on first day, but it is not planning for the future nor is it netting any extra income to then re-invest for the future. where as 4 is not instantly 0% carbon but is on a budget and gaining extra income while then able to slowly build-out extra capacity over the generations to become both 0% carbon and also future capable, on a budget.i say this because with these different plans. requires then allowing or not allowing new industry to take on the excess.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "June 07, 2022, 07:15:14 PM",
      "body": "Quote“All it does is push miners to build in other places where NY has no influence over them.”In his words, miners will simply move to other places outside the state with fewer or no environmental regulations.Lol at the drama queen!Let me ask you one thing if the Bitcoin mining council was claiming that they mine with green energy and if everyone claims that green energy is cheaper than fossil, why would those miners move at all from NY?Unwillingly the guy admitted the truth, miners don't give a damn if that's green or black or red or nuclear or coal or wind energy, what they care is about the cost, everyone fails to see how blatantly he admitted miners will flee to countries that don't give a damn about environmental regulations, just lol!All this while everyone is saying how mining gets greener every day!If everything is like that, what's the problem, nobody is going to force you out!The problem is at Greenidge that uses gas, Massena smelter that burns coal and many more. Quote from: NeuroticFish on June 07, 2022, 08:44:45 AMExactly. With NY state being \"the largest producer of hydroelectric power east of the Rocky Mountains\" one would expect the NY miners use cleaner electricity than many others. Now when you get hydro at 6 cents and coal at 2 cents per kWh!This is what everything boils down to.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "June 07, 2022, 07:26:14 PM",
      "body": "Quote from: stompix on June 07, 2022, 07:15:14 PMNow when you get hydro at 6 cents and coal at 2 cents per kWh!This is what everything boils down to.its not as simple as one source is X and another source is Y depending on how its created. its also how much spare capacity they have to offer out to new industry.EGif one region only has 30GW excess spare and has a regulatory cap-limit of say 12cent as the max they can sell at. they sure as hell are going to sell it at 12cent as they can only earn a max of $3.6m an hour if sold at top amountwhere as if they had 230GW excess they can sell for 3cents and still get $6.9m (more then first example)while offering cheap electric(or any number between, depending on greed of the company(upto $27.6m if at top cap limit price))",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}