{
  "id": "topic_5436803",
  "title": "aidoyoh",
  "author": "aidoyoh",
  "created_time": "January 25, 2023, 11:17:50 PMLast edit: January 26, 2023, 12:36:18 AM by aidoyoh",
  "content": "Focusing on living systems such as mycelium and the stock market for reference, I have been working on a new approach to decentralized consensus(not based in Proof-of-Work, Proof-of-Stake, cryptographic randomness). I am building an equal opportunity protocol that mimics adaptive mechanisms found in mycelium and throughout nature. Instead of utilizing a node selection function (POW and POS) all proposals are evaluated using an algorithm that quantifies current network participation and propagates the most ideal/efficient proposal for the next network state. The network becomes marginally slower at scale with higher use, however, if nodes are comfortable utilizing additional sockets this can be mitigated. Initial distribution will be distributed broadly based on Satoshi's original vision with true decentralized value exchange being an integral piece of a free digital market. Current digital currencies not only fail at scale but also when it comes to inherently encouraging network use. Current consensus methods are partial solutions that will not scale favorably for maintaining freedom how they are currently designed. With a global recession and economic collapse pending, the coming years are essential for implementing a true decentralized solution. It is imperative this system is launched in a broadly decentralized fashion so the network can maintain functional fairness and accessibility at scale and long term. For this reason I am looking to build a founding network of people who are interested in dividing the founding ownership of something that I believe will become fundamental in building a free and sustainable digital economy. Anyone that believes they may have something to bring to the founding network or knows of someone who might please message me. Also, if you have recommendations on what you believe is the best way to launch a decentralized protocol please also feel free to message. In the coming weeks I will be publicizing the white-paper followed by the protocol documentation and reference client. I will be developing and releasing all of these on my own accord at which point the network/protocol will become community run. When the white-paper is made public I can post a link on this thread for anyone else that is interested.In the meantime I am willing to answer general questions about the protocol and what it aims to accomplish as well as any others you may have anytime. Please message me if you are interested or have any questions.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5436803",
  "comments": [
    {
      "author": "vv181",
      "created_time": "January 26, 2023, 05:45:50 AM",
      "body": "If I understand it correctly, the node requires knowing the state of the current network participation/users in order to calculate the algorithm accordingly and then propagate the consensus to all other networks. When the network participation became massive, how much resources that the node need to handle? Can they also scale accordingly?As have you also noticed, it is impractical solution. The pave to decentralization should be designed before its inception. That is not the thing that should or could grow as the software protocol progresses. Thus, I doubt decentralization could getting in the way, where in fact, the root or the essence of the design itself can't afford decentralization.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "aidoyoh",
      "created_time": "January 26, 2023, 06:01:23 AM",
      "body": "each node is only responsible for the load of its neighbouring nodes so as the network scales, proposal processing load remains consistent on a per node basis. The time it takes for a proposal to propagate and be confirmed will be longer with larger networks, however, increasing the number of connections each node is required to have allows speeds to remain low.   Imagine a diagram that shows how force is distributed through the particles of an object. The forces travels through neighbouring particles and force transmission rate will increase based on the number of neighbouring particles. Ie. force travels faster through a solid than a liquid",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}