{
  "id": "topic_5431369",
  "title": "maxpaynen",
  "author": "maxpaynen",
  "created_time": "December 25, 2022, 12:26:25 PM",
  "content": "Bitcoin (BTC), 2022 yılı düşüşle kapatmaya hazırlanıyor. Yıl boyunca olumsuz bir grafik sergileyen lider kripto para birimi ve piyasa için tahminler ise gelmeye devam ediyor. Son olarak veteran yatırımcı Bobby Lee boğaz sezonu tahminini açıkladı.Lee, CNBC’de katıldığı bir programda, ayı piyasasının iki yıl daha sürmesini beklediğini söyledi.Ünlü isme göre Bitcoin boğa sezonu 2024 sonu veya 2025 yılının başında başlayacak:Quote“Piyasa için önümüzdeki yılın oldukça kötü olacağını düşünüyorum. Bir veya 2 yıl ayı olmayacak devam edecektir. 2024 sonu veya 2025 başında yükselişin başlayacağını düşünüyorum.”Kaynak:BeInCrypto TR",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5431369",
  "comments": [
    {
      "author": "Pierre 2",
      "created_time": "December 30, 2022, 06:08:00 AM",
      "body": "Halving e yaklaşık 1 artı çeyrek yıl var. Bu mantıkla bütün halving periyodunu ayıda geçirmemiz gerekiyor. Ben kesinlikle böyle bir şey olacağına inanmıyorum. Halving dönemi mutlaka kendi boğasını tetikler. Bu cılız olur ya da güçlü olur bu konuda kesin konuşamayız. Ama mutlaka bir boğa sezonu göreceğiz. Bu yüzden bu abinin yanılacağına %100 (99 bile değil) eminim. Acaba halving ten haberi var mı?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LGD2Business",
      "created_time": "January 02, 2023, 09:45:36 PM",
      "body": "Tarihte en az bir sene sapma var gibi geldi bana da. Neler olacağını önceden bilemeyiz tabi ama geçmiş olaylara bakarak tahmin edebiliriz. Arthur Hayes'in tahmini tutmaya daha yakın görünüyor. Önümüzdeki iki sene neler olacağını göreceğiz en iyisi şimdiden biriktirmeye başlamak. Tam tarihi kestireyim derken cepte coinsiz kalırsanız kötü.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "flipme",
      "created_time": "March 03, 2023, 09:14:23 PM",
      "body": "Quote from: Pierre 2 on December 30, 2022, 06:08:00 AMHalving e yaklaşık 1 artı çeyrek yıl var. Bu mantıkla bütün halving periyodunu ayıda geçirmemiz gerekiyor. Ben kesinlikle böyle bir şey olacağına inanmıyorum. Halving dönemi mutlaka kendi boğasını tetikler. Bu cılız olur ya da güçlü olur bu konuda kesin konuşamayız. Ama mutlaka bir boğa sezonu göreceğiz. Bu yüzden bu abinin yanılacağına %100 (99 bile değil) eminim. Acaba halving ten haberi var mı?2024 mart veya haziran olarak tahmin ediliyor halving. Bobby Lee'nin tahmini halving ile çok uyumsuz değil aslında. Ben borsalarda her zaman ters köşelere inanan bir insanım. Halving önemli bir gelişme olsa da yeterli ilgiyi görmeyebilir. Bence bütün beklentileri halvinge koşullamak doğru neticeler vermeyebilir. Bitcoin global piyasalardan bağımsız hareket edebilen bir yatırım aracı değil. Klasik döngülere sahip ama en basitinden Amerikan borsalarından tamamen bağımsız bir enstrüman değil. Birkaç yıldır olağanüstü olaylar yaşadık. Salgın ve savaş gibi belirlenemeyecek bir şey her şeyi yine mahvedebilir endişesine sahibim.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "trendcoin",
      "created_time": "March 29, 2023, 04:36:10 AM",
      "body": "16 bin dolar seviyelerindeyken en geç mart civarı iyi bir boğa koşusu ya da bir ara düzeltme dönemine gireceğimizi düşünüyordum ve bu bağlamda söylemlerde bulunmuştum. Quote from: trendcoin on December 07, 2022, 04:45:25 AMben 11-12k altını beklemiyorum ama olur da 11-12k altına doğru süzülürsek ayı oğlu ayı daha 4-5 yıl daha devam eder herhalde... benim tahminim şöyle ki, btc 11k'nın altına sarkmaz ve şubat ya da mart civarında bir ara fişek görürüz. ha! o arada \"altlara ne olur kestirmek zor, ayrıca yeni bir ralli mi başlar yoksa 60k düşüşünün bir düzeltmesi mi olur\" şimdiden kestirmek zor ama btc bence daha fazla yıpranmaz ve 2-3 aylık akümülasyondan sonra iyi bir kar verir. not: yemek tarifi değildir. bugün teknik analizlerimi güncellediğimde karamsar tablolar ile karşılaşıyorum. kimseyi yanıltmak istemediğim için ve kendime eskisi kadar güvenmediğim için teknik analiz paylaşmıyorum ama btc'de kar alıp dışarı çıkmak üzereyim; bu kadar yeter, allah bin bereket versin olm daha ne diyek!yine de boby lee'ye katılmıyorum, iki sene daha sürüncemede kalmayız, belki bir sene daha böyle devam eder (eğer yanılmazsam, b*k da çıkabilir, güvenmiyorum da).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hero1111",
      "created_time": "March 29, 2023, 09:37:34 PM",
      "body": "Bobby Lee nin görüşü imkansızdır diyemiyorum. Aslında normal şartlara bakılacak olursa gecen halving zamanında covid olayı çıktı ve fed bununla başa çıkmak için çok fazla para bastı bu paralarda tüm yatırım araçlarına yaradı altın abd borsaları yerel borsalar kripto vs Bu sefer tam tersi piyasada parayı tutmak isteyen ve bu fazla basılan paraların gerye çekilmesi istenilen bir döneme giriyoruz bu btc halving rüzgarını nasıl etkiler ben çok net göremiyorum neden ? Eğer küresel kriz yaşanacaksa ve 2001 krizi gibi bu tüm ülkeleri ve yatırım araçlarını etkileyecekse bunda btc de etkilenecektir !",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dzigie",
      "created_time": "April 09, 2023, 05:07:15 PM",
      "body": "Quote from: hero1111 on March 29, 2023, 09:37:34 PM Eğer küresel kriz yaşanacaksa ve 2001 krizi gibi bu tüm ülkeleri ve yatırım araçlarını etkileyecekse bunda btc de etkilenecektir ! Bitcoin, doların hegemonyası altında kalmaya devam edecek diyorsunuz. Bitcoin'in bizi bankaların esaretinden kurtarmasını eşsiz bir devrim olarak görüyorum. Satoshi benim için bir banka avcısı. Ancak, Bitcoin'in doların gölgesinde kalmasını biraz olumsuz bir durum olarak görüyorum. Çünkü bu onu eğlencelik bir yatırım aracına dönüştürür. Para borsalara akarken Bitcoin al, para borsalardan çıkarken Bitcoin sat anlayışı kriptoparaların varlık amaçlarına aykırıymış gibi hissediyorum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}