{
  "id": "topic_5471851",
  "title": "DubemIfedigbo001",
  "author": "DubemIfedigbo001",
  "created_time": "October 27, 2023, 09:29:27 AM",
  "content": "I have been thinking of a way of simplifying the bitcoin addressing system. I also know that if your coins are sent to the wrong address, the coins are lost and it brings so much pain to the user. I think that if the process of the transaction is made simpler, or a second layerof address confirmation is added or introduced, it will be easier for both illiterates and less tech savvy people to embrace the bitcoin cryptocurrency completely.I am suggesting the idea of bitcoin wallet address reference system. let me explain in a language everybody will understand. As a web developer, saving my code on GitHub, I add a remote with the following code.Code:git remote add shortname URL. This helps me save the URL in a shortname variable. Now, next time I want to push to the same repository, I don't need to go online and copy or remember the URL anymore, I just need to remember the remote name or simply find it locally using.Code:git remotewhen I pick it up, I can push as many times as necessary, and it is easier.Now, back to my topic. It will be of great good if the 42-character long addresses can be referenced by a shorter name which still points to the original wallet address on the database. Note that I am not talking about wallet username, but all the different wallet addresses being identified by unique reference names and no two addresses can share the same reference name. A New column can be added to the addresses table in the databases and the reference names tied to specific address records. The transactions can as well be carried out using the reference names or the address proper, whichever the user is comfortable with. the goal of this is to foster mass adoption of bitcoin by everybody.as its wallet addresses is kind of simplified and can be remembered off hand. Secondly, in the transaction history, it will be easier to track specific transactions or even initiate another to same person cos the reference name is visible and distinguishable from others outlined. Another value it can add is that it can act as a second layer of confirmation and can verify the correctness of the wallet address as you are able to compare the address reference name Identified, and the one forwarded to you by the recipient. This can help safeguard against sending the coins to the wrong address.just Imagine that I am applying for a signature campaign and my details looks like this.username: DubemIfedigbo001post stats: 94position: memberwallet address: DubemIfedigbo001 orusername: DubemIfedigbo001post stats: 94position: memberwallet address: bc1q287fsyp4jvayqhjrvz5nn8q5gga3rcgf07p5efwallet address reference: DubemIfedigbo001would it not be cool? and make life easier for the campaign manager while making payments. In UI/UX, we were taught that the easier your software is to use, the more clients are comfortable with using it and the more patronage you get cos clients tend to embrace what doesn't stress them much.is there anything like this already?will it be a security threat?If No, is it not worth Implementing?lets discuss.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5471851",
  "comments": [
    {
      "author": "apogio",
      "created_time": "October 27, 2023, 09:41:36 AM",
      "body": "Take a look at Paynyms (https://bitcoiner.guide/paynym/). What you propose is very close to the use of Paynyms where all your receiving addresses are well hidden behind a nickname that is produced by the same entropy that produces your wallet.It is BIP47 https://en.bitcoin.it/wiki/BIP_0047 and it is already implemented in various software like Sparrow, Samourai etc.Also take a look at this topic: https://bitcointalk.org/index.php?topic=5433032.0 where you can find lots of info in regards to paynyms.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "October 27, 2023, 10:42:10 AM",
      "body": "Quote from: apogio on October 27, 2023, 09:41:36 AMTake a look at Paynyms (https://bitcoiner.guide/paynym/). What you propose is very close to the use of Paynyms where all your receiving addresses are well hidden behind a nickname that is produced by the same entropy that produces your wallet.It is BIP47 https://en.bitcoin.it/wiki/BIP_0047 and it is already implemented in various software like Sparrow, Samourai etc.This is interesting.  However,  it is not implemented in electrum, and probably it isn't in a lot of wallets.So if you just add a paynym to your website or something like that, you still need to put the bitcoin address with it.Quote from: ETFbitcoin on October 27, 2023, 10:18:50 AMQuote from: DubemIfedigbo001 on October 27, 2023, 09:29:27 AMis there anything like this already?If the referencing system only happen on your device, it's already possible with many Bitcoin wallet. For example, Electrum have Contacts feature which let you create contact which contain Bitcoin address and name. In past, there were also centralized service where user can assign arbitrary string to Bitcoin address. But it never took off since people are skeptical to such services.Even electrum and many other wallets allows the give name to addresses and UTXO. I use it a lot for privacy purposes.  So I don't mix utxo that I don't want to.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zaguru12",
      "created_time": "October 27, 2023, 10:44:44 AM",
      "body": "Quote from: ETFbitcoin on October 27, 2023, 10:18:50 AMIf the referencing system only happen on your device, it's already possible with many Bitcoin wallet. For example, Electrum have Contacts feature which let you create contact which contain Bitcoin address and name. In past, there were also centralized service where user can assign arbitrary string to Bitcoin address. But it never took off since people are skeptical to such services.i was actually thinking of the contact feature on electrum too but do electrum contacts have ability to generate another address, i don't think so. it only sends to the only address that you manually add yourself and i don't think you can add two or more addresses to the contacts on electrum. And what the OP seems to be suggesting is the idea of reusing a new address for new transactions. my question is will the reference name not be visible along with the address on the TXID?, if the name will be visible too then all addresses can easily be linked to it then which defeats privacy or isn't that way?.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "apogio",
      "created_time": "October 27, 2023, 12:17:27 PM",
      "body": "Quote from: Zaguru12 on October 27, 2023, 10:44:44 AM if the name will be visible too then all addresses can easily be linked to it then which defeats privacy or isn't that way?. possibly, but I guess you aren't refering to the BIP47, right? Because BIP47 doesn't allow address linking.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "October 27, 2023, 02:10:16 PM",
      "body": "Quote from: DubemIfedigbo001 on October 27, 2023, 09:29:27 AMwallet address: DubemIfedigbo001There are generally three main problems with ideas like this. First is the centralization of such database that stores address+short_string duo which introduces a lot of problems from censorship to going down or giving false information.Second is fake information that can be injected into the database without any control. Imagine we start this database and someone is faster than me and takes over my username (pooya87) and associates it with their own address. Now anybody who wants to pay me would go there and search my username and finds someone else's address instead of mine and I can't change that.You may argue that they can contact me and verify it is my address but then why go through all the fuss in first place?Finally it is the limited size. A bitcoin address is usually encoding 160 bits (20 bytes). The said database needs to contain easy to use words that are short (like pooya87 or 7 bytes) which means we are limiting the number of users this database can support. At some point we end up with long \"words\" (like the_real_pooya87_address_123) to be able to cover more and more addresses which at some point defeats the first purpose of it which was using short strings to represent addresses!As a good example if you search my name (pooya) in forum's member list you can already see the problem as there are more than three dozen entries that are variation of my name.Bonus issue: it encourages address reuse.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nc50lc",
      "created_time": "October 27, 2023, 02:10:18 PM",
      "body": "Quote from: DubemIfedigbo001 on October 27, 2023, 09:29:27 AMNow, back to my topic. It will be of great good if the 42-character long addresses can be referenced by a shorter name which still points to the original wallet address on the database.This is the issue, the proposed feature needs a database but Bitcoin do not have a dedicated central database to keep data like those addresses and references.It's out of the question to save it to each nodes since it'll add unnecessary bloat to the already-growing data that they keep.If it's something like a plugin, maybe it's possible if it works like PayNym which needs to be integrated with all Bitcoin wallets for your example \"signature campaign use-case\" to be realistic.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DubemIfedigbo001",
      "created_time": "October 27, 2023, 04:20:10 PM",
      "body": "Quote from: apogio on October 27, 2023, 09:41:36 AMTake a look at Paynyms (https://bitcoiner.guide/paynym/). What you propose is very close to the use of Paynyms where all your receiving addresses are well hidden behind a nickname that is produced by the same entropy that produces your wallet.I've taken my time to visit, read and digest the information in this link and to be honest, it more than meets my intention of starting the topic. Its so cool as the Paynym ID generates new transaction addresses that only the recipient can spend from at every transaction process, thereby limiting the security risk of have to use the same address every time. Also striking is the fact that you only need to put in the person's paynym ID and the wallet will generate a unique recipient address for the receiver to get the funds. It reduces the stress of having to type the address yourself and the risk of sending to the wrong address, thereby making the whole transaction process very less complicated and safe. And from my observation, Sparrow is a decentralized wallet.I think this is a unique selling point that should be incorporated in every wallet cos from my point of view, if the transaction process is easy, there will be more patronage and that can foster mass adoption of the bitcoin cryptocurrency. Many thanks for this piece.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "apogio",
      "created_time": "October 27, 2023, 05:07:10 PM",
      "body": "Quote from: DubemIfedigbo001 on October 27, 2023, 04:20:10 PMAlso striking is the fact that you only need to put in the person's paynym ID and the wallet will generate a unique recipient address for the receiver to get the funds. It reduces the stress of having to type the address yourself and the risk of sending to the wrong address (1), thereby making the whole transaction process very less complicated and safe. And from my observation, Sparrow is a decentralized wallet. (2)(1) I hope you don't actually write the address letter by letter   Addresses should be copy - pasted and then re-checked. But, using a paynym is much easier, yes.(2) Sparrow is my favorite wallet and the most \"accurate\", because it explains the whole transaction proccess properly. It has signing and broadcasting in separate steps (just an example).Quote from: DubemIfedigbo001 on October 27, 2023, 04:20:10 PMMany thanks for this piece.Glad it helped. If you wanna try it, we could play a bit, exchanging paynyms and such. Perhaps not on this topic but we can talk about it. Cheers",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nc50lc",
      "created_time": "October 28, 2023, 04:21:40 AM",
      "body": "Quote from: DubemIfedigbo001 on October 27, 2023, 04:20:10 PM-snip-It reduces the stress of having to type the address yourself and the risk of sending to the wrong address, thereby making the whole transaction process very less complicated and safeIf this is one of the main motivation for the feature, then you don't have to worry about it because addresses already have a \"checksum\" that ensures that users wont be able to send to a mistyped address.It's not 100% reliable since the checksum's size is limited but it does its purpose. (how about 99% reliable?)For example: A P2PKH address' checksum is 4Bytes in size which has 1 out of 2^32 chance of collision.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "philipma1957",
      "created_time": "October 28, 2023, 08:49:48 PM",
      "body": "Quote from: pooya87 on October 27, 2023, 02:10:16 PMQuote from: DubemIfedigbo001 on October 27, 2023, 09:29:27 AMwallet address: DubemIfedigbo001There are generally three main problems with ideas like this. First is the centralization of such database that stores address+short_string duo which introduces a lot of problems from censorship to going down or giving false information.Second is fake information that can be injected into the database without any control. Imagine we start this database and someone is faster than me and takes over my username (pooya87) and associates it with their own address. Now anybody who wants to pay me would go there and search my username and finds someone else's address instead of mine and I can't change that.You may argue that they can contact me and verify it is my address but then why go through all the fuss in first place?Finally it is the limited size. A bitcoin address is usually encoding 160 bits (20 bytes). The said database needs to contain easy to use words that are short (like pooya87 or 7 bytes) which means we are limiting the number of users this database can support. At some point we end up with long \"words\" (like the_real_pooya87_address_123) to be able to cover more and more addresses which at some point defeats the first purpose of it which was using short strings to represent addresses!As a good example if you search my name (pooya) in forum's member list you can already see the problem as there are more than three dozen entries that are variation of my name.Bonus issue: it encourages address reuse.His idea is great for a kyc business that wants the same address and does not care 1 iota for privacy. Or is it?Lets say my LLC which is:A1HashRateLLC . Is used as my code to be paidA spoofercould slip inAIHashRateLLC and you get robbed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}