{
  "id": "topic_5469546",
  "title": "philipma1957",
  "author": "philipma1957",
  "created_time": "October 07, 2023, 01:43:26 PM",
  "content": "First off I am anti killing. Israel 🇮🇱 and Palestine 🇵🇸 seem to be in the first day of a war.How will the rest of the world deal with yet another conflict.Stack this in with Ukraine 🇺🇦 and Russia 🇷🇺 conflict.What will we the rest of the world do with a new conflict?How will we be affected?I am wishing for peace ☮️ not violence.But this may cause a lot of ripples for us all.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5469546",
  "comments": [
    {
      "author": "stompix",
      "created_time": "October 07, 2023, 01:53:01 PM",
      "body": "Hamas won the war in 2 minutes and lost it in the next 3!Everyone was amazed by the sheer speed they attacked and the success and then they had to tie dead and chopped bodies of civilians to trucks and drive them around with a thousand cameras filming it, that's when they lost every support they had, no moderate nation that by default was not agreeing with Israel will never touch the Palestinian subject with a one hundred mile pole ever. Same in the US, if there was a clear majority tired of the whole Isaerl aid now you just have to waive around those pictures and billions will start flowing again.Anyhow, this is less economics as it will have no impact whatsoever in trade, if we talk bitcoin then nothing at all not even a trace so just politics.QuoteWhat will we the rest of the world do with a new conflict?The ones with a brain that are more than 1000km away from it geographically will stay quiet, everyone has already enough problems to get in more stuff out of the blue.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Upgrade00",
      "created_time": "October 07, 2023, 02:34:06 PM",
      "body": "Quote from: philipma1957 on October 07, 2023, 01:43:26 PMWhat will we the rest of the world do with a new conflict?How will we be affected?The same way other conflicts has been dealt with, very poorly but those who interfere and complete ignorance to those unaffected by it.This will not affect global trade and I will assume it will not make headlines for a long period of time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Odohu",
      "created_time": "October 07, 2023, 03:11:11 PM",
      "body": "Quote from: philipma1957 on October 07, 2023, 01:43:26 PMFirst off I am anti killing. Israel 🇮🇱 and Palestine 🇵🇸 seem to be in the first day of a war.How will the rest of the world deal with yet another conflict.Stack this in with Ukraine 🇺🇦 and Russia 🇷🇺 conflict.What will we the rest of the world do with a new conflict?How will we be affected?I am wishing for peace ☮️ not violence.But this may cause a lot of ripples for us all.This is an ongoing war that just got intensified. Israel and Palestine were never at peace, and this kind of sporadic attack is not new. So, the world will not be affected in any way different from the status quo. I feel bad see that the world is heading in the direction of anarchy with wars springing up in different countries and none ending.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "philipma1957",
      "created_time": "October 07, 2023, 06:34:26 PM",
      "body": "Quote from: Odohu on October 07, 2023, 03:11:11 PMQuote from: philipma1957 on October 07, 2023, 01:43:26 PMFirst off I am anti killing. Israel 🇮🇱 and Palestine 🇵🇸 seem to be in the first day of a war.How will the rest of the world deal with yet another conflict.Stack this in with Ukraine 🇺🇦 and Russia 🇷🇺 conflict.What will we the rest of the world do with a new conflict?How will we be affected?I am wishing for peace ☮️ not violence.But this may cause a lot of ripples for us all.This is an ongoing war that just got intensified. Israel and Palestine were never at peace, and this kind of sporadic attack is not new. So, the world will not be affected in any way different from the status quo. I feel bad see that the world is heading in the direction of anarchy with wars springing up in different countries and none ending. Yeah my gut feeling is more and more of this will be occurring the next 10 years or so. It's kinda of why I pur it in economics as I feel trade will be more and more interrupted down the road.I am not sure if Saudi Arabia provides aid to Palestines or Russia but they used more than 1000 missiles or so the news claims. I have to feel this size of attack is 'new' so to speak.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "be.open",
      "created_time": "October 07, 2023, 07:03:51 PM",
      "body": "Quote from: stompix on October 07, 2023, 01:53:01 PMHamas won the war in 2 minutes and lost it in the next 3!Everyone was amazed by the sheer speed they attacked and the success and then they had to tie dead and chopped bodies of civilians to trucks and drive them around with a thousand cameras filming it, that's when they lost every support they had, no moderate nation that by default was not agreeing with Israel will never touch the Palestinian subject with a one hundred mile pole ever. Same in the US, if there was a clear majority tired of the whole Isaerl aid now you just have to waive around those pictures and billions will start flowing again.Anyhow, this is less economics as it will have no impact whatsoever in trade, if we talk bitcoin then nothing at all not even a trace so just politics.QuoteWhat will we the rest of the world do with a new conflict?The ones with a brain that are more than 1000km away from it geographically will stay quiet, everyone has already enough problems to get in more stuff out of the blue.Politics is always about the economy, and if you think otherwise, then you don’t understand something. A month ago, it was announced the creation of the India-Middle East-Europe transport corridor, which will pass through: the UAE, Saudi Arabia, Jordan and Israel. This corridor is very unprofitable for Iran and China, as well as for Turkey. I think the current Hamas action, timed to coincide with the Yom Kippur War, has one of its goals to demonstrate the unreliability of Israel as the weak link in this transport corridor. In other words, Hamas's attack on Israel benefits Hamas's sponsors.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LTU_btc",
      "created_time": "October 07, 2023, 07:16:09 PM",
      "body": "Isreal and Palestine never been at peace, but I don't see this conflict turning into such long and tragic war like we have between Russia and Ukraine. And globally, it can't have such big impact for world economics and trade.Quote from: stompix on October 07, 2023, 01:53:01 PMHamas won the war in 2 minutes and lost it in the next 3!Everyone was amazed by the sheer speed they attacked and the success and then they had to tie dead and chopped bodies of civilians to trucks and drive them around with a thousand cameras filming it, that's when they lost every support they had, no moderate nation that by default was not agreeing with Israel will never touch the Palestinian subject with a one hundred mile pole ever. Very well said about winning war in 2 minutes and losing it in next 3. Today's strike was massive and obviously prepared for long time. But I don't see how they can win war against Israel, even if they will get help and for example Hesbollah will get involved.Palestine independence movement was getting more or less support globally. Nt saying that Israel is sacred cow, but when you see Hamas kidnapping women and children or ridding with dead bodies on motorcycles (https://t.me/ukrnastup/89381), I don't see how civilised world can support Palestine.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gyfts",
      "created_time": "October 07, 2023, 07:57:02 PM",
      "body": "Common tactic by Hamas is to set up military posts and and weapons depots near civilian areas or in civilian buildings. Israel will fire in retaliation to rocket attacks towards these buildings and within the collateral damage, civilians get killed. It's a method of generating emotional propaganda to paint Israel as the aggressors.Of course the Israeli military would wipe Palestine off the map if they chose to unleash the full strength of its military. They show vast amounts of restraint.Europe will stay out of these matters. I'm curious on what the U.S. will do. Under Trump, Israel and the U.S. were strongly aligned. Under Biden, the relationship seems tumultuous.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Torque",
      "created_time": "October 07, 2023, 09:32:15 PM",
      "body": "Follow the money.Oil is the life blood of the world's economies and the military industrial complex.When the world's economies begin to fall, the consumption of oil begins to fall.When the consumption of oil begins to fall, the world's cartels that control that oil get upset.They can only curtail production and/or prop up the price so much. Otherwise the price will have to fall too far to be viable. Or oil production grinds to a halt.Not good. Very bad for business.Need to prop up oil consumption and oil prices in lieu of actual worldwide economic activity.Also need valid \"reasons\" to charge certain countries more for oil and blame it on \"supply chain constraints\".But how to do that?A: Proxy war.First was Ukraine.But after 2 years, now Ukraine war is beginning to dwindle.Need another war to replace it.Hmmm....what next  Follow the money, normies.  QuoteFinally, there is some speculation that Iran may get dragged into what is rapidly emerging as the worst Middle-Eastern crisis in years, with various pro-Israeli hawks claiming that the Hamas attack would have only occurred with explicit Iranian backing. If Israel does indeed attack Iran, as it has hinted it would do for years, may we suggest you fill up your gas tank.https://www.zerohedge.com/geopolitical/israel-state-war-hamas-after-palestinian-militants-launch-unprecedented-incursion",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OgNasty",
      "created_time": "October 07, 2023, 11:40:40 PM",
      "body": "This is probably the last thing America needed right now. Printing money at unbelievable rates to fund a proxy war against Russia and now we’re about to enter into a proxy war with Iran. I had hoped the world would give us a pass and wait until Biden was out of office before doing anything crazy, but it appears our enemies are taking advantage of America’s weakest and most senile President ever.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "aoluain",
      "created_time": "October 08, 2023, 12:58:03 PM",
      "body": "Quote from: philipma1957 on October 07, 2023, 06:34:26 PMQuote from: Odohu on October 07, 2023, 03:11:11 PMQuote from: philipma1957 on October 07, 2023, 01:43:26 PMFirst off I am anti killing. Israel 🇮🇱 and Palestine 🇵🇸 seem to be in the first day of a war.How will the rest of the world deal with yet another conflict.Stack this in with Ukraine 🇺🇦 and Russia 🇷🇺 conflict.What will we the rest of the world do with a new conflict?How will we be affected?I am wishing for peace ☮️ not violence.But this may cause a lot of ripples for us all.This is an ongoing war that just got intensified. Israel and Palestine were never at peace, and this kind of sporadic attack is not new. So, the world will not be affected in any way different from the status quo. I feel bad see that the world is heading in the direction of anarchy with wars springing up in different countries and none ending. Yeah my gut feeling is more and more of this will be occurring the next 10 years or so. It's kinda of why I pur it in economics as I feel trade will be more and more interrupted down the road.I am not sure if Saudi Arabia provides aid to Palestines or Russia but they used more than 1000 missiles or so the news claims. I have to feel this size of attack is 'new' so to speak.I agree that this is not a 'New' war, just a new phase in the same war. It will get someair time in the media but little will be done to try and resolve this ongoing issue.Israel has a lot of support from the US in particular and through Hamas it is theonly way the Palestinians can try and fight for their rights but Hamas is widelycondemned so there you go.What is astounding is the number of rockets which Hamas were able to acquire,fire and land into Israeli territory and from Gaza which is highly controlled by Israel.What is really sad and worrying is that Israel will retaliate with horrible devastation,which will lead to even more hostility...This is unfixable",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Odohu",
      "created_time": "October 08, 2023, 01:31:28 PM",
      "body": "Quote from: aoluain on October 08, 2023, 12:58:03 PMWhat is astounding is the number of rockets which Hamas were able to acquire,fire and land into Israeli territory and from Gaza which is highly controlled by Israel.It is really looking like there are new players involved in the war. I just hope it is not Russia since US is already supporting Isreal. Russia involvement will escalate the war beyond redemption and I don't want us to get to that direction. Quote from: aoluain on October 08, 2023, 12:58:03 PMWhat is really sad and worrying is that Israel will retaliate with horrible devastation,which will lead to even more hostility...This is unfixableThe reality that Isreal will retaliate is what scare me the most.  From history, the extent to which Isreal responds to any attack is always proportional to the level of damages and loss they incurred. According to rumours,  Isreal have an unwritten rule that a single Israeli killed by Hamas is equal to hundred Palestinians. This is the reason Israel's retaliation is always more divestating.  I truly wish there is anything that can be done to prevent the doom that is awaiting Palestine.... we are humans before anything else and human lives matters",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gozie51",
      "created_time": "October 08, 2023, 02:05:20 PM",
      "body": "Quote from: Odohu on October 08, 2023, 01:31:28 PMI truly wish there is anything that can be done to prevent the doom that is awaiting Palestine.... we are humans before anything else and human lives mattersThe war has already started unfortunately and it is going to be worsened by third parties interest which are likely to be the rejuvenated version of Russia Ukraine war and all those interest connected thereto. Palestine will not be able to take up Israel but we know when there is war, different interest are come to play including selling of weapons. Humans are also full of interest unfortunately.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "philipma1957",
      "created_time": "October 08, 2023, 06:33:59 PM",
      "body": "I locked this as it should not be political and I worded the title poorly.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}