{
  "id": "topic_5404025",
  "title": "Porfirii",
  "author": "Porfirii",
  "created_time": "June 25, 2022, 11:37:54 AM",
  "content": "Directo al grano: llevo muchos años funcionando con Blockfolio para hacer un seguimiento de mi portafolio, como todo hijo de pichichi por estos lares, entiendo. Como ya sabréis, ahora es FTX.Hace unas semanas, o un par de meses ya, mi memoria de pez es antológica, entré en la app de FTX y me pedía iniciar sesión; claro, en la vida he tenido una cuenta asociada a un email, la gracia es hacer yo un seguimiento de mis monedas, no terceros. He buscado en reddit y a más gente le ha pasado, pero al parecer que ya tuvieran cuenta, y que se les ha borrado el registro de monedas.¿Alguien podría compartir su experiencia al respecto? ¿si creara una cuenta para poder iniciar sesión, me habrá mantenido en la app el registro de monedas? entiendo que no, pero la esperanza es lo último que se pierde, de ahí la pregunta.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5404025",
  "comments": [
    {
      "author": "DdmrDdmr",
      "created_time": "June 25, 2022, 01:47:27 PM",
      "body": "Los casos que he leído parece que lo resolvieron tras solicitar un cambio de contraseña (incluso teniendo que hacerlo varias veces sucesivas), para lo cual presumo que partían de alguna cuenta registrada, que no es tu caso.El hilo que he mirado probablemente lo hayas visto:https://www.reddit.com/r/CryptoCurrency/comments/q76nsv/ive_just_had_my_portfolios_disappear_from_ftx_aka/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Porfirii",
      "created_time": "June 25, 2022, 10:12:46 PM",
      "body": "Quote from: DdmrDdmr on June 25, 2022, 01:47:27 PMEl hilo que he mirado probablemente lo hayas visto:https://www.reddit.com/r/CryptoCurrency/comments/q76nsv/ive_just_had_my_portfolios_disappear_from_ftx_aka/Ese mismo. Hay concretamente un comentario que dice que instalando una versión anterior de la App ha conseguido que le funcione, para acto seguido contestarle otro usuario diciéndole que tiene iOS (mi caso) y que no tiene credenciales (también mi caso) y que con esas no hay manera, con lo cual esa solución no parece ser viable.A no ser que alguien en mi misma situación comente lo contrario, me da que he perdido los datos. Y menos mal que no eran datos de compra y venta con sus precios, exchanges etc, sino más bien saldos metidos manualmente para hacer un seguimiento grosso modo del valor del portafolio; de lo contrario me estaría tirando de los pelos.Como comenta un usuario:QuoteBut who an earth thinks it’s a good business decision from FTX to wipe everyone’sdata like this?! If I get my data back I’m definitely gone from the platformfor good.O, en cristiano, ¿a quién narices se le ocurre borrar los datos de todo quisqui de esta manera?Blockfolio, tú antes molabas...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}