{
  "id": "topic_5472470",
  "title": "Disruptivas",
  "author": "Disruptivas",
  "created_time": "November 01, 2023, 04:55:23 PM",
  "content": "Acredito que concordamos que vivemos em períodos de incerteza - independente da discussão macro se estamos melhor ou pior do que anos atrás.Rússia e Ucrânia. Hamas e Israel. China e Taiwan. Dívida dos EUA . Alta Inflação e custo de vida impossível pra maior parte das pessoas. Esse é o cenário macro. Neste cenário, fala-se muito sobre ''os ativos seguros'', historicamente: o ouro e os títulos de divida publica.Entretanto, quando comparamos o desempenho do ouro e dos titulos com o BTC considerando a pandemia, a invasão da Ucrania e até a invasão recente do Hamas, o ativo que tem a melhor performance é o Bitcoin .Será que o Bitcoin está perto de se tornar uma moeda vista como segura ou pelo menos segura para momentos de incerteza política?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5472470",
  "comments": [
    {
      "author": "Paredao",
      "created_time": "November 01, 2023, 08:10:10 PM",
      "body": "Eu ainda acredito que virá uma terceira guerra mundial. Daí não tem como fugir. Será a destruição total do planeta terra. Se continuará existindo vida na terra ? Quem saberá. Toda vez que penso nesse assunto, me vem a mente uma frase de Albert Einstein: \"Não sei como será a terceira guerra mundial, mas sei como será a quarta: com pedras e paus.\". Quem sobreviver verá.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "darkv0rt3x",
      "created_time": "November 01, 2023, 08:37:11 PM",
      "body": "Quote from: Disruptivas on November 01, 2023, 04:55:23 PMAcredito que concordamos que vivemos em períodos de incerteza - independente da discussão macro se estamos melhor ou pior do que anos atrás.Rússia e Ucrânia. Hamas e Israel. China e Taiwan. Dívida dos EUA . Alta Inflação e custo de vida impossível pra maior parte das pessoas. Esse é o cenário macro. Neste cenário, fala-se muito sobre ''os ativos seguros'', historicamente: o ouro e os títulos de divida publica.Entretanto, quando comparamos o desempenho do ouro e dos titulos com o BTC considerando a pandemia, a invasão da Ucrania e até a invasão recente do Hamas, o ativo que tem a melhor performance é o Bitcoin .Será que o Bitcoin está perto de se tornar uma moeda vista como segura ou pelo menos segura para momentos de incerteza política?Deixa ver se percebi bem ou é só a minha biased mente. A invasão do Hamas? Quem é que o Hamas invadiu? Ou referes-te ao alegado ataque do Hamas à festa de música? É que eu não tive conhecimento de nenhuma invasão por parte do Hamas a local nenhum. Pelo contrário, Israel é que invadiu a Faixa de Gaza para tentarem a tal limpeza etnica que ninguém fala!Quanto ao resto, acho que sim, Bitcoin é mesmo um asset dos mais seguros que me posso lembrar. Só uma grande crise energética pode pôr em causa Bitcoin e se esse alguma vez fosse um cenário, acredito que mesmo que Bitcoin descesse 50% ou 60%, todos os outros invsetimentos sem excepção desciam 99.99%... Portanto sim, Bitcoin é mais seguro que tudo o que temos agora!Agora outra questão é se os governos alguma vez vão ser humildes o suficiente para o admitir e largar do controlo autoritário e totalitário que tanto almejam para deixar o mercado livre ditar as regras!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lcluciano",
      "created_time": "November 01, 2023, 09:53:33 PM",
      "body": "\"É que eu não tive conhecimento de nenhuma invasão por parte do Hamas a local nenhum.\"Poderia explicar melhor?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "criptoevangelista",
      "created_time": "November 01, 2023, 11:34:24 PM",
      "body": "Vejo muita gente falando de macro , de guerra, disso e daquilo, mas esquecem o principal fundamento do BTC, nunca haverá um momento certo, o momento certo foi ontem... Pra mim BTC é uma das maiores invenções da humanidade. Eu não tenho reais. ALL in BTC e me sinto extremamente confortável com isso",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tg88",
      "created_time": "November 02, 2023, 12:18:22 AM",
      "body": "Quote from: Disruptivas on November 01, 2023, 04:55:23 PMSerá que o Bitcoin está perto de se tornar uma moeda vista como segura ou pelo menos segura para momentos de incerteza política?Considero que sim a bastante tempo e sinto que está ocorrendo um aumento ainda que lento da percepção do mundo em geral sobre isso, atualmente algumas nações estão vendendo títulos dos EUA no prejuízo para trocar por ouro será que em breve algumas nações não vão alocar alguma % em BTC?Quote from: criptoevangelista on November 01, 2023, 11:34:24 PMVejo muita gente falando de macro , de guerra, disso e daquilo, mas esquecem o principal fundamento do BTC, nunca haverá um momento certo, o momento certo foi ontem... Pra mim BTC é uma das maiores invenções da humanidade. Eu não tenho reais. ALL in BTC e me sinto extremamente confortável com issoSó por curiosidade a quantos anos esta all in em BTC?Vou te falar que desde 2016 BTC é sim a maior parte da minha alocação e deu muito certo. Mas mesmo assim de lá até aqui não foi a coisa mais confortável do mundo.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "criptoevangelista",
      "created_time": "November 02, 2023, 01:09:19 AM",
      "body": "Quote from: tg88 on November 02, 2023, 12:18:22 AMSó por curiosidade a quantos anos esta all in em BTC?Vou te falar que desde 2016 BTC é sim a maior parte da minha alocação e deu muito certo. Mas mesmo assim de lá até aqui não foi a coisa mais confortável do mundo.Não foi de uma hora pra outra, todo o processo de conversão durou quase 3 anos, meu ultimo centavo normal q tinha guardado foi convertido em dez-22. Atualmente apenas aportes normais de DCA. Montei uma estratégia para poder me aposentar ou (quase isso) num prazo de 8 anos (2 ciclos completos), e desde então sigo a risca. Vou ter que rebalancear no futuro, não vai ter jeito, só assim vai dar pra multiplicar.  Não sou rico, Enfim, tudo ainda não passa de teoria baseada em estudos q me dediquei nos ultimos tempos a respeito disso.. Pra mim o risco retorno é interessante, se vai dar certo, só o tempo dirá, mas creio que vai sim. Agora se eu fosse podre de rico obviamente espalharia tudo em vários investimentos.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "darkv0rt3x",
      "created_time": "November 02, 2023, 09:04:30 AM",
      "body": "Quote from: lcluciano on November 01, 2023, 09:53:33 PM\"É que eu não tive conhecimento de nenhuma invasão por parte do Hamas a local nenhum.\"Poderia explicar melhor?Estou só a tentar perceber o que é que o Hamas invadiu! Porque a OP referiu \"depois da invasão do Hamas\" e eu não sei de invasão nenhuma que o Hamas tenha feito a nação nenhuma. O que tenho visto é Israel a invadir a faixa de Gaza. Por isso estava a perguntar o que é que o Hamas invadiu!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "November 02, 2023, 01:18:58 PMLast edit: November 02, 2023, 01:32:45 PM by bitmover",
      "body": "Quote from: Disruptivas on November 01, 2023, 04:55:23 PMRússia e Ucrânia. Hamas e Israel. China e Taiwan. Dívida dos EUA . Alta Inflação e custo de vida impossível pra maior parte das pessoas. Esse é o cenário macro. Neste cenário, fala-se muito sobre ''os ativos seguros'', historicamente: o ouro e os títulos de divida publica.Entretanto, quando comparamos o desempenho do ouro e dos titulos com o BTC considerando a pandemia, a invasão da Ucrania e até a invasão recente do Hamas, o ativo que tem a melhor performance é o Bitcoin .Será que o Bitcoin está perto de se tornar uma moeda vista como segura ou pelo menos segura para momentos de incerteza política?Acho que o bitcoin é um importante mecanismo de diversificação, por não depender de um país, não ter ideologia, não depender de mercados etc...Na minha opinião ainda falta para chama-lo de um ativo seguro (como divida publica e ouro e dolar), pois esses ativos são muito testados no tempo e de certa forma sempre terão valor (enquanto formos vivos).Já o bitcoin pode cair 80% e não recuperar, ou demorar muito pra recuperar.... Não diria que é seguro, mas é uma diversificação bem interessante.Quote from: darkv0rt3x on November 02, 2023, 09:04:30 AMQuote from: lcluciano on November 01, 2023, 09:53:33 PM\"É que eu não tive conhecimento de nenhuma invasão por parte do Hamas a local nenhum.\"Poderia explicar melhor?Estou só a tentar perceber o que é que o Hamas invadiu! Porque a OP referiu \"depois da invasão do Hamas\" e eu não sei de invasão nenhuma que o Hamas tenha feito a nação nenhuma. O que tenho visto é Israel a invadir a faixa de Gaza. Por isso estava a perguntar o que é que o Hamas invadiu!darkv0rt3x , não sei como você não está sabendo, mas o Hamas atacou uma cidade Israelense no dia 07 de outubro (quando estavam comemorando o dia do Perdão, um dia sagrado para os judeus), onde mataram 1400 pessoas (maioria de civis)Sequestraram centenas de mulheres e crianças e bebês e levaram para território controlado pelo Hamas. Estão rolando vários videos na internet de homens armados do Hamas utilizando bebes israelenses com menos de um ano como escudo humano. Não sei qual a sua religião, mas acredito que mesmo os mulçumanos devem abominar totalmente esse tipo de procedimento. Independente de quem ocupou essas terras no passado, defender quem mata civis e sequestra mulheres e crianças e bebês para estuprar e usar como escudo humano é lamentável.A esquerda ocidental chegou no fundo do poço e começou a cavar.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Disruptivas",
      "created_time": "November 02, 2023, 01:54:34 PM",
      "body": "Quote from: Paredao on November 01, 2023, 08:10:10 PMEu ainda acredito que virá uma terceira guerra mundial. Daí não tem como fugir. Será a destruição total do planeta terra. Se continuará existindo vida na terra ? Quem saberá. Toda vez que penso nesse assunto, me vem a mente uma frase de Albert Einstein: \"Não sei como será a terceira guerra mundial, mas sei como será a quarta: com pedras e paus.\". Quem sobreviver verá.Realmente o cenário não está nada positivo e acho que ele esta certo mesmo! Quote from: darkv0rt3x on November 01, 2023, 08:37:11 PMDeixa ver se percebi bem ou é só a minha biased mente. A invasão do Hamas? Quem é que o Hamas invadiu? Ou referes-te ao alegado ataque do Hamas à festa de música? É que eu não tive conhecimento de nenhuma invasão por parte do Hamas a local nenhum. Pelo contrário, Israel é que invadiu a Faixa de Gaza para tentarem a tal limpeza etnica que ninguém fala!Quanto ao resto, acho que sim, Bitcoin é mesmo um asset dos mais seguros que me posso lembrar. Só uma grande crise energética pode pôr em causa Bitcoin e se esse alguma vez fosse um cenário, acredito que mesmo que Bitcoin descesse 50% ou 60%, todos os outros invsetimentos sem excepção desciam 99.99%... Portanto sim, Bitcoin é mais seguro que tudo o que temos agora!Agora outra questão é se os governos alguma vez vão ser humildes o suficiente para o admitir e largar do controlo autoritário e totalitário que tanto almejam para deixar o mercado livre ditar as regras!Que eu saiba, o Hamas adentrou território no Sul de Israel, a uns3 km da Faixa de Gaza, de onde sequestraram e fizeram refens. Mas isso não significa que Israel também não invadiu a faixa de Gaza. O ponto do post nem era tomar partido de ninguem, mas 'considero' que o ataque refente partiu do Hamas. Mas do meu lado, é um conflito de muuuuuuuitos anos que eu me sinto incapaz de julgar. Quote from: criptoevangelista on November 01, 2023, 11:34:24 PMVejo muita gente falando de macro , de guerra, disso e daquilo, mas esquecem o principal fundamento do BTC, nunca haverá um momento certo, o momento certo foi ontem... Pra mim BTC é uma das maiores invenções da humanidade. Eu não tenho reais. ALL in BTC e me sinto extremamente confortável com issoSei que o Sabotagem acho que também é all in. Duvida, operacionalmente como vocês fazem com as contas do dia a dia? Qual a melhor dinamica que vocês acharam?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "darkv0rt3x",
      "created_time": "November 02, 2023, 02:52:51 PM",
      "body": "Quote from: Disruptivas on November 02, 2023, 01:54:34 PMQue eu saiba, o Hamas adentrou território no Sul de Israel, a uns3 km da Faixa de Gaza, de onde sequestraram e fizeram refens. Mas isso não significa que Israel também não invadiu a faixa de Gaza. O ponto do post nem era tomar partido de ninguem, mas 'considero' que o ataque refente partiu do Hamas. Mas do meu lado, é um conflito de muuuuuuuitos anos que eu me sinto incapaz de julgar. Ah ok. Mas isso é um ataque. Não é propriamente uma invasão no sentido em que eles chegaram lá, expulsaram a IDF e assentaram arraiais lá. Isso e o que Israel esta a fazer no norte de Gaza que é totalmente diferente. E eu também não estou a tomar partido pelo Hamas, tomo partido pelos civis de Gaza.Quanto a Bitcoin se tornar um safe heaven, eu acho que os políticos sabem bem. A questão é que eles não estão preparados, nem querem tão pouco, abrir mão do actual sistema financeiro porque lhes dá o poder que têm.Quote from: bitmover on November 02, 2023, 01:18:58 PMdarkv0rt3x , não sei como você não está sabendo, mas o Hamas atacou uma cidade Israelense no dia 07 de outubro (quando estavam comemorando o dia do Perdão, um dia sagrado para os judeus), onde mataram 1400 pessoas (maioria de civis)Sequestraram centenas de mulheres e crianças e bebês e levaram para território controlado pelo Hamas. Estão rolando vários videos na internet de homens armados do Hamas utilizando bebes israelenses com menos de um ano como escudo humano. Não sei qual a sua religião, mas acredito que mesmo os mulçumanos devem abominar totalmente esse tipo de procedimento. Independente de quem ocupou essas terras no passado, defender quem mata civis e sequestra mulheres e crianças e bebês para estuprar e usar como escudo humano é lamentável.A esquerda ocidental chegou no fundo do poço e começou a cavar.Exacto, tal como expliquei, um ataque mão é propriamente uma invasão no sentido que expliquei a cima, de entrear numa cidade, combater os \"residentes\", expulsá-los e assentar lá arraiais! Isso é o que está a fazer Israel no norte de Gaza. Entram, combatem, ganham, e assentam arraiais, impõem as leis deles e está feito. Isso para mim é que é uma invasão!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "criptoevangelista",
      "created_time": "November 02, 2023, 03:36:13 PM",
      "body": "Quote from: Disruptivas on November 02, 2023, 01:54:34 PMSei que o Sabotagem acho que também é all in. Duvida, operacionalmente como vocês fazem com as contas do dia a dia? Qual a melhor dinamica que vocês acharam?Eu tenho meu emprego formal normal,  para o dia a dia uso o dinheiro do banco (cartão de crédito). Agora de resto all in. O que sobra converto tudo.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Paredao",
      "created_time": "November 02, 2023, 08:10:38 PM",
      "body": "Quote from: criptoevangelista on November 02, 2023, 03:36:13 PMEu tenho meu emprego formal normal,  para o dia a dia uso o dinheiro do banco (cartão de crédito). Agora de resto all in. O que sobra converto tudo.Muito bom. É exatamente assim que deve agir um Cripto Evangelista. Seguir a risca tudo que prega. Daqui há uns anos, quiçá uns vinte ou trinta anos, você colherá os frutos que você plantou. Não estou zoando não. Eu entrei nesse mundo de criptomoedas há uns doze anos e agora estou colhendo os frutos. Tenha força e continue perseverando.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Disruptivas",
      "created_time": "November 03, 2023, 11:57:54 AM",
      "body": "Quote from: criptoevangelista on November 02, 2023, 03:36:13 PMEu tenho meu emprego formal normal,  para o dia a dia uso o dinheiro do banco (cartão de crédito). Agora de resto all in. O que sobra converto tudo.Tu usa o salario do emprego formal no dia a dia e o que sobra no mes tu converte em cripto, é isso? Só pra ver se entendi. E se surge alguma coisa além que tu precisa comprar, tu compra direto com cripto ou nunca compra em cripto?Hoje até postei esse meme: https://twitter.com/hi_disruptivas/status/1720402762721112358A pergunta é só pra entender mesmo a dinamica. Mas acho realmente importante que possamos usar mais nas trocas mesmo. Essa semana na SatsConf, só vão aceitar pagamento via LN    E já vi algumas pessoas iniciantes meio desesperadas kkkk mas faz parte né. Quote from: Paredao on November 02, 2023, 08:10:38 PMMuito bom. É exatamente assim que deve agir um Cripto Evangelista. Seguir a risca tudo que prega. Daqui há uns anos, quiçá uns vinte ou trinta anos, você colherá os frutos que você plantou. Não estou zoando não. Eu entrei nesse mundo de criptomoedas há uns doze anos e agora estou colhendo os frutos. Tenha força e continue perseverando.12 anos Paredão? kkkkNão exagerou esses números não? Não sei se tu ja contou, provavelmente já. Mas como tu conheceu o Bitcoin há 12 anos atras? kk",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "November 03, 2023, 07:54:11 PM",
      "body": "Quote from: Disruptivas on November 01, 2023, 04:55:23 PMSerá que o Bitcoin está perto de se tornar uma moeda vista como segura ou pelo menos segura para momentos de incerteza política?Em caso de caos total no Mundo, pode realmente ser útil, mas tem um problema: conectividade.Sem internet, energia e afins, o Bitcoin simplesmente não funciona. Enquanto o ouro ou fiat em papel, continua a poder realmente ser usado para trocas comerciais. E mesmo que o fiat deixe de valor, o ouro continua lá e a funcionar como moeda de troca sem qualquer tipo de impedimento.Ou seja, o Bitcoin depende de terceiros para operar, o ouro não depende de nada.Agora, numa situação pós caos, pode se tornar em algo incrível, porque basta colocar um PC a funcionar, para a rede funcionar sem problemas.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "criptoevangelista",
      "created_time": "November 03, 2023, 08:20:07 PM",
      "body": "Quote from: Disruptivas on November 03, 2023, 11:57:54 AMTu usa o salario do emprego formal no dia a dia e o que sobra no mes tu converte em cripto, é isso? Só pra ver se entendi. E se surge alguma coisa além que tu precisa comprar, tu compra direto com cripto ou nunca compra em cripto?Hoje até postei esse meme: https://twitter.com/hi_disruptivas/status/1720402762721112358A pergunta é só pra entender mesmo a dinamica. Mas acho realmente importante que possamos usar mais nas trocas mesmo. Essa semana na SatsConf, só vão aceitar pagamento via LN    E já vi algumas pessoas iniciantes meio desesperadas kkkk mas faz parte né. Isso, exatamente isso, depois de todo o processo de migração pra crypto eu converto tudo o que sobra ou o que recebo em trabalhos por fora, mas ainda preciso de um trabalho comum para a minha subsistência.O bitcoin ainda acho que vai demorar um bom tempo para uma adoção do grande público e ser usado de forma como as moedas são hoje. Nós somos o nicho do nicho e a realidade é que ainda existem muitas pessoas que estão no ramo e nunca usaram de fato crypto como moeda corrente, usam sim como dinheiro de investimentos / especulação. A verdade é que pouca conhece ou usa de fato, eu na bull passada fui numa concessionária e tentei comprar um carro com crypto, o cara ficou me olhando como se eu fosse um alienígena   Eu uso na prática para trocas / compras quando existe a oportunidade. Tive uma motocicleta que vendi em crypto, coleções de videogames etc., uso stablecoins quando viajo para o Paraguay. A LN usei algumas vezes também mas bem poucas.Mas basicamente é isso, caso eu precise de algo, uso sempre cartão de crédito, independente do que seja. Procuro sempre ir usando o dinheiro do banco do que o meu, ai quando recebo meu pgto mensal quito tudo. É assim que faço. E você como faz? como lida com este mundo?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sabotag3x",
      "created_time": "November 03, 2023, 08:24:47 PM",
      "body": "Quote from: joker_josue on November 03, 2023, 07:54:11 PMSem internet, energia e afins, o Bitcoin simplesmente não funciona. Enquanto o ouro ou fiat em papel, continua a poder realmente ser usado para trocas comerciais. E mesmo que o fiat deixe de valor, o ouro continua lá e a funcionar como moeda de troca sem qualquer tipo de impedimento.Ou seja, o Bitcoin depende de terceiros para operar, o ouro não depende de nada.Essa semana mudei minha opinião sobre o ouro nesse sentido.. Afinal, hoje boa parte do ouro é negociado em bolsas, etc. dependendo de terceiros mais do que o bitcoin depende..Então quando acontece alguma crise, o ouro físico aumenta de preço apenas no local dessa crise, nos levando a dois preços: normal e regional.Enquanto a internet estiver funcionando o Bitcoin ganha essa disputa.. principalmente se você estiver tentando sair de uma zona de conflito já que sua transportabilidade é extremamente melhor.Quote from: Disruptivas on November 02, 2023, 01:54:34 PMSei que o Sabotagem acho que também é all in. Duvida, operacionalmente como vocês fazem com as contas do dia a dia? Qual a melhor dinamica que vocês acharam?Tenho um cartão da Crypto que dá uma salvada, costumo sacar dinheiro no caixa eletrônico para pagar coisas que ainda são impossíveis.. (o que é quase a mesma coisa que ter uma conta bancária, tbh)Os gift cards estão sendo de extrema ajuda, já absorvem boa parte de meus gastos (principalmente alimentação).. esses tempos comprei um tênis, por exemplo, fiquei bem contente.. mas é um nicho pequeno, maioria das pessoas prefere bitcoin->exchange->banco->produto na hora de gastar.. o que no fim dá quase no mesmo.. parece que só estou passando trabalho Não sei se no futuro será mais fácil usar btc/criptos (devido a empreendedores) ou se terão mais restrições (por parte do governo).. vamos ver o que acontece.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "November 04, 2023, 01:08:48 AMLast edit: November 04, 2023, 01:23:37 AM by bitmover",
      "body": "Quote from: sabotag3x on November 03, 2023, 08:24:47 PMEssa semana mudei minha opinião sobre o ouro nesse sentido.. Afinal, hoje boa parte do ouro é negociado em bolsas, etc. dependendo de terceiros mais do que o bitcoin depende..Eu não acho muito relevante esse assunto, mas chamam de paper gold esse ouro de ETF. Seria um ouro de papel.Acho que são instituições sólidas e existem diversas opções, desde IAU e GLD(maiores ETFs) até alguns etf com uma maior garantia física (sprott phys). Não vejo isso como problema, é apenas uma ferramenta para auxiliar na compra e venda e dividir os custos de armazenamento. Eu sei que tem um na Suíça que permite saques apenas se você comparecer pessoalmente na Suíça.  Segurança máxima pros mais paranoicos.QuoteTenho um cartão da Crypto que dá uma salvada, costumo sacar dinheiro no caixa eletrônico para pagar coisas que ainda são impossíveis.. (o que é quase a mesma coisa que ter uma conta bancária, tbh)Os gift cards estão sendo de extrema ajuda, já absorvem boa parte de meus gastos (principalmente alimentação).. esses tempos comprei um tênis, por exemplo, fiquei bem contente.. mas é um nicho pequeno, maioria das pessoas prefere bitcoin->exchange->banco->produto na hora de gastar.. o que no fim dá quase no mesmo.. parece que só estou passando trabalho Não sei se no futuro será mais fácil usar btc/criptos (devido a empreendedores) ou se terão mais restrições (por parte do governo).. vamos ver o que acontece.Uma pena que os gift cards vc perde 0,5% a 2% e deixa de ganhar os benefícios do cartão de crédito (1% facil de cashback). Dai acaba perdendo mais de 2%. Mas entendo a necessidade de usar",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "November 04, 2023, 09:18:52 AM",
      "body": "Quote from: sabotag3x on November 03, 2023, 08:24:47 PMEssa semana mudei minha opinião sobre o ouro nesse sentido.. Afinal, hoje boa parte do ouro é negociado em bolsas, etc. dependendo de terceiros mais do que o bitcoin depende..Então quando acontece alguma crise, o ouro físico aumenta de preço apenas no local dessa crise, nos levando a dois preços: normal e regional.Enquanto a internet estiver funcionando o Bitcoin ganha essa disputa.. principalmente se você estiver tentando sair de uma zona de conflito já que sua transportabilidade é extremamente melhor.Mas, ouro em Bolsa é igual a Bitcoin, só é valido se existir comunicações.Eu falava em ouro físico, que qualquer pessoa pode comprar se for a uma loja de venda de ouro. É pratico, seguro e afins? Não é.Qualquer das formas é referia-me a um caos geral em todo o mundo, em que tudo desaba. Só o que é físico, é que minimamente se \"safa\". Mas nessa altura, até agua pode valer mais que ouro.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "criptoevangelista",
      "created_time": "November 04, 2023, 05:41:01 PM",
      "body": "Quote from: joker_josue on November 04, 2023, 09:18:52 AMQuote from: sabotag3x on November 03, 2023, 08:24:47 PMEssa semana mudei minha opinião sobre o ouro nesse sentido.. Afinal, hoje boa parte do ouro é negociado em bolsas, etc. dependendo de terceiros mais do que o bitcoin depende..Então quando acontece alguma crise, o ouro físico aumenta de preço apenas no local dessa crise, nos levando a dois preços: normal e regional.Enquanto a internet estiver funcionando o Bitcoin ganha essa disputa.. principalmente se você estiver tentando sair de uma zona de conflito já que sua transportabilidade é extremamente melhor.Mas, ouro em Bolsa é igual a Bitcoin, só é valido se existir comunicações.Eu falava em ouro físico, que qualquer pessoa pode comprar se for a uma loja de venda de ouro. É pratico, seguro e afins? Não é.Qualquer das formas é referia-me a um caos geral em todo o mundo, em que tudo desaba. Só o que é físico, é que minimamente se \"safa\". Mas nessa altura, até agua pode valer mais que ouro.Se chegarmos no ponto que o mundo estiver no caos e tudo desabando, a ultima preocupação de nossas vidas será o Bitcoin, pode ter certeza",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}