{
  "id": "topic_5397735",
  "title": "romero121",
  "author": "romero121",
  "created_time": "May 07, 2022, 11:31:29 PM",
  "content": "In an article read about the increasing interest among the women's to get into the digital space and educate themselves. This in particular is much about the mom's and not the girls. They find this a place where they can able to invest and leave something to their kids. Most of these mom's were interested in teaching their kids about the developing technology and for that some are learning it. One of the mom mentioned QuoteMy whole point was, I want to educate myself. I lived in Seattle during the dot com bubble and I had no voice or power to do anything.QuoteThe majority of mom investors interviewed by NBC News claimed that they were interested in crypto as a way to “meaningfully change” the financial security of their familiesMore and More Moms Are Embracing Crypto to Help Their Families Get Richer",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5397735",
  "comments": [
    {
      "author": "mk4",
      "created_time": "May 08, 2022, 03:54:09 AM",
      "body": "Props to the women trying to learn about this space. Contrary to some opinions(erm, journalists), there's nothing people can do to get more women interested in bitcoin/crypto. The information is freely available on the web; they just need to be curious/interested enough to jump in.Quote from: romero121 on May 07, 2022, 11:31:29 PMMore and More Moms Are Embracing Crypto to Help Their Families Get RicherThis sure is a scary ass headline though. If the sole reason is to get rich, err.. probably not going to end well.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "davis196",
      "created_time": "May 08, 2022, 05:21:11 AM",
      "body": "The idea of \"meaningfully changing the financial security of their families\" by investing in crypto seems kinda wrong to me.Crypto is everything else but financially secure.The crypto prices are extremely volatile and crypto industry is filled with scams.The entire crypto industry is actually quite the opposite of \"financially secure\".It's actually very risky and I wouldn't recommend someone(it doesn't matter male or female) to jump right away and invest his/her life savings into cryptocurrencies.There's nothing wrong with more women joining the crypto world,but they have learn a lot before putting any money into the game of crypto trading.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "boris singer",
      "created_time": "May 08, 2022, 05:29:18 AM",
      "body": "This, of course, cannot be denied, now the era has become emancipation for women and everyone has the right to anything, especially in Crypto, we will also not see gender or status, of course.Now there are many supporting media and of course information about Crypto is very easy to get anywhere and anytime.On the other hand, women are sometimes underestimated which makes this an opportunity for women to prove that women are strong and I like this perspective.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Apocollapse",
      "created_time": "May 08, 2022, 05:53:26 AM",
      "body": "Quote from: mk4 on May 08, 2022, 03:54:09 AMThis sure is a scary ass headline though. If the sole reason is to get rich, err.. probably not going to end well.Moreover she was learn about metaverse, NFT and crypto, not Bitcoin. I'd say it's completely bullshit if she learn and get educated about those stuffs, I believe she was learn about how to get rich quickly just like how many people become a millionaire by NFT. If people really learn and educated they self about crypto including Bitcoin, they will know all the alts except Bitcoin is totally scam and only hype.QuoteMonson, speaking at the NFT LA conference, which took place in early April, told audience goers that she wanted to be prepared for the metaverse and to help her 6-year-old daughter navigate the increasingly complex digital landscape. So, she began learning about metaverse-related technologies, including NFTs and cryptocurrencies.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "notocactus",
      "created_time": "May 08, 2022, 06:10:38 AM",
      "body": "In demographics, there are more men than women among Bitcoiners.Bitcoiners' Demographic over yearsGet Bitcoin community engagement by genders from Coindance (latest stats)There is an increase in female gender from less than 10% (2017) to 14.2% (now)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "electronicash",
      "created_time": "May 08, 2022, 06:21:34 AM",
      "body": "NFTs attract a lot of audiences including women. they have Black Women Blockchain Council!  women always look up admire to women who can do things that men do in the finance industry. Bitcoin in the long run can solve financial freedom and security for families. with financial freedom, they'd be independent and will have a voice and power and they may even have the guts to file a divorce from thier abusive husband.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kakmakr",
      "created_time": "May 08, 2022, 08:23:30 AM",
      "body": "It is Mother's Day today.. so it will be a nice gesture to give some bitcoins as a gift to some of the mothers to increase adoption, if they have no bitcoins yet.  The thing is... we do not have exact statistics on Gender use ...so it cannot be claimed that there are not a lot of women in the Crypto space. It may even be that there are more women in the space than men.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Marvell1",
      "created_time": "May 08, 2022, 09:47:10 AM",
      "body": "The need to make money is always an instinct that exists in each of us. They are just like men, women need money to take care of their lives and future, so it's not surprising that more and more women are investing in bitcoin. There is nothing wrong with women getting into crypto as long as they learn to take risks when investing in crypto because the crypto market is not like a traditional business. I hope we will soon see female millionaires and billionaires in the crypto market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TravelMug",
      "created_time": "May 08, 2022, 10:21:05 AM",
      "body": "I wouldn't be surprised though if more women are joining crypto space. We know that they can be a CEO or held high financial positions so for sure anyone of the female gender can exploit crypto too. They can just sit at their homes, learn how to invest or do trading. But as others have said, it's a catchy title, but hopefully women will actually wanted to learn crypto and how to make money but not get rich quicker mentality.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Flexystar",
      "created_time": "May 08, 2022, 10:54:30 AM",
      "body": "Is it really necessary to this?I am a guy who always applaud woman participation in every field that we have on the earth. If we are discussing this then I feel like woman is still waiting for her place in the society which is uncompared. I have a sister who is with me in the crypto space since the day I started with it. She is in fact more clearer in her vision of getting education associated with programming and eventually getting into developer. We never had comparison, in fact she is smarter than me in the tech stuff. Woman’s participation increased? Hell why not? It has to be equal and brighter irrespective of gender.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cheezcarls",
      "created_time": "May 08, 2022, 11:12:52 AM",
      "body": "Although that this industry was dominated by men, the number of women who got involved in this space keeps increasing and it won’t stop or slow down anytime soon. We now see more women founding their own crypto companies, organization, products, etc., in this space and it’s a huge development and a step in the right direction to prove that women are capable to lead. And to all the beautiful moms out there in the crypto space, Happy Mother’s Day to you all!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "husdemba",
      "created_time": "May 08, 2022, 11:32:37 AM",
      "body": "I saw a research that women prefer Bitcoin and Ethereum investment more. Today, most of the women have a job and thus earn money. They may prefer Bitcoin for investment because Bitcoin investor always wins in the long term. Everyone says the same thing, \"Women's participation will increase every day.\"",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Vaskiy",
      "created_time": "May 08, 2022, 12:30:27 PM",
      "body": "Women getting interested to learn about cryptocurrencies is a good move than just investing, and trading. What these women learn now will help the betterment of the community. The key focus on NFT will let Women create their own NFTs. The involvement into cryptocurrency to lift the economic conditions of the family isn't a great move, because the risk could have positive as well as negative impact over the economy. When you learn automatically you'll get opportunity to make money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kryptqnick",
      "created_time": "May 08, 2022, 12:38:38 PM",
      "body": "It's a nice article for Mother's Day. But they say it's about bringing meaningful change to financial security, which is not really the same as getting rich. Getting rich is a personal gain, something unnecessary. Financial security of a family is not. It's actually stressed in the article, as well, that it's not really just to invest for oneself. As for whether more women are joining the market, I'm not sure if there are representative stats on the matter. Many might not want to disclose their gender, and I'm not sure comprehensive research was ever conducted on the matter. But I hope that the discrepancy will decrease in this area and other areas as well.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptocurencyKing",
      "created_time": "May 08, 2022, 01:43:39 PM",
      "body": "When it comes to married persons, it's always about the family and it its very encouraging to have seen women decisively choose to be a part of of the ever developing cryptocurrency innovation. Better still, they've got a group to ensure this comes easier. I never knew or heard of the Black women blockchain council before but I feel its a good place to start with women crypto development. Having there focus on the blockchain fintech is a big plus not just to there families but to cryptocurrency as, the human resourcefulness is bound to be full utilised. Breaking the traditional barriers to women resourcefulness that have existed over the years. It's really encouraging and I hope more and more women pick interest in cryptocurrency innovations.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DdmrDdmr",
      "created_time": "May 08, 2022, 02:02:22 PM",
      "body": "Quote from: gamer11 on May 07, 2022, 02:19:36 PM<…>The information, I believe, originates in an article by NBC (see reference link below), where they interview a handful of women that have some kind of entrepreneur relation to crypto, to some degree, but whose testimony is really just that: a small selected sample of somewhat interesting testimonies to read, but likely not representative of the average mother.  See: https://www.nbcnews.com/tech/crypto/crypto-moms-nfts-metaverse-market-rcna22227",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "amishmanish",
      "created_time": "May 08, 2022, 03:27:06 PM",
      "body": "Costliest Iconic painting Paris Hilton's NFT crypto queen is a woman. So you can guess what is the role of women in crypto. Women techies are equally active in crypto space as men. I believe we are in a very unisexual world where the gender gap has almost pugged up and this whole comparisons hold little relevance if any.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Stalker22",
      "created_time": "May 08, 2022, 07:11:24 PM",
      "body": "The pursuit of social and economic equality is a driving force for the cryptocurrency community, but recent reports suggest that women are showing a marked increase in this community. One of the most notable trend observed in the male-dominated crypto world.I sincerely hope so, because the crypto community could use a lot of open minded, open hearted and goal-oriented women who could bring the much needed challenge for gender equality and real world women empowerment. Not to mention, it will be much nicer to look at.  Happy Mother's Day to all the moms out there!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zilon",
      "created_time": "May 08, 2022, 07:25:00 PM",
      "body": "This is a typical definition of parents been relevant for the next generation. As time keeps flying and the world keeps revolving around the sun Bitcoin and crypto adoption will keep expanding as it is wiser for parents not just mothers alone to get the right knowledge about how all this works so they can keep up with a good conversation about investment and technologies with their kids. We live in an era where information flies and once parents fails to gather as much as needed the fail to hold strong and long conversations with their kids",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}