{
  "id": "topic_5486650",
  "title": "0t3p0t",
  "author": "0t3p0t",
  "created_time": "February 26, 2024, 10:08:56 AM",
  "content": "*Another topic I made on the other forum and I also wanted to share it here so we can discuss.QuoteI just found this article here: QuoteIn 2013, Howells, from Newport, Wales, accidentally threw out the hard drive which contained 8,000 Bitcoin.Source: https://www.unilad.com/news/uk-news/james-howells-threw-away-bitcoin-ai-find-it-681168-20240224Though I've already heard of stories of people accidentally lost their huge holdings of Bitcoins but this guy is using AI to locate the missing hard drive that has 8k Bitcoins on it. So my question here;1. Does AI really has the ability to track the hard drive given that it has lost 11 years ago?2. How much do you think is the percentage of odds of finding that hard drive again using AI tech?3. If that hard drive will be found in one of these days, do you think the Bitcoins inside it can still be recoverable using current technology? (Take note it's been 11 years on the ground if not being sold to junk shops by scavengers.)",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5486650",
  "comments": [
    {
      "author": "348Judah",
      "created_time": "February 26, 2024, 10:47:24 AM",
      "body": "Don't let anymore misguided you for nothing sake, once your bitcoin is lost, then it's gone for life, for someone to be claiming the use of AI in locating the hardware devise is a lie and this could also means they have implanted a chip that monitors the transactions flow on it, of which at the point of purchase on any of these hard drives, nothing was being mention about the component possessing a tracking device, if you have the keys to your wallet, you can always claim them, if you lost your device, then maybe you accept the fate for a completely loss of asset as well, don't be scammed or duppped by such services that promises reclaiming of lost coins or devices.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zaguru12",
      "created_time": "February 26, 2024, 11:10:38 AM",
      "body": "1. There are limitations to what exactly AI can be used for. It is a technology that works on programmed terms what it is inputed there is what it brought out. If it was used to find this wallet which I don’t believe it, then the owner must have give the AI informations. But a random wallet cannot be found like that 2. I will say the possibility is very low, machines cannot do better in some aspect than humans and a situation like this is why I don’t think AI can help if something is lost, highest is if the device is track able. 3. Bitcoins are not stored on the wallet but rather on the blockchain, only the private keys are on the wallet and if recovered and it is not damaged yet then it can be accessed and bitcoin recovered",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "HeRetiK",
      "created_time": "February 26, 2024, 11:39:36 AM",
      "body": "Reading the article, you'll find that the part where AI comes in, is in image recognition and not tracking:Quote from: https://www.unilad.com/news/uk-news/james-howells-threw-away-bitcoin-ai-find-it-681168-20240224\"It's a disused section of the site - 100,000 tonnes of a total 1.4m tonnes. I'd then take the landfill to a unit where it'll be placed on a conveyor belt and subjected to an AI scanning system.\"And if the AI recognises anything that looks like a hard drive it'll be flagged and removed.\"I'm not sure about the success rate, but I can very well imagine an AI-based image recognition system narrowing the number of probable items down considerably. Unless the hard drive is physically compromised he probably would have an okayish chance of data recovery as well.That being said, I have my doubts that he'll succeed. There's just too much that would need to go right for him to be able to recover his private keys.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Casdinyard",
      "created_time": "February 26, 2024, 11:44:23 AM",
      "body": "Quote from: 0t3p0t on February 26, 2024, 10:08:56 AM*Another topic I made on the other forum and I also wanted to share it here so we can discuss.QuoteI just found this article here: QuoteIn 2013, Howells, from Newport, Wales, accidentally threw out the hard drive which contained 8,000 Bitcoin.Source: https://www.unilad.com/news/uk-news/james-howells-threw-away-bitcoin-ai-find-it-681168-20240224Though I've already heard of stories of people accidentally lost their huge holdings of Bitcoins but this guy is using AI to locate the missing hard drive that has 8k Bitcoins on it. So my question here;1. Does AI really has the ability to track the hard drive given that it has lost 11 years ago?2. How much do you think is the percentage of odds of finding that hard drive again using AI tech?3. If that hard drive will be found in one of these days, do you think the Bitcoins inside it can still be recoverable using current technology? (Take note it's been 11 years on the ground if not being sold to junk shops by scavengers.) Anything that you can train AI with, AI can do it. that's the thing. So if an AI is taught algorithms to scour the internet and look for clues as to where they can find lost bitcoins/cryptocurrencies, by any means it would be made possible. However, just cause you found cryptocurrencies doesn't necessarily mean that it's yours, it's the owners, or whatever. The concept of finding lost bitcoins can be roped in with the concept of treasure hunting/spelunking. in most cases it's finders keepers, but if it's a lost item, the owner may show interest to reacquire such item. In some cases just like treasure hunting, the government can intervene and chase you along with the item you found (in this case cryptocurrencies) and own it for themselves. This isn't to mention the computing power that would be required to house an AI that would be able to process such hefty task with achievable time and progress. AI at this point alone is already costing the planet billions of dollars in operational costs and is already burning more fossil fuels than when people started to mine cryptocurrencies with their work PCs. What more would it be if AI is now taught to take on processes like these in the future? We need scalable energy resource solutions or else this wouldn't really be a possibility.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Spaceman1000$",
      "created_time": "February 26, 2024, 12:50:46 PM",
      "body": "Quote from: 0t3p0t on February 26, 2024, 10:08:56 AM*Another topic I made on the other forum and I also wanted to share it here so we can discuss.QuoteI just found this article here: QuoteIn 2013, Howells, from Newport, Wales, accidentally threw out the hard drive which contained 8,000 Bitcoin.Source: https://www.unilad.com/news/uk-news/james-howells-threw-away-bitcoin-ai-find-it-681168-20240224Though I've already heard of stories of people accidentally lost their huge holdings of Bitcoins but this guy is using AI to locate the missing hard drive that has 8k Bitcoins on it. So my question here;1. Does AI really has the ability to track the hard drive given that it has lost 11 years ago?2. How much do you think is the percentage of odds of finding that hard drive again using AI tech?3. If that hard drive will be found in one of these days, do you think the Bitcoins inside it can still be recoverable using current technology? (Take note it's been 11 years on the ground if not being sold to junk shops by scavengers.)I think given the length of time he has lost the hard drive, I feel he should just let go. Because is either it has been grinded since it's in an environment full of waste. If the local council are to do excavation they will probably do it in an environmental friendly method which to me might not really help, because given the length of time, they need to do a thorough digging of the soil which my probably leave that landscape with a different topology. So for your first question OP, 1, according to the article an AI was built to detect hardware or hard drives as the case maybe, so you should be looking forward to excavating more hard drives.2, the chances of finding that hard drive are very low given the length of time it has gone missing, however if it is found is more of a miracle but on the percentage level, the chances are low.3. Even if it is been found, it must have suffered a deep level of decay given the length of time it has been under the soil.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hatshepsut93",
      "created_time": "February 26, 2024, 03:29:44 PM",
      "body": "Quote from: 0t3p0t on February 26, 2024, 10:08:56 AMQuoteIn 2013, Howells, from Newport, Wales, accidentally threw out the hard drive which contained 8,000 Bitcoin.1. Does AI really has the ability to track the hard drive given that it has lost 11 years ago?2. How much do you think is the percentage of odds of finding that hard drive again using AI tech?3. If that hard drive will be found in one of these days, do you think the Bitcoins inside it can still be recoverable using current technology? (Take note it's been 11 years on the ground if not being sold to junk shops by scavengers.)[/quote]1. You need to physically search through piles of garbage, AI can't help here in any way2. So there's zero chance AI will find anything3. That hard  drive likely got damaged after the first few months on the dumpster. There are rains, and there's a lot of possibility for mechanical damage as more garbage gets piled on. It sucks to lose 8k coins, but the worst thing to do in this position is to desperately try to get them back. Better just move on.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}