{
  "id": "topic_5413398",
  "title": "Question:",
  "author": "EarnOnVictor",
  "created_time": "September 13, 2022, 10:28:48 AM",
  "content": "Two important US news on inflation are due for release today, which makes me deem it fit to alert my fellow BTT member since we are all Bitcoin lowers. This news has had a strong impact on Bitcoin since many months ago, and I believe this month can't be an exception.The figures in the image below show that the CPI (change in the price of goods and services purchased by consumers in the US) will decrease from 0.0% to -0.1% and the Core CPI (change in the price of goods and services purchased by consumers, excluding food and energy in the US) will remain the same as 0.3%. These are however the expectations of economists, which might or might not be the figure when the actual release is reported.However, judging by the history of some immediate past CPI (left image below) and that of the Core CPI (right image below), inflation was on the rising until the one released in August (July inflation reports). My prediction is that if the actual CPI and Core CPI released today are either the same as economists expect or are below it, then Bitcoin would rise. But if the actual values are higher than the expectations, then Bitcoin would fall.Note: The news would be released at 1:30 GMT +1 todayYou can drop your predictions too. Thanks!",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5413398",
  "comments": [
    {
      "author": "EarnOnVictor",
      "created_time": "September 14, 2022, 06:49:50 AM",
      "body": "ReviewI was glad to have alerted everyone yesterday about the US inflation news that made Bitcoin dive significantly lower from its bullish path. This must have put to rest the arguments of many people that did not agree with me the last time I wrote a similar thread that CPI and Core CPI made Bitcoin rise in August. I don't just write, I am well experienced, I write facts. The post could be seen here: https://bitcointalk.org/index.php?topic=5409456.msg60731162#msg60731162Yesterday's fundamental analysis was correct, the rise in the reports of the US CPI and Core CPI caused the fall witnessed as I predicted in my forecast before the news. I will be updating such kind of news every month on this thread to alert you guys.You might also want to be regularly checking my dedicated Bitcoin daily speculations at: https://bitcointalk.org/index.php?topic=5410763.0The results have been wonderful so far as a daily guide for Bitcoin enthusiasts. This is my contribution to the development of the forum. Cheers!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gayong88",
      "created_time": "September 15, 2022, 08:12:17 AM",
      "body": "My Opinion Today, a small amount of money has been invested in Bitcoin from people who have heard of this currency. But most of the users of this currency have not bought bitcoins. So there will be some movement in the market today. In the next few years, more people will join this community and invest their money in Bitcoin because bitcoin has a very good future.Today's US Inflation News is showing signs that Bitcoin is going up. It is a matter of supply and demand. When there is more to offer, it lowers prices while increasing supply. If less is available, the demand will increase, so it will have a higher value.If the actual value falls below expectations, this could push Bitcoin up later in the day, and it may take a while to adjust.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Leviathan.007",
      "created_time": "September 16, 2022, 08:20:41 AM",
      "body": "Three days passed and the effect of the inflation news still changing something on the markets and the cryptocurrency market is one of them. we all know how this news can affect but these are all temporary because in the short-term this will affect the market and make the price fall but after disappearing these effects the market can recover and the effect won't change anything in long term for any market. This will take some time to stabilize the market once again and since we are still in the bearish season for the cryptocurrencies It's normal for the price to break more support areas.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "el kaka22",
      "created_time": "September 16, 2022, 03:58:43 PM",
      "body": "It's clear that inflation is still going strong, but at least it is lower on the movement speed and that is what matters. Is it the 3% that we would like to see? It is not , but is it still going up insanely high? It is not.If we keep this up and the rate goes on like this for at least 2-3 years, I mean the pace, then we are going to see a drop and that means 2022 will be bad but 2023 will be better, and 2024 will be actually a good year again. That is why it is not about the drop, it can't drop right away, but it is about staying steady, as long as prices do not keep on going up super high, then it means they are staying same and we can go back to normal days.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gozie51",
      "created_time": "September 16, 2022, 10:16:11 PM",
      "body": "Whatever effect that we can think of that will not be on a long-term, it is just for the temporary but not on longtime, it is not capable of causing a change of trend or redirection. The news that will affect bitcoin are those that are talking directly regarding bitcoin like the big players of cryptocurrency, as we had the dump news of bitcoin from Tesla which dragged bitcoin gradually to this level now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "passwordnow",
      "created_time": "September 16, 2022, 10:30:13 PM",
      "body": "Quote from: Gozie51 on September 16, 2022, 10:16:11 PMWhatever effect that we can think of that will not be on a long-term, it is just for the temporary but not on longtime, it is not capable of causing a change of trend or redirection.This is what I'm thinking for this inflation although it may go medium term and the effect could be like that but I know that it will lie low somewhere in the near future.Quote from: Gozie51 on September 16, 2022, 10:16:11 PMThe news that will affect bitcoin are those that are talking directly regarding bitcoin like the big players of cryptocurrency, as we had the dump news of bitcoin from Tesla which dragged bitcoin gradually to this level now.Those words that come from those companies impact bitcoin. But we've seen that the majority of the markets are connected somehow and with all the same factor that meets and it's with inflation. As for bitcoin, it should be the opposite but I guess this is a temporary connection and eventually, it will disconnect from what's happening with the world market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "samcrypto",
      "created_time": "September 16, 2022, 10:34:44 PM",
      "body": "Quote from: Gozie51 on September 16, 2022, 10:16:11 PMWhatever effect that we can think of that will not be on a long-term, it is just for the temporary but not on longtime, it is not capable of causing a change of trend or redirection. The news that will affect bitcoin are those that are talking directly regarding bitcoin like the big players of cryptocurrency, as we had the dump news of bitcoin from Tesla which dragged bitcoin gradually to this level now.There's an analysis that Bitcoin is somehow connected to the trend of US Market so probably this can also affect the Bitcoin market just like what we are seeing right now. Real inflation in US is really huge, and continuously increasing the interest rate might affect everything, so better to have a good strategy now on how you can approach the market and still make profit. Bitcoin might stay longer in a bear market as long as the world market is still down. Hard to know though how long this temporary down is, this can take years before it recovers.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EarnOnVictor",
      "created_time": "September 20, 2022, 07:06:39 AM",
      "body": "Quote from: Gayong88 on September 15, 2022, 08:12:17 AM My Opinion Today, a small amount of money has been invested in Bitcoin from people who have heard of this currency. But most of the users of this currency have not bought bitcoins. So there will be some movement in the market today. In the next few years, more people will join this community and invest their money in Bitcoin because bitcoin has a very good future.Today's US Inflation News is showing signs that Bitcoin is going up. It is a matter of supply and demand. When there is more to offer, it lowers prices while increasing supply. If less is available, the demand will increase, so it will have a higher value.If the actual value falls below expectations, this could push Bitcoin up later in the day, and it may take a while to adjust.What are you saying? I guess this is off-topic entirely. And as for the inflation part, how could the increasing inflation figures bring hope to Bitcoin? So disappointing.Quote from: Leviathan.007 on September 16, 2022, 08:20:41 AMThree days passed and the effect of the inflation news still changing something on the markets and the cryptocurrency market is one of them. we all know how this news can affect but these are all temporary because in the short-term this will affect the market and make the price fall but after disappearing these effects the market can recover and the effect won't change anything in long term for any market.Quote from: passwordnow on September 16, 2022, 10:30:13 PMBut we've seen that the majority of the markets are connected somehow and with all the same factor that meets and it's with inflation. As for bitcoin, it should be the opposite but I guess this is a temporary connection and eventually, it will disconnect from what's happening with the world market.I don't think that anyone could be saying this, these are inflation news, is not any ordinary news. Crypto has been battered for almost 2 years because of this and you are still calling it temporary?Quote from: el kaka22 on September 16, 2022, 03:58:43 PMIt's clear that inflation is still going strong, but at least it is lower on the movement speed and that is what matters. Is it the 3% that we would like to see? It is not , but is it still going up insanely high? It is not.If we keep this up and the rate goes on like this for at least 2-3 years, I mean the pace, then we are going to see a drop and that means 2022 will be bad but 2023 will be better, and 2024 will be actually a good year again. That is why it is not about the drop, it can't drop right away, but it is about staying steady, as long as prices do not keep on going up super high, then it means they are staying same and we can go back to normal days.You are not getting it, this is already a clue for everyone that inflation is negatively affecting Bitcoin and it will continue to do so if it does not subsides. Meaning that good speculators will have it in their minds that they will only rely on a bullish run when inflation is only decreasing.Quote from: Gozie51 on September 16, 2022, 10:16:11 PMWhatever effect that we can think of that will not be on a long-term, it is just for the temporary but not on longtime, it is not capable of causing a change of trend or redirection.This is where most of you are getting it wrong. You should rather speculate than assume based on instincts. The news is inflation news that happened when the weekly and monthly charts of Bitcoin are bearish in signal and you are saying it could not cause a long-term effect. Tell me, what would it cause if not long-term sell after economic and technical analyses agree on it? Let us be constructive here.Quote from: samcrypto on September 16, 2022, 10:34:44 PMThere's an analysis that Bitcoin is somehow connected to the trend of US Market so probably this can also affect the Bitcoin market just like what we are seeing right now. Real inflation in US is really huge, and continuously increasing the interest rate might affect everything, so better to have a good strategy now on how you can approach the market and still make profit. Bitcoin might stay longer in a bear market as long as the world market is still down. Hard to know though how long this temporary down is, this can take years before it recovers.  You are the only person I could see replying constructively and correctly so far, others don't even know what they are saying. The US and the USD have a major influence on the world and the world's economy, which is why any strong news from the country that could have an influence on the USD would strongly affect any asset paired with the currency. Bitcoin is no different here as higher inflation forces the risk-off USD higher, and risk-on assets like Bitcoin lower, and vice versa.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}