{
  "id": "topic_5433374",
  "title": "DdmrDdmr",
  "author": "DdmrDdmr",
  "created_time": "January 07, 2023, 04:21:37 PMLast edit: January 08, 2023, 02:11:41 PM by DdmrDdmr",
  "content": "Los bancos no es que sean amigos de las criptomonedas en general, y aunque algunos de ellos pueden llegar a tener cierto interés en generar bienes y servicios entorno a bitcoin et al, parece que aún estamos lejos de lo que años atrás parecería entonar una senda más positiva en perspectiva. Hay pinitos, pero nada de una generalización del tipo de servicio que pivote entorno a las criptomonedas.La otra vertiente es la de los fondos de reserva de los bancos. Hemos leído libros acerca de cómo los bancos podrían eventualmente tener una buena parte en bitcoin, pero las cosas apuntan en otra dirección.Así, los bancos Europeos, que parecen adelantarse a los de otros países, tienen por objetivo 2023 no tener más de un 2% de su capital expuesto a las criptomonedas, y aun así, las monedas estables son eminentemente preferentes ante las monedas que consideran no tener respaldo, como es el caso del bitcoin y del ethereum (el artículo prácticamente las ubica en el Infierno de Dante, por así decirlo).La cifra anterior del 2% suena incluso elevada para la realidad actual de los bancos, y quizás estén marcando ya los límites antes de que a algún banco se le ocurra tener mayor exposición que la cita cifra.No me queda claro el alcance práctico real, y si esto delimitará, en su caso, la capacidad efectiva de ofrecer productos y servicios basados en las criptomonedas. En todo caso, sí que parece poner un umbral bajo para aquellos bancos que quieran explorar la vía con peso específico.Edit:https://www.lavanguardia.com/economia/20230107/8669678/bancos-preparan-cortafuegos-frente-cripto-mas-problematicas.html",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5433374",
  "comments": [
    {
      "author": "famososMuertos",
      "created_time": "January 07, 2023, 10:28:22 PM",
      "body": "Es como si los Bancos fueran llevando el ritmo en un segundo plano, como la música del Lobby en dónde está bitcoin, todo lo que sucede con bitcoin es en cierta manera independiente de ese aura musical.Pero están ahí sonando y en cierta manera con el control del volumen... literal en la nota de la polisemia.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Don Pedro Dinero",
      "created_time": "January 08, 2023, 05:55:15 AM",
      "body": "Bueno, de la pinta que pueda tener ahora a la realidad de dentro de unos años puede haber un cambio sustancial.Si el bitcoin se acaba imponiendo como un oro digital mejorado, los bancos, sobre todo centrales comprarán bitcoin para sus reservas. No es una cuestión de gustos o de concepción sobre lo que es el bitcoin. Si fuera así, y pongo énfasis en el condicional, el que no adquiera ese oro digital mejorado, o incluso lo mine, estará en desventaja.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Porfirii",
      "created_time": "January 08, 2023, 11:09:44 AM",
      "body": "Quote from: DdmrDdmr on January 07, 2023, 04:21:37 PM... Así, los bancos Europeos, que parecen adelantarse a los de otros países, tienen por objetivo 2023 no tener más de un 2% de su capital expuesto a las criptomonedas, y aun así, las monedas estables son eminentemente preferentes ante las monedas que consideran no tener respaldo, como es el caso del bitcoin y del ethereum...No acabo de entender esto, ¿cuando hablas de monedas estables te refieres a stablecoins como USDT o BUSD? ¿o a las (aún proyectadas) CBDCs de los Bancos Centrales?Porque preferir la segundas no me extrañaría, al fin y al cabo estamos hablando de bancos tradicionales, casi es obvio; pero si nos referimos a las primeras, verdadero dinero de Monopoly, no veo muy inteligente la postura.P.S. ¿Podrías compartir el enlace al artículo?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DdmrDdmr",
      "created_time": "January 08, 2023, 02:36:00 PM",
      "body": "Quote from: Porfirii on January 08, 2023, 11:09:44 AM<…> P.S. ¿Podrías compartir el enlace al artículo?Me lo dejé en el documento donde escribí el contenido del post:https://www.lavanguardia.com/economia/20230107/8669678/bancos-preparan-cortafuegos-frente-cripto-mas-problematicas.htmlPor lo que veo, La Vanguardia se basa en una información de Fitch, que debe ser esta de hace algunos días:https://www.fitchratings.com/research/banks/global-bank-rules-capital-reqs-discourage-crypto-backed-loans-23-12-2022En este último artículo, el tono es un tanto más amable, y de hecho, cita que los activos cripto mantenidos en custodia no estarían supeditados a estos límites de prudencia. Es decir, el artículo de La Vanguardia se ha dejado información relevante que hace cambiar el panorama de lo que realmente se quiere aplicar, al omitir la frase relativa a la custodia.Quote<…> Crypto assets held on a custody-only basis will not be subject to prudential requirements. <…>Visto la frase anterior, mi interpretación es que la limitación está más en la órbita de las reservas y préstamos colaterizados, que del negocio core de productos y servicios, donde siempre podrían decir que la cripto está en custodia con responsabilidad limitada en caso de robo y nula en caso de devaluación (hipótesis que lanzo).En cuanto a las monedas estables, me da que están hablando de las gubernamentales, y viendo el redactado del artículo de Fitch, éstas quedan exentas del límite del 2%, lógico por otra parte, al ser una mera digitalización alternativa del fiat ya existente.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}