{
  "id": "topic_5461261",
  "title": "Odohu",
  "author": "Odohu",
  "created_time": "July 28, 2023, 01:09:23 AM",
  "content": "My fellow country people, make una follow me reason this tory wey I carry come maybe one or two person fit learn how to be safe as a Nigerian. One day you come outside make you for feed your eyes small for wetin street dey talk, you come see say two people dey pursue one guy man say him na thief. True true the guy na thief and na expensive item him steal for one store. As him dey run, luck no too follow am, so them come catch am and na so him start to beg. You dey one corner dey observe as them start to beat am, the guy dey beg but them no gree. You come start to dey go closer make you for observe everything better and see weda na person wey you know and if you fit put mouth beg too; other people too don dey face that side as e dey be na when people hear noise. But as you don dey near there, one of the people wey catch am wey happen to be the owner of the shop come carry something hit the thief, na so the thief voice loss... him no dey move or talk again! By this time, you don dey very close to them when you observe say them don knack the thief something wey strong wey fit mean say the guy don kpeme, but you never confirm sha o. Immediately, you come match break, come reverse and begin to discharge for the area, as a Nigeria make wetin you no know no put you for wahala. If e  happen say true true the guy die and camera dey somewhere wey capture everything and all the people wey dey near the area as e happen... and e come be say you comot for the area run go your house, base on Nigeria system, you dey free or you no dey free? If the person no dey free, wetin be the right thing wey the person suppose do? Remember o, them never confirm say the person don die... you just observe as they knack am and as him no dey move or talk again, and you take off immediately.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5461261",
  "comments": [
    {
      "author": "Obari",
      "created_time": "July 28, 2023, 01:51:13 AM",
      "body": "According to your story, you no really reach the crime scene  fully so no need to fear.Along as you no follow beat the thief,You no follow shout make them beat the thief and you no really reach the crime scene, then nothinh to fear about because this na Nigeria and the truth be say l, except say that thief get person wey fit fight for am which I no sure, then the matter as long as na theft related and if the owner of the shop get better compass, then nothing dey to fear as our police force na one of the most easiest to influence as long as you fit pay.If this matter wey you bring so, dey directly related to you, then I wan assure you say you no need to fear at all because nothing dey happen and normally you no follow especially  since camera  dey wey capture people we gather beat the guy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EluguHcman",
      "created_time": "July 28, 2023, 08:37:13 AM",
      "body": "Along d line, I no reach dia finally so na to make my Waka like I jst dey pass by & if by means u gt to b queried, d way u talk na so camera dey catch am too. If e too much e take ur questioners to d pipo way beat of kill am dia shop or houses cuz as u dey house relax b4 dem com query u, na so others too go dey dia shops & houses since u say jungle justice don b com normal tin 4 dem dia so dem go vomit tins by dem self say u no foloOtherwise... U dey free",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "heenachawlaa",
      "created_time": "July 29, 2023, 11:57:55 AM",
      "body": "Our Goa Call Girl girls are not only beautiful and perfect but also honest and  Goa Escort  will give you genuine love and satisfaction. This Call Girl Agency Goa can help you have the most romantic time of your life.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "anika02",
      "created_time": "July 29, 2023, 12:54:27 PM",
      "body": "This is a fact that you can easily find in any search engine. In our Mumbai Escorts, girls get recruited based on their ability and field of interest. You can trust that the girl you choose will be your friend and make your dreams come true.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Makus",
      "created_time": "July 29, 2023, 01:00:00 PM",
      "body": "my broda with all the information wey you give if at all say the person come kpeme from the knack wey dem knack am, civilised police go interrogate people wey dey the street especially those wey dey around the scene and dem go arrest the people wey take laws into their own hands but just as I been talk \"civilised police\", my broda kpokpo for we country go first do mass arrest for the whole street before dem even watch the video to catch the people wey beat the thief and if you nor dey careful dem fit catch you join.if the matter na death case you nor dey free oo because dem no go stop until dem get all the people wey face show for the camera but las las na money go solve the problem except for the people wey use hand touch the thief.for your case sha, the only thing wey I fit advise na for you to put this matter for God hand, e no get any thing wey e nor fit do.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Smartvirus",
      "created_time": "July 29, 2023, 10:52:51 PM",
      "body": "You don talk am finish say, you no confirm am if the person don die or not, you only think say e dey possible via say, you observe say them don knack the thief strong thing way fit make am kick bucket.It's not in your place to take any action. You no fit take action based on suspicion as you never confirm say the thief don die, the thief no be your person, e no die for your hand, 3 no thief for your shop and the closest thing way bring you for the matter be say, you observe a part of watin happen.So watin you go do be say, you go wait make you get confirmation if the guy kick bucket and na base on the hit way you think say that guy hit am.  If e tur case way them require weakness and you dey called upon, you go talk the past way you see. If them no con give you, Jejely remain your house, no be your matter!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sim_card",
      "created_time": "July 31, 2023, 03:55:02 AM",
      "body": "Bros as long as na thief no cause for alarm,since if police come around,he dey clear say people go say na thief. Remember for Nigeria wey we dey people dey kill thief and nothing police dey do about the matter. If your conscience dey judge you,then know say you no get any power to change wetin don happen. For the state wey I grow up,if bad boys won kill you,them go start to dey beat you dey shout thief for your head because them no say na only wetin go make them get free access to kill you and nobody go talk,instead them go join hand beat you. Na only police go fit come to your rescue then,so to cut all the long story short. You are not part of the killers.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Smartvirus",
      "created_time": "July 31, 2023, 09:32:22 AM",
      "body": "Quote from: Sim_card on July 31, 2023, 03:55:02 AMBros as long as na thief no cause for alarm,since if police come around,he dey clear say people go say na thief. Remember for Nigeria wey we dey people dey kill thief and nothing police dey do about the matter.Before you consider an as a thief, first consider say na human being. This person na person papa, Pikin, brother or sister. Yes, we know say this thieves them dey heartless and the nature of work way them dey do no be watin them dey pity person way go con make them require pity when them grab them like this but, killing person as e describe so, na jungle justice them dey call am and in the site of the law, that doesn’t make it right or the people way kill am to be less than a criminal. Na still murder be that o, make e clear.You saying our arm forces and agencies no go do anything about am, that na lie o. No be for person way them catch and no be thief way get person. Na court dey talk am finish and you taking judgement and dishing out death penalty, that makes you the law which no suppose be so. Nigeria dey act like say we dey lawless but law dey.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gozie51",
      "created_time": "July 31, 2023, 03:15:10 PM",
      "body": "Op I no think say anything concern the person wey no reach crime scene na. Other people dey dere wey beat and kpai the thief. At least camera go show the footage.Quote from: Smartvirus on July 31, 2023, 09:32:22 AMRemember for Nigeria wey we dey people dey kill thief and nothing police dey do about the matter.Bro we no say thief dey do people shege but that one no be the thing to take kpai person except say na on defense for your life but if na say mob catch the person wey thief, na to hand am over to person. However, we also know say if police see money, them eyes go dey shine so the thief fit bribe him way out but or a normal, if them catch one thief e suppose lead to catching of more of them from investigation and torture wey them go give the one in their custody, at least na one benefit of taking them to station even though say the legal system, police dey corrupt too much.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Marykeller",
      "created_time": "July 31, 2023, 04:13:14 PM",
      "body": "Person wey d around the crime scene no mean sae em follow kpai the peso, if to sae the peso die. The peso d as free as the bird, if to sae the camera d around the crime scene and em capture the whole beating wey people give the thief. Since the peso hand no touch the thief, em conscience suppose the free, em no suppose worry for the matter. I remember when I be young kid, I been witness this kind jungle justice for my area, I see as people take beat thief, wetin no d good commot em body until em die. When when em die, na when them come set am ablaze. I can't forget the incident up till date even though I observed the jungle justice from afar. Na after when the jungle justice don happen finish, na when police come show. They begin to the do massive arrest for my area. They begin to the arrest every young guy or papa wey d my area weda the follow for the killing of the thief or not.Wetin I wan talk be sae, anywhere wey peso see jungle justice happen, wey em avoid that area for the time being. You know why? When police show for the matter, I no follow no be wetin them go hear until you follow them reach station to bail and explain yourself out.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptoHeadlineNews",
      "created_time": "July 31, 2023, 07:27:02 PM",
      "body": "Quote from: Odohu on July 28, 2023, 01:09:23 AMIf e  happen say true true the guy die and camera dey somewhere wey capture everything and all the people wey dey near the area as e happen... and e come be say you comot for the area run go your house, base on Nigeria system, you dey free or you no dey free? If the person no dey free, wetin be the right thing wey the person suppose do? Remember o, them never confirm say the person don die... you just observe as they knack am and as him no dey move or talk again, and you take off immediately.  For me, I go talk say for the fact say you no been dey the crime scene, but at a distance & yet no be you carry plank knack the suspected victim for head wey kpai am, as eh go show for camera we been dey video the whole event, me ah go talk say eh no get any business to do with you as per say you dey free. But however, that no mean say make you no comot for that environment for that moment wey that murder incident happen oh, because if police come to do mass arrest, they no go wan hear weather you been dey among or not until all of una don reach cell, and you know what that means, as to bail yourself go cost nothing less than 50k to 100k, since na murder case. So best thing when such happen na to just leave that environment since still yet no be you kill am.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptopreneurBrainboss",
      "created_time": "August 01, 2023, 10:49:58 PM",
      "body": "Quote from: Odohu on July 28, 2023, 01:09:23 AMIf e  happen say true true the guy die and camera dey somewhere wey capture everything and all the people wey dey near the area as e happen... and e come be say you comot for the area run go your house, base on Nigeria system, you dey free or you no dey free? If the person no dey free, wetin be the right thing wey the person suppose do? Remember o, them never confirm say the person don die... you just observe as they knack am and as him no dey move or talk again, and you take off immediately.  First shout say you go pay if you dey in this kind situation, nobody wey go hear that one wey no go calm down first. Make we no dey rheowawauface when we see jungle justice going on.. e fit be say e no concern you since you get any relation with the person wey dem dey beat bit Ike day e fit be someone wey you sabi (friend, brother, relative etc) so always help those experience in this type of treatment because e no good. Me I no happy as this  person dey commot so. Id you feel say dem go out and die your head oya used camera capture things as you dey go help the person in need.The thing be say, most times wey this jungle justice dey go on, the person wey dey receive am no dey guilty and everyone is innocent until proven guilty in the  court of law so no allow people carryon this kind devilish act for your presence and no wash your hands commot, put your hand you no know if you go fit saves a soul like that. For this particular matta so I go try see if I fit save this person before it's too late. Running is been a coward, you no follow them and you just need an evidence for that and you try to help the individual in need. This kind matter them na God wey go bless you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Smartvirus",
      "created_time": "August 01, 2023, 11:58:32 PM",
      "body": "Quote from: Gozie51 on July 31, 2023, 03:15:10 PMQuote from: Smartvirus on July 31, 2023, 09:32:22 AMRemember for Nigeria wey we dey people dey kill thief and nothing police dey do about the matter.<snipe>Bro, e be like you for try edit that your comment o. The kpai their idea no be my idea, na person I quote but, your editing done turn am like my words. I no buy the idea of to kpai thief just like that shah, make after story no con dey gor irreversible events like death. Try check am later shah.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Forever101",
      "created_time": "August 02, 2023, 08:54:43 PM",
      "body": "Actually, u no dey guilty of any crime committed base on the video coverage and your actions. As this matter still be so, e be like say jungle justice still dey brekete for some part of our naija. This thing na bad thing, person wey even dey throw stick and stone fit be ogbonge thief. Make we enlighten everybody for our area about the bad effect of jungle justice as it eliminate or cut short life over useless and non essential things . Life is more precious, we need to value life than anything else. The sin of jungle justice which is in most case death (murder) , is worse than stealing. Jungle justice is an act that is 1 million times worse than stealing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Odohu",
      "created_time": "August 04, 2023, 01:23:12 PM",
      "body": "Quote from: CryptopreneurBrainboss on August 01, 2023, 10:49:58 PMQuote from: Odohu on July 28, 2023, 01:09:23 AMIf e  happen say true true the guy die and camera dey somewhere wey capture everything and all the people wey dey near the area as e happen... and e come be say you comot for the area run go your house, base on Nigeria system, you dey free or you no dey free? If the person no dey free, wetin be the right thing wey the person suppose do? Remember o, them never confirm say the person don die... you just observe as they knack am and as him no dey move or talk again, and you take off immediately.  The thing be say, most times wey this jungle justice dey go on, the person wey dey receive am no dey guilty and everyone is innocent until proven guilty in the  court of law so no allow people carryon this kind devilish act for your presence and no wash your hands commot, put your hand you no know if you go fit saves a soul like that. For this particular matta so I go try see if I fit save this person before it's too late. Running is been a coward, you no follow them and you just need an evidence for that and you try to help the individual in need. This kind matter them na God wey go bless you. This jungle justice of a thing is so common especially in the East and is fast spreading to the Southern and Western parts of Nigeria. It is totally wrong and uncivilised. For Aba, you no need steal or be caught with anything... make person just shout thief o and point your side, boom, fuel and fire don ckme out from no where.  Like you rightly said, majority of victims of jungle justice are innocent people; even setup can make them kill someone.  Well you will agree with me that our law enforcement agencies are not also trying... no forget mass arrest do happen where mostly innocent people are made to answer for and sometimes punished for crimes they know nothing about. I think these are some of the practices that discourage people from interfering whenever there is issue of jungle justice.  Instead of helping, people will flee to avoid getting into trouble. In all of these, the love for humanity is seriously dying... people are becoming so self-cantred, not minding what happens to the next person. That is why people dey happy if light go everywhere and not only their own house.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "anika02",
      "created_time": "September 08, 2023, 12:16:04 PM",
      "body": "If your trip is scheduled for a long time then you must add these pilgrimages into the list of your visiting destinations. Lucknow Call Girls You can appoint an independent India escorts and explore the beauty of the town while accompanying a gorgeous girl. You don’t need to hesitate while calling us because we understand your needs perfectly.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dzwaafu11",
      "created_time": "September 08, 2023, 04:13:33 PM",
      "body": "Quote from: Odohu on July 28, 2023, 01:09:23 AM You dey one corner dey observe as them start to beat am, the guy dey beg but them no gree. You come start to dey go closer make you for observe everything better and see weda na person wey you know and if you fit put mouth beg too; That place wey u no go na wetin favor you be that because why you go put mouth for wetin no concern you and you fit go there make e be another problem for you, because as they knack am that thing if him die the matter con be serious issue you fit enter problem.. however as you talk say weda you fit out mouth help the thief beg if na person wey you know, for me if you see person wey you know thief they con they beat am just pass as if you don’t even know wetin happen. How you wan follow thief beg people and they don confirm a say him thief. You know say e go be something wey you know con think bah if care is not taking they beat you for that place, because there is no way wey you go see say them they beat person wey be thief and they don confirm me I go con put mouth I no dey do am.Quote from: Odohu on July 28, 2023, 01:09:23 AMIf e  happen say true true the guy die and camera dey somewhere wey capture everything and all the people wey dey near the area as e happen... and e come be say you comot for the area run go your house, base on Nigeria system, you dey free or you no dey free?Why you fear? Even if you no run go your house they do am in your presence as far as you no put hand beat the thief or talk for there you just look them why you go con fear, if they come to you normal thing make you ask them they see you when you beat am? So as you no do anything no need to fear na.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Stable090",
      "created_time": "September 09, 2023, 10:18:05 PM",
      "body": "Quote from: Odohu on July 28, 2023, 01:09:23 AMIf e  happen say true true the guy die and camera dey somewhere wey capture everything and all the people wey dey near the area as e happen... and e come be say you comot for the area run go your house, base on Nigeria system, you dey free or you no dey free? Dis story serious ooo, but if dis kin matter happen, and dey wan arrest people, u no dey free ooo, you self na eye witness, so police go carry you and u go drop statement about Wetin u see and how e take happen. Me I no dey like anywhere wey be say dem dey pursue thief or violence dey happen, because if police reach there, they no wan hear say u dey d place or not, dey no care if you dey among people wey kill d person or not, dem go arrest you. But dis ur own now if too say police wan truly do there work, even if dey arrest d person, dey suppose free d person since camera dey d place and e show people wey really kill d thief, ur own na just because you dey d area, but u no join hand beat d thief. Quote from: Odohu on July 28, 2023, 01:09:23 AMIf the person no dey free, wetin be the right thing wey the person suppose do? Remember o, them never confirm say the person don die... you just observe as they knack am and as him no dey move or talk again, and you take off immediately.  Since no be say anything don happen, na to just stay calm and dey look now, since camera dey d area and if dey check am dey go see Wetin everybody do, since u no join hand beat d thief, then I no dey sure say u go get any problem, but u know our country police, dey go wan use d opportunity chop money. just make sure say u dey low key for your house.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pokapoka124",
      "created_time": "September 09, 2023, 10:32:41 PM",
      "body": "Normally if police come the area that time as e dey hot them for arrest everybody them see for road weda you join or you nor join. For that cctv part, I nor sure say cctv dey for trenches o cos na for only trenches them dey do jungle justice. This kind matter na to avoid where e take dey hapun cause when e go burst na aproko people go call everybody name way dey involve.Quote from: heenachawlaa on July 29, 2023, 11:57:55 AMOur Goa Call Girl girls are not only beautiful and perfect but also honest and  Goa Escort  will give you genuine love and satisfaction. This Call Girl Agency Goa can help you have the most romantic time of your life.Who be this werey na here you won come advertise your ashawo business.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}