{
  "id": "topic_5427055",
  "title": "bitmover",
  "author": "bitmover",
  "created_time": "December 08, 2022, 04:57:25 PM",
  "content": "Quotehttps://livecoins.com.br/clientes-nao-conseguem-sacar-na-binance-e-se-revoltam-com-exigencia-de-declaracao-renda/ Sem conseguir sacar, está preocupado com seu dinheiro preso na plataforma, um valor que para ele é considerável.Surpreendido pela Binance, o cliente que prefere não se identificar disse que a prática é duvidosa em sua opinião.    “Eu vinha operando normal, na realidade estou me posicionando no mercado. Então não estava nem fazendo trade, somente comprando um pouco de btc por dia. Porém, ia sacar um valor, devido a contas que tenho que pagar.    Somente bloquearam e fui atrás de enviar meus documentos, imposto de renda 2021, extrato bancário de 3 meses comprovando minha renda de autônomo, tipo coisas que na realidade nem deveriam solicitar para sacar né. Chega ser duvidoso isso.”Esse usuário relatou que após usar repetidamente a corretora, foi avisado de que precisava enviar a declaração de imposto de renda para sacar.Quero frizar aqui o quão sensível é esse documento. Esse documento não ppde nunca ser exigido por uma entidade privada,  a não quer legalmente obrigada a recebê-lo.  O IRPF contém TODOS os seus dados de renda e patrimônio  e é um abuso a exigência dele para qualquer assunto que seja.Agora me ascendeu um \"red light \"  com a binance. Vou evitar mover altos valores lá por um tempo.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5427055",
  "comments": [
    {
      "author": "rdluffy",
      "created_time": "December 08, 2022, 05:46:21 PM",
      "body": "Essa situação é ridícula por vários motivos como você mesmo já citouMas por que aceitar que o usuário deposite e faça transações então? Por que não bloqueiam logo de cara e falem: olha, estamos devolvendo seu dinheiro e até que você comprove sua renda não aceitaremos.Isso pra mim é a maior prova de má fé que uma corretora faz com o clienteJá estou pegando ranço com a Binance não é de hoje então até minhas migalhas que ficaram lá irão ser retiradas sem dó.A própria Binance não é clara quanto seu Headquarter, sua jurisdição etc, dse diz totalmente pró cripto e faz isso?Se tem dúvidas e quer agir de acordo com a lei, libera o dinheiro do usuário e manda uma notificação para a receita então ué.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "alegotardo",
      "created_time": "December 09, 2022, 12:53:16 AM",
      "body": "Quote from: bitmover on December 08, 2022, 04:57:25 PMQuero frizar aqui o quão sensível é esse documento. Esse documento não ppde nunca ser exigido por uma entidade privada,  a não quer legalmente obrigada a recebê-lo.  O IRPF contém TODOS os seus dados de renda e patrimônio  e é um abuso a exigência dele para qualquer assunto que seja.Agora me ascendeu um \"red light \"  com a binance. Vou evitar mover altos valores lá por um tempo.Me desculpe questionar logo você @bitmover e a livecoins, mas o quão \"real\" será que é essa imagem e a publicação do usuário?Eu nunca qualquer notícia da Binance exigindo esse documento, que como você já frisou... é uma prática ilegal. E além do mais, a Binance mesmo opera em uma área cinza, ou seja, nem ela atende completamente às leis brasileiras.Quase certeza que essa é uma posição arbitrária da própria Binance e não alguma \"solicitação\" que a FRB, PF, etc tenha feito para que eles monitorassem determinadas atividades ou pessoas suspeitas.Enfim, chegando à um ponto como esse, creio ser mais seguro operarmos em exchanges que estão 100% legalizadas por aqui, como a BitcoinTrade (sim, eu adoro ela) onde a gente ainda tem algum amparo legal caso algo dê merda.... não que isso possa ser uma garantia, mas é melhor que nada.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "December 09, 2022, 05:07:21 PM",
      "body": "Quote from: bitmover on December 08, 2022, 04:57:25 PMO IRPF contém TODOS os seus dados de renda e patrimônio  e é um abuso a exigência dele para qualquer assunto que seja.Não sei como é no Brasil. Mas, em Portugal esse tipo de informação é solicitada em caso do credito habitação, por parte da banca. Desconheço outros cenários onde isso é exigido. Normalmente é apenas em cenários de solicitação de créditos.Claro que outras empresas não tem de o exigir, salvo seja alguma obrigação legal. O que neste caso duvido.Estou como o alegotardo, é viável essa informação? Ou estamos a falar num caso muito especifico, e algo de errado o utilizador fez?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jayjones",
      "created_time": "December 09, 2022, 06:44:49 PM",
      "body": "Nossa.. esse tipo de coisa me dá enjoo, não deveria ser assim. Reguladores devem ta pressionando muito a binance para ela fazer essas exigências",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Paredao",
      "created_time": "December 09, 2022, 08:39:06 PM",
      "body": "Reportagem um tanto quanto incompleta. Não se sabe quanto que o sujeito estava movimentando em criptomoedas. Me parece mais um caso clássico onde o sujeito declara que ganha salário mínimo, ou nem faz declaração de imposto de renda, e compra milhares de reais em criptomoedas. Depois do que aconteceu com o Faraó dos Bitcoins, a Binance está bem atenta. Se não me falha a memória, a Foxbit também exigia declaração de imposto de renda para quem fazia uma alta movimentação em criptomoedas.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Disruptivas",
      "created_time": "December 10, 2022, 03:38:06 PM",
      "body": "Seria interessante saber mesmo sobre o caso dos outros clientes que eles citam que também estão passando por essa situação. Mas aqui realmente tem dois pontos interessantes levantados, que não se anulam, mas se complementam. A questão de ''beleza, você pode ficar depositando quando quiser, mas se algo der errado, bloqueamos seu saque.'' Isso é realmente uma forma muito ruim de se fazer as coisas. Por que eles já sabem a priori qual a % que será estranha. Acho que seria muito ético perguntar o valor para o usuário no depósito e avisá-lo que aquele valor ta estranho, que já consta um problema. E ai poderia deixar ou não ele seguir, mas esse aviso precisava sem dúvida alguma, vir ANTES. Mas claro que também pode ser uma transação super maluca, de alguem que declarou que tem R$100 e ta comprando todo dia meio bitcoin.Por isso seria interessante saber dos outros casos que eles citam no inicio da matéria.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "December 10, 2022, 06:13:23 PM",
      "body": "A fazer uma pequena pesquisa sobre este tema - que acho estranho essa informação solicitada, lembrei:Será que esse utilizador não usou o Recurso de Relatório Fiscal da Binance?Esse recurso serve, para mais facilmente o utilizador fazer a sua declaração fiscal.Ao usar esse recurso, a informação cruzada que a Binance tem acesso, poderá não fazer sentido e acionar esse alerta.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "l3pox",
      "created_time": "December 10, 2022, 06:54:24 PM",
      "body": "realmente, estranho isso.agora, pelo que sei aqui no Brasil também é comum exigirem declaração de IR ou outras formas de comprovação de renda (extrato bancário de 3 meses, por ex) ao fechar um novo contrato de aluguel de imóvel, não?talvez bitmover ou paredao possam complementar",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Paredao",
      "created_time": "December 10, 2022, 08:45:02 PM",
      "body": "Quote from: Lucasgabd on December 10, 2022, 06:54:24 PMrealmente, estranho isso.agora, pelo que sei aqui no Brasil também é comum exigirem declaração de IR ou outras formas de comprovação de renda (extrato bancário de 3 meses, por ex) ao fechar um novo contrato de aluguel de imóvel, não?talvez bitmover ou paredao possam complementarÉ comum pedir comprovação de renda quando tenta-se operações de credito. Tipo você pedindo empréstimos. Também é comum em caso de locação, apesar que depois que se criou o seguro-fiança isso diminuiu bastante. Antigamente quando não se tinha os bancos digitais, os \"bancões\" pediam comprovantes de rendimento para se abrir uma conta corrente. Lembro que vários contadores ganhavam um bom dinheiro somente para emitir o DECORE (declaração de rendimentos assinado por um contador) para autônomos que não tinham como comprovar renda.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "December 10, 2022, 09:27:24 PM",
      "body": "Quote from: Lucasgabd on December 10, 2022, 06:54:24 PMrealmente, estranho isso.agora, pelo que sei aqui no Brasil também é comum exigirem declaração de IR ou outras formas de comprovação de renda (extrato bancário de 3 meses, por ex) ao fechar um novo contrato de aluguel de imóvel, não?talvez bitmover ou paredao possam complementarEu já vi pediram os últimos 3 contra cheques para alugar um lugar.Mas imposto de renda é um abuso, mesmo para alugar imóvel.Pq no imposto de renda tem o seu patrimônio,  não sua renda. E vc vai pagar o aluguel com a renda, não com patrimônio",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "alegotardo",
      "created_time": "December 11, 2022, 01:13:01 AM",
      "body": "Quote from: bitmover on December 10, 2022, 09:27:24 PMEu já vi pediram os últimos 3 contra cheques para alugar um lugar.Mas imposto de renda é um abuso, mesmo para alugar imóvel.Pq no imposto de renda tem o seu patrimônio,  não sua renda. E vc vai pagar o aluguel com a renda, não com patrimônio Eu estive vendo sobre esse caso, inclusive com imagens e de fato parece ser idôneo.Porém, me parece que a Binance na verdade está dando diversas opções para o usuário e não exigindo que ele envie extrato da conta corrente, contra-cheque, declaração de IR, e tudo mais.De fato isso seria um abuso, mas no caso de comprovação lícita dos ganhos, um simples extrato de conta-corrente ou contra-cheque deveriam ser o suficiente.Mas, ainda é estranho o fato da binance ter enviado apenas uma nota padrão para o Livecoins sobre o ocorrido, pois sabem (ou deveriam) que esse é um grande meio de comunicação cripto no Brasil e que essa matéria vai fazer eles perderem muita credibilidade por aqui.Como eu já disse, para saques de valores fiat, utilizem a Bitcointrade, diaante de tudo o que tem ocorrido me parece ser mais seguro utilizar uma corretora que opera 100% dentro das leis brasileiras e que tem uma excelente reputação e taxas bacanas.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "December 11, 2022, 08:38:37 AM",
      "body": "Quote from: alegotardo on December 11, 2022, 01:13:01 AMEu estive vendo sobre esse caso, inclusive com imagens e de fato parece ser idôneo.Porém, me parece que a Binance na verdade está dando diversas opções para o usuário e não exigindo que ele envie extrato da conta corrente, contra-cheque, declaração de IR, e tudo mais.De fato isso seria um abuso, mas no caso de comprovação lícita dos ganhos, um simples extrato de conta-corrente ou contra-cheque deveriam ser o suficiente.Então, o que a Binance apenas pede é uma comprovação dos ganhos, não importa o método usado. Até aqui tudo, pode fazer sentido, para se proteger caso as autoridades venham ter com eles a pedir justificação.Como surge essa mensagem? O mais certo, é haver uma serie de opções e o utilizador terá de escolher uma delas, e se não carregar um ficheiro ou o ficheiro carregado for incorreto aparece esse mensagem.Não querendo estar a defender a Binance, mas isso cheira-me mais um caso de um utilizador querer criar ideias erradas sobre a Binance, por ter ficado insatisfeito com alguma coisa, ou apenas para causar FUD.Ou até mesmo a concorrência a tentar gerar opiniões negativas, logo agora que estão para sair leis que podem colocar em causa a operação da Binance no Brasil.Eu acho sempre estranho quando este tipo de informações, mesmo que tenham alguma ponta de verdade, saírem nestes momentos cruciais.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sabotag3x",
      "created_time": "December 11, 2022, 04:46:12 PM",
      "body": "Mais clientes reclamando das exigências de declaração de renda pela Binance, desta vez chineses: https://livecoins.com.br/binance-bloqueia-contas-de-usuarios-que-lucraram-com-trades/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "December 11, 2022, 10:10:54 PM",
      "body": "Quote from: alegotardo on December 11, 2022, 01:13:01 AMComo eu já disse, para saques de valores fiat, utilizem a Bitcointrade, diaante de tudo o que tem ocorrido me parece ser mais seguro utilizar uma corretora que opera 100% dentro das leis brasileiras e que tem uma excelente reputação e taxas bacanas.Aí vai de cada um. A bitcointrade é uma corretora antiga, porém pequena. Essas pequenas podem estar sujeitas a problemas a qualquer momento. Pessoalmente, eu nunca usei, e não tenho nada contra.Eu tenho experiência com a Walltime e sempre gostei muito, mas a volume lá anda bastante pequeno e ainda menor que o da bitcointrade.As maiores corretoras que têm me chamado a atenção ultimamente, e se eu fosse arriscar outra que não fosse a binance, seriam uma dessas:Mercadobitcoin, Bitso e Novadax.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "December 12, 2022, 11:15:04 AM",
      "body": "Quote from: sabotag3x on December 11, 2022, 04:46:12 PMMais clientes reclamando das exigências de declaração de renda pela Binance, desta vez chineses: https://livecoins.com.br/binance-bloqueia-contas-de-usuarios-que-lucraram-com-trades/Segundo a Binance, esse tipo de solicitação deveu-se a uma analise interna que estava a ser feita, por um possível hack.Não deixa de ser estranho, sem duvida, mas existe sempre uma explicação.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rdluffy",
      "created_time": "December 12, 2022, 02:31:31 PM",
      "body": "Gente, não sei se é paranóia minha mas já está começando a ter muita coisa estranha acontecendo com a Binance, acabei de ver essa notícia:https://twitter.com/CoinDesk/status/1602281787828436992Pode ser um dos motivos que a Binance está reforçando as exigências de contas que movimentam muito dinheiro.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "December 12, 2022, 06:04:20 PM",
      "body": "Quote from: rdluffy on December 12, 2022, 02:31:31 PMPode ser um dos motivos que a Binance está reforçando as exigências de contas que movimentam muito dinheiro.A historia da queda da FTX, criou uma grande pressão nas autoridades com relação as exchanges, principalmente as grandes.A Binance vai ser forte atacada nos próximos tempos, na Europa já tem sido \"apertada\", mas ainda vai ser mais.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TryNinja",
      "created_time": "December 16, 2022, 08:48:35 PM",
      "body": "Fui depositar BRL na Binance e deu essa para mim:QuotePor favor, forneça sua declaração de fonte de renda. Não podemos fornecer serviços antes de receber a declaração de fonte de renda.Já movimentei uns valores bem altos, mas a conta estava semi-parada há uns meses.Fui fazer o processo e estão pedindo o meu Imposto de Renda ou contrato de trabalho, recibo de pagamento, etc... QuoteAnexe uma cópia da sua Declaração Anual de Imposto de Renda.Caso sua declaração de Imposto de Renda não esteja disponível, anexe uma cópia de um ou mais dos documentos de comprovação alternativos abaixo:- 3 últimos recibos de pagamento, contrato de trabalho ou carta de oferta do seu empregador atual;- Relatório anual de receitas/saldo de investimentos emitido por uma financeira local;- Comprovante de pagamento de dividendos (empresários);- Outro (Exemplo: Cópia de testamento; Extratos de corretoras de criptomoedas; Últimas contas auditadas da empresa; Contratos de venda ou hipoteca; Extratos bancários, mostrando pagamentos de salários, etc.);*Por favor, esteja ciente de que se você nos enviou documentos de comprovação alternativos, o tempo de análise da solicitação pode aumentar e mais informações podem ser solicitadas pelo chat.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "December 17, 2022, 12:39:24 AM",
      "body": "Quote from: TryNinja on December 16, 2022, 08:48:35 PMFui fazer o processo e estão pedindo o meu Imposto de Renda ou contrato de trabalho, recibo de pagamento, etc... Bem, isso é quase o mesmo para quem esta a pedir um empréstimo ao banco.Será que isso não está relacionado com a nova lei que esta para sair, que temos estado a debater noutro tópico?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}