{
  "id": "topic_5465937",
  "title": "Trawda",
  "author": "Trawda",
  "created_time": "September 07, 2023, 04:50:04 AM",
  "content": "السلام عليكمإخواني عندي سؤال لو سمحتولنفترض أن لدي محفظة صلبة تريزور أو ليدجر أو أي نوع آخر وقمت بحفظ البذرة على ورقة ثم قام شخص ما بسرقة هذه الورقة المكتوب عليها البذرة دون المحفظة. السؤال هو: هل يتمكن من استعادة المحفظة عن طريق محفظة إلكتريوم أو أي محفظة أخرى بواسطة البذرة التي حصل عليها؟ مع العلم أنه لم يحصل على المحفظة الصلبة؟",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5465937",
  "comments": [
    {
      "author": "Nalain420",
      "created_time": "September 07, 2023, 10:35:11 AM",
      "body": "وعليكم السلام أخي،أتمنى أن تكون بخير.إذا قام شخص بسرقة البذرة الخاصة بمحفظتك الهاردوير أو قطعة الورق التي كتبت عليها عبارة البذرة (مثل Trezor أو Ledger) ولكنه ليس لديه وصول إلى المحفظة الهاردوير نفسها، فلن يتمكن من الوصول إلى محفظتك بواسطة البذرة وحدها. البذرة بمفردها ليست كافية للوصول إلى أو استرداد الأموال المخزنة في المحفظة الهاردوير.البذرة هي أساسًا نسخة احتياطية تسمح لك باستعادة محفظتك والوصول إلى أموالك إذا فقدت المحفظة الهاردوير أو سُرقت أو تضررت. ومع ذلك، بدون المحفظة الهاردوير الفعلية والرمز السري أو العبارة السرية المرتبطة بها (إذا كنت قد قمت بإعداد واحدة)، لن يتمكن السارق من الوصول إلى أموال العملة المشفرة الخاصة بك.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "khaled0111",
      "created_time": "September 07, 2023, 11:44:53 AM",
      "body": "^^اجابتك اخي متناقظة.البذرة seed هي كل ما تحتاج إليه لاستعادة محفظتك و الوصول إلى عملات و التحكم فيها بشكل كامل. إذا تمكن اي شخص من الوصول او سرقة البذرة الخاصة بك فسيمكنه بكل سهولة سرقة كل ما تملكه في تلك المحفظة. كلمة السر في هذه الحالة لن تنفع في حمايتك. كل ما تقوم به هو منع اي شخص من استعمال محفظة الهاردوير بدون علمك. يجب عليك الحفاظ على البذرة في مكان آمن لا يمكن لأي شخص غيرك الوصول اليه.هذا الأمر ينطبق على كل أنواع المحافظ و ليس محافظ الهاردوير فقط.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Trawda",
      "created_time": "September 07, 2023, 04:02:24 PM",
      "body": "Quote from: khaled0111 on September 07, 2023, 11:44:53 AMالبذرة seed هي كل ما تحتاج إليه لاستعادة محفظتك و الوصول إلى عملات و التحكم فيها بشكل كامل. إذا تمكن اي شخص من الوصول او سرقة البذرة الخاصة بك فسيمكنه بكل سهولة سرقة كل ما تملكه في تلك المحفظة. كلمة السر في هذه الحالة لن تنفع في حمايتك. كل ما تقوم به هو منع اي شخص من استعمال محفظة الهاردوير بدون علمك. نعم أخي شكرا لك هذا ما كنت أظنه أنا أيضا، عند استيراد البذرة ليس هناك حاجة إلى كلمة مرور أو أي شيء آخر. الشق الثاني من السؤال هي يمكن استيراد هذه البذرة إلى محفظة إلكتريوم أو محفظة سوفت وير أخرى أم أنه يجب استخدام محفظة صلبة من نفس النوع حتى تتمكن من استيراد المحفظة عن طريق البذرة؟ حسب معرفتي هناك أنواع من البذرة لاتتوافق مع محفظة إلكتريوم؟",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "khaled0111",
      "created_time": "September 07, 2023, 04:13:06 PM",
      "body": "Quote from: Trawda on September 07, 2023, 04:02:24 PMالشق الثاني من السؤال هي يمكن استيراد هذه البذرة إلى محفظة إلكتريوم أو محفظة سوفت وير أخرى أم أنه يجب استخدام محفظة صلبة من نفس النوع حتى تتمكن من استيراد المحفظة عن طريق البذرة؟ حسب معرفتي هناك أنواع من البذرة لاتتوافق مع محفظة إلكتريوم؟على حد علمي محفظتي ليدجر و تريزور يستعملان البذرة من نوع bip39. لذلك من المفترض أن تتمكن من استرجاع محفظتك على اغلب انواع المحافظ المشهورة و منها محفظة الكتروم.الكتروم تستعمل خوارزمية خاصة بها لإنشاء البذرة لذلك لا يمكن استرجاع محفظة الكتروم على المحافظ الأخرى (مع بعض الاستثناءات) لكن العكس صحيح. هناك خاصية في الكتروم يجب تفعيلها عند إسترداد المحفظة و إدخال البذرة حتى تتعامل مع البذرة على أنها bip39.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hg_away",
      "created_time": "September 07, 2023, 04:18:04 PM",
      "body": "يمكنك اضافة طبقة امان وهي ما يعرف بالمحفظة المخفية حيث يمكنك تمديد البذور بكلمة اضافية تسطيع حفظها في مكان مستقل وبالتالي فلو وجد السارق البذور الخاصة بك ستدخله تلك البذور لحساب يمكنك ان تجعله فارغا ولا يمكن لاحد ان يحصل علي اموالك الا باستخدام البذور + الكلمة الاضافيةهذه الميزة جيدة ان كنت تخاف ان يتم سرقة بذورك فكل ما عليك فعله هو تخبه الكلمة الزائدة في مكان آمن فحتي لو وجد السارق البذور لا بد له من تخمين الكلمة الزائدة والتي يمكن ان تكون اي كلمة وباي طول. ويمكنك من استعادة حسابك حتي ولو فقدت جهاز المحفظة الخاص بكhttps://trezor.io/learn/a/passphrases-and-hidden-wallets",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Trawda",
      "created_time": "September 07, 2023, 04:56:34 PM",
      "body": "شكرا لك أخي khaled0111 على الإجابة الوافية. شكرا أيضا للأخ hg_away على هذه الإضافة الجيدة، هذه طريقة ممتازة لإضافة طبقة أمان ثانية عن طريق إضافة كلمة سر أو كلمة إضافية للبذرة وحفظها في الذاكرة أو في مكان آمن منفصل عن البذرة وبهذه الطريقة لن يتمكن السارق من استرجاع المحفظة حتى لو كان يملك البذرة.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "khaled0111",
      "created_time": "September 07, 2023, 10:52:39 PM",
      "body": "Quote from: Trawda on September 07, 2023, 04:56:34 PMهذه طريقة ممتازة لإضافة طبقة أمان ثانية عن طريق إضافة كلمة سر أو كلمة إضافية للبذرة وحفظها في الذاكرة أو في مكان آمن منفصل عن البذرة وبهذه الطريقة لن يتمكن السارق من استرجاع المحفظة حتى لو كان يملك البذرة. فقط ملاحظة اخي حتى لا تختلط عليك الامور: الكلمة الإضافية التي تضيفها انت للبذرة التي ولدتها المحفظة تعرف ب passphrase, و هي مختلفة كليا عن كلمة السر او pin الجهاز.كلمة السر تستخدم لحماية الجهاز من المتطفلين مثلا او في حالة الضياع او السرقة.الكلمة الإضافية موضوع اخر. مثلا الجهاز ينشئ بذرة متكونة من 12 كلمة تحفظ على الجهاز. ستقوم انت بإضافة كلمة من عندك تضاف للكلمات السابقة. بهذه الطريقة ستحصل على محفظة مختلفة تماما لا يستطيع غيرك الوصول إليها حتى لو تحصل على  ال 12 كلمة المخزنة على الجهاز.ارجو ان تكون توضحت الفكرة.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Trawda",
      "created_time": "September 08, 2023, 03:14:11 AM",
      "body": "Quote from: khaled0111 on September 07, 2023, 10:52:39 PMارجو ان تكون توضحت الفكرة. نعم أخي توضحت الفكرة تماما. شكرا لك للتنبيه.أنا أدرك الفرق بين الpin  و passphrase الpin  لحماية جهاز المحفظة الصلبة في حال أصبحت في يد شخص آخر حتى لايستطيع الدخول عليها. أما passphrase فهي لحماية البذرة في حال تم سرقة الورقة المحفوظة عليها حتى لايستطيع استرداد المحفظة.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kavelj22",
      "created_time": "September 08, 2023, 11:46:19 PM",
      "body": "Quote from: Trawda on September 08, 2023, 03:14:11 AMQuote from: khaled0111 on September 07, 2023, 10:52:39 PMارجو ان تكون توضحت الفكرة. نعم أخي توضحت الفكرة تماما. شكرا لك للتنبيه.أنا أدرك الفرق بين الpin  و passphrase الpin  لحماية جهاز المحفظة الصلبة في حال أصبحت في يد شخص آخر حتى لايستطيع الدخول عليها. أما passphrase فهي لحماية البذرة في حال تم سرقة الورقة المحفوظة عليها حتى لايستطيع استرداد المحفظة. يمكن استعمال كلا الخاصيتين و لكن يجب دوما التفريق بين كلاهما لان احداهما تبقى دوما أهم من الأخرى و هي تلك التي تتعلق بكلمات البذرة لأنه لو نجح شخص بالحصول الى البذرة سيكون اسهل عليه الوصول الى البيتكوين من ان يحصل فقط على الجهاز و يكون عليه فقط تخمين كلمة المرور PIN.محفظات هاردوير جيدة لأن الوصول الى استخدامها يمر دوما عبر كلمة العبور و هذا ما يجعل الأمر صعبا. و لكن ان نجح الهاكر بالوصول الى كلمات البذرة فان الأمر يزداد خطورة في اقصى الحالات. صحيح انه من الصعب التخمين بالكلمة السر الاضافية و لا استطيع التأكيد أن هذا سيحصل على جميع المحفظات لأنه بامتلاكك لكلمات البذرة فالمفترض ان تكون لك صلاحيات استخدام العناوين التي نتجت عن تلك البذرة.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mikeywith",
      "created_time": "September 09, 2023, 11:45:55 PM",
      "body": "Quote from: khaled0111 on September 07, 2023, 11:44:53 AMاجابتك اخي متناقظة.البذرة seed هي كل ما تحتاج إليه لاستعادة محفظتك و الوصول إلى عملات و التحكم فيها بشكل كامل. اعتقد ان الكثير من الناس يجهلون ماهي البذرة او seed, هنا يجب التوضيح ان كل عنوان بتكوين ينبثق من مفتاح خاص واحد, يعني لكي تنشاء 10 عنواين عليك ان تحتفظ ب 10 مفاتيح خاصة, وبما ان الطبيعي ان تنشاء عنوان جديد لكل معاملة يعني انك مع الوقت سوف تحتاج لحفظ او تخزين مئات او الاف المفاتيح الخاصة, في كل مرة تنقل فيها بتكوين من عنوان لاخر وتتحصل على change address جديد يجب عليك كتابة المفتاح الخاص للعنوان الاخير ومسح العنوان القديم, هدا الامر ليس عملي ولايمكن تطبيقه على ارض الواقع.هنا جائت الحاجة لاستخدمام البذرة, لان المحفظة قادرة على استخدام نفس البذرة لانشاء الكثير من المفاتيح الخاصة اللازمة لانشاء عنواين كثيرة, فهما كل ماعليك هوا كتابة 12 او 24 كلمة والتي عن طريقها يمكنك اعادة انشاء نفس المفاتيح الخاصة في كل مرة تقوم بأنشاء عنوان جديد, وهنا يجب التوضيح انه في حال ضياع البذرة وحصول شخص اخر عليها, لايوجد شي اسمها \"استرداد البتكوين\", السارق (او الشخص نفسه عندما يضيع المحفظة ويريد استردادها) عليه ان يقوم بانشاء عنواين جديدة وهنا العنواين الجديدة سوف تكون نفسها العنواين القديمة (اي نفس المفاتيح الخاصة) التي تم انشأئها اول مرة, وستجد قائمة طويلة من العنواين التي تم استخدماها مسبقا والتي قد تكون فارغة اصلا, حتى تصل على العنوان الاخير الذي يحتوي على كل شي.فكرة ال passphrases من وجهة نظري هي فكرة غبية نوعا ما, فكما تضيف نوع من الحماية للمحفظة تقوم ايضا باضافة مجال كبير للخطاء, اولا, يجب ان على الاقل ان نتفق ان الاعتماد على ذاكرتنا هوا امر سيء, فلو قررت اضافة كلمة اعتقد اني اتذكرها, فعلى الاغلب انه بعد خمسة سنوات لن اتمكن من ان اتذكرها, وان قمت بتخزين الكلمة على ورقة في مكان ما, فهنا المسؤولية تزيد حيث اني يجب ان احتفظ بورقتين في مكانين مختلفين ومع الوقت وبعد مرور السنين يمكن ان تنتقل من منزلك او لاي طرف طارئ تحتاج لمغادرة المنزل بسرعة وعليك ان تحاول ايجاد ورقتين مر عليهم سنين, قد يبدو الامر مبالغ فيه ولكن يمكن ان تنشاء تجربتك الخاصة بان تتفكر كلمة الان وتعود بعد عام واحد لترا ان كنت تتفكرها او تكتبها في مكان ما وتعود بعد عام وتحاول ايجادها في دقيقة واحدة مع تخيل ان هناك زلزال او حريق لاسمح الله.الكثير من الاشخاص حاولو ان يكونو اذكياء وكتبو 11 كلمة بدل 12 وبعد مرور عدة سنوات عندما ارادو استرجاح المحفظة اكتشفو انهم قد نسو الكلمة 12, الامر بسيط جدا, اكتب ال 12 او ال 24 كلمة على ورقة واحتفظ بها في مكان امن وانتهت القصة, اي تعقيد للعملية يزيد احتمالية ضياع اموالك حتى وان لم يتم سرقتها.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kavelj22",
      "created_time": "September 10, 2023, 06:35:14 PM",
      "body": "Quote from: mikeywith on September 09, 2023, 11:45:55 PMفكرة ال passphrases من وجهة نظري هي فكرة غبية نوعا ما, فكما تضيف نوع من الحماية للمحفظة تقوم ايضا باضافة مجال كبير للخطاء, اولا, يجب ان على الاقل ان نتفق ان الاعتماد على ذاكرتنا هوا امر سيء, فلو قررت اضافة كلمة اعتقد اني اتذكرها, فعلى الاغلب انه بعد خمسة سنوات لن اتمكن من ان اتذكرها, وان قمت بتخزين الكلمة على ورقة في مكان ما, فهنا المسؤولية تزيد حيث اني يجب ان احتفظ بورقتين في مكانين مختلفين ومع الوقت وبعد مرور السنين يمكن ان تنتقل من منزلك او لاي طرف طارئ تحتاج لمغادرة المنزل بسرعة وعليك ان تحاول ايجاد ورقتين مر عليهم سنين, قد يبدو الامر مبالغ فيه ولكن يمكن ان تنشاء تجربتك الخاصة بان تتفكر كلمة الان وتعود بعد عام واحد لترا ان كنت تتفكرها او تكتبها في مكان ما وتعود بعد عام وتحاول ايجادها في دقيقة واحدة مع تخيل ان هناك زلزال او حريق لاسمح الله.الفكرة ستكون عقيمة اذا استخدمناها لتأمين المحفظة أو كلمات البذرة. كلمة الPassphrase لم يتم تخصيصها لهذا الشأن حسب رأيي لأن لها دورا اخر أكثر فاعلية و هو التحكم في المحفظة للاستعمال العادي. يمكن لمدخر البيتكوين ان يقوم بانشاء العناوين انطلاقا من البذرة ثم يقوم بحفظ تلك البذرة على ورقة و يمحو المحفظة أصلا من على جهازه و هكذا فان البذرة محفوظة و لا محفظة مفتوحة بتلك البذرة. في حالات الاستخدام المتكرر للمحفظة فانه سيكون من الجيد انشاء passphrase لحماية المحفظة على جهازك و لكي لا يتمكن احد من الدخول اليها بمجرد حصوله على الجهاز او ان يستخدم المحفظة لو صدف و وجدها مفتوحة على الجهاز دون علمك بما أن المحفظة ستطلب تلك الpassphrase اذا أراد القيام بارسال بيتكوين او اراد توقيع رسالة من احدى العناوين. الpassphrase تلعب دورا مهما في هذه الحالات و قادرة على توفير طبقة جيدة من الحماية أنا أتصور أنها أفضل بكثير من مساهمة طرف ثالث مثل تطبيق حماية قوقل 2FA.استخدام هذه الخاصيات يجب ان يكون واضحا في أذهان جميع من يستخدمها لكي لا يحصل لديهم خلط في وظائف كل منها لأن البعض قد يتصور ان استخدام اي طريقة سيوفر الحماية اللازمة في حين ان هذا سيكون مخطئا في اغلب الحالات. تأمين المحفظة يختلف عن تأمين البذرة بالرغم من الارتباط الوثيق بينهما و لهذا من المستحسن التفريق بين مختلف الأكواد التي يجب حفظها.نصيحة أخيرة اثناء انشاء الpassphrase: تجنب ان تنشئ passphrase يمكنك دوما تذكرها لأنك حتما ستنساها و عوضا عن ذلك قم بانشاء passphrase من أكواد و رموز مختلفة عشوائية بالشكل الذي لا يمكن لك أو لأحد أن يحفظه ذهنيا و بالتالي سيكون عليك حفظه و استخدامه من خلال خاصية النسخ و اللصق و ليس حفظا ذهنيا. أنا أستعمل هذه الطريقة على جميع الحسابات و لا أحفظ أي من كلمات المرور لأنها تكون مركبة و هذه الطريقة تعطيني امكانية انشاء كلمة مرور معقدة جدا و من المستحيل التكهن بها.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mikeywith",
      "created_time": "September 10, 2023, 11:03:26 PM",
      "body": "Quote from: Kavelj22 on September 10, 2023, 06:35:14 PMالفكرة ستكون عقيمة اذا استخدمناها لتأمين المحفظة أو كلمات البذرة. كلمة الPassphrase لم يتم تخصيصها لهذا الشأن حسب رأيي لأن لها دورا اخر أكثر فاعلية و هو التحكم في المحفظة للاستعمال العادي. يمكن لمدخر البيتكوين ان يقوم بانشاء العناوين انطلاقا من البذرة ثم يقوم بحفظ تلك البذرة على ورقة و يمحو المحفظة أصلا من على جهازه و هكذا فان البذرة محفوظة و لا محفظة مفتوحة بتلك البذرة. في حالات الاستخدام المتكرر للمحفظة فانه سيكون من الجيد انشاء passphrase لحماية المحفظة على جهازك و لكي لا يتمكن احد من الدخول اليها بمجرد حصوله على الجهاز او ان يستخدم المحفظة لو صدف و وجدها مفتوحة على الجهاز دون علمك بما أن المحفظة ستطلب تلك الpassphrase اذا أراد القيام بارسال بيتكوين او اراد توقيع رسالة من احدى العناوين. الpassphrase تلعب دورا مهما في هذه الحالات و قادرة على توفير طبقة جيدة من الحماية أنا أتصور أنها أفضل بكثير من مساهمة طرف ثالث مثل تطبيق حماية قوقل 2FA.اعتقد اننا نتكلم عن شئين مختلفين, ال passphrase يختلف عن الباسورد, انت تتكلم عن الباسورد والذي هوا امر طبيعي يجب ان يكون مفعل في المحفظة, في الواقع لم ارا في حياتي اي محفظة لاتلزمك برمز للولوج لها, اما ال passphrase فهيا كلمة مضافة لل seed ولنفرض مثلا ان عندك قيامك بانشاء محفظة داخل محفظة الهاردوير سيقوم السوفتوير بانشاء بذرة مكونة من 12 كلمة عشوائية ولتكن مثلاCode:Hello , Bit , Coin, Talk, Arabic, Community, Welcome, To, The ,Wallet, Disccsuion, Topicيمكنك اضافة كلمة اخرى من عندك (يمكن ان تكون اي كلمة خاضعة لشروط معينة فبعض الرموز ممعنوعة) ولنقل ان ال passphrase التي اخترتها هي Mikeyحينها البذرة ستكون Code:Hello , Bit , Coin, Talk, Arabic, Community, Welcome, To, The ,Wallet, Disccsuion, Topic , Mikeyنظريا, الان يجب علي تخزين ال12 الاولى في مكان ما, وتخزين كلمة Mikey المضافة وهي الPassphrase في مكان اخر , او ان احفظها في عقلي, فحتى لو ضاعت الورقة التي تحمل ال 12 كلمة لايمكن لاي احد ان يستعملها بدون معرفة الكلمة المضافة وهي Mikey.قد تبدو هده الفكرة رائعة ولكنها ليست كذلك على الاقل من وجهة نظري, وقمت بشرحها في تعليقي السابق.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Trawda",
      "created_time": "September 11, 2023, 10:46:01 AM",
      "body": "Quote from: mikeywith on September 10, 2023, 11:03:26 PMQuote from: Kavelj22 on September 10, 2023, 06:35:14 PMالفكرة ستكون عقيمة اذا استخدمناها لتأمين المحفظة أو كلمات البذرة. كلمة الPassphrase لم يتم تخصيصها لهذا الشأن حسب رأيي لأن لها دورا اخر أكثر فاعلية و هو التحكم في المحفظة للاستعمال العادي. يمكن لمدخر البيتكوين ان يقوم بانشاء العناوين انطلاقا من البذرة ثم يقوم بحفظ تلك البذرة على ورقة و يمحو المحفظة أصلا من على جهازه و هكذا فان البذرة محفوظة و لا محفظة مفتوحة بتلك البذرة. في حالات الاستخدام المتكرر للمحفظة فانه سيكون من الجيد انشاء passphrase لحماية المحفظة على جهازك و لكي لا يتمكن احد من الدخول اليها بمجرد حصوله على الجهاز او ان يستخدم المحفظة لو صدف و وجدها مفتوحة على الجهاز دون علمك بما أن المحفظة ستطلب تلك الpassphrase اذا أراد القيام بارسال بيتكوين او اراد توقيع رسالة من احدى العناوين. الpassphrase تلعب دورا مهما في هذه الحالات و قادرة على توفير طبقة جيدة من الحماية أنا أتصور أنها أفضل بكثير من مساهمة طرف ثالث مثل تطبيق حماية قوقل 2FA.اعتقد اننا نتكلم عن شئين مختلفين, ال passphrase يختلف عن الباسورد, انت تتكلم عن الباسورد والذي هوا امر طبيعي يجب ان يكون مفعل في المحفظة, في الواقع لم ارا في حياتي اي محفظة لاتلزمك برمز للولوج لها, اما ال passphrase فهيا كلمة مضافة لل seed ولنفرض مثلا ان عندك قيامك بانشاء محفظة داخل محفظة الهاردوير سيقوم السوفتوير بانشاء بذرة مكونة من 12 كلمة عشوائية ولتكن مثلانعم أخي mikeywith  كما تقول حضرتك passphrase مخصصة لحماية البذرة عن طريق إضافة كلمة إضافية كما شرحت أنت ولا علاقة لها بالباسوورد أو حماية المحفظة أو الحماية الثنائية التي يتكلم عنها الأخ Kavelj22 . وأتفق معك أيضا أن passphrase سلاح ذو حدين فكما أنها تؤمن حماية إضافية للبذرة لكن ضياع هذه الكلمة يعادل ضياع البذرة كاملة، يعني لو محتفظ بالبذرة في مكان آمن لكنك فقدت passphrase أو نسيتها فلن تتمكن من استرجاع المحفظة. لكن أريد أن أضيف هنا أنه يمكن إضافة passphrase في محفظة إلكتريوم أيضا وليس فقط في المحفظات الصلبة. يعني عند إنشاء محفظة جديدة في إلكتريوم يمكنك إضافة كلمة اختيارية على seed تقوم بحفظها منفردة كحماية إضافية ل seed .",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ulven",
      "created_time": "September 11, 2023, 11:11:41 AM",
      "body": "Quote from: Nalain420 on September 07, 2023, 10:35:11 AMوعليكم السلام أخي،أتمنى أن تكون بخير.إذا قام شخص بسرقة البذرة الخاصة بمحفظتك الهاردوير أو قطعة الورق التي كتبت عليها عبارة البذرة (مثل Trezor أو Ledger) ولكنه ليس لديه وصول إلى المحفظة الهاردوير نفسها، فلن يتمكن من الوصول إلى محفظتك بواسطة البذرة وحدها. البذرة بمفردها ليست كافية للوصول إلى أو استرداد الأموال المخزنة في المحفظة الهاردوير.البذرة هي أساسًا نسخة احتياطية تسمح لك باستعادة محفظتك والوصول إلى أموالك إذا فقدت المحفظة الهاردوير أو سُرقت أو تضررت. ومع ذلك، بدون المحفظة الهاردوير الفعلية والرمز السري أو العبارة السرية المرتبطة بها (إذا كنت قد قمت بإعداد واحدة)، لن يتمكن السارق من الوصول إلى أموال العملة المشفرة الخاصة بك.بالعكس أخي إذا تمكن شخص ما من الوصول إلى كلمة ال seed فإنه يستطيع الوصول للمحفظة و سرقة الرصيد بالكامل. نقطة أخرى و هي التخزين يتم تخزين الأرصدة على شبكة البلوكتشين و ليس على الأجهزة  كما أشارت يمكنك تصحيح المعلومة لديك",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}