{
  "id": "topic_5400808",
  "title": "Majestic-milf",
  "author": "Majestic-milf",
  "created_time": "May 31, 2022, 05:27:31 AM",
  "content": "Gone are those days where the moment you leave school as a graduate, you can be gainfully employed in a reputable company or establishment. Now, you discover that even a graduate of our present generation can not be differentiated from a young school leaver in terms of the kind of menial labor they settle for.  Why is this so? Most individuals believe that life is all about getting into the four walls of a university and getting a degree. I support schooling, don't get me wrong, but then, it is also very important to arm yourself with a skill or two or more of possible. The society we find ourselves now, there are still youths who are depending on the government for employment, ( this is one of the duties of a government), but then, if you are armed with these skills you may necessarily not need to be tagged \"dependent\". But with the skills you've been able to build yourself with, you become an employer of labor. Skills make you independent. A very necessary tool for survival if you ask me.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5400808",
  "comments": [
    {
      "author": "Cnut237",
      "created_time": "May 31, 2022, 07:07:58 AM",
      "body": "Quote from: Majestic-milf on May 31, 2022, 05:27:31 AM Gone are those days where the moment you leave school as a graduate, you can be gainfully employed in a reputable company or establishment. Now, you discover that even a graduate of our present generation can not be differentiated from a young school leaver in terms of the kind of menial labor they settle for.  Why is this so?In my country at least, it's because the nature of university education has changed over the last 25 years or so.Previously, university was all about learning. Only a small percentage of people went to university, everyone had their courses paid for by the government, and students with a low or even median family income received additional government funding through a cost of living grant. The result: a small number of university graduates, highly skilled and ready to pick up jobs that demanded their skills.But then it became about money. University entrance was vastly increased, a large proportion (~50%) of young people started going to university, government funding was removed entirely, and students became saddled with debt. Average student debt in my country is now £45k (~US$56k). University education became a lot more transactional, people were effectively paying for a degree. A lot of less academic and sometimes quite absurd courses sprang up to cater for the rising demand (e.g. surf science, floral design, puppetry). The result: a large number of university graduates, mostly saddled with vast debts, and relatively few highly skilled.https://www.statista.com/statistics/376423/uk-student-loan-debt/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "May 31, 2022, 04:10:56 PM",
      "body": "although college can be career defining. many people go to college just because its the thing to do, even before deciding on a career path.ask any college kid about what they want to 'major-in' most have no idea in the first year of college.half the courses college kids take in the first year are not specialist, they are just random courses for extra credit.much like seeing many female college students being obligated/coerced to add in a STEM class into their schedule's purely to make the college look good by having high female attendance of STEM courses, even if its not going to be their speciality. gone are the days where industry would actually train the young and actually educate them in a career, now its simply fill a college kids day with impractical stuff, but just enough stuff to make a 3 month, night school specialist course feel worthy of the price tag of 2 years of full day college fee.there are many many specialist roles. where it does not require 4 years of training at 10 hours a day.(apart from probably brain surgery), where by kids can actually learn how to become a mechanic in a few months if the course is designed right to teach them the good stuff they need to know up front. colleges need to pull out the crap from their semesters, you know the compulsory STEM classes like biology, where by the student is trying to specialise in electronic/mechanical based stuff. and instead actually teach them stuff that can get them specialist in a role.take someone else i know. they want to be an architect. so they planned on architecture, art, physics and geography. thinking the physics and geography would teach them about how the ground affects building foundations and vice versa. but instead their first semester was biology, second semester was chemistry and third was physics. and none of the sciences helped towards how to construct a building or what building materials, weights or compositions would aid that. and the geography was not about the ground/water info that is key to know when planning a construction site. it was about different states and the other useless stuff about maps and crapthis is being said because having a college qualification is felt as meaningless now. its not a sign of speciality or knowledge anymore. i know people with degree's that specialise in nothing. and so their 3-4 years of college has become a waste of time for themso as the title of topic says. try to build yourself. learn what you can in just the area's you want a career in. learn more then the basics. actually apply yourself and organise yourself.do not pretend others can build you for you. because 30+ other students in the same class are learning the same thing and doing the same thing if just following the lesson plans. meaning only a 3% or less chance of getting a job if all 30+ students are trying to apply for the same career. the other students are your competition. so beat them.. so know more about a subject then they do",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "amishmanish",
      "created_time": "May 31, 2022, 04:38:40 PM",
      "body": "The evolution of technology has made education a ever evolving field. Each year we see more and more newer and sophisticated technology are hitting market and we have to become ever learners to be able to cope with them. Today even the most basic jobs need us to use gadgets, workers need to work on realtime data and manage sophisticated systems remotely. No skill can be considered as a life long skill anymore and we need to upgrade ourselves as fast as the operating systems of our phones",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coolcoinz",
      "created_time": "May 31, 2022, 09:19:41 PM",
      "body": "I have a few friends, who all went to universities and so did I. None of us does anything even remotely related to our studies and we all finished different studies ranging from economics, through law, and ending with robotics. Two guys who studied literature are now working in IT, the robotics guy is selling clothes, law guy is in administration and guy who studied IT ended up running an online store with mobile phones. Based on my experience, a degree doesn't say anything about you and is in no way a guarantee of anything like a job, money, success... You could skip it, but it has a purpose in some cases. It shows that you're willing to learn, that you are able to do research on your own and it teaches you to pick the important parts and manage time. This is probably the most useful thing that the university taught me. That said, I won't ever know if I wouldn't be able to get these skills elsewhere, like by learning a trade and running my own business.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Israelgogo",
      "created_time": "June 01, 2022, 03:12:00 PM",
      "body": "Life is for survival of the fittest, it throws you chalenges ,you have to build yourself to accept all challenges and do better,even if everything seems good to you and life treats you well ,build yourself to do more and sustain the energy",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rruchi man",
      "created_time": "June 01, 2022, 03:42:22 PM",
      "body": "Quote from: Majestic-milf on May 31, 2022, 05:27:31 AM Why is this so? Most individuals believe that life is all about getting into the four walls of a university and getting a degree. I support schooling, don't get me wrong, but then, it is also very important to arm yourself with a skill or two or more of possible.It is traditional thinking to still depend on how life used to be after school, you get a job and work yourself to retirement, things have changed now, and while the importance of education cannot be undermined the importance of learning a skill cannot be overstated. If getting an office job is still your target, you may miss it because the reality of things is that there are no enough office jobs to go round. While you seek to get skilled, please ensure that the skill is relevant to this age and the future and high paying enough to economically cater for needs.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Proro",
      "created_time": "June 01, 2022, 07:37:05 PM",
      "body": "The world is changing and so is everything, the days where young people thinks University certificate will give them a better future is long gone. Most of the higher school of learning now, teaches entrepreneur education, because they know that the government can't provide job for every graduate so they tends to teach them self reliance before they graduate.And it is important every one learn a skill because the government has failed in the aspect of employment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lordhermes",
      "created_time": "June 04, 2022, 07:54:03 AM",
      "body": "It is very important for every human being to know what is good for him,what will grow him,and what will make him acceptable in the society.It is very good to build yourself from a youthful age,do things that will better your future.As they say,that determination brings success,any man who have decided and have determined to succeed in life,must have a set goal,a focus and a target for the future. It is vital to build oneself physically,spiritually,mentally and emotionally as a human being.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Findingnemo",
      "created_time": "June 04, 2022, 04:33:36 PM",
      "body": "In 2000, there was enough job for the people who are graduating so they get and settle but now the requirement is 1/10 while we are producing more graduate due to the increase of population and school became successful business so they one who want need to be skilled enough so they can pass the remaining 9 to get that available job.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ebede",
      "created_time": "June 04, 2022, 07:03:42 PM",
      "body": "Quote from: Israelgogo on June 01, 2022, 03:12:00 PMLife is for survival of the fittest, it throws you chalenges ,you have to build yourself to accept all challenges and do better,even if everything seems good to you and life treats you well ,build yourself to do more and sustain the energyNo body that will tell that life is not challenging itself before becoming some thing for life and every body have it story to give for it life and if you plan for good and the environment you find yourself can replan for you. The structure you create by yourself is structure that will show your reputation and when you build it well other person's will be following your life style",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kavelj22",
      "created_time": "June 04, 2022, 07:52:06 PM",
      "body": "Quote from: Majestic-milf on May 31, 2022, 05:27:31 AM Gone are those days where the moment you leave school as a graduate, you can be gainfully employed in a reputable company or establishment. Now, you discover that even a graduate of our present generation can not be differentiated from a young school leaver in terms of the kind of menial labor they settle for.  Why is this so? Most individuals believe that life is all about getting into the four walls of a university and getting a degree. I support schooling, don't get me wrong, but then, it is also very important to arm yourself with a skill or two or more of possible. The society we find ourselves now, there are still youths who are depending on the government for employment, ( this is one of the duties of a government), but then, if you are armed with these skills you may necessarily not need to be tagged \"dependent\". But with the skills you've been able to build yourself with, you become an employer of labor. Skills make you independent. A very necessary tool for survival if you ask me.I agree with your thoughts. But I would like to point out that relying on the state's formal education system to obtain a certificate that qualifies for the labor market was not the case at all times. The idea that you have to acquire more life skills to gain greater independence and freedom has always been the case. But with the emergence of the nation-state system, which is responsible for schooling, the skills were summed up in what the state system will provide you with according to the needs it deems appropriate.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BADecker",
      "created_time": "June 04, 2022, 08:20:20 PM",
      "body": "Quote from: Kavelj22 on June 04, 2022, 07:52:06 PMQuote from: Majestic-milf on May 31, 2022, 05:27:31 AM Gone are those days where the moment you leave school as a graduate, you can be gainfully employed in a reputable company or establishment. Now, you discover that even a graduate of our present generation can not be differentiated from a young school leaver in terms of the kind of menial labor they settle for.  Why is this so? Most individuals believe that life is all about getting into the four walls of a university and getting a degree. I support schooling, don't get me wrong, but then, it is also very important to arm yourself with a skill or two or more of possible. The society we find ourselves now, there are still youths who are depending on the government for employment, ( this is one of the duties of a government), but then, if you are armed with these skills you may necessarily not need to be tagged \"dependent\". But with the skills you've been able to build yourself with, you become an employer of labor. Skills make you independent. A very necessary tool for survival if you ask me.I agree with your thoughts. But I would like to point out that relying on the state's formal education system to obtain a certificate that qualifies for the labor market was not the case at all times. The idea that you have to acquire more life skills to gain greater independence and freedom has always been the case. But with the emergence of the nation-state system, which is responsible for schooling, the skills were summed up in what the state system will provide you with according to the needs it deems appropriate.Majestic-milf is simply showing us what is going on with things of the past. Everything changes. The child grows into the adult. The strong adult becomes weak with age. Things change. We need to learn that some of our investments for the future fail, and work at whatever works, rather than complain about how good the old days were, and that they aren't so good, now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kavelj22",
      "created_time": "June 04, 2022, 10:45:33 PM",
      "body": "Quote from: BADecker on June 04, 2022, 08:20:20 PMQuote from: Kavelj22 on June 04, 2022, 07:52:06 PMQuote from: Majestic-milf on May 31, 2022, 05:27:31 AM Gone are those days where the moment you leave school as a graduate, you can be gainfully employed in a reputable company or establishment. Now, you discover that even a graduate of our present generation can not be differentiated from a young school leaver in terms of the kind of menial labor they settle for.  Why is this so? Most individuals believe that life is all about getting into the four walls of a university and getting a degree. I support schooling, don't get me wrong, but then, it is also very important to arm yourself with a skill or two or more of possible. The society we find ourselves now, there are still youths who are depending on the government for employment, ( this is one of the duties of a government), but then, if you are armed with these skills you may necessarily not need to be tagged \"dependent\". But with the skills you've been able to build yourself with, you become an employer of labor. Skills make you independent. A very necessary tool for survival if you ask me.I agree with your thoughts. But I would like to point out that relying on the state's formal education system to obtain a certificate that qualifies for the labor market was not the case at all times. The idea that you have to acquire more life skills to gain greater independence and freedom has always been the case. But with the emergence of the nation-state system, which is responsible for schooling, the skills were summed up in what the state system will provide you with according to the needs it deems appropriate.Majestic-milf is simply showing us what is going on with things of the past. Everything changes. The child grows into the adult. The strong adult becomes weak with age. Things change. We need to learn that some of our investments for the future fail, and work at whatever works, rather than complain about how good the old days were, and that they aren't so good, now.What I meant is that the system is recovering itself after the nation-states came to disrupt it. Even during capitalism's incursion to impose a specific school system according to its needs, the creators and those who actually changed history are people who rebelled against those systems and were not satisfied with the few skills that the system provides them with.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BADecker",
      "created_time": "June 05, 2022, 11:01:27 PM",
      "body": "Quote from: Kavelj22 on June 04, 2022, 10:45:33 PMQuote from: BADecker on June 04, 2022, 08:20:20 PMMajestic-milf is simply showing us what is going on with things of the past. Everything changes. The child grows into the adult. The strong adult becomes weak with age. Things change. We need to learn that some of our investments for the future fail, and work at whatever works, rather than complain about how good the old days were, and that they aren't so good, now.What I meant is that the system is recovering itself after the nation-states came to disrupt it. Even during capitalism's incursion to impose a specific school system according to its needs, the creators and those who actually changed history are people who rebelled against those systems and were not satisfied with the few skills that the system provides them with.System recovery is basing the government in family... based on the Bible. Such is the system that God has had in mind forever, and that is the way He set it up in the beginning.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gosgosking",
      "created_time": "June 05, 2022, 11:06:54 PM",
      "body": "Life everyday needs development,  development does not end after school. As far as a man still breaths it is necessary for self development to take place every day till death happens.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "minime0105",
      "created_time": "June 06, 2022, 02:10:35 PM",
      "body": "Quote from: Majestic-milf on May 31, 2022, 05:27:31 AM Gone are those days where the moment you leave school as a graduate, you can be gainfully employed in a reputable company or establishment. Now, you discover that even a graduate of our present generation can not be differentiated from a young school leaver in terms of the kind of menial labor they settle for.  Why is this so? Most individuals believe that life is all about getting into the four walls of a university and getting a degree. I support schooling, don't get me wrong, but then, it is also very important to arm yourself with a skill or two or more of possible. The society we find ourselves now, there are still youths who are depending on the government for employment, ( this is one of the duties of a government), but then, if you are armed with these skills you may necessarily not need to be tagged \"dependent\". But with the skills you've been able to build yourself with, you become an employer of labor. Skills make you independent. A very necessary tool for survival if you ask me.OP I think you should have been more open in directing your post to a particular state or country, do you have proof to show that people don't get employed when they leave high school or graduate from the Universities?  The case of unemployment is caused by underdevelopment and I think that can only be seen in some countries with some or no economic growth, American, for instance, have no case of unemployment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Maestro75",
      "created_time": "June 06, 2022, 03:22:48 PM",
      "body": "Quote from: franky1 on May 31, 2022, 04:10:56 PMalthough college can be career defining. many people go to college just because its the thing to do, even before deciding on a career path.Everything you said here is pure truth. Nothing to subtract there. It is worse in Africa where the society values certificates more than practicalities. There are graduates in fields that are obsolete and irrelevant. They only want to acquire the certificates even if they become unemployable with it. Just get the certificate so you can be seen as a graduate. That is what matters to them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lordhermes",
      "created_time": "June 11, 2022, 09:24:04 AM",
      "body": "Most people have fallen a prey to the things they didn't do while they were supposed to do them.They neglected the fact that self realization and self building is the base for any successful man or woman.Knowing what you can do,and doing them at the right time is the key to ensuring a better future,for both you and your offspring.One must be able to build himself and be stable to be able to face the challenges that will face him,because every man has a time to face some certain challenges in  life.Therefore,putting in one's best in what ever you find yourself doing is a way of preparing and building yourself for the present and the future.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BADecker",
      "created_time": "June 11, 2022, 03:42:57 PM",
      "body": "Don't build yourself. Rather, deny yourself and build Jesus instead. Build Jesus by telling people the great news, that there will be a resurrection to eternal life for all who trust in Him. If you do this, Jesus will build you into greatness in Heaven, as thanks, for all the people you brought to Him.Start by filling yourself on the words of the Bible. Start with the Gospels at the beginning of the New Testament.Build Jesus, and you will be building yourself in the only way that counts.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}