{
  "id": "topic_5477065",
  "title": "l3pox",
  "author": "l3pox",
  "created_time": "December 08, 2023, 04:03:00 PM",
  "content": "ok, o título é levemente clickbait mas dá uma olhada nessa história postada pelo ZachBTC que é bem interessante:https://twitter.com/zachxbt/status/1732790450350703052(para quem não sabe o Zach é famoso por investigar hacks no espaço de crypto)Tem algumas suposições na história, não dá pra saber com certeza pq o dinheiro passou pelo Tornado, conhecido mixer causador da discórdia.Mas aparentemente essa é a trilha do dinheiro do hack de um protocolo DeFi chamado Uranium, mais de 50 milhões de dólares.O possível hacker estava comprando packs lacrados de Magic a 5-10% a mais que o preço de mercado, pagando com crypto e provavelmente pretende vendê-los para lavar a grana.Como o mercado é grande ele conseguiria lavar alguns milhões dessa forma.Curioso né?tem o passo a passo nos tweets e o raciocínio do zack para linkar depositante com saques.Doideras de crypto.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5477065",
  "comments": [
    {
      "author": "criptoevangelista",
      "created_time": "December 08, 2023, 04:10:29 PM",
      "body": "Quando eu era mais novo trabalhava numa loja que vendia cards de magic, era bem surreal o preço de algumas cartas, algumas valendo uma boa grana mesmo! os caras compravam caixas lacradas com centenas de boosters de magic e iam abrindo tudo para pegar as cartas raras e revender, no fim das contas conseguiam uma boa grana, eu conheço gente q na época vivia apenas disto, fazia dessas negociações sua fonte de renda.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Paredao",
      "created_time": "December 08, 2023, 08:16:24 PM",
      "body": "Cada hora aparece uma maneira diferente dos hackers \"lavarem o dinheiro roubado\". Se utilizassem toda essa criatividade em algo construtivo, o mundo seria bem melhor e o mundo das criptomoedas seria melhor ainda. Os Hackers atrapalham muito o crescimento do universo das criptomoedas. Causa muita insegurança e má fama.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fazu",
      "created_time": "December 09, 2023, 01:13:53 AM",
      "body": "Quote from: Lucasgabd on December 08, 2023, 04:03:00 PMok, o título é levemente clickbait mas dá uma olhada nessa história postada pelo ZachBTC que é bem interessante:https://twitter.com/zachxbt/status/1732790450350703052(para quem não sabe o Zach é famoso por investigar hacks no espaço de crypto)Tem algumas suposições na história, não dá pra saber com certeza pq o dinheiro passou pelo Tornado, conhecido mixer causador da discórdia.Mas aparentemente essa é a trilha do dinheiro do hack de um protocolo DeFi chamado Uranium, mais de 50 milhões de dólares.O possível hacker estava comprando packs lacrados de Magic a 5-10% a mais que o preço de mercado, pagando com crypto e provavelmente pretende vendê-los para lavar a grana.Como o mercado é grande ele conseguiria lavar alguns milhões dessa forma.Curioso né?tem o passo a passo nos tweets e o raciocínio do zack para linkar depositante com saques.Doideras de crypto.Foi apenas uma tentativa?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sabotag3x",
      "created_time": "December 09, 2023, 01:57:28 PM",
      "body": "Quote from: Lucasgabd on December 08, 2023, 04:03:00 PMCurioso né?tem o passo a passo nos tweets e o raciocínio do zack para linkar depositante com saques.Doideras de crypto.O trabalho desse cara é incrível.. deve trabalhar em vários casos em simultâneo e mesmo assim consegue entregar conteúdos bem completos que ninguém mostraria.Sobre a possível lavagem de dinheiro, achei interessante que o cara seguiu um padrão em sua operação.. quem sabe teria passado despercebido caso não fizesse wrap/unwrap dos ETH e comprasse outras coisas além de cartas de MTG.Será que o FBI já foi fazer uma visita ao cidadão? imagino que logo vá ser preso se a investigação do Zach estiver certa.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TryNinja",
      "created_time": "December 09, 2023, 03:11:22 PM",
      "body": "Quote from: sabotag3x on December 09, 2023, 01:57:28 PMO trabalho desse cara é incrível.. deve trabalhar em vários casos em simultâneo e mesmo assim consegue entregar conteúdos bem completos que ninguém mostraria.Ele é bem recompensado para tal. Já recebeu algumas centenas de milhares de dólares da comunidade por conta do seu trabalho protetivo contra scammers.Quote from: sabotag3x on December 09, 2023, 01:57:28 PMSobre a possível lavagem de dinheiro, achei interessante que o cara seguiu um padrão em sua operação.. quem sabe teria passado despercebido caso não fizesse wrap/unwrap dos ETH e comprasse outras coisas além de cartas de MTG.Acho que foi isso também. Considerando a origem do dinheiro, não se deve poupar esforços em pagar taxas, enrolar, passar de lá pra cá e o escambau... para dificultar a analise ao máximo que a rede permite. Claro que um dinheiro sujo desse é analisado até o final, mas acho que dava pra inventar até mais coisa. (Não estou recomendando o roubo ou lavagem de dinheiro, só gosto do assunto assim como gosto de ficção cientifica)Quote from: sabotag3x on December 09, 2023, 01:57:28 PMSerá que o FBI já foi fazer uma visita ao cidadão? imagino que logo vá ser preso se a investigação do Zach estiver certa.De acordo com o zach, o vendedor se encontrou pessoalmente para entregar as cartas, então as chances dele eventualmente cair são altas. Sempre fico curioso para saber quem era, o que ele fez, e como ele fez.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Disruptivas",
      "created_time": "December 09, 2023, 06:10:29 PM",
      "body": "Quote from: sabotag3x on December 09, 2023, 01:57:28 PMQuote from: Lucasgabd on December 08, 2023, 04:03:00 PMCurioso né?tem o passo a passo nos tweets e o raciocínio do zack para linkar depositante com saques.Doideras de crypto.O trabalho desse cara é incrível.. deve trabalhar em vários casos em simultâneo e mesmo assim consegue entregar conteúdos bem completos que ninguém mostraria.Sobre a possível lavagem de dinheiro, achei interessante que o cara seguiu um padrão em sua operação.. quem sabe teria passado despercebido caso não fizesse wrap/unwrap dos ETH e comprasse outras coisas além de cartas de MTG.Será que o FBI já foi fazer uma visita ao cidadão? imagino que logo vá ser preso se a investigação do Zach estiver certa.O trabalho dele é realmente muito bom. Mas é sempre difícil acompanhar.  Eu leio e releio e não entendo muito. Acho que talvez precisaria tentar seguir os passos pra ir entendendo mesmo. Será que ele é contratado pras investigações on-chain?E sobre a policia, será que os caras tentam seguir os passsos dos analistas ou vao direto na pessoa e de la tentam investigar o que ela faz e de onde vem o dinheiro das acoes dele?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Paredao",
      "created_time": "December 09, 2023, 08:43:32 PM",
      "body": "Quote from: Disruptivas on December 09, 2023, 06:10:29 PME sobre a policia, será que os caras tentam seguir os passsos dos analistas ou vao direto na pessoa e de la tentam investigar o que ela faz e de onde vem o dinheiro das acoes dele?É uma dúvida bem interessante. Acredito que a polícia vai investigar o padrão de vida do suspeito. Quebrar os sigilos (telemático, bancário, etc) dele e saber no que ele andou gastando ultimamente. Aqui no Brasil, para fazer isso, a polícia tem que pedir uma ordem judicial para a quebra dos sigilos do suspeito. Para isso, muitas das vezes e dependendo do juiz que vai expedir a ordem, ele não exigirá muitas evidências. Vai de caso para caso.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sabotag3x",
      "created_time": "December 24, 2023, 01:02:43 AM",
      "body": "O Zachxbt desativou sua conta no Twitter, então não dá nem mais para ler essa história das cartas de Magic.. será que alguém foi atrás dele? o próprio cara das cartas?Também serve de alerta para ficar de olho com golpistas se passando por ele.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TryNinja",
      "created_time": "December 24, 2023, 01:06:14 AMLast edit: December 24, 2023, 03:58:24 AM by TryNinja",
      "body": "Quote from: sabotag3x on December 24, 2023, 01:02:43 AMO Zachxbt desativou sua conta no Twitter, então não dá nem mais para ler essa história das cartas de Magic.. será que alguém foi atrás dele? o próprio cara das cartas?Também serve de alerta para ficar de olho com golpistas se passando por ele.Update dele, no seu canal do Telegram:Tirando férias? Só não entendi por que desativar. O perfil dele acaba sendo um arquivo de vários golpes que rolaram por aí, vide esse tópico o usando como fonte. E claro, o X/Twitter não perde tempo para memes... QuoteYOOOOOOOOOO @zachxbt deleted his account. LETS FUCKING GOOOOOOOOOOOOOOOOOOOOOOOOOOOO 2k microcap coins on the timeline.Absolute RugsMintable Coinshttps://twitter.com/Lord_Ashdrake/status/1738700828750344471Edit: já voltou",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mikel_012",
      "created_time": "December 24, 2023, 06:02:09 AM",
      "body": "Quote from: sabotag3x on December 24, 2023, 01:02:43 AMO Zachxbt desativou sua conta no Twitter, então não dá nem mais para ler essa história das cartas de Magic.. será que alguém foi atrás dele? o próprio cara das cartas?Também serve de alerta para ficar de olho com golpistas se passando por ele.Visitei o link e o tweet ainda está de pé, adoro ler sobre crimes de lavagem de dinheiro. Na netflix tem documentarios bem feitos sobre o assunto como o Dirty Money",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "l3pox",
      "created_time": "December 26, 2023, 12:44:15 PM",
      "body": "Quote from: mikel_012 on December 24, 2023, 06:02:09 AMQuote from: sabotag3x on December 24, 2023, 01:02:43 AMO Zachxbt desativou sua conta no Twitter, então não dá nem mais para ler essa história das cartas de Magic.. será que alguém foi atrás dele? o próprio cara das cartas?Também serve de alerta para ficar de olho com golpistas se passando por ele.Visitei o link e o tweet ainda está de pé, adoro ler sobre crimes de lavagem de dinheiro. Na netflix tem documentarios bem feitos sobre o assunto como o Dirty MoneySe você gosta desse assunto vai curtir o site rekt.newsEles catalogam varios hacks em crypto e escrevem sobre eles de forma detalhada e claraAlém disso tem um ranking dos maiores hacks. Bem legal",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}