{
  "id": "topic_5469167",
  "title": "CryptSafe",
  "author": "CryptSafe",
  "created_time": "October 04, 2023, 11:02:49 AM",
  "content": "I came across this update on one of the online dailies and it baffles me a lot. I remembered that Nigeria supplies Ghana electricity and I could remember vividly clear that there was a period Ghana celebrated one week constant electricity power supply  without interruption while depending on Nigeria as her supplier but the reverse is the case here in Nigeria. Ghana as a nation are developing their power sector rapidly while still depending on Nigeria and up to the point of possibly becoming a supplier to Nigeria as soon as they are done with the final stage of development of their power sector. This information was disclosed while they were having a Summit at Lagos on Nigeria Energy Leadership Summit as graced by Mr. Hanson Monney, the Head of the Generation and Transmission Unit at the Ghanaian Ministry of Energy. Quote“So, we are working on all these things to make sure that the power system of Ghana continues to be as good as it is or even better, and then, maybe, we can be exporting more to our big brothers in Nigeria when the grid is finally settled,” This has made me to have  a thought over this and I was wondering what is really the cause of our electricity gridlock and  epileptic power supply here in Nigeria. Finance I think is not the cause of our power shortage here in Nigeria as our government allocates huge fund to the power sector, Policies are made to help sustain power supply and also payment of electricity tariff which is not favorable to consumers as they complain lack of power supply and hence some do not bother complying with payment and if they do pay, they make part payment.QuoteMonney stressed the significance of lowering electricity prices, particularly for enterprises, since high electricity bills are a major issue in Ghana. “We saw that in Ghana historically. These industries have been subsidizing the residential sector, and it should be the other way around. Industries should remain viable so that businesses can thrive,” Would Nigeria be able to Implement such policies as Ghana did to sustain and encourage her citizens to pay their electricity tariff. What do you really think is the major cause of power failure here in Nigeria despite the huge funds going into the power sector coupled with the fact that Nigeria is rich in mineral deposit which could have helped well enough to cushion the lapses in our  power sector.Source",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5469167",
  "comments": [
    {
      "author": "Kara3",
      "created_time": "October 04, 2023, 11:44:20 AM",
      "body": "When I saw this update I just had a bitter sweet feeling about it, the sweet feeling is that our Ghanian brother are doing well, the bad feeling is naija my country our government don't even care to rectify our own problem, the refinery issue, as big as this country is there is no refinery, even though dy wanted to remove subsidy as already being done, provision should have been made before the removal of it, now look at how inflation has taken over every thing in the country, and the government are not even learning from there neighbours.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "October 04, 2023, 11:44:36 AM",
      "body": "Quote from: CryptSafe on October 04, 2023, 11:02:49 AMFinance I think is not the cause of our power shortage here in Nigeria as our government allocates huge fund to the power sectorI will point to production, not transmission. I will use four other countries for comparison. Production will also be proportional to transmission.Nigeria population according to 2021 estimate: 213.4 millionGhana population according to 2021 estimate: 32.83 millionSouth Africa population according to 2021 estimate: 59.39 millionMorocco population according to 2021 estimate: 37.08 millionCôte d'Ivoire population according to 2018 estimate: 27.48 millionNigeria is the most populated country in Africa and the sixth in the world. Which means we need more electricity. You will be surprised by this:Electricity production in Nigeria as of March 2023, 8,607 GWhElectricity production in Ghana as of December 2021, 22,051 GWhElectricity production in South Africa as of July 2023, 19,844 GWhElectricity production in Morocco as of December 2021, 40,512 GWhElectricity production in Côte d'Ivoire as of March 2023, 8,607 GWhIf you want to do more comparing to the electricity suffering in Nigeria, this is the link: https://www.ceicdata.com/en/indicator/nigeria/electricity-production#:~:text=Key%20information%20about%20Nigeria%20Electricity,Mar%202005%20to%20Mar%202023.Our governments are not trying at all. Or maybe it is mismanagement or the government is not funding power sector appropriately, it is left to them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Stepstowealth",
      "created_time": "October 04, 2023, 05:21:34 PM",
      "body": "Quote from: CryptSafe on October 04, 2023, 11:02:49 AMI came across this update on one of the online dailies and it baffles me a lot. I remembered that Nigeria supplies Ghana electricity and I could remember vividly clear that there was a period Ghana celebrated one week constant electricity power supply  without interruption while depending on Nigeria as her supplier but the reverse is the case here in Nigeria. Ghana as a nation are developing their power sector rapidly while still depending on Nigeria and up to the point of possibly becoming a supplier to Nigeria as soon as they are done with the final stage of development of their power sector. Na big shame to our country o, say this kind news dey come up in the first place. Why we never fit fix our light problem since how many years, na because say corruption carry leg enter that way too, and because say e get some kind line wey dem dey get light steady for this our country and na mostly men wey get money well well like politicians dey stay these kind areas wey that kind light dey dey, so dem nor fit understand or relate to how bad the light doings dey. Ghana wan make money form us because dem nor go supply the light for free, and that one go oncrese the money wey the country dey spend already. E nor make sense, that money wey dem wan use dey settle Ghana for the light, make dem use am for our side to boost our supply. We get everything to make am sup easily.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Coyster",
      "created_time": "October 04, 2023, 06:17:16 PM",
      "body": "Quote from: CryptSafe on October 04, 2023, 11:02:49 AMWhat do you really think is the major cause of power failure here in Nigeria despite the huge funds going into the power sectorA very good question, and i can say that the short answer to it is corruption. It is shocking that no administration has been able to handle the issue of epileptic power supply and provide constant electricity for Nigerians. Naija as a nation dey lack in all areas of electricity: generation, transmission, distribution/supply, e no really make sense and the government has to do more.TBH, e dey very sad say in 2023 we still dey talk about constant electricity, when other nations dey advance technologically and in other aspects, a nation as rich and blessed as ours no suppose get epileptic power supply as one of its problems.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Broadanbig",
      "created_time": "October 04, 2023, 10:13:42 PM",
      "body": "After reading this, I took a deep breath and i felt sober for my dear nation. How did we get to this point that it is very difficult to make amend of this so swiftly.  After i have read from this post, it is abundantly clear that Ghana  left Nigeria behind long ago. Now i can say that Nigeria long lost her stand and position of giant of Africa. It is a pity that little things that could have been sorted out by our government is now about taking a different dive prompting a nation we supply electricity to outshine us in that sector and even telling us that they would supply us electricity once they are done working on their power sector. This is a very shameful situation and our government would gladly and sheepishly accept it.I  no go dey surprise tomorrow them bring up the proposals and our government quickly key in because them dey always look for means to embezzle funds.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptSafe",
      "created_time": "October 05, 2023, 08:25:46 AM",
      "body": "Quote from: Coyster on October 04, 2023, 06:17:16 PMQuote from: CryptSafe on October 04, 2023, 11:02:49 AMWhat do you really think is the major cause of power failure here in Nigeria despite the huge funds going into the power sectorA very good question, and i can say that the short answer to it is corruption. It is shocking that no administration has been able to handle the issue of epileptic power supply and provide constant electricity for Nigerians. Naija as a nation dey lack in all areas of electricity: generation, transmission, distribution/supply, e no really make sense and the government has to do more.TBH, e dey very sad say in 2023 we still dey talk about constant electricity, when other nations dey advance technologically and in other aspects, a nation as rich and blessed as ours no suppose get epileptic power supply as one of its problems.Just like Ghana planning to key into electricity development as a result of their industrialisation to boost production and encourage the industries in their country to maintain their stand there and keep producing and paying their electricity tariff. This would have been the resolve of Nigeria but corruption would not allow our leaders see the positive aspects of it. Rather what they have in mind is a means of embezzlement even in a sector where the focus should be generation of electricity power supply so as to encourage people, industries etc to produce, businesses to thrive so that tariffs would be paid by consumers but the reverse is the case.It is a shame that Nigeria is still at this stage of facing electricity power outage while this should have been a thing of the past.  Other nations are talking of technological innovation and advancement, showcasing what they can offer to the world, here Nigeria is still dragging feet behind with corruption and underdevelopment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wiwo",
      "created_time": "October 05, 2023, 04:10:28 PM",
      "body": "Quote from: Charles-Tim on October 04, 2023, 11:44:36 AMQuote from: CryptSafe on October 04, 2023, 11:02:49 AMFinance I think is not the cause of our power shortage here in Nigeria as our government allocates huge fund to the power sectorElectricity production in Nigeria as of March 2023, 8,607 GWhElectricity production in Ghana as of December 2021, 22,051 GWhElectricity production in South Africa as of July 2023, 19,844 GWhElectricity production in Morocco as of December 2021, 40,512 GWhElectricity production in Côte d'Ivoire as of March 2023, 8,607 GWhUsing this data above that means Nigairia electricity production way below what the country consume in electricity,  a lot has to be done to improve the power sector and if Ghana as a neighbouring country can come in on that,  I think there is nothing wrong with that,  and as that will be part of their bilateral responsibility for Nigeria,  and also such of revenue to Ghana,  if Nigeria can supply them power for so lai ng I don't see why we should worry about Ghana becoming a supply of electricity to Nigeria,  if they have surplus electricity generation. And from the data above it shows that Ghana's electricity sector is indeed doing great being the highest on the list and I would like to know if the article in the link also covers the electricity consumption of each member country.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptopreneurBrainboss",
      "created_time": "October 05, 2023, 04:16:01 PM",
      "body": "Quote from: CryptSafe on October 04, 2023, 11:02:49 AMThis has made me to have  a thought over this and I was wondering what is really the cause of our electricity gridlock and  epileptic power supply here in Nigeria. Finance I think is not the cause of our power shortage here in Nigeria as our government allocates huge fund to the power sector, Policies are made to help sustain power supply and also payment of electricity tariff which is not favorable to consumers as they complain lack of power supply and hence some do not bother complying with payment and if they do pay, they make part payment.As my brother talk for up so, na corruption be the cause of everything and for we to get things straight na for the government to just privatized everything for the power sector for the country. The partial privatization wey dem do no dey work, make dem private the full sector and watch how things go better. I hope you know say e get some part of the country wey no dey lack light, we get places wey dey use federal light and their light dey dey like 24/7. Wetin this one mean be say the power dey but na distribution be the problem and that's because the power sector go dey lose if dem distribute the power to everybody. Na only those wey dem dey guarantee say dem go play na people wey dem dey give power and this people dey normally dey for areas wey dey use federal light like dem GRA, and prepaid meter areas dem. QuoteWould Nigeria be able to Implement such policies as Ghana did to sustain and encourage her citizens to pay their electricity tariff. What do you really think is the major cause of power failure here in Nigeria despite the huge funds going into the power sector coupled with the fact that Nigeria is rich in mineral deposit which could have helped well enough to cushion the lapses in our  power sector.One thing you have to consider is the population of Ghana and Nigeria, we no be their mate when e come to people to take care of and Nigeria no get good people management. I know say other countries dey wey get population and dem dey manager them well but that's where the corruption comes in because everything dey corrupt. When you put strategies in place to tackle all this things people dey well go spoil am and just like community users that'll refuse to pay because of entitlement and will demand to be given the lights for free and other illegal tapping of the light. Our corruption no go gree us pay when others dey use am freely as we fit tap the light illegally that's why I say government need to commot hand completely for the thing to work for here. Nigeria no be Ghana, our people mentality this side different. We can achieve success like Ghana when it comes to generation and distribution of electricity but the government need to leave the sector to private companies although they'll be monitoring it and maybe subsidy need come in too by the government.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cryptomultiplier",
      "created_time": "October 05, 2023, 04:45:57 PM",
      "body": "Quote from: Wiwo on October 05, 2023, 04:10:28 PMQuote from: Charles-Tim on October 04, 2023, 11:44:36 AMQuote from: CryptSafe on October 04, 2023, 11:02:49 AMFinance I think is not the cause of our power shortage here in Nigeria as our government allocates huge fund to the power sectorElectricity production in Nigeria as of March 2023, 8,607 GWhElectricity production in Ghana as of December 2021, 22,051 GWhElectricity production in South Africa as of July 2023, 19,844 GWhElectricity production in Morocco as of December 2021, 40,512 GWhElectricity production in Côte d'Ivoire as of March 2023, 8,607 GWhUsing this data above that means Nigairia electricity production way below what the country consume in electricity,  a lot has to be done to improve the power sector and if Ghana as a neighbouring country can come in on that,  I think there is nothing wrong with that,  and as that will be part of their bilateral responsibility for Nigeria,  and also such of revenue to Ghana,  if Nigeria can supply them power for so lai ng I don't see why we should worry about Ghana becoming a supply of electricity to Nigeria,  if they have surplus electricity generation. And from the data above it shows that Ghana's electricity sector is indeed doing great being the highest on the list and I would like to know if the article in the link also covers the electricity consumption of each member country. I was impressed by the update about the Ghana sharing electricity to Nigeria. By all means we sure can afford it and I can't stress how it will help alleviate the plight of the current situation. With petrol and food stuff prices seeing a hike in recent days, with more electricity, ideas will be borne, industries will function to maximum and entrepreneurs will be on the rise. Na light dey make people dey vex sometimes o, and everyone go fit agree say na true talk. We have supplied Ghana and neighboring countries with electricity for sometime and it is no bad idea to be supplied now when we need it most.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "knowngunman",
      "created_time": "October 05, 2023, 04:53:05 PM",
      "body": "Quote from: CryptopreneurBrainboss on October 05, 2023, 04:16:01 PMAs my brother talk for up so, na corruption be the cause of everything and for we to get things straight na for the government to just privatized everything for the power sector for the country. The partial privatization wey dem do no dey work, make dem private the full sector and watch how things go better. I hope you know say e get some part of the country wey no dey lack light, we get places wey dey use federal light and their light dey dey like 24/7. Wetin this one mean be say the power dey but na distribution be the problem and that's because the power sector go dey lose if dem distribute the power to everybody. Na only those wey dem dey guarantee say dem go play na people wey dem dey give power and this people dey normally dey for areas wey dey use federal light like dem GRA, and prepaid meter areas dem. Na the problem be that boss. Light na 24/7 stable here for this side although na private company dey handle am. The only time wey you no go see light for my compound na only when our meter unit subscription finish or when rain dey fall and immediately after the rain dem go restore the light again. E better make I pay money and enjoy myself than waiting for government and suffer. I dey in support of privatization too because na the way forward be that. Distributors dey stingy with unit distribution so that the little unit go cover a long time for people under government subsidy and sell large unit for private sectors to make more money and steal from it.The thing be say we like to dey complain about everything in this part of the country when we sef dey follow spoil the thing. I know government dey really fuck up but sometimes we need to calm down. Ghana wan supply Nigeria with electricity no be bad thing because we sef dey supply other countries with light and nobody dey complain about it. Calling Nigeria as giant of africa no be just name. Nigeria population don dey grow pass her resource and mismanagement follow join again to make it worse. Over load dey among wetin dey make our national grid collapse occasionally no be anything else. And the surprising thing be say even if national grid collapse, I still dey get light for this side.Privatization go make us hear body but we really need am to avoid staying in darkness when we get enough dam.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptoHeadlineNews",
      "created_time": "October 05, 2023, 05:54:27 PM",
      "body": "Quote from: CryptSafe on October 04, 2023, 11:02:49 AMThis has made me to have  a thought over this and I was wondering what is really the cause of our electricity gridlock and  epileptic power supply here in Nigeria. Finance I think is not the cause of our power shortage here in Nigeria as our government allocates huge fund to the power sector.Base on my personal research, I was made to understand that in 2021, over N152 billion naira was budgeted for electricity alone, and likewise in 2022 as another N120 billion naira was also allocated to electricity and same thing this year 2023, as another N239 billion naira was also budgeted for electricity . So when you add all these figures together, it clearly shows that capital has never been the problem of Nigerian poor electricity, but lack of proper management and misuse of public funds is the reason why we keep suffering for in total darkness. Hence, if our country Nigeria must achieve what Ghana just did, people placed in public offices just need to be held responsible when they fail to give account of public funds placed in their custody.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "October 05, 2023, 07:42:51 PM",
      "body": "Quote from: CryptSafe on October 05, 2023, 08:25:46 AMIt is a shame that Nigeria is still at this stage of facing electricity power outage while this should have been a thing of the past. A friend of mine went to Ghana and narrated how electricity is constant there. I have a friend that went to Tanzania and he narrated constant electricity where he stayed for over two weeks. I have a friend that went to Benin Republic that Nigeria is supplying light, they have better electricity supply and the city is known for its neatness. Countries that are less developed than us are having good electricity.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptSafe",
      "created_time": "October 05, 2023, 08:32:02 PM",
      "body": "Quote from: CryptopreneurBrainboss on October 05, 2023, 04:16:01 PMQuote from: CryptSafe on October 04, 2023, 11:02:49 AMThis has made me to have  a thought over this and I was wondering what is really the cause of our electricity gridlock and  epileptic power supply here in Nigeria. Finance I think is not the cause of our power shortage here in Nigeria as our government allocates huge fund to the power sector, Policies are made to help sustain power supply and also payment of electricity tariff which is not favorable to consumers as they complain lack of power supply and hence some do not bother complying with payment and if they do pay, they make part payment.As my brother talk for up so, na corruption be the cause of everything and for we to get things straight na for the government to just privatized everything for the power sector for the country. The partial privatization wey dem do no dey work, make dem private the full sector and watch how things go better. I hope you know say e get some part of the country wey no dey lack light, we get places wey dey use federal light and their light dey dey like 24/7. Wetin this one mean be say the power dey but na distribution be the problem and that's because the power sector go dey lose if dem distribute the power to everybody. Na only those wey dem dey guarantee say dem go play na people wey dem dey give power and this people dey normally dey for areas wey dey use federal light like dem GRA, and prepaid meter areas dem. Big man na this one be the another major wahala wey we dey face for Nigeria. The matter of corruption Na wetin hold Nigeria to this stage. The idea of privatisation dey okay but Na still dem go buy the power holding company. Even when dem pass back go buy dem no go fit still manage am.As for the areas wey dey receive light I wonder the segregation, wey make the light no dey go round. only a particular location dey receive light 24/7 pass others and some too Na based on their demand for turbine as an oil rich city wey make dem give dem.   why odas just remain for power outage like that nobody fit talk when month end dem cough out NEPA bill go pay over estimated bill wey dem no consume. Nigeria corruption Na don't tell anybody.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GiftedMAN",
      "created_time": "October 05, 2023, 09:07:32 PM",
      "body": "Quote from: Charles-Tim on October 05, 2023, 07:42:51 PMA friend of mine went to Ghana and narrated how electricity is constant there. I have a friend that went to Tanzania and he narrated constant electricity where he stayed for over two weeks. I have a friend that went to Benin Republic that Nigeria is supplying light, they have better electricity supply and the city is known for its neatness. Countries that are less developed than us are having good electricity.The two African countries you mentioned has been enjoying steady electricity supply for more than ten years now though Ghana may have steady supply of electricity but the chargers are too much when compared to other African countries and the saying that Nigeria has been supplying light to Benin Republic is still not clear to me because few years ago Benin Republic celebrated a good number of years of uninterrupted power supply while my country Nigeria has not experienced a 24hours of uninterrupted power supply for once. I think the information about Nigeria supplying light to Benin Republic is false because we can't be in total darkness while we are generating steady power supply to someone else that's total insane.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptSafe",
      "created_time": "October 05, 2023, 10:36:06 PM",
      "body": "Quote from: GiftedMAN on October 05, 2023, 09:07:32 PMQuote from: Charles-Tim on October 05, 2023, 07:42:51 PMA friend of mine went to Ghana and narrated how electricity is constant there. I have a friend that went to Tanzania and he narrated constant electricity where he stayed for over two weeks. I have a friend that went to Benin Republic that Nigeria is supplying light, they have better electricity supply and the city is known for its neatness. Countries that are less developed than us are having good electricity.The two African countries you mentioned has been enjoying steady electricity supply for more than ten years now though Ghana may have steady supply of electricity but the chargers are too much when compared to other African countries and the saying that Nigeria has been supplying light to Benin Republic is still not clear to me because few years ago Benin Republic celebrated a good number of years of uninterrupted power supply while my country Nigeria has not experienced a 24hours of uninterrupted power supply for once. I think the information about Nigeria supplying light to Benin Republic is false because we can't be in total darkness while we are generating steady power supply to someone else that's total insane.I am very much aware that Nigeria supplies Niger Republic electricity but that aspect of celebration is what I do not really know about but I know that of Ghana to have celebrated one week uninterrupted power supply. It is obvious that we supply to other countries and still yet we experience epileptic power supply.  We as a nation have not satisfied our own needs in terms of electricity  power supply and our the mega  stations are yet to be upgraded but the government claims to be releasing funds for that purpose and things are still the same way they are every year. No improvement, no growth, no development. All they  know is to give estimated bill, climb ladder and cut wire.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "RockBell",
      "created_time": "October 06, 2023, 06:52:34 AM",
      "body": "Quote from: Charles-Tim on October 04, 2023, 11:44:36 AMQuote from: CryptSafe on October 04, 2023, 11:02:49 AMFinance I think is not the cause of our power shortage here in Nigeria as our government allocates huge fund to the power sectorI will point to production, not transmission. I will use four other countries for comparison. Production will also be proportional to transmission.Nigeria population according to 2021 estimate: 213.4 millionGhana population according to 2021 estimate: 32.83 millionSouth Africa population according to 2021 estimate: 59.39 millionMorocco population according to 2021 estimate: 37.08 millionCôte d'Ivoire population according to 2018 estimate: 27.48 millionNigeria is the most populated country in Africa and the sixth in the world. Which means we need more electricity. You will be surprised by this:Electricity production in Nigeria as of March 2023, 8,607 GWhElectricity production in Ghana as of December 2021, 22,051 GWhElectricity production in South Africa as of July 2023, 19,844 GWhElectricity production in Morocco as of December 2021, 40,512 GWhElectricity production in Côte d'Ivoire as of March 2023, 8,607 GWhIf you want to do more comparing to the electricity suffering in Nigeria, this is the link: https://www.ceicdata.com/en/indicator/nigeria/electricity-production#:~:text=Key%20information%20about%20Nigeria%20Electricity,Mar%202005%20to%20Mar%202023.Our governments are not trying at all. Or maybe it is mismanagement or the government is not funding power sector appropriately, it is left to them.From this analysis, I was ashamed that our country has misplaced priority, and is not as if they are not aware of all these defaults, am very sure they know but they don't care. just imagine Nigeria being the sixth and most populated country in the world and also in Africa and we are still obviously putting ourselves to shame just look at the amount of electricity produced just 8,607 GWh just imagine even places like China that have a larger population, still produces good services to their citizens, look at morocco producing 40,000 GWh our country has supposed to have increased the production of electricity, I can not really remember but this issue has been discussed before in the house of assembly and still nothing have been done since it was discussed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptSafe",
      "created_time": "October 06, 2023, 08:32:12 AM",
      "body": "Quote from: RockBell on October 06, 2023, 06:52:34 AMQuote from: Charles-Tim on October 04, 2023, 11:44:36 AMQuote from: CryptSafe on October 04, 2023, 11:02:49 AMFinance I think is not the cause of our power shortage here in Nigeria as our government allocates huge fund to the power sectorI will point to production, not transmission. I will use four other countries for comparison. Production will also be proportional to transmission.Nigeria population according to 2021 estimate: 213.4 millionGhana population according to 2021 estimate: 32.83 millionSouth Africa population according to 2021 estimate: 59.39 millionMorocco population according to 2021 estimate: 37.08 millionCôte d'Ivoire population according to 2018 estimate: 27.48 millionNigeria is the most populated country in Africa and the sixth in the world. Which means we need more electricity. You will be surprised by this:Electricity production in Nigeria as of March 2023, 8,607 GWhElectricity production in Ghana as of December 2021, 22,051 GWhElectricity production in South Africa as of July 2023, 19,844 GWhElectricity production in Morocco as of December 2021, 40,512 GWhElectricity production in Côte d'Ivoire as of March 2023, 8,607 GWhIf you want to do more comparing to the electricity suffering in Nigeria, this is the link: https://www.ceicdata.com/en/indicator/nigeria/electricity-production#:~:text=Key%20information%20about%20Nigeria%20Electricity,Mar%202005%20to%20Mar%202023.Our governments are not trying at all. Or maybe it is mismanagement or the government is not funding power sector appropriately, it is left to them.From this analysis, I was ashamed that our country has misplaced priority, and is not as if they are not aware of all these defaults, am very sure they know but they don't care. just imagine Nigeria being the sixth and most populated country in the world and also in Africa and we are still obviously putting ourselves to shame just look at the amount of electricity produced just 8,607 GWh just imagine even places like China that have a larger population, still produces good services to their citizens, look at morocco producing 40,000 GWh our country has supposed to have increased the production of electricity, I can not really remember but this issue has been discussed before in the house of assembly and still nothing have been done since it was discussed.  The National house does not even care about that aspect of the national concern as it relates to the ordinary citizens of the nation. All they care is passing bills that can favour them when it comes to sharing  of money. They are not bothered because they get allowance for diesel or possibly fuel so they power their plants and generators to supply them constant power supply in their various houses. Our nation really does not prioritize power supply because if they do, Nigeria would have long passed this stage of electricity outage and what we could be aiming for is industrialization and attracting industries to our country for the fact that we have resolved the issues  of power supply because that is what most mega industries look into before choosing a country to establish their high powered factories.Looking at the statistics, you would definitely call this nation a joke. A nation known as the highest populous black nation which should be aware that the electricity demand would be very much high and should be in the move to increase her capacity and up till now its still the same. No improvement, not even an attempt made by the Ministry, no nothing. How do they want to encourage industrialization if they can not tackle demand for power supply.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "HajiBagi",
      "created_time": "October 06, 2023, 03:35:06 PM",
      "body": "Quote from: Kara3 on October 04, 2023, 11:44:20 AMWhen I saw this update I just had a bitter sweet feeling about it, the sweet feeling is that our Ghanian brother are doing well, the bad feeling is naija my country our government don't even care to rectify our own problem, the refinery issue, as big as this country is there is no refinery, even though dy wanted to remove subsidy as already being done, provision should have been made before the removal of it, now look at how inflation has taken over every thing in the country, and the government are not even learning from there neighbours.We just dey Para every day about our country, but waiting I wan make we understand now be say no matter how we dey talk the problem wey we dey face for Nigeria he no go finish, waiting we supposed do be say make we chill as, reason waiting go make our country good for us, as I hear this update now he dey sweet me because na help Ghana wan help us and he go good wey our country supposed get light, although I know say na Nigeria dey supply  Ghana with some things before but due to the progressive wey Ghana dey find dey cooperate and make their country better country, our leaders Don fuck from the beginning and as the matter dey like this he go take time wey Nigeria go come back to his normal ways.No be say we no love our country oo, in fact I love Nigeria, but our habit no good and na waiting dey kill us be that one, we Niger get one thing, if we Don get we no wan dey give people wey never get and we know say God no be like us, he fit change everything about person wey no dey give and give to person wey deserve it, we get many resources wey dey bring money to the country but our leaders no dey let us feel like say we get them, all this thing's wey we dey face for Nigeria na greediness, I swear greediness no dey Allow person improve and even country wey greedy too much it will never improve.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptSafe",
      "created_time": "October 06, 2023, 04:49:02 PM",
      "body": "Quote from: HajiBagi on October 06, 2023, 03:35:06 PMQuote from: Kara3 on October 04, 2023, 11:44:20 AMWhen I saw this update I just had a bitter sweet feeling about it, the sweet feeling is that our Ghanian brother are doing well, the bad feeling is naija my country our government don't even care to rectify our own problem, the refinery issue, as big as this country is there is no refinery, even though dy wanted to remove subsidy as already being done, provision should have been made before the removal of it, now look at how inflation has taken over every thing in the country, and the government are not even learning from there neighbours.We just dey Para every day about our country, but waiting I wan make we understand now be say no matter how we dey talk the problem wey we dey face for Nigeria he no go finish, waiting we supposed do be say make we chill as, reason waiting go make our country good for us, as I hear this update now he dey sweet me because na help Ghana wan help us and he go good wey our country supposed get light, although I know say na Nigeria dey supply  Ghana with some things before but due to the progressive wey Ghana dey find dey cooperate and make their country better country, our leaders Don fuck from the beginning and as the matter dey like this he go take time wey Nigeria go come back to his normal ways.No be say we no love our country oo, in fact I love Nigeria, but our habit no good and na waiting dey kill us be that one, we Niger get one thing, if we Don get we no wan dey give people wey never get and we know say God no be like us, he fit change everything about person wey no dey give and give to person wey deserve it, we get many resources wey dey bring money to the country but our leaders no dey let us feel like say we get them, all this thing's wey we dey face for Nigeria na greediness, I swear greediness no dey Allow person improve and even country wey greedy too much it will never improve.Our leaders dem don already condition the system in the way that na only them the settings go dey favour continuously. Greed na the major reasons why dem set am like that. Only them want to chop alone to the point wey be say them don turn everything to family business for themselves alone. Another thing I come observe be say dem no want the youth to improve at all because if the youths them begin see light omo our leaders dem na on your own o, nobody go send them at all and dem no go fit use anybody for whatsoever reasons. Hence the system dey as e dey like this and e come be say the country no dey improve at all.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}