{
  "id": "topic_5408959",
  "title": "Fivestar4everMVP",
  "author": "Fivestar4everMVP",
  "created_time": "August 06, 2022, 09:54:12 PM",
  "content": "I was reading an article of how Hackers returned $22 million dollars off $190 million hacked money back to Nomad after they were promised 10 percent bounty if they return the money, and not just the bounty, the Nomad team also promised the Hackers that no legal action will be taken against them if the stolen money was returned.And after the promise, out of a total of $190 million dollars that was stolen in from Nomad through the hack, $22 million have been returned.The above arose my curiosity to want to know what actually drive this hackers, and what do they do with all this money they get grok Hacking?Do they hack for the money? - - why then did this ones return the proceeds from their hack for a mere 10 percent bounty?.Do they do it for Power, as a showoff, to make name for themselves? - - why then do hackers hide their identity if what they do for power and fame?. Do they do it just for Fun? - - what is fun in destroying a project some persons spent several years of labor and huge resources to build? And also in the process, stealing away people's hard earned money. Miscallicious question:- it is estimated that over $2 billion dollars have been stolen from cross chain bridges through hacks, this excludes other forms of Hacking.... what exactly do this hackers do with all this money?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5408959",
  "comments": [
    {
      "author": "Stalker22",
      "created_time": "August 06, 2022, 11:01:24 PM",
      "body": "The term \"hacker\" has become synonymous with both the good guys and bad guys of the Internet world. The reality is that most hackers are simply coders trying to make a living by finding bugs in software or exploiting loopholes in computer networks. Some do it for fun; others do it for profit.The most common motivation behind hacking is money, either through selling information about vulnerabilities or through finding exploits that hackers can sell on underground markets.Some hackers want to make money hacking, because can be a lucrative business.Some hackers want to hack for the sake of hacking, because it is their sadistic version of fun.Some hackers want to be hackers because it is cool in their circles.Some hackers have no ulterior motive when they hack; they just want to hack.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "owlcatz",
      "created_time": "August 07, 2022, 01:39:34 AM",
      "body": "speaking from my own experience as a youngster on the internet when it was literally first born (I dialed into it via a 9600 baud modem to my local library and used Lynx on a VAX system... I never even knew the internet had fckn colors until dial-up arrived a few years later and could use Netscape LOL....  Back then, I was never out to cause anything malicious, I just enjoyed learning ways to do stuff that were \"different\" and back then, things were much more simpler as well, but it was also like the wild west of computing, similar to 2013-2014 for BTC lol...  That said, I think a lot of people are just out for a challenge , or just to learn. Sometimes it may cause damage, ofc, but personally I never broke anything that I'm aware of. I just tried to learn as much as I could about TCP/IP and networking etc...  Nowadays, there are so many attack vectors that it's much easier than back then to exploit for gain - In my days, all there was was literally Yahoo search, and a fuckin bunch of UNI servers hosting Unix software lol... I remember telnet was very fun back then too... Anyhow, I think many people just do it to learn, but nowadays, it's very easy for a very smart (and scammy)! person to find exploits... The more code that exists, the more exploits to be found and so on ... 🤷‍♂️",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "August 07, 2022, 05:20:27 AM",
      "body": "Quote from: Fivestar4everMVP on August 06, 2022, 09:54:12 PMThe above arose my curiosity to want to know what actually drive this hackers, and what do they do with all this money they get grok Hacking?You should read Approaching Zero Hacker. It is a history book related to hacking and explores why they do these things. In these cases, it's either for access, or profit. If it's for access, then it is similar to a video game (to those hackers), and the aforementioned hacks won't involve theft.QuoteDo they do it for Power, as a showoff, to make name for themselves? - - why then do hackers hide their identity if what they do for power and fame?. Because they're obviously going to be hounded by the feds and interpol. Some early viruses included contact information and street address in the payload.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "August 07, 2022, 07:14:29 AM",
      "body": "There are literally good and bad hackers. Obviously these guys are way out of league on cryptocommunity. Lets say hackers returned tons of money doesnt mean they are just trying to hack and make money out of it. They are trying to prove that there are loopholes on such security and trying out their skills and possibility of a hack could somehow left the network unsafe.Maybe they thought its not gonna work but somehow it did and get shocked to know that they already penetrated and exploit it. Some guys returns it to show courtesy that their security isnt that great. But unfortunately some are just really doing for the sake of money which is bad for the crypto industry.I am curious to know if the remaining unreturned funds are coming from a single entity or there are actually different groups that hacked that $190m from nomad.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oshosondy",
      "created_time": "August 07, 2022, 07:57:46 AM",
      "body": "Quote from: Fivestar4everMVP on August 06, 2022, 09:54:12 PMThe above arose my curiosity to want to know what actually drive this hackers, and what do they do with all this money they get grok Hacking?Do they hack for the money? - - why then did this ones return the proceeds from their hack for a mere 10 percent bounty?.Do they do it for Power, as a showoff, to make name for themselves? - - why then do hackers hide their identity if what they do for power and fame?. Do they do it just for Fun? - - what is fun in destroying a project some persons spent several years of labor and huge resources to build? And also in the process, stealing away people's hard earned money. That is what they know doing, they hack, know a lot about it and they make money from it. In the example you pointed to above, they were promismsed certain percentage but which is a huge amount of money, the hackers saw the offer good but they will still be very careful. With the thinking that the project developers promised not to have a legal action against them and they still have some amount of money not sent back. Once they know that after renting and buying some tools for the hack, that they will still make high profit, they may consider the offer good. I have even read one in the past that the hackers return almost all the money but took just little.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "robelneo",
      "created_time": "August 14, 2022, 11:25:31 AM",
      "body": "Quote from: Stalker22 on August 06, 2022, 11:01:24 PMSome hackers want to make money hacking, because can be a lucrative business.Some hackers want to hack for the sake of hacking, because it is their sadistic version of fun.Some hackers want to be hackers because it is cool in their circles.Some hackers have no ulterior motive when they hack; they just want to hack.There are two kind of hackers black and white hackers the first one are hacking for money fame and fortune and to enhance their skills, they never get satisfied they keep hacking and they don't care about the losses of projects they are hacking they are truthless and have a criminal mind.The second one is there to help companies and society combat hacking and to make companies hacker-proof, it takes a hacker to fight a hacker, but there are black hackers that disguises as white hackers, and there are white hackers that disguise as black hackers, the best to combat these hacking is to educate ourselves on how they work and to pick the right tool to protect ourselves and our project.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dimonstration",
      "created_time": "August 14, 2022, 11:31:13 AM",
      "body": "Most of the hacker on crypto obviously do it for money because most the crypto hacking incident is related on funds and not just about the security of the project itself. They are breaching the security of the project just to robbed on the project wallet. Those hackers that return the money are those want a safe money and less hassle with the authorities once they are already tracked. I think that there’s only few white hats on crypto because most of them focus on political affairs and banking industry.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Stalker22",
      "created_time": "August 14, 2022, 03:11:10 PM",
      "body": "Quote from: robelneo on August 14, 2022, 11:25:31 AMQuote from: Stalker22 on August 06, 2022, 11:01:24 PM~There are two kind of hackers black and white hackers ~I hope you are not talking about the color of their skin.  There is a variety of different subcultures within the hacker community and each has their own set of rules, ethics and values, and what is and is not allowed to be done. In addition to white hats and black hats, there are grey hats, who are technically criminals but their actions are not malicious or damaging to others. The hacker community is also split into different groups based on their skill level, from script kiddies to ellite black hats and everything in between.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}