{
  "id": "topic_5465589",
  "title": "Lucas Garcia",
  "author": "Lucas Garcia",
  "created_time": "September 04, 2023, 09:11:41 AMLast edit: May 23, 2024, 07:12:29 AM by Lucas Garcia",
  "content": "[UPDATE] 09/18/23 The affiliate earning system has been activated. All affiliate earnings can be instantly withdrawn as BNB. Please check to the Affiliate campaign descriptions for details.[UPDATE] 11/17/23 The Telegram campaign has been updated. A new TikTok and YouTube campaign has been added. The article campaign has been concluded.[UPDATE] 12/23/23 The new Twitter campaign has been added. With real money USDT. Bicity COIN Platform 10.000 USDT Pool(We make daily payments in USDT)★ WEBSITE ★ LAUNCHPAD ★ TELEGRAM ★ TWITTER ★ INSTAGRAM ★ WHITEPAPER The bounty program has been launched and will last throughout the ICO period. Bicity Coin is running one of the biggest and most popular Bounties. Due to the high number of participants,you will be able to check the Bounty plan at their official website and communicate with their Bounty support at contact@bicity.comInfo About the Project:The deployment of BiCity will be established upon the robust framework of the Binance Smart Chain (BSC), a cutting-edge blockchain platform renowned for its eciency, security, and seamless integration of decentralized applications. By leveraging the capabilities of BSC, BiCity aims to ensure a high-performance ecosystem that not only enhances transaction speed and scalability but also reinforces the overall security infrastructure. This strategic choice underscores our commitment to providing a stable, secure, and advanced environment for users to engage with the BiCity platform seamlessly 1. All participants must join the Bicity Coin’s official Telegram Group2. Talking about the bounty in the project chat group will lead to immediate disqualification from the campaign and an instant ban from the company chat group.Please ask your bounty-related questions in the contact@bicity.com3. KYC is not required for the bounty campaign. However, the project's team has the right to require KYC for suspicious cases.4. Please note that any offensive or inappropriate behavior will lead to immediate disqualification from the campaign.5. Using multiple accounts, cheating and spamming are not allowed.6. All participants must send the Proof of Authentication post to join the bounty program.Proof Of Registration Post Format:Code:#PROOF OF REGISTRATIONForum Username:Forum Profile Link:Telegram Username:Participated Campaigns:BSC wallet address:Bicity Ref ID:1. Participants are required to sign up on the Bicity Coin's Launchpad ICO website.2. All participants must join the Bicity Coin’s official Telegram Group.3. Talking about the bounty program in the project chat group will lead to immediate disqualification from the campaign and an instant ban fromthe company chat group.Please ask your bounty related questions in the contact@bicity.com4. KYC is not required for the bounty campaign. However, the project's team has the right to require KYC for suspicious cases.5. Please note that any offensive or inappropriate behavior will lead to immediate disqualification from the campaign.6. Using multiple accounts, cheating and spamming are not allowed. You will be disqualified from the bounty program immediately and all your accountswill be banned permanently.7. Article and Video submission form will be closed 3 days before the end of the bounty.8. Negative Trusted Accounts may be allowed into this Campaign if the reason for red trust is LIBEL or UNJUSTIFIABLE.Final Decision is at the Bounty manager's discretion, if you have a massively red trusted account or acquire too many negatives during the campaign,you accept the risk that you might be eventually removed and your stakes voided.9. All participants must send the Proof of Authentication post to join the bounty program.10. All reports will be sent using the google report submission form. For articles and videos please use the registration form.Reports made on the thread will not be calculated.Proof Of Registration Format (All participants must send 1 time):Code:#PROOF OF REGISTRATIONForum Username:Forum Profile Link:Telegram Username:Participated Campaigns:BSC wallet address:Bicity Ref ID : Bounty AllocationArticle                                         (50%) Video                                          (50%) Note: Due to the bounty duration and pool, we have limited the number of participants for this bounty.Youtube :  First 100 approved participants.Article: First 150 approved participants.Rewards:Very High Quality Tweet comment : 5$ USDTHigh quality Tweet comment: 2,5$ USDTGood quality Tweet comment: 1$ USDTAverage quality Tweet comment : 0,5$ USDTPoor quality tweet comment : 0,1$ USDTRules:1. Every participant must follow the Bicity Coin's Twitter Page2. A comment will be written under the latest tweet on Twitter. The comment must be relevant to the post. 3. All comments that appear fake will be deleted, and you will not be eligible for the bounty. 4. Participants have to make 1 new tweet comment and 1 retweet and like.5. Your privacy settings must be set to public so that we can check your work.6. The first participants immediately after the post is shared are rewarded more and stand a chance to win more.7.Tweets should never be removed.Removal/deletion will result in disqualification.8.The same Twitter account can participate under the same tweet only once. You can participate again under new tweets.9.In tweet comments, the minimum length should be 2 words, and the maximum length should be 15 words. (new rule 23.12.2023)10.Twitter accounts must have a minimum of 501 followers (new rule 28.12.2023)How to join:1. Register at Bicity Launchpad ICO website.2. Must follow the Bicity Coin's Twitter Page3. Fill the registration form: https://forms.gle/8xUmwDqotfLxxCfR6 Rewards:Legendary Quality: 250$ USDT + 250$ worth of Bicity (video>25 000 views)Diamond Quality: 100$ USDT + 100$ worth of Bicity (video>10 000 views)Very High Quality: 50$ USDT + 50$ worth of Bicity High quality: 25$ USDT + 25$ worth of BicityGood quality: 10$ USDT + 10$ worth of BicityAverage quality: 5$ USDT + 5$ worth of BicityPoor quality: 1$ USDT + 1$ worth of BicityRules:1. Participants must have at least 10+ youtube subscribers or tiktok. Videos need to be a minimum of 30 seconds in length.2. Each participant can send 1 video only.3. Video Content must focus on a relevant topic: project features,   Tokensale, latest token updates, blockchain, etc.4. Only original video content will be accepted.5. Face cam video will be highly recommended and considered.6. Bot voices will not be rewarded. But, a good quality animation video with bot voices will be rewarded.7. Bad quality video will not be rewarded. USDT will be awarded based on the number of engagements and quality.8. Videos should never be removed, Removal/deletion will result in disqualification.9. All videos need to have a hashtag #bicity #ico #presale.How to join:The campaign has been suspended due to the continuous submission of bot videosRewards:Legendary Quality: 250$ USDT + 250$ worth of Bicity (video>25 000 views)Diamond Quality: 100$ USDT + 100$ worth of Bicity (video>10 000 views)Very High Quality: 50$ USDT + 50$ worth of Bicity High quality: 25$ USDT + 25$ worth of BicityGood quality: 10$ USDT + 10$ worth of BicityAverage quality: 5$ USDT + 5$ worth of BicityPoor quality: 1$ USDT + 1$ worth of BicityRules:1. Participants must have at least 10+ youtube subscribers. Videos need to be a minimum of 3 minutes in length.2. Each participant can send 1 video only.3. Video Content must focus on a relevant topic: project features,   Tokensale, latest token updates, blockchain, etc.4. Only original video content will be accepted.5. Face cam video will be highly recommended and considered.6. Bot voices will not be rewarded. But, a good quality animation video with bot voices will be rewarded.7. Bad quality video will not be rewarded. USDT will be awarded based on the number of engagements and quality.8. Videos should never be removed, Removal/deletion will result in disqualification.9. All videos need to have a link to the Proof of Authentication and Bicity project's website,  Bicity Twitter page, Telegram, YouTube channel or any other social media.10. NEW RULE - All links must be clickable. Please verify your channel to get clickable links.Otherwise you will not get any rewards.(09.14.2023)Bonus 100% referral campaign note:Participants of the Video campaign can also earn bonus by referring investors with their referral link.You should register on the Bicity Launchpad ICO website and create your unique referral link to earn 100% of the Bicity + 5% Bicity as an addition to your bounty stakes.How to join:The campaign quota has been reached.Thanks for your participationRewards:Diamond Quality: 100$ USDT + 100$ worth of Bicity (yahoo , benzinga ,bloomberg)Very High Quality: 50$ USDT + 50$ worth of Bicity High quality: 25$ USDT + 25$ worth of BicityGood quality: 10$ USDT + 10$ worth of BicityAverage quality: 5$ USDT + 5$ worth of BicityFair quality: 1$ USDT + 1$ worth of BicityRules:1. Articles should be quality and unique with a minimum of 500 words. (Participants who copy the project's website, whitepaper or ANN thread, will not receive rewards)2. Each participant can write more than 1 article, however, the articles need to be clearly different from each other and published at another website,3. Articles should be published on blogs recommended by us: Steemit, Medium, and LinkedIn and must be publicly accessible. Other high ranked blogs may be accepted.4. For the Very high-Quality articles only 1 Tier and 2 Tier websites such as investing.com, Business Insider, Cointelegraph, Digital Journal etc. are accepted.5. Content must focus on a relevant topic: project features, latest project's token updates, blockchain, etc. Everyone should include a note about Bicity Launchpad ICO.6. Participants can read about the project in its Main Website and Whitepaper.7. Only quality and original content will be accepted..8. Articles should never be removed.9. Removal/deletion will result in disqualification.10. Published Articles must include at least 2 images of the project, link to the the Proof of Authentication, the project's ICO website, main website, Medium page,Twitter page, Telegram group, Facebook page, YouTube channel, or any other social media.12. Please provide enough details of the writer (bounty hunter) at the end of the article to ensure authenticity. This will be verified!13. By joining this program, all participants accept that the project's team can use all these articles as marketing materials.14. NEW RULE - Each participant can write ONLY 2 article. (09.12.2023)15. NEW RULE - Each article must be indexed by google.If you don't know mean 'index' do your own research.If article not indexed by google , than user will not receive any rewards (09.14.2023)16. Do not try to cheat,creating multiple accounts or etc. We need good quality articles. For other articles it doesn't matter to us. Make a good quality article and get high rewards.Work smart not hard. Good luck.  (09.14.2023)Bonus 100% referral campaign note:Participants of the Video campaign can also earn bonus by referring investors with their referral link.You should register on the Bicity Launchpad ICO website and create your unique referral link to earn 100% of the Bicity + 5% Bicity as an addition to your bounty stakes.How to join:[The campaign quota has been reached.Thanks for your participation]Rewards:RANK 1-5 : 50$ worth of Bicity RANK 5-15 : 25$ worth of Bicity RANK 15-50 : 10$ worth of Bicity RANK 50-100 : 5$ worth of Bicity RANK 100> : 1$ worth of Bicity CHECK LIVE RANK LIST HERE.Rules:1. Every participant must join the Bicity Coin's Chat Group2. The most active and engaged individuals who send messages in the Telegram channel will be ranked at the top and become the winners of the grand Rewards.3. Telegram post must contains less than 10 characters. Must look organic, be in harmony with the conversation, and avoid copy-pasting.4. We are tracking all text , usernames , IPs , devices and every messages. Do not try to cheat or create multiple account.5. Each person can participate in the Telegram campaign only once.6. Talking about the bounty program in the project chat group will lead to immediate disqualification and banned from the campaign and an instant ban fromthe Bicity chat group.7. All participants must send the Proof of Authentication post to join the bounty program8. Your telegram username must be visible to all while in the community.9. You must stay in the telegram group until the end of the campaign to receive your Rewards.10.Do not spam into the telegram group.Immediate disqualification and banned from the campaign.11.The rewards are distributed every 15 days. Once the distribution is completed, it will be announced in the chat group.How to join:1. Register at Bicity Launchpad ICO website.2. Join the Bicity Coin’s Chat official Telegram Group.3. Fill the registration form: https://app.bicity.com/telegram-bounty.php Reward:You can instantly withdraw your affiliate earnings as BNB.Description&Rules:1. The affiliate commission rate is currently at 25%, but this is only valid for a limited time.2. You can instantly withdraw up to 50% of your affiliate earnings as BNB. 3. Calculations are made directly based on Bicity coins purchased through your referral link. You can track all the details through the Launchpad panel.4. There is no minimum or maximum limit.5. It doesn't matter if it's YouTube, Twitter, TikTok, Facebook, Instagram, or any other platform. All platforms are valid.6. ONLY REFERRAL EARNINGS can withdraw as BNB. All other bounty reward earnings will be withdrawable after the ICO is concluded.How to join:1. Register at Bicity Launchpad ICO website.2. And go to referral page and you can find your referral URL.You may also check the Bounty information at the official Bicity Launchpad ICO website and ask about the bounty at Bicity Coin Bounty Support contact@bicity.com",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5465589",
  "comments": [
    {
      "author": "$Atik2023",
      "created_time": "September 04, 2023, 09:12:34 AM",
      "body": "#PROOF OF REGISTRATIONForum Username: $Atik2023Forum Profile Link: https://bitcointalk.org/index.php?action=profile;u=3558420   Telegram Username: @Nill3NillParticipated Campaigns: Twitter,Telegram,Discord.BSC Wallet Address: 0xCF5176D7d4b149E62f9d27A14a6dfe35261B0fCd",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mdnadim2",
      "created_time": "September 04, 2023, 10:31:05 AM",
      "body": "Proof Of RegistrationForum Username: mdnadim2Forum Profile Link: https://bitcointalk.org/index.php?action=profile;u=3573417Telegram Username: @MdNadim049Participated Campaigns:Twitter,telegram  BSC Wallet Address: 0x65Ce7Bb2cd5e2D48EaCe5700631ECA04B5e2F909",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "flyinghamster",
      "created_time": "September 05, 2023, 02:08:51 PM",
      "body": "Proof Of RegistrationForum Username: flyinghamsterForum Profile Link: https://bitcointalk.org/index.php?action=profile;u=3576193Telegram Username: @FlyingHamsterParticipated Campaigns: YoutubeBSC Wallet Address:0xE07D8221a16df381bdA9855E5ea37ecF87Ea4F7d",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Boe",
      "created_time": "September 05, 2023, 02:16:06 PM",
      "body": "#PROOF OF REGISTRATIONForum Username: BoeForum Profile Link: https://bitcointalk.org/index.php?action=profile;u=3511793Telegram Username: @Boe_yes37Participated Campaigns: Twitter, Telegram,BSC Wallet Address: 0x3f0c523b86d369d2597916633c59baac85ABc626",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "THeWildking",
      "created_time": "September 05, 2023, 05:42:53 PM",
      "body": "#PROOF OF REGISTRATIONForum Username: TheWildKingForum Profile Link: https://bitcointalk.org/index.php?action=profile;u=3507964Telegram Username: @the_wildkingParticipated Campaigns: Twitter, Telegram, TikTok, ArticleBSC Wallet Address: 0x7Da0f8d75504E39C5d3e1675E359e0f49D860ce0",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "direumateul02",
      "created_time": "September 05, 2023, 05:52:00 PMLast edit: September 08, 2023, 08:17:24 PM by direumateul02",
      "body": "#Proof Of RegistrationForum Username: direumateul02Forum Profile Link: https://bitcointalk.org/index.php?action=profile;u=3437220Telegram Username: @DireumatttlParticipated Campaigns : ARTICLE , YOUTUBEWallet Address : 0xcf3DA8D27BC354C8Beb13A98205043e5c0967232",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ella2023ella",
      "created_time": "September 05, 2023, 09:20:45 PM",
      "body": "#Proof Of RegistrationForum Username: ella2023ellaForum Profile Link: https://bitcointalk.org/index.php?action=profileTelegram Username: @ellawotshoenParticipated Campaigns : ARTICLEWallet Address : 0x31C2707378c4141a282d7f51E2B42373f0A485d1",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "prabowo99",
      "created_time": "September 06, 2023, 01:08:00 AM",
      "body": "#PROOF OF REGISTRATIONForum Username: prabowo99Forum Profile Link: https://bitcointalk.org/index.php?action=profile;u=2355059Telegram Username: @HendradoddoParticipated Campaigns: ArticleWallet Address : 0x7494CB69BfB49CB78cf5b1e50193392cB075Af0C",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "warimin",
      "created_time": "September 06, 2023, 05:01:34 AM",
      "body": "#PROOF OF REGISTRATIONBitcointalk Username: wariminBitcointalk Profile Link: https://bitcointalk.org/index.php?action=profile;u=2356204username telegram : @aceppermanaCampaign Participated: ArticleBSC wallet address : 0x343A205ecEca915397620093c8A721DFe9a50b82Bicity Ref ID : https://app.bicity.com/invite?ref=UD07976",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kay01",
      "created_time": "September 06, 2023, 04:03:48 PM",
      "body": "# PROOF OF REGISTRATIONForum Username:kay01Forum Profile Link: https://bitcointalk.org/index.php?action=profile;u=3574840Telegram Username: @ofktoei392Participated Campaigns: Twitter,Article,Video,TikTokBsC Wallet Address: 0x4df7A84D674DEbe33cd9FDd9729AFAc2CF3D7abf",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "khan2323",
      "created_time": "September 07, 2023, 01:37:44 PM",
      "body": "#PROOF OF REGISTRATIONBitcointalk Username: khan2323Bitcointalk Profile Link: https://bitcointalk.org/index.php?action=profileusername telegram : @khan2323Campaign Participated: ArticleBSC wallet address : 0x443A205ecEca915397620093c8A721DFe9a30c83",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jonson545",
      "created_time": "September 07, 2023, 09:59:44 PM",
      "body": "#Proof of AuthenticationBitcointalk Username: jonson545Bitcointalk Profile Link: https://bitcointalk.org/index.php?action=profile;u=2355063Telegram Username: @thomattParticipated Campaigns: articleWallet Address : 0x2B43c1e447e02084296eA5DcfE2F10e711d1C26b",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Alaho15",
      "created_time": "September 08, 2023, 05:59:24 AM",
      "body": "#PROOF OF REGISTRATIONForum Username: Alaho15Forum Profile Link: https://bitcointalk.org/index.php?action=profile;u=2513944Telegram Username: @Alaho15Participated Campaigns: ArticleBSC wallet address: 0x0e55B03D7c3c5427E7b10F6b0B420bb16842b4c5Bicity Ref ID : UD07980",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mdnadim2",
      "created_time": "September 08, 2023, 07:42:41 AM",
      "body": "PROOF OF REGISTRATIONForum Username: mdnadim2Forum Profile Link: https://bitcointalk.org/index.php?action=profile;u=3573417Telegram Username: @MdNadim049Participated Campaigns: Twitter, telegram,BSC Wallet Address: 0x65Ce7Bb2cd5e2D48EaCe5700631ECA04B5e2F909",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "abihoyongsugiihh",
      "created_time": "September 08, 2023, 08:04:46 AM",
      "body": "#PROOF OF AUTHENTICATIONForum Username: abihoyongsugiihhForum Profile Link: https://bitcointalk.org/index.php?action=profile;u=3468992Telegram Username: @abiriskParticipated Campaigns: ArticleBSC Wallet Address : 0x13709d432D989295dA8c9dC9327aB9a9234D1161",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cryptocoinsssss",
      "created_time": "September 08, 2023, 08:19:55 AM",
      "body": "Proof of Authentication PostBitcointalk Username: CryptocoinsssssBitcointalk Profile Link: https://bitcointalk.org/index.php?action=profile;u=3557522Telegram Username: @CryptocoinsssssCampaign Category Participated:Trust Wallet Address: 0xeB6083c46f34668b978570cE56D363DB0492834E",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Usman7860",
      "created_time": "September 08, 2023, 09:34:45 AMLast edit: December 23, 2023, 05:28:34 PM by Usman7860",
      "body": "Proof of Authentication PostBitcointalk Username: Usman7860Bitcointalk Profile Link: https://bitcointalk.org/index.php?action=profile;u=3562897Telegram Username: @Musman7860Campaign Category Participated: Article, Video,Tik Tok, Twitter BSC Wallet address: 0x48a1B2F63ecd45e2bd82Da573a3b96fE01804012Bicity Ref ID:   UD08005",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mrcashflow",
      "created_time": "September 08, 2023, 10:55:24 AMLast edit: June 06, 2024, 08:24:31 PM by Mrcashflow",
      "body": "#PROOF OF REGISTRATIONForum Username: MrcashflowForum Profile Link: https://bitcointalk.org/index.php?action=profile;u=3322649Participated Campaigns: videoBSC wallet address: 0x80C29126665721e2432Eb67351e326d1800668D7Bicity Ref ID: UD07982",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hpscamer",
      "created_time": "September 08, 2023, 11:30:17 AMLast edit: September 11, 2023, 11:59:18 AM by Hpscamer",
      "body": "Proof of Authentication PostBitcointalk username: HpscamerBitcointalk Profile link: https://bitcointalk.org/index.php?action=profile;u=3562715Paticipated Campaigns: Video, Article and Twitter Telegram username:  @hpscamerBSC BEP20 wallet address: 0xA9515271a91F528aD5B559a2A28b2C61f5153B40Bicity Ref ID: UD08068",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}