{
  "id": "topic_5432472",
  "title": "Iadegbola34",
  "author": "Iadegbola34",
  "created_time": "December 31, 2022, 06:55:26 AMLast edit: December 31, 2022, 07:12:35 AM by Iadegbola34",
  "content": "Scammers are always coming up with new cryptocurrency-based schemes to steal your money. Here are a few things to be aware of in order to prevent a crypto con.They reach out to you first. If you receive any strange message asking you to send some coins to claim some reward. They are 99.9% a scammer.If the reward is too good to be true. They always promise an enormous ROI on the money they intend to scam you of.If you don't have to do anything to receive a reward. There's a saying that, if you're not paying for it then you're the product. The 'paying' outside literal context can be any effort on your part deserving of such reward.If they ask for your private keys. \"Not your keys not your coins\" is a popular crypto phrase and if anyone should be in possession of your coins or keys it should be you and only you.They send you random links. It is pertinent to note that, you should not click any link from any stranger as they might be phishing links or a keylogger.These and many others are obvious red flag to identify a potential scam. Even if they're not as obvious as these, trust your gut feelings as most times you would be right.Others opinion are highly welcome on how to know and avoid scams.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5432472",
  "comments": [
    {
      "author": "Charles-Tim",
      "created_time": "December 31, 2022, 07:06:03 AM",
      "body": "There are topics on this forum that was compiled 2 years ago which could still be helpful for beginners, it consists of ways not to lose your coins:Good topics on security and privacyQuote from: Iadegbola34 on December 31, 2022, 06:55:26 AMIf they ask private keys. \"Not your keys not your coins\" is a popular crypto phrase and if anyone should be in possession of your coins or keys it should be you and only you.Exactly, but today's wallet are HD wallets that make use of seed phrase to generate the keys and addresses, the seed phrase should be well protected just like the private key because it can generate the private keys. Quote from: Iadegbola34 on December 31, 2022, 06:55:26 AMThey send you random links. It is pertinent to note that, you should not click any link from any stranger as they might be phishing links or a keylogger.Some phishing email can be very similar to an email sent from a site that you are using, you should not click on it. I neglect many emails, the ones that always got my attention is because I authorized for it, which I would have been expecting to see.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jharris9931",
      "created_time": "December 31, 2022, 03:09:35 PM",
      "body": "Good points! A couple from me:Do not answer direct messages from others offering to help. 99.99% scammers!Never, ever go to a link and put in your seed phrases! Your wallet will get cleaned out!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "robelneo",
      "created_time": "December 31, 2022, 03:35:46 PM",
      "body": "If you're going to create a discussion look for the right section, your thread is worth reading but this is a scam accusation and its about specific complain on one platform, and we have a format for every thread created here,  this topic is better suited to newbies and beginners I'm sure newbies will learn a lot from this topic because some newbies are unaware of some of the pointers you laid out here.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}