{
  "id": "topic_5444537",
  "title": "Godlovesyou",
  "author": "Godlovesyou",
  "created_time": "March 12, 2023, 04:19:29 AM",
  "content": "This set of people are dead in conscience and they never care about how other people feels, it's really baffling that political leaders are always after power, money and name than the lives of their citizens. They're brutal, deadly, corrupt and heartless, what kind initiations this people are in for? What do they smoke?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5444537",
  "comments": [
    {
      "author": "Chilwell",
      "created_time": "March 12, 2023, 12:23:28 PM",
      "body": "Quote from: Godlovesyou on March 12, 2023, 04:19:29 AMThis set of people are dead in conscience and they never care about how other people feels, it's really baffling that political leaders are always after power, money and name than the lives of their citizens. They're brutal, deadly, corrupt and heartless, what kind initiations this people are in for? What do they smoke?When the poor masses sat down to discuss about how our leaders are treating them, they will sound good during the conversation, but I don't know the same person that are bringing good suggestions are the one you find in means of their colleagues distributing items given to them by this leaders. Some of our leaders come to us when there are in need of us, the particular time when elections are approaching, when they have gradually starved us for many years, then they will come back and start behaving as if they are helping us then we will be praising them saying he or she have try, the people will be convinced with their bad attitudes and start saying let give them one more chance maybe they will change. Our leaders knows our problems better than us, they just deliberately ignore us so that they can have full control over us.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fiatless",
      "created_time": "March 12, 2023, 02:06:41 PM",
      "body": "Quote from: Godlovesyou on March 12, 2023, 04:19:29 AMThis set of people are dead in conscience and they never care about how other people feels, it's really baffling that political leaders are always after power, money and name than the lives of their citizens. They're brutal, deadly, corrupt and heartless, what kind initiations this people are in for? What do they smoke?Your topic varies from the content of your post. Do you mean why politicians smoke cigarettes or use drugs? Or are you insinuating that they are heartless and wicked because of the use of drugs? I just can't explain what you are thinking. But from your writings it's clear that the government of your country is not leaving up to your expectations. I think you are going through a lot of pains and suffering. Politicians are generally selfish and don't care about the well-being of the people. But we have the responsibility of voting against them during elections. I want you to be hopeful that there might be a positive change in your country. All the best bro.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Stepstowealth",
      "created_time": "March 12, 2023, 05:09:17 PM",
      "body": "Quote from: Godlovesyou on March 12, 2023, 04:19:29 AMThis set of people are dead in conscience and they never care about how other people feels, it's really baffling that political leaders are always after power, money and name than the lives of their citizens. They're brutal, deadly, corrupt and heartless, what kind initiations this people are in for? What do they smoke?Politicians are not the same everywhere. There are some countries with very good leaders. Money and power corrupts, the politicians you can wicked and brutal are the ones that have been corrupted by money and power, and because of that, they have no conscience again or sympathy for the people they are meant to serve.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hispo",
      "created_time": "March 12, 2023, 05:41:03 PM",
      "body": "Well, if we are talking about liberal politicians when they are likely smoking some marijuana.  In all seriousness, OP. What country are you from, because it would be foolish to say that the politicians for all over the world behave the same way, there are societies and countries where they are not so bad and kinda do a good job (it also depends whom you ask, of course).Perhaps you have some bad experiences with your representatives?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blockman",
      "created_time": "March 13, 2023, 08:23:35 AM",
      "body": "Quote from: Godlovesyou on March 12, 2023, 04:19:29 AMWhat do they smoke?If you have watched the series Narcos on Netflix and if you remember the scene that Pablo Escobar used for making his child warm. Then, that's all the politicians are smoking, money. Money makes them so powerful up to the point that they can do anything to a person's life and even end it. It makes them so powerful but forgets the moral and main reason why they ran for political and public office. Money is just like smoke, it has a smell that lingers on their nose up to their minds and that's really addicting. And this is for those states and countries that have corrupt politicians, yeah you may think about literal money that's been rolled up like a cigarette but it's all about it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yazher",
      "created_time": "March 13, 2023, 09:06:55 AM",
      "body": "His title is like the lyrics from the song Where is the love = \"what's wrong with the world Momma? people living like no Momma\" Human nature is just like that because they always wanted to have the best for themselves and not really caring about their people when it comes to money and when they have the chance to take it all, they won't hesitate to do so. That's why we only have a few names in our entire history that are just leaders and most of the time others are just the same, they are corrupt and evil. In the Philippines, only Duterte was the real President who is concerned for his people the last 5 were completely jokers.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ebede",
      "created_time": "March 13, 2023, 08:25:47 PM",
      "body": "Quote from: Godlovesyou on March 12, 2023, 04:19:29 AMThis set of people are dead in conscience and they never care about how other people feels, it's really baffling that political leaders are always after power, money and name than the lives of their citizens. They're brutal, deadly, corrupt and heartless, what kind initiations this people are in for? What do they smoke?Politicians don't have conscience and that's why when people want to vote them out of power they do it with all their heart knowing that they are heartless set people that can do undo in other to get power, I will be last person who will advice my children to go into politics because of the deadly act of politicians,  politics is something you will do with all you mind for you to get a political position.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wiwo",
      "created_time": "March 13, 2023, 08:36:46 PM",
      "body": "I don't know which country you are from ops but if you speaking on general terms I will advise you should be more specific so that we can have this discussion base on the peculiarity of the political environment. -Take for example, a country that has stronger institutions and systems, and the politician will have little to no effect on the general outcome I think that happens with the economy and other aspects since there are systems and institutions in charge of such. -so the personal life of the politician doesn't apply to the outcome of the welfare of the citizens in all countries, but such inappropriate corrupt practices are most popular with third world countries where there is a high rate of political unrest and highly corrupt political and office holders.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Newlifebtc",
      "created_time": "March 13, 2023, 08:51:33 PM",
      "body": "Quote from: Godlovesyou on March 12, 2023, 04:19:29 AMThis set of people are dead in conscience and they never care about how other people feels, it's really baffling that political leaders are always after power, money and name than the lives of their citizens. They're brutal, deadly, corrupt and heartless, what kind initiations this people are in for? What do they smoke?If you feel of the politicians that have the cities at peaceful mind to liberate them from poverty or represented them according to the law So many of politicians right away only go into qualities to protect their family and their own personal interests that is something we need to use does not understand you politicians during the elections we always have a lot of controversy because we are Mindful in things we do",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}