{
  "id": "topic_5474493",
  "title": "tg88",
  "author": "tg88",
  "created_time": "November 17, 2023, 09:02:17 PM",
  "content": "Ver o hashrate do BTC se espalhando para vários continentes é sem dúvidas uma ótima noticia, recentemente o CEO da Tether revelou que eles tem o plano ambicioso de alcançar 1% do poder computacional do Bitcoin investindo em projetos de mineração na américa latina, especificamente no Paraguay, Uruguay e e El Salvador.Outro ponto interessante é que todo a estrutura será montada em containers móveis que poderão migrar para outras regiões conforme as tarifas de energia.Tether planeja grande expansão na mineração de BTC com investimento de US$ 500 milhões, aponta reportagem",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5474493",
  "comments": [
    {
      "author": "bitmover",
      "created_time": "November 23, 2023, 09:32:52 PM",
      "body": "Quote from: tg88 on November 17, 2023, 09:02:17 PMVer o hashrate do BTC se espalhando para vários continentes é sem dúvidas uma ótima noticia, recentemente o CEO da Tether revelou que eles tem o plano ambicioso de alcançar 1% do poder computacional do Bitcoin investindo em projetos de mineração na américa latina, especificamente no Paraguay, Uruguay e e El Salvador.Outro ponto interessante é que todo a estrutura será montada em containers móveis que poderão migrar para outras regiões conforme as tarifas de energia.Tether planeja grande expansão na mineração de BTC com investimento de US$ 500 milhões, aponta reportagemManeiro demais.A centralização da mineração do bitcoin tem sido um problema há bastante tempo. Poucas pools dominam o mercado... Além disso, tem uma centralização geográfica, pois naturalmente os mineradores vão para onde a energia é mais barata e os hardwares mais acessíveis (e a legislação atrapalhe menos).Não me impressiona não ver o Brasil na lista. Aqui a energia é cara, cheio de subsídios e impostos e uma legislação doida, e um ambiente regulatório cheio de confusões.Acho que o Paraguai realmente pode se tornar uma potencia regional. Eles conseguem hardware mais em conta, por conta dos impostos e das facilidades de importação, além disso a energia lá é mais barata do que no Brasil (toda a energia do país vem da hidroelétrica de itaipu, e nos precisamos de muitas outras fontes mais caras).El Salvador eu desconheço, mas seria ótimo ver eles crescendo nesse setor.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rdluffy",
      "created_time": "November 25, 2023, 08:29:46 PM",
      "body": "E quem diria que a Tether estaria aqui em 2023, investindo em mineração de BTC e tentando espalhar um pouco o hashrate. As apostas para a queda da tether eram muitas há alguns anos atrás, mas fico feliz que a empresa esteja bem e investindo em projetos do BTCQuote from: bitmover on November 23, 2023, 09:32:52 PMAcho que o Paraguai realmente pode se tornar uma potencia regional. Eles conseguem hardware mais em conta, por conta dos impostos e das facilidades de importação, além disso a energia lá é mais barata do que no Brasil (toda a energia do país vem da hidroelétrica de itaipu, e nos precisamos de muitas outras fontes mais caras).O Paraguai tem tudo mesmo para se posicionar bem em relação ao BTC e mineração, mas parece que não é muito considerado por láOs países sul americanos conseguem ser mais desorganizados que o Brasil nesse sentido. Eu sou desanimado aqui com o nosso país, mas quando olho nossos vizinhos, parece que é tudo piorA Itaipu é uma joia raraUma coisa que penso também, devido a importância que as criptos tem se tornado, todo país devia ter pelo menos um ministro e um gabinete pra cuidar e posicionar seu país dentro do ecossistema",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tg88",
      "created_time": "November 26, 2023, 11:08:05 PM",
      "body": "Quote from: rdluffy on November 25, 2023, 08:29:46 PMO Paraguai tem tudo mesmo para se posicionar bem em relação ao BTC e mineração, mas parece que não é muito considerado por láOs países sul americanos conseguem ser mais desorganizados que o Brasil nesse sentido. Eu sou desanimado aqui com o nosso país, mas quando olho nossos vizinhos, parece que é tudo piorInteressante que a Tether sabe muito bem com quem está lidando, já vem com estruturas móveis totalmente alocadas dentro de containers, qualquer desacordo ou surpresa com esses governos e eles se mudam para outro país vizinho. Sabemos que o acordo de Itaipu entre Brasil x Paraguai está em processo de renegociação e os custos de energia podem mudar bastante da noite para o dia lá no Paraguai.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "alexrossi",
      "created_time": "December 02, 2023, 08:16:50 PM",
      "body": "Quote from: tg88 on November 26, 2023, 11:08:05 PMQuote from: rdluffy on November 25, 2023, 08:29:46 PMO Paraguai tem tudo mesmo para se posicionar bem em relação ao BTC e mineração, mas parece que não é muito considerado por láOs países sul americanos conseguem ser mais desorganizados que o Brasil nesse sentido. Eu sou desanimado aqui com o nosso país, mas quando olho nossos vizinhos, parece que é tudo piorInteressante que a Tether sabe muito bem com quem está lidando, já vem com estruturas móveis totalmente alocadas dentro de containers, qualquer desacordo ou surpresa com esses governos e eles se mudam para outro país vizinho. Sabemos que o acordo de Itaipu entre Brasil x Paraguai está em processo de renegociação e os custos de energia podem mudar bastante da noite para o dia lá no Paraguai.Me imagino esses cointainers colocados bem proximo da triplice fronteira, ai o negocio è uns 20-30 minutos de caminhoes guinchando os container no estado mais favoravel.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}