{
  "id": "topic_5415182",
  "title": "bonfire66",
  "author": "bonfire66",
  "created_time": "September 28, 2022, 07:51:01 AM",
  "content": "А что же делать, если , допустим, я атеист и моя религия не позволяет мне воевать, но тем не менее поп на призывном пункте оскорпляет меня кадилой во славу какого-то там вымышленного супергероя древности. И это не смотря на наличие статьи 53 Конституции РФ. Которую пока еще никто не отменял. Мы же приняли новую Конституцию? А это, между прочим, ОСНОВНОЙ закон, по которому мы живем. И там написано, что, оказывается, существуют религии (кто бы мог подумать), НЕ ПОЗВОЛЯЮЩИЕ Вам взять в руки автомат и иттить убивать себе подобных. Кем бы они (подобные) не были. Фашистами, нацистами или людоедами. Как же мне стать адептом такой религии? Хотя, по большому счету, мне на это все насрать по-большому. То есть коричневым калом. Я уже давным-давно все предусмотрел и успешно произвел все соответствующие приготовления. И даже успел свалить забугор  еще до 21 сентября легко, просто и за разумные деньги. Даже почти угадал дату, плюс-минус 10 дней. Неплохо, да? Читайте мои посты, внимайте моим советам – если кто-то хочет выжить, забудьте о  боге. Бог вам не поможет. А поможет только чистый разум и холодный рассудок. Внемлите мне, дети мои, ибо мой разум освобожден от предрассудков любых религий, и суть смысла жизни заключается в том, что надо научиться самому управлять своей жизнью, и не дать вашим врагам возможность управления вашей свободой. Подписывайтесь на мой яндекс-дзен «bonfire», задавайте вопросы – и тогда я вам расскажу, как надо будет прожить эту жизнь так, чтобы не было обидно за бесцельно потраченные годы. Никаких рефералок, СМС и регистраций. Просто следите за моими высерами – и будет вам щастье.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5415182",
  "comments": [
    {
      "author": "Excimer",
      "created_time": "September 28, 2022, 10:54:30 AM",
      "body": "Quote from: bonfire66 on September 28, 2022, 07:51:01 AMВнемлите мне, дети мои, ибо мой разум освобожден от предрассудков любых религий, и суть смысла жизни заключается в том, что надо научиться самому управлять своей жизнью, и не дать вашим врагам возможность управления вашей свободой. Подписывайтесь на мой яндекс-дзен «bonfire», задавайте вопросы – и тогда я вам расскажу, как надо будет прожить эту жизнь так, чтобы не было обидно за бесцельно потраченные годы. Никаких рефералок, СМС и регистраций. Просто следите за моими высерами – и будет вам щастье.Это тебе просто делать нечего вот и выебываешься. C жиру бесишься и маешься от бездельяНет большего счастья чем служить системе. Думать не надо - голова не болит. А если много думать - то нейроны умирают и наступает инсульт",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "xandry",
      "created_time": "September 28, 2022, 11:39:37 AM",
      "body": "Quote from: bonfire66 on September 28, 2022, 07:51:01 AMЯ уже давным-давно все предусмотрел и успешно произвел все соответствующие приготовления. И даже успел свалить забугор  еще до 21 сентября легко, просто и за разумные деньги. Даже почти угадал дату, плюс-минус 10 дней. Неплохо, да?Сдаётся мне, что вам просто повезло, так как вы в принципе часто в Турцию летаете и там можете находится не малое время. Просто судя по вашим постам. Если соберёте точные данные о количестве поездок за последние года-два и сроки нахождения, то будет прям подтверждение.Что касается первой части вашего повествования, то вы упустили каким же образом вы всё же оказались на призывном пункте, ведь по вышеописанному, вы должны были его избегать.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bonfire66",
      "created_time": "September 28, 2022, 02:34:47 PM",
      "body": "Никаким образом я не был на призывном пункте. В этом и есть весь прикол. Но тут я боюсь за свою жену, которая когда-то работала на генштаб. В этом и есть весь прикол. А что касается меня лично... то это почти никак не может быть реализовано в данной текущей реальности.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}