{
  "id": "topic_5398329",
  "title": "catgrassy",
  "author": "catgrassy",
  "created_time": "May 12, 2022, 02:28:39 PM",
  "content": "Hey guys,A crypto newbie here (is it the right time to be one, or not? lol). I am building my website and want to accept crypto payments. I see that there are a lot of crypto processors, so a very natural question arrises: which one to choose?Any ideas and recommendations? Would appreciate any help.Thanks and WAGMI!",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5398329",
  "comments": [
    {
      "author": "BitMaxz",
      "created_time": "May 12, 2022, 02:50:00 PM",
      "body": "There are many options to choose but only one payment gateway is the best but it has limited supported coins. However, you can able to add more coins but you will need to host them on your own server if you want to add more coins.Check BTCpayserver here https://btcpayserver.org/If you are looking for more lists (self-hosted and hosted payment gateway) check this link below.- https://github.com/alexk111/awesome-bitcoin-payment-processors",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "The Cryptovator",
      "created_time": "May 12, 2022, 09:55:57 PM",
      "body": "BTCPaysever would be perfect if you have the knowledge to host it, otherwise, you may use a third-party host. It's quite safer and reliable where you will have control over the funds. However, there are a couple of payment processor links that you would like to compare. Here is the list: https://bitcointalk.org/index.php?topic=5259548.0So you may compare and choose the right one for you that is appropriate for your business. Good Luck.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaveF",
      "created_time": "May 14, 2022, 04:14:31 PM",
      "body": "Although the above information is useful to give better advice we need more information.1) Do you have the ability & time to do it yourself? 2) If not doing it yourself how good are you at programming tech?3) Are you keeping it in crypto or converting to fiat? 4) Online only or physical store?5) Where are you located? (country)6) BTC only or other cryptos?There are a lot of things to consider. Remember TANSTAAFL=ThereAin'tNoSuchThingAsAFreeLunchThe more things you have your payment provider do the more it will cost you.But, with that cost you usually get better support and everything else.If you do it yourself you time is not free so you have to consider that too.-Dave",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dkbit98",
      "created_time": "May 14, 2022, 09:43:11 PM",
      "body": "Quote from: catgrassy on May 12, 2022, 02:28:39 PMI see that there are a lot of crypto processors, so a very natural question arrises: which one to choose?I think that BTCpayserver is best option you can choose and it was mentioned by some members already, but some users want to have some lightweight alternative.One more open source self-hosted software for accepting Bitcoin payments and donations is called CypherpunkPay, and there is clearnet and onion version.No censorship. No fees. No 3rd party. No address reuse.It's simple to use, it can run anywhere including cheap vps servers, and you can run demo version to see how it works.https://cypherpunkpay.org/https://github.com/CypherpunkPay/CypherpunkPay",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "May 15, 2022, 10:17:37 AM",
      "body": "QuoteOne more open source self-hosted software for accepting Bitcoin payments and donations is called CypherpunkPay, and there is clearnet and onion version.No censorship. No fees. No 3rd party. No address reuse.It's simple to use, it can run anywhere including cheap vps servers, and you can run demo version to see how it works.https://cypherpunkpay.org/https://github.com/CypherpunkPay/CypherpunkPayNice cach. I was disappointed to learn when I was busy hosting BTCPayServer that tbe specs (in particular the disk space requirements) were monstrous and overran my VPS storage space [by the way, when that happens, BTCPayServer's web interface 502's out].For accepting most cryptos I would use CoinPayments - you can choose which coins to enable along with LN and stuff - and provided you're not in a restricted country (includes Russia nowadays), verification is a simple check of ID card. Quite worth it considering they won't harass you for \"compliance matters\" later on.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OmegaStarScream",
      "created_time": "May 15, 2022, 11:21:50 AM",
      "body": "Quote from: NotATether on May 15, 2022, 10:17:37 AM-snip-For accepting most cryptos I would use CoinPayments - you can choose which coins to enable along with LN and stuff - and provided you're not in a restricted country (includes Russia nowadays), verification is a simple check of ID card. Quite worth it considering they won't harass you for \"compliance matters\" later on.I'm not sure that using CoinPayments would be a good idea because IIRC, the restrictions they have are applicable in so many countries, and they're not only for businesses/merchants, they're also for the people who want to pay for the goods.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Vegavid Technology",
      "created_time": "May 16, 2022, 06:41:44 AM",
      "body": "There are many crypto payment gateways. Below is the best crypto payment gateway for online businesses for beginners. BitpayCoinbaseCoinpaymentsCoingatePlisioOpenNodeSource: https://vegavid.com/blog/top-crypto-payment-gateway-for-online-business-in-2022/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pupmkin",
      "created_time": "May 16, 2022, 07:41:21 AM",
      "body": "I've been using CoinGate for some time and didn't have any issues with it. It's cool that you can integrate the tool with WooCommerce, so the process is quite easy and you don't need to understand how coding works. They take a 1% processing fee, but that shouldn't be a deal breaker imho",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dkbit98",
      "created_time": "May 16, 2022, 11:43:17 AM",
      "body": "Quote from: NotATether on May 15, 2022, 10:17:37 AMNice cach. I was disappointed to learn when I was busy hosting BTCPayServer that tbe specs (in particular the disk space requirements) were monstrous and overran my VPS storage space [by the way, when that happens, BTCPayServer's web interface 502's out].Yeah I know some people who had the same issues like you.I didn't try Cypherpunkpay myself, but people who use it say this is the best alternative you can find, and it's open source.However, this should be considered as a lightweight alternative to BTCPayServer and some features will be missing, but Lightning Network is supported for advanced users.There is a nice comparison page, they are even praising BTCPayServer and saying they got inspired by it:https://cypherpunkpay.org/rationale/btcpay-server/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CoinGate",
      "created_time": "May 20, 2022, 10:00:33 AM",
      "body": "What is best might depend on what you are looking for in the payment gateway.You could consider looking into CoinGate. In CoinGate, we offer crypto payment processing services with several methods to set up cryptocurrency payments for any website or physical store. Options include payment buttons, web PoS application, API integration, and official plugins for the biggest e-commerce platforms. Our automated gateway handles crypto payments every step of the way, from creating an invoice to confirmation of payment to customer support.We support 70+ cryptocurrencies, including BTC and LTC Lighting Network, and you can choose to keep crypto from the sales or convert it to EUR/USD immediately after payment is received from the shopper. Also, shoppers don't have to register on our platform to pay for your products/services. You can check out our services here: https://coingate.com/acceptWe are always up for a chat if you have any questions!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}