{
  "id": "topic_5477148",
  "title": "Marvelockg",
  "author": "Marvelockg",
  "created_time": "December 09, 2023, 10:02:52 AM",
  "content": "The CBN has released a statement warning the general public to be careful of the money they accept from people. The reason is that they have discovered that there are a lot of fake money in circulation and the country. As the year is coming to an end let's try and not fall victim of receiving fake money in our businesses so it won't affect our next year and it will not land us Into problem.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5477148",
  "comments": [
    {
      "author": "Charles-Tim",
      "created_time": "December 09, 2023, 10:36:48 AM",
      "body": "If you are a seller and receiving naira, you would have seen someone paid you with fake money before. In bank, at the deposit, you will see fake money that has been perforated and attached to the wall for people to see. It has always been like that everytime. If you are not careful, or not careful enough, you would have been paid with fake money and be at a loss before you will realize. So it is not a matter of this time, but everytime.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Barikui1",
      "created_time": "December 09, 2023, 11:02:19 AM",
      "body": "Quote from: Marvelockg on December 09, 2023, 10:02:52 AMThe CBN has released a statement warning the general public to be careful of the money they accept from people. The reason is that they have discovered that there are a lot of fake money in circulation and the country. As the year is coming to an end let's try and not fall victim of receiving fake money in our businesses so it won't affect our next year and it will not land us Into problem.Thanks for the information and secondly it's very easy to know money that isn't real unless you are in a hurry or you fail to pay attention to it, No matter how perfect the money looks like the major problem all this fraudster always encountered is the paper. That feeling when you hold a counter feet and a real money are not the same, even when they are both being squeezed, they don't react same way. If it's a real money, it can still be perfect when being released, but fake money would always behave as a paper it can never be perfect again.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Richbased",
      "created_time": "December 09, 2023, 11:12:50 AM",
      "body": "Quote from: Marvelockg on December 09, 2023, 10:02:52 AMThe CBN has released a statement warning the general public to be careful of the money they accept from people. The reason is that they have discovered that there are a lot of fake money in circulation and the country. As the year is coming to an end let's try and not fall victim of receiving fake money in our businesses so it won't affect our next year and it will not land us Into problem.This issue of counterfeit or fake money has been in existence for long and during the naira redesign a lot of scammers and fraudsters used this fake money to give to people and due to the fact that alot of people where even very incusitive for a way to get the new note made so many persons fall victims of these fake currency otherwise counterfeit. It is good to check the money that you're being given by anyone thoroughly to make sure that it isn't a counterfeit and these fake notes are more common in #500 and #1000 denominations so it is important to check some features that can be used to differentiate the original note from the fake ones features like touch quality, when you hold an original note you will find out that it has high printing quality that makes it look as if it is hard or cannot easily be teared unlike fake ones, secondly the Serial Number, Ribbon, and Gold foil.For example THE SERIAL NUMBER TEST The highlighted area is where the serial number is so when you place something like Mercury and check the black serial number it will look as if it is turning green when you check through the mercury. So if it doesn't turn green that means it's fake.THE RIBBON TESTThe Ribbon test is also another means to identify an original note just like it is being highlighted in the picture, it cut across from the top to the bottom just like broken lines with CBN inscription in it so it's also a way to check fake from original naira notes.Lastly THE GOLD FOIL TEST.Just like inscribed in the picture above, the gold foil cannot be scratched out so in a case where you scratch it out just know that it's fake. the gold foil has the Nigeria coat of arm inside it and 1000 is being written just under the gold foil.It is important to check these features thoroughly before taking the money though sometimes people can be so annoying by telling you that do you feel they're giving you counterfeit? Just disregard them and do your checking as any fake money you possess becomes irrelevant and worthless and if you're caught trying to spend it to another person then you might be apprehended by the government so prevention is better than cure.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hewlet",
      "created_time": "December 09, 2023, 12:32:26 PM",
      "body": "Quote from: Marvelockg on December 09, 2023, 10:02:52 AMThe CBN has released a statement warning the general public to be careful of the money they accept from people. The reason is that they have discovered that there are a lot of fake money in circulation and the country. As the year is coming to an end let's try and not fall victim of receiving fake money in our businesses so it won't affect our next year and it will not land us Into problem.apart from the pos people and some big business people that deals with huge amount of money from people, an average person only takes a little fraction of money, so ends it and withdraws another again.The issue of counterfeit money is not strange to us and most of the big business owners already know how to differentiate counterfeit money from real ones. The end of the year comes with a whole lot of happenings and people will want to device any means just to make extra money they will be spending during the season. Make we try de careful sha.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Miles2006",
      "created_time": "December 09, 2023, 12:51:48 PM",
      "body": "People will still not know how to differentiate between counterfeit and real money na customers go suffer pass for this wahala cause in a busy market when the seller is busy and the buyer is in a hurry that's the issue. The wahala with  counterfeit dey ever since for this country and some people know the trick wey them dey use, I believe say no be only buyers and sellers go face the wahala, pos too for depositing money.I no know if Nigeria get punishment for people wey dey use fake money because I don witness several times wey shop owners don receive fake money from customers but no punishment, no punishment na why them still dey do am, e good make everybody dey careful especially traders.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DubemIfedigbo001",
      "created_time": "December 09, 2023, 02:12:27 PM",
      "body": "While we are talking about fake currency and looking at ways to identify one and safeguard ourselves from being vulnerable to these bad guys, I think fake alert is worth mentioning. This period alone two of my neighbors at the office have been victims of fake alert, one even received the alert on his phone, not knowing that it was fake alert don with some sort of an app. Fake alert is associated with heavier funds loss, especially for business owners. It is advised that you don't just get convinced when you receive alert on you phone that your money has reflected. People are now advised to always use their bank apps for confirmation, you also need to check your transaction history to see if there was any activity there. When the money is very large, I advise you do simple transactions like buying recharge cards with your app and observe you account balance to ensure that the money is there. No cautious measure is too much to safeguard yourself this Christmas period ooo. my mama dey talk am say, caution no be fear, no allow pressure from customers make you loose money. Always see electronic money transaction like P2P trading on exchanges ooo, if you no confirm well, no release your goods. na who loose guard dey collect wotoporiously.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "RockBell",
      "created_time": "December 09, 2023, 02:42:44 PM",
      "body": "Quote from: Miles2006 on December 09, 2023, 12:51:48 PMPeople will still not know how to differentiate between counterfeit and real money na customers go suffer pass for this wahala cause in a busy market when the seller is busy and the buyer is in a hurry that's the issue. The wahala with  counterfeit dey ever since for this country and some people know the trick wey them dey use, I believe say no be only buyers and sellers go face the wahala, pos too for depositing money.I no know if Nigeria get punishment for people wey dey use fake money because I don witness several times wey shop owners don receive fake money from customers but no punishment, no punishment na why them still dey do am, e good make everybody dey careful especially traders.Even at first, I found it difficult to know the difference because even if I withdrew or received change I didn't even bother to check but now that our attention has been drawn there we are supposed to be checking, to avoid being embarrassed by spending fake money and they won't want to believe that you are not aware, a lot of people are been taking advantage of especially people at the filling station, and market places they are always looking for busy places, we all should be careful with the kind of money will also collect especially in our business places, the problem is not about the punishment you might end up punishing innocent people who are not aware so we just have to be very careful.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Y3shot",
      "created_time": "December 09, 2023, 06:13:09 PM",
      "body": "Quote from: Marvelockg on December 09, 2023, 10:02:52 AMThe CBN has released a statement warning the general public to be careful of the money they accept from people. The reason is that they have discovered that there are a lot of fake money in circulation and the country. As the year is coming to an end let's try and not fall victim of receiving fake money in our businesses so it won't affect our next year and it will not land us I just knew things like this will occur, because of the high inflation rate and the high price of living people would want fake currency to just to meet living. I think I blame the government for this, when a government is not Able to improve the currency for it to be valuable then people will toy with it. If the economy was working well things like this won't be very common for people to think to do. I think people needs to be very careful to check if what they are having is the real one fake.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "iBaba",
      "created_time": "December 09, 2023, 07:23:21 PM",
      "body": "Quote from: Marvelockg on December 09, 2023, 10:02:52 AMThe CBN has released a statement warning the general public to be careful of the money they accept from people. The reason is that they have discovered that there are a lot of fake money in circulation and the country. As the year is coming to an end let's try and not fall victim of receiving fake money in our businesses so it won't affect our next year and it will not land us Into problem.We are all vulnerable to this fake money issue as many of us can not even identify between the real money and the fake one. Even the new redesigned Naira issue alone is enough to mislead one from identify the real Naira from the fake one due to the differences and similarities bestowed on these old and new Naira notes.For someone like me, who is already used to cashless transactions even in the markets and amongst other small business, I may not be as vulnerable to this issue as someone who's a petty trader that is involved in the exchange of physical cash everyday of their business life. How such people are able to protect themselves and secure their businesses from fake money scam is not something I would know, however my advice for everyone using cash is;1. Take note of the most obvious features in the cash notes. For instance, if there is a Security Thread embedded in the cash, try and ensure if that is there and if it's a correct match.2. Try and compare the cash you are suspecting to be fake from the original ones already at your disposal to notice the similarities and the differences.3. Also observe the color and the printing quality. This is why it will difficult for us to know the originality since the major or let's say the most noticeable difference between the new Naira notes and the old notes is the color. That can easily get you confused and you won't know which is real from that which is fake.4. Also, try and check the CBN watermark that's printed on the notes, the CBN watermark is most visible when you raise the notes up to the light, so it becomes the shield between your eyes and the notes then you can see the watermark clearly.These are majorly the ways one can easily differentiate between the fake Naira notes and the original ones. But, sincerely, the government needs to invest more on the regulation of the Naira notes and the discovery and discarding of the fake notes from the public consumption.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Timmzzy",
      "created_time": "December 10, 2023, 04:03:48 AM",
      "body": "Quote from: Marvelockg on December 09, 2023, 10:02:52 AMThe CBN has released a statement warning the general public to be careful of the money they accept from people. The reason is that they have discovered that there are a lot of fake money in circulation and the country. As the year is coming to an end let's try and not fall victim of receiving fake money in our businesses so it won't affect our next year and it will not land us Into problem.Normal normal this thing no dey ever stop for this country as in this Naija, e dey happened especially on festive period, e dey happen well well for those places wey transactions dey happen constantly, if you be worker for such place my sister and brother open your eye Wella and no let anybody rush you because na the method them dey use be that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jegileman",
      "created_time": "December 10, 2023, 10:15:01 AM",
      "body": "Quote from: Marvelockg on December 09, 2023, 10:02:52 AMThe CBN has released a statement warning the general public to be careful of the money they accept from people. The reason is that they have discovered that there are a lot of fake money in circulation and the country. As the year is coming to an end let's try and not fall victim of receiving fake money in our businesses so it won't affect our next year and it will not land us Into problem.I also saw this particular news in their official Twitter page. To be honest, I have only come across fake money once and it looks very different from the real money but you’ll only notice if you’re a regular person that usually use money in cash for all of your transactions everyday, maybe as a POS attendant, or a shopkeeper that sells in restaurant or even small kiosk in the market. People are easily scammed with fake money and you won’t notice quick enough until later. So it’s necessary to always be on the alert for fake money at any moment in time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cryptomultiplier",
      "created_time": "December 10, 2023, 11:25:23 AM",
      "body": "Quote from: Jegileman on December 10, 2023, 10:15:01 AMQuote from: Marvelockg on December 09, 2023, 10:02:52 AMThe CBN has released a statement warning the general public to be careful of the money they accept from people. The reason is that they have discovered that there are a lot of fake money in circulation and the country. As the year is coming to an end let's try and not fall victim of receiving fake money in our businesses so it won't affect our next year and it will not land us Into problem.I also saw this particular news in their official Twitter page. To be honest, I have only come across fake money once and it looks very different from the real money but you’ll only notice if you’re a regular person that usually use money in cash for all of your transactions everyday, maybe as a POS attendant, or a shopkeeper that sells in restaurant or even small kiosk in the market. People are easily scammed with fake money and you won’t notice quick enough until later. So it’s necessary to always be on the alert for fake money at any moment in time. I heard of this news on the radio, only to see a circular about it here. Am quite surprised but for this Naija we don't get surprised too quickly. Everyone using cash should try to squeeze any new notes before putting it in the pocket or wallet. Avoid collection of big notes in the night also, because then one may not be too conscious of the reality of the notes. Infact shine torch to see the money well!More tips will be appreciated so we don't fall victim too soon.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sexylizzy2813",
      "created_time": "December 14, 2023, 12:48:34 AM",
      "body": "Before CBN release any statement concerning this fake money wahala we suppose don know say nah something wey we no for dy see as shock or new tori for this contri. Matta like this must always arise becos if fake no dy the original no go come out Wella, people wey complain say the CBN governor no print many new money and make I ask, wetin una expect from the guys wey dy print fake money? Make them sit down dy look? No, for crying out loud, these guys go take advantage of the fact say them no print plenty better new money. Make we dy alert but make this tori no surprise us .",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "I_Anime",
      "created_time": "December 14, 2023, 09:21:41 AM",
      "body": "Nah true Shey e don tey dis fake money stuff dey circulate, but e don dey worse mostly this time around con tey hard dey see cash so. Someone I know recently complain d same tin Shey dem give am fake money. Because she b retailer seller. And most time nah those people wey dey sell for shop nah dem mostly dey fall as victims. So men got to wise now to dey take proper look of money before you carry am. Many ways dey to know sha but most dem dey bring wen d pesin too dey busy to check.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Tuclikk",
      "created_time": "December 14, 2023, 11:35:36 AM",
      "body": "Quote from: Marvelockg on December 09, 2023, 10:02:52 AMThe CBN has released a statement warning the general public to be careful of the money they accept from people. The reason is that they have discovered that there are a lot of fake money in circulation and the country. As the year is coming to an end let's try and not fall victim of receiving fake money in our businesses so it won't affect our next year and it will not land us Into problem.E better oo because this money wey deh recently change na him de cause all this problem wey be say cash scarcity dey every where. na this opportunity does people wey de print fake, fake money dey look for teh teh see ahm don come now. Quote from: Miles2006 on December 09, 2023, 12:51:48 PMPeople will still not know how to differentiate between counterfeit and real money na customers go suffer pass for this wahala cause in a busy market when the seller is busy and the buyer is in a hurry that's the issue. Op all of dem na victim dem be because the buyer fit collect the counterfeit money go, same as the seller too in this situation make we dey very observant with the money go enter our hand even you dey hurry try check ahm. Na the only thing wey fit save man be that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jenwi",
      "created_time": "December 14, 2023, 08:43:56 PM",
      "body": "Quote from: Miles2006 on December 09, 2023, 12:51:48 PMPeople will still not know how to differentiate between counterfeit and real money na customers go suffer pass for this wahala cause in a busy market when the seller is busy and the buyer is in a hurry that's the issue. The wahala with  counterfeit dey ever since for this country and some people know the trick wey them dey use, I believe say no be only buyers and sellers go face the wahala, pos too for depositing money.I no know if Nigeria get punishment for people wey dey use fake money because I don witness several times wey shop owners don receive fake money from customers but no punishment, no punishment na why them still dey do am, e good make everybody dey careful especially traders.Who do you intend to punish? The person that gave it to you also collected it from another person, banks and most people go as far as destroying it rendering the person that owns it a looser. Most time this money is mixed with the good ones inorder not to discover it. This problem can be tackled if the printers and minters can be tracked. Arresting an innocent person that was victimized with the money is wrong.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Onyeeze",
      "created_time": "December 14, 2023, 09:20:44 PM",
      "body": "Quote from: Marvelockg on December 09, 2023, 10:02:52 AMThe CBN has released a statement warning the general public to be careful of the money they accept from people. The reason is that they have discovered that there are a lot of fake money in circulation and the country. As the year is coming to an end let's try and not fall victim of receiving fake money in our businesses so it won't affect our next year and it will not land us Into In my state money has began to be scarce and we don't know the reason personal me I don't know the reason why bank can never release more than five thousand Naira so its because of this warming of fake money in circulation, but wetin we way be naija they do now is digital buying and selling because almost every person now get account wey e dey use buy something and also sell something so I dey see say na wetin make banks no gree to release more than five thousand Naira, but is not good at least we need money to celebrate our Christmas despite that bad money dey for ground we need more ooh, me I sabi fake money and anytime wey fake money enter my hand I dey know",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "HajiBagi",
      "created_time": "December 16, 2023, 03:28:48 PM",
      "body": "Quote from: Marvelockg on December 09, 2023, 10:02:52 AMThe CBN has released a statement warning the general public to be careful of the money they accept from people. The reason is that they have discovered that there are a lot of fake money in circulation and the country. As the year is coming to an end let's try and not fall victim of receiving fake money in our businesses so it won't affect our next year and it will not land us Into problem.Fake money sha go flenty as Christmas Don dey come, na every ending of the year fake money dey come out and I no know why, E better wey CBN even released a statement because many of people this days no dey  Familia with fake money must especially those girl's wey they sell something for market, although as a business seller you have to know different between fake money and the original one, fake money always dey different with original one because fake money no dey always thick, and the original one always they thick and E get one logo wey be say you fit take differentiate them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Makus",
      "created_time": "December 17, 2023, 05:23:25 AM",
      "body": "Na wa oo, niaja which day when we go change na, the fake paper mini na one of the first scam dem wey don tayyy for this kontri, and this type for this kind of period I believe say na unstable pos people dem naim go fit do now, because those of them wey just come new location and you no go see them again the next day, so make we dey careful, or even those pos people sef fit go fall victim for the hand of those people wey dey print this fake mini, before you go know now, person don come carry police arrest for something wey you nor know about, abeg oo let be guarded oo. Nigeria which way na?? E come be like say  na the contri be the center of scam, people don turn am to their work for life, na wa oo.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}