{
  "id": "topic_5447083",
  "title": "1miau",
  "author": "1miau",
  "created_time": "April 01, 2023, 01:44:51 AM",
  "content": "Die Forumsleitung hat eine neue Strategie gegen Spammer entwickelt. Es ist nun erforderlich, dass ihr eine bestimmte Anzahl an Coins sammeln müsst, um nicht als Spammer markiert zu werden. Leider ist das garnicht so einfach, da hat sich die Forumsleitung wirklich eine effektive Lösung ausgedacht. Wer seinen Kommentar absendet, ohne das Chapta zu lösen (die Coins zu sammeln), bekommt seinen Beitrag direkt als Spam markiert. Blöd daran: selbst wenn ihr die Coins gesammelt habt aber in der Zwischenzeit ein neuer Beitrag in den Faden gesendet wird, müsst ihr erneut die Coins sammeln. Leider ist das sehr streng ausgelegt.  Für die Erstellung dieses Beitrages musste ich 13 Coins sammeln...Siehe dazu die Bekanntmachung von theymos: New CAPTCHA now required before postingDaher gelten in diesem Faden folgende Regeln: - Ich reserviere mir das Recht, alle Kommentare von Spammern zu löschen- Kein Off-Topic- Keine Pyramidenzitate- Kein unnötiges Denglisch- Keine Beiträge oberflächlicher Qualität (Shitposts)- Keine Diffamierungen- Keine unnötigen Memes / GIFs- Kein Getrolle",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5447083",
  "comments": [
    {
      "author": "willi9974",
      "created_time": "April 01, 2023, 05:54:30 AM",
      "body": "Ich bin unterwegs und habe einen Beitrag gemacht / editiert und mir ist es mobil auf dem iPad / iPhone nicht möglich die coins einzusammeln.Voll der bullshit würde ich jetzt im ersten Moment sagen.Man sitzt ja nicht den ganzen Tag am PC wo sowas einfach zu lösen ist. Mobil ist man echt im arsch…Eigentlich eine gute Idee, aber total schlecht umgesetzt… nur gut das heute der 1. April istViele Grüße Willi",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o_solo_miner",
      "created_time": "April 01, 2023, 07:49:35 AM",
      "body": "hab nix zu sagen, wollte nur das Captcha lösen!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CoinEraser",
      "created_time": "April 01, 2023, 11:04:15 AM",
      "body": "Ich schaffe es nicht mal, eine Münze einzusammeln. Klatsche immer gegen ein Hindernis. In solchen Spielen war ich noch nie gut. Trotzdem ist es sehr gut, dass diese Änderung aber eingeführt wurde.   Heute wird das Forum schön mit diesem Schriftzug leuchten. Aber so wie willi9974 es schon erwähnt hat, heute ist ja der 1. April.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lafu",
      "created_time": "April 01, 2023, 02:52:36 PM",
      "body": "Als als Aprilscherz lasse ich mir das schon eingehen , und wenn man mal den dreh raus hat mit der steuerung dann ist es kein problem die Coins zu sammeln.Aber wenn man da statt 6 Coins wie ich versucht habe im Englischen Beitrag 26-30 Coins zu sammeln das ist echt hart.zudem muß man immer wieder von neu Anfangen wenn jemand was geschrieben hat in der zeit wo man noch schreibt.Aber sowas könnte erheblich zum Spamschutz beitragen und vor allem gegen die Bots.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "5tift",
      "created_time": "April 01, 2023, 03:38:28 PM",
      "body": "Also ich hab selbst bei den 4BTC ewig gebraucht",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o_solo_miner",
      "created_time": "April 01, 2023, 03:42:45 PM",
      "body": "Quote from: CoinEraser on April 01, 2023, 11:04:15 AMIch schaffe es nicht mal, eine Münze einzusammeln. Klatsche immer gegen ein Hindernis. In solchen Spielen war ich noch nie gut. Trotzdem ist es sehr gut, dass diese Änderung aber eingeführt wurde.   Heute wird das Forum schön mit diesem Schriftzug leuchten. Aber so wie willi9974 es schon erwähnt hat, heute ist ja der 1. April.  Haha, so ging es mir am Anfang auch, max. 5 Coins und dann verloren, man benötigt tatsächlich etwas Übung. (Ich benötige nun 11 Coins WEIA)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cygan",
      "created_time": "April 01, 2023, 04:20:06 PM",
      "body": "in ein paar stunden ist die zockerei eh dann wieder vorbei",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hZti",
      "created_time": "April 01, 2023, 05:50:19 PM",
      "body": "Am iPad auch fast unmöglich die bei mir momentan geforderten 14 Coins zu sammeln. Irgendwas gegen den Spam wäre aber schon gut, vielleicht eine Begrenzung wieviele Posts eine Signatur Kampagne verlangen darf. Momentan gibt es ja zB bei Stake Leute die 80+ Posts machen für den vollen Reward.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "1miau",
      "created_time": "April 01, 2023, 07:02:50 PMLast edit: April 02, 2023, 01:28:03 AM by 1miau",
      "body": "Also bitte, jetzt gebt euch doch ein bisschen Mühe.  Quote from: Lafu on April 01, 2023, 02:52:36 PMzudem muß man immer wieder von neu Anfangen wenn jemand was geschrieben hat in der zeit wo man noch schreibt.Das finde ich den nervigsten Teil. Da hat man es gelöst, muss man es unnötigerweise noch einmal machen.  Quote from: Lafu on April 01, 2023, 02:52:36 PMAber sowas könnte erheblich zum Spamschutz beitragen und vor allem gegen die Bots.Fände ich ebenfalls nicht schlecht, wenn- es ein bisschen einfacher ist (weniger Coins erforderlich sowie breitere Lücken insgesamt)- man nicht immer neu beginnen muss, wenn jemand anderes in der Zwischenzeit einen neuen Kommentar platziert hat. Naja, ich werde es so gut es geht vermeiden, heute weitere Beiträge zu schreiben (und das ist ja auch Ziel der Kampagne). Fände es noch lustig, wenn pro Spambeitrag ein Merit abgezogen wird.  Edit: endlich ist der Spuk vorbei, damit schließe ich den Faden ab.*Danke alle für die Bemühungen. Hier das Archiv, wer alles ein Spammer war: https://archive.is/MZOtZ  *Lasse ihn mal noch offen, da theymos Statistiken zu veröffentlicht hat.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lafu",
      "created_time": "April 02, 2023, 05:34:55 PM",
      "body": "Die Statistiken und die ganzen punkte jedes einzelnen zu dem ganzen Aprilscherz könnt ihr hier direkt anschauen : https://bitcointalk.org/af23stats.txt Was ich so rausgelesen aus dem Beitrag von theymos hat der Benutzer PowerGlove das ganze Spiel programmiert und gemacht in einem Monat.Die Moderatoren wussten eventuell alle bescheid und testeten dies .Es dauerte nicht lang und es wurde direkt geknackt und gehackt von TryNinja der dies nun auch veröffentlicht hat hier : [SCRIPT] New Captcha CRACKER by TryNinja The H4CK3R1337",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}