{
  "id": "topic_5512422",
  "title": "nullama",
  "author": "nullama",
  "created_time": "October 08, 2024, 08:07:16 AM",
  "content": "HBO will release soon(or has released, if you are reading this in the future) a new documentary about Bitcoin:https://www.hbo.com/movies/money-electric-the-bitcoin-mysteryIt features the usual suspects (Adam Back, Roger Ver, etc), and seems to have a great production quality.Here is a video of the director, Cullen Hoback, talking about it:https://edition.cnn.com/2024/10/07/business/video/bitcoin-creator-identity-satoshi-nakamoto-hbo-documentary-digvidAnd here is the official trailer:https://www.youtube.com/watch?v=iSF0KGsFuI8I think this will probably not add too much new content, but I think it will be an interesting watch anyway.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5512422",
  "comments": [
    {
      "author": "freedomgo",
      "created_time": "October 08, 2024, 08:11:49 AM",
      "body": "It was also discussed in this topic. [1] Satoshi Identity Revealed LOL  and here  [2] Could this just be the \"LAMEST\" News?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PrivacyG",
      "created_time": "October 08, 2024, 08:28:06 AM",
      "body": "For some reason the name enrages me.  'Electric Money' seemed like such a better way to name it.Well.  There is not much they can do about the identity of Satoshi unless they gained access to secret documents of Three Letter Agencies, which I highly doubt.  And with out those, we will only hear a repeat of all the information we already knew about Bitcoin or Satoshi.  May be interesting for a Newbie, but probably not for most of us.Anyway.  Exposure is good, although it is a very bad way to gain exposure.  I am not happy with the way it was advertised.  They keep making it sound as if they have the one secret everybody is supposed to be waiting for.In fact.  I completely HATE the idea of being desperate to know who Satoshi is.  I am curious, do not get me wrong.  But if I heard who he is, I only wish I could simply know, shut up and move on.  Satoshi has created this one thing I particularly love and his only desire is to be left alone and Anonymous.  It would be utterly stupid for me to start digging for his real identity and it would be even more ridiculous if I was excited to expose him.This is not a thing anybody should hype up.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FortuneFollower",
      "created_time": "October 08, 2024, 09:02:35 AM",
      "body": "Quote from: freedomgo on October 08, 2024, 08:11:49 AMIt was also discussed in this topic. [1] Satoshi Identity Revealed LOL  and here  [2] Could this just be the \"LAMEST\" News? Yeah, also on the off-topic, the name of this thread is the best, in my opinion, no offense to others",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}