{
  "id": "topic_5397867",
  "title": "Tibu",
  "author": "Tibu",
  "created_time": "May 09, 2022, 09:58:07 AMLast edit: November 18, 2024, 01:21:35 PM by Tibu",
  "content": "Main Satochip topic : https://bitcointalk.org/index.php?topic=5181719.0This message was edited on the 20-nov-2023 with new visuals and description.-----------------------------------------------------------------------------------------------------------------------------------------------------------------SeedkeeperUse the right device to store your seedphrase-----------------------------------------------------------------------------------------------------------------------------------------------------------------PreambuleSatochip is proud to release its new product: Seedkeeper.Seedkeeper is a smartcard device that can be used to securely store seeds and other sensitive data for long term protection.Traditionally, cryptocurrency users have used a simple pen and paper to keep a backup copy of their hardware wallet seed.While this simple method works relatively well, it has also signifiant drawbacks:- A piece of paper can be easily lost, damaged or destroyed;- The seed is usually written in plaintext, since encryption is not practical.With a Seedkeeper, seeds are stored in the smartcard secure memory and can only be accessed by their legitimate owner using a short, easy-to-remember, secret PIN code. Seedkeeper is easy to use yet powerful; it is robust yet affordable; and last but not least, it is completely open-source.https://satochip.io/product/seedkeeper/------------------------------------------------------------------------------------------------------OverviewOn a basic level, here are the main actions you can perform on a Seedkeeper:- Import an existing seed on the Seedkeeper;- Generate a new (random) mnenomic with the tool and store it on your Seedkeeper card;- Generate a new (random) masterseed directly on the Seedkeeper;- Export a seed stored in the Seedkeeper to setup a new Satochip hardware wallet.A Seedkeeper can store several seeds in its secure memory (up to a dozen).A label can be attached to each seed stored in secure memory. This can be used to provide a short description (in less than 128 characters).------------------------------------------------------------------------------------------------------AdvantagesSeedkeeper:- is protected by a PIN code (up to 16 chars);- is affordable;- is NFC ready;- can support several seedphrases and other secrets;- is trustless;- is open-source.BIP39 compliant------------------------------------------------------------------------------------------------------How-toSeedkeeper is really easy to use.1) Connect it to your laptop by NFC or using a chip card reader.2) Download the Seedkeeper tool and launch it.3) Initialize your card with a PIN code.4) Use it...Get the complete information here: https://satochip.io/setup-use-seedkeeper-on-desktop/Multi-slots available------------------------------------------------------------------------------------------------------UsecasesSeedkeeper allows you to cover numerous usecases, including:- if you want to store your seedphrase in a safe place;- you can make multiple cards backup using different PIN code and give a Seedkeeper card to your best-friend, your mom or store one at the bank vault;- easy solution to share your crypto-assets and seed stuffs if you pass away  , just write the PIN code of your Seedkeeper on your testament.Solve your crypto inheritance problem with Seedkeeper------------------------------------------------------------------------------------------------------You can grab your Seedkeeper now at https://satochip.io/product/seedkeeper------------------------------------------------------------------------------------------------------ContactTelegram: https://t.me/SatochipTwitter: https://twitter.com/satochipWebsite: https://satochip.ioGitHub: https://github.com/ToporinYoutube: https://www.youtube.com/channel/UCPmmfB5PpuwMtha9mbaRNlg",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5397867",
  "comments": [
    {
      "author": "dkbit98",
      "created_time": "May 09, 2022, 04:32:14 PM",
      "body": "Tibu can you tell us how exactly is Seedkeeper different from Satochip or Satodime cards?If I understand correctly this is alternative option for storing and writing seed words on paper or metal.One potential problem I see with Seedkeeper is that it can only work with Seedkeeper Tool, and only protection is short PIN code that could be hacked in theory.I do like standard credit card format, that won't bring much attention from other people.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pmalek",
      "created_time": "May 12, 2022, 05:59:22 PM",
      "body": "Quote from: dkbit98 on May 09, 2022, 04:32:14 PMOne potential problem I see with Seedkeeper is that it can only work with Seedkeeper Tool That's a good point. One might ask what would happen if the Seedkeeper tool or Satoship as a company isn't around in a few years? How do I get access to my seeds Tibu?Quote from: dkbit98 on May 09, 2022, 04:32:14 PMand only protection is short PIN code that could be hacked in theory. You can use up to 16 characters, so it's not that short. And there is really no protection of the words if your seed phrase is written down on paper or engraved in steel or wood either. You can use a passphrase though with your standard paper wallet or the seed you store in your Seedkeeper.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "n0nce",
      "created_time": "May 14, 2022, 01:20:51 PM",
      "body": "Quote from: Pmalek on May 12, 2022, 05:59:22 PMQuote from: dkbit98 on May 09, 2022, 04:32:14 PMOne potential problem I see with Seedkeeper is that it can only work with Seedkeeper Tool That's a good point. One might ask what would happen if the Seedkeeper tool or Satoship as a company isn't around in a few years? How do I get access to my seeds Tibu?The software appears to be open source: https://github.com/Toporin?tab=repositoriesSo you could download, compile, modify and even write your own software to interface with it, I suppose. It's probably a very standard Java Card so you might even be able to use other Java Card software as well.Quote from: Pmalek on May 12, 2022, 05:59:22 PMQuote from: dkbit98 on May 09, 2022, 04:32:14 PMand only protection is short PIN code that could be hacked in theory. You can use up to 16 characters, so it's not that short. And there is really no protection of the words if your seed phrase is written down on paper or engraved in steel or wood either. You can use a passphrase though with your standard paper wallet or the seed you store in your Seedkeeper.    I see this as a less safe version of a laminated paper backup (since it can be damaged by heat, cold or radiation), but maybe a bit more convenient. Though I wonder how often you make and restore seed words backups (probably not very often). However I do like the other products Tibu makes and will probably try Satochip in the future. Indeed, it's much more stealthy to carry around a regular card instead of a bulky hardware wallet and it might be a replacement for the software wallet I use for on-the-go payments. It's just a pity that while the device itself is as slim and inconspicuous as it gets, you always need a bulky reader to actually use it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Chikito",
      "created_time": "May 15, 2022, 12:01:13 AM",
      "body": "I just see this on my local board, Husna sharing this tool, I still don't know how it work, when the function still uses electronics as media for storing the seed, is that function can still be hacked from the internet even if it is offline?. (cookie, history and etc)Is available for storing besides BIP39 seed such as Electrum seed?, because when I read how-to, there is generate a random seed, when different seed (electrum) from the default (BIP39), I doubt it will generally not as usual and make the confused when use for restoring it.What material? SS304, Titanium, or PVC (ATM Card)?how to restore when forget PIN CODE?QuoteYour Seedkeeper card is protected by a PIN code: a 4-16 characters password used to unlock it",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pmalek",
      "created_time": "May 15, 2022, 06:51:50 AM",
      "body": "Quote from: DroomieChikito on May 15, 2022, 12:01:13 AMIs available for storing besides BIP39 seed such as Electrum seed? I don't see why not. I doubt the Seedkeeper checks the validity of the seeds, and it really shouldn't. Especially those you import yourself. Look at it as a paper wallet where you can write down anything you want. If you write the words down correctly, you are good. If not, you might lose your coins if you didn't make a simple mistake that can be solved by bruteforcing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "m2017",
      "created_time": "May 15, 2022, 11:14:21 AM",
      "body": "Quote from: Tibu on May 09, 2022, 09:58:07 AM- A piece of paper can be easily lost, damaged or destroyed;Your card can't be lost, damaged (have you tested the influence of electromagnetic fields and other influences of the surrounding world on the safety of information on the memory module) or destroyed (how is a plastic card better protected from burning compared to paper?)Quote from: dkbit98 on May 09, 2022, 04:32:14 PMI do like standard credit card format, that won't bring much attention from other people.I would add here the ability to randomize the appearance of card. For example, to apply an image as a gift or to give the appearance of a bonus card of any store in order to disguise it.The way information is stored on a similar map makes me once again think that there is no ideal way to store seed-phrase. There will always be vulnerabilities in any method and the choice of how to store it, for example, on paper, metal or such a card, will depend on your goals and preferences. It is possible that some investors will want to store their seeds on such cards.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SFR10",
      "created_time": "May 16, 2022, 10:08:44 AM",
      "body": "Quote from: n0nce on May 14, 2022, 01:20:51 PMIt's just a pity that while the device itself is as slim and inconspicuous as it gets, you always need a bulky reader to actually use it.You have a point, but you can also use it with laptops that already have built-in NFC chips.Quote from: DroomieChikito on May 15, 2022, 12:01:13 AMWhat material? SS304, Titanium, or PVC (ATM Card)?It uses \"several plastic PVC layers [it's in the latter part of the page]\".Quote from: DroomieChikito on May 15, 2022, 12:01:13 AMhow to restore when forget PIN CODE?Since they put an emphasis on memorizing it correctly, I strongly believe there's no way to achieve such a thing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Chikito",
      "created_time": "May 16, 2022, 10:24:59 AM",
      "body": "Quote from: Pmalek on May 15, 2022, 06:51:50 AMQuote from: DroomieChikito on May 15, 2022, 12:01:13 AMIs available for storing besides BIP39 seed such as Electrum seed? I don't see why not. I doubt the Seedkeeper checks the validity of the seeds, and it really shouldn't. Especially those you import yourself. Look at it as a paper wallet where you can write down anything you want. If you write the words down correctly, you are good. If not, you might lose your coins if you didn't make a simple mistake that can be solved by bruteforcing.  what I'm worried about this if there are users who have the one way without any backup, and the results are different when trying to restore the seed. Maybe better if Seedkeeper can use another backup, which has another one in Stainless steel. but still, when must connect to a PC, I still doubt it is better than another one the same like we can keep it on USB disk with encrypted which more than cheap than Seedkeeper.Quote from: SFR10 on May 16, 2022, 10:08:44 AMQuote from: DroomieChikito on May 15, 2022, 12:01:13 AMWhat material? SS304, Titanium, or PVC (ATM Card)?It uses \"several plastic PVC layers [it's in the latter part of the page]\".It's risk from fire",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dkbit98",
      "created_time": "May 16, 2022, 04:47:06 PM",
      "body": "Quote from: Pmalek on May 12, 2022, 05:59:22 PMYou can use up to 16 characters, so it's not that short. And there is really no protection of the words if your seed phrase is written down on paper or engraved in steel or wood either.Minimum you can use is 4 characters and people tend to use minimal pin if they can. If I use paper or metal backup I can always add additional protection with one or more passphrases, and I am not sure how that works with Satochip products.Quote from: SFR10 on May 16, 2022, 10:08:44 AMYou have a point, but you can also use it with laptops that already have built-in NFC chips.This could be alternative option but I don't think all of their card wallets and products work with NFC technology, that is why they are offering big readers.Using NFC for hardware wallets and seed words could mean opening new can full of worms, and I wouldn't be surprised if scammers find a way to abuse it soon.This is similar like wireless, it even has small miniature antenna inside chip, but it's with shorter range.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "n0nce",
      "created_time": "May 16, 2022, 11:10:07 PM",
      "body": "Quote from: SFR10 on May 16, 2022, 10:08:44 AMQuote from: n0nce on May 14, 2022, 01:20:51 PMIt's just a pity that while the device itself is as slim and inconspicuous as it gets, you always need a bulky reader to actually use it.You have a point, but you can also use it with laptops that already have built-in NFC chips.I totally missed that they have NFC; then it might actually be a pretty cool device to use in conjunction with a phone, since more phones have NFC than PCs or laptops. It would also be relatively inconspicuous quickly holding a card to the back of your phone even in public spaces. I'm generally not a fan of NFC or other wireless technologies on hardware wallets, but in this form factor and for this application (small amounts for usage on the go) it could actually make sense.But if I understand correctly, unfortunately their software only runs on desktop OSes - missed opportunity in my opinion. If I can carry a laptop, I can also carry a Foundation Passport.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Tibu",
      "created_time": "May 23, 2022, 08:46:56 AMLast edit: May 23, 2022, 09:43:46 PM by Mr. Big",
      "body": "Quote from: dkbit98 on May 09, 2022, 04:32:14 PMTibu can you tell us how exactly is Seedkeeper different from Satochip or Satodime cards?If I understand correctly this is alternative option for storing and writing seed words on paper or metal.One potential problem I see with Seedkeeper is that it can only work with Seedkeeper Tool, and only protection is short PIN code that could be hacked in theory.I do like standard credit card format, that won't bring much attention from other people.Sorry for the late reply, very busy weeks...Satochip is a pure hardware wallet, you generate a new seed or import and existing one. Card is protected by a PIN code.Your keys, your coins. It's a personnal storage for crypto-currencies and other crypto assets.Satodime is more like a cold storage, you don't have to deal with a seed, a password or a PIN code. Everything is done by the chip and you can use a mobile app to load and check the wallet's balance.It's not a personal product, more like a gift card. Best product to orange pill someone or for crypto newcomers.Seedkeeper is purely designed to store sensitive information. Secured by a PIN code.You can use it to initialize a Satochip card or save an existing seed. It's useful to add an extra security layer and as a backup of your metal plate.The 3 products share the same hardware and the same chip. Changes come from the code which is open source.Quote from: n0nce on May 14, 2022, 01:20:51 PMQuote from: Pmalek on May 12, 2022, 05:59:22 PMQuote from: dkbit98 on May 09, 2022, 04:32:14 PMOne potential problem I see with Seedkeeper is that it can only work with Seedkeeper Tool That's a good point. One might ask what would happen if the Seedkeeper tool or Satoship as a company isn't around in a few years? How do I get access to my seeds Tibu?The software appears to be open source: https://github.com/Toporin?tab=repositoriesSo you could download, compile, modify and even write your own software to interface with it, I suppose. It's probably a very standard Java Card so you might even be able to use other Java Card software as well.Quote from: Pmalek on May 12, 2022, 05:59:22 PM-> Yup that's true. Even if Satochip S.R.L. dies, you will be able to keep it running. Our software products are open-source.Quote from: dkbit98 on May 09, 2022, 04:32:14 PMand only protection is short PIN code that could be hacked in theory. You can use up to 16 characters, so it's not that short. And there is really no protection of the words if your seed phrase is written down on paper or engraved in steel or wood either. You can use a passphrase though with your standard paper wallet or the seed you store in your Seedkeeper.    I see this as a less safe version of a laminated paper backup (since it can be damaged by heat, cold or radiation), but maybe a bit more convenient. Though I wonder how often you make and restore seed words backups (probably not very often). However I do like the other products Tibu makes and will probably try Satochip in the future. Indeed, it's much more stealthy to carry around a regular card instead of a bulky hardware wallet and it might be a replacement for the software wallet I use for on-the-go payments. It's just a pity that while the device itself is as slim and inconspicuous as it gets, you always need a bulky reader to actually use it.-> Our products are also great in combination with existing one... Such Ledger or Trezor. You can have a Satochip card as a backup or as a \"traveller\" hardware wallet while you keep your Ledger in the bank safe.Quote from: DroomieChikito on May 15, 2022, 12:01:13 AMI just see this on my local board, Husna sharing this tool, I still don't know how it work, when the function still uses electronics as media for storing the seed, is that function can still be hacked from the internet even if it is offline?. (cookie, history and etc)Is available for storing besides BIP39 seed such as Electrum seed?, because when I read how-to, there is generate a random seed, when different seed (electrum) from the default (BIP39), I doubt it will generally not as usual and make the confused when use for restoring it.What material? SS304, Titanium, or PVC (ATM Card)?how to restore when forget PIN CODE?QuoteYour Seedkeeper card is protected by a PIN code: a 4-16 characters password used to unlock itSeedkeeper is \"offline\". If you generate a masterseed \"on chip\", it's completly air-gapped. Meaning the hosting computer, neither the user is able to see it.Of course, if you use our Seedkeeper-tool to generate a new seed or import an existing one and your computer has a keylogger, you might be compromised.You can store any seed on the device.Cards are made out of PVC like your ATM card.If you forgot your PIN code, you wont be able to recover it. It's a security measure. But Seedkeeper-Tool comes with a one click backup solution. So you can initialize several Seedkeeper cards with different PIN code and import the same backup on each one.Quote from: m2017 on May 15, 2022, 11:14:21 AMQuote from: Tibu on May 09, 2022, 09:58:07 AM- A piece of paper can be easily lost, damaged or destroyed;Your card can't be lost, damaged (have you tested the influence of electromagnetic fields and other influences of the surrounding world on the safety of information on the memory module) or destroyed (how is a plastic card better protected from burning compared to paper?)Quote from: dkbit98 on May 09, 2022, 04:32:14 PMI do like standard credit card format, that won't bring much attention from other people.I would add here the ability to randomize the appearance of card. For example, to apply an image as a gift or to give the appearance of a bonus card of any store in order to disguise it.The way information is stored on a similar map makes me once again think that there is no ideal way to store seed-phrase. There will always be vulnerabilities in any method and the choice of how to store it, for example, on paper, metal or such a card, will depend on your goals and preferences. It is possible that some investors will want to store their seeds on such cards.Well, of course the card can be lost, damaged or destroyed. But what I mean behind this sentence is: a paper is easily damageable; by the UV of the sun, by a wet surrounding air or just lost because it's a small piece of paper. Furthermore, your seed is usually written in plain text. That's why we dont recommand to store a seed on a sheet of paper (and for example, Ledger still sells its hardware wallet with a \"seed paper card\" to allow you to write your seed down\").But the card is waterproof and shock proof. It can be heat and cold resistant. And the secure element is tamper proof.Regarding the card customization, you can already do it for the Satochip and the Satodime cards... We will soon launch the customization module for the Seedkeeper one.Just like your favorite T-Shirt, you can download your own picture and customize the front and the back of the card.\"The way information is stored on a similar map makes me once again think that there is no ideal way to store seed-phrase.\" I agree 100% with you. There is no \"best way\" to store a seed. But some tools/products are a bit safer/better than other. Quote from: dkbit98 on May 16, 2022, 04:47:06 PMQuote from: Pmalek on May 12, 2022, 05:59:22 PMYou can use up to 16 characters, so it's not that short. And there is really no protection of the words if your seed phrase is written down on paper or engraved in steel or wood either.Minimum you can use is 4 characters and people tend to use minimal pin if they can. If I use paper or metal backup I can always add additional protection with one or more passphrases, and I am not sure how that works with Satochip products.Quote from: SFR10 on May 16, 2022, 10:08:44 AMYou have a point, but you can also use it with laptops that already have built-in NFC chips.This could be alternative option but I don't think all of their card wallets and products work with NFC technology, that is why they are offering big readers.Using NFC for hardware wallets and seed words could mean opening new can full of worms, and I wouldn't be surprised if scammers find a way to abuse it soon.This is similar like wireless, it even has small miniature antenna inside chip, but it's with shorter range.Hey  Our products are all NFC compatible. Our card are equiped with NFC antenna and work like a charm when using a NFC reader.For example, our Satodime card can be read on your mobile phone while using our app. That's really important for us because you can esaily check if a keyslot is sealed or unsealed and check the balance. Even on street while dealing some sats for a watch.  We are selling chip card readers because: 1) we have not release mobile app (and thus NFC communication) for Satochip and Seedkeeper products (not yet). 2) NFC reader are very expansive. Much more than a chip card reader.\"Using NFC for hardware wallets and seed words could mean opening new can full of worms, and I wouldn't be surprised if scammers find a way to abuse it soon.\" I dont get your point. NFC is really secure. And even if you try to scan and skim a NFC card, you wont be able to perform any sensitive action as it will require the PIN code.Quote from: n0nce on May 16, 2022, 11:10:07 PMQuote from: SFR10 on May 16, 2022, 10:08:44 AMQuote from: n0nce on May 14, 2022, 01:20:51 PMIt's just a pity that while the device itself is as slim and inconspicuous as it gets, you always need a bulky reader to actually use it.You have a point, but you can also use it with laptops that already have built-in NFC chips.I totally missed that they have NFC; then it might actually be a pretty cool device to use in conjunction with a phone, since more phones have NFC than PCs or laptops. It would also be relatively inconspicuous quickly holding a card to the back of your phone even in public spaces. I'm generally not a fan of NFC or other wireless technologies on hardware wallets, but in this form factor and for this application (small amounts for usage on the go) it could actually make sense.But if I understand correctly, unfortunately their software only runs on desktop OSes - missed opportunity in my opinion. If I can carry a laptop, I can also carry a Foundation Passport.You are right. Our \"NFC' mobile application protfolio is weak at the moment. We only have the Satodime Tool on Android. But we are working on the iOS version and the mobile app for Seedkeeper. We can easily imagine to integrate Seedkeeper with Blue Wallet or Muun Wallet (non custodials soft wallet). And when a user want to create a new wallet, he can just tap his Seedkeeper and the seed is store within the card. It's easy and straight forward. It will be easier for newcomers to start with such software wallet as they would'nt have to deal with the seed. -Store in a dedicated device and forget -",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "n0nce",
      "created_time": "May 23, 2022, 10:06:58 AM",
      "body": "Quote from: Tibu on May 23, 2022, 08:49:11 AMQuote from: n0nce on May 14, 2022, 01:20:51 PMI see this as a less safe version of a laminated paper backup (since it can be damaged by heat, cold or radiation), but maybe a bit more convenient. Though I wonder how often you make and restore seed words backups (probably not very often). However I do like the other products Tibu makes and will probably try Satochip in the future. Indeed, it's much more stealthy to carry around a regular card instead of a bulky hardware wallet and it might be a replacement for the software wallet I use for on-the-go payments. It's just a pity that while the device itself is as slim and inconspicuous as it gets, you always need a bulky reader to actually use it.-> Our products are also great in combination with existing one... Such Ledger or Trezor. You can have a Satochip card as a backup or as a \"traveller\" hardware wallet while you keep your Ledger in the bank safe.I was mostly referring to the seedkeeper; I don't really get the benefits of doing a seed word backup on a smartcard instead of laminated paper. Since restoring seeds is something you typically do so rarely that the convenience of a smartcard is not really needed. Manually typing them in in those rare occasions is totally enough, in my opinion.Quote from: Tibu on May 23, 2022, 09:08:46 AMQuote from: n0nce on May 16, 2022, 11:10:07 PMI totally missed that they have NFC; then it might actually be a pretty cool device to use in conjunction with a phone, since more phones have NFC than PCs or laptops. It would also be relatively inconspicuous quickly holding a card to the back of your phone even in public spaces. I'm generally not a fan of NFC or other wireless technologies on hardware wallets, but in this form factor and for this application (small amounts for usage on the go) it could actually make sense.But if I understand correctly, unfortunately their software only runs on desktop OSes - missed opportunity in my opinion. If I can carry a laptop, I can also carry a Foundation Passport.You are right. Our \"NFC' mobile application protfolio is weak at the moment. We only have the Satodime Tool on Android. But we are working on the iOS version and the mobile app for Seedkeeper. We can easily imagine to integrate Seedkeeper with Blue Wallet or Muun Wallet (non custodials soft wallet). And when a user want to create a new wallet, he can just tap his Seedkeeper and the seed is store within the card. It's easy and straight forward. It will be easier for newcomers to start with such software wallet as they would'nt have to deal with the seed. -Store in a dedicated device and forget -Is this technologically (API-wise) possible on iOS? Since I believe no NFC-capable wallet exists so far that works with iOS, does it? Therefore I assumed it's a kind of software limitation by Apple. But I can definitely be wrong on this; I don't have a lot of knowledge on this topic.The question arises whether you trust a smartcard's secure element more than your phone's, but I am sure that 'mobile' will be the most useful application for such a device. Since as I said before, as soon as you carry even a tiny purse or a bag, like when carrying a laptop with you, you already have enough space and carrying capability for something like Trezor or Passport. These things are already tiny, but obviously don't fit in a wallet. So I don't see a need for smartcard cryptowallets unless you're in a situation where you only carry your wallet and phone, and nothing else.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dkbit98",
      "created_time": "May 23, 2022, 12:14:17 PM",
      "body": "Quote from: Tibu on May 23, 2022, 08:46:56 AMSeedkeeper is purely designed to store sensitive information. Secured by a PIN code.You can use it to initialize a Satochip card or save an existing seed. It's useful to add an extra security layer and as a backup of your metal plate.This means that in theory I could just erase wipe out my Seedkeeper card, and load it with open source code provided for Satochip or Satodime?Quote from: Tibu on May 23, 2022, 09:05:44 AMWe are selling chip card readers because: 1) we have not release mobile app (and thus NFC communication) for Satochip and Seedkeeper products (not yet). 2) NFC reader are very expansive. Much more than a chip card reader.Chip card readers could be serious problem and single point of failure for your product, for example I recently heard a news about card readers that came with malware infected drivers.I didn't know that there is list of approved card readers, so anything that was not approved or certified could have some code hidden inside of them.Even approved card readers can have some government installed backdoor, so I have hard time trusting any of them.Is the card reader you are selling approved or not, and what kind of code it's using?https://krebsonsecurity.com/2022/05/when-your-smart-id-card-reader-comes-with-malware/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Tibu",
      "created_time": "May 23, 2022, 12:41:53 PM",
      "body": "Quote from: n0nce on May 23, 2022, 10:06:58 AMQuote from: Tibu on May 23, 2022, 08:49:11 AMQuote from: n0nce on May 14, 2022, 01:20:51 PMI see this as a less safe version of a laminated paper backup (since it can be damaged by heat, cold or radiation), but maybe a bit more convenient. Though I wonder how often you make and restore seed words backups (probably not very often). However I do like the other products Tibu makes and will probably try Satochip in the future. Indeed, it's much more stealthy to carry around a regular card instead of a bulky hardware wallet and it might be a replacement for the software wallet I use for on-the-go payments. It's just a pity that while the device itself is as slim and inconspicuous as it gets, you always need a bulky reader to actually use it.-> Our products are also great in combination with existing one... Such Ledger or Trezor. You can have a Satochip card as a backup or as a \"traveller\" hardware wallet while you keep your Ledger in the bank safe.I was mostly referring to the seedkeeper; I don't really get the benefits of doing a seed word backup on a smartcard instead of laminated paper. Since restoring seeds is something you typically do so rarely that the convenience of a smartcard is not really needed. Manually typing them in in those rare occasions is totally enough, in my opinion.Quote from: Tibu on May 23, 2022, 09:08:46 AMQuote from: n0nce on May 16, 2022, 11:10:07 PMI totally missed that they have NFC; then it might actually be a pretty cool device to use in conjunction with a phone, since more phones have NFC than PCs or laptops. It would also be relatively inconspicuous quickly holding a card to the back of your phone even in public spaces. I'm generally not a fan of NFC or other wireless technologies on hardware wallets, but in this form factor and for this application (small amounts for usage on the go) it could actually make sense.But if I understand correctly, unfortunately their software only runs on desktop OSes - missed opportunity in my opinion. If I can carry a laptop, I can also carry a Foundation Passport.You are right. Our \"NFC' mobile application protfolio is weak at the moment. We only have the Satodime Tool on Android. But we are working on the iOS version and the mobile app for Seedkeeper. We can easily imagine to integrate Seedkeeper with Blue Wallet or Muun Wallet (non custodials soft wallet). And when a user want to create a new wallet, he can just tap his Seedkeeper and the seed is store within the card. It's easy and straight forward. It will be easier for newcomers to start with such software wallet as they would'nt have to deal with the seed. -Store in a dedicated device and forget -Is this technologically (API-wise) possible on iOS? Since I believe no NFC-capable wallet exists so far that works with iOS, does it? Therefore I assumed it's a kind of software limitation by Apple. But I can definitely be wrong on this; I don't have a lot of knowledge on this topic.The question arises whether you trust a smartcard's secure element more than your phone's, but I am sure that 'mobile' will be the most useful application for such a device. Since as I said before, as soon as you carry even a tiny purse or a bag, like when carrying a laptop with you, you already have enough space and carrying capability for something like Trezor or Passport. These things are already tiny, but obviously don't fit in a wallet. So I don't see a need for smartcard cryptowallets unless you're in a situation where you only carry your wallet and phone, and nothing else.Regarding your first statement, Seedkeeper is not only a memory. It encrypts and stores your secrets within a dedicated element, tamper-proof. With a piece of paper, the biggest problem is not really the material itself but the fact that the seed is usually written in plain text. Thus if someone finds it, he got it. But indeed, the seed is something you dont have to deal on a daily basis. But that's also a problem because when you need it, maybe the time has passed and you cant remember where you put your seedphrase  Regarding the iOS part, yes it is. Apple does allow NFC enabled app since iOS 14 released back in 2020. But you are right, before this date, it was barely impossible to use the NFC with an iPhone.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Tibu",
      "created_time": "May 23, 2022, 12:47:07 PM",
      "body": "Quote from: dkbit98 on May 23, 2022, 12:14:17 PMQuote from: Tibu on May 23, 2022, 08:46:56 AMSeedkeeper is purely designed to store sensitive information. Secured by a PIN code.You can use it to initialize a Satochip card or save an existing seed. It's useful to add an extra security layer and as a backup of your metal plate.This means that in theory I could just erase wipe out my Seedkeeper card, and load it with open source code provided for Satochip or Satodime?Quote from: Tibu on May 23, 2022, 09:05:44 AMWe are selling chip card readers because: 1) we have not release mobile app (and thus NFC communication) for Satochip and Seedkeeper products (not yet). 2) NFC reader are very expansive. Much more than a chip card reader.Chip card readers could be serious problem and single point of failure for your product, for example I recently heard a news about card readers that came with malware infected drivers.I didn't know that there is list of approved card readers, so anything that was not approved or certified could have some code hidden inside of them.Even approved card readers can have some government installed backdoor, so I have hard time trusting any of them.Is the card reader you are selling approved or not, and what kind of code it's using?https://krebsonsecurity.com/2022/05/when-your-smart-id-card-reader-comes-with-malware/For security reason, cards we are selling through our shop are \"locked\" to prevent any malware installation while in transit.BUT, as everything is open source, we are also selling blank javacard that you can buy and load by yourself. One applet at a time can run on the chip. And yes, if you want to load the Seedkeeper applet for testing purpose, then erase it and load the Satodime one or the Satochip one, you can.Check out our compatible Javacard: https://satochip.io/product/satochip-diy-and-developer-card/Regarding the card reader, you are completly right. But that's the exact same thing with every hardware that needs to be connected to the computer: - USB cable can onboard a malware as well as bluethoot communication. We are selling our own chip card reader because we can trust this hardware. But as you said, it is and will be a major concern in regards of the global security. Just as any other connection: people has to be careful.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "n0nce",
      "created_time": "May 23, 2022, 01:18:14 PM",
      "body": "Quote from: Tibu on May 23, 2022, 12:47:07 PMRegarding the card reader, you are completly right. But that's the exact same thing with every hardware that needs to be connected to the computer: - USB cable can onboard a malware as well as bluethoot communication. True, however, this is a very recent / current issue that was recently figured out; I also read about that. In theory, you can build MITM USB cables and whatnot [1], but it's not an acute widespread issue right now, unlike the card reader situation.Quote from: Tibu on May 23, 2022, 12:47:07 PMWe are selling our own chip card reader because we can trust this hardware. But as you said, it is and will be a major concern in regards of the global security. Just as any other connection: people has to be careful.Are you actually making your own card reader or sourcing it somewhere? Because if it's the latter, it could be affected, too. The issue is in the drivers.Here's the first article I can find about it:https://krebsonsecurity.com/2022/05/when-your-smart-id-card-reader-comes-with-malwareWould be worth checking your products / drivers you ship if they're affected too or not.[1] https://mg.lol/blog/badusb-cables/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Tibu",
      "created_time": "May 23, 2022, 07:05:10 PMLast edit: November 20, 2023, 02:25:29 PM by Tibu",
      "body": "Quote from: n0nce on May 23, 2022, 01:18:14 PMQuote from: Tibu on May 23, 2022, 12:47:07 PMRegarding the card reader, you are completly right. But that's the exact same thing with every hardware that needs to be connected to the computer: - USB cable can onboard a malware as well as bluethoot communication. True, however, this is a very recent / current issue that was recently figured out; I also read about that. In theory, you can build MITM USB cables and whatnot [1], but it's not an acute widespread issue right now, unlike the card reader situation.Quote from: Tibu on May 23, 2022, 12:47:07 PMWe are selling our own chip card reader because we can trust this hardware. But as you said, it is and will be a major concern in regards of the global security. Just as any other connection: people has to be careful.Are you actually making your own card reader or sourcing it somewhere? Because if it's the latter, it could be affected, too. The issue is in the drivers.Here's the first article I can find about it:https://krebsonsecurity.com/2022/05/when-your-smart-id-card-reader-comes-with-malwareWould be worth checking your products / drivers you ship if they're affected too or not.[1] https://mg.lol/blog/badusb-cables/Our readers are sourced from a trusted third party. It does not require any specific drivers as we are using well known chip that uses verified OS drivers. Eg: Realtek or Alcor.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "n0nce",
      "created_time": "May 23, 2022, 10:43:21 PM",
      "body": "Quote from: Tibu on May 23, 2022, 07:05:10 PMOur readers are sourced from a trusted third party. It does not require any specific drivers as we are using well known chip that uses verified OS drivers. Eg: Realtek or Alcor.That's very good to know, that you don't need to install some sketchy drivers and they work out of the box. Especially important with the current mess of 'Amazon card readers' that are apparently affected at huge scale.Quote from: https://hothardware.com/news/how-cheap-smart-id-card-reader-sold-amazon-became-national-security-riskThe contractor purchased a $15 card reader sold by Saicoo on Amazon. The device has 4.5/5 stars and 11,700 ratings and appears in the sponsored listing section at the top of the Amazon search results for “PIV (Personal Identity Verification) card reader” or “CAC card reader.” The listing and reviews would suggest that this particular CAC reader is a safe and reputable device. However, when the contractor plugged the device into his computer running Windows 10, he was met with a message saying that the device’s drivers weren’t functioning properly. Windows advised that he find newer drivers on the vendor’s website.The contractor followed this instruction and found drivers for the device on Saicoo’s website, but didn’t install them right away. He instead uploaded the file to Virustotal, which scanned the file for malware with 63 different antivirus tools. 43 of these tools indicated that the file contained malware, specifically the Ramnit worm.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Chikito",
      "created_time": "May 24, 2022, 01:32:17 AM",
      "body": "Quote from: Tibu on May 23, 2022, 08:46:56 AMQuote from: DroomieChikito on May 15, 2022, 12:01:13 AMI just see this on my local board, Husna sharing this tool, I still don't know how it work, when the function still uses electronics as media for storing the seed, is that function can still be hacked from the internet even if it is offline?. (cookie, history and etc)Is available for storing besides BIP39 seed such as Electrum seed?, because when I read how-to, there is generate a random seed, when different seed (electrum) from the default (BIP39), I doubt it will generally not as usual and make the confused when use for restoring it.What material? SS304, Titanium, or PVC (ATM Card)?how to restore when forget PIN CODE?QuoteYour Seedkeeper card is protected by a PIN code: a 4-16 characters password used to unlock itSeedkeeper is \"offline\". If you generate a masterseed \"on chip\", it's completly air-gapped. Meaning the hosting computer, neither the user is able to see it.Of course, if you use our Seedkeeper-tool to generate a new seed or import an existing one and your computer has a keylogger, you might be compromised.You can store any seed on the device.Cards are made out of PVC like your ATM card.If you forgot your PIN code, you wont be able to recover it. It's a security measure. But Seedkeeper-Tool comes with a one click backup solution. So you can initialize several Seedkeeper cards with different PIN code and import the same backup on each one.How many digits codes? is that Seedkeeper have a number 0 for a pin?. because I'm just a little bit uncomfortable, Trezor hasn't Number 0 to create a pin which is my favorite number.Why you don't make it like another seed keeper using steel?, the function will be more perfect, we don't need to worry about fire and we can keep it on a wood cupboard. And I don't know why we need to PIN for each mnemonic phrase where PIN/Password is we can use for an additional phrase using the same mnemonic seed to create another wallet/address.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}