{
  "id": "topic_5477603",
  "title": "halloweenn666",
  "author": "halloweenn666",
  "created_time": "December 12, 2023, 05:05:01 PM",
  "content": "Haberler ABD borsalarında yüzyılın en büyük kış rallisiABD borsaları inanılmaz bir ralliye imza atarak son 120 yılın en büyük sonbahar yükselislerine imza attı. Nasdaq son zirvesine yaklaştı ATH seviyesine geldi. Bu yükselişlerin faiz artışı ile beraber olması yatırımcılar tarafından absürt karşılanıyor.Devasa uyumsuzluk oluştu Nasdaq Ath yaparken aylık macd endeksinde negatif uyumsuzluk göze çarptı. Uyumsuzluğum devasa boyutlarda olması yatırımcıları 2024-2025 yılları için endişeye sevk etti.Paladyum Ayı bölgesine girdi. Yaprak dökümü devam ediyor.Paladyum 3000 dolardan başladığı çöküşe 900 dolara inerek devam etti. En son 2000 yılında girdiği ayı bölgesine 2023 yılı itibari ile yeniden adım atan paladyum için baharın gelmesi yıllar alacaga benziyor.Bitcoin rekor kırdı 1 yıla yüzde 280 getiri Bitcoinde yükseliş devam ediyor yükselişlerin hiç bir düzeltme olmadan devam etmesi dikkat çekti. Yalnızca son 1 ayda yüzde 100 yükselerek rekor kırdı. 1 yılda ise 16 bin dolar seviyesinden 45 bin dolara kadar yükseldi.Yükselişler devam ederken bir çok yatırımcı boğa sezonunun geldiğine inanıyor ve piyasanın halvinge kadar 70 bin dolara gitmesi bekleniyor.Altında Ath geldi Altın fiyatları 2150 doları görerek rekor kırdı ve yeni bir zirve yaptı. Son 10 yıldır ayı sezonunda olan sari metalde kipirdanmalar dikkat çekici boyutlara ulaştı.Platin madencileri kepenk mi kapatıyor ?Platin madeni, düşük fiyat yüzünden madencilerin büyük zarar yazdıkları ve üretimi durdurdukları haberleriyle gündeme düştü. Ons fiyatı 900 dolarda olan beyaz metalde üretim maliyetlerinin çok ciddi oranda arttığı mevcut durumda Afrika bölgesindeki madenlerin üretim yapamayacak duruma geldiği aktarılıyor.Fed zarar yazıyor ABD merkez Bankası Fed 150 milyar dolara yakın zarar açıkladı. 1920 lerden sonra ilk kez zarar açıkladığı belirtiliyor.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5477603",
  "comments": []
}