{
  "id": "topic_5464660",
  "title": "SenopaTEA",
  "author": "SenopaTEA",
  "created_time": "August 26, 2023, 01:07:55 PM",
  "content": "Maaf saya pemula, dulu pernah ikut forum ini tapi belum antusias untuk terjun lebih lanjut. Sesuai judul, saya penasaran dengan beberapa berita dan info lama yang beredar di beranda yang menemukan bitcoin di harddisk lama. Pertanyaan saya adalah bagaimana cara saya dapat mengecek harddisk lama yang saya miliki (eks kantor dan jual beli laptop/pc) memiliki kandungan bitcoin atau altcoin? apakah harus menginstall wallet atau sejenisnya dahulu? ataukah ada cara lain yang lebih sederhana hanya sekedar mengecek?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5464660",
  "comments": [
    {
      "author": "mu_enrico",
      "created_time": "August 26, 2023, 04:17:46 PM",
      "body": "Kalau hardisknya masih sehat dan bisa diakses tinggal pakai fitur search aja di PC aja, tapi berhubung file walletnya tidak sama antara satu wallet dengan yang lainnya, maka agan nanti mencarinya beberapa kali, misalnya: (FYI ini cuma mencari file walletnya, mau tau ada tidaknya \"kandungannya\" ya harus dibuka dulu dengan asumsi agan tau passwordnya).- kalau mencari wallet bitcoin core: cari \"wallet.dat\"- kalau mencari wallet electrum: cari \"default_wallet\"Itu cara yang ane pakai sih, mungkin master di bawah ane ada cara yang lebih canggih?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "vv181",
      "created_time": "August 26, 2023, 04:42:34 PM",
      "body": "Cara cepat lainnya yaitu agan bisa mengunjungi lokasi folder penyimpanan default dari suatu wallet cryptocurrency, tapi kalau mau gampang tinggal gunakan fitur search seperti yang sudah dijelaskan di atas. Untuk cara lainnya agan bisa menggunakan aplikasi yang memiliki fitur untuk mencari wallet dalam keseluruhan harddisk secara otomatis, ada juga aplikasi yang bisa mencoba untuk memulihkan file wallet yang sudah terhapus.Untuk aplikasi-aplikasi tersebut sebagai berikut.[GUIDE] Recover your deleted keysfindwallet - Bitcoin Core Wallet FinderMengenai cara penggunannya, silakan mengikuti panduan yang sudah ada di dalam thread tersebut.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blue Snow",
      "created_time": "August 27, 2023, 12:01:35 AM",
      "body": "Quote from: SenopaTEA on August 26, 2023, 01:07:55 PMapakah harus menginstall wallet atau sejenisnya dahulu?Tidak harus, karena wallet yang terinstall sepengatahuan ane tidak dapat otomatis terdeteksi apa lagi jika tidak berada di folder utama atau di C:Quote from: SenopaTEA on August 26, 2023, 01:07:55 PMataukah ada cara lain yang lebih sederhana hanya sekedar mengecek?Ente bisa pakai cara sederhana yang disampaikan oleh 2 poster di atasQuote from: SenopaTEA on August 26, 2023, 01:07:55 PMPertanyaan saya adalah bagaimana cara saya dapat mengecek harddisk lama yang saya miliki (eks kantor dan jual beli laptop/pc) memiliki kandungan bitcoin atau altcoin? Kalau hardisk lama yang pernah ente pakai bisa pakai ingatan ente sendiri, biasanya hardisk-hardisk wallet itu akan full oleh blockchain yang pernah ente download dulunya. jadi kalau sekiranya hardisk ente itu biasa-biasanya saja, alias datanya sedikit, bisa jadi itu bukan prioritas ente untuk men-scan-nya.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husna QA",
      "created_time": "August 27, 2023, 02:10:56 PM",
      "body": "Quote from: SenopaTEA on August 26, 2023, 01:07:55 PMMaaf saya pemula, dulu pernah ikut forum ini tapi belum antusias untuk terjun lebih lanjut. Sesuai judul, saya penasaran dengan beberapa berita dan info lama yang beredar di beranda yang menemukan bitcoin di harddisk lama. Pertanyaan saya adalah bagaimana cara saya dapat mengecek harddisk lama yang saya miliki (eks kantor dan jual beli laptop/pc) memiliki kandungan bitcoin atau altcoin? apakah harus menginstall wallet atau sejenisnya dahulu? ataukah ada cara lain yang lebih sederhana hanya sekedar mengecek?Biasanya kalau harddisk lama semisal dari hasil jual beli, minimalnya user sebelumnya akan menghapus semua data yang ada atau bahkan memformatnya setelah mereka memindahkan data ke harddrive yang lain.Jika di harddisk masih terdapat data-datanya, bisa gunakan aplikasi Everything untuk pencarian file lebih cepat dari fitur standar bawaan windowsOS.Sementara jika ternyata harddisk-nya sudah di-format, bisa menggunakan aplikasi recovery; Saya sendiri dulu pernah menggunakan Runtime-GetDataBack dan berhasil merecovery harddisk yang partisinya rusak.Untuk mencari file wallet Bitcoin bisa lebih rumit terlebih nama wallet termasuk folder tempat penyimpanannya juga bisa dibuat beda dari default-nya, namun jika memang mau mencobanya, cari dengan menggunakan nama file wallet standar dari aplikasi wallet Bitcoin seperti yang disebutkan di beberapa posting di atas.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joniboini",
      "created_time": "August 28, 2023, 06:57:01 AM",
      "body": "Quote from: Husna QA on August 27, 2023, 02:10:56 PMSaya sendiri dulu pernah menggunakan Runtime-GetDataBack dan berhasil merecovery harddisk yang partisinya rusak.Apakah aplikasi tersebut bisa merecover file yang sudah tertimpa beberapa kali om? Dulu ane nyobain Recuva dan beberapa aplikasi berbayar lain untuk recovery file ane, tapi ketika sudah tertimpa beberapa kali selalu saja corrupt. Dari situ ane tidak melihat perbedaan software-software recovery semacam ini. Mungkin memang dari segi fisik harddisk seperti itu ya.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husna QA",
      "created_time": "August 28, 2023, 09:23:26 AM",
      "body": "Quote from: joniboini on August 28, 2023, 06:57:01 AMQuote from: Husna QA on August 27, 2023, 02:10:56 PMSaya sendiri dulu pernah menggunakan Runtime-GetDataBack dan berhasil merecovery harddisk yang partisinya rusak.Apakah aplikasi tersebut bisa merecover file yang sudah tertimpa beberapa kali om? Dulu ane nyobain Recuva dan beberapa aplikasi berbayar lain untuk recovery file ane, tapi ketika sudah tertimpa beberapa kali selalu saja corrupt. Dari situ ane tidak melihat perbedaan software-software recovery semacam ini. Mungkin memang dari segi fisik harddisk seperti itu ya.Kalau sudah tertimpa beberapa kali dalam artian hardisknya sudah tertulis lagi file baru terlebih pada sector yang sama, kemungkinan memang akan lebih sulit mengangkat file lama yang sebelum itu.Seingat saya pernah juga mencoba Recuva dan beberapa aplikasi recovery lain, namun pada proses save file, hirarki file dan folder tidak terstruktur seperti sebelumnya melainkan dikelompokkan berdasar jenis file dan tidak jarang filenya ada yang corrupt. Sementara di aplikasi yang saya sebut di atas ada fitur Restore file names and directory structure dan ini menurut saya ini bisa lebih memudahkan pencarian semisal pada file wallet Bitcoin pun tinggal mencari folder default-nya dimana dan save file yang dimaksud saja.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mu_enrico",
      "created_time": "August 28, 2023, 05:19:02 PM",
      "body": "Quote from: joniboini on August 28, 2023, 06:57:01 AMApakah aplikasi tersebut bisa merecover file yang sudah tertimpa beberapa kali om? Dulu ane nyobain Recuva dan beberapa aplikasi berbayar lain untuk recovery file ane, tapi ketika sudah tertimpa beberapa kali selalu saja corrupt. Dari situ ane tidak melihat perbedaan software-software recovery semacam ini. Mungkin memang dari segi fisik harddisk seperti itu ya.Kalo yang ane denger, ada spesialis untuk yang kek gini, tidak bisa dilakukan oleh yang bukan ahlinya...Bahkan ada kasus hdd yang sudah terbakar pun bisa direcovery, kan ada tuh \"digital forensic\" klo di pelm-pelm luar negeri Kalo pakai software kek recuva dsb, mentok paling kalo datanya belum ditimpa, baru bisa direcover. Kalau cuma keformat aja dan belum ketimpa data baru sih sangat mudah itu. Ane pernah nyobain bbrp software tp mungkin udah 10+ tahun yang lalu dan ane ga nemuin ada yg mampu recover hdd yg udah di-schredder.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kurinkitafu",
      "created_time": "November 16, 2023, 01:53:44 PM",
      "body": "Jadi ini kasusnya agan hardisk toh yang rusak. Kalau hard disk-nya rusak, coba aja bawa ke jasa pemulihan data biar datanya bisa diakses lagi. Kalau memang hardisknya masih ada coba cek dengan \"sentinel\" dulu. Pasang di komputer lain atau laptop. Biasanya ada jasa juga klo memang pengen bnaget pakasain buat ngambil data. Kalo udah berhasil dipulihkan, cari file wallet-nya (biasanya .dat), trus install wallet yang sesuai di komputer baru. Taruh file wallet yang lama di sana, dan wallet bakal ngecek saldo Bitcoin atau Altcoin yang ada. Kalau buat altcoin wallet biasanya ada private key atau mneumonics phrase (biasanya 12 angka).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blue Snow",
      "created_time": "November 22, 2023, 06:14:02 AM",
      "body": "Quote from: Kurinkitafu on November 16, 2023, 01:53:44 PMJadi ini kasusnya agan hardisk toh yang rusak. Kalau hard disk-nya rusak, coba aja bawa ke jasa pemulihan data biar datanya bisa diakses lagi. Kalau memang hardisknya masih ada coba cek dengan \"sentinel\" dulu. Pasang di komputer lain atau laptop. Biasanya ada jasa juga klo memang pengen bnaget pakasain buat ngambil data. Kalo udah berhasil dipulihkan, cari file wallet-nya (biasanya .dat), trus install wallet yang sesuai di komputer baru. Taruh file wallet yang lama di sana, dan wallet bakal ngecek saldo Bitcoin atau Altcoin yang ada. Kalau buat altcoin wallet biasanya ada private key atau mneumonics phrase (biasanya 12 angka). Sentinel itu setahu ane hanya untuk mengetahui Hardisk milik kita itu sehat atau tidak, Bukan untuk pemulihan data atau recovery hardisk. kalau ane baca lagi kasus dia di atas, OP kepengen tahu apa HD-nya berisi wallet crypto atau tidak, dalam artian, HD dia itu masih cukup sehat tanpa harus di-sentinel-kan lagi.Sedangkan untuk pemulihan data, mending dipulihkan sendiri saja, tidak usah pakai jasa segala, karena kalau pakai jasa pemilihan, nanti kalau ada wallet di dalam HD tersebut, orang yang mengerjakannya akan ngambil dan mengetahui apa isi di dalam HD tersebut.Untuk Wallet, tidak mesti .dat, bahkan untuk electrum tidak ada ekstensi-nya, hanya berupa file saja. bahkan, ada wallet altcoin yang berekstensi .json",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}