{
  "id": "topic_5425667",
  "title": "KiaKia",
  "author": "KiaKia",
  "created_time": "December 04, 2022, 01:10:05 PM",
  "content": "There is a saying that \" if you can't beat them, you join them \" ,is this what's going on with Btc and our government? You can't confuse me that the government aren't buying Bitcoin too, since they knew that this is the real power back to the people, something they really can't control, I'm guessing the only option they have is to join?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5425667",
  "comments": [
    {
      "author": "Obari",
      "created_time": "December 04, 2022, 01:49:43 PM",
      "body": "Quote from: KiaKia on December 04, 2022, 01:10:05 PMThere is a saying that \" if you can't beat them, you join them \" ,is this what's going on with Btc and our government? You can't confuse me that the government aren't buying Bitcoin too, since they knew that this is the real power back to the people, something they really can't control, I'm guessing the only option they have is to join? You're right And since they can't beat Bitcoin, they have now decided to fall back to Bitcoin and join the winning train.Most government officials posses alot of Bitcoin secretly and there are more news of country's adoption to Bitcoin in recent times which is a positive prove of the the acceptance of Bitcoin.Bitcoin despite struggling to be a global legal tender, there are so many other businesses who also accept Bitcoin and other cryptos as a means of payment.So you're right and the situation with government and Bitcoin can also be associated with tye saying that if you can't beat them, join them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yogee",
      "created_time": "December 04, 2022, 02:05:03 PM",
      "body": "Quote from: KiaKia on December 04, 2022, 01:10:05 PM....You can't confuse me that the government aren't buying Bitcoin too,Governments don't need to buy or join any of the Bitcoin movement because they can just regulate them. That's what many countries have been doing as of late. The legality of BTC as a country's legal tender remains negative BUT transactions over centralized exchanges and other platforms offering crypto custodial services are highly regulated and are subjected to taxes.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pandu Geddon",
      "created_time": "December 04, 2022, 02:33:21 PM",
      "body": "if the government wants to ban it, of course, the government must provide another solution regarding the use of Bitcoin. what is becoming difficult for the government to control is the Bitcoin market which is already very large at this time. so what they can do is regulate the existing exchange platform in their country. That's what happened today.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PX-Z",
      "created_time": "December 04, 2022, 02:37:00 PM",
      "body": "That's somewhat right, but as you've seen, in any country, government's regulations do the thing, instead of buying literally. And crypto regulations is a double edge sword, while it's somewhat good for the community instead of banning crypto in specific country, it also a risk for decentralization where we are already in era of KYC—normalizing KYC.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sunsilk",
      "created_time": "December 04, 2022, 02:45:18 PM",
      "body": "Quote from: KiaKia on December 04, 2022, 01:10:05 PMThere is a saying that \" if you can't beat them, you join them \" ,is this what's going on with Btc and our government? You can't confuse me that the government aren't buying Bitcoin too, since they knew that this is the real power back to the people, something they really can't control, I'm guessing the only option they have is to join? Yeah, most likely.They can't stop bitcoin but they can regulate the usage of it and the licenses that can be applied to them by those businesses that has a sole focused for bitcoin.But it's not all about the power of the people and what bitcoin has but the potential of it on how valuable it will be in the near future. As they understand that it has a finite supply and demand of it will be greater so, that's where they're capitalizing it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Issa56",
      "created_time": "December 04, 2022, 04:21:14 PM",
      "body": "Quote from: KiaKia on December 04, 2022, 01:10:05 PMThere is a saying that \" if you can't beat them, you join them \" ,is this what's going on with Btc and our government? Don't be surprise that most people in government agencies are buying bitcoin, I know some people that are in government office which are asking me to teach them about bitcoin and cryptocurrency in general, some of them are holding bitcoin and some are ready to invest in bitcoin. Quote from: KiaKia on December 04, 2022, 01:10:05 PMYou can't confuse me that the government aren't buying Bitcoin too, since they knew that this is the real power back to the people, something they really can't control, I'm guessing the only option they have is to join? The government knows the truth but I don't know why they don't really want to join bitcoin, maybe it's because they don't have control over bitcoin that's why they are against it, they want a currency that they can control but they can't control bitcoin. The only thing I know is that with time the government won't have choice than to accept bitcoin, they have done different things just to kill bitcoin but all are always in vain, so they will accept bitcoin but it might take time before they will accept it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sandra_hakeem",
      "created_time": "December 04, 2022, 04:59:52 PM",
      "body": "Quote from: KiaKia on December 04, 2022, 01:10:05 PMThere is a saying that \" if you can't beat them, you join them \" ,is this what's going on with Btc and our government? You can't confuse me that the government aren't buying Bitcoin too, since they knew that this is the real power back to the people, something they really can't control, I'm guessing the only option they have is to join? The government doesn't really need to stop Bitcoin; in our technological world today, we've got a Grand rule, which is: you can't destroy what you cannot create. Ethical hackers are tryna bypass 'em limits but it's somewhat hard and almost impossible.The government isn't in control of Bitcoin. AFAIK,since BTC ain't a \"medium of exchange\", alot of Bitcoin's transaction - most especially in p2p - will have a user paid in FIAT, cash, bucks etc....this invariably means that this two are working in concordance, until whenever. For now, Bitcoin serves as a store of value which, I guess is ONE of the reasons for it's volatility.Sandra 🧑",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "UserU",
      "created_time": "December 04, 2022, 05:01:18 PM",
      "body": "Exchanges like FTX are the reason why gov agencies are lobbying for control. Too much freedom, too many scams. Then those victims cry foul and beg for those criminals to be arrested. And that involves the authorities.Honestly it's not always a bad thing. I mean if you have nothing to hide, why be scared of the government? Just declare your assets and you'll be fine.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "2stout",
      "created_time": "December 04, 2022, 05:54:18 PM",
      "body": "Governments know they can't control Bitcoin so the next best thing they figure is to contain it.  They will try to contain it by buying some up and also via regulations.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptopreneurBrainboss",
      "created_time": "December 04, 2022, 07:52:02 PM",
      "body": "Quote from: KiaKia on December 04, 2022, 01:10:05 PMYou can't confuse me that the government aren't buying Bitcoin too, since they knew that this is the real power back to the people, something they really can't control, I'm guessing the only option they have is to join? I don't think the government are directly buying Bitcoin although they hold a very large amounts in seized assets (Bitcoin and probably other cryptocurrency). QuoteBut sometimes the government is able to get it back. Last week, the United States seized $500,000 in cryptocurrency from alleged North Korean hackers who got that money by extorting American medical organizations. That’s just a drop in the bucket considering the grand total: the IRS alone seized $3.5 billion in cryptocurrency in 2021. Source: https://www.technologyreview.com/2022/07/26/1056447/how-governments-seize-millions-in-cryptocurrency/amp/ We're yet to get to that stage when the government will be scared of Bitcoin to the extend that they'll start trying to buy out the Bitcoin in existence. Now there are still some doubts by the government that Bitcoin can achieve what it claims to be targeting which is the total decentralized of finances.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Upgrade00",
      "created_time": "December 04, 2022, 07:58:35 PM",
      "body": "Quote from: KiaKia on December 04, 2022, 01:10:05 PMI'm guessing the only option they have is to join? They have some other options;• They can try to replicate the network by creating CBDCs which function on the blockchain, but this would not be a popular alternative,• They can regulate its usage within the country and place heavy taxations on Bitcoin related transactions,• They can outrightly ban the network and make it illegal to use,• They can try to benefit of the surge of the network and become more Bitcoin friendly to attract developers and investors alike.They could do any of this while buying Bitcoin, and neither of it really matters as it's not in our control how the government reacts. What's in your control is how you store your bitcoins that no government would be able to control.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zilon",
      "created_time": "December 04, 2022, 08:00:52 PM",
      "body": "Those in power are only trying to echo their fear of losing control of the people with the decentralisation Bitcoin has using their office as officials to express it. But in their homes they buy as much has the can just like you and i. Now the price is down don't be surprise if the most strict government official bought enough that will serve as a financial protection for their children and beyond. The wise do what is right after all it is a decentralised asset.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gantez",
      "created_time": "December 04, 2022, 08:30:20 PM",
      "body": "Government is only a name that covering some people like a coverage and the people on that covering are individuals who having five sense organs and like you and like me they also invest in bitcoin. This is sure that government try to stop bitcoin but can't because it can't be monitored. The government officials know and they are wise to invest with public money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SatoPrincess",
      "created_time": "December 04, 2022, 08:38:01 PM",
      "body": "Quote from: KiaKia on December 04, 2022, 01:10:05 PMThere is a saying that \" if you can't beat them, you join them \" ,is this what's going on with Btc and our government? You can't confuse me that the government aren't buying Bitcoin tooExcept for El Salvador that made Bitcoin a legal tender, there is no other country patronizing bitcoin. While persons holding public offices may be buying bitcoins for themselves,  that doesn’t mean the government is buying bitcoin, it just means more people are buying,  Quote from: KiaKia on December 04, 2022, 01:10:05 PMI'm guessing the only option they have is to join? There are lot more options on the table, for one they can ban p2p transactions, ban bitcoin mining and also go hard on crypto exchanges with strict regulations. The government isn’t a body that can be cornered easily to do something that’s is not in their economical interest",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "libert19",
      "created_time": "December 05, 2022, 03:26:27 AM",
      "body": "Idk about government (s) themselves, but government employees are likely into it, especially from corrupt nations.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "December 05, 2022, 08:13:21 AM",
      "body": "Government employees are definitely joining it. Even though there are hindrances or opposition on the side of Government. Majority of the people inside are probably buying bitcoin and crypto since they are also human who are looking for side hustle and good investment. Many of my colleagues in the industry are also joining the wagon and asking me of some of my idea about crypto even though they knew that this is a risky and not supported at all by the government.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Vicson1",
      "created_time": "December 05, 2022, 02:57:13 PM",
      "body": "Quote from: KiaKia on December 04, 2022, 01:10:05 PMThere is a saying that \" if you can't beat them, you join them \" ,is this what's going on with Btc and our government? You can't confuse me that the government aren't buying Bitcoin too, since they knew that this is the real power back to the people, something they really can't control, I'm guessing the only option they have is to join? To me, because Bitcoin is a decentralized organization, the government can only regulate it if they want to live in peace with their citizens as this is going to be difficult to stop. My suggestion to the government is to find a way to make it official and they can generate funds from it by including vat for every purchase or Bitcoin transaction. Thank you...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lida93",
      "created_time": "December 05, 2022, 06:21:20 PM",
      "body": "Btc has in the past conquered all odds put towards eliminating it by any government and they could see the level of fairness and equality it offers to all involved in it . The government may pretend not to be involved in crypto investment but there's a possibility of their official secretly participating in the business. The concern of government over cryptocurrency is the lack of control they want to have over it which is not possible cause the uniqueness of cryptocurrency is the decentralization it enjoys.In my country in the past years the government placed a ban on cryptocurrency operations, blocking all means of involvement by the citizens, but as it stands there is news going round about them putting plans on ground  to accept it and only place tax on it operations. So it's just an issue of time, many government will eventually accept the operations of cryptocurrency.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mpamaegbu",
      "created_time": "December 05, 2022, 06:24:05 PM",
      "body": "Quote from: KiaKia on December 04, 2022, 01:10:05 PMYou can't confuse me that the government aren't buying Bitcoin tooBut of course, the two-faced hypocrites are insidiously buying it. They may not come to the open to do it, either as a government body or as their individual officials. At the peak of Bitcoin ban in my country, one of the top government officials (the Attorney General of my country) was caught using a Kucoin exchange. There is much pretence with what people are in public and what they truly are in their private chambers. So, take advantage of this period and DCA on Bitcoin now. Tomorrow may not present us an opportunity.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}