{
  "id": "topic_5420960",
  "title": "ChillyMatthew",
  "author": "ChillyMatthew",
  "created_time": "November 14, 2022, 01:35:41 PM",
  "content": "GM Crypto Fam, we all know that lots of firms were impacted by the FTX's fallout, like BlockFi, Galaxy Digital, Wintermute, etc.I'll use the example that made me wonder about this in the first place.Quote Galaxy Digital, a prolific Web3 and crypto investor headed by Michael Novogratz, had $77 million in exposure to FTX, of which $47.5 million is yet to be withdrawn. Since FTX filed for bankruptcy this Friday, what happens to Galaxy Digital's $47.5 million? What am I missing here?Source of the quote:https://app.getresponse.com/view.html?x=a62b&m=BI7D9x&mc=lE&s=BtgXWnG&u=QcLhh&z=EF6QS1l&",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5420960",
  "comments": [
    {
      "author": "Tony116",
      "created_time": "November 14, 2022, 03:14:12 PM",
      "body": "Once filed for bankruptcy, it means that FTX is no longer able to pay money to partners and investors, so the possibility of investors getting their money back is very low. After FTX goes bankrupt, the company's assets will be liquidated and this money will be used to return money to investors. Therefore, strategic investors can get a share, but for retail investors, the risk of losing everything is very high. The missing amount of FTX is up to 9 billion USD, this is a very large number and that is why binance does not want to buy back FTX because it does not want to pay this debt on behalf of FTX.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zasad@",
      "created_time": "July 12, 2023, 01:30:46 PM",
      "body": "https://twitter.com/FTX_Official/status/1674154921040441346@FTX_Official(C)\"The FTX Debtors’ “Customer Bar Date” has been set for September 29, 2023 at 4 PM ET. To streamline the process for customers, the FTX Debtors are finalizing an online claims portal at https://claims.ftx.com. FTX Debtors will announce when the portal is active.\"",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}