{
  "id": "topic_5436589",
  "title": "Question:",
  "author": "ahmim",
  "created_time": "January 24, 2023, 11:06:43 AMLast edit: January 29, 2023, 07:24:00 AM by ahmim",
  "content": "helloI'm from the ahmim Baunty Management Community. I want to run a bounty campaign with your project. Let me know if you're interested. I've preached a lot of bounty campaigns before. According to everyone, my medium of promotion is different, but everyone likes it. Also ask me any questions if you want to do more about a bounty campaign.My Contract Telegram: https://t.me/samil507 Means of bounty :1. Twitter2.Facebook 3.Telegram4.Instagram5.Discord6.Medium7.Reddit8.Article 9.Tik Tok Video/ Youtube Video",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5436589",
  "comments": [
    {
      "author": "jayce",
      "created_time": "January 24, 2023, 07:14:35 PM",
      "body": "Cool thread! And it would be much better if you put the link on each of project icons so your potential clients could check them. I'm bit surprised to know that you have managed 8 project campaigns already. Too bad I'm not looking for a campaign manager, but I'm curious about your different promotion method.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bnbstorm",
      "created_time": "January 25, 2023, 07:16:06 AM",
      "body": "Quote from: ahmim on January 24, 2023, 11:06:43 AMhelloI'm from the CryptoWorld Baunty Management Community. I want to run a bounty campaign with your project. Let me know if you're interested. I've preached a lot of bounty campaigns before. According to everyone, my medium of promotion is different, but everyone likes it. Also ask me any questions if you want to do more about a bounty campaign.My Contract Telegram: https://t.me/samil507 Means of bounty :1. Twitter2.Facebook 3.Telegram4.Instagram5.Discord6.Medium7.Reddit8.Article 9.Tik Tok Video/ Youtube Video I've preached a lot of the bounti campaign. Those areMy Contract Telegram : https://t.me/samil507Kindly provide links for your precious campaigns as your profile is quite new to claim management of 8 campaigns.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}