{
  "id": "topic_5475332",
  "title": "Prancheiro",
  "author": "Prancheiro",
  "created_time": "November 24, 2023, 01:33:27 PM",
  "content": "Podemos fundar uma cidade ou um país?Dado que a internet permitiu criarmos startups para competir com as grandes corporações, também permitiu criarmos criptomoedas para serem uma alternativa às moedas estatais, qual seria o próximo passo?Criamos startups como Amazon e Google.Também criamos comunidades como Facebook (agora Meta), Twitter (agora X), e o Linkedin. Há quase 15 anos Satoshi criou o Bitcoin, que precedeu o ETH da Ethereum e milhares de outras criptomoedas.Todas essas iniciativas começaram pequenas: O Google dentro de uma garagem;O Facebook dentro de um dormitório em uma faculdade;O Bitcoin a partir de uma postagem em uma lista de discussão, e que por um mês foi usado por apenas uma pessoa;Todas essas iniciativas se tornaram alternativas para resolver problemas existentes, passaram a ser utilizadas por bilhões de usuários e hoje valem bilhões, e até trilhões de dólares.E é isso? Chegamos no fim da linha? O máximo que a internet irá nos permitir é construir novas empresas, novas moedas e nada além disso?E fosse possível criar novas cidades ou novos países conectando pessoas com o mesmo propósito ao redor do mundo?Esse é o conceito de Network State.Se você ficou curioso, bora pra 1ª Conferência de Startup Societies da América Latina.https://ipe.city/conferenceQuem quiser ir me avisa que consigo código de desconto!",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5475332",
  "comments": [
    {
      "author": "Paredao",
      "created_time": "November 24, 2023, 08:00:48 PM",
      "body": "Não obrigado. Essa história de fundar nações na internet eu já vi outras vezes. Sempre dá em nada. Teve uns malucos que já fundaram várias \"Nárnias\" Virtuais e não deram em nada. Apenas eles conseguiram arrecadar uma graninha extra de outros malucos. Tem maluco para tudo na Net.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "November 24, 2023, 11:35:05 PM",
      "body": "Quote from: Prancheiro on November 24, 2023, 01:33:27 PMDado que a internet permitiu criarmos startups para competir com as grandes corporações, também permitiu criarmos criptomoedas para serem uma alternativa às moedas estatais, qual seria o próximo passo?Apesar de entender o conceito, não concordo com essa ideia.Todas as empresas foram \"startups\", a questão é que já existe a muitos anos. Mas na realidade, elas acabaram por não vir competir com as grandes corporações, pelo menos enquanto eram \"startups\".A Google veio ocupar um espaço pouco explorado. Talvez o único concorrente era a Yahoo e mesmo assim a Yahoo era um portal com motor de pesquisa, e não era simplesmente um motor de pesquisa. Então, nem foi bem um competição com ela. Com o seu crescimento, sim, passou a competir com empresas já estabelecidas por anos, mas nessa altura já não era nenhuma \"startup\".O Facebook veio ocupar um espaço também ele pouco trabalho. Tinha o Hi5 ou Orkut, mas mesmo na realidade não eram grandes corporações, eram também startups que acabaram por não vingar.A Amazon nem se fala, nasceu sem concorrência.Enfim, quando essas empresas nasceram, não vieram para competir com nenhum gigante. Por sua vez, hoje, a probabilidade de uma startup desse gênero ficar grande para competir é cada vez menor, porque os gigantes vão comprar.Temos um exemplo bem recente, o OpenGT. O facto de ter crescido tanto, já tem a Microsoft ao seu lado, e mais cedo ou mais tarde vai a comprar. Mas se não fosse a Microsoft, tinha sido outra grande empresa a posicionar-se para fazer isso.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Prancheiro",
      "created_time": "November 25, 2023, 06:50:25 PM",
      "body": "Quote from: Paredao on November 24, 2023, 08:00:48 PMNão obrigado. Essa história de fundar nações na internet eu já vi outras vezes. Sempre dá em nada. Teve uns malucos que já fundaram várias \"Nárnias\" Virtuais e não deram em nada. Apenas eles conseguiram arrecadar uma graninha extra de outros malucos. Tem maluco para tudo na Net.   Quote from: joker_josue on November 24, 2023, 11:35:05 PMApesar de entender o conceito, não concordo com essa ideia.Todas as empresas foram \"startups\", a questão é que já existe a muitos anos. Mas na realidade, elas acabaram por não vir competir com as grandes corporações, pelo menos enquanto eram \"startups\".A Google veio ocupar um espaço pouco explorado. Talvez o único concorrente era a Yahoo e mesmo assim a Yahoo era um portal com motor de pesquisa, e não era simplesmente um motor de pesquisa. Então, nem foi bem um competição com ela. Com o seu crescimento, sim, passou a competir com empresas já estabelecidas por anos, mas nessa altura já não era nenhuma \"startup\".O Facebook veio ocupar um espaço também ele pouco trabalho. Tinha o Hi5 ou Orkut, mas mesmo na realidade não eram grandes corporações, eram também startups que acabaram por não vingar.A Amazon nem se fala, nasceu sem concorrência.Enfim, quando essas empresas nasceram, não vieram para competir com nenhum gigante. Por sua vez, hoje, a probabilidade de uma startup desse gênero ficar grande para competir é cada vez menor, porque os gigantes vão comprar.Temos um exemplo bem recente, o OpenGT. O facto de ter crescido tanto, já tem a Microsoft ao seu lado, e mais cedo ou mais tarde vai a comprar. Mas se não fosse a Microsoft, tinha sido outra grande empresa a posicionar-se para fazer isso.Existem iniciativas e iniciativas!Uma coisa é um grupo de pessoas que quer \"fundar\" um país novo. Outra é uma comunidade de pessoas com o propósito e os valores alinhados e com capacidade de ações coletivas.Trazendo por mundo real, o melhor paralelo seriam os judeus: Pessoas com os mesmos valores, descentralizados, mas com grande capacidade de ações coletivas, a ponto de pressionar a comunidade internacional com reconhecimento diplomático de terras.E aqui já entra-se em uma divisão dentro da tese: A de \"land first\" ou \"land later\".Outra narrativa é quanto à adoção ou reformas de políticas, leis, governança. Dentro de um país, é quase impossível testar antes esse tipo de implementação. E aí tem o conceito de sandbox, que na tecnologia é amplamente utilizado: Cria-se um ambiente de teste para ver como as reformas irão desempenhar e depois decide-se por incluir ou não na \"rede principal\".Esse conceito hoje é o de Zonas Econômicas Especiais.No Brasil temos a Zona Franca de Manaus que atua sob algumas premissas (fiscais e tributárias apenas) diferentes da do restante do país!As mais conhecidas talvez sejam Singapura e Hong Kong, que adotaram modelos de governança diferentes, geralmente mais pró liberdade e pró mercado, e menos intervencionistas.E atrairam muito mais talentos, empresas, pesssoas e consequente desenvolvimento, renda, baixa pobreza em relação aos seus pares (Malásia e China).Não à toa, a China pra evitar um choque de realidade muito grande quando recebesse Hong Kong de volta, adotou uma ZEE em Shenzhen com governança diferente do restante da China, e a cidade saiu de uma vila de pescadores para 12 milhões de pessoas e uma economia/riqueza/pib per capita muuuito acima do restante da China.Existem diversas iniciativas.Fundar um país, é a cereja do bolo. Mas durante a jornada, tem muita coisa que dá pra fazer ajudando os estados atuais a terem uma governança mais aberta, livre, transparente.Tem o case de Taiwan também, onde a sociedade civil entrou no meio e conseguiu gerar muito mais transparência e inclusive participação ativas em várias deliberações.Hoje vários nômades digitais já escolhem viver em países que são mais amigáveis. E a tendência é continuar. Cada vez mais existirá uma competição por talentos, recursos, pessoas. E na história da humanidade, sempre prosperou mais quem era mais pró liberdade e mercado.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Paredao",
      "created_time": "November 25, 2023, 08:09:42 PM",
      "body": "Quote from: Prancheiro on November 25, 2023, 06:50:25 PM(...)Sim, já vi essas histórias sobre formação de lideranças, talentos, etc,etc,etc. Essa pratica é bem difundida por Think Tanks conservadoras norte-americanas para doutrinar as pessoas a pensarem e agirem como eles querem. Tem vários exemplos disso. Gastam milhões com isso. Sei bem como começou tudo isso. Foi um cidadão britânico que começou com essas ideias no final dos anos 60 e começo dos anos 70 do século passado. Margareth Thatcher e seu grupo quem primeiro abraçou essas ideias. Morei um tempinho em Londres nos final dos anos 70 e começo dos 80 do século passado(meu pai foi transferido para lá). Então, sei muito bem como tudo isso começou.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}