{
  "id": "topic_5406171",
  "title": "hugeblack",
  "author": "hugeblack",
  "created_time": "July 13, 2022, 07:11:19 PM",
  "content": "About less than a month ago, my TRX wallet address randomly receives amounts smaller than one dollar, mostly (+0.000003 TRX - 0.000028TRX)? Does this happen to you? And what is the reason?I thought it was a dust attack, but the frequency of receiving random values is an indication of something abnormal",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5406171",
  "comments": [
    {
      "author": "ryzaadit",
      "created_time": "July 13, 2022, 07:17:38 PM",
      "body": "Yes, most of the time is a dusting attack.Also, this method is being used for spamming services to promote a site. If you click on the hash transaction, most of these spam transactions always have a description in the Chinese language with a link.You can't do anything, since the smart-contract of this spamming is reacted everytime you doing a transaction.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "serjent05",
      "created_time": "July 13, 2022, 07:38:04 PM",
      "body": "Did you set some of your TRX staking/voting?  It is possible that the TRX you received is a reward from it.  If not, it is possible that it is a dusting attack as said by ryzaadit.To anyone who doesn't know about dusting attack:QuoteA dusting attack refers to a relatively new kind of malicious activity where hackers and scammers try and break the privacy of Bitcoin and cryptocurrency users by sending tiny amounts of coins to their wallets. The transactional activity of these wallets is then tracked down by the attackers, who perform a combined analysis of different addresses to deanonymize the person or company behind each wallet.You can read a detailed explanation here: https://academy.binance.com/en/articles/what-is-a-dusting-attack",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zonefloor",
      "created_time": "July 13, 2022, 10:24:57 PM",
      "body": "dust attack. You have to be careful. But such things can also be done for advertising purposes in general. It is now most frequently performed on the bsc network. For example, whenever I perform a transaction on the bsc network, I immediately notice that a random token is sent to my wallet. When I enter their contract, it is either sent for advertising purposes or it is sent for the purpose of advertising that site with a website link. As far as I understand, it may also be sent to you for advertising purposes.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "btc_angela",
      "created_time": "July 13, 2022, 11:05:04 PM",
      "body": "Yeah, just be careful though, maybe those who are sending you TRX might have a bad intention after-all.There has been some attack that some bad entity are sending malicious token to target their assetshttps://cointelegraph.com/news/more-than-4-7m-stolen-in-uniswap-fake-token-phishing-attackSo just ignored those, and yes, another reason could be that it is a dusting attack as well.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yamifoud",
      "created_time": "July 13, 2022, 11:35:28 PM",
      "body": "Upon reading this post, I'd check my wallet transaction but never it appears that I have received any from an unknown person. Maybe I was not a part of their list as the target for something we don't know as it is sure it was intentional. That could be worrying if you usually use this wallet for major transactions as you are wallet has been known to them and likely being monitored by this group. You gonna be careful or may change your wallet address if possible and let's see if they are still sending you some TRX.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blockman",
      "created_time": "July 13, 2022, 11:40:38 PM",
      "body": "Yeah, just another dust attack if not a reward if ever you've staked TRX. I've got an old trx address and it's receiving not TRX though but those tokens that are built in the trx network. And I think they're more dangerous because some of them will really make you curious and will make you visit their website. They're all worthless though but I've never received such exact TRX as what you've experienced OP.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GreatArkansas",
      "created_time": "July 14, 2022, 12:34:55 AM",
      "body": "I also experienced this even on my exchange account, because before I used my exchange account wallet on the TRX network I think it was USDT on the Tron network and sometimes I can receive TRX on my wallet.Also, they are advertisements, and yeah in my case, they maybe forgot to exclude exchange wallets. I'm just ignoring it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "antsam",
      "created_time": "July 14, 2022, 01:45:32 AM",
      "body": "Worth watching out for, because a lot like it was an attempt from Dusting Attack. It's better to secure funds from important coins of value at the wallet address to another new wallet so that it is more secure. Do not attempt to send or transact received coins",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "smartaction",
      "created_time": "July 14, 2022, 03:38:28 AM",
      "body": "Quote from: hugeblack on July 13, 2022, 07:11:19 PMAbout less than a month ago, my TRX wallet address randomly receives amounts smaller than one dollar, mostly (+0.000003 TRX - 0.000028TRX)? Does this happen to you? And what is the reason?I thought it was a dust attack, but the frequency of receiving random values is an indication of something abnormal It can be dust attack. But if you transfer any altcoin like USDT or anything else from your personal wallet in Trx Network then it is normal. Coz if you transfer altcoin by TRX network after transferred token Some TRX come back like your TRX amount. sometimes it come instantly and sometimes it take a little time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "D ltr",
      "created_time": "July 14, 2022, 04:31:48 AM",
      "body": "Quote from: serjent05 on July 13, 2022, 07:38:04 PMDid you set some of your TRX staking/voting?  It is possible that the TRX you received is a reward from it.  If not, it is possible that it is a dusting attack as said by ryzaadit.To anyone who doesn't know about dusting attack:QuoteA dusting attack refers to a relatively new kind of malicious activity where hackers and scammers try and break the privacy of Bitcoin and cryptocurrency users by sending tiny amounts of coins to their wallets. The transactional activity of these wallets is then tracked down by the attackers, who perform a combined analysis of different addresses to deanonymize the person or company behind each wallet.You can read a detailed explanation here: https://academy.binance.com/en/articles/what-is-a-dusting-attackemmm, if this dust is very dangerous for our wallets in the future, because I also get it in my personal wallet, and I also use my wallet for trade transactionsif its dangerous then i will leave this wallet",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ryzaadit",
      "created_time": "July 14, 2022, 02:08:11 PM",
      "body": "Quote from: GreatArkansas on July 14, 2022, 12:34:55 AM-snip-There is no specifiq target.The smart-contract has been set up for any kind of transaction, If you make a transaction then you will receive the dusting attack. And the dusting attack is not targeting any user, so can be happen in any platform, user, exchange, etc.Most of dusting attack is for scamming, spamming, and advertiser not really to be used for track fund and reveal privacy of the user.Quote from: D ltr on July 14, 2022, 04:31:48 AM-snip-Huh?For what you leave the wallet, you will always get the dusting attack everytime you doing transaction. Changing wallet is useless, If you get dusting attack token never connected or trade the token. If you get dusting attack for advertiser service, never click anything (most the time on the description hash transaction).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blue_hurricanger",
      "created_time": "July 14, 2022, 06:06:32 PM",
      "body": "Quote from: GreatArkansas on July 14, 2022, 12:34:55 AMI also experienced this even on my exchange account, because before I used my exchange account wallet on the TRX network I think it was USDT on the Tron network and sometimes I can receive TRX on my wallet.Also, they are advertisements, and yeah in my case, they maybe forgot to exclude exchange wallets. I'm just ignoring it.Since it was sent to your exchange wallet, you can convert those dust to other coins instead of leaving it like that. As long as your exchange account has 2FA and a good combination of words in the password, hackers can't do shit. If it was your personal wallet, I say you should send your main portfolio to a new clean address just to make sure.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "July 14, 2022, 06:21:02 PM",
      "body": "Quote from: smartaction on July 14, 2022, 03:38:28 AMIt can be dust attack. But if you transfer any altcoin like USDT or anything else from your personal wallet in Trx Network then it is normal. Coz if you transfer altcoin by TRX network after transferred token Some TRX come back like your TRX amount. sometimes it come instantly and sometimes it take a little time.No, I started receiving it about a month ago and I get several transfers daily, so far I haven't found a logical reason, it may be a dust attack, but what is the wisdom of repeating it? I thought that such an attack targets your privacy.Thanks for the answers above, but I did not subscribe to any staking, and only wrote my TRX/USDT address on OKX platform.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Morningstarr",
      "created_time": "July 14, 2022, 06:45:25 PM",
      "body": "Quote from: hugeblack on July 13, 2022, 07:11:19 PMAbout less than a month ago, my TRX wallet address randomly receives amounts smaller than one dollar, mostly (+0.000003 TRX - 0.000028TRX)? Does this happen to you? And what is the reason?I thought it was a dust attack, but the frequency of receiving random values is an indication of something abnormal I've heard that a lot of people say that tokens are coming into their wallets more or less, they were happy and tensed to wanted to know the reason While I was wondering what's the big deal, maybe someone sent it by mistake. It's good that something is coming into the wallet. But after reading the reply, I searched for Dust Attack and I realized how dangerous it is. Thankfully, I'm safe from it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "smartaction",
      "created_time": "July 15, 2022, 03:04:16 PM",
      "body": "Quote from: D ltr on July 14, 2022, 04:31:48 AMQuote from: serjent05 on July 13, 2022, 07:38:04 PMDid you set some of your TRX staking/voting?  It is possible that the TRX you received is a reward from it.  If not, it is possible that it is a dusting attack as said by ryzaadit.To anyone who doesn't know about dusting attack:QuoteA dusting attack refers to a relatively new kind of malicious activity where hackers and scammers try and break the privacy of Bitcoin and cryptocurrency users by sending tiny amounts of coins to their wallets. The transactional activity of these wallets is then tracked down by the attackers, who perform a combined analysis of different addresses to deanonymize the person or company behind each wallet.You can read a detailed explanation here: https://academy.binance.com/en/articles/what-is-a-dusting-attackemmm, if this dust is very dangerous for our wallets in the future, because I also get it in my personal wallet, and I also use my wallet for trade transactionsif its dangerous then i will leave this wallet It is normal mate. When you transcation for trading in TRX network then A gas fee is determined at the start of your transaction. But when the transaction is complete, some portion of the fixed fee amount is deducted. and the rest amount  returned to your wallet. This will happen every time you make a transaction. It happens to me all the time",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "iv4n",
      "created_time": "July 15, 2022, 04:25:29 PM",
      "body": "I also get some TRX from here and there... mostly from casino staking in the early days! But I have some tokens for that, like WIN, DICE, Rake... In the beginning, I was trying so many TRX DApps, mostly casinos as I said, but I was trying some other things as well! So I am getting some TRX from that I guess, everytime I open my TRX wallet my amount is little bigger!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "$crypto$",
      "created_time": "July 15, 2022, 05:11:30 PM",
      "body": "The last few months I also received random TRX with a very small amount but this time I was at the exchange address every time I sometimes deposited I also received this dime TRX, on Binance and Kucoin exchanges I also experienced the same thing but I always ignored it because I know this is like a dust attack but I'm pretty sure if this is an exchange address it is quite secure because it has quite tight security and is different from a personal wallet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "keyscore44",
      "created_time": "July 15, 2022, 05:53:05 PM",
      "body": "Seeing your experience on the forum, I find it hard to believe you would make such a mistake, but shyly I will suggest (ask) that you check the contract address. Maybe it is not a TRX, but just a copy created in a pattern, and in fact it is a dust attack, but in a smarter form.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "KaliLinux",
      "created_time": "July 15, 2022, 05:55:18 PM",
      "body": "Quote from: blockman on July 13, 2022, 11:40:38 PMYeah, just another dust attack if not a reward if ever you've staked TRX. I've got an old trx address and it's receiving not TRX though but those tokens that are built in the trx network. And I think they're more dangerous because some of them will really make you curious and will make you visit their website. They're all worthless though but I've never received such exact TRX as what you've experienced OP. Likewise me. I have never received any TRX dust that I did not collect by myself from staking TRX and the only tokens I have ever received in my Tron Wallet are those other tokens on the Tron network and all of them I really don't pay attention to and you can also make them not visible in your wallet if you want so that they are less distractive.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}