{
  "id": "topic_5448252",
  "title": "Mr. Magkaisa",
  "author": "Mr. Magkaisa",
  "created_time": "April 10, 2023, 11:58:47 AM",
  "content": "-   Good day to all the members here in the forum, this time I just want to talk about the word DYOR(do your own research) that is often read here in different sections of the forum. I want to detail how we should do it right so that we can choose the right projects that will appear in the field of cryptocurrency. Because I noticed that many people don't know how to do it, they just know DYOR is just that, but the application of it, they don't really know how to start or what is the first step to take. And this is what I'm going to share today,Things we should look at in crypto projects whether short term or long term projects.* WEBSITE       this is the first thing we will look at then we will go to the social media channels to find out the announcements, is the community active, and if we pass this primary information we will jump to the WHITEPAPER or we can also look at the REVIEWS of the projects on youtube channels or ARTICLES.And right here in this area we can decide if we will continue the research, because this is where we can identify the common red flags in crypto projects. And if we don't like something, we don't proceed. However, if everything passes for us, we will move on to the next step and this is,* PROJECT DESCRIPTION     Since we have read the whitepaper, we have been able to find reviews about the project and it seems okay, so we will put it here like;- Overview of the projects, How does it work?- what is the governance structure?- How does it create value if there is an architecture?This is where we will know if we really understand the project.Isn't one rule that we need to follow before we invest in anything else is that we need to understand it. And if we don't understand anything in this matter, probably, we haven't understood the project yet and we need to study it again.* INDUSTRY OVERVIEW     Here, it is important that we see the market or industry that the project operates in, such as:- Who are those direct and indirect competitors?- What are those metrics?- Is the industry moving a lot?This is what will be our measure, like for example the project we are researching is a DEX, now we will look at the category where we can use coinecko and coinmarketcap or Defillama to do this. Then, let's check the competitors who are the players who are performing.* VALUE PROPOSITION- What is the project bringing to the ecosystem? are the decentralized exchange but its user interface is better compared to others, it can be that.- What is the competitive advantage? something unique to the project that we can't see in others, like this decentralized exchange is the fast execution that can be compared to centralized exchanges. Reasons why people prefer to use it compared to others or why investors prefer to use it. So we should look for innovation and differentiation.- why should we use it?* BLOCKCHAIN- On which blockchain is it based?- Does it have a lot of TVL?- Large money inflows?Because if the tvl is low it means the demand of the project is low and it is more difficult to pump compared to projects with big tvl. And the tools we can use for this are cryptoflows.info* TEAM- Do they have crypto experience?- Who are they?- How many people are on the team?- How transparent is the team overall?- Are they anon?For doxed what we can use there is Linkedin or crypherhunter.com blockchain analytic also but the focus of the platform is to track the crypto projects, the company behind them and the product they are building.* ADVISERS OR PARTNERS- Who can guide them in their journey?- Are they any strategic Partnership?it also helps a lot in projects if they also have extensive experience in such projects. And normnally that is also indicated on their project website.* FUNDRAISING- Did they raise funds?- Which valuation?- Who are the investors?- Can they help the project grow?   It is important that a project has funds because there is no point without it. Normally projects share their fundraising activities.* FINANCIAL METRICS   here we can measure if a project has real users and adoptions.- What are the key financial key metrics (TVL, and Trading volume.- Is it growing?- Are their Users?- Is the protocol generating revenue?- What is the adoption?And the tools we can use here are the https://tokenterminal.com/terminal* ROADMAP- What is the roadmap of the project? because here we can see the commitment of a project if they have a clear roadmap. Normally, projects are in the whitepaper or website itself.- Is it realistic?* TOKENOMICS- What is the purpose of tokens?- What is the circulating supply?- Is it deflationary, inflationary or fixed?- Vesting and Cliff model?- What is the token utility?The tools we can use here are https://token.unlocks.app/ we can see here some details information about how many are locked in a project or daily unlock and many others.* PUMPAMENTALS- What is the reason for pumping a project?- What is the narrative around it? Is it entering the narrative market today?* COMMUNITY@MARKETING ANALYSIS- Do they have fake followers or engagement?- Who are the influencers interacting with the projects?- Is there a lot of activity around the project?- Is the community strong?If a project does not have a community, then there is no reason for us to invest in it because there is no demand. We can see on various social media channels whether it is strong or not.* RISK- What do we see as possible risk?- What are the weaknesses? Does the marketing seem weak?- Isn't the community that active? the Founders and etc. are unknown.Here we can measure how much we will put into it if we ever decide to invest. Also we should identify whether the project is short or long-term. It really depends on our strategy. So this research that you will do will strengthen you whether you will invest or not. Because DYOR is not easy but we need it, especially if the project we want has not been reviewed much, it's just a bit laborious but that's how researching crypto is, nothing is easy here.Have a good day",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5448252",
  "comments": [
    {
      "author": "BitcoinPanther",
      "created_time": "April 10, 2023, 12:13:51 PM",
      "body": "Nice long list of the aspects of the project we need to look for in checking the validity and effectiveness of the project.  I do agree with your list that the component is very important in verifying the hardworks, ability, and insight of the developers.  I would say that the priority to look for about a project is the member of its team and the credibility.  We have seen many blockchain project where they fake the achievement of their team to make them look capable but in reality those are just exaggerated achievement.Next is the roadmap, we need to identify if the project will realize or wishful thinking.  Many project in order to attract investors in terms of innovation create a road map that is impossble to happen or unrealistic.  Checking and evaluating the project according to the component listed can determine the level of risk we are facing if we invest on that project.  And we all know that the more skilled the developer is, and realistic the project can minimize the risk involve in the investment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "benalexis12",
      "created_time": "April 10, 2023, 04:09:19 PM",
      "body": "It's a good effort you made about sharing the steps on how to do the dyor because there are still many people in this forum who really don't know what to do like what you said on this topic.And I just found out about it now, because before all I knew was to read the whitepaper and the roadmap was the basis, even though what you gave was informative and detailed, at least we have some guides to follow little by little. Thanks op",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bettercrypto",
      "created_time": "April 11, 2023, 02:36:31 AM",
      "body": "Nice topic, what you said here is actually correct. Looking at the website, whitepaper and roadmap is not missing from doing your own research, these three are really important.       The only good thing about what you did is that you shed light on each step in doing your own research and in fairness I just found out the other details that you said here and that's a big thing for me I think and I don't know about others. Too bad I don't have any more smerit to give you. This is a very nice post you made,…",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Luffygroove",
      "created_time": "April 11, 2023, 03:24:27 AM",
      "body": "Wow, I'm impressed. Thank you for this valuable information. It's very thoughtful of you to share this kind of knowledge to make us better investors who can be responsible with our own decisions. If I may add, usually it would add my confidence to the project if they had a real product to offer first before doing some fund raising because it could show their passion and good intentions. Not many would do this gesture; it's kind of rare, and it's really appreciated if they do this because of so many history or scam projects that I've found before. I'm kind of tired of projects that only sell concepts and words. I will absolutely use these steps so my research process will be more organized. Thanks once again.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jossiel",
      "created_time": "April 11, 2023, 10:33:50 AM",
      "body": "Quote from: Mr. Magkaisa on April 10, 2023, 11:58:47 AM* WEBSITE* TEAM* ADVISERS OR PARTNERSIMHO, these are crucial factors.You can have the first glance if a project is good enough or scammy. Because having a good website is a big factor that will make investors see that these are professionals. This is just like being on the first step.And looking at the teams and partners, you can research them on different platforms and social networks if they're real people. Because the scammy ones are just copy pasta's with the name's and pictures.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "April 11, 2023, 11:49:54 AM",
      "body": "These are nice and correct reviewing the project. But to do an initial scanning, its not necessarily to over review it. For me browsing the website alone can help you identify many things. Focus on their development and check if they have some github or any open source record. Social value too, and team working on it. Sometimes by seeing the people behind it make us become confident that they are indeed a good project. Portfolio of those and some partners too.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "so98nn",
      "created_time": "April 11, 2023, 12:24:58 PM",
      "body": "Great topic buddy. Love the efforts you have taken to write all this. Definitely all the points are valid but always make sure that they are also manipulated by most of the project developers. What I mean is, you could study the entire project with the DYOR study as mentioned by you. We can have nice list on a paper and go through each of them. However, it may happen that what we are seeing may not be true. There had been projects in which team was real, we could access their LinkedIn profile, see their past experiences and everything. Soon it became evident that all those profiles were fake as flat earth!!You wouldn't believe they had so nice presentation of everything. They had good payments to anyone whose working for them, they created nice repo for themselves and soon one day eceryhting vanished just after the ICO sale was completed.Up to that insane level these guys can fake us..So yes, do the DYOR but do catch up validity until the time they list tokens on an exchanger. At least one can be sure about selling the coins in no profit no loss.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fvb",
      "created_time": "April 11, 2023, 01:30:52 PM",
      "body": "You are very thorough in your post. And they gave generally good arguments, many of which I use when studying a project or company. But sometimes I don’t really study the project and look only superficially. Maybe this is wrong, but my intuition basically does not fail, and more than a percentage of what projects I choose are more or less promising.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "isaac_clarke22",
      "created_time": "April 11, 2023, 01:53:15 PM",
      "body": "Quote from: Mr. Magkaisa on April 10, 2023, 11:58:47 AM~This really fits into that image of an iceberg meme if you would ask me. It would make at least a good illustration to what people really mean by DYOR. You're definitely spot on that website itself could already give away if the project is not worth investing to or purely a scam at the end. Back then I encountered a bland website from a project that was posting their ANN thread here. The first page of the ANN thread was already like swarming with people sensing something fishy.A website that has a really horrible spelling mistakes would already indicate that it is rushed out and unprofessional and it could give away projects even if it is a legitimate ones.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "moneystery",
      "created_time": "April 11, 2023, 02:01:49 PM",
      "body": "This is a great topic because people are often confused about where to start on their DWYOR. With this topic, people can have parameters, such as what they need to do on DWYOR, so that they can minimize errors and be more precise in taking action. Nice post.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bananington",
      "created_time": "April 11, 2023, 04:03:02 PM",
      "body": "This is really good, you have broken down the research steps and made it easier that someone can make a well researched decision about a project in a matter of minutes or few hours with these specific key points to consider about the project that you have listed. You have simplified the research process, and anyone who comes across this post should have no excuse why they did not research a project before investing in it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Xal0lex",
      "created_time": "April 11, 2023, 05:44:16 PM",
      "body": "By and large, you only need to know who the main investors are, how tokens will be distributed, what ratio tokens will be distributed to different categories of investors, for what period tokens will be blocked by the main investors and the team, how many tokens will be distributed to the community, and what the difference between the price for seed investors and public investors is. This information is enough to assess the investment appeal of a token.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MAAManda",
      "created_time": "April 11, 2023, 05:58:44 PM",
      "body": "Very cool, mate. There's not a single aspect that you forgot there. These days many crypto activists forget the fundamental things they should do to see the potential of a project they will invest in for financial security. BTW, from all the aspects you mentioned, the most crucial thing for me is industry overview, value proposition, team, advisor or partner and roadmap. And regarding TVL, not all projects in crypto are about DeFi, and I don't think the study of TVL can be generalized to DYOR for every project.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Silberman",
      "created_time": "April 11, 2023, 08:04:57 PM",
      "body": "Quote from: Bananington on April 11, 2023, 04:03:02 PMThis is really good, you have broken down the research steps and made it easier that someone can make a well researched decision about a project in a matter of minutes or few hours with these specific key points to consider about the project that you have listed. You have simplified the research process, and anyone who comes across this post should have no excuse why they did not research a project before investing in it. No one has any excuse about not doing their own due diligence whether they saw this post or not, and while the due diligence the OP is proposing is very deep, for what I can tell due to my experience the more difficult and time consuming and activity becomes the less people want to do it, then a simpler and faster due diligence which concentrated on the most important points to investigate will be better, as people will be more inclined to actually do it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "el kaka22",
      "created_time": "April 12, 2023, 03:02:00 PM",
      "body": "Team would tell you all you need to know. If the team is a known one that worked with other great projects before and got together, that is a team you may research more about and if their idea is good then you can continue to research.However, if the team is people that you haven't heard from before, or they do not have a CV filled with other crypto projects and this is the first time they are ever doing something in this field, then you should run away from it. I am not saying there is no possibility, but it is true that we have not seen too many people who never worked in any other project before and suddenly became better overnight. Hence, that's the first ever step and always should be, you can check the rest later.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "$crypto$",
      "created_time": "April 12, 2023, 03:13:07 PM",
      "body": "This is a good step for those who want to find a new project, so the criteria mentioned above can help you review the project you are looking for, of course this requires longer skills and is prepared for all risks later, if you are a beginner it is still difficult to find out this is why don't ever do it basically with a new project it will get you stuck if you just choose a project.Sometimes for those who already know in project research and have confirmed that it is good but do not rule out the possibility that it will also end in fraud because many factors have occurred in several projects that are trusted but in the end they leave.One thing for beginners is simply to choose a coin that is already on the exchange with a large market cap.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Silberman",
      "created_time": "April 14, 2023, 10:16:19 PM",
      "body": "Quote from: el kaka22 on April 12, 2023, 03:02:00 PMTeam would tell you all you need to know. If the team is a known one that worked with other great projects before and got together, that is a team you may research more about and if their idea is good then you can continue to research.However, if the team is people that you haven't heard from before, or they do not have a CV filled with other crypto projects and this is the first time they are ever doing something in this field, then you should run away from it. I am not saying there is no possibility, but it is true that we have not seen too many people who never worked in any other project before and suddenly became better overnight. Hence, that's the first ever step and always should be, you can check the rest later.Another point to take into account is if the developers try to silence any dissenting voices or those which ask difficult questions, this is very common in platforms like telegram in which they can kick you out of their groups, this way they have complete control of the information their investors hear and see and this makes way easier for those people to scam more people, so whenever someone is able to perceive that behavior coming from the developers of a project they need to stay away from it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "abel1337",
      "created_time": "April 14, 2023, 10:39:21 PM",
      "body": "Quote from: Silberman on April 14, 2023, 10:16:19 PMQuote from: el kaka22 on April 12, 2023, 03:02:00 PMTeam would tell you all you need to know. If the team is a known one that worked with other great projects before and got together, that is a team you may research more about and if their idea is good then you can continue to research.However, if the team is people that you haven't heard from before, or they do not have a CV filled with other crypto projects and this is the first time they are ever doing something in this field, then you should run away from it. I am not saying there is no possibility, but it is true that we have not seen too many people who never worked in any other project before and suddenly became better overnight. Hence, that's the first ever step and always should be, you can check the rest later.Another point to take into account is if the developers try to silence any dissenting voices or those which ask difficult questions, this is very common in platforms like telegram in which they can kick you out of their groups, this way they have complete control of the information their investors hear and see and this makes way easier for those people to scam more people, so whenever someone is able to perceive that behavior coming from the developers of a project they need to stay away from it.Oh yes! This is very common happening on projects that want to hide something that can potentially make their token goes down in value. They can just tell us that they are just avoiding FUDS if they are in the tight spot of many people questioning about their doings. This kind of behaviour is a red flag for me. Thinking that they can silent people by kicking them out on their main channels, they just don't know that there are several platforms that can discuss about them like in this forum. This is why ANN thread is important, We all can talk freely about it with the freedom of posting logical things about the project.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Quidat",
      "created_time": "April 14, 2023, 11:28:33 PM",
      "body": "Quote from: benalexis12 on April 10, 2023, 04:09:19 PMIt's a good effort you made about sharing the steps on how to do the dyor because there are still many people in this forum who really don't know what to do like what you said on this topic.And I just found out about it now, because before all I knew was to read the whitepaper and the roadmap was the basis, even though what you gave was informative and detailed, at least we have some guides to follow little by little. Thanks op People usually newbies would really be having that kind of behavior on which they would really be just directly making out some investment without doing proper research or simply they would really be just following on what others been doing which is really very wrong.You are really that susceptible on being scammed or ending up on investing on a project which is neither a rug pull scam or would really be just investing on a shit coin.This is why you would really be ending up on bagging some shitcoins which is something that we do really need to avoid as much as we could.You would be able to realize things on the time that you would experience some losses due to bad decisioning.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}