{
  "id": "topic_5464856",
  "title": "safar1980",
  "author": "safar1980",
  "created_time": "August 28, 2023, 03:24:25 PMLast edit: August 29, 2023, 01:26:50 PM by safar1980",
  "content": "Регулятор Великобритании: крипто компании будут соответствовать Travel Rule начиная с 1 сентября.Регулятор индустрии финансовых услуг Соединенного Королевства, Управление финансового поведения ( FCA ), заявил, что крипто-фирмы, базирующиеся в стране, вскоре должны будут придерживаться так называемого Travel Rule или правило контроля переводов. По словам регулятора, крипто-фирмы должны начать соблюдать это правило с 1 сентября 2023 года.https://news.bitcoin.com/uk-regulator-crypto-asset-businesses-expected-to-comply-with-the-travel-rule-starting-in-september/Список стран-членов FATF:АвстралияАвстрияАргентинаБельгияБразилияВеликобританияГерманияГолландияГрецияДанияЕгипетИндияИрландияИспанияИталияКанадаКипрКитайЛюксембургМалайзияМексикаНорвегияНовая ЗеландияПольшаПортугалияРоссияСаудовская АравияСингапурСоединенные Штаты АмерикиТаиландТурцияФинляндияФранцияШвейцарияШвецияЮжная КореяЯпонияhttps://worldpopulationreview.com/country-rankings/fatf-countriesИ че?Пока эти нормы начинают работать в Англии, а по закону эти нормы должны поддерживать все страны из списка членов. Проблемы с транзакциями с бирж криптовалют суммой более 1000 долларов будут в будущем актуальны для всех, потомучтоо биржа должна знать отправителя и получателя.Binance , ведущая криптовалютная биржа по объему торгов и блокчейн-экосистема, сегодня анонсировала партнерство с Shyft Network для реализации децентрализованной инфраструктуры и соответствию \"Travel Rule\" Группы разработки финансовых мер борьбы с отмыванием денег (FATF).",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5464856",
  "comments": [
    {
      "author": "light_warrior",
      "created_time": "August 28, 2023, 06:29:57 PM",
      "body": "Quote from: safar1980 on August 28, 2023, 03:24:25 PMтак называемого Travel Rule или правила путешествий. Какое еще правило путешествий? Travel Rule это Правило контроля переводов. И оно не так называемое, а совершенно официальное название от FATF.  Это правило требует обмениваться данными отправителя и получателя бабла свыше какого то определенного порога. А пошла эта мулька из штатов.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Smartprofit",
      "created_time": "August 28, 2023, 07:31:36 PM",
      "body": "А как будет считаться этот лимит в 1.000 долларов США? Будет требование по раскрытию информации в отношении одной конкретной транзакции суммой более 1.000 долларов США? Или все годовые транзакции между двумя контрагентами будут приравниваться к одной транзакции? И в отношении такой расчётный транзакции будет действовать лимит в 1.000 долларов США?В любом случае, для обхода этих ограничений нужно дробить транзакции на более мелкие суммы. А во втором варианте нужно ещё постоянно менять сторон сделок (что для бизнеса будет невероятно затратным).Да, конечно видно что регуляторы усложняют жизнь криптовалютным компаниям. Буквально душат их в бюрократических объятиях. Конечно всегда можно найти способ обойти ограничения, но это дополнительные затраты, а для бизнеса увеличения затрат - это всегда уменьшение прибыли.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "safar1980",
      "created_time": "August 29, 2023, 01:28:26 PM",
      "body": "light_warrior, спасиб.Quote from: Smartprofit on August 28, 2023, 07:31:36 PMА как будет считаться этот лимит в 1.000 долларов США? Будет требование по раскрытию информации в отношении одной конкретной транзакции суммой более 1.000 долларов США? Или все годовые транзакции между двумя контрагентами будут приравниваться к одной транзакции? И в отношении такой расчётный транзакции будет действовать лимит в 1.000 долларов США?В любом случае, для обхода этих ограничений нужно дробить транзакции на более мелкие суммы. А во втором варианте нужно ещё постоянно менять сторон сделок (что для бизнеса будет невероятно затратным).Да, конечно видно что регуляторы усложняют жизнь криптовалютным компаниям. Буквально душат их в бюрократических объятиях. Конечно всегда можно найти способ обойти ограничения, но это дополнительные затраты, а для бизнеса увеличения затрат - это всегда уменьшение прибыли. Да скоро переводс биржи на непонятный неизвестный адрес может считаться финансированием преступлений, а вы спрашивайте про годовые транзакции.я неправильно перевел на русский определение, но вы правильно поняли что переводы с бирж будут контролироваться сравнимо банковским, где Travel Rule используется успешно давно. потому много бирж требует КИС заранее.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}