{
  "id": "topic_5412410",
  "title": "drac970815",
  "author": "drac970815",
  "created_time": "September 05, 2022, 06:38:42 AM",
  "content": "Hello all, I'm just new here. I recently found this token called CHZ while I was browsing in CMC. As I can see this is related to sports and I found that they are currently had 100+ partners from different sports worldwide. Mostly they have soccer(football) partners. I saw a Twitter post also that they're scheduled 2.0 for mainnet later this year also. But I didn't find yet any user case for chiliz.So I would really appreciate it to have some advice from senior members about this project. Because the FIFA world cup coming later in November. So can we expect price movement from chiliz? because there most partners are from soccer.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5412410",
  "comments": [
    {
      "author": "hd49728",
      "created_time": "September 05, 2022, 03:00:07 PM",
      "body": "CHZ is good for investment if you can hold it long enough. Because fan tokens are parts of Chiliz products and if clubs, sports are here, not disappear, fan tokens will be here too.Fan fokens have good potential for adoption and growth too. If fan tokens can achieve good things, Chiliz CHZ will get benefit and would be a very good investment.Especially we will have a World Cup in late of this year and you can enoy the event and a rise of CHZ this year. But I have a bigger vision for CHZ as described above.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ever-young",
      "created_time": "September 05, 2022, 05:34:54 PM",
      "body": "I have traded chz and I have made profits from it, thou am not currently holding any but I think it's good for investment, it's am exchange for fan tokens, and the project has been holding on for long.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MAAManda",
      "created_time": "September 05, 2022, 05:58:43 PM",
      "body": "Quote from: drac970815 on September 05, 2022, 06:38:42 AMHello all, I'm just new here. I recently found this token called CHZ while I was browsing in CMC. As I can see this is related to sports and I found that they are currently had 100+ partners from different sports worldwide. Mostly they have soccer(football) partners. I saw a Twitter post also that they're scheduled 2.0 for mainnet later this year also. But I didn't find yet any user case for chiliz.So I would really appreciate it to have some advice from senior members about this project. Because the FIFA world cup coming later in November. So can we expect price movement from chiliz? because there most partners are from soccer. What you're saying is true that to date $CHZ doesn't have a real use-case that could push the price even higher. However, it looks like we will not see this condition for much longer. They will create their own network and currently in development stage, Habanero (the name in their development stage) will launch this Q3 - Q4. Many things will be possible later in their network, not much different from other mainstream networks. Their use-cases are as follows: DeFi, NFTs, Metaverse, P2E Games, Event Ticketing, Loyalty Programs and Merchandise CertificationYou can monitor the progress of Testnet from their network on their official page here: https://www.chiliz.com/en/chain/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kocret02",
      "created_time": "September 05, 2022, 06:01:31 PM",
      "body": "Quote from: drac970815 on September 05, 2022, 06:38:42 AMHello all, I'm just new here. I recently found this token called CHZ while I was browsing in CMC. As I can see this is related to sports and I found that they are currently had 100+ partners from different sports worldwide. Mostly they have soccer(football) partners. I saw a Twitter post also that they're scheduled 2.0 for mainnet later this year also. But I didn't find yet any user case for chiliz.So I would really appreciate it to have some advice from senior members about this project. Because the FIFA world cup coming later in November. So can we expect price movement from chiliz? because there most partners are from soccer. It is undeniable that football fans are the most in the world.they are very fanatical and always support and follow every game event of their favorite club.Built on Chiliz blockchain infrastructure & using $CHZ as the exclusive currency on the platform. The token helps fans and merchants to buy voting rights and mark influence shares.$CHZ is a decentralized cryptographic utility token based on the Ethereum protocol (ERC20 token) designed for direct utility within the Socios.com Platform.Various clubs have joined the platform, such as Paris Saint-German, FC Barcelona, ​​Manchester City and AC Milan. Many more await in the future, which will make Chiliz a favorite football fan token.I think Chiliz crypto is perfect for the crypto market and is profitable where long term investment is desired.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blockman",
      "created_time": "September 05, 2022, 06:07:08 PM",
      "body": "IMHO, it's a good investment. It's more focused on making fan tokens and not just fan tokens but fan tokens for certain popular sports teams.It's actually good that you've made your own research already and you seem to have more knowledge before you asked.So, if you ever decided to invest on it, it's not that you've relied on the opinion of others but you have already made your research before doing so.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "romero121",
      "created_time": "September 05, 2022, 11:17:23 PM",
      "body": "It is also a good decision to make the investment before the days of FIFA, as the project is connected to sports. Weeks back when there is no big movement in the market, few fan tokens made a good bump in the market. This is termed to be manipulative, and not all fan tokens are good. Investment on Chiliz is really good, and an eye over the market movement will help in booking the profit at the right time than missing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "drac970815",
      "created_time": "September 06, 2022, 02:36:20 AM",
      "body": "Quote from: MAAManda on September 05, 2022, 05:58:43 PMQuote from: drac970815 on September 05, 2022, 06:38:42 AMHello all, I'm just new here. I recently found this token called CHZ while I was browsing in CMC. As I can see this is related to sports and I found that they are currently had 100+ partners from different sports worldwide. Mostly they have soccer(football) partners. I saw a Twitter post also that they're scheduled 2.0 for mainnet later this year also. But I didn't find yet any user case for chiliz.So I would really appreciate it to have some advice from senior members about this project. Because the FIFA world cup coming later in November. So can we expect price movement from chiliz? because there most partners are from soccer. What you're saying is true that to date $CHZ doesn't have a real use-case that could push the price even higher. However, it looks like we will not see this condition for much longer. They will create their own network and currently in development stage, Habanero (the name in their development stage) will launch this Q3 - Q4. Many things will be possible later in their network, not much different from other mainstream networks. Their use-cases are as follows: DeFi, NFTs, Metaverse, P2E Games, Event Ticketing, Loyalty Programs and Merchandise CertificationYou can monitor the progress of Testnet from their network on their official page here: https://www.chiliz.com/en/chain/Thanks for the update sir",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JohnBitCo",
      "created_time": "September 06, 2022, 02:51:57 AM",
      "body": "Quote from: drac970815 on September 05, 2022, 06:38:42 AMHello all, I'm just new here. I recently found this token called CHZ while I was browsing in CMC. As I can see this is related to sports and I found that they are currently had 100+ partners from different sports worldwide. Mostly they have soccer(football) partners. I saw a Twitter post also that they're scheduled 2.0 for mainnet later this year also. But I didn't find yet any user case for chiliz.So I would really appreciate it to have some advice from senior members about this project. Because the FIFA world cup coming later in November. So can we expect price movement from chiliz? because there most partners are from soccer. Chiliz token is at number 42 at coinmarketcap. Currently, i do not see any use case for this token but if the sports club decides to use Chiliz token for different services, then it can quickly gain the hype. The price of CHZ is $0.206 which can be a good investment for the future, however, buy only a certain portion of CHZ and make sure you have a diversified portfolio.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yhiaali3",
      "created_time": "September 06, 2022, 02:58:51 AM",
      "body": "CHZ is already a token related to sports clubs, they have a blockchain and a wonderful project that achieved tremendous success in the last period, the price of the token has increased by a few hundred times and achieved a good rank in the market with a very high volume, there is constant development on the project and it has a good work team so I expect them more of success and growth in the future.For the World Cup, of course I expect there will be a lot of buying on CHZ since it's all about the sport and it has a lot of sporting partners.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ahmia39",
      "created_time": "September 06, 2022, 08:57:26 AM",
      "body": "Is Chiliz still a good investment?Possible. While 2019 and 2020 have been pretty quiet regarding token prices, Chiliz has seen an uptrend last. Sports exchange CHZ's native token had projected a nearly 100% rally last October and is still showing some promise for years to come.Therefore, before making any investment, do your research, investing in cryptocurrencies is very risky and speculative.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "$anounimus$",
      "created_time": "September 06, 2022, 09:18:52 AM",
      "body": "Chiliz (CHZ ) is a good long-term investment as the project has good potential but personally, I don't see any big moves until the project will be listed on the top market exchanges.Regarding your question regarding the future price movement of the Chiliz platform and the CHZ token, it looks like they are still in the early stages. Prize money allocation and dividend distribution will not be a priority before the third quarter. Before that, they will focus on a few key developments in the platform that will improve usability and the overall experience for sports fans, supporters, and those with a passion for sports.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "drac970815",
      "created_time": "September 06, 2022, 04:53:48 PM",
      "body": "Quote from: yhiaali3 on September 06, 2022, 02:58:51 AMCHZ is already a token related to sports clubs, they have a blockchain and a wonderful project that achieved tremendous success in the last period, the price of the token has increased by a few hundred times and achieved a good rank in the market with a very high volume, there is constant development on the project and it has a good work team so I expect them more of success and growth in the future.For the World Cup, of course I expect there will be a lot of buying on CHZ since it's all about the sport and it has a lot of sporting partners.yeah, that's what I thought also, there will be a temporary short pump when fifa world cup start may be. Maybe I will be wrong but who knows, cuz anything can happen in crypto",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "topman21",
      "created_time": "September 06, 2022, 04:57:49 PM",
      "body": "CHZ project is a very good currency for long time investment.I have analyzed the trial in various ways and found it to be a long term investment But if you are more in doubt, you can know more.I have analyzed its future and in various ways it can definitely be invested for a long time. There will be no problem for long time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}