{
  "id": "topic_5464822",
  "title": "bonfire66",
  "author": "bonfire66",
  "created_time": "August 28, 2023, 10:33:29 AM",
  "content": "Как бы распространено тупое изречение. «Не в деньгах счастье». Мне кажется, что это все твердят ТОЛЬКО те, кто никогда в этой жизни достаточно не зарабатывали и не будут зарабатывать денег. Просто для того, чтобы оправдать собственную никчемность перед своей семьей и другими людьми.   Да, абсолютное счастье за деньги купить трудно. Но если денег нет, то шансов нет 100%.  Потому что примерно 98% реальных проблем в этой жизни можно решить за деньги. Я очень хорошо про это знаю, ибо я знаю как весьма успешных людей, так и тех, кто торчит в полной жопе. А сам я как бы нахожусь в пограничной зоне. Поэтому все что я тут буду писать ниже – истинная правда из личного опыта!   Итак, почти все, то есть 98% проблем можно либо решить за деньги, либо существенно облегчить способ их решения. Допустим, хотите вы отдохнуть на Сейшелах. Что делает обычный человек – ищет дешевые билеты в Крым или Сочи. Что делает Успешный человек – поручает своему референту  организовать поиск оптимального тура на Сейшелы (если что – я там пока еще не был, но подумываю...).    Да, пока ты молод и полон сил, и мозги, еще не отягощенные чрезмерным потреблением алкоголя, еще работают – несложно все сделать и организовать лично самому. Но по прошествии лет приходит мудрость, деньги, и понимание того, что лучше всего весь мелкий текущий гимор поручать проверенным надежным людям. Которые и билеты купят, и такси подгонят, и разбудят, и отель забронируют.    Если что – у меня таких помощников нет. Не вышел статусом. Но зато, у меня есть друзья, которые берутся все организовать и оформить. А мне только и остается, как платить в нужный момент бабло. И поддерживать их своим присутствием. Ибо друзья – это и есть то самое ценное, что может быть в этом мире. Берегите и любите друзей! Ведь если у вас много денег - то у вас будет много друзей. А если денег будет мало - то нафиг вы никому не нужны!",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5464822",
  "comments": [
    {
      "author": "TopTort777",
      "created_time": "September 04, 2023, 11:51:17 AM",
      "body": "Если у тебя есть друзья, которые за бабки решают проблемы, то почему ты никак не порешаешь вопросик с челом, которые тебе бабки должен? У него с твоих слов денег полно, какие-то объекты,  шашлык и вискарик. Отстегни им процент и пусть они порешают с ним вопрос. Или у того чела решалы по круче твоих будут?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Julien_Olynpic",
      "created_time": "September 06, 2023, 06:56:27 AM",
      "body": "Quote from: TopTort777 on September 04, 2023, 11:51:17 AMЕсли у тебя есть друзья, которые за бабки решают проблемы, то почему ты никак не порешаешь вопросик с челом, которые тебе бабки должен? У него с твоих слов денег полно, какие-то объекты,  шашлык и вискарик. Отстегни им процент и пусть они порешают с ним вопрос. Или у того чела решалы по круче твоих будут?  У него и так бабок много, девать некуда). Поэтому он о  скуки и посвящает свой досуг форуму Биткойнтолк. Кстати, у нас многие посещение форума именно так позиционируют. Типа, я устал от денег, разжирел и решил от скуки потриндеть в локали.  Хотя у Бонфайра в этот раз топик какой-то многозначительный, там много чего намешано, даже лень разбираться в этом. Конечно, деньги решают, с ними и в лесу хорошо. Особенно неплохо с ними в старости. Соцработника нанять, охрану там, чтобы из твоего сейфа приватники не вытащили. Пусть они и на зашифрованной флешке, но мало ли...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TopTort777",
      "created_time": "September 06, 2023, 01:59:18 PM",
      "body": "Quote from: Julien_Olynpic on September 06, 2023, 06:56:27 AMQuote from: TopTort777 on September 04, 2023, 11:51:17 AMЕсли у тебя есть друзья, которые за бабки решают проблемы, то почему ты никак не порешаешь вопросик с челом, которые тебе бабки должен? У него с твоих слов денег полно, какие-то объекты,  шашлык и вискарик. Отстегни им процент и пусть они порешают с ним вопрос. Или у того чела решалы по круче твоих будут?  У него и так бабок много, девать некуда). Поэтому он о  скуки и посвящает свой досуг форуму Биткойнтолк. Кстати, у нас многие посещение форума именно так позиционируют. Типа, я устал от денег, разжирел и решил от скуки потриндеть в локали.  Хотя у Бонфайра в этот раз топик какой-то многозначительный, там много чего намешано, даже лень разбираться в этом. Конечно, деньги решают, с ними и в лесу хорошо. Особенно неплохо с ними в старости. Соцработника нанять, охрану там, чтобы из твоего сейфа приватники не вытащили. Пусть они и на зашифрованной флешке, но мало ли...Какой сейф? Какой приватник и флешка? Он бинанс с мобильником подружить не может? Он дядька уже в годах, но какой-то бесхребетный. То с женой-дочкой-другом порешать не может ничего. То ютубом и видосиками не может ничего добиться уже 2 года. Я его подталкиваю чуть-чуть в жизни быть активнее чуть-чуть. А он все ленится. Так вся жизнь и пробежит, набирая не решенные задачи. Вроде голова есть, руки ноги тоже. Знает и ни раз говорили что делать. Но все равно то на месте топчется, то идет по стандартной дороге.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Excimer",
      "created_time": "September 06, 2023, 03:00:23 PM",
      "body": "Quote from: TopTort777 on September 06, 2023, 01:59:18 PMОн дядька уже в годах, но какой-то бесхребетный. .... То ютубом и видосиками не может ничего добиться уже 2 года. Я его подталкиваю чуть-чуть в жизни быть активнее чуть-чуть. А он все ленится. Так вся жизнь и пробежит, набирая не решенные задачи. Вроде голова есть, руки ноги тоже. Знает и ни раз говорили что делать. Но все равно то на месте топчется, то идет по стандартной дороге. Надо забанить bonfire66. Сразу время найдется для монтажа видосиков с пичужками. Глядишь и в топы ютуба попадетДавайте поможем bonfire66? Забаньте его. А то чел страдает",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GearBrillsGB",
      "created_time": "September 13, 2023, 07:53:07 AM",
      "body": "Соглашусь с автором. Деньги правят миром и нами - тем более нынешним, это надо принять и не строить иллюзий диснеевских. Нет денег - тяжко что-либо делать, есть деньги - все пути открыты.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "xandry",
      "created_time": "September 13, 2023, 03:03:30 PM",
      "body": "bonfire66 куда пропал? Не уж то твои бабы все деньги из тебя уже высосали, что аж за VPN заплатить не можешь?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TopTort777",
      "created_time": "September 14, 2023, 12:06:24 PM",
      "body": "Quote from: xandry on September 13, 2023, 03:03:30 PMbonfire66 куда пропал? Не уж то твои бабы все деньги из тебя уже высосали, что аж за VPN заплатить не можешь?Кстати да, пропал наш приятель куда-то  Его не могли забанить на форуме? Потому что ролики про голубятню выходят регулярно. Судя по недавнему ролику, он в Турции. Турция вроде форум не банила.Могу предположить, что его супер друг, владелец ангаров/недвижки/ларьков/площадей/потребитель дорого вискарика и стейков, все же вернул одолженные бабки и наш бонфайр66 загулял.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "borderlander",
      "created_time": "September 27, 2023, 07:40:13 AM",
      "body": "Quote from: xandry on September 13, 2023, 03:03:30 PMbonfire66 куда пропал? Не уж то твои бабы все деньги из тебя уже высосали, что аж за VPN заплатить не можешь?Да вроде тут он",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}