{
  "id": "topic_5454392",
  "title": "malizec",
  "author": "malizec",
  "created_time": "May 29, 2023, 12:47:30 PM",
  "content": "I received three ordinal inscriptions in my bitcoin core wallet. First, I created a new wallet and created three bech32 segwit addresses. Each address received one ordinal inscription. Now I’d like to send them out to a new wallet but have no idea how. I tried to send one but since I didn’t think the fees would be enough I used two utxo for inputs and now I am afraid the ordinals utxo was used for fees instead the address with spare btc for fees. https://ibb.co/jTYpxZFHere’s the transaction , is my ordinal stil somewhere in my posession or was it used for fees? https://mempool.space/tx/c9a81d5818110f3bdc73d49f78c8fe6c0ce27de2ca35551563a248c89905812eSo , how do I properly send out an ordinal from bitcoin core. I also tried connecting sparrow wallet to do this but again I didn’t  have enough btc for fees in these ordinal utxos, or when I tried to sign the transaction using fees from another address, it asks me to connect hardware wallet which I don’t even have. Is there a way to export wif private keys in bitcoin core for taproot wallet, so I can export these wallets directly to something that is ordinal friendly like ordinalswallet.  All I was able to find was something called descriptors.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5454392",
  "comments": [
    {
      "author": "LoyceV",
      "created_time": "May 29, 2023, 01:01:02 PM",
      "body": "Quote from: malizec on May 29, 2023, 12:47:30 PMI received three ordinal inscriptions in my bitcoin core wallet.Since you posted this in Bitcoin Technical Support, you're going to get a Bitcoin based answer: there are no \"ordinal inscriptions\" in Bitcoin Core. If you have received Bitcoin, you can send Bitcoin.Allow me to quote myself:Quote from: LoyceV on May 03, 2023, 07:52:21 AMI've been wondering for a while what would be next after altcoins, ICOs, Forkcoins, DeFi and NFTs. I guess the next pyramid scheme is making up BS on the Bitcoin blockchain. As usual, a few people will get very rich out of this, and many people will lose money. All I can do is warn against it.Do people not understand they need some centralized service to \"use\" their made-up tokens, which goes against everything Bitcoin stands for? So, when they think they have this, in reality they have only Bitcoin dust!Quote from: malizec on May 29, 2023, 12:47:30 PMSo , how do I properly send out an ordinal from bitcoin core.If someone told you the Bitcoin dust in your wallet is \"special\", it's likely you fell for a (ponzi) scam.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "malizec",
      "created_time": "May 29, 2023, 05:40:01 PM",
      "body": "Quote from: LoyceV on May 29, 2023, 01:01:02 PMQuote from: malizec on May 29, 2023, 12:47:30 PMI received three ordinal inscriptions in my bitcoin core wallet.Since you posted this in Bitcoin Technical Support, you're going to get a Bitcoin based answer: there are no \"ordinal inscriptions\" in Bitcoin Core. If you have received Bitcoin, you can send Bitcoin.Allow me to quote myself:Quote from: LoyceV on May 03, 2023, 07:52:21 AMI've been wondering for a while what would be next after altcoins, ICOs, Forkcoins, DeFi and NFTs. I guess the next pyramid scheme is making up BS on the Bitcoin blockchain. As usual, a few people will get very rich out of this, and many people will lose money. All I can do is warn against it.Do people not understand they need some centralized service to \"use\" their made-up tokens, which goes against everything Bitcoin stands for? So, when they think they have this, in reality they have only Bitcoin dust!Quote from: malizec on May 29, 2023, 12:47:30 PMSo , how do I properly send out an ordinal from bitcoin core.If someone told you the Bitcoin dust in your wallet is \"special\", it's likely you fell for a (ponzi) scam.If I wanted your opinon on ponzi scams, I'd ask for that. I wanted to know how do I transfer an utxo with ordinal inscription from bitcoin core to ordinals wallet, if possible using available balance in my wallet, si the ordinal is not used as fee.How do I get a wif key from bech32 address in bitcoin core, or a private key, so I could import this address in another client. Dumpprivkey doesn't work for becuase it's not a legacy wallet, I can do dumpwallet and get something called a descriptor, how do I decode wif key from that if possible.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackHatCoiner",
      "created_time": "May 29, 2023, 07:53:54 PM",
      "body": "Quote from: malizec on May 29, 2023, 05:40:01 PMI wanted to know how do I transfer an utxo with ordinal inscription from bitcoin core to ordinals walletAnd LoyceV told you that no Bitcoin client in our knowledge understands Ordinal syntax. Your question simply makes no sense in this board. The Bitcoin technical support exists solely for widely accepted Bitcoin clients, such as Bitcoin Core (pretty much only that, according to this). Quote from: malizec on May 29, 2023, 05:40:01 PMHow do I get a wif key from bech32 address in bitcoin core, or a private key, so I could import this address in another client.To get a private key in WIF, you can enter dumpprivkey <your_bech32_address> in the Bitcoin Core console (either using bitcoin-qt or bitcoin-cli). Again, this is importable in widely accepted, and standard clients. If you're planning on importing somewhere else, make sure you know what you're doing, because this is hard cash.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nc50lc",
      "created_time": "May 30, 2023, 05:00:35 AM",
      "body": "Quote from: malizec on May 29, 2023, 05:40:01 PMDumpprivkey doesn't work for becuase it's not a legacy wallet, I can do dumpwallet and get something called a descriptor, how do I decode wif key from that if possible.   Use listdescriptors true command, find the proper descriptor for your addresses and find a way to import the descriptor to Sparrow.Since it's all TapRoot, it must be your \"tr\" descriptor that isn't 'internal' since that's for your change addresses.For example, you're looking for:Code:\"desc\": \"tr(xprv.../86'/0'/0'/0/*)#nnnnnnnn\",-snip-\"internal\": false,You can also use iancoleman's BIP39 tool to extract the private key based from the \"master private key\" (xprv) and derivation path included in the descriptor.After exporting that from Bitcoin Core, it's altcoin territory and you might need to create a new topic in Altcoin Boards on how to spend it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "malizec",
      "created_time": "May 30, 2023, 05:59:49 AM",
      "body": "Quote from: nc50lc on May 30, 2023, 05:00:35 AMQuote from: malizec on May 29, 2023, 05:40:01 PMDumpprivkey doesn't work for becuase it's not a legacy wallet, I can do dumpwallet and get something called a descriptor, how do I decode wif key from that if possible.   Use listdescriptors true command, find the proper descriptor for your addresses and find a way to import the descriptor to Sparrow.Since it's all TapRoot, it must be your \"tr\" descriptor that isn't 'internal' since that's for your change addresses.For example, you're looking for:Code:\"desc\": \"tr(xprv.../86'/0'/0'/0/*)#nnnnnnnn\",-snip-\"internal\": false,You can also use iancoleman's BIP39 tool to extract the private key based from the \"master private key\" (xprv) and derivation path included in the descriptor.After exporting that from Bitcoin Core, it's altcoin territory and you might need to create a new topic in Altcoin Boards on how to spend it.Thank you, I'll try that",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nc50lc",
      "created_time": "May 31, 2023, 04:05:48 AM",
      "body": "Quote from: ETFbitcoin on May 30, 2023, 10:08:46 AMQuote from: nc50lc on May 30, 2023, 05:00:35 AMYou can also use iancoleman's BIP39 tool to extract the private key based from the \"master private key\" (xprv) and derivation path included in the descriptor.It seems iancoleman's BIP39 tool was last updated on 2021[1] and there's no support for BIP 86 which about deriving key P2TR. Have you tried extracting private key from P2TR address with this tool?He just need the private key(s) derived from the xprv with the correct derivation path.He don't necessarily have to derive the correct addresses with the tool,just have to type the correct path m/86'/0'/0'/0 in \"BIP32\" tab and the private key list below should correspond to his TapRoot receiving addresses.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bettercrypto",
      "created_time": "May 31, 2023, 12:01:09 PM",
      "body": "Quote from: malizec on May 29, 2023, 05:40:01 PMQuote from: LoyceV on May 29, 2023, 01:01:02 PMQuote from: malizec on May 29, 2023, 12:47:30 PMI received three ordinal inscriptions in my bitcoin core wallet.Since you posted this in Bitcoin Technical Support, you're going to get a Bitcoin based answer: there are no \"ordinal inscriptions\" in Bitcoin Core. If you have received Bitcoin, you can send Bitcoin.Allow me to quote myself:Quote from: LoyceV on May 03, 2023, 07:52:21 AMI've been wondering for a while what would be next after altcoins, ICOs, Forkcoins, DeFi and NFTs. I guess the next pyramid scheme is making up BS on the Bitcoin blockchain. As usual, a few people will get very rich out of this, and many people will lose money. All I can do is warn against it.Do people not understand they need some centralized service to \"use\" their made-up tokens, which goes against everything Bitcoin stands for? So, when they think they have this, in reality they have only Bitcoin dust!Quote from: malizec on May 29, 2023, 12:47:30 PMSo , how do I properly send out an ordinal from bitcoin core.If someone told you the Bitcoin dust in your wallet is \"special\", it's likely you fell for a (ponzi) scam.If I wanted your opinon on ponzi scams, I'd ask for that. I wanted to know how do I transfer an utxo with ordinal inscription from bitcoin core to ordinals wallet, if possible using available balance in my wallet, si the ordinal is not used as fee.How do I get a wif key from bech32 address in bitcoin core, or a private key, so I could import this address in another client. Dumpprivkey doesn't work for becuase it's not a legacy wallet, I can do dumpwallet and get something called a descriptor, how do I decode wif key from that if possible.   Did you not understand what @LoyceV said that there is no ordinal inscription in the bitcoin core. Because if you know Bitcoin core it is a full node implementation of the bitcoin protocol. This means its obviously does not support the creation of ordinals.      Because the ordinal is a class of digital assets that can be stored in the bitcoin blockchain and most people know this too. And it was created by using the ord utility, which is a separate project from the bitcoin core, so if it is separate it is clear that it is not really part of the Bitcoin core.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "odolvlobo",
      "created_time": "June 01, 2023, 01:23:26 AM",
      "body": "Quote from: malizec on May 29, 2023, 12:47:30 PMI received three ordinal inscriptions in my bitcoin core wallet. First, I created a new wallet and created three bech32 segwit addresses. Each address received one ordinal inscription. Now I’d like to send them out to a new wallet but have no idea how. I tried to send one but since I didn’t think the fees would be enough I used two utxo for inputs and now I am afraid the ordinals utxo was used for fees instead the address with spare btc for fees. DO NOT USE BITCOIN CORE TO SEND OR RECEIVE INSCRIPTIONSBitcoin Core is completely unaware of ordinals and inscriptions. It will not handle them correctly. The inscription you received at bc1p2pct... is gone.You can check on the status of your inscriptions by entering their addresses in this site and checking the activity: https://ordiscan.comThere are wallets designed for sending and receiving inscriptions. You must use one of those or you risk losing the others (if they aren't lost already).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "June 01, 2023, 02:49:28 AM",
      "body": "Quote from: odolvlobo on June 01, 2023, 01:23:26 AMBitcoin Core is completely unaware of ordinals and inscriptions.Correction: Bitcoin is completely unaware of the Ordinals Attack.In other words you can not use any of the bitcoin wallets out there to abuse the protocol to send what they call Ordinals inscription.BTW you don't need to receive this attack transaction in a P2TR address, only the sender who wants to spam the chain with the junk data needs to do that, the receiving address can be literary anything because obviously there is no tokens to be moved and the junk data is not being transferred.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}