{
  "id": "topic_5417824",
  "title": "CryptoFuturistic",
  "author": "CryptoFuturistic",
  "created_time": "October 20, 2022, 07:43:05 PM",
  "content": "What do you think about it? I read this article in the Market Times https://markettimes.co.uk/cryptocurrencies/would-bitcoin-survive-a-nuclear-war/ and in my opinion I don't see a future 'cause to have access to the bitcoin you need internet",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5417824",
  "comments": [
    {
      "author": "Zilon",
      "created_time": "October 20, 2022, 08:17:26 PMLast edit: October 20, 2022, 08:34:24 PM by Zilon",
      "body": "QuoteRalph Merkle’s latest article states: “If a nuclear war destroyed half our planet, [Bitcoin] would live on, uncorrupted. It would continue to offer its services… The only way to shut it down is to kill all the servers that host it. Which is difficult, because many servers host it, in many countries, and many people want to use it.”If half of our planet get destroyed it means the other half will need to have steady energy source to power mining process and it will also mean the human who are survivors on the half planet must serve as  nodes for the network to function.  Once there is an explosion people will panic and saving a server might be the last thought that will come to peoples minds. If Bitcoin must survive a Nuclear war it relies on so many factors and the basics will be energy (power source) and the web As for Bitcoin living on i won't doubt that but while it still lives it will get slower for transactions to get verified, cost of mining will multiply drastically, many nodes might forcefully shot down due to the attack and many will lose access to their wallet as explosion will destroy lots of valuables and documents. A big chance for the internet to shutdown completely",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "The Cryptovator",
      "created_time": "October 20, 2022, 08:25:58 PM",
      "body": "If humans can't survive then how Bitcoin would survive? We all know what would happen if suddenly we face nuclear war. Everything will be collapsed and the world economy wouldn't survive. The same will happen for Bitcoin. People should be alive and survive first before anything else. We will need a lot of cash or fiat in case of nuclear war. So everyone will start the sale definitely to survive their life. We have to be ready to see Bitcoin collapse as well. No other option except to saving humans.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hamza2424",
      "created_time": "October 20, 2022, 08:37:36 PM",
      "body": "Nope, Not at all as Nuclear war has a lot of consequences. Stability cant be achieved in a nuclear war always remember not only BTC but also our all the technology, development, progress, and evolution cant stand against nuclear war as much I know remember the famous words, I don't know Which type of weapons are going to be used in WW3 but in WW4 there will be Axes and Hammer of stones.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "The Cryptovator",
      "created_time": "October 20, 2022, 08:44:45 PM",
      "body": "Quote from: Hamza2424 on October 20, 2022, 08:37:36 PM I don't know Which type of weapons are going to be used in WW3 but in WW4 there will be Axes and Hammer of stones.Please use the quote for this part, otherwise, you might get banned due to plagiarism. It's because of this quote from Albert Einstein. But this is true, that's what I explained in my first post. There must be humans using Bitcoin. And we all know what will happen when Nuclear war starts. But don't expect that, something should be good for humans.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DannyHamilton",
      "created_time": "October 20, 2022, 08:54:46 PM",
      "body": "Quote from: The Cryptovator on October 20, 2022, 08:25:58 PMWe will need a lot of cash or fiat in case of nuclear war. No.Cash and fiat will be useless after a society-ending war. The only things that will have value will be the things that keep you alive:FoodFresh waterMedicineShelterBullets and other weaponsIf you can't eat it, drink it, or use it to protect yourself from weather, disease, and hostile people or animals, then it's pretty useless.Gold? Largely valueless and useless.Diamonds? Largely valueless and useless.Coins? Largely valueless and useless.Paper/linen/plastic cash? Largely valueless and useless.Credit cards and debit cards? Largely valueless and useless.Bank accounts? Largely valueless and useless.Stocks and bonds? Largely valueless and useless.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "White pawn",
      "created_time": "October 20, 2022, 09:06:50 PM",
      "body": "Bitcoin would probably not survive a nuclear war as we humans are not even sure of our existence after a nuclear war. A nuclear war is so destructive and if humans barely cling onto life, how could bitcoin survive?In the event of a nuclear war, everything would be destabilized including the internet. With everything down, bitcoin would probably not be the first thing I would think of.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "VanillaH",
      "created_time": "October 20, 2022, 09:38:00 PM",
      "body": "I'm not even sure \"cash\" will survive. People will be hoarding more concrete stuff like food, shelter and ammo.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Vaskiy",
      "created_time": "October 20, 2022, 09:39:29 PM",
      "body": "When the survival of human beings is question mark, how will be the survival of bitcoin. The man made marvels too will fade away. Lets be positive, we hadn't got any need for a war when people are with expections of having peace all around. Every country know well about the power of nuclear weapons, so they won't get into nuclear wars.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "posi",
      "created_time": "October 20, 2022, 09:41:43 PM",
      "body": "Quote from: CryptoFuturistic on October 20, 2022, 07:43:05 PMWhat do you think about it? I read this article in the Market Times https://markettimes.co.uk/cryptocurrencies/would-bitcoin-survive-a-nuclear-war/ and in my opinion I don't see a future 'cause to have access to the bitcoin you need internet Nuclear war means the destruction of the earth, which means that everything will be completely destroyed. If that happens, we have more to worry about than the existence of bitcoin, like the famous Einstein quote that Hamza2424 repeated to us. The war between russia and ukraine is getting fiercer and more widespread but I hope they know what they are doing, especially Russia if they think of using small nuclear weapons to respond to Ukraine then this will also be the starting point of real nuclear war.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Baofeng",
      "created_time": "October 20, 2022, 09:51:40 PM",
      "body": "Basic things are needed in order for us to survived, food, shelter and water. Even money will be useless in a nuclear war, how can you spend your money when there is nothing to buy and people are starving and fighting for food? We are talking here about the full destruction or the effects of a nuclear weapons to the whole world. But if the other half can survived, then maybe bitcoin will still continue to flourish and as long as there are people who can mine.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GreatArkansas",
      "created_time": "October 20, 2022, 09:57:04 PM",
      "body": "Quote from: posi on October 20, 2022, 09:41:43 PMQuote from: CryptoFuturistic on October 20, 2022, 07:43:05 PMWhat do you think about it? I read this article in the Market Times https://markettimes.co.uk/cryptocurrencies/would-bitcoin-survive-a-nuclear-war/ and in my opinion I don't see a future 'cause to have access to the bitcoin you need internet Nuclear war means the destruction of the earth, which means that everything will be completely destroyed. If that happens, we have more to worry about than the existence of bitcoin, like the famous Einstein quote that Hamza2424 repeated to us. (.....)For me, this is impossible to happen right now even in the future. But if just incase it will happen in the future, I believe we are all dead by that time, or there is a new generation of people who will experience that and I don't hope it will happen.Speaking of Bitcoin, for sure Bitcoin that time is already in high market cap and trading volume, trading stable or sideways without any huge dump or pump in just short period of time and for sure there are lot of ways to store your Bitcoin in the future which became safe even there's a nuclear war.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "decodx",
      "created_time": "October 20, 2022, 10:24:33 PM",
      "body": "The hypothetical question of whether Bitcoin could survive a nuclear attack is really impossible to answer. Both sides of the argument have merit, but it's impossible to know how an extensive nuclear war would affect our society, let alone the technology behind Bitcoin. For example, would it be a limited strike or full-scale? How many nukes are we talking about here? Would it be targeted at financial hubs like New York City or London, or spread out across the globe? Would banks and other financial institutions survive? What would the world economy look like? Ultimately, the answer is that it's impossible to know. Even if the internet survived a nuclear war, which is very unlikely, there is no way of knowing how much damage would be done to our society and infrastructure.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mr.right85",
      "created_time": "October 20, 2022, 10:49:04 PM",
      "body": "I think Nuclear war is the hight of it. I wasn't around in the Times of the world war but, I know of a local war that almost divided my country, we didn't have much technology then as we do now but, we had transitor radios, a few walkie talkie and early generations phones and it was the most , most forks needed to keep up with the news. Life was hard as it is with wars and I don't think, anyone in his right mind even if a part of the world's population would be running nodes or mining during those times.Surviving is the first thing given the nature of the weapon at play and just being out operating a mine and having troubles with hit amongst others is what non would be readybto handle. Bitcoin's survival would depend largely on the survival of humans first but still would crash and come back up.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Stalker22",
      "created_time": "October 20, 2022, 11:21:48 PM",
      "body": "Quote from: CryptoFuturistic on October 20, 2022, 07:43:05 PMWhat do you think about it? That is impossible to say. Most likely, no one would even be around to watch it unravel. That said, if somehow mankind survives long enough for the world to begin to rebuild, Bitcoin may still exist as a relic from the pre-apocalypse era.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "8rch7",
      "created_time": "October 20, 2022, 11:48:51 PM",
      "body": "Quote from: The Cryptovator on October 20, 2022, 08:25:58 PMIf humans can't survive then how Bitcoin would survive? We all know what would happen if suddenly we face nuclear war. Everything will be collapsed and the world economy wouldn't survive. The same will happen for Bitcoin. People should be alive and survive first before anything else. We will need a lot of cash or fiat in case of nuclear war. So everyone will start the sale definitely to survive their life. We have to be ready to see Bitcoin collapse as well. No other option except to saving humans.  If nuclear war really happened, of course the most important thing that crossed our minds is how we can save ourselves and our families, because the most valuable thing is our own lives, and we only think about how we can fill our stomachs and what is certain is that we want cash to buy our needs for our needs during the war, in my personal opinion bitcoin will not survive if a nuclear war occurs, because it is certain that the internet will die, electricity will also die, if the internet is dead we will certainly never can access bitcoin again.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bazzu",
      "created_time": "October 21, 2022, 12:06:38 AM",
      "body": "in my opinion bitcoin will not survive a nuclear war, because surely people will sell their bitcoins for daily needs. because of course what is needed is money. and of course the price of bitcoin will also go down, but of course people will have different views on this.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "October 21, 2022, 12:29:59 AMLast edit: October 21, 2022, 12:46:13 AM by stompix",
      "body": "Quote from: Hamza2424 on October 20, 2022, 08:37:36 PMStability cant be achieved in a nuclear war always remember not only BTC but also our all the technology, development, progress, and evolution cant stand against nuclear war as much I know remember the famous words, I don't know Which type of weapons are going to be used in WW3 but in WW4 there will be Axes and Hammer of stones.I was sure somebody was going to quote that, but that's just not going to happen.Assuming enough population survives after this to start a new war, do you think people will suddenly forget how to craft weapons? Even if a nuclear bombardment happens in every city on this planet there will still be enough scraps, and enough raw materials for everything to start just in a few years as it was before, it's not like we will be reduced to monkeys! There are thousands of pipe guns right now in the world, guns that look like coming from a zombie game, that can be crafted from scrapyard parts but they are still lethal.Just think, if a nuclear war happens will thousands of people forget how to melt iron, how to get coal, or how to build an engine? No!As for Bitcoin, it's all a matter of the scale of what that war will be, and more important what surviving means.A copy of the blockchain will survive, a few computers or hopefully a few ASICs to keep mining also, let's ignore the difficulty adjustment and others, but would that mean people will still find a use for it? Cause things like sending money in minutes on the other side of the globe from which a few nukes just came might not be a priority anymore.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "crwth",
      "created_time": "October 21, 2022, 12:36:04 AM",
      "body": "It is hard to imagine what life would be like after that event because a lot of things could arise from it, and the specialized area would probably be very different if everyone in the world were affected. As long as there is a way to recover information that we have already been doing now in this era, we could re-create it, so we need people who understand and possibly someone who would learn to do it, then we can re-create and relive it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Darker45",
      "created_time": "October 21, 2022, 01:40:24 AM",
      "body": "I guess so. Bitcoin isn't tangible so it won't be blown into dust when nuclear bombs pulverize everything. They all remain in the blockchain. A copy could survive, which could later on be used to revive the network.If the human race will survive a nuclear war, then people would begin to restore things right after. That includes the internet. But it might come at a much later point. First things first. I think human civilization would have a long time rebuilding itself. That depends on the scale of the war, though. But with human beings having the tendency to annihilate the world with their craziness, it could really be worse.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}