{
  "id": "topic_5406418",
  "title": "kudosinitchi",
  "author": "kudosinitchi",
  "created_time": "July 15, 2022, 02:39:58 PM",
  "content": "It says that there will only ever be 21 million Bitcoin and the current BTC supply is almost at 19,094,150. What happens when its limit reached? will BTC price goes up instantly due to scarcity? is it the doom for Bitcoin since there is no room to mine? or maybe it will likely never reach 21 million?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5406418",
  "comments": [
    {
      "author": "Apocollapse",
      "created_time": "July 15, 2022, 02:51:05 PM",
      "body": "This is the Satoshi's answer regarding your questionQuote from: satoshi on February 14, 2010, 03:52:23 PMI'm sure that in 20 years there will either be very large transaction volume or no volume.Well we can't predict how much Bitcoin would be if almost of Bitcoin has been already mined, but we can pretty sure Bitcoin price either so low since many people lose interest due to high fees (we don't know how much the fees in the future) or Bitcoin price would be very high since many people really interested and scarce.Quote from: kudosinitchi on July 15, 2022, 02:39:58 PMor maybe it will likely never reach 21 million? Correct, Bitcoin supply will never reach 21 million, but it's almost closest to 21 million on 2140",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "July 15, 2022, 03:09:17 PM",
      "body": "Supply(which is capped at 21m) is just one thing, now it will completely depend on demand. Even if a certain asset was sharply decreasing in supply, if there's not much buying, price will still go down (or at least just not go up, but sideways).https://www.investopedia.com/terms/l/law-of-supply-demand.asp",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dragonvslinux",
      "created_time": "July 15, 2022, 03:21:42 PM",
      "body": "Quote from: kudosinitchi on July 15, 2022, 02:39:58 PMIt says that there will only ever be 21 million Bitcoin and the current BTC supply is almost at 19,094,150. What happens when its limit reached? will BTC price goes up instantly due to scarcity?90% of all BTC has already been mined, so it's far to say the scarcity is already at 90%. The difference between only 10% left available, and 0%, isn't really that much. Roughly +11% scarcity being the difference.Quote from: kudosinitchi on July 15, 2022, 02:39:58 PMis it the doom for Bitcoin since there is no room to mine? or maybe it will likely never reach 21 million? It'll reach 21 million in 2140 (give or take), so not for a long time still. Miners will still be incentivised to mine as it will still be for transaction fees, even if no new Bitcoins. Generally given the distribution of new Bitcoin halves every 4 years (hence halving), then the effect of no new Bitcoins to mine won't be felt that much at all, but gradually over the next 118 years.At some point before then miners will be receiving more income from transaction fees than newly mined Bitcoin anyway, so it's designed as a gradual transition process.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TheNineClub",
      "created_time": "July 15, 2022, 03:40:59 PM",
      "body": "Quote from: kudosinitchi on July 15, 2022, 02:39:58 PMIt says that there will only ever be 21 million Bitcoin and the current BTC supply is almost at 19,094,150. What happens when its limit reached? will BTC price goes up instantly due to scarcity? is it the doom for Bitcoin since there is no room to mine? or maybe it will likely never reach 21 million? It will probably never reach it as scarcity is not the only factor why people invest. Utility is a big factor and if BTC loses it's use factor to other coins, it might fall out of favor. That's not a bad thing nor is it something unexpected, but as it get's replaced, people might loose interest.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "|MINER|",
      "created_time": "July 15, 2022, 03:43:14 PM",
      "body": "Quote from: kudosinitchi on July 15, 2022, 02:39:58 PM What happens when its limit reached? will BTC price goes up instantly due to scarcity? is it the doom for Bitcoin since there is no room to mine? or maybe it will likely never reach 21 million? In the world of cryptocurrency, nothing can be said with certainty, but the idea is that the price of bitcoin will rise when the total supply mining is over. Even then I also think that the volatility of Bitcoin prices will always be there, as it depends entirely on the trading. I do not want to confirm anything because it is not possible to tell the future of anything.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yogee",
      "created_time": "July 15, 2022, 03:44:14 PM",
      "body": "We're free to speculate but we'll never really know since none of us wil be alive for another century. We can't even say if there will be a superior tech that would replace blockchain or if Bitcoin will still be alive. What I'm sure of is that future trader or investors can't use the four year-halving cycle as basis for price speculation when the last bitcoin is mined hehe.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Eternad",
      "created_time": "July 15, 2022, 03:50:23 PM",
      "body": "Quote from: kudosinitchi on July 15, 2022, 02:39:58 PMIt says that there will only ever be 21 million Bitcoin and the current BTC supply is almost at 19,094,150. What happens when its limit reached? will BTC price goes up instantly due to scarcity? is it the doom for Bitcoin since there is no room to mine? or maybe it will likely never reach 21 million? Mining the last satoshi might not happened because the difficulty might be set to very hard at that time while the price is still the same. It will be unprofitable for miners to mine that last satoshi if they will consume too much power just too mine a few satoshi but this will be a different story if the price of Bitcoin grow astronomically which no one can predict because there’s too many factor to be considered to come up to the estimated amount in the future.It’s much better to hold any amount of Bitcoin in the future to make sure you will not miss out whatever gonna happened. We are just enter on the exciting part.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "notocactus",
      "created_time": "July 15, 2022, 04:15:21 PM",
      "body": "Proof of Work so mining and reward for miners from transaction fee will be what you will see on Bitcoin network after all Bitcoin in total supply releases.How is the 21 Million Bitcoin Cap Defined and Enforced?Controlled supplyEquivalent network time (another way to present the Controlled supply)It is with an assumption that Bitcoin won't die. If it won't die, its price will be much higher than now and income from transaction fee will be good enough for miners.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kudosinitchi",
      "created_time": "July 15, 2022, 04:20:07 PM",
      "body": "Quote from: tranthidung on July 15, 2022, 04:15:21 PMProof of Work so mining and reward for miners from transaction fee will be what you will see on Bitcoin network after all Bitcoin in total supply releases.How is the 21 Million Bitcoin Cap Defined and Enforced?Controlled supplyEquivalent network time (another way to present the Controlled supply)It is with an assumption that Bitcoin won't die. If it won't die, its price will be much higher than now and income from transaction fee will be good enough for miners.thanks for the links i'll give time to read this.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fuguebtc",
      "created_time": "July 15, 2022, 04:20:28 PM",
      "body": "The price of bitcoins is not determined by the supply of bitcoins, supply is only part of those factors. It is determined by the technology behind bitcoin, and by the benefits it offers to us.Currently, we have mined 19 million bitcoins and only 2 million bitcoins left unmined, but to mine all 21 million bitcoins we will have to 2140. That means we have 120 years left before we can mine all the bitcoin, I think that's pretty far away.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dragonvslinux",
      "created_time": "July 15, 2022, 04:27:54 PM",
      "body": "Quote from: Eternad on July 15, 2022, 03:50:23 PMQuote from: kudosinitchi on July 15, 2022, 02:39:58 PMIt says that there will only ever be 21 million Bitcoin and the current BTC supply is almost at 19,094,150. What happens when its limit reached? will BTC price goes up instantly due to scarcity? is it the doom for Bitcoin since there is no room to mine? or maybe it will likely never reach 21 million? Mining the last satoshi might not happened because the difficulty might be set to very hard at that time while the price is still the same.It'd eventually happen, regardless of the difficulty, as if the difficulty is too high then the hash rate will decline and therefore reduce the difficulty as a consequence. What you're suggesting, the idea that the last satoshi might not be mined, is suggesting that the blockchain will be halted, as there is no way it can continue without miners being rewarded the final rewards.Quote from: Eternad on July 15, 2022, 03:50:23 PMIt will be unprofitable for miners to mine that last satoshi if they will consume too much power just too mine a few satoshi but this will be a different story if the price of Bitcoin grow astronomically which no one can predict because there’s too many factor to be considered to come up to the estimated amount in the future.I don't see a case where miners are mining for only a few satoshis, as there will still be the transaction fees which will be higher than the last remaining satoshis.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "July 15, 2022, 04:32:16 PM",
      "body": "Quote from: mk4 on July 15, 2022, 03:09:17 PMSupply(which is capped at 21m) is just one thing, now it will completely depend on demand. Even if a certain asset was sharply decreasing in supply, if there's not much buying, price will still go down (or at least just not go up, but sideways).https://www.investopedia.com/terms/l/law-of-supply-demand.aspNOPEit doesnt work like that in crypto.. firstlythere are 19m btc right now.. but exchanges only have deposits of ~1m btcand the active order books have less then that..there is no connection to 'coins in circulation(network) vs market pricethose that hoard away from exchanges dont ever trade so they dont touch the price thus dont affect the price.markets only move via the coins deposited in exchanges and currently on ACTIVE order lines..secondlyas for the demandif you look at the market changes over the last 10 years.. the average minnow order is about $400-$600. same then as it is nowwhat has changed is that the buyers get less coin for their fiat. yep. even if there was less coin. or more coin deposited in an exchange. . deflation still wins outyep in 2012 there were only 10.5m coins in circulation(network) in 2022 there are 19m coins in circulation(network)so normal investopia 'supply and demand' would say there is more supply.. meaning 2022 should be lower then 2012but thats where crypto trading differs.. sellers seeing buyer only wanting to spend $400 dont then throw whole bitcoin at them as thats all a buyer is offering. instead a seller gives them a smaller portion(decimal) of crypto for their small fiat offerits why in 2012 MTGox had orderlines of 1btc-1000btcand why now its more like 0.0002btc-2btc",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ImThour",
      "created_time": "July 15, 2022, 04:35:53 PM",
      "body": "It will never reach 21 million as we will not be surviving until 2140, which is the expected time period for the total supply to be mined.And thus, the price will continue to rise up every 4 years due to a phenomenon called Bitcoin Halving. So, you personally don't need to worry about the bitcoin supply limit. It's far much better and more sophisticated than other coins in the market as of now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackHatCoiner",
      "created_time": "July 15, 2022, 04:36:12 PM",
      "body": "Quote from: kudosinitchi on July 15, 2022, 02:39:58 PMWhat happens when its limit reached?When all the bitcoins are mined, which will happen in about 118 years, the miners' income will come solely from transaction fees. Quote from: kudosinitchi on July 15, 2022, 02:39:58 PMwill BTC price goes up instantly due to scarcity?It can't go up instantly, because:Coins are brought into circulation gradually.Demand is another factor, irrelevant of supply, which affects the price.Quote from: kudosinitchi on July 15, 2022, 02:39:58 PMis it the doom for Bitcoin since there is no room to mine?As said, the main income will sooner or later come from transaction fees. This will happen much sooner than 2140. Quote from: kudosinitchi on July 15, 2022, 02:39:58 PMor maybe it will likely never reach 21 million? Who knows what can happen within the next 118 years.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ucy",
      "created_time": "July 15, 2022, 04:48:17 PMLast edit: July 16, 2022, 06:03:45 AM by Ucy",
      "body": "It will ofcourse go up as it becomes scarce due to high demand which is expected to be based on its usefulness. And it will only become more divisible if it becomes too scarce to reach more people... which will probably mean having more units that are lesser than sat like you possibly have units that are lesser than cent or penny. Bitcoin really may not reach the supply limit assuming the limit remains unchanged, or Bitcoin does nolonger exists or is nolonger in use",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kudosinitchi",
      "created_time": "July 15, 2022, 05:29:25 PM",
      "body": "Judging from your replies, reaching BTC supply will really tend to take for a century or maybe not will likely reach its upper limit. But, since we can not guarantee if Bitcoin will still be the top crypto in that given year, maybe there will be another superior coin that will emerge in replace for BTC. Moreover, in 19million BTC existing right now, is there some portion of it that is burned? it was reported then this so called \"lost coins\" when owners that holds BTC in there wallet forget its private key, can we assume that the BTC is burned and will likely lessen BTC circulating supply?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "The Cryptovator",
      "created_time": "July 15, 2022, 05:43:24 PM",
      "body": "No one can predict what will happen when the last Bitcoin will be mined. We can take lessons only from past history. A lot of threads have been created with the same subject, just use the search button. Look at the past where was Bitcoin and where is now. So you can assume something when it will be mined last Bitcoin. There is no way to stop supply before it reached 21M.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fiulpro",
      "created_time": "July 15, 2022, 05:52:04 PM",
      "body": "The scarcity would not be a contributing factor in bringing the price up but rather it would make the investors search for new cryptocurrencies which have unlimited potential the reason I think it might not happen is because at the end of the day the developers can decide otherwise and decide to have unlimited supply to curb the inflation. I do think that having a limit on the supply does help big time since : 1. Less environmental concerns 2. Old investors do get profits while we all can still trade in satoshi 3. Unlimited potentialDemand and supply Rule would ofcourse work on full speed but how the market reacts and how the whales takes their money out and make the whole market crash at a might higher rate is something else.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fivestar4everMVP",
      "created_time": "July 15, 2022, 06:23:20 PM",
      "body": "When Bitcoin can no longer be mined because all 21 million coins have been mined, first, I believe Bitcoins that will be in circulation won't be up to 21 million coins when we consider the hundreds of thousands of Bitcoin that it's owners have lost access to, so this I believe makes Bitcoin even more scarce, and since there will be no other way to get Bitcoins except by buying them, I believe price will skyrocket, but it all depends on the demand though, and how good the network is by the time, if after mining ends, and transaction fees skyrocket, then I believe this will be a major issue for many most especially the small investors, but i still believe this is unlikely to happen, but let's see what happens then.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}