{
  "id": "topic_5473895",
  "title": "cygan",
  "author": "cygan",
  "created_time": "November 13, 2023, 10:58:51 AMLast edit: November 13, 2023, 01:42:23 PM by cygan",
  "content": "as the twitter/x user @oscpacey informs us with his tweet, there is another fake app from Electrum on the Apple AppStore. the whole offer is very similar to the original app.you can see the whole process and what happened under the following link: https://nitter.net/oscpacey/status/1723758796806263043and it looks like this is the scammer address: https://mempool.space/address/1LGou2YkuYLoFkkixLAd3HK6bVvUqX5BLzthe first transaction took place on 08-11 and the last on 12-11 and a total of ~0.42BTC was stolen by these scammersyou can repeat yourself over and over again - be careful with all these apps and double/triple check everything until you install somethingElectrum has also already confirmed ithttps://nitter.net/ElectrumWallet/status/1724006226785140935",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5473895",
  "comments": [
    {
      "author": "Charles-Tim",
      "created_time": "November 13, 2023, 11:05:32 AM",
      "body": "It is worth mentioning that the best place to download Electrum is the Electrum official site. https://electrum.org/To know if the wallet is not a fake one, in a way the site was not compromised to include a fake wallet by hackers, verify the PGP signature. [GUIDE] How to Safely Download and Verify Electrum [Guide]On app stores, if a wallet that supposed to have over 500 thousand to millions of downloads, but having like 1000 downloads, it is clearly a fake wallet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yamane_Keto",
      "created_time": "November 13, 2023, 11:33:16 AM",
      "body": "They have a rating of 4.7 in the store, which are ratings that may deceive some beginners. Reporting the application and leaving a negative rating will give an indication that it is a fraudulent service. Unfortunately, many do not verify the signature, but rather trust the default that the Apple Store is safe. I found some reviews from OCT so it's been about a month without this scam being shut down.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitMaxz",
      "created_time": "November 13, 2023, 12:17:07 PM",
      "body": "Quote from: Charles-Tim on November 13, 2023, 11:05:32 AMIt is worth mentioning that the best place to download Electrum is the Electrum official site. https://electrum.org/Actually, there's no Electrum installer for iPhone they only support macOS, Android, Linux, and Windows.And it seems Electrum developers do not have a plan to develop Electrum app on IOS because even if they do release Electrum for iPhone you can't able to install the app if it came from directly on electrum.org.So if you found the Electrum app on the AppStore don't install it because it's a fake Electrum wallet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TheUltraElite",
      "created_time": "November 13, 2023, 12:41:11 PM",
      "body": "Two things I would like to point out here.1. The official Electrum client for Android is published by Electrum Technologies GmbH and that is the legit one. For Apple store, I have no idea because I dont use any such device (poor guy here ). But this should be a point of awareness for common Electrum users to not search for any such apps on Apple store either, they might land up on the scam app.2. Since Twitter/X is owned by you-know-who and we lazy people dont have accounts on it and hate to create more, please use nitter.net to replace the x.com or twitter.com and be able to view the page easily without logging in. Its a great alternative, do try it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cygan",
      "created_time": "November 13, 2023, 01:46:11 PM",
      "body": "Quote from: TheUltraElite on November 13, 2023, 12:41:11 PM✂️2. Since Twitter/X is owned by you-know-who and we lazy people dont have accounts on it and hate to create more, please use nitter.net to replace the x.com or twitter.com and be able to view the page easily without logging in. Its a great alternative, do try it.thank you!i didn't even have this service on my radar and from now on i will also refer to it or the nitter links in my posts so that all users can benefit from it, of courseas it should be, i have now replaced my opening post with the nitter links",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rat03gopoh",
      "created_time": "November 13, 2023, 02:44:16 PM",
      "body": "This fake app has the last label \"Management\" = Electrum Wallet Management. And what needs to be noted here is that fake apps are not only electrum.QuoteLUMI WALLET MANAGEMENTSAMOURAIWALLET MANAGEMENTJAXX LIBERTY TRADEJAXX LIBERTY WALLET MANAGEMENTFANTOM WALLET MANAGEMENTAAVE PROTOCOL ASSETS TRADEhttps://nitter.net/oscpacey/status/1723758807224893953#mSo the appstore is now slowly becoming as bad as playstore.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PX-Z",
      "created_time": "November 13, 2023, 02:52:45 PM",
      "body": "So its from App Store knowing they claim they are strict on allowing apps to be avoided by their users and here we heard a shitty doing of them from their side. They should be accountable if someone lost their funds by using such fake app.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "November 13, 2023, 03:26:24 PM",
      "body": "Quote from: rat03gopoh on November 13, 2023, 02:44:16 PMSo the appstore is now slowly becoming as bad as playstore.I think they used the word \"Management\" to fool the Apple Store team, but I am surprised that they are so careless.Without reports explaining that they are scammers and Apple’s desire to remove any fraudulent content related to Bitcoin, I do not think they will be removed soon.So they are not bad, but they may want to leave a negative impression of cryptocurrencies, just as here is the slowness in removing any scam crypto video content on YouTube.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Z-tight",
      "created_time": "November 13, 2023, 05:37:31 PM",
      "body": "I can confirm that this scam application is in Apple app store, this is a screenshot i just took from my IOS device:The name of this scam wallet: 'Electrum wallet management' should be suspicious to people because of the word 'management', there is no such thing as Electrum wallet management. Anyway people who do not know what they are doing can fall for this, they wouldn't know that Electrum doesn't have an IOS version and wallet softwares should only be downloaded from the orginal Electrum wallet [1] and verified [2] after download[1] https://electrum.org/[2] https://bitcointalk.org/index.php?topic=5240594.msg54223763#msg54223763",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cygan",
      "created_time": "November 13, 2023, 06:31:28 PM",
      "body": "Quote from: Z-tight on November 13, 2023, 05:37:31 PMI can confirm that this scam application is in Apple app store, this is a screenshot i just took from my IOS device:✂️the bad thing is that Apple has not yet removed this fake version from their appstore and therefore victims continue to fall for this scamtoday, for example, a user was stolen just over 0.025BTC https://mempool.space/tx/45e9510feb824cfb78bb074feae39f9fde2884035093f2d39c79b5e6e21ab44b",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husna QA",
      "created_time": "November 14, 2023, 06:14:33 AM",
      "body": "Quote from: cygan on November 13, 2023, 06:31:28 PMQuote from: Z-tight on November 13, 2023, 05:37:31 PMI can confirm that this scam application is in Apple app store, this is a screenshot i just took from my IOS device:✂️the bad thing is that Apple has not yet removed this fake version from their appstore and therefore victims continue to fall for this scamtoday, for example, a user was stolen just over 0.025BTC https://mempool.space/tx/45e9510feb824cfb78bb074feae39f9fde2884035093f2d39c79b5e6e21ab44bYesterday, I reported the fake Electrum wallet application to Apple (https://reportaproblem.apple.com/).Quote from: Husna QA on November 13, 2023, 03:19:25 PM-snip-I tried downloading the application to see what it contained (just curious, not to be followed -DWYOR). And like other phishing applications, after I tried to open several existing menu buttons (some menus didn't work), they all directed the user to input the Mnemonic or Private Key.Quote from: Husna QA on November 13, 2023, 02:24:03 PM",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AprilioMP",
      "created_time": "November 14, 2023, 10:10:49 AM",
      "body": "Quote from: Husna QA on November 14, 2023, 06:14:33 AMYesterday, I reported the fake Electrum wallet application to Apple (https://reportaproblem.apple.com/).Thanks for doing a great job Husna QA.Quote from: Husna QA on November 13, 2023, 03:19:25 PMI tried downloading the application to see what it contained (just curious, not to be followed -DWYOR). And like other phishing applications, after I tried to open several existing menu buttons (some menus didn't work), they all directed the user to input the Mnemonic or Private Key.Quote from: Husna QA on November 13, 2023, 02:24:03 PM        The iPhone, which is said to be superior to Android in terms of security, turns out to be easy to penetrate fake applications like this.What about users who download the application and choose to create a new wallet instead of selecting the I already have a wallet option? Will they lead to a Mnemonic or private key request like importing from an existing wallet.I ask this so that most iPhone users reading are in the position of not wanting to try installing for fear of something happening.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Z-tight",
      "created_time": "November 14, 2023, 10:25:47 AM",
      "body": "Quote from: AprilioMP on November 14, 2023, 10:10:49 AMThe iPhone, which is said to be superior to Android in terms of security, turns out to be easy to penetrate fake applications like this.People should not rely on that, and only download their wallet from the original website. Apple app store may be better than Playstore in terms of security, but it doesn't mean that it is impossible to download phishing applications from Apple app store.Quote from: AprilioMP on November 14, 2023, 10:10:49 AMWhat about users who download the application and choose to create a new wallet instead of selecting the I already have a wallet option? Will they lead to a Mnemonic or private key request like importing from an existing wallet.I do not want to download this scam application into my ios device to find out, but from what Husna QA posted below, i think the scam application would redirect the person to input their recovery phrase or private keys, so their coins can be swept by the scammers into their own wallet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "November 14, 2023, 10:44:19 AM",
      "body": "Quote from: BitMaxz on November 13, 2023, 12:17:07 PMActually, there's no Electrum installer for iPhone they only support macOS, Android, Linux, and Windows.And it seems Electrum developers do not have a plan to develop Electrum app on IOS because even if they do release Electrum for iPhone you can't able to install the app if it came from directly on electrum.org.There's news making the rounds that Apple has plans to enable support for 3rd party app stores (but only for users in Europe). Although I don't know how that would work, I suppose this means that something like the equivalent of F-Droid can be made by some people, and Electrum can publish their app on platform, or even provide a binary that you can download, but opens with that app store by default for the purpose of installation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husna QA",
      "created_time": "November 14, 2023, 10:45:25 AM",
      "body": "Quote from: AprilioMP on November 14, 2023, 10:10:49 AMWhat about users who download the application and choose to create a new wallet instead of selecting the I already have a wallet option? Will they lead to a Mnemonic or private key request like importing from an existing wallet.When you create a new wallet, you will generate a new Seed phrase. It is no different from the import wallet option. Because the Seed phrase is still input there. I'm sure it will also be sent to the scammer.What is clear, make sure to download using the link from the official Electrum website (https://electrum.org/#download), even for the Android version of Electrum. Don't search manually on Playstore or other stores such as AppStore. Moreover, until now, there is no Electrum for iOS users.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bayu7adi",
      "created_time": "November 14, 2023, 11:00:47 AM",
      "body": "The scammer is pretty clever... they didn't embed any malware or other threats that AppStore reviewers could catch. Most likely, its function is just to import private keys. So, the focus of the review process before accepting it for launch on the AppStore, like ransomware, spam, spyware, trojan, ad bots, and other virus types, was intentionally left out.But it's quite surprising too. Why a major platform like the AppStore did not recognize Electrum and checking deeper into verifying it? Does simply having 'Management' in the app's name make it seem like a new and non-suspicious brand here?Quote from: Husna QA on November 14, 2023, 06:14:33 AMYesterday, I reported the fake Electrum wallet application to Apple (https://reportaproblem.apple.com/).I think this could be a solution, but unfortunately, it requires an Apple ID to report. I'm not an Apple user, but I really want to contribute and report the app.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AprilioMP",
      "created_time": "November 14, 2023, 11:10:55 AM",
      "body": "Quote from: Husna QA on November 14, 2023, 10:45:25 AMQuote from: AprilioMP on November 14, 2023, 10:10:49 AMWhat about users who download the application and choose to create a new wallet instead of selecting the I already have a wallet option? Will they lead to a Mnemonic or private key request like importing from an existing wallet.When you create a new wallet, you will generate a new Seed phrase. It is no different from the import wallet option. Because the Seed phrase is still input there. I'm sure it will also be sent to the scammer.This means that the seed phrase given when creating a new wallet is recorded with all of them (the perpetrators) so that users who cannot distinguish between genuine Electrum and fake ones will lose their stored Bitcoin assets.Quote from: Husna QA on November 14, 2023, 10:45:25 AMWhat is clear, make sure to download using the link from the official Electrum website (https://electrum.org/#download), even for the Android version of Electrum. Don't search manually on Playstore or other stores such as AppStore. Moreover, until now, there is no Electrum for iOS users.I ask as above because up to now Electrum does not support iOS but macOS (desktop). So, when iPhone users find Elcetrum app in mobile appstore can clearly know that the app is a scam because Electrum mobile is available on Android devices.https://electrum.org/#downloadThank you Husna QA",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "notocactus",
      "created_time": "November 14, 2023, 11:18:31 AM",
      "body": "Being paranoid with fake apps on Google Play?Protect yourself from fake wallet software (guide)The paranoid user's security guide for using Electrum safely.People got fake apps because they don't visit an official website to get download links. They also don't verify wallet, PGP key of developers. Only download an application and use it immediately.They will have more chance to get fake applications if they directly search in Google Play.Some websites to check wallet applications and I mean for double checking. Verify PGP key is most important.https://walletscrutiny.com/https://www.cryptowisser.com/wallets/This one https://bitcoin.org/en/choose-your-wallet, with some filters to choose a Bitcoin wallet. Below is some filters I used to narrow down the list of wallets to Electrum.https://bitcoin.org/en/wallets/mobile/android/electrum/?step=5&platform=android&user=experienced&important=control,fees&features=bech32,lightning,multisig,segwit",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitMaxz",
      "created_time": "November 14, 2023, 12:13:59 PM",
      "body": "Quote from: NotATether on November 14, 2023, 10:44:19 AMQuote from: BitMaxz on November 13, 2023, 12:17:07 PMActually, there's no Electrum installer for iPhone they only support macOS, Android, Linux, and Windows.And it seems Electrum developers do not have a plan to develop Electrum app on IOS because even if they do release Electrum for iPhone you can't able to install the app if it came from directly on electrum.org.There's news making the rounds that Apple has plans to enable support for 3rd party app stores (but only for users in Europe). Although I don't know how that would work, I suppose this means that something like the equivalent of F-Droid can be made by some people, and Electrum can publish their app on platform, or even provide a binary that you can download, but opens with that app store by default for the purpose of installation.It seems that I found the news you talking about here Apple may plan to appeal against the EU App Store law it was published 3 days ago.According to it \"Apple’s engineers have already developed tools to permit third-party stores and app sideloading on its systems, at least in Europe\"That's good news for those who live in Europe but how about other countries? Actually, you can install apps from 3rd party the only problem is you will need to jailbreak the unit to be able to install apps outside the appstore but it's not permanent once you turn off and on the device, the jailbreak is gone and all 3rd party apps won't work.And another problem is we do not know how safe is jailbreaking just like on Android phones if you root your phone you are vulnerable to any attacks online just like what happened to my old phone which has lots of malware and ads when you connect online.I hope that Apple decides to support other countries too so that we don't need to use any tools just to jailbreak the unit.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}