{
  "id": "topic_5419180",
  "title": "janellebowlerr",
  "author": "janellebowlerr",
  "created_time": "November 02, 2022, 12:38:01 PM",
  "content": "Hi. I'm a newbie and I'm just learning about this topic. There are many questions that I would like to understand, maybe this one has already been discussed, but I didn't find the thread, sorry. How reliable is Bitcoin, what will it be if someone will generate a new blockchain or another digital currency, will it make bitcoin fall down, and how fast?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5419180",
  "comments": [
    {
      "author": "hosemary",
      "created_time": "November 02, 2022, 12:46:31 PM",
      "body": "Quote from: janellebowlerr on November 02, 2022, 12:38:01 PMHow reliable is Bitcoin, what will it be if someone will generate a new blockchain or another digital currency, will it make bitcoin fall down, and how fast? Many people have already done so. That's very easy. Currently, there are many other cryptocurrencies (called altcoin), but none of them have been able to compete with bitcoin.None of the altcoins have been able to provide the security and the decentralization bitcoin gives us. Just go to coinmarketcap.com and see how many coins/tokens have been already created.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "November 02, 2022, 12:53:28 PM",
      "body": "Quote from: janellebowlerr on November 02, 2022, 12:38:01 PMHow reliable is Bitcoin, what will it be if someone will generate a new blockchain or another digital currency, will it make bitcoin fall down, and how fast? New and new cryptocurrencies are literally made by the hour. It's just that most cryptocurrencies created today are pretty much like pseudo-equity. Bitcoin pretty much won the currency/SoV category, and every cryptocurrency that tried to beat bitcoin in that category has failed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "November 02, 2022, 01:08:46 PM",
      "body": "On Coinmarketcap, there are over 21600 altcoins, yet bitcoin increased in value as the adoption continues. The most decentralized coin that is best free of manipulation is bitcoin. Just that you do not have to buy during wrong time when its price has significantly reached higher price, but best to buy and hold it after a significant bear market. Luckily bitcoin price has dropped significantly, and good to buy if you want to hold for many months or years.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "salad daging",
      "created_time": "November 02, 2022, 01:19:32 PM",
      "body": "It's been almost 10 years that bitcoin can't be dropped by a new coin or any other coin. It's become one of the most secure coins and blockchains among those who came or the old one, so bitcoin has nothing to match them, they are still at the top no 1 .I don't think altcoins with their blockchain are great, they always have vulnerabilities and also the price of coins that are often thrown away, even I don't dare to store altcoins for long or this new coin is too risky for me to experience so I avoid holding altcoins long term.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "348Judah",
      "created_time": "November 02, 2022, 01:31:23 PM",
      "body": "Quote from: janellebowlerr on November 02, 2022, 12:38:01 PMHow reliable is Bitcoin, what will it be if someone will generate a new blockchain or another digital currency, will it make bitcoin fall down, and how fast? Have you take your time to discover what it takes to invent something new, have you even read about the history on digital currency and know how many people have previously work on it that all avail to nothing, bitcoin is in for now and will everly be recognized being a currency and an asset for a store of value, and if something new is to come in thereafter bitcoin then I don't think it's at this present generation and we've not seen any move or attempt from any body yet coming with something new, but always consider the magnitude of required efforts, years and research needed to come up with something new, for now bitcoin is the only one invoke and no other.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Coyster",
      "created_time": "November 02, 2022, 01:35:38 PM",
      "body": "Quote from: janellebowlerr on November 02, 2022, 12:38:01 PMHow reliable is BitcoinWell, very reliable and secure; borderless too, op if you are new to the Bitcoin network and you are worried about some other crypto coming out and causing Bitcoin to fall, then you actually have nothing to worry about, quite a lot of crypto's have been made since the creation of Bitcoin and most of them have just being a waste of time, even the government have got in on the act with their own digital currencies  (CBDC). The thing is that Bitcoin offers what they can't, and it has an actual utility, something that most altcoins do not have.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SquirrelJulietGarden",
      "created_time": "November 02, 2022, 01:58:32 PM",
      "body": "Quote from: janellebowlerr on November 02, 2022, 12:38:01 PMHow reliable is Bitcoin, what will it be if someone will generate a new blockchain or another digital currency, will it make bitcoin fall down, and how fast? There are 9296 coins listed on Coinmarketcap. You can see the figure at bottom of Coinmarketcap table and it is a huge figure. Only one Bitcoin, others are altcoins and you must know there are more coins or tokens are not listed on Coinmarketcap.In addition, there are so many of altcoins are Bitcoin forks. How Many Bitcoin Forks Are There? You will be surprised!!!.What do you see from Bitcoin forks? Do they succeed more than Bitcoin or do they kill Bitcoin?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "November 02, 2022, 03:31:41 PM",
      "body": "Quote from: SquirrelJulietGarden on November 02, 2022, 01:58:32 PMThere are 9296 coins listed...True, 93 pages with 100 coins on each, which does not correspond to the number of 21 612 cryptos, but for some reason not all of them are listed, maybe because they are not worth anything?Quote from: janellebowlerr on November 02, 2022, 12:38:01 PMHow reliable is Bitcoin, what will it be if someone will generate a new blockchain or another digital currency, will it make bitcoin fall down, and how fast? Bitcoin has been around since early 2009, but for some, that's still too short a time to believe it will survive. There are a lot of people who believe in the new crypto king, not because Bitcoin is not good enough, but because they think they missed the opportunity to buy Bitcoin cheap and become rich. Unfortunately for all of them, Bitcoin is the only truly decentralized cryptocurrency that makes sense, everything else is more or less just bad copies, and it doesn't even help that they have the word Bitcoin in their name.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "carlfebz2",
      "created_time": "November 03, 2022, 08:32:41 PM",
      "body": "Quote from: janellebowlerr on November 02, 2022, 12:38:01 PMHi. I'm a newbie and I'm just learning about this topic. There are many questions that I would like to understand, maybe this one has already been discussed, but I didn't find the thread, sorry. How reliable is Bitcoin, what will it be if someone will generate a new blockchain or another digital currency, will it make bitcoin fall down, and how fast? Its been a while where other devs had been trying out to make a better blockchain tech and its utilities which it cant really be denied.If you do look around and see into those top 10 ranking on the entire marketthen you could definitely able to say that their features is much too far off with Bitcoin but still why Bitcoin did remain as #1? Because its simply its the king or father of all crypto.Its the origin which it cant really be just simply ignore into something who had copied the general idea when it comes to decentralization, and also the fact thatBitcoin utility is sufficient enough for making people stay and maintain its demand.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "wxa7115",
      "created_time": "November 04, 2022, 05:14:02 AM",
      "body": "Quote from: janellebowlerr on November 02, 2022, 12:38:01 PMHi. I'm a newbie and I'm just learning about this topic. There are many questions that I would like to understand, maybe this one has already been discussed, but I didn't find the thread, sorry. How reliable is Bitcoin, what will it be if someone will generate a new blockchain or another digital currency, will it make bitcoin fall down, and how fast? You just have to check one of the several websites which already track the different coins we have in the market and you will see that we have many different altcoins appearing daily and yet the price of bitcoin is not affected.And if you think about you will see why things are this way, those coins are just another asset in this market, and even if they are good they will not necessarily take money away from bitcoin, this is similar to what we see in the stock market in which a stock will not go down in price just because another powerful company emerged, so you do not have to worry about something like that at all.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Plaguedeath",
      "created_time": "November 04, 2022, 06:46:56 AM",
      "body": "No one has a crystal ball, so one one can predict Bitcoin price how fast it will fall down, how fast it will rise, how long it can stay on x price etc etc. If you're looking to bought Bitcoin at the cheapest price and you will keep waiting until now, I advice don't do that since you wouldn't know when it will happen. It's better if you start DCA-ing Bitcoin right now to 2023, so you can bought Bitcoin at the cheap price.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kemarit",
      "created_time": "November 04, 2022, 09:32:36 AM",
      "body": "Quote from: janellebowlerr on November 02, 2022, 12:38:01 PMHi. I'm a newbie and I'm just learning about this topic. There are many questions that I would like to understand, maybe this one has already been discussed, but I didn't find the thread, sorry. How reliable is Bitcoin, what will it be if someone will generate a new blockchain or another digital currency, will it make bitcoin fall down, and how fast? Did you mean secure? (as opposed to reliable?), I guess it mostly secure, it's just how you manage your bitcoin, how you keep it so that you are not giving any chance for a hacker to steal your very own BTC. And Bitcoin blockchain hasn't been broken yet.Regarding your second question, we can't really tell how fast bitcoin goes down, specially in the current market that we are in. But the basic is that it is base on supply and demand, so if there are more people wanting to buy then the price will go up, same on how it will go down.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "wmaurik",
      "created_time": "November 04, 2022, 09:53:40 AM",
      "body": "Quote from: janellebowlerr on November 02, 2022, 12:38:01 PMHi. I'm a newbie and I'm just learning about this topic. There are many questions that I would like to understand, maybe this one has already been discussed, but I didn't find the thread, sorry. If you say you can't find the thread and it's related to Bitcoin, then you haven't looked for it on this forum, because anyone can use the Search button in the top right column if you want to find something, including Bitcoin.QuoteHow reliable is Bitcoin, what will it be if someone will generate a new blockchain or another digital currency, will it make bitcoin fall down, and how fast? There have been many new Blockchains created by different people and running until now, but all of these Blockchains have not been able to match the strength of the Blockchain from Bitcoin and also have not been able to displace Bitcoin from the top as the world's best digital currency that can still be owned by everyone until now. . And speaking of reliability, it is clear that Bitcoin is still very reliable with proof that it still survives and is increasingly valuable in the eyes of many people today.And if you want to know more about what Bitcoin is, now try accessing investopedia.com to find out what Bitcoin is and also several other websites that are well known and trusted in presenting every news and article.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nrcewker",
      "created_time": "November 04, 2022, 02:37:33 PM",
      "body": "Quote from: janellebowlerr on November 02, 2022, 12:38:01 PMHi. I'm a newbie and I'm just learning about this topic. There are many questions that I would like to understand, maybe this one has already been discussed, but I didn't find the thread, sorry. How reliable is Bitcoin, what will it be if someone will generate a new blockchain or another digital currency, will it make bitcoin fall down, and how fast? If BTC falls down then it will definitely take a long time. You can see the marketcap of the coin. This proves the popularity and trading volume of the coin. Moreover regarding the new coins, then there are plenty of coins already in the market. Forget about overtaking, there aren’t any coins which are even half price that of Bitcoins. So OP if you are thinking to invest in Bitcoins, then this is the right time to do it so. Currently Bitcoins are listed in the cheap possible price. So buy as many coins as you can.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Maidak",
      "created_time": "November 04, 2022, 03:24:48 PM",
      "body": "Quote from: janellebowlerr on November 02, 2022, 12:38:01 PMHi. I'm a newbie and I'm just learning about this topic. There are many questions that I would like to understand, maybe this one has already been discussed, but I didn't find the thread, sorry. How reliable is Bitcoin, what will it be if someone will generate a new blockchain or another digital currency, will it make bitcoin fall down, and how fast? These are basic questions that I think a newbie like you should thoroughly research before deciding to invest in bitcoin. It is very difficult to fully explain what you are asking, everyone's answers are all correct but it's not complete and detailed. I think these basic questions and information you can find anywhere on the internet, try searching them on google. I believe you will find a complete and detailed answer.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cozytrade",
      "created_time": "November 04, 2022, 03:47:46 PM",
      "body": "Quote from: janellebowlerr on November 02, 2022, 12:38:01 PMHi. I'm a newbie and I'm just learning about this topic. There are many questions that I would like to understand, maybe this one has already been discussed, but I didn't find the thread, sorry. How reliable is Bitcoin, what will it be if someone will generate a new blockchain or another digital currency, will it make bitcoin fall down, and how fast? Look at the coinmarketcap. You would see thousands of blockchain projects. Many projects have come and washed out from the market till now but bitcoin always remains number one. There is a reason BTC is called the father of all cryptocurrencies. If there is one true decentralized cryptocurrency in the market that is bitcoin. So it will be better for you to learn about bitcoin before comparing it with another blockchain.  All the new blockchains just came with the solution to some limitations bitcoin has. Most of them is just some hybrid version of bitcoin which means they are not totally unique.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "palle11",
      "created_time": "November 04, 2022, 06:31:14 PM",
      "body": "I think your question is a straight forward question but because you don't understand what you are asking of that is why you didn't know how to put the question. You can simply ask if a new blockchain is created will it affect bitcoin to drop? And the answer is no. Like many have responded, there are blockchains already existing and this has no effect on bitcoin. Altcoins have existed and some try to dublicate bitcoin but it has no effect against bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cabron",
      "created_time": "November 04, 2022, 06:42:25 PM",
      "body": "Thousands of altcoins created already with the objective to bury BTC. None of them succeed and evidently, it shows on the rank sites. But if you mean how fast it could fall during a bear market, it's gradual but you should assume fast like -5 to 10% when you see the price goes its ATH. You better be the first to sell or lose potential profit by thousands.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ShowOff",
      "created_time": "November 04, 2022, 07:44:18 PM",
      "body": "Quote from: janellebowlerr on November 02, 2022, 12:38:01 PMHi. I'm a newbie and I'm just learning about this topic. There are many questions that I would like to understand, maybe this one has already been discussed, but I didn't find the thread, sorry. How reliable is Bitcoin, what will it be if someone will generate a new blockchain or another digital currency, will it make bitcoin fall down, and how fast? As far as I am in the crypto world, no other blockchain can surpass bitcoin. What that means is, they may compete but ultimately cannot beat the dominance of bitcoin which is not only used as an investment and trading asset. On the other hand, you should know that bitcoin is a currency that you can spend legally in any country that has legalized it, that is something that has made bitcoin always ahead of other blockchain so far.The price of bitcoin falls or rises not because of other blockchain, but it depends on a lot of things that have been talked about over and over again. You need to read a lot about what affects prices, there is a lot of information you can find with specific keywords. Fluctuation is something that is always there, so it is not due to competition between blockchain.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}