{
  "id": "topic_5408080",
  "title": "BADecker",
  "author": "BADecker",
  "created_time": "July 29, 2022, 06:26:23 PM",
  "content": "If the Dems use the Internet, and a bunch of lies and vote fraud to steal this one from Trump, there's going to be open rebellion. We'll be finding out where all those guns that Americans have bought over the last decade went.Donald Trump plotting return to White House in 2024, makes major pledge to military members discharged for refusing COVID vaxQuote from: https://www.naturalnews.com/2022-07-29-trump-plotting-return-white-house-makes-pledge-military-members-discharged-covid-vax.html# Former President Donald Trump and his team have been huddling together at his Mar-a-Lago estate in Florida for the better part of a year plotting how he plans to return to the White House in 2024.After handily winning the GOP nomination, which he will if he runs — and we believe he is going to run — Trump will once again fall under major attack by the far-left media propagandists and deep state, all of whom will go to extreme lengths to keep him out of the Oval Office because they are petrified of his ‘America First’ agenda, which empowers citizens and strips power from the governing elite.But in addition to these plans, Trump made a pledge this week to former U.S. military members discharged because they refused to take the problematic, largely still experimental, and often dangerous COVID-19 vaccine.Namely, Trump plans to reinstate those “patriots” and more.“We have to abolish all COVID mandates and lockdowns,” Trump told the Turning Point USA conference in Tampa, Fla., on Saturday. “Rehire every patriot who was shamefully fired from the military, with an apology — we have to give them an apology. And all of their back pay.”The Western Journal adds:Trump would be well-poised to deliver on this proposal if he’s elected to a second, non-consecutive term in the 2024 presidential election.The former president has suggested he’s likely to run, with some polling showing Trump with a dominant lead in a tentative 2024 GOP primary.In the speech, Trump also criticized what he identified as “woke’” cultural policies targeting the military.“You hear all about the woke stuff… I think a lot of our military laugh it off, but at some point, it really gets in there, you get infected, and it’s bad,” he said.Regarding Trump’s plans to continue draining the swamp once he gets back into the Oval Office, they will be multifaceted, very targeted, and take into consideration the embedded opposition to his policies.According to Axios, whose correspondents spent three months interviewing some two dozen Trump insiders and others familiar with the planning, Trump will reimplement “Schedule F,” an executive order he issued just days before the 2020 election and which was quickly rescinded by President Joe Biden that calls for completely reshaping hundreds of federal agencies.The plan calls for firing thousands of current bureaucrats and replacing them with young professionals who are all-in with his “MAGA” agenda. Schedule F formed a new category of federal employees who are in “positions of a confidential, policy-determining, policy-making, or policy-advocating character,” and allows for those employees to be replaced following a presidential transition....",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5408080",
  "comments": [
    {
      "author": "Die_empty",
      "created_time": "July 29, 2022, 11:53:58 PM",
      "body": "Politicians cannot be trusted because they are selfish and corrupt. Donald Trump had the opportunity to become a two term president but he messed it up with his lies and open racial discrimination. I am not also a fan of Joe Biden because of some of his failed promises. Generally, I have lost confidence in politicians that I don't even care about who becomes the next president because all of them are the same.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BADecker",
      "created_time": "July 31, 2022, 01:53:11 AM",
      "body": "^^^ So, let's do it this way. Make the platform that all the candidates run on, to be a contract with the people. Let's pin them down on their contract as to dates and times they will accomplish whatever they set out to do if they win. The penalty for not doing what they said is death. The only two other options are:1. They can resign the post if they can see they aren't going to make it. But then the vice-president is required to finish the contract or resign. And so on down the line with whomever gets the job of president by default. If they all resign, we hold new elections.2. If a president pleads not guilty by way of being held back by Congress, and he doesn't resign, he gets life in prison. And we get to hold the elections over.Of course there will be other details to this that people will have to figure out... like the language of the contract, and the importance of the things in the platform. But this is the start to make things happen the way they should.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TwitchySeal",
      "created_time": "August 01, 2022, 05:16:55 AM",
      "body": "",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}