{
  "id": "topic_5493902",
  "title": "Question:",
  "author": "BlackHatCoiner",
  "created_time": "April 23, 2024, 11:33:32 AM",
  "content": "I want to get an answer to this question from the community of Bitcoin. The opinions on fungibility go like this:No: Many places buy the \"taint\" nonsense and treat bitcoins unequally. Therefore, you might be discriminated based on your coins' history.Yes: No matter the history, 1 BTC = 1 BTC, always. The protocol doesn't treat them differently, and we shouldn't interact with businesses that enforce this \"taint\" notion, which is evidently based on inaccurate fallacies.I'm personally on the latter group. Third parties can treat them however they like. They're just losing me as client. Decentralized solutions treat all coins equally, as they should.In the Monero community, there is a prevailing perspective that due to these businesses, Bitcoin is not fungible, and Monero is. My question is: have you ever paid a business that buys the \"taint\" nonsense with Monero? Does it make any sense to enforce this BS while accepting a completely private currency that you cannot track? In my view, if a business performs blacklists on my bitcoins, it absolutely doesn't accept Monero. You either accept both Bitcoin and Monero as fungible, or you blacklist the former and delist the latter (due to your inability to track it).",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5493902",
  "comments": [
    {
      "author": "_act_",
      "created_time": "April 23, 2024, 11:42:17 AM",
      "body": "Fungibility by law means a commodity or a product that is replaceable by another item similar to the commodity or product. Bitcoin is fungible and can be bought. Bitcoin has all the characteristics of what we can described as fungible. This should not be about tainted coin or comparing it with monero. This should not even be a matter of argument.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "goldkingcoiner",
      "created_time": "April 23, 2024, 11:50:13 AMLast edit: April 23, 2024, 12:00:30 PM by goldkingcoiner",
      "body": "I agree that \"tainted\" Bitcoin is nonsense. Since decentralized swaps, mixers etc. are possible for Bitcoin, it is technically impossible to filter out \"tainted\" coins. If I use a decentralized atomic swap to trade my untraceable Monero for somebody's \"tainted\" Bitcoin, then how would the simple act of owning that Bitcoin make it legal for some third party to harass me? Even if the last owner did something illegal with that Bitcoin, that connection is severed the moment I become the new owner.Any business that supports withholding a users funds over such unlawful reasoning such as: 'the user supposedly owns tainted coins' is a criminal business and should be avoided like the plague.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "barto123",
      "created_time": "April 23, 2024, 12:31:30 PM",
      "body": "fungibility is when all units are indistinguishable between one anotheri.e you melt a dozen 24 carat gold coins, you can recreate them into a new set of coinsi've been censored numerous times now because i use coinjoin - that means there is bitcoin & tainted bitcoin. only a small percentage of supply is coinjoined. lightning & onchain are not indistinguishable either, sure 1 sat is 1 sat, but they make different history on the ledgerthe only thing that comes close to fungible as a cryptocurrency is monero - and the anon set is due to massively increase with upcoming upgrade.also, with these high fees it's becoming too costly to use coinjoin / open lightning channels on bitcoin for the average user.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "btc78",
      "created_time": "April 23, 2024, 12:45:09 PM",
      "body": "Quote from: _act_ on April 23, 2024, 11:42:17 AMFungibility by law means a commodity or a product that is replaceable by another item similar to the commodity or product. Bitcoin is fungible and can be bought. Bitcoin has all the characteristics of what we can described as fungible. This should not be about tainted coin or comparing it with monero. This should not even be a matter of argument.This is the real definition of fungible but it seems like the cryptocurrency community has brought in a whole different kind of concept to associate with the word ‘fungible’. If you ask crypto enthusiasts about fungibility they will most likely say that it is the concept of exchanging 1 bitcoin to another and it will still be the same.Meaning they have the same value. But those ‘tainted’ bitcoin can be considered less desirable thus disapproving of the statement that bitcoin is fungible.I do get that notion since bitcoin is also considered an asset and some people wouldn’t want to be involved in an asset that was involved in something dark or dirty.The hesitation with transacting with those tainted btc just increases more because everything is public and can be linked back to you. However I still think that yes bitcoin is fungible.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "barto123",
      "created_time": "April 23, 2024, 12:47:01 PM",
      "body": "Quote from: goldkingcoiner on April 23, 2024, 11:50:13 AMI agree that \"tainted\" Bitcoin is nonsense. Since decentralized swaps, mixers etc. are possible for Bitcoin, it is technically impossible to filter out \"tainted\" coins. If I use a decentralized atomic swap to trade my untraceable Monero for somebody's \"tainted\" Bitcoin, then how would the simple act of owning that Bitcoin make it legal for some third party to harass me? Even if the last owner did something illegal with that Bitcoin, that connection is severed the moment I become the new owner.Any business that supports withholding a users funds over such unlawful reasoning such as: 'the user supposedly owns tainted coins' is a criminal business and should be avoided like the plague.you can filter out tainted coins, but how costly & time consuming will that be going forward. bitcoin is suppose to be permissionlessbitcoin is operating mostly in the realm of surveillance platforms, most mainstream people fear the system - they will bend the knee and complythe creep with only increase for people who want privacy, the controllers of this world want a top down authoritarian world government - if you think it's a conspiracy theory - they're openly telling us lolbut i agree, any business who supports KYC, freezing funds etc should be boycotted immediatedly - it's completely immoralbecause of all this im gravitating more toward undergroud economy and we know monero is king",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kryptqnick",
      "created_time": "April 23, 2024, 12:51:18 PM",
      "body": "There are monitoring platforms that try to assess if BTC is alright or tainted, and some websites can ask for additional documentation based on the fact that some BTC was flagged somewhere as tainted. Some also have policies like not accepting Bitcoin that was mixed (using a mixer).Such policies do raise the question of fungibility of Bitcoin. I think Bitcoin is fungible, and that we shouldn't care about the notion of tainted coins. What authorities should care about is tracking money that is currently under control of criminals, but once the money is seized and released back via auctioning or exchanges, that shouldn't matter.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Amphenomenon",
      "created_time": "April 23, 2024, 12:58:18 PM",
      "body": "Quote from: goldkingcoiner on April 23, 2024, 11:50:13 AMSnipJust like how it is impossible to filter out tainted fiat currency then it should be similar to bitcoin since we have mixers and other means of making bitcoin transactions more anonymous and It's just hypocrisy seeing some coins flag while in the blockchain they are all the same because this makes bitcoin Fungible as a currency A similar situation is that I as an individual may choose not to accept my local fiat maybe cause how old it looks but when taken to the bank it will definitely be accepted. We don't always have to know who once used our fiat currency or what they did to get it before we can use it which should be a similar situation in Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Plaguedeath",
      "created_time": "April 23, 2024, 01:00:40 PM",
      "body": "Quote from: BlackHatCoiner on April 23, 2024, 11:33:32 AMYou either accept both Bitcoin and Monero as fungible, or you blacklist the former and delist the latter (due to your inability to track it). You can't expect they will use their common sense because they're using double standards.If you received coins that they said \"dirty coins\", your coins will be frozen and you will be asked many information, but in the end you can't access your coins.But if they i.e. Federal Reserve confiscate the coins from criminals, they can auction the coins and they will earn money from that. Federal Reserve is actually a legal mixer since they launder from \"dirty coins\" to \"clean coins\".",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitcoin_mining",
      "created_time": "April 23, 2024, 01:20:37 PM",
      "body": "Those who have lost money investing in Bitcoin may consider Bitcoin as such but those who have invested in Bitcoin in the right way will definitely consider Bitcoin as a safe investment platform. As far as I know about Bitcoin, many people invest through Bitcoin and many do business with Bitcoin. Investment or trading can result in loss of money if the skills are not fully applied.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "April 23, 2024, 02:02:59 PMLast edit: April 23, 2024, 02:27:43 PM by franky1",
      "body": "firstly fungible is not a 2(yes no) option answer.. its more of a scale, whereby some coins are less fungible than othersblackhat has to explain his version of fungiblebecause trading coins yes MAJORITYare 1btc=1btcbut investigating coins no, not all coins are the same as they all have unique identifiers (utxo references) which are linked to previous utxo spends.for instance people would react more if just 10btc moved from an address of satoshis(the unspent of satoshi->hal address) compared to someone moving 10btc from a different stash more recentwhere different coins are more important than the othermuch like how some people value 1950's dimes more then 2020 dimes (hint: older ones were 90% silver)or how mis printed/mis minted coins/notes are worth more then face valueoh and by the wayif he really thinks every coin is fungible.. then he needs to quit his day job promoting mixing to hide the infungibilitiesyepfunny part is he pretends to say all coins dont have a thing called taint to make it seem to victims that mixing is safe to be handed dirty coinsyet, if dirty coins were safe(in his delusion) then why need to mix them? (rhetorical question)the real thing is coins can be investigated and treated differently but he wants idiots to become victims to hand over their clean coins to scammers/creeps/perves and criminals.. so those weirdos can run off with victims clean coins.. whilst trying to promote to idiots that its safe and not a threat for innocent people to give up their clean un-criminally linked coins.. and be given dirty coins, which innocent victoms then have to explain to investigators why they have possession of dirty coins.. in short.. if your coins are good and clean dont give them over to mixers.. and definitely dont do it where you are not making profit from itif you want to swap your clean coins... charge a criminal a premium.. after all you receiving dirty coins will most likely have your deposits into CEX frozen and investigated if the suspicion threshold(scale) is high enough to trigger an investigation.. which especially happens if all your coins were coming from mixing+ from a criminal stashas for \"taint nonsense\" bitcoin is a ledger every coin is accounted for as having a path back to its origin block reward creation and subsequent movement.. so taint is real.. as for businesses tagging when coins were used by certain people for certain reasons.. well if he says thats nonsense. then ill say again, why does he then promote mixing.. (rhetorically)he is the type of person that suggests guns dont kill people... whilst he sells guns, and offers training on how to get away with murder by gunshotlast comedy moment of blackhathis overall mindset is if he can dupe/recruit majority into running all their coins through a mixer.. he can taint all coins as being mixed(and profit from the fee's of that business) and hope that if all coins are flagged as tainted, investigators will give up tagging all coins as mixed.. or stop investigating... but the real world wont work the way he hopes and he wont get his dream come true from his recruitees or from investigators..oh and he also doesnt want people knowing better ways to clean coins. as thats not the business he is in and he doesnt want people using methods not part of his business",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tbct_mt2",
      "created_time": "April 23, 2024, 02:26:12 PM",
      "body": "Bitcoin is fungible, nobody and no government can change it.Because Bitcoin is fungible, we have Bitcoin transactions with any bitcoin value different than round numbers. Because of fungibility, 19,689,128 BTC in circulating supply can be exchanged by many people. If it is non-fungible, actual available bitcoins for circulation will be very smaller because many bitcoins will be locked.In addition, miners get transaction fee because Bitcoin is fungible. It is unrealistic to get transaction fee in only round numbers of bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "April 23, 2024, 02:29:10 PM",
      "body": "Quote from: tbct_mt2 on April 23, 2024, 02:26:12 PMBitcoin is fungible, nobody and no government can change it.Because Bitcoin is fungible, we have Bitcoin transactions with any bitcoin value different than round numbers. Because of fungibility, 19,689,128 BTC in circulating supply can be exchanged by many people. If it is non-fungible, actual available bitcoins for circulation will be very smaller because many bitcoins will be locked.In addition, miners get transaction fee because Bitcoin is fungible. It is unrealistic to get transaction fee in only round numbers of bitcoin.MAJORITY are fungible because only a MINORITY are mixed/used by criminalsfungibility had nothing to do with total circulation or decimals, its more to do with utxo references and spending paths",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "God bless u",
      "created_time": "April 23, 2024, 03:50:02 PM",
      "body": "Quote from: BlackHatCoiner on April 23, 2024, 11:33:32 AMI want to get an answer to this question from the community of Bitcoin. The opinions on fungibility go like this:No: Many places buy the \"taint\" nonsense and treat bitcoins unequally. Therefore, you might be discriminated based on your coins' history.Yes: No matter the history, 1 BTC = 1 BTC, always. The protocol doesn't treat them differently, and we shouldn't interact with businesses that enforce this \"taint\" notion, which is evidently based on inaccurate fallacies.I'm personally on the latter group. Third parties can treat them however they like. They're just losing me as client. Decentralized solutions treat all coins equally, as they should.In the Monero community, there is a prevailing perspective that due to these businesses, Bitcoin is not fungible, and Monero is. My question is: have you ever paid a business that buys the \"taint\" nonsense with Monero? Does it make any sense to enforce this BS while accepting a completely private currency that you cannot track? In my view, if a business performs blacklists on my bitcoins, it absolutely doesn't accept Monero. You either accept both Bitcoin and Monero as fungible, or you blacklist the former and delist the latter (due to your inability to track it).  If we go to literal meaning of fungible that yes BTC is fungible because it can be replaced by another BTC and both are equal in worth and value but the fact that it can be replaced makes it fungible. Now if we talk about with facts and brain then the term fungible has no place in crypto world. What I mean to say is why someone will replace a BTC by BTC there is no point to that. No coin is fungible if we come out of the literal meaning.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mate2237",
      "created_time": "April 23, 2024, 04:52:55 PM",
      "body": "In the cryptocurrency ecosystem space anything \"tainted\" is nonsense and if Monero is \"tainted\" but bitcoin can't be. And with that bitcoin can't be fungible. Developers have been trying to create coins that look similar like bitcoin and use it to lure people to invest in it but it doesn't work. Quote from: God bless u on April 23, 2024, 03:50:02 PM If we go to literal meaning of fungible that yes BTC is fungible because it can be replaced by another BTC and both are equal in worth and value but the fact that it can be replaced makes it fungible. Now if we talk about with facts and brain then the term fungible has no place in crypto world. What I mean to say is why someone will replace a BTC by BTC there is no point to that. No coin is fungible if we come out of the literal meaning.Even though you bring it from the literally perspective it can be fungible because \"1 bitcoin is 1 bitcoin\" as the Op said. There are many similar bitcoin related coins in the ecosystem but none can withstand with bitcoin because their prices are still very far below $1. Even the Monero the Op used as the example for the fungible is doing well more than those nonsense coins. And if you talk about others I will not have problem but remove bitcoin from the fungible argument.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "un_rank",
      "created_time": "April 23, 2024, 05:06:18 PM",
      "body": "The Bitcoin network does not filter transactions and UTXOs, everything can go through as long it is properly validated, meaning it is fungible. BUT...The influence of centralized, third party services is high and is only growing with most of the trading going on there. Sure those services can lose some users with their silly rules but they have 5 more willing to register and submit themselves to all the requirements and regulation they will be put through. You are now having less window to trade your Bitcoin as you wish and need to be extra careful with it.  If over 65% of the exchange market starts to filter bitcoins based on their arbitrary rules it is becoming less fungible.It is inherently fungible, but that feature needs to be protected by keeping channels that see it that way in business.- Jay -",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hatshepsut93",
      "created_time": "April 23, 2024, 05:13:27 PM",
      "body": "Well, fiat money is considered to be fungible, yet it has the same concept of taint. Entities like banks or some companies can freeze and reject transactions if they deemed as high risk by their algorithms, for example coming from a blacklisted country. Or when a person with no financial history suddenly deposits a huge sum in cash. This is the reality of digitalization. It allows much easier control on the monetary flows than physical money, and governments don't want something digital yet anonymous like Monero to be widespread, so they will never allow it to be accepted by legally operating businesses.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptosize",
      "created_time": "April 23, 2024, 05:20:47 PM",
      "body": "For the mainnet it's fungible, for CEX/AML/governments it's not.Quote from: Plaguedeath on April 23, 2024, 01:00:40 PMQuote from: BlackHatCoiner on April 23, 2024, 11:33:32 AMYou either accept both Bitcoin and Monero as fungible, or you blacklist the former and delist the latter (due to your inability to track it). You can't expect they will use their common sense because they're using double standards.If you received coins that they said \"dirty coins\", your coins will be frozen and you will be asked many information, but in the end you can't access your coins.But if they i.e. Federal Reserve confiscate the coins from criminals, they can auction the coins and they will earn money from that. Federal Reserve is actually a legal mixer since they launder from \"dirty coins\" to \"clean coins\".That's a really good point.Silk Road bitcoins were deemed \"tainted\", until the US government decided they're not and started selling them.  Voila, you now have \"clean\" bitcoins!Maybe they want to have a mixer monopoly too. Quote from: hatshepsut93 on April 23, 2024, 05:13:27 PMWell, fiat money is considered to be fungible, yet it has the same concept of taint. Entities like banks or some companies can freeze and reject transactions if they deemed as high risk by their algorithms, for example coming from a blacklisted country. Or when a person with no financial history suddenly deposits a huge sum in cash. This is the reality of digitalization. It allows much easier control on the monetary flows than physical money, and governments don't want something digital yet anonymous like Monero to be widespread, so they will never allow it to be accepted by legally operating businesses. Even physical money cannot always be considered fungible...Banknotes have serial numbers for a reason.Only metallic coins (either gold, or fiat money ones) can be considered truly fungible, since they have no serial numbers by design.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "April 23, 2024, 05:56:13 PM",
      "body": "Quote from: un_rank on April 23, 2024, 05:06:18 PMThe Bitcoin network does not filter transactions and UTXOs, everything can go through as long it is properly validated, meaning it is fungible. BUT...the bitcoin network does filter transactions and UTXO's thats its jobyou can only spend a utxo whos endpoint is unspent and has a valid path back to its original blockreward creationand its current endpoint is known and associated with a publickey which the network knows which publickey can move which fundsyou cant randomly pick any utxo and use it.. you have to use one thats been assigned to you and you have the keypair of to move that..that is the security of the network. preventing random users treating all coin the same and swappable.. you only get control of coin you control and the network doesnt let people pick random utxo/coinsthere is only one way to stop one taint path and create a new utxo with no taint path, and blackhat does not like people talking about it as it ruins his business plan of mixingbut for all other people interestedif you do a deal with a mining pool whereby you will pushtx your coin privately to them as a transaction spending your coin as fee's (to them). (destroying coinage/taint) that then becomes fresh new coin as a coin reward(the fee excess)this new coin has no taint(it appears on blockchain as new mined coin reward). which a pool can then give to a user as new coin, clean coin.. enjoy a proper way to 'clean coin', just have to do a deal with a mining pool to get it",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptosize",
      "created_time": "April 23, 2024, 06:25:37 PM",
      "body": "Quote from: franky1 on April 23, 2024, 05:56:13 PMbut for all other people interestedif you do a deal with a mining pool whereby you will pushtx your coin privately to them as a transaction spending your coin as fee's (to them). (destroying coinage/taint) that then becomes fresh new coin as a coin reward(the fee excess)this new coin has no taint(it appears on blockchain as new mined coin reward). which a pool can then give to a user as new coin, clean coin.. enjoy a proper way to 'clean coin', just have to do a deal with a mining pool to get itHow do you know that your transaction will end up in that specific pool and not somewhere else (maybe even a random solo miner)?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}