{
  "id": "topic_5443815",
  "title": "Hydrogen",
  "author": "Hydrogen",
  "created_time": "March 06, 2023, 11:18:01 PM",
  "content": "QuoteA rapid acceleration in Bitcoin’s pace of global adoption could catapult the top cryptocurrency to staggering new heights, according to quantitative analyst PlanB.In a series of tweets, the pseudonymous strategist says the most powerful part of Bitcoin’s adoption s-curve is around the corner.The adoption s-curve is often used to track the cumulative rate at which people adopt breakthrough technologies.According to PlanB, BTC’s pace of adoption is about to witness an unprecedented level of acceleration that could bring its price to as high as $10 million by 2028.“If Bitcoin adoption is now 1-5%, then we will enter the vertical of the S-curve next couple of years. On log scale (left) this just means more exponential growth until 50% adoption.For the linear thinkers (right) everything will change. Bitcoin might be substantially undervalued…Although I enjoyed Bitcoin adoption the last 10+ years (especially the investment returns), I am really looking forward to the vertical part of the S-curve in the next halving period (2024-2028).”Image link:  https://i.ibb.co/XSjMwRy/stock-to-flow-btc.jpgPlan B is well-known for applying the stock-to-flow scarcity model to Bitcoin (BTC), which divides the total supply of an asset by the new supply entering the market to forecast future moves in price.Based on that model, PlanB predicts BTC’s next top will happen around 2025, with its price landing between $100,000 to $1,000,000.https://dailyhodl.com/2023/03/04/bitcoin-btc-targeting-10000000-amid-rapid-global-crypto-adoption-according-to-quant-analyst-planb/....It has been awhile since we've heard about the \"stock-to-flow\" model of technical analysis being applied to bitcoin's current value. Here we have some commentary offered by quants at PlanB. I'm not certain if quants have good track records as independent traders. I think they tend to emphasize arbitrage trading in algorithmic models with dark pools. Which used to be very profitable in its inception and early history. These days I don't know if dark pools have become heavily saturated with many trading bots attempting to execute similar trading strategies. But it has been a long time since algorithmic arbitrage trading has claimed consistently large profits, that I know of. That said $10 million dollars for one BTC sounds good to me. Their prediction of $100,000 to $1 million for one BTC around 2025 also sounds fantastic.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5443815",
  "comments": [
    {
      "author": "Ozero",
      "created_time": "March 22, 2023, 01:27:11 PM",
      "body": "So far, the price of one million dollars for bitcoin still seems to be a fact. Well, it's too early to talk about 10 million dollars. We see that after each large rise in prices in the cryptocurrency market, a long and deep fall follows. In November 2021, Bitcoin reached a price of over $64,000, after which there was a long fall and now its price is at $28,000. To dream of a million dollars, bitcoin first needs to consistently overcome the price of one hundred thousand, and then several hundred thousand dollars. After the next halving in 2024, there is a good chance to see something similar at the end of 2024 and in 2025.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Faisal2202",
      "created_time": "March 22, 2023, 03:32:25 PM",
      "body": "Quote from: Hydrogen on March 06, 2023, 11:18:01 PMI'm not certain if quants have good track records as independent traders.Well, all i can say PlanB is the creator of the S2F (stock-to-flow) model, and he/she is good at it. talking about its usage in previous times, can not be assumed as most people use it but no one exposes their tricks. Because they have to sell their courses too (trading and prediction courses). I am not an expert/senior like you, i am never familiar with the existence of such a model but always have an idea of demand and supply ratio because from what i have learned about S2F it's the same thing. (if i am wrong please correct me then). Overall, if things go as planned or predicted by PlanB then that is beneficial for everyone and this could answer the queries of people who always ask, Can BTC end poverty, or should we invest our savings in it, or should we use it as a retirement saving. etc. etc. Quote from: Hydrogen on March 06, 2023, 11:18:01 PMI think they tend to emphasize arbitrage trading in algorithmic models with dark pools. i cannot think of any way, what the relation between S2F and the above two terms (ATA and DP) is. As you mentioned, indirectly, Dark pools and arbitrage trading algorithms are of great benefit to traders as well as to the market. But how exactly do three of them come to a single point of relevancy? (note* actually still in the learning phase if you don't mind my question)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "el kaka22",
      "created_time": "March 23, 2023, 08:34:35 PM",
      "body": "These type of calculations are usually just funny to me, and I understand that people try to put some type of belief in it and I get that but that doesn't mean that it's true, it's usually quite wrong and will not really work out in the end.I hope that people could realize that and could stay away from these type of dreamy stuff because if it doesn't happen the way you want, then you could be too much upset over it and miss out the realistic targets that could make you richer. I won't really invest based on these type of goals, I invest because I believe it will be a lot of money in the distant future but at the same time we are not going to end up with anything bad neither.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Smartprofit",
      "created_time": "March 24, 2023, 11:51:57 AM",
      "body": "I take it this is a bitcoin price prediction for 2028 (i.e. a five year prediction)?  In order to assess the probability of this forecast, in my opinion, it is necessary to simulate the world that will be on planet Earth in 5 years.  This is a very difficult task.  Currently, there are several sustainable trends in the world that will definitely change our world by 2028.  What trends do I mean?  1. The collapse of world globalization, 2. The formation of two opposing military-political blocs (the Western world (USA, European Union, Japan, South Korea, Australia, Canada) and the Eastern world (China, Russia, North Korea, Iran, Syria)), 3. The development of the virtual world and  metaverses,4. The development of neural networks and artificial intelligence, 5. The introduction of the CBDC system.  In a rapidly changing world, the first cryptocurrency (Bitcoin) should unite all earthlings into a single humanity.  Bitcoin is a universal value.  In 5 years, it can become the basis of trust between different countries and blocs of countries.  I would not be surprised if in 5 years Bitcoin becomes an integral part of the gold and foreign exchange reserves of the Central Banks of most countries.  And this will allow him to reach the price of 10,000,000 US dollars.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "March 24, 2023, 12:05:14 PM",
      "body": "Quote from: Smartprofit on March 24, 2023, 11:51:57 AMWhat trends do I mean?  1. The collapse of world globalization, ~In a rapidly changing world, the first cryptocurrency (Bitcoin) should unite all earthlings into a single humanity.  For sure you have no idea what globalization means if you think it will fail but at the same time Bitocin will manage to unite all earthlings, which is the definition of globalization.Quote2. The formation of two opposing military-political blocs (the Western world (USA, European Union, Japan, South Korea, Australia, Canada) and the Eastern world (China, Russia, North Korea, Iran, Syria)),Since you actually believe that, lol, just hilarious, how about some more \"military\" blocks- The Islands Empire (Nauru, Tuvalu, Maldives, Barbados, Palau)-  The Absurdistan Coalition ( Bartovia, Cagliostro, Emmeria, Genosha, Inazuma, Shangri-La)I got more if you want  Quote from: el kaka22 on March 23, 2023, 08:34:35 PMThese type of calculations are usually just funny to me, and I understand that people try to put some type of belief in it and I get that but that doesn't mean that it's true, it's usually quite wrong and will not really work out in the end.It's quite funny, a month ago nobody dreamed of 50k and was buying spare sets of underwear to prepare for under 10k and now suddenly after going up 50%, we're talking about $10 million in 4 years. But why stop at 10 million, how about 76 trillion in 12 years? Any problem with it?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SyndicateLabs",
      "created_time": "March 24, 2023, 12:13:33 PM",
      "body": "It reminds me of some of the stories about prophesying the future, there are some things that I learn through stories like this don't take it for granted and let's be more simple where we are now.Regarding the value of BTC over time I don't feel much of a problem, as many people have mined on how much it has to gain even though they know it will increase  , a bit contradictory but very time consuming to argue about something unimportant.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "posi",
      "created_time": "March 24, 2023, 12:16:20 PM",
      "body": "Dreams are not taxed, so we have the right to dream, but don't be too delusional because if it's not as expected, we will be very disappointed and depressed. I prefer reality over illusion, and my target for the next bull season will be 120k-150k, then I think we will recalculate according to bitcoin's popularity in the future and come up with other targets. If I remember correctly, PlanB predicted bitcoin would hit $100k in 2021, but that didn't happen. We haven't hit the $100k target yet, so don't think about the higher ATH.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "March 24, 2023, 12:37:51 PM",
      "body": "In my opinion there is a very high chance that we see $1 million target reached somewhere in the next 5 years but $10 million sounds unlikely to me. $1 mil itself can be the peak of a bubble not a sustained price (like $20k in 2017).There is a couple of things to consider here though.We have the global economy changing very fast, a massive shift from West to East with the Western economy collapsing. This New World Order will create a lot of chaos in the coming years. This chaos will create a lot of volatility in bitcoin and it could slow down that adoption.Namely the recession going on mostly in the West means less investments in bitcoin ergo a smaller rise. We've seen this over the past year when the bitcoin guaranteed bull market was significantly postponed and eventually was replaced by a bear market where price (for the first time) went below the previous ATH (ie. below $20k) after the crash.That's the negative part, the positive part is the collapse of US dollar.Considering how everyone measures bitcoin price in terms of dollar, as dollar becomes weaker (gets dumped) bitcoin price should go up against it. For now that dump is slow specially since FED is artificially keeping it strong by manipulating the interest rates but it is a catastrophe waiting to happen specially since US regime is about to print trillions of dollars to rescue its failing economy. That is in addition to dedollarisation that is happening across the globe that weakens US dollar even more.That rise against dollar itself will attract a lot of additional investment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husires",
      "created_time": "March 24, 2023, 12:41:24 PM",
      "body": "Is the S2F (stock-to-flow) model valid? I thought it was no longer the case for a while, especially since over the past year he has insisted that the price of bitcoin will exceed $10,000 in 2021.All the prices mentioned in the model are very optimistic and I know a lot of people have lost their money because of the confidence in that model so don't build too much hope on it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Smartprofit",
      "created_time": "March 24, 2023, 02:33:05 PM",
      "body": "Quote from: stompix on March 24, 2023, 12:05:14 PMQuote from: Smartprofit on March 24, 2023, 11:51:57 AMWhat trends do I mean?  1. The collapse of world globalization, ~In a rapidly changing world, the first cryptocurrency (Bitcoin) should unite all earthlings into a single humanity.  For sure you have no idea what globalization means if you think it will fail but at the same time Bitocin will manage to unite all earthlings, which is the definition of globalization.Quote2. The formation of two opposing military-political blocs (the Western world (USA, European Union, Japan, South Korea, Australia, Canada) and the Eastern world (China, Russia, North Korea, Iran, Syria)),Since you actually believe that, lol, just hilarious, how about some more \"military\" blocks- The Islands Empire (Nauru, Tuvalu, Maldives, Barbados, Palau)-  The Absurdistan Coalition ( Bartovia, Cagliostro, Emmeria, Genosha, Inazuma, Shangri-La)I got more if you want  Quote from: el kaka22 on March 23, 2023, 08:34:35 PMThese type of calculations are usually just funny to me, and I understand that people try to put some type of belief in it and I get that but that doesn't mean that it's true, it's usually quite wrong and will not really work out in the end.It's quite funny, a month ago nobody dreamed of 50k and was buying spare sets of underwear to prepare for under 10k and now suddenly after going up 50%, we're talking about $10 million in 4 years. But why stop at 10 million, how about 76 trillion in 12 years? Any problem with it?In my opinion, in the world, trends always coexist with anti-trends (and this is normal). Yes, the rejection of globalization is indeed a disaster. After all, it was globalization that contributed to the development of scientific and technological progress and an increase in the standard of living of most people on planet Earth. People have mastered the entire territory of the planet and have established universal laws and rules everywhere, but something seems to have gone wrong .... We see an increase in mistrust in the world between different countries, we also saw the closure of all borders during the Covid-19 coronavirus pandemic  . And now international logistics is no longer working as well as it used to. Countries are trying to localize production in their territories, no longer counting on the international division of labor. The idea of ​​abandoning the US dollar as an international reserve currency arises, new wars begin, most countries are in a hurry to introduce CBDC....At the same time, the Internet does not seem to be in danger of disintegration into separate regional segments. And with regard to bitcoin, I remain an optimist, in my opinion, even in the context of the widespread introduction of national CBDCs, the digital decentralized world currency will not lose its relevance (on the contrary, it will become absolutely necessary for communication and interaction between people living in different countries)!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "March 24, 2023, 03:49:52 PM",
      "body": "QuoteBased on that model, PlanB predicts BTC’s next top will happen around 2025, with its price landing between $100,000 to $1,000,000.For such speculation, we do not need any plans B or anything similar, because the price will probably reach $100k, and certainly will not exceed $1 million. For me personally, the people who \"play\" with these speculations are no better than the one who first started them and got his 5 minutes of fame - and obviously others also want at least a part of that fame.The value of BTC in $1+ million is something you can fantasize about, but it won't happen in the near future (at least 10 years), and maybe even then if the central banks and the super rich don't get involved in the whole thing. In addition, even if this happens one day, inflation will make $1 million have far less purchasing power than it has today.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CoinEraser",
      "created_time": "March 24, 2023, 04:03:38 PM",
      "body": "In the last few days, the predictions have become more and more daring. On the one hand the 1$ million in 90 days and now the 10$ million prediction in 2028. No offense. We all want such prices, but we are still a long way from that. First the $100k has to be cracked. Once that happened, the way is possible at a higher price. But we're just not that far yet. Rather, I think we can expect $1 million in 8 to 10 years if everything continues to be as positive as it has been in recent years. Therefore, one should not rely on a very high bitcoin price too early, otherwise one will only be disappointed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "odunybiz",
      "created_time": "March 24, 2023, 10:57:26 PM",
      "body": "Can this happen? Many billionaires will be seen in the world if this happen. I know Bitcoin will definitely increased in price but not to that extent. I'm hoping for $100,000 I'm the next bullrun.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "serjent05",
      "created_time": "March 24, 2023, 11:13:28 PM",
      "body": "Quote from: Hydrogen on March 06, 2023, 11:18:01 PMThat said $10 million dollars for one BTC sounds good to me. $10 million sounds good to anyone who holds BTC but reality check, it is too far from reality.Quote from: Hydrogen on March 06, 2023, 11:18:01 PMTheir prediction of $100,000 to $1 million for one BTC around 2025 also sounds fantastic.$100k for 1 BTC on 2025 sounds not only fantastic but realistic for me.  Forget the $ 1 million, we will only get disappointed once we hope for that to happen.  Let it come if it will come, lets be contented for $100k for now  .Honestly, that $10m prediction is too optimistic which makes it fall under speculation that has no fundamental base at all.  But whatever, I'll just fill my stash with BTC just in case...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "livingfree",
      "created_time": "March 24, 2023, 11:36:30 PM",
      "body": "We all want to be there when it hits $10M but having that timeline around 2025, I think that's still too early but it's quite long for many things to happen and like the governments pushing together with financial institutions to have it there.Quote from: odunybiz on March 24, 2023, 10:57:26 PMCan this happen? Many billionaires will be seen in the world if this happen. I know Bitcoin will definitely increased in price but not to that extent. I'm hoping for $100,000 I'm the next bullrun.Yes, it can.It's like going back to the time when bitcoin was just worth a $1 or even cents and we're not expecting it to hit $69,000 after some time. $100k is already great to me, $1M is greater and if it tends to be at $10M, that's the greatest.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cuenta Alternativa",
      "created_time": "March 25, 2023, 04:37:20 AM",
      "body": "Quote from: Husires on March 24, 2023, 12:41:24 PMIs the S2F (stock-to-flow) model valid? I thought it was no longer the case for a while, especially since over the past year he has insisted that the price of bitcoin will exceed $10,000 in 2021.All the prices mentioned in the model are very optimistic and I know a lot of people have lost their money because of the confidence in that model so don't build too much hope on it.Optimistic? He is high on drugs. What he has done when the data has falsified his predictions has been instead of owning his mistake, to continue to give increasingly exaggerated price predictions. When his model had already been shown to be false I remember him insisting that we could reach half a million in this cycle or thereabouts. Now he spouts this. Doesn't he get tired of making a fool of himself? The S2F makes some sense but it is not a reliable predictive model, much less an accurate one, even less so if every time the predictions are falsifie by the low price he raises the prediction target up and upper.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fiatless",
      "created_time": "March 25, 2023, 07:33:02 AM",
      "body": "Quote from: odunybiz on March 24, 2023, 10:57:26 PMCan this happen? Many billionaires will be seen in the world if this happen. I know Bitcoin will definitely increased in price but not to that extent. I'm hoping for $100,000 I'm the next bullrun.With bitcoin nothing is possible. The currency is built to get to any height without restrictions. I might be part of the beneficiary of this price increase and some of my dreams will come. But my reservation concerning such a prediction is that it attracts uninformed investors that quickly see bitcoin as money doubling scheme to invest in. When the price fails to get to this predicted point, they go on the media spreading fake news about bitcoin. I also agree that the $100,000 benchmark is attainable.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DrBeer",
      "created_time": "March 25, 2023, 08:19:27 AM",
      "body": "The forecast is interesting, and of course \"warms the soul\"! This means that you can very easily become a billionaire just by waiting 5 years But back to reality. Let's assume that the forecast came true. And this means that the economic indicator of the cue ball will be \"backed\" by real world assets by 210.000.000.000.000.Or 210 trillion dollars! Now the question arises - what should happen in the world, and in the global economy (the scale of the assessment - just such a level), for this to come true? I suppose - the transition of the world economy from the usual dollar to .. bitcoin. This is perhaps the only model where such a scenario is possible. But the next question arises - will the world economy switch to Bitcoin? And realistically, the forecast in the title of the topic - corresponds to the answer to the question \"will the world economy switch to Bitcoin\"?PS. I save 10 BTC, I want to be a billionaire",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "March 25, 2023, 12:05:01 PM",
      "body": "Quote from: DrBeer on March 25, 2023, 08:19:27 AM~snip~But the next question arises - will the world economy switch to Bitcoin? And realistically, the forecast in the title of the topic - corresponds to the answer to the question \"will the world economy switch to Bitcoin\"?I don't see any way how this could happen, because the world is centralized and the whole civilization stands on the pillars of centralized mechanisms. The question arises whether it is even possible to replace these mechanisms in a \"painless\" way, or an even better question - why would those who built them for hundreds or even thousands of years agree to destroy the mechanisms that enable them to control people, all because of something over which won't have even close to that kind of control?Even if the western economy decides to no longer use the US dollar, pound or euro, what about all those billions of people who live in countries where Bitcoin is banned or is in some gray area where its use is not something that governments encourage. Again, for those who want to live in fantasy, they can always be improved in a very simple way - just add another zero. Bitcoin will probably be worth $100 000 000 one day",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}