{
  "id": "topic_5461594",
  "title": "Faisal2202",
  "author": "Faisal2202",
  "created_time": "July 31, 2023, 03:27:09 PM",
  "content": "Yes as the title says, first Bitcoin ETF got approved for europeans now they could trade Bitcoin ETF from official platform. It have the ticker of \"BCOIN\". The ETF platforms is knows as JacoBTCi. Well, this is what i have not been expecting because i didn't heard about it before. Most of the news outlet was talking about only Black Rock.Quote🟠 NEW: First European Bitcoin ETF is now live 🙌Institutional investors from the following countries are able to participate in it:🇳🇱 The Netherlands🇬🇧 United Kingdom🇱🇺 Luxembourg🇨🇭 Switzerland🇩🇪 Germany🇩🇰 Denmark🇸🇪 Sweden🇫🇮 Finland🇦🇹 Austria🇮🇪 IrelandThe news outlets saying about this platform is it already got approval of ETF back in 2021 but was not live till then (source).But according to another latest news, they says this platform is going to launch its own Exchange for ETFs trading very soon. (Source).The thing is why this ETFs is so underrated then other. Because such news must have good impact on the market as well but it didn't. Well, i think due to the unavailability of the exchange maybe as according to news it was not live back then but now i think it's live. Made this topic to know more about it from you guyz.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5461594",
  "comments": [
    {
      "author": "Dunamisx",
      "created_time": "July 31, 2023, 03:36:36 PM",
      "body": "Live or not we are not that interested about bitcoin ETF because it's another thing entirely outside the bitcoin network, if every applications on bitcoin ETF is approved does not change anything to the bitcoin network because bitcoin EFT should be well understood not to be bitcoin itself but commodity items investors stock and pegged with bitcoin price, regarding your news, if this is an update or an already existing news doesn't make much difference as well since it does not implicate any change or difference to the bitcoin network.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Upgrade00",
      "created_time": "July 31, 2023, 03:46:16 PM",
      "body": "Quote from: Dunamisx on July 31, 2023, 03:36:36 PMLive or not we are not that interested about bitcoin ETF because it's another thing entirely outside the bitcoin network, The price reaction the last time there was news about Bitcoin ETF showed that it influences traders and the market in general, if it's a big enough news.The news about this ETF is under reported maybe cause it's 1 year late in its launch, and it is not going to have a similar impact on the Bitcoin price.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dunamisx",
      "created_time": "July 31, 2023, 04:00:20 PM",
      "body": "Quote from: Upgrade00 on July 31, 2023, 03:46:16 PMQuote from: Dunamisx on July 31, 2023, 03:36:36 PMLive or not we are not that interested about bitcoin ETF because it's another thing entirely outside the bitcoin network, The price reaction the last time there was news about Bitcoin ETF showed that it influences traders and the market in general, if it's a big enough news.The news about this ETF is under reported maybe cause it's 1 year late in its launch, and it is not going to have a similar impact on the Bitcoin price.Thanks for such observation and idea given on this to shed more light, but on a real life experience, bitcoin ETF shouldn't be a drive to the bitcoin market even though it is believed that, cryptocurrency news has a little contribution it give to affect the market price of bitcoin especially when there's a news release on important aspect of bitcoin or cryptocurrency, seing that ETF is a centralized institutionized decisions is not all about bitcoin but how they make use of bitcoin demands and supply value determine what they set for their own stocks which makes it more of institutional decisions and not what may be expected to make a push on bitcoin market, well also, there may be coincidental occurrence in such occassions which makes me believe that this release may not be on target as the first one that goes along with the market shift then, but i really tot your point in what makes their difference from what you gave as well.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sim_card",
      "created_time": "August 01, 2023, 03:37:13 AM",
      "body": "Assuming this news was coming from US,it will surely have a little impact on bitcoin,but since it is from the Europe and a different exchange like JacoBTCi that isn't popular and has been around the corner for over a year that is why there is no impact on bitcoin price. We are still waiting for ETF approval from the US to see if theirs will have an impact on bitcoin price with Black Rock. We needs big news that will have an impact on bitcoin price from which we experienced last time when SEC accepted to look into the approval of ETF.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "adaseb",
      "created_time": "August 01, 2023, 03:58:24 AM",
      "body": "This isn’t anything new. Etfs are approved for many Bitcoin funds and have been for a while. Usually there is no market impact because people only care if it gets approved by the SEC.In a couple weeks we will know because the first ARK etf is suppose to reach its deadline for its application. If it’s get approved then most likely so will the other etfs and we should finally break out of this range and head higher.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hd49728",
      "created_time": "August 01, 2023, 04:04:18 AM",
      "body": "Quote from: Faisal2202 on July 31, 2023, 03:27:09 PMYes as the title says, first Bitcoin ETF got approved for europeansThe title is not clear and it is confusing.You must have a title like \"First Bitcoin Spot ETF got approved in Europe\". It is a first Bitcoin Spot ETF in history, to emphasize its meaning for Bitcoin community. It is not a first Bitcoin ETF in general because many Bitcoin Futures ETFs were approved in the past.Spot and Futures ETFs are very different types and the USA. already approved some Bitcoin Futures ETFs, they only have yet approved any Bitcoin Spot ETF.6 Best Bitcoin ETFs Of August 2023QuoteETF (ticker)                                                  AUMProShares Bitcoin Strategy ETF (BITO)                   $889 millionProShares Short Bitcoin ETF (BITI)                           $100 millionVanEck Bitcoin Strategy ETF (XBTF)                           $39 millionValkyrie Bitcoin Strategy ETF (BTF)                           $27 millionSimplify Bitcoin Strategy PLUS Inc ETF (MAXI)           $21 millionGlobal X Blockchain & Bitcoin Strategy ETF (BITS)   $11 million",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Don Pedro Dinero",
      "created_time": "August 01, 2023, 04:22:48 AM",
      "body": "I just searched my broker and I don't see it, so I couldn't buy it, at least for the moment. Maybe it will be added later. Well, anything that normalises bitcoin for me is welcome, and this does it, although it is a derivative product that moves away from the original idea, but if we are going to reach mass adoption it will be through small steps that normalise bitcoin on a day-to-day basis, like this one.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "August 01, 2023, 05:43:07 AM",
      "body": "Quote from: Faisal2202 on July 31, 2023, 03:27:09 PMThe thing is why this ETFs is so underrated then other. Because such news must have good impact on the market as well but it didn't. Well, i think due to the unavailability of the exchange maybe as according to news it was not live back then but now i think it's live. Made this topic to know more about it from you guyz. Generally speaking ETF is in my opinion an over-hyped thing which doesn't have nearly as much an impact as some people have been saying it should have over the past 5-6 years. Specially since there have been a bunch of different ETFs in different countries around the globe without much impact.Besides I'd go as far as saying ETF by definition is the exact opposite of what Bitcoin is made for. When you want to buy bitcoin, you should buy bitcoin directly instead of buying the garbage some investment company sells to you in the name of bitcoin as a middle man. After all Bitcoin was created to eliminate the middle man not add more of them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kakmakr",
      "created_time": "August 01, 2023, 05:50:43 AM",
      "body": "Quote from: adaseb on August 01, 2023, 03:58:24 AMThis isn’t anything new. Etfs are approved for many Bitcoin funds and have been for a while. Usually there is no market impact because people only care if it gets approved by the SEC.In a couple weeks we will know because the first ARK etf is suppose to reach its deadline for its application. If it’s get approved then most likely so will the other etfs and we should finally break out of this range and head higher. The SEC does not have any influence over European financial matters, because they are governed by the European Securities and Markets Authority (ESMA) In any way, it does not matter... because it was approved and it is live! The thing is ETF's are just another Fiat tool for the old schooled investors and centralized to boot.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fiatless",
      "created_time": "August 01, 2023, 06:51:29 AM",
      "body": "Quote from: Faisal2202 on July 31, 2023, 03:27:09 PMThe thing is why this ETFs is so underrated then other. Because such news must have good impact on the market as well but it didn't. Well, i think due to the unavailability of the exchange maybe as according to news it was not live back then but now i think it's live. Made this topic to know more about it from you guyz. The size of the US cryptocurrency market might be the reason why the news of BlackRock, Fidelity, and others applying for Bitcoin spot ETF approval is getting more attention than others. The US has the highest number of crypto users making it the most important crypto market in the world. The US economy is also seen as a role model of other economies which means that policies made in that country will soon be copied by others. Black Rock and Fidelity are all big firms with large financial bases. They will attract wider attention from the media because of their influence than small firms like JacoBTCi.Quote from: pooya87 on August 01, 2023, 05:43:07 AMBesides I'd go as far as saying ETF by definition is the exact opposite of what Bitcoin is made for. When you want to buy bitcoin, you should buy bitcoin directly instead of buying the garbage some investment company sells to you in the name of bitcoin as a middle man. After all Bitcoin was created to eliminate the middle man not add more of them.ETF is a clear departure from the original reason for the creation of bitcoin. But I like to see the positive impact of these moves by these middlemen. More people will know about bitcoin and gradually they will learn that they don't needs to rely on these exchanges to use bitcoin. Just as FTX made the use of decentralized wallets more popular, an event in the future will keep promoting the need for people to own and control their keys.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "August 01, 2023, 07:14:20 AM",
      "body": "Quote from: Kakmakr on August 01, 2023, 05:50:43 AMQuote from: adaseb on August 01, 2023, 03:58:24 AMThis isn’t anything new. Etfs are approved for many Bitcoin funds and have been for a while. Usually there is no market impact because people only care if it gets approved by the SEC.In a couple weeks we will know because the first ARK etf is suppose to reach its deadline for its application. If it’s get approved then most likely so will the other etfs and we should finally break out of this range and head higher. The SEC does not have any influence over European financial matters, because they are governed by the European Securities and Markets Authority (ESMA) In any way, it does not matter... because it was approved and it is live! The thing is ETF's are just another Fiat tool for the old schooled investors and centralized to boot.   You know what, I don't think investors buying a bunch of ETFs from a custodian who keeps the bitcoins around is going to make much of a price impact, because the bitcoins are already in a custody, and investors are trading with a surrogate form of Bitcoin that is not connected to the cryptocurrency exchanges.Then again, most people on CEXes will try to react somehow to this by buying in order to achieve this effect. It's a pretty old-school phenomenon.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "avikz",
      "created_time": "August 01, 2023, 09:42:59 AM",
      "body": "Not sure why there is so high craze about the ETF. Usually an ETF is an investment instrument to make money out of thin air. Very few ETFs hold actual asset under management. Majority of them just play on the market price of an asset. Do we know if this BCoin is going to be a physically settled one? If not, that's no point! It's just not going to do any good to the crypto market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GreatArkansas",
      "created_time": "August 01, 2023, 09:48:59 AM",
      "body": "Quote from: Dunamisx on July 31, 2023, 03:36:36 PMLive or not we are not that interested about bitcoin ETF because it's another thing entirely outside the bitcoin network, if every applications on bitcoin ETF is approved does not change anything to the bitcoin network because bitcoin EFT should be well understood not to be bitcoin itself but commodity items investors stock and pegged with bitcoin price, regarding your news, if this is an update or an already existing news doesn't make much difference as well since it does not implicate any change or difference to the bitcoin network. Even we don't want ETF for Bitcoin. Time will come or already started, they can file ETF for Bitcoin. This is also what happened in Gold before.For me, ETF is not good for Bitcoin because the essence of owning Bitcoin will be gone, but these people really want it.For me, ETF will help Bitcoin to introduce to more people like spreading the word about Bitcoin to the majority, and will help people will hold Bitcoin for investment (not holding actual Bitcoin for people).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hd49728",
      "created_time": "August 01, 2023, 10:50:11 AM",
      "body": "Quote from: Don Pedro Dinero on August 01, 2023, 04:22:48 AMI just searched my broker and I don't see it, so I couldn't buy it, at least for the moment. Maybe it will be added later. Well, anything that normalises bitcoin for me is welcome, and this does it, although it is a derivative product that moves away from the original idea, but if we are going to reach mass adoption it will be through small steps that normalise bitcoin on a day-to-day basis, like this one. According to the news, it will be available for trading in late of this year. It's a plan and we will never know it will exist in late of this year or will be delayed till 2024. I am keen on a next year because it will bring better effects in a bull run than in a bearish year like 2023.Delay can be their plan or can be because of technical difficulty and problems from their developments, security for their exchanges.Quote from: Kakmakr on August 01, 2023, 05:50:43 AMThe SEC does not have any influence over European financial matters, because they are governed by the European Securities and Markets Authority (ESMA) In any way, it does not matter... because it was approved and it is live! The thing is ETF's are just another Fiat tool for the old schooled investors and centralized to boot.   SEC can not approve or reject Bitcoin Spot EFT applications in European countries but SEC is from the USA that is a big nation with big economy. So any news from SEC regulation will have enough big effects on cryptocurrency market.Quote from: GreatArkansas on August 01, 2023, 09:48:59 AMEven we don't want ETF for Bitcoin. Time will come or already started, they can file ETF for Bitcoin. This is also what happened in Gold before.For me, ETF is not good for Bitcoin because the essence of owning Bitcoin will be gone, but these people really want it.For me, ETF will help Bitcoin to introduce to more people like spreading the word about Bitcoin to the majority, and will help people will hold Bitcoin for investment (not holding actual Bitcoin for people).If other markets have ETFs, Futures and Spot, Bitcoin must have the same to infiltrate more into investor communities. It's responsibility of investors who decide to not buy bitcoin directly but invest their money into Bitcoin ETFs. If anything bad happens with Spot ETFs they invest money in, it's their responsibility and they have to accept any bad results in future.People or entities are able to invest in Bitcoin Spot ETFs would be rich ones so I don't think I should feel regret for them because with very bigger capital, they would do more research than me about Bitcoin and they would have better risk management than me.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "aoluain",
      "created_time": "August 01, 2023, 01:17:44 PM",
      "body": "Quote from: avikz on August 01, 2023, 09:42:59 AMNot sure why there is so high craze about the ETF. Usually an ETF is an investment instrument to make money out of thin air. Very few ETFs hold actual asset under management. Majority of them just play on the market price of an asset. Do we know if this BCoin is going to be a physically settled one? If not, that's no point! It's just not going to do any good to the crypto market. I think the hype is based on people thinking or hoping there is a lot of investors waiting for an ETF so they can buy into it, investors with no ambition or knowledgeto own their own.While there may already be ETF's running and along with this one as per the OP >https://jacobiam.com/bitcoin-etf/Its the ETF from the largest global investment company which is very eagerly awaited.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kryptqnick",
      "created_time": "August 01, 2023, 02:20:24 PM",
      "body": "BlackRock and other companies get in the news as those trying to get an ETF approval from the SEC, in the US. The SEC has a notoriously strong position about Bitcoin: it's not anti-Bitcoin, but they think Bitcoin isn't under their competency because it's not a security or a security-like thing.This company didn't get any approval from the US or even the EU, it seems. According to the article, they are registered in Guernsey (an island that has its own jurisdiction and the British monarch as the head of state), which is why they didn't need to meet any harsh requirements.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "August 01, 2023, 02:39:30 PM",
      "body": "Quote from: Faisal2202 on July 31, 2023, 03:27:09 PMThe thing is why this ETFs is so underrated then other. Because such news must have good impact on the market as well but it didn't. Because it's sketchy as hell.Everyone says European but it's registered in Guernsey and if that doesn't ring a bell let me tell you this, Guernsey is a self-governing dependency of the British Crown, part of the Bailiwick of Guernsey but it's not part of the UK nor part of the EU or the EEA.So this fund has a Guernsey FSC license, which is not seen as different from a Curacao gambling license.This thing doesn't meet UCITS standards approval so, no EU pass and also no EU investor protection under UCITS framework within the EU",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Smartvirus",
      "created_time": "August 01, 2023, 02:41:49 PM",
      "body": "Quote from: Dunamisx on July 31, 2023, 04:00:20 PMQuote from: Upgrade00 on July 31, 2023, 03:46:16 PMQuote from: Dunamisx on July 31, 2023, 03:36:36 PMLive or not we are not that interested about bitcoin ETF because it's another thing entirely outside the bitcoin network, The price reaction the last time there was news about Bitcoin ETF showed that it influences traders and the market in general, if it's a big enough news.The news about this ETF is under reported maybe cause it's 1 year late in its launch, and it is not going to have a similar impact on the Bitcoin price.Thanks for such observation and idea given on this to shed more light, but on a real life experience, bitcoin ETF shouldn't be a drive to the bitcoin market even though it is believed that, cryptocurrency news has a little contribution it give to affect the market price of bitcoin especially when there's a news release on important aspect of bitcoin or cryptocurrency, There are a lot that shouldn’t be but is the case and continues to persist for some reasons such as, the rest of the world is yet to get a clear picture of what bitcoin is about or entails. This in turn creates a reaction based on what news is being put out there and whine it comes from a trusted and regulated body.Bitcoin ETF doesn’t speak much about bitcoin itself but, it pegs it to other commodities giving investors the security they need to go ahead in a crypto innovative investment without having much phobia on the happenings within the field.As much as the negative creates a sentiment about the coin and is allowed to stay, the positive just could as well too but, it’s best to stress the fact that, these are carried out within centralized systems, susceptible to hacks and your only leveraged by the broker.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "buwaytress",
      "created_time": "August 01, 2023, 04:46:20 PM",
      "body": "Yawn. Show me just one big company who'll buy this ETF and I'll change my mind about how insignificant they are. Read news history on this ETF on Google and ut fell into the same ETF trap of the US with CME et al. Loads spent on hype and expectation. Delay after delay (I see an article in 2021 during the bullrun, what else eh, about a delay date for 2022 and it's now 2023), and a whimper on launch.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}