{
  "id": "topic_5318330",
  "title": "rdbase",
  "author": "rdbase",
  "created_time": "February 18, 2021, 11:45:36 PM",
  "content": ".. Ross Ulbricht aka. The Dread Pirate Roberts. Didn't know this film was getting done with hollywood all but shutting down mid-last year. So they must of been just doing the special effects in post-production in having it wrap up inorder to be released earlier this year.But here it is for all to watch and see what they thought had happened during the bust of the creator of the silk road website.Now with the boom of bitcoin in early 2021, this is prime time for them to benefit in just how much publicity all of crypto has received, since the likes of what Elon and Saylor have been doing with their contributions thrown into the hype machine since the end of 2020.Here is the outline they had on imdb for it:Philosophical twenty-something Ross Ulbricht creates Silk Road, a dark net website that sells narcotics, while DEA agent Rick Bowden goes undercover to...Actors: Nick Robinson, Jennifer Yun, Jimmi Simpson, Jason Clarke, Paul Blott, Darrell Britt-Gibson, Daniel David Stewart, Kenneth Miller, Alexandra Shipp, Katie Aselton, Lexi Rabe, David DeLao, Beth Bailey, Mark Sivertsen, Will Roppsource: https://www.imdb.com/title/tt7937254trailer: https://youtu.be/LBOBuqBzn7wTagline: The amazon for drugs. Releasing tomorrow according to imdb date, February 19th.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5318330",
  "comments": [
    {
      "author": "Sithara007",
      "created_time": "February 19, 2021, 04:01:07 AM",
      "body": "They are going for a theatre release rather than releasing it on the OTT platforms? I want to see how honest their depiction of Silk Road and DPR is. Perhaps they should mention that the real reason why the FBI went after Silk Road is because the Mexican drug cartels were losing money due to competition from the dark market.. or perhaps that is too much to ask for. I hope at least they would show what happened after the arrest, including some of the rogue FBI agents stealing BTC from the silk road wallet and transferring them to their personal wallets.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "avikz",
      "created_time": "February 19, 2021, 04:25:25 AM",
      "body": "I don't know why I sense that bitcoin will be shown as an evil in this movie! Probably yes! Probably not! I can see only one mention of Bitcoin in the trailer but I really hope it doesn't show bitcoin in negative light. The trailer is already popular with 62k views but the problem is, bitcoin can be shown as an evil money which connected the dots with silk road and its customers. Not good! Especially at this time when bitcoin has started generating a lot of interest among the corporates!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "February 19, 2021, 05:21:37 AM",
      "body": "It seems like it's going to be a good movie. This quote doesn't seem to hit me in a good way though: \"Amazon, for drugs\". We could make assumptions and that might've been the main public selling point of the Silk Road, but how sure are we that that was literally Ross Ulbricht's intention?Quote from: avikz on February 19, 2021, 04:25:25 AMI don't know why I sense that bitcoin will be shown as an evil in this movie! Probably yes! Probably not! I can see only one mention of Bitcoin in the trailer but I really hope it doesn't show bitcoin in negative light.Don't get your hopes up lol.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rhomelmabini",
      "created_time": "February 19, 2021, 05:39:55 AM",
      "body": "Quote from: avikz on February 19, 2021, 04:25:25 AMI don't know why I sense that bitcoin will be shown as an evil in this movie! Probably yes! Probably not! I can see only one mention of Bitcoin in the trailer but I really hope it doesn't show bitcoin in negative light. The trailer is already popular with 62k views but the problem is, bitcoin can be shown as an evil money which connected the dots with silk road and its customers. The curiosity will just grow more and they'll realize that Bitcoin wasn't meant to be used that way, surely an easy to judge mind will think it was meant for evil when it's not unless those who watch read the whole whitepaper too. Quote from: Sithara007 on February 19, 2021, 04:01:07 AMThey are going for a theatre release rather than releasing it on the OTT platforms? I want to see how honest their depiction of Silk Road and DPR is. Perhaps they should mention that the real reason why the FBI went after Silk Road is because the Mexican drug cartels were losing money due to competition from the dark market.. or perhaps that is too much to ask for. I hope at least they would show what happened after the arrest, including some of the rogue FBI agents stealing BTC from the silk road wallet and transferring them to their personal wallets. That would be worth to know in the movie but I wouldn't be that surprised if there is/are alterations or the production doesn't know the whole story, just my opinion.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Vishnu.Reang",
      "created_time": "February 19, 2021, 05:50:12 AM",
      "body": "Quote from: avikz on February 19, 2021, 04:25:25 AMI don't know why I sense that bitcoin will be shown as an evil in this movie! Probably yes! Probably not! I can see only one mention of Bitcoin in the trailer but I really hope it doesn't show bitcoin in negative light. The trailer is already popular with 62k views but the problem is, bitcoin can be shown as an evil money which connected the dots with silk road and its customers. Not good! Especially at this time when bitcoin has started generating a lot of interest among the corporates! This movie was not produced by a big production house and given the pandemic season, I don't think that it will receive much attention within the United States. Less than 63,000 views in three weeks, despite being posted in the official YouTube channel of the Lionsgate Movies is quite disappointing for the production team. That said, I don't want to comment much about the content, before I get to watch the movie. BTW, did the movie producers got permission from Ross Ulbricht? In the movie they are using his real name and they are claiming that the story is based on what actually happened. So if Ross hasn't given them permission, they can't really release this movie. Everyone seems to have forgotten about Ross. A pardon from Donald Trump was his last opportunity to be freed. But now it is 100% sure that he will die in prison without ever seeing the outside world again. That is the price you pay, when you go against the authorities. After a while, everyone forgets about these guys. I hardly see anyone talking about Aaron Swartz nowadays. On the other hand, the individual who is responsible for his death (Carmen Ortiz) is now in a very powerful position.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "davis196",
      "created_time": "February 19, 2021, 06:00:19 AM",
      "body": "It seems that this is an independent release,rather than a Hollywood blockbuster with 100 million dollar budget and A-list Hollywood stars in the cast.I guess that nobody outside the crypto industry and the tech world(cyber punks,nerds,etc)would pay attention to this movie.The \"average Joe\" doesn't know who Ross Ulbricht actually is and what is Silk Road.This movie has nothing to do with Bitcoin,so I don't know why OP posted this thread in the Bitcoin discussion forum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "amishmanish",
      "created_time": "February 19, 2021, 06:09:02 AM",
      "body": "Quote from: Vishnu.Reang on February 19, 2021, 05:50:12 AM--snip--But now it is 100% sure that he will die in prison without ever seeing the outside world again. That is the price you pay, when you go against the authorities. Sounds bad but that is the cold reality. Snowden, Assange, Ross or anyone else who puts themselves on the line to go against the establishment inevitably end up isolated or incarcerated. Those are just the cases that gain attention. The numerous whistleblowers and truth-seekers within society/ organizations who choose to do the \"right thing\", almost always pay the price for not compromising with their consciences.Just hope that the movie will actually treat him as the brilliant, idealistic kid he was who ended up playing someone else's game of intimidation and reprisal.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "3meek",
      "created_time": "February 19, 2021, 06:37:18 AM",
      "body": "I'm sure it will be an interesting film!Very much I want to watch it, Ross is an interesting man, thanks to whom bitcoin now has achieved such success!I also really liked Nick Bilton's book about Ross Ulbricht... I recommend everyone to read it!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Vishnu.Reang",
      "created_time": "February 19, 2021, 07:18:10 AM",
      "body": "Quote from: amishmanish on February 19, 2021, 06:09:02 AMQuote from: Vishnu.Reang on February 19, 2021, 05:50:12 AM--snip--But now it is 100% sure that he will die in prison without ever seeing the outside world again. That is the price you pay, when you go against the authorities. Sounds bad but that is the cold reality. Snowden, Assange, Ross or anyone else who puts themselves on the line to go against the establishment inevitably end up isolated or incarcerated. Those are just the cases that gain attention. The numerous whistleblowers and truth-seekers within society/ organizations who choose to do the \"right thing\", almost always pay the price for not compromising with their consciences.Just hope that the movie will actually treat him as the brilliant, idealistic kid he was who ended up playing someone else's game of intimidation and reprisal.Snowden, Assange.etc still have a chance. They have a lot of people supporting them. That is not the case of Ross Ulbricht. Even if he has any supporters, those people are not going to come out in the open for the fear of reprisals. The FBI has put all sort of charges against Ross, such as drug trafficking, murder, money laundering, blackmail.etc. Anyone who supports him will be quickly branded as a supporter of illegal narcotics trade. Snowden and Assange doesn't carry such baggage. Snowden is living in Moscow as a fugitive, while Assange is currently fighting extradition. They are in a much better position when compared to Ross.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lorence.xD",
      "created_time": "February 19, 2021, 07:38:14 AM",
      "body": "Quote from: Sithara007 on February 19, 2021, 04:01:07 AMThey are going for a theatre release rather than releasing it on the OTT platforms? I want to see how honest their depiction of Silk Road and DPR is. Perhaps they should mention that the real reason why the FBI went after Silk Road is because the Mexican drug cartels were losing money due to competition from the dark market.. or perhaps that is too much to ask for. I hope at least they would show what happened after the arrest, including some of the rogue FBI agents stealing BTC from the silk road wallet and transferring them to their personal wallets. Where there any corroborating articles to support that claim because that is a pretty big conspiracy if there really is although I don't think that they will be putting conspiracy that makes FBI look bad to the public in a movie.Quote from: avikz on February 19, 2021, 04:25:25 AMI don't know why I sense that bitcoin will be shown as an evil in this movie! Probably yes! Probably not! I can see only one mention of Bitcoin in the trailer but I really hope it doesn't show bitcoin in negative light. The trailer is already popular with 62k views but the problem is, bitcoin can be shown as an evil money which connected the dots with silk road and its customers. Not good! Especially at this time when bitcoin has started generating a lot of interest among the corporates! If it is Hollywood then your hopes will be for nothing, if it fits the narrative and it sells more tickets then bitcoin will be on whatever light they want it to be. I just hope that this movie will show the highlights of the story and make it follow what really happened as much as possible.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kakmakr",
      "created_time": "February 19, 2021, 07:53:49 AM",
      "body": "Quote from: davis196 on February 19, 2021, 06:00:19 AMIt seems that this is an independent release,rather than a Hollywood blockbuster with 100 million dollar budget and A-list Hollywood stars in the cast.I guess that nobody outside the crypto industry and the tech world(cyber punks,nerds,etc)would pay attention to this movie.The \"average Joe\" doesn't know who Ross Ulbricht actually is and what is Silk Road.This movie has nothing to do with Bitcoin,so I don't know why OP posted this thread in the Bitcoin discussion forum.I beg to differ... Ross Ulbricht's was a focus point on this forum for years and a lot of the forum users used his site and some of them even petitioned for his release. So it is very relevant and also information that a lot of people would want to know about... I being one of them, because I surely would want to see this movie. We had several movies before where Bitcoin was at the center of criminal actions, but this one might help to answer some questions .. hopefully it is based on facts and not fiction. (Which I doubt, because it is all about Silkroad and Ross Ulbricht's)OP, thank you for the heads up .... I hope this one will do justice to his story.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rdbase",
      "created_time": "February 19, 2021, 08:11:01 AMLast edit: February 19, 2021, 08:29:30 AM by rdbase",
      "body": "Quote from: davis196 on February 19, 2021, 06:00:19 AMIt seems that this is an independent release,rather than a Hollywood blockbuster with 100 million dollar budget and A-list Hollywood stars in the cast.I guess that nobody outside the crypto industry and the tech world(cyber punks,nerds,etc)would pay attention to this movie.The \"average Joe\" doesn't know who Ross Ulbricht actually is and what is Silk Road.This movie has nothing to do with Bitcoin,so I don't know why OP posted this thread in the Bitcoin discussion forum.You do realize Ross was a part of these forums don't you? And the sole reason why he got caught was because they traced him using his forum account to an email he idiotically used for his personal use. This was a screen to a part where an fbi agent was logged in to read his messages back to other forum members, which was inevitable to his demise.It has got to be the most noobish move for him to make in order to get caught since he was meticulous with how he conducted his business so to not be detected for years on end.There was a whole entire program dedicated to this case and showed exactly how they caught up to him featured On FBI Declassified.https://www.cbsnews.com/news/ross-ulbricht-dread-pirate-roberts-silk-road-fbiI suggest you watch it before stating that this doesn't belong here in the bitcoin discussions thread. Because it's whole reason for ending up the way it did and even in part to it's creation was due to the forums and it's involvement to bitcoin!Straight facts, whether you like it or not.It is reality and not just a movie like this production was based on..real life events.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kik1977",
      "created_time": "February 19, 2021, 08:26:49 AM",
      "body": "Quote from: davis196 on February 19, 2021, 06:00:19 AMThis movie has nothing to do with Bitcoin,so I don't know why OP posted this thread in the Bitcoin discussion forum.You don't see SilkRoad and Bitcoin as having something in common? SR would have not been possible without Bitcoin, and the second wave of adoption, after the first pioneers, was SR users. Bitcoin started being in the news thanks to SR.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BChydro",
      "created_time": "February 19, 2021, 10:02:22 AM",
      "body": "Quote from: Sithara007 on February 19, 2021, 04:01:07 AMThey are going for a theatre release rather than releasing it on the OTT platforms? I want to see how honest their depiction of Silk Road and DPR is. Perhaps they should mention that the real reason why the FBI went after Silk Road is because the Mexican drug cartels were losing money due to competition from the dark market.. or perhaps that is too much to ask for. I hope at least they would show what happened after the arrest, including some of the rogue FBI agents stealing BTC from the silk road wallet and transferring them to their personal wallets. Seriously the FBI went after Silk Road because other drug cartels were loosing money  . It is a new spin of the event as i am not aware of why they went after but they were getting notorious as you were even allowed to hire hit man and when you start these you are bound to end up in jail considering you are allowing to facilitate these activities.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ucy",
      "created_time": "February 19, 2021, 10:55:43 AM",
      "body": "Quote from: avikz on February 19, 2021, 04:25:25 AMI don't know why I sense that bitcoin will be shown as an evil in this movie! Probably yes! Probably not! I can see only one mention of Bitcoin in the trailer but I really hope it doesn't show bitcoin in negative light. The trailer is already popular with 62k views but the problem is, bitcoin can be shown as an evil money which connected the dots with silk road and its customers. Not good! Especially at this time when bitcoin has started generating a lot of interest among the corporates! If that is the case, I would suggest that people be warned about such movie.By the way, the movie must not expose innocent/harmless Bitcoiners to harm with what it tries to potray, or get people to start turning against Bitcoin unnecessarily.I believe the transparency of Bitcoin (which fiat doesn't offer) made things easy for the security agencies... and it's transparent to the public too. This is the kind of thing a Just society should promote not resist.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bryant.coleman",
      "created_time": "February 19, 2021, 11:11:35 AM",
      "body": "Quote from: Ucy on February 19, 2021, 10:55:43 AMIf that is the case, I would suggest that people be warned about such movie.By the way, the movie must not expose innocent/harmless Bitcoiners to harm with what it tries to potray, or get people to start turning against Bitcoin unnecessarily.I believe the transparency of Bitcoin (which fiat doesn't offer) made things easy for the security agencies... and it's transparent to the public too. This is the kind of thing a Just society should promote not resist. It is an independent production and therefore I am hopeful that they will portray a neutral picture of Silk Road and Ulbricht. That said, it needs to be seen how much interest it will generate among the average moviegoers. This movie should have been released at least a year ago. It would have increased the chances of Ulbricht getting a pardon from Trump. But now Trump is gone, and he was probably the only president who could have considered a pardon for Ulbricht. Also, I am a bit worried about how they are going to portray Bitcointalk.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "?QuestionMark?",
      "created_time": "February 19, 2021, 11:52:40 AM",
      "body": "Quote from: avikz on February 19, 2021, 04:25:25 AMI don't know why I sense that bitcoin will be shown as an evil in this movie! Probably yes! Probably not! I can see only one mention of Bitcoin in the trailer but I really hope it doesn't show bitcoin in negative light. The trailer is already popular with 62k views but the problem is, bitcoin can be shown as an evil money which connected the dots with silk road and its customers. Not good! Especially at this time when bitcoin has started generating a lot of interest among the corporates! The problem with bitcoin is that almost everyone including normal people, investors and even some of the core dev team still believe bitcoin is usuable for criminals or protects them. Bitcoin is not and was never usefull for criminals or designed for them. Everyone just gets it wrong. Over 400 darknet markets have been taken down and many other cyber criminals just because of bitcoin and not their infrastructure.Its also not anymous. Its not anarchistic and its not to destroy banks and govermnets. The goal was never any of them. Sadly all this things the current anarchistic BTC dev team is trying to achieve. To protect and allow criminal activites. But they don't have a bloody clue about anything. BTC is not Bitcoin. Bitcoin is desgined to be cash and money. BTC is also not cash nor money. Bitcoin was designed to make everyones life better and make criminal acitivies harder and more and more less possible and to end corruption. Corruption which causes the daily wars, hate and problems which affects and harms everyone every single day.Beside that everyday tens of billions of dollars in fiat are used, earned and spend for highly criminal activities. From the streets up to the banks. Without anyone noticing or anyone doing or can doing anything against it.You can't do that on a transperent distributed and protected by economics ledger or blockchain. And everyone is crying about bitcoin but doesn't get that it is the opposite of illegal and it doesn't allow criminal activities.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Similificator",
      "created_time": "February 19, 2021, 01:16:49 PM",
      "body": "Wow, I am so amazed by this. It really excites me to know that there is an upcoming film that highlights the use of bitcoin. I just hope that they would not make such a bad image for bitcoin in that movie which may mislead all people who know close to nothing about it. But nevertheless, I am so excited to see this movie. I hope this movie gets to be available here in my country soon.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dkbit98",
      "created_time": "February 19, 2021, 01:30:08 PM",
      "body": "I already watched the movie and I talked about it few days ago in other SilkRoad topic, that means imdb release date is wrong Not a bad movie to watch especially if you are interested in Bitcoin history, but I think they added to many fantasy elements and they presented Ross character as some kind of lunatic.Anyone knows what is Ross Ulbricht bitcointalk account?Maybe silkroad?This post is interesting, Silk road and Bitcointalk. How it played a role in its rise and fall.Quote from: dkbit98 on February 13, 2021, 11:06:45 AMFor anyone who doesn't know anything about darknet site Silk Road and Ross Ulbricht it would be interesting to check out latest 2021 movie starring Nick Robinson as Ross Ulbricht and Jason Clarke as DEA agent Rick Bowden.I still didn't watch the movie myself (I plan to do it in next few days) and I can't confirm if it is mostly based on actual real events or not, but it would be interesting to watch for anyone who is interested in Bitcoin and no matter what you think about Ross Ulbricht and Silk Road it had a big role in Bitcoin history.Reminder that in real life Ross Ulbricht was arrested in 2013, and in 2015 he was convicted and double life sentenced plus forty years without a parole!There are many documentaries about SilkRoad but I think this is the first real movie.Trailer: https://www.youtube.com/watch?v=r8zlJcKygbU",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}