{
  "id": "topic_5414676",
  "title": "Symmetrick",
  "author": "Symmetrick",
  "created_time": "September 23, 2022, 10:55:24 PMLast edit: November 30, 2023, 12:10:41 AM by Symmetrick",
  "content": "ㅤ",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5414676",
  "comments": [
    {
      "author": "johnsaributua",
      "created_time": "September 23, 2022, 11:21:02 PM",
      "body": "that's good info sir, i just heard netcoin.org i thought it was a different forum, apparently not the name of bitcoin is easier to remember and simple to say, although its function is more important than a name",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "KennyR",
      "created_time": "September 23, 2022, 11:35:30 PM",
      "body": "Finally he have chosen the right name, because netcoin means it gets connected with internet connectivity whereas the bit means data. Probably we can soon see projects on this name, and promoting in the name of Satoshi.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OgNasty",
      "created_time": "September 23, 2022, 11:52:29 PM",
      "body": "This was an interesting development. I would agree that Bitcoin was the right choice. I think he probably figured people would eventually trade “bits” (instead of satoshis) which sounds a lot better than “nets.” It does show where his mind was at though. Currency built to be used on the internet was clearly the goal.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bittraffic",
      "created_time": "September 24, 2022, 01:30:35 AM",
      "body": "It's too coincidental for this to happen. Assuming it's Satoshi who registered these domains. It's really possible to trace him with the information from the registrar because during that time, even if you want it to be anonymous the registrar will still need your data.Would you say that BTC is planned not just by Satoshi alone, someone must have advised him what to name right?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sandra_hakeem",
      "created_time": "September 24, 2022, 01:31:45 AM",
      "body": "Actually, no one will support any revamp ( I'm not saying that's what you mean tho).  The current name gives the whole digital process,a kinda magnificent display honestly. BIT-coin ; okay someone could Vividly understand that those digital coins are made-up in BITS and apparently, those bits are called Satoshi. Anyone who's interested , probably in owning 1 Bitcoin should havr stacked-up enough sats which are also known as bits. The name alone is a BRAND to which it function lies and that makes it self explanatory. Maybe netcoin could've been an ordeal in today but, it wasn't chosen so I think it wasn't guaranteed.Cheers ,Sandra💇",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kemarit",
      "created_time": "September 24, 2022, 01:42:01 AM",
      "body": "For me it seems that he has not decided yet to the name of his project,Netcoin - Internet coin, this is what we call bitcoin, magic internet coinBitcoin - more subtle, but it attracts attraction, bit = 0 or 1. But I do agree that he make the right call to stick with Bitcoin, if he is the one who registered the name Netcoin as well.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "September 24, 2022, 03:05:22 AM",
      "body": "In my opinion: Netcoin sounds better when talking about the network, while Bitcoin sounds better when talking about the asset/currency.On the top of my head, what I'd probably prefer is something like \"bitnet\" when describing the network, and \"bitcoin\" when describing the asset/currency. \"Bitcoin\" for the network and \"bitcoin\" for the asset/currency can be quite confusing for some.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DapanasFruit",
      "created_time": "September 24, 2022, 03:10:12 AM",
      "body": "Our guy Satoshi Nakamoto made the right choice of using Bitcoin rather than Netcoin. The kind of impact that Bitcoin has so far delivered for the whole world to witness can partly be attributed to its name. In the world where brands are fighting for attention of the people or the market, having a good name is always important as we have seen many good products falling away because the name is lousy and has no power in itself to gain some good attention. With Bitcoin this is surely a a biting name.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "September 24, 2022, 04:45:57 AM",
      "body": "That is very interesting but a little odd to be honest because at that point the code must have been written and \"bitcoin-qt\" should have been at least 80% complete. This means that the name should have been already set and any change would have required significant changes in the code, comments on it, etc.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "romero121",
      "created_time": "September 24, 2022, 07:01:20 AM",
      "body": "Quote from: mk4 on September 24, 2022, 03:05:22 AMIn my opinion: Netcoin sounds better when talking about the network, while Bitcoin sounds better when talking about the asset/currency.On the top of my head, what I'd probably prefer is something like \"bitnet\" when describing the network, and \"bitcoin\" when describing the asset/currency. \"Bitcoin\" for the network and \"bitcoin\" for the asset/currency can be quite confusing for some.From the very beginning if bitnet have been used to describe the network and bitcoin for the currency means this could've been better and people used to it. Now if we think of such a term it feels different and sounds like doesn't make a connect.Also as pooya87 mentioned this name have been already done, because throughout the program bitcoin is added. Anyhow even if it was named \"Bitten\" the popularity and the growth would've never shrunk, as the technology is very strong.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NeuroticFish",
      "created_time": "September 24, 2022, 08:11:20 AM",
      "body": "While I do understand a developer may have difficulties to find the best name for his product, I also tend to agree with @pooya87 that some of his work should have been already done at that date.But it's not so difficult to change even such late from one name to another, since the nothing was released publicly yet at that date (please correct me if I'm wrong).So I think that it's probably the last two name candidates, not different \"products\".From the dates I could even conclude that he first thought of Netcoin name and next day he got the idea of Bitcoin name.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "348Judah",
      "created_time": "September 24, 2022, 08:27:47 AM",
      "body": "Quote from: Ratimov on September 23, 2022, 10:55:24 PMToday, information appeared that Satoshi Nakamoto, presumably, could call bitcoin a little differently:Judging by this find, it is possible that Satoshi chose between the names \"netcoin\" and \"bitcoin\", but chose the second option, or he prepared absolutely two projects, but the first one was not released at all. What other options do you allow?Well said, this actually could be an interesting research made upon but how are we going to know that this actually is from Satoshi decision or not, having the two names almost the same time doesn't give enough reasons that it maybe from Satoshi because things happens coincidentally also atimes, but if this isn't coming out from Satoshi himself or the whitepaper made then i think it's better to discard such, but also, am well pleased with this kind of research and findings that it may be actually the fact we all don't know, even though it lack the enough proofs to the fact.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pmalek",
      "created_time": "September 24, 2022, 08:33:41 AM",
      "body": "Quote from: Ratimov on September 23, 2022, 10:55:24 PMJudging by this find, it is possible that Satoshi chose between the names \"netcoin\" and \"bitcoin\", but chose the second option, or he prepared absolutely two projects, but the first one was not released at all. I don't think satoshi worked on a different project. He was probably just unsure about how to call the creation and that's why he registered two different domains. It seems unlikely that the person or group that though of something as good as Bitcoin would also work on a different project that was abandoned for whatever reason, and there is absolutely no mentions of it anywhere.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Z-tight",
      "created_time": "September 24, 2022, 09:00:28 AM",
      "body": "Quote from: johnsaributua on September 23, 2022, 11:21:02 PMapparently not *,* the name of bitcoin is easier to remember and simple to say, although its function is more important than a nameYou can probably say that now because Satoshi went with the name bitcoin, and that's the one we've been using since they created their project, if they had selected \"netcoin\" rather, and this news had come out about 13 years later, you would say the same thing in favor of netcoin. Neither of them is difficult to remember or say.Quote from: 348Judah on September 24, 2022, 08:27:47 AMWell said, this actually could be an interesting research made upon but how are we going to know that this actually is from Satoshi decision or not, having the two names almost the same time doesn't give enough reasons that it maybe from Satoshi because things happens coincidentally also atimes The records show it was a single person that purchased the two domains, and Satoshi was the person who released one of the domains to the public.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitzizzix",
      "created_time": "September 24, 2022, 09:15:11 AM",
      "body": "the creation of Netcoin.org on August 17, 2008 and Bitcoin.org, created on August 18, 2008 just a day before the creation of Bitcoin.org.indeed to make a good name is often one of the most challenging decisions one has to make when launching a new service or business, and Satoshi Nakamoto chose the proper name Bitcoin even though it was the second name after Netcoin was created the day before. https://cointelegraph.com/news/bitcoin-was-almost-named-netcoin-by-satoshi-nakamoto-hints-domain-data",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "September 24, 2022, 10:15:43 AM",
      "body": "Quote from: romero121 on September 24, 2022, 07:01:20 AMFrom the very beginning if bitnet have been used to describe the network and bitcoin for the currency means this could've been better and people used to it. Now if we think of such a term it feels different and sounds like doesn't make a connect.I have no idea if it would've been better or worse, but it was just my personal preference(and I think some would agree as well). It's pretty much just a better naming convention thing when talking about programming and technical stuff, as differentiating 2 very different things(network and currency) by the capitalization of the first letter is simply just a bad practice.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "passwordnow",
      "created_time": "September 24, 2022, 12:49:37 PM",
      "body": "Wow, great find. Little info but it's great to know such information and it's likely that satoshi was really thinking about what should be the name of his project release.Just as everyone is saying, he chose the right now and we're all happy with bitcoin. What I'm impressed with is that he's got it ready and prepared it well and he's just on the verge of choosing which is going to be the name of this great piece of invention he's made.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "noorman0",
      "created_time": "September 24, 2022, 12:50:00 PM",
      "body": "Looks like satoshi was thinking hard to choose between the two. Bitcoin is indeed a more comprehensive name for computing devices, and perhaps satoshi's main hope is that bitcoin in the future can be scaled up not only by relying on an internet network that is easily controlled by providers.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coinerer",
      "created_time": "September 24, 2022, 12:50:14 PM",
      "body": "Bitcoin was a right choice. The name Netcoin sounds familiar.  And it's not compatible with blockchain. Bitcoin was a unique name which is compatible with blockchain and sound soo cool. Choosing the name Bitcoin was a brilliant move.  In the case of netcoin, things did not go well. i support bitcoin name which is already choice Satoshi at the time of creating Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}