{
  "id": "topic_5446523",
  "title": "Flexystar",
  "author": "Flexystar",
  "created_time": "March 27, 2023, 05:33:15 PM",
  "content": "I am so shocked to the news that Binance was sued in the USA by Commodity and Futures Trade Commission (CFTC). Just a week before I have myself published an article on the forum regarding the SEC and their negative attention towards Binance and its offshore offices. SEC always kept Bianance on the radar and they kept bombarding multiple law suites against Binance - probably the world's largest crypto exchange. Now, here we are; with another authority that is CFTC putting Binance in the courtroom and putting all the allegations against the leader Changpeng Zhao. It's heartfelt that they are plotting various conspiracy theories behind the curtain and now one by one they are releasing the press and charging whatever suits they could. I see it as a clear message from the US, they want to let down the crypto ecosystem and do not want it operational. They even put allegations that employees were also involved in spoofing the location of Binance, now tha't really serious one. :-/QuoteStocks of crypto companies fell Monday after the U.S. Commodity and Futures Trade Commission (CFTC) sued Binance, the world's largest cryptocurrency exchange by trading volume, and CEO Changpeng Zhao.Coinbase (COIN), the only U.S. publicly traded crypto exchange, fell 9.1% as of 15:25 UTC (11:25 a.m. ET). Shares of bitcoin mining companies Marathon Digital (MARA), Riot Blockchain (RIOT) and Hut 8 Mining (HUT) all slid more than 7%. MicroStrategy (MSTR) – which earlier Monday disclosed the purchase of nearly another 6,500 bitcoin – was down 6.7%.Bitcoin, the largest cryptocurrency by market cap, lost $1,000 to below $27,000. Binance's exchange token, BNB fell 3.3%.Filed in the U.S. District Court for the Northern District of Illinois on Monday, the CTFC's lawsuit alleged that Binance knowingly offered unregistered crypto derivatives products in the U.S. contrary to federal law.The company, said the CFTC, operated a derivatives trading operation in the U.S., offering trades for numerous cryptocurrencies, all of which the CFTC said are commodities. The suit also alleged that Binance, under Zhao’s leadership, directed its employees to spoof their locations through the use of virtual private networks.Crypto-Related Stocks Drop Alongside Bitcoin on CFTC Binance Suit",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5446523",
  "comments": [
    {
      "author": "Nwada001",
      "created_time": "March 27, 2023, 05:47:14 PMLast edit: March 27, 2023, 09:24:35 PM by Nwada001",
      "body": "Two topics already existing regarding this..https://bitcointalk.org/index.php?topic=5446496.new#newhttps://bitcointalk.org/index.php?topic=5446517.msg61987636#msg61987636",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}