{
  "id": "topic_5463326",
  "title": "Forever101",
  "author": "Forever101",
  "created_time": "August 15, 2023, 06:17:18 AM",
  "content": "As the topic suggest, it is very important to balance our lifestyle as we pursue the dream in cryptocurrency. What are reasons for this discussion, many persons who are new to Cryptocurrency have the habit of constantly checking their phone or laptop from seconds to seconds to see their money jump high to profit. With that kind of mindset, they hardly have time for other things as their mind is just fixed on that money. And in most cases, it leads to breakdown in health as first time or new investors centres their mind on profit especially in our country where things are hard, many young person think, crypto is the saver . As you engage in cryptocurrency, manage everyother part of your life, take care of your family, spend time with them, relate with others, have fun, do other business and have impact on other people's life in a positive way. Staying indoor half of the day or throughout the day is not too helpful, checking your phone on the High way is dangerous. Wisdom demands that every area of your life is balanced as you pursue your investment goal in cryptocurrency.It is also wise to have time allocation for crypto so that it won't consume most of your time, understand the basic and know when to expect profit instead of perpetual checking of your wallet.Cheers",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5463326",
  "comments": [
    {
      "author": "Gozie51",
      "created_time": "August 15, 2023, 09:46:07 AM",
      "body": "Quote from: Forever101 on August 15, 2023, 06:17:18 AMIt is also wise to have time allocation for crypto so that it won't consume most of your time, understand the basic and know when to expect profit instead of perpetual checking of your wallet.Cheers E easy? You know say where your money dey na there wey your treasure dey sleep? Lol.My brother people dey hussle everything join oo, country hard everybody dey hold himself tight. People dey guide themselves oo, no lele. But guy ehn... You see that checking of phone matter ba, no be only people wey dey dis forum or people wey dey into crypto dey check check phone oo. The thing don become hubby, we are all attached to our phones these days including rich people. Every dey check phone for one thing or the other, people get other things Dem dey do with phone and now self phone na source of entertainment like watching movies, comedy skits etc for those wey dey watch such.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kodec5",
      "created_time": "August 15, 2023, 12:32:08 PM",
      "body": "Quote from: Forever101 on August 15, 2023, 06:17:18 AMAs you engage in cryptocurrency, manage everyother part of your life, take care of your family, spend time with them, relate with others, have fun, do other business and have impact on other people's life in a positive way. Staying indoor half of the day or throughout the day is not too helpful, checking your phone on the High way is dangerous. Wisdom demands that every area of your life is balanced as you pursue your investment goal in cryptocurrency.It is also wise to have time allocation for crypto so that it won't consume most of your time, understand the basic and know when to expect profit instead of perpetual checking of your wallet.Cheers I go allign with you my brother for the fact say I carry my money invest for inside Bitcoin na him go make me no close two eyes sleep for night or come dey iniside my house just dey monitor the price, Bitcoin is volatile the price fit just drop down anytime wey go cos panick before u know person don sell. Go out for other activities, get a good paying job, do business and other stuffs except say u get person wey dey provide ur basic needs but even at that person still get to put hand for something aside cryptocurrencies.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lida93",
      "created_time": "August 15, 2023, 10:38:15 PM",
      "body": "Quote from: Forever101 on August 15, 2023, 06:17:18 AMAs the topic suggest, it is very important to balance our lifestyle as we pursue the dream in cryptocurrency. What are reasons for this discussion, many persons who are new to Cryptocurrency have the habit of constantly checking their phone or laptop from seconds to seconds to see their money jump high to profit. With that kind of mindset, they hardly have time for other things as their mind is just fixed on that money. And in most cases, it leads to breakdown in health as first time or new investors centres their mind on profit especially in our country where things are hard, many young person think, crypto is the saver .Nothing wrong with constantly checking on the market to see how your investment is doing, on a larger part it helps you get updated constantly with how the market is doing and what step to take if the need be. In so far as you're not been obsessive about it but doing it with some moderation then it's fine. There's no way having an investment in crypto could make you not spend more time with your family except normally you're someone that doesn't have the habit of spending time with family and wanna use your small bitcoin investment as an excuse.Investing in crypto like bitcoin doesn't mean you should focus on other areas of life, and you can hardly see any bitcoin investor here that doesn't engage into other source of income cause that's what we usually preach of concerning multiple streams of income.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dr.Bitcoin_Strange",
      "created_time": "August 15, 2023, 10:42:30 PM",
      "body": "Quote from: Forever101 on August 15, 2023, 06:17:18 AMAs the topic suggest, it is very important to balance our lifestyle as we pursue the dream in cryptocurrency. What are reasons for this discussion, many persons who are new to Cryptocurrency have the habit of constantly checking their phone or laptop from seconds to seconds to see their money jump high to profit. With that kind of mindset, they hardly have time for other things as their mind is just fixed on that money. And in most cases, it leads to breakdown in health as first time or new investors centres their mind on profit especially in our country where things are hard, many young person think, crypto is the saver . It doesn't work that way; in fact, Bitcoin investment and altcoin investment (for those that still invest in them) are the kind of investment that gives one the privilege to do other things while their investment is right there in their wallet. Perhaps, as you have said, it doesn't take more than 5 minutes to look through your wallet if you really want to do so. Bitcoin Investment doesn't stop you from balancing your life style; it doesn't stop you from doing other things. In fact, Bitcoin is freedom, and anyone who uses it as an excuse to escape other important things in life is only making mistakes and investing wrongly. Perhaps it has been said time and time again without numbers that investors should only invest what they can afford to lose. When carrying out crypto investments, the investor is not supposed to invest an amount that they know will have some psychological effect on them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Samlucky O",
      "created_time": "August 16, 2023, 08:20:29 AM",
      "body": "I accept the fact. So many people who have endolge in crypto currency's has  became hazadious to themselves. physical, emotionally, spiritually and otherwise. Many of them find it difficult to reach out to friends and loved ones. Always tag friends to be enermy of progress. Seeing themselves as a success and others as failure. I suggest this topic considered relivant. because it informs, educate, and adds value to #bitcointalk members. And other people out there.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dzwaafu11",
      "created_time": "August 16, 2023, 08:51:10 AM",
      "body": "Quote from: Forever101 on August 15, 2023, 06:17:18 AMIt is also wise to have time allocation for crypto so that it won't consume most of your time, understand the basic and know when to expect profit instead of perpetual checking of your wallet.So e go possible say make person no go where him they work abi wetin you mean OP, you know as e be like this e no go ever work say make person no they check him wallet everytime. Where person don invest huge amount of money con keep am for there you wan talk say make person have time for checking that thing something wey they your phone and your phone they always they with you, e possible? No, mate. But wetin you talk say make person have time for crypto na true sha make person get time for crypto. Just that our phone they always they with us any time I'm less busy na crypto I dey always focus on learning new things and other things that is needed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mate2237",
      "created_time": "August 16, 2023, 01:15:04 PM",
      "body": "Quote from: Lida93 on August 15, 2023, 10:38:15 PMNothing wrong with constantly checking on the market to see how your investment is doing, on a larger part it helps you get updated constantly with how the market is doing and what step to take if the need be. In so far as you're not been obsessive about it but doing it with some moderation then it's fine. There's no way having an investment in crypto could make you not spend more time with your family except normally you're someone that doesn't have the habit of spending time with family and wanna use your small bitcoin investment as an excuse.Investing in crypto like bitcoin doesn't mean you should focus on other areas of life, and you can hardly see any bitcoin investor here that doesn't engage into other source of income cause that's what we usually preach of concerning multiple streams of income.  Everything is wrong. You cannot just invest in bitcoin and be checking the price everyone second even everyday is bad and tokless of every second for weti na? If anyone is doing that he or she should refrain from that habit. It is a very bad one be that. This kind of issue has been discussed in the general English boards and the advised given to those who doing that is to steer clear from the investment. Bitcoin is not something you invest today and you have profit within one day or week but years. So if anyone invest in bitcoin should know that they should wait for like 2 to 3 years and then they will benefit from the investment. When the person invest in bitcoin he should remove his mind from it and don't invest in bitcoin with the money that you want to use within the week. Invest in it with the money that is not par of your family plan. You have to make sacrifices in the investment to have profit and if you are not ready for the sacrifices (patient enough) then leave bitcoin investment and do physical business.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rachael9385",
      "created_time": "August 16, 2023, 01:39:45 PM",
      "body": "Quote from: Lida93 on August 15, 2023, 10:38:15 PMQuote from: Forever101 on August 15, 2023, 06:17:18 AMAs the topic suggest, it is very important to balance our lifestyle as we pursue the dream in cryptocurrency. What are reasons for this discussion, many persons who are new to Cryptocurrency have the habit of constantly checking their phone or laptop from seconds to seconds to see their money jump high to profit. With that kind of mindset, they hardly have time for other things as their mind is just fixed on that money. And in most cases, it leads to breakdown in health as first time or new investors centres their mind on profit especially in our country where things are hard, many young person think, crypto is the saver .Nothing wrong with constantly checking on the market to see how your investment is doing, on a larger part it helps you get updated constantly with how the market is doing and what step to take if the need be. In so far as you're not been obsessive about it but doing it with some moderation then it's fine. There's no way having an investment in crypto could make you not spend more time with your family except normally you're someone that doesn't have the habit of spending time with family and wanna use your small bitcoin investment as an excuse.Investing in crypto like bitcoin doesn't mean you should focus on other areas of life, and you can hardly see any bitcoin investor here that doesn't engage into other source of income cause that's what we usually preach of concerning multiple streams of income.  I do tell investors to not constantly checking price on market because it will yield fears to the investor if the price droped too low and again constant checking of price will make an investor not to hold on for dear life which means HODL, Bitcoin is ment to be bought and hold for dear life and checking bitcoin price all the time will do favour to no investor I die season.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptoHeadlineNews",
      "created_time": "August 16, 2023, 03:51:55 PM",
      "body": "Quote from: Forever101 on August 15, 2023, 06:17:18 AMIt is also wise to have time allocation for crypto so that it won't consume most of your time, understand the basic and know when to expect profit instead of perpetual checking of your wallet.Cheers Checking on phone na one thing wey dey very common among newbies and first-time Bitcoin investors, wey I dey sure can never be eradicated due to that high expectations wey first-time investors dey always get about Bitcoin. Because me I be one of those wey been dey check phone during my early days & I see nothing wrong with that when a newbie does that within his/her first period investing in Bitcoin. But if an old member does that then something is wrong somewhere, as such individual is meant to have understand how it works, set either  take-profit or stop-loss order and a notification to be notified when the price of BTC reaches a certain amount so as to sell or buy to make profit, while he/her go on with his daily activity. Because the fact that you invested in Bitcoin does not mean you have to cut yourself from relating with family and friends.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sim_card",
      "created_time": "August 16, 2023, 04:47:12 PM",
      "body": "I know understand this phone checking pattern because say you invest for crypto,abi you be trader. Because I feel say na only traders dey do like that,I never for one day carry my phone to check price because I no get intention to make quick profit. I just dey store my coins dey wait for 2025 and the price of bitcoin no dey make me worry at all. The only time wey I dey check the price of bitcoin na when I receive my weekly pay from signature campaign because I dey more after the digits,so if I see say e increase or reduce na then I go check price. I beg make we think of other things to put our lives together and not crypto price since it isn't necessary and wouldn't change anything when you are hodli.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Marykeller",
      "created_time": "August 16, 2023, 05:34:04 PM",
      "body": "As a human being, na normal thing sae, once once you go check your crypto wallet to know whether your bitcoin or altcoin wey you don invest don increase for profits or not. That one no mean say, em go stop you from taking care of your family or balancing your lifestyle with other things join. Crypto investment no be wetin the take peso time or stop am from doing wetin em suppose do on a normal day. Where d issue day na when peso go take money meant for em personal needs or taking care of em family, em carry am go invest for bitcoin, expecting a quick return of investment. Na where the problem go dey. Apart from that crypto no for once stop peso from balancing em lifestyle. Peso get em whole lifestyle for emself. As I d now, I run my stuffs daily. I no see where pursuing financial freedom through crypto don stop me from doing wetin I suppose do on a normal day. My bitcoin and crypto investment d safe for my wallet, as I d take a look on them once once whether dem don skyrocket for price or d still d on decline mode",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaNNy001",
      "created_time": "August 16, 2023, 09:52:31 PM",
      "body": "Quote from: Forever101 on August 15, 2023, 06:17:18 AMAs the topic suggest, it is very important to balance our lifestyle as we pursue the dream in cryptocurrency. What are reasons for this discussion, many persons who are new to Cryptocurrency have the habit of constantly checking their phone or laptop from seconds to seconds to see their money jump high to profit. With that kind of mindset, they hardly have time for other things as their mind is just fixed on that money. And in most cases, it leads to breakdown in health as first time or new investors centres their mind on profit especially in our country where things are hard, many young person think, crypto is the saver . As you engage in cryptocurrency, manage everyother part of your life, take care of your family, spend time with them, relate with others, have fun, do other business and have impact on other people's life in a positive way. Staying indoor half of the day or throughout the day is not too helpful, checking your phone on the High way is dangerous. Wisdom demands that every area of your life is balanced as you pursue your investment goal in cryptocurrency.It is also wise to have time allocation for crypto so that it won't consume most of your time, understand the basic and know when to expect profit instead of perpetual checking of your wallet.Cheers I think this kind of symptom only affects those people wey don decide to go into crypto and Bitcoin investment to be specific on a short term plan and also full time Bitcoin traders,  these set of persons nai I feel say fall for that category of yours and moreover you wey know the risk involved no go wan even try such thing because you know ever get rest of mind because you go constantly dey monitor the Market to see if any possible profit don enter make you cash out.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptopreneurBrainboss",
      "created_time": "August 16, 2023, 10:27:42 PM",
      "body": "Quote from: Forever101 on August 15, 2023, 06:17:18 AMAs you engage in cryptocurrency, manage everyother part of your life, take care of your family, spend time with them, relate with others, have fun, do other business and have impact on other people's life in a positive way. Staying indoor half of the day or throughout the day is not too helpful, checking your phone on the High way is dangerous. Wisdom demands that every area of your life is balanced as you pursue your investment goal in cryptocurrency.See as you dey do like say cryptocurency na full time jobs wey be say you no go get time for people again. Anybody wey dey take investing as full time job no get handwork to do because wetin dey there to just buy your coin from exchange or any where we sure for you then you move am to ur wallet wey you get full control come hodl an and u no need do anything until your investment mature you come move am to exchange to. So if na wetin wey dey investing be dat which one come be say you no go get time again for family abi na the forum wey you dey reason for your discussion dey call am Bitcoin investment? Anything investment no supposed dey affect your everyday life na.Quote from: Lida93 on August 15, 2023, 10:38:15 PMNothing wrong with constantly checking on the market to see how your investment is doing, on a larger part it helps you get updated constantly with how the market is doing and what step to take if the need be. In so far as you're not been obsessive about it but doing it with some moderation then it's fine. Na the koko be dat, get ur coins for wallets and dey follow up for market and their social platforms wey be say you need dey up to date because if na altcoins you dey hold, things dey happen wey dey rekt man without knowing like if exchange dey delist the coins because of one one or two wahala or just low trading volume. You need know so you know how you go take, take cover or just lock up and continue holdings. Check up for crypto dey necessary but anything wey you dey do make you no make am addiction like some people wey go wake up and before dem do anything dem go check market and all through the day na so so visit dem go dey go for market apps, dat one no make sense.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "August 17, 2023, 07:19:45 AM",
      "body": "Quote from: Forever101 on August 15, 2023, 06:17:18 AMWhat are reasons for this discussion, many persons who are new to Cryptocurrency have the habit of constantly checking their phone or laptop from seconds to seconds to see their money jump high to profit.This is the life of traders and crypto trading is one of them. Especially if you are a scalper or a day trader, you may have the habit of looking at the screen and checking the chart and the price of the coins that you are using to trade. I will advice against such habit as well because it can even affect the trader's health and good lifestyle.As for investment, that is the easiest thing to do. You even leave your coins on a noncustodial wallet. Checking wallet from time to time will be in an healthy way and most likely there will be a time you will leave the wallet and not check it often again, unlike trading, thinking of your trading funds not to get liquidated and watching the chart often. Investment is not what you are panicked about like trading and it will not affect you like trading. You will have time for yourself, family and friends with investment.But invest on right right coins, not shit or dead ones.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}