{
  "id": "topic_5399582",
  "title": "dragonb",
  "author": "dragonb",
  "created_time": "May 21, 2022, 08:03:57 AM",
  "content": "Hello everyone - lately I'm interested in the crypto market and would like to get in... I know it's very volatile at the moment, but I think the entry point could be quite well at the moment, because a lot is currently underperformed and yes also bearmarket… But I don't really want to get into the big currencies like Bitcoin or Ethereum... maybe you have other tips and recommendations, hence the question: What are the most undervalued cryptocurrencies in 2022 - I am looking forward to hear/read your opinions? I'm already looking forward to it! Thanks in advance!",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5399582",
  "comments": [
    {
      "author": "MAAManda",
      "created_time": "May 21, 2022, 08:33:28 AM",
      "body": "Quote from: dragonb on May 21, 2022, 08:03:57 AMHello everyone - lately I'm interested in the crypto market and would like to get in... I know it's very volatile at the moment, but I think the entry point could be quite well at the moment, because a lot is currently underperformed and yes also bearmarket… But I don't really want to get into the big currencies like Bitcoin or Ethereum... maybe you have other tips and recommendations, hence the question: What are the most undervalued cryptocurrencies in 2022 - I am looking forward to hear/read your opinions? I'm already looking forward to it! Thanks in advance!Everyone will have their own opinion regarding undervalued altcoins. From my perspective, I would say that Oasis Network (ROSE) is one of the undervalued altcoins. Oasis Network is the leading privacy-enabled and scalable layer-1 blockchain network to propel Web3 forward. You can find out the basics about Oasis Network on their official website here.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "right-as-rain",
      "created_time": "May 21, 2022, 03:37:59 PM",
      "body": "I agree, I guess there will be pretty much as many opinions as people you ask.   It will always be risky investing in something new, but if you’re willing to try your luck you might get rewarded  Personally, I reckon that with climate change and the generally unstable global situation at the moment, it is time for a new approach in cryptocurrencies as well. That is to say, a more democratic, and also more energy efficient way of using Blockchains. Looking at proof of work or proof of stake, there is definitely room for improvement when it comes to fairness and power consumption, but if you took some time to read into the subject of crypto, you will already know that. If not, I’d highly recommend it. As with anywhere else, it makes sense to take a sustainable approach here. So in my opinion, currencies that use the concept of proof of personhood will be the next big thing in the market. At the moment I personally only know of Idena doing that, but hopefully the trend will spread soon.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "X-ray",
      "created_time": "May 21, 2022, 04:03:51 PM",
      "body": "Almost all of legit tokens in the market already undervalued. i can only suggest you to take a look at the some metaverse tokens and why? the metaverse tokens are having real product but these kind of tokens have less hype compared with the blockchain project. You can take a look at the some metaverse like ape token and stepn. both have very big hype and stepn has a very good utility usage. Both are trading at the bottom due to the bitcoin price but these tokens can sustain from the dump. You can go to the blockchain coin like avalanche or defi tokens as well.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "drumamat",
      "created_time": "May 21, 2022, 05:30:24 PM",
      "body": "I think the undervalued are precisely those coins behind which there is either a powerful technology or a future trend. Definitely the future belongs to cross chain bridges and L2 solutions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Tytanowy Janusz",
      "created_time": "May 21, 2022, 05:32:59 PM",
      "body": "Quote from: dragonb on May 21, 2022, 08:03:57 AMHello everyone - lately I'm interested in the crypto market and would like to get in... I know it's very volatile at the moment, but I think the entry point could be quite well at the moment, because a lot is currently underperformed and yes also bearmarket… But I don't really want to get into the big currencies like Bitcoin or Ethereum... maybe you have other tips and recommendations, hence the question: What are the most undervalued cryptocurrencies in 2022 - I am looking forward to hear/read your opinions? I'm already looking forward to it! Thanks in advance!Describe \"undervalued\" in crypto XD How much is startup without userbase worth? With only promise of deliver something good in the future? How to calculate P/BV when all BV is a \"promise of a random team from internet\". Out of 18 000 projects I think we can talk only about 1-5 in terms of being undervalued.One of them might be BNB - Phenomenon of BNB (Fundamental analysis BNB/USD). Topic is a little bit outdated but you can do your math for present data. I did that few weeks ago and Although price pumped 20 times binance volumes pumped even more and bnb is as undervalued as it was @15$.You can also check idena. its super low cap for super low investment (high risk high reward). Its innovative blockain - proof of person with 15k nodes - each node = 1 real person = 1 equal vote. All achived without KYC - turing test protect agains sybil atack. And its evaluated at 2 mln $ marketcap.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "standingdol",
      "created_time": "May 21, 2022, 06:15:41 PM",
      "body": "With the YOP reward mechanism, each contributor receives the same APY reward as YOP is distributed based on their share of the storage pool. I am delighted with this project.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tvplus006",
      "created_time": "May 21, 2022, 06:36:25 PM",
      "body": "Quote from: dragonb on May 21, 2022, 08:03:57 AM...But I don't really want to get into the big currencies like Bitcoin or Ethereum... maybe you have other tips and recommendations, hence the question: What are the most undervalued cryptocurrencies in 2022 - I am looking forward to hear/read your opinions? I'm already looking forward to it! Thanks in advance!Given the fact that most altcoins have lost their value by up to 90%, then all these coins can be considered undervalued. And if the market turns bullish again, then today's prices look very attractive. But do not buy altcoins right now, because if the market continues to decline, the price of altcoins will fall even more.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sunsilk",
      "created_time": "May 21, 2022, 08:08:22 PM",
      "body": "If you don't like the top two, ethereum and bitcoin.There's still one crypto that you haven't mentioned and is also down right now and that's, BNB. You might want to consider buying it because that's another good coin to hold.It's half now from the ATH that it has before. If that's a good sign and factor to you, you still do your own research for this coin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "wxa7115",
      "created_time": "May 21, 2022, 09:26:48 PM",
      "body": "Quote from: dragonb on May 21, 2022, 08:03:57 AMHello everyone - lately I'm interested in the crypto market and would like to get in... I know it's very volatile at the moment, but I think the entry point could be quite well at the moment, because a lot is currently underperformed and yes also bearmarket… But I don't really want to get into the big currencies like Bitcoin or Ethereum... maybe you have other tips and recommendations, hence the question: What are the most undervalued cryptocurrencies in 2022 - I am looking forward to hear/read your opinions? I'm already looking forward to it! Thanks in advance!The problem is that with the exception of bitcoin, ethereum and the binance coin it is quite difficult to determine if the rest of the coins are undervalued as they may never recover or they could even disappear during the next months and years.However one type of cryptocurrency I would not recommend to invest in it right now are stable coins, and the reason is that while they have remained stable against fiat, with the exception of UST, their price in terms of bitcoin is very high so it is best to convert them to bitcoin and then decide in which altcoin you may want to invest.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "goaldigger",
      "created_time": "May 21, 2022, 09:51:21 PM",
      "body": "The undervalued cryptocurrency are the one with a great potential in the future and they have more chance to pump considering that they offer a great platform, sooner or later investors will recognize them and lucky to those who supported them from the very beginning, this could be a big pump for them. I haven’t find any undervalued crypto, I try to analyze some but the result is not good for me. Maybe, its better OP to have the list so newbies can also search for it and confirm if its really a good one.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "crzy",
      "created_time": "May 21, 2022, 09:59:20 PM",
      "body": "For this year, I can say ADA and GAL are my choice of undervalued crypto since I see their true potential and I see that the project itself continues to provide good technology. This could be a great altcoin investment that you can have aside from having those top altcoins, this is a good alternative. Though, undervalued crypto doesn’t mean you have to buy because maybe, they are meant for that value and later on will die as well.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Doell",
      "created_time": "May 21, 2022, 10:57:12 PM",
      "body": "Right now it's maybe better to start if you are very interested in invest, but just a suggestion if you insist on investing in under value altcoins, it's better to save your money it for re-invest later if there any crash or other bad things. This is a project that may have the potential Qtum Rose Hydra Cardano, but it's just a suggestion and you'll have to do some research again if you want to put them in your bag.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lobo13hf",
      "created_time": "May 21, 2022, 11:32:25 PM",
      "body": "You shall go to the top 100 or 200 CMC. Most of coins in these range were still undervalued right now. I consider this caused by the fact that the price is still at the bottom. bitcoin is not yet pumping to the moon and so think about this will be going even dipper was not a good thing for now as the price already dipped. If you didn't like to go to the top 1 and 2 coins and then you can try to take your chance by investing into the top 100 - 200 CMC. There are so many coins in the market but you must be careful with it. I see that if this time the unstability of bitcoin is making the market quite risky to invest",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ajochems",
      "created_time": "May 21, 2022, 11:57:02 PMLast edit: May 23, 2022, 03:29:39 AM by ajochems",
      "body": "It will changed by many people opinion,based on their research towards it. Now the worst coin is Luna. All the people should not inverse one dollar in the Luna. Because some people using to scam by saying new Luna launch. Untill you get official information, you should inverse any money in new Luna too. Because don’t waste money on the shit coin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "trendcoin",
      "created_time": "May 25, 2022, 07:12:15 PM",
      "body": "Excuse my behavior. You said that you do not want to enter major cryptocurrencies such as Bitcoin and Ethereum, but I still want to start my words by recommending Bitcoin and Ethereum.For good cash management, you need to divide the risk. Bitcoin is the engine of the market. You should always allocate a large share of your cash to Bitcoin. In the category of Layer 1 technology, Ethereum is unrivaled. It is the most popular choice of developers. Therefore, you should allocate a large share to Ethereum as well. And finally, you can try to follow the trends in the market with the rest of your money. For example; NFT, Metaverse or GameFI etc. I wish you good luck.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "uneng",
      "created_time": "May 25, 2022, 07:57:28 PM",
      "body": "With the exception of shitcoins, the whole market is undervalued in 2022. That is what a bearish market represents. Every altcoins which have a working project concept and showed solid results previously, with loyal supporters' base along the time, are likely to perform well on the next bull run. But keep in mind altcoins by themselves do nothing. It's bitcoin currency which pushes them above. Without bitcoin pumping there isn't altcoins' bull run. So it really doesn't make sense to not pick bitcoin to invest. That is the safest and surest option in crypto market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "wxa7115",
      "created_time": "May 27, 2022, 10:17:47 PMLast edit: June 02, 2022, 05:44:00 PM by wxa7115",
      "body": "Quote from: trendcoin on May 25, 2022, 07:12:15 PMExcuse my behavior. You said that you do not want to enter major cryptocurrencies such as Bitcoin and Ethereum, but I still want to start my words by recommending Bitcoin and Ethereum.For good cash management, you need to divide the risk. Bitcoin is the engine of the market. You should always allocate a large share of your cash to Bitcoin. In the category of Layer 1 technology, Ethereum is unrivaled. It is the most popular choice of developers. Therefore, you should allocate a large share to Ethereum as well. And finally, you can try to follow the trends in the market with the rest of your money. For example; NFT, Metaverse or GameFI etc. I wish you good luck.And I agree with this, I can understand the desire many investors have of maximizing their profits, however what they do not seem to see is that they cannot take such extreme risk in this market.Just look at what happened to those that invested in Luna and lost every single dollar they had to their name, if they had been more cautious then at most they would have invested something like 5% to 10% in Luna, and while losing money is something that no one likes at least they will have an opportunity to recover that money eventually, something that is impossible for those that were 100% invested in Luna.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "btc_angela",
      "created_time": "May 27, 2022, 10:36:02 PM",
      "body": "We are in a crypto winter right now, so all coins are going to be underperforming and undervalued because of the trend. And this is the best way to make money because all of you have to do is buy them right now because they are cheap.However, I would say that only BTC and ETH should be your main focus here. And then maybe fill your bags with some on the top 2-10 on alt coins. No need to look for other so called gems because it might be a scam coin after all.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Smack That Ace",
      "created_time": "May 27, 2022, 10:38:25 PM",
      "body": "Quote from: dragonb on May 21, 2022, 08:03:57 AMHello everyone - lately I'm interested in the crypto market and would like to get in... I know it's very volatile at the moment, but I think the entry point could be quite well at the moment, because a lot is currently underperformed and yes also bearmarket… But I don't really want to get into the big currencies like Bitcoin or Ethereum... maybe you have other tips and recommendations, hence the question: What are the most undervalued cryptocurrencies in 2022 - I am looking forward to hear/read your opinions? I'm already looking forward to it! Thanks in advance!Why don't you want to invest in bitcoin or ethereum, these are considered the 2 safest coins on the market. Are you thinking that they will not be able to bring you big profits so you decide to choose other altcoins. That's a mistake most newbies make.Honestly, this is a good time to invest since most coins have dropped a lot, but it is difficult to pick out a few altcoins to hold and make a profit. You better do your own research and make your own choice because everyone like you are trying to find an alt that can bring big profits. The only advice is probably that you should hold the top 10 coins on CMC.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}