{
  "id": "topic_5468172",
  "title": "Macoach",
  "author": "Macoach",
  "created_time": "September 26, 2023, 01:14:09 PM",
  "content": "I know people who are still dubious about the cryptocurrency sector because they worry about losing their money to scams or security breaches, which has been a typical occurrence in this market. Since the majority of users appear to have welcomed the requirement for required KYC, I believe the focus should now be on enhancing exchange security. I am aware that KYC may reduce fraudulent activity, however dealing with hacking and security exploitation issues will need investing in the strengthening of security. Adoption could happen quickly with sufficient protection because safety will be assured.The latest Houbi attack, which resulted in the theft of roughly $8 million worth of Ethereum, and a few other security exploitations of a similar nature on other trading platforms in the past don't bode well for the sector, which calls for the prioritizing of security. https://cointelegraph.com/news/huobi-global-crypto-exchange-hacked-reportEven though there are still very few trading platforms that have never experienced security exploitation, the recent incident with Houbi should serve as a reminder for everyone to remainattentive and prioritize their security.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5468172",
  "comments": [
    {
      "author": "Jawhead999",
      "created_time": "September 26, 2023, 01:52:45 PM",
      "body": "As good as the security they can improve or enhance, it's not make they 100% will never get hacked because online website are prone to get hacked.Huobi isn't the only one exchange get hacked, centralized exchange already get hacked since 2011 [1] and every year there's always an exchange get hacked. So it means, all centralized exchange only waiting their turn to get hacked.[1] https://bitcointalk.org/index.php?topic=5090869.0",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Alpha Marine",
      "created_time": "September 26, 2023, 01:56:54 PM",
      "body": "As security gets more sophisticated, that's how criminals also get sophisticated. Hacking into systems will always be a thing no matter how the world gets. We can't trust these exchanges to have top-notch security or not be careless with anything. Even if they're not careless, a single mistake can lead to a hack.So it's best to not leave your coins in an exchange. As a trader, you can leave a certain amount you're amount to use to trade but leaving a large amount on centralized exchanges is not advisable. The fact that your coins are a non-custodial wallet doesn't mean it's ultimately safe. You also have to be careful and take every security measure possible. Hackers don't only attack exchanges. They're also constantly looking for ways to access wallets.So even if you don't trust centralized exchanges, you still have a role to play to keep your coins safe.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mr.right85",
      "created_time": "September 26, 2023, 02:09:08 PM",
      "body": "Quote from: Macoach on September 26, 2023, 01:14:09 PMSince the majority of users appear to have welcomed the requirement for required KYC, I believe the focus should now be on enhancing exchange security. Are you being serious right now because, I’m not taking you up on that.The cryptocurrency space and it’s users have never been very welcoming of the KYC idea. It’s not an entirely bad idea but, anonymity remains a vital part of the cryptospace and KYC sort of takes that away from you. It’s mainly an option that you can’t refuse on a much needed service else, majority of users that occupy the cryptospace aren’t arms open to KYC.Quote from: Macoach on September 26, 2023, 01:14:09 PMI am aware that KYC may reduce fraudulent activity, however dealing with hacking and security exploitation issues will need investing in the strengthening of security. Adoption could happen quickly with sufficient protection because safety will be assured.Yeah, that’s one of its benefits but, where it becomes an issue of concern is about the safety of these KYC documents. In cases of obvious hacks, while most of the focus might be centered on the money being stolen, data are also picked up along the way too.Quote from: Macoach on September 26, 2023, 01:14:09 PMthe recent incident with Houbi should serve as a reminder for everyone to remainattentive and prioritize their security.When it’s a hack on the exchange, it has nothing to do with you but still, you must ensure to take security seriously.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "avikz",
      "created_time": "September 26, 2023, 02:09:54 PM",
      "body": "Web security can never become bulletproof. It's due to the nature of the business. As Alpha Merine had correctly pointed out that the hackers will get more sophisticated along with the systems. So no platform can stay 100% secure from the hacking attacks. It will be a part of their daily operations. Yes, we need to see how the exchanges can handle such attacks and what they do after the attack. Also it is required to have a complete insurance cover to protect the consumer funds. That's what sets the exchanges apart from the competition.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "notocactus",
      "created_time": "September 26, 2023, 02:18:42 PM",
      "body": "Quote from: Macoach on September 26, 2023, 01:14:09 PMSince the majority of users appear to have welcomed the requirement for required KYC, I believe the focus should now be on enhancing exchange security. If you want so, you must write many emails to many exchanges as one of their customers to request them to do that to solve your concern. This forum is not a relevant place to do it because very limited exchanges have representatives in Bitcointalk. Even they are here, they probably don't see your thread.Users must change their attitude and practice first as it is more easily to do than asking for changes, security improvement from exchanges. They must focus on what they can control so focus on themselves and how they can change their security practice first.QuoteI am aware that KYC may reduce fraudulent activity, however dealing with hacking and security exploitation issues will need investing in the strengthening of security. I am unsure that KYC can reduce fraudulent activities a lot.Why KYC is extremely dangerous – and useless",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EL MOHA",
      "created_time": "September 26, 2023, 02:25:09 PM",
      "body": "Quote from: Macoach on September 26, 2023, 01:14:09 PMSince the majority of users appear to have welcomed the requirement for required KYC, I believe the focus should now be on enhancing exchange security. I don’t agree that majority have actually agreed to the KYC protocol implemented by exchanges, it is mostly exchanges that have come to the conclusion that KYC adds another level of security to their users. If you read some news once any non-KYC exchanges enforces KYC you will see some of the users fuming, most especially bitcoiners. Most just stick to the exchanges because they aren’t many out there that can provide them with some features they want. Decentralized Exchanges would have been a place to habour them but most do not have enough liquidity. Quote from: Macoach on September 26, 2023, 01:14:09 PMI am aware that KYC may reduce fraudulent activity, however dealing with hacking and security exploitation issues will need investing in the strengthening of security. Adoption could happen quickly with sufficient protection because safety will be assured.One effective way of preventing this security breaches is to be very cautious in handling our storage devices, do not because you looking for something easier you compromised your security like not going through to have knowledge of how to save your money or coins on cold wallets, to not wanting to take the stress of having to store your keys yourself and there for either entrusting your keys to others or storing the funds on platforms. Also carefully scrutinizing any related information concerning your accounts ranging from mails that could contain phishing links or downloading just any applications",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "348Judah",
      "created_time": "September 26, 2023, 02:40:03 PM",
      "body": "Quote from: Macoach on September 26, 2023, 01:14:09 PMEven though there are still very few trading platforms that have never experienced security exploitation, the recent incident with Houbi should serve as a reminder for everyone to remainattentive and prioritize their security.Exchanges are being attacked, mixers are being attacked and also there are several attacks aimed at gambling organizations to cheat on their system, which means we are to always get ready of anything that relates to this each time we are using a centralized institution because they are more subjected to hack by the scammers, but we should also ask these organizations on how effective have they been maintaining their websites security network, what attention are they giving it, how much do they spend in assuring this security measures.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hyphen(-)",
      "created_time": "September 26, 2023, 03:01:17 PM",
      "body": "Quote from: Macoach on September 26, 2023, 01:14:09 PMSince the majority of users appear to have welcomed the requirement for required KYC, I believe the focus should now be on enhancing exchange security. Most users who welcomed the KYC requirement on any exchange are those who like trading and are very sure that they will get the best trading futures on centralized exchanges. Not because KYC enhances security, but because I believe that doing KYC will only expose your privacy to the world, and once you submit KYC, you should just be prepared because your personal details might be sold out anytime.QuoteI am aware that KYC may reduce fraudulent activity, however dealing with hacking and security exploitation issues will need investing in the strengthening of security. Adoption could happen quickly with sufficient protection because safety will be assured.I don't believe that, because most exchanges that are getting hacked these days are all KYC exchanges, but if you have evidence, you can share it here on how doing KYC on an exchange enhances its security.QuoteEven though there are still very few trading platforms that have never experienced security exploitation, the recent incident with Houbi should serve as a reminder for everyone to remainattentive and prioritize their security.The security we should patronize is to move our coins to our personal wallet that will not be under any third party since the hacking of Centralize exchanges has now become a trend. Who knows which exchange might get hacked today because the security they claim they will provide is always failing.Let's always remember this \"Not your keys not your coins\"",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rruchi man",
      "created_time": "September 26, 2023, 03:04:12 PM",
      "body": "Quote from: Macoach on September 26, 2023, 01:14:09 PM~You are always advised not to store your bitcoins on exchanges. As a step to ensure your personal security cold wallets are recommended for use because they are not connected to the internet and operate offline. You should never fully trust exchanges no matter how big their name is because since almost everything is hackable, you will not know when hackers will decide to want to exploit security vulnerabilities that these exchanges are unable to detect on time or vulnerabilities that they choose to overlook.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kryptqnick",
      "created_time": "September 26, 2023, 03:24:48 PM",
      "body": "I agree that crypto exchanges must invest in better security, but there are also a couple of other things to note here. First, people must learn to only store what they're totally fine with losing on exchanges because a centralized platform is a risk not just due to possible hacks but also exit scams, mismanagement of customers' funds, etc. Second, crypto exchanges sometimes claim there was a hack, when in all likeliness it was an inside job that led to funds being stolen from customers.I also stand with those who aren't sure KYC is that useful, especially in the context of security.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Beerwizzard",
      "created_time": "September 26, 2023, 04:00:01 PM",
      "body": "Quote from: tranthidung on September 26, 2023, 02:18:42 PMWhy KYC is extremely dangerous – and uselessDamn, I find it so funny this bullshit thread was translated into 13 languages. The arguments are incredibly dumb. And the the thread itself is so huge that I am impressed of the amount of work that has been done to make such a huge piece of shit.Quote from: 348Judah on September 26, 2023, 02:40:03 PM but we should also ask these organizations on how effective have they been maintaining their websites security network, what attention are they giving it, how much do they spend in assuring this security measures. You really expect to get the answer? Organizations can't publicly discuss the details on their security system as it is actually exposing it to hackers. Your funds are safu and this is it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Z-tight",
      "created_time": "September 26, 2023, 04:11:55 PM",
      "body": "Quote from: Macoach on September 26, 2023, 01:14:09 PMSince the majority of users appear to have welcomed the requirement for required KYC, I believe the focus should now be on enhancing exchange security.With the high number of users who have registered on centralized exchanges and custodial services, you are right if you say majority of BTC users have undergone kyc, if they agree with it or welcome it? I do not know about that, but i know most BTC users choose centralized services over decentralized solutions like p2p exchanges, because they think it is more 'convenient'.It goes without saying that you should not store your BTC's in a centralized exchange, they bite the dust too often and they use your money to make more money for themselves through fractional reserve scam. If you use p2p exchanges and self custodial wallets, you don't have to worry about what happens to centralized exchanges.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ZAINmalik75",
      "created_time": "September 26, 2023, 04:15:24 PM",
      "body": "Quote from: Macoach on September 26, 2023, 01:14:09 PMEven though there are still very few trading platforms that have never experienced security exploitation, the recent incident with Houbi should serve as a reminder for everyone to remainattentive and prioritize their security.Nothing can be perfect, many platforms have back doors that can lead hackers straight into the exchange, and hackers are now smarter than before. I am really amazed to see their hard work and how they proceed to make attempts. You are right; the KYC was made so that fraudulent activity would be reduced and people could not scam others in p2p trades, etc.Still, KYC does not make any exchange vulnerable to hacks, but the back doors and out-of-date infrastructure of the platform and the lack of enthusiasm of the team make the platform vulnerable to hacks. And the Houbi exchange had some issues with liquidation, which was also discussed here.I wanted to know which exchanges have not been hacked yet; you should write some examples. It would be helpful.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AHOYBRAUSE",
      "created_time": "September 26, 2023, 04:17:01 PM",
      "body": "Nothing can be 100% sure, there is always some way to get into anything unfortunately.But seriously though, companies, sites and so handling other people's money should always have the highest priority to keep the costumers funds save. It is a real shame that sometimes, when big hacks or whatever occur these companies leave their costumers in the dark without any info or reimbursement.Basically they say, bad timing, better luck next time.There have been several gib hack in the past and it seems nothing has be learned from them. There is always a next one exploiting already knows leaks of security. Why that is even possible, I can't wrap my head around it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Z-tight",
      "created_time": "September 26, 2023, 04:32:17 PM",
      "body": "Quote from: ZAINmalik75 on September 26, 2023, 04:15:24 PMYou are right; the KYC was made so that fraudulent activity would be reduced and people could not scam others in p2p trades, etc.Bisq is a p2p exchange, no kyc and no data required to trade on bisq, yet it is so difficult to scam your trading partner in the bisq network, except they do not know what they are doing. Bisq is so secure because funds are locked in a 2-of-2 multisig wallet, and the two traders control the keys during the trade. This is more effective to mitigate scam as you control your funds as you trade, you don't lose control of it like you do in Binance or Coinbase.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptoHeadlineNews",
      "created_time": "September 26, 2023, 05:32:14 PM",
      "body": "Quote from: Macoach on September 26, 2023, 01:14:09 PMI know people who are still dubious about the cryptocurrency sector because they worry about losing their money to scams or security breaches, which has been a typical occurrence in this market. Since the majority of users appear to have welcomed the requirement for required KYC, I believe the focus should now be on enhancing exchange security. Exchanges are meant for trading, and likewise, wallet for hodling coins, but just that most times people mistake what is meant to be done on an wallet on an exchange because of the presence of the wallet feature, which is why I think majority keep falling victims whenever there is a hack or security breach, which is ought not to be that way. So in regards to this, I think while we keep letting exchange know the importance while it's good to have an improved security, let's not forget to educate people also on the reason why it's very much important not to hold much funds on an exchange but a very secured non-custodial wallet where they can have access to the private key to their funds.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tjtonmoy",
      "created_time": "September 26, 2023, 05:46:06 PM",
      "body": "It's not only scams, hacks, or other data leaks, you should also be concerned about the platform itself. There are platforms popping out every now and then. They all require KYC or they will offer you this and that for successfully completing KYC verification. Some of them will collect the data and sell it to people for money. Enhancing security means nothing. What I believe is that, if the right person chooses, then that person can hack it no matter what the security measures are. It's all about time. Once a person finds a loophole then they can hack it. Now to keep ourselves safe, we need to do it personally. Our privacy is ours to keep. Centralized exchanges are required to some extent but it's not something that we can't live without. There are some other alternative decentralized platforms in existence. Maybe trying some from that list might help. But they are not immune to hacking or scams either. So my suggestion is, to only deposit what you need to work with. Otherwise, keep everything in a private wallet. Not your key, not your coin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "wxa7115",
      "created_time": "September 27, 2023, 04:37:16 AM",
      "body": "Quote from: tjtonmoy on September 26, 2023, 05:46:06 PMIt's not only scams, hacks, or other data leaks, you should also be concerned about the platform itself. There are platforms popping out every now and then. They all require KYC or they will offer you this and that for successfully completing KYC verification. Some of them will collect the data and sell it to people for money. Enhancing security means nothing. What I believe is that, if the right person chooses, then that person can hack it no matter what the security measures are. It's all about time. Once a person finds a loophole then they can hack it. Now to keep ourselves safe, we need to do it personally. Our privacy is ours to keep. Centralized exchanges are required to some extent but it's not something that we can't live without. There are some other alternative decentralized platforms in existence. Maybe trying some from that list might help. But they are not immune to hacking or scams either. So my suggestion is, to only deposit what you need to work with. Otherwise, keep everything in a private wallet. Not your key, not your coin. Exchanges are just a huge target for hackers, scammers and even governments, so anyone that wants to use them should do so with a very clear intent, which is to buy and sell whatever they need and then send their coins out of the exchange.Such a thing should take just a few minutes and this will reduce the chances of losing your coins dramatically, however very few people do this as they prefer to save themselves a few dollars and keep their coins in their favorite exchange, not understanding the massive risk they are taking by doing this.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Die_empty",
      "created_time": "September 27, 2023, 06:29:55 AM",
      "body": "Quote from: Macoach on September 26, 2023, 01:14:09 PMI know people who are still dubious about the cryptocurrency sector because they worry about losing their money to scams or security breaches, which has been a typical occurrence in this market. Since the majority of users appear to have welcomed the requirement for required KYC, I believe the focus should now be on enhancing exchange security. The cryptocurrency financial sector is in its developmental stage so issues like hacks and scam projects will always occur. As old as the fiat banking system they still suffer from security breaches and scams. In 2022 banks in the US paid close to $1.2 billion ransomware payments. So these attacks are not limited to the crypto industry but as the sector grows, it's security will improve. I don't think that the majority of people are comfortable with KYC because it is an arbitration of the concept of bitcoin. The only reason why people give out their KYC is because they have few options. In my country, centralized exchanges are the major means of dealing with Bitcoin this is due to the fact that we have limited P2p platforms.  It would not be a bad idea for exchanges to adopt current security measures to curb these attacks but some of them went bankrupt not because of attacks but mismanagement. QuoteI am aware that KYC may reduce fraudulent activity, however dealing with hacking and security exploitation issues will need investing in the strengthening of security. Adoption could happen quickly with sufficient protection because safety will be assured..These attacks will not end automatically, in fact, they might always be a problem in the crypto sector. Adoption should be promoted using the right information. People should be aware that they can keep their money in a safe non-custodian wallet and be their bank. They should be taught how to protect their coins against hacks. We should let them know that keeping money in centralized platforms is riskier.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}