{
  "id": "topic_5414469",
  "title": "Robert518",
  "author": "Robert518",
  "created_time": "September 22, 2022, 09:20:06 AM",
  "content": "Why are many governments not regulating cryptocurrency?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5414469",
  "comments": [
    {
      "author": "batang_bitcoin",
      "created_time": "September 22, 2022, 09:53:14 AM",
      "body": "Quote from: Robert518 on September 22, 2022, 09:20:06 AMWhy are many governments not regulating cryptocurrency?It's because they're not yet ready and doesn't see its potential on their countries. Look at the countries that are regulating it right now, they're only looking at it because many of their citizens are making money off it. But, if their people are not making anything on it, it's either they'll just ignore it or worst ban it because they only hear bad things about cryptocurrencies being used in the black markets and through the use of illegal activities.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ethereumhunter",
      "created_time": "September 22, 2022, 12:33:15 PM",
      "body": "Quote from: Robert518 on September 22, 2022, 09:20:06 AMWhy are many governments not regulating cryptocurrency?Governments are unaware of the existence of cryptocurrencies and when they know about it, they have become popular and are trying to learn about it. But because cryptocurrency is beyond their control, they don't fully regulate it. Maybe they can only set policies to use cryptocurrencies and adapt it to the conditions in their country. It looks like the government is still studying it and allowing its people to use it. And hopefully, the government will continue to allow us to use it and not make regulations that are too strict for its citizens.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coin-investor",
      "created_time": "September 22, 2022, 01:28:48 PM",
      "body": "Quote from: Robert518 on September 22, 2022, 09:20:06 AMWhy are many governments not regulating cryptocurrency?They have not seen yet its potential, but soon there will be many countries that will adopt it and regulate Cryptocurrency, the majority always rule if the majority of countries are using Cryptocurrency, those countries will adopt it or lift the restrictions, blockchain, and Cryptocurrency is the technology that will rule the world and if these countries are late or ignore in adopting it they will eventually suffer, they cannot ignore something that the majority of countries are using.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tbct_mt2",
      "created_time": "September 22, 2022, 01:37:30 PM",
      "body": "Quote from: Robert518 on September 22, 2022, 09:20:06 AMWhy are many governments not regulating cryptocurrency?First, so many scammers in crypto and as governments, they must have laws, regulations to control and reduce scammers. To protect citizens including investors in crypto.Second, they have to protect governmental benefit. To reach it, they must have more regulations, to control crypto market.Fortunately, it is not only negatively. Please see it oppositely, in long term it will be very helpful and positively for crypto market and investors",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "asriloni",
      "created_time": "September 22, 2022, 02:19:42 PM",
      "body": "Quote from: Robert518 on September 22, 2022, 09:20:06 AMWhy are many governments not regulating cryptocurrency?it's caused by so many governments are thinking that if crypto was still in the grey area. that means if crypto shall or shall not be regulated actually depend with so many factors. You can't force the government to regulate crypto. The government knows what they must be doing with crypto. Some regulators have been deciding to regulate crypto and that this means if crypto is not always need to be regulated. I think that if you are aware about this and then you shall not feel curious about that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "avikz",
      "created_time": "September 22, 2022, 02:32:08 PM",
      "body": "Quote from: Robert518 on September 22, 2022, 09:20:06 AMWhy are many governments not regulating cryptocurrency?It's easier said than done! Cryptocurrency is a authority less system for transacting value unlike the fiat system. So it is extremely difficult or even impossible for governments to regulate cryptocurrency. Even though the transactions are recorded in the blockchain, it is not easy to regulate. Governments can provide guidelines and make laws on cryptos to be followed in their own country but it is then upto the citizens to follow and comply with such laws. If they don't, it's literally impossible for the governments to make them follow the law.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitstar_coin",
      "created_time": "September 22, 2022, 03:45:30 PM",
      "body": "Perhaps they are yet to come up with a better regulation policy that will benefit both government and the people. Besides, they can only achieve that through the various centralized platform that offer cryptocurrency services not that it will be so easy to regulate crypto.The crypto community have been expecting this now so when it eventually happens it won't come as a surprise, even the governments are not sure how to go about the whole regulation process imo. I guess we have to wait and find out.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CapGelatik",
      "created_time": "September 22, 2022, 04:00:00 PM",
      "body": "Quote from: Robert518 on September 22, 2022, 09:20:06 AMWhy are many governments not regulating cryptocurrency?To be honest, cryptocurrencies do not have to be regulated, because indeed the nature of cryptocurrencies is that they are decentralized, not centralized, meaning that regulation is not implemented, it's just that we know that cryptocurrencies are very vulnerable to crime, such as terrorist financing and even money laundering.from that I hope more for all countries to legalize Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "electronicash",
      "created_time": "September 22, 2022, 04:12:33 PM",
      "body": "they dont know how to. in the US senate, they invite blockchain expert or someone knowledgable enough when they discuss crypto bill because law makers themselves doesn't know how to handle the tech behind crypto. and Gensler himself pretends not understanding it. China give up in trying to regulate crypto.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TheUltraElite",
      "created_time": "September 22, 2022, 05:29:59 PM",
      "body": "There are different aspects to this, as per my understanding. 1. They can screen the exchanges through which money in going and keep track using KYC. Difficulty is that too many exchanges are running and more coming up as well as DEXs which cannot be monitored like that.2. How to regulate? Confiscate and then prohibit the person or punishment for owning that currency. This is a difficult legal approach.It is possible that governments may come up with something new, lets hope for the best.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JoyMarsha",
      "created_time": "September 22, 2022, 07:51:07 PM",
      "body": "Cryptocurrency is not rampant. There is no need for the government to regulate it. The government only regulates what it sees its citizen getting highly involved with. A country will only regulate cryptocurrency when it sees the danger of how scammers using it to dupe its citizens.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "serjent05",
      "created_time": "September 22, 2022, 08:37:03 PM",
      "body": "Quote from: ethereumhunter on September 22, 2022, 12:33:15 PMQuote from: Robert518 on September 22, 2022, 09:20:06 AMWhy are many governments not regulating cryptocurrency?Governments are unaware of the existence of cryptocurrencies and when they know about it, they have become popular and are trying to learn about it. But because cryptocurrency is beyond their control, they don't fully regulate it. Maybe they can only set policies to use cryptocurrencies and adapt it to the conditions in their country. It looks like the government is still studying it and allowing its people to use it. And hopefully, the government will continue to allow us to use it and not make regulations that are too strict for its citizens.The government are not some kind of noob that doesn't know about the existence of cryptocurrency.   They already knew it, remember they have different departments and intels that can gather information, but they have a more important task in their hands than giving notice to the cryptocurrency industry.It is either they regulate or ban cryptocurrency, most prefer being in the middle because it won't cost them anything.  The only time they get involved in crypto is when they see a threat or potential benefits they have on it.  Quote from: JoyMarsha on September 22, 2022, 07:51:07 PMCryptocurrency is not rampant. There is no need for the government to regulate it. The government only regulates what it sees its citizen getting highly involved with. A country will only regulate cryptocurrency when it sees the danger of how scammers using it to dupe its citizens.I highly agree with you, the time when the government steps in are when a certain cryptocurrency had done huge damage to its citizen.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Silberman",
      "created_time": "September 22, 2022, 08:49:01 PM",
      "body": "Quote from: Robert518 on September 22, 2022, 09:20:06 AMWhy are many governments not regulating cryptocurrency?Many countries are regulating cryptocurrencies and some of the most important institutions around the world have called for an unified regulation coming from some of the most powerful countries around the world, now there could be some countries which haven't created any regulation at the moment, and the most likely reason for this is that there is simply not enough activity of those kind of assets in their country to justify a new regulation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "goaldigger",
      "created_time": "September 22, 2022, 09:42:06 PM",
      "body": "Quote from: Robert518 on September 22, 2022, 09:20:06 AMWhy are many governments not regulating cryptocurrency?Many countries now have their own regulations either to adopt cryptocurrency or just to ignore it for now. We cannot force them to do this, because what we are seeing now is that regulations can be very bad for cryptocurrency because it can kill the purpose of decentralized and being anonymous. Well, some countries don’t have any regulations yet but their people can freely own cryptocurrency and that’s actually a good one. Regulations might totally happen soon, I just hope for the positive impact of that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dataispower",
      "created_time": "September 22, 2022, 09:52:26 PM",
      "body": "Quote from: Robert518 on September 22, 2022, 09:20:06 AMWhy are many governments not regulating cryptocurrency?I don't think that government can regulate cryptocurrency, because it's a decentralized, because assuming that cryptocurrency is centralised currency it would have be easy for government to manipulate it and regulate it. Secondly. Bitcoin came unexpected to government and before they could know the adoption has gone far. And again bitcoin can be regulated in only one nation because of the usefulness in that nation, but generally that bitcoin will just be regulate i think it's impossible, even some of the countries that bitcoin is not legalize, the government of that country is only trying to regulates the adoption.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TravelMug",
      "created_time": "September 23, 2022, 02:30:13 AM",
      "body": "Quote from: Robert518 on September 22, 2022, 09:20:06 AMWhy are many governments not regulating cryptocurrency?What do you mean? There are a lot of government that are regulating crypto,  they have mandated that all platform should be mandated to have KYC/AML. At least that is what is going on in our country. Our government is crypto friendly but in the last couple of years they are heavily regulating it. So you have to look at the country and their governments because it depends on their stance on crypto. So if they are on the other side of the spectrum, then expect a full blanket ban. But if they are very friendly, then regulations will have in our way. Some government might have their own CBDC for all we know.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "adzino",
      "created_time": "September 23, 2022, 03:33:35 AM",
      "body": "Quote from: Robert518 on September 22, 2022, 09:20:06 AMWhy are many governments not regulating cryptocurrency?Because it is not very easy to regulate something that isn't centralized. But still most government has already found some way to regulate crypto currencies. Even if they can't directly control the network, they do have some way to indirectly control crypto currencies due to most people using centralized financial institutions like exchanges and wallets to do most of their transactions. Other countries that has no regulation what so ever don't know how crypto currencies work or they don't actually care.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TheUltraElite",
      "created_time": "September 23, 2022, 05:15:17 AM",
      "body": "Quote from: Teraboy on September 22, 2022, 11:47:38 PMThis is actually government's decision after try to analyze the crypto itself  It becomes a bit tricky when the government tries to use its own people to regulate stuff that is difficult for them to analyze. There are very few people who actually understand how crypto works in every country's administration. Still we can hope that each country attempts to go forward in civilization and not backward.It will take a lot of time for governments to actually regulate crypto and move it forward, or they may not and only focus on CBDCs. Whatever be the future, we should focus on collecting bitcoin as much as possible from our every day income and recycle that every bear-bull cycle so as to keep on increasing it.Like I said in my last, there are problems with regulating a decentralized currency, how the governments will bypass that only they know.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ethereumhunter",
      "created_time": "September 23, 2022, 05:28:03 AM",
      "body": "Quote from: serjent05 on September 22, 2022, 08:37:03 PMQuote from: ethereumhunter on September 22, 2022, 12:33:15 PMQuote from: Robert518 on September 22, 2022, 09:20:06 AMWhy are many governments not regulating cryptocurrency?Governments are unaware of the existence of cryptocurrencies and when they know about it, they have become popular and are trying to learn about it. But because cryptocurrency is beyond their control, they don't fully regulate it. Maybe they can only set policies to use cryptocurrencies and adapt it to the conditions in their country. It looks like the government is still studying it and allowing its people to use it. And hopefully, the government will continue to allow us to use it and not make regulations that are too strict for its citizens.The government are not some kind of noob that doesn't know about the existence of cryptocurrency.   They already knew it, remember they have different departments and intels that can gather information, but they have a more important task in their hands than giving notice to the cryptocurrency industry.It is either they regulate or ban cryptocurrency, most prefer being in the middle because it won't cost them anything.  The only time they get involved in crypto is when they see a threat or potential benefits they have on it.  They are not noobs but what they do seems a bit late because they started taking action after crypto became popular and many people started working or using crypto. And what's more, there was a pandemic yesterday that left many people unable to go anywhere and that's where casino crypto started to grow fast.The benefit that the government can take is how they can collect taxes from crypto users because we know that cryptocurrencies have developed into an industry that can provide large tax contributions. This is what the government wants.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}