{
  "id": "topic_5473503",
  "title": "Yipidy",
  "author": "Yipidy",
  "created_time": "November 09, 2023, 03:09:05 PM",
  "content": "So this is the case...I sent some btc from an electrum mobile wallet to another electrum mobile wallet.Reason: I wanted to send a certain amout to a different address but the funds in either of the wallets weren't enough so I wanted to \"top up\" one of the wallets with enough funds to send the required btc.Example...Electrum wallet 1: $5 worth of btcElectrum wallet 2: $10 worth of btcI want to send to X wallet: $12.So...I sent everything on Electrum wallet 1 ($5 worth of btc) to Electrum wallet 2. So now Electrum wallet 2 has $15 worth of btc.The problem...On Electrum wallet 1 (the sending wallet), I set the transaction fees too low. So it's been unconfirmed for days.To speed up things, I bumped the fee on the receiving wallet (Electrum wallet 2). A child pays for parent transaction. BUT!! The transaction was still stuck for a long time because the fee apparently was still not enough. I bumped the fees 3 times and still no go because the fees keep increasing.I then decided to go ahead and just send $8 to X wallet now and the remaining $4 some other time in the future. BUT!!...the transaction is stuck because...you guessed it...again...low fees.So now I have transactions stuck at multiple fronts.My question...How can I remedy my losses.I could bump up the fee, by a lot, and get my  confirmation, but the fees right now are crazy high and much more than I am willing to pay (it wouldn't be worth it).My mistake was that I did not use lightning instead.So...How can I incorporate lightning right now (as a first time user) to recoup my loses in pending transaction fees and get the $8 to X pronto?Appreciate your input!",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5473503",
  "comments": [
    {
      "author": "Kruw",
      "created_time": "November 09, 2023, 03:17:30 PM",
      "body": "Quote from: Yipidy on November 09, 2023, 03:09:05 PMHow can I remedy my losses.You can't remedy any losses already spent in fees.  You can increase the fee of an unconfirmed transaction, but you cannot decrease it.Quote from: Yipidy on November 09, 2023, 03:09:05 PMI could bump up the fee, by a lot, and get my  confirmation, but the fees right now are crazy high and much more than I am willing to pay (it wouldn't be worth it).Correct, your coins are currently worth less than the cost to spend them.  If fees go down in the future, you may be able to get some value out of your uneconomically small UTXOs by consolidating them with a larger coin.Quote from: Yipidy on November 09, 2023, 03:09:05 PMHow can I incorporate lightning right now (as a first time user) to recoup my loses in pending transaction fees and get the $8 to X pronto?Nodes are not really going to accept incoming channels for $8, so you are fundamentally limited by the amount you are dealing with.  If you want to incorporate Lightning, I recommend Phoenix Wallet on mobile for beginners.  Phoenix does not have the best privacy or the lowest fees, but it's extremely user friendly.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "November 09, 2023, 03:21:44 PM",
      "body": "The fees are very high now, and to open a lightning channel you need to make an onchain transaction which has a normal cost.If you want to do more transactions,  lightning might help you in your future transactions To use lightning in electrum, you can follow this guide made by Rath_https://bitcointalk.org/index.php?topic=5259973.msg54732922#msg54732922",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitMaxz",
      "created_time": "November 09, 2023, 03:53:00 PM",
      "body": "Pretty bad you're too late to do that the fees are suddenly spike according to mempool the low priority fee is around $8 but I think it will rise again more due to recent events about ORDI.The only way I could suggest is that if the transaction is still unconfirmed and you already made a bump transaction you can maybe able to speed up the transaction by submitting it to the ViaBTC accelerator. Here's the link https://www.viabtc.com/tools/txaccelerator",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yipidy",
      "created_time": "November 09, 2023, 03:55:05 PM",
      "body": "Quote from: Kruw on November 09, 2023, 03:17:30 PMNodes are not really going to accept incoming channels for $8, so you are fundamentally limited by the amount you are dealing with.  If you want to incorporate Lightning, I recommend Phoenix Wallet on mobile for beginners.  Phoenix does not have the best privacy or the lowest fees, but it's extremely user friendly.It's not really $8. That was just an example. How about doing it on Electrum?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Findingnemo",
      "created_time": "November 09, 2023, 04:36:54 PM",
      "body": "Quote from: Yipidy on November 09, 2023, 03:09:05 PM...How can I incorporate lightning right now (as a first time user) to recoup my loses in pending transaction fees and get the $8 to X pronto?Appreciate your input!First, you need to understand how lightning network transactions works which you can learn from Basics of the Lightning Network.It doesn’t replace them completely because on-chain transactions are still needed for closing and opening payment channels.So in your case lightning network will double the TX fee than the actual fee needed considering you need to open the channel and then fund it which needs on-chain TX for that you need to pay whatever fee is required at the moment and send it to the person X via lightning then while closing channel again you need to make an on-chain transaction.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yipidy",
      "created_time": "November 09, 2023, 04:46:23 PM",
      "body": "Quote from: BitMaxz on November 09, 2023, 03:53:00 PMHere's the link https://www.viabtc.com/tools/txacceleratorIs this safe?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yamane_Keto",
      "created_time": "November 09, 2023, 04:51:00 PM",
      "body": "Quote from: Yipidy on November 09, 2023, 03:55:05 PMIt's not really $8. That was just an example. How about doing it on Electrum?If you are not in a hurry, it is better for you to wait until the transaction is confirmed. The problem is that to calculate the transaction fees, the term wallet is useless. You need to specify the number of inputs, outputs and type of addresses. If you tell us the number of Inputs and outputs (how many address in both sides) and type of addresses, we will recommend the best fee for you in exchange for a reasonable waiting time ( Several hours) but the bump fee option will still mean that you will pay more",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yipidy",
      "created_time": "November 09, 2023, 06:25:59 PM",
      "body": "Quote from: Yamane_Keto on November 09, 2023, 04:51:00 PMQuote from: Yipidy on November 09, 2023, 03:55:05 PMIt's not really $8. That was just an example. How about doing it on Electrum?If you are not in a hurry, it is better for you to wait until the transaction is confirmed. The problem is that to calculate the transaction fees, the term wallet is useless. You need to specify the number of inputs, outputs and type of addresses. If you tell us the number of Inputs and outputs (how many address in both sides) and type of addresses, we will recommend the best fee for you in exchange for a reasonable waiting time ( Several hours) but the bump fee option will still mean that you will pay moreSo going by mempool[dot]space not so accurate?Also i was thinking of just sending the funds in lightning if the cost for the transaction from start to finish wont be more than a couple of dollars. It looks like it's at least $13 for btc atm. I realize ill be double sending - with the one that's pending eventually going through.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "khaled0111",
      "created_time": "November 09, 2023, 06:53:36 PMLast edit: November 09, 2023, 07:07:06 PM by khaled0111",
      "body": "Quote from: Yipidy on November 09, 2023, 03:09:05 PM.. I bumped the fees 3 times and still no go because the fees keep increasing.I then decided to go ahead and just send $8 to X wallet now and the remaining $4 some other time in the future. BUT!!...the transaction is stuck because...you guessed it...again...low fees.So now I have transactions stuck at multiple fronts.My question...How can I remedy my losses.In those three times you tryed to bump the fees, did you also use CPFP?If this is what you did and I'm getting the situation correctly then you now have four unconfirmed transactions and each of them is paying more fees than the previous one!Imo, the best thing to do is to cancel the first transaction sending from wallet 1 to wallet 2 and replace it with another one paying higher fees. This will cancel all the other transactions (child transactions).To do this, click on the transaction in your first wallet's history tab and select Options->Bump fee.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nc50lc",
      "created_time": "November 10, 2023, 10:52:22 AM",
      "body": "Quote from: Yipidy on November 09, 2023, 06:25:59 PMAlso i was thinking of just sending the funds in lightning if the cost for the transaction from start to finish wont be more than a couple of dollars. It looks like it's at least $13 for btc atm.The issue is if you do not have an existing channel opened, you'll have to open at least one to be able to send through lightning.Opening a channel incurs an on-chain transaction and requires confirmations before the channel can be established.So if you do not have an open channel yet, you'll need to spend as much fee or more to open a channel.And lastly, the receiver should've an active channel as well with enough inbound capacity to receive your funds.It's only convenient if you already set these all up while the fee is low.If you want to experience the workflow, I'd suggest you to test it in testnet. (available only on Desktop)Start Electrum in testnet mode (instructions), get some testBTC from testnet faucets (links) gather about 0.002tBTC and more for fee.Then enable lightning in \"Wallet->Information\", after that, create a new channel in \"Channels\" tab (View->Show Channels if it's not displayed).Use \"Channels->Settings icon->Submarine swap\" or purchase virtual coffee with tBTC from starblocks.acinq.co to gain inbound capacity on the receiver side.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Findingnemo",
      "created_time": "November 10, 2023, 12:40:30 PM",
      "body": "Quote from: Yipidy on November 09, 2023, 04:46:23 PMQuote from: BitMaxz on November 09, 2023, 03:53:00 PMHere's the link https://www.viabtc.com/tools/txacceleratorIs this safe?Yes, its completely safe but you transaction has to meet the criteria to be eligible for free acceleration. You just have to provide the txid and if you're eligible then the TX will likely to be confirmed in the next one hour since viabtc has an average of mining one block per hour.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackHatCoiner",
      "created_time": "November 10, 2023, 06:53:19 PM",
      "body": "Quote from: Yipidy on November 09, 2023, 06:25:59 PMAlso i was thinking of just sending the funds in lightning if the cost for the transaction from start to finish wont be more than a couple of dollars. It looks like it's at least $13 for btc atm.If you don't have a lightning channel opened already, you'll have to open one, which will cost you one on-chain transaction at first (which will also be more expensive than a regular native segwit), and another one when you'll have to close it. If you're not in a rush, you can broadcast your transaction at ~12 sat/vb ($1.50) and it'll be confirmed in about a day or two. Quote from: Yipidy on November 09, 2023, 04:46:23 PMIs this safe?If you use Tor, yes. It cannot de-anonymize you, and there is no problem with security whatsoever. It's the same as sending your transaction to a Bitcoin node which will then broadcast it to the rest.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}