{
  "id": "topic_5401872",
  "title": "kastoriante",
  "author": "kastoriante",
  "created_time": "June 09, 2022, 01:04:59 AM",
  "content": "Kısaca yazarsam, mail adresimi değiştirirken yanlış girdim. Diğer borsalar gibi yeni adresi onaylamak falan yok bunlarda. Neyse adresin değiştirilmesi için üç belge istiyorlar birisi de güncel tarih ve Paribu yazılı kimlikli öz çekim. Fotoğrafı çekiyorum, çektiğim fotoğrafta kimliği ben okuyorum ama bunlar okunmuyor diye kabul etmiyor. 3 gün önce saatlerce uğraştım, istedikleri gibi fotoğrafı çektim. Beni aradılar, değiştirdik dediler. Mailim değişmiş ama yine para çekemiyorum. Sordum yeniden belge istiyorlar. 3 gün önceki fotoğrafı da kabul etmiyorlar. Cimer'e yazsam Maliye Bakanlığına şikayet etsem olur mu? Var mı bilgisi olan? Ne kadar rezil bir firmaymış bu. BTC Turk falan gibi değil. Çalışanlar asla hiçbir konuda yardımcı olmuyor.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5401872",
  "comments": [
    {
      "author": "mandown",
      "created_time": "June 09, 2022, 08:37:28 AM",
      "body": "Borsaların işi bu kadar sıkı tutması kadar güzel birşey yok üç beş dolara hintli bulup kimlik doğrulayan biri olabilirdiniz. Bu kadar titiz çalışmaları suç mu oldu? Paribuyu kullanmıyorum ama bu konuda çok hassas olmaları doğru bir yaklaşım.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bthd",
      "created_time": "June 09, 2022, 11:16:12 AM",
      "body": "Quote from: kastoriante on June 09, 2022, 01:04:59 AMKısaca yazarsam, mail adresimi değiştirirken yanlış girdim. Diğer borsalar gibi yeni adresi onaylamak falan yok bunlarda. Neyse adresin değiştirilmesi için üç belge istiyorlar birisi de güncel tarih ve Paribu yazılı kimlikli öz çekim. Fotoğrafı çekiyorum, çektiğim fotoğrafta kimliği ben okuyorum ama bunlar okunmuyor diye kabul etmiyor. 3 gün önce saatlerce uğraştım, istedikleri gibi fotoğrafı çektim. Beni aradılar, değiştirdik dediler. Mailim değişmiş ama yine para çekemiyorum. Sordum yeniden belge istiyorlar. 3 gün önceki fotoğrafı da kabul etmiyorlar. Cimer'e yazsam Maliye Bakanlığına şikayet etsem olur mu? Var mı bilgisi olan? Ne kadar rezil bir firmaymış bu. BTC Turk falan gibi değil. Çalışanlar asla hiçbir konuda yardımcı olmuyor. Borsalar gönderdiğiniz evrakları genellikle manuel incelemezler, kimlikte yapılabilecek olası dezenformasyonu gözle tespit edemeyecekleri için synaps gibi kimlik doğrulama platformlarını kullanıyorlar. Telefon kameranızın kirliliğinden yada kimliğinizdeki her hangi bir lekeden dolayı flu bir görüntü oluşuyorsa otomatik reddeder. Yani gözle okunuyor olsa bile yeterli olmayabilir. Twitter destek ekibini zorlamayı deneyin eğer kimlik sürecini geçmeyi başardıysanız. Maliye bakanlığına bu konuda şikayet etmeniz çok işe yaramaz. Zaten bu şartların çoğunu artık onlar istiyor.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}