{
  "id": "topic_5473619",
  "title": "Best-mary",
  "author": "Best-mary",
  "created_time": "November 10, 2023, 03:00:44 PM",
  "content": "So, my friend who just started trading asked me which is better Fundamental and Technical Analysis. So, this is the reply I gave which I also decided to share with others who don't know how this works hand in hand.Fundamental Analysis and Technical Analysis are not inherently better than each other. Fundamental Analysis allows you to assess the potential direction of a coin's price, whether it's bearish or bullish. For instance, you can observe how Bitcoin's price has responded to positive news, which you can find on exchanges news insights, as well as popular news apps. Technical Analysis comes into play to further analyze price movements. Is just as easy as that.Fundamental tells you what to do, while Technical tells you when to do it",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5473619",
  "comments": [
    {
      "author": "Eternad",
      "created_time": "November 10, 2023, 03:08:24 PM",
      "body": "Quote from: Best-mary on November 10, 2023, 03:00:44 PMFundamental tells you what to do, while Technical tells you when to do it Not exactly this but you have some merit on your opinion. Fundamental Analysis is use for long term holdings since you will choose an asset to invest if it has a good fundamentals so that you can guarantee success in the future while Technical Analysis can give you a guide on when to enter and exit through indicator and chart patterns.I said you have a merit since you are right on your point but lacking some details, Fundamental Analysis is the foundation of your investment while Technical Analysis gives you the guide for your investment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oshosondy",
      "created_time": "November 10, 2023, 03:14:43 PM",
      "body": "Let me make this to be short, both technical and fundamental analyses are very important. You hear of good news, miners are not selling, exchange outflow to noncustodial wallet is increasing, long term holders are not selling, the present bitcoin spot ETF approval and many others like that makes the price of bitcoin to increase. The technical analysis is good too. You can still know that the price of bitcoin is not as high as all-time-high, you do not need to ask anybody, you can see it from the chart while analysing. You can also see from the chart a lot of information that makes it important. Both are very important and not need comparison.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Best-mary",
      "created_time": "November 10, 2023, 03:24:12 PM",
      "body": "Quote from: Oshosondy on November 10, 2023, 03:14:43 PMLet me make this to be short, both technical and fundamental analyses are very important. You hear of good news, miners are not selling, exchange outflow to noncustodial wallet is increasing, long term holders are not selling, the present bitcoin spot ETF approval and many others like that makes the price of bitcoin to increase. The technical analysis is good too. You can still know that the price of bitcoin is not as high as all-time-high, you do not need to ask anybody, you can see it from the chart while analysing. You can also see from the chart a lot of information that makes it important. Both are very important and not need comparison.Yeah, that's, more like it. I don't seem to compare the both but I do see people saying Technical Analysis is better. I do believe that both are good particularly fundamental which can direct you about the long-term journey of a particular asset. That's why is better before making any decision, we check both. I do get weekly insights on these two exchanges I use mostly Binance and Bitget, then check up some other news apps before deciding to trade",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bittraffic",
      "created_time": "November 10, 2023, 03:31:40 PM",
      "body": "Technical analysis traders are the ones using the charts to read where the markets go even in a short time frame relying on indicators. When they understand the use of moving averages and all, they combine what they learn outside the chart that affects the prices which is the fundamental news.ETF approval news is like fundamental news. I think some of those TA guys who are shorting after it went down to $31K were burned when suddenly another ETF news comes. Fundamental news must be useful for those insider traders.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mate2237",
      "created_time": "November 10, 2023, 03:50:11 PM",
      "body": "Among all, the fundamental analysis is the most important one because a trader can not do well when he or she has not gotten the fundamental knowledge of the trading tools. And the technical analysis is when you have mastered the fundamental then you use it to finalize the trading process. It is the time you can breakdown the movement of the market to know when to start and when to stop. Though all are necessary in the trading, a trader can't do without the both both the fundamental is the first of it all.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rruchi man",
      "created_time": "November 10, 2023, 04:37:29 PM",
      "body": "Quote from: Best-mary on November 10, 2023, 03:00:44 PMFundamental Analysis and Technical Analysis are not inherently better than each other. Knowledge and mastery of both analytical methods will greatly increase a traders chances of success. A trader who focuses on technical analysis will have results but not as good and consistent as it would have been had they known fundamental analysis. A trader who focuses on Fundamental analysis alone and not technical analysis will even make greater mistakes and errors in trading that will lead to losses. I personally feel that  both are necessary to know, but technical analysis is the most important. You can place a trade by just technically analyzing the charts and profit from the trade better than when you only rely on news and events to make a trade.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EarnOnVictor",
      "created_time": "November 10, 2023, 04:40:36 PM",
      "body": "Quote from: Best-mary on November 10, 2023, 03:00:44 PMFundamental Analysis and Technical Analysis are not inherently better than each other. Fundamental Analysis allows you to assess the potential direction of a coin's price, whether it's bearish or bullish. For instance, you can observe how Bitcoin's price has responded to positive news, which you can find on exchanges news insights, as well as popular news apps. Technical Analysis comes into play to further analyze price movements. Is just as easy as that.As much as I respect the opinion of everyone, for me, the technical analysis is better. I've been using both fundamentals and technical analyses since I started trading many years back and I've come across software and companies propagating their gospels about the two. The issue is that more lies/confusions go for the interpretation of the fundamental analysis and some news would always disappoint the expectation of people no matter how exect they are. There are also many news that would be interpreted in a way but the market will move in the opposite, this is not because the interpretation is wrong but the sentiment of the market doesn't just care, which is why news could be so frustrating regardless of how good you are at it.But if you are good with the chart reading, I must tell you that you would be so unstoppable in trading and will be earning consistently with less frustration and market disappontment. Also, there is nothing that would happen through the news that the effect would not be felt on the chart, and hence technical analysis traders could interpret and trade it. Meaning, nothing is truly hidden from the technical analysis.QuoteFundamental tells you what to do, while Technical tells you when to do it I simply do not understand your grammar, it's so wrong of the two. How could one tell you something and the other tell you to do it? Are you saying the two must be used together? This is all wrong as the two are independent of each other and you can use them independently as well. For fundamental analysis, read/hear the news, digest/interpret it and act on your trading platform whether to buy or sell. As for technical analysis, you solely read your chart and you act accordingly (buy/sell).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "macson",
      "created_time": "November 10, 2023, 07:12:18 PM",
      "body": "Quote from: Best-mary on November 10, 2023, 03:00:44 PMSo, my friend who just started trading asked me which is better Fundamental and Technical Analysis. So, this is the reply I gave which I also decided to share with others who don't know how this works hand in hand.Fundamental Analysis and Technical Analysis are not inherently better than each other. Fundamental Analysis allows you to assess the potential direction of a coin's price, whether it's bearish or bullish. For instance, you can observe how Bitcoin's price has responded to positive news, which you can find on exchanges news insights, as well as popular news apps. Technical Analysis comes into play to further analyze price movements. Is just as easy as that.Fundamental tells you what to do, while Technical tells you when to do it without good fundamental analysis, your final trading decision will be in vain, and without good technical analysis, your final trading decision will be in vain, so a balance between fundamental and technical analysis is very important, the point is, never be trivial with the history of bitcoin prices and also news about bitcoin circulating in the market, apart from that the other most important thing is risk management, yes that is a complete package to become a good trader, you need a balance of all three so that the final trading decision you make can be right.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husires",
      "created_time": "November 10, 2023, 08:18:00 PM",
      "body": "Both are complementary to the other. Fundamental analysis tells you basic information upon which to build the trading strategy that characterizes this stage. Then the role of technical analysis is whether it is primary or secondary. If the fundamental analysis tells you that the Bitcoin market is rising as in the coming months, then choosing a trading strategy that makes you buy now instead of spreading out dates. Buying and vice versa is true. When fundamental analysis does not give you an answer, the role of technical analysis comes in strengthening one of the hypotheses at the expense of the other hypothesis.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "carlfebz2",
      "created_time": "November 10, 2023, 08:19:49 PM",
      "body": "Quote from: Best-mary on November 10, 2023, 03:00:44 PMSo, my friend who just started trading asked me which is better Fundamental and Technical Analysis. So, this is the reply I gave which I also decided to share with others who don't know how this works hand in hand.Fundamental Analysis and Technical Analysis are not inherently better than each other. Fundamental Analysis allows you to assess the potential direction of a coin's price, whether it's bearish or bullish. For instance, you can observe how Bitcoin's price has responded to positive news, which you can find on exchanges news insights, as well as popular news apps. Technical Analysis comes into play to further analyze price movements. Is just as easy as that.Fundamental tells you what to do, while Technical tells you when to do it When it comes to differences then it would really be that basically be speaking or talking about FA= News / TA= Indicators/Tools. Actually it could really be able to move or could be used purely basing up on the situation which we know that not all the time this market could really be having that kind of sentiments or news around on which you could really be making some fundamental analysis on which means that you cant really be able to rely on it from time to time since not all the time which news do comes out. This is why it would really be that important that you should really know on making use of Technical indicatorson which means that you would really be needing to know as well so that you do able to make your positions even if the market doesnt really have any news around.In case if there's one, then you could make use of both, try to have if there's some confluence between two on which this is something that you will really be able to find outif that one would correlates to each other or not, you are the ones who would really be able to find it out.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bushdark",
      "created_time": "November 10, 2023, 08:32:55 PM",
      "body": "Quote from: Best-mary on November 10, 2023, 03:00:44 PMSo, my friend who just started trading asked me which is better Fundamental and Technical Analysis. So, this is the reply I gave which I also decided to share with others who don't know how this works hand in hand.Fundamental Analysis and Technical Analysis are not inherently better than each other. Fundamental Analysis allows you to assess the potential direction of a coin's price, whether it's bearish or bullish. For instance, you can observe how Bitcoin's price has responded to positive news, which you can find on exchanges news insights, as well as popular news apps. Technical Analysis comes into play to further analyze price movements. Is just as easy as that.Fundamental tells you what to do, while Technical tells you when to do it This is somehow funny to me honestly, just like you have explained the fundamental and technical analysis. Fundamental is just all about getting new about the market from the news while technical analysis is all about using our knowledge about chart patterns, candle sticks etc to evaluate what direction the market tend to go. The fundamental analysis is very different from the technical and we can use either to trade in the market depending on how we want our results to be. Although many traders make use of the technical analysis to trade the market most time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Faisal2202",
      "created_time": "November 10, 2023, 08:41:03 PM",
      "body": "Quote from: Best-mary on November 10, 2023, 03:00:44 PMFundamental Analysis and Technical Analysis are not inherently better than each other. Fundamental Analysis allows you to assess the potential direction of a coin's price, whether it's bearish or bullish. For instance, you can observe how Bitcoin's price has responded to positive news, which you can find on exchanges news insights, as well as popular news apps. Technical Analysis comes into play to further analyze price movements. Is just as easy as that.Fundamental tells you what to do, while Technical tells you when to do it You have explained it well, but in the last, I would say Fundamental tells us when to do and Technical tells us what to do because in fundamental we get to know the sentiments of the market whether it is of BTC or ALTs market. Once we get to know that it's time to make profits or take entry or I should say it's time to accumulate or distribute. After getting to know when to do what, there comes how to do it (means what to do) either we should follow the levels or trends of the market or ignore them and avoid all the risk assessments and enter the market at once or exit the market at once, etc. These are the points that comes in handy in technical analysis further technical analysis is a little bit hard for me but for other it might not be as fundamental we only have to be active so that when we get the news we can act upon it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "goaldigger",
      "created_time": "November 10, 2023, 08:59:09 PM",
      "body": "This is the basic thing that you should not forget to learn when you are planning to trade or invest.We know this market is risky and in order for us to minimize such risk we should do our own analysis and having that Fundamental analysis and Technical analysis skills can save you a lot of money. Everyone should not skip this learning part because its very important, we can’t trade successfully if we don’t have proper knowledge about this or else, you are doing gambling.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Assface16678",
      "created_time": "November 10, 2023, 09:34:00 PM",
      "body": "That's the basic knowledge that many beginners in trading forget. They abandon these two things, hoping to still earn; some rely on free trading signals or purchase signals from paid channels or groups. Without them knowing that, even though it is hard to learn and execute these two elements in tradition, eventually it will be worth it. And it's easy to learn this thing because all the resources, such as ebooks, videos, or study materials, are all over the internet; you just need to give it time and patience to absorb them. Anyway, it's good that you give your friend advice like that or an idea; it will be helpful for his trading journey. We just hope that he will know more about the two things you've mentioned. Yeah, it's a bit hard to absorb it all at once, and there's no guarantee that you will always have a winning trade, so I guess you should also have a good mindset while trading.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Johnyz",
      "created_time": "November 10, 2023, 09:41:15 PM",
      "body": "Quote from: Best-mary on November 10, 2023, 03:00:44 PMFundamental tells you what to do, while Technical tells you when to do it This is the shortest explanation for this two, and yes this is correct.Fundamental tells us if the project if worthy, and technical analysis helps us on timing the market so we can get the best price at the right time. This two should complement each other and if you are a long term investor, better not to forget to do fundamental analysis because not all project can be good in long term.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hd49728",
      "created_time": "November 11, 2023, 04:24:55 AM",
      "body": "You need to master this one firstBe fearful when others are greedy and be greedy when others are fearful from Warren Buffet.If you can not master it, can not understand the psychology of market cycles, you will fail with both fundamentals and technical analysis because your fear and greed will prevent you to do right decisions.It is a biggest challenge and a hardest one to master, not technical or fundamental analysis.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hypnosis00",
      "created_time": "November 11, 2023, 06:20:20 AM",
      "body": "Quote from: Johnyz on November 10, 2023, 09:41:15 PMQuote from: Best-mary on November 10, 2023, 03:00:44 PMFundamental tells you what to do, while Technical tells you when to do it This is the shortest explanation for this two, and yes this is correct.Fundamental tells us if the project if worthy, and technical analysis helps us on timing the market so we can get the best price at the right time. This two should complement each other and if you are a long term investor, better not to forget to do fundamental analysis because not all project can be good in long term. Both of them had different roles, traders would use TA while Holder would use FA. This is why we just focus on understanding the one the most needed for us, though we can still learn both of them as well. But the question arises if we could execute it well because it makes no sense if we fail to understand the situation of the market. We know TA and FA, plus executed well, and choose the right project(s) --success isn't far from happening. That is obviously not an easy job for us but certainly earn good rewards in the end.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Text",
      "created_time": "November 11, 2023, 06:41:01 AM",
      "body": "Quote from: Best-mary on November 10, 2023, 03:24:12 PMYeah, that's, more like it. I don't seem to compare the both but I do see people saying Technical Analysis is better. I do believe that both are good particularly fundamental which can direct you about the long-term journey of a particular asset. That's why is better before making any decision, we check both. I do get weekly insights on these two exchanges I use mostly Binance and Bitget, then check up some other news apps before deciding to tradeJust found an analogy and I'll leave it here:Fundamental analysis is like looking at the engine of a car. It tells you how well the car is made, and what it's capable of. Technical analysis is like looking at the car's dashboard. It tells you how the car is currently running, and whether it's likely to break down anytime soon.  If you're buying a car, you'll want to look at both the engine and the dashboard. The same is true when you're trading cryptocurrencies. You want to find coins with strong fundamentals, and then use technical analysis to time your trades.And this is my personal approach:Fundamental Analysis is beneficial for long-term investments while Technical Analysis is useful for short-term trading or day trading. FA is the vehicle that will get you to your destination.TA is GPS that guides you on when to make turns.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "knowngunman",
      "created_time": "November 11, 2023, 08:13:07 AM",
      "body": "Quote from: Best-mary on November 10, 2023, 03:00:44 PMFundamental tells you what to do, while Technical tells you when to do it This is very detailed for a lay man to understand the difference between fundamental and technical analysis. They both have their unique benefits and they can complement each other to help a trader make more informed and successful trades. Fundamental analysis can help you to identify potential opportunities and technical analysis can help you determine the best entry and exit points for a trade. Using both fundamental and technical analysis can help a trader to stay disciplined in trading. You know sometimes it's easy to get caught up in the emotions of the moment and either buy or sell a coin based on our feelings but using both fundamental and technical analysis can give us a clear and objective way to make decisions. The truth is that we have to keep in mind when using both fundamental and technical analysis that they're not perfect tools and there is always the potential for unexpected events to happen.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}