{
  "id": "topic_5447414",
  "title": "pakhitheboss",
  "author": "pakhitheboss",
  "created_time": "April 03, 2023, 03:08:55 PM",
  "content": "I am not so into finding jugad but considering the tax issue I went ahead and checked with one of my friend who is always using Amazon & Flipkart for most of his domestic requirements. The reason for me asking such a stupid question was to find out whether you can cash an Amazon gift card using Amazon pay. I found out that you can transfer the gift card amount to your bank account but you need to pass full KYC. Now the question that came into my mind was is their any tax involved for using a coupon on an Amazon or any other online platform? If yes then why use Bitrefill? If not then what are the implications of passing KYC of Amazon pay? I am aware the max you can get as a gift coupons is 5k as I recently made a purchase on Bitrefill. The problem is if I pass full KYC can I still cashout with regular intervals before Amazon start questioning my transaction?If anyone here has tried it please leave a reply.Thanks in advance. P.S- Please ignore my typo mistake as this time is midnight for me.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5447414",
  "comments": [
    {
      "author": "elevates",
      "created_time": "April 03, 2023, 04:02:35 PMLast edit: April 04, 2023, 01:50:11 AM by elevates",
      "body": "Hmm, this is interesting. I am not aware of how Amazon pay works. I think there would be some issues in doing a cashing out a gift coupon.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cafter",
      "created_time": "April 03, 2023, 04:08:44 PM",
      "body": "Quote from: pakhitheboss on April 03, 2023, 03:08:55 PMI am not so into finding jugad but considering the tax issue I went ahead and checked with one of my friend who is always using Amazon & Flipkart for most of his domestic requirements. The reason for me asking such a stupid question was to find out whether you can cash an Amazon gift card using Amazon pay. I found out that you can transfer the gift card amount to your bank account but you need to pass full KYC. Now the question that came into my mind was is their any tax involved for using a coupon on an Amazon or any other online platform? If yes then why use Bitrefill? If not then what are the implications of passing KYC of Amazon pay? I am aware the max you can get as a gift coupons is 5k as I recently made a purchase on Bitrefill. The problem is if I pass full KYC can I still cashout with regular intervals before Amazon start questioning my transaction?If anyone here has tried it please leave a reply.Thanks in advance. P.S- Please ignore my typo mistake as this time is midnight for me.  there is no fee or tax for redeeming the amazon gift card code,but, after redeeming the code you won't able to transfer that money into your bank account without doing full KYC,it will better for you to find any trusted user in service board and tell them to exchange that amazon pay gift card to inr or crypto (if you already redeemed the gift card and now that money is in you amazon pay wallet then you can buy another amazon pay gift card to code to exchange it for crypto or INR here in this forum many trusted people are there to help you to exchange any giftcard or you can use any other website to exchange)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "IIrik11",
      "created_time": "April 03, 2023, 04:37:57 PM",
      "body": "what will u show it in the income tax?that u sold some items on amazon and received money from it?that would again be taxable if your total source of income is taxable ie.best thing to do is to buy stuff with it that u buy anyway.but if your total income falls below the taxable income then i don't see any problems with amazon kyc.also, i am not sure but i think u can get amazon pay card that can be used to spend/withdraw money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pawanjain",
      "created_time": "April 12, 2023, 03:40:26 PMLast edit: May 15, 2023, 04:59:27 PM by pawanjain",
      "body": "Quote from: pakhitheboss on April 03, 2023, 03:08:55 PMI found out that you can transfer the gift card amount to your bank account but you need to pass full KYC.Is it possible ? If so then do let me know because just recently I got an Amazon Voucher of 2500 INR.And I was thinking if there's anyway to get it in my bank account but didn't find any.Also, Amazon have explicitly mentioned it that once balance is loaded on Amazon then we cannot transfer it to bank.Bolded part in below screenshot.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lender",
      "created_time": "April 12, 2023, 06:16:21 PM",
      "body": "Quote from: pakhitheboss on April 03, 2023, 03:08:55 PMI found out that you can transfer the gift card amount to your bank account but you need to pass full KYC. How? AFAIK, you can not ever transfer your GC balance to bank account. Please note that, Amazon Pay balance can be loaded using bank account as well. You may transfer that money back to your bank account again.Quote from: pakhitheboss on April 03, 2023, 03:08:55 PMI am aware the max you can get as a gift coupons is 5k as I recently made a purchase on Bitrefill. No. 10k. Check https://www.coinsbee.com/en/Amazon-bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Coinsbee.com",
      "created_time": "May 28, 2023, 08:18:19 PM",
      "body": "Yes we offer Amazon Pay giftcards up to 10.000INR.We added also a lot of other indian brands. Even Paytm and Flipkart.Our mission is to make it easier to use crypto in real life for all cryptousers out there. Hope you like what we do. ;-)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "avikz",
      "created_time": "May 29, 2023, 03:49:06 PM",
      "body": "Quote from: pakhitheboss on April 03, 2023, 03:08:55 PM I found out that you can transfer the gift card amount to your bank account but you need to pass full KYC. Now the question that came into my mind was is their any tax involved for using a coupon on an Amazon or any other online platform? If yes then why use Bitrefill? If not then what are the implications of passing KYC of Amazon pay? I am aware the max you can get as a gift coupons is 5k as I recently made a purchase on Bitrefill. The problem is if I pass full KYC can I still cashout with regular intervals before Amazon start questioning my transaction?If anyone here has tried it please leave a reply.Thanks in advance. P.S- Please ignore my typo mistake as this time is midnight for me.  Are you sure? I have tried doing it but wasn't able to transfer the gift card balance to my bank account. I wasn't even able to make UPI transactions with that. I am one of the oldest members of Amazon Prime and fully KYC verified. Please let me know how you did that? I personally think, if you don't transact too often, there's no way Amazon will question you. I do about 40-50 grand gift card transaction in a year and have never received any questions from them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}