{
  "id": "topic_5402737",
  "title": "Vijjuxtra",
  "author": "Vijjuxtra",
  "created_time": "June 15, 2022, 03:47:21 PMLast edit: June 19, 2022, 10:39:15 AM by Vijjuxtra",
  "content": "New token launched Digigame(DGM)on Polygon Matic Networktest liquidity provided and working fine we are heading for launch on 20th junmay be stealth launchSmart Contract Address :-0x7B0084FA010E856DE9138b570Ff6C49C5C8b7CDfour telegram group link :- https://t.me/Digigame_Dgm we facing some issues with twitter will announce after updates.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5402737",
  "comments": [
    {
      "author": "zasad@",
      "created_time": "June 15, 2022, 06:08:30 PM",
      "body": "I don't know what kind of project you have, but you chose not the best time to start. The index of fear is maximum, the markets are falling. Even serious projects have now suspended listing on exchanges, because people will sell tokens, not invest in them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Vijjuxtra",
      "created_time": "June 19, 2022, 10:42:02 AM",
      "body": "if that,s a thing we match our liquidity with stable tokenso price fluctuation does,nt effect our projectwe have solution i am not behind money i am behind something else  we just want to prove ourselves",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bayudndy",
      "created_time": "June 19, 2022, 12:33:19 PM",
      "body": "I don't know what you're thinking when you're spreading the above information at this point. I understand this is the next shitcoin where you are trying to spread and fantasize about profits. Right from the name Digigame, I envisioned a plagiarized product that copied the idea and arrived late with a tendency to exaggerate. So keep that opportunity to yourself, or you can erase it from your mind with a deceptive thought about the messaging in this market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SistaFista",
      "created_time": "June 20, 2022, 01:55:26 AM",
      "body": "You should make a proper announcement about the project so people will join into the project.The thread of new token announcement is here : https://bitcointalk.org/index.php?board=240.0With that way, im very sure that there will be more people come to visit the project's website.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Morningstarr",
      "created_time": "June 20, 2022, 02:55:34 PM",
      "body": "Please give more and proper information about your project so everyone can discuss its features. If you listen to my advice, be patient now and wait for the market to settle.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Xal0lex",
      "created_time": "June 20, 2022, 08:00:21 PM",
      "body": "Another potential scam. There is no website, no social networks, no information, just a smart contract and a telegram group. Hundreds, if not thousands, of such smart contracts appear online every day, and they are all worthless and no one needs them. What are the creators counting on when they choose this form of presentation of their project?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ANSEL_2.0",
      "created_time": "June 21, 2022, 06:07:50 AM",
      "body": "Quote from: zasad@ on June 15, 2022, 06:08:30 PMI don't know what kind of project you have, but you chose not the best time to start. The index of fear is maximum, the markets are falling. Even serious projects have now suspended listing on exchanges, because people will sell tokens, not invest in them.You do have a point but many projects in 2018 got launched in a bear market and they are doing so well right now, Cartesi, DIA, and Vulcan forged all came in a bear market, the only difference here is we are still in a very early bear market I believe.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Vijjuxtra",
      "created_time": "July 12, 2022, 08:56:48 AM",
      "body": "Quote from: Xal0lex on June 20, 2022, 08:00:21 PMAnother potential scam. There is no website, no social networks, no information, just a smart contract and a telegram group. Hundreds, if not thousands, of such smart contracts appear online every day, and they are all worthless and no one needs them. What are the creators counting on when they choose this form of presentation of their project?We are not a scam project, yes you may call us strugglers,or a victim's if we were was to make scam we would never had showed our intentions, we had did it earlier,we would have got lots of investors earlier,but we took our own time to represent ourselves instead of getting attracted to fake project s we advise you believe us once, it's not your fault to call us scammers, there are many out there do it, and I know it's hard to judge..If you are calling or thinking us as scammers, I advise  your followers not to follow you bcoz you are bad at judging or you are bad at making decisions. Sorry but its truth I dont how do you digest it..😔😔😔",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Vijjuxtra",
      "created_time": "July 12, 2022, 09:04:06 AM",
      "body": "Quote from: SistaFista on June 20, 2022, 01:55:26 AMYou should make a proper announcement about the project so people will join into the project.The thread of new token announcement is here : https://bitcointalk.org/index.php?board=240.0With that way, im very sure that there will be more people come to visit the project's website.Well thanks your response guided us, we remember you as our well wisher A true friendThank you very much for guiding & for your valuable time",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "RussianEnglishTranslation",
      "created_time": "July 12, 2022, 01:53:23 PM",
      "body": "Quote from: Vijjuxtra on June 15, 2022, 03:47:21 PMNew token launched Digigame(DGM)on Polygon Matic Networktest liquidity provided and working fine we are heading for launch on 20th junmay be stealth launchSmart Contract Address :-0x7B0084FA010E856DE9138b570Ff6C49C5C8b7CDfour telegram group link :- https://t.me/Digigame_Dgm we facing some issues with twitter will announce after updates.I see so many projects launching tokens on BNB chain and Polygon but I think to myself, why? Why would you do that when you can get paid to launch on Candle Chain and receive a token grant? And if you're launching a DApp, Fantom for example also gives FTM tokens to high TVL projects on their chain. If you are creating a project, you should do it on a chain that wants you there and appreciates you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dezoel",
      "created_time": "July 12, 2022, 02:16:29 PM",
      "body": "Quote from: Vijjuxtra on July 12, 2022, 08:56:48 AMWe are not a scam project, Of course no one will admit that they are a scam but unlike him I won't judge you that early. First, I will check your project properly and do some re-searching if the text used are plagiarized and if the image used are stolen from the internet. Next would be studying the potential of the project if it's worthy to invest on it or not.Quote from: Vijjuxtra on July 12, 2022, 08:56:48 AM if we were was to make scam we would never had showed our intentions, we had did it earlier,we would have got lots of investors earlier,Oh so this was not the first project you created? That's nice but that wasn't enough for someone to fully trust you. You know there are so many trusted people or companies that run for years before they show their true intentions. That is one of their tactics, to gather as much as confidence from the public so that they can scam bigger amounts.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Xal0lex",
      "created_time": "July 12, 2022, 08:03:34 PM",
      "body": "Quote from: Vijjuxtra on July 12, 2022, 08:56:48 AMQuote from: Xal0lex on June 20, 2022, 08:00:21 PMAnother potential scam. There is no website, no social networks, no information, just a smart contract and a telegram group. Hundreds, if not thousands, of such smart contracts appear online every day, and they are all worthless and no one needs them. What are the creators counting on when they choose this form of presentation of their project?We are not a scam project, yes you may call us strugglers,or a victim's if we were was to make scam we would never had showed our intentions, we had did it earlier,we would have got lots of investors earlier,but we took our own time to represent ourselves instead of getting attracted to fake project s we advise you believe us once, it's not your fault to call us scammers, there are many out there do it, and I know it's hard to judge..If you are calling or thinking us as scammers, I advise  your followers not to follow you bcoz you are bad at judging or you are bad at making decisions. Sorry but its truth I dont how do you digest it..😔😔😔Don't have to twist words into a profitable victim position and try to make me look like some kind of scoundrel. I didn't say you were scammers. I said the project is a potential scam. This means that you have not cheated anyone, but the project has all the prerequisites to go bust and leave its investors with a loss. By the way, the projects do not always fail because of deception of developers and owners. It can also occur due to natural reasons, such as poor and ill-conceived tokenomics, very bad marketing, unoriginality of the product offered and other conditions.I came into altcoin world not yesterday and I have reasons to think like that, not just randomly take information and throw it in anyone. Why do I consider this project a potential scam? Because there are no resources to tell about the project concept, white paper, roadmap, there are no venture capitalists, there is no support from various crypto communities. Do you really think that one smart contract address and a telegram group is enough to get people to start investing in you and see your project as a serious player in the crypto world?If you think that I am prejudicially calling you a potential scam, you can contradict me and provide as an argument at least 3 projects that started their crypto journey just like you did (just smart contract address and telegram group) and succeeded, their token grew in value, they attracted investors, conducted a successful investment round and got listed on some exchange. Do you have any such examples?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}