{
  "id": "topic_5468846",
  "title": "Negotiation",
  "author": "Negotiation",
  "created_time": "October 02, 2023, 03:54:59 AMLast edit: October 03, 2023, 08:12:11 AM by Negotiation",
  "content": "There are many people around us, where their income is not enough to manage a family how do you manage your family and economy? There are many people who manage their family very well even though their income is very low in their personal life, how do you manage it?I listed some advices with Quotes.Quote from: Upgrade00 on October 02, 2023, 04:19:22 AMQuote from: Litzki1990 on October 02, 2023, 04:05:28 AMNo matter how low a person's income is, even if it is difficult, people are able to run their family with that small amount of income. That is quite an optimistic view, but no one can run a family on an income of $1 per day or less. There are basuc necessities that has to be paid for, of which the most important is food and shelter, if you cannot provide these 2 basic needs, there is no family Quote from: Litzki1990 on October 02, 2023, 04:05:28 AMThe higher your income the higher your expenses the lower your income the lower your expenses. The lower your income, the more necessities you have to let go off. Your expenses does not reduce, but you adjust (by letting go of some things) to make it work. For example, you can forfeit an education for shelter, even though both are important, you opt for the most basic need.Quote from: Zlantann on October 02, 2023, 06:04:10 AMThe first thing to do is to plan how to use your income. You should have a budget that guides your financial endeavors. You should also take note of the following. 1. Focus on only basic needs and reduce luxury to a large extent. Seek for a cheap alternative for the thing you buy. 2. Search for alternatives for making additional income. You might need to learn a new skill or get a certification. 3. Invest in durable products, don't be enticed by flashy but fragile products. You don't need to change any of your belongings when they are still in good shape. 4. Cut the cost of living by reducing your expenses. You can decide to use public transport instead of driving or moving to a cheaper accommodation.  5. Pay attention to your health. Don't joke with exercise, healthy food, and hygiene. It is cheaper to maintain your health than to seek medical attention when ill. Quote from: eightdots on October 02, 2023, 06:13:33 AMThis is a very difficult situation. Even if you give up your personal expenses and spend your income for your family, in some cases you may not be able to afford everything. In such situations, one needs to have a strong mental structure. He needs to find additional income to manage his difficult situation. If he cannot earn additional income, he should make the best use of the money he earns.They should get their needs in the cheapest way and avoid additional expenses. There are many people living in difficult conditions and they somehow survive. Everyone needs to plan for their financial situation and find the best solution.Quote from: Solosanz on October 02, 2023, 08:46:06 AMWho are them? it's your friend? your cousin? people you see in social media? your neighbor? if you haven't live with them at least for a week, you can't say they can manage their family very well because you're only see the \"cover\", you don't know about the inside of their family.Haven't you heard \"fake it, until you make it\"? I don't believe someone can manage their family \"very well\" when their income are low range.Quote from: Woodie on October 02, 2023, 09:32:04 AMQuote from: Negotiation on October 02, 2023, 03:54:59 AMThere are many people around us, where their income is not enough to manage a family how do you manage your family and economy? There are many people who manage their family very well even though their income is very low in their personal life, how do you manage it?It starts by knowing how much the family uses in a month that's from utility bills(water, electricity, phone & data),  food, your transport or fuel Bills and if kids are in the picture school fees need to be worked into the calculations then draw up your budget to know how to use available resources.If one finds themselves in a budget deficit then a side hustle or second job needs to be considered  as these bills won't pay themselves...Quote from: YUriy1991 on October 02, 2023, 04:11:38 AMThis condition is very common and is not something new. Well, I think this is where we need to activate coordination and communication with our wives. Mature advice right here !!!Communication is the key to solving these problems, if both husband and wife need to get a job, then let it be so until husband finds a well paying job to get wife off work duty.Quote from: lovesmayfamilis on October 02, 2023, 10:54:28 AMThe expression “very well even though their income is very low in their personal life” is not entirely true. Maybe these people and families are well-fed; maybe they are clothed, but we don’t know their real needs. Most likely, they deprive themselves and their children of the most ordinary things, such as what we provide for ourselves and our children. Yes, many people have different levels of happiness. And not everyone’s happiness is measured precisely by money. However, for you to feel good, you first need health, and maintaining it is becoming very expensive these days. But be that as it may, people should not kill themselves with suffering because they are not getting something in life. As harsh as it may be, the fact that someone is poor is always their fault. The fact that people agree to be poor is the biggest problem for them.Quote from: Rruchi man on October 02, 2023, 01:55:54 PMQuote from: Negotiation on October 02, 2023, 03:54:59 AMThere are many people around us, where their income is not enough to manage a family how do you manage your family and economy? If your income is not enough to manage a family and you do not have a family yet, Do not start one. There is already a high rate of crime, do not bring children into this world when you know you cannot yet carter for them, that is just adding more to the problems of the society. You should be able to take good care of yourself first before you start a family, do not fall into that trap where you are advised that you can start a family first, that money will come to take care of them, that is a lie!Quote from: Negotiation on October 02, 2023, 03:54:59 AMThere are many people who manage their family very well even though their income is very low in their personal life, how do you manage it?Planning is the word that explains it all.Quote from: Abu-Naim on October 02, 2023, 05:10:56 PMQuote from: Negotiation on October 02, 2023, 03:54:59 AMThere are many people around us, where their income is not enough to manage a family how do you manage your family and economy? There are many people who manage their family very well even though their income is very low in their personal life, how do you manage it?Though to me it is very simple to manage a family according to my income, if my income is low, then definitely there are things I will let them go for the main time. No condition is permanent. So people who have a low income will know how to manage their families. For example, if you earn $50 a month and plan for $80 in expenses, that is not a good plan. Cut your cut according to your size. You need to let some things go while you want to have other things. So as a responsible man who wants to manage his family in a good way and has a low income, you will know what kind of expenses you will bring up. Quote from: Antotena on October 02, 2023, 02:27:07 PMAnother solution for less people who have little to survive is to ensure that they do family planning, stop giving birth to kids that you cannot control, you cannot control the economy but you can control your family to your budget so as to live without pressures.Exactly. The way the world economy is moving now, family planning is very important, and I think it will be the only way to reduce our expenses if we really want to make our family happy financially because things are getting high every day and the income is low. But when this family planning is implemented, you will definitely manage your family's financial status well.Quote from: Yatsan on October 02, 2023, 05:15:30 PMIf there’s no other way to earn more then the only option left is to make adjustment with your expenses. Average salary would still give you chances to make it bigger but lower salary on the other hand will be a real problem wherein most of the time, people are the ones who adjust in order for your daily income to be enough for the rest of the day. Managing finances means you should be aware of the amount of money which is circulating with your family’s environment. However one should not settle with low salary especially if you have the skill and knowledge to know more and to earn more. Tough times would indeed push you to adjust your lifestyle for the meantime but that would be for your own good. To those who are saying investment is the key; keep in mind that ot all people has the capability to do so.Quote from: tjtonmoy on October 02, 2023, 05:51:06 PMA man should always provide. This is what we have learned as we grew up. So doesn't matter what your income is, a man can find ways to provide for his family. I live alone so I may not know about it, but when there is a responsibility on my shoulders, I will find a way somehow. Maybe I will have to suffer, or my family will suffer too, but that's the push that I will need to expand my way of earning. Here's an interesting fact. As a Muslim, I believe in it. So here it is. The word Rizq is mentioned 123 times in the Quran and most of which essentially addresses how it comes from Allah the Exalted. It is He who determines what a person will obtain in this life. It is Allah who gives us happiness and Allah who sets the events for sadness. He is Allah Ar-Raziq and Ar-RazzaqSourceSo you have to do what you can to earn but Allah is the one who will provide for you. But the thing is you need to try and keep on working. When you are providing for your family, their rizq(Some scholars translate Rizq as ‘sustenance’, ‘provision’ and some call it ‘blessings’. ) will also come from your hand. So somehow everything will be alright. All you need to do is work in order to get it. Quote from: Fortify on October 02, 2023, 06:46:32 PMSome people find great value from family and manage to scrape through life very happy in these situations. Sure, they would gladly like the have more money but I have encountered plenty of families who have a very strong bond in comparison to others after going through this lifestyle. There are all sorts of ways to save money in a family, like sharing clothes across the generations - especially for younger kids. Making meals go further with lots of cheaper vegetables. They really have to think creatively and always be on the hustle where they can. Taking advantage of benefits available to them should also be a top priority because in some ways large families are supporting future generations so should be encouraged or at least helped.Quote from: carlfebz2 on October 02, 2023, 07:23:41 PMLive by your meansLive according into your capabilityLive a life which you dont make yourself too lavish on spendingChoose first your prioritiesProper money managementPeople do really differ on this aspect on which there are ones who do really that ending up on devastated just because of wrong budgeting or spending out of their income which they aregoing into those borderline without even thinking on whats tomorrow but there are those people who are really that having that good financial planning on which despite of having not that sufficient number of their salary but still they do able to partition it out well and able to compensate somehow. Yes, its hard but its not impossible. It would really just dependingor would really be entirely be basing up on how well you do handle yourself when it comes to this matter.Some cant really just be able to realize that living within their means does give out that kind of advantage. Dont make yourself chasing on being on the trend and buyingshit things along the way because it would really be derailing you out if you are really that making a budget.Quote from: KingsDen on October 02, 2023, 11:23:25 PMIf your income is low, you have an extra work to do in order to sustain your family. You must first be smart to detect that your present income is not enough to cater for your family. You have to do the following; Try and handle more jobs in order to earn more in order to sustain your family. You have to learn to spend less. Deprive yourself some luxuries because of your family.   Plan to relocate with your family in the case you are living in a very advance area.   Endure you do not lose money carelessly  The most important is to train your child to leave according to what you have  Quote from: el kaka22 on October 03, 2023, 03:22:00 AMI would suggest try to find more money is the only thing that you can do. Trying to learn to live with a small amount is not acceptable and you are going to end up with something that would be a lot worse. If you go from 1000 dollars to 500 dollars and get used to it, then you will get used to 300 and then to 200. Don't do that, find a way to grow your income, I do not know what OP can do or anyone else that can read this can do, we all have our own separate lives so always try to find something that fits you personally but I believe that unless you try to make some more money than you are not going to do a lot better.I think it should be important to remember that we are going to end up with a better life not by cutting down on our expenses but get better life by earning a lot more money by finding something we love doing.I will also record some more advice in my diary....Cheer,",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5468846",
  "comments": [
    {
      "author": "Litzki1990",
      "created_time": "October 02, 2023, 04:05:28 AM",
      "body": "No matter how low a person's income is, even if it is difficult, people are able to run their family with that small amount of income. The higher the income, the higher the cost of running a household, that is, the cost of running a household depends entirely on your income. The higher your income the higher your expenses the lower your income the lower your expenses. A person earning $10 a day and a person earning $3 a day must think differently about managing a family. Those who earn $10 will try to live a little better and market a little better, but those who earn $3 a day will market once or twice a week, and spend a limited amount of money. It is definitely possible to manage a family if the income is low or high and can be calculated.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "YUriy1991",
      "created_time": "October 02, 2023, 04:11:38 AM",
      "body": "This condition is very common and is not something new. Well, I think this is where we need to activate coordination and communication with our wives. To be honest and I don't think it's wrong to tell the actual income conditions, the figures for how much income comes in every month. That way, our wives can understand and try to manage it optimally and of course there must be additional efforts to help cover these deficiencies. Yes. Being honest is better because we as heads of families have conveyed the true conditions because the final goal of what we are trying is only for our family and not for other.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Upgrade00",
      "created_time": "October 02, 2023, 04:19:22 AM",
      "body": "Quote from: Litzki1990 on October 02, 2023, 04:05:28 AMNo matter how low a person's income is, even if it is difficult, people are able to run their family with that small amount of income. That is quite an optimistic view, but no one can run a family on an income of $1 per day or less. There are basuc necessities that has to be paid for, of which the most important is food and shelter, if you cannot provide these 2 basic needs, there is no family Quote from: Litzki1990 on October 02, 2023, 04:05:28 AMThe higher your income the higher your expenses the lower your income the lower your expenses. The lower your income, the more necessities you have to let go off. Your expenses does not reduce, but you adjust (by letting go of some things) to make it work. For example, you can forfeit an education for shelter, even though both are important, you opt for the most basic need.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ben Barubal",
      "created_time": "October 02, 2023, 04:33:47 AM",
      "body": "Quote from: Negotiation on October 02, 2023, 03:54:59 AMThere are many people around us, where their income is not enough to manage a family how do you manage your family and economy? There are many people who manage their family very well even though their income is very low in their personal life, how do you manage it?       Proper management is all that is needed to maintain your responsibility to your family. It's not a question of whether the salary or income you earn at work is big or small. What is important is how you support your family properly. And there are many who do it even in the present time.         This is a matter of proper knowledge, because if you know what you should know, it is not sure that it will lead to improper management of the family you have. You can definitely manage your financial status correctly in the life you have now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JunaidAzizi",
      "created_time": "October 02, 2023, 05:20:11 AM",
      "body": "Quote from: Negotiation on October 02, 2023, 03:54:59 AMThere are many people around us, whose their income is not enough to manage a family how do you manage your family and economy? There are many people who manage their family very well even though their income is very low in their personal life, how do you manage it?This is not a new one as already many families in the world are passing such an issue. I have seen many people in my country where their income is less but still, they are serving. If a person has a $10 income per day and his necessities are $15 per day then they need to reduce their consumption level up to $7 per day, let me explain, In our daily life food is not the only thing for survival you need clothes, shelters, education, and medications. If you use all the $10 on food then how you will treat the others in case of any illness how you can take medication from doctors, how to buy clothes, and if you want any investment then how you can do it? By saving the $3 you can up to some extent manage these things.The above is just a rough estimate for your understanding. If you have a small income you need to tell your family not because of sympathy but for the reason to reduce their unnecessary things yeah do not tell them the actual income you are earning tell them the lower one so they will manage their needs in it and save the rest of money for investment in somethings like in bitcoin because form this problem you need to come out and the only path is to do investment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kakmakr",
      "created_time": "October 02, 2023, 05:41:26 AM",
      "body": "You do what millions of people are doing..... you adapt your lifestyle towards the income that you receive. You first start by cutting the luxuries from your budget and strip it down to the bare necessities and then you find cheaper alternatives for the bare necessities. You also look for ways to supplement your primary income, so that you can pay off most of your debt. Also try not to incur more debt, because that puts you in a worst situation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zlantann",
      "created_time": "October 02, 2023, 06:04:10 AM",
      "body": "Quote from: Negotiation on October 02, 2023, 03:54:59 AMThere are many people around us, where their income is not enough to manage a family how do you manage your family and economy? There are many people who manage their family very well even though their income is very low in their personal life, how do you manage it?The first thing to do is to plan how to use your income. You should have a budget that guides your financial endeavors. You should also take note of the following. 1. Focus on only basic needs and reduce luxury to a large extent. Seek for a cheap alternative for the thing you buy. 2. Search for alternatives for making additional income. You might need to learn a new skill or get a certification. 3. Invest in durable products, don't be enticed by flashy but fragile products. You don't need to change any of your belongings when they are still in good shape. 4. Cut the cost of living by reducing your expenses. You can decide to use public transport instead of driving or moving to a cheaper accommodation.  5. Pay attention to your health. Don't joke with exercise, healthy food, and hygiene. It is cheaper to maintain your health than to seek medical attention when ill.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "eightdots",
      "created_time": "October 02, 2023, 06:13:33 AM",
      "body": "Quote from: Negotiation on October 02, 2023, 03:54:59 AMThere are many people around us, where their income is not enough to manage a family how do you manage your family and economy? There are many people who manage their family very well even though their income is very low in their personal life, how do you manage it?This is a very difficult situation. Even if you give up your personal expenses and spend your income for your family, in some cases you may not be able to afford everything. In such situations, one needs to have a strong mental structure. He needs to find additional income to manage his difficult situation. If he cannot earn additional income, he should make the best use of the money he earns.They should get their needs in the cheapest way and avoid additional expenses. There are many people living in difficult conditions and they somehow survive. Everyone needs to plan for their financial situation and find the best solution.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "xSkylarx",
      "created_time": "October 02, 2023, 07:01:28 AM",
      "body": "Ive been in that situation where the biggest problem is your food and those other expenses like medical if someone got sick and if there are expenses in school. This strategy that you will do really is that you need to cook food that will last the 2 or 3 meals like you will cook breakfast that you will eat still at dinner. I know others may say that they cant do that but that is the way you can save if you have low income and you cant have another meal when we eat. Also we rarely do snacks if we do only bread and juice but this is really rare. Lastly we won't be taking any vitamins because they are very expensive.There are other strategies but this is really what I noticed before with my parents, it is difficult as you will get jealous that other of your friends can eat at those restaurants but you can't do it you just smell their cooking as you pass by as you can't afford it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DrBeer",
      "created_time": "October 02, 2023, 07:13:00 AM",
      "body": "Quote from: Negotiation on October 02, 2023, 03:54:59 AMThere are many people around us, where their income is not enough to manage a family how do you manage your family and economy? There are many people who manage their family very well even though their income is very low in their personal life, how do you manage it?I have one question and one answer Question : and why did you decide that family/money management is only applicable if you have a small income ? Answer: family budget management is ALWAYS necessary !You should plan your income, expenses and even your payment calendar, so that you don't get what is called \"cash flow gap\" at one moment - when you should have money in the nearest time, but at the moment when you need to pay, you don't have it.At the same time, you have to take into account everything on the cost side - utilities, school fees for the kids, parking fees, food costs, loans and obligations, etc. The same goes for income.  Otherwise, the picture will not be very accurate, which means you may have an erroneous assessment of the situation.And then you will see the real picture - what you need to do - where to save, where you can postpone, and where you need to start looking for additional income! Good luck and profit to you !",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mvdheuvel1983",
      "created_time": "October 02, 2023, 07:48:52 AM",
      "body": "Quote from: Negotiation on October 02, 2023, 03:54:59 AMThere are many people around us, where their income is not enough to manage a family how do you manage your family and economy? There are many people who manage their family very well even though their income is very low in their personal life, how do you manage it?Life has dealt many of us with its cards. The difference between the two narratives in the story is that one person decides to play it the best way he can.If you are a low income earner who has family responsibilities, to manage you well your resources doesn't happen by chance but through conscious effort. Planning and the right strategy. If you do not live in your own house, you know that the most important thing is your shelter. So you have to pay your rent. Next is feeding. You need to be able to either stock up the most essential stable food through bulk buying and you can have a small garden in your yard where you grow vegetables. Schooling. You can home-school your kids if you don't have the means or rather put them in a good school where the fees is affordable and supplement it with teaching them too. Next is clothing. There are thrift stores where you can get durable clothes for less than a dollar. Basically, live below you means and strategically plan.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yamane_Keto",
      "created_time": "October 02, 2023, 07:57:37 AM",
      "body": "The solution to all these problems is through more learning and thinking outside the box, and starting financial education before finishing university so that you have more ideas about trading and how to make money than how to look for a good job.I see that most of us believe that the ideal solution is to find more high-income jobs or try to work in another country so that there are better opportunities to live or to immigrate to another country where tax levels are low, but unless you have knowledge of trade and how to create your own business, large market variables will force you You have to give up your job or have a lower annual income over time. We should not forget that pension and retirement funds and the security they provide have become much less than before.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Xcode7",
      "created_time": "October 02, 2023, 08:00:07 AM",
      "body": "Quote from: xSkylarx on October 02, 2023, 07:01:28 AMIve been in that situation where the biggest problem is your food and those other expenses like medical if someone got sick and if there are expenses in school. This strategy that you will do really is that you need to cook food that will last the 2 or 3 meals like you will cook breakfast that you will eat still at dinner. I know others may say that they cant do that but that is the way you can save if you have low income and you cant have another meal when we eat. Also we rarely do snacks if we do only bread and juice but this is really rare. Lastly we won't be taking any vitamins because they are very expensive.There are other strategies but this is really what I noticed before with my parents, it is difficult as you will get jealous that other of your friends can eat at those restaurants but you can't do it you just smell their cooking as you pass by as you can't afford it.In fact, if you are in such a position, it is not how to save money or manage your small finances that you need to think about, but how to get more money to get out of this situation of economic difficulty.Many people have experienced this kind of thing, and personally I have also felt this way, but I never thought about how I could save, instead I would go out harder to find more money to be able to meet my needs.It's all about mindset, we have to be able to take responsibility for all our needs and those of our families.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fadhilz123",
      "created_time": "October 02, 2023, 08:06:02 AM",
      "body": "Quote from: Negotiation on October 02, 2023, 03:54:59 AMThere are many people around us, where their income is not enough to manage a family how do you manage your family and economy? There are many people who manage their family very well even though their income is very low in their personal life, how do you manage it?In my neighborhood there are also many families whose lives are not very luxurious or rich but they are all still quite harmonious and comfortable in living their own lives. And I also asked one of the heads of the families here about how they can continue to live in harmony and comfort even though their income is not that much. The person answered that he only used the money he got for his basic needs and never spent excessively on sectors that were not important and not useful for him and his family.Sometimes they only eat twice a day to be able to cover their children's school snacks and their children are even willing to go to school without considering whether they have pocket money or not. So what I learned from the answer of the head of the family was about our own self-awareness in using money and spending money in more important places when we already know that our income is not enough to have fun like other people do. And it still amazes me that they can survive in such conditions until now without complaining to many people or their neighbors.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Findingnemo",
      "created_time": "October 02, 2023, 08:22:15 AM",
      "body": "Quote from: Negotiation on October 02, 2023, 03:54:59 AMThere are many people around us, where their income is not enough to manage a family how do you manage your family and economy? There are many people who manage their family very well even though their income is very low in their personal life, how do you manage it?I can relate to the situation very well because I was in that situation 2016-17 period where the business went broke and left me with nothing so I had to work for a job which is just enough to feed my family.I had to take swift action by clearing my debt by selling the assets so I don't feel the pressure on my head then I could think about what I should do further and even if you start from zero you can do multiple works to increase the source of revenue then only you can survive which means if you are earning low and isn't enough to meet your needs then you need to increase the source of income by doing side hustle or whatever it takes.If you try to settle for low income and try to minimize your lifestyle then it is never going to be enough cause as far as I remember the inflation rate has just been overkill with salary appraisal all these years so unless you break the hurdle you will never cross the hanging bridge for entire life.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yhiaali3",
      "created_time": "October 02, 2023, 08:37:45 AM",
      "body": "Eating, drinking, housing, and clothing, these are the basic components of human life that cannot be dispensed with. These basics must be the responsibility of the state to provide for all its citizens. This happens in developed countries, but it never happens in poor countries.Therefore, living requirements vary according to the country in which you live. You and your family must adapt to the economic reality, creating a balance between expenses and the source of income, otherwise you will enter into debt and may not be able to get out of it easily.Simply focus first on the basics and then if you have enough money you can buy luxuries or other minor things.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Solosanz",
      "created_time": "October 02, 2023, 08:46:06 AM",
      "body": "Quote from: Negotiation on October 02, 2023, 03:54:59 AMThere are many people who manage their family very well even though their income is very low in their personal life, how do you manage it?Who are them? it's your friend? your cousin? people you see in social media? your neighbor? if you haven't live with them at least for a week, you can't say they can manage their family very well because you're only see the \"cover\", you don't know about the inside of their family.Haven't you heard \"fake it, until you make it\"? I don't believe someone can manage their family \"very well\" when their income are low range.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EarnOnVictor",
      "created_time": "October 02, 2023, 08:50:49 AM",
      "body": "Quote from: Kakmakr on October 02, 2023, 05:41:26 AMYou do what millions of people are doing..... you adapt your lifestyle towards the income that you receive. You first start by cutting the luxuries from your budget and strip it down to the bare necessities and then you find cheaper alternatives for the bare necessities. You also look for ways to supplement your primary income, so that you can pay off most of your debt. Also try not to incur more debt, because that puts you in a worst situation.Your points are very good as they are part of the necessary measures to take in this situation, but the OP referred to those who are low-income earners. Meaning that they do not even have the power for luxuries, the situation could only worsen as the family progresses over time. Anyone who receives low pay and lives a luxury lifestyle might end the money before the 2nd week of a monthly payment and that is foolishness. So, there can't be a luxury for this kind of people, they might only try to live at their average or below it if they are wise.My advice is for them to continue to live the average lifestyle depending on the category fall and find a way to increase their stream of income. That is the only way their lives could be better.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Renampun",
      "created_time": "October 02, 2023, 08:57:35 AM",
      "body": "Quote from: Negotiation on October 02, 2023, 03:54:59 AMThere are many people around us, where their income is not enough to manage a family how do you manage your family and economy? There are many people who manage their family very well even though their income is very low in their personal life, how do you manage it?I admit that my monthly income is not large, so it is to cover the costs of daily needs, our family lives frugally and only eats at restaurants on important days. From what I've noticed, if it's just to survive then there are many people who are able to do it, but often the desire to have luxury goods and live a hedonistic life makes people forget how much they earn each month, don't let your lifestyle damage your family's finances, think again about how difficult it is for you to make money now (I'm also thinking about that).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}