{
  "id": "topic_5436600",
  "title": "chartsqa",
  "author": "chartsqa",
  "created_time": "January 24, 2023, 12:31:16 PM",
  "content": "I was watching a Youtube video today about the 200 MA, and he refers to the MA 200 as 200 \"week\" MA not 200 day MA. When I add the SMA to my chart and change the \"length\" field to 200 I get a totally different outcome to what he has on the video.https://www.youtube.com/watch?v=SlkrfSNl9DUWhen I add 200 day sma to my chart I get a totally different result. Surely the figure for \"length\" is days not weeks?https://postimg.cc/7f7PvyCW",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5436600",
  "comments": [
    {
      "author": "examplens",
      "created_time": "January 24, 2023, 12:54:27 PM",
      "body": "Quote from: chartsqa on January 24, 2023, 12:31:16 PMI was watching a Youtube video today about the 200 MA, and he refers to the MA 200 as 200 \"week\" MA not 200 day MA. When I add the SMA to my chart and change the \"length\" field to 200 I get a totally different outcome to what he has on the video.https://www.youtube.com/watch?v=SlkrfSNl9DUWhen I add 200 day sma to my chart I get a totally different result. Surely the figure for \"length\" is days not weeks?I believe that it would be better if you asked the question to the person who presented that analysis. I won't say that it's bad or good (I didn't even listen to it in detail), but it seems that he didn't explain it well, because you have to search further in order to understand it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dbshck",
      "created_time": "January 24, 2023, 01:34:17 PM",
      "body": "The \"length\" depends on the timeframe of the chart that you're using. If you're on the weekly chart, then 200 length on SMA will be a 200 Week SMA. Here's my attempt to recreate that line, I think its quite similar:Edit: Just realized you can edit the timeframe with the Timeframe dropdown. If you choose \"Chart\", it will use the same timeframe as the chart. Just change the timeframe to 1 week and you'll get 200 Week SMA.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitcoin_Arena",
      "created_time": "January 24, 2023, 01:41:55 PM",
      "body": "Could you please share a full screenshot of your chart?I think you are using a different time interval on your chart, like 1hr or 1 day. If that's the case, you will get a different result from that in the video. The video author's chart is on a weekly interval, which means his 200 MA means 200 weekly MAIf his chart is on a daily interval, that would mean the MA shown would be 200 Daily MA",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "chartsqa",
      "created_time": "January 24, 2023, 01:44:54 PM",
      "body": "Quote from: dbshck on January 24, 2023, 01:34:17 PMThe \"length\" depends on the timeframe of the chart that you're using. If you're on the weekly chart, then 200 length on SMA will be a 200 Week SMA. Here's my attempt to recreate that line, I think its quite similar:Edit: Just realized you can edit the timeframe with the Timeframe dropdown. If you choose \"Chart\", it will use the same timeframe as the chart. Just change the timeframe to 1 week and you'll get 200 Week SMA.Brilliant dbshck, that helps. I knew how to change the candlesticks but did not realize this would change the timeframe of the length like that or rename it in the window, thanks.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "chartsqa",
      "created_time": "January 24, 2023, 03:22:01 PM",
      "body": "Quote from: Bitcoin_Arena on January 24, 2023, 01:41:55 PMCould you please share a full screenshot of your chart?I think you are using a different time interval on your chart, like 1hr or 1 day. If that's the case, you will get a different result from that in the video. The video author's chart is on a weekly interval, which means his 200 MA means 200 weekly MAIf his chart is on a daily interval, that would mean the MA shown would be 200 Daily MAI think I'm sorted here now thanks.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}