{
  "id": "topic_5419220",
  "title": "CoinDahmer",
  "author": "CoinDahmer",
  "created_time": "November 02, 2022, 05:14:18 PM",
  "content": "Hello everyone!Let me start with the fact that I am a 17-year-old boy who comes from a poor Polish family. I can't start working because I go to school and live in a small village, I have no idea how to start earning money for my dream driving license, first cheap car and new computer, so I created a Milwaukee cannibal fan token. If anyone wants to help me make my dream come true, please add liquidity to pancakeswap and can buy a fan token Jeffrey Lionel Dahmer.addresses to make my dream come true:Jeffrey Lionel Dahmer - Dahmerbscscan.com/token/0x0be8ce5066e4bd546290f0d402e400f6a1ffb9f2Thank you for your help!",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5419220",
  "comments": [
    {
      "author": "livingfree",
      "created_time": "November 03, 2022, 10:01:12 AM",
      "body": "Please don't excuse poverty to use others name like that serial killer. It doesn't look good honestly, I appreciate you as a teenager and trying to do something for yourself and family. But this isn't the way that you should do.I'll give you some advice.Since you have made this token, you can just simply add it to your portfolio like past works that you've made and try to look for some other jobs for which you can apply your skills in making this token.You can actually work and look for part time jobs online and be a freelancer. I hope this helps you and you won't feel bad of what I've said. Good luck.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "peter0425",
      "created_time": "November 03, 2022, 10:49:08 AM",
      "body": "sorry to hear that poverty covers you but the way you posted this thread? it sounds like that you have more to give than asking for such help mate.you are Brighter than any one of us as you can create your own token so yes , try to dig more on how to make crypto profit.in this forum or in crypto market? there is more to offer if you will only be willing to grow , so make it better mate.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rodskee",
      "created_time": "November 03, 2022, 11:02:46 AM",
      "body": "Quote from: livingfree on November 03, 2022, 10:01:12 AMPlease don't excuse poverty to use others name like that serial killer. It doesn't look good honestly, I appreciate you as a teenager and trying to do something for yourself and family. But this isn't the way that you should do.I'll give you some advice.Since you have made this token, you can just simply add it to your portfolio like past works that you've made and try to look for some other jobs for which you can apply your skills in making this token.You can actually work and look for part time jobs online and be a freelancer. I hope this helps you and you won't feel bad of what I've said. Good luck.i think He is not that young to understand your concern and all of us will surely take this for him as well because as a Newly created account but have that knowledge about crypto? seems like there is a catch in this thread  But lets give Him a benefit of the doubt and assume that he is a student that needs help , but with knowledge he had ? I believe that he can find best option than this.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "livingfree",
      "created_time": "November 03, 2022, 11:55:29 AM",
      "body": "Quote from: rodskee on November 03, 2022, 11:02:46 AMQuote from: livingfree on November 03, 2022, 10:01:12 AMPlease don't excuse poverty to use others name like that serial killer. It doesn't look good honestly, I appreciate you as a teenager and trying to do something for yourself and family. But this isn't the way that you should do.I'll give you some advice.Since you have made this token, you can just simply add it to your portfolio like past works that you've made and try to look for some other jobs for which you can apply your skills in making this token.You can actually work and look for part time jobs online and be a freelancer. I hope this helps you and you won't feel bad of what I've said. Good luck.i think He is not that young to understand your concern and all of us will surely take this for him as well because as a Newly created account but have that knowledge about crypto? seems like there is a catch in this thread  But lets give Him a benefit of the doubt and assume that he is a student that needs help , but with knowledge he had ? I believe that he can find best option than this.Yeah, there's a catch and I've chosen not to notice that lowkey shilling by adding some story to give that exposure for his newly created project. Maybe he's just too honest to say everything including his personal life so we read it with empathy. Anyway, I hope that he'll take my advise seriously and understands where I am coming from because I've seen a lot of the same thing in the past, even if how hard they did, it all ended up with failure.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SirLancelot",
      "created_time": "November 04, 2022, 06:48:21 PM",
      "body": "Quote from: CoinDahmer on November 02, 2022, 05:14:18 PMLet me start with the fact that I am a 17-year-old boy who comes from a poor Polish family. I can't start working because I go to school and live in a small village, I have no idea how to start earning money for my dream driving license, first cheap car and new computer, so I created a Milwaukee cannibal fan token. If anyone wants to help me make my dream come true, please add liquidity to pancakeswap and can buy a fan token Jeffrey Lionel Dahmer.addresses to make my dream come true:Jeffrey Lionel Dahmer - Dahmerbscscan.com/token/0x0be8ce5066e4bd546290f0d402e400f6a1ffb9f2To make our dreams come true or to make your dreams come true? I see that you are still a student but that is not a hindrance to stop you from working. I've seen a lot of students who work part time in fast food restaurants. If they can do it then why can't you? Or you can also work online, in this forum through bounties and airdrops.There is no need to beg on here because it looks so inappropriate and pretty sure no one will donate on you because you are still capable of earning money. Sorry but there are more people out there who deserve to be helped. People like affected badly by the typhoon or if they have a deadly disease and are already dying.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "wheelz1200",
      "created_time": "November 04, 2022, 09:43:21 PM",
      "body": "Quote from: CoinDahmer on November 02, 2022, 05:14:18 PMHello everyone!Let me start with the fact that I am a 17-year-old boy who comes from a poor Polish family. I can't start working because I go to school and live in a small village, I have no idea how to start earning money for my dream driving license, first cheap car and new computer, so I created a Milwaukee cannibal fan token. If anyone wants to help me make my dream come true, please add liquidity to pancakeswap and can buy a fan token Jeffrey Lionel Dahmer.addresses to make my dream come true:Jeffrey Lionel Dahmer - Dahmerbscscan.com/token/0x0be8ce5066e4bd546290f0d402e400f6a1ffb9f2Thank you for your help!You basically are begging for money then?  And of all the names or people you could have named it after, you named it after that wacko?  Sorry but anyone who buys into this deserves to lose all theor money.  There is always ways to make money no matter the situation you are in, this isn't the way sorry.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "goaldigger",
      "created_time": "November 04, 2022, 09:48:17 PM",
      "body": "You can go so far with that skills and knowledge about cryptocurrency, I suggest to use it the right way and go for other ways on making profit, you can be a big help to many projects better to look for alternatives instead of doing this. Creating liquidity with that token might not be ok especially if there’s no real usage for that token. You’re still young and still have more time to learn, I know you want to earn easily and there’s a good way for that, maximize it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Baofeng",
      "created_time": "November 04, 2022, 09:59:34 PM",
      "body": "I'm sorry but I'm not going to support your project with the name attached to some serial killer. Yes, it's one of the most viewed tv shows in Netflix and obviously, you wanted to capitalized on its popularity.Nevertheless, crypto investors are wise and very intelligent not to fall for this kind of trick. Even when the Queen died, many meme coins suddenly appear in her name and this and that. Sorry to burst the bubble for you, you should have used your skills to create projects that are unique.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Quidat",
      "created_time": "November 04, 2022, 11:37:23 PM",
      "body": "Quote from: livingfree on November 03, 2022, 10:01:12 AMPlease don't excuse poverty to use others name like that serial killer. It doesn't look good honestly, I appreciate you as a teenager and trying to do something for yourself and family. But this isn't the way that you should do.I'll give you some advice.Since you have made this token, you can just simply add it to your portfolio like past works that you've made and try to look for some other jobs for which you can apply your skills in making this token.You can actually work and look for part time jobs online and be a freelancer. I hope this helps you and you won't feel bad of what I've said. Good luck.For sure he's aware that begging for someone to invest on his own token wont really be that looking good but when desperation calls then you would definitely be doing this but its true that evenyou are really that honest with your current condition but you wouldn't able to get sympathy on the people here on the community specially when we do talk about money.It would be better if you do find out other sources which you could possibly able to make money for yourself on doing hardwork.Having goals or wishes isnt badbut you should really be working hard for it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fullcoinese",
      "created_time": "November 05, 2022, 02:00:00 PM",
      "body": "is this work for a charity?You are asking for donations for your goals that not everyone can get with their hard work in the real world.you have a creative mind, but begging like that is not worth doing in the forums.I suggest you just create NFT and sell it on the exchange. rather than expecting people to buy your tokens, I think NFT assets look more attractive. although I'm not sure anyone will buy it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Reatim",
      "created_time": "November 06, 2022, 08:34:46 AM",
      "body": "Looking at OPs account and this thread posted ? this is a desperate thread from someone who's trying to take advantage of the community members that has a good heart  Sorry OP but this is not how it works here, if all of us will do what you did ask here? this forum will be filled of begging thread from here and there .find other ways to earn and have your desired things .",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Silberman",
      "created_time": "November 07, 2022, 01:23:44 AM",
      "body": "Quote from: CoinDahmer on November 02, 2022, 05:14:18 PMHello everyone!Let me start with the fact that I am a 17-year-old boy who comes from a poor Polish family. I can't start working because I go to school and live in a small village, I have no idea how to start earning money for my dream driving license, first cheap car and new computer, so I created a Milwaukee cannibal fan token. If anyone wants to help me make my dream come true, please add liquidity to pancakeswap and can buy a fan token Jeffrey Lionel Dahmer.addresses to make my dream come true:Jeffrey Lionel Dahmer - DahmerThank you for your help!During my stay here in the forum I have seen all kind of crazy coins, I remember there was a Trumpcoin, a Jesuscoin and even a coin which was supposedly a bitcoin fork but which ran above the ethereum network, but this has to be on the top 10 of the craziest ideas I have ever seen for a coin, unfortunately for you this is not good news as I do not think anyone is going to invest a single dollar in your project as not only it has no potential at all but you gave it one of the most unattractive names I could ever think.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Xal0lex",
      "created_time": "November 07, 2022, 10:57:02 PM",
      "body": "Not the best way to ask for money from the community, even through a veiled scheme with the purchase of some fan token. Let's be honest, your token is just a scam, it's worthless and nobody needs it. You might as well not have come up with this token, but just say you need money, please send it to me. It would have been pretty much the same thing. If you have the ability to create tokens, I don't see any barriers to earning yourself cryptocurrencies in a more honest way, through various initiatives, including airdrops, retrodrops, testnets, nodes, bounties, etc.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "romero121",
      "created_time": "November 07, 2022, 11:33:16 PM",
      "body": "Quote from: Xal0lex on November 07, 2022, 10:57:02 PMNot the best way to ask for money from the community, even through a veiled scheme with the purchase of some fan token. Let's be honest, your token is just a scam, it's worthless and nobody needs it. You might as well not have come up with this token, but just say you need money, please send it to me. It would have been pretty much the same thing. If you have the ability to create tokens, I don't see any barriers to earning yourself cryptocurrencies in a more honest way, through various initiatives, including airdrops, retrodrops, testnets, nodes, bounties, etc.There were more opportunities where OP need to fulfill certain tasks to get rewards. He could try that way and based on what he have developed it looks like he's skilled. He can use his skills in the right way and surely make some earning out of it than trying cheap tactics that isn't supported by the community.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Adbitco",
      "created_time": "November 08, 2022, 08:34:14 AM",
      "body": "Instead of creating a no featuristic token, from your post seems to be in college why not join freelancing and bounty job to earn little money to cover your expenses and further uses to train yourself in school than just coming here to create any token and asking for liquidity from users over. What happened to those who added the liquidity, what are the agreement between you them and who have full control of it?There are more things you need to make a project includes building of websites, having a social media handle and also revealing your identities for those who wants to add liquidity to project can feels more relaxed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tygeade",
      "created_time": "November 09, 2022, 08:32:02 AM",
      "body": "Quote from: Adbitco on November 08, 2022, 08:34:14 AMInstead of creating a no featuristic token, from your post seems to be in college why not join freelancing and bounty job to earn little money to cover your expenses and further uses to train yourself in school than just coming here to create any token and asking for liquidity from users over. What happened to those who added the liquidity, what are the agreement between you them and who have full control of it?There are more things you need to make a project includes building of websites, having a social media handle and also revealing your identities for those who wants to add liquidity to project can feels more relaxed.Because, having just one big huge money in a single move sounds better to young kids. After a certain age you realize that if you could make 1k dollars per month which is realistic, you would be fine and you could live off that, and if you could gain experience and collect some proof that you have done some work and made money that way, then in case you lose your job, you could end up making it back.So all in all I would assume that the best thing to do would be making some money while building a portfolio of jobs you have done and then growing from there. After a while you will earn a lot more money because if you did a good job, your name will be known everywhere.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fullhdpixel",
      "created_time": "November 09, 2022, 09:00:22 AM",
      "body": "Quote from: romero121 on November 07, 2022, 11:33:16 PMQuote from: Xal0lex on November 07, 2022, 10:57:02 PMNot the best way to ask for money from the community, even through a veiled scheme with the purchase of some fan token. Let's be honest, your token is just a scam, it's worthless and nobody needs it. You might as well not have come up with this token, but just say you need money, please send it to me. It would have been pretty much the same thing. If you have the ability to create tokens, I don't see any barriers to earning yourself cryptocurrencies in a more honest way, through various initiatives, including airdrops, retrodrops, testnets, nodes, bounties, etc.There were more opportunities where OP need to fulfill certain tasks to get rewards. He could try that way and based on what he have developed it looks like he's skilled. He can use his skills in the right way and surely make some earning out of it than trying cheap tactics that isn't supported by the community.Yeah, there are lots of them. Sky is only the limit here online or in the crypto world. We can see that op has some talent in coin developing. If I were him I will utilize this talent properly and not by creating a shitcoin and then fooling other people by using some sad words. It won't work because many people have woken up from the reality already.Common OP, we are now in 2022 and scammers now have also came up with a new idea of scamming. I am not saying that you should follow them but why not open a coin creation service in the service section of our forum or you can also post it on some freelancing sites and I am sure that you can get a lot of clients in no time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kotajikikox",
      "created_time": "November 09, 2022, 10:00:24 AM",
      "body": "Begging money is not allowed in this forum mate , this is strictly prohibited  but I think you have a bright future ahead of you mate , just learn how to earn slowly , and not this kind of approach .and also you will find no support inside forum from this , improve your skills and offer other service here , trust me it won't take a year before you can avail your computer and License .Quote from: Adbitco on November 08, 2022, 08:34:14 AMInstead of creating a no featuristic token, from your post seems to be in college why not join freelancing and bounty job to earn little money to cover your expenses and further uses to train yourself in school than just coming here to create any token and asking for liquidity from users over. What happened to those who added the liquidity, what are the agreement between you them and who have full control of it?There are more things you need to make a project includes building of websites, having a social media handle and also revealing your identities for those who wants to add liquidity to project can feels more relaxed.I think he already had been joining bounty because the way he posted this? you can find in him about the knowledge in crypto and in this forum also.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tygeade",
      "created_time": "November 13, 2022, 06:56:21 PM",
      "body": "Quote from: kotajikikox on November 09, 2022, 10:00:24 AMBegging money is not allowed in this forum mate , this is strictly prohibited  but I think you have a bright future ahead of you mate , just learn how to earn slowly , and not this kind of approach .and also you will find no support inside forum from this , improve your skills and offer other service here , trust me it won't take a year before you can avail your computer and License .I think hard work with crypto combined could definitely give a young person a great future. Instead of focusing on quick get rich schemes, he should focus on finding some talent. Developers for example can earn thousands and thousands of dollars every month, I know a developer who also runs a audit business for tokens as well and he makes about 25k dollars per month, that’s a huge business.Of course it’s not just talent, it’s both talent but also he grew and didn't reach here in a day, he did his own marketing. So all in all, I would say that it’s not that easy to reach there, but if you are young then you could work hard and by the time you are 30 you would be a wealthy person.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}