{
  "id": "topic_5422872",
  "title": "meser#",
  "author": "meser#",
  "created_time": "November 23, 2022, 06:52:31 PM",
  "content": "Forumumuzun Konu Dışı bölümünde zaman içerisinde birçok olay için birden fazla konu açılmış bu konular içinse Genel ve Ana Konu şeklinde birleştirilmeye gidilmişti genel olarak. Birçok konu uzun süre pasif kalması sebebiyle arka sayfalara düşmekte daha sonrasında yeni konular açılarak bir nevi bilgi fazlalığı oluşmakta. Bunun için açılan Genel ve Ana Konuları bir liste haline getirmeye karar verdim. Bunların bazısı ana konu olmasa da gelen cevap sayılarıyla bu konulardan devam edilmesi doğru olacaktır düşüncesindeyim. Kilitli olan bazı konuları da es geçtim ayrıca gözümden kaçmış olan ancak bilginiz olan konular varsa iletirseniz bu konuya ekleyeyim. Moderatörümüz @EFS bu konuyu sabitlerse iyi olur düşüncesindeyim. 2022 ZAM Ana Konu...  - 2022 yılında gelen zamlara dair bilgilendirme ve tartışma konusu2022 FIFA Dünya Kupası ve Elemeleri Ana Konu  - 2022 yılında gerçekleştirilen Dünya kupasına dair ana konu Türkiye Süper Ligi Ana Konusu - Türkiye Süper Ligine dair transfer, maç sonuçları vb eylemlerin tartışıldığı konu Ana konu Deprem oldu  - Depremlerle ilgili paylaşılan anlık bilgilerin yer aldığı konuPremier Lig 2022-23 sezonu - Premier Ligle ilgili transfer, maç sonuçları vb eylemlerin tartışıldığı konuE-spor bilgi,tartışma ve tahmin konusu   - E-Spora dair herşeyin yer aldığı konuİmza Kampanya Öneri Konusu ( Kullanıcılar Tarafından Gelen Öneriler )  Adından belli olduğu gibi İmza kampanyalarının takibinin yapılabileceği konu 2022 indirim Ana Konu  - Zam konusu olurda indirim konusu olmaz mı! Tabi bir zam konusu kadar yoğun olmasa da böyle bir konu başlığı da mevcut   Sedat Peker ve İddaları  - Bir zamana açıklamalarıyla damga vuran ve hala da buna devam eden Sedat Peker'in açıklamalarına dair ana konuTavsiyeler Ana Konu - Yeni alınacak araç gereç teknolojik aletlere dair tavsiye alıp verebileceğiniz yeni konu      Kitap aranıyor ana konu - Kitap tutkunları çıkacak olursa çok işlevsel olabilecek bir konu başlığı Netflix Dizi/Film Takibi, Eleştiri, Öneri ve Tartışma Alanı  - Pandemi zamanında bayağı yoğun olan bu konuda dizi ve filmler hakkında tartışmaların yapıldığı ana konu Hayatımızdaki Güzel Şeyler Ana Konu     - Hayatımızda olan ve memnun olabileceğimiz şeylere dair farkındalık oluşturabilecek bir konu Araç Tavsiye Ana Konu   - Araç alım satımı konusunda tavsiye alıp verebileceğiniz ana konu Xbox Game Pass Ana Konu - XBox Game pass kullananlara hitap eden bir ana konuCovid-19 Genel  - Pandemi zamanında aşırı yoğun olan ancak etkisi hala geçmemiş olan Covid-19 a dair ana konu2022/23 Avrupa Ligi konusu - 2022/2023 Avrupa Ligi konusunda tartışmaların yapıldığı ana konuFilm önerisi - Netflix Amazon prime gibi platformlarla sınırlı kalmayan film tavsiyelerine dair konu YouTube'da severek takip ettiğiniz kanallar - Youtube'da takip edilesi kanalların paylaşımının yapılabileceği bir kanal bunu ana konu haline getirebiliriz güzel olur  Nargileye dair her şey - Hazırlanan nargile rehberi ile nargileye dair ana konu olmaya aday bir konudur. Açık Öğretim'de Okumaya Değer Bölümler / 2. Üniversite ve Merak Edilenler - Tercih zamanlarında değerlendirilmeye alınabilecek güzel bir konu ve bu konuda ana konu olabilir. Formula 1 Genel Tartışma Alanı - Formula 1'e dair tartışmaların yer aldığı genel konu  2022-2023 NBA Sezonu Başlıyor.  NBA'e dair ana konu olabilecek bir konu Pek Bilinmeyen İnternet Siteleri- Son ve güncel olan işlevsel web sitelerinin paylaşıldığı ana konu             -",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5422872",
  "comments": [
    {
      "author": "judas",
      "created_time": "November 23, 2022, 06:59:07 PM",
      "body": "Haklısınız benzer konulardan dolayı forumda ilk sayfada daha fazla konu görebilecekken daha az konu görmek durumunda kalıyoruz.Ben de 2022 Katar Dünya Kupası için yeni bir konu açarak hataya düştüm ancak önceki konuya 7 ay mesaj yazılmadığı için bence çok sorun değil.Önemli olan hala güncel olan konuların benzerinin açılmasını engellemek olmalı diye düşünüyorum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "eightdots",
      "created_time": "December 22, 2022, 06:31:46 PM",
      "body": "Artık acemiliği attım diyebilirim ama öyle büyük de konuşmayayım şimdi gider arama yapmayı unutup benzer bir konu açarım.Hem benzer konular açmamaya özen gösteriyorum hem de daha düzenli ve göze hoş gelen bir biçimde yazmaya gayret ediyorum bu sıralar. Konular çoğaldıkça da bu özenle devam ederim diye düşünüyorum. Mesela son yazdığım cevap ve konularda kaynakçanın üstüne düz çizgi çekip ayırmayı, dipnotları cümle yanına eklemeyi bir de konu linki yazmaktansa o konunun adını yazıp link haline getirmeyi @meser'in yazdıklarından nasıl yapmış diye merak ederek baktım ve öğrendim. Forumun yazı kısmı eski yani pek bilmiyorum oradaki işaretleri, word excel gibi değil alışmışız şimdikilere.Bu ince ayrıntıların olduğu başlık varsa eğer yazarsanız sevinirim. Ya da \"quote\" dediğimizde konu içindeki kodlardan da bakıp öğrenme şansımız var.Bu mesaj vesilesiyle de herkese iyi forumlar diliyorum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}