{
  "id": "topic_5430921",
  "title": "Merit.s",
  "author": "Merit.s",
  "created_time": "December 21, 2022, 09:51:39 PMLast edit: December 21, 2022, 10:16:44 PM by Merit.s",
  "content": "Nigeria has come to consider the banned  which was put to crypto currency in the country in 2020. Ibrahim Babaginda the chairperson of legislative body committee on capital market and institute said that Central Bank of Nigeria does not have the right to control crypto industries and the Apex bank don't have the authority to regulate cryptocurrency because many digital investors don't even use local account since it is not a financial market but a capital market. the House of Rep be asked to approve a bill to that seeks to amend the investment and security in Act 2007 in other to designated cryptocurrency as a capital investment. Ibrahim Babaginda said the banned on cryptocurrency will not only be lifted but will be legalize.https://news.bitcoin.com/report-nigerian-lawmakers-set-to-pass-law-that-diminishes-central-bank-influence-on-crypto/",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5430921",
  "comments": [
    {
      "author": "coupable",
      "created_time": "December 21, 2022, 10:16:02 PM",
      "body": "I really hope that Nigeria will be able to overcome its financial and economic crises soon.Since the spread of the culture of crypto and digital assets since late 2016, we have noticed that some countries have resorted to changing their currencies from paper to electronic, and the reason, of course, is careful monitoring of money movements and financial activity of individuals and companies.  It is an attempt to escape forward and does not provide real alternatives that encourage people to abandon the use of crypto.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hydrogen",
      "created_time": "December 21, 2022, 11:25:51 PM",
      "body": "This announcement makes me wonder if FOREX exchange rates around the world are forcing nations to implement extreme measures.Image link:  https://i.ibb.co/wCnNtr2/nigerian-naira-to-usd.jpgAbove we can see the FOREX exchange rate for the nigerian naira and us dollar for 2022.These fundamental shifts in trade could seriously threaten stability for major economies. Which could greenlight crypto as an alternative.Ghana announced they would seek to purchase oil in gold rather than their native currency to avoid price swings in FOREX exchange:https://bitcointalk.org/index.php?topic=5423456.msg61353854#msg61353854A similar negative precedent may also be felt in nigeria.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Vaskiy",
      "created_time": "December 21, 2022, 11:50:07 PM",
      "body": "Positive approach from the government. The country that have got good number of cryptocurrency users, and still without proper stand from the government is really a mess. One side the government is showing its interest on making cryptocurrency legal and lift the ban. On the other side through its CBDC launch the government is trying to keep things under control.Anyhow it is really good to make the best choice to support its economic uplifting. As in the above response, maybe considering it as the alternate could help in retaining the economy as it is the country to have the highest number of cryptocurrency users in the African continent.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Die_empty",
      "created_time": "December 22, 2022, 12:01:48 AM",
      "body": "Quote from: Merit.s on December 21, 2022, 09:51:39 PMNigeria has come to consider the banned  which was put to crypto currency in the country in 2020. Ibrahim Babaginda the chairperson of legislative body committee on capital market and institute said that Central Bank of Nigeria does not have the right to control crypto industries and the Apex bank don't have the authority to regulate cryptocurrency because many digital investors don't even use local account since it is not a financial market but a capital market. the House of Rep be asked to approve a bill to that seeks to amend the investment and security in Act 2007 in other to designated cryptocurrency as a capital investment. Ibrahim Babaginda said the banned on cryptocurrency will not only be lifted but will be legalize.From the source OP gave there is no information that the the bill proposed by the legislature is targeted at lifting the ban on or legalizing cryptocurrencies. But it is a very good news because the Nigerian legislative arm is waking up from its slumber. How would a single entity like the Central Bank be the one that make policies that concerns a big sector like the crypto space. The CBN arbitrary makes laws and policies targeting the crypto industry without the input of the Security and Exchange Commission or the law makers. What this proposed bill wants to achieve is to reduce the autocratic powers of the CBN and transfer more powers to the SEC and the National Assembly The CBN should focus more on cryptocurrencies as a means of exchange, while SEC would handle the the sector as an investment option. This is a welcomed development because SEC is more friendly to cryptocurrencies than the CBN, in fact the former recognizes crypto assets are securities  .",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Darker45",
      "created_time": "December 22, 2022, 02:13:51 AM",
      "body": "This is good news. At least they're trying to reconsider their previous policy on Bitcoin and crypto. It seems this bill has a bright future. The chairman of the committee on capital markets in the lower house, which happens to be a former president of the country, seems positive on it and probably influential enough to bring his colleagues into passing it. And if Bitcoin and crypto thrived unrecognized in the country, this will certainly provide a boost to its local adoption.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mr. Magkaisa",
      "created_time": "December 22, 2022, 03:00:12 AM",
      "body": "Quote from: Merit.s on December 21, 2022, 09:51:39 PMNigeria has come to consider the banned  which was put to crypto currency in the country in 2020. Ibrahim Babaginda the chairperson of legislative body committee on capital market and institute said that Central Bank of Nigeria does not have the right to control crypto industries and the Apex bank don't have the authority to regulate cryptocurrency because many digital investors don't even use local account since it is not a financial market but a capital market. the House of Rep be asked to approve a bill to that seeks to amend the investment and security in Act 2007 in other to designated cryptocurrency as a capital investment. Ibrahim Babaginda said the banned on cryptocurrency will not only be lifted but will be legalize.https://news.bitcoin.com/report-nigerian-lawmakers-set-to-pass-law-that-diminishes-central-bank-influence-on-crypto/   -  Ibrahim Babaginda's cryptocurrency proposal is good in this regard. And I liked what he said that the central bank of Nigeria has no right to control the cryptocurrency industry and the banks have no authority to regulate it.Sometimes the owners of the bank think they have the money they are holding, they will make a large percentage of those who want to lend to them, but they will make a very small per annum, which is one of the reasons that I prefer to use my money to invest in cryptocurrency even though I know there is a risk.I hope that Ibrahim Babaginda's good thinking will continue for his constituents, especially for the crypto enthusiasts in his country.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "noorman0",
      "created_time": "December 22, 2022, 04:05:54 AM",
      "body": "Quote from: Die_empty on December 22, 2022, 12:01:48 AMFrom the source OP gave there is no information that the the bill proposed by the legislature is targeted at lifting the ban on or legalizing cryptocurrencies. News media interpretations may vary, just check on other sites. It's only a matter of sentence, the point is that the bill on the legality of using crypto will soon be passed.Adoption of bitcoin by the country's SME business class seems unstoppable, this is clearly not going to benefit Nigeria if it does not have a clear regulatory framework. A statistic says that Nigeria is in 4th place in the world based on the number of crypto holdings of its citizens as of June 2022.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Free Market Capitalist",
      "created_time": "December 22, 2022, 04:40:27 AM",
      "body": "The case of Nigeria is interesting because citizens are escaping government control measures.I learned the other day that they are not paying much attention to CBDCs and use cryptocurrencies instead. The inflation of its currency, as Hydrogen shows, must be a major factor in this regard.I guess now the government have capitulated and are thinking: \"if you can't beat 'em, join 'em\".I would like to take this opportunity to congratulate the Nigerian community for the creation of their local forum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gozie51",
      "created_time": "December 22, 2022, 03:29:17 PM",
      "body": "Quote from: Die_empty on December 22, 2022, 12:01:48 AMWhat this proposed bill wants to achieve is to reduce the autocratic powers of the CBN and transfer more powers to the SEC and the National Assembly The CBN should focus more on cryptocurrencies as a means of exchange, while SEC would handle the the sector as an investment option. This is a welcomed development because SEC is more friendly to cryptocurrencies than the CBN, in fact the former recognizes crypto assets are securities  . You are right because lately the regulatory body as sec is pushed to the background and nothing is heard of it in Nigeria rather CBN is taking all the shine and I guess that is because the CBN governor, Godwin Emefiele is at the corridor of power. He whines and dines with who is who in the APC government and so he gets every approval he needs from the president. But now that the legislative body is trying to wake up to their responsibility and define roles, lets see if sec will take up the mantle. It is only reasonable that there should no restrictions to trading of cryptocurrency and bitcoin in Nigeria and the youth are allowed to take the same chance that other youths has. The economy will begin to have positive vibes in investment.Quote from: Poker Player on December 22, 2022, 04:40:27 AMI would like to take this opportunity to congratulate the Nigerian community for the creation of their local forum.On behalf of the Nigerian users on the platform, I welcome your congratulatory message. I say a big thank you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Crypt0Gore",
      "created_time": "December 22, 2022, 03:56:28 PM",
      "body": "Let them try, they will fail, Months ago the government plan to limit daily Fiat spending and now they have increased it, I knew that won't work as well, this currency of a thing is not the appropriate way to change the country's situation, the problem that Nigeria is facing today is because of it's people. All they think about is making more money that's why they set eye on crypto, probably buyers will start paying tax, this is where I expected them to be active, as if taking this path will ease the country's suffering.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "avikz",
      "created_time": "December 22, 2022, 05:55:59 PM",
      "body": "Quote from: Merit.s on December 21, 2022, 09:51:39 PMNigeria has come to consider the banned  which was put to crypto currency in the country in 2020. Ibrahim Babaginda the chairperson of legislative body committee on capital market and institute said that Central Bank of Nigeria does not have the right to control crypto industries and the Apex bank don't have the authority to regulate cryptocurrency because many digital investors don't even use local account since it is not a financial market but a capital market. the House of Rep be asked to approve a bill to that seeks to amend the investment and security in Act 2007 in other to designated cryptocurrency as a capital investment. Ibrahim Babaginda said the banned on cryptocurrency will not only be lifted but will be legalize.https://news.bitcoin.com/report-nigerian-lawmakers-set-to-pass-law-that-diminishes-central-bank-influence-on-crypto/Good for Nigeria! It's great to see that Nigerian government has come out of the decision of completely banning bitcoin and other cryptocurrencies. Rather they are looking to legalize it. So Nigeria should be able to build businesses around cryptos in coming years with the availability of legal framework. Nigerian government has finally realised that they can't control it. I hope other governments also acknowledge the same in next few years after trying their best!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rruchi man",
      "created_time": "December 22, 2022, 06:12:11 PM",
      "body": "Quote from: Merit.s on December 21, 2022, 09:51:39 PMIbrahim Babaginda said the banned on cryptocurrency will not only be lifted but will be legalize.This is the hope for crypto, although I am fairly certain that this will not happen immediately, but will take some times. There are many individuals into crypto in the country already and due to the massive awareness being raised by Forum members who are Nigerians the number of crypto users is increasing. I patiently wait for the period when Crypto will be declared legal for use in Nigeria.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "so98nn",
      "created_time": "December 22, 2022, 06:50:25 PM",
      "body": "That’s seriously bad condition in the Nigeria. I dint know they have such worst economical issues with banking system that nobody even cares to have the account in a bank. No wonder the decline in price against USD. It feels like as if I am looking at the charts of altcoin Vs bitcoin price. It’s noticeable that we are actually talking about a country which has its freedom since long time ago and still it dint gain that much market and economic standard as one country should have. Definitely something is wrong with the administration or may be they are failing with the whole principles behind it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Amphenomenon",
      "created_time": "December 24, 2022, 04:58:00 AM",
      "body": "I don't really think this will happen any moment from now, because of the current Economic crisis. It will somehow increase inflation in some ways like the pump of btc to $60k alot of people became a millionaires in the US and that would definitely increase inflation in some ways but the fact is not only btc gives this some alt coins do this (they literally do x100% - 1000%).But the Good thing about it is that it will in some ways reduce fraud and be a better investment for the middle class and below in the country.Also Our currency will not be depreciated this much because there won't be much people converting NGN to USDSo I guess it's better they legalize it",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jossiel",
      "created_time": "December 24, 2022, 10:53:31 AM",
      "body": "The government should appreciate what's happening in their country based on the feedback of their citizens. The feedback was terrific and amazing that's why they have to capitalize it instead of being an obstacle to their people.I guess every country will be a villain at first tries whenever they see the thriving market on their country. But eventually, they'll change their decisions to be give way to its early adoption that's happening on their jurisdiction.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Moeda",
      "created_time": "December 24, 2022, 08:48:26 PM",
      "body": "Ibrahim Babaginda besides being a smart thinker is also a clear thinker. Because Ibrahim Babaginda knows that prohibiting crypto is the same as prohibiting water from flowing from the highest place to the lowest place. It's something hard to control. So he made a decision in his way of thinking that instead of controlling or prohibiting it, it would be better to control it with certain rules so that it has clear income for the country.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Viscore",
      "created_time": "December 24, 2022, 09:25:16 PM",
      "body": "Quote from: Darker45 on December 22, 2022, 02:13:51 AMThis is good news. At least they're trying to reconsider their previous policy on Bitcoin and crypto. It seems this bill has a bright future. The chairman of the committee on capital markets in the lower house, which happens to be a former president of the country, seems positive on it and probably influential enough to bring his colleagues into passing it. And if Bitcoin and crypto thrived unrecognized in the country, this will certainly provide a boost to its local adoption.  Probably positive chances are also possible here. If this reconsideration will create positive outcome, the Central Bank of Nigeria will start boosting crypto adoption and will come to recognize crypto as a legal tender or a form of exchange in the near future. Otherwise, though crypto is not also illegal, but it will never be used as a legal currency.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "goaldigger",
      "created_time": "December 24, 2022, 09:56:04 PM",
      "body": "Quote from: Moeda on December 24, 2022, 08:48:26 PMIbrahim Babaginda besides being a smart thinker is also a clear thinker. Because Ibrahim Babaginda knows that prohibiting crypto is the same as prohibiting water from flowing from the highest place to the lowest place. It's something hard to control. So he made a decision in his way of thinking that instead of controlling or prohibiting it, it would be better to control it with certain rules so that it has clear income for the country.Every country needs someone in position who are truly cares about the others, and with this development in Nigeria, I hope that it will be passed and make Cryptocurrency legal. Other countries started to amend their laws about financial investment, this could be a great start again. Didn’t know about the financial status of Nigeria but I know many people there are suffering because of poor financial system, they also deserve to use cryptocurrency and enjoy the freedom of choice by using other crypto as a legal tender.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Smartvirus",
      "created_time": "December 24, 2022, 10:31:59 PM",
      "body": "Quote from: Rruchi man on December 22, 2022, 06:12:11 PMQuote from: Merit.s on December 21, 2022, 09:51:39 PMIbrahim Babaginda said the banned on cryptocurrency will not only be lifted but will be legalize.This is the hope for crypto, although I am fairly certain that this will not happen immediately, but will take some times. There are many individuals into crypto in the country already and due to the massive awareness being raised by Forum members who are Nigerians the number of crypto users is increasing. I patiently wait for the period when Crypto will be declared legal for use in Nigeria.Just like Ibrahim Babaginda has stated, it was an abrupt decision that didn't come by a lot of consideration and deliberation, seeking to end all in a swipe move but of course, that wasn't going to work. CBN and NSEC failed to understand how the cryptocurrency industry works. There irrational decision was only followed by more participation as they ended up creating more awareness and drove people to be more private on there crypto investment/transactions.The news as we have it now is one that comes from a very thoughtful individual as he not only seeks to lift ban but hopes to understand and find a common ground for proper categorisation and giving legal status to the niche.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}