{
  "id": "topic_5434166",
  "title": "Trofo",
  "author": "Trofo",
  "created_time": "January 11, 2023, 02:01:39 PM",
  "content": "Hey guys I just wanted to write some stuff about upcoming championship in handball and couldn't find the thread so i guess it doesn't exists yet.We can use this one to discuss the games and hopefully share some tips. Handball is one of the better sports to get some money away from the bookies so it would be shame to skip on it  I know there isn't a big handball following here on the forum but I also remember we had some nice discussions in the past.The competition starts today with France-Poland game. Did not watch a lot of friendlies coming up to this competition so I will start slow and check the teams in initial games before placing big bets. Odds @1.4 look fair for France win and H2H is 7:1 for France so I will take that France ML just to make it more interesting to watch.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5434166",
  "comments": [
    {
      "author": "Bttzed03",
      "created_time": "January 11, 2023, 02:04:54 PM",
      "body": "Quote from: Trofo on January 11, 2023, 02:01:39 PMHey guys I just wanted to write some stuff about upcoming championship in handball and couldn't find the thread so i guess it doesn't exists yet.Thread by @slackovic is not so active that's why it's harder to find but here it ishttps://bitcointalk.org/index.php?topic=5432117.msg61508823#msg61508823",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Trofo",
      "created_time": "January 11, 2023, 02:05:58 PM",
      "body": "Quote from: Bttzed03 on January 11, 2023, 02:04:54 PMQuote from: Trofo on January 11, 2023, 02:01:39 PMHey guys I just wanted to write some stuff about upcoming championship in handball and couldn't find the thread so i guess it doesn't exists yet.Thread by @slackovic is not so active that's why it's harder to find but here it ishttps://bitcointalk.org/index.php?topic=5432117.msg61508823#msg61508823Thanks, that is easy to handle then. locking this one and continuing to write there.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}