{
  "id": "topic_5465273",
  "title": "mandown",
  "author": "mandown",
  "created_time": "September 01, 2023, 09:45:48 AMLast edit: September 01, 2023, 09:57:40 AM by mandown",
  "content": "Bistte hisse alıp satarken en önemli konulardan biri aldığınız hisse enflasyon karşısında paranızı koruyabiliyormu? Hisseyi yıllarca taşımakla zarar mı ediyorsunuz? Yada neden hisseler çok ucuz deniyor?Arkadaşlar çoğu hisse malesef  enflasyona karşı paranızın değerini koruyamamış size bir tane örrnek göstermek istiyorum. Sözde hisse ath yapmış ve yatırımcısı uzun bir bekleyiş sonrasında parasına para katmış değilmi?Malesef hisseyi elinde tutanlar ciddi anlamda zarar etmiş durumda 2020 yılında ki yükselişinde tepe noktasında 134 dolar yapıyormu şimdiki ath'sinde 59 dolar yapıyor yani hala bu hisse bir önceki tepesine göre 75 dolar ekside hisse 2000 tl daha artmadıkça yatırımcısına 1 tl bile kazandırmış sayılmayacak. tradingview'de size bist hisselerine dolar bazlı nasıl bakarsınız onu göstermek istiyorum. trading view web sitesini açıyorsunuz arama kısmına alttaki kodu yapıştırım enter'a basıyorsunuz.QuoteBIST:TETMT/OANDA:USDTRYTETMT yazan yere hangi hisseyi görmek istiyorsanız onun kodunu yazıyorsunuz ve karşınızda dolar bazlı hisseniz.Yani ben hisseyi alayıım tutayım 2x yapayım para kazanayım diyene kadar paranızdan da olabilirsiniz.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5465273",
  "comments": [
    {
      "author": "ZekiBeyy",
      "created_time": "September 01, 2023, 10:27:17 AM",
      "body": "Bir çok hisse dolar bazında bakıldığı zaman çok çok ucuz kalıyor yabancı yatırımcıda bu durumu bildiği için yatırım yapmak daha cazip hale geliyor. Türk Lirası değer kaybettikçe hisseler değil şirketlerde ucuzlamış oluyor yani dolar değerlenmiş olduğu için yabancı yatırımcının parası değerli oluyor mesela geçen yıl 2 birime aldığı şirketi bu yıl 1 birime alarak %50 ucuza almış oluyorlar bu nedenle şirketler bir bir satılıyor. Bir çok hisse 2 katına çıksa bile dolar karşısındaki değerine ulaşamamış oluyor.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "velbet",
      "created_time": "September 01, 2023, 11:44:25 AM",
      "body": "Ben hala biste yatırım yapmayı mantıklı göremiyorum. İçi boş şirketler tek tek biste girdi.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LGD2Business",
      "created_time": "September 01, 2023, 01:52:35 PM",
      "body": "Herhangi bir yatırım aracına TL bazında bakmak çok büyük hata olur bu sadece hisseler için değil her şey için geçerli. Türkiye'de hep yüksek enflasyon vardı ama son 5 seneki kadar yüksek enflasyon tarihte olmadı. Paramız 10 kat birden değer kaybetti paraya bir 0 daha eklenmiş oldu. Borsada aylık bakarken bile enflasyonu hesaba katarak yatırdığımız ve kazancımızı hesaplamalıyız. Enflasyonun altında artış gösteren hisseler kazandırmamış aksine kaybettirmiştir.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SUPERSAIAN",
      "created_time": "September 01, 2023, 03:32:01 PM",
      "body": "Tl olarak uzun vadeli, yakın vadeli bile yatırım yapmak bana hiç mantıklı gelmiyor. Enflasyonu en sert olan para birimini böylesine istikrarlı yükselirken BIST'e giren içi boş şirketleri takip edip emek harcamak bana göre doğru gelmiyor. Anlık kazanç için daha iyi tarafı var gibi yorumlardan onu anlıyorum, uzun vade de tabi bir anda her şey tersine dönerse o da büyük süpriz olur bu saatten sonra.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "halloweenn666",
      "created_time": "September 01, 2023, 05:13:03 PM",
      "body": "BİST ucuz ama riskler var. Bazı hisselerde balonlaşma var. Baş harfi T olan bir hisse mesela.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pierre 2",
      "created_time": "September 01, 2023, 09:45:37 PM",
      "body": "Biste dolar bazlı baktığınızda en baba şirketlerin bile nal topladığını çok net görürsünüz. Bistin güncel olayı bu değil zaten daha çok küçük şirketlerin ya da halka arzların yarattıkları hype ile dolar bazında yüksek karlar bırakmasıyla asıl para kazanılıyor. Bu yüzden borsa hisseleri yerine fonlara yöneldim ben şahsen, fonlar yeri gelince BISTi de shortluyor bu sayede karın kararlılığı sağlanmış oluyor. Kendim shortlamaya kafa patlatamayacağım açıkçası.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mustang Shelby",
      "created_time": "September 03, 2023, 07:31:51 PM",
      "body": "Çok güzel bir konu ve bakış açısı hocam bunun için sizi kutluyorum ancak hala bu durumda bile para kazandığını düşünenler var. Borsa yatırımı tam olarak sizin bize söylediğiniz şeyler yani dolar bazlı olarak bakmak ve dolar karşısında bize para kazandırmış mı kazandırmamış mı bunu tespit etmek. Bunu tespit edip dolar bazında zarardaysanız o hisse sizin paranızı korumamış bile. Bu arada bedelsiz veya bedelli bölünme yaşamış mı buna baktınız mı? Eğer %100 bölündüyse parasını kurtarmış demektir.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ZekiBeyy",
      "created_time": "September 03, 2023, 08:33:39 PM",
      "body": "Bazı hisseler dolar karşısında eriyip gitmiş durumda bazıları değerini korusada bazı hisselerde kat kat değerlenmiş durumda. Borsada bazı hisseleri spekülatif olarak arttırabiliyorlar bu hisselere dikkat etmek gerek. Yatırım yapmadan önce hissenin dolar karşısındaki fiyatından çok firmanın iş hacmi karlılığı yatırımlarını inceleyerek yatırım yapmak daha doğru sonuç verecektir.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bthd",
      "created_time": "September 03, 2023, 10:14:58 PM",
      "body": "Paranın çok hızlı değer kaybettiği durumlarda nerede yaşarsanız yaşayın fiyatlara daha stabil bir açıdan bakmalısınız. USD her ne kadar bir değer koruma aracı niteliği taşımaktan çok uzak olsa dahi Türk Lirasıyla karşılaştırdığınızda çok daha stabil durumda bu yüzden her ticaretim için temel dayanak noktasını oluşturur. Dün bir arkadaşımla bu konuda tartışma yaşadım 4 sene önce 100 birime satın aldığı malı bugün 120 birim TL'ye sattığı için kar ettiğini iddia edebilecek kadar gerçeklerden kopuk yaşıyordu.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "püsür",
      "created_time": "September 09, 2023, 08:15:35 PM",
      "body": "Çok güzel bir konu açmışsınız hocam. Bu günlerdeki borsa hype'ı ile özellikle herkes parasını borsaya atma peşinde ancak uzun vadede dolar olarak kazandırmadığı gerçeğini ya bilmiyorlar ya da kafaları basmıyor. Anca şu andaki hype'ta kâr alıp çıkma yapılabilir. Özellikle bizimki gibi kırılgan ve dolara karşı aşırı değer kaybeden bir parası olan ülke için. Bazı yaşlı kişiler var zamanında Demirbank'a para yatırmış batmış hala sadece borsaya yatırım yapıyor. Parasını dolara karşı erimiş de erimiş ama akıllanmamış. Aynı şekilde yatırım için 10 sene önce 200.000 dolara ev almış ama şimdi evi 2.000.000 lira oldu diye sevinen var. Ekonomi yönetimi şu anda biraz profesyonellere geçmiş gözüküyor ama yarın birinin çıkıp nas mas bakara makara sallamayacağını kimse garanti edemez bu ülkede. TL'nin değer kaybedeceğine göre hareket etmek her zaman mantıklı.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ZekiBeyy",
      "created_time": "September 10, 2023, 09:11:00 AM",
      "body": "@mandown hocam çok fazla hisse var tek tek incelemek epey vakit alacak ama işe yarar sonuçlar verecektir. Vakit buldukça bazı hisseler için değerlendirme yapacağım. Bazen konuşuyoruz borsaya giren arkadaşlarla ama anlatamıyorum bazı konuları, anlamak istemiyorlar dolar bazlı olarak diyorumki hisse fiyatı değişmemiş ama Türk Lirası 2 katına çıkmış. Konuyla alakalı olmasada ticaret yapan tanıdıklarla konuşuyorum bazen 100 birime aldığımız malı 130 birime satıyoruz sonra aynı malı 150 birime kendimiz tekrar alıyoruz diyor bakınca 30 birim kâr gibi görünüyor ama enflasyon neticesinde kâr değil zarar oluyor.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mandown",
      "created_time": "September 11, 2023, 06:01:22 PM",
      "body": "Quote from: ZekiBeyy on September 10, 2023, 09:11:00 AM@mandown hocam çok fazla hisse var tek tek incelemek epey vakit alacak ama işe yarar sonuçlar verecektir. Vakit buldukça bazı hisseler için değerlendirme yapacağım. Bazen konuşuyoruz borsaya giren arkadaşlarla ama anlatamıyorum bazı konuları, anlamak istemiyorlar dolar bazlı olarak diyorumki hisse fiyatı değişmemiş ama Türk Lirası 2 katına çıkmış. Konuyla alakalı olmasada ticaret yapan tanıdıklarla konuşuyorum bazen 100 birime aldığımız malı 130 birime satıyoruz sonra aynı malı 150 birime kendimiz tekrar alıyoruz diyor bakınca 30 birim kâr gibi görünüyor ama enflasyon neticesinde kâr değil zarar oluyor.değerlendirme yapabilecek bir algoritma yapılmış olsa ve en ucuz görünenden beğendiklerimizi alabilsek. Keşke.Son dönemde usd bazlı bakınca cidden işe yarar sonuçlar alınabildiğini gördüm örnek veriyorum şekerbank hissesi neredeyse son haftalarda %40 civarı yükseliş gösterdi çünki dolar bazlı yükseliş trendine girmişti. Tl bazlı hisselere bakmak bana doğru gelmiyor birşeyler eksik kalıyor. Sonuçta bir yandan tl basılmaya devam ediliyor. Bu esnada hisse anlamsız fiyatlamalar gösterebiliyor. Usd bazlı bakarak hem paramı korumuş oluyorum hemde hissenin geçmiş gerçek performansını inceleme şansım oluyor.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "halloweenn666",
      "created_time": "September 14, 2023, 12:22:47 PM",
      "body": "Son bir yılda yaşanan ralli yerini açlık ve sefalete bırakmaz umarım. Dolar bazlı hiç iyi şeyler görmüyorum grafikte.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gospodin",
      "created_time": "September 14, 2023, 02:37:16 PM",
      "body": "diyeceğimi ilk baştan yazayım da kafalar karışmasın: tl ile uzun dönem yatırım yapmak her zaman tehlikeli olmuştur. tl benim için internet explorer gibi bir şey. opera indiriyorum, tl ile de dolar alıyorum mesela.şimdi diğer önemli konulara gelelim:- bu şekilde hisse karşılaştırması yapılacaksa tüpraş, thy gibi büyük şirketler üzerinden yapılmalı. her türlü numaraya açık kağıtlar üzerinden yapılmamalı.- bir diğer konu da bedelli, bedelsiz ve şeklinde bölünmeler; temettü gibi durumlar da inceleme yaparken dikkate alınmalıdır.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "verbakalim",
      "created_time": "September 17, 2023, 07:48:01 AM",
      "body": "Fiyat konusunda nerdeyse herşeye bir sıfır eklendi. Şimdi dolar bazlı fiyat konusuna bakacaksak bis te de fiyatların sonuna bir sıfır ekleyip bakmak gerekecek sanırım. Diger haliyle pek düzgün olmaz. Eğer bir sıfır ekleyip bakarsak kagıtların gideceği yol daha çok görünüyor. Kısacası bizde boga zengine ayı yoksula durumunu daha çok yaşarız.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mandown",
      "created_time": "September 18, 2023, 06:19:37 PM",
      "body": "Birde yatırımcılar o kadar acemiki bist'e çok geç girdiğim halde olaya dolar bazlı bakmanın daha doğru olduğuna inanıyordum ki bugün bir yatırımcı ile sohbetim sonrasında cidden doğru bir karar verdiğimi gördüm. Eleman diyorki thy hissesi 10 kat artmış. 2018'de bu hisse sadece 5 dolarmış şimdi ise 8 dolar yani %60 civarı bir kar elde etmiş ancak arkadaşımız diyorki hisse arttı. 2018'de dolar 3tl civarlarındaydmış 3x9=27 günümüz dolar kuru  şaka gibi değilmi hissede tl bazlı 10x yapmış.Bu arkadaşlar para kazandığını düşünüyor bu düşünce yapısı devam ettiği taktirde bistte kaybeden taraf bu küçük yatırımcı olacaktır sonuçta onlar bu hisseleri toplayacak. Yeni hisselerde dikkatimi çekti dolar bazlı yüksek fiyatlanıyor eşdeğer hisseler 10-20 tl iken yeni halka arzlarda 100 tl leri bulabiliyor.Yakın gelecekte KY dediğmiz küçük yatırımcıların sızlanışını duyacağımızı düşünüyorum..",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Phoenix Anka",
      "created_time": "September 18, 2023, 11:19:34 PM",
      "body": "Quote from: verbakalim on September 17, 2023, 07:48:01 AMFiyat konusunda nerdeyse herşeye bir sıfır eklendi. Şimdi dolar bazlı fiyat konusuna bakacaksak bis te de fiyatların sonuna bir sıfır ekleyip bakmak gerekecek sanırım. Diger haliyle pek düzgün olmaz. Eğer bir sıfır ekleyip bakarsak kagıtların gideceği yol daha çok görünüyor. Kısacası bizde boga zengine ayı yoksula durumunu daha çok yaşarız.Dolar bazlı bakarsak haklısınız ama şirketler olarak bakarsak o kadar çok büyüyecekler mi bilmiyorum. Bist 30 belki büyür o kadar ama diğerleri hatta bist 100 dışı olanlar spekülasyon hisseleri olarak devam eder bence. Bist 30’dan hisse alınıp beklenebilir belki.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mandown",
      "created_time": "September 21, 2023, 07:56:10 AMLast edit: September 21, 2023, 08:10:32 AM by mandown",
      "body": "Bist'e dolar bazlı bakmak kazancın ana kapısı. Bistte usd bazlı ne ucuzsa yürütüyorlar üstüne üstlük usd bazlı yükseliş trendi olanlarda yükselmeye devam ediyor. Alıp dayanamayıp erkenden sattım ancak son 1 ay içerisinde dolar bazlı bakıp almak isteyip almadığım hisselerin son durumu. bir iki tane daha var bu şekilde moralimde bozuldu yani aslında usd bazlı bakmak cidden bir kazanç kapısı.IEYHO :  gördüğümden beri dolar bazlı neredeyse 2x yaptı.ADESE :  Usd bazlı %50 arttıSKBNK : Dolar bazlı düşüş trendini bitirip yukarı gidiyordu. usd bazlı en az %40 arttıSorunum şu bist'i derli toplu usd bazlı bakabileceğim bir kaynak yok tek tek uğraşmak can sıkıcı.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "halloweenn666",
      "created_time": "October 01, 2023, 06:45:37 PM",
      "body": "Bist nihayet yolun sonuna geldi.Artık dolar zamanı.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}