{
  "id": "topic_5460373",
  "title": "Redcoinn",
  "author": "Redcoinn",
  "created_time": "July 19, 2023, 07:33:20 PM",
  "content": "President Bola Ahmed Tinubu has warned the Presidential Election Petition Court (PREPEC), that misinterpreting the law as provided for in the Constitution on the 25% of lawful votes cast in the Federal Capital Territory Abuja, (FCT), could leads to absurdity, chaos, anarchy and alteration of the very intention of the legislature.What is your stake on this? https://www.thisdaylive.com/index.php/2023/07/17/tinubu-misinterpreting-the-law-on-25-fct-votes-can-lead-to-anarchy",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5460373",
  "comments": [
    {
      "author": "rybako",
      "created_time": "July 21, 2023, 06:05:00 AM",
      "body": "The controversy arises from the interpretation of the phrase “and the Federal Capital Territory, Abuja” in subsection (b). Does it mean that a presidential candidate must obtain at least 25% of the votes cast in Abuja, in addition to 25% of the votes cast in at least 24 states, to be declared the winner? Or does it mean that Abuja is treated as one of the states, and therefore a presidential candidate only needs to obtain 25% of the votes cast in any 25 states, including Abuja, to be declared the winner?President Tinubu and his supporters argue for the latter interpretation, while his opponents, such as Peter Obi of the Labour Party and Muhammadu Buhari of the All Progressives Congress, argue for the former interpretation. This is a fascinating case that will attract a lot of attention and debate from legal experts, political analysts, and ordinary citizens. I hope that PREPEC will deliver a fair and sound judgment that will uphold the rule of law and respect the will of the people.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "uchegod-21",
      "created_time": "July 21, 2023, 06:49:24 AM",
      "body": "Tinubu is the president of Nigeria and this seems to be a Nigerian news. It is not many people that will love to read the news, if they do they have to visit the Nigerian local board. You can move this topic to Nigeria local board",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rruchi man",
      "created_time": "July 21, 2023, 06:52:03 AM",
      "body": "Quote from: Redcoinn on July 19, 2023, 07:33:20 PMPresident Bola Ahmed Tinubu has warned the Presidential Election Petition Court (PREPEC), that misinterpreting the law as provided for in the Constitution on the 25% of lawful votes cast in the Federal Capital Territory Abuja, (FCT), could leads to absurdity, chaos, anarchy and alteration of the very intention of the legislature.What is your stake on this? This matter mostly concerns Nigerians and should be discussed in the local board here - https://bitcointalk.org/index.php?board=275.0@op consider moving your topic there, so you can have better engagement.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}