{
  "id": "topic_5441446",
  "title": "Cryptomultiplier",
  "author": "Cryptomultiplier",
  "created_time": "February 27, 2023, 05:28:52 PM",
  "content": "I took the liberty of scavenging the internet to put together a few Snippet on a development soon to be norm in the cryptocurrency world, but it mostly concerns NFT and it is a welcomed innovation for those of us who have explored NFTs or have thoughts of delving in or who have friends, families or aquaintances into art, music or any creative imaginative field and would be interested in minting their work or just to learn more for good reasons, here's a snippet of key notable perspective on the next stage in Bitcoin's evolution, called Ordinals:Quote*Ordinal NFTs are made up of on-chain data, meaning the actual image for the NFT is stored directly on the blockchain, rather than being linked to an external website like most NFTs on Ethereum. Since ordinals are stored on-chain, their data is immutable and cannot be changed.* NFTs are linked to individual satoshis, unlike Ethereum NFTs, which have their own token. This creates a connection between the NFT and the underlying asset, Bitcoin. Ordinals use a shared numbering system that assigns every satoshi an ordinal number based on the order in which it was mined. This numbering system, along with other details, is used to maintain continuity for NFTs.* ordinals use existing infrastructure available on bitcoin, it doesn’t require a separate token, another blockchain, or any changes to the bitcoin code.*If a file storage service deletes an image, goes down, or the file is corrupted and path compromised, that NFT would no longer reference a live file. NFTs have merely hashed barcodes on a chain pointing to a file hosted elsewhere; this is where ordinals differ.*Ordinals store texts, images, SCG, or HTML on-chain and can be authorised through a transaction —  they can also be purchased, stored and gifted. The information added to the bitcoin blockchain using ordinals must adhere to the roughly 4MB limit, but this doesn’t mean they are links to an image, pdf white paper or a video; they are actual files of white paper and videos, which are permanent parts of the bitcoin blockchain that must be downloaded by all full nodes.Visit references and links for more details about Ordinals, Ordinal NFTs:https://thebitcoinmanual.com/articles/bitcoin-ordinals/https://www.kitco.com/news/2023-02-24/Ordinals-the-next-stage-in-Bitcoin-s-evolution.htmlhttps://cryptobullsclub.com/ordinals-bitcoin-nfts/1. Would this development gather users, noting how the data sticks to Blockchain and becomes a permanent part of the Bitcoin Blockchain ?2. What measures do you think Bitcoin Ordinals project team may have put in place to ensure someone's original creative work is not stolen by another and minted permanently on the Blockchain?3. How does Ordinals outperform NFTs in your opinion? Or do you think otherwise?Let's discuss!",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5441446",
  "comments": [
    {
      "author": "franky1",
      "created_time": "February 27, 2023, 10:54:05 PM",
      "body": "Quote from: Cryptomultiplier on February 27, 2023, 05:28:52 PM I took the liberty of scavenging the internet to put together a few Snippet on a development soon to be norm in the cryptocurrency world, but it mostly concerns NFT and it is a welcomed innovation for those of us who have explored NFTs or have thoughts of delving in or who have friends, families or aquaintances into art, music or any creative imaginative field and would be interested in minting their work or just to learn more for good reasons, here's a snippet of key notable perspective on the next stage in Bitcoin's evolution, called Ordinals:Quote*Ordinal NFTs are made up of on-chain data, meaning the actual image for the NFT is stored directly on the blockchain, rather than being linked to an external website like most NFTs on Ethereum. Since ordinals are stored on-chain, their data is immutable and cannot be changed.* NFTs are linked to individual satoshis, unlike Ethereum NFTs, which have their own token. This creates a connection between the NFT and the underlying asset, Bitcoin. Ordinals use a shared numbering system that assigns every satoshi an ordinal number based on the order in which it was mined. This numbering system, along with other details, is used to maintain continuity for NFTs.1, yes the full file is locked into a data [witness] space of a transaction X2. however the \"linked to individual satoshi's\" is not a hard fixed 'link' its just that the ordinals inventor said the first/lowest spend(outout0) of the tx origins is where the taint will follow..however that can change. without needing to alter block dataso ordinals are not a NFT with locked reference when spent onto new utxo. in short the meme is not actually 'in the sat' its just told whomever is listed as the first output gets the transfer, yet that can be changed/de-pegged, thus not a good scheme for a supposed lock of value/propertythe property(meme) remains in a transaction X blocks prior.. and when spent to tx Y and then Z, the taint tracing by only the ordinals analysis/rule.. forward to current deemed \"owner\" of the meme in a previous block.. but from outside the ordinal analysis nothing is proven in tx Z in todays Z utxo that the utxo owner also owns property in X.. emphasis: looking at the blockchain as-isthere is no reference in todays Z utxo owner of a resold transfer that shows anything in the current z utxo. that actually references the meme Xits just 'said' that output 0 recipients own it. which can change to output1 without needing to change block data",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}