{
  "id": "topic_5436222",
  "title": "G_Besar",
  "author": "G_Besar",
  "created_time": "January 21, 2023, 08:39:24 AM",
  "content": "Hello AllI hope that on this day all of you are always healthy and can still carry out activities as usual with great comfort, because here at the end of Indonesia where I am experiencing flooding due to continuous rain for the last 12 hours and causing puddles in several villages that are very close with the outskirts of the city as well as being very close to the river. Usually we say that rain is a blessing for farmers, but excess water is a disaster for everyone so that it hampers the activities of all local residents and will obviously greatly affect their economic cycle.Some of the residents' land belonging to farmers around here have been flooded and hopefully the rain will stop soon and the puddles can recede soon and I hope the local government will be able to handle this properly soon. Because at the beginning of the year we always feel excessive rain and that really suits the weather here where the rainy season here always occurs at the end to the beginning of the year.As an ordinary person, I also feel the impact of this because when the floods hit, people who usually sell snacks on the side of the road also cannot carry out their usual activities because they are all busy looking after their own homes and those around them. Hopefully this does not happen at your place and especially elsewhere in Indonesia.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5436222",
  "comments": [
    {
      "author": "Vyeon11",
      "created_time": "January 21, 2023, 09:33:05 AM",
      "body": "I'm sorry about what happened in your area.Such a situation is sure to kill the economy, especially the lower middle class economy, as you wrote (small traders).let alone to sell, just to do activities is already very difficult,All of these must be resolved quickly.in essence, you have to report to the government, find a way out.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Baofeng",
      "created_time": "January 21, 2023, 11:32:19 PM",
      "body": "I guess most of the Southeast Asia have been hit by storms and flooding in the last century. The thing is that the climate has change a for the worst, and now we can't really define when is the monsoon season as it is not as it used to be.And probably this is the reason why some countries can't cope with it because of the ever evolving season.In any case, I do agree that it has bad effect, on the contrary it could bring water to our rice fields and it could be one positive side of excessive rain in my opinion.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bangjoe",
      "created_time": "January 22, 2023, 02:50:24 AM",
      "body": "Excessive rain is indeed very detrimental, especially if a flood occurs it becomes an obstacle to the distribution of goods from region to city or from city to region which hampers economic circulation, especially if there is damage to road infrastructure which may cause delays in the supply of goods resulting in long delays. .In addition, community activities will be constrained, their efforts will fail, especially farmers who are the most important commodity producers in the community to meet primary needs, if there is a crop failure, it is certainly not a good thing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "xSkylarx",
      "created_time": "January 22, 2023, 04:45:01 AM",
      "body": "Mostly those countries that are near in Ring of Fire are really prone to typhoons. I am very sorry about what happened in your country. Our country is also experiencing moderate rain as we have a low-pressure area that already hit us, though the rain is not the same in your country as it has been 12 hours, which means a lot of flooding there, and I am worried about those low-lying areas as they are very susceptible to flooding. Additionally, those farmers' crops are affected, and food prices will rise once more.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "browsiek",
      "created_time": "January 22, 2023, 06:28:51 AM",
      "body": "what I observe from every occurrence of a flood disaster in an area is because of the people themselves, where they throw garbage indiscriminately and do not provide smooth waterways besides the lack of public awareness in protecting the environment.  The most influential in this disaster will be the farmers because their crops will fail and a shortage of staple goods will occur, so small traders will also be hampered by the increase in the price of goods.  besides that workers will take the day off because of the loss of access to alternative roads, submerged buildings and loss of communication networks.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sayeds56",
      "created_time": "January 22, 2023, 07:53:03 AMLast edit: January 22, 2023, 09:44:03 AM by Sayeds56",
      "body": "Quote from: browsiek on January 22, 2023, 06:28:51 AMwhat I observe from every occurrence of a flood disaster in an area is because of the people themselves, where they throw garbage indiscriminately and do not provide smooth waterways besides the lack of public awareness in protecting the environment.  The most influential in this disaster will be the farmers because their crops will fail and a shortage of staple goods will occur, so small traders will also be hampered by the increase in the price of goods.  besides that workers will take the day off because of the loss of access to alternative roads, submerged buildings and loss of communication networks.I have also observed in my country where heavy rains often lead to floods, which results in loss of human life, destruction of infrastructure land damage to agricultural crops and residential propriety. You are right that , to prevent these disasters, we need to create awareness on massive level for protecting environment by reducing consumption of fossil fuel, planting new trees as well as stop building illegal construction on river paths. additionally, the governments should take necessary steps to construct water reservoirs and pass legislation to reduce emission of toxic gases.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitstar_coin",
      "created_time": "January 22, 2023, 07:55:02 AM",
      "body": "This is sad to see, flood is really causing havoc in different part of the world. In my location similar case happened to certain areas where the residents where forced to fled their homes as a result of heavy flood.Excessive rain can definately hamper economic growth because of the destructive effects of flood. When farms have been destroyed because of flood there will be shortage of food supplies likewise when flood destroys infrastructures, it will have a negative impact on the economy because it will affect transportation, power outage, buildings which affects the economy directly. Reason why it is important the government provide better drainage system and other helpful resources to prevent this type of situations from happening.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "so98nn",
      "created_time": "January 22, 2023, 08:54:13 AM",
      "body": "Yes definitely that is nightmare for every farmer and the whole economy depends on our food! With such natural calamities it gets worsen for every sector. It starts from the basics like farming, water treatment plants, supply chain based on it. Once the town is disturbed it starts destroying other sectors like electricity generation, which then impacts offices, manufacturing, everything goes down with it. This means money stops flowing and economy halts as well. We had similar situation in my town, it was disaster everywhere. We couldn’t even get to our offices, vegetables were short on market, water was untreated. Surprisingly it also boosted the diseases in my town and hospitals were flooded with it. Everything collapses with this including economy. Just hold tight mate. Hope everything will be alright soon.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Die_empty",
      "created_time": "January 22, 2023, 09:20:09 AM",
      "body": "Quote from: browsiek on January 22, 2023, 06:28:51 AMwhat I observe from every occurrence of a flood disaster in an area is because of the people themselves, where they throw garbage indiscriminately and do not provide smooth waterways besides the lack of public awareness in protecting the environment.  The most influential in this disaster will be the farmers because their crops will fail and a shortage of staple goods will occur, so small traders will also be hampered by the increase in the price of goods.  besides that workers will take the day off because of the loss of access to alternative roads, submerged buildings and loss of communication networks.This is also the case in my country, where residents dispose of refuse in drainages without considering the consequences. Each time I tell some citizens about the consequences of their actions to rain insults on me and always tell me to mind my business. I blame the government because they have not monitored the drainage systems properly and there are no institutions that would punish these unpatriotic citizens. Climate change would cause more rain that would flood most areas and this would affect commercial activities, as well as food production. In my area, many farms have been destroyed by floods which have resulted in high cost of food and over-reliance on imported products. Climate change is here to stay and we expect the government to engage in various preventive measures such as the building of dams that can reduce the impact of this flood water.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "slapper",
      "created_time": "January 22, 2023, 11:55:19 AM",
      "body": "Yeah, hearing about the floods in your region is pretty awful. I'm hoping things go better for you and your neighborhood soon. Extreme weather events are becoming more frequent these days, and climate change is unquestionably a major contributing cause. Here are some things to think about:1. The average worldwide temperature is increasing, which may cause certain locations to experience more rain and floods. Changes in weather patterns brought on by climate change might result in more severe weather events like droughts and heat waves in other regions.2. The two most significant human activities that contribute to climate change are the combustion of fossil fuels and deforestation. Communities that are already at risk from climate change, such as low-income neighborhoods or places where a large number of people live in poverty, may be particularly affected.It's crucial that we all contribute to lowering our carbon footprints and backing laws that combat climate change. My thoughts are with you and everyone else impacted by the water in the meantime. I'm hoping the neighborhood administration can provide the aid and assistance needed to get through this trying period. Bitcointalk community is with the Indonesian",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "G_Besar",
      "created_time": "January 22, 2023, 01:04:48 PM",
      "body": "Quote from: Vyeon11 on January 21, 2023, 09:33:05 AMI'm sorry about what happened in your area.Such a situation is sure to kill the economy, especially the lower middle class economy, as you wrote (small traders).let alone to sell, just to do activities is already very difficult,All of these must be resolved quickly.in essence, you have to report to the government, find a way out.The local government has indeed moved since yesterday and we as citizens also really understand it if there is a delay in handling because our government offices here are also flooded and you don't need to apologize to me because I don't blame anyone for this natural disaster.Quote from: Baofeng on January 21, 2023, 11:32:19 PMIn any case, I do agree that it has bad effect, on the contrary it could bring water to our rice fields and it could be one positive side of excessive rain in my opinion.Indeed, there are positive and negative sides to this, but if excessive water occurs through very high rainfall and the effects of climate and bad weather. So the negative side far outweighs the positive because until now there has been no loss of life due to this disaster, but some of the local residents' assets have become victims such as rice fields, houses and even damaged public roads. Here are some photos that I took around the city along with government officials who have started distributing aid for this for the smooth running of the lives of its citizens.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JoyMarsha",
      "created_time": "January 22, 2023, 01:19:47 PM",
      "body": "Quote from: G_Besar on January 21, 2023, 08:39:24 AMI hope that on this day all of you are always healthy and can still carry out activities as usual with great comfort, because here at the end of Indonesia where I am experiencing flooding due to continuous rain for the last 12 hours and causing puddles in several villages that are very close with the outskirts of the city as well as being very close to the river. Usually we say that rain is a blessing for farmers, but excess water is a disaster for everyone so that it hampers the activities of all local residents and will obviously greatly affect their economic cycle.Some of the residents' land belonging to farmers around here have been flooded and hopefully the rain will stop soon and the puddles can recede soon and I hope the local government will be able to handle this properly soon. Because at the beginning of the year we always feel excessive rain and that really suits the weather here where the rainy season here always occurs at the end to the beginning of the year.As an ordinary person, I also feel the impact of this because when the floods hit, people who usually sell snacks on the side of the road also cannot carry out their usual activities because they are all busy looking after their own homes and those around them. Hopefully this does not happen at your place and especially elsewhere in Indonesia.No area that will be hit by this kind of storm will remain the same in terms of agricultural, road infrastructure, residential properties, and rendering of goods and services. Flooding does hinder the economic growth of a place whether it is a rural area or an urban area. Am sorry it happened in your area at the beginning of the year. Let the local government of your area gets involved with the state government of your area to find lasting solutions to this flooding or at least minimize it. If proper measures are not taken now, I wonder what will be of your community during the rainy season.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rruchi man",
      "created_time": "January 22, 2023, 01:36:47 PM",
      "body": "Quote from: G_Besar on January 21, 2023, 08:39:24 AMexcess water is a disaster for everyone so that it hampers the activities of all local residents and will obviously greatly affect their economic cycle.First of all I'm very sorry for what you have had to experience due to flooding. Coincidentally we just experienced the first rain of the year as I read this post and the rain has started very heavily, this indicates that we may see more heavy rainfalls during the course of the year. I understand that the issue of controlling flooding is majorly a job and responsibility of the government but personally on your own terms you can do well by starting to prepare for the flood if your area has not yet been flooded. Clear drainages around you, and do not obstruct waterways.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Darker45",
      "created_time": "January 22, 2023, 01:48:10 PM",
      "body": "I agree. Sometimes it is being underestimated how the factor of rain can actually hamper an economic cycle. In my country, there are crops that rely heavily on rain or the rainy season. However, rains could come in extremes. While rain could be anticipated, even prayed for, sometimes it simply comes too much. Entire rice fields and other crops could all go to waste because of excessive rain. Not only that, even hectares and hectares of fish ponds could be damaged by too much rain. Not to mention that so many other economic activities could also be put to a halt because of rain. Unfortunately, excessive rains are becoming a normal occurrence thanks to climate change.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "teosanru",
      "created_time": "January 22, 2023, 02:08:18 PM",
      "body": "Economic cycle? This is a natural climatic disaster, it doesn't only disturbs the economic cycle but the complete life cycle of a certain place. A lot of people die and have to be relocated, not to forget even animals suffer a lot of deaths. People are abandoned and separated from their loved ones. So this is much more than just a disturbance in economic cycle.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dothebeats",
      "created_time": "January 22, 2023, 04:54:01 PM",
      "body": "When the forces of nature conspired against Man, there certainly is not much we can do but to weather the storm and rebuild afterwards. I've seen the news, the reports, and all the articles surrounding this flooding and it's really devastating to see families suffer and farmlands destroyed. It will take months or even years to get back that farmland to shape,  ut the lives of those who perished will never be returned. Intense rains that cause flood causes a massive setback economically, not just to those directly affected but also those who rely on these products to survive. Needless to say, in a war of attrition, you don't really stand a chance against nature no matter how rich you may be.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cryptodebjoe",
      "created_time": "January 23, 2023, 07:36:11 PM",
      "body": "Countries that rely heavily on agricultural produce for export to strengthen their economy are mostly affected when flood seasons occurs and it reduces the GDP. So it can really affect economic cycle and it has damaging effects on SMEs bcuz day to day transactions won't be done with ease....  So it's definitely true. The only challenge I have with this is that some floods can be anthropogenic (man-made) especially in areas of poor sewage management....",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bushdark",
      "created_time": "January 23, 2023, 07:49:37 PM",
      "body": "Excessive rain is a big thread to the economy cycle which can hamper human activities causing damages to human resources. We all never wish for this kind of unfavourable conditions but sometimes when we need to an for the rainy and dry seasons when things might not come as planned. It is very painful some see this kind of flood entering people's houses and stopping commercial activities.I feel your pains but there is less we can do about this because this is a natural disaster that we can't easily avert unless we planned ahead of time for any likely chances of it happening. Stay strong and ensure you focus on better days.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "freedomgo",
      "created_time": "January 23, 2023, 09:28:05 PM",
      "body": "Quote from: Baofeng on January 21, 2023, 11:32:19 PMI guess most of the Southeast Asia have been hit by storms and flooding in the last century. The thing is that the climate has change a for the worst, and now we can't really define when is the monsoon season as it is not as it used to be.And probably this is the reason why some countries can't cope with it because of the ever evolving season.In any case, I do agree that it has bad effect, on the contrary it could bring water to our rice fields and it could be one positive side of excessive rain in my opinion. My area was also once flooded maybe two weeks ago and I can say that it has cause tremendous effects on the business owners as some of their items were damaged because of the excessive water that has entered already into their floors. So it’s not helping at all, even the animal farms here are also seen dead because the water is overflowing that made them drown and died. Maybe it’s more of a climate change, but if this will constantly happen, it will be a huge reason for the country’s economy to fail and will hard to prosper again.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}