{
  "id": "topic_5399199",
  "title": "Prestongold",
  "author": "Prestongold",
  "created_time": "May 18, 2022, 01:32:30 PM",
  "content": "STOP INVASIONSO recently I want to use the UEFA Championship soundtrack on my Facebook story just to support my club and boom I was welcome with this message that say, the song belongs to sunny music who had its origin from Russia so I can't use the soundtrack since Facebook has sanctioned Russia from and I was chucked to see how far the extent of the sanction have gone affecting our social life already even though we are not part of the war.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5399199",
  "comments": [
    {
      "author": "jrrsparkles",
      "created_time": "May 18, 2022, 02:26:50 PM",
      "body": "Quote from: Prestongold on May 18, 2022, 01:32:30 PMSTOP INVASIONSO recently I want to use the UEFA Championship soundtrack on my Facebook story just to support my club and boom I was welcome with this message that say, the song belongs to sunny music who had its origin from Russia so I can't use the soundtrack since Facebook has sanctioned Russia from and I was chucked to see how far the extent of the sanction have gone affecting our social life already even though we are not part of the war.If I am not wrong most of the social media stopped their service from Russian so its obvious that they block contents belongs to Russia and this isn't really new in the Facebook, it is happening for very long time. The only saviour is Elon who can buy Facebook to bring freedom to all the Facebook users.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Prestongold",
      "created_time": "May 19, 2022, 07:52:05 AM",
      "body": "Quote from: jrrsparkles on May 18, 2022, 02:26:50 PMQuote from: Prestongold on May 18, 2022, 01:32:30 PMSTOP INVASIONSO recently I want to use the UEFA Championship soundtrack on my Facebook story just to support my club and boom I was welcome with this message that say, the song belongs to sunny music who had its origin from Russia so I can't use the soundtrack since Facebook has sanctioned Russia from and I was chucked to see how far the extent of the sanction have gone affecting our social life already even though we are not part of the war.If I am not wrong most of the social media stopped their service from Russian so its obvious that they block contents belongs to Russia and this isn't really new in the Facebook, it is happening for very long time. The only saviour is Elon who can buy Facebook to bring freedom to all the Facebook users. That is a huge one there the impact of war is always devastating and it last longer than war, this is so bad for this to affect other countries who are not directly involve in the war.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}