{
  "id": "topic_5399091",
  "title": "BADecker",
  "author": "BADecker",
  "created_time": "May 17, 2022, 08:50:30 PM",
  "content": "Good deal! Why should Arizona suffer with the illegals. Give it to the whole nation. That's what Texas Governor Greg Abbot is doing. The dangerous thing is, if any one of those aliens understood common law, and knew the English language fluently, Biden and the law makers and law enforcers would be paying in blood through their noses.I wonder how they will bus them in the future with the up-and-coming furl shortage?Arizona Governor Doug Ducey Begins Bussing Illegal Aliens To Washington DCQuote from: https://www.thegatewaypundit.com/2022/05/arizona-governor-doug-ducey-begins-bussing-illegal-aliens-washington-dc/The Gateway Pundit reported that Texas has transported over 900 illegal aliens to Washington before the expulsion of President Trump's Title 42.ABC 15 reported,This week Arizona began busing immigrants more than 2,000 miles to Washington D.C.Governor Ducey took the action in advance of the Biden Administration's plan to end a pandemic-era policy known as Title 42. Title 42 allows the Border Patrol to turn away hundreds of thousands of migrants out of concern they may spread COVID.A local non-profit near Yuma is the staging ground for the migrants. Two buses have left so far, including one Thursday. A total of 60 people so far from 12 countries. \"With Arizona community resources under all-time demand, and little action or assistance from the federal government, individuals who entered Arizona seeking asylum have the opportunity to voluntarily be transported to Washington, D.C.,\" Governor Ducey said.This is not a real solution to illegal immigration.Bussing illegal aliens across the country is still destroying our country.This is something the Biden regime has already been doing since stealing the 2020 Presidential Election....",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5399091",
  "comments": [
    {
      "author": "OgNasty",
      "created_time": "May 18, 2022, 06:39:45 PM",
      "body": "They need to do something.  I saw on the news that we have a \"tent city\" here in Arizona now.  That's the sort of insane situation we've come to expect from California.  A shame as they export their liberal politics to Arizona to flee the state they ruined, that they're now causing the same problems here.  It's terrible.  I really hope something can be done because the weather here won't be pretty in a month or two for the homeless.  I really wish people would wake up to the far left poison that is destroying our nation.  Sadly, I think it's too late to save us from the nightmare that is headed our way, as our clueless President thinks higher taxes causing layoffs and a recession is the way to fight inflation.  I feel sorry for those who voted for this Biden administration, because I have a feeling they're the ones least prepared for what he has coming for them and were victims to a campaign of lies and shady backdoor tactics.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gyfts",
      "created_time": "May 18, 2022, 07:12:02 PM",
      "body": "Interesting how Kamala Harris was put in charge of the border in 2021. She even visited the border for her photo ops. Nothing changed, why is that? Either she might be incompetent at her job, or they (democrats) seek to gain political capital from having millions of illegals come into the U.S. and then vote democrat if they ever were given the opportunity to vote. May even include illegals in the census figures so California can pick up more congressional representation in the house and a few electoral votes. The lack of media attention is appalling.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}