{
  "id": "topic_5407491",
  "title": "zasad@",
  "author": "zasad@",
  "created_time": "July 24, 2022, 06:22:33 PM",
  "content": "Is this the new black swan that should crash all markets?https://www.cnbc.com/2022/07/23/who-declares-spreading-monkeypox-outbreak-a-global-health-emergency.html?\"The WHO declared monkeypox a global health emergency.The rare designation means the WHO now views the outbreak as a significant enough threat to global health that a coordinated international response is needed.The WHO last issued a global health emergency in January 2020 in response to the Covid-19 outbreak.Europe is the epicenter of the outbreak. Right now, men who have sex with men are the community at highest risk.The WHO chief said the global risk is moderate, but the threat is high in Europe.Monkeypox is unlikely to disrupt international trade or travel right now, the WHO chief said.\"",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5407491",
  "comments": [
    {
      "author": "teosanru",
      "created_time": "July 24, 2022, 07:04:23 PM",
      "body": "Quote from: zasad@ on July 24, 2022, 06:22:33 PMIs this the new black swan that should crash all markets?https://www.cnbc.com/2022/07/23/who-declares-spreading-monkeypox-outbreak-a-global-health-emergency.html?\"The WHO declared monkeypox a global health emergency.The rare designation means the WHO now views the outbreak as a significant enough threat to global health that a coordinated international response is needed.The WHO last issued a global health emergency in January 2020 in response to the Covid-19 outbreak.Europe is the epicenter of the outbreak. Right now, men who have sex with men are the community at highest risk.The WHO chief said the global risk is moderate, but the threat is high in Europe.Monkeypox is unlikely to disrupt international trade or travel right now, the WHO chief said.\"No not at all. This isn't going to be a major black swan event. First of all this isn't a new virus it's just another outbreak which also is not that contagious like Covid and all. The number of cases in total are pretty low and then moreover the death rate is pretty low in this case so I dont think this will affect the global markets in any manner. Covid was on an altogether different level compared to this. These types of viruses have been coming and going it's only after Covid we are noticing them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lanatsa",
      "created_time": "July 24, 2022, 07:08:19 PM",
      "body": "Quote men who have sex with men are the community at highest risk.Im wondering on whats the reason on why men who have sex with other men does have higher risk? Is this immunity issue or just trying you tell something? heheDont know if this one needs to make out some emphasis into those who had some relation with similar gender but well this is how they do deliver it out.Important thing that people or government shouldnt really be that confident on neglecting or not putting some attention on this one becausethis might end up on being a pandemic if cant be stopped nor get rid early.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dunamisx",
      "created_time": "July 24, 2022, 07:27:29 PM",
      "body": "How long will it take us to get set free from all this pandemic that seems unending, it just keep revolving round only with a change of name, I can't start to mention from the list of past events but why am must concerned is that if the governments were using this to frame reports so as to source finance in running unaware projects that are visible to the society, we can't be hearing different names of disease outbreaks time to time and the sanity of the community hold at ransom for this",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Z-tight",
      "created_time": "July 24, 2022, 07:59:10 PM",
      "body": "Quote from: Lanatsa on July 24, 2022, 07:08:19 PMQuote men who have sex with men are the community at highest risk.Im wondering on whats the reason on why men who have sex with other men does have higher risk? Is this immunity issue or just trying you tell something? heheI have not found any news or report that carries the exact reason why, they only state this:QuoteAnyone can get or spread monkeypox, but a \"notable fraction of cases\" in the latest global outbreak are happening among gay and bisexual menWHO are probably seeing to it that they act faster and be more proactive with this, because if you look at the cases and death rate, it is not at the level of covid or something that can cause any disruption or economic damage, they are trying to prevent it from getting any worse than it already is, that is why the alarm bells have been rung now.Quote from: Dunamisx on July 24, 2022, 07:27:29 PMHow long will it take us to get set free from all this pandemic that seems unendingMonkeypox is not a pandemic.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "be.open",
      "created_time": "July 24, 2022, 08:32:58 PM",
      "body": "Quote from: Z-tight on July 24, 2022, 07:59:10 PMQuote from: Lanatsa on July 24, 2022, 07:08:19 PMQuote men who have sex with men are the community at highest risk.Im wondering on whats the reason on why men who have sex with other men does have higher risk? Is this immunity issue or just trying you tell something? heheI have not found any news or report that carries the exact reason why, they only state this:QuoteAnyone can get or spread monkeypox, but a \"notable fraction of cases\" in the latest global outbreak are happening among gay and bisexual menI have come across different quantitative estimates of this \"noticeable fraction of cases\" and they ranged from 95-98%. Simply put, if a person gets monkeypox, then most likely he is gay.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rruchi man",
      "created_time": "July 24, 2022, 09:51:05 PM",
      "body": "Quote from: zasad@ on July 24, 2022, 06:22:33 PM\"The WHO declared monkeypox a global health emergency.I hope this doesn't become another version of COVID that wrecks havoc on the economy. The appropriate bodies should quickly swing into action and not underestimate this new global health concern because we cannot survive another lockdown. Many are still trying to get back and recover from the economic effect and situation the last global health emergency put them and there are also too many things going on at this time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jackg",
      "created_time": "July 24, 2022, 10:46:10 PM",
      "body": "This is probably just extra news the companies are able to sell to force a bit of panic in the markets perhaps or just get their ad revenue from people being concerned about it.International cooperation to reduce a cross border virus is necessary to stop it spreading - regardless of it's spreading speed. The WHO probably declared this for things like norovirus too around 8 years ago - they might've done it with measles and mumps in 2019 too.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blockman",
      "created_time": "July 24, 2022, 11:21:05 PM",
      "body": "Every time there's an outbreak from a certain country, it's becoming scarier than before. After the pandemic news came out for covid-19, it seems that every coverage from the WHO is being hyped by the media as something that people should be feared. Well, viruses are really scary but this time, even if it's an epidemic, it seems that it's like a \"potential\" pandemic and as if there's no treatment for those diseases that they're reporting like the monkeypox and as well as the Marburg disease but there are antiviral that has been said that can help the infected person feel better. Before it was like we're all panicking with covid 19 and we still are all panicking today and that feeling seems to be hard to removed from everyone's thought if there disease news spread like this.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "July 25, 2022, 07:25:52 AM",
      "body": "I don't think it will be black swan or other things, but just news to cause panic in the markets, and the reason is that when the first global health emergency was declared in 2020, the markets were not affected, but the shock was when the covid-19 was declared a global pandemic, which has not happened until now.The question now is the confusing question about the nature of the disease and how it spreads, which seems more difficult and more known, so there is no reason for the closure.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cabron",
      "created_time": "July 25, 2022, 07:50:03 AM",
      "body": "Quote from: hugeblack on July 25, 2022, 07:25:52 AMI don't think it will be black swan or other things, but just news to cause panic in the markets, and the reason is that when the first global health emergency was declared in 2020, the markets were not affected, but the shock was when the covid-19 was declared a global pandemic, which has not happened until now.The question now is the confusing question about the nature of the disease and how it spreads, which seems more difficult and more known, so there is no reason for the closure.Doesn't sound like it really is contagious enough that will spread widely in just weeks unlike covid, it wouldn't really affect much. It does have a cure I believe since this is not a new virus at all. Its just WHO making it too big. I would really believe Covid doesn't come from China if monkeypox virus go spread in Asia.Quote from: be.open on July 24, 2022, 08:32:58 PMQuote from: Z-tight on July 24, 2022, 07:59:10 PMQuote from: Lanatsa on July 24, 2022, 07:08:19 PMQuote men who have sex with men are the community at highest risk.Im wondering on whats the reason on why men who have sex with other men does have higher risk? Is this immunity issue or just trying you tell something? heheI have not found any news or report that carries the exact reason why, they only state this:QuoteAnyone can get or spread monkeypox, but a \"notable fraction of cases\" in the latest global outbreak are happening among gay and bisexual menI have come across different quantitative estimates of this \"noticeable fraction of cases\" and they ranged from 95-98%. Simply put, if a person gets monkeypox, then most likely he is gay.I saw images of kids and women have monkeypox, WHO's pronouncement will make LGBTQ protest against it. They can be manipulated.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BADecker",
      "created_time": "July 26, 2022, 07:14:45 PM",
      "body": "The WHO is the big emergency. Mostly they lie. But a lot of it they are ignorant about. Monkeypox is one of the results of being vaccinated for Covid.“Monkeypox” is only circulating in countries where the Pfizer Vaccine has been distributed & is being used to advance a Technocratic Great ResetQuote from: https://www.naturalnews.com/2022-07-26-monkeypox-being-used-to-advance-technocratic-great-reset.htmlSince around the middle of May 2022, you will have most likely heard or seen the word Monkeypox mentioned numerous times in the mainstream media.(Article republished from Expose-News.com)If you haven’t then you’re about to.This is because on Saturday 23rd July 2022, the Director General of the World Health Organization, Dr Tedros, overruled the World Health Organization to single-handedly declare the alleged monkeypox outbreak a Public Health Emergency of International Concern. (Source)Allegedly, for the first time since its discovery among humans in Africa over 50 years ago, the monkeypox virus is circulating throughout several countries including the USA, UK, Canada, Brazil, Australia and most of Europe all at the same time.But it just so happens that every single country where monkeypox is allegedly circulating is also a country that has distributed the Pfizer Covid-19 injection to its population; excluding some countries in Africa where the disease has been endemic for the past 50 or so years.The World Health Organization has not received a single report of monkeypox from any country in the world where the Pfizer vaccine was not administered.Why is this?Well, it’s most definitely not because we’re witnessing what we will soon be told is a second pandemic to hit the world within the past two years.It’s because we’re seeing the consequences of injecting millions of people with an experimental mRNA injection that causes untold damage to the immune system, and public health authorities are now scrambling to cover up Covid-19 vaccine-induced shingles and using it as an opportunity to advance their technocratic agenda of implementing ‘The Great Reset’.Click on the below image and take a good long look to compare which countries have reported cases of monkeypox to the W.H.O. since May 2022, and which countries have distributed the Pfizer Covid-19 injection....",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gyfts",
      "created_time": "July 28, 2022, 06:39:07 PM",
      "body": "WHO should also mention that the threat is high in Europe for homosexual men who have multiple sexual partners.They don't want to produce a stigma so they will mislead people about the risks the average person has from monkeypox. This is just another STD, but WHO won't call it that.A person not having sex with random strangers has virtually a zero chance of contracting the disease. Global health emergency, haven't heard that one before.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "be.open",
      "created_time": "July 28, 2022, 06:49:24 PM",
      "body": "Le Monde: The authorities of New York have approached the World Health Organization with a proposal to rename monkeypox to a more tolerant name so as not to injure members of the LGBT community and black people.ps lol wtf?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LTU_btc",
      "created_time": "July 28, 2022, 11:11:20 PM",
      "body": "I'm not really sure why someone is trying to make big deal from monkeypox and comparing it with Covid. In general, mostly it's dangerous for homosexual men and it don't have that much potential to spread. Before Covid pandemic we didn't paid that much attention to much more dangerous diseases than monkeypox. Remember outbreaks of Ebola or Zika virus, birds flu and etc.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BADecker",
      "created_time": "July 31, 2022, 07:04:06 PM",
      "body": "I like that new name for monkeypox >>> pridepox. Lol. It sorta fits, even though it defames lions a little. After all, a family of lions is called a pride of lions.SCHLONG COVID: Global study finds that almost every case of monkeypox occurs among a homosexual or bisexual maleQuote from: https://www.naturalnews.com/2022-07-31-study-every-case-monkeypox-gay-disease.html#Researchers from Queen Mary University of London put together a study published in The New England Journal of Medicine (NEJM) that shows monkeypox, or PridePox, to be a primarily homosexual and bisexual disease that spreads among LGBT males.The largest PridePox study conducted so far, the paper reveals that 98 percent of all infections are in “gay or bisexual men” (Related: The Centers for Disease Control and Prevention [CDC] is going out of its way to avoid linking monkeypox to homosexuality).The study looked at 528 PridePox infections diagnosed between April 27 and June 24 of this year at 43 sites in 16 countries. Based on this, researchers concluded that “many, but not all, cases have been linked to men who have sex with men.”Another interesting discovery is that 41 percent of homosexual or bisexual men with PridePox also have HIV, another primarily gay disease that we are told got its start back in the 1980s.The paper does not look at any potential connection between PridePox and Wuhan coronavirus (COVID-19) “vaccines,” even though there is growing speculation that the monkey virus might be an adverse effect of the jab.Researchers avoid labeling monkeypox as a “gay disease” to stay politically correctThe fact that most PridePox lesions seem to be occurring near the genitals and anus of male LGBTs may also suggest that this is some kind of new sexually transmitted disease (STD).It had to start somewhere, of course, but the fact that this particular demographic is bearing the brunt of it following orgies and other deviant behavior following “Pride” month in June is suspicious.Queen Mary researchers made sure to throw a politically correct disclaimer in the paper about how PridePox is supposedly not “a gay disease,” despite everything seeming to point to the fact that it is, in fact, a gay disease....",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gosgosking",
      "created_time": "August 01, 2022, 01:46:05 PM",
      "body": "What WHO should have done now this disease have not gone rampant is to give some useful preventing measures that will help not contact this disease, this measures should be taking strictly by everyone.  I could remember when corona virus came out the earlier time it wasn't taking serious until when the spread of the disease was out of hand. WHO needs to take this one very serious.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BADecker",
      "created_time": "August 01, 2022, 02:43:24 PM",
      "body": "Quote from: Gosgosking on August 01, 2022, 01:46:05 PMWhat WHO should have done now this disease have not gone rampant is to give some useful preventing measures that will help not contact this disease, this measures should be taking strictly by everyone.  I could remember when corona virus came out the earlier time it wasn't taking serious until when the spread of the disease was out of hand. WHO needs to take this one very serious. WHO is medical. Medical has to do with drugs. What gay people need is nutrition. With proper nutrition, they will not be interested in being gay. Monkeypox (pridepox) will go away.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gyfts",
      "created_time": "August 05, 2022, 04:26:11 PM",
      "body": "U.S. declares monkeypox a health emergency: https://www.nytimes.com/2022/08/04/health/monkeypox-emergency-us.htmlOver 7k confirmed cases of monkey pox according to the CDC this year: https://www.cdc.gov/poxvirus/monkeypox/response/2022/us-map.htmlHere we go again...Cases primarily among gay and bisexual men engaging in sex with strangers. Given that homosexuals are on the intersectional scale, they'll get special privileges that other folks were not allowed during COVID restrictions. Meaning, sex festivals won't be shut down for monkeypox, but attending a wedding or a funeral for your loved during COVID was unacceptable.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "theskillzdatklls",
      "created_time": "August 10, 2022, 07:48:59 AM",
      "body": "Quote from: Gyfts on August 05, 2022, 04:26:11 PMMeaning, sex festivals won't be shut down for monkeypox, but attending a wedding or a funeral for your loved during COVID was unacceptable.Given that we are trying to flatten the curve for moneypox but that shutting down these festivals would be racist, what other tools does the world have to help slow the spread?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}