{
  "id": "topic_5464041",
  "title": "Nheer",
  "author": "Nheer",
  "created_time": "August 21, 2023, 12:11:38 PM",
  "content": "I have been into sports betting for a while now and i am not really proud of my earliest experience in gambling, i feel like i am the most unlucky person in the world i lost a lot of games and also i lost a lot of money. I had knowledge about football and basketball games and they were my most picked games and even so I kept losing all my bets and even when i try to play safe i still end up losing and whenever i ask my friends for games we still end up losing the bet then i got tired and in the end i gave up and tried to quit gambling and I left it for some months. During this period my friends made a lot of money gambling and i was envious of them but it didn’t made me change my mind to start gambling over again. Some months later i came across a telegram channel and i joined, it was a gambling channel that posted free sports bets for its users and there is also a VIP section where users subscribe for some sure games. I am well aware of all these techniques used by scammers so I decided to observe the channel and follow up games posted and I discovered he won most of the games and had about 80% victory rate. Then after some time I decided to try my luck again so I played one of his games and i won i was so happy and it was as though the curse placed on me has been lifted and I tried some more games and i won again and again and since the beginning of the new season i only lost twice and i am now proud of my gambling achievements. According to the channel free games are limited and we can only enjoy for a month and now the month is almost over and only VIPs will be entitled to games when the month elapses. I have been having doubts whether to join the VIP zone because I don’t want to be scammed that’s why i want to know your opinions. What do you all think i should do?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5464041",
  "comments": [
    {
      "author": "Cantsay",
      "created_time": "August 21, 2023, 12:21:17 PM",
      "body": "Quote from: Nheer on August 21, 2023, 12:11:38 PM~~~ What do you all think i should do?I haven’t really used any vip telegram channels for myself, I do look at them the same way I do for those channels that offers trading signals I think of them as scam and I don’t want to risk paying for something that I will end up regretting. Although, I have heard of someone who uses a vip channel and based on his experience, not all the games that are being predicted in their vip channel are sure, but if it was to be compared to the the number of wins he has made its cool. But, if you ever want to pay for any vip channel make sure you’re ready to lose the money that you’re using to pay because there’s a higher probability of you losing your money and still lose most of your bets so in a way I guess it’s a 50-50 something, it’s either you profit or you lose.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Davidvictorson",
      "created_time": "August 21, 2023, 12:21:33 PM",
      "body": "Quote from: Nheer on August 21, 2023, 12:11:38 PMAccording to the channel free games are limited and we can only enjoy for a month and now the month is almost over and only VIPs will be entitled to games when the month elapses. I have been having doubts whether to join the VIP zone because I don’t want to be scammed that’s why i want to know your opinions. What do you all think i should do?You have been gambling for some years now, therefore you already have good experience. You have joined a telegram channel and you are experiencing wins and you love it. The one month is almost over, and you are undecided because you do not want to be scammed. The point of trying to summarize what you have written is that you should be able to smell a scam from a far. No risk no reward right? If you are scared that after paying for the VIP you may get scammed and you will not be able to face yourself, then don't pay. However, if your risk appetite is high, go in by all means. But take caution. That is my opinion.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "swogerino",
      "created_time": "August 21, 2023, 12:32:09 PM",
      "body": "Quote from: Nheer on August 21, 2023, 12:11:38 PMI have been into sports betting for a while now and i am not really proud of my earliest experience in gambling, i feel like i am the most unlucky person in the world i lost a lot of games and also i lost a lot of money. I had knowledge about football and basketball games and they were my most picked games and even so I kept losing all my bets and even when i try to play safe i still end up losing and whenever i ask my friends for games we still end up losing the bet then i got tired and in the end i gave up and tried to quit gambling and I left it for some months. During this period my friends made a lot of money gambling and i was envious of them but it didn’t made me change my mind to start gambling over again. Some months later i came across a telegram channel and i joined, it was a gambling channel that posted free sports bets for its users and there is also a VIP section where users subscribe for some sure games. I am well aware of all these techniques used by scammers so I decided to observe the channel and follow up games posted and I discovered he won most of the games and had about 80% victory rate. Then after some time I decided to try my luck again so I played one of his games and i won i was so happy and it was as though the curse placed on me has been lifted and I tried some more games and i won again and again and since the beginning of the new season i only lost twice and i am now proud of my gambling achievements. According to the channel free games are limited and we can only enjoy for a month and now the month is almost over and only VIPs will be entitled to games when the month elapses. I have been having doubts whether to join the VIP zone because I don’t want to be scammed that’s why i want to know your opinions. What do you all think i should do?I don't think any sport bettor should be relying on those so called VIP channels to make wins in sport betting.I think people nowadays have enough resources in the internet that they only need time to calmly analyze any event before betting on.You have from news sites,prediction sites,sites that covers everything is going on with a certain team that for me only people who do not believe in themselves find these telegram VIP channels as an alternative to keep winning in sport bets.I don't think any VIP telegram channel can offer guaranteed profit in sport betting no matter how good they are so better forget about them.If you are obsessed at trying then try for one month but as I said I highly discourage such event.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitcoinTurk",
      "created_time": "August 21, 2023, 12:49:16 PM",
      "body": "Quote from: Nheer on August 21, 2023, 12:11:38 PMAccording to the channel free games are limited and we can only enjoy for a month and now the month is almost over and only VIPs will be entitled to games when the month elapses. I have been having doubts whether to join the VIP zone because I don’t want to be scammed that’s why i want to know your opinions.What do you all think I should do?It is normal for you to be skeptical of such Telegram channels because there are thousands of people and Telegram channels that are scamming in this way. Here, before making a decision I will suggest that you do a research about the channel and the owner of the channel you mentioned because it is possible to come across really successful Telegram channels in such channels although it's rare. If you can reach someone who has purchased this service on a free or paid channel, that person's comments will influence your decision. Also, were you able to earn the cost of the paid service from the free Telegram channel to purchase this service? This is definitely a very important detail because in case of any fraudulent, you will not lose money from your own pocket. For this reason, I would suggest that you consider such details and research the channel as best you can before joining paid Telegram channels.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Viscore",
      "created_time": "August 21, 2023, 12:55:03 PM",
      "body": "Forget about relying on channels and instead focus on learning from your own experiences. It's normal to lose most of the time when you're still a newbie, as you lack experience, and eventually, you'll learn from your mistakes. Having knowledge of the game isn't sufficient; what you need is a learning experience. It won't cost you a lot of money if you know how to effectively manage your bankroll.Your problem is that you've already lost a lot of money despite being new to gambling. I would say your approach is incorrect. The right thing to do is to start small and progress gradually. Once you feel you've gained consistency in winning, that's the time you can wager larger amounts of money.Don't expect overnight success in sports betting. Successful sports bettors achieved their success through a long-term journey, where they experienced both highs and lows.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AbuBhakar",
      "created_time": "August 21, 2023, 12:57:49 PM",
      "body": "Quote from: Nheer on August 21, 2023, 12:11:38 PMWhat do you all think i should do?Rest from gambling and use different strategies on gambling since even with your comfortable sports bet pick is still not working on your side. It only shows that something is wrong on your analysis skills and you should analyze first before you start gambling again.I usually play different games until I find a game that will give me a better winning probability. Gambling is still requires a lot of luck even on sportsbetting, you will need to experiment until you find the perfect game that will work for you. Just rest if gambling doesn’t give you entertainment and just a burden.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Altryist",
      "created_time": "August 21, 2023, 01:58:50 PM",
      "body": "Quote from: Nheer on August 21, 2023, 12:11:38 PMAccording to the channel free games are limited and we can only enjoy for a month and now the month is almost over and only VIPs will be entitled to games when the month elapses. I have been having doubts whether to join the VIP zone because I don’t want to be scammed that’s why i want to know your opinions. What do you all think i should do? It is obvious that you do not get the proper result on your own, your knowledge and ability to analyze events is not enough to win at a distance. But it’s also not clear with the telegram channel, because you saw its results only for a short period of time, and you don’t know what the results will be there, in a month or two, they can also have a losing streak, no one is safe from this. If your result depends on someone else, then it is better to exclude it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Apocollapse",
      "created_time": "August 21, 2023, 02:17:24 PM",
      "body": "There's a chance if they're just lucky by giving correct prediction, but there's a chance if they're a legit channel.Since the result you're using their predictions are good, I can't comment too much especially you're also know if there are so many scam channels. Always remember this, gambling is only for fun, don't really looking to make money through gambling. If you're looking for money and you're not win after joining their VIP zone, then gambling isn't for you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lorence.xD",
      "created_time": "August 21, 2023, 02:18:35 PM",
      "body": "It's already fishy for me because you could do more research about the group you have joined if it's legit or not. But the most common case of scamming is that they would let you taste some win and cash out some money so when they baited you, you would avail the VIP so you could just do gambling. If you have provided in the post OP what kind of gambling group is that so we could check the legitimate. Gambling doesn't guarantee you win even if you joined the VIP so it's still up to you since it's risky the fact that you'll have to subscribe first. I think the best thing to do OP is to learn your past mistakes like where did you lack like strategies whether when to pick a good team since your do betting at sports game and think wisely on the money that your putting at stake.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Westinhome",
      "created_time": "August 21, 2023, 02:33:22 PM",
      "body": "Quote from: BitcoinTurk on August 21, 2023, 12:49:16 PMIt is normal for you to be skeptical of such Telegram channels because there are thousands of people and Telegram channels that are scamming in this way. Here, before making a decision I will suggest that you do a research about the channel and the owner of the channel you mentioned because it is possible to come across really successful Telegram channels in such channels although it's rare. If you can reach someone who has purchased this service on a free or paid channel, that person's comments will influence your decision. Also, were you able to earn the cost of the paid service from the free Telegram channel to purchase this service? This is definitely a very important detail because in case of any fraudulent, you will not lose money from your own pocket. For this reason, I would suggest that you consider such details and research the channel as best you can before joining paid Telegram channels.Now a days many online scamming was take place by the various form.One among this was telegram scamming,the scammer will create a channel and add the 10-100k users.So that the new people think it as the big project and they won’t scam them.But the fact is totally different one,the scammer will ask some money to join the group itself.Mostly the group is based on the signals for the crypto trading.This applies to both for the crypto based and on gambling.The wide range of the scam was based on the signals and they made to scam using the channel and ask to inverse on the fake project for the big profit.At the end the scammer will get your money for the twice.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "madnessteat",
      "created_time": "August 21, 2023, 03:03:46 PM",
      "body": "Quote from: Nheer on August 21, 2023, 12:11:38 PM~snip~Gambling is risky enough. No owner of a Telegram channel can one hundred percent guarantee that his predictions will come true. In my opinion, it is much better to understand a particular sport (you already know how to do it) and gradually increase your capital without unnecessary risks. Personally, I am not in favor of paying for information that you can get for free, so I would recommend you to focus on your analytical knowledge.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CarnagexD",
      "created_time": "August 21, 2023, 03:05:57 PM",
      "body": "Quote from: Davidvictorson on August 21, 2023, 12:21:33 PMQuote from: Nheer on August 21, 2023, 12:11:38 PMAccording to the channel free games are limited and we can only enjoy for a month and now the month is almost over and only VIPs will be entitled to games when the month elapses. I have been having doubts whether to join the VIP zone because I don’t want to be scammed that’s why i want to know your opinions. What do you all think i should do?You have been gambling for some years now, therefore you already have good experience. You have joined a telegram channel and you are experiencing wins and you love it. The one month is almost over, and you are undecided because you do not want to be scammed. The point of trying to summarize what you have written is that you should be able to smell a scam from a far. No risk no reward right? If you are scared that after paying for the VIP you may get scammed and you will not be able to face yourself, then don't pay. However, if your risk appetite is high, go in by all means. But take caution. That is my opinion. Like other scams, they will make you experience wins for a limited time being VIP, it will feel like its a bug because it's always a win, but when you subscribed to the marketed promo, it will be just get back to normal. You still will experience losses like normal gambling. Maybe just greater edge over the house but not a 100% always a win. So regardless of the signal you get or the participation of greater win, it's more important to manage your risk properly along with your strategy joining the said telegram.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Josefjix",
      "created_time": "August 21, 2023, 03:10:12 PM",
      "body": "Quote from: Nheer on August 21, 2023, 12:11:38 PMI have been into sports betting for a while now and i am not really proud of my earliest experience in gambling, i feel like i am the most unlucky person in the world i lost a lot of games and also i lost a lot of money. I had knowledge about football and basketball games and they were my most picked games and even so I kept losing all my bets and even when i try to play safe i still end up losing and whenever i ask my friends for games we still end up losing the bet then i got tired and in the end i gave up and tried to quit gambling and I left it for some months. During this period my friends made a lot of money gambling and i was envious of them but it didn’t made me change my mind to start gambling over again. Some months later i came across a telegram channel and i joined, it was a gambling channel that posted free sports bets for its users and there is also a VIP section where users subscribe for some sure games. I am well aware of all these techniques used by scammers so I decided to observe the channel and follow up games posted and I discovered he won most of the games and had about 80% victory rate. Then after some time I decided to try my luck again so I played one of his games and i won i was so happy and it was as though the curse placed on me has been lifted and I tried some more games and i won again and again and since the beginning of the new season i only lost twice and i am now proud of my gambling achievements. According to the channel free games are limited and we can only enjoy for a month and now the month is almost over and only VIPs will be entitled to games when the month elapses. I have been having doubts whether to join the VIP zone because I don’t want to be scammed that’s why i want to know your opinions. What do you all think i should do?Gambling is very risky, we ought to know the amount of losses we can take in and the one we can breath out. Playing crucial fixed games from telegram channels, ofcourse you of all people should know that most of these premiums telegram channels are scams, we just have to be extremely careful when dealing with these games. In my opinion, I would urged you to take good time to check the possibilities of the group to turn out to be scam or legit. We should take risks, afterall you have gain some significant figures from their betting channel, so losing won't be any challenge.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "romero121",
      "created_time": "August 21, 2023, 03:24:50 PM",
      "body": "Analyse yourself and compare the bets predicted by you as well as the suggestions provided from the VIP telegram channel. Sometimes this could be a coincidence or it can be precise prediction from the channel. It looks like you're lucky to win good. If you find the suggestions from the channel is worth the subscription cost then go for it. With gambling everything is connected with luck. Right now luck had favoured and you're successful. We don't know how effective this will continue. Keeping in mind it is good to gather as much data and make your own prediction taking suggestions as reference.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "YOSHIE",
      "created_time": "August 21, 2023, 03:30:37 PM",
      "body": "Quote from: Nheer on August 21, 2023, 12:11:38 PMWhat do you all think i should do?I don't know what to tell you, be careful telegram channel is a hotbed of fraud, especially in sports betting.To be honest I always avoid and don't want to deal with telegram channels to gamble, I think if they are good at predictions, why don't they do it themselves, whose logic doesn't want money, if the prediction really happens, for that there is nothing right in terms of That.Example: one of the sports betting channels.QuoteAZEEZ BETTING PLARTFORM ON TELEGRAM IS A SCAM! HE USES DIFFERENT FORMAT TO SCAM PEOPLE. GUYS BEWARE. HE USES FAKE FREE TIPS TO TRAP HIS VICTIMS. RUN FROM HIM... ALL THE \"AZEEZ BETTING PLATFORM\" ON TELEGRAM ARE SCAMMERS. ONCE U PAY HIM, HE WILL REMOVE YOU FROM THE GROUP.I often see users elsewhere complaining about sports betting via the VIP telegram channel who get scammed.For example:* List Of Telegram Fixed Match Scammers... - Sports ( - NairalandQuote@Vip_Football_Tipsters please stay away from this scammer @Vip_Football_Tipsters, on telegramThis guy is 100% scammer, he scammed me 15,000 Naira,if you pay for the VIP ticket, he will invite you to the vip group, he will tell you that the game is 100% sure win, please don't believe him,he will give you the game to bet on Melbet, the game will loose, after the game he will then edit the score as won game and post it to his group,all those win match you are seeing in his group are 100% fake, he edited them, none of his game won,please bewarned, i contacted flutterwave which is the method of payment i used, i told them to refund back my money but they told me to contact my bank,The money is too small for me but i am making this report to safe the life of others,the guy blocked me and removed me from the VVIP which i paid for 30 Days, i was just 5 days on the VVIP, he blocked because i confronted him that he is a scammer, anyway my bank have gotten his real identity,all this scammer most be stop.his id is @Vip_Football_TipstersI think the quote above can be a consideration if you want to continue or stop using the VIP telegram channel in gambling.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "qwertyup23",
      "created_time": "August 21, 2023, 03:37:55 PM",
      "body": "Quote from: Nheer on August 21, 2023, 12:11:38 PMAccording to the channel free games are limited and we can only enjoy for a month and now the month is almost over and only VIPs will be entitled to games when the month elapses. I have been having doubts whether to join the VIP zone because I don’t want to be scammed that’s why i want to know your opinions. What do you all think i should do?Buddy, I think this is the time where you should reflect and decide on which path do you really want to invest it. Surely, your experiences tell you that something is not working. Even if it may work in the future, you just have to accept that your losses may probably more than your winnings. Worse, it may even accumulate more in the process, thereby making you stuck in that very position.Ask yourself- what do you really want to do? Do you enjoy gambling due to the adrenaline kicking; or do you gamble for profit? Such answer will depend on what path you would choose and even if you decide to stay, you very well know that things are not working.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "danherbias07",
      "created_time": "August 21, 2023, 03:38:08 PM",
      "body": "If there's payment required for that VIP group to join in then I won't waste time with them. It's a scammy type of scheme and you will end up getting maybe one tip and it's done. Bet on the sport that you like. That way it will be easier to predict the outcome of the game. Don't waste money looking for a group that will give you tips about where you should bet with. Instead, use your free time watching the games and be updated with roster changes and injury news.I have been following three different sports and somehow I could still end up winning my bets at a high percentage. You can do it too as long as you really love the sport that you will betting for. But just don't let emotions get the better of you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lida93",
      "created_time": "August 21, 2023, 03:38:53 PM",
      "body": "OP you sound like someone who has taking gambling as a part-time job or a source of income for you whereas it's not meant to be that way. If you have been losing your bets for a long time now doesn't mean you are cursed it's part of gambling which some of us gamblers have experienced such times before and if you don't take hold for yourself you start thinking something is wrong with you just as you're doing now.  Joining any channel for predictions tips isn't the solution, it might help but momentary as there's no 100% sure predictions. You said you have been given two time free predictions tips from this telegram channel you just joined and the predictions all won, alright. I'll suggest you use the profit you made from those two winnings to pay the subscription and test the VIP section if you lose the first two predictions you get from the VIP section then stop from further subscription even if you won one don't continue cause it's mostly likely the channel is not reliable as their predictions is mainly just lucky ones.But if they turn out to be scammer and had to ran away with your money at your first subscription then you still didn't lose anything as it's the money from the first two free predictions you used in subscribing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fivestar4everMVP",
      "created_time": "August 21, 2023, 03:47:44 PM",
      "body": "I have never used or subscribed to a VIP sports prediction channel before, so I clearly do not have any experience of how they really operate, and like you @Op, i also can not say that i am very proud with my gambling and betting experience so far, as i have lost far more games than I ever won, and to be honest, sometimes, i do feel like subscribing to such services, but knowing that most of them are just scammers looking for prey to feed on in the name of sharing sure bet/games, this just discourages me from participating in such services .what I can say now is that, since you have tried this service and you seem satisfied with it, I personally believe that with the few games you have won through their free picks, you must have made enough profit to cover for the cost of subscribing for the VIP services, you can take your chances and try the VIP services out since you are losing nothing but only part of the profit you've made through the same service, if I was you, this is what I was going to do after all .And I also don't mind you sharing the group or channel, I might want to check them out and possibly join, my pm is open just incase you cant  or don't want to share the link to the group or channel publicly.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}