{
  "id": "topic_5459341",
  "title": "TheGhostMan",
  "author": "TheGhostMan",
  "created_time": "July 10, 2023, 06:00:39 PM",
  "content": "Acabo de encontrarme con una noticia un tanto interesante la cual indica lo siguiente:QuoteBinance.US ofrece Bitcoin y Ethereum a precios más bajos. Los descuentos solo aplican para operaciones contra USD, cuyos depósitos están suspendidos desde junio.El 9 de julio, varios criptousuarios comenzaron a notar una creciente discrepancia de precios entre las criptomonedas que cotizan en el Exchange de criptomonedas de Estados Unidos y sus precios globales al contado, y muchos lo llamaron una \"desvinculación\" de las criptomonedas.Figura 1: Los gráficos del par BTC/USD en Binance.US muestran un precio actual de USD 27,536. Fuente: Binance.US.Fuente: https://es.cointelegraph.com/news/bitcoin-btc-discount-binance-us-but-theres-a-catch.          Como se ve en el gráfico anterior, está claro que Bitcoin se cotiza actualmente a un precio de $27 536, lo que representa un descuento de alrededor del 8,5 por ciento del precio spot actual del dólar, que se establece en USD 30 106. El mismo razonamiento llevó a los inversores a expresar la opinión de que las criptomonedas se están \" desvinculando\". Esta frase, en mi opinión, se toma en consideración, al menos en este caso, debido a la notable discrepancia entre los precios que se ven en la bolsa y los precios al contado en todo el mundo. El término \" desvinculación \" se refiere por lo menos en este caso, a una ruptura o separación de la correlación normalmente anticipada entre el precio de una criptomoneda en varias plataformas o mercados.          Ahora ¿por qué digo, que más que una oportunidad podría ser un engaño? Según el artículo nos indica que: Quoteel descuento solo se aplica cuando una criptomoneda se negocia contra el dólar estadounidense (USD) en la plataforma de intercambio. El problema es que los usuarios de Binance.US no han podido depositar nuevos USD en la plataforma desde el 9 de junio, cuando se suspendió esta opción.          Bien…En mi opinión y punto de vista, es bastante restrictivo que los descuentos solo se apliquen cuando una criptomoneda se negocie en el intercambio frente al dólar estadounidense (USD), sin mencionar la suspensión de los depósitos en USD. desde junio. considerando que, para beneficiarse de los descuentos, los usuarios sólo podrán utilizar los fondos que tuvieran en su cuenta a la fecha anterior. Esto a mi parecer crea una gran desigualdad entre los inversores interesados, ya que la mayoría no podrán aprovechar dicho beneficio, porque aquellos que no teníamos suficientes fondos en USD o simplemente no tenían antes de la suspensión, se ven excluidos de la oportunidad de comprar criptomonedas a precios más bajos. Además, que también existe el temor de que Binance.US pueda suspender las retiradas de USD en el futuro (lo cual lo único que ha ocasionado es que los llevado los usuarios a vendan sus criptomonedas por debajo del valor de mercado para evitar quedar atrapados con posiciones en USD).          Sinceramente pienso que la situación que se presenta genera un sentimiento de frustración y desconfianza en la plataforma, ya que da la impresión de que los usuarios están siendo restringidos en su capacidad de aprovechar las oportunidades disponibles. Sería favorable que Binance.US encuentre una solución que permita a todos los inversores beneficiarse de los descuentos sin imponer restricciones excesivas, promoviendo así la equidad y la transparencia en el intercambio de criptomonedas.Que opinan ustedes de la situacion que se esta presentando con Binance.US, los leo colegas...Fuente de información 1:https://criptotendencia.com/2023/07/10/descuentos-en-bitcoin-y-ethereum-en-binance-us-una-oportunidad-o-una-trampa-2/Fuente de información 2:https://es.cointelegraph.com/news/bitcoin-btc-discount-binance-us-but-theres-a-catch",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5459341",
  "comments": [
    {
      "author": "Porfirii",
      "created_time": "July 11, 2023, 04:53:04 AM",
      "body": "Muy interesante lo que nos traes TheGhostMan. En mi opinión, más que debido a alguna política perniciosa por parte del exchange, más bien podría tratarse simplemente del efecto en el mercado de la falta de oferta por la imposibilidad de depositar nuevos USDs. De hecho, aunque por distintos motivos, descuentos del estilo no son nuevos: me viene a la mente el concepto de \"Kimchi premium\" que ofrecía años atrás una oportunidad de arbitraje entre exchanges occidentales y coreanos.En definitiva, no creo que estos nuevos datos deriven en una especial frustración y desconfianza para con Binance, pero estaremos atentos.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "darxiaomi",
      "created_time": "July 11, 2023, 06:53:37 PM",
      "body": "Pregunta porque desconozco, en BINANCE se puede tener dinero liquido en USD en la cartera?. Porque de ser SI es que estan queriendo que esa liquides virtual entre al mercado a compensar un poco la falta de ingreso de USD externo.Y si en el fondo llegamos a la misma conclusion que con Porfirii, es para mover un poco el mercado y a su vez si existe lo que escribi arriba hacer todo crypto y que no queden saldos USD sueltos.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Silberman",
      "created_time": "July 11, 2023, 07:27:44 PM",
      "body": "Quote from: Porfirii on July 11, 2023, 04:53:04 AMMuy interesante lo que nos traes TheGhostMan. En mi opinión, más que debido a alguna política perniciosa por parte del exchange, más bien podría tratarse simplemente del efecto en el mercado de la falta de oferta por la imposibilidad de depositar nuevos USDs. De hecho, aunque por distintos motivos, descuentos del estilo no son nuevos: me viene a la mente el concepto de \"Kimchi premium\" que ofrecía años atrás una oportunidad de arbitraje entre exchanges occidentales y coreanos.En definitiva, no creo que estos nuevos datos deriven en una especial frustración y desconfianza para con Binance, pero estaremos atentos.Otra posibilidad que se me ocurre es que si Binance permite retiros en dólares estadounidenses, pero no permiten depósitos entonces talvez les falte liquidez, suponiendo que esto así, entonces a pesar de que tienen los dólares de sus clientes en sus arcas, estos dólares no son suyos, así que para incentivarlos a deshacerse de esos dólares podrían estar ofreciendo bitcoin a un precio un poco más barato a sus clientes.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "seoincorporation",
      "created_time": "July 17, 2023, 09:25:13 PM",
      "body": "Quote from: darxiaomi on July 11, 2023, 06:53:37 PMPregunta porque desconozco, en BINANCE se puede tener dinero liquido en USD en la cartera?.Por lo que tengo entendido no puedes tener directamente USD en la cartera, pero puedes tener la criptomoneda estable de nombre USDT la cual tiene el valor de 1 dolar, y también puedes retirar en esa moneda ya que es un contrato inteligente el cual lo encuentras en diversas cadenas de bloques como BSC, ETH, Tron, entre otras. Digamos es es el equivalente a tener dolares, pero no son dolares que puedas mandar a tu cuenta de banco. Tal vez me la plataforma si te permita tener USD para con esto poder hacer retiros, pero lo del USDT si es seguro. Desafortunadamente no tengo tanta experiencia con esa casa de cambio.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "darxiaomi",
      "created_time": "July 17, 2023, 09:49:48 PM",
      "body": "Gracias Seoincorporation por la respuesta, a mi me daba la sensacion, de que si se podia tener un saldo en USD liquidos, igual esto estoy hablando la ultima vez que vi la front page de Binance hace facil 4 años, jamas tuve cuenta en Binance asi que no puedo aseverar esto ultimo.Seguiremos esperando a que alguien que opere en dicha plataforma nos aclare la situacion.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Porfirii",
      "created_time": "July 18, 2023, 04:51:26 AM",
      "body": "Al igual que darxiaomi, yo también estaba interpretando que el caso que el OP nos traía trataba sobre depósitos de USD. De hecho, el gráfico indica BTC/USD, y si fuera tether entiendo que pondría USDT. Y es de ahí el sentido que le encontraba al premium.Ahora bien, yo también hace unos años que no quiero saber nada de la plataforma y, aunque sí que tuve un par de cuentas en su día (que luego me enteré que no se podía salvo excepcionalmente, aunque nunca me dio problemas) nunca hice depósitos en Euros, mucho menos en dólares, por lo que a lo mejor seoincorporation está más acertado que nosotros. Aunque como se podía comprar con tarjeta de crédito, supongo que no sería muy difícil depositar.A ver si alguien que siga operando nos aclara la duda, aún ya pasada la noticia.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "famososMuertos",
      "created_time": "July 20, 2023, 08:49:15 PM",
      "body": "Quote from: darxiaomi on July 17, 2023, 09:49:48 PMGracias Seoincorporation por la respuesta, a mi me daba la sensacion, de que si se podia tener un saldo en USD liquidos, igual esto estoy hablando la ultima vez que vi la front page de Binance hace facil 4 años, jamas tuve cuenta en Binance asi que no puedo aseverar esto ultimo.Seguiremos esperando a que alguien que opere en dicha plataforma nos aclare la situacion. Solo con las monedas Fiat que están permitidas ahí, obviamente no están permitidos todos los países.QuoteEn resumen, las pasarelas fiat sirven como canales de entrada al mundo de las criptomonedas, al permitir depositar dinero fiat en una aplicación o un exchange de criptomonedas.Sin embargo, en los países en donde no ofrecemos pares de intercambio seleccionados de cripto-fiat en nuestra plataforma principal, los usuarios pueden optar en su lugar por stablecoins. Con las stablecoins, puedes intercambiar dólares estadounidenses (USD) u otras monedas fiat a las que se da soporte, por tokens disponibles en Binance.Fuente:https://www.binance.com/es-LA/blog/fiat/cuáles-son-los-diferentes-canales-fiat-o-de-pagos-disponibles-421499824684902838Por ejemplo, según la fuente puedes tener el Rublo, el AUD, el real brasileño, etc. (Etc: tampoco es que sean muchos países) pero al ser el \"$\" la moneda que todos queremos, debes usar las estables-coin, salvo Binance.us (USA) de ahí su existencia, si eres ciudadano o vives en los Estados Unidos debes usar Binance.us Luego los que no tienen o no son \"nominados\" al par Fiat, pues usan P2P.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}