{
  "id": "topic_5473842",
  "title": "muliyadi227",
  "author": "muliyadi227",
  "created_time": "November 12, 2023, 09:12:45 PM",
  "content": "Republik Palau udah bekerjasama dengan Ripple untuk membuat USD backed digital currency, bukan sebagai CBDC, tapi sebagai Govcoin. Buat temen-temen yang baru pertama kali dengar tentang Govcoin, Governance coin adalah sektor baru di 2022 lalu dan mungkin nanti akan Hype diakhir 2023/2024. Govcoin adalah Stable coin yang diterbitkan oleh bank sentral suatu negara, beberapa Stable coin udah diterbitkan di Xrp Ledger meskipun bukan Govcoin. Beberapa diantaranya ada USDS yang diterbitkan oleh Stably dan AUDD dari Novatti Group. Kalau emang Govecoin bisa pakai private chainnya Ripple, ripple bakal jadi The mother of Govcoin. Tapi ya itu tadi di private chainnya XRP punya use case atau tidak.Sumber :https://www.crypto-news-flash.com/novatti-expands-audd-stablecoin-to-xrp-ledger-unlocking-new-possibilities-for-stellar-based-payments/https://coingape.com/xrp-news-usd-stablecoin-officially-launches-xrp-ledger/https://www.fintechfutures.com/2023/07/the-republic-of-palau-taps-ripple-for-first-stablecoin-pilot/#:~:text=PSC%20is%20to%20be%20backed,of%20unique%20vegetation%20and%20wildlife.https://coinvestasi.com/berita/palau-jadi-negara-pertama-pakai-sistem-cbdc-ripplehttps://id.wikipedia.org/wiki/Bendera_PalauNote : Maaf jika gambar belum dapat dilihat langsung pada thread ini.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5473842",
  "comments": [
    {
      "author": "Husna QA",
      "created_time": "November 12, 2023, 11:57:38 PM",
      "body": "Quote from: muliyadi227 on November 12, 2023, 09:12:45 PMRepublik Palau udah bekerjasama dengan Ripple untuk membuat USD backed digital currency, bukan sebagai CBDC, tapi sebagai Govcoin. Buat temen-temen yang baru pertama kali dengar tentang Govcoin, Governance coin adalah sektor baru di 2022 lalu dan mungkin nanti akan Hype diakhir 2023/2024. Govcoin adalah Stable coin yang diterbitkan oleh bank sentral suatu negara, beberapa Stable coin udah diterbitkan di Xrp Ledger meskipun bukan Govcoin. Beberapa diantaranya ada USDS yang diterbitkan oleh Stably dan AUDD dari Novatti Group. Kalau emang Govecoin bisa pakai private chainnya Ripple, ripple bakal jadi The mother of Govcoin. Tapi ya itu tadi di private chainnya XRP punya use case atau tidak.Sumber :https://www.crypto-news-flash.com/novatti-expands-audd-stablecoin-to-xrp-ledger-unlocking-new-possibilities-for-stellar-based-payments/https://coingape.com/xrp-news-usd-stablecoin-officially-launches-xrp-ledger/https://www.fintechfutures.com/2023/07/the-republic-of-palau-taps-ripple-for-first-stablecoin-pilot/#:~:text=PSC%20is%20to%20be%20backed,of%20unique%20vegetation%20and%20wildlife.https://coinvestasi.com/berita/palau-jadi-negara-pertama-pakai-sistem-cbdc-ripplehttps://id.wikipedia.org/wiki/Bendera_PalauNote : Maaf jika gambar belum dapat dilihat langsung pada thread ini.Negara tersebut saya baca di salah satu link sumber di atas tidak memiliki bank sentral, dan selama ini mata uang yang digunakannya adalah US dollar, ini lebih kurang seperti penerapan Bitcoin sebagai mata uang resmi di El Salvador yang mana negara tersebut juga sebelumnya menggunakan mata uang US Dollar sebagai alat pembayaran di negara tersebut.Dengan dukungan resmi dan mendapat fasilitas dari pemerintah, terlebih mengingat mereka belum memiliki mata uang resmi sendiri maka lebih mudah untuk menerapkan aset kripto sebagai mata uang dalam bentuk manapun di negaranya.Namun jika dikaitkan dengan Indonesia, maka menjadikan aset kripto sebagai mata uang resmi tidak bisa mudah begitu saja karena sudah ada mata uang Rupiah, bahkan untuk menerapkan Rupiah dalam bentuk digital (CBDC) pun masih belum masuk tahap uji coba (baru sampai tahap penerbitan White P​aper dan Consultative Paper: https://www.bi.go.id/id/rupiah/digital-rupiah/default.aspx).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "strunberg",
      "created_time": "November 13, 2023, 02:46:12 PM",
      "body": "Quote from: muliyadi227 on November 12, 2023, 09:12:45 PMNote : Maaf jika gambar belum dapat dilihat langsung pada thread ini.Beberapa image hoster seperti ibb atau imgur terkadang tidak bisa kompatibel dengan forum, entah karena masalah sekuritas atau hal-hal teknis lainnya. Ane menyarankan agan untuk memakai TalkImg yang didesain oleh salah satu member forum ini yang bernama joker_josue. Link Utas: https://bitcointalk.org/index.php?topic=5450546.0. Link website TalkImg: https://www.talkimg.com/Penggunaannya sangat praktis dan hampir dapat dipastikan tidak ada error saat loading image.Terkait \"akan menjadi hype di tahun 2023/2024\" ane pikir jika mengingat beberapa poin yang disampaikan oleh agan Husna QA sepertinya itu akan sedikit sulit untuk diaplikasikan. Penggunaan stable coin yang diperuntukkan untuk menggantikan mata uang negara tersebut akan harus melewati banyak hal dan akan ada banyak regulasi yang harus dibuat/direvisi. Berbeda dengan negara Palau atau beberapa negara lain yang tidak memiliki bank sentral dan memakai mata uang negara lain, US dollar misalnya.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "moneystery",
      "created_time": "November 13, 2023, 03:26:55 PM",
      "body": "pengembangan CBDC itu memerlukan sumber daya yang signifikan dan konsep yang matang dari bank sentral, contohnya saja negara kita sendiri memerlukan waktu bertahun-tahun untuk bisa mengembangkan CBDC-nya sendiri, bahkan proof of konsepnya saja akan selesai di Maret 2024, itu membuktikan bahwa pengembangan CBDC itu butuh pertimbangan yang matang. Jadi apa yang dilakukan oleh Republik Palau ini untuk mempersingkat waktu pengembangan CBDC mereka sendiri, mengingat bahwa Ripple itu sudah profesional dalam pengembangan solusi crypto dan dengan pengalaman tersebut Republik Palau bisa mempercepat pengembangan konsep crypto mereka sendiri yang secure, efektif, dan lebih murah. dan mungkin langkah Republik Palau ini akan diikuti oleh banyak negara-negara kecil lainnya yang akan menggunakan jasa pihak ketiga seperti Ripple, Stellar, dan beberapa perusahaan solusi kripto lainnya untuk pengembangan crypto mereka.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rampagoe004",
      "created_time": "November 14, 2023, 07:06:56 AM",
      "body": "Quote from: moneystery on November 13, 2023, 03:26:55 PM-snipSebenarnya seperti yang dikatakan oleh agan HusnaQA bahwa negara-negara yang tidak mempunyai bank sentralnya sendiri cenderung lebih mudah mengaplikasikan CBCD ini. Kalau negara yang mempunyai bank sentral maka kesulitannya adalah selain konsep yang harus benar-benar matang, membuat peralihan di masyarakat dari mata uang negaranya ke CBCD juga butuh waktu yang lama sebelum akhirnya beradaptasi. Beda dengan negara yang memakai dollar sebagai mata uangnya dimana ketika mereka mempunyai CBCD artinya mereka bisa memakai keduanya, dollar sebagai mata uang kedua dan kripto sebagai mata uang yang diluncurkan dari pemerintahannya sendiri.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blue Snow",
      "created_time": "November 17, 2023, 06:04:57 AM",
      "body": "Quote from: muliyadi227 on November 12, 2023, 09:12:45 PMRepublik Palau udah bekerjasama dengan Ripple untuk membuat USD backed digital currency, bukan sebagai CBDC, tapi sebagai Govcoin. Buat temen-temen yang baru pertama kali dengar tentang Govcoin, Governance coin adalah sektor baru di 2022 lalu dan mungkin nanti akan Hype diakhir 2023/2024. Govcoin adalah Stable coin yang diterbitkan oleh bank sentral suatu negara, beberapa Stable coin udah diterbitkan di Xrp Ledger meskipun bukan Govcoin. Beberapa diantaranya ada USDS yang diterbitkan oleh Stably dan AUDD dari Novatti Group. Kalau emang Govecoin bisa pakai private chainnya Ripple, ripple bakal jadi The mother of Govcoin. Tapi ya itu tadi di private chainnya XRP punya use case atau tidak.Mungkin lebih tepat kalau thread ini dipindahkan ke altcoin board, karena kita berbicara altcoin seperti ripple dan stable coin. Mong-omong soal negara yang mengadopsi crypto sebagai currency, ane rasa itu sah-sah saja sepanjang tidak menyalahi aturan mereka sendiri dan moneter internasional. Pelan-pelan saja, jangan terlalu vulgar karena negara palao ini makai Dollar AS sebagai mata uang utama negaranya, takutnya nanti Paman Sam ngamuk, tau sendirilah bagaimana kalau mereka tidak senang, dan menganggu perekonomiannya, bisa-bisa negara kecil tersebut (Palao) bisa dibumi hanguskan kayak Libya (yang berusaha menyatukan mata uang afrika jadi emas)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}