{
  "id": "topic_5444143",
  "title": "T3PR00T",
  "author": "T3PR00T",
  "created_time": "March 09, 2023, 04:34:31 PM",
  "content": "Quote from: T3PR00T on March 09, 2023, 04:32:00 PMQuote from: SeedChecker on March 09, 2023, 02:18:19 PM- By using the SeedChecker software, you confirm thall seed phrases used on your part belong only to you.Wait, you are asking me to give you the seed and also pay for the subscription?Nice scam!Profile : SeedCheckerType 1 flag : https://bitcointalk.org/index.php?action=trust;flag=3127",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5444143",
  "comments": [
    {
      "author": "Rikafip",
      "created_time": "March 09, 2023, 04:44:19 PM",
      "body": "I thought I've seen all kind of scam attempts, but this is something new. Worst of all, I have no doubts that some will actually fall for this and enter their own seed phrase into this \"software\". Anyway, flag supported and scammer tagged.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Stalker22",
      "created_time": "March 09, 2023, 06:46:03 PM",
      "body": "Newbies should be very wary of such scam attempts. Even if the software developer claims that it is an open-source tool, that does not mean it is safe, and don't be too quick to trust them. In fact, some software can send your private information to their servers without you even knowing it! Once they have your data, who knows what they might do with it? So, be careful and don't fall for these tricks, or you might end up losing all your precious coins!Flag supported.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "albon",
      "created_time": "March 09, 2023, 09:36:47 PM",
      "body": "I support the flag, and I hope no one downloads this scammer's software or puts seed phrases in it because the victim's entire device will be hacked, and he will lose his wallet and all assets.Quote from: SeedChecker on March 09, 2023, 05:45:42 PMWhat does it check?Coin balance, balance of all tokens, NFTs, 200+ staking pools, 350+ farming pools, 90+ lending pools, 200+ yield aggregators, 150+ liquidity protocolsPrice:$300 one-time + $99 / monthWhat made me laugh frankly is the price of this malicious program, which does not offer anything new other than nonsense; perhaps an ignorant child created it. It requires the victim to pay $300 and get software that checks the price of his currencies and the NFTS..etc. These are all accessible features, and anyone can do this manually through one of the sites; the other thing is that for the victim to do these checks and monitor prices, he should put his wallet recovery phrases    .",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dragonvslinux",
      "created_time": "March 09, 2023, 09:58:36 PMLast edit: March 09, 2023, 10:26:58 PM by dragonvslinux",
      "body": "Source: https://loyce.club/archive/posts/6188/61883059.htmlQuote from: SeedChecker on March 09, 2023, 02:18:19 PMSeedChecker is a browser-based software for checking and 24/7 monitoring of Seed-phrase balances.From each seed phrase the checker extracts:50 Bitcoin addresses (legacy, segwit, compatibility formats)20 Ethereum addresses20 BinanceSmartChain addresses20 Polygon addresses (and other ERC-20 chains: Avalanche, HECO, Fantom, Optimism, ...)50 Bitcoin cash addresses15 Litecoin addresses10 Solana addresses5 TRON addresses10 DogeCoin addressesWhat does it check?Coin balance, balance of all tokens, NFTs, 200+ staking pools, 350+ farming pools, 90+ lending pools, 200+ yield aggregators, 150+ liquidity protocols20+ supported wallets:Metamask, Exodus, Blockchain, Trezor, Atomic, Phantom, Coinomi, Ledger, Jaxx, bitcoin core, as well as other wallets that generate addresses on the standard BIP-32 (BIP-39, BIP-44, BIP-49 BIP-84)15+ supported blockchains:Ethereum, Bitcoin, Bitcoin cash, Binance smart chain, Litecoin, TRON, Solana, Dogecoin, Polygon, Fantom, HECO chain, Avalanche, Arbitrum, Optimism, Boba, Moonbeam, ...100% OpenSource. SeedChecker is a fully open source product. You can analyze the entire code as well as make any changes.SeedChecker will send a telegram notification about all found balancesNEW! The checker now has a realtime monitoring function. Now you will receive telegram notifications of all incoming transactions to your base of seed phrases in real time.Want to see how SeedChecker works before you buy?Try demo access in our telegram bot: @buyseedchecker_botPrice:$300 one-time + $99 / monthInstant Purchase: telegram @buyseedchecker_botAny questions? telegram @chain_flint- By using the SeedChecker software, you confirm that all seed phrases used on your part belong only to you.- By purchasing the software, you confirm that you going to use the author's products exclusively for lawful purposes.- The author is not responsible for your legal / illegal actions, as a result of which harm was caused to any person.Clearly a scam, have tagged with correct reference. Will support flag if evidence to OP's claim is updated.At the moment the evidence of this user being a scammer is based on this quote:Quote from: SeedChecker on March 09, 2023, 02:18:19 PMwe are movedClearly this isn't enough (or no longer enough) to support such a flag, given the quote has been deleted.Here is otherwise an updated source (no doubt due to be deleted):Quote from: SeedChecker on March 09, 2023, 05:45:42 PMSeedChecker is a browser-based software for checking and 24/7 monitoring of Seed-phrase balances.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "T3PR00T",
      "created_time": "March 09, 2023, 10:04:49 PM",
      "body": "Quote from: dragonvslinux on March 09, 2023, 09:58:36 PMQuote from: SeedChecker on March 09, 2023, 02:18:19 PMwe are movedClearly this isn't enough (or no longer enough) to support such a flag, given the quote has been deleted.With ninjastic or loyceclub you can easily check he deleted the post contents.About the new post, consider I update my topic with that source, you support the flag and then he again removes the contents, are you gonna remove your support and wait for another update again 😃You are giving the scammers a new loop lol",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rikafip",
      "created_time": "March 09, 2023, 10:07:07 PM",
      "body": "Quote from: dragonvslinux on March 09, 2023, 09:58:36 PMClearly a scam, have tagged with correct reference. Will support flag if evidence to OP's claim is updated.OP correctly used his own topic as a proof for flag where everything is obvious so I don't think that he has to update anything.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dragonvslinux",
      "created_time": "March 09, 2023, 10:08:39 PM",
      "body": "Quote from: T3PR00T on March 09, 2023, 10:04:49 PMQuote from: dragonvslinux on March 09, 2023, 09:58:36 PMQuote from: SeedChecker on March 09, 2023, 02:18:19 PMwe are movedClearly this isn't enough (or no longer enough) to support such a flag, given the quote has been deleted.With ninjastic or loyceclub you can easily check he deleted the post contents.This is irrelevant. The flag source link must provide clear evidence of the claim, which at present it doesn't.Quote from: T3PR00T on March 09, 2023, 10:04:49 PMAbout the new post, consider I update my topic with that source, you support the flag and then he again removes the contents, are you gonna remove your support and wait for another update again 😃Well no, because it would still be archived and you'd still have the archive link of this in the OP, so the scammer wouldn't be able to remove it  Quote from: T3PR00T on March 09, 2023, 10:04:49 PMYou are giving the scammers a new loop lolI'm just trying to encourage the correct use of flags, not much else. Otherwise the flag link references a claim with no evidence.Quote from: Rikafip on March 09, 2023, 10:07:07 PMQuote from: dragonvslinux on March 09, 2023, 09:58:36 PMClearly a scam, have tagged with correct reference. Will support flag if evidence to OP's claim is updated.OP correctly used just own topic as a proof for flag where everything is obvious so I don't think that he has to update anything.How is this any proof that SeedChecker is a scammer?Quote from: SeedChecker on March 09, 2023, 02:18:19 PMwe are movedEdit: Maybe I'm being too harsh as the flag link is to a topic, and I've since provided the evidence, but ideally this would be in the OP.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JollyGood",
      "created_time": "March 09, 2023, 10:36:41 PM",
      "body": "Quote from: Rikafip on March 09, 2023, 04:44:19 PMI thought I've seen all kind of scam attempts, but this is something new. Worst of all, I have no doubts that some will actually fall for this and enter their own seed phrase into this \"software\". Anyway, flag supported and scammer tagged.That seems to be what the creator of the website seems to be holding on to (that gullible people will fall for the scam). I also have supported the flag for obvious reasons.Quote from: Stalker22 on March 09, 2023, 06:46:03 PMOnce they have your data, who knows what they might do with it? So, be careful and don't fall for these tricks, or you might end up losing all your precious coins!Flag supported.That is the key point, after they in possession of your data (seed phrases or anything else) they could easily use that very same data to steal from you. Simply on that basis alone, this website cannot be trusted.Quote from: albon on March 09, 2023, 09:36:47 PMI support the flag, and I hope no one downloads this scammer's software or puts seed phrases in it because the victim's entire device will be hacked, and he will lose his wallet and all assets.I also have supported the flag but would invite the seed checker website forum representative to make a post here to add their comments and views to those that have already been expressed here so we can all read what they have to say about the situation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Razmirraz",
      "created_time": "March 10, 2023, 03:26:33 AM",
      "body": "He led to the opinion that their software would be useless if the Seed phrase base was less than 500 pieces. LolQuote from: SeedChecker on March 09, 2023, 05:49:52 PMOur software will be useful for you only if you have a large base of Seed phrases (from 500 pieces and more). Our software does not make sense to work with 1-2 Seed phrases.There are many ways to monitor coins without spending $300 on scam software that can send information to their servers. scammers of this kind must be exterminated, without a doubt I support the flag.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "speedy963",
      "created_time": "March 10, 2023, 05:15:06 AM",
      "body": "I supported the allegations. I just pity those newbie he preyed upon if ever he did that before. I was also once a newbie so it pricks my conscience seeing this predators around waiting to fall for their trap, and whether we like it or not there are still person who will commit this evil deeds.Kudos OP for reporting and spotting this one!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FatFork",
      "created_time": "March 10, 2023, 01:09:56 PM",
      "body": "It's unfortunate that there are people out there preying on newbies and taking advantage of their lack of knowledge, but we can all do our part by spreading awareness and making sure people know how to protect themselves. We really have to be careful with our private information, especially our seed phrases, as that's the key to accessing our crypto assets. Once scammers get their hands on that, it's game over. No one should ever give their seed phrase to anyone, period. So, it's really important to be careful and not fall for these kinds of tricks. Never give your seed phrase to anyone, and be wary of any software that asks for it. There are other ways to keep track of your cryptocurrency without putting yourself at risk.I have also supported the flag against the user. Hopefully, by raising awareness and flagging the user's malicious actions, we can prevent at least a few unsuspecting newbies from falling for this scam.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coin-investor",
      "created_time": "March 10, 2023, 02:37:05 PM",
      "body": "The nerve of this guy, he should be banned and all his posts deleted only newbies who do not know the basic of not sharing their seed phrase will fall into this, how he markets his software is enticing but make no mistake about it there is no such thing as good software or platform if they will ask you your seed phrase, supported the flag and requested that the said account get a ban, he even got a copper account to promote his software.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "March 10, 2023, 03:03:10 PM",
      "body": "Quote from: coin-investor on March 10, 2023, 02:37:05 PMThe nerve of this guy, he should be banned and all his posts deleted...~snip~The scam is not moderated on this forum, and the only reason why a permanent ban could possibly be requested is if the link to his software is actually a virus/malware. Personally, I don't want to check what exactly it is about, but we all know that the idea is completely wrong, regardless of who is behind it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JollyGood",
      "created_time": "March 10, 2023, 08:58:28 PM",
      "body": "Though it seems morally the correct course of action, we all know scams are not moderated in the forum therefore that will probably not happen on the basis of a scam or potential scam.When scams or potential scams take place all we can do is leave tags, support flags and exclude from our trust lists and try to warn to newbies and gullible people to avoid them otherwise they will most probably end up out of pocket.Quote from: coin-investor on March 10, 2023, 02:37:05 PMThe nerve of this guy, he should be banned and all his posts deleted only newbies who do not know the basic of not sharing their seed phrase will fall into this, how he markets his software is enticing but make no mistake about it there is no such thing as good software or platform if they will ask you your seed phrase, supported the flag and requested that the said account get a ban, he even got a copper account to promote his software.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Razmirraz",
      "created_time": "March 11, 2023, 02:38:15 AM",
      "body": "Quote from: FatFork on March 10, 2023, 01:09:56 PMIt's unfortunate that there are people out there preying on newbies and taking advantage of their lack of knowledge, but we can all do our part by spreading awareness and making sure people know how to protect themselves. We really have to be careful with our private information, especially our seed phrases, as that's the key to accessing our crypto assets. Once scammers get their hands on that, it's game over. No one should ever give their seed phrase to anyone, period. That's the goal, they never care about other people's fate to get personal profit. Luckily here this kind of scammers is immediately combated by flagging negative tags and supporting flags. Newbies whose knowledge is still very minimal must test the feasibility of the software they want to use to prevent the worst from happening to their assets.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LoyceV",
      "created_time": "March 11, 2023, 09:10:56 AM",
      "body": "Quote from: albon on March 09, 2023, 09:36:47 PMWhat made me laugh frankly is the price of this malicious program, which does not offer anything new other than nonsense; perhaps an ignorant child created it. It requires the victim to pay $300It's an interesting \"business model\".Quote from: FatFork on March 10, 2023, 01:09:56 PMIt's unfortunate that there are people out there preying on newbies and taking advantage of their lack of knowledgeI can't really call this preying on newbies, he's targeting people with many wallets and lots of money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pmalek",
      "created_time": "March 11, 2023, 09:23:54 AM",
      "body": "Quote from: LoyceV on March 11, 2023, 09:10:56 AMI can't really call this preying on newbies, he's targeting people with many wallets and lots of money. Depends on what your definition of a newbie is. You (LoyceV) might at this moment have 0 bitcoin to your name but you are not a newbie. Someone else could have 10 wallets with 10 BTC in each and still be a newbie by not knowing how to protect themselves and recognizing the intentions of software like this one. He is targeting newbies in the common sense and security knowledge department. I didn't want to say intelligence, but it's not that far away. If you see a thread like this and think that it's a wonderful way to check if my seeds belong exclusively to myself, you aren't the brightest mind. I saw a funny response to a picture someone posted somewhere about a guy who was driving in the opposite direction in a roundabout and someone replied to him, it's because of people like you they have to write on shampoos that it's not supposed to be consumed as a beverage.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FatFork",
      "created_time": "March 11, 2023, 09:24:28 AM",
      "body": "Quote from: LoyceV on March 11, 2023, 09:10:56 AMQuote from: FatFork on March 10, 2023, 01:09:56 PMIt's unfortunate that there are people out there preying on newbies and taking advantage of their lack of knowledgeI can't really call this preying on newbies, he's targeting people with many wallets and lots of money.Hey, newbies can have a lot of money too!   But yeah, not many of them would shell out $300 for this software. Maybe the guy would've had more luck if he gave it away for free, but I bet people would catch on to his scam pretty quickly. (I'm curious to check out the source code, but I'm definitely not paying $300 for it.)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dragonvslinux",
      "created_time": "March 11, 2023, 12:25:09 PM",
      "body": "Quote from: LoyceV on March 11, 2023, 09:10:56 AMQuote from: albon on March 09, 2023, 09:36:47 PMWhat made me laugh frankly is the price of this malicious program, which does not offer anything new other than nonsense; perhaps an ignorant child created it. It requires the victim to pay $300It's an interesting \"business model\".I think the price is because it claims to be open source, but there is a paywall, so clearly it's not \"open\" source code. But there is a good reason for this... If it were truly open source, with source code published on github for example, then it would be easily to pick apart and find the exploit if there is one. For example there is already a \"SeedChecker\" on github it seems: https://github.com/L1ghtM4n/SeedChecker - not recommended(May or may not be legit, even though couldn't see an obvious exploit myself)So while it's \"possible\" SeedChecker has forked this and included more blockchain compatibility, it's the claim of being open source while having a paywall that's the obvious scammy part (the contradition). A seed checker in itself wouldn't necessarily be a scam, it could be like Exodus wallet (that supports lots of blockchains) without the functionality of sending transactions. At least theoretically speaking.My point is if SeedChecker wanted to restore their reputation, they could provide the source code for review to some trusted members here... but for obvious reasons, I doubt this would happen.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}