{
  "id": "topic_5405945",
  "title": "uneng",
  "author": "uneng",
  "created_time": "July 12, 2022, 01:10:36 AMLast edit: February 04, 2024, 12:25:54 AM by uneng",
  "content": "Freebitco.in - FUN Token Investment ExperimentOn this thread I'm going to share my personal investment's updates in Top 1 Tier FUN Token package (500,000 FUN) at Freebitco.in.To better understand how the premium program works, I'm going to post this spreadsheet containing all the achievable boosts' rates offered and how long the investment takes until investors can receive them:The investment offers benefits for micro earners, gamblers and investors. So, if you fall under at least one of those categories it might interest you. You can start having access to premium program from 2500 FUN holdings on and the best cost benefit package is without any doubts 12,500 FUN. Here I'm going for the 500,000 FUN one, though, in order to maximize the experience.Total investment potential will be reached after 360 days holding.Updates are going to be made in a monthly basis. This experiment can be useful if you are willing to invest, but don't know what to expect from it, or it can be just interesting as curiosity.THE BEGINNING (12/06/2022 - 11/07/2022) ROI - 0,0856%Below you can see the result after the first month of investment. As we can see on the spreadsheet above, not too much can be expected, since the first month of investment give us access only to 13 WOF (Wheel of Fortune) spins daily. Personally, I wasn't lucky at anytime and got only base rewards every day, with the exception of one day where I hit 500 satoshis once at wheel, but that is all. Being lucky you could hit 5000 satoshis or RP prizes. From next month on income is going to rise considerably, once more boosts become available.        INFOFUN TOKENS: number of FUN tokerns purchased. I already had 12,962 FUN, so i bought only 487,038 FUN to reach the final package.VALUE UNIT: price paid in satoshis of BTC for each FUN.INVEST. TOTAL: total investment amount in BTC.BTC INT. %: bonus interest percentage paid on BTC investment.FUN INT. %: interest paid on FUN holdings for locking it for different time periods.FUN LOCK PERIOD: for how long I'm locking my tokens.CASHBACK WAGER INCOME + RP: satoshis + reward points received back for playing on multiplier or betting on events. 1 satoshi equals to 1 RP, so they can be added.WHEEL INCOME: rewards from Wheel of Fortune.BTC INTEREST: extra interest paid by premium boost. Base interest rate (4,08%) will be excluded from the daily calculation.FUN INTEREST: profit from FUN sales.*SPINS BUG: 13 lost daily wheel's spins regarding 09/07/2022 due to an internal error on the platform.!!!I'M NOT PART OF FREEBITCO.IN's TEAM IN ANYWAYS AND THIS IS JUST MY PERSONAL EXPERIENCE AS A COMMON USER OF THE WEBSITE, LIKE EVERYONE ELSE!THIS IS NOT FINANCIAL ADVICE! INVEST AT YOUR OWN RISK!",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5405945",
  "comments": [
    {
      "author": "16xypjnxlrew",
      "created_time": "July 12, 2022, 05:22:50 AM",
      "body": "Very good forum thread. This is the first time I've seen someone create something like this. Thanks for this thread!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Strongkored",
      "created_time": "July 12, 2022, 05:40:12 AM",
      "body": "Good thread, seeing from the period when you started investment in FUN means that you buy in the 35-37 Satoshi range, this price range is still quite cheap in my opinion and my prediction for a year you can benefit from WoF maybe if the price of FUN goes up, but it's difficult to early investors who bought FUN in the 100 satoshi price range, especially when freebitcoin made some changes so that now it becomes more difficult to get 5K satoshi from 1 WoF. Good luck with your investment and will continue to monitor every update.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Saint-loup",
      "created_time": "July 12, 2022, 06:35:18 AMLast edit: July 12, 2022, 07:06:17 AM by Saint-loup",
      "body": "Quote from: Strongkored on July 12, 2022, 05:40:12 AMGood thread, seeing from the period when you started investment in FUN means that you buy in the 35-37 Satoshi range, this price range is still quite cheap in my opinion and my prediction for a year you can benefit from WoF maybe if the price of FUN goes up, but it's difficult to early investors who bought FUN in the 100 satoshi price range, especially when freebitcoin made some changes so that now it becomes more difficult to get 5K satoshi from 1 WoF. Good luck with your investment and will continue to monitor every update.He bought his bag at 30 satoshis each token precisely according to the figures in his table (487038 tokens for 0.1461114BTC). That's a very nice price, he's very likely to be able to sell them with profit during the coming months at least, even if he doesn't take premium program benefits into account. So this is a very smart investment, kudos to him. 0.1461114BTC / 487038 = 0.00000030BTC",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "16xypjnxlrew",
      "created_time": "July 12, 2022, 07:38:33 AM",
      "body": "Oh no, I just noticed that your thread was flagged as a scam, but it's not. Please write to these moderators (https://bitcointalk.org/index.php?action=profile;u=78147https://bitcointalk.org/index.php?action=profile;u=164822) to remove this warning: \"Warning: Moderators do not remove likely scams. You must use your own brain: caveat emptor. Watch out for Ponzi schemes. Do not invest more than you can afford to lose.\"",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FatFork",
      "created_time": "July 12, 2022, 11:13:17 AM",
      "body": "Quote from: 16xypjnxlrew on July 12, 2022, 07:38:33 AMOh no, I just noticed that your thread was flagged as a scam, but it's not. This thread is not flagged as a scam. It's a generic warning that appears on all threads under the Marketplace > Securities board.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "babygun",
      "created_time": "July 12, 2022, 02:09:14 PMLast edit: July 13, 2022, 06:09:17 PM by babygun",
      "body": "Very interesting thread, thanks OP! But maybe it is better to move to the gambling section, it will also get more attention there. It will be interesting to see how long it will take before you break even!Quick question about the \"wheel income\". Is that just the satoshis that you get from the 13 daily WOF spins or do you also include the amount of RP?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "uneng",
      "created_time": "July 12, 2022, 07:38:22 PM",
      "body": "I'm glad you all liked. Thanks for the replies.Quote from: babygun on July 12, 2022, 02:09:14 PMVery interesting thread, thanks OP! But maybe it is better to move to the gambling section, it will also get more attention there. It will be interesting to see how like it will take before you break even!Quick question about the \"wheel income\". Is that just the satoshis that you get from the 13 daily WOF spins or do you also include the amount of RP?Yes, that is a possible idea, let's see... I wasn't sure where to post, because the subject is more about investment than gambling, so i thought this would be the most accurate section.\"Wheel income\" includes satoshis + RPs.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Eternad",
      "created_time": "July 13, 2022, 02:19:59 PM",
      "body": "Quote from: Saint-loup on July 12, 2022, 06:35:18 AMQuote from: Strongkored on July 12, 2022, 05:40:12 AMGood thread, seeing from the period when you started investment in FUN means that you buy in the 35-37 Satoshi range, this price range is still quite cheap in my opinion and my prediction for a year you can benefit from WoF maybe if the price of FUN goes up, but it's difficult to early investors who bought FUN in the 100 satoshi price range, especially when freebitcoin made some changes so that now it becomes more difficult to get 5K satoshi from 1 WoF. Good luck with your investment and will continue to monitor every update.He bought his bag at 30 satoshis each token precisely according to the figures in his table (487038 tokens for 0.1461114BTC). That's a very nice price, he's very likely to be able to sell them with profit during the coming months at least, even if he doesn't take premium program benefits into account. So this is a very smart investment, kudos to him. 0.1461114BTC / 487038 = 0.00000030BTCI doubt that he is in profit if we consider his investment value in fiat because the price of FUN token during the time he bought it approximately June 12 was around 0.0085$ while the current price of the token was 0.0073$ as I’m writing this post. It’s true that he he gain already more BTC than before but he already loss around 14% of his initial investment in fiat.His goal is long term and he still can recover that fiat loses plus gain once this bear market is already over.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "16xypjnxlrew",
      "created_time": "July 13, 2022, 02:38:55 PM",
      "body": "Quote from: Eternad on July 13, 2022, 02:19:59 PMI doubt that he is in profit if we consider his investment value in fiat because the price of FUN token during the time he bought it approximately June 12 was around 0.0085$ while the current price of the token was 0.0073$ as I’m writing this post. It’s true that he he gain already more BTC than before but he already loss around 14% of his initial investment in fiat.His goal is long term and he still can recover that fiat loses plus gain once this bear market is already over.In a year, there will be 100% growth and his investments will increase many times over!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Eternad",
      "created_time": "July 13, 2022, 03:42:00 PM",
      "body": "Quote from: 16xypjnxlrew on July 13, 2022, 02:38:55 PMQuote from: Eternad on July 13, 2022, 02:19:59 PMI doubt that he is in profit if we consider his investment value in fiat because the price of FUN token during the time he bought it approximately June 12 was around 0.0085$ while the current price of the token was 0.0073$ as I’m writing this post. It’s true that he he gain already more BTC than before but he already loss around 14% of his initial investment in fiat.His goal is long term and he still can recover that fiat loses plus gain once this bear market is already over.In a year, there will be 100% growth and his investments will increase many times over!How sure you are for making such comment on this crypto winter? Anyway in long term, I do such comment that he will be on profit once the market already recover but no one is certain if this will happened over just a year of waiting because base on previous crypto cycle, Its always have a 3 to 4 years period of each cycle which means we still have few more years to endure this bear market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NeuroticFish",
      "created_time": "July 13, 2022, 03:49:08 PM",
      "body": "Quote from: 16xypjnxlrew on July 12, 2022, 07:38:33 AMOh no, I just noticed that your thread was flagged as a scam, but it's not. Please write to these moderators (You should try to understand what you read. Use translator if needed.Or you're just \"playing a game\" in order to spam the mods? You do have a history of trolling I see...Quote from: uneng on July 12, 2022, 01:10:36 AMFreebitco.in - FUN Token Investment ExperimentIt's nice to see such experiment, although i don't agree with your (over)use of colors I'll watch this thread. Keep us posted.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Strongkored",
      "created_time": "July 14, 2022, 05:07:49 AM",
      "body": "Quote from: Eternad on July 13, 2022, 02:19:59 PMI doubt that he is in profit if we consider his investment value in fiat because the price of FUN token during the time he bought it approximately June 12 was around 0.0085$ while the current price of the token was 0.0073$ as I’m writing this post. It’s true that he he gain already more BTC than before but he already loss around 14% of his initial investment in fiat.His goal is long term and he still can recover that fiat loses plus gain once this bear market is already over.Since he buys directly on freebitcoin and is available in bitcoin only then the drop in fiat probably won't be his concern.@Uneng, are you not locking your tokens?, indeed it will be possible to miss the train if there is a price increase on FUN if locking within a year period, but locking it every 15 days or 30 days will also give you other benefits",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "uneng",
      "created_time": "July 14, 2022, 07:13:51 AM",
      "body": "Quote from: NeuroticFish on July 13, 2022, 03:49:08 PMIt's nice to see such experiment, although i don't agree with your (over)use of colors I'll watch this thread. Keep us posted.Thanks, hehe! Quote from: Strongkored on July 14, 2022, 05:07:49 AM@Uneng, are you not locking your tokens?, indeed it will be possible to miss the train if there is a price increase on FUN if locking within a year period, but locking it every 15 days or 30 days will also give you other benefitsYes, I'm locking every 30 days and selling the surplus for profit. I could lock for a longer time period for extra %, but for now it's probably better to enjoy the season, as each FUN is selling for 37 satoshis.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mohd1983",
      "created_time": "July 15, 2022, 09:27:32 AM",
      "body": "Thanks for this amazing reportI just to ask you when last time you withdraw Fun token from Freebitco.in ?Because for me it was working fine long time but before 2 days i was trying to withdraw 700k FUN and still its pending and i am thinking maybe its because of the database crash which 5 days ago or not related to this crash Already i sent email to the support team but no response till nowSo i just want to check if anyone else face the same issue in last 48 hours",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "uneng",
      "created_time": "July 15, 2022, 04:54:14 PM",
      "body": "Quote from: Mohd1983 on July 15, 2022, 09:27:32 AMThanks for this amazing reportI just to ask you when last time you withdraw Fun token from Freebitco.in ?Because for me it was working fine long time but before 2 days i was trying to withdraw 700k FUN and still its pending and i am thinking maybe its because of the database crash which 5 days ago or not related to this crash Already i sent email to the support team but no response till nowSo i just want to check if anyone else face the same issue in last 48 hours Thanks! Actually I have never withdrawn FUN from freebitco.in. I always buy and sell FUN inside the platform itself.I feel sorry for the issue you are facing. It's really annoying. You can try sending a personal message to TheQuin (https://bitcointalk.org/index.php?action=profile;u=143168) on this forum. He handles demands from forum members who are freebitco.in's users.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "16xypjnxlrew",
      "created_time": "July 15, 2022, 05:10:10 PM",
      "body": "Quote from: uneng on July 15, 2022, 04:54:14 PMThanks! Actually I have never withdrawn FUN from freebitco.in. I always buy and sell FUN inside the platform itself.I feel sorry for the issue you are facing. It's really annoying. You can try sending a personal message to TheQuin (https://bitcointalk.org/index.php?action=profile;u=143168) on this forum. He handles demands from forum members who are freebitco.in's users.Try to withdraw too! I wonder what will happen?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mohd1983",
      "created_time": "July 16, 2022, 05:03:49 AM",
      "body": "Confirm  of receiving the Fun",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "16xypjnxlrew",
      "created_time": "July 16, 2022, 09:32:33 AM",
      "body": "Quote from: Eternad on July 13, 2022, 03:42:00 PMHow sure you are for making such comment on this crypto winter? Anyway in long term, I do such comment that he will be on profit once the market already recover but no one is certain if this will happened over just a year of waiting because base on previous crypto cycle, Its always have a 3 to 4 years period of each cycle which means we still have few more years to endure this bear market.Because Powell will no longer be able to raise the interest rate and the uncontrolled emission of money will begin again. Isn't it obvious? The year of the bear market has almost passed, the next 3 years will be the bull market",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ezeminer",
      "created_time": "July 23, 2022, 09:19:37 PM",
      "body": "If you want some interesting info about the spins, here's my 1009 saved up spins",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}