{
  "id": "topic_5418578",
  "title": "adaseb",
  "author": "adaseb",
  "created_time": "October 28, 2022, 02:56:30 AM",
  "content": "Seems it’s official. However I am puzzled as to why he bought it in the first place.For one he overpaid for it because looking at tech stocks like Facebook, it’s value would be probably less than $20 a share compared to the $54.20 he paid for it. So he really must have a big interest in it.Anyone know why? Is it because they banned Trumps account? Is it because it’s censored too much and he wants it to be more decentralized ?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5418578",
  "comments": [
    {
      "author": "Don Pedro Dinero",
      "created_time": "October 28, 2022, 03:32:35 AM",
      "body": "It seems that the purchase had a political background, yes. People who have those levels of money are no longer driven by money so much as by power:Elon Musk ‘fires Twitter executive’ who banned Trump as speculation mounts he could return to platformIn addition, it is quite likely that Trump will run for president again in 2024. So it all adds up.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Solosanz",
      "created_time": "October 28, 2022, 04:06:53 AM",
      "body": "Twitter is really a big social media for cryptocurrency space, he can do anything if he want to pump his favorited coin e.g. Doge. I think he don't mind about the overpaid since he's a billionaire and can bought anything that he want. I think sooner or later we will see he will trolling on twitter about Doge and Bitcoin, that will make his fanatic fans taking serious about his joke and buy the coin he promoted.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Majestic-milf",
      "created_time": "October 28, 2022, 06:09:53 AM",
      "body": "Sincerely, I have no idea as to his intentions because he's not the kinda person whose actions can be predicted. On the outside, he's saying the purchase was for Space X and since it's a platform with alot of potential, it's a worthy buy. Twitter will be facing a lot of changes as they've already been pressed with a debt of $13bn and with his initial plan to scrap %75 of the workers, and according to a co entrepreneur, Jason Calcanis, a suggested workforce of 3000 workers was given to Musk..Personally, I think the major part of his job would be to resuscitate Twitter in the years to come.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "davis196",
      "created_time": "October 28, 2022, 06:30:00 AM",
      "body": "Money aren't the main motivator. Social media platforms aren't very profitable and their stocks are overpriced.Elon Musk is driven by his own ego. He wants to be in the spotlight. He wants the people to like him and talk about him 24/7. Maybe he's turning into a narcissist or maybe he keeps trolling everyone.Meta is going  downhill. Instagram is trying to become the new TikTok and the IG users hate that. Facebook has become \"grandma's favorite social media\" and the young people ran away from FB years ago.Maybe Musk wants to make Twitter \"great again\", by reducing the amount of censorship and trying to gather more republican/conservative/right-wing users, who keep complaining about the progressive-liberal \"big tech\" corporations trying to silence them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NeuroticFish",
      "created_time": "October 28, 2022, 06:39:52 AM",
      "body": "Twitter probably brings nice money from advertising. And it can be \"improved\" to bring more.Twitter has a huge number of users. I would not be surprised if Elon has in mind businesses targeting vast number of users and this will give a good potential user base.It may be somewhat political too, but I don't think that - no matter how rich he is - he would spend 44 billions only for political reasons. He must have been convinced he will earn that money back and more.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LogitechMouse",
      "created_time": "October 28, 2022, 07:13:12 AM",
      "body": "Additional income stream, I guess.There are many daily active users of twitter and when a social media platform is being used by many users, companies will go there and advertise their company or business. Just look at Facebook.Elon has a mind that no other businessmen have. I mean he is doing something that businessmen aren't doing. Him pursuing his main goal which is people living in Mars. I saw a Facebook post an hour ago just when he officially bought Twitter, he went in the office with a sink. I mean who in the hell will go to his office with a sink on his hand . I expect good things in Twitter now that we have a new owner and now a private-owned company. 44 billion for him is just small and he can just earn that money in a year with his other business, I guess.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MArsland",
      "created_time": "October 28, 2022, 08:45:55 AM",
      "body": "Today Friday October 28th Elon Musk came to Twitter HQ to sort out what had to be done, he came with a washbasin and tweeted 4 hours ago \"the bird is freed\". This means that maybe he really wants Twitter to be more decentralized. Of course, after Elon's arrival at Headquarters, Twitter shares rose to $53.18 as it was almost close to the acquisition price had occurred at $54.20. Regardless of the intent contained in it whether it's political or not I think he wants to return to his reputation which had sunk because he made Twitter wait too long.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Reid",
      "created_time": "October 28, 2022, 09:11:04 AM",
      "body": "IMO, it's not just business anymore, it will be tainted by politics obviously. Free advertising will be a start, all he need is to pay actors for the ads. That will be millions of dollars that could be saved, and it will be worth the investment in the long run. I don't really care about the politics side, but it could influence big time when the elections start. It's not like they could ban the platform during those days so it will be a powerful tool for those who seek power. The upgrades and new features are what I am looking forward to, I wish they will be good.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Tony116",
      "created_time": "October 28, 2022, 09:31:40 AM",
      "body": "Quote from: Solosanz on October 28, 2022, 04:06:53 AMTwitter is really a big social media for cryptocurrency space, he can do anything if he want to pump his favorited coin e.g. Doge. I think he don't mind about the overpaid since he's a billionaire and can bought anything that he want. I think sooner or later we will see he will trolling on twitter about Doge and Bitcoin, that will make his fanatic fans taking serious about his joke and buy the coin he promoted.I don't think he bought twitter just because he is holding bitcoin and doge and his purpose of buying twitter is just manipulating these 2 coins for profit. You would think how long he can do that, people will soon realize if he intends to manipulate for profit. Spent a huge amount of money to buy back twitter just because this is not worth it, he is not that stupid. It seems to have more to do with politics as Don Pedro Money mentioned. It is reported that Trump's account will be restored soon and this means that US politics will continue to be more chaotic.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lovesmayfamilis",
      "created_time": "October 28, 2022, 09:57:48 AM",
      "body": "Any media is power. But according to Musk, he fights for freedom of speech so that everyone can express their point of view. Dogecoin's payments were also Musk's promises. But we can see all this in the future. Will Twitter really be a free platform, or will we see another power with its own laws in this society.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sunsilk",
      "created_time": "October 28, 2022, 10:20:26 AM",
      "body": "I guess it all lies about authority and power, data is the new oil today and everyone who has the most data got the most information from all over the world.Twitter is popular and I think that the influence that he's got, for him, it's not enough. Well, after this acquisition look at what Elon has done.Elon Musk completes Twitter takeover and ‘fires top executives’Also Binance has announced, they've invested on this acquisition: Binance’s CZ Confirms Participating as Equity Investor in Musk’s Twitter Takeover",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Johnyz",
      "created_time": "October 28, 2022, 10:25:37 AM",
      "body": "Quote from: adaseb on October 28, 2022, 02:56:30 AMAnyone know why? Is it because they banned Trumps account? Is it because it’s censored too much and he wants it to be more decentralized ?We can only speculate and no one know the exact reason, some can say it's because of censorship and some because of his personal interest.We can just wait for the future updates with twitter and with that, we can get the answer why. Elon owns twitter now and his first action is to remove the executives probably because something is going on with the organizations and Elon needs to clean in. There's also money and power with twitter, that's for sure.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "monineklutak",
      "created_time": "October 28, 2022, 10:35:35 AM",
      "body": "Quote from: lovesmayfamilis on October 28, 2022, 09:57:48 AMAny media is power. But according to Musk, he fights for freedom of speech so that everyone can express their point of view. Dogecoin's payments were also Musk's promises. But we can see all this in the future. Will Twitter really be a free platform, or will we see another power with its own laws in this society.It seems that the changes in Twitter are not going to happen right away anytime soon,but it will be interesting to see how Twitter develops and whether Elon Musk promise will be kept or not.I'm sure in the future Twitter will grow, we'll see",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zasad@",
      "created_time": "October 28, 2022, 11:14:08 AM",
      "body": "Quote from: adaseb on October 28, 2022, 02:56:30 AMSeems it’s official. However I am puzzled as to why he bought it in the first place.For one he overpaid for it because looking at tech stocks like Facebook, it’s value would be probably less than $20 a share compared to the $54.20 he paid for it. So he really must have a big interest in it.Anyone know why? Is it because they banned Trumps account? Is it because it’s censored too much and he wants it to be more decentralized ?https://twitter.com/elonmusk/status/1585341984679469056?\"Entering Twitter HQ – let that sink in!\"Elon Musk made a $50 billion bet with another billionaire that he would install his sink in the Twitter office.Looks like he won the bet. https://www.theguardian.com/technology/2022/oct/26/elon-musk-twitter-visit-sinkElon Musk makes splashy visit to Twitter headquarters carrying sinkTesla CEO changes his profile to ‘Chief Twit’ as Friday deadline to finalize his takeover deal nears",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sithara007",
      "created_time": "October 28, 2022, 11:24:25 AM",
      "body": "It can't get any better than this. The left-wing mafia that had ruled Twitter for all these years have lost their jobs, and have been \"escorted out\" of the Twitter headquarters in San Francisco. Those who lost the job after Elon Musk completed the takeover includes the following: Parag Agrawal (Chief Executive Officer), Vijaya Gadde (head of legal, policy and trust), Sean Edgett (general counsel) and Ned Segal (Chief Financial Officer). What happened yesterday represents perhaps the most important victory for free speech in this century. People like Parag and Vijaya were the worst abusers of free speech censoring. We should all thank Elon for kicking these people out of their offices.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Die_empty",
      "created_time": "October 28, 2022, 11:33:06 AM",
      "body": "Quote from: monineklutak on October 28, 2022, 10:35:35 AMIt seems that the changes in Twitter are not going to happen right away anytime soon,but it will be interesting to see how Twitter develops and whether Elon Musk promise will be kept or not.I'm sure in the future Twitter will grow, we'll seeNo human or government can guarantee freedom of speech. Would Elon Musk vow that he wouldn't censor speeches that is against him and his companies? How are we sure that Twitter would not be used as a tool to witch-hunt his enemies? For me the only reason why he bought Twitter is for more money, influence and power. He would use this medium to promote himself, company and ideology. Freedom of speech would continue to be a mirage because humans are naturally selfish and self-centered, maybe only superhuman can guarantee it.Elon Musk is diversifying his wealth and power to build more influence that would enable become a major player in the global and economic settings of the world. We have began to see this influence when he tried to propose negotiation for the peaceful resolution of the Russia-Ukraine conflict.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "RockBell",
      "created_time": "October 28, 2022, 12:42:57 PM",
      "body": "Who would have thought that a man like Elon would purchase Twitter at that price, but considering that it is one of the most influential social media platforms ever, I believe he has his own personal reasons. I'm still curious about the motivations behind his purchase, but Twitter has a lot of qualities that can go a long way in terms of social media, which is taking on a new dimension sharing of information goes faster and very easily. Let’s wait and see what will happen.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "samcrypto",
      "created_time": "October 28, 2022, 12:58:04 PM",
      "body": "After the drama between Elon and Twitter, finally they resolve it and now Elon owns it.I read other news as well that Elon is not alone here, some companies contributed to Elon, probably they are dealing into something and working with the one goal. Hard to know his reason but hopefully it won’t be bad. Anyway, Trump is back can’t wait to see his tweets again.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "KaliLinux",
      "created_time": "October 28, 2022, 01:00:46 PM",
      "body": "Quote from: lovesmayfamilis on October 28, 2022, 09:57:48 AMAny media is power. But according to Musk, he fights for freedom of speech so that everyone can express their point of view. Dogecoin's payments were also Musk's promises. But we can see all this in the future. Will Twitter really be a free platform, or will we see another power with its own laws in this society.So does this mean Elon Musk can even tweet whatever he wants and influence the market since he is the owner of the platform now without someone censoring him  Because I believe maybe before now that would have happened if he posted something that might be inappropriate for the market or seen as trying to manipulate the market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}