{
  "id": "topic_5466554",
  "title": "Liliana1304",
  "author": "Liliana1304",
  "created_time": "September 12, 2023, 05:49:28 PM",
  "content": "Yup. Just as the heading reads, it seems our good ol' Franklin has joined other financial institutions to apply for a spot Bitcoin ETF.Mainstream Assets manager, Franklin Templeton has applied to the US SEC to float a full fledged Bitcoin Exchange Traded Fund(ETF) product. This product, dubbed \"The Franklin Bitcoin ETF\" is a remarkable investment and this could open more doors for a new era of institutional participation in the crypto space.Franklin Templeton is one of the world's largest independent investment manager with a combined $1.4trn in assets under management across one of the broadest ranges of investment teams in the industry.The company has highlighted it's choice of custody provider and it's assets are to consist primarily of Bitcoin which is in custody of Coinbase Custody Trust Company.This move by Franklin Templeton coincides with the growing trend of other financial giants who have files for a spot Bitcoin ETF like BlackRock who are eager for a future where the SEC will approve of their applications. This is a good move by the Asset management company especially as it's CEO, Jenny Johnson was quoted in the past referring to Bitcoin as a \"great distraction from the greatest disruption in financial services\".. Is this something to celebrate over or are these applications just going to continue piling on Gary's desk without receiving a favorable response?https://www.investopedia.com/frankling-templeton-files-for-bitcoin-etf-7968500",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5466554",
  "comments": [
    {
      "author": "SquirrelJulietGarden",
      "created_time": "September 13, 2023, 01:05:24 AM",
      "body": "Franklin Templeton is only one of many entities file their Bitcoin Spot ETF application to SEC.You can follow up many Bitcoin Spot ETF applications and deadlines for SEC. to make their decisions.Here Is the Full List of Spot Bitcoin ETF Applications and Deadlines",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "adaseb",
      "created_time": "September 13, 2023, 04:01:16 AM",
      "body": "Does anyone remeber how many BTC etf applications there were in the past? I think it was like 4 maybe 5. Then they all mostly withdrew because they knew it wouldn’t be approved.Now we got almost 10 different applications. It’s strange. Maybe they know something that we don’t. Why are all these companies applying all of a sudden when it’s been impossible to get approved in the past. Maybe the blackrock application is the game changer here.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Don Pedro Dinero",
      "created_time": "September 13, 2023, 04:37:36 AM",
      "body": "In Spanish we say that when the pitcher (of mud) goes so many times to the fountain that in the end it breaks. With so many applications, eventually they will have to approve the first ETF spot at some point, and when that happens we will start to see them approve one after the other.Quote from: adaseb on September 13, 2023, 04:01:16 AMNow we got almost 10 different applications. It’s strange. Maybe they know something that we don’t. Why are all these companies applying all of a sudden when it’s been impossible to get approved in the past. Maybe the blackrock application is the game changer here.Probably. Whether it's BlackRock or whatever, what seems clear is that the firms that are putting forward bitcoin ETFs have some reason to believe they will be approved, otherwise they wouldn't be investing so much time and resources.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OgNasty",
      "created_time": "September 13, 2023, 05:52:46 AM",
      "body": "The latest company to throw their hat in the ring. While I don’t think this alone is a huge story, the overall picture of many companies filing applications for a spot ETF suddenly shows that maybe something has changed among regulators and the industry has caught wind that they’re ready to mass approve Bitcoin spot ETFs.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sesterceshop",
      "created_time": "September 13, 2023, 06:16:35 AM",
      "body": "Quote from: OgNasty on September 13, 2023, 05:52:46 AMThe latest company to throw their hat in the ring. While I don’t think this alone is a huge story, the overall picture of many companies filing applications for a spot ETF suddenly shows that maybe something has changed among regulators and the industry has caught wind that they’re ready to mass approve Bitcoin spot ETFs. I think you’re right that there is a growing demand and optimism for Bitcoin spot ETFs in the market. The firms that are filing are hoping to capitalize on the success of the first Bitcoin futures ETF, which debuted last month and attracted over $1 billion in assets in its first two days. And a Bitcoin spot ETF would be even more appealing to investors, as it would track the actual price of Bitcoin rather than its future contracts. However, there are still some regulatory hurdles and uncertainties that could delay or prevent the approval - the SEC. It's still not clear when or if the SEC will greenlight Bitcoin spot ETFs. But it seems that the industry is optimistic and ready for this possibility.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Majestic-milf",
      "created_time": "September 13, 2023, 06:29:45 AM",
      "body": "Quote from: adaseb on September 13, 2023, 04:01:16 AMDoes anyone remeber how many BTC etf applications there were in the past? I think it was like 4 maybe 5. Then they all mostly withdrew because they knew it wouldn’t be approved.Now we got almost 10 different applications. It’s strange. Maybe they know something that we don’t. Why are all these companies applying all of a sudden when it’s been impossible to get approved in the past. Maybe the blackrock application is the game changer here. I actually got curious too. Last year, there was nothing like spot Bitcoin ETFs but now, it just seems like a profitable business venture every financial institution wants to sink their claws in and the fact that the SEC might just delay the approval is not deterring them, rather it just adds to fuel their determination. While most would explain that the reason behind this is that these institutions are in it to make more money, I call bullcrap! Maybe they want to keep self custodied Bitcoin away from the average person? I'm puzzled",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pakhitheboss",
      "created_time": "September 13, 2023, 06:48:41 AM",
      "body": "Quote from: OgNasty on September 13, 2023, 05:52:46 AMThe latest company to throw their hat in the ring. While I don’t think this alone is a huge story, the overall picture of many companies filing applications for a spot ETF suddenly shows that maybe something has changed among regulators and the industry has caught wind that they’re ready to mass approve Bitcoin spot ETFs. I don't think all ETFs would get approved in one go. Like Blackrock we can expect other rejection, before the SEC approves a few. Recently I came across an article about the long awaited Bitcoin accounting rules. I believe it might be another reason why every financial institution are applying for Bitcoin ETFs. Another might be the global regulation timeline submitted by IMF in the concluded G20 summit. It talks about global regulatory framework and not country specific. I may be wrong with my assessment as to why there is a sudden surge of ETFs application.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bittraffic",
      "created_time": "September 13, 2023, 07:13:34 AM",
      "body": "The prices is reacting in the opposite direction though. I can only think they are trying to make announcement like this be heard by the regular people to invest while these institutions are pulling the prices down.The only thing that changed was that Grayscale won the case and although GBTC wasn't yet converted to ETF, they may be the first along with Blackrock ETF whenever SEC approves ETF.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Text",
      "created_time": "September 13, 2023, 07:57:01 AM",
      "body": "As one of the world’s largest independent investment managers, with $1.4 trillion in assets under management, Franklin Templeton’s entry could potentially attract more institutional investors to the crypto market. This move aligns with the trend of other financial giants like BlackRock filing for a spot Bitcoin ETF.https://coinjournal.net/news/asset-manager-franklin-templeton-applies-to-launch-a-spot-bitcoin-etf/https://markets.businessinsider.com/news/etf/traditional-finance-giant-franklin-templeton-bets-big-on-bitcoin-with-etf-application-1032624292https://finance.yahoo.com/news/franklin-templeton-files-bitcoin-etf-143353749.html",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Blitzboy",
      "created_time": "September 13, 2023, 08:22:57 AM",
      "body": "Its surprising and amazing at the same time. With so many assets to handle, this move gives a clear picture of how the financial world is changing. The fact that the company is working with Coinbase Custody Trust Company to hold the ETF gives more authority.Its important to look closely at the rising trend. If big companies like BlackRock and Franklin Templeton are positive about Bitcoin ETFs, it could lead to more institutions accepting them. Even though the steps these organizations have taken are good, the big question is whether or not the SEC will share their optimism. Its one thing to fill out an application, but its a whole other thing to get a green light from the government.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "September 13, 2023, 09:29:33 AM",
      "body": "I don't like to rush to judgment on these things because the news of Bitcoin ETF is always accompanied by a lot of analysis from people who hear the word for the first time and argue about it without knowledge. Therefore, unless the first US ETF is approved, we cannot say that this is good news, and after that it may Its impact will not be as positive as many expect. Initial indicators will appear in the first quarter of 2024, specifically from January 1 to 3.Unfortunately, if you listen to the reasons they talk about for offering an ETF, you will find:Quote“The spot Bitcoin markets (1) have a history of artificially inflated trading volumes due to rampant manipulation and wash trading; (2) are highly concentrated; and (3) rely on a select group of individuals and entities to maintain Bitcoin’s network. These are features of the bitcoin network that make a proposed spot Bitcoin-based ETP extremely vulnerable to manipulation by bad actors, posing unnecessary risks to investors and the public interest. The proposed rule changes offer little to neutralize these threats,” Farnin said.These things may mean the end of Bitcoin cycles in its current form if ETF approved.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hd49728",
      "created_time": "September 14, 2023, 01:42:10 AM",
      "body": "Quote from: OgNasty on September 13, 2023, 05:52:46 AMThe latest company to throw their hat in the ring. While I don’t think this alone is a huge story, the overall picture of many companies filing applications for a spot ETF suddenly shows that maybe something has changed among regulators and the industry has caught wind that they’re ready to mass approve Bitcoin spot ETFs. More companies do so, more bigger companies join the application party, more pressure on regulators.Regulators will no longer refuse Bitcoin Spot ETFs application after a blink of eyes because pressure from those companies and communities have been becoming bigger. Together with growth of Bitcoin adoption, Bitcoin communities have been becoming stronger too. Their voice makes more sense that turns to bigger pressure on regulators.Quote from: hugeblack on September 13, 2023, 09:29:33 AMI don't like to rush to judgment on these things because the news of Bitcoin ETF is always accompanied by a lot of analysis from people who hear the word for the first time and argue about it without knowledge. Therefore, unless the first US ETF is approved, we cannot say that this is good news, and after that it may Its impact will not be as positive as many expect. Initial indicators will appear in the first quarter of 2024, specifically from January 1 to 3.I no longer feel exciting about Bitcoin Spot EFT news because I know if a first Bitcoin Spot ETF is approved in the USA, the market will react accordingly to it very strongly. Then when I see Bitcoin movements on the market, I will check what happened recently with Bitcoin Spot ETFs in the USA. If nothing big happens on the market, such news is useless.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mauser",
      "created_time": "September 16, 2023, 06:16:19 AM",
      "body": "Quote from: Liliana1304 on September 12, 2023, 05:49:28 PMYup. Just as the heading reads, it seems our good ol' Franklin has joined other financial institutions to apply for a spot Bitcoin ETF.Mainstream Assets manager, Franklin Templeton has applied to the US SEC to float a full fledged Bitcoin Exchange Traded Fund(ETF) product. This product, dubbed \"The Franklin Bitcoin ETF\" is a remarkable investment and this could open more doors for a new era of institutional participation in the crypto space.That is great news, Franklin Templeton is one of largest asset managers in USA and has a good reputation. If such a renowned name decides to enter the crypto world it's going to bring a lot of new investors and money in. For the younger generations ETFs is the go-to investments if they don't have any information advantage. It offers a cheap and easy solution to profit of the price increase of the underlying assets. For both my parents I switched all their investments in ETFs, they don't hold any actively traded fund anymore. It makes sense to save as much as possible in cost and be happy about the index returns. Most ETF usually replicate the index synthetically and not really buy the underlying assets. It’s for some ETFs to buy actual bitcoins and engage in spot transactions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bureau",
      "created_time": "September 16, 2023, 08:11:23 AM",
      "body": "There was a time when every financial institution in the USA was against Bitcoin. Now, they all want to get their hands on Bitcoin through ETFs. I wonder what all these big names are cooking behind our backs. I am certain there is a great deal of money and control involved plus they are all certain that the SEC would accept their application.This might be speculative but why is such news no longer bringing in positive sentiments to the market? When it all started the Bitcoin pumped and everyone believed that the Bull market had returned. Currently, we are neither in a Bull market nor a Bear, Bitcoin is just hovering sideways. Next year we have the 4th halving and if one of the ETFs gets approved we might as well see some upward trend.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tabas",
      "created_time": "September 16, 2023, 09:03:31 AM",
      "body": "No idea about that company but I guess that we're all getting the vibe here that the next bull run will be pushed by all of these soon-to-be approved Bitcoin ETFs.Quote from: Bureau on September 16, 2023, 08:11:23 AMThere was a time when every financial institution in the USA was against Bitcoin. Now, they all want to get their hands on Bitcoin through ETFs. I wonder what all these big names are cooking behind our backs. I am certain there is a great deal of money and control involved plus they are all certain that the SEC would accept their application.That's right, many of them have backlashed Bitcoin before and they're known household names and personalities in the finance sector. But then, here they are, many of them are starting to show interest and like for Bitcoin. There's only one drive here, they don't wanna miss the train and they have an idea on what's next for Bitcoin. It's all about the bull run and the profit that they can't ignore when it's there.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TravelMug",
      "created_time": "September 16, 2023, 10:00:29 AM",
      "body": "Quote from: tabas on September 16, 2023, 09:03:31 AMNo idea about that company but I guess that we're all getting the vibe here that the next bull run will be pushed by all of these soon-to-be approved Bitcoin ETFs.Quote from: Bureau on September 16, 2023, 08:11:23 AMThere was a time when every financial institution in the USA was against Bitcoin. Now, they all want to get their hands on Bitcoin through ETFs. I wonder what all these big names are cooking behind our backs. I am certain there is a great deal of money and control involved plus they are all certain that the SEC would accept their application.That's right, many of them have backlashed Bitcoin before and they're known household names and personalities in the finance sector. But then, here they are, many of them are starting to show interest and like for Bitcoin. There's only one drive here, they don't wanna miss the train and they have an idea on what's next for Bitcoin. It's all about the bull run and the profit that they can't ignore when it's there.I do agree, it seems that the timing is that at least one of those who have applied for a spot Bitcoin ETF might be approved or soon to be approved in the bull run. And if this case, it will trigger a rally, so we shall see.Everyone is exciting to see news like this, maybe it didn't have a huge impact on the price in the last 24 hours, but at least we have maintain above $26k already and so that is very positive, at least for the month of September.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "marlo1001",
      "created_time": "September 16, 2023, 10:07:05 AM",
      "body": "Another application that sec will reject, nothing intresting after blackrock",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sim_card",
      "created_time": "September 16, 2023, 10:13:22 AM",
      "body": "The interest that everyone is showing on bitcoin looks suspicious to me and i don't see why the sudden love for bitcoin to the extend that many institutions are applying for ETF bitcoin spot recently. These institutions are after their personal interest and not for the public because they desire to make huge profit from it. They have all understood the potential of bitcoin in the long run and that is why they are showing great interest. One thing i hate with the ETF stuff is that they will be in custody of customers bitcoin and this is the wrong way to store bitcoin that is suppose to be stored in a noncustodial wallet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tabas",
      "created_time": "September 16, 2023, 11:34:01 AM",
      "body": "Quote from: TravelMug on September 16, 2023, 10:00:29 AMQuote from: tabas on September 16, 2023, 09:03:31 AMNo idea about that company but I guess that we're all getting the vibe here that the next bull run will be pushed by all of these soon-to-be approved Bitcoin ETFs.I do agree, it seems that the timing is that at least one of those who have applied for a spot Bitcoin ETF might be approved or soon to be approved in the bull run. And if this case, it will trigger a rally, so we shall see.It is most likely that BlackRock's application will be approved first but there were some news that it's gonna be delayed. Well, these applications are all floating but there's this thought that if not most of them but many of them are likely to get rejected. Quote from: TravelMug on September 16, 2023, 10:00:29 AMEveryone is exciting to see news like this, maybe it didn't have a huge impact on the price in the last 24 hoursWhen there are news like this, I don't expect that they're going to be impactful within 24 hours. But the result of it will surely be big in the long run once they're approved. Quote from: TravelMug on September 16, 2023, 10:00:29 AMbut at least we have maintain above $26k already and so that is very positive, at least for the month of September.Yup, the support around $25k-$26k is already good if it's being maintained prior to the awaited push that we're tuning in.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}