{
  "id": "topic_5490289",
  "title": "Davidvictorson",
  "author": "Davidvictorson",
  "created_time": "March 25, 2024, 08:04:24 PM",
  "content": "Is there a feature in any type of Bitcoin wallet—whether hardware wallets, software wallets, web wallets, paper wallets, multi-signature wallets, or Lightning Network wallets—that can blacklist another Bitcoin wallet address from sending Bitcoin to your own wallet address?Do you think this may be a feature that will be needed in the future for whatever reason best known to the user of the wallet?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5490289",
  "comments": [
    {
      "author": "Charles-Tim",
      "created_time": "March 25, 2024, 08:16:53 PM",
      "body": "There is nothing like this. You can not block coins to be received on your wallet.If your are sent dust coin or you do not know the sender, just use coin control to freeze the coin. I will prefer to move my coins out of the addresses of the wallet and send it all to the addresses of another wallet which I have just generated its seed phrase.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DesmondHayes",
      "created_time": "March 25, 2024, 08:17:36 PM",
      "body": "I think not because Bitcoin would not be decentralized and censorship-resistant system anymore!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Z-tight",
      "created_time": "March 25, 2024, 08:19:07 PM",
      "body": "There is nothing like blacklisting addresses in the BTC network, this is just a word used by the government and centralized services to attack BTC's fungibility. You cannot reject incoming BTC tx's, if you are worried about dust tx's, you can freeze dust utxo's, this is why coin control is very important, because it helps you with your privacy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SatoPrincess",
      "created_time": "March 25, 2024, 08:23:36 PM",
      "body": "There are websites where scam victims can make reports of how they were scammed and provide the scammer wallet address so it can be blacklisted and watched. Governments can flag a wallet address if they believe it is connected to a crime. They track the “tainted coins” on the blockchain until it eventually links to the identity of a person. Centralized exchanges can also freeze funds transferred from blacklisted addresses. Bitcoin is decentralized and there is no such feature that can prevent a bitcoin address from receiving bitcoins. However it is possible for developers to ban address of Altcoins & smart contracts.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NeuroticFish",
      "created_time": "March 25, 2024, 08:25:26 PM",
      "body": "Bitcoin doesn't have such thing as blocking or blacklisting.However, various centralized services, of which some may call themselves wallets, do have this, but it's more a stupid workaround:* if their wallets receive coins that they consider tainted by their rules, they may seize them (but the funds were received, as you can see)* if their users try to use their account to send coins to wallets the centralized service prohibits (for example gambling), they will not allow the sending and may lock the accountI will add that my statement doesn't include LN. I don't know LN good enough to also tell about it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptoHeadlineNews",
      "created_time": "March 25, 2024, 08:27:37 PM",
      "body": "But if I may ask, what could make a person want to blacklist a wallet address from sending him/her some BTC? Because I'm yet to get any reasonable reason for one to think about the implementation of such feature amidst the millions of BTC wallet address in existence. But, however, I'm very much open to learning if anyone has a reason why such feature is needed. Thank you",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yhiaali3",
      "created_time": "March 25, 2024, 08:39:12 PM",
      "body": "As most of the members pointed out above, Bitcoin is decentralized and I do not expect that such a feature can be created that can prevent a Bitcoin address from receiving Bitcoins from any other address.I don't know what exactly your problem is and why you want such a feature. If such a feature could be made, governments would be the biggest beneficiaries because they would then blacklist some addresses and prevent them from sending Bitcoin to anyone else.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Amphenomenon",
      "created_time": "March 25, 2024, 08:43:12 PM",
      "body": "Quote from: Davidvictorson on March 25, 2024, 08:04:24 PMDo you think this may be a feature that will be needed in the future for whatever reason best known to the user of the wallet?This is a feature that can never be added to the Bitcoin Network because it's goes totally out of being decentralized to centralize.Bitcoin is free for everyone to use the way they please while some may have use it for illicit things, every other currency even the fiat is not an exception but once the account can be trace to the owner then they will face the law, with the recent being Woman found with £2bn in Bitcoin convicted of money laundering arrangement offence https://www.bbc.com/news/uk-england-london-68620253.ampWhile if this is for the reason to avoid Dusk attacks coin control is the best way to avoid it and this feature should be among the main features a good Bitcoin wallet should have",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "The Cryptovator",
      "created_time": "March 25, 2024, 08:48:06 PM",
      "body": "If you can block addresses for receiving or sending funds, that would stand against a decentralised ecosystem. Like a few other centralised currencies, you can't block or freeze Bitcoin addresses. For example, USDT can freeze addresses with funds. Means you can't move funds from your address. But I haven't heard yet if somehow you can block a sender's address. I don't think this feature will be found in any decentralised cryptocurrency. If so, it will no longer be decentralised.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NeuroticFish",
      "created_time": "March 25, 2024, 08:48:22 PM",
      "body": "Quote from: CryptoHeadlineNews on March 25, 2024, 08:27:37 PMBut if I may ask, what could make a person want to blacklist a wallet address from sending him/her some BTC? Because I'm yet to get any reasonable reason for one to think about the implementation of such feature amidst the millions of BTC wallet address in existence. But, however, I'm very much open to learning if anyone has a reason why such feature is needed. Thank youLet's say you are a big company (like MicroStrategy) and, for whatever reason (like wanting to look good in the eyes of some square-headed politicians) you don't want any questionable money getting to your wallet or cold storage. It could be an use case.Or it can be a way to fight dust attacks.Various centralized exchanges, gambling sites or other services that want to overly enforce KYC and \"source of funds\" may want to also do this kind of blacklisting (although in reality the current situation suits them best, since they can freeze user funds and - why not - use them for business' needs for a long time for free).So while the concept of tainted money is pretty stupid (and should not be recognized by anyone who cares about bitcoin!), there can be businesses that may like such a feature like blacklisting.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zaguru12",
      "created_time": "March 25, 2024, 10:26:58 PM",
      "body": "Quote from: CryptoHeadlineNews on March 25, 2024, 08:27:37 PMBut if I may ask, what could make a person want to blacklist a wallet address from sending him/her some BTC? Because I'm yet to get any reasonable reason for one to think about the implementation of such feature amidst the millions of BTC wallet address in existence. But, however, I'm very much open to learning if anyone has a reason why such feature is needed. Thank youAside of the explanation above they are also this dust attack issue where dust amount of bitcoin is sent to your wallet to monitor it. Blacklisting will simply stop it from coming into the wallet but it’s a very bad idea of decentralization. That means restricting others from performing their task. This kind of proposal could escalate to even restricting one from spending their bitcoin. The only thing close to blacklisting is the restriction of one’s CEX accounts which is not a bitcoin protocol feature.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "adaseb",
      "created_time": "March 25, 2024, 10:40:06 PM",
      "body": "Yeah there is no such feature. I got sent some dust attack inputs over the years, they are annoying and I just hide them in my wallet software. Unless fees are 1sat/byte you cannot even spend this dust because the miner fees to move it are more than the value of the input.I know why he is worried, if he is sent some tainted funds from some mixer or hacked funds, then his exchange could freeze his account due to suspicious activity. However I dont think this is common. If you are worried dont publish your BTC address in public, keep it a secret. OR at least use a one time use address and switch to a new address for each new transaction.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nelson4lov",
      "created_time": "March 25, 2024, 10:51:35 PM",
      "body": "The only way to do this on bitcoin would be at the protocol-level. On Ethereum, token creators/deployers just adds a censorship function that can do what you want but on bitcoin, it's not the same because wallets are simply means of accessing your on-chain account which is why you can use your seed on different wallet vendors. My best guess would be to just rotate addresses from time to time. Don't excessively use one address so you can minimize your address exposure to the bare minimum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bananington",
      "created_time": "March 26, 2024, 04:39:13 AM",
      "body": "Quote from: adaseb on March 25, 2024, 10:40:06 PMYeah there is no such feature. I got sent some dust attack inputs over the years, they are annoying and I just hide them in my wallet software. Unless fees are 1sat/byte you cannot even spend this dust because the miner fees to move it are more than the value of the input.I know why he is worried, if he is sent some tainted funds from some mixer or hacked funds, then his exchange could freeze his account due to suspicious activity. However I dont think this is common. If you are worried dont publish your BTC address in public, keep it a secret. OR at least use a one time use address and switch to a new address for each new transaction.It would be hard to keep an address a secret mostly when one belongs to a community like this, has grown past full rank and is seeking to join a signature campaign.If our OP is worried about receiving funds from addresses he doesn't know and wants to stop it, isn't there a way to chat with contact support or customer service representatives for such directions?I also think the phrase, Not your keys, not your coins is very valid here because ones it's your keys and such coins is received in your wallet, it automatically makes it yours, unless you intend to send the funds back to the address you received it for and thank them for their service. There isn't a blacklisting function that I know of, but there's a whitelisting for your addresses incase you need to send your coins to an address you frequently use.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "March 26, 2024, 05:06:38 AM",
      "body": "You've misunderstood how Bitcoin works. In Bitcoin you do not receive coins in your wallet. The \"coins\" reside on the blockchain in the decentralized network of nodes, when anybody transfers money using Bitcoin they are updating the state of that public distributed ledger and your wallet only updates its local state from this ledger called blockchain.You do not and can not control what happens in the entire network.The only thing you can do is to locally \"freeze\" coins you've received to prevent the wallet from spending those coins. But they're still going to be received nonetheless.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Z-tight",
      "created_time": "March 26, 2024, 07:51:55 AM",
      "body": "Quote from: CryptoHeadlineNews on March 25, 2024, 08:27:37 PMBut if I may ask, what could make a person want to blacklist a wallet address from sending him/her some BTC? Because I'm yet to get any reasonable reason for one to think about the implementation of such feature amidst the millions of BTC wallet address in existence. Institutions and companies comply with the government and their regulations, and part of that is helping them combat money laundering and other types of illicit activities, so they work with blockchain analysis companies to track the origin of tx's and if they think it is suspicious, they can blacklist the address and confiscate the funds. However, since blockchain analysis is more of guesswork, these services just prefer not to receive funds from mixers or CoinJoin, so in doing all these, the service frees itself from charges of aiding laundering, etc.But if it is for an individual, i think the reason could be if they are worried about dust attack, but with coin control you don't have to worry about incoming tx's as you can freeze it and never spend it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Helena Yu",
      "created_time": "March 26, 2024, 08:12:29 AM",
      "body": "Nope, but mining pools can do this, just like Ocean mining pool that blacklist Whirlpool transactions by Samourai Wallet.Quote from: SatoPrincess on March 25, 2024, 08:23:36 PMCentralized exchanges can also freeze funds transferred from blacklisted addresses. And if the user fail to submit the source of incomes, they will confiscate it and US will sold the coins by auction it. Technically US is the real Bitcoin mixer because they can change people perspective from illegal coins to clean coins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackBoss_",
      "created_time": "March 26, 2024, 08:50:57 AM",
      "body": "If you are worrying about dust attacks, you only can freeze UTXOs from dusts you received. You can not black list any address that sends dusts to your wallet.Dust Attack, what it is, why it is dangerous and how to prevent falling to itIf you use Electrum wallet, right click on that address, and choose Freeze.What does it mean to “freeze” an address in Electrum?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Frankolala",
      "created_time": "March 26, 2024, 09:30:44 AM",
      "body": "Only a centralized platform can blacklist an address. This is because you kept your coins with a third party, giving them access to do whatever they like with your coins. But in bitcoin, you only have access to transfer funds from your wallet address to another wallet address because you are in charge of the private key to unlock your input in the blockchain.You cannot stop coins from coming into your wallet address, because the network is decentralized and is been run by nodes. Like the posters above said, use coin control to freeze the dust attack.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}