{
  "id": "topic_5406374",
  "title": "Frostbase",
  "author": "Frostbase",
  "created_time": "July 15, 2022, 08:48:11 AM",
  "content": "I got around 100 USD worth of BTCX coin that I got from an airdrop and I would like to exchange them here1 BTCX coin  = 0.1 USD, so you get around 1000 BTCX coinsI prefer USDT, but am willing to get other crypto",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5406374",
  "comments": [
    {
      "author": "DireWolfM14",
      "created_time": "July 15, 2022, 05:27:32 PM",
      "body": "Quote from: Frostbase on July 15, 2022, 08:48:11 AM1 BTCX coin  = 0.1 USD, so you get around 1000 BTCX coinsI have found two different tokens that are referred to as BTCX.  One is Bitscoin which is trading around $0.000262, and the other is BitcoinX that's trading around $0.0389.  Regardless, I don't trust the market cap reports for either of these tokens, it looks like a bunch of fake volume.I wasn't able to find any token called BTCX that's trading at $0.1.  Is there another that I'm unable to find?  Is your token traded on any legitimate exchange?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "noorman0",
      "created_time": "July 19, 2022, 03:53:29 AM",
      "body": "Quote from: DireWolfM14 on July 15, 2022, 05:27:32 PM-snip-I wasn't able to find any token called BTCX that's trading at $0.1.  Is there another that I'm unable to find?  Is your token traded on any legitimate exchange?I'm sure the OP was referring to the new coins that are only valuable on their own exchange more or less like this (as is the usual way of airdrops to attract new users). Otherwise, OP will have no trouble selling $100 because that's above the minimum order amount on all exchanges.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DireWolfM14",
      "created_time": "July 19, 2022, 07:52:19 PM",
      "body": "Quote from: Frostbase on July 19, 2022, 05:51:44 PMYeah, there's a new exchange called btc6x that launched their airdrop back in December, I got mine and never used it since I never intended to be a trader. Though I realise I can get its value out by exchanging it hereI seriously doubt anyone here is going to pay you $100 for a shitcoin that's locked on a shitexchange that's very likely faking trade volume to make it look like their shitcoin is worth something.  Odds are, like most of these scammers, they're trying to get as much bitcoin for their shitcoin as possible before they fold, and move on to the next scam.Do yourself a favor; lock this thread and pretend like that airdrop never happened.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NeuroticFish",
      "created_time": "July 19, 2022, 08:57:41 PM",
      "body": "Quote from: Frostbase on July 15, 2022, 08:48:11 AMand I would like to exchange them hereIf you find an exchange where you can sell those coins, please do. But I doubt you can.So, as said, you better close this \"wonderful offer\" and move on before you start getting accused for trying to scam.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "noorman0",
      "created_time": "July 20, 2022, 04:14:15 AM",
      "body": "Quote from: Frostbase on July 19, 2022, 05:51:44 PMYeah, there's a new exchange called btc6x that launched their airdrop back in December, I got mine and never used it since I never intended to be a trader. LOL, so I guessed it right.Quote from: Frostbase on July 19, 2022, 05:51:44 PMThough I realise I can get its value out by exchanging it hereNo, such tokens are of no value here at all. As I said before, even someone on youtube commented who also got it couldn't withdraw it. This means that their own companies cannot put a price on the tokens they issue themselves. Forget it that you're going to get $100 somewhere.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "RodgerPace",
      "created_time": "August 06, 2022, 12:22:45 PM",
      "body": "I have found two different tokens that are referred to as BTC",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "noorman0",
      "created_time": "August 08, 2022, 06:52:21 AM",
      "body": "Quote from: RodgerPace on August 06, 2022, 12:22:45 PMI have found two different tokens that are referred to as BTCBe more careful, lots of fake wrapped bitcoin tokens out there. Real Bitcoin is on the blockchain itself, otherwise it is confirmed to be fake.First you have to confirm the above, however I doubt that your token will have a price here like the OP's tokens.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}