{
  "id": "topic_5461527",
  "title": "mandown",
  "author": "mandown",
  "created_time": "July 30, 2023, 09:55:08 PM",
  "content": "Base ağına köprü aktif edilince millet çılgınlar gibi saldırdı saçma salak coinler bir gecede inanılmaz rakamları görmeyi başardı. Bunlardan en göze çarpan bald token. Daldan dala atlamasam bu akşam çok karlı olabilirdi kısmet değilmiş deyip devam ediyoruz.Bugün yarın herhangi bir borsa listelemesi gelirmi bilmiyorum ama base ağına giren para'yı çıkartmak için sağlıklı bir köprü malesef yok yani orada birkaç gün daha ciddi hype göreceğiz..Meraklısına teknik ayrıntılar : Satın alabileceğiniz dex: https://base.leetswap.finance/#/swap Fiyat : https://www.dextools.io/app/en/base/pair-explorer/0xe96df8f5ef1a8790415068c798765b07d57643bd",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5461527",
  "comments": [
    {
      "author": "yenerbatmaz",
      "created_time": "July 31, 2023, 02:06:49 PM",
      "body": "Bald Dev yaratıcı bir rug çekti, sadece token'ı satın alıp lp ekleyerek, daha sonra kendi lp'sini kaldırarak 23 milyon USD buharlaştırmış oldu,bu tarz paylaşımlarda dikkatli olun arkadaşlar, daha yeni çıkan zincirde dışarı köprüleme bile yokken rastgele bir token bir günde 70 milyon USD mcap'e ulaşırsa çok şüpheci yaklaşmanız gerekir... image source: https://twitter.com/wizardofsoho",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mandown",
      "created_time": "July 31, 2023, 04:54:28 PM",
      "body": "Hocam bu işler malesef her zaman riskli dün en güvenilir curve bile hacklendi. Elemanın cüzdanında o eth'ler duruyor mainnet eth'ye binanceden eth gelmiş yani o ürün kimin çoktan biliniyordur binance ile iletişime çoktan geçilmiştir. Öyle bir parayı yedirmezler.Elemanın cüzdanı incelediğimde heyecan arayan biri sürekli token üretmiş biri tutmuş. Elemanın tavru yüzünden dex coinleri bile inanılmaz düşmüş neredeyse düşmeyen ürün kalmamış base içinde inanılmaz kötü bir durum.Eleman tek kalemde değil bir kaç seferde likiditeyi çekmiş. Çektikçe fiyat düşmüş düştükçe de almışlar. 12K eth yi kendini akıllı sanan biri kazandığını sanıyor Geçmiş olsun",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SUPERSAIAN",
      "created_time": "July 31, 2023, 06:51:59 PM",
      "body": "Dex işlemi yapan alternatif projeler yaşanan hatta sıklıkla hack durumları rugpullar olduğu için bir türlü toparlamıyorlar. Şu geçtiğimiz iki gün içerisinde iki tane milyon dolarlar almış projenin havuzları boşaltıldı bu iş böyle devam ettiği sürece DEX kripto platformlarına hep bir adım mesafeli durmak gerekiyor riski artı bir olarak yazmak lazım. Bir anda şişirilen projeler genellikle daha sonra boşaltılıyor bu aldatmacalarda para kazanmakta ayrı bir mesele kolay değil büyük riskler geçerli aynı zamanda kazançlarda.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ajanwalker",
      "created_time": "July 31, 2023, 08:50:05 PM",
      "body": "Quote from: yenerbatmaz on July 31, 2023, 02:06:49 PMBald Dev yaratıcı bir rug çekti, sadece token'ı satın alıp lp ekleyerek, daha sonra kendi lp'sini kaldırarak 23 milyon USD buharlaştırmış oldu,bu tarz paylaşımlarda dikkatli olun arkadaşlar, daha yeni çıkan zincirde dışarı köprüleme bile yokken rastgele bir token bir günde 70 milyon USD mcap'e ulaşırsa çok şüpheci yaklaşmanız gerekir... image source: https://twitter.com/wizardofsohoBtc ağında nft ile iş yapmaya çalışan ohm ekibinden birisi de rug çekti sonra takım işi düzeltmeye çalışsa da bazı şeyleri geri getirmek kolay olmuyor maalesef.Bu da kötü olmuş. Ayı piyasası olduğu için rug olayları çok fazla oluyor. Umarım bizden yatırım yapan olmamıştır.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bthd",
      "created_time": "July 31, 2023, 11:50:18 PM",
      "body": "Olayın asıl bomba tarafı geliyor. Bald'ın yaratıcısının yani rug çeken kişinin SBF olduğuna dair paylaşımlar var. Bence ortaya konuşan ilişkiler bütünü kanıt niteliğinde ve SBF gibi piyasayı ve ilginin nereye gideceğini diğerlerinden önce kestirebilen asalak tipler insanları dolandırmaya devam ediyorlar.@hype_eth adlı twitter kullanıcısının paylaşımları:Quote- Thousands of ETH between FTX and Bald- Bald deployer was first voter on all sushi proposals- Bald deployer tweets same sentence structure as SBF- Bald deployer was biggest DYDX farmer- Bald deployer DYDX posts sound like SBF- Bald deployer DYDX posts sound like SBF- Onchain activity times line up with court dates/bail- We know SBF was doing stuff through VPN recently- Ties with Alameda as well as FTX- Official project serum account on twitter changed name to @0xLukaeth and was shilling $bald - Bald deployer linked through binance to UST depegger that helped collapse $LUNAhttps://twitter.com/hype_eth/status/1686126115947941890?t=8rxskLsjNQdiL25_sNCBOw&s=35",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}