{
  "id": "topic_5443670",
  "title": "Alphakilo",
  "author": "Alphakilo",
  "created_time": "March 06, 2023, 07:24:25 AM",
  "content": "Who else has noticed that although the CBN Naira redesign policy has a lot of downsides, there is an upside for business people which I have in the past couple of weeks observed. This CBN Naira redesign policy has made most people to go cashless and we are slowly entering the cashless economy.  Financial institutions like OPAY, Moniepoint, Smartcash, Palmpay, has seen an increase in their users who are using their services. Especially OPAY because you trust that immediately you make a cash transfer, it takes less than 10 minutes for the recipient to receive it. When last did you pay with cash for an item(s) you bought from the corner shop or mall in your vicinity?Now, my observation is that you tend to buy more when doing a cashless transaction than when paying with cash. For example since you can't just make a transfer of N200 for a bag of sachet water only, you may buy 5 bags and pay N1000 instead or you may even add some other items to your list. What this translates to is that more traders, and business people are making more sales, more profit, and seeing an increase in their revenue.Who else has noticed this. I would love to hear how it is in your area.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5443670",
  "comments": [
    {
      "author": "Davidvictorson",
      "created_time": "March 06, 2023, 02:14:54 PM",
      "body": "Yes, the naira redesign has encouraged bulk buying from consumers. Naturally, it is what is expected as most sellers would rather prefer that the consumer pays for 1 mudu of garri(N800) than two cups(N200) via bank transfer. Logically, the consumer without cash would prefer the first option because of the bank charges that every transfer attracts. While some Nigerians believe that POS merchants are the one cashing out this period, they are not. The real guys are the traders who accepts transfer because even some of them would ask that the buyer adds an extra N50 to the cash for transfer. According to them, it is the POS charge.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "royalfestus",
      "created_time": "March 06, 2023, 02:22:51 PM",
      "body": "we already have enough thread for the same topic on the forum. Lets try to search for topic before we start one. 1. https://bitcointalk.org/index.php?topic=5437204.02. https://bitcointalk.org/index.php?topic=5439067.03. https://bitcointalk.org/index.php?topic=5399596.04. https://bitcointalk.org/index.php?topic=5422967.05. https://bitcointalk.org/index.php?topic=5437477.0 New members should learn to search the forum",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}