{
  "id": "topic_5444804",
  "title": "Mr.corol",
  "author": "Mr.corol",
  "created_time": "March 14, 2023, 04:24:34 AMLast edit: March 14, 2023, 05:35:07 AM by Mr.corol",
  "content": "I bought a $14.55 bitcoin a few days ago when it was at 22k. Again Bitcoin came to 19k. However, I did not sell bitcoins. I was convinced that the price of Bitcoin would rise again. I buy $50 worth of bitcoins again. Got some profit on this small investment. Looking at Bitcoin 24k today. I will keep it for a long time and will not sell it now. I think at some point bitcoin will pump a lotSince I can't invest more dollars, I don't have that much money. Still will invest as much as possible.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5444804",
  "comments": [
    {
      "author": "paid2",
      "created_time": "March 14, 2023, 04:27:24 AM",
      "body": "Quote from: Mr.corol on March 14, 2023, 04:24:34 AMI bought a $14.55 bitcoin a few days ago when it was at 22k. Again Bitcoin came to 19k. However, I did not sell bitcoins. I was convinced that the price of Bitcoin would rise again. I buy $50 worth of bitcoins again. Got some profit on this small investment. Looking at Bitcoin 24k today. Since I can't invest more dollars, I don't have that much money. Still will invest as much as possible.Keep it up, DCA and hold until next ATH if you can !",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cuenta Alternativa",
      "created_time": "March 14, 2023, 05:05:59 AM",
      "body": "Quote from: Mr.corol on March 14, 2023, 04:24:34 AM Got some profit on this small investment.Have you sold? If you haven't, that actually is not a profit, it's called unrealised profit.Quote from: Mr.corol on March 14, 2023, 04:24:34 AMI bought a $14.55 bitcoin a few days ago when it was at 22k. Again Bitcoin came to 19k. However, I did not sell bitcoins. I was convinced that the price of Bitcoin would rise again. I buy $50 worth of bitcoins again. Sounds like you are short of money. I hope you're not using money to buy bitcoin that you might need to eat. As long as you're doing it with money you won't need in a few years, keep buying small amounts regularly, it's called DCA, as iwantmyhomepaidwithbtc2 says.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Tytanowy Janusz",
      "created_time": "March 14, 2023, 08:30:45 AM",
      "body": "Witch such small investment, even if bitcoin will go x5 to new ATH ... its still like 250$ profit in like 2-3 years. Wouldn't it be better to spend those 50$ on books/courses to get new skills that will allow you to earn more and come back with that extra money? I mean like, if you have only 50$ ... i don't know if bitcoins is the best place to put them. The timing is good, bitcoin is cheap right now, but you won't make much.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "livingfree",
      "created_time": "March 14, 2023, 08:39:56 AM",
      "body": "Just keep on doing it. You're even greater than the others that only speak that they'll buy bitcoin but never did anything. The initiative that you've made is a great move and if you continue on doing that, you'll eventually see why we're talking about buying bitcoin and holding it.The downside of it might hurt you when the market isn't that good but that's part of the game and it'll teach you how to be patient at most times because that's what an investor should be.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fuguebtc",
      "created_time": "March 14, 2023, 08:44:10 AM",
      "body": "Quote from: Tytanowy Janusz on March 14, 2023, 08:30:45 AMWitch such small investment, even if bitcoin will go x5 to new ATH ... its still like 250$ profit in like 2-3 years. Wouldn't it be better to spend those 50$ on books/courses to get new skills that will allow you to earn more and come back with that extra money? I mean like, if you have only 50$ ... i don't know if bitcoins is the best place to put them. The timing is good, bitcoin is cheap right now, but you won't make much.Do you have any better suggestions for him? A get rich quick tool. It may be a very small amount to many people, but sometimes it means a lot to many people. I know what you said didn't mean to offend him, but you will probably disappoint him because he is DCAing every time he has money, he never said he would stop with a $50 investment in bitcoin. For someone who doesn't have a lot of money, but if they work hard to accumulate it for a few years and when bitcoin increases in price, it becomes a decent amount.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Supianto",
      "created_time": "March 14, 2023, 08:51:38 AM",
      "body": "Congrats. keep it that way, even $20 in a month can make a big difference in the future. I was starting almost the same way and I can't say I spend much more on it now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Tytanowy Janusz",
      "created_time": "March 14, 2023, 08:55:21 AM",
      "body": "Quote from: fuguebtc on March 14, 2023, 08:44:10 AMDo you have any better suggestions for him? A get rich quick tool. It may be a very small amount to many people, but sometimes it means a lot to many people. Its not a \"get rich quick tool\" i was talking about. I was talking about finding another source of income (online freelancing something like fiverr.com) or improve skill by making a forklift course, excavator course, welding course, english school (if he is not english native speaker). something that will help him get better job and safe 100$ monthly instead of 20$. That way after a year of DCA he will have 1200$ invested instead of 240$. If BTC will pump 5x its 6k$ profit instead of 1200$. I can't give an exact answer because I don't know where he lives, what he does, how old he is, and what his abilities are.Or even get more active here on forum and get a signature campaing that pays 50$ weekly.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Adbitco",
      "created_time": "March 14, 2023, 09:11:49 AM",
      "body": "Actually what you did was purely scalping, and I do encourage that even i myself does it several times to keep my financially balance. Whenever you noticed your not confident with the market anymore you could keep holding for awhile before entering again, you chosen the right part whenever the market seems to be little dip then you fill up your bags again by so doing your bitcoin volume keeps increasing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CageMabok",
      "created_time": "March 14, 2023, 09:21:23 AM",
      "body": "Quote from: Mr.corol on March 14, 2023, 04:24:34 AMI bought a $14.55 bitcoin a few days ago when it was at 22k. Again Bitcoin came to 19k. However, I did not sell bitcoins. I was convinced that the price of Bitcoin would rise again. I buy $50 worth of bitcoins again. Got some profit on this small investment. Looking at Bitcoin 24k today. I will keep it for a long time and will not sell it now. I think at some point bitcoin will pump a lotSince I can't invest more dollars, I don't have that much money. Still will invest as much as possible.You have already made a profit with your short term investment and if you are still optimistic about your long term investment in Bitcoin, maybe you will get bigger profit than now. With the condition that you still have to continue buying when you have money or when a correction occurs, and you don't need to force yourself to do this because you can do it according to what you have.Because that kind of thing would be much better than you keep forcing yourself to invest but you have to refrain from buying every other important need in life. Even if you invest it is to achieve a better future through the profits you get later.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "March 14, 2023, 09:23:44 AM",
      "body": "Quote from: Mr.corol on March 14, 2023, 04:24:34 AMSince I can't invest more dollars, I don't have that much money. Still will invest as much as possible.Then your only choice is to try your best to increase your income by creating more income streams — regardless if you're investing in bitcoin or not. It's still uncertain if the current market is going bullish or not, so you probably have ample amounts of time to earn money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bobrox",
      "created_time": "March 14, 2023, 10:29:25 AM",
      "body": "High investment get high return later and small investment fund will get small return or profit, there are no doubt with many trader want to invest much money in cryptocurrency because they want to earn much profit later. But not fault when starting small fund for investing in Bitcoin and seems $14 not enough in the right moment earn much profit later although Bitcoin back to the all time high price.Better use $14 to invest with altcoin still have lower price and when up 5x potential earn more than $60 than Bitcoin needed longer time reach higher price again, but first investment is not wrong just not have bigger expected with small fund investment hope could reach above $1,000 more several years later.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "KaliLinux",
      "created_time": "March 14, 2023, 10:33:10 AM",
      "body": "Quote from: Mr.corol on March 14, 2023, 04:24:34 AM I think at some point bitcoin will pump a lotIt shouldn't be a question of thinking that Bitcoin will pump a lot at some point but when will be the next bull market circle. History has proven this for Bitcoin and that is why I would buy Bitcoin at any point I have the funds, especially during bear markets periods like this. The price might fall after you bought and if you still have spare investment funds, buy some more at the end of the bear market or even a small relief rally, you would have made some profits from some of your buys as you have noticed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "michellee",
      "created_time": "March 14, 2023, 11:20:24 AM",
      "body": "You did the right thing by not selling your bitcoins when they reached $19k and could have bought more. Indeed, that's what we have to do if we want to invest in bitcoin and don't panic if the price drops again because it's only temporary. We should consider adding more bitcoins so that the profits we will get later will be even greater.Continue what you have been doing @OP, keep holding your bitcoins until the price reaches the highest price again, and sell your bitcoins at the highest price to get maximum profit. And you still have plenty of time to buy bitcoins because the price isn't going to increase that fast yet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lorence.xD",
      "created_time": "March 14, 2023, 12:00:47 PM",
      "body": "Quote from: Mr.corol on March 14, 2023, 04:24:34 AMI bought a $14.55 bitcoin a few days ago when it was at 22k. Again Bitcoin came to 19k. However, I did not sell bitcoins. I was convinced that the price of Bitcoin would rise again. I buy $50 worth of bitcoins again. Got some profit on this small investment. Looking at Bitcoin 24k today. I will keep it for a long time and will not sell it now. I think at some point bitcoin will pump a lotSince I can't invest more dollars, I don't have that much money. Still will invest as much as possible.Starting from a small amount is also a good investment. If you're gonna invest in a long term, I hope you're not using your savings that you might need. It's a good moveto invest in bitcoin but always remember that \"invest what you can afford to loss\"  because the volatile situation of bitcoin your investment might gone in a second and it's notguaranteed that you will always profit here in bitcoin. I suggest you to 50/50 if you really want to invest so incase you need money you have savings. Good luck in your journey!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "arwin100",
      "created_time": "March 14, 2023, 12:15:21 PM",
      "body": "Quote from: Mr.corol on March 14, 2023, 04:24:34 AMI bought a $14.55 bitcoin a few days ago when it was at 22k. Again Bitcoin came to 19k. However, I did not sell bitcoins. I was convinced that the price of Bitcoin would rise again. I buy $50 worth of bitcoins again. Got some profit on this small investment. Looking at Bitcoin 24k today. I will keep it for a long time and will not sell it now. I think at some point bitcoin will pump a lotSince I can't invest more dollars, I don't have that much money. Still will invest as much as possible.Bad idea to hold such small amount of money for long time period because the profit you can get with such amount is so small even if bitcoin pump then reach for new ATH. If you really want to see some good profit with those amount better start trading it and sell when you are in profit(day trades) since from this you may have a chance to make your balance grow more. If you let its sleep for long time you might realize that waiting for pump is not really worth it for you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "speedy963",
      "created_time": "March 14, 2023, 12:53:05 PM",
      "body": "I recommend that it's best to buy more whenever you have extra money. This isn't financial advice but only a suggestion. Based on the interviews from veteran investors, what gives them more profit is by buying and holding or buy to to store it as savings coz overtime what you bought whatever the market price is, in the end if the price moves up, you already profited from your purchase, either it will rise or fall you will still gain even a small percentage as your profit.It'a also best to learn more about the market while you are storing your purchase. Some will advise you to do different kinds of trading, but whichever you will choose what's important is that you earn. In the process of learning the market for sure you will encounter more opportunities for you to buy more for your investments.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dickiy",
      "created_time": "March 14, 2023, 01:48:22 PM",
      "body": "Quote from: Mr.corol on March 14, 2023, 04:24:34 AMI bought a $14.55 bitcoin a few days ago when it was at 22k. Again Bitcoin came to 19k. However, I did not sell bitcoins. I was convinced that the price of Bitcoin would rise again. I buy $50 worth of bitcoins again. Got some profit on this small investment. Looking at Bitcoin 24k today. I will keep it for a long time and will not sell it now. I think at some point bitcoin will pump a lotSince I can't invest more dollars, I don't have that much money. Still will invest as much as possible.That's a good goal sir, but you don't have FOMO will increase so you give up your money for the next investment. You must have sound financial management in investing, you must prioritize the basic needs of your life and your family so that your investment will be calmer if all your basic needs are met.It's okay with small value to buy bitcoin it's a good step and I really appreciate it, especially if you make the next purchase with DCA strategy (scaled purchase of the same amount) you will get a lot of bitcoin if you do it consistently and DCA also reduces mental attacks when bitcoin is down, I highly recommend that you do that strategy, especially if you are new to investing in bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bananington",
      "created_time": "March 14, 2023, 01:57:38 PM",
      "body": "Quote from: Mr.corol on March 14, 2023, 04:24:34 AM I think at some point bitcoin will pump a lotIt is expected that bitcoin pump is coming, but I already hear you talking of profit on the small amount of bitcoins that you have purchased. No matter how bitcoin pumps, that small money you have invested will not turn into millions. People that will enjoy massive benefits in the form of profit when bitcoin pumps are those who have invested more than what you can call small. You invested little and happy about the profit, Imagine how happier you will be if you somehow found a way to invest more. Make it your assignment to seek new ways to get free money to invest in bitcoins, you can do it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mr.right85",
      "created_time": "March 14, 2023, 02:08:02 PM",
      "body": "Quote from: Mr.corol on March 14, 2023, 04:24:34 AMI bought a $14.55 bitcoin a few days ago when it was at 22k. Again Bitcoin came to 19k. However, I did not sell bitcoins. I was convinced that the price of Bitcoin would rise again. I buy $50 worth of bitcoins again. Got some profit on this small investment. Looking at Bitcoin 24k today. I will keep it for a long time and will not sell it now. I think at some point bitcoin will pump a lotSince I can't invest more dollars, I don't have that much money. Still will invest as much as possible.It's not something put of the ordinary that the market will always dp and pump. All you need when it comes to bitcoin investment when it comes to holding is just the patience to hold for a long time. You don't have to sell just because your scared based on the FUD that is being past around. FUD have been around as much as bitcoin have been around but still, the coin still pumps when the time comes.You saying you don't have funds to buy, might be immediate but still, you could always buy, just as you topped up your portfolio of $14.55 with a $50 investment. Just try to have other streams of income to divert your focus from your holding and you don't have to ne looking at the charts often.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}