{
  "id": "topic_5454532",
  "title": "mvdheuvel1983",
  "author": "mvdheuvel1983",
  "created_time": "May 30, 2023, 03:53:35 PM",
  "content": "If you have been full-time into trading for one to three years, what has been the greatest sacrifice you've made to become a successful trader? And did it pay off? Someone I know who a seven-figure trader is now made the sacrifice of moving into a shared apartment with a friend just to save money. Another person, who had previously started a logistics company, sold off his trucks and used the money for trading. Another person had to pay to be mentored. He did this because the mentor said people do not appreciate free things, and if he were not making the sacrifice of paying out of pocket, he probably would not be serious and would take it for granted. These people cited in here went on to become successful traders. It paid off.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5454532",
  "comments": [
    {
      "author": "Oshosondy",
      "created_time": "May 30, 2023, 04:01:06 PM",
      "body": "Quote from: mvdheuvel1983 on May 30, 2023, 03:53:35 PMIf you have been full-time into trading for one to three years, what has been the greatest sacrifice you've made to become a successful trader? And did it pay off? I have no sacrifice to make than to reduce the time I am using to trade, to reduce the leverage that I am using and to be very patient and discipline myself. Quote from: mvdheuvel1983 on May 30, 2023, 03:53:35 PMSomeone I know who a seven-figure trader is now made the sacrifice of moving into a shared apartment with a friend just to save money.Save money for what? If he is a good trader, he will not do that, he can even prefer to rent a better apartment if trading is profitable for him.Quote from: mvdheuvel1983 on May 30, 2023, 03:53:35 PMAnother person, who had previously started a logistics company, sold off his trucks and used the money for trading.Are you serious? That is bad. Trading is not very easy like some people think it is. Some people will even be gambling with it and think they are trading and later lose.If you want to trade, do not let it disturb your work. Do not sell your belongings because of trading too. Trading is risky.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "irhact",
      "created_time": "May 30, 2023, 04:14:30 PM",
      "body": "Quote from: mvdheuvel1983 on May 30, 2023, 03:53:35 PMIf you have been full-time into trading for one to three years, what has been the greatest sacrifice you've made to become a successful trader? And did it pay off? I haven't been a full time trader for three years but for the short time I was fully into trading I did some things to increase my capital. I started small so I compounded by profits so I can put those profits back into my trades. Having to sacrifice this profits made my capital to increase and gives me more opportunities to make better profits which helped me to stop trading full time.Some newbies that starts trading make the mistakes of spending their profits on unnecessary things since when individual make money immediately they begin spending more, they might decide to live a more expensive life so it looks like they have made it to their friends.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Doan9269",
      "created_time": "May 30, 2023, 05:00:06 PM",
      "body": "Quote from: mvdheuvel1983 on May 30, 2023, 03:53:35 PMIf you have been full-time into trading for one to three years, what has been the greatest sacrifice you've made to become a successful trader? And did it pay off? What more sacrifice is ot required of me than giving the best of my abilities to the trades i made, which is my number one priority and security, spend the night althrough on the weekly candles speculating, busy with my charts and always on the screen of my computer system, isn't this all a sacrifice enough to ensure am having the best of experience in trading, the profits i also gain or realized through this are good enough to serve as results i can say really paid off for me in trading bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "May 30, 2023, 05:28:03 PM",
      "body": "Not a daytrade, but a mid-long term one. Noticed how Axie Infinity(that NFT game that got overhyped) was skyrocketing in terms of playerbase by a crap ton while it wasn't reflecting on the token price(AXS, not SLP). Went in with like 90% of my total crypto portfolio. Earned a good amount of money, to say the least.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Findingnemo",
      "created_time": "May 30, 2023, 05:46:08 PM",
      "body": "I would like to point out the one important phase that every full time trader is going through which is turning into anti social, because the nature of job is just sit and do analysis and make your money it also applies to all kinds of full time trades but it's more visible in cryptocurrency because personally my lifestyle changed but not to any extreme still I can feel the difference which I will say definitely a sacrifice. Because more we become anti social then there 8s high chance of getting stress, anxiety and others so if someone doing it as full time job then never forget to take an off day.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "May 30, 2023, 06:06:36 PM",
      "body": "Quote from: Findingnemo on May 30, 2023, 05:46:08 PMI would like to point out the one important phase that every full time trader is going through which is turning into anti social, because the nature of job is just sit and do analysis and make your money it also applies to all kinds of full time trades but it's more visible in cryptocurrency because personally my lifestyle changed but not to any extreme still I can feel the difference which I will say definitely a sacrifice. Because more we become anti social then there 8s high chance of getting stress, anxiety and others so if someone doing it as full time job then never forget to take an off day.Fun fact: you can be a trader and still have a mentally-healthy lifestyle. I pretty much trade for a living but still have healthy relationships through my SO, family, and friends. Especially that I do get burned out easily by looking at my screen all day, I frequently go out at night.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Faisal2202",
      "created_time": "May 30, 2023, 07:07:53 PM",
      "body": "Quote from: mvdheuvel1983 on May 30, 2023, 03:53:35 PMIf you have been full-time into trading for one to three years, what has been the greatest sacrifice you've made to become a successful trader? And did it pay off? Leaving the trading is the most significant sacrifice i have made in my journey. I step into trading with no knowledge, i merely understand technical analysis and i had no grip on fundamental analysis too. So, in frustration of losing money (which i had it all like i was trading with money which if gone, then i could be broke) i left trading back in a year and focused on earning it by providing my skills and services and i am happy on that decision that i found some ways.To be very honest, my reply might not be in accordance with your question's context but i think it is. As, sacrifice is necessary, for example back then i was involved in future trading but due to some religious beliefs i can not perform future trading so i moved to spot trading but it needs a huge capital so after realizing this fact i left it too. Quote from: Findingnemo on May 30, 2023, 05:46:08 PMI would like to point out the one important phase that every full time trader is going through which is turning into anti social, because the nature of job is just sit and do analysis and make your money it also applies to all kinds of full time trades but it's more visible in cryptocurrency because personally my lifestyle changed but not to any extreme still I can feel the difference which I will say definitely a sacrifice. Because more we become anti social then there 8s high chance of getting stress, anxiety and others so if someone doing it as full time job then never forget to take an off day.You have pointed out a great sacrifice because observing the market even when you are at a family gathering, or at a picnic, or at any function i.e marriage, etc. you have to keep checking the phone and have to remain prepared to take action according to the market changes which no doubt changes every trader's lifestyle. But at the other hand, i have seen few people in my friend and university zone have managed to schedule or live their life in such a way that no one can assume them to be a trader. Like in 2022, i was at a university campaign and i had to go village to village and i was an early learner at that time so, during the campaign i took small entries and spent most of my time on watching the market even though i can't understand what it means and what impact does it make but still, i was reading any news comes in front of me. In my group there was another trader of which i knew not as if he acted like one then i might predict at least of him a trader but in 2023 i came to know that he is a pro trader as he started some classes related to trading. And then i embarrassed myself too like i was acting it like a pro thing in front of an expert trader while i have no expertise. (haha) well from then i manage to understand that live a life that no one can predict you as a trader.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitcoin_Arena",
      "created_time": "May 30, 2023, 07:23:12 PM",
      "body": "No all such \"sacrifices\" pay off though especially that part of selling off property or trucks in order to trade.I do have a friend who sold off his good business to get into crypto trading just because he was convinced by a friend that he can make a shit ton of money. Unfortunately he went all in on Terra Luna shortly before the crash and kept the coins in an external wallet. I think you guess is as good as mine on what happened next. Stressed and depressed, his life has never been the same again.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ShowOff",
      "created_time": "May 30, 2023, 07:55:29 PM",
      "body": "Quote from: mvdheuvel1983 on May 30, 2023, 03:53:35 PMIf you have been full-time into trading for one to three years, what has been the greatest sacrifice you've made to become a successful trader? And did it pay off?Besides time and money, what else do you think?My losses on trades sometimes don't pay off immediately in the trade itself, but tend to be paid off by my investment. This is a fact that I feel so far even though in fact I also make profits in trading. My days don't trade much so that in the end, I tend to focus on investing instead of a short-term return plan.Quote from: mvdheuvel1983 on May 30, 2023, 03:53:35 PMSomeone I know who a seven-figure trader is now made the sacrifice of moving into a shared apartment with a friend just to save money. Another person, who had previously started a logistics company, sold off his trucks and used the money for trading. Another person had to pay to be mentored. He did this because the mentor said people do not appreciate free things, and if he were not making the sacrifice of paying out of pocket, he probably would not be serious and would take it for granted. These people cited in here went on to become successful traders. It paid off.No, I will not sell anything to trade crypto including cars, houses or anything else that has value. I'm trading from my saved budget within a certain limit, so it's not too risky for me in case I don't manage to get a return. Obviously there are a lot of risks to consider, so selling anything to trade is not the best recommendation in my opinion.I would imagine, what if they don't succeed and all of their trading budgets are lost due to price volatility or something else?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dr.Bitcoin_Strange",
      "created_time": "May 30, 2023, 09:18:39 PM",
      "body": "The sacrifice I have really made for trading is the time I have devoted to learning both online and offline. I downloaded quite a lot of videos on YouTube to minimize my data usage when I wanted to watch them, and I spent sleepless nights watching those videos and practicing trading terms. The worst of all is not knowing how to study the forming candle or price chart. I was seriously engaged then on a daily basis, and my only free time was at night, so I used those nights to learn about trading, but all the time and effort I exerted then into trading never paid off to half of my stress, but although I just thank God for those things, at least I am not a newbie, so even if I want to start trading again, which I am considering, I wouldn't find some things so very difficult like a real beginner.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mahanton",
      "created_time": "May 30, 2023, 09:51:35 PM",
      "body": "Quote from: mvdheuvel1983 on May 30, 2023, 03:53:35 PMIf you have been full-time into trading for one to three years, what has been the greatest sacrifice you've made to become a successful trader? And did it pay off? Someone I know who a seven-figure trader is now made the sacrifice of moving into a shared apartment with a friend just to save money. Another person, who had previously started a logistics company, sold off his trucks and used the money for trading. Another person had to pay to be mentored. He did this because the mentor said people do not appreciate free things, and if he were not making the sacrifice of paying out of pocket, he probably would not be serious and would take it for granted. These people cited in here went on to become successful traders. It paid off.Trading couldnt really be giving out an assurance that it would be something that will really be your main source of income but its true that there are people who are really able to achieve this kind of point or certaincondition on which they are really that sustainable and able to survive this unpredictable and very volatile market. If we do speak about the chances or how many full time traders then no one really knows but for sure they are really those individuals who do really make a living out of these market movements. Even myself do consider out an old time trader but im not really that still confident on making it as a full time thing.I couldnt really be that too confident on leaving my day job for trading but i do find myself on making profits at least but there are really moments or really those days on which i do really experience up some losses which im not really that much confident on making up some decision. Of course there would really be those sacrifices on which a certain trader would have done before they do get into that point.It would really be t hat situational.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lalabotax",
      "created_time": "May 30, 2023, 09:57:18 PM",
      "body": "Quote from: mvdheuvel1983 on May 30, 2023, 03:53:35 PMIf you have been full-time into trading for one to three years, what has been the greatest sacrifice you've made to become a successful trader? And did it pay off? Honestly, None of them.In the past, I often thought that after getting profits several times with the trading strategy that I applied, I thought it was the most suitable and good trading strategy, but after that, it didn't work anymore. And so on. Maybe it's not the trading strategy's fault, but rather how I manage it to be more consistent in getting profits. On the other hand, the trading strategy should also be successful in all kinds of markets, both ups and downs, and even in uncertain market conditions. By doing a few tricks so that the trading strategy can still run well. But unfortunately, for me, who really lacked the ability to teach and didn't want to learn more, this didn't work, and even went further than what was said to be successful. ha ha ha",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Eternad",
      "created_time": "May 30, 2023, 10:03:44 PM",
      "body": "Quote from: mvdheuvel1983 on May 30, 2023, 03:53:35 PMIf you have been full-time into trading for one to three years, what has been the greatest sacrifice you've made to become a successful trader? And did it pay off? Someone I know who a seven-figure trader is now made the sacrifice of moving into a shared apartment with a friend just to save money. Another person, who had previously started a logistics company, sold off his trucks and used the money for trading. Another person had to pay to be mentored. He did this because the mentor said people do not appreciate free things, and if he were not making the sacrifice of paying out of pocket, he probably would not be serious and would take it for granted. These people cited in here went on to become successful traders. It paid off.Sacrificing something just to make you anle trade is a bit questionable act because trasing especially crypto involved a lot of risk due to the crypto volatility. I can’t picture out how the guy that owns a logistic company sold his truck for trading while it's the main tool for his business running. Why not use some part of his company profit on trading rather than selling valuable asset just to put the money on risky investment.I will understand if the sacrifice involves savings from cutting expenses but selling valuable asset that provides profit is an ass way of getting more losses since that person will chase profit just to recover immediately his loss on selling his property that generates income.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jeraldskie11",
      "created_time": "May 30, 2023, 10:49:44 PM",
      "body": "I gave up my job and my education for Bitcoin at the time. I did it because I saw that bitcoin trading has the ability to make you wealthy. I joined the mentorship program because I wanted to be successful in trading, but it didn't work in my first attempt, so I stopped to relieve stress. And after a few months, I returned to trading and joined another mentorship program, since I believe that trading is the best method to get wealthy in the future, as opposed to working for someone else and not being able to do what you want. Fortunately, I learned a lot and am gradually progressing and recouping my trading losses.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sheenshane",
      "created_time": "May 30, 2023, 10:59:47 PM",
      "body": "Quote from: mvdheuvel1983 on May 30, 2023, 03:53:35 PMIf you have been full-time into trading for one to three years, what has been the greatest sacrifice you've made to become a successful trader? And did it pay off? I didn't experience this because I didn't push my trading activity but instead, I'd go for investing for long-term purposes. I didn't also see someone get successful in trading, usually, they've encountered many losses and difficulties in trading, and the reason no one gets successful. Selling off assets like trucks, houses, or more worst land to fund trading can be a risky decision but may provide the necessary capital to start or expand a trading venture.  It shows a willingness to take calculated risks and prioritize trading over other endeavors.That's the real sacrifice which I think is not good to hear.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "noorman0",
      "created_time": "May 31, 2023, 03:25:15 AM",
      "body": "Quote from: mvdheuvel1983 on May 30, 2023, 03:53:35 PM-snip-Someone I know who a seven-figure trader is now made the sacrifice of moving into a shared apartment with a friend just to save money. Another person, who had previously started a logistics company, sold off his trucks and used the money for trading. Another person had to pay to be mentored.Trading is probability, there is no guarantee that no matter how much money you sacrifice, you will reap good returns. Indeed there are some people who will study seriously if they get a personal mentor (paid), but it comes back to one's ability to develop themselves. There are some successful traders who in fact only get free trading courses from the internet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kapalmabur",
      "created_time": "May 31, 2023, 04:45:25 AM",
      "body": "Quote from: noorman0 on May 31, 2023, 03:25:15 AMQuote from: mvdheuvel1983 on May 30, 2023, 03:53:35 PM-snip-Someone I know who a seven-figure trader is now made the sacrifice of moving into a shared apartment with a friend just to save money. Another person, who had previously started a logistics company, sold off his trucks and used the money for trading. Another person had to pay to be mentored.Trading is probability, there is no guarantee that no matter how much money you sacrifice, you will reap good returns. Indeed there are some people who will study seriously if they get a personal mentor (paid), but it comes back to one's ability to develop themselves. There are some successful traders who in fact only get free trading courses from the internet.That's right, because if there were guarantees, of course there would have been many merchants who had become rich,and in reality it doesn't happen so every trader needs to learn because knowledge and skills will help in trading,besides that there is still a lot for us to learn and still enjoy the process.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LogitechMouse",
      "created_time": "May 31, 2023, 06:13:32 AM",
      "body": "Hmmm, None .I don't need to sell other things that I have just to have money to trade. I don't want to risk it, sell those important things that I obviously need for something that is very risky, has a high chance of losing money especially if you don't know what you are doing, and has a potential to change your life negatively. I prefer a lesser stressful route, and that is to focus on building a base for the long term thru long term investing. I'm purely investing on long term coins. I know that there are some people out there who can sacrifice what they have for trading. Some of them went on to become successful traders like the one OP has shared to us, while there are some who sacrificed whatever they need to sacrifice, sold all of their belongings only to end up losing money which is quite unfortunate for them.Well, I guess I'm lucky that I didn't quit my job for trading because I would be doomed if I did that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Stable090",
      "created_time": "May 31, 2023, 06:30:26 AM",
      "body": "Quote from: mvdheuvel1983 on May 30, 2023, 03:53:35 PMIf you have been full-time into trading for one to three years, what has been the greatest sacrifice you've made to become a successful trader? And did it pay off? I haven’t made any serious sacrifices just because I want to trade, the only sacrifice I can say I made is reducing the way I spend so that I will be able to accumulate enough money to trade with some and to use some to accumulate bitcoin for future purpose, that’s the only sacrifice I can say I make so that I will be able to trade. Quote from: mvdheuvel1983 on May 30, 2023, 03:53:35 PMSomeone I know who a seven-figure trader is now made the sacrifice of moving into a shared apartment with a friend just to save money. Another person, who had previously started a logistics company, sold off his trucks and used the money for trading. Another person had to pay to be mentored. He did this because the mentor said people do not appreciate free things, and if he were not making the sacrifice of paying out of pocket, he probably would not be serious and would take it for granted. These people cited in here went on to become successful traders. It paid off.Because we want to trade those not mean we should sell properties, am not always in support of selling properties just because you want to start trading, the best thing I do encourage people to do is to trade with any amount they can afford to lose. If you sell your house because you want to trade, if the trade goes against you and you lose money, then you will have to become homeless, I don’t really think any professional trader will encourage anyone to sell their properties because they want to trade. The best thing we can do is to increase the way you work so that your income can increase and you will be able to save money and start trading, but I don’t support selling of properties.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}