{
  "id": "topic_5470105",
  "title": "Question:",
  "author": "BitcoinBarrel",
  "created_time": "October 12, 2023, 04:59:02 PM",
  "content": "There are 1000's of Alternative Crypto-Currencies out there, but which one do you actually use?Post your favorite Altcoin below and tell us why you think so.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5470105",
  "comments": [
    {
      "author": "Wiwo",
      "created_time": "October 12, 2023, 05:08:30 PM",
      "body": "Quote from: BitcoinBarrel on October 12, 2023, 04:59:02 PMThere are 1000's of Alternative Cryptocurrencies out there, but which one do you actually use?Post your favorite Altcoin below and tell us why you think so.Ethereum still remains my favourite altcoin when it comes to long-term investment and the reason is that Ethereum has been following Bitcoin closely in all its market movement and also has done significantly well in terms of development and network. Upgrade that could help the coin to have a long-term potential. Sometimes,  I only choose the altcoin to go for based on my personal conviction and need for such coins,  and coins that fall in that category are low few coins that offer faster transactions and lower fees which make them suitable for sending transactions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "abel1337",
      "created_time": "October 12, 2023, 05:52:09 PM",
      "body": "Quote from: BitcoinBarrel on October 12, 2023, 04:59:02 PMThere are 1000's of Alternative Crypto-Currencies out there, but which one do you actually use?Post your favorite Altcoin below and tell us why you think so.I don't have a favorite ones because they all serve different purposes, I just have a bias on other coins. One of the altcoins that I own and use is Ethereum for gas purposes and BNB for my trading fees on binance when I'm doing my trades. I think it's hard to choose a favorite altcoin today since everyone of them has purpose and of course different potential profit when the bull market comes. Majority of the altcoin where replaceable when someone better had been created, this has been proven many times already as the technology we have are advancing, this is why it's hard to choose a favorite coin, fundamentally.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AbuBhakar",
      "created_time": "October 12, 2023, 05:57:31 PM",
      "body": "Quote from: BitcoinBarrel on October 12, 2023, 04:59:02 PMPost your favorite Altcoin below and tell us why you think so.[/size]BNB(Binance Coin) is my favorite altcoin of all time because it has a lot of utility which I can fully utilize since I’m using Binance exchange frequently. BNB can be use to reduce fee on exchange, to participate on Binance Launchpad, Gas fee on binance smartchaij and many more which other altcoin can’t do since BNB is the only token from exchange with a very successful blockchain network.OP(Optimism) is my second favorite since its very volatile but it’s price has definite low and high boundary which is very profitable if you know how to play it since this altcoin has a very good trading volume and liquidity.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "edmundduke",
      "created_time": "October 12, 2023, 07:04:51 PM",
      "body": "My favourite one has pretty much always been Doge, its the memes and the age. Always felt like a fun little coin even tho its marketcap is giganticUsability wiseTRX - For USDT transfersAVAX - for some NFT memesPolygon - for some gamesETH aswell, but less lately tbh.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Joeyp",
      "created_time": "October 12, 2023, 08:37:45 PM",
      "body": "I like TRON TRX, because transfers are free of charge, up to ~3 per day and very fast - in some minutes.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MAAManda",
      "created_time": "October 13, 2023, 08:57:41 AM",
      "body": "Quote from: BitcoinBarrel on October 12, 2023, 04:59:02 PMThere are 1000's of Alternative Crypto-Currencies out there, but which one do you actually use?Post your favorite Altcoin below and tell us why you think so.I have several altcoins (network native tokens) to use, because each altcoin (network native token) has its own advantages and disadvantages. For example, to send or receive stablecoins (USDT in general), I use Tron (TRC-20 network), for serious DeFi investments I use Ethereum (ERC-20 network), while to connect to several DApps I use Binance Coin (BSC network). I don't think I need to explain the reasons because everyone who has been involved in crypto for a long time already knows about the advantages and disadvantages of each altcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cuongtruna81",
      "created_time": "October 13, 2023, 10:05:02 AM",
      "body": "When it comes to usage, I primarily use BNB and TRX the most. I frequently use these two networks to conduct transactions because their fees are relatively low, and they offer fast transaction speeds.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptoGirl7",
      "created_time": "October 13, 2023, 10:12:50 AM",
      "body": "Litecoin and Bitcoin Cash are my favourite!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "devil-soul",
      "created_time": "October 13, 2023, 10:49:11 AM",
      "body": "Ethereum remains my first choice even if recently it has undergone ups and downs both in terms of value and reliability after the various forks and eips and the transition to staking but in my opinion it remains the best and the most versatile",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Texac",
      "created_time": "October 13, 2023, 10:49:35 AM",
      "body": "Quote from: BitcoinBarrel on October 12, 2023, 04:59:02 PMThere are 1000's of Alternative Crypto-Currencies out there, but which one do you actually use?Post your favorite Altcoin below and tell us why you think so.The altcoin market is extremely risky so placing your trust in them is truly a gamble, but if I had to choose, I would choose ethereum and dogecoin.  Ethereum is considered the queen of altcoins and it is also the coin with the second largest market capitalization after bitcoin, so whoever chooses it, we need not be surprised.  As for dogecoin, I believe many people despise it because they think it is just a farce without any utility and is only hyped by Elon.  but I believe that memecoin will never disappear from the market, not only that it is also an important part of the market used to create hype to attract newbies market participants.  and to be able to maintain the existence of meme projects, we need a king and Doge is the choice.  many people do not believe that Doge can reach 1 USD in the upcoming bull season, but I even believe that it can achieve more than that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "danherbias07",
      "created_time": "October 13, 2023, 12:41:33 PM",
      "body": "Litecoin, I use it for gambling. I just like the way that I am winning like it's Bitcoin (in satoshis), then I feel like I am also lucky using it, and you can actually use it to bet small amounts too. I don't know why but it seems like there are many users of this coin on Stake.com and most winners also tip using these cryptocurrencies. I don't know much about the history of Litecoin but I know that it has been in the industry for a long time so there are no worries about the value suddenly going down while I keep it in my stash. Sadly, there's no P2P in Binance so when I win I send it to the said exchange and then sell it for something else so I can make it cash.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "livingfree",
      "created_time": "October 13, 2023, 12:43:33 PM",
      "body": "For investing, it's Ethereum and I'm still holding a bit of it. While for transfers, I'm mostly using TRX for USDT because it's cheap and faster than the USDT(ERC20). I guess that's the main reason why I am into TRX today and made me use it despite that I don't like it before. Things have changed and use cases are there so that's why I'm on it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Adbitco",
      "created_time": "October 13, 2023, 12:52:25 PM",
      "body": "If not for transaction purposes and less fee tron is the preferred one for quick and convenient to use without any hassle, although ETH still the remains the best altcoin in aspect of investment. It has the tendency to increase and gives you much in returns than the above mentioned altcoin. Then for other coin like LTC well it's mostly used as payment gateway where most of the payment accepts it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "avp2306",
      "created_time": "October 13, 2023, 12:52:38 PM",
      "body": "Quote from: BitcoinBarrel on October 12, 2023, 04:59:02 PMThere are 1000's of Alternative Crypto-Currencies out there, but which one do you actually use?Post your favorite Altcoin below and tell us why you think so.I always love Ethereum knowing that this is the second strongest crypto in the market. Also the same with bitcoin we can use it everywhere since if they put bitcoin accepted as payment on the site Ethereum is also the second alternative option to choose from and there's wide market for it that's why for sure majority prefer to have it.Also in investment perspective I can say that the same with bitcoin it has a huge potential to rise up when bull run came so this is a must have crypto to store for hodl since we will not feel worry about it unlike on those other alts which we don't know if there's some good movement that will happen to it especially if bullish season show up.Second will be the BNB since I like the low fee feature offered by binance that's the reason why I save some so that it can make me save some fees especially when I do trades on their exchange.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bluebit25",
      "created_time": "October 13, 2023, 02:06:03 PM",
      "body": "Before that it was ETH and I think in the future maybe LINK will also be used more often.  For me, there is not much difference in the altcoin category, the top ones will always be known by many people as well as the opportunities they bring during use. But there are some things that people only come back to when there is some hype, or simply a switch back and forth towards altcoins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nrcewker",
      "created_time": "October 13, 2023, 02:21:57 PM",
      "body": "Quote from: BitcoinBarrel on October 12, 2023, 04:59:02 PMThere are 1000's of Alternative Crypto-Currencies out there, but which one do you actually use?Post your favorite Altcoin below and tell us why you think so.Yes there are plenty of coins available in the market. If you ask me my favourite coin other than Bitcoins, then definitely I will say Ethereum and BNB. Not only mine, but also many people’s favourite coins are these. These coins are favourite because their marketcap is high and these are very popular. These coins are very old and are backed up by big companies like Binance backing up BNB. These coins price have also increased significantly from the past, and hence giving us positive future projections. Hence if I have funds, and I have to buy alts, then definitely I will go for these two.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "|MINER|",
      "created_time": "October 13, 2023, 02:55:42 PM",
      "body": "Quote from: Nrcewker on October 13, 2023, 02:21:57 PMYes there are plenty of coins available in the market. If you ask me my favourite coin other than Bitcoins, then definitely I will say Ethereum and BNB. Not only mine, but also many people’s favourite coins are these. These coins are favourite because their marketcap is high and these are very popular. These coins are very old and are backed up by big companies like Binance backing up BNB. These coins price have also increased significantly from the past, and hence giving us positive future projections. Hence if I have funds, and I have to buy alts, then definitely I will go for these two.In this case, I have some similarities with you. I wanna also add two more coins in the line and one's Lite coin and the other one is Polygon(matic). With Ethereum and BNB becoming popular and renowned, I think these two coins are in a pretty good position. If long term investment is to be done in alternative coins after Bitcoin then I will keep these coins in my list. And my main favorite features of these two coins are their low transaction cost on the block chain. Although currently they are having a little down time due to the effect of the crypto market, but I think they can get a good return after bitcoin halving.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ultrloa",
      "created_time": "October 13, 2023, 03:18:59 PM",
      "body": "Quote from: BitcoinBarrel on October 12, 2023, 04:59:02 PMThere are 1000's of Alternative Crypto-Currencies out there, but which one do you actually use?Post your favorite Altcoin below and tell us why you think so.I vote xrp in poll since this is the coin which I usually use when doing some transactions since for me this is fast and more cheaper option, I also like Ethereum since we already know its reputation but I just don't like to use this coin when there's a network congestion issue since the fee's skyrocket and its so painful if we choose to proceed our transaction since it require us to pay huge fees so that we can make our transaction fast since if we put small fees then chances that it will stuck for many hours or even days.Other coins listed on the poll is good but I rarely use them but maybe will consider to have especially that accumulation phase might gonna happen soon since I'm speculating that top coins listed will also have a good pump next year.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitcoinpoly",
      "created_time": "October 13, 2023, 08:04:31 PM",
      "body": "Quote from: BitcoinBarrel on October 12, 2023, 04:59:02 PMThere are 1000's of Alternative Crypto-Currencies out there, but which one do you actually use?Post your favorite Altcoin below and tell us why you think so.My best altcoin is $BGB token My reason for choosing $BGB; in this current year 2023 $BGB token outshine every other platforms token and came out as the best performing platform token with 185%+ increase.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}