{
  "id": "topic_5468972",
  "title": "tech30338",
  "author": "tech30338",
  "created_time": "October 03, 2023, 01:00:06 AM",
  "content": "Marahil pamilyar na tayo sa mga points rewards sa malls, department stores at groceries, at ngaun ang coinsph nman ay nagkaroon ng isang event or pakulo kung saan maari kang kumita ng 5% interest sa iyong hawak na usdc, ang minimum daw na pwede kang kumita or makaearn is 20 USDC at 5% interest sa isang linggo or higit pa, at ito ay matatanggap mo, kung gusto mo naman na maconvert ito sa pera nlang at hindi usdc maari kang magsubmit ng request via support at tatagal nman ang process ng 7days dinNote:Parang staking ang style nila ang approach, although hindi natin alam ang process nila more like a bank style din, kasi for sure pwede nila yan ipahiram or ipagamithttps://bitpinas.com/business/coins-ph-hodl-usdc-earn-rewards/Wei Zhou coinsph CEO gusto pang palawakin ang coins ph napakaaggresive din ng approach alam natin na galing siya binance at alam nya ang diskarte hindi ako magtataka maging malaking exchange din itong coinsph in the future dahil ang move nila ay kumuha ng licenses for crypto so its a matter of time nalangAnung masasabi ninyo sa mga moves neto ng coinsph at management?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5468972",
  "comments": [
    {
      "author": "SFR10",
      "created_time": "October 03, 2023, 06:33:51 PM",
      "body": "Quote from: tech30338 on October 03, 2023, 01:00:06 AMParang staking ang style nila ang approach, although hindi natin alam ang process nila more like a bank style din, kasi for sure pwede nila yan ipahiram or ipagamitTama ka at kahit na sinabi ng global marketing director nila na hindi nila ito gagamitin sa \"investment instruments\", hindi pa rin ako naniniwala dahil saan sila kukuha nung 5% [considering na bawat linggo nila ibibigay yung reward, magiging malaki ito]?Quote from: tech30338 on October 03, 2023, 01:00:06 AMWei Zhou coinsph CEO gusto pang palawakin ang coins ph napakaaggresive din ng approach alam natin na galing siya binance at alam nya ang diskarte hindi ako magtataka maging malaking exchange din itong coinsph in the future dahil ang move nila ay kumuha ng licenses for crypto so its a matter of time nalangAnung masasabi ninyo sa mga moves neto ng coinsph at management?May mixed feelings ako tungkol sa global expansion nila, dahil hindi nila maimanage ng mabuti ang services nila sa Pinas, tapos mageexpand pa sila!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bhadz",
      "created_time": "October 03, 2023, 10:42:04 PM",
      "body": "Nag try ako niyan at kahapon lang nareceive na yung bayad. Parang every Tuesday ang crediting nila sa mga naka hold ng USDC. Hindi nila sinasabing stake, kundi mag hold lang ng USDC sa mga accounts natin. Mababa lang nilagay ko kaya alam ko yung risk na tinetake ko dito. Posible kasi na hindi yan masustain kapag merong sumubok ng $100k na isang bagsakan lang tapos 5% annually pa tapos weekly ang crediting. Parang sa ganito bumagsak yung ibang platform pero kapag makita nilang parang hindi na sustainable baka ibaba nila pakonti konti yung % annually at yung crediting weekly.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}