{
  "id": "topic_5452685",
  "title": "FP91G",
  "author": "FP91G",
  "created_time": "May 14, 2023, 12:38:25 PMLast edit: May 17, 2023, 02:17:53 PM by FP91G",
  "content": "Автор: preturnioОригинальная тема: Project: Preturnio - a full text search engine for BitcoinПривет. Хочу рассказать о проекте Preturnio - текстовой поисковой системой в блокчейне биткоина. С Preturnio вы можете искать текст внутри каждой транзакции OP_RETURN, Coinbase и Ordinal транзакции, начиная с генезис блока. Вы можете попробовать поиск на сайте: https://preturnio.comОбозреватели блокчейна могут искать транзакции, блоки и адреса, но поиск произвольного текста является проблемой. Данные хранятся в блокчейне изначально в шестнадцатеричном формате и нелегко читаются. Preturnio решает эту проблему с помощью простого в использовании интерфейса для поиска. Просто введите текст, который вы ищете, и Preturnio найдет ваши слова, найденные в любой транзакции OP_RETURN, Coinbase или Ordinal. Вы увидите, когда данные были созданы, в каком блоке они были подтверждены и другие важные детали.Вы можете искать что угодно: исходный код, имена, цитаты, токены brc-20 - любой простой текст, который вы можете придумать, вы можете найти в блокчейне с помощью Preturnio. Вы также можете поделиться данными прямой ссылкой или даже изображением для предварительного просмотра. Публикация в Твиттере автоматически создаст Twitter Card.Ordinal поддерживается. Каждая запись может быть предварительно просмотрена в режиме реального времени или во весь экран. Платформа поддерживает все транзакции, закодированные с помощью текстовых типов MIME, и мы разделяем данные на две категории - текстовые и HTML. Вы можете переключиться на просмотр исходного кода с помощью знакомого интерфейса поиска, чтобы найти искомый текст внутри полученных данных. Когда вы делитесь данными, Preturnio попытается включить предварительный просмотр, будь то текст или HTML. После того, как вы нашли нужные данные, вы можете выполнить поиск внутри них с помощью знакомой функции \"Найти\", для поиска конкретного текста.Естественно, каждый результат поиска можно проверить одним щелчком мыши в одном из нескольких общедоступных обозревателей блокчейна, а также в ordinal эксплорерах. Также легко скопировать идентификатор TX для проверки на собственной ноде.Preturnio также сопоставляет все транзакции с опубликованным списком всех известных английских слов (скоро появятся новые языки), чтобы вы могли просматривать отдельные слова, хранящиеся где-то в блокчейне. Это на самом деле очень весело!Посетите https://preturnio.com/docs , чтобы узнать о других поддерживаемых функциях поиска.Обратная связь приветствуется. Спасибо за внимание!",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5452685",
  "comments": []
}