{
  "id": "topic_5523518",
  "title": "_act_",
  "author": "_act_",
  "created_time": "December 19, 2024, 09:09:17 PMLast edit: December 20, 2024, 01:50:58 AM by _act_",
  "content": "Man who falsely claimed to be bitcoin creator sentenced for continuing to sue developersYou all know who I am talking about. He is the most well known Faketoshi. I do not know what happened to Craig Wright for continuing suing bitcoin developers in the cases he has lost all the time. The court has said he is not Satoshi Nakamoto but he still continues to sue bitcoin developers. He has now been sentenced to 12 moths in prison.Quote from: https://www.theguardian.com/technology/2024/dec/19/craig-wright-man-who-falsely-claimed-to-be-bitcoin-creator-sentenced-for-continuing-to-sue-developersOn Thursday Wright was sentenced for five counts of contempt of court. Sentencing him to 12 months in jail, suspended for two years and to pay £145,000 in costs within a fortnight, the court also struck out his enormous claim.Edit:It was a suspended sentence.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5523518",
  "comments": [
    {
      "author": "SmartGold01",
      "created_time": "December 19, 2024, 09:27:05 PM",
      "body": "I see no reason for claiming to be satoshi nakamoto while he is not and he tried the best to make sure that the world believed he is satoshi but on the other hand he failed because his claim werent back up with some facts that he is satoshi or even signed messages from his bitcoin address or make some transactions from his wallet to prove he is Satoshi, then fine, he could have won the battle, but instead fighting a blind battle with no facts to show he is nakamoto. BTW, 12 months is actually very pitiable to him otherwise, country like ours he could be sentence for 6-10 years imprisonment for allegedly claiming what he is not, anyway that place would serve him as a resting place to enable him use his right senses.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Aanuoluwatofunmi",
      "created_time": "December 19, 2024, 09:34:46 PM",
      "body": "Quote from: _act_ on December 19, 2024, 09:09:17 PMMan who falsely claimed to be bitcoin creator sentenced for continuing to sue developersYou all know who I am talking about. He is the most well known Faketoshi. I do not know what happened to Craig Wright for continuing suing bitcoin developers in the cases he has lost all the time. The court has said he is not Satoshi Nakamoto but he still continues to sue bitcoin developers. He has now been sentenced to 12 moths in prison.Quote from: https://www.theguardian.com/technology/2024/dec/19/craig-wright-man-who-falsely-claimed-to-be-bitcoin-creator-sentenced-for-continuing-to-sue-developersOn Thursday Wright was sentenced for five counts of contempt of court. Sentencing him to 12 months in jail, suspended for two years and to pay £145,000 in costs within a fortnight, the court also struck out his enormous claim.Maybe he has his own targets which he thinks he can't afford to leave unaccomplished and not to even talk of accepting a defeat, after knowing that the entire public eyes are set on him like awk spying on a chick from afar, he may also thought that persistent could help in some ways, but this is not what we can use any influence upon, the real and actual fact is that the line has been drawn and also visible for everyone to know why he is not Satoshi, I will say this is best for him.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Odusko",
      "created_time": "December 19, 2024, 09:35:15 PM",
      "body": "Quote from: SmartGold01 on December 19, 2024, 09:27:05 PMI see no reason for claiming to be satoshi nakamoto while he is not and he tried the best to make sure that the world believed he is satoshi but on the other hand he failed because his claim werent back up with some facts that he is satoshi or even signed messages from his bitcoin address or make some transactions from his wallet to prove he is Satoshi, then fine, he could have won the battle, but instead fighting a blind battle with no facts to show he is nakamoto. BTW, 12 months is actually very pitiable to him otherwise, country like ours he could be sentence for 6-10 years imprisonment for allegedly claiming what he is not, anyway that place would serve him as a resting place to enable him use his right senses.Craig Wright is just a lier and just as the article proclaimed him already, reading through the news in the Link you will see how the Media already have a concluded name for Craig Wright, they persistently called him a liar, but the question is why should he be claiming to be Bitcoin creator in the first place and Satoshi is neither a person nor and acronyms.What I can say is that if Craig Wright claims he is Satoshi even though he is not, let him sign a message from the various Satoshi Bitcoin wallets holding the Satoshi Bitcoins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Amphenomenon",
      "created_time": "December 19, 2024, 09:38:06 PM",
      "body": "I think this man doesn't just needs to be jailed and fined, rather just needs a therapist because he is just too delusional after all these years and being officially ruled out as Satoshi Nakamoto, for lying and forgery of his so called claims.I think he has tormented developers enough and I guess if he is done with his jail terms and finally out, he might have learnt his lesson and not sue these dev again, after being warned never to again, when he lost the case of being Satoshi Nakamoto. Although he did continue suing these devs and now facing his punishment. This can be seen in the link shared by Op.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "uchegod-21",
      "created_time": "December 19, 2024, 09:44:34 PM",
      "body": "Quote from: _act_ on December 19, 2024, 09:09:17 PMMan who falsely claimed to be bitcoin creator sentenced for continuing to sue developersYou all know who I am talking about. He is the most well known Faketoshi. I do not know what happened to Craig Wright for continuing suing bitcoin developers in the cases he has lost all the time. The court has said he is not Satoshi Nakamoto but he still continues to sue bitcoin developers. He has now been sentenced to 12 moths in prison.Quote from: https://www.theguardian.com/technology/2024/dec/19/craig-wright-man-who-falsely-claimed-to-be-bitcoin-creator-sentenced-for-continuing-to-sue-developersOn Thursday Wright was sentenced for five counts of contempt of court. Sentencing him to 12 months in jail, suspended for two years and to pay £145,000 in costs within a fortnight, the court also struck out his enormous claim.The court has been so lenient on him. He has reigned for so long that I began to suspect a kind of conspiracy between him and the US government. Sentencing him is a kind of relief to my memory but I suspect that after 12 months CW will continue his frivolous claims. Maybe it is time we accept his behaviour to be part of the industry drama that will ensure for a long period of time (as long as he lives and bitcoin exists).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Orpichukwu",
      "created_time": "December 19, 2024, 10:07:43 PM",
      "body": "Quote from: Amphenomenon on December 19, 2024, 09:38:06 PMI think this man doesn't just needs to be jailed and fined, rather just needs a therapist because he is just too delusional after all these years and being officially ruled out as Satoshi Nakamoto, for lying and forgery of his so called claims.I will say the opposite: he actually does deserve that jail sentence. He will learn and adjust from that place. I'm sure a therapist can't even help him. I don't know what he plans to gain from all this, which he has been doing. Maybe he just has enough finance to be causing those troubles and freedom to do that because anyone who doesn't have enough spare money can't continue to be suing developers over and over again and keep on losing, and yet they don't give up. One year of jail time is enough to set his brain straight.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Amphenomenon",
      "created_time": "December 19, 2024, 10:38:31 PM",
      "body": "Quote from: Orpichukwu on December 19, 2024, 10:07:43 PMQuote from: Amphenomenon on December 19, 2024, 09:38:06 PMI think this man doesn't just needs to be jailed and fined, rather just needs a therapist because he is just too delusional after all these years and being officially ruled out as Satoshi Nakamoto, for lying and forgery of his so called claims.I will say the opposite: he actually does deserve that jail sentence. He will learn and adjust from that place. I'm sure a therapist can't even help him. I don't know what he plans to gain from all this, which he has been doing. You actually misunderstood me, I meant he deserved the jail and the fine but also needs a therapy from being obviously delusional after the truth is now easily known by everyone.Quote from: Orpichukwu on December 19, 2024, 10:07:43 PMMaybe he just has enough finance to be causing those troubles and freedom to do that because anyone who doesn't have enough spare money can't continue to be suing developers over and over again and keep on losing, and yet they don't give up. One year of jail time is enough to set his brain straight.To be frank he is not really as wealthy or even rich as he is acting, this is among the reason they knew he is not Satoshi because he can't even accessed the Satoshi address with a million+ bitcoins. He is far from being consider among the wealthiest bitcoiners.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GeorgeJohn",
      "created_time": "December 19, 2024, 10:42:54 PM",
      "body": "That is what some people desire because someone who is claiming what he does not know about the foundation cannot be able to defend it when it comes in terms of Defense so I believe that many of them who is claiming to become the founder of Bitcoin will not be able to make such utterance openly any longer.. you can see in this community that in so many times many people has claimed to become a satoshi nakamoto which will know quite well that they are not the one so if nobody resist them they will continue to claim that they are satoshi makamoto where is the founder of Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rruchi man",
      "created_time": "December 19, 2024, 11:54:19 PM",
      "body": "Quote from: _act_ on December 19, 2024, 09:09:17 PMMan who falsely claimed to be bitcoin creator sentenced for continuing to sue developersWhy was he claiming and wanting so badly to be who he was not? It can be an offense to waste the courts time; I imagine it will be a bigger offence when it is now done repeatedly. His story, when it becomes popular, will help as a warning to others who are having the idea to want to assume an identity that they are not when they know that they are not.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ale88",
      "created_time": "December 20, 2024, 12:48:12 AM",
      "body": "Quote from: Amphenomenon on December 19, 2024, 09:38:06 PMI think this man doesn't just needs to be jailed and fined, rather just needs a therapist because he is just too delusional after all these years and being officially ruled out as Satoshi Nakamoto, for lying and forgery of his so called claims.I disagree, he would totally deserve some jail time. The only reason he keeps claiming he's Satoshi is to get some kind of personal gain, probably putting pressure on the developers or something like that, so he's trying to jeopardize the whole system for some stupid gain. And he's also playing some dangerous game because Satoshi is a billionaire, if the wrong person believes him, well, not sure how that would end...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "seoincorporation",
      "created_time": "December 20, 2024, 01:16:28 AM",
      "body": "Jail for him, it sounds as a Fair de al, ay least the developers will be able to work without having that pain in the ass...This is a importante lesson for all, here we learn how our acts have a consequence, and the law will get you if you try yo play a smart role without evidencie.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "December 20, 2024, 01:20:45 AM",
      "body": "Quote from: _act_ on December 19, 2024, 09:09:17 PMMan who falsely claimed to be bitcoin creator sentenced for continuing to sue developersYou all know who I am talking about. He is the most well known Faketoshi. I do not know what happened to Craig Wright for continuing suing bitcoin developers in the cases he has lost all the time. The court has said he is not Satoshi Nakamoto but he still continues to sue bitcoin developers. He has now been sentenced to 12 moths in prison.Quote from: https://www.theguardian.com/technology/2024/dec/19/craig-wright-man-who-falsely-claimed-to-be-bitcoin-creator-sentenced-for-continuing-to-sue-developersOn Thursday Wright was sentenced for five counts of contempt of court. Sentencing him to 12 months in jail, suspended for two years and to pay £145,000 in costs within a fortnight, the court also struck out his enormous claim.id love to see him in prison, but he is not going.. he is given basically a warning shot, that if he repeats his offences or does anything criminal in UK jurisdiction, then he would defacto/by default have to serve 12 months in prison automatically plus any extra time added for the further crimeshowever staying out of the UK means he can do crimes elsewhere and it not affect his UK suspended order",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Darker45",
      "created_time": "December 20, 2024, 01:42:32 AM",
      "body": "Quote from: seoincorporation on December 20, 2024, 01:16:28 AMJail for him, it sounds as a Fair de al, ay least the developers will be able to work without having that pain in the ass...This is a importante lesson for all, here we learn how our acts have a consequence, and the law will get you if you try yo play a smart role without evidencie. He's not going to jail. It was a suspended sentence. He won't be spending a day in prison. But, yeah, this decision of the court is indeed a breather to Bitcoin developers. Craig is being childish. He just wants to wreak havoc on the personal lives of people. He probably just wants to make their lives as uncomfortable as possible for not bending a knee to him, for not believing in his lies. Something's seriously wrong with this man's brain. He certainly needs professional intervention. But the court doesn't have time for childish games.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Text",
      "created_time": "December 20, 2024, 01:58:25 AM",
      "body": "Another twist in the bizarre saga of this man. I can't believe he still hasn't accepted the court's decision and continues to sue those developers after everything. Will this finally put an end to his baseless claims and allow the developers to move on without this constant legal harassment or will it fail to deter him from further lawsuits?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "notocactus",
      "created_time": "December 20, 2024, 02:14:16 AM",
      "body": "Quote from: _act_ on December 19, 2024, 09:09:17 PMMan who falsely claimed to be bitcoin creator sentenced for continuing to sue developersYou all know who I am talking about. He is the most well known Faketoshi. I do not know what happened to Craig Wright for continuing suing bitcoin developers in the cases he has lost all the time. The court has said he is not Satoshi Nakamoto but he still continues to sue bitcoin developers. He has now been sentenced to 12 moths in prison.It was a suspended sentence.If the person is someone else, not Craig Wright, I can feel interested in following it up, but it's a case about Craig Wright, who many times was proven as Faketoshi.Any claim or lawsuit actions from Craig Wright with intention to prove that he is Satoshi Nakamoto, to sue Bitcoin developers, and more similar activities, no longer are interesting with me. You or we can not change Craig Wright, so let him be what he want to be, and move on by focusing on more important things in each of our personal life.Updates from the COPA v Craig Wright trial",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Samlucky O",
      "created_time": "December 20, 2024, 02:38:37 AM",
      "body": "Quote from: SmartGold01 on December 19, 2024, 09:27:05 PMI see no reason for claiming to be satoshi nakamoto while he is not and he tried the best to make sure that the world believed he is satoshi but on the other hand he failed because his claim werent back up with some facts that he is satoshi or even signed messages from his bitcoin address or make some transactions from his wallet to prove he is Satoshi, then fine, he could have won the battle, but instead fighting a blind battle with no facts to show he is nakamoto. BTW, 12 months is actually very pitiable to him otherwise, country like ours he could be sentence for 6-10 years imprisonment for allegedly claiming what he is not, anyway that place would serve him as a resting place to enable him use his right senses.That's actually true, if he was really satoshi Nakamoto, there would have been proof to back up his claims including making a transaction from his wallet containing his 1m bitcoin, as that will make it easy for people to believe him. Or he could have explained more technical aspect of bitcoin. but obviously he is claiming what he is not, and we all knows a proof of real satoshi nakamoto. The appearance of satoshi in bitcointalk forum here shows he was the real satoshi Nakamoto even without a physical appearance,  because he answered some difficult question which new developers could not answer or could not have known without him. and until today his messages are still very lively and important, which no one else would have answered such question if not him. There are signs to proof a real satoshi but not ranting and forcing to be what he is not.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "xmrhopium",
      "created_time": "December 20, 2024, 03:56:09 AM",
      "body": "Quote from: Odusko on December 19, 2024, 09:35:15 PMWhat I can say is that if Craig Wright claims he is Satoshi even though he is not, let him sign a message from the various Satoshi Bitcoin wallets holding the Satoshi Bitcoins.Would't have to see his court case when the very system he supposedly invented gives him a very straightforward way of proving ownership of those genesis wallet private keys and he has refused to do so, but unfortunately, he doesn't own any key of those genesis wallet, likely probably will face jail time.But Fakesatoshi scamamoto is very good at faking a story (or a story teller) about why Satoshi choose a Japanese name, instead of being english person when is not supposed to be a Japanese person.Why satoshi kept Japanese name by craig. Quote from: Amphenomenon on December 19, 2024, 10:38:31 PMTo be frank he is not really as wealthy or even rich as he is acting, this is among the reason they knew he is not Satoshi because he can't even accessed the Satoshi address with a million+ bitcoins. He is far from being consider among the wealthiest bitcoiners.I firstly heard about this guy was in 2015 end or mid of 2016 something (didn't remember the actual date) but the price of btc was not much high during that time and probably i wouldn't say Craig is poor perhaps holds bunch of bitcoin in couple of multiple different wallets till this date. Also, afaik craig was among those people much intrested in forking bsv years ago and here is the link   said btc won't reach 100k ever,  and what most i dont like about him is \"a fragile ego\" dude pretends to be satoshi and criticize bitcoin that bsv is the orginal vision of satoshi will fulfill the original promises being p2p cash system at a same time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "serjent05",
      "created_time": "December 20, 2024, 04:07:50 AM",
      "body": "It is really sad to see people trapped in their delusions and pride.  This kind of action often ends up into self destruction since he can't accept the fact that he has been proven lying about the being the creator of Bitcoin.  He is lucky that the execution of the decision of the court is suspended for 2 years and that he had more time to reflect his action and plan a strategy to get out of that decision.I believe he needs to seek the help of medical experts to fix his delusions and put his thinking straight.  Anywho, I am glad that the court is not blind to just follow what this person claimed to be and clearly see the deceit and lies laid in their eyes.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "L4rs_",
      "created_time": "December 20, 2024, 04:11:30 AM",
      "body": "Damn for the effort he makes to tell everyone he's Satoshi Nakamoto he might be the real",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}