{
  "id": "topic_5453264",
  "title": "tech30338",
  "author": "tech30338",
  "created_time": "May 19, 2023, 04:12:14 AMLast edit: May 19, 2023, 05:08:19 PM by tech30338",
  "content": "These are the things that make people hesitant to learn and start in cryptocurrency:Scam - When i first told my friends about crypto they ignored me and say its a scamFear - since they thought crypto is a big scam, they fear they will just waste their time, and money investing and then wipeout afterlack of knowledge - since they don't have knowledge and they sometimes think it will be hard to learn, they loose interest in it, but in reality with lots of information over the web and with bitcointalk its really easy to learn something about cryptoMentoring - Although others don't need help from others some are don't have the courage to start on their own and need others to guide them although as i said, bitcointalk is the way to go, but someone should point them to this site for them to realize thatMoney - Although money is important they thought that the only way to earn in crypto is to have money to invest, but there is lots of things how to earn without moneyResources - some have laptop mobile phones, internet but others only have to rent, that is why they have less time go online and check what is going on, but if you are like this, don't stop, even though not daily but try to go online if you have time.I have seen others who really want's to know about crypto while their friends are into crypto and they are not, sometimes they don't want to teach their friends for a reason that they would earn better or more As a person who is new to crypto i have experience this things in the list, until i have tried it, and overcoming those, my advice is don't be afraid and start, because sometimes no one will help you, but yourself, have the courages to push yourself and start now, before its too late, and one more thing share your knowledge to others ,no one can steal it from you, but it will be better if everyone will have knowledge that they can use and share also at the same time, like what is going on in this forum sharing what they know will make crypto more popular.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5453264",
  "comments": [
    {
      "author": "Odusko",
      "created_time": "May 19, 2023, 05:47:03 AM",
      "body": "Quote from: tech30338 on May 19, 2023, 04:12:14 AM------------------------------------------------------------------------------------Let me point out one very important point among the points you listed which is about the importance of money to a newbie, there is no way a newbie will earn money from cryptocurrency without the direct investment of money because there is no longer free money anywhere so no one is going ditch out money to a newbie unless their earn it or buy and hold only in exceptional cases you see newbie be earning money without directly investing which is that the newbie will have marketable skills and render service in that regard to get paid with bitcoin.So even if the newbie doesn't invest money directly,  he will have to invest time and effort in providing such services to get paid for it, that is why marketable knowledge/digital skills are very important.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yaunfitda",
      "created_time": "May 19, 2023, 05:55:57 AM",
      "body": "And that's why we are in this community, we learn and at the same time shares our experienced with all of the newbies. If they ask, and if they are sincere then they can stay in the crypto world for as long as they can and maybe one day made them self made millionaires.The problem with newbies though is that they think that crypto is a get rich quick scheme. It's not that they are afraid of scams or there are not mentors. It's that idea that they can earn money big money very fast. And that is the wrong mindset in the beginning and that's where I believed that once they got into crypto they stay away for good because their mindset is not right from the start.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Apocollapse",
      "created_time": "May 19, 2023, 05:58:33 AM",
      "body": "Quote from: tech30338 on May 19, 2023, 04:12:14 AMsometimes they don't want to teach their friends for a reason that they would earn better or more Incorrect, someone don't want to teach his friends because he worried if his friends will blame him after his friends invest in cryptocurrency. Or his friend will ask money because they know you're making a lot profit from the crypto you told to them before.Actually teach friends to invest in crypto will make you earn more because the demand of the coin is increase (in case he buy it).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Iroh",
      "created_time": "May 19, 2023, 09:45:02 AM",
      "body": "I think people fear what they do not know nor understand. That’s how it is. Same with bitcoin, there are a lot of things people do not understand and their thoughts and reasoning would be to best stay away from those things. I wouldn’t blame them. The unknown can also be scary and dangerous. I think people are rightly hesitant to want to talk to other people about bitcoin and crypto in general. It’s crazy what people can do when things don’t go as they had expected. People think bitcoin to be a scam because they actually don’t know a thing about it. They just hear and absorb trash from other trash talkers without actually trying to find things out for themselves. These people form their opinions from other people biased thoughts.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Faisal2202",
      "created_time": "May 19, 2023, 09:46:37 AM",
      "body": "Quote from: tech30338 on May 19, 2023, 04:12:14 AMThese are the things that people who want's to start in crypto who I always see by others as a problem:You arose good points and the interesting thing is, when i was new to the crypto industry, all of these factors were in my mind. Like, let me tell you how?I have Less knowledge about crypto so i started to search for ways to earn crypto,(first mistake) because to earn crypto i would have to search and learn crypto. Well, i did not learn it first and directly searched to earn free crypto because i don't have so-called \"Money\" so, Well, i found some faucets and free mining sites (server-based). Well, in 2018 i spent a hell lot of time on them and i have no \"Mentor\" and have \"fewer resources\". So, after wasting some time on many websites i came to understand there is no way to earn a bundle of cash in crypto for free. like we at least have a big amount of following so that we can earn from referral systems in faucets. Well, i then left it by the fear of wasting more time and getting more scammed.Quote from: tech30338 on May 19, 2023, 04:12:14 AMI have seen others who really want's to know about crypto while their friends are into crypto and they are not, sometimes they don't want to teach their friends for a reason that they would earn better or more That's one of the many reasons but the most common one i have seen in my reality as well on this platform is, the one who has been asked by his friends to teach them crypto and try to think from the start. Like, i had a friend who was doing drop shipping and i knew drop shipping is a shit load of work and he has to spend a hell lot of time on it. So, in 2022, i told him about my first trades in crypto (yes i am also a pro learner). he insisted me to teach him well i said first let me get some grip then i will, well, after that i realized i am not capable of teaching him and he still regards me as an experienced one because he says you are the only one in my zone having more experience than me in crypto so i have to ask you only. Well, my try was always that he has many other options in his life that he can choose from and can become something more than a trader because he has a progressive mind of an entrepreneur and i know he will achieve something in his life, why i would help him to stick to this platform for the sake of money while he can do other innovations which help him to make life easier. Well, still, i am afraid to teach anyone about it because i think they could achieve more. But for myself ( people with my mentality) i don't hesitate to tell them about crypto so at least they could start making a living on their own.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Crypt0Gore",
      "created_time": "May 19, 2023, 09:47:47 AM",
      "body": "Quote from: Apocollapse on May 19, 2023, 05:58:33 AMQuote from: tech30338 on May 19, 2023, 04:12:14 AMsometimes they don't want to teach their friends for a reason that they would earn better or more Incorrect, someone don't want to teach his friends because he worried if his friends will blame him after his friends invest in cryptocurrency. Or his friend will ask money because they know you're making a lot profit from the crypto you told to them before.Actually teach friends to invest in crypto will make you earn more because the demand of the coin is increase (in case he buy it).So true, this was my story, I was once like this until some people I used to carry along lose some money and they put the whole blame on my head, I felt so bad and I promised myself to never repeat such again, today I am very careful telling friends about a project that I want to invest money into, if I lose my money it's my money and I like it this way than other people losing their money because of me.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "paid2",
      "created_time": "May 19, 2023, 10:07:48 AM",
      "body": "Quote from: Apocollapse on May 19, 2023, 05:58:33 AMIncorrect, someone don't want to teach his friends because he worried if his friends will blame him after his friends invest in cryptocurrency. Or his friend will ask money because they know you're making a lot profit from the crypto you told to them before.Yeah I agree, getting your loved ones to invest in cryptos can be risky. You always think you know people, until one day it's about big money. People change when the money runs out, or when things goes wrong.I invested in mining equipment with some people I knew (not closed friends), but from that moment on, I considered them as associates and not as friends. I think you always have to keep a social distance from people you do business with, and you can't do that with friends. That's why I don't talk about money with my friends.QuoteActually teach friends to invest in crypto will make you earn more because the demand of the coin is increase (in case he buy it).Yeah, on a very small scale, unless your friends are billionaires and ready to invest tons of money. And in general, very wealthy people doesn't need advices from friends to make more money",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BIT-BENDER",
      "created_time": "May 19, 2023, 11:32:25 AM",
      "body": "First why is your definition of Crypto-currency has to do with money and earning, this is the reason why your friends you mentioned always think in the direction you listed, (scam,  fear and little money to start) I think this attitude from those who aren't yet into crypto-currency comes from the way they are told about crypto-currency .Quote I seen others who really want's to know about crypto while their friends are into crypto and they are not, sometimes they don't want to teach their friends for a reason that they would earn better or more Was I can say is that you guys are all business men looking for the next business to make profits but this not wrong and the fact a business man doesn't want to you overtake him too is also not wrong and it's part of the business competition. Next time try to channel the way you tell people about Crypto-currency try to give them a broad picture of what it's all about, and let them decide if they also want to invest in crypto-currency.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dunamisx",
      "created_time": "May 19, 2023, 11:56:04 AM",
      "body": "Quote from: tech30338 on May 19, 2023, 04:12:14 AMScam - When i first told my friends about crypto they ignored me and say its a scamScam is everywhere, not only in cryptocurrency but every aspect in life there's scam taking place, name it, is it in politics, businesses, government, NGOs, and other areas of life, but what are the measures that we take as an individual against these occurrences.Quote from: tech30338 on May 19, 2023, 04:12:14 AMFear - since they thought crypto is a big scam, they fear they will just waste their time, and money investing and then wipeout afterThis fear has gone wide to an extent that people hardly believe in anything new again just because they were afraid of missing out, maybe they have fall a victim of scam or just gave this timid spirit of inferiority with fear, they are the kinds that easily fear to take risk or try out on new development and they often remain on the same spot for long.Quote from: tech30338 on May 19, 2023, 04:12:14 AMlack of knowledge - since they don't have knowledge and they sometimes think it will be hard to learn, Everyone today has fone through the process in learning more about new things they come across with in life, laziness and relunctancy is what affects most people from learning new things because they don't see the possibility of them achieving it or creating enough time to achieve it with all that it demand.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Frankolala",
      "created_time": "May 19, 2023, 12:27:00 PM",
      "body": "Quote from: tech30338 on May 19, 2023, 04:12:14 AMScam - When i first told my friends about crypto they ignored me and say its a scamFear - since they thought crypto is a big scam, they fear they will just waste their time, and money investing and then wipeout afterYes most crypto are scam and I don't blame for friends for saying this because they might have met someone who invested on altcoins and ended up losing all his money. You should be specific with the crptocurrency. When talking to people about crypto tell them bitcoin because bitcoin is the only cryptocurrency that you can trust on.Quote from: tech30338 on May 19, 2023, 04:12:14 AMlack of knowledge - since they don't have knowledge and they sometimes think it will be hard to learn, they loose interest in it, but in reality with lots of information over the web and with bitcointalk its really easy to learn something about cryptoThis has been a big problem on bitcoin adoption, this is the reason why Satoshi created this forum so that people with no knowledge on bitcoin can learn from experts here. Quote from: tech30338 on May 19, 2023, 04:12:14 AMMentoring - Although others don't need help from others some are don't have the courage to start on their own and need others to guide them although as i said, bitcointalk is the way to go, but someone should point them to this site for them to realize thatMany of us in this forum have introduced people here to have knowledge and guidance on their bitcoin journey and I will advice you to introduce those your friends that are scared of investing to the forum,so that they can be encouraged and guided on how to go with their investment.Quote from: tech30338 on May 19, 2023, 04:12:14 AMMoney - Although money is important they thought that the only way to earn in crypto is to have money to invest, but there is lots of things how to earn without moneyThere is no way a newbie will have bitcoin if he doesn't buy with his funds or render service and get paid with bitcoin. It is only in this forum that I know it is possible through signature campaigns. If they are not a member of this forum how will it be possible for them to have bitcoin without investing. Bitcoin investment is like every other investment that you must have a capital to start with.Quote from: tech30338 on May 19, 2023, 04:12:14 AMResources - some have laptop mobile phones, internet but others only have to rent, that is why they have less time go online and check what is going on, but if you are like this, don't stop, even though not daily but try to go online if you have time.You don't need a laptop to start your bitcoin journey. A simple android phone can access the internet like any other expensive andriod phone. Anybody that don't have money to buy an android phone should forget about bitcoin investment. He should get an android phone first before he can think of investing because bitcoin investment needs steady monitoring and researches online. If you can't purchase a phone,how will you be able to invest in bitcoin ?.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fiatless",
      "created_time": "May 19, 2023, 12:50:58 PM",
      "body": "Quote from: tech30338 on May 19, 2023, 04:12:14 AMThese are the things that people who want's to start in crypto who I always see by others as a problem:Scam - When i first told my friends about crypto they ignored me and say its a scamIt is not only in the crypto industry, there have been a high rate of scam in almost all the sectors of the economy. But the crypto industry has a fair share of these criminal activities with the uncontrollable creation of many shitcoins and unreliable exchanges. But there are also genuine crypto platforms that have been steady for many years. But when you start to reap from your patients and confidence in bitcoin, they might be convinced of its genuineness. QuoteFear - since they thought crypto is a big scam, they fear they will just waste their time, and money investing and then wipeout afterInvesting or believing in Bitcoin is not for everybody. Some people are chicken-hearted and can not take business risks. At least we know that Bitcoin has not disappointed since its creation. Business is risky and only the brave can invest in Bitcoin because there will always be fearful speculations and many distractions. Quotelack of knowledge - since they don't have knowledge and they sometimes think it will be hard to learn, they loose interest in it, but in reality with lots of information over the web and with bitcointalk its really easy to learn something about cryptoThis is a slothful man's excuse. Everybody should do their research and learn about the sector they want to invest in. There are so many educational materials about Bitcoin on this forum and some other reliable websites or ebooks. So this shouldn't be an excuse because they can always access vital information. QuoteMentoring - Although others don't need help from others some are don't have the courage to start on their own and need others to guide them although as i said, bitcointalk is the way to go, but someone should point them to this site for them to realize thatInvestment decisions are personal. After you have gotten enough information about a sector, it is your responsibility to choose to invest or abstain. Mentors will only counsel and guide you but they will not force you to invest. This is because you will blame them if something goes wrong. QuoteMoney - Although money is important they thought that the only way to earn in crypto is to have money to invest, but there is lots of things how to earn without moneyResources - some have laptop mobile phones, internet but others only have to rent, that is why they have less time go online and check what is going on, but if you are like this, don't stop, even though not daily but try to go online if you have time.The beauty of Bitcoin is that you can start with what you have. You don't need to take a loan to start investing in the sector. And it is also not a full-time venture. So one can always get a job and use this sector as a side job. Electronic or communication devices are expensive but there are also cheaper options. Renting a laptop or phone is not advisable because it could be risky and expensive. My advice is that people should take their time and save money and  get a cheap but functional secondhand device.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "May 19, 2023, 01:10:46 PM",
      "body": "Fear is an emotion that if you use it well, you will make profits, and if you misuse it, you will end up losing your money. Fear and greed are linked and it is difficult to separate them, so you will need a little of this and a little of this to make reasonable profits.The real problem that I see is a lack of knowledge. Fear disappears as soon as you start the first trade, and cheating ends with knowledge, but not continuing to acquire knowledge and trying to be on a permanent coating is the long-term problem.Investing also means that you do not invest the money you need to pay expenses or feed your family, otherwise you are risking their future.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jimmycrooks",
      "created_time": "May 19, 2023, 01:18:57 PM",
      "body": "Quote from: tech30338 on May 19, 2023, 04:12:14 AMThese are the things that people who want's to start in crypto who I always see by others as a problem:Scam - When i first told my friends about crypto they ignored me and say its a scamFear - since they thought crypto is a big scam, they fear they will just waste their time, and money investing and then wipeout afterlack of knowledge - since they don't have knowledge and they sometimes think it will be hard to learn, they loose interest in it, but in reality with lots of information over the web and with bitcointalk its really easy to learn something about cryptoMentoring - Although others don't need help from others some are don't have the courage to start on their own and need others to guide them although as i said, bitcointalk is the way to go, but someone should point them to this site for them to realize thatMoney - Although money is important they thought that the only way to earn in crypto is to have money to invest, but there is lots of things how to earn without moneyResources - some have laptop mobile phones, internet but others only have to rent, that is why they have less time go online and check what is going on, but if you are like this, don't stop, even though not daily but try to go online if you have time.I have seen others who really want's to know about crypto while their friends are into crypto and they are not, sometimes they don't want to teach their friends for a reason that they would earn better or more As a person who is new to crypto i have experience this things in the list, until i have tried it, and overcoming those, my advice is don't be afraid and start, because sometimes no one will help you, but yourself, have the courages to push yourself and start now, before its too late, and one more thing share your knowledge to others ,no one can steal it from you, but it will be better if everyone will have knowledge that they can use and share also at the same time, like what is going on in this forum sharing what they know will make crypto more popular.As long as there's money I don't think any of these factors would hinder anyone from starting crypto. SCAM and FEAR are literally the same thing, you just separated them to make your thread longer. The fear of being scammed can be overlooked with enough funds it's a known fact. That's a known factRESOURCES: you mentioned laptop and mobile devices which can be bought with money. I'm not gon talk much on this, you get where I'm driving at.LACK OF KNOWLEDGE and MENTORING: Again two similar points that could've been folded into one point, but you felt that separating them would make your thread longer. There are legit crypto classes out there that one can register under. Yes they might cost you money, but that's where the funds come in.They main factor hindering people from engaging in crypto is the lack of funds and ignorance. .",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Accardo",
      "created_time": "May 19, 2023, 09:00:07 PM",
      "body": "Mentioning money as a factor why people delay their motives of investing into cryptocurrency is quite true, but that doesn't stop anyone if they're determined to exhaust energy and work to get bitcoin. When money is the barrier, energy is always there to make space for more opportunities. All over many marketplaces, people offer services for bitcoin and that's a good way to start investing into cryptocurrency. So, in a way, money shouldn't be the reason why a person won't invest into cryptocurrency. However, plenty of money is required to get high profits and loss in the market, yet starting from somewhere is better than ignoring the investment entirely despite being interested in the market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LogitechMouse",
      "created_time": "May 19, 2023, 09:33:48 PM",
      "body": "Quote from: tech30338 on May 19, 2023, 04:12:14 AMScam - When i first told my friends about crypto they ignored me and say its a scamIt's completely normal for a person who hears an investment like Bitcoin for the first time to think that it's a scam. TBH, I'm like them when I was a newbie. I also think that Bitcoin is a scam for some reasons, but after learning it, and researching, I realized that I was wrong, and it wasn't a scam. Your friends might need to make some research as well, or just let them be, and ignore them as well, or better if you don't open anything crypto-related to them.Quote from: tech30338 on May 19, 2023, 04:12:14 AMlack of knowledge - since they don't have knowledge and they sometimes think it will be hard to learn, they loose interest in it, but in reality with lots of information over the web and with bitcointalk its really easy to learn something about cryptoThat's why we have this forum. That's why we have Youtube. That's why we have different websites where we can learn crypto. There are many ways already for a newbie to learn about crypto online. What they only need is time to do it, and the eagerness to learn it. It's already a good thing that we have an access to these information, and it's free take note. Quote from: tech30338 on May 19, 2023, 04:12:14 AMMentoring - Although others don't need help from others some are don't have the courage to start on their own and need others to guide them although as i said, bitcointalk is the way to go, but someone should point them to this site for them to realize thatI always believe that having a mentor will shorten your learning curve, and you will learn faster if you have a mentor that will help you. Though like you said that there are some who prefer self-studying, I still thing that having a mentor is a good thing. When I'm starting, I didn't have any mentors at all, and the only thing that helped me is this forum, and Youtube. I learned a lot from these 2 websites, and I didn't have a mentor that's why it took me longer time to learn.Quote from: tech30338 on May 19, 2023, 04:12:14 AMMoney - Although money is important they thought that the only way to earn in crypto is to have money to invest, but there is lots of things how to earn without moneyResources - some have laptop mobile phones, internet but others only have to rent, that is why they have less time go online and check what is going on, but if you are like this, don't stop, even though not daily but try to go online if you have time.These 2 are somewhat correlated with each other.In order for you to make money, you need some resources.You said it already that there are many ways to earn money online, and these money can be used to buy the resources that they need if they really want to use cryptocurrencies. Like I said, if somebody really wants to learn it, they will do everything just to have it, and that's include saving some of their money to buy a laptop, or a phone etc.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Obari",
      "created_time": "May 19, 2023, 11:24:19 PM",
      "body": "One of the major reasons I didn't get into crypto  earlier was because of the fear of being scammed and most times I try my best not to get to regret them because there is nothing I can actually do to change the last and some other  time, I also wish I can go back to time to buy bitcoin  even it was still on pre-sale but you know as they always say that you can't eat your cake and have it back. No true friend should  hide a legit way of earning income from his friend and anyone who does shouldn't be regarded as a friend.And the only reason I don't feel comfortable  bringing people into the industry is the fact that I might be blamed if anything  goes wrong and if you must come into crypto  through me, then be willing  to accept my disclaimer.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SOKO-DEKE",
      "created_time": "May 20, 2023, 08:12:59 AM",
      "body": "Quote from: tech30338 on May 19, 2023, 04:12:14 AMScam - When i first told my friends about crypto they ignored me and say its a scamDue to their experiences with scammers, a lot of people consider any online investment to be a scam.It is not news to us that many people have lost a significant sum of money to scam projects, particularly ponzi schemes. As a result, prospective investors are scared and neglect to learn about cryptocurrencies because they assume they are scams. Quote from: tech30338 on May 19, 2023, 04:12:14 AMFear - since they thought crypto is a big scam, they fear they will just waste their time, and money investing and then wipeout afterThe fear of losing will always be larger than the idea of winning if a person doesn't have enough knowledge about cryptocurrency, this will prevent them from investing in it. Quote from: tech30338 on May 19, 2023, 04:12:14 AMlack of knowledge - since they don't have knowledge and they sometimes think it will be hard to learn, they loose interest in it, but in reality with lots of information over the web and with bitcointalk its really easy to learn something about cryptoKnowledge is very important in anything you may choose to do in this life especially in term of business or investment. I agreed with you that lack of knowledge make some people to loss in interest, but I don't think it main reason for someone to loss interest easily because we are not born with knowledge, so are to acquire it. If we are lack of lack knowledge about anything the best is to do, is do research about such things.Quote from: tech30338 on May 19, 2023, 04:12:14 AMMoney - Although money is important they thought that the only way to earn in crypto is to have money to invest, but there is lots of things how to earn without moneyMoney is one of the primary reasons why people are put off from investing in the bitcoin sector. It even puts people off from learning because some people don't even have the resources, like as high-quality smartphones and laptops, that would allow them to access the internet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Daniel91",
      "created_time": "May 20, 2023, 11:02:08 AM",
      "body": "OP, I might add a few more things from my practical experience here.Local media in my country very often write negatively about crypto, and often give examples of how someone lost money investing in crypto or was scammed.Even government financial regulators and banks often send out press releases warning of the dangers of crypto investing.For the average person without much financial experience and education, these are quite enough reasons to give up investing in crypto.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "michellee",
      "created_time": "May 20, 2023, 11:15:41 AM",
      "body": "People don't want to know and learn about crypto because there is a fear of stepping into something new that might change for the better. I've met people who didn't want to know new things and to be able to give them a chance to get better. And I also don't force them to follow me because that is a choice.And I'll leave it entirely up to them when it's a choice. It's their money, they are responsible with their money and we are just giving them information. And if they are not interested or are hesitant to get to know crypto, that is up to them. The important thing is that we have tried to introduce crypto to them.And the information I gave them was not trading or participating in investment programs but only buying bitcoins regularly every month by setting aside some of the money. But they don't want to and it's their choice.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}