{
  "id": "topic_5447522",
  "title": "cryptoknightt",
  "author": "cryptoknightt",
  "created_time": "April 04, 2023, 09:59:38 AMLast edit: April 04, 2023, 10:33:50 AM by cryptoknightt",
  "content": "Omg some time ago Elon Musk again shocked the cryptocurrency community by changing his Twitter home profile and as the owner of Twitter which became the symbol of Doge Coin, now Doge has increased by 24% recorded today at https://www.coingecko.com/en/coins/dogecoin there is always this behavior of influential people.Do you think Elonmusk's movement can make Doge return to the moon?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5447522",
  "comments": [
    {
      "author": "Jackl87",
      "created_time": "April 04, 2023, 10:56:06 AM",
      "body": "Quote from: cryptoknightt on April 04, 2023, 09:59:38 AMOmg some time ago Elon Musk again shocked the cryptocurrency community by changing his Twitter home profile and as the owner of Twitter which became the symbol of Doge Coin, now Doge has increased by 24% recorded today at https://www.coingecko.com/en/coins/dogecoin there is always this behavior of influential people.Do you think Elonmusk's movement can make Doge return to the moon?According to coinmarketcap Dogecoin is up 30% now in comparison to yesterday so that last joke of Elon Musk definitely had a pretty big impact on it's price. To be honest i don't really know what to think about this stuff. I mean of course Elon Musk is probably one of the most influential persons on the planet right now and twitter is a very important platform, but if it is enough to jokingly replace a company logo with a logo of a cryptocurrency to make that project, which is among the top 10 in terms of marketcap, pump more like 30% withing a day, then this just shows to me again that the whole crypto market can still not be taken serious at all.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bussybuddy",
      "created_time": "April 04, 2023, 11:12:08 AM",
      "body": "It is affecting the price, I have seen dogecoin go up and people are starting to see it more popular now and in my opinion the fomo will come and not too surprising if the price continues to rise.The result of this action of Elon Musk with twitter surprised me very much, I don't know about this change very well but like some previous events where Elon Musk mentioned dogecoin, I don't think he is serious. with this market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yaunfitda",
      "created_time": "April 04, 2023, 11:16:44 AM",
      "body": "Obviously, he still has some influence on Doge for this matter, but the thing is how long can he influence the price?Will it go down again after the hype has gone? We've seen this a lot from the past so I wouldn't be surprised if this is the case. Everyone is jumping on board, but the one that is going to make money here is the one who is the first one to ride and then exit when the price is still up. And the one that will suffer the most is those who think that this price action is real and that the price will go on parabolic rise again because of Elon, just saying. So just be careful as this looks like artificial to me pump to me.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "raidarksword",
      "created_time": "April 04, 2023, 12:23:49 PM",
      "body": "Uncle Elon done it again, the hype is back for Dogecoin it is. It's possible that the real price of Dogecoin will be back and this is just the start as ELon Musk integrating Dogecoin inside the Twitter platform. Elon Musk has still a magic and have more tricks up to his sleeve. It is finally happening the merge of Twitter and Dogecoin adoption.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "imamb",
      "created_time": "April 04, 2023, 03:25:51 PM",
      "body": "I think Elon Musk loves this altcoin, DOGE coin, until the Twitter logo is changed to the DOGE logo. maybe the price of DOGE will return to the old 0.85$.??or alon musk is still stuck with holding DOGE until he switches to taking minus his investment through a different way now. I think he holds the old DOGE in 2020 until now",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "makishart",
      "created_time": "April 04, 2023, 03:50:49 PM",
      "body": "Im not sure what was the main motive to change the logo of twitter into the doge coin but it seems like that this was just for fun only and no more. https://twitter.com/elonmusk/status/1642976364080041984Elon was just remembering if he has ever triggered with a tweet that already made by WSBchairman. It seems like that elon was just using it as a momentum to give a surprise to the all of doge coin community if twitter's logo changed into the doge coin logo. Elon can make doge coin to go to the moon again with simple steps. Just try to accept doge coin as a part of payment to be verified on twitter and this will be triggering massive adoption for doge coin. Elon is still having so many ways to make it happen caused by he was billionaire.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tvplus006",
      "created_time": "April 04, 2023, 04:21:23 PM",
      "body": "Quote from: Yaunfitda on April 04, 2023, 11:16:44 AMObviously, he still has some influence on Doge for this matter, but the thing is how long can he influence the price?..It is obvious that sooner or later Elon Musk will change the Twitter logo to the old one and this will mean the end of hype for Doge. Accordingly, we will not have to miss this moment to open a short position. There is no doubt that the dump will absorb the previous growth.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Silberman",
      "created_time": "April 04, 2023, 08:17:43 PM",
      "body": "Quote from: Yaunfitda on April 04, 2023, 11:16:44 AMObviously, he still has some influence on Doge for this matter, but the thing is how long can he influence the price?Will it go down again after the hype has gone? We've seen this a lot from the past so I wouldn't be surprised if this is the case. Everyone is jumping on board, but the one that is going to make money here is the one who is the first one to ride and then exit when the price is still up. And the one that will suffer the most is those who think that this price action is real and that the price will go on parabolic rise again because of Elon, just saying. So just be careful as this looks like artificial to me pump to me.This is the question, people are thinking about the influence Elon has on the market but this is the wrong way to think about this, speculators are the ones which can influence it and they use the actions of Elon to manipulate the markets as they want, however this is manipulation short-lived and soon enough we will see the price of dogecoin going down again, and anyone thinking about trading dogecoin now needs to be very careful or they may lose a great deal of their capital in just a few days once the price goes down.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o48o",
      "created_time": "April 04, 2023, 08:46:52 PM",
      "body": "Quote from: cryptoknightt on April 04, 2023, 09:59:38 AMOmg some time ago Elon Musk again shocked the cryptocurrency community by changing his Twitter home profile and as the owner of Twitter which became the symbol of Doge Coin, now Doge has increased by 24% recorded today at https://www.coingecko.com/en/coins/dogecoin there is always this behavior of influential people.Do you think Elonmusk's movement can make Doge return to the moon?Sure, it can bring doge to moon but it can also get elon rekt as this is exactly what the lawsuit was about in the first place. This taunting isn't helping his case and most likely backfires badly.Elon's networth is currently $202.4 billion while lawsuit is $258 billion. So not only elon would have to sell EVERYTHING. He would most likely be jailed as well. I wonder who would get the twitter in auction .",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Strongkored",
      "created_time": "April 04, 2023, 10:40:10 PM",
      "body": "Quote from: cryptoknightt on April 04, 2023, 09:59:38 AMOmg some time ago Elon Musk again shocked the cryptocurrency community by changing his Twitter home profile and as the owner of Twitter which became the symbol of Doge Coin, now Doge has increased by 24% recorded today at https://www.coingecko.com/en/coins/dogecoin there is always this behavior of influential people.Do you think Elonmusk's movement can make Doge return to the moon?That's what he wanted with dogecoin going back to the moon would make his portfolio of assets grow and would cover the losses from his other businesses. He always uses the same way to make people react in the market and it is profitable for him. But what do we care about his actions, just use this good moment to also benefit, so that's why hold deogecoin by buying when the price is cheap, it always gives benefits to the holders and the price of dogecoin will be even higher when the crypto market is really entering a bullish period and don't be left behind by thinking of buying at a lower price than now because the current price is still relatively cheap.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitkanu",
      "created_time": "April 04, 2023, 11:02:21 PM",
      "body": "elon musk legit trying to find every opportunity in pumping the value of doge coin that I think he definitely have some huge share amounts of doge in his pocket.it doesn't make sense for billionaire to be so focused on something if not for profit, i'm seriously thinking that it definitely isn't some april fools joke.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Teraboy",
      "created_time": "April 04, 2023, 11:48:11 PM",
      "body": "Just change twitter logo to the doge coin logo has been triggering people to buy doge coin but the pump will not even big as the past when so many people from stock were buying doge coin at the same time. Elon is trying so hard to pump doge coin. It was able pumping doge coin more than 20% which is good enough but that will not be remain so long. The price will be back again soon. Be careful. Doge coin is pnd coin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoknightt",
      "created_time": "April 05, 2023, 12:17:28 AM",
      "body": "Quote from: bussybuddy on April 04, 2023, 11:12:08 AMIt is affecting the price, I have seen dogecoin go up and people are starting to see it more popular now and in my opinion the fomo will come and not too surprising if the price continues to rise.The result of this action of Elon Musk with twitter surprised me very much, I don't know about this change very well but like some previous events where Elon Musk mentioned dogecoin, I don't think he is serious. with this market.how can you not be serious why did elon musk change the twitter icon to become the doge logo until elon musk was called doge father by people on the internet, especially the doge coin community in the worldis doge just a coin meme? correct me if wrong",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoknightt",
      "created_time": "April 05, 2023, 02:04:10 AM",
      "body": "Quote from: Yaunfitda on April 04, 2023, 11:16:44 AMObviously, he still has some influence on Doge for this matter, but the thing is how long can he influence the price?Will it go down again after the hype has gone? We've seen this a lot from the past so I wouldn't be surprised if this is the case. Everyone is jumping on board, but the one that is going to make money here is the one who is the first one to ride and then exit when the price is still up. And the one that will suffer the most is those who think that this price action is real and that the price will go on parabolic rise again because of Elon, just saying. So just be careful as this looks like artificial to me pump to me.how long it is certain we will not know, humans like to follow along with what is called fomo and that is a fact.That's right, what you also said could be a fake pump and only temporary, but let's see together",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoknightt",
      "created_time": "April 05, 2023, 02:07:33 AM",
      "body": "Quote from: bitkanu on April 04, 2023, 11:02:21 PMelon musk legit trying to find every opportunity in pumping the value of doge coin that I think he definitely have some huge share amounts of doge in his pocket.it doesn't make sense for billionaire to be so focused on something if not for profit, i'm seriously thinking that it definitely isn't some april fools joke.sure he must have some doge coins in his pocket some in elon musk maybe very much our morning let alone we know he is a rich and very rich man. but it makes sense maybe it could be april fools. be careful",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sweetbtc",
      "created_time": "April 05, 2023, 03:37:06 AM",
      "body": "QuoteOmg some time ago Elon Musk again shocked the crypto currency community by changing his Twitter home profile and as the owner of Twitter which became the symbol of Doge Coin, now Doge has increased by 24% recorded today at https://www.coingecko.com/en/coins/dogecoin there is always this behavior of influential people.Do you think Elon musk's movement can make Doge return to the moon?From the day Elon Musk bought Twitter From that day it was assumed that the doge coin would not take long to go up again. Because every time the value of Dodge coin has increased, it has increased because of elon musk. Now he has only changed the Twitter logo and replaced the bird with a DOGE symbol, due to which the Doge coin has increased by 25 percent. Now if it announced to use doge coin as currency for Twitter registration, you can imagine where the price could go. And many experts are saying that if this happens, the price of Doge coin could go to one dollar.And it is not impossible. Because Elon musk always raised the doge coin to the heights of moon. in my openion Elon Musk will now link Doge Coin to Twitter in some way, which will keep the price of Doge Coin going up.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Reatim",
      "created_time": "April 05, 2023, 04:59:45 AM",
      "body": "Quote from: cryptoknightt on April 04, 2023, 09:59:38 AMOmg some time ago Elon Musk again shocked the cryptocurrency community by changing his Twitter home profile and as the owner of Twitter which became the symbol of Doge Coin, now Doge has increased by 24% recorded today at https://www.coingecko.com/en/coins/dogecoin there is always this behavior of influential people.Do you think Elonmusk's movement can make Doge return to the moon?we cannot deny the fact about ELon Musk influence over the crypto market and also about the capacity of His action to boost Coins like Doge so the effect still visual for everyone,but asking if this can make doge mooning again? without bitcoin acting first? I am afraid that there is possibilities mate.try not to expect so much specially if this is following Elon Musk action.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Similificator",
      "created_time": "April 05, 2023, 06:54:43 AM",
      "body": "Ahh.. The classic \"Elon moves, price does too\" scenario. Well, if there's anything that I have learned about the reactions of the market whenever Elon says or does something related to the crypto industry, it is that whenever it happens, ride on it early and get off of it early. The duration of the ride would then depend on the situation and how the crowd moves along with it. I suggest not getting emotional about it that would make one go against the flow. Whether one likes the guy or not, it's better to just take advantage of the situation. A few just can't beat the many so might as well join them. haha",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kevindjunaidi",
      "created_time": "April 05, 2023, 07:40:07 AM",
      "body": "Quote from: cryptoknightt on April 04, 2023, 09:59:38 AMOmg some time ago Elon Musk again shocked the cryptocurrency community by changing his Twitter home profile and as the owner of Twitter which became the symbol of Doge Coin, now Doge has increased by 24% recorded today at https://www.coingecko.com/en/coins/dogecoin there is always this behavior of influential people.Do you think Elonmusk's movement can make Doge return to the moon?I'm confused why there are still many people who believe Elon Musk, because I'm sure if he only manipulates Doge prices and it's very risky to make an investment, therefore I personally will definitely not be interested to investing in Doge or coin promoted by influencers, because the risk is very big and I am a person who prefers to avoid risks.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}