{
  "id": "topic_5409821",
  "title": "bitmover",
  "author": "bitmover",
  "created_time": "August 14, 2022, 12:13:19 PM",
  "content": "Quotehttps://cointelegraph.com.br/news/indian-authorities-freeze-more-crypto-funds-over-money-laundering-allegations Autoridades indianas congelam mais fundos de criptomoedas por alegações de lavagem de dinheiroO Diretório de Execução da Índia congelou US$ 46,4 milhões nas contas da filial indiana de Vauld até que a exchange possa contabilizar os produtos criminais que transferiu para fora do país. 46 milhões de usd em cripto, supostamente usados em lavagem de dinheiro, foram congelados de corretoras.Está realmente uma caça as bruxas as corretoras e criptomoedas e esse negócio de AML, KYC, Mixers etc.Mais um motivo para não deixar seu dinheiro em corretoras.  Nao é so o risco da corretora quebrar As corretoras podem congelar seu saldo a qualquer momento, caso ls julgum qu sua atividade é suspeita.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5409821",
  "comments": [
    {
      "author": "joker_josue",
      "created_time": "August 15, 2022, 03:56:16 PM",
      "body": "No meio disto tudo, acho interessante é ainda não ter surgido noticias no género na Europa.Querem ver, que eles falam muito que as cripto são para lavar dinheiro... mas depois, olham para o lado?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Paredao",
      "created_time": "August 15, 2022, 08:27:35 PM",
      "body": "Quote from: joker_josue on August 15, 2022, 03:56:16 PMNo meio disto tudo, acho interessante é ainda não ter surgido noticias no género na Europa.Querem ver, que eles falam muito que as cripto são para lavar dinheiro... mas depois, olham para o lado? Logo eles começarão a bloquear na Europa também. É uma questão de tempo.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gagux123",
      "created_time": "August 15, 2022, 09:58:18 PM",
      "body": "Quote from: Paredao on August 15, 2022, 08:27:35 PMLogo eles começarão a bloquear na Europa também. É uma questão de tempo. Puts.... será mesmo que isso poderá chegar até a Europa!!? Será que essa \"\"onda de investigações\"\" poderá chegar até o Brasil também? Estive pensando comigo mesmo sobre a possibilidade esse tipo de situação ocorrer aqui no Brasil",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "August 16, 2022, 07:55:16 PM",
      "body": "Quote from: gagux123 on August 15, 2022, 09:58:18 PMPuts.... será mesmo que isso poderá chegar até a Europa!!? Claro! Estranho é não ter chegado primeiro!A UE é muito rigorosa nessas coisas, as vezes até demais. É raro uma grande empresa de tecnologias que já não tenha sido multada na UE por algum motivo. Já foi multadas Microsoft, Apple, Google e Facebook. Achas que eles tem medo de cair em cima de empresas mais pequenas?Mas, sabem porque é que ainda não foram? Estão mais preocupadas com a situação na Ucrânia e as sanções que tem \"sido obrigados\" a implementar. A Europa Ocidental esta com um medo doido de ficar sem energia no Inverno! Nem sabem o que fazer... Vocês vão ver como, quando chegar o frio, a conversa da guerra vai começar a mudar.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "alegotardo",
      "created_time": "August 20, 2022, 01:47:46 AM",
      "body": "Quote from: joker_josue on August 16, 2022, 07:55:16 PMQuote from: gagux123 on August 15, 2022, 09:58:18 PMPuts.... será mesmo que isso poderá chegar até a Europa!!? Claro! Estranho é não ter chegado primeiro!O problema que vejo é isso virar \"moda\" e os governos sacarem que essa é a melhor forma de combater não só a lavagem de dinheiro mas também o Bitcoin.Claro que as Exchanges são um mal gigantesco para as criptomoedas devido a sua decentralização, mas muito da popularidade e adoção do Bitcoin só oi possível graças a elas... no P2P tudo teria evoluido de forma muito mais lenta, e se tivermos que voltar à ele o processo seria bastante \"doloroso\"para todo mundo, principalmente no preço.Mas.... se formos ter que voltar a isso, que ocorra o quanto antes, pois ach que não tenho mais do que uns 50 anos para ver o Bitcoin chegar à lua",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "August 20, 2022, 07:49:02 AM",
      "body": "Quote from: alegotardo on August 20, 2022, 01:47:46 AMO problema que vejo é isso virar \"moda\" e os governos sacarem que essa é a melhor forma de combater não só a lavagem de dinheiro mas também o Bitcoin.Também acho isso.Por isso, é que cada vez mais as exchanges são mais rigorosas no KYC, pedindo coisas que nem fazem muito sentido, mas serve apenas para elas poderem se proteger caso ocorra uma ação judicial.Por sua vez, também acredito que nunca serão tomadas medidas muito radicais, visto que muita gente bastante influente já está metida no Bitcoin. E por isso, as coisas não fiquem tão radicais assim.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Disruptivas",
      "created_time": "August 20, 2022, 01:24:15 PM",
      "body": "Eu acho que o governo dos EUA é mais intrometido na verdade.Mas eu não consigo ficar UM DIA sem ter mais raiva e achar os governos cada vez mais toscos. Essa semana eu conversei com uma founder de uma plataforma de tokenização de ''escambo/barter''. E ela me disse que estava preocupada porque no país dela e da empresa (a Irlanda), escambo é algo regulado, que você precisa declarar e pagar imposto sobre. Então por exemplo, se eu troco quatro abacates contigo por um maracuja raro, eu preciso declarar e pagar sobre essa troca. Pra mim isso é um crime contra o desenvolvimento da humanidade. Há MUUUUUUUUITO tempo antes do nascimento de um Estado e de presidentes, a humanidade sempre fez escambos, regular isso é muita censura pra mim. Enfim, todo dia uma decepção governamental a mais.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "August 21, 2022, 07:17:15 AM",
      "body": "Quote from: Disruptivas on August 20, 2022, 01:24:15 PMEssa semana eu conversei com uma founder de uma plataforma de tokenização de ''escambo/barter''. E ela me disse que estava preocupada porque no país dela e da empresa (a Irlanda), escambo é algo regulado, que você precisa declarar e pagar imposto sobre. Então por exemplo, se eu troco quatro abacates contigo por um maracuja raro, eu preciso declarar e pagar sobre essa troca. Mas na Irlanda as trocas de \"fruta\" também são reguladas?Troca de casa, carro ou barco, eu ate entendo. Agora bens de consumo e de baixo valor? Isso é mesmo para chatear.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Disruptivas",
      "created_time": "August 21, 2022, 01:32:01 PM",
      "body": "Quote from: joker_josue on August 21, 2022, 07:17:15 AMMas na Irlanda as trocas de \"fruta\" também são reguladas?Troca de casa, carro ou barco, eu ate entendo. Agora bens de consumo e de baixo valor? Isso é mesmo para chatear.Eu não entrei em detalhes na conversa com a moça sobre exatamente quais itens, mas eu entendi que sim, que na verdade qualquer tipo de escambo é tributável. Mas o caso das frutas eu dei aleatoriamente porque foi uma troca que eu havia feito na noite seguinte com um amigo. Eu vou pedir pra ela mais detalhes sobre a lei e ai venho com mais informações estruturadas pra contar aqui.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "August 24, 2022, 12:13:58 PM",
      "body": "Quote from: Disruptivas on August 20, 2022, 01:24:15 PMPra mim isso é um crime contra o desenvolvimento da humanidade. Há MUUUUUUUUITO tempo antes do nascimento de um Estado e de presidentes, a humanidade sempre fez escambos, regular isso é muita censura pra mim. Enfim, todo dia uma decepção governamental a mais. Todo imposto gera uma ineficiencia econômica. Tudo seria mais barato sem imposto.Em contrapartida, o Estado, teoricamente, nos oferece segurança, bens públicos para usufruirmos,  etc.O problema é a carga tributária alta. E existe uma pressao para aumebtar essa carga tributária. Ontem o Ciro Gomes estava falando em aumentar a carga tributária já,  no jornal nacional. Sobre taxar escambos,  é como o joker falou. Daqui a pouco o pessoal tá trocando casa por barco pra não pagar imposto..",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "August 24, 2022, 06:56:00 PM",
      "body": "Quote from: bitmover on August 24, 2022, 12:13:58 PMSobre taxar escambos,  é como o joker falou. Daqui a pouco o pessoal tá trocando casa por barco pra não pagar imposto.. Na realidade até se pode fazer essa troca com permuta. Mas a pessoa tem de pagar a mesma impostos, se quer fazer tudo legal, claro.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}