{
  "id": "topic_5433453",
  "title": "ZekiBeyy",
  "author": "ZekiBeyy",
  "created_time": "January 08, 2023, 09:28:05 AM",
  "content": "Unutmamak ve hatırlamak adına kendimce bulduğum pratik çözümleri aktarmak istiyorum belki sizlerin de işine yarayabilir.Bir yerde kamp yapacaksam veya gezi olur balık tutmak olur yani kısaca bir yere gittiğimiz zaman yanımıza alacağımız ekipmanlardan tutunda eşyalara kadar bir çok şey götürüyoruz ama işi ne kadar sıkı tutsakta genelde her zaman bir şeyler unutulur  işte ben bunu en aza indirmek adına olayı hayalimde canlandırıyorum. Mesela deniz kenarına hem balık tutmaya hem bir şeyler pişirip atıştırmalık yapacaksam hemen sıralarım: Denize gireceğim kıyafet ve malzemeler, ağırlık, olta ve zıpkın bunlar balık tutmak için gerekli olan şeyler. İnsan av malzemelerini unutur mu? hiç demeyin unutulabiliyor sık sık gittiğim zaman değil de araya biraz zaman girince unutulabiliyor bir kaç kez zıpkınımı bir kaç kerede ağırlık kemerimi unuttuğum oluyordu ama kendi arabam olduğundan beri ağırlık kemerim hep bagajda duruyor. Yemek vs yapacağım zamanda hemen gitmiş gibi hayal ederek ocağın üstüne tavayı koy yağ tuz kaşık böyle sırayla giderim çay yapacaksam semaver çaydanlık çay şeker sırasıyla devam eder birde malzemelerinizi kendiniz ayarlayın böylelikle kamp keyfiniz daha güzel geçecektir. Bakın ateş almayı unuttum  bunun içinde her zaman araçta bir çakmak bulunduruyorum Yeni tanıştığım kişilerin isimlerini genelde unuturum bunun içinde tanıdığım biriyle aynı ismi taşıyan kişiyi eşleştiririm onun ismi aklıma gelmediği zaman şu kişiyle aynı diyerek kendime çağrışım yaparım",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5433453",
  "comments": [
    {
      "author": "SUPERSAIAN",
      "created_time": "January 08, 2023, 11:46:40 AM",
      "body": "Güzel pratik çözümler, zihninizde canlandırdığınız zaman bir kaç kere tekrarladığınız da hata yapma yada unutma olasılığınız azalıyor, bu yöntemi bende uyguluyorum günlük yaşantımda. Hatta bazen hayatımla ilgili önemli bir karar alacağım zaman manyetik alandan(telefon, modem, pc) uzak bir yerde oturup sadece zihnimde düşünmeye çalışıyorum a - b kararını alırsam nasıl olabilir diye çözümlemeye çalışıyorum işe yarıyor mu gerçekten de yarıyor.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cacabey_40",
      "created_time": "January 08, 2023, 06:29:06 PM",
      "body": "Pikniğe ve ava giderken gerçekten bir şeyleri unutmak insanı huzursuz ediyor. Bir gün pikniğe gittik her şey tamam, balıklar hazır, neyse acıktık mangal yapıcaz. Baktık çakmak yok. Ateşi unutmuşuz. Pikniğe gittiğimiz yerde çok sakin ve ıssız bir mekandı. Kırmızı benekli alabalık tutmak için gitmiştik. İnsan da yok birinden istesek. 2 saate yakın boş boş bekledik. Neyse bir çoban çıkageldi de ondan ateş isteyip mangalı yaktık. Bu bana ders oldu. Arabamda bıçak ve çakmak demirbaştır. Bir etkinlik planlanırken en baştan eksiklikleri listeleyip hazırlamak önemli. Yoksa etkinliğin tadı tuzu kaçıyor. Haa tuzu da unutmamak önemli.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "eightdots",
      "created_time": "January 09, 2023, 06:06:48 AM",
      "body": "Zihinde canlandırıldığında gerçekten eksikleri tamamlayabiliyorsunuz. Her zaman çözüm değil ama faydası büyük. Bazen de ne kadar unutmamaya çalışırsak o kadar aklımızdan çıkıyor. Ben de böyle durumlarda sürekli anımsatıcı eklerim. 1 hafta sonra gideceksem kampa, o hafta anımsatıya alacağım her şeyi not ederim aklıma geldikçe de eklerim. Sakin kafayla düşünmek ya da sizden önce sizin yapacağınız şeyi yapmış olan birine neleri götürdün, nelere ihtiyaç duydun gibi sorular sorup eksikleri tamamladığım da oldu. Bu da çok faydalı öneririm. İlla ki her düşündüğümüzü unutmadan alsak bile bilmediğimiz “bu da mı lazımmış” dediğimiz eşyalar çıkabiliyor. O yüzden birilerine sormak iyidir. En son kampa gitmeden eksiklerimi kamp videosu izleyerek tamamlamıştım. Kamp videoları bu konuda harika oluyor hem keyifle izliyorum hem de oradan görüp eksiklerimi tamamlıyorum. Örneği sadece kamp üzerinden verdim ama birçok şeylerde bu yöntemler izlenebilir.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "meser#",
      "created_time": "January 09, 2023, 07:12:13 AM",
      "body": "Suits dizisini izleyenler bilir, Louis Litt diye bir efsane ve onun vazgeçilmez aksesuarı Diktafon  İlerleyen zamanlarda yoğun bir iş hayatına sahip olursam unutmamak için bende bir diktafon alacağım. Şuan için ajandam unutmamam için yeterli oluyor",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ZekiBeyy",
      "created_time": "January 09, 2023, 11:18:40 AM",
      "body": "Quote from: meser# on January 09, 2023, 07:12:13 AMSuits dizisini izleyenler bilir, Louis Litt diye bir efsane ve onun vazgeçilmez aksesuarı Diktafon  İlerleyen zamanlarda yoğun bir iş hayatına sahip olursam unutmamak için bende bir diktafon alacağım. Şuan için ajandam unutmamam için yeterli oluyor  Bazen insan anlık olarak da unutkanlık yaşayabiliyor mesela bir şeyler yaparken aklınıza bir şey yada bir fikir geldi diyelim bunu bir kişiye söyleyeceğiniz esnada yada bir odadan diğerine geçtiğiniz esnada unuttunuz bu seferde o unutulan şeyi bulmak için öncesinde yaptığım işleri tekrarlıyorum genelde faydalı oluyor  Dediğim gibi şehirden uzak kamp yaptığınız yerlerde bir şeyler unutmak çok kötü oluyor. Çay yapacaksam hemen sıralıyorum tüp, çaydanlık, çay, su, şeker... aldım mı? almadım mı? çek ederek eksiksiz hale getirmiş oluyorum. Birde sepetinizi kendiniz doldurmanız daha sağlıklı başka birine dediğiniz zaman siz saysanız bile o kişi sepete doldururken atlayabilir yada unutabilir yada ikinci bir seçenek 1-2 gün öncesinde liste yapmak ve işaretleyerek sepet yapmak.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "totti67",
      "created_time": "January 09, 2023, 11:23:56 AM",
      "body": "Biz bu sorunu kendi aramızda şöyle çözüyoruz, tüm detayları kesinlikle atlamaz veya çok azını atlar ve de onlar da önemsiz olanlar olur dediklerimizle balığa gidiyoruz, böylelikle ortada mesele falan kalmıyor",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "l99l",
      "created_time": "January 09, 2023, 12:15:29 PM",
      "body": "Kamp olaylarında en önemli araçların(tool) unutulduğu taktirde o kamptan hayır gelmiyor. Her zaman bir listem vardı telefonumda, yazılı olarak da tutuyorum.Biz de bir keresinde gittiğimizde şişme yatak almayı unutmuşum o geceyi zor geçirdim. Hatırlamak ve unutmamak için faydalı tavsiyeler.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "RaltcoinsB",
      "created_time": "January 10, 2023, 12:07:54 PM",
      "body": "Quote from: meser# on January 09, 2023, 07:12:13 AMSuits dizisini izleyenler bilir, Louis Litt diye bir efsane ve onun vazgeçilmez aksesuarı Diktafon  İlerleyen zamanlarda yoğun bir iş hayatına sahip olursam unutmamak için bende bir diktafon alacağım. Şuan için ajandam unutmamam için yeterli oluyor  Diktafonu bizim fakülte birincisi bir abimiz her derste kullanıyordu bir de aklındaki soruları sorardı hocanın cevabı da orada olurdu not tutmazdı sadece diktafon sayesinde fakülte derecesiyle mezun oldu ayrıca biz 24-25 yaşında iken o 35 yaşındaydı ve hocalar mezun olurken ona baya sağlam iş buldu akademik kalsın istediler ama abimiz yaşı yüzünden kabul etmemişti bu aklıma geldi benim verimli yani",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Phoenix Anka",
      "created_time": "January 13, 2023, 04:41:42 AM",
      "body": "Güzel bir taktik uygulamışsınız hocam. Bende genellikle kağıtlara yazmayı ve kayıt altına almayı en sağlıklı yöntem olarak görürüm. Ne de olsa söz uçar yazı kalır demişler değil mi? Kayıtlar genellikle rutin işlerimi kapsamaz ancak alışverişe gideceksem, pikniğe daha önceden plan yapmışsam kesinlikle kağıda yazar, dolaba asarım aklıma geldikçe de eklemeler yaparım.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "püsür",
      "created_time": "January 13, 2023, 09:21:28 PM",
      "body": "Ben de bu taktiği uyguluyorum. Hatta evden çıkmadan bunu yaparsam eşim kızıyor ama o da %100 bir şey unutmuş oluyor. Küçükken çok unutkandım, bu sebeple bir şeyler unuta unuta ve acı çeke çeke öğrendim. Çok önemli bir şey olursa liste yapıyorum, üstünden iki kere geçiyorum. Bir de zihinde canlandırma yapıyorum. Canladırırken çoğunlukla insan liste yaparken bile aklına gelmeyen bir şeyi hatırlayabiliyor. Balayı için uzak bir yere gitmiştik ve alışveriş imkanı da yoktu. Oraya giderken tam evden çıkarken bu metotla bir şey hatırlamıştım ve neredeyse hayatımızı kurtarmıştı diyebilirim. Unutsaydım balayı rezil olacaktı. Önemli olaylar için bu yöntemi ben de öneririm.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "xzone",
      "created_time": "January 14, 2023, 12:51:55 PM",
      "body": "Konuya başka bir açıdan bakalım. Unutmamak ve hatırlamak için yapmanız gereken bir başka şey var. Doktor kontrolüne gitmek.Kan değerlerinize düzenli olarak baktırmalısınız. B12 eksikliği varsa unutkanlığın kralını yaşarsınız, yeri gelir kahvaltı yaptığınızı unutursunuz. Çözümü de çok basit, hap kullanarak eksikliğinizi kapatabilirsiniz. Biraz daha ileri seviyedeyse iğne kullanımına ihtiyaç duyuluyor",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kriminall",
      "created_time": "January 14, 2023, 03:14:19 PM",
      "body": "Quote from: xzone on January 14, 2023, 12:51:55 PMKonuya başka bir açıdan bakalım. Unutmamak ve hatırlamak için yapmanız gereken bir başka şey var. Doktor kontrolüne gitmek.Kan değerlerinize düzenli olarak baktırmalısınız. B12 eksikliği varsa unutkanlığın kralını yaşarsınız, yeri gelir kahvaltı yaptığınızı unutursunuz. Çözümü de çok basit, hap kullanarak eksikliğinizi kapatabilirsiniz. Biraz daha ileri seviyedeyse iğne kullanımına ihtiyaç duyuluyorB12 eksikliği yoksa ve yine unutkanlık varsa işte o zaman tehlike çanları çalıyor demektir, bir çok hastalığın başlangıcı anlamsız unutkanlıklar ile başlıyor, bildiğim kadarıyla bunların en bilineni alzheimer, b12 öncelik olmalı, b12 normal değerlerdeyse mutlaka bir uzmana danışmanızda fayda var, bunu da bu yararlı postun altına eklemek istedim,",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}