{
  "id": "topic_5398972",
  "title": "DaNNy001",
  "author": "DaNNy001",
  "created_time": "May 17, 2022, 05:45:18 AMLast edit: May 17, 2022, 10:19:49 AM by DaNNy001",
  "content": "Today I was convinced by a friend to take part in the interesting  lectures going on Bitcoin talk..The first time I had to do anything with Bitcoin was three years back when I first purchase a Bitcoin of small amount in my bitcoin wallet..at the time people all over locality was just talking about this amazing platform Bitcoin that if you can purchase a Bitcoin of 100$ and leave it in your wallet,it will grow to and change any moment from when you  bought it ...and for me I never knew it can be an (increasing or decreasing change) so I was very eager to try it out. So I bought Bitcoin of 75 $ in the wallet I created and left there till two days time to check if revelation are true..So after everything I went back to my wallet to check if my bitcoin has grown to better amount all to my greatest suprise.. Bitcoin of 75 $ reduce greatly to 47$ I was so scared I knew not that it can reduce too...so I immediately withdrawed everything having a loss ..and since then I am conscious with anything Bitcoin..",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5398972",
  "comments": [
    {
      "author": "pooya87",
      "created_time": "May 17, 2022, 05:51:42 AM",
      "body": "Your story is another sad commentary of what has been going on for as long as bitcoin existed. Unfortunately there are always some people who introduce bitcoin to others as something you can buy to make profit! But bitcoin is not a money making machine. It is a currency that is decentralized and is meant to be used as an alternative payment system to the existing centralized payment systems that are filled with numerous issues.The price and its long term rise (not short term like 2 days!) is only an additional benefit of this currency that unlike any other currencies has a limited supply.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "May 17, 2022, 06:13:42 AM",
      "body": "The first thing you really need to know before you buy bitcoin, is that bitcoin frequently goes up and down significantly within days and sometimes even within hours. If you're not a fan of those kinds of investments, bitcoin really isn't for you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Don Pedro Dinero",
      "created_time": "May 17, 2022, 06:14:51 AM",
      "body": "Quote from: DaNNy001 on May 17, 2022, 05:45:18 AMToday I was convinced by a friend to talk part in the interesting  lectures going on Bitcoin talk..The first time I had to do anything with Bitcoin was three years back when I first purchase a Bitcoin of small amount in my bitcoin wallet..at the time people all over locality was just talking about this amazing platform Bitcoin that if you can purchase a Bitcoin of 100$ and leave it in your wallet,it will grow to and change any moment from when you  bought it ...and for me I never knew it can be an (increasing or decreasing change) so I was very eager to try it out. So I bought Bitcoin of 75 $ in the wallet I created and left there till two days time to check if revelation are true..So after everything I went back to my wallet to check if my bitcoin has grown to better amount all to my greatest suprise.. Bitcoin of 75 $ reduce greatly to 47$ I was so scared I knew not that it can reduce too...so I immediately withdrawed everything having a loss ..and since then I am conscious with anything Bitcoin.. Your story doesn't add up. Or I don't know if you're not making yourself clear. You bought bitcoin for 75 USD three years ago and two days ago it was worth 47 USD?Bitcoin three years ago was worth 10 times less than it is now, so you should have been able to sell it for around 750 USD.I don't know if you're not explaining yourself well, you've been ripped off or you've left it in some non-custodial service where they charge you every few days for something.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "May 17, 2022, 06:25:49 AM",
      "body": "Thats a straighforward action from you but before purchasing any bitcoin make sure you are aware what aryou are buying cause its higly volatile asset which can let yout funds shrink if you buy at high price. Well I thunk you now knew what it means by that. You should study first on trading and everything related to blockchain cause its a risky investment. If you are a long time investor then thats fine but if that money is a burden for you when go down then you should think first.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Accardo",
      "created_time": "May 17, 2022, 09:26:47 AM",
      "body": "Quote from: Don Pedro Dinero on May 17, 2022, 06:14:51 AMQuote from: DaNNy001 on May 17, 2022, 05:45:18 AMToday I was convinced by a friend to talk part in the interesting  lectures going on Bitcoin talk..The first time I had to do anything with Bitcoin was three years back when I first purchase a Bitcoin of small amount in my bitcoin wallet..at the time people all over locality was just talking about this amazing platform Bitcoin that if you can purchase a Bitcoin of 100$ and leave it in your wallet,it will grow to and change any moment from when you  bought it ...and for me I never knew it can be an (increasing or decreasing change) so I was very eager to try it out. So I bought Bitcoin of 75 $ in the wallet I created and left there till two days time to check if revelation are true..So after everything I went back to my wallet to check if my bitcoin has grown to better amount all to my greatest suprise.. Bitcoin of 75 $ reduce greatly to 47$ I was so scared I knew not that it can reduce too...so I immediately withdrawed everything having a loss ..and since then I am conscious with anything Bitcoin.. Your story doesn't add up. Or I don't know if you're not making yourself clear. You bought bitcoin for 75 USD three years ago and two days ago it was worth 47 USD?Bitcoin three years ago was worth 10 times less than it is now, so you should have been able to sell it for around 750 USD.I don't know if you're not explaining yourself well, you've been ripped off or you've left it in some non-custodial service where they charge you every few days for something. I think you need to reread the post again and understand his view. From what I read, Op said he checked his investment after 2 days of buying the $75 worth of Bitcoin and the price plunged to $47. OP, you must give Bitcoin time to yeild profits. Just like he said, your coin would have been around $750 today (not sure) but definitely, if you allow Bitcoin for a long time either it rises or it falls. One thing is for sure, you cannot meet your bitcoin price the same way you left it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "_act_",
      "created_time": "May 17, 2022, 09:43:11 AM",
      "body": "Quote from: DaNNy001 on May 17, 2022, 05:45:18 AMBitcoin of 75 $ reduce greatly to 47$ I was so scared I knew not that it can reduce too...so I immediately withdrawed everything having a loss ..and since then I am conscious with anything Bitcoin..If you want to buy bitcoin as of this time, just know that you want to hold, holding it for two, three or more years will bring you profit, but not that you should panic and sell because the price decrease, that is the mistake you did, you buy during bull and sell during bear. All I can advice you for now is to use that money to buy bitcoin again when the price is still low and wait for 2 or more years before you sell but you may see profit before that time. You will see that people that told you that your money will increase are not lying by that time. But know that what can make your money increase can also make your money decrease, even in business, your money can increase or decrease. If investing in bitcoin, the profit is more after long time while short time investment prediction may not be accurate. It is good to buy during bear and sell during bull.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sunsilk",
      "created_time": "May 17, 2022, 09:45:56 AM",
      "body": "It's normal to had a panicked feeling as first time buyer and holder of bitcoin. Well, that's a good start that you've experienced the dump because you'll eventually realize that this is no easy market and those people that you see bragging their profits towards bitcoin did also went through the same experience as you.Well, don't lose hope.You're not alone on this journey as we're all having losses while we hold bitcoin. Start out your plan again and understand that what happened to you is the nature of bitcoin for being a volatile asset.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaNNy001",
      "created_time": "May 17, 2022, 10:28:13 AM",
      "body": "Thanks for the advice but I never knew I could still leave it and it will still rise to profit I can be able make use of ...Well it's a first time experience.. but now am ready to learn about Bitcoin more",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DdmrDdmr",
      "created_time": "May 17, 2022, 10:28:29 AM",
      "body": "Quote from: DaNNy001 on May 17, 2022, 05:45:18 AM<...>It’s rather confusing the way you expressed yourself, and I can see how both seen interpretations from your data can be derived (@pooya87’s and @Don Pedro Dinero):-   Recently bought, and checked the price 2 days ago.-   Bought in 2019 and checked the price 2 days ago.My semantical interpretation now (after a couple of re-reads) is the latter, which doesn’t add up, as mentioned, in terms of price:Going from 75$ worth to 47$ worth is a 37,33% drop in price. You would have has to have bought at around 48K $ roughly, which is not in the range of prices from three years ago.If we interpret the couple of days interval, it doesn't seem to match either. The closest would be if you had bought on around march 29th, when it was above 47K $.In any case, we shouldn’t really be interpreting, but rather have a clear picture of what you mean.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Daniel91",
      "created_time": "May 17, 2022, 11:13:37 AM",
      "body": "Quote from: DaNNy001 on May 17, 2022, 05:45:18 AMToday I was convinced by a friend to take part in the interesting  lectures going on Bitcoin talk..The first time I had to do anything with Bitcoin was three years back when I first purchase a Bitcoin of small amount in my bitcoin wallet..at the time people all over locality was just talking about this amazing platform Bitcoin that if you can purchase a Bitcoin of 100$ and leave it in your wallet,it will grow to and change any moment from when you  bought it ...and for me I never knew it can be an (increasing or decreasing change) so I was very eager to try it out. So I bought Bitcoin of 75 $ in the wallet I created and left there till two days time to check if revelation are true..So after everything I went back to my wallet to check if my bitcoin has grown to better amount all to my greatest suprise.. Bitcoin of 75 $ reduce greatly to 47$ I was so scared I knew not that it can reduce too...so I immediately withdrawed everything having a loss ..and since then I am conscious with anything Bitcoin..Unfortunately, you made the classic mistake of a beginner.Before making any investment, you must first thoroughly research the crypto market, understand what it is about, have a clear plan and exit strategy.Bitcoin and the crypto market behave like classic exchanges, so there are cycles of growth and decline and this is quite normal.A few days is too short a deadline for any conclusions, one has to wait a few months or years.And most importantly, you are at a loss or gain only when you sell your crypto, not before",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sunsilk",
      "created_time": "May 17, 2022, 11:22:57 AM",
      "body": "Quote from: DaNNy001 on May 17, 2022, 10:28:13 AMThanks for the advice but I never knew I could still leave it and it will still rise to profit I can be able make use of ...Well, now you know. That's what we do when we the price goes down. There's no need to panic now for you because that's very normal to bitcoin when you see it go down. Always remember the quote about; \"everything that goes up, must come down: everything that goes down ,must go up\".Quote from: DaNNy001 on May 17, 2022, 10:28:13 AMWell it's a first time experience.. but now am ready to learn about Bitcoin moreGood luck, you're about to do the right thing.  When bitcoin price goes down, it's the time to buy and don't panic. Set how long you'll hold bitcoin and that's how long you have to endure the pain in the market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Doan9269",
      "created_time": "May 17, 2022, 11:38:42 AM",
      "body": "Quote from: DaNNy001 on May 17, 2022, 05:45:18 AMSo I bought Bitcoin of 75 $ in the wallet I created and left there till two days time to check if revelation are true..The most saddest aspect of the story is that you did not take any further step or responsibility to search online what that bitcoin is all about, am sure you would have come to the realization of it volatility and the likes your friend couldn't wait to teach you, this personal discovey is what we should take very serious as important as the investment itself, had it been your bitcoin still remains in your wallet address link to the blockchain you would have been so amazed seeing what it could have turned to by now after three years. here on the platform we admonish newbies to as well make their personal research and discoveries about anything they encounter in cryptocurrency, imagine if part of the research you would have done had place you to discover this forum those three years back.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GiftedMAN",
      "created_time": "May 17, 2022, 05:14:36 PM",
      "body": "Quote from: DdmrDdmr on May 17, 2022, 10:28:29 AMQuote from: DaNNy001 on May 17, 2022, 05:45:18 AM<...>It’s rather confusing the way you expressed yourself, and I can see how both seen interpretations from your data can be derived (@pooya87’s and @Don Pedro Dinero):-   Recently bought, and checked the price 2 days ago.-   Bought in 2019 and checked the price 2 days ago.My semantical interpretation now (after a couple of re-reads) is the latter, which doesn’t add up, as mentioned, in terms of price:Going from 75$ worth to 47$ worth is a 37,33% drop in price. You would have has to have bought at around 48K $ roughly, which is not in the range of prices from three years ago.If we interpret the couple of days interval, it doesn't seem to match either. The closest would be if you had bought on around march 29th, when it was above 47K $.In any case, we shouldn’t really be interpreting, but rather have a clear picture of what you mean.I got a better understanding of what Op is trying to say after going through your analysis. When you get a wrong interpretation as a result of not having a clear picture of a post or something, you tend to remain in state of confusion.I think Op post here is different from his notion he needs to revisit his post.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "qwertyup23",
      "created_time": "May 17, 2022, 05:30:19 PM",
      "body": "Quote from: DaNNy001 on May 17, 2022, 05:45:18 AM...... <snip> So I bought Bitcoin of 75 $ in the wallet I created and left there till TWO DAYS time to check if revelation are true..So after everything I went back to my wallet to check if my bitcoin has grown to better amount all to my greatest suprise.. Bitcoin of 75 $ reduce greatly to 47$ I was so scared I knew not that it can reduce too...so I immediately withdrawed everything having a loss ..and since then I am conscious with anything Bitcoin..So I cut most of your messages and highlighted and bolded the important part of what you mentioned. Purchasing BTC is an investment- it is not like a magic trick where if you leave it for a matter of two days, you will definitely gain any profit. If it were this easy, then everyone would be considered as a millionaire. Though this may be the case, I do not blame you for such but it is still your responsibility to do your respective research on the subject before investing. Unfortunately, lots of newbie investors have done the same thing you just did. They invest into something due to the hype (without any research) and subsequently pull-out their investments when they see its price drop.I just hope you learn from this lesson as investing into cryptocurrencies is not a one trick pony.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NeuroticFish",
      "created_time": "May 17, 2022, 06:31:19 PM",
      "body": "Quote from: DaNNy001 on May 17, 2022, 05:45:18 AMBitcoin of 75 $ reduce greatly to 47$ I was so scared I knew not that it can reduce too...so I immediately withdrawed everything having a loss ..and since then I am conscious with anything Bitcoin..This is the typical story of newbie investor into Bitcoin. Find out about it in the middle of a bubble, FOMO-buy, don't read, then panic when the price goes down, sell and leave disappointed.You are not the first, nor the last, doing that. You are one of the few though that somehow managed to return to Bitcoin (or at least bitcointalk)Now do some reading. It won't be easy. You'll read that bitcoin price goes up and down pretty wildly and this is not something we're too worried about. You'll read that it matters where you buy your coins from, since the amount of scams rose exponentially, you'll read to avoid too-good-to-be-true business opportunities, you'll read that \"not your keys, not your coins\" and it's better to get your money into your wallet (but withdrawing can be costly), you'll read about keeping your wallet and its backup seed safely, you'll read that best to buy is DCA and even more you should invest only what you afford to lose, so you don't get scared again when your investment looks bad.It's quite some info to assimilate, but imho it worth it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nakamura12",
      "created_time": "May 17, 2022, 06:45:28 PM",
      "body": "Sad story you got there. I think you are just holding your bitcoin not very long and as far as I can tell you bought bitcoin at a wrong time. As you have known, bitcoin's price is not stable so it may increase or decrease at any time. Not too long ago, bitcoin price is at 40k dollars and now it's 30k dollars. Even at 10 hours time, I checked the price of bitcoin and I see it decrease by 5% and then increase by 5% and again decrease by 5%. As I said, it is not for short term holding.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GeorgeJohn",
      "created_time": "May 17, 2022, 07:55:58 PM",
      "body": "At first i have to welcomed you in the community of bitcointalk. Here is place you can advance your Bitcoin knowledge despite that you come in existence with bitcoin before and late you stopped... I will tell that bitcoin is investment you will run and get yourself relief of any disturbance from my perspective. Secondly bitcoin increment is not specific or direct to grow in one channel. Why people invest for long term is the ability to double what they used to purchase bitcoins. From my views the long you store bitcoin in the wallet the longer it grows",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mpamaegbu",
      "created_time": "May 20, 2022, 06:43:12 PM",
      "body": "Quote from: DaNNy001 on May 17, 2022, 05:45:18 AM~snipped~You lost $28 from your $75 investment and you freaked out. It's even less than 50% and they already sold. That's not how cryptos or Bitcoin works because it's not a get rich quick scheme. Besides, you said you bought this Bitcoin which you sold off in panic of loss three years ago. That should be in 2019, right? That was in the thick of bear season which prolonged to 2020. By last quarters of 2020, the bull season returned and Bitcoin went from as low as $3,200 to $64k+. If you had heDl, you would've been singing Bitcoin a sonnet by now.Quote from: pooya87 on May 17, 2022, 05:51:42 AMUnfortunately there are always some people who introduce bitcoin to others as something you can buy to make profit! But bitcoin is not a money making machine. It is a currency that is decentralized and is meant to be used as an alternative payment system to the existing centralized payment systems that are filled with numerous issues.You don't think the belief of a turnover is the major reason most people buy Bitcoin? Certainly, truth be told, that's the main reason most people hodl – the investment potential. Maybe there are a few who see Bitcoin as a payment channel but trust me, most see it as an asset and may not even know what decentralization is all about. This informs why people invest in Bitcoin, including institutional investors.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Shamm",
      "created_time": "May 20, 2022, 08:28:23 PM",
      "body": "I know how it feels Op and because of your greediness and lack of knowledge that's the reason why you've forced to sell your BTC in a short time  $75 to $45, it's a bad amount of loss. But you must remember to this Op that bitcoin is not for shortime investment or let say you would not get rich automatically when you buy a bitcoin. It takes time and you should wait for the right timing in order to grow.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}