{
  "id": "topic_5438580",
  "title": "EFS",
  "author": "EFS",
  "created_time": "February 07, 2023, 07:52:35 PM",
  "content": "As you may know, two very large earthquakes happened in a row in Türkiye on the same day. Earthquakes of magnitude 7.8 and 7.6 affected a very large part of the country. There was great destruction in 10 cities.One of the most active non-governmental organizations in the country \"Ahbap\" platform, listened to our voice. The founder of the platform, famous artist Haluk Levent shared his wallet addresses by obtaining permission from the state to collect donations with crypto-currency.You can donate by sending stablecoins to these addresses.https://twitter.com/haluklevent/status/1622926244512661504QuoteERC20 Network Transfers: 0xe1935271D1993434A1a59fE08f24891Dc5F398CdBEP20 Network Transfers: 0xB67705398fEd380a1CE02e77095fed64f8aCe463Avalanche Network Transfers: 0x868D27c361682462536DfE361f2e20B3A6f4dDD8At the moment, more than $2.5 million has been collected in these addresses of three chains.You can track the money collected so far here: https://portfolio.nansen.ai/dashboard/APE-JBS8U7In the past, it wasn't so easy to send money and donate internationally. But now, thanks to crypto-currencies we can do these transactions very quickly, easily and at no additional cost. If you want to help, you can donate with stablecoins such as BUSD, USDT, USDC.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5438580",
  "comments": [
    {
      "author": "karabiber",
      "created_time": "February 07, 2023, 07:59:21 PMLast edit: February 08, 2023, 05:30:32 AM by karabiber",
      "body": "My country is going through very difficult times. It will take many years to forget this pain. We did not learn from the 1999 earthquake and we cannot act against devastating earthquakes. Iskenderun, the country's most important port, is still on fire.  People have been in the rubble for hours and cannot be helped. Now we must do whatever we can.To donate blood you can reach the nearest blood donation point herehttps://www.kanver.org/KanHizmetleri/KanBagisiNoktalariYou can donate to STK https://ahbap.org  To volunteer in earthquake zoneshttps://www.tog.org.trFor free accommodationhttps://www.otelz.com/gecmisolsunturkiyem",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "eightdots",
      "created_time": "February 07, 2023, 08:24:50 PM",
      "body": "AHBAP, one of the most reliable non-governmental organizations in the country, is a platform that has proven itself by doing charity works in many fields. As you all know, after the great earthquakes in Turkey, the people living in that region need support. For this support, Haluk Levent shared his wallet addresses to collect donations with crypto money. We, the people of the crypto world, can take advantage of crypto's ability to share from anywhere in the world for such a support issue. For this, it is important to support the addresses opened with the permission of the state. My friends set out to go to the earthquake zone today. A lot of help is needed. We are trying to do our best. I hope everyone is well. Thanks to all crypto world users for their support.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EFS",
      "created_time": "February 07, 2023, 10:32:53 PM",
      "body": "Honestly I'm not a fan of AVAX but Ava Labs founder Emin Gün Sirer said that their foundation donated $1 million worth of AVAX.It's nice to see such support at these moments. The size of the disaster is so great that every penny counts.https://twitter.com/avalancheavax/status/1622975707528962049QuoteThe Avalanche Foundation has donated $1M in AVAX to the disaster relief efforts, organized by @haluklevent, for the earthquake that has affected Turkey and Syria. We encourage others to join the effort.Total donation amount in 3 chains is almost $2.7 million now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Apocollapse",
      "created_time": "February 08, 2023, 10:05:45 AM",
      "body": "Just to add, anyone can donate any coins they have as long as they send it to correct address on each network, I see few people even send a coin without any value to the donation address, it's either they're trolling or only willing to donate that.I tend to agree cryptos are really help a lot due to it's borderless transaction, some charity and organization ask for 5-10% additional cost which will reduce a lot money given to the affected people.I hope person behind the address are using hardware wallet and have a good knowledge about security.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pierre 2",
      "created_time": "February 08, 2023, 10:25:32 AM",
      "body": "Ahbap is legit and well loved non-profit organization. I hope our fellow forum members would look and donate a bit of their stable coins. Our government gave special permission to founder ahbap to receive stable coins through bep20, erc20 and avax. Your donations will not only help millions suffering under natural disaster. It will also show how strong crypto currencies are as method of donation. It can actually help people to convince government for further use of crypto currencies.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EFS",
      "created_time": "February 08, 2023, 10:39:27 AM",
      "body": "Waves founder Sasha said they donated $50k from Binance chain. Everyone is doing their best and we are thankful for that.https://twitter.com/sasha35625/status/1622967858983469056Quotehttps://bscscan.com/address/0xB67705398fEd380a1CE02e77095fed64f8aCe463 50.000 Dolar bağış yapıldı. #waves ekibi olarak Türk Halkının yanındayız. #WavesArmy sizi de destek olmak için bağış yapmaya davet ediyorum. Hep birlikte yaraları saralım. @ahbap @halukleventTotal crypto donation amount is $2.86 million now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "eightdots",
      "created_time": "February 08, 2023, 04:38:51 PM",
      "body": "You don't need to doubt the reliability of the shared AHBAP platform. Many trusted names donate to this platform. I would like to give an example from Merih Demiral. We see that Merih shows the AHBAP platform to donate on twitter and collects donations by auctioning Dybala and Bonucci jerseys after Cristiano Ronaldo. Footballers, artists and us users of the crypto world are trying to do something. Thanks again to everyone who supported.https://twitter.com/Merihdemiralhttps://twitter.com/ahbaphttps://twitter.com/Merihdemiral/status/1622999188320518144?cxt=HHwWgIC8qbXKhoYtAAAAhttps://twitter.com/Merihdemiral/status/1623051996633636870?cxt=HHwWjICx9aHMnoYtAAAA",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "püsür",
      "created_time": "February 08, 2023, 06:29:01 PM",
      "body": "I have also donated to 'Ahbap', the most trusted organization to donate at the moment. They are also very transparent about their activities and financial accounts. Totally non-profit and actually doing the most good. No BS. As it is pointed out above, stablecoin donations are perfect way to prove the use of crypto currencies.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "husdemba",
      "created_time": "February 08, 2023, 06:33:31 PM",
      "body": "Turkey experienced a great disaster. There are currently 9054 dead and thousands of people buried under the rubble. AHBAP association is the most appropriate organization to reach aid. Very good donations have been collected so far, but the pace has slowed. Please speed up donations and heal the wounds",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MArsland",
      "created_time": "February 08, 2023, 06:37:13 PM",
      "body": "Quote from: EFS on February 07, 2023, 07:52:35 PMIn the past, it wasn't so easy to send money and donate internationally. But now, thanks to crypto-currencies we can do these transactions very quickly, easily and at no additional cost. If you want to help, you can donate with stablecoins such as BUSD, USDT, USDC.You are right that stablecoins are good enough for alternative donations and by their stable nature, keep the value provided by donors equal to the amount given. Because maybe other altcoins are actually not a problem but for network problems, fluctuations in prices and costs need to be considered. With the presence of crypto, there is no reason not to be able to send across countries. In the past, you might have had to go through many stages, but now it's only in one hand and full control can be conveyed right away.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Silence Scream",
      "created_time": "February 08, 2023, 10:06:05 PM",
      "body": "The crypto money accumulated in the account, which was approximately $ 3.5 million. Thank you to everyone who has supported the Turkish people. We would also like to thank EFS, who created the Topic, for its sensitivity. AHBAP is a private non-governmental organization. Although it does not belong to the state, you can make your donations to the specified address with peace of mind, as it is very reliable by the Turkish people. I sent some humanitarian aid boxes to the area. Our friends also provide great help to the citizens who have to go there and live in the cold. The primary need of the region is earthquake tent and heater. The weather is really cold. I can sadly say that many people froze to death. One of the biggest disasters not only in Turkey but in the world has occurred.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o48o",
      "created_time": "February 09, 2023, 09:10:50 PM",
      "body": "Binance also airdropped $100 USD (in total $5M in TRY tokens) directly to their turkish users living in the destruction area. I am not sure if that's the best way to go as an organization with an infrastructure already in place can help more efficiently with proper funding.I guess those users need money if they are alive, but i am not sure if $100 would make much of a difference to my situation if i was living in the area.And i am not bashing Binance for giving money. That's very cool gesture from them. Just pointing out that i don't understand why not give to organizations that actually know what they are doing.Source",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EFS",
      "created_time": "February 09, 2023, 10:51:29 PM",
      "body": "Quote from: o48o on February 09, 2023, 09:10:50 PMBinance also airdropped $100 USD (in total $5M in TRY tokens) directly to their turkish users living in the destruction area. I am not sure if that's the best way to go as an organization with an infrastructure already in place can help more efficiently with proper funding.I guess those users need money if they are alive, but i am not sure if $100 would make much of a difference to my situation if i was living in the area.And i am not bashing Binance for giving money. That's very cool gesture from them. Just pointing out that i don't understand why not give to organizations that actually know what they are doing.It's better than nothing. Even government will pay only $500 for affected families. Binance made a nice move. I don't know how they will determine who's affected and who isn't though. I don't think many people verified their addresses in the site.Total donation amount passed $3.6 million. The momentum of donations has decreased but still continues.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "karabiber",
      "created_time": "February 10, 2023, 12:56:30 PMLast edit: February 13, 2023, 10:05:59 AM by karabiber",
      "body": "Vitalik Buterin this morning donated 1 ETH to the crypto aid account opened by the Ahbap Association for earthquake victims in Turkey. There are reactions to Vitalik for 1 ETH help and i think this donation is symbolic. I hope Vitalik will tweet soon and mobilize people to help support. He can do more than he does.Murat Pak sent him the amount of donation Vitalik made and made a statement by tagging Vitalik on Twitter.Vitalik Buterin donated 99 Ether.Vitalik continues to donate. Vitalik sent 50 ETH to Anka Relief.Again. Vitalik continues to donate. Vitalik sent 50 ETH to Anka Relief. Total donation was 150 ETH.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "eightdots",
      "created_time": "February 10, 2023, 07:01:32 PM",
      "body": "I think his support is symbolic and will continue to support it from now on. Vitalik Buterin is no ordinary figure for crypto. I think that he will display a behavior that will influence the majority and set an example. I hope I am not mistaken in this thought. In times like these, we all need the power of helping each other. We also need the power of crypto.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EFS",
      "created_time": "February 10, 2023, 07:07:35 PM",
      "body": "Quote from: eightdots on February 10, 2023, 07:01:32 PMQuote from: karabiber on February 10, 2023, 12:56:30 PMVitalik Buterin this morning donated 1 ETH to the crypto aid account opened by the Ahbap Association for earthquake victims in Turkey. There are reactions to Vitalik for 1 ETH help and i think this donation is symbolic. I hope Vitalik will tweet soon and mobilize people to help support. He can do more than he does.I think his support is symbolic and will continue to support it from now on. Vitalik Buterin is no ordinary figure for crypto. I think that he will display a behavior that will influence the majority and set an example. I hope I am not mistaken in this thought. In times like these, we all need the power of helping each other. We also need the power of crypto.I think it's straight disrespectful. Since he sent 1 ETH that means he saw the campaign and took an action. I'm not going to tell who should send how much money, but I see it as nothing but disrespectful to send such an amount. It would be better if he didn't send anything. I don't think he even realizes his rudeness. There are many people from many countries rushing to help. We can do well without Vitalik Buterin's fake support.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nakamura12",
      "created_time": "February 10, 2023, 07:24:34 PM",
      "body": "Quote from: EFS on February 10, 2023, 07:07:35 PMI think it's straight disrespectful. Since he sent 1 ETH that means he saw the campaign and took an action. I'm not going to tell who should send how much money, but I see it as nothing but disrespectful to send such an amount. It would be better if he didn't send anything. I don't think he even realizes his rudeness. There are many people from many countries rushing to help. We can do well without Vitalik Buterin's fake support.If I am the one who opened an account to receive donations then I wouldn't say that it is straight disrespectful to send an amount like that not to offend you or anyone. i am just saying my opinion about it and it is much better to receive donations on how much amount it is whether if it's coming from the heart and not for showing good reputation or a good heart through donation to make good public image but if he is only doing that to have a good public image then I wouldn't use it for the victims of earthquake even though it is very selfish of me for not using the money that vitalik's donation and donate it in other charity. As you have said it is very rude and it is fine not accepting his funds since there are other people who will donate their money for the sake of helping the victims and not something else other than helping as I have explained and I agree with you that he shouldn't send any amount if he is not really supporting as you have claimed or fake support as what I can read in your post.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BIT-BENDER",
      "created_time": "February 10, 2023, 08:19:23 PM",
      "body": "Indeed thanks to Crypto-currency that has made many financial issues or activities better. My heart goes out to any one affected personally or knows someone who was affected in this earthquake.Don’t have much but would send the little I have, also I believe since the system of donation is through Crypto-currency we can be sure that aid would get to the needed individual in shorter time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bangjoe",
      "created_time": "February 11, 2023, 03:52:29 PM",
      "body": "I thank the people who have provided assistance to victims of natural disasters that have befallen Turkish citizens, regarding any coin that is used as an intermediary tool to provide assistance, be it stablecoins or other altcoins, is a good thing, in my opinion, don't get hung up on the form of coins in crypto, any crypto is definitely received by those who are important maybe the crypto must have an exchange rate and also be easily exchanged to make it easier for humanitarian organizations or institutions to intercede for delivery to victims.No matter how small our help is in any form, hopefully we will get a better reward from God.#prayforturkey#getbettersoonturkey",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}