{
  "id": "topic_5464213",
  "title": "Hatchy",
  "author": "Hatchy",
  "created_time": "August 22, 2023, 08:50:22 PM",
  "content": "As government no dey show concern and dey restrict Bitcoin, e dey important make dem consider the bigger effect wey e fit get if we embrace Bitcoin for Nigeria as a whole. Bitcoin fit allow us tap into global network of innovation wey go help us grow economically, financially and technologically. Our young people wey plenty well for our country don already show interest for Bitcoin, and dem dey open way for new digital entrepreneurs and businesses. But e go make sense if government fit recognize the plenty potential wey dey inside Bitcoin and the technologies wey dey follow am. As I dey read some posts online, I come see say miners for Nigeria dey pass through plenty wahala. The one wey pain me pass be say I hear say miners dey hide the miners wey dem buy with their own money so dem fit pass customs. Dem dey pretend call am computer devices so dem fit bring am enter the country. This one just weak me. These men dey try their best to make sure say Nigeria still dey tap from Bitcoin network, but because of many wahala, dem dey hide or even dey discouraged. Another problem be say light no dey. As we sabi say mining dey use plenty power and e dey cost well well. For our country wey light sef no dey steady, e be like wahala. Now wey fuel price don high well well, and we fit even dey expect am to reach 1000 naira per litre, miners fit no get better alternative to electricity. Even solar energy wey dem fit use still dey cost plenty and e dey hard to maintain. All this matter just dey make me think say miners for our country fit no dey plenty at all because some people no go wan pass through all this stress. With all these things wey dey happen, I just wan talk say if you still dey Nigeria and you never sabi about Bitcoin, then you fit miss out on plenty things. If our miners fit dey do all these things then, no dull oo. d country dey experience recession and soon many fit turn to digital currency wey be Bitcoin as dem no go wan dey left behind. Wetin una see about this whole matter, my people?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5464213",
  "comments": [
    {
      "author": "Makus",
      "created_time": "August 22, 2023, 09:48:50 PM",
      "body": "The truth is just that, for mining to profit normal individual for this country e go hard well well, because only the amount electricity wey one miner dey consume sef, e no easy and e still con need standby electricity join am,  though some places still dey for the country wey light nor dey blink anyhow oo, but that one nor mean say other obstacles dem nor dey.To me oo, even if FG remove the restriction of the adoption of Bitcoin e no go still easy for individual Miner, unless many person go do cooperate joint business, and we all know say if that restriction commot sef na all those politicians dem nai go still get the largest mining farm, so dem fit even profit pass us for the Bitcoin adoption, but wickedness nor go let dem think reach that side.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "August 22, 2023, 10:23:13 PM",
      "body": "Which restirction? Nigeria government is not an enemy of bitcoin adoption. They even include 10% capital gain tax in the recent financial act. No much regulation yet in Nigeria that can restrict you from not having your own crypto business and ads if you know the right way to go about it.ASICs are not banned or restricted in Nigeria. If they are banned, they will not be imported. If imported illegally, custom will seize it. But you can see people on social media talking about bitcoin mining and about cryptocurrencies.I do not think we should blame Nigeria government because they are not an enemy to bitcoin adoption.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Timmzzy",
      "created_time": "August 23, 2023, 08:47:16 AM",
      "body": "For this current generation trust me say no body dey dull again oh many youth eyes don clear, and i come like the voltage wey people dey take now invest in bitcoin and other crypto assets, but the truth of the matter wey i go wan add join be say make them no carry live savings  money put inside oh.. because if you try am otilo is by the corner. but apart from bitcoin investment we still get forex too to chuok hand inside like make them sha get the basic knowledge of how the thing dey go. na my own part i feel say i wan add be that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Abu-Naim",
      "created_time": "August 23, 2023, 10:16:56 AM",
      "body": "Quote from: Hatchy on August 22, 2023, 08:50:22 PMWith all these things wey dey happen, I just wan talk say if you still dey Nigeria and you never sabi about Bitcoin, then you fit miss out on plenty things. If our miners fit dey do all these things then, no dull oo. d country dey experience recession and soon many fit turn to digital currency wey be Bitcoin as dem no go wan dey left behind. Wetin una see about this whole matter, my people?I know say our miners for Nigeria no fit they get too much profit due to lack of stable electricity supply and other regulations which we may not know about, but what I am confident in is that bitcoin can never fail us and it will be better we use our little money to buy bitcoin than taking them to banks because them bank charges and other things fit affect the money as well, and as inflation they now, the money wey we keep for bank no get value reach wetting we they expect in some times from now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kelward",
      "created_time": "August 26, 2023, 06:20:51 PM",
      "body": "Quote from: Charles-Tim on August 22, 2023, 10:23:13 PMWhich restirction? Nigeria government is not an enemy of bitcoin adoption. They even include 10% capital gain tax in the recent financial act. No much regulation yet in Nigeria that can restrict you from not having your own crypto business and ads if you know the right way to go about it.ASICs are not banned or restricted in Nigeria. If they are banned, they will not be imported. If imported illegally, custom will seize it. But you can see people on social media talking about bitcoin mining and about cryptocurrencies.I do not think we should blame Nigeria government because they are not an enemy to bitcoin adoption.True true, Nigeria government no be enemy of bitcoin, na only CBN wey be an agency of di government na dem put restrictions for bitcoin. But where I reason with di OP be say our government officials de harass young people too much, especially di police, if dem see especially youth's wey  carry anything wey resemble laptop or if dem see say dem carry big phones. I de talk from experience because I don witness am for many occasions. But all dat obstacles no suppose to deter us, so far say na genuine crtpto matter we de run. Di enlightenment, awareness and acceptance of cryptocurencies don de increase more for Nigeria, so I believe say with time every body go accept am say em don come to stay and tap into em benefit as an alternative globally recognized decentralized digital currency, wey dem even fit to de cash in from trading and investing in di coin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mate2237",
      "created_time": "August 26, 2023, 09:46:00 PM",
      "body": "Op you don strive for di compilation of the thread but you need some updates in the country about bitcoin matter dem. And di matter why we country never developed to the world standard is because we are the enemy of ourselves. If Nigeria want to adapt to the world innovative and technology space, it is very easy. But our leaders will not allow it to happen. As e bi like dis our government e no dey see di important of bitcoin and the bad advisers nai dey cause all these wahala. Nigeria government e no be di problem to accept bitcoin but na bad advisers na im get. And nobody want to tell am di truth. And one thing we have to k ow be say, the CBN can't do anything with the order of the government, so the banning of BTC by the CBN is ordered by the government. Just like what happened in the lekki toll gate. It was the president gave the order through the state government.I believed there was a time last year, Davidvictorson, Markinzo (the spelling is confusing) were asking to invest in Asic and cloud mining and I don't know how far their products have gone, so they might have small knowledge on the mining field because they initiated the process before. Light has been the issue of mega businesses in the kwantry though people are still doing it in their own way.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wiwo",
      "created_time": "August 26, 2023, 10:30:48 PM",
      "body": "Quote from: Charles-Tim on August 22, 2023, 10:23:13 PMWhich restirction? Nigeria government is not an enemy of bitcoin adoption. They even include 10% capital gain tax in the recent financial act. No much regulation yet in Nigeria that can restrict you from not having your own crypto business and ads if you know the right way to go about it.ASICs are not banned or restricted in Nigeria. If they are banned, they will not be imported. If imported illegally, custom will seize it. But you can see people on social media talking about bitcoin mining and about cryptocurrencies.I do not think we should blame Nigeria government because they are not an enemy to Bitcoin adoption.I agree with in some ways,  such as the government's stand concerning bitcoin/crypto in Nigeria,  but then where the government have failed is in the area of facility provisions and enabling environment to encourage bitcoin adoption and participation in its network in the form of mining Bitcoin,  such facilities are electricity,  security and Tax holidays for those importing computer hardware and software putting strict measures on ground to check those goods before being allowed into the country. If such measures are taken,  it will allow for more participation from the citizens who are already aware of Bitcoin at their own individual level,  and also one of the things that has been a limitation to the increasing number of Bitcoin mining in Nigeria is,  the lack of technicalities in most of the bitcoin adopters in Nigeria,  not many of them have the computer knowledge to successful run a bitcoin mining farm in Nigeria and since bitcoin is still in it early stage in Nigeria,  just a few people are willing to undergo training to become professional in that area,  since Bitcoin mining is one of the technical aspects of bitcoin it requires high tech knowledge to run it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "August 27, 2023, 10:54:31 AM",
      "body": "Quote from: Abu-Naim on August 23, 2023, 10:16:56 AMI know say our miners for Nigeria no fit they get too much profit due to lack of stable electricity supply and other regulations which we may not know about If you have enough money and leave your comfort zone to a city or town that has constant electricity supply in Nigeria after you have made your research about it, you will be surprised that the low cost of living will help you to make profit in bitcoin mining than you to be mining it in a well developed country with high cost of living. I saw a thread few days ago about report of countries that miners are more making money, four countries listed are African countries.Quote from: Abu-Naim on August 23, 2023, 10:16:56 AMbut what I am confident in is that bitcoin can never fail us and it will be better we use our little money to buy bitcoin than taking them to banks because them bank charges and other things fit affect the money as well, and as inflation they now, the money wey we keep for bank no get value reach wetting we they expect in some times from now.If you put naira in a fixed deposit, your naira will have certain percentage profit using annual profit yield. But this is not recommended because naira is a depreciating asset. In time like this, buying bitcoin is better. After massive bull run, you may prefer to use a domiciliary account and have some of your money in dollars, euro or pounds, or also have some on stable coins but which might lose peg which is the reason you should only use stable coin for low amount of money that you can afford to lose.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sokani",
      "created_time": "August 27, 2023, 01:11:07 PM",
      "body": "Quote from: Charles-Tim on August 27, 2023, 10:54:31 AMIf you have enough money and leave your comfort zone to a city or town that has constant electricity supply in Nigeria after you have made your research about it, you will be surprised that the low cost of living will help you to make profit in bitcoin mining than you to be mining it in a well developed country with high cost of living. Because of unavailable power supply or poor electricity in most places in Nigeria, I have never thought of this but what you said just opened up my mind. I com dey reason say e get some places in Nigeria wey dey enjoy free and steady light, like some oil producing communities, example na Omoku wey for Rivers state. Person fit take advantage of dis free and steady electricity, set up a mining farm dey run Bitcoin mining. So like dis electricity don comot for di cost of operation in running di Bitcoin farm. If di person get small money na to just back am up di farm with solar electricity to make sure di farm no go suffer any power outage.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sim_card",
      "created_time": "August 27, 2023, 07:51:41 PM",
      "body": "The truth be say Nigeria na country wey we get bad belle leaders wey want make only them get money so that you ho dey do Sir, sir for them. Most leaders know say we the youths of nowadays dey smart pass them and if them give us slight opportunity, say we go make money and no go send them again. All these na him make the government dey make life difficult for us,if not why Emiefele go ban crypto wey come make uniform men dey use am dey oppress people wey no know their left from their right. The truth be say e get some States and places wey mining go work for Naija base on their steady power supply for the area. But the problem be say one day government fit come put eye for your body to spoil your business if you don dey make profit. This is why you should forget about all this mining thing and buy bitcoin with those funds and hodli. With this method,nobody ho fit put eye for your body because them know no how much you worth.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}