{
  "id": "topic_5419895",
  "title": "Plaguedeath",
  "author": "Plaguedeath",
  "created_time": "November 08, 2022, 04:14:04 AM",
  "content": "What happened:  There's scam in Mining (Altcoins) section where the @OP is promoting cloud mining that offer 3% to 8% daily return as we know we're in bear market and it's impossible to mine for get such daily return. Even though you live in a country where electricity cost is cheap and has a lot mining rigs, it still can't reach 8% per day.Scammers Profile Link:  https://bitcointalk.org/index.php?action=profile;u=3515229Reference Link:  https://bitcointalk.org/index.php?topic=5419706.0Archived: https://archive.ph/U0VeTWebsite link: https://rebelminers.com/Archived: https://archive.ph/iyVCRFlag : https://bitcointalk.org/index.php?action=trust;flag=3049QuoteDomain Name: REBELMINERS.COMRegistry Domain ID: 2734957344_DOMAIN_COM-VRSNRegistrar WHOIS Server: whois.discount-domain.comRegistrar URL: http://gmo.jpUpdated Date: 2022-10-31T02:34:58ZCreation Date: 2022-10-28T08:59:18ZRegistry Expiry Date: 2023-10-28T08:59:18ZThe @OP itself admit it's cloud mining.Quote from: milex69 on November 07, 2022, 11:18:34 AMits a cloudmining..  try to go daapradar.. and search about smartcontract",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5419895",
  "comments": [
    {
      "author": "Don Pedro Dinero",
      "created_time": "November 08, 2022, 04:45:41 AM",
      "body": "Quote from: Plaguedeath on November 08, 2022, 04:14:04 AMWhat happened:  There's scam in Mining (Altcoins) section where the @OP is promoting cloud mining that offer 3% to 8% daily return as we know we're in bear market and it's impossible to mine for get such daily return. Even though you live in a country where electricity cost is cheap and has a lot mining rigs, it still can't reach 8% per day.Any 'business' that offers such returns is a scam. In bear market it is even more difficult, but it would still be a scam even if we were in bull market. I will support the flag and leave feedback to the profile as well. Well spotted.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "November 08, 2022, 09:15:33 AM",
      "body": "Quote from: Plaguedeath on November 08, 2022, 04:14:04 AMThere's scam in Mining (Altcoins) section where the @OP is promoting cloud mining that offer 3% to 8% daily return as we know we're in bear market and it's impossible to mine for get such daily return. Even during bull market, it is a scam. It is nothing more than a ponzi scheme.All cloud minings have no two more aims than to look for people that will invest, pay them, making them to tell family, friends and people they know about the high yield investment scheme, making more people to invest, while those that have invested before will invest again and can even double the money. But what happened at last is exit scam.I just wonder that some people can still be foolish to fall victim of this, but maybe because of ignorance.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pmalek",
      "created_time": "November 08, 2022, 09:30:32 AM",
      "body": "Just by reading the first couple of sentences in the OP, you can see all you need to know about the project and the person promoting it.Quote from: milex69 on November 07, 2022, 07:49:42 AMR*******.com is a decentralized application (dApp) projectIt operates in blockchain technology... This is just a bunch of keywords you often see in the crypto niche scattered around to give this scam more legitimacy and importance. Quote from: milex69 on November 07, 2022, 07:49:42 AMThe smart-contract was subjected to dapp high-level security audit to give further assurance that the investments will never be hacked, rugged nor stolen, not even by its creators. Oh, high-level security, awesome. Many DeFi platforms in the past that became the subjects of scams, hacks, and rug pulls also claimed they were thoroughly audited, had bulletproof security standards, and were unbreakable. We now have that went.  Quote from: Charles-Tim on November 08, 2022, 09:15:33 AMI just wonder that some people can still be foolish to fall victim of this, but maybe because of ignorance. And greed, don't forget about greed. That's the driving force for many.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TheUltraElite",
      "created_time": "November 08, 2022, 11:38:27 AM",
      "body": "Lets all face it, we all have been greedy but most of us here who have survived ponzis, scams and bear markets have been cunning enough to identify a scam within a few seconds. This comes from experience and from reading how people like us have been scammed by ponzi schemes getting reported in this forum.Greed and lack of experience will make some newbies fall for this. But the number of such projects getting posted here these days have reduced a lot. Most of them get red flagged and tagged that makes non-logged in users also aware of the red flag. I mostly see such scams getting promoted in telegram cold call PMs nowadays.Flag supported my side, obviously.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}