{
  "id": "topic_5416590",
  "title": "Team_MegaPari",
  "author": "Team_MegaPari",
  "created_time": "October 10, 2022, 10:25:35 AM",
  "content": "Hey guys.Choosing crypto in casinos has always also to do with more anonimous gambling. Anyway I'm curious how important is anonimity to you when you pay & play?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5416590",
  "comments": [
    {
      "author": "Oshosondy",
      "created_time": "October 10, 2022, 10:31:01 AM",
      "body": "Cryptocurrencies makes transactions easier and make cross border casino deposit and withdrawal very easy, unlike when I was using bet365 that take like 2 weeks before they credit my account. Most common casinos are now centralized and they are requiring KYC, but people are using the casinos and they are well trustworthy. As far as gambling is concerned, I am not bothered with anonymity, just as I was using fiat casinos before, and I like the fast withdrawal.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "swogerino",
      "created_time": "October 10, 2022, 10:34:22 AM",
      "body": "Quote from: Team_MegaPari on October 10, 2022, 10:25:35 AMHey guys.Choosing crypto in casinos has always also to do with more anonimous gambling. Anyway I'm curious how important is anonimity to you when you pay & play? For me is the utmost top priority and I prefer casinos who ask KYC only when you withdraw a certain amount of money which usually is somewhat high.Even when I win big I withdraw in small chunks I have no problems whatsoever by withdrawing with 0.01 Bitcoin which is not a relevant amount nowadays equivalent in dollars.I have withdrawn a lot of times from reputable casinos who may ask KYC only if that big amount withdraw is requested or they have some suspicions about your account,so far they have not asked me KYC or anything,they just let the withdraws through.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mauser",
      "created_time": "October 10, 2022, 10:42:10 AM",
      "body": "Quote from: Team_MegaPari on October 10, 2022, 10:25:35 AMHey guys.Choosing crypto in casinos has always also to do with more anonimous gambling. Anyway I'm curious how important is anonimity to you when you pay & play? For me the anonymity of online game is not really important. I don't mind if people know that I am a gambler, all of my friends and my whole family knows it for years already. Also gambling is legal and quite common in my country, in my city there are tons of small slot places and sports betting cafes. Every young man here as at least gambled once in his life. If I had to choose between anonymity and safety I would always go for safety in an online casino. I mainly prefer crypto casinos because it's easy to deposit and withdraw money, and it gives me a chance to increase my crypto holdings.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Plaguedeath",
      "created_time": "October 10, 2022, 10:56:45 AM",
      "body": "Anyone who choose casinos that has a rule about mandatory KYC aren't care with their anonymity anymore.Most of users in this forum are wearing KYC casino signature which mean they're promoting it and of course they're already start observing the casino and try to gamble. If they're not gamble on the casino where they promote, I'd say those users aren't a gamblers at all.People are want licensed casinos, of course they need to follow the regulations to enable KYC rule.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jemzx00",
      "created_time": "October 10, 2022, 10:57:06 AM",
      "body": "My anonymity in regard to gambling depends on the platform itself as I don't really want to provide any personal information or KYC however, I already did on some platforms that I personally trust and have been a user for a long time. I've been with more than 15 online casinos already and I've done only 2 or 3 KYC on these gambling platforms since most of my gambling activities are from those websites. So far, I've only encountered 3 casinos that asked me for KYC to be able to regain access to my account and I'd just let it go since I don't really trust those websites. But on most casinos that I haven't did the KYC, they just allow me to gamble until now, probably because of the amount I've gambled.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Haunebu",
      "created_time": "October 10, 2022, 11:03:06 AM",
      "body": "Anonymity is the primary reason why I dabbled with crypto gambling in the first place which is why it matters a lot to me. I most probably wouldn't have shifted to crypto gambling from FIAT gambling if it weren't for the anonymity factor.This is also why I detest any form of mandatory KYC and avoid casinos that enforce such centralised policies.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gantez",
      "created_time": "October 10, 2022, 11:07:06 AM",
      "body": "Gambling is a choice and not what we say is by force or by impulse to do. It is those who want to be secret about it that will concern so much about the anonymity of their person or status.There can be some reason people do stay anonymous like especially married people who want the wife and family knowing about it, the clergy sure will prefer to stay away from the public and gamble and we know the reason. The higher people that people are looking up to in the society. Those that win big also can decide anonymity because they don't like public to know about them.  Apart from them , it doesn't matter you staying anonymous in gambling when you are not forced to do it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rruchi man",
      "created_time": "October 10, 2022, 11:27:55 AM",
      "body": "Quote from: Team_MegaPari on October 10, 2022, 10:25:35 AMChoosing crypto in casinos has always also to do with more anonimous gambling. The anonymity that many may seek when gambling may not necessarily be concerned with the casino but people. Some people who do not like to physically visit a casino maybe to avoid stereotype or be tagged as irresponsible by people who do not understand, or may judge them due to their position, online gambling with crypto offers that anonymity that they desire. Quote from: Team_MegaPari on October 10, 2022, 10:25:35 AMAnyway I'm curious how important is anonimity to you when you pay & play? You should be careful while pursuing anonymity on gambling platforms. So you don't make it cloud your judgement/perception, and then you subscribe for an online gambling platform that turns out to be a scam but you couldn't detect it because you liked the fact that they did not ask you for any form of verification.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PX-Z",
      "created_time": "October 10, 2022, 11:53:27 AM",
      "body": "Quote from: swogerino on October 10, 2022, 10:34:22 AMI have withdrawn a lot of times from reputable casinos who may ask KYC only if that big amount withdraw is requested or they have some suspicions about your account,so far they have not asked me KYC or anything,they just let the withdraws through.Make sense, this is a casino people usually preferred. Although, the OP is asking the importance of anonymity, this  case doesn't suit as providing the KYC is contradicting to anonymity. Well, as long as there is a reputed casino that doesn't require KYC then why not plus a deposit transaction from a custodial wallet is enough for being anonymous (IMO).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "maydna",
      "created_time": "October 10, 2022, 12:01:18 PM",
      "body": "Anonymity when gambling using crypto can make us hide behind a curtain so that people around us will not know about our gambling activities. We can also protect our identity in gambling because we can send money from wallets that support anonymity.I use crypto to gamble at crypto casinos because crypto casinos don't ask for our identity. But the government doesn't like this and is asking casinos to KYC on their members.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Saisher",
      "created_time": "October 10, 2022, 12:09:56 PM",
      "body": "Quote from: Team_MegaPari on October 10, 2022, 10:25:35 AMHey guys.Choosing crypto in casinos has always also to do with more anonimous gambling. Anyway I'm curious how important is anonimity to you when you pay & play? Anonymity is very important to me so far none of the casinos I signup and plays asked me to do KYC maybe because I am not a high roller and I'm always logged in to the same computer and IP that is the reason why Cryptocurrency adoption of casinos becomes popular because of the anonymity they provided for every player, but always expect to be asked KYC you just never know, they have it in their terms that they will ask KYC under some circumstances they stated in their TOS.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Adbitco",
      "created_time": "October 10, 2022, 12:24:15 PM",
      "body": "You might feel not secure while dealing with cryptocurrency but I have to say to you is the most convenient way to gamble with, with cryptos you can make deposit of btc or any crypto currency and then withdraw with another cryptocurrencies of your choice, this doesn't applicable to local betting shop where you only make deposit and withdraw with your local currency only. In online gambling you must take note to adhere strictly to their rules and regulations in terms of kyc compliance which is also one major thing which you can't skip or shy from, nowadays people don't like exposing their real identities to gambling site.If you wanna gamble online with cryptocurrency all you needs is to get the best rated cryptocurrency wallet where to store your fund or making an account in trusted and reliable exchange to fund your betting account otherwise you could use p2p to fund your online casino account.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "avikz",
      "created_time": "October 10, 2022, 12:49:39 PM",
      "body": "Quote from: Team_MegaPari on October 10, 2022, 10:25:35 AMHey guys.Choosing crypto in casinos has always also to do with more anonimous gambling. Anyway I'm curious how important is anonimity to you when you pay & play? I would say it's very very important, at least for me! There are multiple countries in Asia where gambling is legally banned. So there is always a risk factor. So staying anonymous is very important for the gamblers from such countries. No KYC rule 8s very important and that's one of the major decision making factor for many people while choosing a gambling platform. Whenever, there is a new platform appears in the market, that's the most frequently asked question in this forum whether there is a requirement of KYC or not!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "robelneo",
      "created_time": "October 10, 2022, 12:51:06 PM",
      "body": "Quote from: Team_MegaPari on October 10, 2022, 10:25:35 AMHey guys.Choosing crypto in casinos has always also to do with more anonimous gambling. Anyway I'm curious how important is anonimity to you when you pay & play? This is the privilege of playing in Cryptocurrency based casinos, you are not exposed and you are not in danger of getting your vital information sold in the black market, anonymity in gambling is very important for players it keeps you safe from having your financial capability and your status, that is why the Cryptocurrency based casinos are on the rise, majority of players will always choose protection and they can get this protection through anonimity.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "seoincorporation",
      "created_time": "October 10, 2022, 01:24:58 PM",
      "body": "Quote from: robelneo on October 10, 2022, 12:51:06 PMThis is the privilege of playing in Cryptocurrency based casinos, you are not exposed and you are not in danger of getting your vital information sold in the black market, anonymity in gambling is very important for players it keeps you safe from having your financial capability and your status, that is why the Cryptocurrency based casinos are on the rise, majority of players will always choose protection and they can get this protection through anonimity.I'm not sure about this because nowadays most of casinos has KYC, I'm not saying the casinos sold your data on the dark market, but if the casino gets Hacked then the personal data of their users could get exposed to the bad guys and sold in the dark market.Cryptocasinos doesn't provided anonymity at all, they need to know who their users are to avoid money laundering, it's one of the rules from the license providers.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yamifoud",
      "created_time": "October 10, 2022, 01:44:16 PM",
      "body": "Anonymity in gambling is somewhat close to its end as most gambling sites now are requiring KYC. But never say it was a problem unless it was not a trusted site which most people are worried about. Whether we like it or not, a time will come KYC is mandatory, and puts no excuse for us not to do this if we want to gamble. As long as we are using trusted gambling sites, we believe that our personal identities are safe. Some people say they are afraid about their identities sold in the market, that might happen if we handed our KYC to strangers and scam sites.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coin-investor",
      "created_time": "October 10, 2022, 02:35:57 PM",
      "body": "Quote from: Team_MegaPari on October 10, 2022, 10:25:35 AMHey guys.Choosing crypto in casinos has always also to do with more anonimous gambling. Anyway I'm curious how important is anonimity to you when you pay & play? Who would not want anonymity when dealing with gambling, when you are anonymous you are comfortable knowing that your sensitive information is safe, if you're working in a government financial institution you don't want to be bribed by unscrupulous casinos from exposing who you are and what position you're holding so if what extend gamblers want anonymity they want total anonymity as much as the casino can give them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "abel1337",
      "created_time": "October 10, 2022, 03:41:43 PM",
      "body": "It's true that most crypto casino now is doing KYC and the reputable once are also requiring it. I don't like KYC, Well it's for the majority. I miss the days where most crypto casino is not requiring KYC from their gamblers, compared to our current time where it is normal for crypto casino to collect identification from their customer especially if you are doing large withdrawals. A gambler should always be ready to give up their identity when they plan to play on casinos.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Renampun",
      "created_time": "October 10, 2022, 04:00:25 PM",
      "body": "Quote from: Team_MegaPari on October 10, 2022, 10:25:35 AMHey guys.Choosing crypto in casinos has always also to do with more anonimous gambling. Anyway I'm curious how important is anonimity to you when you pay & play? being anonymous when playing gambling is important IMO, my country strictly prohibits anything in the form of gambling, and those who violate it will be severely punished, it's funny if my house is visited by the police just because they know the online gambling activities that I do.I have a family that I love very much, I don't want their future to be ruined just because of a small stupidity that I did that's why I chose to be anonymous. being anonymous makes happier.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}