{
  "id": "topic_5413611",
  "title": "Hydrogen",
  "author": "Hydrogen",
  "created_time": "September 14, 2022, 11:55:36 PM",
  "content": "QuoteThe supply chain issues have no end in sight, so manufacturers are being forced to improvise.AS THE GLOBAL chip shortage stretches toward the two-year mark, manufacturers are pulling some unusual tricks to keep production lines moving. Carmakers are using semiconductors taken from washing machines, rewriting code to use less silicon, and even shipping their products without some chips while promising to add them in later. With the shortage of semiconductors now a new normal, everyone is being forced to adapt.“There's desperation in the market,” says Bill Wiseman, a senior partner at the consulting firm McKinsey. “If you’re building a $350,000 mass spectrometer, and you can't ship it because you don't have a 50-cent chip, you’re pretty much willing to pay anything.”McKinsey has tapped into the sense of urgency by creating a team dedicated to sourcing chips for the companies it consults for. Wiseman says the team will look beyond regular supply chains and has found much-needed chips in countries including Morocco, the Netherlands, and Japan. They have also been able to identify chips that may be slightly different from the ones originally called for. Manufacturers and brokers are, of course, able to charge a premium, and companies have little choice but to pay. “The chips actually are out there,” Wiseman says. “It's just a question of finding and getting them.”In some cases, this means taking desperate measures. Last month, Peter Wennink, CEO of the Dutch company ASML, which makes the complex machines needed to mint cutting-edge computer chips, revealed another eye-opening example. Wennink says one large industrial conglomerate had resorted to buying washing machines just to scavenge the chips inside them for its products.The chip shortage was caused by several factors, including a rush to buy electronics needed to work from home in the pandemic, a hoarding of chips sparked by trade tensions between the US and China, and disruption to flow of components through a complex semiconductor supply chain distributed around the globe.The crisis has highlighted how crucial semiconductors are to the economy and has shown how brittle many supply chains are. Industries that have been badly affected include consumer electronics, LED and other lighting, energy, and automotive. At the beginning of the pandemic, car makers halted production and canceled orders for chips, before being blindsided by an uptick in demand. Having fallen to the back of the queue for chip orders, auto firms have been struggling to catch up ever since.Carmakers have taken to stripping features from vehicles rather than shut down production lines. Last September, Cadillac said it would remove the hands-free driving feature from some vehicles. In November, Tesla started selling cars without USB ports. And this May, Ford said it would ship some models without chips for noncritical features like heating controls and would have dealers add them at a later date.Mike Juran, CEO of Altia, a company that makes software for building interfaces for cars and appliances, says many companies are rewriting their code so that it works with different chips or so that a single chip does double the work. In some cases, Juran says, companies are using chips that are as much as 10 years old. “They’re swapping out chips with what's available,” he says. “We get them to go back to old chips that were, like, sitting in warehouses, that weren't cutting edge, but we can get the same GUI on there.”The chip crunch is dragging on partly because new issues, including Covid outbreaks in China and the war in Ukraine, are contributing to the supply chain chaos.The crisis is also creating new opportunities for some companies. Smith & Associates, an electronic components broker, has hired 300 staff since the pandemic began, on top of a staff of 500, says Matt Hartzell, the company’s chief administrative officer. “Salaries have pumped up to all-time highs,” he says. Hartzell adds that while a few companies have canceled products, many are doing whatever they can to keep production lines running. Chiplitics, a startup that has licensed technology from Sandia National Laboratories, has developed a more efficient way to quickly spot counterfeit chips by sending a signal through them. Spotting fakes is a critical issue for chip brokers and manufacturers looking to source chips quickly.Dan Hutcheson, an analyst at TechInsights, who follows the chip industry, says companies have taken desperate measures to deal with previous shortages, including harvesting chips from other products. He also warns that the shortage could quickly turn into a glut, as the economy cools and demand for new products slows. But he also wonders if the current shortage might have another explanation. “There has to be hoarding out there,” Hutcheson says. “I think chips are the new toilet paper.”https://www.wired.com/story/chip-shortage-hacks/....Tesla shipping cars without USB ports. Ford selling cars without heating controls. Both with plans to add components later as they become available.I had no idea supply chain disruptions were still so severe in 2022. Nearly 2 years after they first began during the 2020 pandemic.At the moment the cost of constructing a semiconductor foundry is too expensive for wealthy billionaires like Elon Musk to afford. What is needed is a technology breakthrough to reduce the cost and exclusivity factor of semiconductor fabrication. I'm not certain exactly where the cost bottleneck is. If its in skilled labor, manufacture of materials and equipment or development of software. Aspects of markets which make the cost of semiconductor fab prohibitive could be easy or difficult to overcome depending on their nature.Hopefully we'll see the breakthroughs needed for markets to stabilize.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5413611",
  "comments": [
    {
      "author": "dansus021",
      "created_time": "September 15, 2022, 01:15:54 AM",
      "body": "yeah in my opinion the chip shortage cant cath up with the demand after covid hit and the war make everything become expensive too. the end of chip shortage is three1. the demand low (which is impossible since everything adopting chip for the product)2. increase the production rate ( that make manufacture overwhelmed i don't this is an option )3. build new factory (that can still make delay because the factory can build in one month or two)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "2stout",
      "created_time": "September 15, 2022, 03:17:20 AM",
      "body": "And in the end it's the consumer/customer that gets the shaft or short end of the stick as in many of these cases, the prices still remain the same even though some components are not included any longer.  I would substitute Hacking in the OP for Short Changing- Companies Are Short Changing Their Way Around the Chip Shortage.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zasad@",
      "created_time": "September 15, 2022, 07:53:24 AM",
      "body": "Do you agree that modern budgetary cars are crap?Automakers are chasing big profits, so they make it so expensive and unprofitable to use a car in 5-7 years. It is cheaper to buy a new car on lease.What good budgetary cars did Fiat make in the 60sFiat 124https://motor.ru/stories/fiat-124-dolce-vita.htm",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Obito",
      "created_time": "September 15, 2022, 08:37:48 AM",
      "body": "That's because we want to make everything around us electronic so we end up losing supplies real fast, I don't think we need a smart car, with the prevalence of hacking, you don't want to be in a car that don't have any controls because it got hacked. The reason why we don't see this disruption that much is because the global supply chain is sturdy and the people who manages it knows how catastrophic a total disruption is so they do everything they can to put fail safes or make it stronger.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NeuroticFish",
      "created_time": "September 15, 2022, 01:29:21 PM",
      "body": "Quote from: Hydrogen on September 14, 2022, 11:55:36 PMTesla shipping cars without USB ports. Ford selling cars without heating controls. Both with plans to add components later as they become available.I had no idea supply chain disruptions were still so severe in 2022.It's bad. I've heard of things like you said. Even more, it has happened that one was requested to pay the advance payment for a new car and the dealer could not give a deadline at all for when the car will be delivered (and ask \"you prefer me to lie to you?\"). Plus they all got more expensive.But both EU and US are pushing the creation of new chip factories, so this madness will end soon (although the energy madness may drag the things a little more). Hopefully in much less than 2 years.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zasad@",
      "created_time": "September 16, 2022, 02:53:40 PM",
      "body": "Quote from: Obito on September 15, 2022, 08:37:48 AMThat's because we want to make everything around us electronic so we end up losing supplies real fast, I don't think we need a smart car, with the prevalence of hacking, you don't want to be in a car that don't have any controls because it got hacked. The reason why we don't see this disruption that much is because the global supply chain is sturdy and the people who manages it knows how catastrophic a total disruption is so they do everything they can to put fail safes or make it stronger.We don't want this, but the manufacturers of cars and other equipment want it to make a lot of money, so they release new models every year and put more chips in their products. this will lead humanity to a new digital concentration camp, as is happening in China.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tbterryboy",
      "created_time": "September 17, 2022, 11:45:03 AM",
      "body": "Quote from: zasad@ on September 16, 2022, 02:53:40 PMQuote from: Obito on September 15, 2022, 08:37:48 AMThat's because we want to make everything around us electronic so we end up losing supplies real fast, I don't think we need a smart car, with the prevalence of hacking, you don't want to be in a car that don't have any controls because it got hacked. The reason why we don't see this disruption that much is because the global supply chain is sturdy and the people who manages it knows how catastrophic a total disruption is so they do everything they can to put fail safes or make it stronger.We don't want this, but the manufacturers of cars and other equipment want it to make a lot of money, so they release new models every year and put more chips in their products. this will lead humanity to a new digital concentration camp, as is happening in China.No, there are actually people who want this and those people are not contented on what they already owned but they always want the newest model that are being released in the market. They are the target by those companies who non stop creating new models.For some, those models are not necessary anymore as what is important for them is that they can have something to use and they are contented with that already, as that alone can already improve their life. Not only that new models are expensive but there's also a danger on using them like Obito said, they can get hacked and what if that happens in the middle of the road?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NeuroticFish",
      "created_time": "September 17, 2022, 08:20:36 PM",
      "body": "Quote from: zasad@ on September 16, 2022, 02:53:40 PMWe don't want this, but the manufacturers of cars and other equipment want it to make a lot of money, so they release new models every year and put more chips in their products. this will lead humanity to a new digital concentration camp, as is happening in China.Many people love to see their car can estimate how many miles their car can go with the current amount of gasoline, many love to see their car announce them when they don't keep the line, many would prefer more features like this.Some know that this kind of complication makes the car easier to break and harder to fix, especially when some chips work erratically or not at all.And some are just afraid or nostalgic about \"how good were the cars <insert number here> years ago\".I am not sure what you say about China and the chips. I know that in there facial recognition is not just allowed, but used at an increasing scale, which can be a problem. In EU the laws seem to go in a better direction though.But \"digital concentration camp\"? I hope you're not expecting Skynet get alive any day now...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}