{
  "id": "topic_5421185",
  "title": "Not your key not your BTC",
  "author": "Not your key not your BTC",
  "created_time": "November 16, 2022, 01:52:32 AM",
  "content": "I keep my crypto folio on goodle drive and partial on one drive.I read reminder news on top page and still doubt to keep staying or moving it.what your thought?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5421185",
  "comments": [
    {
      "author": "Charles-Tim",
      "created_time": "November 16, 2022, 01:57:04 AM",
      "body": "Do away with anything that has to do with backup of seed phrase or private key on cloud or anything that has to do with online backup, it is not safe. Do offline backup, like on paper, laminated paper or metallic sheet. Two or three separate backup in different locations is highly recommended.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SquirrelJulietGarden",
      "created_time": "November 16, 2022, 02:04:21 AM",
      "body": "Quote from: Not your key not your BTC on November 16, 2022, 01:52:32 AMI keep my crypto folio on goodle drive and partial on one drive.Do you have control on Google Drive or One Drive?It is a similar story to \"Not your keys, not your coins\".You try to backup your wallet, save your keys, your wallet seeds but unfortunately you ended by storing it in Google Drive or OneDrive which you don't actually control. What if Google Drive or OneDrive have serious data leak, hacks, etc.Why do you not trust exchanges but trust Google or Microsoft which are centralized corporations too?If you want to save your backup, save it offline, in a vault which is against fire, water, pressure ...You can write your key / seed down and store it offline, safely and secretly.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jackg",
      "created_time": "November 16, 2022, 03:13:47 AM",
      "body": "Offline backups are the best way to store your funds.the nmemonic makes it quite easy to do too. Onedrive is a problematic place for storing data as it'll get deleted after 3 years anyway if you don't use it much.If you store a securely encrypted wallet on cloud storage, it's likely safe but you also need a strong random password and memorising your nmemonic is about as complex as memorising a secure password so I see it as pointless..",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lien Uiryen",
      "created_time": "November 16, 2022, 03:24:52 AM",
      "body": "If you don't believe that the exchange is afraid of hacker attacks, no matter what software it is, it will be hacked. Everyone recommends that you use a cold wallet: by keeping the private key offline and never touching the Internet, it can effectively prevent hackers from stealing it.Before, some people would say, I only have such a little money, can hackers still see this money? But hackers don’t care about that much. They want to conquer everything. (However, most people do not have a large amount of funds, and they will use hot wallets or directly in the exchange)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "November 16, 2022, 03:39:10 AM",
      "body": "A Ledger or Trezor hardware wallet, and write down the backup on a piece of paper(or 2, and store it on 2 different locations). That's it. Don't try to complicate things.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Free Market Capitalist",
      "created_time": "November 16, 2022, 04:44:21 AM",
      "body": "Quote from: Not your key not your BTC on November 16, 2022, 01:52:32 AMI keep my crypto folio on goodle drive and partial on one drive.I read reminder news on top page and still doubt to keep staying or moving it.what your thought?It seems like a bad joke that you have chosen for your nickname: \"Not your key not your BTC\"No, it has already been explained to you. Move those funds from the cloud to cold storage ASAP if you don't want to lose them. I hope we are talking about low amounts, I can't imagine you have millions and are asking that question.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Plaguedeath",
      "created_time": "November 16, 2022, 04:46:50 AM",
      "body": "I don't really understand what does you mean about keep your money in cloud, but you need to know cloud and the other online storage isn't safe and very vulnerable against hacker or malicious virus.Quote from: mk4 on November 16, 2022, 03:39:10 AMA Ledger or Trezor hardware wallet, and write down the backup on a piece of paper(or 2, and store it on 2 different locations). That's it. Don't try to complicate things.I wouldn't recommend to backup the seeds phrase on a paper because it can be easily destroyed by fire or water, also when you hold for a long time usually you can miss few words from your written since the quality isn't same anymore. I'd recommend to backup using steel plates that resistant against fire, water, corrosion etc.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "wxa7115",
      "created_time": "November 16, 2022, 04:57:14 AM",
      "body": "Quote from: Not your key not your BTC on November 16, 2022, 01:52:32 AMI keep my crypto folio on goodle drive and partial on one drive.I read reminder news on top page and still doubt to keep staying or moving it.what your thought?No backups should ever be online, you have no control at all over how long the information you store on the cloud will be there, so it is be be assumed that once you upload that information it will be somewhere on the Goggle servers as long as the company keeps existing.So if I was you I will move my coins from those wallets to a new set of wallets of which the only backup that exist is a psychical one, this is more impractical than your current setup but it is way more secure, and at the end that is all what matters.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Free Market Capitalist",
      "created_time": "November 16, 2022, 04:59:10 AM",
      "body": "Quote from: Plaguedeath on November 16, 2022, 04:46:50 AMI don't really understand what does you mean about keep your money in cloud, but you need to know cloud and the other online storage isn't safe and very vulnerable against hacker or malicious virus.Quote from: mk4 on November 16, 2022, 03:39:10 AMA Ledger or Trezor hardware wallet, and write down the backup on a piece of paper(or 2, and store it on 2 different locations). That's it. Don't try to complicate things.I wouldn't recommend to backup the seeds phrase on a paper because it can be easily destroyed by fire or water, also when you hold for a long time usually you can miss few words from your written since the quality isn't same anymore. I'd recommend to backup using steel plates that resistant against fire, water, corrosion etc.If you notice, he is saying to write the seeds on two pieces of paper and store them in two different locations. The probability of getting the two papers burned or wet is practically 0, and the steel plates are also not 100% safe because they attract the attention of potential thieves and kidnappers, while the papers are easily camouflaged. There is no system that is 100% secure, although some are more secure than others, but in this case having the papers in two locations is quite secure and used by many people.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "November 16, 2022, 05:14:50 AM",
      "body": "It is not as bad as storing your coins in an account where you have zero control over your keys or your money but it it still pretty bad because those accounts could be hacked and the attacker could gain access to your coins or there could be other kinds of problems such as your account being shut down by that company for whatever reason such as violating their ToS, etc. with the same result of you losing access to your own money.The only good choice is cold storage https://en.bitcoin.it/wiki/Cold_storage",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kakmakr",
      "created_time": "November 16, 2022, 05:34:41 AM",
      "body": "Please remove it immediately, because it is not safe and it has been proven ....over and over again. Cloud storage is not suitable at all for any storage of valuable information or something with monetary value. It is well known that everything that are being stored in these cloud storage services are being scrutinized by private and government organizations. (It is a honey pot of information for them and it will destroy any pseudo anonymity that you might have had over your financial matters) It is much easier to print a few Paper wallets.... laminate them and store them in 2 or more separate geographical locations.  https://www.bitaddress.org <=== Create it offline and print it... for small amounts only.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "$anounimus$",
      "created_time": "November 16, 2022, 05:36:19 AM",
      "body": "My opinion is that it is still safe for your funds to be in a hard wallet /cold wallet such as Trezor, Ledger, Safepal, and Cold Wallet because hackers and scammers are getting more sophisticated but remember that if something is stored on an exchange wallet, it is only as good as the security measures taken by the platform, and don't forget to read the terms and conditions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "November 16, 2022, 06:04:23 AM",
      "body": "Quote from: Plaguedeath on November 16, 2022, 04:46:50 AMI wouldn't recommend to backup the seeds phrase on a paper because it can be easily destroyed by fire or water, also when you hold for a long time usually you can miss few words from your written since the quality isn't same anymore. I'd recommend to backup using steel plates that resistant against fire, water, corrosion etc.Totally up to you how you're going to store the backups, but the main point is that you do it non-digitally. Heck, you can etch the backup on a stone tablet à la The 10 Commandments if you want to.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "worle1bm",
      "created_time": "November 16, 2022, 06:40:58 AM",
      "body": "I just want to ask if you are having thoughts about storing your coins over cloud storage where potential risk of hacks is very high and you could loose funds why in the hell we don't care to have non custodial wallets like Electrum in our devices keeping the funds in our custody? It's free to download and won't take up space on your system but still we figure some other ways of losing funds then you know the consequences for it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Aanuoluwatofunmi",
      "created_time": "November 16, 2022, 09:03:45 AM",
      "body": "Quote from: Not your key not your BTC on November 16, 2022, 01:52:32 AMI keep my crypto folio on goodle drive and partial on one drive.You could have do yourself more good by getting a hardware wallet and have your asset there than using a third party centralized storage network that is liable to have same experience others are going through now, just don't trust having your investment with any form of central authorities because they can restrict you from accessing your funds or their system may got hacked and you will be left with no remedy.Quote from: Not your key not your BTC on November 16, 2022, 01:52:32 AMI read reminder news on top page and still doubt to keep staying or moving it.Only take a move if you truly believe in recent hacks with centralized exchanges, as a matter of fact, you will not have a second thought about moving your wealth as fast as possible.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sulendra12",
      "created_time": "November 16, 2022, 09:18:13 AM",
      "body": "Quote from: Not your key not your BTC on November 16, 2022, 01:52:32 AMI keep my crypto folio on goodle drive and partial on one drive.I read reminder news on top page and still doubt to keep staying or moving it.what your thought?Anything in the internet has a chance to get hacked in the future even in a scale of google where everything is possible to get hacked with the current technology, although it may take almost longer than anything else.It's best to just backup offline using your paper and pen or just put your seed or private key into USB and store it to somewhere safe, or even better just buy hardware wallet for everything you need. Just make sure you remember where you store it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "vv181",
      "created_time": "November 16, 2022, 09:34:32 AM",
      "body": "Quote from: Not your key not your BTC on November 16, 2022, 01:52:32 AMI keep my crypto folio on goodle drive and partial on one drive.I read reminder news on top page and still doubt to keep staying or moving it.The point of the news announcement is to inform the risk of storing the coin where you did not have any control over your own money a.k.a the key.If what you meant is you are keeping your cryptocurrency key backup on drive and cloud, it's rather a backup or data security method and concern that need to be addressed. As other have been mentioned, ideally you should have multiple separate locations of the backup. Physically and digitally is fine, there is a great reference on how to do it on the bitcoin wiki link above. What is essential is that you have a failure mechanism plan in case one of the backup methods is fail, so you still have access to your data.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "arwin100",
      "created_time": "November 16, 2022, 09:58:21 AM",
      "body": "Quote from: Not your key not your BTC on November 16, 2022, 01:52:32 AMI keep my crypto folio on goodle drive and partial on one drive.I read reminder news on top page and still doubt to keep staying or moving it.what your thought?There are several people has possibility to access that so I guess much safer for you to have hardware wallet since this is more advisable rather than believing on someone telling its safe because you didn't get hack yet.Also maybe try to save your keys offline like your writing it up on books or anything where you have total control.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "xSkylarx",
      "created_time": "November 16, 2022, 10:10:02 AM",
      "body": "Quote from: Not your key not your BTC on November 16, 2022, 01:52:32 AMI keep my crypto folio on goodle drive and partial on one drive.I read reminder news on top page and still doubt to keep staying or moving it.what your thought?Do you mean your private key or seed phrase? Saving it in an online cloud is not that safe. I know they have security procedures, and the possibility of getting hacked into their cloud is low, but still, I am hesitant. I save it mostly on my computer. I know some of you will react, but it makes me more cautious when clicking links and visiting websites. Since 2016, I always save it on my computer. But still, if it is your preference, you can save it, but when it comes to leaving your money on the exchange, do not keep it in online accounts, as Theymos said. There is no need for an explanation; withdraw your funds to be safe.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}