{
  "id": "topic_5450586",
  "title": "ajaxtempest",
  "author": "ajaxtempest",
  "created_time": "April 29, 2023, 08:13:32 AMLast edit: April 29, 2023, 08:33:05 AM by ajaxtempest",
  "content": "I have been using bitcoin core with plugin BWT to connect with my electrum( plugin is installed in electrum plugin folder). After a lot of efforts i was able to link electrum with bitcoin core as a single server using bwt plugin. https://github.com/bwt-dev/bwt-electrum-pluginNow since i updated from bitcoin core 22.1.0 to to 24 version, i am getting errors.Here is the error message in electrum pluginINFO bwt » thread 'peer' panicked at 'called `Option::unwrap()` on a `None` value', src/util/mod.rs:33:45INFO bwt::electrum » [127.0.0.1:53256] connected peerDue to security issues the plugin only connects with cold wallet file of electrum. Can anyone help me in this?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5450586",
  "comments": [
    {
      "author": "NeuroticFish",
      "created_time": "April 29, 2023, 08:24:45 AM",
      "body": "Probably not the answer you're expecting, but since the last development in that plugin was 2 years ago, it may be significantly less effort for you to just use Electrs (or blockstream's fork in case you want to use it out of your LAN) as server.And if you skip the few Windows specifics, this topic shows you the steps for installing Electrs.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ajaxtempest",
      "created_time": "April 29, 2023, 08:27:11 AM",
      "body": "Quote from: NeuroticFish on April 29, 2023, 08:24:45 AMProbably not the answer you're expecting, but since the last development in that plugin was 2 years ago, it may be significantly less effort for you to just use Electrs (or blockstream's fork in case you want to use it out of your LAN) as server.And if you skip the few Windows specifics, this topic shows you the steps for installing Electrs.I am comfortable with bitcoin core acting as my node and giving info to softwares like bisq, electrum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NeuroticFish",
      "created_time": "April 29, 2023, 08:29:39 AM",
      "body": "Quote from: ajaxtempest on April 29, 2023, 08:27:11 AMI am comfortable with bitcoin core acting as my node and giving info to softwares like bisq, electrum.Electrs will be just a \"blanket\" over your own BitcoinCore node, so imho it's not such a paradigm shift.But it's really up to you. I can't help with more than this, maybe others can.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ajaxtempest",
      "created_time": "April 29, 2023, 08:31:45 AM",
      "body": "Ok i went back to 22.1.0 and now it is working.I think the core version 23,24 changed some things and that i why it is not working. Can i raise this issue to the dev team?this is now i getINFO bwt » bwt v0.2.4 connected to /Satoshi:22.1.0/ on main at height 787462INFO bwt::indexer » completed initial sync in 10.3094ms up to height 787462 (total * transactions and * addresses)INFO bwt::electrum » Electrum RPC server running on 127.0.0.1:53741:t (protocol 1.4)INFO bwt::electrum » [127.0.0.1:53743] connected peeralso are there any drawback using 22.1.0 version?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaveF",
      "created_time": "April 29, 2023, 12:34:28 PM",
      "body": "Quote from: ajaxtempest on April 29, 2023, 08:31:45 AM...I think the core version 23,24 changed some things and that i why it is not working. Can i raise this issue to the dev team?...also are there any drawback using 22.1.0 version?I would open an issue on github with the BWT people, but since as NeuroticFish pointed out it's been 2 years since their last update so they might have abandoned it.Running 22.x.x short term will probably not matter, but it's not a solution. Over time you will miss out on features & security updates & other changes.Also as NeuroticFish said, there are other options for a back end electrum server that are still actively being updated. You should probably take a look at one of those.If you do not want to deal with it yourself there are a few prepackaged virtual machine nodes in a box like mynodebtc that would do it all for you.-Dave",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}