{
  "id": "topic_5473339",
  "title": "zasad@",
  "author": "zasad@",
  "created_time": "November 08, 2023, 12:02:56 PM",
  "content": "https://www.coindesk.com/business/2023/11/08/trustwallets-twt-falls-as-parent-company-binance-releases-web3-wallet/Trust Wallet's TWT Falls as Parent Company Binance Releases Web3 WalletBinance Web3 Wallet Terms of Usehttps://www.binance.com/en/defiwallet/term-of-usePlease read these terms and conditions carefully. This wallet is called a competitor to Metamask and TrustWallet, but in reality it is custodial crap and all your funds can be blocked.Don't trust centralized exchanges and their products, you will lose your money.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5473339",
  "comments": [
    {
      "author": "DeathAngel",
      "created_time": "November 08, 2023, 12:27:51 PM",
      "body": "This is just Binance trying to squeeze every last cent that they can with their shitcoin casino brand. I know they have a long history of being trustworthy but by promoting  so many alts, it just adds to the risk they carry. Obviously people shouldn’t still need to be told to take custody of their own money but seriously, avoid this like the plague.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bureau",
      "created_time": "November 08, 2023, 12:43:01 PM",
      "body": "Quote from: zasad@ on November 08, 2023, 12:02:56 PMPlease read these terms and conditions carefully. This wallet is called a competitor to Metamask and TrustWallet, but in reality it is custodial crap and all your funds can be blocked.Don't trust centralized exchanges and their products, you will lose your money.It is obvious that the wallet relased by a centralized exchange would be custodial. There is only one plus point and that would be getting defi benefits of Binance through the wallet app and not the exchange app. The wallet shouldn't be used for holding crypto for long term. It's use should be for only for investment purpose and that too for short term.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "vv181",
      "created_time": "November 08, 2023, 12:56:55 PM",
      "body": "Concerning things I look upon the Terms of Use.QuoteThe Binance Web3 Wallet Services is a built-in feature within the Application and/or Website which provide you access and use to a self-custodial wallet that uses multi-party computation (“MPC”) technology for managing Digital Currencies and NFTsQuoteTo use the Binance Web3 Wallet Services, you must first have an existing Binance Account.QuoteThe Binance Web3 Wallet is using MPC technology and therefore there is no private key or seed phrase required. You will not be able to export or import a private key or seed phrase.QuoteIn exceptional circumstances and where there’s legitimate reason (determined by Binance acting reasonably) Binance may refuse to co-sign the transaction or activity you initiated. This will prevent you from using your Binance Web3 Wallet to engage in the transaction or activity that you initiated.QuoteSuspicious activity monitoring and holds. In order to comply with anti-money laundering laws, and to protect you and other users from unlawful use of the Binance Web3 Wallet Services, Binance monitors transactions for potential fraud, suspicious activity, and sanctions evasion. As a result, in some cases transactions and accounts may be placed on hold, and the delivery of Digital Currencies or NFTs will be delayed, to permit these processes to proceed to conclusion. In addition, Binance may be required to file suspicious transaction reports, and reports of property blocked, or transactions rejected with the applicable governmental authority.Those things are such red flags. Requires a Binance account as a prerequisite to use the wallet and also you can not export any keys. And many other things.As OP said, surely it is not a self-custodial wallet. You did not own the keys, they can block and censor or freeze transactions. The term seems to strongly suggest they own the wallet, not the user. So it should not be categorized as a self-custodial wallet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bluebit25",
      "created_time": "November 08, 2023, 02:35:04 PM",
      "body": "Quote from: vv181 on November 08, 2023, 12:56:55 PM(...)As OP said, surely it is not a self-custodial wallet. You did not own the keys, they can block and censor or freeze transactions. The term seems to strongly suggest they own the wallet, not the user. So it should not be categorized as a self-custodial wallet.Although I'm not sure if it's necessary or not, I think it will be a product to make the Binance service more convenient. But if you think that competing with metamask, trustwallet,... or many other defi wallets, I agree that this is meaningless when your keys do not belong to you. And I'm not sure if it requires KYC to use, because Binance requires users to KYC, if this is true then it's definitely not necessary for me.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "abel1337",
      "created_time": "November 08, 2023, 02:54:34 PM",
      "body": "Custodial web3 wallet? LOL I'll pass into that. I'm happy to use my metamask and physical wallets to secure my assets. Every product that binance do has some centralization into it and could control the assets inside of it. I don't have a problem with their exchange and of it's features since I'm happily using it for some of my transactions like doing trades but I personally won't really try to use or even open their wallet since it's just the same as storing your funds in their exchange given that you don't have a private key and you only need your binance account to sign-in in their wallet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sayeds56",
      "created_time": "November 08, 2023, 03:02:59 PMLast edit: November 08, 2023, 03:16:54 PM by Sayeds56",
      "body": "Quote from: zasad@ on November 08, 2023, 12:02:56 PMhttps://www.coindesk.com/business/2023/11/08/trustwallets-twt-falls-as-parent-company-binance-releases-web3-wallet/Trust Wallet's TWT Falls as Parent Company Binance Releases Web3 WalletBinance Web3 Wallet Terms of Usehttps://www.binance.com/en/defiwallet/term-of-usePlease read these terms and conditions carefully. This wallet is called a competitor to Metamask and TrustWallet, but in reality it is custodial crap and all your funds can be blocked.Don't trust centralized exchanges and their products, you will lose your money.I think we should take it as positive development for those individuals who prefer to keep their assets on centralized exchanges, as it will enhance the security of funds stored on Binance exchange's  wallets, while, retaining some level of control over custody. I agree with your perspective on favoring personnel wallets (preferably hard wallets) for storing our digital assets and connect them with centralized or decentralized when you need to sell your assets.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jrrsparkles",
      "created_time": "November 08, 2023, 03:52:31 PM",
      "body": "Quote from: Sayeds56 on November 08, 2023, 03:02:59 PMQuote from: zasad@ on November 08, 2023, 12:02:56 PMhttps://www.coindesk.com/business/2023/11/08/trustwallets-twt-falls-as-parent-company-binance-releases-web3-wallet/Trust Wallet's TWT Falls as Parent Company Binance Releases Web3 WalletBinance Web3 Wallet Terms of Usehttps://www.binance.com/en/defiwallet/term-of-usePlease read these terms and conditions carefully. This wallet is called a competitor to Metamask and TrustWallet, but in reality it is custodial crap and all your funds can be blocked.Don't trust centralized exchanges and their products, you will lose your money.I think we should take it as positive development for those individuals who prefer to keep their assets on centralized exchanges, as it will enhance the security of funds stored on Binance exchange's  wallets, while, retaining some level of control over custody. I agree with your perspective on favoring personnel wallets (preferably hard wallets) for storing our digital assets and connect them with centralized or decentralized when you need to sell your assets.I don't see anything positive here. We shouldn't trust their products just because it is coming from the biggest crypto exchange and its misleading way of advertising will get more people too due to ignorance of people.Metamask is open-sourced and non-custodial while trust wallet is closed source and still non-custodial, this is custodial which means this is worse than trust wallet because where we at least get the private keys and can manage to sweep the funds if needed but here you can't do anything against the Binance.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husires",
      "created_time": "November 08, 2023, 07:52:00 PM",
      "body": "Perhaps this service targets the category of investors who want to withdraw to the wallet and yet are afraid of having full access to their currencies, but I see it as useless, in addition to the complaints and the possibility of the wallet blocking and freezing your funds, and that the majority of us will not read or remember the terms of use, which will inevitably be bad and do not respect privacy and give them Comprehensive access to all data.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nelson4lov",
      "created_time": "November 08, 2023, 10:57:32 PM",
      "body": "Not sure why Binance thinks that if they ever want a piece of the DeFi came, they'd succeed at that with a custodial \"DeFi\" wallet? It makes zero sense to me in that, anything that has to do with DeFi is inherently decentralized (at least to some degree). You can't launch a custodial wallet and expect DeFi enthusiasts to get hyped up about it.Trust wallet started on a solid path but it messed up with that binance acquisition same with coinmarketcap.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LogitechMouse",
      "created_time": "November 09, 2023, 03:23:21 AM",
      "body": "Quote from: vv181 on November 08, 2023, 12:56:55 PMQuoteTo use the Binance Web3 Wallet Services, you must first have an existing Binance Account.QuoteThe Binance Web3 Wallet is using MPC technology and therefore there is no private key or seed phrase required. You will not be able to export or import a private key or seed phrase.I guess these 2 alone are enough already to say that this is just like other custodial wallets out there.You need your account, and there are no private keys whatsoever. It's almost the same as storing your coins in their exchange right? I mean what's the purpose of this one if you can just simply store your wallet in Binance? Their copy-trading feature is more attractive than this wallet crap that they just released. Will not touch it and I don't want to store my coins in whatever exchange it is, even on Binance. Not your keys, not your coins. Better to store it in a hardware wallet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Samlucky O",
      "created_time": "November 09, 2023, 03:23:52 AM",
      "body": "What ever wallet CEX provide is more of custodiall wallet and not advisable to use. CeX has been looking for a way on how all crypto kept in different non custodiall wallet to emerge into there exchanges. To have a total control over it. But the fact still reamain that they can not be trusted. Binance and FTX where once hacked of millions of Dollars, that is a sign that your money might lost one dey. For me I use Binance as my CEX while Trust wallet as my DEX",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "libert19",
      "created_time": "November 09, 2023, 03:57:06 AM",
      "body": "After reading highlights of tnc from vv181's comment. This wallet looks far from the competitor of Metamask, only ignorant people will use this. Even trust wallet looks better in comparison as people can at least export seed/Private key, here you will be on mercy of binance in case something unfortunate happens or for some tech reason wallet doesn't work properly momentarily, you'll be hanging on Binance without any refuge elsewhere. Once Dot network was not working on Trust wallet, so I imported the seed into other wallet and it worked out, this is flexibility of non-custodial wallets. I'm out, don't even wanna check.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bittraffic",
      "created_time": "November 09, 2023, 04:15:55 AM",
      "body": "Yep they already have the Trustwallet. CZ is getting crazier but maybe they don't want users to withdraw their coins because they'd gonna end up having no coins left if all the users withdraw from them. Coins are getting out from their exchanges because of the P2p.No seed required means shit. I think in the next cycle they will also fall like FTX, this is desperation. If they don't cheat from the stakers I think the altcoin stakers will not remove their coins from them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sophokles",
      "created_time": "November 09, 2023, 04:32:05 AM",
      "body": "Isn't twt Binance's wallet or are they the ones who were supporting that wallet? What happens with that? If binance is going to launch another web3 wallet then i am expecting there will be a token sale for that wallet too. Also it can be custodial crap but they have the capability to take this wallet to the level of a metamask in terms of user growth. There is a reason why people call them the kings of the altcoin market. Thats why we have seen lots of altcoin markets on their exchange and from that a wide number of projects are their own or supported and backed by the lap team.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "2Pizza410000BTC",
      "created_time": "November 09, 2023, 04:34:47 AM",
      "body": "Quote from: zasad@ on November 08, 2023, 12:02:56 PMhttps://www.coindesk.com/business/2023/11/08/trustwallets-twt-falls-as-parent-company-binance-releases-web3-wallet/Trust Wallet's TWT Falls as Parent Company Binance Releases Web3 WalletBinance Web3 Wallet Terms of Usehttps://www.binance.com/en/defiwallet/term-of-usePlease read these terms and conditions carefully. This wallet is called a competitor to Metamask and TrustWallet, but in reality it is custodial crap and all your funds can be blocked.Don't trust centralized exchanges and their products, you will lose your money.Yes I have read the terms and conditions, if so then I must be doing something wrong. I am depositing my funds on Binance centralized exchange. But so far I haven't had any problems, I don't know if it will happen later, but I will be careful from now on. The reason I keep my funds in a centralized exchange is because I can easily use P2P in local currency and do occasional short term trading. But I believe Binance they will never cheat their customers.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "electronicash",
      "created_time": "November 09, 2023, 06:49:18 AM",
      "body": "Quote from: Sophokles on November 09, 2023, 04:32:05 AMIsn't twt Binance's wallet or are they the ones who were supporting that wallet? What happens with that? If binance is going to launch another web3 wallet then i am expecting there will be a token sale for that wallet too. Also it can be custodial crap but they have the capability to take this wallet to the level of a metamask in terms of user growth. There is a reason why people call them the kings of the altcoin market. Thats why we have seen lots of altcoin markets on their exchange and from that a wide number of projects are their own or supported and backed by the lap team.trustwallet is different from the newly rolled-out wallet which is purposely for Web3. they reason because web3 wallets are prone to hacks and exploits, they need this wallet to have no private key or seed to which i guess you will need binance in order for you to recover the tokens you have in your wallet. so this is for everyone's protection, i think the goal is very noble. it's reasonable though unless we want the newbies to get hacked all the time and lose their hard-earned tokens.the adoption is here and web3 wallets are pioneering this development by the likes of metamask, binance is to protect the newcomers of crypto. c*ugh c**gh",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Publictalk792",
      "created_time": "November 09, 2023, 07:20:41 AM",
      "body": "I have seen many time Binance always try to dive in the every field of crypto and always dive in and leave a good impact in that crypto field. Like you can see in the NFT market when Binance saw that NFTs are getting famous in crypto it launched it. Whenever it will see a coin is getting hype they list in innovation zone. Now it is diving in Web3 wallet so I think this is not a new thing. If they want to make their own.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sophokles",
      "created_time": "November 09, 2023, 12:05:19 PM",
      "body": "Quote from: electronicash on November 09, 2023, 06:49:18 AMQuote from: Sophokles on November 09, 2023, 04:32:05 AMIsn't twt Binance's wallet or are they the ones who were supporting that wallet? What happens with that? If binance is going to launch another web3 wallet then i am expecting there will be a token sale for that wallet too. Also it can be custodial crap but they have the capability to take this wallet to the level of a metamask in terms of user growth. There is a reason why people call them the kings of the altcoin market. Thats why we have seen lots of altcoin markets on their exchange and from that a wide number of projects are their own or supported and backed by the lap team.trustwallet is different from the newly rolled-out wallet which is purposely for Web3. they reason because web3 wallets are prone to hacks and exploits, they need this wallet to have no private key or seed to which i guess you will need binance in order for you to recover the tokens you have in your wallet. so this is for everyone's protection, i think the goal is very noble. it's reasonable though unless we want the newbies to get hacked all the time and lose their hard-earned tokens.the adoption is here and web3 wallets are pioneering this development by the likes of metamask, binance is to protect the newcomers of crypto. c*ugh c**ghSo binance will take custody of user funds! How will people believe binance itself is immune from hacks and exploits? People's trust in centralized exchanges has gone lower after the FTX incident. We have all seen what they have done with their customers funds. Now I understand it will be custodial wallet coinbase where users will be able to buy major crypto assets, and they can even transfer their assets from one user to another only by using their email address or username.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "johnsaributua",
      "created_time": "November 09, 2023, 12:33:16 PM",
      "body": "Non custodial but still under someone else's supervision? My assumption is that if a binance account is enough to trade then web3 is just a label and to make it look more practical 1 bundling with binance to make transactions on dapps or dex as usual, it's interesting. In terms of development this is far enough, and so that users are increasingly spoiled with this binance feature.But if for saving, I'm not sure about binance's web3, especially binance has had accusations and lawsuits, this is one of them, CEX could have happened instead of following regulations, metamask is open source (the word) is certainly not the same in plain sight.Binance's high rating is not a certainty if it will increase interest to grow using binance products, some people only exchange and the rest are stored in private wallets, in terms of service, binance is quite good, cheap and fast and some people only care about easy transactions and many choices, including me, It's not a dependency for a long time, it depends on each person.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}