{
  "id": "topic_5434934",
  "title": "Debilsumda",
  "author": "Debilsumda",
  "created_time": "January 16, 2023, 10:13:17 AMLast edit: January 16, 2023, 10:24:16 AM by Debilsumda",
  "content": "Some may know some may don't, but im gonna be open again, i was released from prison after 6 years and 3 months served time for mining crypto, more specifically btc. My motherland is Bulgaria, there mining is not illegal, nor legal, but yes, they did charged me for money laundering and tax fraud, draining all i had accumulated from mining and trading. Destroying my farm and all, and here i am. This is the time where having some cash is crucial for me. Openly said I turned from rich to rag. But it is what it is. If someone is in position to lend me any amount will technically help me get on my feet at this part of the month. If not, it is what it is. Thank in advance and i do understand if no one reach his hand, i know trust issues best.Ps.200 is the max i need, but every penny count.Forgot to ask is there still a way to buy crypto or something i can turn into fiat paying with my monthly phone bill in Europe? Ifz double edged sword, but this is my life for now, and im trying to adjust it while holding my self from not completely losing my self.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5434934",
  "comments": [
    {
      "author": "BitcoinGirl.Club",
      "created_time": "January 16, 2023, 10:29:23 AM",
      "body": "Quote from: Debilsumda on January 16, 2023, 10:13:17 AMSome may know some may don't, but im gonna be open again, i was released from prison after 6 years and 3 months served time for mining crypto, more specifically btc. My motherland is Bulgaria, there mining is not illegal, nor legal, but yes, they did charged me for money laundering and tax fraud, draining all i had accumulated from mining and trading. Destroying my farm and all, and here i am. This is the time where having some cash is crucial for me. Openly said I turned from rich to rag. But it is what it is. If someone is in position to lend me any amount will technically help me get on my feet at this part of the month. If not, it is what it is. Thank in advance and i do understand if no one reach his hand, i know trust issues best.Ps.200 is the max i need, but every penny count.Forgot to ask is there still a way to buy crypto or something i can turn into fiat paying with my monthly phone bill in Europe? Ifz double edged sword, but this is my life for now, and im trying to adjust it while holding my self from not completely losing my self. Let's assume your story is true and you get a loan. Imagine how many others will create fake story and ask for loan. Eventually this board will become a spammers and scammers paradise. Sorry we can not let this place to be a spammers paradise.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Debilsumda",
      "created_time": "January 16, 2023, 10:39:26 AM",
      "body": "Quote from: BitcoinGirl.Club on January 16, 2023, 10:29:23 AMQuote from: Debilsumda on January 16, 2023, 10:13:17 AMSome may know some may don't, but im gonna be open again, i was released from prison after 6 years and 3 months served time for mining crypto, more specifically btc. My motherland is Bulgaria, there mining is not illegal, nor legal, but yes, they did charged me for money laundering and tax fraud, draining all i had accumulated from mining and trading. Destroying my farm and all, and here i am. This is the time where having some cash is crucial for me. Openly said I turned from rich to rag. But it is what it is. If someone is in position to lend me any amount will technically help me get on my feet at this part of the month. If not, it is what it is. Thank in advance and i do understand if no one reach his hand, i know trust issues best.Ps.200 is the max i need, but every penny count.Forgot to ask is there still a way to buy crypto or something i can turn into fiat paying with my monthly phone bill in Europe? Ifz double edged sword, but this is my life for now, and im trying to adjust it while holding my self from not completely losing my self. Let's assume your story is true and you get a loan. Imagine how many others will create fake story and ask for loan. Eventually this board will become a spammers and scammers paradise. Sorry we can not let this place to be a spammers paradise.I can give hard proof, im not ashamed that i did time, im neither newbie in the forum, just by circumstances. I do understand your point also, won't debate or anything",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Timelord2067",
      "created_time": "January 17, 2023, 07:20:24 AM",
      "body": "What was your previous user profile name here?  (Am asking for a friend)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Debilsumda",
      "created_time": "January 17, 2023, 09:23:09 AM",
      "body": "Quote from: Timelord2067 on January 17, 2023, 07:20:24 AMWhat was your previous user profile name here?  (Am asking for a friend)Wrote you in private, because im afraid that can lead to information that was connected with the adress im trying to recover. Like i did mention in the private message it has, coin in it.Btw if u look closely i do reveal it here and in the message i sent u",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DireWolfM14",
      "created_time": "January 17, 2023, 08:55:18 PM",
      "body": "Quote from: Debilsumda on January 17, 2023, 09:23:09 AMBtw if u look closely i do reveal it here and in the message i sent uNo one is interested in searching for puzzles in your text.  If you want a loan and have an old account that shows some history and trust you may be more likely to get a loan if you ask using that account.  Just out of curiosity, why aren't you using your old account?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Debilsumda",
      "created_time": "January 17, 2023, 09:33:09 PM",
      "body": "Quote from: DireWolfM14 on January 17, 2023, 08:55:18 PMQuote from: Debilsumda on January 17, 2023, 09:23:09 AMBtw if u look closely i do reveal it here and in the message i sent uNo one is interested in searching for puzzles in your text.  If you want a loan and have an old account that shows some history and trust you may be more likely to get a loan if you ask using that account.  Just out of curiosity, why aren't you using your old account?I understand the confusion, but it is compromised, last login from 2017 isn't from me, also lead to a adress which still have nice amount of coins and i guess its missed from the police to be drained, like the others, and i can't be sure that im not monitored i mean, im being paranoid, its not long since i was released and i found one of my adresses still alive, but on other hand i really do need a loan to buy me a laptop and try to acces regain accces, because its really impossible thru the phone, from laptop is doubtful too but i can use it to plug everything I find or connect it to whatever i find to gain any information and the best scenario to regain acces, if this happens as i think it will the repayment will be far from what i mentioned, otherwise i have to wait till end of January. If anyone decide to loan me,even if i don't successfully do what i need and must to do by any means i can still repay by selling the laptop or the phone, and i will receive some cash like, idk how to call it but like a pension for the time I did in cage, because im successfully suing the country for it, it was wrongful and it affected me in many ways not only financially, but mentally too, i had ptsd before even it happened but it wasn't a problem, because i could manage, now i hardly can. Also they put me in there way to young and ettc..",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Timelord2067",
      "created_time": "January 18, 2023, 09:41:14 AM",
      "body": "Quote from: Debilsumda on January 17, 2023, 09:23:09 AMQuote from: Timelord2067 on January 17, 2023, 07:20:24 AMWhat was your previous user profile name here?  (Am asking for a friend)Wrote you in private, because im afraid that can lead to information that was connected with the adress im trying to recover. Like i did mention in the private message it has, coin in it.Btw if u look closely i do reveal it here and in the message i sent uSix lines of rambling is what I call what you wrote.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Debilsumda",
      "created_time": "January 18, 2023, 09:57:03 AM",
      "body": "Quote from: Timelord2067 on January 18, 2023, 09:41:14 AMQuote from: Debilsumda on January 17, 2023, 09:23:09 AMQuote from: Timelord2067 on January 17, 2023, 07:20:24 AMWhat was your previous user profile name here?  (Am asking for a friend)Wrote you in private, because im afraid that can lead to information that was connected with the adress im trying to recover. Like i did mention in the private message it has, coin in it.Btw if u look closely i do reveal it here and in the message i sent uSix lines of rambling is what I call what you wrote.Trying my best, it doesn't matter anymore, it's all cool",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}