{
  "id": "topic_5524806",
  "title": "Asap264",
  "author": "Asap264",
  "created_time": "December 31, 2024, 08:31:19 AM",
  "content": "Happy New Year in advance! As we step into the new year, the world of cryptocurrency trading continues to fascinate and intimidate in equal measure. Interestingly, while AI is already solving complex problems in various industries, the cryptocurrency trading space still lacks a reliable solution for predicting price movements.Apart from technical analysis, psychology, and candlestick patterns, I wonder if there's a simpler way to predict the possible movement of cryptocurrencies like BTC, BGB, and DOGE without requiring extensive trading knowledge. This question occurred to me because I'm interested in participating in an upcoming event where daily price predictions of cryptocurrencies can earn credits. As a newbie, can fundamentals or just basic supply & demand zones work?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5524806",
  "comments": [
    {
      "author": "Oshosondy",
      "created_time": "December 31, 2024, 09:12:36 AM",
      "body": "If it is long term, you may not use technical analysis for it but it is daily prediction according to what you posted. You will definitely need a technical analysis for it as it is short term.But know that technical analysis does not mean that your prediction may not be wrong. You also need to have experience and not just knowledge about technical analysis. Also you need to know about fundamental analysis because what is happening that news will let people know can have positive or negative effect on the price of bitcoin.Note: My post is about bitcoin and not altcoins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hero_the_bossman",
      "created_time": "December 31, 2024, 09:17:02 AM",
      "body": "Learn about cycles, OP - and be a happy hodler.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rodskee",
      "created_time": "December 31, 2024, 09:49:41 AM",
      "body": "“can you predict bitcoin prices without trading expertise?”well yes but you’d most likely not be close to the actual price even if with trading expertise and analytics skills it wouldn’t help you to 100% accurately predict what the price is but the chance is higher if you are knowledgeable and experienced why are you even asking this though? if you are a beginner then learn first before you dive into predicting",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "john_egbert",
      "created_time": "December 31, 2024, 10:00:02 AM",
      "body": "Quote from: rodskee on December 31, 2024, 09:49:41 AM“can you predict bitcoin prices without trading expertise?”well yes but you’d most likely not be close to the actual price even if with trading expertise and analytics skills it wouldn’t help you to 100% accurately predict what the price is but the chance is higher if you are knowledgeable and experienced why are you even asking this though? if you are a beginner then learn first before you dive into predicting Probably to try things out. But nobody would be able to predict the price for sure, the sentiment - it can be viewed and felt through the market, but the numbers, and especially accurate ones - nah.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "slaman29",
      "created_time": "December 31, 2024, 10:46:07 AM",
      "body": "Short and sweet answer: duh, yes.I mean, OP, what do you think the people on this forum or on news sites are doing? They are predicting crypto prices 100% without trading expertise.Its so easy we all do it. BTC will be 99999 today. There you go I just predicted without trading expertise.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Darker45",
      "created_time": "December 31, 2024, 11:07:39 AM",
      "body": "If it's daily price predictions, I don't think you would give too much importance on fundamentals and supply and demand dynamics. They're probably more important long-term, but can't significantly affect daily price fluctuations, unless perhaps if there's a big partnership announced or other huge events. For daily predictions, I think it helps if you develop good charting skills. Otherwise, just make your prediction. I've won prediction contests by just guessing. If you're looking at the price many times in a day, you can probably come up with your own close predictions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Outhue",
      "created_time": "December 31, 2024, 11:25:12 AM",
      "body": "Most people will predict the market correctly if it is long term but since many traders depend on short term trading they can be wrong without using any analysis.To be a good trader you will face a lot, wrong calls will be yours for a while until you start learning from your mistake, it is not going to be easy and it is not something you can learn and know in a month, some expertise today learnt trading for years before they get this good. To better things up you can go premium with trading tools on trading view or get yours from a pro trader, this will help you in making calls.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fikrett",
      "created_time": "December 31, 2024, 11:34:58 AM",
      "body": "Quote from: Outhue on December 31, 2024, 11:25:12 AMMost people will predict the market correctly if it is long term but since many traders depend on short term trading they can be wrong without using any analysis.To be a good trader you will face a lot, wrong calls will be yours for a while until you start learning from your mistake, it is not going to be easy and it is not something you can learn and know in a month, some expertise today learnt trading for years before they get this good. To better things up you can go premium with trading tools on trading view or get yours from a pro trader, this will help you in making calls. And better start to view the charts of the past to see the differences and similarities between the cycle now and the cycles of the past.Many things already are seen or repeat themselves from a glance of someone who was there for a long time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jcojci",
      "created_time": "December 31, 2024, 11:39:56 AM",
      "body": "Anyone can predict where the price will moves but they can not get 100% accurate for their prediction. They need to learn more to know the detail but that still can not be accurate prediction. We can only give our prediction although we have a good skill in analyzing.We can not say our prediction will happen in a few days, weeks, or even years because no one will know for sure. That is why we only see some people tells their prediction but they will not so sure if that can really happen later.If that is about Bitcoin, I suggest you to invest Bitcoin and not trade if you don't have much skill. That will help you to avoids from the loss because you have a chance to accumulate more Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wonder Work",
      "created_time": "December 31, 2024, 11:47:53 AM",
      "body": "Quote from: rodskee on December 31, 2024, 09:49:41 AM“can you predict bitcoin prices without trading expertise?”Trading skills are different to me, but to predict the price of BTC, you must know about it. Now, if you do not have good knowledge about Bitcoin, it is impossible to predict its price in any way. You have to know a lot about Bitcoin; you have to learn. Moreover, it is not possible to determine its trajectory in any way.Quote from: rodskee on December 31, 2024, 09:49:41 AMwhy are you even asking this though? if you are a beginner then learn first before you dive into predicting However, here is something that someone who knows about Bitcoin is ignorant about trading. One can be seen as complementary to the other. Because someone who knows about BTC also knows about training quite well. If those who are completely new go to learn about Bitcoin, you will see that they are also gaining knowledge about trading from there. You must learn to predict you will get better. I have seen many cases where, even after recharging a lot, the prediction cannot be made correctly; it is a very difficult matter. Since we are moving forward slowly, we must study and learn well if it is new.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "God Of Thunder",
      "created_time": "December 31, 2024, 11:53:29 AM",
      "body": "Quote from: Asap264 on December 31, 2024, 08:31:19 AMApart from technical analysis, psychology, and candlestick patterns, I wonder if there's a simpler way to predict the possible movement of cryptocurrencies like BTC, BGB, and DOGE without requiring extensive trading knowledge. This question occurred to me because I'm interested in participating in an upcoming event where daily price predictions of cryptocurrencies can earn credits. As a newbie, can fundamentals or just basic supply & demand zones work?You cannot learn this in a week or in a month. You need to invest your time in the crypto space to learn how the movement happens. I have been in the crypto market for a couple of years already, yet I don't think I can predict the market correctly. The problem is, that the crypto pattern always does not match each other. But you can increase your chances by following a couple of things. One of them is to be aware of recent events and news about a specific crypto. For example, we have seen a recent price surge of BGB while the entire market was crashing. The reason behind that price surge is, that BGB and BWB are going to be merged. So, you have to check the crypto news and blogs so you can understand what is going to happen.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FortuneFollower",
      "created_time": "December 31, 2024, 11:53:55 AM",
      "body": "Quote from: jcojci on December 31, 2024, 11:39:56 AMAnyone can predict where the price will moves but they can not get 100% accurate for their prediction. They need to learn more to know the detail but that still can not be accurate prediction. We can only give our prediction although we have a good skill in analyzing.We can not say our prediction will happen in a few days, weeks, or even years because no one will know for sure. That is why we only see some people tells their prediction but they will not so sure if that can really happen later.If that is about Bitcoin, I suggest you to invest Bitcoin and not trade if you don't have much skill. That will help you to avoids from the loss because you have a chance to accumulate more Bitcoin.Predictions and speculations are called that way for a reason. They are not certain - they are literally the embodiment of thoughts and beliefs we have on the market or on Bitcoin itself - and that's why we need to accumulate enough knowledge to be able to compile the biggest picture to see all the things to achieve what we need in the end.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Frankolala",
      "created_time": "December 31, 2024, 11:58:38 AM",
      "body": "No one can predict the price of bitcoin accurately but we can only speculate on it, because the price of bitcoin is unpredictable, even if you have all the trading skills and analysis. This is why majority of traders run at loss because it's hard to predict the future. You should invest in bitcoin with your own funds and hodli for long. Forget about trading because it will lead to big losses in the long run.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitbollo",
      "created_time": "December 31, 2024, 11:58:55 AM",
      "body": "there are a lots of crypto that include serious project to clear scam from the scratch. of course you can try to predict any price or value. but this doesn't means you will be profitable. I think that btc price will ever go up. I mean in 10 years from now I am expeting a price higher then nowadays. Its impossible to say something similar in day by day trading. or even monthly trading. With crypto coins... well mostly you need expertise on that argument. being able to have a profitable trading could help but if you don't know what you are using, this will turn in a big issue later.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "moneystery",
      "created_time": "December 31, 2024, 11:59:17 AM",
      "body": "you don't need to be a trading expert to be able to predict the price of bitcoin, what you need is to be good at reading some news from trusted sources and use a little of your reasoning to predict according to what you want. this method should be very basic for people who invest in bitcoin, because it is quite easy and does not require spending a lot of time and energy just for that, moreover it is impossible for everyone to become a trading expert just to predict the price of bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Stepstowealth",
      "created_time": "December 31, 2024, 12:05:01 PM",
      "body": "Quote from: Asap264 on December 31, 2024, 08:31:19 AMApart from technical analysis, psychology, and candlestick patterns, I wonder if there's a simpler way to predict the possible movement of cryptocurrencies like BTC, BGB, and DOGE without requiring extensive trading knowledge. You should be able to predict the price of Bitcoin and other cryptocurrency without any trading expertise but know that your prediction will be closer to being incorrect than being correct because of your lack of knowledge of some certain key principles to look out for. With more knowledge on trading your predictive skills concerning the price of Bitcoin and other cryptocurrency will become sharper, your predictions will then likely be more correct than wrong.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Alpha Marine",
      "created_time": "December 31, 2024, 01:05:26 PM",
      "body": "I don't think you can predict daily prices without trading expertise. What you can predict is the price of Bitcoin in the long run, like the price of bitcoin in a few months or a year. Without a proper understanding of technical analysis, you'll just be guessing when it comes to predicting bitcoin daily prices. Even with technical analysis, you won't be 100% accurate talking about a person that's just guessing.With the long, you will able to use the price history of bitcoin , and the current situation of global finance, politics and economy to predict what range the price of bitcoin will be. Take, for instance, a lot of people who predict bitcoin to get to $200k because of different countries are talking able having a bitcoin reserve.  Also, because of the having, people speculate that next year will be bullish for bitcoin because according to history, bitcoin is always bullish a year after halving. Als remember that these won't give you an accurate prediction because there are other factors which might come which you may ever know.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wonder Work",
      "created_time": "December 31, 2024, 01:47:54 PM",
      "body": "Quote from: moneystery on December 31, 2024, 11:59:17 AMyou don't need to be a trading expert to be able to predict the price of bitcoin, what you need is to be good at reading some news from trusted sources and use a little of your reasoning to predict according to what you want. this method should be very basic for people who invest in bitcoin, because it is quite easy and does not require spending a lot of time and energy just for that, moreover it is impossible for everyone to become a trading expert just to predict the price of bitcoin.Yes, those who learn about BTC can gain good knowledge about trading by learning about Bitcoin. Those who learn to predict Bitcoin do not have much difficulty in learning trading again and can master it very easily. Predicting Bitcoin is also like trading. Through trading, we can predict how the coin's price will fluctuate in a long and short time. These are like planning for the future. One complements the other.I will tell you about myself. While learning about BTC, I also learned a lot about trading, and that is where my journey started, although I'm not that kind of expert, I understand what else. That is why I said that predicting is also like trading.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bakasabo",
      "created_time": "December 31, 2024, 01:54:06 PM",
      "body": "I wish someone would teach me how to predict crypto prices with our without having trading or analysis experience. Because I think this is impossible. How many time we read predictions from experts, and they either fail, or are very long period predictions. I dont count prediction as «in 2050, Bitcoin would cost more than its price on December 31 2024, and it would cost $+200k.» That is not a prediction, that is a hope and random guessing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}