{
  "id": "topic_5450851",
  "title": "Zoomic",
  "author": "Zoomic",
  "created_time": "May 01, 2023, 12:36:52 PM",
  "content": "Why is there no live bitcoin price update in the forum. I am not suggesting that there should be live price update, I am just asking why there is none. I know this forum is for bitcoin and there are many die hard bitcoiners here and I have seen many developers here.It will not be hard to get an API which will fetch() live bitcoin price, if not everywhere in the forum, atleast at the top of the  Speculation board.I was trying to analyse bitcoin chart in speculation board, I saw myself opening the binance app in another tab and reading the chart from there to make a post in a bitcoin forum. It didn't make good sense to me. That is why I decided to ask the reason behind not implementing the live bitcoin price.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5450851",
  "comments": [
    {
      "author": "LoyceV",
      "created_time": "May 01, 2023, 12:52:15 PM",
      "body": "It's going to be a boring price update:1BTC = 1BTC",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pakhitheboss",
      "created_time": "May 01, 2023, 12:54:01 PM",
      "body": "You can check this thread - Wall Observer for Bitcoin price updates. It is done by Chart Buddy every hour. As of now, there are many websites and apps that can give you realtime updates of Bitcoin prices. I do not think there is any need of realtime Bitcoin price update on the speculation board.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nwada001",
      "created_time": "May 01, 2023, 12:55:40 PM",
      "body": "I don't think it will really be a bad idea to see the Bitcoin price on its own forum; it would have been something interesting, but at the same time, I also don't think the forum needs that here. We don't expect to have everything here on the forum; it will be a little work for the admin, and I don't think it will be something of interest to the admin either.Let's not be dependent on the forum chart information; what if the price source happens to have some error reading sometimes? We could possibly accuse the forum and its admin of what they don't know, just like what happened with CoinMarketCap a few years ago, where all coins and token prices were doubled and everyone's wallet was showing millions of dollars, and all those who integrated it into their server will definitely experience the same price error.We have other places to read the chart if we really want; all of us have different places where we get our price information, which we read and make our own predictions under the speculation and argument price prediction there.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hispo",
      "created_time": "May 01, 2023, 08:09:39 PM",
      "body": "I personally would not mind to see some optional widget option which could show the price of Bitcoin versus the USD on live, but to be honest with you, it is a feature that many people around here would find to be unnecessary. Because if someone is interested in giving the price of Bitcoin that kind of attention, they already have third party apps, widgets, notifications, etc.So the administration may consider that implementation to be a waste of time and effort, unfortunately.  They might rather to work on more vital things to keep this place safe and running.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "macson",
      "created_time": "May 01, 2023, 08:40:58 PM",
      "body": "Quote from: Zoomic on May 01, 2023, 12:36:52 PMWhy is there no live bitcoin price update in the forum. I am not suggesting that there should be live price update, I am just asking why there is none. I know this forum is for bitcoin and there are many die hard bitcoiners here and I have seen many developers here.It will not be hard to get an API which will fetch() live bitcoin price, if not everywhere in the forum, atleast at the top of the  Speculation board.I was trying to analyse bitcoin chart in speculation board, I saw myself opening the binance app in another tab and reading the chart from there to make a post in a bitcoin forum. It didn't make good sense to me. That is why I decided to ask the reason behind not implementing the live bitcoin price.do you mean the USD/BTC price updates every day?  that's really not suitable for this forum.(i prefer BTC/USD or BTC/ other fiat)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Adbitco",
      "created_time": "May 01, 2023, 09:25:14 PM",
      "body": "Quote from: Zoomic on May 01, 2023, 12:36:52 PMI was trying to analyse bitcoin chart in speculation board, I saw myself opening the binance app in another tab and reading the chart from there to make a post in a bitcoin forum.Why opening Binance while we have coinmarketcap or tradingview that you could quickly tap to have a look at the market, alternatively you may bookmark the page and pin to your browser for easier access. Including a live update of bitcoin price may somehow function as the speculation board in my opinion because people do visit tradingview or CMC to have their price update over there. Well just as you said using Binance exchange is quiet enough for you to use, although is a good suggestion but I doubt if it will be implemented as you think.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "May 02, 2023, 06:05:56 AM",
      "body": "It already has one. If you go into the Wall Observer thread, you can get the real-time price of Bitcoin, as well as the ask/spread/take/blah/etc. distributions every hour from a bot called ChartBuddy.There is no reason to create another bot that does exactly the same thing, and even if there were, in which thread or part of the board would you possibly  put it in?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bettercrypto",
      "created_time": "May 02, 2023, 06:23:18 AM",
      "body": "Quote from: Zoomic on May 01, 2023, 12:36:52 PMWhy is there no live bitcoin price update in the forum. I am not suggesting that there should be live price update, I am just asking why there is none. I know this forum is for bitcoin and there are many die hard bitcoiners here and I have seen many developers here.It will not be hard to get an API which will fetch() live bitcoin price, if not everywhere in the forum, atleast at the top of the  Speculation board.I was trying to analyse bitcoin chart in speculation board, I saw myself opening the binance app in another tab and reading the chart from there to make a post in a bitcoin forum. It didn't make good sense to me. That is why I decided to ask the reason behind not implementing the live bitcoin price.Why would there be a problem if no one is giving live updates on the value of Bitcoin here on the forum? There are many ways for us to see that, and maybe that depends on each one who is here on this platform.       It's probably not a big deal to you if none of the members here on the forum post it. Maybe we can just look at the live updates to see the situation or condition of its price value in the market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitcoinGirl.Club",
      "created_time": "May 02, 2023, 06:29:24 AM",
      "body": "Quote from: Zoomic on May 01, 2023, 12:36:52 PMWhy is there no live bitcoin price update in the forum. I need a website, do you accept bitcoin? How much you want for a simple five page static page? Show me your portfolio before sharing the contents.I need my grocery, do you accept bitcoin? How much you want for 1kg potato? Do you accept bitcoin? I like this t-shirt.The value for the service and goods are simply paid in exchange of bitcoin. Bitcoin is the price you are paying.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mpamaegbu",
      "created_time": "May 02, 2023, 07:58:22 AM",
      "body": "Quote from: Zoomic on May 01, 2023, 12:36:52 PMIt will not be hard to get an API which will fetch() live bitcoin price, if not everywhere in the forum, atleast at the top of the  Speculation board.This isn't a bad idea. I believe as a Bitcoin forum it should be a welcome development. Perhaps we can have it up there like that little space beneath the homepage where theymos dutifully drops updates on Electrum wallet or other snippets on latest developments. Just a widget type of thing that won't bug the entire forum. Yes, I know ChartBuddy updates Bitcoin price in  Speculation  but that's done on hourly basis. What OP is proposing is real time update as it floats on crypto sites like Coingecko and CMC and I like that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hyphen(-)",
      "created_time": "May 02, 2023, 08:44:50 AM",
      "body": "Quote from: Zoomic on May 01, 2023, 12:36:52 PMIt didn't make good sense to me. That is why I decided to ask the reason behind not implementing the live bitcoin price.I also expect to be seeing only the Bitcoin price chart and updates since it is a Bitcoin forum, but the forum can not keep doing the same thing in all sections of the forum even though it will be good if we have such price updates in all sections, But still not bad since there are vareious platforms that give such price update, and ChartBuddy do give price updates in the wall observer every hour.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Aanuoluwatofunmi",
      "created_time": "May 02, 2023, 04:13:32 PM",
      "body": "Quote from: pakhitheboss on May 01, 2023, 12:54:01 PMYou can check this thread - Wall Observer for Bitcoin price updates. It is done by Chart Buddy every hour. As of now, there are many websites and apps that can give you realtime updates of Bitcoin prices. I do not think there is any need of realtime Bitcoin price update on the speculation board. The user does an update from time to time, infact in less than an hour he make the post updates on bitcoin price, his case has been discussed already about causing a nuisance in what he post without any additional information, just a price updates when bitcoin prize go bearish or bullish, some even say that he uses AI to make such post because he don't respond to other post or any other board than WO, tracking bitcoin price is what is very common and simple to do with the use of any crypto app, exchange or websites for live updates, we are expected to discuss about this price movement o the WO and not to only post the update, it must be informative as well.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Coyster",
      "created_time": "May 02, 2023, 04:36:38 PM",
      "body": "Quote from: Aanuoluwatofunmi on May 02, 2023, 04:13:32 PMThe user does an update from time to time, infact in less than an hour he make the post updates on bitcoin price, his case has been discussed already about causing a nuisance in what he post without any additional information, just a price updates when bitcoin prize go bearish or bullish, some even say that he uses AI to make such post because he don't respond to other post or any other board than WO, ChartBuddy is not a regular user, but a bot that cannot engage in discussions. I don't think ChartBuddy is constituting a nuisance in the forum, the bot posts this Bitcoin price updates in the correct section: speculation > wall observer BTC/USD - Bitcoin price movement tracking and discussion. If the bot was prolly placed in another section, or if it made posts all around the forum then it would have been spam, but the speculation section is the appropriate section for it and i don't think the WO posters have any problem with ChartBuddy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zoomic",
      "created_time": "May 02, 2023, 04:55:50 PM",
      "body": "Quote from: LoyceV on May 01, 2023, 12:52:15 PMIt's going to be a boring price update:1BTC = 1BTCThis idea means that bitcoin is bitcoin and it's value shouldn't be measured or tied with another currency. But in stocks or other volatile industries, no stock or coin exists in isolation. For the value of bitcoin to be known at any time is must be measured against fiat, gold or another commodity.I also understand that many people support the idea of having a bitcoin live price update and others said  everything shouldn't be in the forum. It is fine we get the update and chart from outside the forum. All is fine. The price update in the wall observer thread does not solve the problem. I wanted something that will be at the top of speculation board, below the menu bar  and not something that will hide in another thread.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EarnOnVictor",
      "created_time": "May 05, 2023, 06:55:46 AM",
      "body": "This is a thoughtful question, live price feeds should be available, and I would suggest it on the first page of the forum where people visiting would be able to take a quick glance. The price feeds should be priced with major world currencies including gold as it's been done with websites dealing with assets.On second thought, the only setback might be that the forum wants to remain private, and can't do feeds without third-party involvement.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rikafip",
      "created_time": "May 05, 2023, 07:37:07 AM",
      "body": "Quote from: EarnOnVictor on May 05, 2023, 06:55:46 AMThis is a thoughtful question, live price feeds should be available, and I would suggest it on the first page of the forum where people visiting would be able to take a quick glance. The price feeds should be priced with major world currencies including gold as it's been done with websites dealing with assets.But bitcointalk is a discussion forum and not some news/trading portal so I don't really see the need to have live bitcoin/gold/whatever price update. I honestly don't care about the daily bitcoin price fluctuations, I  certainly woulnd't like to see something like that on the main forum page and I am pretty sure that I am not the only one. Hell, I even deleted mobile phone app that tracks portoflio as I honestly don't care what my bitcoin is currently worth since I am hodling and I removed CMC/Coingecko from my bookmark so I would really be bummed out to see that every time I visit forum (which is quite often).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Plaguedeath",
      "created_time": "May 05, 2023, 07:43:36 AM",
      "body": "Quote from: Zoomic on May 02, 2023, 04:55:50 PMThis idea means that bitcoin is bitcoin and it's value shouldn't be measured or tied with another currency. But in stocks or other volatile industries, no stock or coin exists in isolation. For the value of bitcoin to be known at any time is must be measured against fiat, gold or another commodity.Remember, Bitcoin is a decentralized currency, not a commodities like gold or stock. It just because USD is become the global reserve currency right now, if Bitcoin could replace fiat and become the global reserve currency, any currency or commodities will measure it's value against Bitcoin.Value and price are different thing, the value of Bitcoin is decentralization, security, transparency, privacy etc which never get changed since 2009.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rat03gopoh",
      "created_time": "May 05, 2023, 08:22:38 AM",
      "body": "This isn't an urgent proposal, I think it will be difficult to grant. Also there are actually many alternative ways just to install the price widget without leaving the current tab. It can be on your taskbar, browser addon bar. Or just hope that there are volunteer users who are willing to build a Tampermongkey script on this forum after this request.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "aylabadia05",
      "created_time": "May 05, 2023, 06:07:11 PM",
      "body": "Quote from: Zoomic on May 01, 2023, 12:36:52 PMWhy is there no live bitcoin price update in the forum. I am not suggesting that there should be live price update, I am just asking why there is none. I know this forum is for bitcoin and there are many die hard bitcoiners here and I have seen many developers here.It will not be hard to get an API which will fetch() live bitcoin price, if not everywhere in the forum, atleast at the top of the  Speculation board.I was trying to analyse bitcoin chart in speculation board, I saw myself opening the binance app in another tab and reading the chart from there to make a post in a bitcoin forum. It didn't make good sense to me. That is why I decided to ask the reason behind not implementing the live bitcoin price.Because it's not a requirement that is really needed like other things to be made even though you yourself don't mean to suggest that there be a price update here, but by asking it it can lead to things that are needed.We think that opening another tab in the browser is not something that can be inconvenient if you need to see the Bitcoin price for the post material to be made.Quote from: LoyceV on May 01, 2023, 12:52:15 PMIt's going to be a boring price update:1BTC = 1BTCI smiled to myself reading this.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}