{
  "id": "topic_5406998",
  "title": "325btc",
  "author": "325btc",
  "created_time": "July 20, 2022, 01:43:15 PM",
  "content": "This guy seems to be very interested about cryptoBut first do he even have wallet? Any btc ?If not then about crypto should talk someone with experince and some knowledge.People asking for what this guy getting payed?Just to talking even garling house laugh at him Its better him to learn topic then talk.Also we dont need SEC opinion or approvement for crypto they can mind their own lifes we dont need disturbing things crypto and exchangers are good binance giving money from the long shorts pumps giving us nice money everything is good we earn profit there is no need to change nothing leave crypto and exchangers how it is.Everything works just fine for us if they start ruin then the sec after i want to see apoligize to all the traders whos profits might be ruined also exchangers dont need to tell them nothing.Like ontario poloniex case canada...belive me if i would be poloniex owner i would say go mind your own business we understood that those goverment officials have their own life so boring so they try disturb others but they even dont own crypto they dont trade binance futures....first let them do it then let them talk U cant hear opinion or experise about cars from someone who never had a car even.Gerry cancler talking nonsense also PEOPLE see that and everything works fine traders get profit all good keep that way no need to change nothing in crypto.All the goverment and fed and sec just let them make sure repo funds are funding the markets for other things they are not needed the gerry cancer should better of instead of talking what security or not or other bla blahh to make sure markets are well feeded with repo funds from fed.Thats it",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5406998",
  "comments": [
    {
      "author": "hugeblack",
      "created_time": "July 21, 2022, 08:37:47 AM",
      "body": "I think you mean \"Gary gensler\" right? According to his understanding, he sees that Bitcoin has some characteristics of securities and therefore it is subject to the jurisdiction of the Securities and Exchange Commission.Does Bitcoin need the approval of that authority to survive? No, Bitcoin worked without SEC consent all this time.Do we need SEC approval to grow fast? Yes, by obtaining this approval, these assets will grow very quickly in a short time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "shogun47",
      "created_time": "July 22, 2022, 03:23:37 AM",
      "body": "Quote from: hugeblack on July 21, 2022, 08:37:47 AMI think you mean \"Gary gensler\" right? According to his understanding, he sees that Bitcoin has some characteristics of securities and therefore it is subject to the jurisdiction of the Securities and Exchange Commission.Does Bitcoin need the approval of that authority to survive? No, Bitcoin worked without SEC consent all this time.Do we need SEC approval to grow fast? Yes, by obtaining this approval, these assets will grow very quickly in a short time.The real issue is that Gensler is going completely nuts. The SEC is doing everything imaginable to put the \"security\" label on a token/coin in order to make a certain project or protocol (e.g. Bitcoin) be subject to their authority. https://beincrypto.com/sec-extrajudicial-industry-sweeps-crypto-sector-tom-emmer/https://beincrypto.com/crypto-regulation-enforcement-addressed-during-gensler-speech/The two articles explain the problem very well. They are even tricking projects out of their jurisdiction into responding to so called sweep letters, hoping for mistakes on behalf of the respondents in order to then crack down on them. The first article says that the SEC then publicly threatened projects that refuse to provide the requested information voluntarily (I quote from the article): \"Those failing to respond to supposedly voluntary information requests would, in the words of the SEC, face a “bloodbath.”\"  The thing is that the requested information in those sweep letters is not to be provided as per the law if I understood the article correctly. It is just a means to put pressure onto those projects in order to provide info that could later on be used against them. The SEC has never been particularly crypto friendly, but am I wrong saying that Jay Clayton was not as aggressive as this dude? When they publicly admit to be performing extrajudicial action against a particularly industry, how is that to be stopped from getting out of control if not by US authorities themselves?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jating",
      "created_time": "July 22, 2022, 11:22:04 PM",
      "body": "Yeah, and if I'm not mistaken, as far as what they level Bitcoin and Ethereum in 2017-2018 but are not been labelled as securities. So obviously, they don't have a control over it. But now it seems that SEC is changing their tune because of Gensler? I agree he is going bananas, and will just spin out everything so that they will have the authority to two of the biggest prime movers in crypto. And this is not good for us enthusiast, both are not tokens that can be used to pump and dump and no one has control over the price and it's hard to be manipulated.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "el kaka22",
      "created_time": "July 23, 2022, 07:23:42 AM",
      "body": "Bitcoin ETF and SEC were big news on this crypto space by the times of 2018/2019 but I do not think which remain same till now. I mean that crypto people might have assumed like if bitcoin ETF become popular then more people will easily come forward to adopt bitcoin but after institutional funds did some magic on bitcoin market, started forgetting about anything related to SEC.Still, I feel that if some high authority people do favor cryptocurencies after understanding its underlying concepts then more countries and institutions will adopt bitcoin which is the main thing we all always look for. Moreover, I am sure that such things will happen over the time but pushing up by high level people will be good and dream of all of us.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}