{
  "id": "topic_5467270",
  "title": "AlejndroBtc18",
  "author": "AlejndroBtc18",
  "created_time": "September 19, 2023, 02:45:31 AM",
  "content": "I bought an amount of BTC from a stranger and made my payment in cash! I checked to see if the BTC was available and if they were, after a day they just disappeared. Does somebody know anything about this? What happened? What is this situation called or something like that?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5467270",
  "comments": [
    {
      "author": "Don Pedro Dinero",
      "created_time": "September 19, 2023, 03:15:20 AM",
      "body": "Explain yourself better. Where do you have your wallet? On your mobile or a computer? What kind of wallet is it? I would bet that it is in a centralised entity and somehow they phished to show you the amount.What amount are we talking about?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "September 19, 2023, 03:18:30 AM",
      "body": "We can't help you without much information.1. What wallet were you using?2. Were you using an exchange wallet(Coinbase, Binance, etc) or a non-custodial wallet(BlueWallet, Electrum, etc)?3. Was the transaction confirmed with at least 2 confirmations?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cvetik56",
      "created_time": "September 19, 2023, 03:36:23 AM",
      "body": "Quote from: AlejndroBtc18 on September 19, 2023, 02:45:31 AMI bought an amount of BTC from a stranger and made my payment in cash! I checked to see if the BTC was available and if they were, after a day they just disappeared. Does somebody know anything about this? What happened? What is this situation called or something like that?Try to resync your wallet if it's possible. Check your address on blockchair. If it says that there were no transactions then nothing must be done if you bought your BTC from a stranger, he won't give you money back anyway.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "adaseb",
      "created_time": "September 19, 2023, 03:43:31 AM",
      "body": "Maybe post the transaction so we can look into it.Perhaps you downloaded some fake app which has a wallet which is compromised. And as soon as it receives a payment it’s sent elsewhere.Did the transaction confirm? Maybe they did a double spend but this is rare.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cantsay",
      "created_time": "September 19, 2023, 04:12:57 AM",
      "body": "Quote from: AlejndroBtc18 on September 19, 2023, 02:45:31 AMI bought an amount of BTC from a stranger and made my payment in cash! I checked to see if the BTC was available and if they were, after a day they just disappeared. Does somebody know anything about this? What happened? What is this situation called or something like that?Why I’m feeling like you bought the wallet from the person? Op can you please confirm that you didn’t buy any private keys to a wallet that have a balance and bought some actual bitcoin that was sent to a new wallet that you created and sent to the person? If your answer is the latter then follow the advice that has been provided above and provide either your wallet address or the tx Id.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LoyceMobile",
      "created_time": "September 19, 2023, 04:51:16 AM",
      "body": "It sounds like you accepted an unconfirmed Bitcoin transaction, and got scammed. Bitcoin fees are quite high at the moment, which gives the seller/scammer plenty of time to use RBF to replace the transaction by another one.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Despairo",
      "created_time": "September 19, 2023, 04:58:28 AM",
      "body": "Possibility if the seller is a scammer: double spend.Possibility due to your ignorance: downloading phishing wallet, clicking random link, share private key, etc.I hope the wallet or exchange you using were glitched because there are some sites like that e.g. Coinbase or Blockchain.com. You need to use better wallet e.g. Electrum or Bluewallet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fivestar4everMVP",
      "created_time": "September 19, 2023, 05:18:27 AM",
      "body": "Quote from: AlejndroBtc18 on September 19, 2023, 02:45:31 AMI bought an amount of BTC from a stranger and made my payment in cash! I checked to see if the BTC was available and if they were, after a day they just disappeared. Does somebody know anything about this? What happened? What is this situation called or something like that?We are in 2023 going to 2024, though your complaint lack adequate information to properly digest the situation and give proper solution or advice to avoid such occurrence next time, the only thing of sense I could grab here is you stating you bought Bitcoin from a stranger, we are no longer in 2010 to 2014 when buying Bitcoin was a hurdle for many due to lack of trusted exchange platforms, why would you opt to buying Bitcoin from a stranger when you should have bought directly from the exchange, several exchanges offer fiat deposit through p2p or direct deposit ..Whether it be centralized or non-custodial wallet you used to received those bitcoins, what I believe you saw was the incoming transaction, and seeing that you are a newbie the person you bought from probably reversed the transaction..Or another possible scenerio is, if you meet the person whom you bought the Bitcoin from physically(since you said you paid him in cash), then recall if you gave this person your phone, the person must have used that opportunity to copy and save your wallet private key on his own device, and immediately after sending you the Bitcoins you bought, he went behind you back to login into your wallet though with your private keys, then withdrew those coins back..You gotta be very vigilant and careful in this space man .",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Latviand",
      "created_time": "September 19, 2023, 05:18:41 AM",
      "body": "The wrong thing that you did was to trust the stranger and at the same time not even confirm with your eyes that they've paid you. Basing on your limited information, it seems like this is a transaction done in person. Maybe @LoyceMobile is right, they could've used RBF to redirect the destination address of the bitcoin back to them. As the others have pointed out, post your address so people can see what you're talking about or even the conversations with the person prior to the bitcoin purchase.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "davis196",
      "created_time": "September 19, 2023, 06:01:41 AM",
      "body": "Quote from: AlejndroBtc18 on September 19, 2023, 02:45:31 AMI bought an amount of BTC from a stranger and made my payment in cash! I checked to see if the BTC was available and if they were, after a day they just disappeared. Does somebody know anything about this? What happened? What is this situation called or something like that?Payment in cash? You mean that you have actually met the stranger in person and you gave him paper cash?How does he look like? You could call the police and tell them about this scam. You could describe how the stranger looked like and police might try to find him. Can you post screenshots of your Bitcoin wallet? What kind of BTC wallet are you using?Is there an outgoing transaction in your BTC wallet(BTC sent to another address, not received)? Were the coins transferred to another BTC address or they are just missing?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "September 19, 2023, 06:30:43 AM",
      "body": "Quote from: mk4 on September 19, 2023, 03:18:30 AM3. Was the transaction confirmed with at least 2 confirmations?You mean one confirmation. Block reorgs are extremely rare and if they happen the transaction probably just goes back to the mempool and gets confirmed immediately in the next block instead.If the transaction was visible for a full day and then it disappeared, that means the other party used a very low fee, because most normal fees would make the transaction confirmed within a few hours max.Never send cash payment before the transaction is confirmed during P2P exchange, it is a common scam.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "September 19, 2023, 07:14:02 AM",
      "body": "According to OP question, the attacker likely double spent the coin using RBF is what that likely happened.Quote from: NotATether on September 19, 2023, 06:30:43 AMIf the transaction was visible for a full day and then it disappeared, that means the other party used a very low fee, because most normal fees would make the transaction confirmed within a few hours max.You are correct, but I just want to point out that it does not mean that the transaction can be seen by the victim the whole day, the bad actor can immediately use RBF to cancel or invalidate the transaction anytime that he knows the victim has paid already.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Outhue",
      "created_time": "September 19, 2023, 07:25:11 AM",
      "body": "It looks like you approved an unconfirmed BTC transaction and released your money to the stranger.By the way, why are you doing business with a stranger? If you can confirm that this person is a Stranger, why do business with them? As a crypto newbie, you can't tell me that you don't know about crypto exchanges where you can safely buy your Bitcoin with Fiat. I think there is more to this story than you are telling us, I think this stranger promised to sell the BTC for a cheaper rate to you, probably a 50% off, because what can make you buy Bitcoin from a stranger? Can you provide screenshot of you and this stranger's conversation? Your wallet address? Or transaction harsh? What is the name of the wallet you use? A Double spending attack happens because of an attractive offer, coming from a stranger,  in your case this is the only thing that makes sense to me.Sorry to say, no one on this forum can help you get your money back, it's gone, at least learn from your mistake and avoid strangers in the future.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "reagansimms",
      "created_time": "September 19, 2023, 07:26:46 AM",
      "body": "The case you are facing is very complicated, there is not much that forum members can do to help you without being equipped with valid information about the transaction process that occurred. Why buy it from strangers, isn't there a centralized exchange that you can use to buy Bitcoin.?Next time, never trust anyone you just met through social media, they are scammers who always target their victims in any way. That's how they work, after getting what they want, they will just disappear without a trace.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AHOYBRAUSE",
      "created_time": "September 19, 2023, 07:29:40 AM",
      "body": "Quote from: Charles-Tim on September 19, 2023, 07:14:02 AMAccording to OP question, the attacker likely double spent the coin using RBF is what that likely happened.Quote from: NotATether on September 19, 2023, 06:30:43 AMIf the transaction was visible for a full day and then it disappeared, that means the other party used a very low fee, because most normal fees would make the transaction confirmed within a few hours max.You are correct, but I just want to point out that it does not mean that the transaction can be seen by the victim the whole day, the bad actor can immediately use RBF to cancel or invalidate the transaction anytime that he knows the victim has paid already.Seems like that scenario.Maybe, since the mempool is super low and OP looks like he doesn't know anything about bitcoin and so on, the seller chose a super low fee, let it sit for some hours cause he knows it won't confirm anyway, then double spent it and the money was gone.As a newbie it is really important to educate yourself better how bitcoin and crypto currency works. If you don't then you open yourself up to the possibility of getting scammer. There are a lot of black sheep out there.Where ever you found the scammer, try to get him to sell you something again, make a trap with a new account or something like that. If he bites you can get him and possibly get your money back. And don't go alone, bring some backup with you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Blitzboy",
      "created_time": "September 19, 2023, 07:33:37 AM",
      "body": "It's hard to identify what went wrong without more facts. Your issue sounds familiar. It reminds me of \"double spend.\"An attempt to spend the same Bitcoin twice is called a \"double spend.\" After checking your balance, did you observe how many confirmations? A deal isn't really \"final\" until it's been confirmed more than once. If zero, it might be reversed around.If you ever trade peer-to-peer, especially with a stranger, wait multiple confirmations (my standard is 6) before considering a transaction complete. Be careful and check again and again",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Woodie",
      "created_time": "September 19, 2023, 07:34:38 AM",
      "body": "When you say they coins disappeared, do you mean you can't see your coin from your wallet dashboard or coins can not be seen on address even after using an explorer??If coins disappeared from wallet dashboard try resyncing it as this is something normal if wallet isn't oftenly used...but if coins don't even show up on an explorer unfortunately your contact might have pulled a fast one on you.Quote from: NotATether on September 19, 2023, 06:30:43 AMIf the transaction was visible for a full day and then it disappeared, that means the other party used a very low fee, because most normal fees would make the transaction confirmed within a few hours max.One of the disadvantages of bitcoin >>>\"RBF\" which is a good and bad feature about having this feature as it makes double spending so easy.With the current low transaction fees do we still have transactions taking all day to get confirmed thought such a tx should be confirmed within a few hours at the most.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BALIK",
      "created_time": "September 19, 2023, 07:39:35 AM",
      "body": "Quote from: AlejndroBtc18 on September 19, 2023, 02:45:31 AM What happened? What is this situation called or something like that?No one can tell you what is happening to you with your short sentences. At the very least, you need to provide us with some evidence such as the wallet you used and the wallet address you used to receive the bitcoins...Furthermore, why don't you use an exchange to buy bitcoin and instead buy it from a stranger? You are just a newbie and are becoming the target of many scammers, you should be more careful when talking and dealing with those strangers. I don't know if it's a big amount of money or not but my condolences for your loss.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sim_card",
      "created_time": "September 19, 2023, 08:32:18 AM",
      "body": "Quote from: AlejndroBtc18 on September 19, 2023, 02:45:31 AMI bought an amount of BTC from a stranger and made my payment in cash! I checked to see if the BTC was available and if they were, after a day they just disappeared. Does somebody know anything about this? What happened? What is this situation called or something like that?You have been scammed mate, never deal with strangers because even people that you know can scam you talk more of a stranger that you don't know where to get him. Next time buy bitcoin from an exchange and use p2p method. There is nothing one can do to help your situation, this is a hard lesson for you. Always make sure that the transaction is confirmed before send the funds.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}