{
  "id": "topic_5459986",
  "title": "BayAreaCoins",
  "author": "BayAreaCoins",
  "created_time": "July 16, 2023, 09:54:02 AMLast edit: July 17, 2023, 03:26:35 AM by BayAreaCoins",
  "content": "We have been having at least a few people buying Bitcoin Testnet coins lately on AltQuick.com.  I know this is a bit tabboo in the community, but as Bitcoin grows... people want these coins for short periods of time and they want whole coins to test their big new platforms.Bitcoin Testnet has a block reward of 0.02 TBTC every ten minutes and this makes it a bit of a pain in the ass obtaining them privately.The AltQuick exchange offers a bid/ask for Bitcoin Testnet with Bitcoin and allows people to anonymously trade between the two.  I suspect this leads to more people \"returning\" their \"valueless\" Bitcoin Testnet coins and keeps the testing rolling smoothly.  People aren't just using Bitcoin Testnet for development, they are using it to test using Bitcoin itself.  This at the very least keeps someone downloading Bitcoin files and not some dirt cheap/sketchy Altcoin wallet.  I personally see it as a good thing.I'm writing this because we need more people willing to sell Bitcoin Testnet on our exchange.  You can name your price.  If they are valueless... sell them for the least possible Bitcoins.  It seems someone, somewhere, appreciates it and hopefully, they are building something cool.https://altquick.com/exchange/market/BitcoinTestnetSignup is quick and requires any personal information or email.  Bitcoin Testnet deposits take 100 confirmations (avg 20-minute block times) & you can test our deposit system for free using various different blockchain Bitcoin testnet faucets online.Please feel free to discuss this in this thread regardless of your opinion.  It should be noted we give away free Bitcoin Testnet coins through our sister site FreeBitcoins.com as well as through a faucet and users can instantly put their Bitcoin Testnet coins on the blockchain with just one faucet hit.  There is also a warning on the Testnet exchange.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5459986",
  "comments": [
    {
      "author": "Luchewson",
      "created_time": "July 17, 2023, 08:22:06 PM",
      "body": "This is weird to me because I have tones of testnet bitcoins stucked up somewhere.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BayAreaCoins",
      "created_time": "July 18, 2023, 01:54:48 AM",
      "body": "Quote from: Luchewson on July 17, 2023, 08:22:06 PMThis is weird to me because I have tones of testnet bitcoins stucked up somewhere.Help put them in circulation for people who want to develop things that have 1000 BTC on them or new users who want to transfer coins around to practice their copy/paste skills.  Sell them or donate them to a faucet <3Thanks for the consideration.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}