{
  "id": "topic_5437930",
  "title": "uche6215",
  "author": "uche6215",
  "created_time": "February 03, 2023, 01:23:36 PM",
  "content": "My first experience about Bitcoin, I was busy saying Bitcoin is a scam for about let me say 1 year and some month not untill a friend of mine was into forex trading so I visited him and I was watching what he was doing so one day he made a big hit for about $2000 for just a night. And That's what push me more to trade Bitcoin with forex trading I didn't pay to learn. But now am not into forex trading am into stock marketing. I buy when the price is low and sell when the price increaseses.And That's how I made my first $1000",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5437930",
  "comments": [
    {
      "author": "Getmon",
      "created_time": "February 03, 2023, 01:47:28 PM",
      "body": "The objective of every trader is to make money. Is it clear that we need to buy low and then sell high in order to earn money in trading? I applaud on your earnings. However, your topic is completely illogical. You never talked about the specific stocks, charts, and indicators you trade. However, perhaps your sole purpose here is to inform all bitcointalk members that you earned $1,000 through stock trading. Therefore, prior to creating topics, you might want to move your topic to the appropriate location and familiarize yourself with the forum.Trading discussions- https://bitcointalk.org/index.php?board=8.0",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Osama Maaz",
      "created_time": "February 03, 2023, 07:07:59 PM",
      "body": "Thats awesome Congratulation Mate, But i warn you that in markets if your strategy is working is a specific trend then its not meant that is best strategy and put all your funds to multiply ,I suggest to use proper risk management which you might using , second diversify your portfolio and divide it so if anyone stock give you lose others recovers all your portfolio .   You are doing great But at a point we get in greed and thats things that market teaches me with high loses .",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitcoin_Arena",
      "created_time": "February 03, 2023, 11:24:28 PM",
      "body": "So which is which bro? Something is definitely not right. Did you make your first $1000 or $2000?Quote from: uche6215 on February 03, 2023, 01:23:36 PMHow I made my first $2000 through stock marketingQuote from: uche6215 on February 03, 2023, 01:23:36 PMAnd That's how I made my first $1000Regardless, trading is a journey, today to can make very huge profits and then the next time losses. Be well armed with good risk management practices if you want to keep long in the game.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tbct_mt2",
      "created_time": "February 03, 2023, 11:39:18 PM",
      "body": "Quote from: uche6215 on February 03, 2023, 01:23:36 PMI was busy saying Bitcoin is a scam for about let me say 1 year and some month not untill a friend of mine was into forex trading so I visited him and I was watching what he was doing so one day he made a big hit for about $2000 for just a night.How much is his initial capital to make $2000 after a night?If it is a $2000 or smaller initial capital, it is a big win even just by luck. If the initial capital is like $100,000 it is not a big win, just 2% from initial capital.The more importance is did your friend succeed to protect his initial capital and that won part ($2,000) after all?QuoteAnd That's what push me more to trade Bitcoin with forex trading I didn't pay to learn. But now am not into forex trading am into stock marketing. I buy when the price is low and sell when the price increaseses.Trading in forex or stock means you don't own any bitcoin. Not your keys, not your coins and I'm sure that with forex or stock, you don't own any key.Trading is more risky than investment and with Bitcoin, you will have best ROI by investment, not by trading.QuoteAnd That's how I made my first $1000Again, if you don't say how much did you spend initially, your story does not present that you succeed much.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dansus021",
      "created_time": "February 04, 2023, 01:49:03 AM",
      "body": "Quote from: uche6215 on February 03, 2023, 01:23:36 PMI was busy saying Bitcoin is a scam for about let me say 1 year Uhhh a little bit hurt for me  and you don't say the bitcoin is a scam right now right? forex, stock, and crypto is a volatile asset in my opinion but the crypto is very high volatile. But your friend's trade forex hit 2K in single night I think the initial balance is 1000+ but here is my friend I will give you some advice what you see is when the trade is profit of course it will be fun but you should now the market isn't always run in your direction so sometimes you will see a loss too so be prepared",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "February 04, 2023, 02:12:42 AM",
      "body": "So you thought bitcoin was a scam, until you found out that you can make money by trading it?Mate, being able to make money by trading something doesn't make it a not-scam. You can trade crypto scams all day and make money, but in the end they're still scams.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ethereumhunter",
      "created_time": "February 04, 2023, 06:29:56 AM",
      "body": "Your friend is very lucky to make $ 2000 in one night. You are also lucky to make $1000 but more important is how you can make the same or even close amount after you make $1000. This is sometimes more difficult than before because any market situation will definitely not be the same and will always change.You are better suited to be in stock marketing, while others are better suited to bitcoin trading. And we should keep learning to make bigger profits. And congratulations to you @OP, who can make that profit.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Maus0728",
      "created_time": "February 04, 2023, 11:49:15 AM",
      "body": "I would appreciate it if you could provide more details about that particular trade rather than simply stating what you're up to. I'm not saying the story is made up; I'm just stating the post is questionable.You could share how is your chart looks like, your risk:reward ratio, what's the overall market structure when you execute the trade, your entry and exit, how's your risk management or anything useful infos that can help us improve.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "palle11",
      "created_time": "February 05, 2023, 06:08:51 PM",
      "body": "Quote from: uche6215 on February 03, 2023, 01:23:36 PMBut now am not into forex trading am into stock marketing. I buy when the price is low and sell when the price increaseses.And That's how I made my first $1000Buying when price is low and selling if it gets higher is the ideal of trading both real life and online, both stock, forex or cryptocurrency. Now that you have made your first profit don't throw caution away because you still need to understand that there different risk in trading so you need to trade with all the mechanism of trading to avoid unnecessary and huge loss as it looks you and your friend are trading with heavy risk tendencies. Be careful not manage your money well to avoid huge losses when it will come.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "South Park",
      "created_time": "February 05, 2023, 07:54:08 PM",
      "body": "Quote from: uche6215 on February 03, 2023, 01:23:36 PMMy first experience about Bitcoin, I was busy saying Bitcoin is a scam for about let me say 1 year and some month not untill a friend of mine was into forex trading so I visited him and I was watching what he was doing so one day he made a big hit for about $2000 for just a night. And That's what push me more to trade Bitcoin with forex trading I didn't pay to learn. But now am not into forex trading am into stock marketing. I buy when the price is low and sell when the price increaseses.And That's how I made my first $1000Be very careful, according to your story you thought bitcoin was a scam and what changed your mind was not an exhaustive investigation about the economy and how money works, you changed your mind simply because a friend of yours made a lot of money in front of you in a short amount of time, and this is the incorrect way to judge an investment, if you earned money in a ponzi scheme this will not make it legitimate since many other people lost money with it and if you began losing money with bitcoin this does not make it a scam either.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "examplens",
      "created_time": "February 05, 2023, 10:57:18 PM",
      "body": "Quote from: uche6215 on February 03, 2023, 01:23:36 PMI buy when the price is low and sell when the price increaseses.And That's how I made my first $1000congratulations my friend, you have really come up with a brilliant idea. Buy low and sell high, It's a real wonder that no one has thought of it until now. take this as advice, you need to actively trade for at least a year to be able to talk about any success, things change very easily and your $1000 or $2000 from the subject can easily become only $100.I sincerely hope you don't appear on another board where you offer your advisory services or \"successful trading\" tutorial.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "boyptc",
      "created_time": "February 05, 2023, 11:51:54 PM",
      "body": "Then that's great and congratulations.If you're no good in the other markets, you better be jumping off from one to the other and see if you've got the potential to grow there. But we're just in talks and having some conversation without proof.But I'll give you that and still have congratulated you with that achievement that you've mentioned. You just have to be consistent and see if you'll be able to make it as your day job.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GreatArkansas",
      "created_time": "February 06, 2023, 01:30:23 AM",
      "body": "For OP, can you share your experience when you start to trade Bitcoin compared to Forex or stocks?How it different from cryptocurrency, I know someone that are traders on forex and stocks for a long time and they are profitable, but when they start doing to trade cryptocurrencies, they are not profitable anymore.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OcTradism",
      "created_time": "February 06, 2023, 02:40:55 AM",
      "body": "Quote from: GreatArkansas on February 06, 2023, 01:30:23 AMHow it different from cryptocurrency, I know someone that are traders on forex and stocks for a long time and they are profitable, but when they start doing to trade cryptocurrencies, they are not profitable anymore.Each market has its own characteristics so traders must build up their own skill sets for each market. They can not apply same strategy from stock to forex and cryptocurrency markets. A strategy can work fine in stock but fails in Forex and bring nightmare in cryptocurrency market.With cryptocurrency market, it has many differences than stock and Forex markets. Because it is a young market which little regulations so it is more sensitive to news and regulatory rumor as well actual enforcement. In this market, you can trade well in 2 weeks or 6 months but suddenly, the market flips its trend and if you are not careful and don't have good strategy to cut loss, exit and protect your capital, all profits will vanish in a few minutes or hours.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "KingsDen",
      "created_time": "February 06, 2023, 08:26:37 AM",
      "body": "Quote from: uche6215 on February 03, 2023, 01:23:36 PMMy first experience about Bitcoin, I was busy saying Bitcoin is a scam for about let me say 1 year and some month not untill a friend of mine was into forex trading so I visited him and I was watching what he was doing so one day he made a big hit for about $2000 for just a night. And That's what push me more to trade Bitcoin with forex trading I didn't pay to learn. But now am not into forex trading am into stock marketing. I buy when the price is low and sell when the price increaseses.And That's how I made my first $1000Congratulations Op!Your thread title said about how you made your first $2000 but the body of your thread said you made your first $1000 which is a big contradiction. Again, the way you narrated your story like a novice who kept watching his friend trade forex and from watching forex trading he learnt to trade stocks. I feel you didn't tell the whole stories how it is supposed to be. This story may likely deceive newbies to think that trading volatility is so simple and they will fall for it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yhiaali3",
      "created_time": "February 06, 2023, 10:15:56 AM",
      "body": "This is just it!! Is that all??!!I do not know, but I feel that there is something missing in the story, everyone understands instinctively that trading is buying at a low price and selling at a higher price, but is it that easy? I do not think so.Everyone is surprised that you earned $2,000 on your first day of trading, but perhaps this could happen, but of course it will not always happen. It is possible in the next times that the exact opposite will happen, so you have to learn well and gain more experience so as not to fall victim to your first success.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "South Park",
      "created_time": "February 13, 2023, 07:39:48 PM",
      "body": "Quote from: yhiaali3 on February 06, 2023, 10:15:56 AMThis is just it!! Is that all??!!I do not know, but I feel that there is something missing in the story, everyone understands instinctively that trading is buying at a low price and selling at a higher price, but is it that easy? I do not think so.Everyone is surprised that you earned $2,000 on your first day of trading, but perhaps this could happen, but of course it will not always happen. It is possible in the next times that the exact opposite will happen, so you have to learn well and gain more experience so as not to fall victim to your first success.Maybe @uche6215 skipped a part of the story because I also think that he went from not trading to earning 1000 in a short amount of time, so he either took his time to learn how to trade or he just began trading without knowing what he was doing and he was lucky enough to get those profits, but if it is the latter then @uche6215 needs to be very careful as I do not think he can sustain those results and it will not take him long to lose those profits and the rest of his capital.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "goaldigger",
      "created_time": "February 13, 2023, 09:21:32 PM",
      "body": "You’re into stocks, forex and crypto? Since these are all different market though have the same trading rules. Well, you’re not the only one who don’t believe with Bitcoin at first but the moment they start earning crypto, they will realize that they are wrong and they are starting to explore this market. If you already made profit from your Bitcoin activities, then its good for you try to learn more and you’ll see a lot of opportunities here.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "justdimin",
      "created_time": "February 14, 2023, 09:50:50 AM",
      "body": "Quote from: goaldigger on February 13, 2023, 09:21:32 PMYou’re into stocks, forex and crypto? Since these are all different market though have the same trading rules. Well, you’re not the only one who don’t believe with Bitcoin at first but the moment they start earning crypto, they will realize that they are wrong and they are starting to explore this market. If you already made profit from your Bitcoin activities, then its good for you try to learn more and you’ll see a lot of opportunities here.How can we earn a crypto if we don't believe at it? But, to be able to earn we must believe on it first because this was the only way for us to buy and hodl them. The OP is not into forex but he only applied what he learned to it and it work. Well, that's no surprise because like you said all of them have the same rules and that is to buy low and sell high.Since the OP just learned forex, why can't he just try it as well right? Because even though they have the same rules, their market is still different from each other. what I know is that stocks and forex market are more stable but crypto market is highly volatile. It's much riskier in short so it would be better to diversify to cut the risk.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}