{
  "id": "topic_5444947",
  "title": "Godlovesyou",
  "author": "Godlovesyou",
  "created_time": "March 15, 2023, 06:48:23 AM",
  "content": "I do know how people massively gather btc and looking at this period trade has not been fair enough. I saw a friends btc wallets yesterday I was shock, he told me I used to do loaning and credits facilities to double up investment and trades. Is there loan and credits facilities on BTC that one can obtain and pay back at agree terms of blockchain? I guess if there is many people would be quite managing the situations of BTC prices dropping. Anywhere to obtain loans and credits? Guys",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5444947",
  "comments": [
    {
      "author": "Oshosondy",
      "created_time": "March 15, 2023, 07:12:22 AM",
      "body": "Loaning is risky is what I know and it is not fiat which you can be able to obtain license for, but if you are able to obtain license for it in your country, it may be a good idea if you can cope with both bull and bear market. Some people are using a lending platform, but the profit is small. Most of the lending platform are centralized, which is another thing to consider.Quote from: Godlovesyou on March 15, 2023, 06:48:23 AMI do know how people massively gather btc and looking at this period trade has not been fair enough.Some people are not traders, they trade during bull run, buying or opening a long position during bull run, thinking they are good, not knowing it is the market period that is favoring them. Traders can make profit both in bull and bear market, but trading is risky.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rat03gopoh",
      "created_time": "March 15, 2023, 07:29:47 AM",
      "body": "BTC doesn't have that facility. It has to be built outside of the bitcoin blockchain and sure it can use some of the features bitcoin has available such as the use of multisig to hold collateral funds like decentralized lending in general.However, developers prefer to build such facilities based on altcoins smartcontract due to some complexity reasons. So they also created fake bitcoins called \"wrapped-btc\" on demand.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Maslate",
      "created_time": "March 15, 2023, 07:54:07 AM",
      "body": "There's no such kind of facility that exists. Most online loans are non-collateral loans, so they're a bit risky. Perhaps your friend knows how to manage the risk, and that's the reason he was able to grow his funds. Well, lending is not as risky as trading because you just have to lend BTC and expect payment once the loan is due. As long as you are on a platform where the default rate is low, I'm sure you'll make a profit. But keep in mind, it's a slow and steady process.Additionally, we also have a loaning service here in bitcointalk, in case you wanna try just visit https://bitcointalk.org/index.php?board=65.0You can also try https://www.binance.com/en/loan",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Doan9269",
      "created_time": "March 15, 2023, 10:05:39 AM",
      "body": "Quote from: Godlovesyou on March 15, 2023, 06:48:23 AMIs there loan and credits facilities on BTC that one can obtain and pay back Even right on this forum there's a board (lending) where members offers loans and other valuables for loan to other members and you will have to stake your address used in signing a message on the forum or have anything valuable to serve as qualateral for the loan you want to take, also considers the need before going for it because there's a certain percentage you will be charged for taking loan, read their requirements for eligibility before applying.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tbct_mt2",
      "created_time": "March 15, 2023, 10:57:02 AM",
      "body": "Quote from: Godlovesyou on March 15, 2023, 06:48:23 AMI saw a friends btc wallets yesterday I was shock, he told me I used to do loaning and credits facilities to double up investment and trades. Hopefully you don't fabricate the story.If I was your friend, I'd never show my wallet to you. It brings me to more risk and I am not a type of person who want to show others that I am rich and expose myself to potential thief. QuoteIs there loan and credits facilities on BTC that one can obtain and pay back at agree terms of blockchain? I guess if there is many people would be quite managing the situations of BTC prices dropping.I don't fully understand your question but making loan to invest into anything is not good idea.When you make a loan, usually you have to submit collateral that can be your house, your car, your coin and there are terms for liquidations. You don't want to be liquidated but it is not what you can fully control.When Bitcoin has big green or big red candles, you will see long candle tails that are signals that many gamblers were liquidated.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "March 15, 2023, 11:16:15 AM",
      "body": "Quote from: tbct_mt2 on March 15, 2023, 10:57:02 AMHopefully you don't fabricate the story.I hope that he was not deceived by his \"friend\", because it is not too much of a problem to \"fake the balance\", because all you need is to create a watch-only wallet, and enter a public address that has a very nice balance that you can brag about, which of course it's not something I would recommend to anyone if they don't want to jeopardize their safety.Quote from: tbct_mt2 on March 15, 2023, 10:57:02 AMI don't fully understand your question but making loan to invest into anything is not good idea.There are only two options, either the OP is asking where he can invest his BTC to double the amount he currently owns, or where he can borrow money to buy more BTC. Both options are a bad choice, with the difference that the first is a little less painful because you lose the BTC you lent to someone, and the second means that you borrowed money to buy BTC and it happens that you can't pay back the loan and then you lose a little more in your life, especially if the loan is from a loan shark.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wapfika",
      "created_time": "March 15, 2023, 11:22:35 AM",
      "body": "There’s no on-chain loan facility for Bitcoin that will let you trade through smart contract. You can use DeFi platform but you will need a wrapped BTC in able to lend your Bitcoin through smart contract since Bitcoin blockchain doesn’t have this feature.You are not technically lending actual BTC since it’s just wrapped but it’s the only way to lend your BTC on chain or else you will need CEX service which is very risky.FYI there’s no double investment or high yield on lending in crypto or else you are looking for a HYIP scam.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Godday",
      "created_time": "March 15, 2023, 11:34:22 AM",
      "body": "It is a risky move because if you ask for a loan in BTC and then the price of BTC experiences an extreme increase or decrease of course it will destabilize your economy or the one who gave you the loan.  And what I already know is that BTC doesn't have that facility.  And those who carry out cryptocurrency trading will also not take such a very risky action.  I think it's better if you make a loan at a Financial Company and it's safer and you only need to pay low interest.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Z-tight",
      "created_time": "March 15, 2023, 11:44:33 AM",
      "body": "Quote from: Godlovesyou on March 15, 2023, 06:48:23 AMI do know how people massively gather btc and looking at this period trade has not been fair enough.People \"gather\" BTC by buying it, people have their own ways of buying, but dca is a good way to \"gather\" BTC without affecting your financial life so much.Quote from: Godlovesyou on March 15, 2023, 06:48:23 AMI saw a friends btc wallets yesterday I was shock, he told me I used to do loaning and credits facilities to double up investment and trades. Do not look into people's wallets, if anything happens to their money they would blame you. They may even be lying, and want you to be jealous and then greedy so you can be deceived by them in an easy way.Quote from: Godlovesyou on March 15, 2023, 06:48:23 AMIs there loan and credits facilities on BTC that one can obtain and pay back at agree terms of blockchain? I guess if there is many people would be quite managing the situations of BTC prices dropping. Anywhere to obtain loans and credits? GuysWhy didn't you ask your friend what kind of \"loan and credit facility\" he is into. Use dca to buy BTC, do not take loans because you may not be able to pay your creditor back, and your BTC may be below the price you paid for it at that time. Do not also loan your BTC to lending platforms or centralized exchanges for liquid cash or for interest, volatility can affect your interest and the service can collapse, and your money is gone.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}