{
  "id": "topic_5402147",
  "title": "danadc",
  "author": "danadc",
  "created_time": "June 10, 2022, 10:26:33 PM",
  "content": "Para nosotros que tenemos siempre muchas maneras de buscar tener BTC o cualquier criptomoneda surge la incógnita de saber cómo podemos incrementar las maneras de hacer más BTC, y surgen algunas ideas, una de ellas es el Staking, pues es muy buena opción, lo único que es dependiente de un tercero y en cualquier momento puede pasar lo peor y quedarnos sin nada, ahora bien la minería de BTC pero las máquienas son muy costosas y el mantenimiento es una de las cosas que siempre deben estar fijas.En este artículo me parece que es interesante lo que dicen y una de las plataformas confiables que muestran son las de los casinos para hacer el staking, pero realmente es confibale esto?QuoteEl staking de criptomonedas, una inversión que se ha popularizado porque permite ganar dinero de forma pasiva, y la minería de Bitcoin y otras monedas, que tiene toda una estructura pensada para la ganancia de recompensas, son dos de las alternativas dispuestas para los que quieren invertir fondos en el ecosistema emergente.Fuente: https://www.criptonoticias.com/mineria/staking-mineria-criptomonedas-dos-maneras-invertir-ganar-dinero/Para los más expertos, ¿Qué prefieren ustedes, Staking o Minar? ambas opciones me parecen interesantes y me atraen.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5402147",
  "comments": [
    {
      "author": "DdmrDdmr",
      "created_time": "June 11, 2022, 12:43:04 PM",
      "body": "No me categorizaría entre el rango de los más expertos, ni mucho menos en términos prácticos sobre las dos opciones planteadas, pero si hablamos de BTC, el staking de algún emulador que he probado (Binance) da poco rendimiento, y además sorprendentemente con rendimiento porcentual decreciente a más BTCs que pongas en staking. La idea de stakingno me atrae en demasía de por sí, al no tener un pleno control de tus bitcoins. Más allá del riesgo plataforma que pueda existir, durante la época que prestas el dinero para el staking, dejas de tener control de tus claves, y una vez lo has tenido, no es algo que quieras realmente perder de vista. A su vez, si el dinero llega a estar bloqueado durante cierto plazo de tiempo, un vaivén del mercado puede dejarte atrapado sin poder maniobrar.La minería conceptualmente me atraería más, pero realizarlo a nivel individual hoy por hoy tiene tintes de poder ser más un gasto que una inversión, máxime en paises con los costes energéticos disparados como lo están por estas latitudes.Sería interesante por eso escuchas experiencia práctica reciente en ambos terrenos.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hispo",
      "created_time": "June 11, 2022, 08:14:34 PM",
      "body": "Si nos debatimos solamente entre esas dos alternativas: Minar o Staking, debermos tener en mente que ya la minería es algo como una profesión en la cual se necesita de equipos especializados y costosos, aunado a cumplir con las leyes/impuestos del país en donde se viva (Tengo entendido por ejemplo, que en España los impuestos sobre los llamados \"autónomos\" son significativamente elevados).Así que eso nos deja con la opción del \"staking\" en plataformas centralizadas. Como ya lo ha mencionado el compañero DrmrDdmr, los exchanges de más confianza como Coinbase o Binance ofrecen porcentajes que en lo personal, dirían que no justifican el ceder nuestros satoshis a terceros y aunque existen plataformas que ofrecen mejores rendimientos, creo que aún así no vale la pena por el riesgo que suponen los términos y servicios de estas, si la mayoría de las personas se dedicaran a leer y a entender de forma más clara estos términos creo que se lo pensarían dos o tres veces antes de apuntarse.Creo que como los que hacemos vida en este foro consideramos a Bitcoin como una forma de dinero, entonces estaremos de acuerdo que actualmente, al igual que el FIAT, la mejor forma de obtenerlo para la mayoría es mediante el trabajo.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "darxiaomi",
      "created_time": "June 12, 2022, 03:23:43 PM",
      "body": "El problema radica en varias cuestiones.1- Hay que admitir y hacer un mea culpa de que el mundo crypto esta movido principalmente por adolescentes y jovenes. El problema viene de que estos tiene varias aristas, una claramente positiva que es la energia joven con fuerza para transformar pero tambien una negativa su consiguiente falta de experiencia y creer que se lleva todo por delante. A que voy con esto, a que es realmente patetico ver como mucha gente pone su dinero y al mismo tiempo crea o realmente cree que X proyecto va a funcionar, cuando solo esos sistemas se mantienen andando por una sola cuestion, y esta es que el mercado esta super BULLISH (claramente no en este momento).La mayoria de Stackings son cosas sin sentido alguno, son pedaleadas financieras que funcionan hasta que se va el mercado alcista, o el que monto eso decide terminarlo, o un gran jugador decide tomar muchas ganancias.Como se puede ser tan credulo de pensar que un numero de 10000 cryptos mas xxxxx cantidad de tokens todos tiene que estar siempre al alza y encima pensar que todos tienen  que valer \"mucho\". Es algo demencial sin pies ni cabeza.2- Con la mineria pasa algo muy similar, todos se suman por el mercado alcista y proque ETH termino explotando y la nombro porque fue con la que mas gente se puso a minar.Ahora que pasa ETH no se sabe si se va a poder seguir minando y encima se desplomo, que dicen los mineros? \"eeee pero hay otras cryptos siempre para minar\" que no niego que sea verdad pero.... y?. Como carajo yo se que esa shitcoin no se va a desplomar en dos meses?. como se si realmente vale la pena. Porque ahora pasa a ser que ademas de minar casi que automaticamente tenes que tradear. Nos metemos ya en tener que estar muy encima y todo el dia operando y eso a que nos lleva..... a la famosa frase.\"wall street gana dinero solo cuando tu operas y lo pierde cuando no lo haces\". Es como el casino cuanto mas jugas mas chacnes de perder tenes. (cambien WS por Binance o cualqueir exchange).Los ROI estan en la mierda pero que hacen los nenitos..... \"ya va a subir\", tremenda mierda de pensamiento, basado casi que en Fe. Porque obviamente que todos pensamos que X cosas se recuperara, pero una cuestion es decirlo con fundamentos y sob re pocas cosas y otra es tener un pensamiento reinante de ese estilo y encima basar en eso todos los modelos economicos.Se que suena tragico, pero hay que desterrar ese pensamiento si no quieren ver suicidios o gente deprimida que piensa hacerse rica de la noche a la mañana, porque en el fondo es el mismo pensamiento del apalancado.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dominguero",
      "created_time": "June 15, 2022, 10:53:38 AM",
      "body": "El Staking es un \"invento\" muy viejo (deposito que genera intereses) y que a pesar de la importancia que tiene a día de hoy, poco tiene que ver con el mercado cripto, más allá de los automatismos que se le han implementado.Y particularmente solo me llamaría la atención si no dependiera de un tercero, y por tanto conservaras tus propias claves y el control total del deposito e intereses generados. Lo que no se si ya existe.El tema de minar BTC es, a no ser que tengas ingentes recursos, una ruina, solo tiene sentido como algo \"puramente académico\" pues poca rentabilidad vas a poder sacarle de otra manera.Ahora, minar shitcoins, es otro tema, y no solo puede un pasatiempo de lo más entretenido a la par que \"educativo\" sino que puede llegar a ser muy rentable (especialmente por el bajo costo, ya que puedes usar tu ordenador personal, y limitar el consumo a menos de 100W).A mi particularmente me gustan las shitcoins de tercera regional por CPU o similares, Monero es demasiado top para mí, me decanto por shitcoins sin precio, o con precios de mierda, pero que tienen un desarrollo constante. Actualmente entre todas las shitcoins existentes, solo tengo 3 proyectos en los que a día de hoy no me importaría tirar a la basura un 1€/dia de electricidad aunque solo sea por mantenerme entretenido.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "seoincorporation",
      "created_time": "June 15, 2022, 04:54:35 PM",
      "body": "Quote from: danadc on June 10, 2022, 10:26:33 PMPara los más expertos, ¿Qué prefieren ustedes, Staking o Minar? ambas opciones me parecen interesantes y me atraen.El tema del staking es algo revuelto hoy en día, ya que las ganancias del stacking proviene de la bolsa de los proveedores del servicio y no de la naturaleza blockchain, es por esto que varios servicios nos ofrecen hacer stacking in diferentes cryptodivisas, y su staking se refiere a retener tus fondos para en un futuro generar ingresos.Ahora, hay otras monedas como Clamcoin o Peercoin que nos ofrecen staking como parte de su naturaleza blockchain usando el algoritmo PoS. y la ventaja de minar de este modo es que nosotros podemos disponer de nuestro dinero en el comento que queramos.Personalmente entre Minar y Staking prefiero stacking ya que no neceitamos de un equipo especial de minería, sino que podemos hacerlo con una computadora y el core de la moneda, mientras mas monedas tengas mayor será nuestro peso en la red y por ende obtendremos mas bloques.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}