{
  "id": "topic_5474815",
  "title": "Davidvictorson",
  "author": "Davidvictorson",
  "created_time": "November 20, 2023, 09:00:26 PM",
  "content": "I am making this topic because due to the news with Open AI firing its CEO, Sam and Microsoft somehow getting involved(apologies for not having all the details). A friend of mine took to social media with the post, \"Buy Microsoft Stock. This is financial advice.\" This prompted me to reflect on the times when any mention of Bitcoin would be accompanied by the disclaimer, \"This is not financial advice.\" Now, considering the current landscape, I'm seeking financial advice, specifically in the realm of cryptocurrencies.  Consider this and share your own crypto financial advice here -  it could be about bitcoin, altcoins, memecoins, NFTs, airdrops, Web3...you already catch my drift. Okay now, over to you. what financial advice would you offer?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5474815",
  "comments": [
    {
      "author": "Charles-Tim",
      "created_time": "November 21, 2023, 01:13:29 PM",
      "body": "It is not too late to buy bitcoin before the bull run that will likely take bitcoin price to $100000 or more would begin by next year. But if you have enough bitcoin already, then you are good to just wait for the time to come.I have not been posting on this topic, but I like it: Buy the DIP, and HODL!Investing 30% weekly is not bad at all. But some people are still expecting bitcoin to fall to around $30000 (which might be or not happen) before and after the bull run.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Frankolala",
      "created_time": "November 21, 2023, 02:14:20 PM",
      "body": "Bitcoin has shown that it is an investment that has outperform most investments even though she is still young. This is why I would advise anyone that wants a stress free investment because he has no time to monitor his investment or people with low income to invest in bitcoin because you can invest in bitcoin with little amount and hodli for long. No matter the size of your investment, you will still make profit, this is because bitcoin price increases with timeline. For instance, if bitcoin dips and the bottom line is $100 in this circle, by next circle, we might not see the bottom line as $100 but a price higher than that. This is also the same with ATH from past records, bitcoin ATH price is always higher than the previous circle. In this circle, the bottom line was 15k+, we may not see this price as the bottom line in nest circle, it might be a price higher than this.It is also good that you should think of increasing your investment after you must have bought through regular DCA so that you can buy weekly or monthly with 10% or more or below based on your monthly income so that you don't end up investing aggressively to the extend that you will be run at of cash and go sell part of your investment. Investment is something that is being allowed to grow in a long term so that the size of the invest will expand before you take profit. This doesn't apply to only bitcoin investment but to all other investment. This is why you must cancel short term investment goal from your mind.If you already have a huge amount on ground to invest with, it might be better that you share the money into three, and use one part for limp sum buying, use the second part to DCA regularly either weekly or month, and the last part should be on reserve to buy at the dip so that you don't miss out when the dip comes but rather take advantage of the dip by buying in discount price.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Obim34",
      "created_time": "November 21, 2023, 02:45:55 PM",
      "body": "Quote from: Charles-Tim on November 21, 2023, 01:13:29 PMIt is not too late to buy bitcoin before the bull run that will likely take bitcoin price to $100000 or more would begin by next year. But if you have enough bitcoin already, then you are good to just wait for the time to come.I have not been posting on this topic, but I like it: Buy the DIP, and HODL!Investing 30% weekly is not bad at all. But some people are still expecting bitcoin to fall to around $30000 (which might be or not happen) before and after the bull run.He made mention of getting Financial advice and you option Bitcoin alone out from what he listed omitting every of them is it totally wrong in investing in some Altcoins or NFTs just before the bull run cos I believe that an increase in price of Bitcoin will certainly bring an uptrend in the price of other currencies.I personally would not choose investing in any of which he listed over Bitcoin because there has been with time clearer evidence why Bitcoin overseas others but I think after giving him an advice of buying Bitcoin, what will be the next is it NFTs , airdrops, meme coins or altcoins. What could it be?It might be base on choice but I can see you have much experience than I do and I will love to know your mind on this, do we consider the rest of them not worth investing into or you don't just buy the idea of involving in any of them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Doan9269",
      "created_time": "November 21, 2023, 03:04:49 PM",
      "body": "Quote from: Davidvictorson on November 20, 2023, 09:00:26 PMOkay now, over to you. what financial advice would you offer?My own financial advise i will like to give is that, it is not too late to start from somewhere, we should also have that determination of going for the best at all cost no matter the risk as long as it's deserving for it, in cryptocurrency, bitcoin should be your number one choice and know that going for anything other than this is at your own risk, life do presents us with opportunities to make a lifetime success and not only if we recognized such moments and make use of them before the time elapsed, such may never come again, we should not despise the day of little beginning, because a million miles start with a step.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Frankolala",
      "created_time": "November 21, 2023, 03:08:28 PM",
      "body": "Quote from: Obim34 on November 21, 2023, 02:45:55 PMQuote from: Charles-Tim on November 21, 2023, 01:13:29 PMIt is not too late to buy bitcoin before the bull run that will likely take bitcoin price to $100000 or more would begin by next year. But if you have enough bitcoin already, then you are good to just wait for the time to come.I have not been posting on this topic, but I like it: Buy the DIP, and HODL!Investing 30% weekly is not bad at all. But some people are still expecting bitcoin to fall to around $30000 (which might be or not happen) before and after the bull run.He made mention of getting Financial advice and you option Bitcoin alone out from what he listed omitting every of them is it totally wrong in investing in some Altcoins or NFTs just before the bull run cos I believe that an increase in price of Bitcoin will certainly bring an uptrend in the price of other currencies.I personally would not choose investing in any of which he listed over Bitcoin because there has been with time clearer evidence why Bitcoin overseas others but I think after giving him an advice of buying Bitcoin, what will be the next is it NFTs , airdrops, meme coins or altcoins. What could it be?So why will you give someone a financial advice that you cannot implement, it means that it is a wrong advice. Why will you talk about altcoins when we are talking about investment. An investment should be on a long term goal that you will reap from in future and not instantly or in a short period. Altcoins don't have the capacity to survive that long in the market and it is good for traders and not hodlers. Altcoins are like gambling because of the high risk attached to it, you might wake up in the morning and the value has run down to zero. Invest wisely, so that you don't regret your actions after to have ended up in big loss. It is people that have achieved their butcoin target and are in their maintenance level that might choose to invest in altcoins if they wish because altcoins are garbage. A newbie should stay away from altcoin because it is a distraction towards your accumulation goal.Quote from: Obim34 on November 21, 2023, 02:45:55 PM What could it be?If it is not bitcoin, then invest in gold, stock, bond or real estate. Because the altcoins are very inferior.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Makus",
      "created_time": "November 21, 2023, 05:32:00 PM",
      "body": "Buy bitcoin before the halving event, you might even choose to use DCA to accumulate before the halving or use lump sum. Never you invest in any of those altcoins that do not have a good reputation without first having a good looking bitcoin portfolio. I will also advice to keep some of your savings in bitcoin rather than using fiat, except it will not take long before you exhaust the money, reason I say so, like in Nigeria our currency is dropping value on a daily bases now naira to dollar rate in the black market is N1139 so its not advisable to keep your savings in fiat due to inflation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cryptomultiplier",
      "created_time": "November 21, 2023, 09:09:19 PM",
      "body": "Quote from: Doan9269 on November 21, 2023, 03:04:49 PMQuote from: Davidvictorson on November 20, 2023, 09:00:26 PMOkay now, over to you. what financial advice would you offer?My own financial advise i will like to give is that, it is not too late to start from somewhere, we should also have that determination of going for the best at all cost no matter the risk as long as it's deserving for it, in cryptocurrency, bitcoin should be your number one choice and know that going for anything other than this is at your own risk, life do presents us with opportunities to make a lifetime success and not only if we recognized such moments and make use of them before the time elapsed, such may never come again, we should not despise the day of little beginning, because a million miles start with a step. I like the terms you used in stating you own advice and if I may add to your thoughts, I would advise that it may never be too late to start, but starting at the right time will ensure one doesn't loose fully incase there is any loss recorded. In this case I would use the forth coming halving and a newbie who intends to invest in BTC. BTC is good for long term HoDL strategy and the chances of one not making a loss is >1. So from now despite the current price of BTC, one can buy fractions and keep safe in a wallet that's offline. After the halving, there should be instance when the price of BTC will drop and that will be an added advantage to accumulate more BTC and trade if there is the interest.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Coyster",
      "created_time": "November 21, 2023, 09:56:41 PM",
      "body": "Quote from: Davidvictorson on November 20, 2023, 09:00:26 PMOkay now, over to you. what financial advice would you offer?Financial advice no be something wey i dey like give people, i fit share my idea with my friends and we fit discuss about potential investment opportunities, but i no go fit tell person wetin them go use their money buy. Financial advice dey cause wahala wella, i don see two friends dey quarrel because one introduced the other to a ponzi scheme and both of them lost all the money wey dem put into that scheme, na there quarrel come start between the two of them.That being said, me i dey buy and hodl Bitcoin, i believe say Bitcoin get better potential and e dey very sustainable for the long term, i no dey too look the side of altcoins for now because e dey like gambling to me, so if you like as i dey do, you fit DYOR and see if na something wey go favor you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mayor of ogba",
      "created_time": "November 21, 2023, 11:20:05 PM",
      "body": "QuoteOkay now, over to you. what financial advice would you offer?Even formal Binance CEO CZ will tell you crypto is not finance advice but as na the thing you used your mouth asked for. If you get money to use do an investment and you no go depend on that particular money wey you used to invest to survive your life, I go tell you to start to dey accumulate Bitcoin with the DCA strategy because Bitcoin halving no far again and after Bitcoin halving don take place, Bitcoin dey always set new ATH. If you start to accumulate your Bitcoin now, and hodl it till 2025 you go see how your Bitcoin will rise in value. No go invest for altcoin because you no follow for dev and something fit happens for the backend you no go know and you go lose all the money wey you used to invest for altcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jegileman",
      "created_time": "November 21, 2023, 11:23:11 PM",
      "body": "Quote from: Davidvictorson on November 20, 2023, 09:00:26 PMOkay now, over to you. what financial advice would you offer?Financial advise no be small tin o and for person to give you financial advise no mean say na d best way to follow na e be dat if you never go do d research yourself. All advise for here suppose be everybody own view of wetin dem dey think. Anytime wey you ready to invest in any of d advise wey dem give you make you do ur research well about am. As for us wey be bitcoin lovers, na only bitcoin we fit give you advise make you invest in, na d only coin wey we trust and d investment wey go make sense for person for this technology age be that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Roseline492",
      "created_time": "November 22, 2023, 03:31:12 PM",
      "body": "Quote from: Charles-Tim on November 21, 2023, 01:13:29 PMIt is not too late to buy bitcoin before the bull run that will likely take bitcoin price to $100000 or more would begin by next year. But if you have enough bitcoin already, then you are good to just wait for the time to come.I have not been posting on this topic, but I like it: Buy the DIP, and HODL!Investing 30% weekly is not bad at all. But some people are still expecting bitcoin to fall to around $30000 (which might be or not happen) before and after the bull run.You are right because so many persons are still having doubt about the bitcoin price, however giving them the mindset that bitcoin price will still dip more before they could invest, without knowing that they may likely miss out the opportunities of accumulating bitcoin while the price is still this way. Perhaps What most people fails to understand is that Considering the bitcoin all time high we are still in the dip so I don't know how the price is gonna be before most people will realize that this is the right time to invest on bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Promocodeudo",
      "created_time": "November 25, 2023, 03:19:37 PMLast edit: December 13, 2023, 08:06:57 AM by Promocodeudo",
      "body": "OP, in as much that we individuals have the final decision to make even though we have been advised, I will say that Bitcoin as a competent asset has shown high level of trust in terms of national and international transaction with the use of wallets in general be it custodian or exchange wallets.I will advice that it won't be a regrettable event if you give Bitcoin a benefit of doubt, since it has made itself available for everyone that's is interested to join the queue, as someone who is interested and wants to be part of the process, investing the little you can in other to see how the market works won't be a bad idea, but before you do this, you have to learn how to do the needful that's is concerned with bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}