{
  "id": "topic_5451358",
  "title": "Prestongold",
  "author": "Prestongold",
  "created_time": "May 05, 2023, 02:19:57 PM",
  "content": "At this level, I am well informed about Bitcoin and its securities, I have read on the forum how Bitcoin and cryptocurrency trading has changed people's lives, and I am kind of interested in acquiring skills, I have read in many other threads on how risky Bitcoin trading is.But at this point, I will really like to know whether or not Bitcoin trading is a means to gain profits during market speculations, and how possible it is to make passive income through cryptocurrency trading.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5451358",
  "comments": [
    {
      "author": "Dunamisx",
      "created_time": "May 05, 2023, 03:07:16 PM",
      "body": "Quote from: Prestongold on May 05, 2023, 02:19:57 PMI will really like to know whether or not Bitcoin trading is a means to gain profits during market speculations, and how possible it is to make passive income through cryptocurrency trading.Know this that there's no guarantee trading pattern for your profitability than in what you have learnt and discovered by yourself, we may give you some recommendations but they may be less effective if you don't also make a discovery of your own pattern as well in trading, i will first by advising that you start your trading with bitcoin only for a start, till you grow more thicker skin in going for other cryptocurrencies, read from this little tips from links provided.Tips before you start tradinghttps://bitcointalk.org/index.php?topic=5311311.0Best way/ timing for coin purchasehttps://bitcointalk.org/index.php?topic=5351564.0",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oshosondy",
      "created_time": "May 05, 2023, 03:47:25 PM",
      "body": "Quote from: Prestongold on May 05, 2023, 02:19:57 PMBut at this point, I will really like to know whether or not Bitcoin trading is a means to gain profits during market speculations, and how possible it is to make passive income through cryptocurrency trading.You can have a million dollars and lost it in some hours to trading. You have to be disciplined and do not let emotion control you. Learn the basics and do not use more than the amount of money that you can afford to lose to trade. Use lesser amount less to start.It is true that some people gain from trading but you have to learn and you will first lose and later you will become better to know if you have to continue to trade or not. Do not use high amount of money to trade, avoid that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tbct_mt2",
      "created_time": "May 05, 2023, 04:09:55 PM",
      "body": "Quote from: Prestongold on May 05, 2023, 02:19:57 PMI have read on the forum how Bitcoin and cryptocurrency trading has changed people's livesChanging people's lives in what way? Positive or negative, what did you get from your reading?Quoteand I am kind of interested in acquiring skills, I have read in many other threads on how risky Bitcoin trading is.If you see trading Bitcoin is risky, why do you want to involve in trading?QuoteBut at this point, I will really like to know whether or not Bitcoin trading is a means to gain profits during market speculations, and how possible it is to make passive income through cryptocurrency trading.Trading Bitcoin is a mean to gain profit as well as a mean to have loss.You win, another lose as in trading, it is a zero sum game. Same total capital but it flows in the market, from you to another, from your wallet to another wallet of someone else.And you won't have passive income by trading as you have to seriously trade with knowledge and time spent for it. It's not passive.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "worle1bm",
      "created_time": "May 05, 2023, 04:17:12 PM",
      "body": "There are no fixed pathways declared in trading to make guaranteed profits and what you will gain depends on your skills and experience that you will acquire during trading with time or even polish your strategies according to market conditions.If you are into learning phase then start with small amounts that you don't care about much even if you loose that amount which will help you to gain practical knowledge or try demo trading.If you say about btc trading then it's for holding that can give you good returns instead of day trading as beginner in this field.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitMaxz",
      "created_time": "May 05, 2023, 04:18:50 PM",
      "body": "There is no passive income in trading there is always a risk in trading with Bitcoin due to its price volatility. And without trading skills, you won't be able to make any profit.If you want to learn about trading there are lots of source to learn you can check this link below.- https://github.com/SpiralDevelopment/Awesome-Crypto-Trading DCA strategy is also works as suggested above but you must learn first how to find the resistant level so that you know when to buy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ojima-ojo",
      "created_time": "May 05, 2023, 04:42:05 PM",
      "body": "Ops I will advise you not to take the role of trading any coin even Bitcoin because trading is the fastest way to lose money next to gambling so I will most likely advise you to use the DCA mechanism to hold Bitcoin, that way you limit the risk of losing your investment.Truly trading is a big risk as you have rightly said but then instead of taking that route I think its best you continue to DCA and buy Bitcoin at an average price, while doing that you must know when to buy and keep accumulating Bitcoin on the long term while cutting in on average gains.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Anguwa",
      "created_time": "May 05, 2023, 04:57:47 PM",
      "body": "Quote from: Prestongold on May 05, 2023, 02:19:57 PMAt this level, I am well informed about Bitcoin and its securities, I have read on the forum how Bitcoin and cryptocurrency trading has changed people's lives, and I am kind of interested in acquiring skills, I have read in many other threads on how risky Bitcoin trading is.But at this point, I will really like to know whether or not Bitcoin trading is a means to gain profits during market speculations, and how possible it is to make passive income through cryptocurrency trading.The only possible way you will gain a massive profit in Bitcoin trading is when you have good knowledge about it.You cannot benefit from something you don't know well, if you want to have good profit in Bitcoin investment, you need to be patient and learn more about trading before you start.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tjtonmoy",
      "created_time": "May 05, 2023, 05:48:39 PM",
      "body": "Quote from: Prestongold on May 05, 2023, 02:19:57 PMBut at this point, I will really like to know whether or not Bitcoin trading is a means to gain profits during market speculations, and how possible it is to make passive income through cryptocurrency trading.If you want to start your journey with Bitcoin, then trading is not going to be the best option for you. Bitcoin trading includes many risks. If you are not a pro at trading, don't start with it in the first. Bitcoin is best if you can hold it for a long term. It will give you the best profit in the long run. Only experts in this field can make best profits from trading. And don't forget that they make losses too. So start with DCA and use a small amount in trading which you can afford to lose. Learn the process first, then use the big amounts when you think that you are ready.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cling18",
      "created_time": "May 05, 2023, 06:23:04 PM",
      "body": "Some people believe that we can earn our desired profit in trading in an instant, but the reality is that despite a large capital, we can't reach our target profit objective if we don't have the interest to learn all we need to succeed. Predictions are not always accurate. The actual problem of trading is dealing with market volatility and managing our emotions as a result of fluctuations. Discipline, which is required in trading, involves a lot of courage and determination. Don't rush things out and focus on gaining knowledge first.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Silberman",
      "created_time": "May 05, 2023, 09:04:50 PM",
      "body": "Quote from: Prestongold on May 05, 2023, 02:19:57 PMAt this level, I am well informed about Bitcoin and its securities, I have read on the forum how Bitcoin and cryptocurrency trading has changed people's lives, and I am kind of interested in acquiring skills, I have read in many other threads on how risky Bitcoin trading is.But at this point, I will really like to know whether or not Bitcoin trading is a means to gain profits during market speculations, and how possible it is to make passive income through cryptocurrency trading.Is it possible to make profits by trading bitcoin and other cryptocurrencies? Of course it is, is it easy to do so? Of course not, I will give you a 10% chance of succeeding, and that is if you actually go through the trouble of learning how to trade and study the market for months, but if you are like a lot of newbies out there and you just want to get profits and you want them now, then I will give you no chance at all of succeeding, this is because when it comes to trading knowledge is your best and at times your only weapon, and if you trade without that knowledge then that is as if you were fighting in a war completely disarmed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Obari",
      "created_time": "May 05, 2023, 10:22:40 PM",
      "body": "Quote from: Prestongold on May 05, 2023, 02:19:57 PMBut at this point, I will really like to know whether or not Bitcoin trading is a means to gain profits during market speculations, and how possible it is to make passive income through cryptocurrency trading.It is very possible to make profits off trading but you must also know that while it is very enticing to imagine the profits, you should also know  that nothing  is certain in trading, and just as you are expecting  to make some profits, so it is very much very possible  to make huge losses upto  having to blow account. I would advice that you rather invest more in learning than in wanting  to make profits suddenly  and I also want to let you know that bitcoin is a very lucrative  business but it all depends  on how you do it  and how much of knowledge  and information  that we have.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PX-Z",
      "created_time": "May 05, 2023, 10:50:52 PM",
      "body": "Quote from: Prestongold on May 05, 2023, 02:19:57 PMBut at this point, I will really like to know whether or not Bitcoin trading is a means to gain profits during market speculations, and how possible it is to make passive income through cryptocurrency trading.You can make profit in any kind of market trends, either its down or up trend, it depends on the trader.Also, i don't think there is so called passive income in trading, trading needs manual way to do things to make it possible. Possible if you can refer users to register on specific trading platform using your link.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Stalker22",
      "created_time": "May 05, 2023, 11:13:39 PM",
      "body": "Quote from: Prestongold on May 05, 2023, 02:19:57 PMAt this level, I am well informed about Bitcoin and its securities, I have read on the forum how Bitcoin and cryptocurrency trading has changed people's lives, and I am kind of interested in acquiring skills, I have read in many other threads on how risky Bitcoin trading is.But at this point, I will really like to know whether or not Bitcoin trading is a means to gain profits during market speculations, and how possible it is to make passive income through cryptocurrency trading.Oh absolutely, investing in cryptocurrencies is the surefire way to get rich quick without any effort at all. Just throw your money at the market and watch the profits roll in!  But seriously, I cannot understand people who ask questions like this. What do you expect? Step-by-step instructions on how to make millions trading? And what do you mean by passive income from trading? If the profit comes from active trading then it cannot be called passive income, right?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husires",
      "created_time": "May 06, 2023, 12:34:08 AM",
      "body": "You asked a big and basic question and you will find many answers, but Google and YouTube will teach you a lot if you search well.So reading books like Mastering Bitcoin, Rich Man and Poor Man, Richest Man in Babylon, Think and Get Rich or watching audio clips about them will give you basic knowledge.Then you can start learning the basics of technical analysis, including how to trade.All of this requires that you have a job and extra cash.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "adaseb",
      "created_time": "May 06, 2023, 04:23:08 AM",
      "body": "You can’t make any passive income when it comes to trading. Only way is perhaps buying a stock which pays a dividend but there is the issue of the stock itself going down in value and losing money.But with crypto trading there is no dividend. If you hold certain coins like ETH you can stake those and earn a little yield but once again, the value of ETH can go down and you might lose money. There is risk in everything.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DevilSlayer",
      "created_time": "May 06, 2023, 04:40:32 AM",
      "body": "Quote from: Stalker22 on May 05, 2023, 11:13:39 PMQuote from: Prestongold on May 05, 2023, 02:19:57 PMAt this level, I am well informed about Bitcoin and its securities, I have read on the forum how Bitcoin and cryptocurrency trading has changed people's lives, and I am kind of interested in acquiring skills, I have read in many other threads on how risky Bitcoin trading is.But at this point, I will really like to know whether or not Bitcoin trading is a means to gain profits during market speculations, and how possible it is to make passive income through cryptocurrency trading.Oh absolutely, investing in cryptocurrencies is the surefire way to get rich quick without any effort at all. Just throw your money at the market and watch the profits roll in!  But seriously, I cannot understand people who ask questions like this. What do you expect? Step-by-step instructions on how to make millions trading? And what do you mean by passive income from trading? If the profit comes from active trading then it cannot be called passive income, right?It is called \"portfolio income\" wherein, you gain profits through price appreciation meaning that if you will earn if a certain assets that you hold increase its market value. I do not agree that you will get sure rich if you put money on cryptocurrency, kindly look the majority of the investors and trader in this industry; most of them are LOSERS and they keep losing more money because they do not have enough knowledge and experience that they can use in order to make profit in this market. The problem is that those newbies are impatient to make money, that is why they putting their hard earned money on some shitcoins that can make them incur huge losses wherein they will regret and doubt theirselvles. If you want to make huge amount of money, forget buying cryptocurrencies or memecoins because what you need is to invest in your education first and forget the coins around you. For me there are steps on how can you become rich in trading, you cannot just put your money and hope that it can give you returns. A lot of successful traders and investors put a lot of effort and work for them to achieve what they have now. The misunderstanding is that people think they can easily make money by just putting their money and sitting like a dork without doing anything.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "slaman29",
      "created_time": "May 06, 2023, 08:09:07 AM",
      "body": "On the one hand you are \"well informed\" about Bitcoin, and yet on the other hand you're actually asking how to acquire skills?Theory = knowledge, that's what you seem to have. Skill = practice. The only way to gain skill is to do.But be careful, Bitcoin changed a lot of lives not actually because of trading.Trading changes lives for sure but not in the positive way you're thinking of...Oh and Lol OP you really did sound like a nob the way you posted but anyway",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Latviand",
      "created_time": "May 06, 2023, 09:12:07 AM",
      "body": "There's thing called paper trading, try to find one that you can access and you can easily practice trading there without the worry of losing real money but trading in a real market conditions, I think you should experience it first-hand since you are claiming that you're knowledgeable in crypto to some level.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Litzki1990",
      "created_time": "May 06, 2023, 09:52:51 AM",
      "body": "Quote from: Prestongold on May 05, 2023, 02:19:57 PMAt this level, I am well informed about Bitcoin and its securities, I have read on the forum how Bitcoin and cryptocurrency trading has changed people's lives, and I am kind of interested in acquiring skills, I have read in many other threads on how risky Bitcoin trading is.But at this point, I will really like to know whether or not Bitcoin trading is a means to gain profits during market speculations, and how possible it is to make passive income through cryptocurrency trading.First of all welcome to bitcoin trading site.  Since you expressed an interest in learning about Bitcoin trading and wanted to gain experience, you can. But to gain a good understanding of trading, you must be patient. You need to understand the market conditions. At first these things may be very challenging for you but if you can accept this challenge then I think you will get success from trading site.  You already know about the risk in other threads. To succeed on the crypto platform you have to take risks. If you can take this trick and gain enough knowledge and experience about trading then surely you can earn good income from trading.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}