{
  "id": "topic_5415506",
  "title": "kriptobaron",
  "author": "kriptobaron",
  "created_time": "September 30, 2022, 04:18:56 PM",
  "content": "Merhaba arkadaşlar yatırım amaçlı ilerde satarım düşüncesi ile bir domain buldum boşta.Uzantı .io ama kendimce domain çok güzel örnek vermek gerekirse nftsell.io nftbuy.io bunlar ayarında sayılabilecek bir domain..com boş olsa düşünmeden alacaktım ama .io yıllık domain kaydetme 1000 liraya çıkmış.Bu tarz domainler para eder mi sizde tecrübesi olan var mı alsak nerelerde nasıl sergileyip satışa çıkarabiliriz.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5415506",
  "comments": [
    {
      "author": "LGD2Business",
      "created_time": "September 30, 2022, 05:14:31 PM",
      "body": "1000 lira neymiş ya 10 dolardı domainler bu .io domainin farklı bir olayı mı var? Gerçi 10 dolar bile 200 lira olmuş 50 dolar falan herhalde .io uzantıları.Çok iyi bir isimse şansınızı deneyebilirsiniz ama ben çok karlı olacağını sanmıyorum. Hem kur yüksek hem domain fiyatı yüksek bir de satmak için uğraşacaksınız belki yıllarca kayıtlı tutmanız gerekecek. NFT ilk dalgasını yaptı herkes ne olduğunu öğrendi şimdi yeni bir dalga yeni bir hype lazım.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gospodin",
      "created_time": "October 01, 2022, 08:32:08 AM",
      "body": ".io uzantılı domainlerin fiyatları ico furyası ile uçtu gitti; özellikle 2017-2018 yılından sonra  peyyy. yeni bir durum değil yani bu.valla hocam domain nft.io ise al ama onun dışında nftcartcurt.io şeklinde ise iyi düşün derim.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jossque",
      "created_time": "October 01, 2022, 10:07:44 AM",
      "body": "Alınabilir ama yaratıcı olmak gerektiğini düşünüyorum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Retro Harmony",
      "created_time": "October 01, 2022, 04:31:25 PM",
      "body": "Yıllık 1000 lira kaydettirme parasını ödeyecekseniz, bunun karşılığı olarak size gerçekten faydalı olabilecek, kazandırabilecek bir domain adı gerekiyor. 1000 lira sizin için önemli bir para değilse de alıp kenarda bekletmek istiyorsanız bekletin. Ne kadar ilgi çeker bilmiyorum da ben bu zamanlarda domain zamanı olmadığını düşünüyorum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ondekinecakabilirim",
      "created_time": "October 12, 2022, 10:38:02 AM",
      "body": "Alan adının bi önemi kalmadı artık. Alakasız bir isim bile olsa iş yapan proje iş yapar. Com, net uzantıları bile o kadar önemli değil günümüzde. Google da indexlerken seçici davranmıyor diye biliyorum. Konunun uzmanı değilim tabiki. Ama önemli olan domain değil bence. Önemli olan sizin projeniz. Projenize güveniyorsanız hiç düşünmeden alın derim. Her uzantı işinizi görür. Ama İo. uzantılar kriptoparalarda kullanıldığı için NFT projesi yapacaksanız io. kullanmanız hoş olur biraz gerçi.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}