{
  "id": "topic_5422049",
  "title": "Hydrogen",
  "author": "Hydrogen",
  "created_time": "November 17, 2022, 11:51:20 PM",
  "content": "QuoteEven as companies around the world continue to struggle with the impacts of the pandemic and the war in Ukraine on global supply chains, there is another challenge looming: new environmental regulations that promise to change how shipping companies operate many transoceanic and regional routes.New rules from the International Maritime Organization (IMO), the United Nations agency responsible for regulating global shipping, will have significant implications for how container lines design their services and will have consequences for production location choices that underpin global supply chains. Plus, European Union regulations that are likely to be passed before the end of 2022 and whose initial phase would begin in 2023 promise to add additional costs and complexity. Managers in supply chain and sourcing need to start planning for these changes.A Major Generator of Greenhouse GasesMaritime transport is the backbone of international trade. It is the most cost-effective way to move large volumes of goods such as oil, mineral ores, grains, and containerized cargo over long distances. But it has also attracted attention for its environmental impact: It accounts for 3% of global greenhouse gas (GHG) emissions.The problem is that most ship engines burn heavy marine fuel oil, which produces not only carbon dioxide (CO2) but other pollutants as well. In a study published in 2015, the IMO projected that CO2 emissions associated with the sector could increase as much as 250% between 2014 and 2050 if abatement steps were not taken. Moreover, emissions are difficult to eliminate because of the need to consume large amounts of energy over long distances without the opportunities to refuel. Maritime assets have very long lifetimes — typically 25 years — so getting to net zero by 2050 will require substantial investments in near-zero fuels and propulsion technologies deployed as soon as 2030.The IMO RulesBeginning in January, the new IMO rules will require individual ships to measure and report a carbon intensity index in the form of an annual efficiency ratio (AER). The AER is a function of a ship’s deadweight tonnage (DWT) — how much weight it can carry in cargo, fuel, crew, fresh water, passengers, supplies, etc. — plus how much and what type of fuel it consumed and how far it traveled in the previous year. This data has been part of an IMO mandatory annual submission since 2019 for ships over 5,000 DWT.The AER is used to grade the ship A, B, C, D, or E. Vessels that receive a grade of A, B, or C will be deemed compliant that year. Vessels graded D have a three-year grace period during which the owner will have to somehow get back into compliance, and those graded E will have one year to do so. Importantly, the grading criteria will become tougher every year: The IMO is mandating a 2% annual improvement in AER from 2023 through 2030. Thus, a ship may start with a B grade in 2023, but if no changes are made after as few as six years, it could automatically become a D. If the owner cannot comply, the vessel will have to be removed from service and likely scrapped.The impact on container shipping, the backbone of the global merchandise trade, will be substantial. A significant number of ships will not be compliant. Most of these are older, smaller ships with less than 8,000 TEU capacity (TEU stands for 20-foot equivalent unit and is a standard container size), but the implications are serious.Options for Achieving a Better GradeShipping companies have three options to improve a ship’s grade:Switch to fuels that generate less CO2.The fuel choice is challenging because not many fuels have the necessary energy density. Maersk, the second-largest container line by capacity, is focusing on biomethanol and has ordered 12 16,000 TEU methanol-powered ships. It has also signed agreements with several companies to produce methanol from renewable energy. CMA CGM, the third-largest container line, has made a big bet on liquified natural gas (LNG) as an interim transition fuel and plans ultimately go to some form of hydrogen. It has already put 12 LNG-powered vessels into service and will have 44 operating by 2024. Mitsui OSK Lines plans to launch 90 LNG-powered ships by 2030, and Ocean Network Express (ONE) recently ordered 10 13,700 TEU ships that could run on either ammonia or methanol. All these companies will be looking to bio-based marine fuel oil as well.For all these strategies, a key dependency is how fast suppliers can scale up production of the massive quantities of fuel that will be needed. Originally, it was thought that LNG would have a significant advantage over the near term because it is already available in many geographies, and it is easier to handle than methanol and ammonia. But the skyrocketing prices of LNG and questions about Russian supplies due to the Ukraine war could significantly alter that equation. New LNG-powered ships will be comfortably below IMO targets for the first decade of their lifetime, but beyond that other measures will likely have to be taken such as blending with bio-based LNG or transitioning to some form of hydrogen fuel.Change how a ship is operated.This option is the least expensive way to keep many existing ships in compliance. Because the carbon-intensity measure is tied to how much weight is moved per unit of distance, larger vessels sailing long routes with fewer port calls will earn higher grades than smaller ships making lots of port calls. Newer and larger ships, even if not completely full, will score better than smaller ones.Ships can slow-steam to reduce fuel consumption and hence emissions, but this also reduces the annual cargo hauling capacity of what are expensive assets and crews. Ship operators have been reducing speeds for the last decade, but the 2% annual improvement mandate means this technique will eventually reach its practical limits and older ships will have to be replaced sooner rather than later. Ports and trade lanes that cannot support high volumes may see less frequent service or the elimination of service altogether as it becomes progressively harder to serve them and remain compliant.Make technical refinements.These include upgrading engines and emission controls. It might include actions such as retrofitting the engine so that the ship can use alternative fuels, making changes to optimize the flow of water around the hull, or polishing or upgrading propellers.These changes will also be expensive. Jeremy Nixon, the CEO of Ocean Network Express, a global container shipping company, estimated at a conference in January that the global container shipping industry will have to invest $1.5 trillion over the next 20 to 30 years to meet IMO targets. Even though the industry booked record profits last year, the investments it faces are enormous.The EU’s Emissions Trading SchemeAdding to costs, the European Union (EU) is planning to bring shipping into its Emissions Trading Scheme (ETS) in 2023. Shipping lines will have to purchase allowances for 50% of emissions for voyages connecting EU and non-EU ports. Maersk has already announced surcharges for its Asia to North Europe and North Europe to U.S. trade lanes, and others will have to follow. While a looming recession is already driving shipping costs lower, they will likely not return to their pre-pandemic levels over the longer term as the added costs ultimately have to be paid for.The ETS is central to the EU’s climate policy and covers 40% of emissions of firms in energy-intensive sectors. It seeks to reduce GHG emissions by 61% by 2030 compared to 2005 levels. The EU’s proposed Carbon Border Adjustment Mechanism (CBAM), slated to become fully operational in 2026, will put a tax on imported products in designated sectors where production-related emissions have not been taxed at the same level by the exporter’s country. This is designed to prevent the circumvention of the EU’s GHG-reduction efforts by imports from countries with less ambitious climate policies. It will also be a critical part of phasing out of free allowances for EU producers.While imports into Europe of products covered by the CBAM will likely decrease, exports will be impacted as well. EU-made goods that use EU ETS products as inputs will become more expensive, whether they are imported or produced in Europe. As other countries implement carbon pricing, they will need to set up similar mechanisms.The Implications for CompaniesFor managers planning their supply chains, there are several important things to pay attention to:The cost of decarbonization in ocean shipping is going to change the calculus of where goods are sourced. Although spot market rates have declined recently, it is probably unrealistic to think that costs will return to their pre-pandemic level. While carriers plan to add a substantial amount of new capacity in the next few years, it’s tricky to forecast shipping rates because the retirement of old capacity that will have trouble meeting IMO rules will likely balance out the additions. Much will depend on whether U.S. import demand drops and carriers choose to idle ships. Other segments like bulk carriers and vessels for transporting motor vehicles may face significant challenges because there isn’t as strong an order book for new more efficient ships to replace older ones that will need to be taken out of service. High-volume trade lanes where container lines can deploy newer, larger, and more efficient assets will fare better, but all in all it may make less sense to produce many goods far away from where they are consumed even if the production costs are lower.Lower-volume trade lanes will likely see less-frequent and higher-cost services. This was foreshadowed during the height of the supply chain crisis in 2021, when Japan lost some direct eastbound services to North America as container lines tried to juggle capacity shortages and delays by dropping port calls from their schedule rotations. (It was a more efficient way to operate the vessels.) The IMO rules will favor efficiency: larger ships, fewer port calls, and less-frequent service with maximum capacity utilization per ship.Companies that export to Europe or have European suppliers should plan for the higher costs that CBAM, ETS, and similar actions by other countries will produce. Managers should anticipate that other countries outside the EU will take similar actions. For example, U.S. managers should pay attention to Canada, which has set a large increase in carbon pricing for 2030. There may be pressure for similar border adjustment measures in heavy-GHG-emitting industries such as steel.Policies and regulations to help mitigate climate change promise to have a major impact on how supply chains are designed. Increased costs as well as the practicalities of shipping logistics are on a course for change. They will alter the way supply chains are designed and how shipping will work. Now is the time to start planning for this new era.https://hbr.org/2022/10/climate-regulations-are-about-to-disrupt-global-shipping....3 letter organization I have never heard of before: the IMO - International Maritime Organization. Are they associated with the IMF (international monetary fund) and similar organizations? It seems that their jurisdiction mainly covers european regions. Being an american who pays not much attention to current events in europe. I can only guess at whether proposals for regulation as in the above are popular or even supported by europeans. Judging by posts on this forum, it seems that many europeans hold negative views of renewable energy. The transition to solar and wind was too abrupt. There was not enough forethought or future planning on the part of EU leaders to allow for a seamless and stable transition to alternate forms of energy.The organization behind these newly introduced regulation having 3 letters and bearing a resemblance to the IMF while invoking Klaus Schwab connotations may not help with their public image. But despite my expectations of there being few who would support measures which would likely raise prices and cause shortages of essential necessities in supply chains. I would guess there will still be a large number of people who will support these measures. Whether because they love the environment and consider it an extremely high priority. Or due to other reasons. That has been the trend I have observed so far.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5422049",
  "comments": [
    {
      "author": "dansus021",
      "created_time": "November 18, 2022, 02:09:41 AM",
      "body": "Climate Change is real that is why many countries try to set their goal of net zero emmision. But Shipping of course play a big role and cannot be disrupt in a second. I heard also the news that many shipping company to start adapting by using lower carbon emission vehicle including truck, car and even a ship",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "care2yak",
      "created_time": "November 18, 2022, 04:08:05 AM",
      "body": "If elites were really serious about this, private jets would never leave their hangars",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zlantann",
      "created_time": "November 18, 2022, 04:16:28 AM",
      "body": "Quote from: Hydrogen on November 17, 2022, 11:51:20 PMBut despite my expectations of there being few who would support measures which would likely raise prices and cause shortages of essential necessities in supply chains. I would guess there will still be a large number of people who will support these measures. Whether because they love the environment and consider it an extremely high priority. Or due to other reasons. That has been the trend I have observed so far.These climate regulation is untimely and would have a negative impact on both the maritime sector and the global economy in general. Switching to environmental friendly ships would cost a whole lot of money and I don't think most shipping companies have such money to spend. Does the International Maritime Organization (IMO) have any provision to support these companies financially as they switch to green energy? The most challenging part of it is that this regulations would definitely cause an increase in shipping cost which would be transferred to consumers. Citizens of most countries are already battling inflation and high cost of goods and services and adding more burden with this policy would not be a good decision. International Maritime Organization (IMO) and European Union should suspend the implementation of these policies until the world economy recover from this downturn.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "November 18, 2022, 10:47:26 AM",
      "body": "The issue of climate and environmental changes is important, but unless the whole world unites on decisions and they are strictly implemented, we will not succeed in reducing the environmental impact. What compels all world governments to comply with environmental rules or reduce pollution levels, and what is done with countries that have not signed any charter that guarantees that they Will it reduce the cost of emissions?All these factors make me believe that countries that reduce carbon emissions will add additional burdens to their costs.In short, unless an alternative fuel economy solution is found, current efforts will not succeed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gantez",
      "created_time": "November 18, 2022, 11:38:06 AM",
      "body": "Quote from: hugeblack on November 18, 2022, 10:47:26 AMIn short, unless an alternative fuel economy solution is found, current efforts will not succeed.If the manufacturing of electric cars will get serious attention it can help as solution to huge carbon emissions from trucks and cars. All companies that are having to manufacture things are this guilty because they have trucks to use in taking raw materials to site and carry finished products, they all can be changed into electric cars and that reduction of gas hitting the ozone will sure go long way to stable climate change.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kryptqnick",
      "created_time": "November 18, 2022, 01:59:07 PM",
      "body": "To be honest, transportation is a significant part of the environmental impact and shipping goods is a part of that. And some supply chains just don't make sense. I've seen multiple times when ordering an international delivery how something travels in mysterious ways into several countries, very far from the straightforward road to mine. It also happens on a smaller scale when you order something within one country and can see how it also sometimes gets sent to places that are further than your location before basically going back. I realize that they're trying to account for the majority of deliveries and it leads to such things, but optimising the routes to ensure smaller travel distances even at the expense of longer delivery time would be worth it. Options like switching fuels and upgrading engines can also be of great help.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaveF",
      "created_time": "November 18, 2022, 10:02:06 PM",
      "body": "The other take on this is that the larger multinational shipping companies tend to have the newer more efficient ships . The smaller ones tend to be using older ones that the bigger companies sold off so they could sail the newer ones. So now the smaller companies can't sail, but the larger ones having the newer more efficient ships can take on the older more polluting ones since on average at that point their fleet meets the required goals.Same way you can sell some big gas guzzling monster cars but so long as you have a bunch of econo boxes also your 'manufacturer fleet average' is good.Just my view....-Dave",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dothebeats",
      "created_time": "November 18, 2022, 10:29:27 PM",
      "body": "Just imagine how many private jets are burning so much fuel just to be of service to a select few. Meanwhile the rest of the world are scrambling to make ends meet everyday and deprive themselves of transportation that is comfortable enough for their standards. Perhaps look at those rich asshats first then talk about other industries next. Logistics and global shipping is improving their freighters, cargo airplanes, and ships just to accommodate with the growing demand, and perhaps it's time for the jet-riding, out of touch individuals to go economy or first class with their travels.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gyfts",
      "created_time": "November 19, 2022, 09:21:04 AM",
      "body": "Quote from: Zlantann on November 18, 2022, 04:16:28 AMQuote from: Hydrogen on November 17, 2022, 11:51:20 PMBut despite my expectations of there being few who would support measures which would likely raise prices and cause shortages of essential necessities in supply chains. I would guess there will still be a large number of people who will support these measures. Whether because they love the environment and consider it an extremely high priority. Or due to other reasons. That has been the trend I have observed so far.These climate regulation is untimely and would have a negative impact on both the maritime sector and the global economy in general. Switching to environmental friendly ships would cost a whole lot of money and I don't think most shipping companies have such money to spend. Does the International Maritime Organization (IMO) have any provision to support these companies financially as they switch to green energy? The most challenging part of it is that this regulations would definitely cause an increase in shipping cost which would be transferred to consumers.Of course not. These folks don't understand that elevated prices always get passed to the consumers. Corporations are not inclined to eat the cost of climate change activism. In order to stay competitive, they will be forced to raise prices. I myself haven't ever heard of IMO but seems like another organization that's keen on social activism via climate change. Social activism doesn't cost them anything so it's easy to be sanctimonious, merely places a burden on other people.Quote from: Zlantann on November 18, 2022, 04:16:28 AMCitizens of most countries are already battling inflation and high cost of goods and services and adding more burden with this policy would not be a good decision. International Maritime Organization (IMO) and European Union should suspend the implementation of these policies until the world economy recover from this downturn.Precisely. Post COVID supply chains still are under duress with demand issues and they choose now to implement these regulations. Incredible.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gayong88",
      "created_time": "November 19, 2022, 12:37:35 PM",
      "body": "Yes, a global transition to renewable energy is a moral imperative, and it is high time we start meeting the standards necessary to avoid crippling climate change. Emission caps can be increased substantially and still avert disaster but to achieve this, governments have a role to play and must take bold action. The time has come to consider more daring options.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "2stout",
      "created_time": "November 20, 2022, 08:34:21 PM",
      "body": "No, I don't see this happening in light of the current circumstances.  Basically, we are in a recession, and climate regulation to disrupt global shipping won't happen as to not hasten a depression.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TimeTeller",
      "created_time": "November 20, 2022, 08:44:43 PM",
      "body": "Quote from: Gayong88 on November 19, 2022, 12:37:35 PMYes, a global transition to renewable energy is a moral imperative, and it is high time we start meeting the standards necessary to avoid crippling climate change. Emission caps can be increased substantially and still avert disaster but to achieve this, governments have a role to play and must take bold action. The time has come to consider more daring options.The government should start the initiatives to alter their plans when it comes to using nonrenewable and renewable energies.Global shipping is just one of the industries that do need to change some of their ways to address this climate change.On this subject, we will expect that some goods will rise their prices. As that's one of the aftermath of the changes in the shipping industry.Those rich people will always get their ways on using their private jets, so hard to call for them to change their lifestyle.We need to accept the fact that climate change is real and it would devastate the human population if we don't act now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ultegra134",
      "created_time": "November 20, 2022, 08:59:21 PM",
      "body": "I'm from Europe, Greece to be exact, and have never heard of the IMO. I'll drop my two cents about energy sources, though. Climate regulations are what sparked the energy crisis, starting in August/September, by closing a large amount of coal plants in Europe in order to turn to renewable energy resources. I'm not against renewable energy, but there are numerous scandals in Greece about placing wind turbines on burned forests. It sounds like a conspiracy theory, but it has been proven that huge corporations were interested in and had deposited proposals for creating wind farms in forests that would be burned in the near future.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Argoo",
      "created_time": "November 22, 2022, 07:21:40 AM",
      "body": "Quote from: Zlantann on November 18, 2022, 04:16:28 AMThese climate regulation is untimely and would have a negative impact on both the maritime sector and the global economy in general. Switching to environmental friendly ships would cost a whole lot of money and I don't think most shipping companies have such money to spend. Does the International Maritime Organization (IMO) have any provision to support these companies financially as they switch to green energy? The most challenging part of it is that this regulations would definitely cause an increase in shipping cost which would be transferred to consumers. Citizens of most countries are already battling inflation and high cost of goods and services and adding more burden with this policy would not be a good decision. International Maritime Organization (IMO) and European Union should suspend the implementation of these policies until the world economy recover from this downturn.    First, this is not about regulating the climate on our planet. Rather, on the contrary: the question of reducing the influence of man on climatic conditions is raised. Mankind simply does not need to poison nature and everything will be fine.Secondly, if we say that the struggle for the restoration of the natural environment is untimely and the transition to alternative energy sources will be very expensive, then humanity will never solve this pressing problem until it kills itself. We see how quickly the climate on our planet is changing. This problem should have been solved for a long time. We are already way too late with this transition. Therefore, it is necessary to get rid of coal, oil and gas as direct energy sources as quickly as possible.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DrBeer",
      "created_time": "November 22, 2022, 10:17:55 PM",
      "body": "In a sense, you can say \"thank you\" to Russia, which unleashed, almost a third world war, and a war of economic terror, through hydrocarbon energy sources such as oil and gas.Until this year, the development of alternative energy sources was, to put it mildly, not very active, in relation to industrial solutions, such as sea / ocean transportation. Now the whole world has understood that oil and gas can and have become weapons of mass economic terror. I am sure that soon enough, we will observe the migration of super-heavy sea ships (dry cargo ships, container ships, etc.) to alternative technologies. Yes, it will take not 1 day, but years. But the world does not want to again become a hostage of the distraught \"gas station\". And it is logical to assume that it will drastically reduce emissions and other negative consequences of using internal combustion engines.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "November 23, 2022, 11:55:57 AM",
      "body": "I have had a question for some time, which is the difficulty of having a global shipping fleet powered by nuclear energy? I believe that defining unified international paths and designing ships to be environmentally friendly is much easier than trying to restrict the global oil and gas situation.The bad news is that when all these technical problems are resolved, the user is the one who will pay all the extra expenses, and there may be a delay in delivery time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zasad@",
      "created_time": "November 23, 2022, 02:45:35 PM",
      "body": "Why is Europe fighting global warming, while in Russia, China, India, Kazakhstan and other countries a lot of electricity is generated by burning coal and other resources?They want to kill their economy with increased logistics costs.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ozero",
      "created_time": "February 02, 2023, 03:11:17 PM",
      "body": "Quote from: gantez on November 18, 2022, 11:38:06 AMQuote from: hugeblack on November 18, 2022, 10:47:26 AMIn short, unless an alternative fuel economy solution is found, current efforts will not succeed.If the manufacturing of electric cars will get serious attention it can help as solution to huge carbon emissions from trucks and cars. All companies that are having to manufacture things are this guilty because they have trucks to use in taking raw materials to site and carry finished products, they all can be changed into electric cars and that reduction of gas hitting the ozone will sure go long way to stable climate change.Most likely, the new strict rules on shipping are only the beginning of a general strict regulation to prevent the negative consequences associated with abrupt climate change over the past decades. They have not yet taken up the cars, however, they will get to them in time. Therefore, citizens now need to switch to electric cars. Indeed, there are much more harmful emissions from cars due to their huge amount compared to river and sea vessels.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Argoo",
      "created_time": "February 13, 2023, 05:26:01 PM",
      "body": "Quote from: hugeblack on November 23, 2022, 11:55:57 AMI have had a question for some time, which is the difficulty of having a global shipping fleet powered by nuclear energy? I believe that defining unified international paths and designing ships to be environmentally friendly is much easier than trying to restrict the global oil and gas situation.The bad news is that when all these technical problems are resolved, the user is the one who will pay all the extra expenses, and there may be a delay in delivery time.The problem with the use of nuclear energy has always been the safety of its use. Therefore, nuclear editors cannot be built in seismologically active areas of the area, in densely populated areas where accidents, fires, floods and other disasters often occur. If nuclear editors are placed on sea vessels, they will turn into floating atomic bombs. Humanity in general needs to think first of all about the consequences of applying technological progress, and then about profit, otherwise the current seventh or already the eighth civilization of people on this planet will not last long.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}