{
  "id": "topic_5462279",
  "title": "yoshimitsu777",
  "author": "yoshimitsu777",
  "created_time": "August 06, 2023, 07:14:13 PM",
  "content": "i am sending hash rate to 2miners solo pool using my wallet address x.2miners dashboard showing my worker with hash rate flowing and valid shareswhen I open dashboard on woolypooly for the same wallet address x,i see also the worker online and hash rate flowing. About same hash rate as shown on 2minersThen I test vice-versa. I send hash rate to woolypooly using wallet address y.woolypooly dashboard showing my worker with hash rate flowing and valid sharesnow i open 2miners dashboard for wallet address y and againit shows me hash rate flowing with valid shares.Although i did not send hash rate to 2miners using wallet address yi am not sure if this is related to reddit thread WoolyPooly Stealing Solo Blocks From Miners?obviously 2miners and woolypooly are linked somehow together - anyone can clarify and explain? currently i stopped mining on those pools because i am loosing trust",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5462279",
  "comments": [
    {
      "author": "BitMaxz",
      "created_time": "August 07, 2023, 12:20:28 AM",
      "body": "No one will answer this here because you are in the Bitcoin mining section and the pool you mention above only supports altcoin mining.About your problem, it seems that you are talking about the total hash rate of the pool, not the hash rate of your miner because if you click the dashboard you will see the pool total hashrate with a chart.Or maybe it is just a browser bug it would be better use incognito mode or other browsers to check the address y.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sxemini",
      "created_time": "August 08, 2023, 10:59:19 AMLast edit: August 08, 2023, 11:25:14 AM by sxemini",
      "body": "Quote from: yoshimitsu777 on August 06, 2023, 07:14:13 PMi am sending hash rate to 2miners solo pool using my wallet address x.2miners dashboard showing my worker with hash rate flowing and valid shareswhen I open dashboard on woolypooly for the same wallet address x,i see also the worker online and hash rate flowing. About same hash rate as shown on 2minersThen I test vice-versa. I send hash rate to woolypooly using wallet address y.woolypooly dashboard showing my worker with hash rate flowing and valid sharesnow i open 2miners dashboard for wallet address y and againit shows me hash rate flowing with valid shares.Although i did not send hash rate to 2miners using wallet address yi am not sure if this is related to reddit thread WoolyPooly Stealing Solo Blocks From Miners?obviously 2miners and woolypooly are linked somehow together - anyone can clarify and explain? currently i stopped mining on those pools because i am loosing trustBullshit!!! How long you waited between the pool switches? Minutes, hours, Days? Wait a day. And i use sometimes both pools, and no i can´t confirm this. But the trust in 2miners is very low, bad admins, bad experience more than one time and so on.And did you really read this stupid reddit thread? over 2 years old. I mean there are writing some dudes with no knowledge as anyone can see and talk about shit they don´t understand and nothing more. FUD is so easy, because people are so stupid. Or you have some screenshots for the proof? I don´t think so.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JayDDee",
      "created_time": "August 08, 2023, 01:36:55 PM",
      "body": "Typical loaded question like \"have you stopped beating your wife?\" A certain politician famously uses the technique to make accusations whileclaiming he was only asking a question.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FP91G",
      "created_time": "August 09, 2023, 12:51:55 PM",
      "body": "Quote from: yoshimitsu777 on August 06, 2023, 07:14:13 PMi am sending hash rate to 2miners solo pool using my wallet address x.2miners dashboard showing my worker with hash rate flowing and valid shareswhen I open dashboard on woolypooly for the same wallet address x,i see also the worker online and hash rate flowing. About same hash rate as shown on 2minersThen I test vice-versa. I send hash rate to woolypooly using wallet address y.woolypooly dashboard showing my worker with hash rate flowing and valid sharesnow i open 2miners dashboard for wallet address y and againit shows me hash rate flowing with valid shares.Although i did not send hash rate to 2miners using wallet address yi am not sure if this is related to reddit thread WoolyPooly Stealing Solo Blocks From Miners?obviously 2miners and woolypooly are linked somehow together - anyone can clarify and explain? currently i stopped mining on those pools because i am loosing trustFirstly, it would be very strange if the hashrate were different, but its value becomes equal to the hashrate of your miner only after a while.It is possible to check which pool is more profitable only with the help of simultaneous mining on the same mining farms, and it is advisable to do the experiment not for several hours, but for at least several days, and then see the number of caught shares and mined coins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}