{
  "id": "topic_5417325",
  "title": "david678345",
  "author": "david678345",
  "created_time": "October 16, 2022, 06:14:40 PM",
  "content": "Im looking for platforms that allow profit share (basically these platforms allow users to avoid paying commissions for trades.The user only pays commision when the trade is closed with a profit. If the trade losses money, the user doesn't have to pay any feesFor now I just found a platform that offers this option (stormgain) but Im not sure if this exchange has enough liquidity to be able to do trading without problemsDoes anyone checking the order book or with another way could tell me if could be a good option? obviously wont have the same liquidit as bybit etc but wanted to know if has enough liquidity to make my trading profitable (probably their btc usdt has enough liquidity to be able to trade, right?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5417325",
  "comments": [
    {
      "author": "Oshosondy",
      "created_time": "October 16, 2022, 06:37:59 PM",
      "body": "If you are good in trading, you do not have to think about the fee. Just make calculation of the trading fee from the total trading fund and use it to set a target of the profit you want from each trade you make.I will advice you not to look for what scammers can use to scam you, although I checked that exchange (stormgain) and it is a good exchange, it would have high liquidity because it has trading volume of approximately $283 million in 24 hours. But you have to be careful of the coin you want to trade, because an exchange can have a good trading volume overall, but not having good trading volume for some altcoins.To know more if an exchange has high liquidity of a particular coin, check the coin market on Coingecko or Coinmarketcap to know the confidence level of the coin liquidity on the exchange if your choice. This would help you to know if it has high liquidity or not.As for me I use exchanges with much more high trading volume like Binance and OKX which are the top exchanges in the world, I do not care about the fee deducted for trading, and not even that much, but they are in percentage. Whichs means the more the trading fund or higher leverage, the more the money that would be dedicated for trading fee.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Potato Chips",
      "created_time": "October 16, 2022, 11:35:18 PM",
      "body": "But they will charge 10% for the profitable trades (https://stormgain.com/profit-share)? lol not worth it.Honestly, I've only heard about them from their shady \"cloud mining\" business which is more than enough to make me stay away, see: https://bitcointalk.org/index.php?topic=5392696.0. Be careful with lesser known exchanges/services, they're more likely to end up problematic.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "noorman0",
      "created_time": "October 17, 2022, 01:40:57 PM",
      "body": "Quote from: Potato Chips on October 16, 2022, 11:35:18 PMBut they will charge 10% for the profitable trades (https://stormgain.com/profit-share)? lol not worth it.As I suspected, it will only suffocate the user in the end. 10% I think is enough to cover 100 times normal trading fees.@OP, even if stormgain has sufficient liquidity, would you really use it? You should consider your trading frequency first. Normal trading has a small fee (0.5% and less). Some platforms even offer lower fees when using their utility coin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NeuroticFish",
      "created_time": "October 17, 2022, 01:47:21 PM",
      "body": "Quote from: david678345 on October 16, 2022, 06:14:40 PMbasically these platforms allow users to avoid paying commissions for trades.At least for a short while there is at least one exchange with no trading fees at all for certain trading pairs (BTC vs fiat and BTC vs stablecoins).I don't know how long it will last, but maybe it can be an option for now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tabas",
      "created_time": "October 18, 2022, 10:34:30 AM",
      "body": "Quote from: Potato Chips on October 16, 2022, 11:35:18 PMBut they will charge 10% for the profitable trades (https://stormgain.com/profit-share)? lol not worth it.I'm surprised to see that someone wants a zero commission for each of his trades then wants a 10% taken for his profitable trades. It doesn't make sense, someone who's profitable wouldn't mind to pay the fee for those cents of commissions. Also, this is an exchange that's hard to trust. If it's just heard somewhere else and still not that reputable at all, I'll stick to the exchanges that I'm familiar with and tested already.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitMaxz",
      "created_time": "October 18, 2022, 11:41:46 PM",
      "body": "Quote from: Potato Chips on October 16, 2022, 11:35:18 PMBut they will charge 10% for the profitable trades (stormgain.com/profit-share)? lol not worth it.That's too expensive than trading free on the Binance spot exchange Binance offer free USDT/BTC pair and BUSD to any pairs you don't need to pay a fee unless you want to trade on other coins/token or use their other services but the fees still very cheap around 0.1% or lower than that if you use BNB as your trading fee the discount is around 10% to 25% off.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}