{
  "id": "topic_5446286",
  "title": "mendace",
  "author": "mendace",
  "created_time": "March 25, 2023, 03:58:33 PM",
  "content": "The Mastering Lightning NetworkProtocollo di secondo livello per pagamenti Bitcoin istantaneiAndreas M. AntonopoulosOlaoluwa Osuntokun Rene PickhardtTraduzione italiana a cura di Riccardo MasuttiTraduzione ItalianaMastering Lightning Network – Protocollo di Secondo Livello per Pagamenti Bitcoin Istantaneidi Riccardo Masutti, viene rilasciato in una versione cartacea e una versione digitale. Ilcontenuto è lo stesso nelle due versioni, ma ci sono alcune differenze importanti.La versione cartacea è disponibile su Amazon e, a richiesta, nelle varie librerie online elocali. La versione cartacea è a sua volta suddivisa in due formati diversi.Una versione con copertina a colori flessibile e testo su carta leggera constampante a getto d'inchiostro bianco e nero.Una versione con copertina a colori rigida e testo su carta più spessa constampante a toner a colori e immagini di nitidezza e qualità altissima.La versione digitale è disponibile su Amazon (formati ePub, Kindle) e in formato PDF.Tutte queste modalità sono prive di DRM.Versione FlessibileLa versione flessibile è nel formato 8\"x10\" con 526 pagine si presenta con stampa in bianco e nero in carta leggera ma pur sempre di ottima qualità, il formato permette un facile trasporto se lo si vuole leggere in qualsiasi circostanza, peso 1.14kg.Versione RigidaLa versione rigida è nel formato 20.96 x 3.3 x 27.94 cm con 470 pagine e stampe a colori è un tomo veramente stupendo da tenere nella propria libreria, ha delle dimensioni e peso importanti e per questo la consiglio per una lettura comoda nel proprio ambiente. La carta è più spessa e la qualità di stampa è superiore al formato flessibile.Versione PDFEsiste una versione PDF che potete scaricare gratuitamente da questo link anche se vi consiglio caldamente l'acquisto del libro sia perchè non si potrà mai eguagliare la sensazione di sfogliare un libro specialmente quando il contenuto è ben fatto, sia per sostenere l'enorme mole di lavoro fatto dagli autori e dal traduttore in questo caso. In ogni caso vi suggerisco di lasciare una recensione su Amazon per aiutare a diffondere in modo positivo il libro.ContenutoCome potete immaginare LN non è un argomento facile da poter affrontare senza nessun base su Bitcoin, infatti consiglio la lettura di Mastering Bitcoin dello stesso autore con traduzione in italiano sempre di Masutti anche se nel testo viene spiegato tutto ciò che il paragrafo affronta in maniera approfondita. Questo libro è destinato principalmente a lettori con interessi tecnici e con unacomprensione dei fondamenti di Bitcoin, anche se chiunque con tanta voglia di apprendere può leggerlo.Dove acquistareSe volete acquistare una delle due versioni cartacee flessibile o rigida potete farlo su Amazon a questo link mentre probabilmente sarà possibile acquistarlo in satoshi verso terzi (vi aggiornerò non appena avrò maggiori info).CuriositàCopertina della Traduzione ItalianaUno speciale ringraziamento a Yegor Petrov, artista ed illustratore, che ha ideato e disegnatoil \"fulmine” di Lightning Network presente nella copertina di questo libro, Yegor è attualmente uno dei maggiori promotori allo sviluppo di Nostr e ci tenevo in particolare a citarlo perchè chi mi segue nei social o telegram avrà sicuramente visto la mia pic profilo con la lampadina appunto diegnata da Yegor e poi animata da me.Uno speciale ringraziamento da parte mia a Riccardo Masutti che mi ha permesso di recensire entrambe le copie.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5446286",
  "comments": [
    {
      "author": "babo",
      "created_time": "March 27, 2023, 09:25:14 AM",
      "body": "Belloooooolo comprerei se avessi tempo di leggerloforse prima o poi lo prendo, pero onestamente e' tanta roba, poi posso leggerlo anche al cesso (perche in italiano)i libri in inglese devo stare ben concentrato altrimenti non capisco tutto (e' uno sforzo cognitivo per me)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mendace",
      "created_time": "March 27, 2023, 10:19:29 AM",
      "body": "Quote from: babo on March 27, 2023, 09:25:14 AMBelloooooolo comprerei se avessi tempo di leggerloforse prima o poi lo prendo, pero onestamente e' tanta roba, poi posso leggerlo anche al cesso (perche in italiano)i libri in inglese devo stare ben concentrato altrimenti non capisco tutto (e' uno sforzo cognitivo per me)Si è un libro impegnativo e per leggerlo in inglese bisogna avere padronanza della lingua, infatti per questo ringrazio tanto Riccardo per il lavoro svolto perché ha dato la possibilità a tanti di poterlo leggere ma anche comprendere.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fillippone",
      "created_time": "March 27, 2023, 12:16:25 PM",
      "body": "Come ben sapete sono un fan delle traduzioni.Per molte persone la barriera linguistica è una difficoltà insormontabile.Lavori come questo, soprattutto in ambito tecnico, hanno un’importanza incredibile nella diffusione della conoscenza anche a chi non ha, per un motivo o per un altro, una padronanza completa della lingua.Mia iniziativa per le traduzioni sul forum:Help me translate my best posts in your Local Board",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}