{
  "id": "topic_5404290",
  "title": "KingsDen",
  "author": "KingsDen",
  "created_time": "June 27, 2022, 11:17:54 PM",
  "content": "I raised this topic after a post by 1miau, so that the community can discuss some issues bothering me.When I was a newbie, I was curious to know many things. I asked The Pharmacist what DT1 and DT2 meant. He sent me a link and explained briefly that DT1 are users trusted by theymos while DT2 are users trusted by the people theymos trusted.After that brief explanation, I was curious why there is no DT3, DT4 and so on. But I didn't want to bother him the more. My understanding of the trust system is that it is not moderated, just as scam is not moderated and also the merit system. But the abuse of any of the above is not encouraged.  Is a user trusted based on how long he has been in the forum?: I believe the answer is No. You can be 5yrs+ here and not trusted while a user like EZ0010 with only 5 activities would be trusted much. Is Trust + what one begs to have?: My answer is No. The trust system is mainly because of marketplace activities (services and goods), in order to know who to do business with. Any other trust that isn't based on successful business or the case similar to EZ0010 is not cogent to me. Trusting someone because he bursts scam doesn't mean that the person cannot scam. Though it could give the user an expression authority to tag scammers whenever. Well, that is why every good trust feedback should have a concise and precised feedback with references.Must everyone be positively trusted?: My answer is No. I do not bother to build my trust list because till now, I am not involved in selling or services rendering. But I have many users here that I trust their judgement, but I don't think it's worth stressing myself about. The case of EZ0010 could be anyone else. Many users here including myself would send the money back to theymos, but because the incident didn't involve us, there's no way to prove. My point is, allow trust to come naturally, don't beg or pay for it.Should a user be trusted because he is a quality poster?: I leave this to the community to decide.Hint: Should a spammer be tagged? If a spammer can be tagged, it therefore means a quality poster can be trusted. Is this correct?Then a spammer could be neg tagged for spamming, yet he doesn't have the potential to scam as he has done numerous businesses. Lolx...the mystery of trust system. My fear about the trust system which is in accordance with 1miau: If a group of scammers upto 50 persons are working together and one among the 50 gets a positive trust. He can in turn trust the remaining 49 scam users and they inturn trust one another. Then, the trust system would be compromised.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5404290",
  "comments": [
    {
      "author": "BitcoinGirl.Club",
      "created_time": "June 27, 2022, 11:38:09 PM",
      "body": "Anything above DT2 is a huge network. It's like LinkedIn 3rd and more connection. Almost everyone is included into the network so there are no point for anything above DT2.Quote from: KingsDen on June 27, 2022, 11:17:54 PMMy fear about the trust system which is in accordance with 1miau: If a group of scammers upto 50 persons are working together and one among the 50 gets a positive trust. He can in turn trust the remaining 49 scam users and they inturn trust one another. Then, the trust system would be compromised.With the current net score which is just one inclusion (then maintain the score 0) to be in the DT2 is too easy. A bad DT1 member can make as many DT2 members as he wants. We already have a discussion and most of us consider we should have a net inclusion of above 1. Higher the number of net score is safer for the system. I personally would consider anything above or equal to 3.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Z-tight",
      "created_time": "June 27, 2022, 11:46:27 PM",
      "body": "Quote from: KingsDen on June 27, 2022, 11:17:54 PMShould a user be trusted because he is a quality poster?: I leave this to the community to decide.No, i think you should leave a neutral feedback if you believe a user is a quality poster and his posts have maybe helped you improve your knowledge, or something similar to that. That is what i read in LoyceV's Beginners guide to correct use of the Trust systemQuoteUse Neutral feedback for anything that doesn't mean someone can or can't be trusted. This can be good feedback, for instance when someone helped you out.Quote from: KingsDen on June 27, 2022, 11:17:54 PMShould a spammer be tagged? If a spammer can be tagged, it therefore means a quality poster can be trusted. Is this correct?No. Spammers posts should be reported, a moderator will delete the posts, if the spammer continues, the moderator knows what to do. I will quote LoyceV again hereQuoteDon't leave negative feedback when someone violates the forum rules. Instead, use Report to moderator for rule violationsQuote from: KingsDen on June 27, 2022, 11:17:54 PMIf a group of scammers upto 50 persons are working together and one among the 50 gets a positive trust. He can in turn trust the remaining 49 scam users and they inturn trust one another. Then, the trust system would be compromised.It is extremely unlikely that 50 members will work together on bitcointalk.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitcoin_Arena",
      "created_time": "June 27, 2022, 11:58:54 PMLast edit: June 28, 2022, 12:09:48 AM by Bitcoin_Arena",
      "body": "Quote from: KingsDen on June 27, 2022, 11:17:54 PMHe sent me a link and explained briefly that DT1 are users trusted by theymos while DT2 are users trusted by the people theymos trustedThis is not true, Theymos doesn't have to trust anyone to be on DT1. DT1 members are voted from eligible members but what I believe is through Lottery voting then Theymos publishes the DT1 members every beginning of month.To be eligible, a profile must meet this criteriaQuote from: theymos on January 09, 2019, 06:03:26 PM#3I will periodically (maybe every month) be reconstructing the default trust list to include everyone who matches these criteria: - If rank was determined solely using earned merit, then you must be of at least Member rank. - You must have been online sometime within the last 3 days. - Your trust list must include at least 10 users, not including ~distrust entries. - You must not be banned or manually blacklisted from selection. - You must have posted sometime within the last 30 days. - You must have at least 10 people directly trusting you each with an earned merit of at least 10, not including merit you yourself sent. These \"votes\" are limited. - You must have at least 2 people directly trusting you with an earned merit of at least 250, not including merit you yourself sent. These \"votes\" are limited.Unlike the previous policy, I will not generally be trying to cultivate a good list; that will be left to the DT1 members themselves. However, I reserve the right to remove you and blacklist you from future selection if you engage in egregious and obvious abuse, or if multiple known alt accounts could be selected.Currently not that many users are eligible. If hundreds of users would be selected in the future, I plan to instead choose a random subset of about 100 eligible users each time. This DT1 reconstruction may even automatically happen on a schedule in the future, but it doesn't currently.This threads can be helpful to you1. DefaultTrust changes2. LoyceV's Beginners guide to correct use of the Trust system3. ★ Keep your role on default trust (DT) selection ★Quote from: KingsDen on June 27, 2022, 11:17:54 PMMy fear about the trust system which is in accordance with 1miau: If a group of scammers upto 50 persons are working together and one among the 50 gets a positive trust. He can in turn trust the remaining 49 scam users and they inturn trust one another. Then, the trust system would be compromised.It will get noticed, especially if they get elected on DT1, and they may get excluded by other members.Some group of people tried to manipulate the system but failed miserably (Remove Corruption From DT - Union Trust List",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "1miau",
      "created_time": "June 28, 2022, 12:12:47 AMLast edit: June 28, 2022, 12:23:05 AM by 1miau",
      "body": "Quote from: KingsDen on June 27, 2022, 11:17:54 PMI raised this topic after a post by 1miau, so that the community can discuss some issues bothering me.No need to have any fear, speaking from what I've seen, DT is very friendly and when you known the DT rules and community standards, everything is ok.  LoyceV's guide is a very good start.  There's also an useful thread from xtraelv: Discussion about acceptable and unacceptable behavior. Community values. DT (see also his second post)In fact, DT is only acting if there's (coordinated) abuse ongoing. Abuse against DT values / DT standards. Regarding trust abuse: We had a case some years ago, when some accounts from the turkish section tried to manipulate their way into DT with friends or even alts. The accounts didn't deserve a positive trust and it was very clear that the accounts were trying to cheat their way into DT. I've lost track about all the threads but here are some: https://bitcointalk.org/index.php?topic=5247155.0https://bitcointalk.org/index.php?topic=5219960The main discussion happened in the dedicated trust topic: https://bitcointalk.org/index.php?topic=5095156.0 (I don't know which page exactly, maybe someone knows about it)There have been very long discussions about it. The abuse was very clear and some accounts were red tagged. Receiving a red tag is only for serious offenses. And the case some years ago was very serious. Today, the tools like from LoyceV are very advanced to detect trust abuse very early to avoid escalations. Often it's enough when the abusers are distrusted (added ~ to the trust list), meaning they are getting excluded. They might get a neutral tag to for pointing it out to potential trading partners. But no need to worry here for you because DT is giving people a chance to improve. Or at least I am doing this. Keep in mind that the issue some years ago was a very clear offense, where many accounts were involved and some more shady stuff. So, you are safe.  Quote from: KingsDen on June 27, 2022, 11:17:54 PMMy understanding of the trust system is that it is not moderated, just as scam is not moderated and also the merit system. But the abuse of any of the above is not encouraged. Exactly, DT is a decentralized reputation system created in the first half of the previous decade and maintained by the Bitcointalk since it was established (with some changes in 2019). Quote from: KingsDen on June 27, 2022, 11:17:54 PM Is a user trusted based on how long he has been in the forum?: I believe the answer is No. You can be 5yrs+ here and not trusted while a user like EZ0010 with only 5 activities would be trusted much.  Trust is mainly based on trades to evaluate whether the account in question can be trusted or not. An account that has done 100 trades with 1 BTC is more trustworthy than a shitposter with 0 trades. That's how trust was developed. Some years ago, there was a part where the feedback included a \"risked amount\" of BTC, to show how much BTC was involved. More BTC = more trustworthy. But that \"risked amount\" was removed in 2019. I found it very useful but since BTC increased so much in price, it was removed...Quote from: KingsDen on June 27, 2022, 11:17:54 PMMy fear about the trust system which is in accordance with 1miau: If a group of scammers upto 50 persons are working together and one among the 50 gets a positive trust. He can in turn trust the remaining 49 scam users and they inturn trust one another. Then, the trust system would be compromised.Exactly, trust is to prevent scams and offer a decentralized reputation system to recognize trusted (having many successful trades) accounts.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Apocollapse",
      "created_time": "June 28, 2022, 05:27:11 AM",
      "body": "There's no reason to give positive feedback to good person, skillful user, scam buster, spam buster etc since all of them has no relation with money related. Positive feedback is used if you're can be trusted because you have made several trade with huge amount and foremost the user send first or didn't using any escrow, this will help other users who want to trade with the users that have positive feedback will know if he's can be trusted, but not 100%.I've pointed this feedback on LoyceV thread, you can read it below.Quote from: Apocollapse on May 08, 2022, 07:33:00 AM\"This user is really valuable and wrote many high quality posts, it's an asset in this forum\"\"This user fighting against scammer, good scam buster\"\"This user is a good guy, useful, and active in x board\"\"This user is trusted with his valuable posts\"\"This user is really smart about Bitcoin\"I feel those above positive feedback isn't correct, since there's nothing about money or trade involved. Why does a smart person which created many high quality posts can be trusted? it's just like trusting a hacker which know how to hack a website and stole the funds. Now talking about scam buster, a respectable person who help the forum, why we should leaving positive feedback a respectable person? I think adding his name on trust list is already enough since they're mostly leaving a negative and neutral feedback, also support or opposite a flag (forum stuffs). Someone who willing to help about forum stuffs are different with someone who willing to help in money oriented e.g. refund back the money. Moreover trusting someone because he active in x board, knowing each other or join on a same gang/activities e.g. active in their local board are just subjective judgement and shouldn't given a positive feedback.The 5 positive feedback reflect on EZ0010 account isn't really correct since it's too many, he only need 1 positive feedback left by theymos since he's returning back theymos (forum) money, not with the other 4 users.Quote from: KingsDen on June 27, 2022, 11:17:54 PMMy fear about the trust system which is in accordance with 1miau: If a group of scammers upto 50 persons are working together and one among the 50 gets a positive trust. He can in turn trust the remaining 49 scam users and they inturn trust one another. Then, the trust system would be compromised.When this is happen, I believe theymos will take care with this case since it's already too big and would messed up the current trust system.Have anyone forget the case by this user elmanchez where he get TMAN's positive feedback since he design everyone for free? after that, he continue to farm more positive feedback and act like an innocent. Many users thought he's a good user and can be trusted with many positive feedback, but the fact he's a loan defaulter elmanchez exit scam, loan default",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SatoPrincess",
      "created_time": "June 28, 2022, 07:16:37 AM",
      "body": "Quote from: KingsDen on June 27, 2022, 11:17:54 PMMust everyone be positively trusted?: My answer is No. I do not bother to build my trust list because till now, I am not involved in selling or services rendering. But I have many users here that I trust their judgement, but I don't think it's worth stressing myself about. The case of EZ0010 could be anyone else. Many users here including myself would send the money back to theymos, but because the incident didn't involve us, there's no way to prove. The case of EZ0010 could be anyone else, but not everyone would return that money. The EZ0010 account was a newbie account with few posts, I believe there was no sentimental attachment to the account for him to want to keep it. What EZ0010 did was noble and he was rewarded for his honesty.  Quote from: KingsDen on June 27, 2022, 11:17:54 PMShould a user be trusted because he is a quality poster?: I leave this to the community to decide.Hint: Should a spammer be tagged? If a spammer can be tagged, it therefore means a quality poster can be trusted. Is this correct?Then a spammer could be neg tagged for spamming, yet he doesn't have the potential to scam as he has done numerous businesses. Lolx...the mystery of trust system. My fear about the trust system which is in accordance with 1miau: If a group of scammers upto 50 persons are working together and one among the 50 gets a positive trust. He can in turn trust the remaining 49 scam users and they inturn trust one another. Then, the trust system would be compromised.There is nothing mysterious about the trust system. A spammer can be given a neutral trust with reference to his post spamming. I have seen accounts with neutral trust by Actmyname with reference of being part of a spammer list. It’s not a red tag, a negative tag in such situations would be harsh and will be abuse of the trust system. The person may choose to create a thread on reputation to drag the case.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LoyceV",
      "created_time": "June 28, 2022, 10:19:22 AM",
      "body": "Quote from: KingsDen on June 27, 2022, 11:17:54 PMI was curious why there is no DT3, DT4Actually, there is! You can change the Trust depth in Trust settings. But be aware this has large recursive implications and depth 4 will probably give a timeout on the Trust settings page.QuoteI have many users here that I trust their judgement, but I don't think it's worth stressing myself about.That's unfortunate, because the Trust system can only be decentralized if enough people use it:Quote from: LoyceV on October 10, 2019, 03:37:17 PMOnce you fully understand the system, it's important to start using it:Did you do a trade in which you risked funds? Leave feedback!Did you see users who left accurate Trust feedback on many accounts? Add them to your Trust list!Anyone can leave feedback, and anyone can customize their Trust list!Quote from: KingsDen on June 27, 2022, 11:17:54 PMShould a user be trusted because he is a quality poster?: I leave this to the community to decide.A quality poster has more to lose than a spammer. That's why I trust a quality poster more.QuoteIf a group of scammers upto 50 persons are working together and one among the 50 gets a positive trust.Prove it, and theymos can manually blacklist them from voting for DT1. See this example.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "examplens",
      "created_time": "June 28, 2022, 11:09:49 AM",
      "body": "Quote from: 1miau on June 28, 2022, 12:12:47 AMExactly, trust is to prevent scams and offer a decentralized reputation system to recognize trusted (having many successful trades) accounts. ok, that might be a good signal but has not \"having many successful trades\" also proved in part to be unreliable and prone to manipulation?A few dollars trades, or taking short and small loans just for the sake of gaining positive trust.a closed system is almost being created, where some novices can gain trust very hard and slowly.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "KingsDen",
      "created_time": "June 28, 2022, 11:49:39 AM",
      "body": "Quote from: BitcoinGirl.Club on June 27, 2022, 11:38:09 PMWe already have a discussion and most of us consider we should have a net inclusion of above 1. Higher the number of net score is safer for the system. I personally would consider anything above or equal to 3.Thanks for pointing my attention to this thread. I will go through it and see people's opinions. Quote from: examplens on June 28, 2022, 11:09:49 AMA few dollars trades, or taking short and small loans just for the sake of gaining positive trust.That's what really happens. Some people will get a loan from Darkstar and repay in order to have a positive feedback from him. Though in most cases I have seen him place a neutral feedback instead.What I really missed is the early days of the forum where the weight of trust is determined by how much btc trade you were able to execute. Someone pointed it out in this thread.Quote from: LoyceV on June 28, 2022, 10:19:22 AMQuote from: KingsDen on June 27, 2022, 11:17:54 PMI have many users here that I trust their judgement, but I don't think it's worth stressing myself about.That's unfortunate, because the Trust system can only be decentralized if enough people use it:I am honestly unaware of this. I didn't know that a fellow without a feedback from DT1 or DT2 can have a stake in the trust system. Now I know, I'm gonna arrange my trust list.Quote from: LoyceV on June 28, 2022, 10:19:22 AMQuote from: KingsDen on June 27, 2022, 11:17:54 PMIf a group of scammers upto 50 persons are working together and one among the 50 gets a positive trust.Prove it, and theymos can manually blacklist them from voting for DT1. See this example.I haven't seen it happen, was just thinking aloud and being concerned. Someone has already noted that something similar happend but theymos was able to handle it.Quote from: Z-tight on June 27, 2022, 11:46:27 PMQuote from: KingsDen on June 27, 2022, 11:17:54 PMIf a group of scammers upto 50 persons are working together and one among the 50 gets a positive trust. He can in turn trust the remaining 49 scam users and they inturn trust one another. Then, the trust system would be compromised.It is extremely unlikely that 50 members will work together on bitcointalk.Same was my thought but a thread by Ratimov was an eye opener to me. That thread left me in awe for some time. But I have a strong believe that Ratimov was right because 85% of that farm doesn't exist in this forum today.Exposing RainbowKun and His Large Alts Army. Big farm 60+ Accs !!!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LoyceV",
      "created_time": "June 28, 2022, 01:39:49 PMLast edit: June 28, 2022, 03:33:43 PM by LoyceV",
      "body": "Quote from: KingsDen on June 28, 2022, 11:49:39 AMI didn't know that a fellow without a feedback from DT1 or DT2 can have a stake in the trust system.Well, not directly. But with 10+ earned Merit, you can have a vote, and with 250+ earned Merit, you can have a big vote for DT1.If you use the Trust system correctly, eventually someone will include you and your feedback becomes more meaningful to others.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AnotherAlt",
      "created_time": "June 28, 2022, 03:26:05 PM",
      "body": "Quote from: LoyceV on June 28, 2022, 01:39:49 PMyou can have a big for for DT1.You may want to rephrase this.QuoteIf you use the Trust system correctly, eventually, someone will include you, and your feedback becomes more meaningful to others. So, Merit count matters (For Voters) when it comes to DT1 Selection? I didn't see the official election yet. How to vote? Add to my trust List = Vote? Do you believe someone will add me to their list if they don't know me personally? I feel like no Because I am not a veteran member like you",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LoyceV",
      "created_time": "June 28, 2022, 03:36:30 PM",
      "body": "Quote from: AnotherAlt on June 28, 2022, 03:26:05 PMHow to vote? Add to my trust List = Vote?Correct. See DefaultTrust changes.QuoteDo you believe someone will add me to their list if they don't know me personally?I know none of the people who included (or excluded) me personally.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AnotherAlt",
      "created_time": "June 28, 2022, 03:50:32 PM",
      "body": "Quote from: LoyceV on June 28, 2022, 03:36:30 PMQuote from: AnotherAlt on June 28, 2022, 03:26:05 PMHow to vote? Add to my trust List = Vote?Correct. See DefaultTrust changes.I added you to my trust list a few weeks ago. But, You are a DT1 member already. Does it make any change on it? I mean, What if you get more votes from members? I guess there are some changes in rank?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "examplens",
      "created_time": "June 28, 2022, 03:59:22 PM",
      "body": "Quote from: AnotherAlt on June 28, 2022, 03:50:32 PMQuote from: LoyceV on June 28, 2022, 03:36:30 PMQuote from: AnotherAlt on June 28, 2022, 03:26:05 PMHow to vote? Add to my trust List = Vote?Correct. See DefaultTrust changes.I added you to my trust list a few weeks ago. But, You are a DT1 member already. Does it make any change on it? I mean, What if you get more votes from members? I guess there are some changes in rank?in fact, this does not change anything concerning LoyceV DT power. You are not DT1 or even DT2, so adding someone to your trust list doesn't change many things. btw. are you sure you have edited your trust list correctly? Judging by BPIP from your profile, you still only have the default list \"Not available in the latest file.\" https://bpip.org/Profile?id=3461867",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AnotherAlt",
      "created_time": "June 28, 2022, 04:17:31 PM",
      "body": "Quote from: examplens on June 28, 2022, 03:59:22 PMare you sure you have edited your trust list correctly? Judging by BPIP from your profile, you still only have the default list \"Not available in the latest file.\" https://bpip.org/Profile?id=3461867I am not sure what's wrong with BPIP.org but you may check Loyce.club which I always use, Here is the lastest one https://loyce.club/trust/2022-06-25_Sat_05.09h/3461867.html",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LoyceV",
      "created_time": "June 28, 2022, 04:26:06 PM",
      "body": "Quote from: AnotherAlt on June 28, 2022, 03:50:32 PMI added you to my trust list a few weeks ago. But, You are a DT1 member already. Does it make any change on it? I mean, What if you get more votes from members? I guess there are some changes in rank?See theymos' semi-mysterious algorithy Quote from: examplens on June 28, 2022, 03:59:22 PMbtw. are you sure you have edited your trust list correctly? Judging by BPIP from your profile, you still only have the default list \"Not available in the latest file.\" https://bpip.org/Profile?id=3461867It's a bug on BPIP: newer Trust lists don't get updated. I guess it's too much work to fix, so it never happened.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AnotherAlt",
      "created_time": "June 28, 2022, 04:32:10 PM",
      "body": "Quote from: LoyceV on June 28, 2022, 04:26:06 PMIt's a bug on BPIP: newer Trust lists don't get updated. I guess it's too much work to fix, so it never happened.So it's better to suggest to Loyce.club which I already did.Quote from: AnotherAlt on June 28, 2022, 04:17:31 PMyou may check Loyce.club which I always use, Here is the lastest one https://loyce.club/trust/2022-06-25_Sat_05.09h/3461867.html",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PaperWallet",
      "created_time": "June 28, 2022, 05:20:52 PM",
      "body": "The trust system on this forum is not that much reliable. I personally have a negative trust score for just speaking out about a scam I was victim of, yet nobody has ever lost money with me. Nobody knows why people are at risk of losing money with me according to my trust score. On the contrary, I got abused organising a giveaway, kept my word, and yet got a negative feedback for it. The person who abused my giveaway, with proof, didn't get any negative trust score (@examplens). I caught that guy in a big lie yet people here defend him, because they're all part of the same group.Scams get promoted no problem, every now and then. The last one is Bitlucy. The promoter of that scam, Royse777, has a positive trust score, because \"He just didn't pay attention\". Most people here will assure you he has nothing to do with it, yet the evidence is overwhelming. Not to forget that the trust score is supposed to do with the risk of trade associated with that person, not if it was intentional or not (although in this case it most certainly was). This had some but little effect on Royse777 account. And then this scam gets forgotten and there we go to the next one.It is rather the reputation of this forum that has been created by the founder of Bitcoin that has now been sabotaged by a bunch of evil people promoting scams, and it would be very difficult to change since they are the larger group on this forum and some of them have a lot of accounts.I'd estimate 99% of accounts here have a price set on them. If they were to be trusted in a sum of money that is larger than the promotion money they get to promote their scam organisations, they'd scam the person who trusted them. That might or might not affect their trust a little, but it wouldn't matter then. Of course this is something I would never do since I know there is a God and there would be a price to pay if I would steal someone.LoyceV as an example would have a large price for his account so he could be trusted to some extent. Others a bit less. The question is how much do you value their accounts. Go take a look on the signature campaigns and see how much they get. I wouldn't advise anyone to go beyond 200-300 dollars on average, and that is already too high and a bit more risky.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "actmyname",
      "created_time": "June 30, 2022, 07:43:38 AM",
      "body": "Quote from: PaperWallet on June 28, 2022, 05:20:52 PMI wouldn't advise anyone to go beyond 200-300 dollars on average, and that is already too high and a bit more risky.lolIt's always been that users can read/leave feedback at their discretion. Completely up to you whether you decide to frame DefaultTrust as your god of reputation, if you bend over for theymos or if you investigate individual feedback.If you're the type of person to simply look at a bunch of numbers and be satisfied, then there are plenty of prime candidates out there. Positive or negative have varying definitions to all users - if you have to miss out interacting with those who disregard the nuance, then it's not much of a loss.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}