{
  "id": "topic_5440082",
  "title": "BenCodie",
  "author": "BenCodie",
  "created_time": "February 16, 2023, 04:10:41 PM",
  "content": "A job to assist securing a centos7 server via consulting is available. The server uses whm and litespeed to deliver its hosted application. Proficiency with these on top of Centos 7 is required. The purpose of the work is to prepare the server and hosting infrastructure for pen-testing of the web application that will be hosted on the server, followed by a server stress-test when the web application is completely patched. Work will be available in these fields respectively after the standard of security of the server is believed to be at its highest (information below).Web application pen-test and server stress-test spots are also openPen-testing and stress-testing spots are also available. Right now this is just a preliminary expression of interest to gauge interest and price quotes until the security consulting is complete. An external expert who can provide pen-testing and reporting up to ISO 27002 best practices and PCI DSS compliance standards is available. Providing a similar service with consulting and revisions for a lower cost will land you the spot over this expert. More information about the web application will be provided to candidates who seem like a good fit based on provided experience/portfolio/references/preliminary talks etc. Other general information- Someone who is knowledgeable and charging fairly for consulting can expect a long term relationship. - Ideally provide your hourly consulting rate privately after you have posted a bit about yourself, or provide an introduction privately too if you prefer.- Hours for the consulting job will be counted by the duration of communication sessions and bonuses may be provided depending how efficient and effective the overall experience is.- The web application pen-test and server stress-test will come after the security consulting.- If you are not an established member we will use an escrow. If you are someone who is clearly trusted, an agreed cost before hand with a growing pay-as-you-go structure is preferred (to establish initial trust during initial work). If we build a long-term relationship you can expect upfront payment. - Please do not ask what is being worked on and expect an answer. This will be public information when the web app is done as it will be posted here at that point. Until then, this information will be confidential with whoever is being worked with. - I only use Matrix/Element.io for communication. Please provide your handle by PM after you have given some information about yourself and I will be in touch.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5440082",
  "comments": []
}