{
  "id": "topic_5463043",
  "title": "Compromise me",
  "author": "Compromise me",
  "created_time": "August 12, 2023, 04:07:30 PM",
  "content": "We can invest in property, if we have knowledge about real estate market. We can perform low bowling strategy by visiting 100 properties which are on sale. We can filter 10 properties of of ten, then we can filter 3 out of ten and offer 70 percent price as comparison to real price, then we can choose best from last three properties. We can see which person and buy property from that. Rental properties are best options because these give fare after every month. We can also take advance from lessee. After 5 to 8 years, retal property value will be double. In this way, we can in rental properties safely.We can also invest in commercial market and we can work on it and then sale it, it is very advantageous. Commercial market also give bare and its bare increases speedly. Commercial Market price also increases speedly. We can invest in plots if we have knowledge about the area in which we are investment. In a long term, property plot value increases.If we have least amount of money, we should invest in rental property that will give fare  and equity. By investing in plot, we cannot get  fare but we get equity. Commercial investment is a best investment if we have a large amount of money. Commercial real estate value increases speedlyas comparison to rental properties and plots.We see , millioners are growing from real estate. Other businesses are also available but real estate industry is fast income growing industry. Builders also get benefit from real estate, they work on foreigners projects, builders invest foreigner  money. Real estate industry is continuously growing.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5463043",
  "comments": [
    {
      "author": "Findingnemo",
      "created_time": "August 12, 2023, 04:13:59 PM",
      "body": "Quote from: Compromise me on August 12, 2023, 04:07:30 PMWe can invest in property, if we have knowledge about real estate market. We can perform low bowling strategy by visiting 100 properties which are on sale. We can filter 10 properties of of ten, then we can filter 3 out of ten and offer 70 percent price as comparison to real price, then we can choose best from last three properties. We can see which person and buy property from that. Rental properties are best options because these give fare after every month. We can also take advance from lessee. After 5 to 8 years, retal property value will be double. In this way, we can in rental properties safely.It depends on where the property is Location Your negotiation skills Your selling abilityEvaluation of the actual market priceEnough contacts to sell the propertySo if you want to be a realtor then you can be but if you say that all the millions are made from only there then you are blindsided. Have you heard of Wall Street guys?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Adams0001",
      "created_time": "August 12, 2023, 04:29:19 PM",
      "body": "Quote from: Compromise me on August 12, 2023, 04:07:30 PMWe see , millioners are growing from real estate. Other businesses are also available but real estate industry is fast income growing industry. Builders also get benefit from real estate, they work on foreigners projects, builders invest foreigner  money. Real estate industry is continuously growing.One can make significant gains through a variety of investment strategies, but which one will work for you will depend on your own circumstances. It is true that the real estate industry is rapidly expanding and that many people are finding success there. But first, keep in mind the startup costs, the investment strategy, and the best ways to reach your target market through advertising or market research. You seem quite sure about this business, and I don't dispute that, but at the same time, it's not as simple as you made it sound and requires a thorough knowledge as well.Quote from: Findingnemo on August 12, 2023, 04:13:59 PMHave you heard of Wall Street guys? I haven’t heard about them, what do they do? I’m curious to know.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Eternad",
      "created_time": "August 12, 2023, 04:43:32 PM",
      "body": "Millions is on real estate but all billions is on the technology/e-commerce market which is far more diversified than real estate. Real estate business or investment is only advantageous to thise country with high rate of urbanization since most of the people is looking for house due to limited land properties availability.I really like Real Estate investment too but it just required huge capital while the risk of making your money sleep on a certain property for a long time while it's value depreciate due to property damage overtime makes me skip and just focus on business industry that not prone to physical damage due to age.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "so98nn",
      "created_time": "August 12, 2023, 04:53:29 PM",
      "body": "This is very much true in my country. Most of the land around the city is under cultivation. However, whenever city needs an expansion, town planning starts expanding the municipal corporation borders to newer limits. This slowly stretches towards the agri lands which are then converted to non agricultural lands. We have seen the price hikes of 5-10 fold as compared to the land under agriculture. This has given rise to new type of business. For example, many corporates, and rich individuals would start buying the lands nearby city but that are no non agri. After few years as the borders start stretching it gives out hell lot of money. Definitely booming business if played well.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "m2017",
      "created_time": "August 12, 2023, 05:01:06 PM",
      "body": "Quote from: Compromise me on August 12, 2023, 04:07:30 PM1) We can invest in property, if we have knowledge about real estate market. We can perform low bowling strategy by visiting 100 properties which are on sale. We can filter 10 properties of of ten, then we can filter 3 out of ten and 2) offer 70 percent price as comparison to real price, then we can choose best from last three properties. We can see which person and buy property from that. Rental properties are best options because these give fare after every month. We can also take advance from lessee. 3) After 5 to 8 years, retal property value will be double. In this way, we can in rental properties safely.We can also invest in commercial market and we can work on it and then sale it, it is very advantageous. Commercial market also give bare and its bare increases speedly. Commercial Market price also increases speedly. We can invest in plots if we have knowledge about the area in which we are investment. In a long term, property plot value increases.If we have least amount of money, we should invest in rental property that will give fare  and equity. By investing in plot, we cannot get  fare but we get equity. Commercial investment is a best investment if we have a large amount of money. Commercial real estate value increases speedlyas comparison to rental properties and plots.We see , millioners are growing from real estate. Other businesses are also available but real estate industry is fast income growing industry. Builders also get benefit from real estate, they work on foreigners projects, builders invest foreigner  money. Real estate industry is continuously growing.1) We can invest in real estate if we have a large amount of money. Buying real estate is not like buying hamburgers for a couple of bucks.2) For the price you offered, 70% of the current value of the property, they can say thank you, wish you success and say goodbye. You talk about it so easily that it seems that you are a bigwig from the world of real estate, who has made more than one hundred transactions with the purchase and sale of real estate.3) It's not the price of real estate doubling, but inflation devours the local currency. That is, it takes more cut paper to buy the same property. The real estate market is heavily overheated, prices are overpriced, and yields are overpriced and have low liquidity. Of course, with due skill, people make money on this, but in order to repeat their success, it is not enough just to read your post.Everywhere has its own nuances. Here are a couple of them.Will real estate rise in price in a country where local military conflicts occur, natural disasters like earthquakes, and will the pile of bricks and concrete on the ruins in which you invested be worth at least something? And if you have to urgently relocate to another country, will you take your property with you, because there will be no time to sell it?After reading all this, I had only one question: what did you want to say with your post? What can you become a millionaire by investing in real estate? What is your message to forum members?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Faisal2202",
      "created_time": "August 12, 2023, 05:10:19 PM",
      "body": "Quote from: Eternad on August 12, 2023, 04:43:32 PMMillions is on real estate but all billions is on the technology/e-commerce market which is far more diversified than real estate. Real estate business or investment is only advantageous to thise country with high rate of urbanization since most of the people is looking for house due to limited land properties availability.I really like Real Estate investment too but it just required huge capital while the risk of making your money sleep on a certain property for a long time while it's value depreciate due to property damage overtime makes me skip and just focus on business industry that not prone to physical damage due to age.Long story short, not every one is educated an well aware of new or existing technologies or ecommerce markets. Because most of the millennials prefer to invest in traditional investment opportunities like real estate. I have 5 uncles and everyone prefer to start a business physically like real estate where they can see the land by themselves or where they know there land exist. If i will suggest them to buy land in Metaverse than they will declare me crazy one or dumb one. They will say you are out of your mind.But technology geeks who have the experience do know that they could earn more than real estate business in real world. So, somethings are not for everyone. Like those millennials who wanted to buy land instead of investing that money in BTC. I can not agree more on your second paragraph's first statement, because everyone wants to buy lands either its for personal or commercial purposes, we do want to buy land but we don't have that much investment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dr.Bitcoin_Strange",
      "created_time": "August 12, 2023, 05:23:14 PM",
      "body": "Despite the fact that real estate is profitable to its investors, note also that not only the real estate investment is very profitable; I mean, like you said, all the millions come from real estate, but real estate is not the only booming investment. I think there are other investment that most people consider even better options for now; some great investors are putting their money mostly into digital assets(Although it's just a thing of choice and where you feel your asset will be more safe). technologies companies, AI world, cryptocurrency. Just as  Eternad said, there are still billions of dollars in those industries. If you know, real estate and gold have been old means of investment from time immemorial, despite the fact that they are still being invested in today because they are still profitable and some people believe their risks are minimal. But there are still other investment methods that are more profitable than real estate. Real estate investing also has its drawbacks, which can also cause significant losses to the investor any time those problems arise.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kakmakr",
      "created_time": "August 12, 2023, 05:39:56 PM",
      "body": "I like simplicity.... almost zero effort ...and lots of profits. So, if you have to compare the two investment options... then real estate is one of the most complicated investments that an individual can get into. Just making the decision where to buy to garantee a steady rental income or a profit when you sell it...are riddled with complexity. Property investment can also quickly backfire, when you pick the wrong area or the wrong property. You also need a lot of experience to do it the correct way.... but Bitcoin is easy, because you buy low and wait..... wait ..wait... until you can sell at a higher price.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Agbe",
      "created_time": "August 12, 2023, 05:47:32 PM",
      "body": "Quote from: Compromise me on August 12, 2023, 04:07:30 PMAll millions are from real estate. Well there would be not too much argument on this for now because those investment are still around but bitcoin investors will pass them very soon. Property investment has more risk than bitcoin investment. The management of real estate is much more harder than cryptocurrency management and real estate has been in existence before cryptocurrency came to the world and with time cryptocurrency will take over the investment world of real estate.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "paxmao",
      "created_time": "August 12, 2023, 06:07:42 PM",
      "body": "There are many people working the real state market both big and small players, it is pretty much a classic in most countries. Getting deals as you describe is possible but it requires lots of time an work, and knowledge, so it is not as simple as getting some financing and jump in the market. Also, some countries have a better streamline of services for renting and refurb than others.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DeathAngel",
      "created_time": "August 12, 2023, 06:19:32 PM",
      "body": "Real estate can be a fantastic investment for several reasons. It normally appreciates in value over time allowing you to build equity and potentially earn a profit when you decide to sell. Real estate can provide a steady stream of passive income through rental properties. It also offers tax benefitssuch as deductions on mortgage interest and property taxes. However like any investment, success depends on factors like market conditions, location, & thorough research. It's always wise to seek advice from professionals in the field to make informed decisions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fiatless",
      "created_time": "August 12, 2023, 07:03:44 PM",
      "body": "Quote from: Compromise me on August 12, 2023, 04:07:30 PMWe see , millioners are growing from real estate. Other businesses are also available but real estate industry is fast income growing industry. Builders also get benefit from real estate, they work on foreigners projects, builders invest foreigner  money. Real estate industry is continuously growing.All sectors are not profitable if one understands the area and keeps adopting new technology. Some people are making a fortune in the oil and gas sector. At the beginning of the war in Ukraine when there was oil and gas crises the Saudi oil giant Aramco made a record $161 Billion Profit In 2022. Making money in any sector can be triggered by anything either positive or negative. Currently, money-making firms are in the artificial intelligence sector. The AI industry is revolutionalizing other sectors and reaping a lot of profit.  Quote from: DeathAngel on August 12, 2023, 06:19:32 PMReal estate can be a fantastic investment for several reasons. It normally appreciates in value over time allowing you to build equity and potentially earn a profit when you decide to sell. Real estate can provide a steady stream of passive income through rental properties. It also offers tax benefitssuch as deductions on mortgage interest and property taxes. However like any investment, success depends on factors like market conditions, location, & thorough research. It's always wise to seek advice from professionals in the field to make informed decisions.Real estate is a profitable business in areas that are experiencing population growth or an increase in tourist activities. There is a high rate of urbanization in countries that are experiencing population growth either through birth rate or immigration. Most people buy cheap land in rural areas and wait for them to develop into urban areas. These cheap lands win now become very expensive and the investor can resell them or build houses for rentals. Buying houses in countries that attract tourists can be expensive but can also be profitable. Rents are usually high in these countries because of the influx of tourists.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BIT-BENDER",
      "created_time": "August 12, 2023, 07:30:53 PM",
      "body": "I will address your topic specifically, firstly the notion is not well thought because there is no fact to prove this to get true what so ever, also I won't deny the fact that real estate is amongst the top investment opportunities one can get into but as investment goes the higher you invest the more your chances of profits.Firstly it's super hard to own properties of good value and real estate capital is very high, and if you do your research properly the major investors in real estate especially the high investors had already made their millions from else where like their profession and now real estate is seen as their best option for investment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "August 12, 2023, 08:01:31 PMLast edit: August 12, 2023, 08:17:40 PM by franky1",
      "body": "real estate is not a guaranteed investmentfirstly when you get a mortgage. the 'comps value' of the house is not the end amount you payyou have to factor in:mortgage interestmaintenance to keep it up to sellable standardmortgage providers want payers to also buy insurance to protect the propertythen there is the contractual costs like land surveys, taxessome mortgage providers want their mortgage holders to modernise the property periodically to retain property valueif you then rent out the property:maintenance costs go up. repairing damage the renters doyou also dont always have reliable renters that pay the rentlegal costs for contracts and doing checks on the proposed renteethe reason housing prices go up. is not profit. its just for people to try to break even to cover all their costs. ...with bitcoin once you buy bitcoin. thats it. no more ongoing costs. just hoard and wait...alot of people are fooled into thinking they can just get a house that is 'turn key' (finished, furnished and ready to move in) at 30% discount. and do absolutely nothing to it. have guaranteed income to just pay the sold price. and after 8-10 years (when its now derelict and in disrepair) sell it at 30% above local comps of turn key modern upgraded homessorry it doesnt work like that",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "darkangel11",
      "created_time": "August 12, 2023, 08:12:13 PM",
      "body": "Real estate industry is growing and it's going to keep growing, but there's a little problem. For it to keep growing, the population of a country needs to keep growing. In countries with declining population, when you see real estate prices being in a bubble, this bubble is unsustainable. There's no way to keep the prices up if the demand is bound to decline. IMO investing in real estate meaning land is going to be profitable almost everywhere you go, but investing in apartments can be a tricky thing. Just look at China. They're building too much and in a cheap way. These apartments aren't worth the price.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "August 12, 2023, 08:21:05 PM",
      "body": "Quote from: darkangel11 on August 12, 2023, 08:12:13 PMReal estate industry is growing and it's going to keep growing, but there's a little problem. For it to keep growing, the population of a country needs to keep growing. In countries with declining population, when you see real estate prices being in a bubble, this bubble is unsustainable. There's no way to keep the prices up if the demand is bound to decline. IMO investing in real estate meaning land is going to be profitable almost everywhere you go, but investing in apartments can be a tricky thing. Just look at China. They're building too much and in a cheap way. These apartments aren't worth the price. its not just a population game.. its an affordability gamepeople get a mortgage for a $200k house but with all costs added, ends up paying closer to $350k+ so NEED to sell it at $350k just to break even.however if the local region over a 10 year investment has not had a 75% pay rise over 10 years (7.5% inflation each year)then the new buyer cant afford your property.they end up buying a newly built \"affordable housing\" property part funded by government grants.. not your propertyto sell your property. you would need to not only modernise your 10+year old property to modern standards, but excel those standard to sway those on higher income to pay extra to buy yours rather than a property newly built still under warranty",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "darkangel11",
      "created_time": "August 12, 2023, 08:41:40 PM",
      "body": "^^^Then there's more...Holding on to your property generates additional cost of property tax+ maintenance that over the period of 10 years gives a hefty sum. To compare, holding bitcoin or gold doesn't generate additional cost. Holding real estate can generate tremendous cost if that property gets damaged by a hurricane, flood, or even rodents. Then you could happen to buy property located in unlucky area, like people who bought apartments in Ukraine before 2022.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Aanuoluwatofunmi",
      "created_time": "August 12, 2023, 09:24:23 PM",
      "body": "Quote from: Compromise me on August 12, 2023, 04:07:30 PMWe see , millioners are growing from real estate. Other businesses are also available but real estate industry is fast income growing industry. Builders also get benefit from real estate, they work on foreigners projects, builders invest foreigner  money. Real estate industry is continuously growing.I can't say if truly that real estate is the highest most financial demanding project and assets but am very sure there are more other ones that we can also point at being financial demanding and not only that, they are fast growing as well, a good instance is in cryptocurrency, taking bitcoin for an example, acquiring bitcoin is what we can all do at any affordable level we could stand to invest base on our capacity, I can't even count the number of assets or rate of money involved in cryptocurrency as at where it is today.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "STT",
      "created_time": "August 12, 2023, 09:31:28 PM",
      "body": "Quite true if we take McDonalds owning the land their franchises operate on as being a large part of why they are profitable over many years.   Land can dramatically fall in value too, land can be flooded, can be washed away by a meandering river or ruined in value by any number of possibilities.  Sometimes a town just falls out of favor, the land becomes far less worth then prior.  Maybe we say land because so many other assets lose out more easily and generally land goes up in a country with rising population, it just might take a century.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}