{
  "id": "topic_5438540",
  "title": "Serverandcloud",
  "author": "Serverandcloud",
  "created_time": "February 07, 2023, 04:08:47 PM",
  "content": "Hi BitcoinTalk forum members!We're for the first time here with you and would like to offer you a professional hosting service - Server & Cloud.We provide a wide range of products and services including Dedicated Servers, VPS, Cloud Hosting, DDoS Protection and Colocation. Our company is a privately owned, customer oriented hosting company with highly skilled employees at every level of organizational structure.Here are the key benefits of our service:SecuritySecurity and confidentiality is our specialty. Your privacy, including all customer data, is protected by laws and regulations of Switzerland.24/7 SupportAround the clock support by highly qualified staff. Your questions will be addressed in timely, professional manner. Feel free to contact us anytime.99.9% UptimeOur industry leading infrastructure guarantee uptime in excess of 99.99%. You can count on exceptional high availability of your web resource.Unbeatable PricesWe recognize that cost efficiency is essential to your business. We provide you with the best value - the combination of quality and price that cannot be beaten.We accept multiple payment methods.Bank transfersCredit cards (MasterCard, Visa, American Express)Cryptocurrencies (Bitcoin, Bitcoin Cash, Litecoin, Ethereum, Polkadot and Monero)PayPal* (Restrictions apply)*PayPal payments must be processed manually.We Own Dedicated InfrastructureInfrastructure is the key to reliable IT business. Our team has created an outstanding proprietary platform where all equipment, network and software solutions are owned by Server & Cloud. This eliminates potential risks associated with leased equipment adding yet another safety layer to our network.Low latency 1 gbit/s LAN portsServer & Cloud ensure that our customers are using the most reliable and fast network. Premium Multi Homed Bandwidth guarantees necessary network redundancy at low latency. 1 gbit/s LAN ports are used at all servers for even better performance.DISCOUNT COUPONFor all new customers we provide a 50% discount for any service within one month with voucher BTCTLK50JOIN OUR PLATFORM NOW: https://server-cloud.com   FOLLOW US ON SOCIAL MEDIA -- NEW CONTENT WEEKLY!! Twitter: https://twitter.com/ServerAndCloudFacebook: https://facebook.com/serverandcloud",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5438540",
  "comments": [
    {
      "author": "Serverandcloud",
      "created_time": "February 09, 2023, 03:02:39 PM",
      "body": "He, We've just loaded keywords into AI, and after thinking for a while, the service generated for us the prediction text, which we present without corrections.Look what we've got   https://server-cloud.com/en/news/web_hosting_future/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "shasan",
      "created_time": "February 10, 2023, 12:13:41 AM",
      "body": "I am really confused about your service. I have just opened your twitter profile and it seems to me that the account 11 years old and you have only 5 followers while you have followed 9 profile. This means your service is not good or you have bought an account to show your business is old.Again I am confused after checking your domain info:Code:Important DatesExpires On2027-12-02Registered On2008-12-02Updated On2021-09-24So, are you doing business in 2008 or started recently just bought the domain in 2008?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Serverandcloud",
      "created_time": "February 11, 2023, 08:49:33 AM",
      "body": "Quote from: shasan on February 10, 2023, 12:13:41 AMI am really confused about your service. I have just opened your twitter profile and it seems to me that the account 11 years old and you have only 5 followers while you have followed 9 profile. This means your service is not good or you have bought an account to show your business is old.https://img001.prntscr.com/file/img001/C4VMunVRS4SbIEu_siuJKw.pngAgain I am confused after checking your domain info:Code:Important DatesExpires On2027-12-02Registered On2008-12-02Updated On2021-09-24So, are you doing business in 2008 or started recently just bought the domain in 2008?Hi!You're dead right about the number of followers on our Twitter acc. In fact, we have only 24 tweets here. I should also say that the number of followers on this page has nothing to do with the level of service and the quality of work of our company. When we started this business 11 years ago (a young group of programmers,franlky) and we were not trying to win any social media audience. We think the same now, so your idea about buying an account with subscribers is fundamentally different from our ideas about how to do business.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "shasan",
      "created_time": "February 11, 2023, 08:54:00 AM",
      "body": "Quote from: Serverandcloud on February 11, 2023, 08:49:33 AMIn fact, we have only 24 tweets here. Yes, I have just seen it. I have almost no activity though your first tweet is too old. But there is several years/months gap on each tweet and I think you have not done any social media promotion that's why your twitter handle is in such a condition.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Serverandcloud",
      "created_time": "February 11, 2023, 10:58:54 AM",
      "body": "Quote from: shasan on February 11, 2023, 08:54:00 AMQuote from: Serverandcloud on February 11, 2023, 08:49:33 AMIn fact, we have only 24 tweets here. Yes, I have just seen it. I have almost no activity though your first tweet is too old. But there is several years/months gap on each tweet and I think you have not done any social media promotion that's why your twitter handle is in such a condition.We're currently working to rectify this situation and once again point out the lack of connection between occasional posts on social networks and our work itself.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Serverandcloud",
      "created_time": "March 04, 2023, 01:35:45 PM",
      "body": "Attention all Bitcointalkers! 🛍️ Get a 25% discount on your first order with us! 🎉 Simply post \"S&C TOP OFFER\" below and receive a PM with your exclusive discount code. Don't miss out on this amazing deal!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "shasan",
      "created_time": "March 06, 2023, 02:40:35 AM",
      "body": "I noticed a few of your posts have already been deleted from this thread. I think it is for creating multiple posts in a single row. If you need to create more than one post then you have to wait for another response or you have to edit your previous posts or you have to delete your previous posts and create new posts or something like that otherwise your posts will be deleted and your profile might be get banned.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Serverandcloud",
      "created_time": "March 06, 2023, 08:16:55 AM",
      "body": "Quote from: shasan on March 06, 2023, 02:40:35 AMI noticed a few of your posts have already been deleted from this thread. I think it is for creating multiple posts in a single row. If you need to create more than one post then you have to wait for another response or you have to edit your previous posts or you have to delete your previous posts and create new posts or something like that otherwise your posts will be deleted and your profile might be get banned.Oh, thank you very much for this tip!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Serverandcloud",
      "created_time": "March 07, 2023, 08:40:48 AM",
      "body": "FOLLOW US ON SOCIAL MEDIA -- NEW CONTENT WEEKLY!! Twitter: https://twitter.com/ServerAndCloudFacebook: https://facebook.com/serverandcloud",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Serverandcloud",
      "created_time": "March 08, 2023, 08:11:04 AM",
      "body": "🌺Today, on International Women's Day, we celebrate the incredible women who have paved the way in IT and technology. We recognize their contributions and are committed to continuing the journey towards gender equality in the tech industry!!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Serverandcloud",
      "created_time": "March 09, 2023, 12:55:09 PM",
      "body": "Psst, Bitcointalkers... Wanna know what your hosting provider isn't telling you?  We've got the inside scoop on all the sketchy downsides of cheap hosting. Check out our fresh material now!https://server-cloud.com/en/news/cheap_webhosting_risks/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Solarcom",
      "created_time": "March 10, 2023, 08:06:48 AM",
      "body": "Quote from: Serverandcloud on March 09, 2023, 12:55:09 PMPsst, Bitcointalkers... Wanna know what your hosting provider isn't telling you?  We've got the inside scoop on all the sketchy downsides of cheap hosting. Check out our fresh material now!https://server-cloud.com/en/news/cheap_webhosting_risks/Cool stuff, guys",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Serverandcloud",
      "created_time": "March 12, 2023, 11:31:15 AM",
      "body": "Hey, Bitcointalkers!Check out our NEW Cloud Hosting offer:2.4 - 3.0 Ghz / Intel Xeon1 VMCPU: 1core (1 Ghz)2048 RAMStorage: 20 GBBandwidth: 1TB1 IPv4 addressVoucher HSTADVC50Total: $54/moOrder here: https://member.server-cloud.com/en/cart/add/171?bill=1",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Serverandcloud",
      "created_time": "March 13, 2023, 08:58:10 AM",
      "body": "Hi everyone,Just ti remind that for all Bitcointalkers we provide a 50% discount for any service within one month with voucher BTCTLK50",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "elisabethkemou",
      "created_time": "March 13, 2023, 01:40:34 PM",
      "body": "Quote from: Serverandcloud on March 12, 2023, 11:31:15 AMHey, Bitcointalkers!Check out our NEW Cloud Hosting offer:2.4 - 3.0 Ghz / Intel Xeon1 VMCPU: 1core (1 Ghz)2048 RAMStorage: 20 GBBandwidth: 1TB1 IPv4 addressVoucher HSTADVC50Total: $54/moOrder here: https://member.server-cloud.com/en/cart/add/171?bill=1What'll be the price for a year with discount?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Serverandcloud",
      "created_time": "March 14, 2023, 01:37:05 PM",
      "body": "Quote from: elisabethkemou on March 13, 2023, 01:40:34 PMQuote from: Serverandcloud on March 12, 2023, 11:31:15 AMHey, Bitcointalkers!Check out our NEW Cloud Hosting offer:2.4 - 3.0 Ghz / Intel Xeon1 VMCPU: 1core (1 Ghz)2048 RAMStorage: 20 GBBandwidth: 1TB1 IPv4 addressVoucher HSTADVC50Total: $54/moOrder here: https://member.server-cloud.com/en/cart/add/171?bill=1What'll be the price for a year with discount?Elizabeth, replied you in DM",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mouradhom",
      "created_time": "March 15, 2023, 03:05:22 PM",
      "body": "Please PM me discount coupon for an annual Dedicated VPN",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Serverandcloud",
      "created_time": "March 15, 2023, 05:42:21 PM",
      "body": "Quote from: Mouradhom on March 15, 2023, 03:05:22 PMPlease PM me discount coupon for an annual Dedicated VPNHi! Replied to you",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Helal11",
      "created_time": "March 18, 2023, 11:17:51 AM",
      "body": "Hi, What'll be the price for six months of Dedicated VPN service and is there any coupons?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}