{
  "id": "topic_5460817",
  "title": "KalOlak",
  "author": "KalOlak",
  "created_time": "July 23, 2023, 07:24:09 PM",
  "content": "If Bitcoin were to replace the current global financial system and achieve widespread adoption as a decentralized and reliable store of value, some enthusiasts might see Michael Saylor as a visionary or a pivotal figure. Similar to how Peter and Paul played crucial roles in spreading the teachings of Christianity, Saylor's active promotion and strategic investment in Bitcoin could be viewed as instrumental in driving its adoption.The analogy suggests that just as the apostles were significant in the establishment and spread of Christianity, Saylor's dedication to advocating for Bitcoin and integrating it into his business strategies could be perceived as foundational for a potential future financial paradigm.discuss",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5460817",
  "comments": [
    {
      "author": "Upgrade00",
      "created_time": "July 23, 2023, 07:33:13 PM",
      "body": "This is just an investment, do not help the idea that the Bitcoin community is a cult on. We just resonate with the idea of freedom and decentralization.Micheal Saylor is a guy who is looking after his investment, if Bitcoin rises in price, he profits, so it's only wise to help it on by using his influence.If we are looking for those who advocated for Bitcoin and helped it to reach where it is today we should look further back to the early days (someone like Hal Finney) and the developers that helped keep everything functioning.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wiwo",
      "created_time": "July 23, 2023, 07:33:29 PM",
      "body": "Bitcoin will never be a replacement to the world financial system so yoh need to settle with that fact, but the beat that Bitcoin can be is be an alternative to the traditional financial system which is a decentralized financial system that give its user the freedom to choose when and how they spend their money and how much, since there is no limit to Bitcoin transition, unlike the traditional financial system that involves all kinds of limits and restrictions.So be that is it may, Bitcoin is bigger than any individual investor, and as for Michelle Saylor, he is just an investor and the best he can be is to be among institutional investors but not up to the category of being called a whale Bitcoin holder, the total amount of Michael Saylor and his company bitcoin holding is still low compared to some individual Bitcoin holders.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BIT-BENDER",
      "created_time": "July 23, 2023, 07:41:21 PM",
      "body": "Now I think this is going crazy, Bitcoin has now been compared with everything and anything, now the spread of Christianity is compared with Bitcoin really funny.I think there have been many that have said that Bitcoin would develop and become generally accepted and just because they aren't popular should not make Micheal saylor special. Infact Many of us are here because we believe that Bitcoin has a strong place in the financial system in the future, that should not mean we are a figure from the bible. Let's stop all this weird comparison.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "KalOlak",
      "created_time": "July 23, 2023, 07:53:33 PMLast edit: July 24, 2023, 01:20:09 PM by hilariousandco",
      "body": "Quote from: Wiwo on July 23, 2023, 07:33:29 PMBitcoin will never be a replacement to the world financial system so yoh need to settle with that fact, but the beat that Bitcoin can be is be an alternative to the traditional financial system which is a decentralized financial system that give its user the freedom to choose when and how they spend their money and how much, since there is no limit to Bitcoin transition, unlike the traditional financial system that involves all kinds of limits and restrictions.So be that is it may, Bitcoin is bigger than any individual investor, and as for Michelle Saylor, he is just an investor and the best he can be is to be among institutional investors but not up to the category of being called a whale Bitcoin holder, the total amount of Michael Saylor and his company bitcoin holding is still low compared to some individual Bitcoin holders.While the overindulgent citizens and bourgeoisie in the Europe or USA are struggling to comprehend that 2.625 Bitcoin are vital for them not to become slaves in the next 100 years or can't grasp how to conduct AML Bitcoin LN transactions, here's an interesting fact. In Africa, approximately 500 million people do not possess passports and consequently, they lack access to banking services. The only available financial instrument for them today is Bitcoin LN. Understand, gentlemen, strictly speaking, it is indifferent to me whether you join the Order 2.625 or if we have to form an Order with our African brothers. In some sense, it might even be easier with them since their minds haven't undergone nuclear cleansing from Marvel and DC, and I can teach them everything they need to know: Rwanda, Sudan, Kenya, Chad, Angola... strictly speaking, these territories hold countless riches... diamonds, gold, cadmium... you name it, just to add around 8 million plebeians to our Order. And then, who knows, perhaps the \"old\" money earned by Belgians on the backs of Rwandans will turn to dust, and Belgium itself will become a colony.Quote from: Upgrade00 on July 23, 2023, 07:33:13 PMThis is just an investment, do not help the idea that the Bitcoin community is a cult on. We just resonate with the idea of freedom and decentralization.Micheal Saylor is a guy who is looking after his investment, if Bitcoin rises in price, he profits, so it's only wise to help it on by using his influence.If we are looking for those who advocated for Bitcoin and helped it to reach where it is today we should look further back to the early days (someone like Hal Finney) and the developers that helped keep everything functioning.The art of longing cults.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kemarit",
      "created_time": "July 23, 2023, 08:50:10 PM",
      "body": "Quote from: KalOlak on July 23, 2023, 07:24:09 PMIf Bitcoin were to replace the current global financial system and achieve widespread adoption as a decentralized and reliable store of value, some enthusiasts might see Michael Saylor as a visionary or a pivotal figure. Similar to how Peter and Paul played crucial roles in spreading the teachings of Christianity, Saylor's active promotion and strategic investment in Bitcoin could be viewed as instrumental in driving its adoption.The analogy suggests that just as the apostles were significant in the establishment and spread of Christianity, Saylor's dedication to advocating for Bitcoin and integrating it into his business strategies could be perceived as foundational for a potential future financial paradigm.discussNah, I would stir away from the religion analogy. It's totally different and we shouldn't compare it to like Christianity wherein Satoshi could be the symbol like Jesus and then he as his apostles like what you are portraying here as Michael Saylor = Peter or Paul.It's just the Saylor being a investor and see the potential on BTC, \"religiously\" invested on it because as humans, he knows that he can make a lot of money and so he will be rich. Of course he has been preaching Bitcoin since he join the bandwagon, but it doesn't mean he doesn't have any investment outside of Bitcoin. We just don't know, maybe he has property investments or like stocks and others.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "KalOlak",
      "created_time": "July 23, 2023, 09:09:23 PM",
      "body": "Quote from: Kemarit on July 23, 2023, 08:50:10 PMNah, I would stir away from the religion analogy. It's totally different and we shouldn't compare it to like Christianity wherein Satoshi could be the symbol like Jesus and then he as his apostles like what you are portraying here as Michael Saylor = Peter or Paul.It's just the Saylor being a investor and see the potential on BTC, \"religiously\" invested on it because as humans, he knows that he can make a lot of money and so he will be rich. Of course he has been preaching Bitcoin since he join the bandwagon, but it doesn't mean he doesn't have any investment outside of Bitcoin. We just don't know, maybe he has property investments or like stocks and others.In general, when observing humans, those who are isolated within a tribe or society tend to have shorter lifespans. Throughout early human history, we realized the importance of being part of a strong group (cult or religion) for survival. Typically, the groups that maintain strong bonds and loyalty are more likely to succeed over other groups.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wiwo",
      "created_time": "July 23, 2023, 09:17:51 PM",
      "body": "Quote from: KalOlak on July 23, 2023, 07:53:33 PMQuote from: Wiwo on July 23, 2023, 07:33:29 PMBitcoin will never be a replacement to the world financial system so yoh need to settle with that fact, but the beat that Bitcoin can be is be an alternative to the traditional financial system which is a decentralized financial system that give its user the freedom to choose when and how they spend their money and how much, since there is no limit to Bitcoin transition, unlike the traditional financial system that involves all kinds of limits and restrictions.So be that is it may, Bitcoin is bigger than any individual investor, and as for Michelle Saylor, he is just an investor and the best he can be is to be among institutional investors but not up to the category of being called a whale Bitcoin holder, the total amount of Michael Saylor and his company bitcoin holding is still low compared to some individual Bitcoin holders.While the overindulgent citizens and bourgeoisie in the Europe or USA are struggling to comprehend that 2.625 Bitcoin are vital for them not to become slaves in the next 100 years or can't grasp how to conduct AML Bitcoin LN transactions, here's an interesting fact. In Africa, approximately 500 million people do not possess passports and consequently, they lack access to banking services. The only available financial instrument for them today is Bitcoin LN. Understand, gentlemen, strictly speaking, it is indifferent to me whether you join the Order 2.625 or if we have to form an Order with our African brothers. In some sense, it might even be easier with them since their minds haven't undergone nuclear cleansing from Marvel and DC, and I can teach them everything they need to know: Rwanda, Sudan, Kenya, Chad, Angola... strictly speaking, these territories hold countless riches... diamonds, gold, cadmium... you name it, just to add around 8 million plebeians to our Order. And then, who knows, perhaps the \"old\" money earned by Belgians on the backs of Rwandans will turn to dust, and Belgium itself will become a colony.I agree with you that bitcoin have banking the unbanked and helping the financial inclusion of everyone who chose to use Bitcoin without any limitations and this is what have proven Bitcoin to be the best alternatives but also having given it user the best alternative currency as being the decentralized alternatives. This have been the reason for the widespread adoption of Bitcoin for both small and whale bitcoin holders,  but then also we have had a whale control attempt to make changes to the price pattern of Bitcoin being a relatively stable alternative currency and due to Bitcoin decetralized nature and volatility in it value make Bitcoin to become a highly speculative assets at the moment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "serjent05",
      "created_time": "July 23, 2023, 10:14:09 PM",
      "body": "Quote from: KalOlak on July 23, 2023, 07:24:09 PMIf Bitcoin were to replace the current global financial system and achieve widespread adoption as a decentralized and reliable store of value, some enthusiasts might see Michael Saylor as a visionary or a pivotal figure. Similar to how Peter and Paul played crucial roles in spreading the teachings of Christianity, Saylor's active promotion and strategic investment in Bitcoin could be viewed as instrumental in driving its adoption.The analogy suggests that just as the apostles were significant in the establishment and spread of Christianity, Saylor's dedication to advocating for Bitcoin and integrating it into his business strategies could be perceived as foundational for a potential future financial paradigm.discussThere are people that believe Bitcoin can replace the current global financial system even before Michael Saylor stated his vision.  So I will never consider Michael Saylor as a modern apostle even after Bitcoin become the replacement of the current global financial system.  Saylor's promotion and strategic investment is just for personal gain since he really need to promote Bitcoin so that his plans and project will flourish.  It is more on personal gain, IMO.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hatshepsut93",
      "created_time": "July 23, 2023, 10:28:01 PM",
      "body": "Quote from: KalOlak on July 23, 2023, 07:24:09 PMIf Bitcoin were to replace the current global financial system People need to stop talking about replacement of global financial system, because Bitcoin is not a financial system, it's a payment network and a currency. Even if as a thought experiment we imagine that Bitcoin can replace fiat, there would still be a need for banks, brokers, trust funds and all the other financial institutions. Quote from: KalOlak on July 23, 2023, 07:24:09 PMThe analogy suggests that just as the apostles were significant in the establishment and spread of Christianity, Saylor's dedication to advocating for Bitcoin and integrating it into his business strategies could be perceived as foundational for a potential future financial paradigm.Roger Ver used to be called Bitcoin Jesus, and we all know how it all ended. Don't put all your faith into any individual, but especially the ultra-rich individual whose #1 priority in life is making even more money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nelson4lov",
      "created_time": "July 23, 2023, 10:38:53 PM",
      "body": "Quote from: KalOlak on July 23, 2023, 07:24:09 PMThe analogy suggests that just as the apostles were significant in the establishment and spread of Christianity, Saylor's dedication to advocating for Bitcoin and integrating it into his business strategies could be perceived as foundational for a potential future financial paradigm.discussI haven't seen any credible contribution by Michael Saylor to the bitcoin community and ecosystem since he started advocating for Bitcoin. While it's true that Microstrategy bought a lot of Bitcoin at different points in time! It's important to note that it's just business for Michael Saylor. It's his investment so it's only right thst he promotes his bag for other institutional investors to follow suit. Saylor saw an opportunity in Bitcoin and made the move to capitalize on it. Other than that, nothing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Baofeng",
      "created_time": "July 23, 2023, 11:10:11 PM",
      "body": "Quote from: KalOlak on July 23, 2023, 07:24:09 PMIf Bitcoin were to replace the current global financial system and achieve widespread adoption as a decentralized and reliable store of value, some enthusiasts might see Michael Saylor as a visionary or a pivotal figure. Similar to how Peter and Paul played crucial roles in spreading the teachings of Christianity, Saylor's active promotion and strategic investment in Bitcoin could be viewed as instrumental in driving its adoption.As much as we love to see Bitcoin becoming a world currency or even a reserved, it might not happen. I mean countries or the global reserves should at least be not as volatile as Bitcoin. And with that alone, it totally eliminates Bitcoin or even the rest of crypto to become a reserved, sorry to burst the bubble for you.Quote from: KalOlak on July 23, 2023, 07:24:09 PMThe analogy suggests that just as the apostles were significant in the establishment and spread of Christianity, Saylor's dedication to advocating for Bitcoin and integrating it into his business strategies could be perceived as foundational for a potential future financial paradigm.discussSaylor just so happen to be one of the biggest investors, nothing more, nothing less. Just like the rest of us here, average joe can be called apostle right? But that is not the case, Saylor is just like the rest of us. We shouldn't treat him like above us or even compare him to the apostles.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Casdinyard",
      "created_time": "July 23, 2023, 11:32:48 PM",
      "body": "Here we are again with the people who thinks bitcoin is the second coming of jesus christ or something. I mean it's one thing to be happy for its existence and support it with whatever you can but it's another to truly idolize it with the idea that it's the answer to all of the world's problems when it clearly isn't. Stop it with this you're more cringey than bitcoin maximalists. Michael Saylor did nothing but to preach bitcoin and buy it for microstrategy, I don't think he'd go as high as Peter and Paul in acclaim and fame just cause he supported one cryptocurrency when this thing is decentralized and the effort of it becoming a global currency lies upon the people and not among the hands of these promoters. Stop it. it's stupid.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GreatArkansas",
      "created_time": "July 24, 2023, 12:40:19 AM",
      "body": "I do not really agree about the word \"replace\".For me, Bitcoin will stay just like fiat is staying for quite some time since it was started.For me, our current financial system really sucks and Bitcoin will fix it. But for me, there will be only improvement on current financial that have Bitcoin involvement. And these people that are popular in the market are only advocates, even if we can say that they indeed just pumping their bags, which for me is normal, you will do it if you are on their side as long as you are not doing any illegal.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dansus021",
      "created_time": "July 24, 2023, 01:18:06 AM",
      "body": "Quote from: Upgrade00 on July 23, 2023, 07:33:13 PMThis is just an investment, do not help the idea that the Bitcoin community is a cult on. We just resonate with the idea of freedom and decentralization.Micheal Saylor is a guy who is looking after his investment, if Bitcoin rises in price, he profits, so it's only wise to help it on by using his influence.I do agree with you Michael Saylor or Elon Musk or even BlackRock is just a businessman thas has a company and wants to invest in Bitcoin and get a profit from it. It just same like us they might tweet something about bitcoin so people buying more at the end of the day the can take profit retailer like us. The world is like this :') but here we are",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptoHeadlineNews",
      "created_time": "July 24, 2023, 01:48:55 AM",
      "body": "Quote from: KalOlak on July 23, 2023, 07:24:09 PMIf Bitcoin were to replace the current global financial system and achieve widespread adoption as a decentralized and reliable store of value, some enthusiasts might see Michael Saylor as a visionary or a pivotal figure. Similar to how Peter and Paul played crucial roles in spreading the teachings of Christianity, Saylor's active promotion and strategic investment in Bitcoin could be viewed as instrumental in driving its adoption.The analogy suggests that just as the apostles were significant in the establishment and spread of Christianity, Saylor's dedication to advocating for Bitcoin and integrating it into his business strategies could be perceived as foundational for a potential future financial paradigm.discussComparing the work of Peter and Paul who went about spreading the good news of Christianity to that of what Michael Saylor is currently doing right now of his spread over the adoption of Bitcoin is kind of preposterous, because both are totally two different concepts, of which just as Peter and Paul offered a selfless service for the promotion of the kingdom of God, Michael Saylor is currently offering a service of which he stands to make huge profit if Bitcoin happens to skyrocket very high with mass adoption. Because I'm made to understand that Michael owns over 12,333 Bitcoin, worth over $369million with a current of approximately $30k per Bitcoin. So imagine how much profit he stands to gain if Bitcoin hit $100k, that is almost a billion dollars.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fiatless",
      "created_time": "July 24, 2023, 02:25:52 AM",
      "body": "Quote from: KalOlak on July 23, 2023, 07:24:09 PMIf Bitcoin were to replace the current global financial system and achieve widespread adoption as a decentralized and reliable store of value, some enthusiasts might see Michael Saylor as a visionary or a pivotal figure. Similar to how Peter and Paul played crucial roles in spreading the teachings of Christianity, Saylor's active promotion and strategic investment in Bitcoin could be viewed as instrumental in driving its adoption.Bitcoin is an alternative payment system that promotes privacy and decentralization. Bitcoin has the potential of becoming one of the dominant currencies, especially when it becomes less volatile but I am not sure it will become the only currency. It will keep existing with fiat and people will have the opinion of using anyone. QuoteThe analogy suggests that just as the apostles were significant in the establishment and spread of Christianity, Saylor's dedication to advocating for Bitcoin and integrating it into his business strategies could be perceived as foundational for a potential future financial paradigm.Your comparison between Saylor and Peter and Paul is funny. Saylor is promoting and protecting his investment because he wants to make financial gains. While Peter and Paul were promoting the Gospel because of eternal life. But I have to also confirm that Saylor is doing a great job. As he is promoting his Bitcoin asset, it is also having a good impact on the ecosystem. Quote from: KalOlak on July 23, 2023, 07:53:33 PMWhile the overindulgent citizens and bourgeoisie in the Europe or USA are struggling to comprehend that 2.625 Bitcoin are vital for them not to become slaves in the next 100 years or can't grasp how to conduct AML Bitcoin LN transactions, here's an interesting fact. In Africa, approximately 500 million people do not possess passports and consequently, they lack access to banking services. The only available financial instrument for them today is Bitcoin LN. Understand, gentlemen, strictly speaking, it is indifferent to me whether you join the Order 2.625 or if we have to form an Order with our African brothers. In some sense, it might even be easier with them since their minds haven't undergone nuclear cleansing from Marvel and DC, and I can teach them everything they need to know: Rwanda, Sudan, Kenya, Chad, Angola... strictly speaking, these territories hold countless riches... diamonds, gold, cadmium... you name it, just to add around 8 million plebeians to our Order. And then, who knows, perhaps the \"old\" money earned by Belgians on the backs of Rwandans will turn to dust, and Belgium itself will become a colony.Your claim that African nations hold so much potential based on natural resources and population strength is true. But these resources are not reflected in the standard of living of the people on the continent. Most unbanked people in Africa are poor and have no need for banks because they have nothing to save. Lack of basic amenities and illiteracy will not give bitcoin a good opportunity to flourish. Bitcoin will be a leading payment option in Africa if these nations gain some level of development.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rat03gopoh",
      "created_time": "July 24, 2023, 02:59:02 AM",
      "body": "I don't see MS trying so far to spread the lesson on the importance of adopting bitcoin seriously. Instead, I see him as just another market bubble maker with bitcoins he has piled up, that are none other than MS's business interests. You can see how the market reacted when it was under pressure from liquidation last year, most people were just worried it would happen. In this case MS can't protect its followers.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yhiaali3",
      "created_time": "July 24, 2023, 03:12:05 AM",
      "body": "Some may find Saylor's analogy to the Prophet of Bitcoin or Paul exaggerated, but regardless of the names, there is in every new matter a man who embraces the idea and works to spread it well.Although it would be inappropriate to liken Bitcoin to a religion, Saylor does a good job of popularizing the concept of Bitcoin, which helps expand global adoption.I believe that we will one day reach global adoption, but this is difficult to happen at the present time because we need a long time to consolidate these concepts and spread them on a global scale.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "adaseb",
      "created_time": "July 24, 2023, 03:38:25 AM",
      "body": "In 10 years if he doesn’t sell any Bitcoin prior he will be either known as the worlds best investor or the worst investor in the last 100 years.He is heavily invested in it already and has billions riding for his company. He had a very good average last time we rallied to $69K and hasn’t sold anything. So it’s shows you how determined he is. It might hit $100K and he might not sell either.When he starts to scale out it will be a problem because many retail will just copy trade him and sell. Just like Elon when he sold his Bitcoin holdings for Tesla.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}