{
  "id": "topic_5458871",
  "title": "BADecker",
  "author": "BADecker",
  "created_time": "July 06, 2023, 04:11:02 PM",
  "content": "That seems to be about right, when you consider that there are about \"More Than 105 Million Working Age Americans Do Not Have a Job Right Now.\"Number of homeless people in Los Angeles County surges to more than 75,000https://www.naturalnews.com/2023-07-05-homeless-los-angeles-county-surges-75000.htmlLos Angeles County now has more than 75,000 homeless people in its streets, constituting a 10 percent rise for the city and nine percent for the county.According to a massive count conducted by thousands of volunteers during a three-day period in January, an estimated 75,518 people were living in temporary housing tents, vehicles, RVs or other kinds of makeshift shelters, compared to 69,144 people with similar living conditions recorded in the previous year.The figures demonstrate a 70 percent increase in homelessness in the county and an 80 percent increase in the city since 2015. (Related: Homelessness in LA-LA Land Los Angeles getting WORSE under Democrats who blame the GOP for \"ignoring the NEEDY.\")Most of these increases were in the Westside and Harbor areas of Los Angeles, each experiencing an influx of over 2,000 people, an approximately 45 percent increase from the previous year.South L.A., which has the second-highest number of homeless people in the county behind central Los Angeles, bucked the trend with a 10 percent decrease representing around 1,600 fewer homeless people. The number of homeless people in the rest of the county remained relatively stable.Los Angeles Mayor Karen Bass, who took office late last year, has made decreasing homelessness her foremost priority. She set an ambitious target of transitioning 17,000 people off the streets in her first year, planning to house them in local motels.However, this strategy has faced limitations as many homeless people seem to prefer the relative freedom of life on the streets. Additionally, most homeless people struggle with drug addiction and mental illness, further complicating efforts to provide effective assistance. Homelessness growing despite presence of multiple housing programsDespite allocating funds for shelter, permanent housing and outreach, the annual point-in-time count released by the Los Angeles Homeless Services Authority (LAHSA) reveals a continuous growth of street encampments. ...",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5458871",
  "comments": [
    {
      "author": "Stepstowealth",
      "created_time": "July 06, 2023, 06:11:08 PM",
      "body": "Quote from: BADecker on July 06, 2023, 04:11:02 PMNumber of homeless people in Los Angeles County surges to more than 75,000This is bad, and if not checked will increase the more in a few years time. The economy gets tougher and people become poorer that they are no longer able to maintain the lifestyle they have. The increasing number of homeless people will also increase the number of criminals on the streets. Shelter is one of the basic needs of a human, and someone who is homeless and unable to afford this basic need will be very disorganized, and be more prone to involving in crimes.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BADecker",
      "created_time": "July 06, 2023, 07:30:05 PM",
      "body": "^^^ Could always send them off to fight in Ukraine.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Stepstowealth",
      "created_time": "July 07, 2023, 10:54:19 AM",
      "body": "Quote from: BADecker on July 06, 2023, 07:30:05 PM^^^ Could always send them off to fight in Ukraine.Surprisingly, as this is an unlikely suggestion, many of them will jump at the opportunity if offered, It will be an opportunity to get a roof over their head, have some income to them or their family that they have dissapointed and also give their life a meaning. Some Inmates especially those who are on a life sentence, also will like to die fighting than spending their whole life to die in jail, some will prefer dying with some honor and meaning. For the homeless people with no criminal record, providing a job for them can solve it. The homeless with criminal record can be given the option to join the army.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BADecker",
      "created_time": "July 07, 2023, 03:32:37 PM",
      "body": "Quote from: Stepstowealth on July 07, 2023, 10:54:19 AMQuote from: BADecker on July 06, 2023, 07:30:05 PM^^^ Could always send them off to fight in Ukraine.Surprisingly, as this is an unlikely suggestion, many of them will jump at the opportunity if offered, It will be an opportunity to get a roof over their head, have some income to them or their family that they have dissapointed and also give their life a meaning. Some Inmates especially those who are on a life sentence, also will like to die fighting than spending their whole life to die in jail, some will prefer dying with some honor and meaning. For the homeless people with no criminal record, providing a job for them can solve it. The homeless with criminal record can be given the option to join the army.The scary thing about this is, look at how the US economy is dumping. Nobody KNOWS the future. But a whole lot of financial people are saying that it will only get worse. So, along the employment lines, as you say, many people will join the military just to get a roof over their heads.Russia is a threat. They are a threat because they were goaded into being a threat by the US/Nato involvement in Ukraine. While the US is not prepared for a ground war, Russia is. But with the failing economy in the US, the people are becoming ready to become an army. Maybe, if Putin doesn't get the war over with, maybe we the people will become the army the US needs to go into Ukraine and fight Russia.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OgNasty",
      "created_time": "July 08, 2023, 06:19:17 AM",
      "body": "The homeless problem has gotten so much worse since the pandemic. It’s gotten close to home no matter where you live. They’re being provided with free food and encouraged to stay in cities on sidewalks. I’m really not even sure how this problem can be solved. The government seems to be happy with the current situation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blockman",
      "created_time": "July 08, 2023, 07:01:02 AM",
      "body": "Aside from LA, although I'm not from the USA. I've seen also a video about the drug problem in Philadelphia wherein it's like in every place there. They're also homeless people that have overdosed on drugs and they're everywhere based on that video that I've watched.Quote from: OgNasty on July 08, 2023, 06:19:17 AMThe homeless problem has gotten so much worse since the pandemic. It’s gotten close to home no matter where you live. They’re being provided with free food and encouraged to stay in cities on sidewalks. I’m really not even sure how this problem can be solved. The government seems to be happy with the current situation. I thought that this problem is only existing in countries like ours in the third world. And while our government is providing housing projects on these people, they don't like it due to the place where they'll be relocated. The result, they go back to the side walks and they sell the house even if it's not allowed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Stepstowealth",
      "created_time": "July 08, 2023, 07:01:15 AM",
      "body": "Quote from: OgNasty on July 08, 2023, 06:19:17 AMThe homeless problem has gotten so much worse since the pandemic. It’s gotten close to home no matter where you live.It means that if another global crisis begins, the number of homeless people will be nothing compared to the number then and because the problem is not been addressed, it will have a lot of consequences then. We could see homeless people in our front yard, not just close to home.Quote from: OgNasty on July 08, 2023, 06:19:17 AMThey’re being provided with free food and encouraged to stay in cities on sidewalks. I’m really not even sure how this problem can be solved. It should not be so difficult. Temporary apartments can be designated to these people to take then off the street, someone with a roof over their head will think better about how to move their life forward than someone who lives on the street and barely getting enough sleep.Quote from: OgNasty on July 08, 2023, 06:19:17 AMThe government seems to be happy with the current situation. Most likely some few powerful people are benefiting from it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Don Pedro Dinero",
      "created_time": "July 08, 2023, 07:05:39 AM",
      "body": "I have seen the images of homeless camps in US cities and I find it hard to understand that this is happening in what is still the world's leading power and where people from other countries emigrate en masse. In Europe you see homeless people but not such large concentrations or the fentanyl problem. Quote from: Stepstowealth on July 08, 2023, 07:01:15 AMMost likely some few powerful people are benefiting from it.How do they benefit according to you? Potentially some people could benefit if homeless people had jobs and were consumers, I think, but not in the current situation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zlantann",
      "created_time": "July 08, 2023, 09:56:46 AM",
      "body": "My country is also facing the same housing deficit but our situation is more complicated. The major reason is because of poverty. Many people are living in makeshift houses in slums and ghettos because they can not afford to pay house rent. Another reason for this problem is flooding. Due to climate change, many areas in my country are now flood prone which has rendered most people homeless. But the US issue is not caused by poverty but by immigration and drugs.Quote from: BADecker on July 06, 2023, 04:11:02 PM Most of these increases were in the Westside and Harbor areas of Los Angeles, each experiencing an influx of over 2,000 people, an approximately 45 percent increase from the previous year. QuoteHowever, this strategy has faced limitations as many homeless people seem to prefer the relative freedom of life on the streets. Additionally, most homeless people struggle with drug addiction and mental illness, further complicating efforts to provide effective assistance. Homelessness growing despite presence of multiple housing programsControlling the influx of people will be the solution to this problem. This has been a major problem in the US for a very long time and most governments have failed to tackle it. Most of those people that want a free life on the street are lazy and don't want to take responsibility. Drug addiction makes people lose their sense of reasoning. How can people prefer to sleep in the street when they have the opportunity to have good accommodation?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "swogerino",
      "created_time": "July 08, 2023, 11:38:15 AM",
      "body": "Quote from: OgNasty on July 08, 2023, 06:19:17 AMThe homeless problem has gotten so much worse since the pandemic. It’s gotten close to home no matter where you live. They’re being provided with free food and encouraged to stay in cities on sidewalks. I’m really not even sure how this problem can be solved. The government seems to be happy with the current situation. Unfortunately the government is the problem not only of US but of all world.They promise us all kind of sh*t to get our votes and when they do so they do not give the slightest f*ck what is happening with the normal citizens let alone the homeless who for them provide nothing as they do not pay any tax like us normal citizens do by taxing our wages.The fact that the major of L.A has made her utmost priority to house at least 17.000 of them in motels is a good desire more than a reality as these people will do more harm to themselves and motels rather than benefits,it is normal from such people with vices and other things because life has made them so,so we are still at point 0 of our trip.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BADecker",
      "created_time": "July 08, 2023, 04:08:33 PM",
      "body": "Foe what it's worth, the Amish in America don't seem to have this problem. But they are not big business, and they do not accept big business.What points do the Amish teach their children that protect them? How can we teach this to the poor of America?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OgNasty",
      "created_time": "July 08, 2023, 08:55:37 PM",
      "body": "Quote from: blockman on July 08, 2023, 07:01:02 AMAside from LA, although I'm not from the USA. I've seen also a video about the drug problem in Philadelphia wherein it's like in every place there. They're also homeless people that have overdosed on drugs and they're everywhere based on that video that I've watched.Quote from: OgNasty on July 08, 2023, 06:19:17 AMThe homeless problem has gotten so much worse since the pandemic. It’s gotten close to home no matter where you live. They’re being provided with free food and encouraged to stay in cities on sidewalks. I’m really not even sure how this problem can be solved. The government seems to be happy with the current situation. I thought that this problem is only existing in countries like ours in the third world. And while our government is providing housing projects on these people, they don't like it due to the place where they'll be relocated. The result, they go back to the side walks and they sell the house even if it's not allowed.It isn't just in a few cities anymore.  That's what is so crazy.  Even in Phoenix which is 120 degrees in the summer, there are homeless camps where people are being fed and given needles under the guise of helping them.  Most of the videos I've seen on YouTube interviewing people show that they don't even want to leave.  They enjoy their 3 free meals, good drugs, clean needles, and lawless environment.  I think we're seeing the beginning of society splintering into haves and have nots in a way that will shock people in the coming years when the true depths of the situation are common knowledge.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gyfts",
      "created_time": "July 08, 2023, 10:09:49 PM",
      "body": "A lot of the cities have an increase number of homeless and the solution they've put forth is just throwing money at them hoping the problem goes away.Lots of drug addicted, mentally ill people in California. LA and San Francisco have effectively decriminalized drug use, so these homeless encampments turn into open-air drug markets. You give these people a hotel room and food and that still won't be enough. Institutionalization for drug treatment/mental health treatment might be the only option.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hispo",
      "created_time": "July 09, 2023, 11:06:42 AM",
      "body": "Quote from: Gyfts on July 08, 2023, 10:09:49 PMA lot of the cities have an increase number of homeless and the solution they've put forth is just throwing money at them hoping the problem goes away.Lots of drug addicted, mentally ill people in California. LA and San Francisco have effectively decriminalized drug use, so these homeless encampments turn into open-air drug markets. You give these people a hotel room and food and that still won't be enough. Institutionalization for drug treatment/mental health treatment might be the only option.I agree. It is not enough just to throw money and wait for the problem to solve itself. If the root of the problem is drug addiction and mental illness, one needs to tackle the problem and commit the people who needs them, even if it is against their will at first, once they are recovered and realize what their life had become, they will likely be grateful of the measures that were taken to help them.Though, it can be quite controversial to institutionalize people like that, since there are very bad previous history on the asylums in the United States and Europe. The violation of human rights and the mistreatment of the people who were there supposedly to be helped...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BADecker",
      "created_time": "July 09, 2023, 04:36:48 PM",
      "body": "Quote from: Hispo on July 09, 2023, 11:06:42 AMQuote from: Gyfts on July 08, 2023, 10:09:49 PMA lot of the cities have an increase number of homeless and the solution they've put forth is just throwing money at them hoping the problem goes away.Lots of drug addicted, mentally ill people in California. LA and San Francisco have effectively decriminalized drug use, so these homeless encampments turn into open-air drug markets. You give these people a hotel room and food and that still won't be enough. Institutionalization for drug treatment/mental health treatment might be the only option.I agree. It is not enough just to throw money and wait for the problem to solve itself. If the root of the problem is drug addiction and mental illness, one needs to tackle the problem and commit the people who needs them, even if it is against their will at first, once they are recovered and realize what their life had become, they will likely be grateful of the measures that were taken to help them.Though, it can be quite controversial to institutionalize people like that, since there are very bad previous history on the asylums in the United States and Europe. The violation of human rights and the mistreatment of the people who were there supposedly to be helped...The thing to do is stick them in a big squirrel-cage treadmill, with their drugs just outside of their reach (or almost outside of it). Have the treadmill hooked up to generators to make electricity to be sold.At the same time, play Bible tapes - narrators reading the Bible on tape - around the clock, so that some of them will be saved by hearing God's word, and the Holy Spirit will change their attitudes and lives.Of course, this is only an outline of what to do. Whoever is in authority in a local, can figure out the practical 'treadmill' details. Bible narrations are a must, of course.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blockman",
      "created_time": "July 09, 2023, 10:15:15 PM",
      "body": "Quote from: OgNasty on July 08, 2023, 08:55:37 PMQuote from: blockman on July 08, 2023, 07:01:02 AMAside from LA, although I'm not from the USA. I've seen also a video about the drug problem in Philadelphia wherein it's like in every place there. They're also homeless people that have overdosed on drugs and they're everywhere based on that video that I've watched.Quote from: OgNasty on July 08, 2023, 06:19:17 AMThe homeless problem has gotten so much worse since the pandemic. It’s gotten close to home no matter where you live. They’re being provided with free food and encouraged to stay in cities on sidewalks. I’m really not even sure how this problem can be solved. The government seems to be happy with the current situation. I thought that this problem is only existing in countries like ours in the third world. And while our government is providing housing projects on these people, they don't like it due to the place where they'll be relocated. The result, they go back to the side walks and they sell the house even if it's not allowed.It isn't just in a few cities anymore.  That's what is so crazy.  Even in Phoenix which is 120 degrees in the summer, there are homeless camps where people are being fed and given needles under the guise of helping them.  Most of the videos I've seen on YouTube interviewing people show that they don't even want to leave.  They enjoy their 3 free meals, good drugs, clean needles, and lawless environment.  I think we're seeing the beginning of society splintering into haves and have nots in a way that will shock people in the coming years when the true depths of the situation are common knowledge. That's tough.I guess these people like the way they're living as they're getting food stamps and free meals and don't even have to work and they're all getting the drug that they're addicted to. What's more in the future and it's so sad that the proliferation with this situation is expanding widely.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}