{
  "id": "topic_5416510",
  "title": "Cryptomultiplier",
  "author": "Cryptomultiplier",
  "created_time": "October 09, 2022, 02:58:01 PM",
  "content": "An automatic response to a simple stimulus which does not require mental processing is known as reflex. Gambling involves factors which entices people to spend more time and money than intended thereby neglecting friends and family, skipping classes or work in order to gamble.In reflex gambling, however, it is simply gambling without prior thoughts to variables involved all due to the brains response to a gambling stimuli.It is known in gambling that, whether one wins or lose, the brain releases chemicals like adrenalin and endorphins which gets one excited. One may want to play again to try to get a different score or outcome - and end up making some decisions they wished they hadn’t made.So, for a friend, roommate or family member who  gambles at the slightest impulse, these tips should be kept in mind:• Set and stick to time and money limits.• Prioritize responsibilities such as classes or work over gambling.• Be aware of signs of a problem like lying about the amount of money or time spent, withdrawing socially from friends and family, and negative effects to mental or physical health.• Use money set aside for entertainment, not for rent, tuition or other bills.• Spend time doing other activities, not just gambling.• Remember that mixing gambling with alcohol or drugs can be risky also.https://checkyourreflex.ca/",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5416510",
  "comments": [
    {
      "author": "Oshosondy",
      "created_time": "October 09, 2022, 03:07:38 PM",
      "body": "Quote from: Cryptomultiplier on October 09, 2022, 02:58:01 PM• Set and stick to time and money limits.This is very important, going beyond your time and monthly gambling budget means nothing more than addiction.Quote from: Cryptomultiplier on October 09, 2022, 02:58:01 PM• Be aware of signs of a problem like lying about the amount of money or time spent, withdrawing socially from friends and family, and negative effects to mental or physical health.That is true, but someone may be very social and be a gambling addict. Staying on phone followed by mood swing or reduction in exciting talk and slight sudden change of behavior during that moment can be used to know if someone is a gambling addict.Quote from: Cryptomultiplier on October 09, 2022, 02:58:01 PM• Spend time doing other activities, not just gambling.The enjoyment in gambling should be recreational, not addiction. Having other things you are doing makes life more recreational for you. I agree.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "acroman08",
      "created_time": "October 09, 2022, 06:25:19 PM",
      "body": "aside from the message you can see on the webpage I think OP should highlight what the website is about. the message that you can see on the website is already good but the game they have to test your (RE)Flex is great and I suggest members trying the game out. anyway,  at the end of the game, it will ask you what you felt while playing and whether you think you'd do better if you play again(which is what a lot of gamblers think when they lose).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "swogerino",
      "created_time": "October 09, 2022, 06:39:00 PM",
      "body": "I think the best thing to do is in the title,reflex action in gambling which means to gamble and not expecting anything in return.This I do every time I get the signature campaign earnings,I play 25 dollars and no matter what outcome winning or losing once I have lost this amount I quit and withdraw the money,when I win of course I play longer as then it is not anymore reflex gambling but is gambling with an aim,I think why not try to play in order to get that maximum pay line in the slot machine or even the jackpot and this keeps everyone going,I mean the slot players I don't know for other type of games but slots are ones of the most addictive so it is good to play a set limit bankroll and not expecting anything in return.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rruchi man",
      "created_time": "October 09, 2022, 07:05:30 PM",
      "body": "Quote from: Cryptomultiplier on October 09, 2022, 02:58:01 PMAn automatic response to a simple stimulus which does not require mental In reflex gambling, however, it is simply gambling without prior thoughts to variables involved all due to the brains response to a gambling stimuli.It is known in gambling that, whether one wins or lose, the brain releases chemicals like adrenalin and endorphins which gets one excited. One may want to play again to try to get a different score or outcome - and end up making some decisions they wished they hadn’t made.This reflex gambling is sounding same as compulsive gambling where a gambler is unable to control his gambling, and can sometimes find himself/herself gambling even before they can realises.Quote from: Cryptomultiplier on October 09, 2022, 02:58:01 PM• Spend time doing other activities, not just gambling.if you find yourself being in the category of a reflex or compulsive gambler you must try as much as possible to engage yourself in other activities to distract your mind from gambling. Seek enjoyment and pleasure in other activities, so you will not be idle and then the thought of gambling beseeches you.Quote from: Cryptomultiplier on October 09, 2022, 02:58:01 PM• Remember that mixing gambling with alcohol or drugs can be risky also.if you are the type that cannot handle the intoxication that comes with alcohol or drug use you may find yourself making irrational decisions when you are gambling and you become more prone to overspending.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fortify",
      "created_time": "October 09, 2022, 07:25:06 PM",
      "body": "Quote from: Cryptomultiplier on October 09, 2022, 02:58:01 PMAn automatic response to a simple stimulus which does not require mental processing is known as reflex. Gambling involves factors which entices people to spend more time and money than intended thereby neglecting friends and family, skipping classes or work in order to gamble.In reflex gambling, however, it is simply gambling without prior thoughts to variables involved all due to the brains response to a gambling stimuli.It is known in gambling that, whether one wins or lose, the brain releases chemicals like adrenalin and endorphins which gets one excited. One may want to play again to try to get a different score or outcome - and end up making some decisions they wished they hadn’t made.So, for a friend, roommate or family member who  gambles at the slightest impulse, these tips should be kept in mind:• Set and stick to time and money limits.• Prioritize responsibilities such as classes or work over gambling.• Be aware of signs of a problem like lying about the amount of money or time spent, withdrawing socially from friends and family, and negative effects to mental or physical health.• Use money set aside for entertainment, not for rent, tuition or other bills.• Spend time doing other activities, not just gambling.• Remember that mixing gambling with alcohol or drugs can be risky also.If gambling becomes anything more than an afterthought in your downtime, maybe you are playing too much. It's very easy to get drawn in and hooked to games like poker, which unless you are carefully managing your finances can be a big money sink as there are a lot of expert players out there who will slowly deplete any money that you put in. You should definitely also have an understanding of the odds involved in your games in choice, because generally you will never beat \"the house\" aka the casino in casual games like slots. If you think you are the lucky or that you are somehow \"due for a win\", then it's time to evaluate your whole psychology and stop.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "famososMuertos",
      "created_time": "October 09, 2022, 08:46:18 PM",
      "body": "All basic advice is always well received, it is not too later to remember never these guidelines.By the way  before following or trying to follow these guidelines, you should ask yourself or analyze if you have ever been able to maintain routines such as:Go to the gym.You are Save to buy an important good or asset.He is a social drinker or he is not, either one requires control.Manages some type of monetary responsibility.You have been able to achieve a personal achievement that requires a time-demanding routine.(....etc.)If you do not have at least one of the above, nothing prevents you from being successful in managing the destination of your money when betting it, but previous experiences are useful, sometimes we do not fail because we are unlucky, it is that we do not know how to follow routines, execute plans, etc.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Viscore",
      "created_time": "October 09, 2022, 09:15:55 PM",
      "body": "Quote from: swogerino on October 09, 2022, 06:39:00 PMI think the best thing to do is in the title,reflex action in gambling which means to gamble and not expecting anything in return.This I do every time I get the signature campaign earnings,I play 25 dollars and no matter what outcome winning or losing once I have lost this amount I quit and withdraw the money,when I win of course I play longer as then it is not anymore reflex gambling but is gambling with an aim,I think why not try to play in order to get that maximum pay line in the slot machine or even the jackpot and this keeps everyone going,I mean the slot players I don't know for other type of games but slots are ones of the most addictive so it is good to play a set limit bankroll and not expecting anything in return. Gambling has always given us excitement to gamble more especially if we are the in the verge of winning, and that is normal to us for gamblers. However, if you gamble for a living, that’s another thing, you will lose eventually and worst is you might get addicted to gambling. The reason why every time we gamble, spend an amount you can afford to lose so that if you win or not, you will not regret on it. And always gamble for fun, that way you will never have problems in gambling.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "goaldigger",
      "created_time": "October 09, 2022, 09:29:44 PM",
      "body": "Quote from: Cryptomultiplier on October 09, 2022, 02:58:01 PMSo, for a friend, roommate or family member who  gambles at the slightest impulse, these tips should be kept in mind:• Set and stick to time and money limits.• Prioritize responsibilities such as classes or work over gambling.• Be aware of signs of a problem like lying about the amount of money or time spent, withdrawing socially from friends and family, and negative effects to mental or physical health.• Use money set aside for entertainment, not for rent, tuition or other bills.• Spend time doing other activities, not just gambling.• Remember that mixing gambling with alcohol or drugs can be risky also.https://checkyourreflex.ca/Most of this tips already discusses before but of course it’s always good to highlights the importance of this to avoid gambling addiction, or else you’ll be on a big trouble if you let yourself lose a lot of money. Following this tips and suggestions will make gambling more enjoyable, this only means you are not too focus with the money and whatever the result of gambling is, you can easily accept it. Self control is a must, gambling is a game of trick you should not fall on that trap.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptomaniac_xxx",
      "created_time": "October 09, 2022, 09:36:40 PM",
      "body": "Thanks for the tips, but it's no secret that we have seen this kind of advise here in the forum. And I would say it's good but sometimes majority of us here don't follow a set of rules. I mean we already know the downfall of gambling from the beginning and yet we try it isn't it. So for sure, many of us are aware of this so called reflex action and yet we still can't avoid the pitfalls. And it's really hard to really get out of gambling so maybe the best thing to do is to really stay away from it in the beginning.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Davidvictorson",
      "created_time": "October 09, 2022, 09:47:22 PM",
      "body": "Quote from: Cryptomultiplier on October 09, 2022, 02:58:01 PM• Set and stick to time and money limits.If you are a gambler, you'd know that it is easier said than done. Oh yes, even a responsible gambler too requires an extra measure of self-restraint.  We tell ourselves that we'd 2 hours, 3 games, $60 and I am done. After an hour and 45minutes, we begin to negotiate with ourselves and before you know it, we have talked ourselves out our set time. That is why I usually recommend that you let someone who is non-judgmental know about it so as to hold you accountable. It works.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lionheart78",
      "created_time": "October 09, 2022, 10:00:06 PM",
      "body": "Quote from: Cryptomultiplier on October 09, 2022, 02:58:01 PM• Set and stick to time and money limits.This enable us to spend less and have more time for our daily activities outside gambling.Quote from: Cryptomultiplier on October 09, 2022, 02:58:01 PM• Prioritize responsibilities such as classes or work over gambling.This is a no brainer but mostly forgotten by gamblers.  We must prioritize our responsiblity over leisure.  Having leisure once in a while is not bad but forgetting our responsiblity will often put us to an unfavorable situation especially when our gambling activities affects our jobs or schooling.Pretty much it all goes down to self-control, priority, and responsibility.  We should always control ourselves in everything we do.  Having balance is the key and most of all knowledge on gambling and gambling addiction is a must whenever a person is to engage in gambling activity.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Saisher",
      "created_time": "October 09, 2022, 10:26:45 PM",
      "body": "Quote from: Cryptomultiplier on October 09, 2022, 02:58:01 PM• Set and stick to time and money limits.• Prioritize responsibilities such as classes or work over gambling.• Be aware of signs of a problem like lying about the amount of money or time spent, withdrawing socially from friends and family, and negative effects to mental or physical health.• Use money set aside for entertainment, not for rent, tuition or other bills.• Spend time doing other activities, not just gambling.• Remember that mixing gambling with alcohol or drugs can be risky also.https://checkyourreflex.ca/These are good points to follow to avoid getting stray, the bottom line is monitoring and strict allocation of your time and money, you have to be strict in your allocation because gambling addiction happens when you least expect it, most of the time it just happens and it's too late for you to stop it and you need outside interference, so don't let excess time and excess money spent in gambling, follow your allocation and you will be safe.Note: You need to quote posts that you copy from your source or your thread will be considered plagiarism.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hydrogen",
      "created_time": "October 09, 2022, 11:03:37 PM",
      "body": "The main issue with gambling is money and greed impair judgement and decision making. Gambling with money is very similar to driving a car drunk with alcohol. That's what makes it so hard to stay composed and disciplined when gambling, money and risk are involved. If a person's normal IQ is 120. Money and gambling might reduce their IQ to 50. A significantly reduced amount. When people gamble its common for them to only see the money they can earn for guessing correctly. No matter how much they're losing. The high yield of gambling means they're always only a few wins from winning back their losses. This mental image impairs judgement and decision making in a powerful way. Greed and emotions definitely also have strong negatives effect on logic and consistency. This applies not only to gambling but also stock market trading, investment and anything involving money and risk. To have a chance of success requires mental discipline. Those who are impulsive and lack self control might best steer clear and find something else better tailored to their natural impulses and mentality.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "serjent05",
      "created_time": "October 09, 2022, 11:06:08 PM",
      "body": "Quote from: Davidvictorson on October 09, 2022, 09:47:22 PMQuote from: Cryptomultiplier on October 09, 2022, 02:58:01 PM• Set and stick to time and money limits.If you are a gambler, you'd know that it is easier said than done. Oh yes, even a responsible gambler too requires an extra measure of self-restraint.  We tell ourselves that we'd 2 hours, 3 games, $60 and I am done. After an hour and 45minutes, we begin to negotiate with ourselves and before you know it, we have talked ourselves out our set time. That is why I usually recommend that you let someone who is non-judgmental know about it so as to hold you accountable. It works. True, a gambler once started his session often plays depending on his bankroll.  Worst, players tend to top up when their bankroll got depleted early but failed to stop when he is winning and his game time is extended for so long.  I have several experiences breaking this setting limit thing and oftentimes ends at a loss.  This is a simple reminder but too hard to execute and it needs a lot of effort and self-control.  I bet many of us break this thing lol.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PX-Z",
      "created_time": "October 09, 2022, 11:08:42 PM",
      "body": "You should indicate what is the posted website all about, don't just put it there like you are a newbie who is promoting his site after a long post.If you copy-pasted some phrase from that website you posted then indicate it as the source of your post's points.Back to the topic, hmm yes, most of these are really important to be kept in mind when doing gambling.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "samcrypto",
      "created_time": "October 09, 2022, 11:09:03 PM",
      "body": "Quote from: Cryptomultiplier on October 09, 2022, 02:58:01 PM• Use money set aside for entertainment, not for rent, tuition or other bills.• Spend time doing other activities, not just gamblingThis helps all the time, having your budget in gambling can prevent you from too much addiction, and focusing on other also helps you to forget to gamble. I experience some problem like this before, I just focus my attention to other things like playing video games and hanging out with my friend, I can say that it helps be forget my losses and make me realize that I should control myself from time to time, being a responsible gambler is really hard but we have to do it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OgNasty",
      "created_time": "October 09, 2022, 11:11:30 PM",
      "body": "Setting money limits is definitely a smart move. It’s basically a stop loss for gambling. You see it a lot in tv shows and movies where the main character will give his wallet to a friend and then gamble away his gambling money only to then beg his friend to give him back his wallet. Nobody likes to lose everything, so be smart and remember it’s all about paying for entertainment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "qwertyup23",
      "created_time": "October 09, 2022, 11:14:19 PM",
      "body": "Quote from: Hydrogen on October 09, 2022, 11:03:37 PMThe main issue with gambling is money and greed impair judgement and decision making. Gambling with money is very similar to driving a car drunk with alcohol. That's what makes it so hard to stay composed and disciplined when gambling, money and risk are involved. ....Interesting comparison as it is easier to visualize in another perspective.The nature of gambling makes it so risky to the point that your initial response to a loss is to recover it quickly. Now it begs the question: \"what is the fastest way of recovering it on the spot?\" Some might suggest to quit gambling and call it a day but majority would respond and answer to gamble again and try out your luck!With this kind of vicious cycle, a person would get stuck thinking that the only way to recover your losses is via gambling again in the same situation. Unfortunately, only a few can get out of this circle while many remain hopeful that by gambling again, they would recover their losses (which is the ideal scenario but they experience otherwise).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Baofeng",
      "created_time": "October 09, 2022, 11:14:53 PM",
      "body": "Or maybe if you are really into gambling and can't control yourself, this tips are not going to be effective, just saying. And so the gamblers in the beginning should understand the pitfalls and the actions that they will have to take course.As for the addicted one, as I have said before, it's hard to get out and they really need the help they needed specially from their families. It's only them that can help themselves though, to admit it and then seek help and go into rehab.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}