{
  "id": "topic_5446729",
  "title": "Yamane_Keto",
  "author": "Yamane_Keto",
  "created_time": "March 29, 2023, 04:24:53 AM",
  "content": "QuoteCanada's national government said federally regulated pension funds in the country will need to disclose their crypto assets exposure to the Office of the Superintendent of Financial Institutions (OSFI), as Ottawa tightens its regulatory oversight on the volatile industry.\"To help protect Canadians’ retirements, Budget 2023 announces that the government will require federally regulated pension funds to disclose their crypto-asset exposures to OSFI,\" the government said in the new 2023 budget plan. The federal government will also work with provinces and territories to discuss crypto-asset or related activities disclosures by the country's largest pension plans, which would ensure Canadians are aware of their pension plan’s potential exposure to crypto assets, the budget plan added.below links may be helpfulTo OKX Canadian users https://www.budget.canada.ca/2023/pdf/budget-2023-en.pdfhttps://www.coindesk.com/business/2022/08/17/canadian-pension-giant-caisse-writes-off-150m-bet-on-bankrupt-crypto-lender-celsius/https://www.coindesk.com/business/2022/11/18/pension-giant-ontario-teachers-plans-to-write-off-all-95-million-invested-in-crypto-exchange-ftx/https://www.coindesk.com/policy/2023/02/16/canada-close-to-tightening-rules-for-crypto-exchanges-sources/Source https://finance.yahoo.com/news/canada-ask-pension-funds-disclose-215021857.htmlWhy have so many governments become so serious about crypto investments? It all started in the United States and is now in Canada.Is it all because of FTX?- Yamane",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5446729",
  "comments": [
    {
      "author": "retreat",
      "created_time": "March 29, 2023, 04:33:49 AM",
      "body": "Quote from: Yamane_Keto on March 29, 2023, 04:24:53 AMWhy have so many governments become so serious about crypto investments? It all started in the United States and is now in Canada.Is it all because of FTX?Even before the FTX case, the government did not like the increasing adoption of cryptocurrencies. The government does not want that the adoption of cryptocurrency to increase, because it will threaten the existence of traditional banking products. Therefore they are trying their best to discredit cryptocurrencies and make them unreliable and unsafe payment/investment products for people.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OcTradism",
      "created_time": "March 29, 2023, 04:45:53 AM",
      "body": "I agree with this movement and law enforcement in Canada and if it is enforced in other countries, it's good.It's not about the elderly only but for all people who put their savings in Pension funds and don't get enough transparent reports from those entities. If their life savings are all in those Pension funds, their life will be at risk if those entities go bankrupted.I don't think only cryptocurrency is risky and authorities should ask for more transparancy of all asset types in Pension Funds, not only cryptocurrency. Banks are risky like they did collapsed within hours and days, just few weeks ago. Stocks are risky too and I disagree if they only focus on cryptocurrency.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "The Sceptical Chymist",
      "created_time": "March 29, 2023, 12:08:27 PM",
      "body": "I don't think this is a bad idea at all, and I don't think the Canadian government is being biased against crypto in this case.  Because of crypto's volatility alone, there ought to be some kind of warning for people who might unwittingly invest in a fund that holds crypto as part of its portfolio.  At least Canada hasn't banned state-sponsored pension funds from investing in crypto altogether.  That would be a lot more discouraging IMO.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "un_rank",
      "created_time": "March 29, 2023, 12:52:14 PM",
      "body": "Quote from: The Sceptical Chymist on March 29, 2023, 12:08:27 PMI don't think this is a bad idea at all, and I don't think the Canadian government is being biased against crypto in this case.I agree to an extent. Pensions are life time piggy banks and one has to be extra careful when handling it. Pensioners should be aware of the crypto exposure of the funds they use and make an informed decision to use such services.Some might argue that risks are present in any asset the pension funds are exposed to, even fiat and government bonds. In the U.K some months ago, a large pension fund came close to crashing and needed emergency intervention to stay afloat[1], this was a result of financial policies put in place. Situations like these would never be painted as a 'fiat problem' or show the risk in banking activities.[1] https://www.theguardian.com/business/2022/oct/06/bank-of-england-confirms-pension-funds-almost-collapsed-amid-market-meltdown- Jay -",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Twentyonepaylots",
      "created_time": "March 29, 2023, 11:22:35 PM",
      "body": "I think this is a good move for the government to see the activities in regards with cryptos that involves pension. Pension money should always be secured and it is the government's duty to protect it and make sure it is legally used and saved. This transparency would also make the citizens have reassurance of their funds. Overall, it is a great idea to have this.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OcTradism",
      "created_time": "March 30, 2023, 01:37:03 AM",
      "body": "Quote from: Twentyonepaylots on March 29, 2023, 11:22:35 PMI think this is a good move for the government to see the activities in regards with cryptos that involves pension. Pension money should always be secured and it is the government's duty to protect it and make sure it is legally used and saved. This transparency would also make the citizens have reassurance of their funds. Overall, it is a great idea to have this.Not only in pension fund management but also must be regulated more strictly in other areas related to fund management. People should not use money of others for their own greed and benefit that cause bad management and potential collapse.Collapse can be small or big but when it happens, it surely affects people who believe in that entity and their management board members. Their life can be broken forever and putting some people in to jail won't rescue life of others so as their savings and funds.Quote from: un_rank on March 29, 2023, 12:52:14 PMSome might argue that risks are present in any asset the pension funds are exposed to, even fiat and government bonds. In the U.K some months ago, a large pension fund came close to crashing and needed emergency intervention to stay afloat[1], this was a result of financial policies put in place. Situations like these would never be painted as a 'fiat problem' or show the risk in banking activities.Governments would have seen negative nets of government bonds in banks but they did not intervene it sooner. They just let it be and see some banks collapsed and later they reacted as they are saviors. I don't believe in them and their regulations are for citizen benefit.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Don Pedro Dinero",
      "created_time": "March 30, 2023, 02:24:31 AM",
      "body": "Quote from: The Sceptical Chymist on March 29, 2023, 12:08:27 PMI don't think this is a bad idea at all, and I don't think the Canadian government is being biased against crypto in this case.  Because of crypto's volatility alone, there ought to be some kind of warning for people who might unwittingly invest in a fund that holds crypto as part of its portfolio.  At least Canada hasn't banned state-sponsored pension funds from investing in crypto altogether.  That would be a lot more discouraging IMO.This.There are two essential points.1. There are many altcoins that are pure rubbish.2. Even if the only cryptocurrency in which a given pension fund invests is bitcoin, it cannot have a very large percentage invested because at any given time it can fall by 80% and pension funds need to have a good percentage of low-volatility investments in the mix to pay the pensions of those who are retiring.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "March 30, 2023, 02:59:53 AM",
      "body": "I think that the Pensions and Retirement Fund has a special symbolism, as any losses in that money will expose a group of elderly people to financial problems, which may negatively affect the government, and therefore it is better to invest in low-risk investments and thus reduce the possibility of losing money. It is more political than being related to investing in Cryptocurrency where the same warning would be for any high risk activity.It appears that the FTX debacle has alerted the authorities to the dangers of cryptocurrencies.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Maslate",
      "created_time": "March 30, 2023, 03:04:23 AM",
      "body": "I believe that this is a good way to protect people from companies that do not know how to manage their crypto assets. It is crucial to understand the risks associated with crypto investments, given that it is a highly volatile asset.To minimize the risks associated with crypto volatility, it is important to know a company's crypto exposure. So, it's alright that they are being required to disclose this information.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptoBuds",
      "created_time": "March 30, 2023, 03:19:51 AM",
      "body": "Quote from: retreat on March 29, 2023, 04:33:49 AMQuote from: Yamane_Keto on March 29, 2023, 04:24:53 AMWhy have so many governments become so serious about crypto investments? It all started in the United States and is now in Canada.Is it all because of FTX?Even before the FTX case, the government did not like the increasing adoption of cryptocurrencies. The government does not want that the adoption of cryptocurrency to increase, because it will threaten the existence of traditional banking products. Therefore they are trying their best to discredit cryptocurrencies and make them unreliable and unsafe payment/investment products for people.That may be true compared to years ago, but now I think the government no longer hates cryptocurrencies. Many countries have gradually changed their minds and accepted it to a certain extent, those that completely ban bitcoin are not many anymore. The government has seen its potential, and instead of banning it with no benefit, they are looking to regulate and tax it. That way they can make a profit as well as manage us. I support what the Canadian government is doing, I don't think they are trying to smear crypto.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "YUriy1991",
      "created_time": "March 30, 2023, 06:15:22 AM",
      "body": "I don't think it's related to the increased regulatory scrutiny on crypto investments by governments not solely because of FTX. While FTX has been gaining attention for its high-profile sponsorship deals and aggressive expansion, the regulatory crackdown on crypto assets is the result of broader concerns about the potential risks and challenges posed by the industry including market volatility, fraud, money laundering, and cybersecurity threats.As cryptocurrencies become more common, governments are trying to ensure that they are properly regulated to protect consumers and maintain financial stability and regulatory oversight of crypto investments is becoming a global trend that has gained momentum in recent years for many countries to monitor and control the industry.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bittraffic",
      "created_time": "March 30, 2023, 06:43:51 AM",
      "body": "Yep Canada's national government needs to know where they put thier money. Maybe they indeed are going to help the pensioners not to get scammed like the pensioners who invested in Celsius.Or the government could target those crypto projects soon when they learned that pensioners are linked to some Defi projects. There are many reasons not to trust Trudeau's government.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "un_rank",
      "created_time": "March 31, 2023, 07:27:35 AM",
      "body": "Quote from: OcTradism on March 30, 2023, 01:37:03 AMGovernments would have seen negative nets of government bonds in banks but they did not intervene it sooner. They just let it be and see some banks collapsed and later they reacted as they are saviors. I don't believe in them and their regulations are for citizen benefit.Whatever the case, it makes governments look weaker financially and shows out their policies to be detrimental to the economy. Emergency intervention as a term is one that is sure to put a pensioner on high alert and looking for other ways to safeguard their pension funds.Quote from: bittraffic on March 30, 2023, 06:43:51 AMThere are many reasons not to trust Trudeau's government. There are many reasons not to trust any government.- Jay -",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mauser",
      "created_time": "April 01, 2023, 05:34:28 AM",
      "body": "Quote from: Yamane_Keto on March 29, 2023, 04:24:53 AMWhy have so many governments become so serious about crypto investments? It all started in the United States and is now in Canada.Is it all because of FTX?I don't think this is only because of FTX, we had other big crisis before and it's definitely not going to be the last one. As soon as there is a lot of money involved it will attract shady businesses as well, that is part of the game and can't be avoided unfortunately. Just look at the stock market which has been around for such a long time and even with all the regulation today there is still bad things happening. I wouldn't worry too much about it, as long as the government is not banning crypto currencies we are fine. Pension funds are very serious business because people spend 30-40 years saving money and don't want to lose it in the end. In my country there are hard caps on how much a company can invest in stocks, the main focus is usually bonds to make sure that there is a lot of security in the funds. Also Canada and US are very similar countries as they share such a large boarder, nothing wrong with having similar laws. I think we should be happy that we can at least save some of our retirement money in crytpos.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Die_empty",
      "created_time": "April 01, 2023, 10:32:20 AM",
      "body": "Quote from: The Sceptical Chymist on March 29, 2023, 12:08:27 PMI don't think this is a bad idea at all, and I don't think the Canadian government is being biased against crypto in this case.  Because of crypto's volatility alone, there ought to be some kind of warning for people who might unwittingly invest in a fund that holds crypto as part of its portfolio.  At least Canada hasn't banned state-sponsored pension funds from investing in crypto altogether.  That would be a lot more discouraging IMO.I also think this policy will be helpful to the Canadian pension sector. Last year two major Canadian pension managers were forced to write off their crypto investments. The Caisse de Depot et Placement du Quebec lost about US$150 million stake in Celsius Network LLC. While Ontario Teachers’ Pension had to write down its stakes in Bankman-Fried’s FTX to zero after  losing US$95-million. Pension fund managers should invest in areas that are less volatile because the pension funds should be handled carefully because some pensioners are very fragile and might not be able to withstand the shock that might arise due to loss of funds.https://financialpost.com/fp-finance/ontario-teachers-writes-off-ftx-stake-taking-95-million-loss/wcm/fd896f13-f0dd-4cc5-9e4e-479ca2d8b2c6/amp/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "HedgeFx",
      "created_time": "April 01, 2023, 10:36:16 AM",
      "body": "Quote from: Yamane_Keto on March 29, 2023, 04:24:53 AMWhy have so many governments become so serious about crypto investments? It all started in the United States and is now in Canada.Is it all because of FTX?Governments do this because they fear that there will be a flight of capital from the financial system in favor of the world of cryptocurrencies. If this happened, the financial system would go into crisis.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zasad@",
      "created_time": "April 01, 2023, 02:46:54 PM",
      "body": "If pension funds could buy bitcoins and ethereum, they would not suffer such losses.Most of the funds that were allowed to invest in played a very risky game and went bankrupt. The managers of these funds have earned very well and are not criminally liable for losses. The best fund is to buy cryptocurrencies and store on a cold or hardware wallet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LeGaulois",
      "created_time": "April 02, 2023, 12:41:07 PM",
      "body": "Cryptocurrencies are not really what the Canadian's government is worry about. But rather what generally speaking the Pension Funds do with the money. Remember that we are talking about money for the retirements of the citizens.Imagine yourself Canadian, you have contributed for years to the system in order to receive a pension years later. And once you get old, they say \"sorry we can't pay you your pension because we have invested it in something not really safe.\"This kind of investment, with the people's money, should be invested in a low risk market. And not like a 20 year old who can afford to take more risk in his investment portfolio. And perhaps I should say, the funds shouldn't be invested somewhere because it's not the goal of the pension funds to make a profitI had watched a documentary on pension funds in Canada. And they are known for investing people's money in markets that are really questionable from a risk point of view.As the news say, the goal is \"To help protect Canadians’ retirements\" but that's about everything, not only the numbers about their crypto-asset exposuresFrom a politic point of view, if I was a citizen there, I would be happy to know where is MY money and is it in a safe place.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zasad@",
      "created_time": "April 02, 2023, 04:36:55 PM",
      "body": "Quote from: LeGaulois on April 02, 2023, 12:41:07 PMThis kind of investment, with the people's money, should be invested in a low risk market. And not like a 20 year old who can afford to take more risk in his investment portfolio. And perhaps I should say, the funds shouldn't be invested somewhere because it's not the goal of the pension funds to make a profitSo it might be better to ban commercial pension funds. There were no commercial pension funds in the Soviet Union, there was only one state pension fund, and not a single pensioner lost his pension. In Russia, banks and funds are now prohibited from investing in cryptocurrency companies. It is enough to ban these investments until the market is ready for it. In 3-5 years I think there will be more favorable conditions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}