{
  "id": "topic_5449608",
  "title": "Julien_Olynpic",
  "author": "Julien_Olynpic",
  "created_time": "April 20, 2023, 05:34:12 PM",
  "content": "Согласно обзору исследовательской компании DDA, происходит рост чила верифицированных пользователей-холдеров биткойна. Тенденция, как по мне, довольно парадоксальная. Как говорится, за что боролись поколения криптанов и шифропанков, на то и напоролись. Это говорит о том, что на определённом этапе адопшена, в орбиту крипты будут втягиваться такие слои человеко-массы, которым будет всё равно на базовую анонимность. Ну и косвенно это говорит о том, что биток начинает восприниматься неким мейнстримовским направлением финансов, которое немыслимо без верификации. https://deutschedigitalassets.com/wp-content/uploads/2023/04/Cryptoasset-Adoption-Volatility.pdf_________________________",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5449608",
  "comments": [
    {
      "author": "BVeyron",
      "created_time": "April 20, 2023, 06:58:40 PM",
      "body": "Quote from: Julien_Olynpic on April 20, 2023, 05:34:12 PMСогласно обзору исследовательской компании DDA, происходит рост чила верифицированных пользователей-холдеров биткойна. Тенденция, как по мне, довольно парадоксальная. Как говорится, за что боролись поколения криптанов и шифропанков, на то и напоролись. Это говорит о том, что на определённом этапе адопшена, в орбиту крипты будут втягиваться такие слои человеко-массы, которым будет всё равно на базовую анонимность. Ну и косвенно это говорит о том, что биток начинает восприниматься неким мейнстримовским направлением финансов, которое немыслимо без верификации. Вообще то это сильно подпортит  всю задумку биткоина, как анонимной валюты.Повсеместный KYC в криптовалютах постепенно  стал уже обычным делом, а когда я начинал пользоваться криптой, вообще и речи не было ни о каких верификациях.Это все означает, что долларовые киты просто начнут становиться китами и в биткоинах.Плюс к ним добавится овсем немного первых инвесторов биткоина  которые тоже будут китами, да они и сейчас уже киты.И финансовая система сожрёт всю криптосистему на корню, и это печально. У человечества ведь был шанс хоть как то подравнять уровни жизни за счёт криптовалют.Но он считайте уже упущен.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Smartprofit",
      "created_time": "April 20, 2023, 06:59:28 PM",
      "body": "Я уже высказывал предположение, к чему мы придем.Отсутствие анонимности и конфиденциальности, в сочетании с прозрачным блокчейном, жёстко ограниченным количеством монет, децентрализацией и всемирной известностью и признанностью актива ведёт нас в одном направлении.Скорее всего, в будущем bitcoin станет резервным активом. Никто не будет скрывать, что он владеет биткоином, потому что владельцы биткоина будут невероятно могущественными организациями. Владеть биткоином будут Центральные Банки всех государств, крупные промышленные и it-компании, а также отдельные частные лица (уровня Илона Маска).Bitcoin, не будет использоваться как платёжное средство, его транзакции будут очень редки. Он будет использоваться почти исключительно как резервный актив.Владение биткоином даст право создавать все другие цифровые активы, в том числе цифровые права на реальные активы нашей планеты.А анонимность и конфиденциальность сохранить скорее всего не удастся.Для этих целей есть другие активы, например, Монеро.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Julien_Olynpic",
      "created_time": "April 21, 2023, 02:37:39 AM",
      "body": "QuoteВладение биткоином даст право создавать все другие цифровые активы, в том числе цифровые права на реальные активы нашей планеты.А анонимность и конфиденциальность сохранить скорее всего не удастся.Для этих целей есть другие активы, например, Монеро.Насчёт Монеро, пожалуй, соглашусь, хотя и помимо него есть много неплохих анонимных монет.Касаемо битка как резервного актива - я уже писал, что он плоховато на эту функцию подходит из-за падения ликвидности. К примеру, все его торги на так называемых индексных биржах к тру-доллару (например, на Битстампе) демонстрируют то, что объёмы торгов неуклонно снижаются, начиная аж с 2016-го года. И в целом на биржах битков всё меньше. Рост торгов происходит только в парах со стейблами - на Бинансе, например. Крупные государства, которые будут держать большие доли битка на балансе в роли резервной валюты могут столкнуться с ловушкой ликвидности - когда у тебя на балансе есть актив, формально он торгуется по высоким ценам, но по этим ценам ты его физически продать не сможешь тупо из-за того, что нет контрагентов на биржах, готовых купить у тебя актив по таким ценам и, главное, В ТАКОМ ОБЪЁМЕ. Слишком много битка находится в холде. И это будет только расти.Поэтому биток будет интересен только мелким и средне-крупным игрокам со временем.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "witcher_sense",
      "created_time": "April 21, 2023, 05:04:07 AM",
      "body": "Насколько я понял из этой исследовательской публикации, это число включает не только холдеров Биткоина, а вообще всех пользователей криптовалют, так или иначе прошедших верификацию на бирже. По их подсчетам, число верифицированных пользователей составляет 420 миллиона человек, а общее количество составляет 650 миллионов. То есть более 64% криптоюзеров уже засветили свои документы и часть из них совсем не скрывает сколько крипты есть в наличии. Соглашусь, что это будет прекрасным подарком для правительства, если они вдруг решат немного подзакрутить гайки в криптоиндустрии. Они знают на кого давить, у кого конфисковывать, с кого сдирать непомерные налоги за хранение криптовалюты. Ну а вообще, я бы не стал безоговорочно доверять этой статистике, так как многие пользователи используют анонимные способы приобретения крипты, некоторые совмещают трейдинг и холдинг (то есть часть крипты приобретается не на бирже и часть крипты используется для торговли, то есть таких пользователей могут подсчитать сразу за нескольких), другие прошли KYC, но пожалели об этом и теперь скрывают активность. Мой вывод такой: большинство пользователей все еще воспринимает крипту не как средство расчета или сбережения, а как спекулятивный актив и легкий спрсоб заработать денег. Поэтому они не особо заботяться об анонимности, они думают, что это явление временное и раскрывать свою личность поэтому безопасно. Но если вдруг окажется, что крипта это нечто большее чем просто предмет спекуляций, то многие пользователи пострадают от предследований сторонников традиционной финансовой системы.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Smartprofit",
      "created_time": "April 21, 2023, 07:19:00 AM",
      "body": "На мой взгляд, в качестве резервного актива Биткоину вообще не будет нужна ликвидность - его никто не будет продавать, только в случае крайней нужды.Ценно будет именно владение Биткоином, причём именно демонстрационное владение. А в обороте будут совсем другие активы.И если так будет (а при этом Биткоином будут владеть и государства напрямую), то проблем с ликвидностью как раз не возникнет. CBDC любой страны вы на Биткоин  легко приобретёте. Вопрос - зачем? Если само наличие Биткоина на вашем балансе повышает ценность ваших собственных CBDC и других цифровых активов.Чем дольше существует Биткоин, тем больше его ценность. С введением CBDC, даже классический доллар США уже исчезнет. У Биткоина есть шансы очень скоро стать самым древним финансовым активом (как это не парадоксально сейчас звучит).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jokers10",
      "created_time": "April 21, 2023, 11:52:22 AM",
      "body": "Очень плохой симптом. Верификация в банковской сфере компенсируется полной закрытостью самой системы платежей: да, где угодно можно видеть небольшие утечки тех или иных персональных данных, но довольно сложно с их помощью увидеть движения средств и банковские счета. В биткойне ситуация обратная: каждый может увидеть все движения и накопления, и для этого и нужна обезличенность адресов и транзакций. Когда жадные до контроля правительства требует кусей для биткойна, они чудовищным образом снижают уровень безопасности владельцев биткойнов. Понятно, что им всё равно, но хорошо бы те, кого это коснётся, задумывались о том, что анонимность им помогает не столько скрывать что-то от государств, сколько от соседей, чтобы не провоцировать у тех нехорошие мысли.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Altryist",
      "created_time": "April 21, 2023, 05:23:10 PM",
      "body": "Quote from: jokers10 on April 21, 2023, 11:52:22 AMКогда жадные до контроля правительства требует кусей для биткойна, они чудовищным образом снижают уровень безопасности владельцев биткойнов. Понятно, что им всё равно, но хорошо бы те, кого это коснётся, задумывались о том, что анонимность им помогает не столько скрывать что-то от государств, сколько от соседей, чтобы не провоцировать у тех нехорошие мысли. Беспокоится об этом они не хотят, у них же есть правоохранительные органы, которые должны обеспечивать порядок, тут все идет так что сначала делаем - потом думаем. Вместо этого регуляторы зажимают всем гайки и приходится соглашаться на кус, чтобы иметь возможность работать. Тут даже больше не в соседях дело, а в нехороших людях, к которым может попасть эта база и которые будут знать куда идти и за чем они пришли.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Julien_Olynpic",
      "created_time": "April 22, 2023, 04:56:18 AM",
      "body": "Quote from: Altryist on April 21, 2023, 05:23:10 PMQuote from: jokers10 on April 21, 2023, 11:52:22 AMКогда жадные до контроля правительства требует кусей для биткойна, они чудовищным образом снижают уровень безопасности владельцев биткойнов. Понятно, что им всё равно, но хорошо бы те, кого это коснётся, задумывались о том, что анонимность им помогает не столько скрывать что-то от государств, сколько от соседей, чтобы не провоцировать у тех нехорошие мысли. Беспокоится об этом они не хотят, у них же есть правоохранительные органы, которые должны обеспечивать порядок, тут все идет так что сначала делаем - потом думаем. Вместо этого регуляторы зажимают всем гайки и приходится соглашаться на кус, чтобы иметь возможность работать. Тут даже больше не в соседях дело, а в нехороших людях, к которым может попасть эта база и которые будут знать куда идти и за чем они пришли. Могу сказать, что часто требование КУСя и объём личной информации, затребованной в рамках процедуры верификации явно избыточный по сравнению с с простым здравым смыслом. Самое же интересное, что в  требовании всё больше личной информации о платежах нет никакой необходимости. Как во многих банковских картах, например. Есть уровни верификации. Но даже самый нижний уровень требует предоставить от вас такое количество инфы (ФИО, адрес жительства, телефон), по которой о вас всё можно выяснить внутри одного оперативно-разыскного расследования при необходимости.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "satscraper",
      "created_time": "April 22, 2023, 09:02:44 AMLast edit: April 22, 2023, 09:45:57 AM by satscraper",
      "body": "Биткойн не задумывался быть анонимным, поэтому в его протоколе нет механизма, который бы делал его таковым.Сатоши задумал его как средство для избавления от посредников (в лице банков или подобных им финансовых институтов) в операциях между отправителем и получателем. С этим биткойн справляется.Думаю, что высказываемое  недовольство  КИСом связано  с озабоченностью по поводу  необходимости уплаты налогов.Игра \"заработай и отдай часть заработанного\" продолжается с момента появления государства и на 99,[99]% уверен что холдеры крипты не смогут её отменить. Но побороться за правила этой игры в их силах, если масса холдеров биткоина станет превалирующей над остальной массой. Пока до этого далеко.Пока нет единых правил этой игры , устанавливаемых  разными государствами. Например в Германии всё еще действует закон, согласно которому налог с прибыли получаемой от продажи крипты равен нулю, если с момента приобретения этой крипты прошло не меньше одного года. Чтобы воспользоваться этим законом нужно доказать  своё право на проданную крипту. Без КИС этого сделать невозможно.Поэтому у держателей крипты две опции - или \"пройти КИС, спать спокойно и платить налог\" или \"перейти в лагерь налогонеплательщиков\". Не знаю как в других государствах, но в Евросоюзе приняты драконовские штрафы за неуплату налогов , поэтому большинство выбирают опцию спать спокойно. С этим повидимому и связан наблюдаемый рост числа верифицированных биткойн-холдеров.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jokers10",
      "created_time": "April 22, 2023, 09:44:26 AM",
      "body": "Quote from: satscraper on April 22, 2023, 09:02:44 AM...Думаю, что высказываемое  недовольство  КИСом связано  с озабоченностью по поводу  необходимости уплаты налогов....Есть наличные, которыми можно оперировать в значительной мере обезличенно по отношению к государству, однако с операций наличными прекрасно уплачиваются налоги. Так что упрощение взгляда на анонимность к простому уклонению от уплаты налогов выглядит надуманным. Анонимность нужна для безопасности. Государство имеет значительные возможности для отслеживания и определения денежных потоков, так что прятать существенные доходы от него довольно бессмысленно и чревато, а вот от потенциальных недоброжелателей, которые могут запросто скупать разнообразные базы данных с полными выкладками, я бы предпочёл скрыть как можно больше, даже при отсутствии у меня чего-либо. Потому как сложно доподлинно предположить, что и когда злоумышленники задумают использовать, что может сильно осложнить мою жизнь.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "satscraper",
      "created_time": "April 22, 2023, 09:52:37 AM",
      "body": "Quote from: jokers10 on April 22, 2023, 09:44:26 AMQuote from: satscraper on April 22, 2023, 09:02:44 AM...Думаю, что высказываемое  недовольство  КИСом связано  с озабоченностью по поводу  необходимости уплаты налогов....Есть наличные, которыми можно оперировать в значительной мере обезличенно по отношению к государству, В Евросоюзе отслеживается сколько вы заработали за год. Если заработанное превышает определённую сумму - заплати налог, и неважно проводите ли вы операции наличными, держите заработанное на банковских счетах или держите обезличенные наличные в матрасе.За серые схемы тут драконовские штрафы, которые применятся к обеим сторонам таких схем. Даже найти человека, который бы согласился бы за наличку установить тебе смеситель в ванной, это большая  проблема. Приходит мастер, предлагаешь ему наличку, а он в ответ сует тебе свой IBAN. Думаю обезличенно по отношению к государству оперируют в основном в нецивилизованных странах.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jokers10",
      "created_time": "April 22, 2023, 09:58:43 AM",
      "body": "Quote from: satscraper on April 22, 2023, 09:52:37 AMВ Евросоюзе отслеживается сколько вы заработали за год. Если заработанное превышает определённую сумму - заплати налог, и неважно проводите ли вы операции наличными, держите заработанное на банковских счетах или держите обезличенные наличные в матрасе.Инспектор ходит за мной лично и смотрит за каждой банкнотой, которую я получаю в руки? Вы же апеллируете к недобросовестным практикам, а не к добросовестному декларированию доходов. А незадекларированные наличные в качестве дохода каким образом планируется отслеживать, если не класть их в банк и не расплачиваться с паспортом? По кофейной гуще или рунам на костях?А если наличные задекларированы, то точно так же можно декларировать и доходы в крипте, никакой кусь для этого не обязателен.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "satscraper",
      "created_time": "April 22, 2023, 10:01:32 AMLast edit: April 22, 2023, 10:44:12 AM by satscraper",
      "body": "Quote from: jokers10 on April 22, 2023, 09:58:43 AMИнспектор ходит за мной лично и смотрит за каждой банкнотой, которую я получаю в руки? Нет, смотрят на ваши банковские счета. В руки банкноты редко кто соглашается принимать. Quote from: jokers10 on April 22, 2023, 09:58:43 AMможно декларировать и доходы в крипте, никакой кусь для этого не обязателен.Я задекларировал доход в виде продажи крипты которую я холдил в течении года и хочу заплатить зависящий от источника дохода % согласно действующему законодательству. Каким образом без КИС доказать что проданная крипта принадлежит мне и доход получен от её продажи, а не из других источников? Декларация без возможности подтвердить задекларированное чревата здесь огромными штрафами. Фининспектор может нагрянуть к вам и через 10 лет.Можно конечно сохранять все чеки с криптоматов, что я и делаю, но всё равно на конечном этапе доказательства с помощью этих чеков будет КИС.Пользоваться такими инструментами как Wirex без КИСа вообще нельзя. Вам просто счёт не откроют.Quote from: jokers10 on April 22, 2023, 09:44:26 AM злоумышленники задумают использовать, что может сильно осложнить мою жизнь.злоумышленникам достаточно посмотреть на вас и ваш образ жизни, чтобы определить достойны ли вы их внимания. Их не интересует источник ваших доходов.  В этом отношении страхи по поводу КИС преувеличены.Давайте не уходить в офтоп. Я высказывал своё мнение о том, почему произошёл рост числа  биткойн-холдеров, прошедших КИС.Если у вас есть своё мнение на этот счёт, пожалуйста высказывайте.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Julien_Olynpic",
      "created_time": "April 23, 2023, 05:00:19 AM",
      "body": "QuoteЯ задекларировал доход в виде продажи крипты которую я холдил в течении года и хочу заплатить зависящий от источника дохода % согласно действующему законодательству. Каким образом без КИС доказать что проданная крипта принадлежит мне и доход получен от её продажи, а не из других источников?Насколько я понимаю, твоя позиция по поводу КУС заключается в том, что КУС позволяет доказать, что :1. Проданная крипта принадлежит (принадлежала) тебе2. Доход получен от её продажи.Тут, кстати, государство тихой сапой нарушило закон о презумпции невиновности. То есть это мы ему должны доказывать, что не преступники, а не оно доказывать нашу вину. То есть оно по умолчанию считает нас преступниками.Государство легко может установить факт связи твоего адреса с фиатом после обмена. Если ты ему будешь интересен. В большинстве случаев можно с обменников инфу собрать. Или с биржи. Отследить цепочку. Но государства обычно ленивые, они хотят, чтобы ты сам им доказывал, что ты не преступник.  А они ещё подумаю, принимать твои налоги или нет).Даже если ты докажешь государству, что некий криптоадрес твой или был твоим ( и ты купил \"честно\"), то могут при желании поднять вопрос - а каково происхождение средств у того, у кого ты купил? Тот точно наркотой не торговал и терроризм не спонсировал?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "satscraper",
      "created_time": "April 23, 2023, 06:37:34 AMLast edit: April 23, 2023, 06:54:16 AM by satscraper",
      "body": "Quote from: Julien_Olynpic on April 23, 2023, 05:00:19 AMQuoteЯ задекларировал доход в виде продажи крипты которую я холдил в течении года и хочу заплатить зависящий от источника дохода % согласно действующему законодательству. Каким образом без КИС доказать что проданная крипта принадлежит мне и доход получен от её продажи, а не из других источников?Насколько я понимаю, твоя позиция по поводу КУС заключается в том, что КУС позволяет доказать, что :1. Проданная крипта принадлежит (принадлежала) тебе2. Доход получен от её продажи. На данный момент так оно и есть. Но если правила игры, навязанные государством, изменятся, моя позиция изменится, чтобы соответствовать этим правилам. Я предпочитаю использовать крипту для своего блага, а не бороться с ветрянными мельницами ради фантома анонимности.На 99,[99] процентов уверен ,что в современном мире дааже если  родиться из пробирки где-то в глубокой пещере и не вылазить из неё , то нет никакой уверенности , что тебя в какой-то момент не обнаружат. Поэтомубудет  более продуктивным для меня вылезти из пещеры и жить полноценной жизнью.Quote from: Julien_Olynpic on April 23, 2023, 05:00:19 AMДаже если ты докажешь государству, что некий криптоадрес твой или был твоим ( и ты купил \"честно\"), то могут при желании поднять вопрос - а каково происхождение средств у того, у кого ты купил? Тот точно наркотой не торговал и терроризм не спонсировал? Это относится не только к крипте. Доказывать приходится  происхождение любых имеющихся у тебя средств, не содержащихся в персональном файле, заведенном на тебя государством.Таковы правила игры, в которую мы играем.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Smartprofit",
      "created_time": "April 23, 2023, 07:25:41 AM",
      "body": "Да, это нормальная позиция, пока государство не объявило вам войну. А это тоже возможно, если к примеру посмотреть на ситуацию с коронавирусом Covid -19, когда природные базовые права человека нарушались в массовом порядке.Но сейчас, конечно, Европа это такой оазис, окружённый дикими варварами. По крайней мере, я думаю так европейцы воспринимают окружающий мир. В оазисе все соблюдают правила и в принципе в обмен на это гарантируются высокие стандарты жизни. Это вполне нормальный расклад - единственное , бедный Биткоин от этого страдает, так как транзакции они же не знают границ, а тут их часть деанонимирована ...Но опасения тех, кто не любит KYC действительно не связаны с уплатой или неуплатой налогов. Тут совсем другие опасения.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BVeyron",
      "created_time": "April 23, 2023, 07:28:15 AMLast edit: April 23, 2023, 08:00:34 AM by BVeyron",
      "body": "А вот как интересно обстоит дело с кусем  в такой интересной стране, как Сальвадор.Вот приехал чел в эту страну с десятком кошельков набитыми биткоинами. И начал там за все платить битками, они же там легализованы. Пьёт кофе по LN, ездит в такси, купил недвижимость на пляже, наконец купил гражданство ....все за битки.  Неужели кто то там придумает шерстить его на происхождение битков. Проверили AML программкой своей, чиновники местные, когда недвижимость и гражданство покупал,  да и нормально все.И что, кому он там будет дальше отчитываться кусем за какие то свои расходы. Он же баксы вообще в упор не видел и не имел. Одни битки везде.Интересная страна.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "light_warrior",
      "created_time": "April 23, 2023, 09:04:50 AM",
      "body": "Quote from: BVeyron on April 23, 2023, 07:28:15 AMА вот как интересно обстоит дело с кусем  в такой интересной стране, как Сальвадор.Вот если бы ты задал свой вопрос где положено то там и нашел бы ответ на свой вопрос. У нас же есть тема про Сальвадору в этом же разделе и совсем рядом с этой темой. Я не поленился и нашел там примерный ответ. я дума что это то о чем ты спрашиваешь.https://bitcointalk.org/index.php?topic=5358676.msg57922113#msg57922113https://bitcointalk.org/index.php?topic=5358676.msg57925534#msg57925534",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BVeyron",
      "created_time": "April 23, 2023, 09:37:52 AMLast edit: April 23, 2023, 09:56:03 AM by BVeyron",
      "body": "Quote from: light_warrior on April 23, 2023, 09:04:50 AMQuote from: BVeyron on April 23, 2023, 07:28:15 AMА вот как интересно обстоит дело с кусем  в такой интересной стране, как Сальвадор.Вот если бы ты задал свой вопрос где положено то там и нашел бы ответ на свой вопрос. У нас же есть тема про Сальвадору в этом же разделе и совсем рядом с этой темой. Я не поленился и нашел там примерный ответ. я дума что это то о чем ты спрашиваешь.https://bitcointalk.org/index.php?topic=5358676.msg57922113#msg57922113https://bitcointalk.org/index.php?topic=5358676.msg57925534#msg57925534А, ну да, точно, я и не заметил, что там можно почитать.  Но чисто теоретически я ж говорил о необходимости кусей для биткойнеров.Так похоже не имеется никаких кусей хоть где то на земле, вот в том же Сальвадоре.И это хорошо, если так, а может и совсем не так, хрен его знает? А Европа и остальной золотой миллиард погрязли в тотальном контроле. Куси они тоже из этой",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}