{
  "id": "topic_5459913",
  "title": "alastantiger",
  "author": "alastantiger",
  "created_time": "July 15, 2023, 02:10:17 PM",
  "content": "I have heard the advice that you should only use money you can afford to lose for gambling. I say that this is more theoretical than practical. Literally no one has money that they can afford to lose. I feel that money for gambling is a matter of opportunity cost. You either use the money for gambling or use it to meet a need. If using money one can afford to lose were practical there will be no need for articles on having a gambling budget or bank roll management. Hey gamblers my question is to you now is, the money you currently plan to use for gambling is it money that you can afford to lose?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5459913",
  "comments": [
    {
      "author": "robelneo",
      "created_time": "July 15, 2023, 02:18:39 PM",
      "body": "Quote from: alastantiger on July 15, 2023, 02:10:17 PMHey gamblers my question is to you now is, the money you currently plan to use for gambling is it money that you can afford to lose?For me yes because you understand that you cannot beat the house if you say no then you have this idea that you can beat the house and you will be disappointed if the outcome is not what you expect when you say you can afford to lose, it's not that you're giving it away you're still taking a chance and at the same time have fun, it's that you will still feel good when you log out because there's no pressure losing that money.There is a cost to be entertained on a platform like gambling.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mu_enrico",
      "created_time": "July 15, 2023, 02:23:42 PM",
      "body": "\"Money you can afford to lose\" is a figure of speech, meaning money that isn't used for important stuff, including paying bills and groceries. No one wants to lose money, but when you drop a penny on the street, you might not want to pick it up and walk away. Some people also toss it in a pool or something to pray for a miracle. It's similar to gambling when let's say your income is $1000 a month, then $25 for gambling isn't much, and when you lose you'll feel not as devastated as people who bet their life savings. Sure you'll feel sad, but if you play for fun, it goes away quickly.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "swogerino",
      "created_time": "July 15, 2023, 02:24:32 PM",
      "body": "Quote from: alastantiger on July 15, 2023, 02:10:17 PMI have heard the advice that you should only use money you can afford to lose for gambling. I say that this is more theoretical than practical. Literally no one has money that they can afford to lose. I feel that money for gambling is a matter of opportunity cost. You either use the money for gambling or use it to meet a need. If using money one can afford to lose were practical there will be no need for articles on having a gambling budget or bank roll management. Hey gamblers my question is to you now is, the money you currently plan to use for gambling is it money that you can afford to lose?Yes it is money that I can afford to lose as once I get my payroll I allocate money to each of my spending needs,electricity and water bills,internet bill,basic food for 1-2 weeks twice in a month,money for drinking coffee during afternoons,some little money to buy a few toys to my daughter and whatever is left I play some amount of it,not all the amount to play gambling,I can afford to lose that money as it does not cost me anything except that if I don't play it I would start saving more money than I am already doing.However I need some form of entertainment too and that is to gamble for me.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oshosondy",
      "created_time": "July 15, 2023, 02:25:46 PM",
      "body": "Quote from: alastantiger on July 15, 2023, 02:10:17 PMHey gamblers my question is to you now is, the money you currently plan to use for gambling is it money that you can afford to lose?Yes and I go go beyong the amount. If you do not want to let gambling to discipline you, you have to discipline yourself and gamble responsibly. The only way to a responsible gambling is for you to set a small percentage of your weekly income to use to gamble. I use 5%bor less and I am not going beyond it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Stepstowealth",
      "created_time": "July 15, 2023, 02:26:21 PM",
      "body": "Quote from: alastantiger on July 15, 2023, 02:10:17 PM Hey gamblers my question is to you now is, the money you currently plan to use for gambling is it money that you can afford to lose?Things are getting tough economically, there is barely money that someone can throw in the wind unless they have an excess of it. I think what is often meant by using free money is that you should not gamble with the money that you have budgeted. There is really no free money that you will like to loose, but free money refers to the money that you have not planned any use for, that is after you have settled all other things that you need, and loosing that money will not affect negatively how you will live for that time until you get another money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Johnyz",
      "created_time": "July 15, 2023, 02:32:54 PM",
      "body": "Quote from: alastantiger on July 15, 2023, 02:10:17 PMHey gamblers my question is to you now is, the money you currently plan to use for gambling is it money that you can afford to lose?Have to disagree on this one, the moment you set-aside a budget for gambling that's an indication that you are ready to lose that money because gambling is not a guaranteed way to make profit, and yes you should gamble only with the money you can afford to lose.This is not theoretical, its more of a practical way of being a gambling and this can also mean a responsible gambling. Imagine, you are using emergency funds in gambling just because of a hope of making it double, that could be risky.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "_act_",
      "created_time": "July 15, 2023, 02:36:30 PM",
      "body": "Quote from: Stepstowealth on July 15, 2023, 02:26:21 PMThings are getting tough economically, there is barely money that someone can throw in the wind unless they have an excess of it. I think what is often meant by using free money is that you should not gamble with the money that you have budgeted. There is really no free money that you will like to loose, but free money refers to the money that you have not planned any use for, that is after you have settled all other things that you need, and loosing that money will not affect negatively how you will live for that time until you get another money.I will agree if you put savings as part of the budget. If yu do not, do not gamble with the amount of money that you can not afford to lose can go beyond your budget. In life, you need to have savings too. What you can afford to lose is when you have excess that you have nothing to do with it and can be part of your savings too, but you can use some from it to gamble. But what most people regard as it is when you use the money that can not affect your financial life to gamble.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "maydna",
      "created_time": "July 15, 2023, 02:55:26 PM",
      "body": "Yes, that is an amount I can afford to lose. I can't afford to lose more than that amount of money, so I try to stay within my limits regarding gambling. And I also try not to complain if my gambling budget runs out at the gaming tables because that's what I can afford. Like other people, I try to enjoy my gambling time, so whatever happens, whether winning or losing, I just try to enjoy it. That is advice that many people recommend, so before gambling, we must limit the amount of money we can use to gamble. Don't try to exceed that limit or you might regret it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gozie51",
      "created_time": "July 15, 2023, 02:56:07 PM",
      "body": "Quote from: alastantiger on July 15, 2023, 02:10:17 PMI have heard the advice that you should only use money you can afford to lose for gambling. I say that this is more theoretical than practical. Literally no one has money that they can afford to lose.Money that you can afford to lose is simply the money that you may have budgeted for gambling. A gambler knows that gambling involves luck and with high risk tendency for losing. So a gambler understand he could lose that part of the money he is using for gambling therefore if he loses that should not cause him a financial handicap or injury to make him go begging or put him in debt. That is why such phrase is always used in gambling palace.Quote from: alastantiger on July 15, 2023, 02:10:17 PMHey gamblers my question is to you now is, the money you currently plan to use for gambling is it money that you can afford to lose?That is the case as it is the proper thing to do. A gambler should make a budget of how much of his income he wants to risk at the time he is playing. That is financial propriety and to avoid regrets, it is a wiser gambling decision.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptoHeadlineNews",
      "created_time": "July 15, 2023, 03:04:33 PM",
      "body": "Quote from: alastantiger on July 15, 2023, 02:10:17 PMI have heard the advice that you should only use money you can afford to lose for gambling. I say that this is more theoretical than practical. Literally no one has money that they can afford to lose. I feel that money for gambling is a matter of opportunity cost. You either use the money for gambling or use it to meet a need. If using money one can afford to lose were practical there will be no need for articles on having a gambling budget or bank roll management. Hey gamblers my question is to you now is, the money you currently plan to use for gambling is it money that you can afford to lose?When people say \"use the money you can afford to lose for gambling\", it simply implies they are saying you should be use an amount you could afford to risk (i.e even if you happen the lose it all you won't feel it that much), of which everybody had a particular amount of money they can afford to risk at all times.Example:Let's assume a forum member \"Y\" has a monthly salary of $10,000, while a forum member \"X\" has a monthly salary $1000, and both are invited to gamble at a casino, and \"Mr.Y\" happens to stake $1000 on a single game (i.e 10% of his monthly salary), you literally don't expect \"Mr.X\" to stake same $1000 on a game (i.e 100% of his monthly salary) because by doing so he will be putting his entire money at risk, so on that note, what Mr.X will be able to stake is $100, which is 10% of his monthly salary, and an amount he could to risk. But note that what people could afford to risk varies from one individual to the other.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blockman",
      "created_time": "July 15, 2023, 03:11:31 PM",
      "body": "Quote from: alastantiger on July 15, 2023, 02:10:17 PMLiterally no one has money that they can afford to lose. Maybe that's what you think but in reality, there are people that have money that they can afford to lose and that's what gambling is for them. They've got money ready to lose.Quote from: alastantiger on July 15, 2023, 02:10:17 PMHey gamblers my question is to you now is, the money you currently plan to use for gambling is it money that you can afford to lose?Yes.I gamble with an amount that I can afford to lose. It's like a money ready to be spent for gambling and no matter what the results, you're on it and there will be no hard feelings when the results didn't go accordingly.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ondekinecakabilirim",
      "created_time": "July 15, 2023, 03:11:50 PM",
      "body": "I think you're making a fair and strong criticism. What money can we afford to lose? I don't want to give a sophisticated answer. But I think the answer to this question varies from person to person. To me, the money I'm willing to lose is the amount I can spend while drinking at the bar after work. I go out to have fun with my friends a few times a week. If I reduce this number, I can spend the money I would spend at the bar on a few match bets. I realize I don't actually have a very good explanation. But I think I have as reasonable an explanation as possible. As a result, I prefer to gamble only for some adrenaline. That's why I continue to act knowing my limits and never exceed my limits.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zlantann",
      "created_time": "July 15, 2023, 03:38:52 PM",
      "body": "Quote from: alastantiger on July 15, 2023, 02:10:17 PMI have heard the advice that you should only use money you can afford to lose for gambling. I say that this is more theoretical than practical. Literally no one has money that they can afford to lose. I feel that money for gambling is a matter of opportunity cost. You either use the money for gambling or use it to meet a need. If using money one can afford to lose were practical there will be no need for articles on having a gambling budget or bank roll management. Hey gamblers my question is to you now is, the money you currently plan to use for gambling is it money that you can afford to lose?OP have you not heard stories where people lose money and commit suicide? Others have suffered from serious health issues because of losses. Some families have suffered from financial problems because money meant for upkeep has been lost to gambling. Nobody wants to lose even a penny in gambling but gambling what you can afford to lose means more than the literal words. It entails that you should only gamble with what will not affect your health, finance, family, and other activities negatively. Furthermore, it is staking the amount you can be able to bear if you lose. It is a slogan that guides us to gamble responsibly. Having a gambling budget serves as a plan that helps bettors to know their financial standings to prevent over gambling which can affect them negatively. So when someone says he is gambling with what he can afford to lose he simply means that he is gambling within his means.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dimonstration",
      "created_time": "July 15, 2023, 03:45:49 PM",
      "body": "Quote from: alastantiger on July 15, 2023, 02:10:17 PMI have heard the advice that you should only use money you can afford to lose for gambling. I say that this is more theoretical than practical. Literally no one has money that they can afford to lose. I feel that money for gambling is a matter of opportunity cost. You either use the money for gambling or use it to meet a need. If using money one can afford to lose were practical there will be no need for articles on having a gambling budget or bank roll management. Hey gamblers my question is to you now is, the money you currently plan to use for gambling is it money that you can afford to lose?You can afford to lose meaning you are still ok after losing it and not feeling nothing after you loss it since every money really count but there is a certain amount which players has tolerance to loss in proportion to their total bankroll.Let’s say you have 1M in your bank account. Will you be remorseful after losing 100$ on a game that you have a chance to grow it? You can move on easily since your total money in the bank is far huge and you can always play again using that same amount as many as you want compared when you loss 100K or more which will decrease significantly your total money. This is the meaning of play what you can afford to lose. Afford is the key word here.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coin-investor",
      "created_time": "July 15, 2023, 03:48:30 PM",
      "body": "I always advise all that they should only play with money that they can afford to lose, this is what we all believe and this is what we should be doing if we want to remain safe, this advice should not be questioned if you have expectations on money that you gamble then it's your decision but you will eventually find out that you can not beat the house and you should not expect to profit from gambling.Money for gambling can be considered an opportunity cost but you should not have high expectations, and it's more comfortable to think that the money you've used to gamble is something that you can easily part.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "leonair",
      "created_time": "July 15, 2023, 04:01:56 PM",
      "body": "Quote from: alastantiger on July 15, 2023, 02:10:17 PMI have heard the advice that you should only use money you can afford to lose for gambling. I say that this is more theoretical than practical. Literally no one has money that they can afford to lose. I feel that money for gambling is a matter of opportunity cost. You either use the money for gambling or use it to meet a need. If using money one can afford to lose were practical there will be no need for articles on having a gambling budget or bank roll management. Hey gamblers my question is to you now is, the money you currently plan to use for gambling is it money that you can afford to lose?There is a lot of similar advice in this forum so I don't think it is reasonable to create a new topic on this topic.  Because it is not something new that can benefit someone in a new way.  Although no such topic has been created, this is a common advice given to almost all gamblers. Gambling is something that helps one gain profit and also has the possibility of loss so every gambler must gamble with the amount he can afford.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "qwertyup23",
      "created_time": "July 15, 2023, 04:22:55 PM",
      "body": "Quote from: alastantiger on July 15, 2023, 02:10:17 PMI have heard the advice that you should only use money you can afford to lose for gambling. I say that this is more theoretical than practical. Literally no one has money that they can afford to lose. I feel that money for gambling is a matter of opportunity cost. You either use the money for gambling or use it to meet a need. If using money one can afford to lose were practical there will be no need for articles on having a gambling budget or bank roll management. Hey gamblers my question is to you now is, the money you currently plan to use for gambling is it money that you can afford to lose?Generally whenever I gamble, I always consider it as money loss on my part due to the nature of its circumstances. It is not about the money that I can afford to lose, but it is more of conditioning that every money that I enter in gambling is considered money lost.In conclusion, gambling is a game of chance where it does not guarantee any absolute form of profit. In return, you experience the adrenaline of knowing whether you double your money or lose more in the process, which is a trade-off in itself. If you really want to limit yourself in gambling, then you should only bring only a handful amount of money at your disposal.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Stalker22",
      "created_time": "July 15, 2023, 04:26:58 PM",
      "body": "Quote from: alastantiger on July 15, 2023, 02:10:17 PMLiterally no one has money that they can afford to lose. ~Nah, I gotta disagree. The money I allocate for gambling is essentially my entertainment budget. Whether I decide to spend it on gambling or any other form of amusement makes no difference. But let me clarify something. Just because I am okay with the possibility of losing that money, it does not mean I actually want to lose it. The thing is, gambling is enjoyable largely because of the thrill and excitement that comes with winning.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jating",
      "created_time": "July 15, 2023, 04:29:25 PM",
      "body": "Quote from: alastantiger on July 15, 2023, 02:10:17 PMI have heard the advice that you should only use money you can afford to lose for gambling. I say that this is more theoretical than practical. Literally no one has money that they can afford to lose. I feel that money for gambling is a matter of opportunity cost. You either use the money for gambling or use it to meet a need. If using money one can afford to lose were practical there will be no need for articles on having a gambling budget or bank roll management. Hey gamblers my question is to you now is, the money you currently plan to use for gambling is it money that you can afford to lose?Well if that is how you interpret it then so be it. It seems that you have your own reasons for that and so is gamblers around you. For them definitely the answer will be yes, but you can't just argue around here if you see it as more of theoretical than practical.As the saying goes \"to each his own\". May I ask if you are a gambler though?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}