{
  "id": "topic_5470716",
  "title": "Zoomic",
  "author": "Zoomic",
  "created_time": "October 17, 2023, 06:15:20 PM",
  "content": "I am not a campaign manager and neither have I promoted any project in the forum. I was just considering the best method to promote any project in future as far as BTT is concerned. If I have fund to choose either of the below methods to promote my project, which should I choose; Signature Campaign  Review Campaign Personally, I feel that review campaign brings more results to the project owners because the participants of the review campaign will surely use the project and there is the possibility than more than 30% of the campaign participants will continue to use the project if it is a good project. Whereas, we can say that upto 5% of signature campaign participants doesn't use the project they promote. This is not an effort to undermine signature campaign because it may have a better influence than review campaign outside the forum.I am not so certain about this, I will like to hear from project owners and campaign managers like Royse777 who often launch review campaigns.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5470716",
  "comments": [
    {
      "author": "_act_",
      "created_time": "October 17, 2023, 06:42:18 PM",
      "body": "If you want to let people to know your site like gambling site and also if you want them to continue to use your gambling site very well, you do not need a review campaign, just go for signature campaign. If you are able to pay for the signature campaign and able to satisfy your users, your gambling site will be used by people on this forum very well. If you have the money that you can spend on signature campaign, you can go for it. You can also go for review campaign if you want people on this forum to test your site for you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "noorman0",
      "created_time": "October 17, 2023, 06:50:18 PM",
      "body": "This depends on what the company wants to achieve with the campaign. Both have their respective functions. The signature campaign is of course for wider company visibility, such as advertising broadcasts on YouTube, this allows the signature to be displayed in all sections of the forum until the campaign contract ends. Meanwhile, review campaign is to build company's trust or reputation. Reviews will remain available forever except with the intervention of the thread owner and mods.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Stalker22",
      "created_time": "October 17, 2023, 07:56:49 PM",
      "body": "You are partially right. Review campaigns can bring more direct engagement because participants have to use the project. If its a good project, there is a good chance they will continue using it. But review campaigns are mostly short-term. They will attract a certain number of users who are interested in testing the service / product and writing a review. Signature campaigns, on the other hand, bring more visibility to the project, even outside the forum community. You are right that not all participants may use the project they promote, but that does not mean it cant attract users outside the circle of participants. I do not know where you got the information about 5%, but even if it is true, there is no doubt that signature campaigns are a good promotion for some projects, because they would not implement such a marketing campaign that has been going on for years.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitcoin_Arena",
      "created_time": "October 17, 2023, 09:41:58 PM",
      "body": "Both serve different purposesReview campaigns are usually put in place for the users to test on the functionality of the service, look out for the strong points and weak points about the service, and provide feedback on how the service can be improved. Reviews can be both positive and negative, so this in no way promotes a service. It's more like a way to improve the service.A signature Campaign on the other hand is advertisement for service and the exposure to potential customers goes way beyond the users in the forum (the target could also be guest users)So I don't know why you are making comparisons. The two are completely different, and a service can do both.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jossiel",
      "created_time": "October 17, 2023, 10:09:57 PM",
      "body": "Quote from: Bitcoin_Arena on October 17, 2023, 09:41:58 PMBoth serve different purposesI agree.While project owners know what they want, they know the purposes and uses of both campaigns. Signature campaigns are a way to increase the exposure of the project particularly on the forum which means is to give visibility just like the ads banner that we see in social medias and search engines. This target specific niche and people in the market.And as for the review campaigns, this gives the idea the potential customers about user experience. While OP is right that all of the reviewers are required to use the project or its platform but eventually, they'll stop because they're just after for the review.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "examplens",
      "created_time": "October 17, 2023, 10:13:33 PM",
      "body": "It isn't easy to compare two different types of campaigns and indeed they give different results. A signature campaign gives some kind of result only after a certain period and it can be considered as a long-term promotion. The ultimate goal of such campaigns is to create brand recognition.The basic purpose of the review campaign is for the owner to receive guaranteed feedback to further improve his service, and not exclusively to get new users.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AB de Royse777",
      "created_time": "October 17, 2023, 10:40:25 PM",
      "body": "Quote from: Zoomic on October 17, 2023, 06:15:20 PMI am not so certain about this, I will like to hear from project owners and campaign managers like Royse777 who often launch review campaigns.Thank you for giving me a chance to write a few words. I feel honored and grateful.A signature campaign is crucial for building brand reputation; it keeps the brand in front of the targeted audience all the time. Expecting immediate results from a signature campaign is unrealistic. It requires a long-term plan. The goal is to create a lasting impression in the audience's mind.Have you ever wondered why big and well-known brands like Coca Cola, McDonald's, Apple, Google, or Microsoft continue to spend billions on advertising? Despite their fame, why does it make sense for them to invest so much?It's because of a basic human tendency: if something is out of sight, it's out of mind. In the business world, on top of this, you have competitors. If you reduce your visibility to your audience, your competitors will take your place. Brands that understand this truth and recognize the value of advertising, ultimately they lead their industries.I hope the importance of a signature campaign is clearer to you now.A review campaign serves a different purpose. It's mainly about getting feedback on the product and improving its functionality and user-friendliness.Cheers,",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "robelneo",
      "created_time": "October 17, 2023, 10:55:47 PM",
      "body": "Quote from: Zoomic on October 17, 2023, 06:15:20 PMI am not a campaign manager and neither have I promoted any project in the forum. I was just considering the best method to promote any project in future as far as BTT is concerned. If I have fund to choose either of the below methods to promote my project, which should I choose; Signature Campaign  Review Campaign Personally, I feel that review campaign brings more results to the project owners because the participants of the review campaign will surely use the project and there is the possibility than more than 30% of the campaign participants will continue to use the project if it is a good project. Whereas, we can say that upto 5% of signature campaign participants doesn't use the project they promote. This is not an effort to undermine signature campaign because it may have a better influence than review campaign outside the forum.I am not so certain about this, I will like to hear from project owners and campaign managers like Royse777 who often launch review campaigns.Reviews bring results in a long-term, signature campaign immediate results, both have positive outcome on their brandSince Bitcointalk has a high page rank and with high level of authority on many keywords the reviews will show up on the internet based on the keywords used by the campaign and this is good for the overall reputation of the project getting reviews posted here on Bitcointalk this will have a positive long term effect.Before the implementation of Google Panda and Penguin, blogs were getting paid for just reviewing products related to their niche I remember one blog getting as high as $500 for their reviews, this is why WordPress has become so popular back then.In the signature campaign, the internet brings people to Bitcointalk based on their queries related to their searches, and from their visit, people will see these banners, and that visibility could result in traffic but once the signature campaign ends the traffic flow stops.Both have a good effect but they differ in the results they bring, it's good for a platform to have both.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zoomic",
      "created_time": "October 17, 2023, 11:43:23 PM",
      "body": "Quote from: Royse777 on October 17, 2023, 10:40:25 PMQuote from: Zoomic on October 17, 2023, 06:15:20 PMI am not so certain about this, I will like to hear from project owners and campaign managers like Royse777 who often launch review campaigns.Thank you for giving me a chance to write a few words. I feel honored and grateful.Thanks too, you deserve the honour as you are a hardworking manager Quote from: Royse777 on October 17, 2023, 10:40:25 PMI hope the importance of a signature campaign is clearer to you now.Yes, it is clear to me, especially on knowing that the result of the signature is normally on the long run and I think that is why some signature campaigns has lasted for so many years.Quote from: Royse777 on October 17, 2023, 10:40:25 PMA review campaign serves a different purpose. It's mainly about getting feedback on the product and improving its functionality and user-friendliness.Cheers,Yea and in most times it serves more than that. Search engine can also direct people to this forum to read the review of such a project depending on the keywords used.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Darker45",
      "created_time": "October 18, 2023, 04:14:48 AM",
      "body": "As others have already pointed out, the two are more different than similar. Both have different goals, timeframes, durations, budgets, and so on. What's probably more interesting to compare and contrast are signature campaigns and various contests. Roobet's art contests, for example, have been running for quite a while already. It's not the same with signature campaign, but I think both of them are mainly done for the sake of making the brand more popular or recognized. They are more comparable with each other. Both of them are for the sake of brand awareness or brand recognition, which a review campaign isn't.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "October 18, 2023, 05:38:37 AM",
      "body": "Quote from: Zoomic on October 17, 2023, 11:43:23 PMYea and in most times it serves more than that. Search engine can also direct people to this forum to read the review of such a project depending on the keywords used.That is — if people are actually searching for it in the first place. That's why advertising and things like signature campaigns exist — to make people aware that this certain platform exist, which may lead to people doing research on the said platform.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Despairo",
      "created_time": "October 18, 2023, 07:06:04 AM",
      "body": "Review campaign only can viewed on the specific thread, it will not make people attracted to use the service. There's no absolute correlation when people who previously joined the review campaign will keep using the service. If you're use Bisq because of it's fully decentralized and privacy oriented, you will not use other exchange you review that less decentralized or privacy.Quote from: Zoomic on October 17, 2023, 11:43:23 PMYea and in most times it serves more than that. Search engine can also direct people to this forum to read the review of such a project depending on the keywords used.It's not, this forum has a low index other than other sites, people can find this forum if they search about Bitcoin or use \"bitcointalk\" in their search engine.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yamane_Keto",
      "created_time": "October 18, 2023, 11:15:29 AM",
      "body": "The purpose of both campaigns is different. The purpose of the review campaign is to verify the existing features and possible errors. Almost all services have one or another  form of Review Campaigns, but they are under different names, such as bug campaigns or security campaigns.Signature campaigns aim to promote the project just like referral links, but the difference in referral links is that you are looking for unique visits, while in signature campaigns you are not looking for use, but rather to establish your brand. When you see the advertisement in the signature or even on the Internet or television, when you go to the market and see the product, then inevitably You will buy it, or at least it will be familiar to you, and it is the same here, when there is an influential person wearing a signature, you will try to use the service, or at least you will think it as reliable service.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wapfika",
      "created_time": "October 18, 2023, 11:36:22 AM",
      "body": "Quote from: Zoomic on October 17, 2023, 06:15:20 PM Review Campaign Personally, I feel that review campaign brings more results to the project owners because the participants of the review campaign will surely use the project and there is the possibility than more than 30% of the campaign participants will continue to use the project if it is a good project. The target of the campaign is not the participants exposure to the product launching their campaign but rather to give project a better exposure to the general audience. Review campaign main goal is to get feedback to the service they are offering. Review campaign and Signature campaign have different goal.Signature is for exposure while review campaign is to gather feedback. I doubt your 30% figure is true or else project will choose review campaign as fix advertisement since 30% conversion is guaranteed. This is 2 different campaigns with different goal, you are the only one who assume review campaign as a better campaign for exposure compared to signature campaign that literally spread the brand all over the forum. Review campaign exposure is limited to a single thread.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TheUltraElite",
      "created_time": "October 18, 2023, 03:49:10 PM",
      "body": "Creating a account on a site or app and then reviewing the service with some testing money is nothing new. It does not necessarily mean that the person doing the work is going to continue using that service if they never actually needed it.Similar with signature campaigns, because it is a person's own choice to use the service or not. It may make the person's first choice preference to that site that they promote but not necessarily.All in all, I feel a mixture of signature/review/Artwork making/Giveaways all add in to the promotional landscape, all have their own different way of drawing the crowd.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "salad daging",
      "created_time": "October 18, 2023, 04:30:15 PM",
      "body": "We all know the difference between a review campaign and a signature campaign, Royse777's exposure has gone into detail to explain the difference including the project manager who brought the audience here.Yes it is almost the same as my own thought that signature campaign is to build their reputation and spread the company brand everywhere including in the forum will be widely seen across the board if the participants spread the posts of various threads and we will see it.As others have said I agree that the review campaign is just to test the features of the project in terms of advantages and disadvantages then it will be revealed in a review that they feel when testing it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coupable",
      "created_time": "October 18, 2023, 07:02:09 PM",
      "body": "Quote from: Zoomic on October 17, 2023, 06:15:20 PMPersonally, I feel that review campaign brings more results to the project owners because the participants of the review campaign will surely use the project and there is the possibility than more than 30% of the campaign participants will continue to use the project if it is a good project. I respect your opinion, but it made me wonder what makes you so sure that participants in the review campaign will continue to use the service after the campaign ends. There is no confirmation of this, and it is not possible to obtain any kind of statistics to prove it.Then this can apply to casino projects, but how can it be applied to mixer projects? Those who try Mixer as part of the review campaign cannot guarantee that they will be regular users of this type of service.There is a difference between a signature campaign and a review campaign, and each of them has its own goals, which Royse777 summarized in his comment above.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "The Cryptovator",
      "created_time": "October 18, 2023, 07:43:43 PM",
      "body": "Have you noticed Google still uses banner ads for Google itself? Though it's surprising, if you visit a site that allows Google ads, sometimes you may find them there. It's because branding is all about spreading the word and showing more people about their brand to build their reputation.Once a time, I managed many signature campaigns. Most projects come to me for a short time, like 4 weeks. They regret it when they don't get many users from the forum. So I investigated what the reason was. I find out that a short signature campaign isn't enough to gain a reputation on the forum. So usually, people don't use their projects or sites. Then I decide to explain to companies that contact me about a short-term campaign. I don't like to give them fake hopes. So I keep rejecting all short campaigns, and they move forward with other managers.I hope you get what I want to say. By using a signatures campaign, you can show your brand in front of thousands of users. This won't be the purpose of a review campaign. Both campaigns have a different approach. The review campaign is all about discovering negative and positive aspects of your platform. Not about branding.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dunamisx",
      "created_time": "October 18, 2023, 11:37:11 PM",
      "body": "Quote from: Zoomic on October 17, 2023, 06:15:20 PMI am not a campaign manager and neither have I promoted any project in the forum.But you're just promoting one already which is the trust dice signature campaign you're wearing it avatar and signature mate   don't mind me am just kidding, anyway you would have stated that you have not managed any signature campaign before not promote being used, i understand English could be sometimes difficult to catch up with.Quote from: Zoomic on October 17, 2023, 06:15:20 PM I was just considering the best method to promote any project in future as far as BTT is concerned. If I have fund to choose either of the below methods to promote my project, which should I choose; Signature Campaign  Review Campaign Don't get it wrong, review campaign is aimed at letting user's have a better experience in using their platform, they do that to get user's feedback and make corrections as appropriate, most organizations that made review are likely to be newly launched platforms to see their ratings on performance of the use of their site, while signature campaign is strictly for the promotion otherwise known as advertisement.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}