{
  "id": "topic_5474696",
  "title": "Bitstar_coin",
  "author": "Bitstar_coin",
  "created_time": "November 19, 2023, 06:30:55 PM",
  "content": "#HODLing is not a smooth journey, do you agree? Totally agree, it is mostly easier said than done for most investors. I personally can recall the different juicy opportunities I have missed to really make it big in this space as a result of a lack of patience to HODL. Especially those early days in crypto when you barely understand the market and easily get freaked out with every FUD and market dip. Experience is the best teacher they say and I believe the majority of us are more experienced and mature over the years of being in crypto. What is your view on #Hodling Guys?source",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5474696",
  "comments": [
    {
      "author": "Hatchy",
      "created_time": "November 19, 2023, 06:49:19 PM",
      "body": "I still believe that HOLDING is much better than trading. As you can see in the provided image, holding for the long term involves less stress and risk compared to trading, where you could potentially lose your investment. Successful holders outnumber successful traders. However, it doesn't mean holding is without challenges. During the holding period, an impatient investor might sell, fearing the price might drop further or gotten to it's ATH. It requires emotional strength and avoiding FOMO (fear of missing out) to hold for a long time. Every investment plan has its downsides, but it's essential to choose one with a lower chance of loss and a higher chance of making profits.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "electronicash",
      "created_time": "November 19, 2023, 06:51:59 PM",
      "body": "its not an easy journey when you expect to make profit at a short period of hold BTC. we all have that the same experience upon holding and then thinking it will take years for to cycle another bull market while the price keeps dipping ever week.not easy that some sells their BTC after hearing some fud. bad news comes out and you know the price will go down. yet you on the other hand just hold while the halving is still more than a year away.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GxSTxV",
      "created_time": "November 19, 2023, 06:56:29 PM",
      "body": "Let me tell you my journey of like 3 years ago when I started gathering bitcoin and holding, I started working only online and without any other job because I’m a student and the only time I have is staying on my computer or phone.In every chance I take a small some of bitcoin and send it to my private wallet. I do my best to not take out of that bitcoin until a very hard financially situation, with studying fees and expenses sometimes. I won’t say that I didn’t fail many times and had to take out some amounts but in general I’m happy with the result. The journey is very hard, I would say it depends on the person, his job, situation, region and money management mentality. Whoever, I didn’t care about the market situation as long as I believe in bitcoin not it’s price",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DVlog",
      "created_time": "November 19, 2023, 06:56:34 PM",
      "body": "It can be if you stop looking at your portfolio frequently. Some of us have this bad habit of checking our wallets a few times a day. We are emotional being so when we see that our portfolio is few thousand dollars down or up we take action immediately out of fear or greed. If i am planning to hold a project for a few years then i don't care what happens to the market or the project. I will keep doing the work i am doing and let the portfolio grow. If the price is falling towards zero then let it be because i have confidence in the project and even if the price goes down like crazy for sometimes it will revert back if my analysis of the project was right.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "alani123",
      "created_time": "November 19, 2023, 07:04:55 PM",
      "body": "Quote from: Hatchy on November 19, 2023, 06:49:19 PMI still believe that HOLDING is much better than trading. As you can see in the provided image, holding for the long term involves less stress and risk compared to trading, where you could potentially lose your investment. Successful holders outnumber successful traders. However, it doesn't mean holding is without challenges. During the holding period, an impatient investor might sell, fearing the price might drop further or gotten to it's ATH. It requires emotional strength and avoiding FOMO (fear of missing out) to hold for a long time. Every investment plan has its downsides, but it's essential to choose one with a lower chance of loss and a higher chance of making profits.That's more like it. People think that they can get ahead of the competition by buying altcoins or trading, while in reality it's only a rat race to the bottom. In most cases markets will be manipulated just enough to shake off most sats of people in risky positions. Rinse and repeat, it's just like gambling. Trying to win back your losses will lead you to owning nothing. Don't trust the charts, don't trust anyone's analysis. They all get burned in the end. It's just BTC that survives in the long run and those that hold doing nothing more earn the most.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "boltz",
      "created_time": "November 19, 2023, 07:22:31 PM",
      "body": "Quote from: alani123 on November 19, 2023, 07:04:55 PMQuote from: Hatchy on November 19, 2023, 06:49:19 PMI still believe that HOLDING is much better than trading. As you can see in the provided image, holding for the long term involves less stress and risk compared to trading, where you could potentially lose your investment. Successful holders outnumber successful traders. However, it doesn't mean holding is without challenges. During the holding period, an impatient investor might sell, fearing the price might drop further or gotten to it's ATH. It requires emotional strength and avoiding FOMO (fear of missing out) to hold for a long time. Every investment plan has its downsides, but it's essential to choose one with a lower chance of loss and a higher chance of making profits.That's more like it. People think that they can get ahead of the competition by buying altcoins or trading, while in reality it's only a rat race to the bottom. In most cases markets will be manipulated just enough to shake off most sats of people in risky positions. Rinse and repeat, it's just like gambling. Trying to win back your losses will lead you to owning nothing. Don't trust the charts, don't trust anyone's analysis. They all get burned in the end. It's just BTC that survives in the long run and those that hold doing nothing more earn the most. Yep..I really don't trust altcoins anymore besides few ones and I most likely I will never be a hodler of altcoins because 90% of the times , you will lose 90% of your money just by holding. It has become worse than gambling to be honest as there you still have some luck on your side to actually win something but holding random altcoins ? for me never again. I will stick to Bitcoin and only a few trusty altcoins ( if I can call them that ) but overall , holding Bitcoin is much better than trading.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tjtonmoy",
      "created_time": "November 19, 2023, 07:24:59 PM",
      "body": "Yes it is hard, I totally agree to this with you. But with experience, it becomes easy. Some people hate the idea of holding so they never join, some people start to do it but can't keep up with it and leave, and finally those who don't give up and keep on doing it, becomes successful. You can never gain experience if you never try it. But as you move forward, it starts to become easier. It is a bumpy road at the beginning but it eventually becomes smooth as time passes by. This also depends on your ability to build up a mindset which will help you make it smooth. In hodling, emotion place a big role and we need to have proper control over it. Also, watching the market occasionally is also a good idea. Because you need to know when is the perfect time to sell so that you can make profit. If we can master this two thing, then it will become a smooth journey. Hardship will come that's for sure but we will be prepared to face it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gozie51",
      "created_time": "November 19, 2023, 07:25:24 PM",
      "body": "Trading bitcoin is riskier than hodling bitcoin. The challenge with hodling is that most people who want to do short time hodling before selling later find themselves being stocked after the price drop away from their entry and this is the challenge that most hodlers face because they over hodl even when the ATH has been reached and retracement starts to occur but they feel the bull momentum will continue. That is what happened during the last season of bull that got some hodlers trapped. So while hodling, know your right exit point and play safe.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rachael9385",
      "created_time": "November 19, 2023, 07:25:59 PM",
      "body": "It is very hard to hold Bitcoin mostly when you always look at the price of Bitcoin, it is a bit easy to invest but it is hard to hold it, but it can only take a very discipline person to invest and hold to a particular time he or she planned for.As Bitcoin investment is not an investment where one will plan to get reach in a short time, it is also good to put in mind not to sell immediately the price of Bitcoin just increase a little bit, I don't think that the impatient people can invest in Bitcoin because they will be at a big rush to see their holdings.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mate2237",
      "created_time": "November 19, 2023, 08:24:03 PM",
      "body": "I don't know you personal experienced on this matter but I don't think any other person will choose trading to investment. When we talked about risky in the cryptocurrency ecosystem industry trading is the number one risky element in the industry. Hodling bitcoin is one of the smoothest investment in the world with even another businesses. The experience you talking about is different from the hodling and probably you are saying trading and gambling then we will know that their ways are not smoothly. If you have not involved in investment then I advise you to do that right way because bitcoin is still ok to invest.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tabas",
      "created_time": "November 19, 2023, 08:43:37 PM",
      "body": "When you're starting out, everything is not smooth but believe us when someone experienced how HODLING really is. They'll say that it's one of the best, effortless and profitable strategy that one can do. He can even acclaim that he's a real investor with that strategy.I do understand why it's not smooth even if many experienced says that it is. And that is because when you're holding, there's a lot of temptation and it depends on you on how you're going to overcome the FUD that will push you to panic sell and lose your grip on it. But if you listen to the real ones who held for a very long time, you won't get affected by such anymore.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stomachgrowls",
      "created_time": "November 19, 2023, 08:44:14 PM",
      "body": "Quote from: Bitstar_coin on November 19, 2023, 06:30:55 PM#HODLing is not a smooth journey, do you agree? Totally agree, it is mostly easier said than done for most investors. I personally can recall the different juicy opportunities I have missed to really make it big in this space as a result of a lack of patience to HODL. Especially those early days in crypto when you barely understand the market and easily get freaked out with every FUD and market dip. Experience is the best teacher they say and I believe the majority of us are more experienced and mature over the years of being in crypto. What is your view on #Hodling Guys?sourceI can attest to this and pretty sure that most of us did experience on tending to hold for long term but on the time that the market do make out some serious correction or dips then we do panic and freak out and the worst we did make some cutlosses on which it is really indeed the most common thing that do really happen on this space. If you arent that emotionally stabled then for sure you would really be committing tons of mistakessince we are really just that humans on which we are really that emotional. No one really likes on losing money and this is why experience would really be the key for you to be able to make yourself that much strongerand having that discipline towards your hold or portfolio. You would be finding out yourself to be that impulsive if you do lack knowledge and experience but on the time that you are having sufficient experiencethen you do already have the idea on what you would gonna do. Hodling is never been a smooth journey yet it would really be involving lots of ups and downs towards the market on which you would really be having a hard time on making decisionswhether you should hold or not. It would really be a test of faith and patience which it would really be that bringing up that kind of probability whether you wouldsucceed on holding or fail to do so.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zaguru12",
      "created_time": "November 19, 2023, 08:47:00 PM",
      "body": "Quote from: rachael9385 on November 19, 2023, 07:25:59 PMIt is very hard to hold Bitcoin mostly when you always look at the price of Bitcoin, it is a bit easy to invest but it is hard to hold it, but it can only take a very discipline person to invest and hold to a particular time he or she planned for.As Bitcoin investment is not an investment where one will plan to get reach in a short time, it is also good to put in mind not to sell immediately the price of Bitcoin just increase a little bit, I don't think that the impatient people can invest in Bitcoin because they will be at a big rush to see their holdings. The best way to hodl for long is to be patient and the only way to attain this peace is when you invest an amount that you are not looking to use in a short period of time or better still an amount that you can afford to lose. This way you will definitely have the ability to overlook your bitcoin even if there is a long period of bear market. But once you invest into bitcoin following the trend like this ETF saga and the market swings sides you will definitely be looking for a way to pull out. Just like how one needs patience in running business before he starts gaining profits same thing goes to holding of bitcoin. It’s not easy but with an amount that you can afford to lose it will help smoothen the process",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mirakal",
      "created_time": "November 19, 2023, 08:58:02 PM",
      "body": "Yes, bitcoin hodling is never easy most especially if you are still new in the market industry. You would definitely think that keeping bitcoin in your wallet is good enough, but that's not how bitcoin works. You will encounter a lot of hurdles once you decide to hold and with every market crash and price decline, you will tend to break your patience easily and lose out of control and end up panic selling. The reason why a lot of bitcoin hodlers still end up losing and regretting.However, if you do prior research before bitcoin investing and study the market and bitcoin price first before entering the market, then you can easily manage the pressures in bitcoin hodling. It could be hard if you hold bitcoin without knowledge, but if you are aware on the high volatility and market downturn, I guess you would still end up successful in your bitcoin investment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Balmain",
      "created_time": "November 19, 2023, 09:07:25 PM",
      "body": "I believe this is a better method than HODL trading, but when HODLing, you need to make some sales where necessary, otherwise you may look back and regret that you missed the opportunity and make more mistakes. And you have to spend years to reach the same point again. That's why I think it's important to make partial sales while HODLing. But in general HODL makes more sense. By the way, the best thing to do is not to pay too much attention to FUDs and the media. If you start listening to your surroundings too much, you become open to making mistakes.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dr.Bitcoin_Strange",
      "created_time": "November 19, 2023, 09:53:48 PM",
      "body": "Yes, it isn't. Only those who think that holding is easy are probably those who have not actually ventured into it. There are some people who intended to hold their Bitcoin till the next bull run, but I can say that most of them are not holding again, either because of the volatile nature of the market or because they sold out of panic, while some people, too, might have actually sold off because they probably invested more than they could afford to hold for a long time. Just as Hatchy has also said, holding might be so uneasy, but trading Bitcoin too is very much not easy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wexnident",
      "created_time": "November 19, 2023, 10:56:33 PM",
      "body": "Quote from: Bitstar_coin on November 19, 2023, 06:30:55 PM~I mean just don't look at the market. I do agree it's a different experience in the early days though. I doubt a lot of people even expected the market to go above $100, let alone more than $50k really. It's more comfortable now to hodl than in the past that's for sure since the market has already shown what it's capable of and my point of entry is pretty low compared to ath so I was pretty easy going when entering since I can, at the very least (imo back then) achieve at the minimum the amount I invested. The picture you showed was me when I was trading though. A single percent drop was enough to make my heart go \"oh shit, gotta dip before it goes lower\" and it going up I was like time to buy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hatshepsut93",
      "created_time": "November 19, 2023, 11:47:21 PM",
      "body": "Quote from: Bitstar_coin on November 19, 2023, 06:30:55 PM#HODLing is not a smooth journey, do you agree? It really is like the upper picture if you don't care about the short-term movements and patiently wait for your price goal or the peak of the bull market or even just decided to never sell and wait for the times when you can buy anything with Bitcoin.HODLing can be stressful if you're a beginner investor who checks the price every 15 minutes and read all the crypto news, but you're supposed to eventually grow up as an investor and stop worrying about that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AmoreJaz",
      "created_time": "November 19, 2023, 11:50:57 PM",
      "body": "Quote from: Dr.Bitcoin_Strange on November 19, 2023, 09:53:48 PMYes, it isn't. Only those who think that holding is easy are probably those who have not actually ventured into it. There are some people who intended to hold their Bitcoin till the next bull run, but I can say that most of them are not holding again, either because of the volatile nature of the market or because they sold out of panic, while some people, too, might have actually sold off because they probably invested more than they could afford to hold for a long time. Just as Hatchy has also said, holding might be so uneasy, but trading Bitcoin too is very much not easy.in this market, even if you say you have been on this market for so many years, you won't be exempted with possible panic mode. because of the uncertainty of this market, it is hard to say when will you get the profits you want or if you will incur loss once you decide to sell.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}