{
  "id": "topic_5464596",
  "title": "Tahid12",
  "author": "Tahid12",
  "created_time": "August 25, 2023, 09:58:54 PM",
  "content": "As an investor, i bought so many exchange based tokens! Bnb, uniswap, kucoin (kcs), cake, houbi (ht),  FTP and so on. Undoubtedly those exchangers are so big and reputable. I though those altcoins will pump if exchange get larger during time and if exchange add more pair with their altcoin on their platform, then price will boom but most of those are like shitcoin, dumped 70-80℅ in long run except bnb. So what do you think? I'm no longer going to invest any exchange coin anymore!",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5464596",
  "comments": [
    {
      "author": "_act_",
      "created_time": "August 25, 2023, 10:04:10 PM",
      "body": "Even the BNB, what if Binance got hacked or something happened and it fold up? BNB will crash and become useless. I used it as the example because it is the one you recognized most and the first among them if marketcap is used. Any exchange can get hacked and this may cause their token to become useless. Go for decentralized coin like bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o48o",
      "created_time": "August 25, 2023, 10:19:23 PM",
      "body": "Quote from: Tahid12 on August 25, 2023, 09:58:54 PMAs an investor, i bought so many exchange based tokens! Bnb, uniswap, kucoin (kcs), cake, houbi (ht),  FTP and so on. Undoubtedly those exchangers are so big and reputable. I though those altcoins will pump if exchange get larger during time and if exchange add more pair with their altcoin on their platform, then price will boom but most of those are like shitcoin, dumped 70-80℅ in long run except bnb. So what do you think? I'm no longer going to invest any exchange coin anymore! Well they have an obvous weak points. They might seem like decentralised tokens as transactions are permissionless, but their value is based on very centralized entity that doesn't have security of blockchain. Cexes can be hacked, have been hacked, exit scammed, failed and sued. After that only use case for that token is to short it. And if those exchanges that have their own tokens fail somehow, their token price will drop so fast that you need to be really fast to sell them. And if you try to sell them in that exchange that's failing, it's a possibility that you can't even get your money out.There are different tokenomics and mechanism behind them and some are worth it while others are not, but they are very much centralized around their issuer.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JeffBrad12",
      "created_time": "August 25, 2023, 10:31:02 PM",
      "body": "honestly it really depends, with this kind of tokens the performance and valuation depends on the exchanges themselves like BNB, whenever they have staking programs that tells them to stake some of the BNB the price went up, but if there's news surrounding the platform themselves in which giving negative impression the value of the token usually plummet.i'd personally never gonna hold these tokens for long, at best just following staking program, its just not worth it. not to mention of suddenly the exchange asset got stolen or something similar to that.i can be 100% sure that the value of token will just make a sharp down turn, there's just too many ways for these tokens to lose its value honestly that i don't think they are worth long term holding.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wiwo",
      "created_time": "August 25, 2023, 11:11:51 PM",
      "body": "Quote from: Tahid12 on August 25, 2023, 09:58:54 PMAs an investor, i bought so many exchange based tokens! Bnb, uniswap, kucoin (kcs), cake, houbi (ht),  FTP and so on. Undoubtedly those exchangers are so big and reputable. I though those altcoins will pump if exchange get larger during time and if exchange add more pair with their altcoin on their platform, then the price will boom but most of those are like shitcoin, dumped 70-80℅ in the long run except bnb. So what do you think? I'm no longer going to invest in any exchange coin anymore! You don't rely so much on centralized coins because even while they are sitting in your wallets, they can still be frozen,  or if the owner decides to take an exit your investment will become worthless,  so it does not matter how big the exchange is you can not build confidence in holding their coin most especially for long term base. Most of the exchange tokens that you mention are best for paying fees and short-term speculation despite that most of the exchanges are big exchanges that have a proven history of sustainability.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EFS",
      "created_time": "August 25, 2023, 11:32:12 PM",
      "body": "It depends on the exchange. We've all seen what FTX turned into from one of the most reputable exchanges to going awol. Even the best exchanges make mistakes and disappear for a variety of reasons. When that happens their coins turn into garbage. Currently Binance appears to be the largest exchange and BNB has really paid off for its early investors. CZ seems to be untouchable in the market, but we all know what will happen to Binance if something happens to him. Don't trust anything about centralized exchanges much.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hildentine",
      "created_time": "August 26, 2023, 03:35:20 AM",
      "body": "I think exchange based tokens are strong token and they also going long but its depends token activity if token is strong there concept is strong so its will be good its means exchange are help but main thing is token roadmap..",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MAAManda",
      "created_time": "August 26, 2023, 04:10:25 AM",
      "body": "Quote from: Tahid12 on August 25, 2023, 09:58:54 PMAs an investor, i bought so many exchange based tokens! Bnb, uniswap, kucoin (kcs), cake, houbi (ht),  FTP and so on. Undoubtedly those exchangers are so big and reputable. I though those altcoins will pump if exchange get larger during time and if exchange add more pair with their altcoin on their platform, then price will boom but most of those are like shitcoin, dumped 70-80℅ in long run except bnb. So what do you think? I'm no longer going to invest any exchange coin anymore! Exchange-based altcoins are one of the safest ways to invest, but this is only true if you are an early bird, I'm the lucky ones to have been an early investor in PancakeSwap (CAKE). If you invest your money in exchange-based altcoins when their ecosystem is already large, you will only be a loser or only make a small profit from it.There are lots of L-1 projects popping up mate, my advice, you better pay attention to these projects instead of investing in exchange-based altcoins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "August 26, 2023, 04:49:32 AM",
      "body": "Quote from: Tahid12 on August 25, 2023, 09:58:54 PMAs an investor, i bought so many exchange based tokens! Bnb, uniswap, kucoin (kcs), cake, houbi (ht),  FTP and so on. Undoubtedly those exchangers are so big and reputable. I though those altcoins will pump if exchange get larger during time and if exchange add more pair with their altcoin on their platform, then price will boom but most of those are like shitcoin, dumped 70-80℅ in long run except bnb. So what do you think? I'm no longer going to invest any exchange coin anymore! Based on results in the past it is worth it for quite sometime but it doesnt mean or guaranteed you forever privilege with that. There are numerous exchange fell down and didnt survive their closure. But some still retain and probably continue. Its always up to you to weigh the pros and cons or take advantage of the time while they are working best for you but dont be complacent enough to trust more than you are willing especially if you are risking your own money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mindrust",
      "created_time": "August 26, 2023, 05:02:11 AM",
      "body": "Quote from: Tahid12 on August 25, 2023, 09:58:54 PMAs an investor, i bought so many exchange based tokens! Bnb, uniswap, kucoin (kcs), cake, houbi (ht),  FTP and so on. Undoubtedly those exchangers are so big and reputable. I though those altcoins will pump if exchange get larger during time and if exchange add more pair with their altcoin on their platform, then price will boom but most of those are like shitcoin, dumped 70-80℅ in long run except bnb. So what do you think? I'm no longer going to invest any exchange coin anymore! Depends on the exchange's reputation imo. I would hold the tokens of binance and kucoin and dump the rest. Huobi especially has a very shitty reputation. Why would anybody want to make trades on their platform let alone owning their products... It don't make a bit of sense to me. Binance and Kucoin have been doing great so far other than the KYC fiasco but it happened to every exchange and casino so I don't mind it much. I have no idea about uniswap and I don't talk about the stuff I have no clue and I surely don't invest in them. Unless you know uniswap and the exchanges well enough, I advise you to do the same.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GreatArkansas",
      "created_time": "August 26, 2023, 05:51:47 AM",
      "body": "There's nothing about exchange-based tokens, they are all the same to me. But what I can see right now is new altcoins these days tend to be more risky, even if there's a high chance of high reward.Among the list OP provided, the only first Uniswap, OG decentralized exchange for me, Uniswap for me will stay just like Ethereum.Next is Binance and Kucoin only, they have been exchanges since 2017 and until now, they are all kicking alive! But just be careful, these centralized exchange are just like any centralized exchange who went bankrupt recently.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "X-ray",
      "created_time": "August 26, 2023, 07:08:17 AM",
      "body": "Quote from: Tahid12 on August 25, 2023, 09:58:54 PMAs an investor, i bought so many exchange based tokens! Bnb, uniswap, kucoin (kcs), cake, houbi (ht),  FTP and so on. It's worth for hold as long as you will able to deal with the risk. The fact that if decentralized exchange site token was a governance token and it offers less utilities to the its token compared with centralized tokens. Holding centralized tokens is worthy enough caused by you will be able to get various advantages like participating in the launchpad, discount fees, raffle event and many more. The dex token is not even worth to hold. You will receive nothing from hold it. The only risk once the exchange site faces the same trouble as FTX. It will make the token worth nothing. Quote from: Tahid12 on August 25, 2023, 09:58:54 PMUndoubtedly those exchangers are so big and reputable. I though those altcoins will pump if exchange get larger during time and if exchange add more pair with their altcoin on their platform, then price will boom but most of those are like shitcoin, dumped 70-80℅ in long run except bnb. So what do you think? I'm no longer going to invest any exchange coin anymore! The price movement of exchange token totally depending on the trend. You can't use the popularity from the exchange site as measurement to determine the future price of token. Think about that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dbshck",
      "created_time": "August 26, 2023, 07:43:41 AM",
      "body": "Quote from: Tahid12 on August 25, 2023, 09:58:54 PMAs an investor, i bought so many exchange based tokens! Bnb, uniswap, kucoin (kcs), cake, houbi (ht),  FTP and so on. Undoubtedly those exchangers are so big and reputable. I though those altcoins will pump if exchange get larger during time and if exchange add more pair with their altcoin on their platform, then price will boom but most of those are like shitcoin, dumped 70-80℅ in long run except bnb. So what do you think? I'm no longer going to invest any exchange coin anymore! Exchange tokens' prices drop significantly when cryptocurrency trading activity slows down, like we're experiencing right now. If you bought them at higher prices last year, well tough luck. I think it's performance will still be highly correlated to the overall crypto market trend. So, if you think the crypto market will go up again in the near future, getting exchange tokens could be a way to profit from that.That said, I wouldn't recommend buying tokens like BNB and HT. They have risky legal and regulatory problems. I can't count how many Binance and Justin Sun FUD we had in these last few months. Smaller exchanges like Kucoin might not be a good idea either. I'm personally more interested towards investing in Coinbase stock ($COIN). It's a public company with transparent financials and a leading position in navigating regulatory challenges in the US. With their recent expansion into international derivative exchanges and the launch of the Base chain, Coinbase stock has become even more appealing. It's definitely an asset I'm looking to accumulate during this bear market. But for individuals like me who aren't US citizens, purchasing this stock might be challenging.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wexnident",
      "created_time": "August 26, 2023, 08:09:03 AM",
      "body": "They're probably worth to buy and sell every now and then, but definitely, not something I'd hold on to in the long run. You're probably better off trying to short them instead of the long-term, they are exchange regulated coins so there's always the risk of said exchange fucking it up all of a sudden, and you'd probably have no idea what even happened when your coins drop. Sure Binance for example is doing great right now, but they'd all fall and rise as a cycle imo, so shorting them is fine, maybe for even a longer period in case of famous exchanges tokens, but other than those short.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blockman",
      "created_time": "August 26, 2023, 08:10:45 AM",
      "body": "Quote from: Hildentine on August 26, 2023, 03:35:20 AMI think exchange based tokens are strong token and they also going long but its depends token activity if token is strong there concept is strong so its will be good its means exchange are help but main thing is token roadmap..Like a few of them are good to long for long term but this is to each their own. As you're saying that token's activity is the concept that investors have to look at.Well, it's right but aside from the actual token's movement. There's the involvement of the actual exchange if they're doing good or not. You can see that for example Binance and its BNB. Whenever there's news about Binance having trouble with SEC, the coin of it reacts and that's why it's like playing in two books. The economy of its token/coin and the exchange itself.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bussybuddy",
      "created_time": "August 26, 2023, 08:37:25 AM",
      "body": "Quote from: Tahid12 on August 25, 2023, 09:58:54 PMAs an investor, i bought so many exchange based tokens! Bnb, uniswap, kucoin (kcs), cake, houbi (ht),  FTP and so on. Undoubtedly those exchangers are so big and reputable. I though those altcoins will pump if exchange get larger during time and if exchange add more pair with their altcoin on their platform, then price will boom but most of those are like shitcoin, dumped 70-80℅ in long run except bnb. So what do you think? I'm no longer going to invest any exchange coin anymore! There is no absolute guarantee that they will increase in price in the future, of course we all know their popularity and strength, but they are always subject to fluctuations with the trend of bitcoin, case of FTX teach everyone a lesson to be more wary of CEX. However, I also think that buying many different types will also reduce risks and increase opportunities, at the moment it is not suitable for me to start accumulating many altcoins, it is better to observe Bitcoin movement.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "catdaunt82h",
      "created_time": "August 26, 2023, 10:53:07 AM",
      "body": "That level of price decrease is completely normal; if you're a true investor, you must have patience and wait",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fzkto",
      "created_time": "August 26, 2023, 11:23:12 AM",
      "body": "I think that any token of any exchange is not safe for investment. I don't even have to give the example that probably all exchanges have always had the same scenario of hacking or bankruptcy. It is better to find some other coin for investment, because tokens of exchanges are also altcoins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cheezcarls",
      "created_time": "August 26, 2023, 11:34:53 AM",
      "body": "It really depends if the exchange token itself has a good utility. Like for example, Echodex exchange has a ECP token. It has an interesting use case where we can reduce trading fees if we hold some ECP tokens into it. It has an option where we can either go for the traditional ETH trading fee or the ECP fee to save more.For me, if I consistently use this exchange and take advantage of this utility, it would be worth to hold them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Tipstar",
      "created_time": "August 26, 2023, 11:36:07 AM",
      "body": "Exchange based tokens increases in price when there demand is high. The demand is higher when there are larger number of transactions are happening in the said exchange. That happens when there is a bull run. So in short almost all tokens of popular exchanges rises upto 100% where there's a bull run. They are a good investment both as buying low and selling high and as cheap way to make transactions happen. I happen to buy a few number of exchange tokens when I have money to spare. It's a good investment if you believe in the future of the exchange.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}