{
  "id": "topic_5404817",
  "title": "runningwolf",
  "author": "runningwolf",
  "created_time": "July 01, 2022, 04:36:24 PM",
  "content": "It looks like Bitcoin had to reach a point of no return from which it became impossible to kill it. I think we're past it and, from now on, no state actor, no whale, no entity can destroy it. You need to nuke the entire Earth to destroy every copy of the ledger. The demand comes mostly from developing countries, and the banks and governments have no choice now. They all need to mine or buy bitcoin. More reasons why Bitcoin's future is bright despite the price are listed here. https://bitcoinmagazine.com/culture/the-message-of-bitcoin-has-already-won",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5404817",
  "comments": [
    {
      "author": "mk4",
      "created_time": "July 01, 2022, 04:54:01 PM",
      "body": "It's been pretty much like this for a while now. Not sure how many full nodes Bitcoiners have running today, but even if Bitcoin had only around like 50 full nodes running, it would already be pretty impossible to shut down.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "runningwolf",
      "created_time": "July 01, 2022, 05:12:08 PM",
      "body": "Quote from: mk4 on July 01, 2022, 04:54:01 PMIt's been pretty much like this for a while now. Not sure how many full nodes Bitcoiners have running today, but even if Bitcoin had only around like 50 full nodes running, it would already be pretty impossible to shut down.I'm not sure about it. It would be probably too easy to coerce them. But this point of no return couldn't have been reached (or it would be much slower) without these current conditions around the world.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jackg",
      "created_time": "July 01, 2022, 05:13:52 PM",
      "body": "It's been impossible to shut down or destroy it for many years already.1btc is always 1btc and the network only needs a few members to keep it going (and the bitcoin network has millions of users - I saw a report about a crypto conference that had an audience of 35k - even with speakers pulling out due to a price crash - that says something about the strength of the community and how easy it'll be to shut down).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "July 01, 2022, 05:18:39 PM",
      "body": "Quote from: runningwolf on July 01, 2022, 05:12:08 PMI'm not sure about it. It would be probably too easy to coerce them.That's totally assuming they can find the people who run the full nodes in the first place.Quote from: runningwolf on July 01, 2022, 05:12:08 PMBut this point of no return couldn't have been reached (or it would be much slower) without these current conditions around the world.If you're referring to recessions and covid and stuff, not really. Bitcoin has been doing really really well in terms of nodes and hashrate even before covid.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Doan9269",
      "created_time": "July 01, 2022, 05:26:35 PM",
      "body": "Bitcoin has come to stay and that has no doubt at all, thirteen years is one of the proofs, its value, application, decentralization and adoption has gone beyond reasonable doubts, we are taking this good advantage for an investment and a means to secure freedom from the centralized world of governments over our finances, when we are left with no choice, then bitcoin came as a rescue and being volatile is just the mode of how it operates and not an expression of doubts about it this time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kryptqnick",
      "created_time": "July 01, 2022, 05:37:09 PM",
      "body": "I believe Bitcoin reached the point of no return in that sense when it recovered from the 2018 fall of the price. Many thought Bitcoin would never reach $20k again, and it's been years before it did, but it happened and, as we know, the new ATH was established. I don't think that it's reasonable to believe that Bitcoin will die after it recovered from that situation, unless something very serious (like WW3 or breakthrough in quantum computing) happens. The last years have shown that things most aren't waiting for and that haven't happened for decades can actually happen, so who knows, but until then, Bitcoin is likely to stay afloat and continue growing long-term.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "amishmanish",
      "created_time": "July 01, 2022, 05:41:05 PM",
      "body": "Bitcoin has reached certainly reached a point of no return, It has become the backbone of crypto currency. Alienating bitcoin from crypto market is as difficult as alienating US dollar from world economy. Even is a country tries to meddle seriously with bitcoin, It will have to suffer economically. A bitcoin crash can make the world economy spiral into a recession, because investments of worth of trillions of dollars is linked to bitcoin.Moreover the clear benefits of bitcoin are too meaningful to ignore and bitcoin has ability to significantly improve the efficiency of current financial situation. Thus I believe bitcoin will not going to sink. Its the black pearl of crypto world.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mindrust",
      "created_time": "July 01, 2022, 05:51:28 PM",
      "body": "Quote from: runningwolf on July 01, 2022, 04:36:24 PMIt looks like Bitcoin had to reach a point of no return from which it became impossible to kill it. I think we're past it and, from now on, no state actor, no whale, no entity can destroy it. You need to nuke the entire Earth to destroy every copy of the ledger. The demand comes mostly from developing countries, and the banks and governments have no choice now. They all need to mine or buy bitcoin. More reasons why Bitcoin's future is bright despite the price are listed here. https://bitcoinmagazine.com/culture/the-message-of-bitcoin-has-already-wonWith every day bitcoin don't die adds up to its lifespan and makes it harder to kill. After it is being recognized by the banks and the wallstreet it surely won't die. Not in the near future at least. I can't talk about what will happen 30 years from now but I can imagine that bitcoin will still be around and kicking banksters ass. Even China is powerless against bitcoin. They banned it that's true but they couldn't kill it because it is simply impossible.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "July 01, 2022, 05:55:31 PM",
      "body": "the rule of history is to never say never...but there is more chance of a world wide blackout than there is to find all node users at once for a simultaneous halt of the blockchain..there is more chance of someone winning the lottery more then once. then a world wide blackout. never say its never going to happen. but chances are slim...governments that confiscate asics from large mining farms is ok, it gives more incentive for the smaller farms to continue on by them getting a bigger slice of the rewards due to lack of competition thus makes it more worth them to mine.. . so the act of stopping large farms actually ends up making bitcoin stronger and more decentralised. ..as for the devs.. well the github community do need to diversify a little more, as their arrogance has made them a little ignorant to their 'community' risk, where they prefer to group together as a single entity.. but even if attacked. they cant all be attacked individually, all that can happen effectively is a court order against github to close accounts.. which only temporarily affects a delay in updates, and takes a few minutes to use other accounts/set up another file source repo, so a risk but not a threat. people can just run current versions for a lil while, whilst devs migrate to other file source repos.as for businesses. well governments can stop businesses accepting bitcoin. but, well did that really work for the alcohol prohibition era or the war on drugs..so never say never.. but the chances are low of any real risk.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sunsilk",
      "created_time": "July 01, 2022, 06:01:05 PM",
      "body": "And it's not gonna stop to become recognized by most people in the world. Let's say that it's not that popular as the usual payment methods but looking at it from 5 years ago, it has really gone that far.And even if there will be a sudden decrease of the miners and difficulty, you'll see the rampage on it and that particular opportunity will be taken as soon as possible by the enthusiasts upon knowing that opportunity.Although in reality, there's only one way where it's heading, mining difficulty will continue to increase and that means a stable and secured network.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Die_empty",
      "created_time": "July 01, 2022, 06:07:37 PM",
      "body": "Bitcoin has reached the same level with the World Bank and IMF. But the beauty of its strategic position is that unlike these big financial institution, it is decentralized and not controlled by any world power or individual. Yes they have tried to manipulate and frustrate the Bitcoin system, but the currency is gaining momentum and acceptance. It is now a threat to the the oppressive and exploitative tendencies of big banks globally. Developing nations sees Bitcoin has a veritable tool to invade Neo-colonialism and control their economic destinies. Regardless of the misinformation and fraudulent tendencies of other shitcoins that have tried to tarnish the image of Bitcoin, it has strategically calmed those storms and portrayed itself as the first and best in the crypto space. Only a fool would dispute the fact that Bitcoin is here to stay.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "famososMuertos",
      "created_time": "July 01, 2022, 06:35:03 PM",
      "body": "Quote from: runningwolf on July 01, 2022, 04:36:24 PM...//...:::Hi, OP;Well, not so much drama in the Hollywood style; ), it's a good point of view, in fact something of the moral \"... when the glass is seen as half full,\" this is good and in a way for now that has been shown in how he stay(endure) , but we must not rule out the possibility (now I am on the side of the glass half empty) that this point changes, but it does not matter, it is the trust that has no contrary thought, the more the trust maintains the point of return is always there, the price is circumstantial.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Haunebu",
      "created_time": "July 01, 2022, 06:52:16 PM",
      "body": "Nothing new as some of the posters above mentioned op. What's more important is that BTC adoption needs to continue increasing organically leading to higher prices thanks to higher demand basically.Small countries are adopting it in droves, but bigger countries need to join the party too hopefully in the near future.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Anonylz",
      "created_time": "July 01, 2022, 07:04:35 PM",
      "body": "What else to say, the article really hit the nail on the head and if we view btc interaction with the world from the onset it will be clear that nothing can touch this technology at this point, btc have gone through it all and still remain standing. The only regret you can have as a bitcoiner is not able to take advantage of btc dip when you had the opportunity. The time is not very far.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "The Cryptovator",
      "created_time": "July 01, 2022, 07:16:59 PM",
      "body": "No more chances to destroy or stop Bitcoin anyway. At this point, we just can expect adaption, not destroy. No one will miss Bitcoin mining till it has value. And value isn't going to ZERO anyway since it's backup by the world's largest community. Few countries already adopted Bitcoin and many are on the way. A lot of institutional investors have been investing. So I can't imagine Bitcoin will be destroyed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Welsh",
      "created_time": "July 01, 2022, 07:27:45 PM",
      "body": "Yeah, I'm never going to believe that. Even, if we're the mainstream currency. Also, I'm okay with that, if we can come up with something better than Bitcoin, I don't see the reason to be elitist about it, if it's better, it's better simple as that. I don't think so, as we can adapt Bitcoin has new ideas are thought of, but I'm not completely closed off to the idea. Quote from: The Cryptovator on July 01, 2022, 07:16:59 PMNo more chances to destroy or stop Bitcoin anyway. At this point, we just can expect adaption, not destroy. No one will miss Bitcoin mining till it has value. And value isn't going to ZERO anyway since it's backup by the world's largest community. Few countries already adopted Bitcoin and many are on the way. A lot of institutional investors have been investing. So I can't imagine Bitcoin will be destroyed. I mean, we have plenty of things that will prove to be stumbling blocks. The main one for me is the complexity of Bitcoin, so while I do agree the longer that Bitcoin exists, and does well the more faith in it, and therefore adoption rates increase, and in a way your theory makes sense. However, I do think it'll definitely have a few threats, but more about impacting it instead of outright destroying it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rby",
      "created_time": "July 01, 2022, 07:50:31 PM",
      "body": "Quote from: The Cryptovator on July 01, 2022, 07:16:59 PMNo more chances to destroy or stop Bitcoin anyway. At this point, we just can expect adaption, not destroy. No one will miss Bitcoin mining till it has value. And value isn't going to ZERO anyway since it's backup by the world's largest community. Few countries already adopted Bitcoin and many are on the way. A lot of institutional investors have been investing. So I can't imagine Bitcoin will be destroyed. Apart from the security architecture of bitcoin, one major thing I noticed a out bitcoin is that the price fluctuation is also an advantage to bitcoin. Since bitcoin went below $20k, many people are being scared to invest in bitcoin, while the wise and the whales are planning how to buy big now and send the price back to $60k. It is a project, even if few are tired of it, another group will work tirelessly to send bitcoin to $60k and above.So, the masses are used to the network and they keep managing it as long as it will last. That is what I discovered.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TheNineClub",
      "created_time": "July 01, 2022, 08:10:41 PM",
      "body": "Quote from: runningwolf on July 01, 2022, 04:36:24 PMIt looks like Bitcoin had to reach a point of no return from which it became impossible to kill it. I think we're past it and, from now on, no state actor, no whale, no entity can destroy it. You need to nuke the entire Earth to destroy every copy of the ledger. The demand comes mostly from developing countries, and the banks and governments have no choice now. They all need to mine or buy bitcoin. More reasons why Bitcoin's future is bright despite the price are listed here. https://bitcoinmagazine.com/culture/the-message-of-bitcoin-has-already-wonWait wait wait, BTC has never experienced (or been on the doorstep) of such an economic crisis. So we still need to see how that rolls out. But we forget that even if BTC falls out of favor, that dosen't mean crypto will follow. Something new might take it's place.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Welsh",
      "created_time": "July 01, 2022, 08:25:23 PM",
      "body": "Quote from: rby on July 01, 2022, 07:50:31 PMApart from the security architecture of bitcoin, one major thing I noticed a out bitcoin is that the price fluctuation is also an advantage to bitcoin. Since bitcoin went below $20k, many people are being scared to invest in bitcoin, while the wise and the whales are planning how to buy big now and send the price back to $60k. It is a project, even if few are tired of it, another group will work tirelessly to send bitcoin to $60k and above.So, the masses are used to the network and they keep managing it as long as it will last. That is what I discovered. To speculative investors or long term holders, temporary blips in price are absolutely welcomed. It allows you to accumulate more Bitcoin than you would've been able too. No one is going to turn down that if presented to them. If you're a short term investor then things get a little tricky. Short term investors are undoubtedly the ones that get burnt, however they need to accept that Bitcoin is probably one of the highest volatility investments you can make. So, you should try, and mitigate the risk of that at all times. People usually suggest Dollar cost averaging DCA, as a way of mitigating the risk of inflation, but even that is more suited to long term or medium term investors.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}