{
  "id": "topic_5398278",
  "title": "emmaglory5",
  "author": "emmaglory5",
  "created_time": "May 12, 2022, 09:07:22 AM",
  "content": "CRYPTONAIRE WEEKLY MAGAZINE 233RD EDITION IS OUT NOWThe #1 CRYPTO TRADING MAGAZINE❖ Latest Crypto News Digital Magazine➖➖➖➖➖➖➖➖➖➖➖➖➖➖➖➖➖➖➖➖➖➖TerraUSD (UST) the algorithmic stablecoin of the Terra blockchain lost its peg to the US dollar and dropped to a low of $0.67 on May 10. Terra’s LUNA token, which is used to back UST has also been in a tailspin plunging more than 52% on May 9.Analysts fear that if the Luna Foundation Guard, tasked to defend the peg of the UST to USD, is forced to liquidate its Bitcoin holdings, that could create more panic and result in further liquidations.On-chain market intelligence firm Glassnode highlighted in a recent report that Bitcoin had declined between 77.2% to 85.5% from the all-time high during the bear markets of 2015, 2018 and 2020. Network profitability has also declined to the precapitulation levels seen during 2018, late 2019 bear and March 2020. Glassnode warned that “further downside remains a risk, and would be within the realm of historical cycle performance.\"Bitcoin turned down from the 20-day exponential moving average (EMA) on May 5 and plunged below the $37,000 support. This aggravated selling and the BTC/USD pair plummeted to $32,933 as we had projected in our previous analysis.The sharp fall of the past few days has pulled the relative strength index (RSI) into the oversold zone, indicating that the selling may have been overdone in the short term. This points to a possible consolidation or a relief rally in the near term.The bulls are likely to defend the zone between $30,000 and $28,800 with all their might but the recovery is likely to face stiff resistance in the zone between $33,670 and $34,886.If the price turns down from this zone aggressively, it will suggest that the sentiment remains negative and traders are selling at higher levels. That could increase the possibility of a break below $28,800. If that happens, the pair may enter a capitulation phase and drop to $25,000 and later to $20,000.On the upside, the 20-day EMA is the key level to keep an eye on. If the price rises and maintains above this level, it will suggest that bears may be losing their grip. The pair could then rally to $37,000.Lastly please check out the advancement’s happening in the cryptocurrency world.Enjoy the issue!Featuring in this week's Edition:- Bancambios- Playpoint- Smartchem (SMAC)- AppZaloot- Artex- Ernest in Disguise- Yieldchain- CleanCarbon- World Mobile Token- PlutusFi- ZiberBugs- Faith Tribe- Solidray- Loop VenturesRead MoreCRYPTO TRADE OPPORTUNITIESBitcoin Recovers to $32K After Dipping Below $30K to 10-Month LowThree new crypto ETFs to begin trading in Australia this weekCrypto presents golden opportunity for UK to take back financial crown post-BrexitTerra Stablecoin Peg Slips Below $0.70—Despite Loan From Bitcoin ReservesArtex: Bring Art Investment to the Next Level!Ernest Comics Nexus: Welcome to our Launch PresentationBancambios Announces the Launch of its First ESG-driven DeFi INDEXCleanCarbon Opens up Second Token Pre-Sale for All, Launch Set on May 08WMT token listed on Eight Exchanges: KuCoin,ZB, Bitrue, BItmart, MuesliSwop, SundaeSwop, Minswop and MEXC GlobalFaith Tribe: An Inclusive Platform For Fashion NFTs!Solidray: A Safe Space for the Blockchain Community#Bancambios #Playpoint #Smartchem(SMAC) #AppZaloot #Artex #ErnestinDisguise #Yieldchain #CleanCarbon #WorldMobileToken #PlutusFi #ZiberBugs #FaithTribe #Solidray #LoopVentures #CryptonaireWeekly #platinumcryptoacademy #Binance #Bitcoin #Ethereum #Ripple #Litecoin #Ecosystem #DayTrading #BTC #digitalcurrency #digitalcurrencymarket #DayTrading #Cryptocurrencyexchanges #digitalexchangeCW - Website Workhttps://www.platinumcryptoacademy.com/cryptonaireweekly/edition233/10th-may-2022",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5398278",
  "comments": []
}