{
  "id": "topic_5403490",
  "title": "buwaytress",
  "author": "buwaytress",
  "created_time": "June 21, 2022, 02:01:24 PMLast edit: April 10, 2025, 01:56:56 PM by buwaytress",
  "content": "This is the discussion thread for the Europa Conference League, the newly-created third-tier UEFA club competition that started its inaugural in the 2021/22 season.Champions League thread can be found here: https://bitcointalk.org/index.php?topic=5403488Europa League thread can be found here: https://bitcointalk.org/index.php?topic=5403489Hi guys! New thread now self-moderated. Appreciate also if you use the report function for spam. Kindly keep the discussions to the correct thread!The 2023/24 season starts on 12 July 2023 with the first qualifying rounds. Official schedule is here: https://www.uefa.com/uefaeuropaconferenceleague/++++++++++++++++Reference and Past Season threads:Previous season thread from 2021/22 here: https://bitcointalk.org/index.php?topic=5342840Season 2022/23 winner: West Ham (FT - Fiorentina 1:2 West Ham)Season 2023/24 winner: Olympiacos (AET - Olympiacos 1:0 Fiorentina)",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5403490",
  "comments": [
    {
      "author": "mia_houston",
      "created_time": "June 21, 2022, 02:20:06 PM",
      "body": "Thanks bro for opening a new thread and hopefully we will see a healthy discussion here without any spam, btw what about the old thread you created, has it been locked? oh yeah, if you can slightly differentiate the writing on the current thread title, because if you look at the old thread, you will definitely find a little confusion from the members here who discuss the Europa League instead posting in the Conference League thread and vice versa.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Coyster",
      "created_time": "June 22, 2022, 02:59:02 PM",
      "body": "Quote from: mia_houston on June 21, 2022, 02:20:06 PMThanks bro for opening a new thread and hopefully we will see a healthy discussion here without any spam, btw what about the old thread you created, has it been locked? Yeah it has been locked, you can find the link to the old thread in the OP to see that it has been locked, and since spam is the major reason why it was locked, i do hope users try and stay on-topic and make quality posts in this thread.Quote from: mia_houston on June 21, 2022, 02:20:06 PMoh yeah, if you can slightly differentiate the writing on the current thread title, because if you look at the old thread, you will definitely find a little confusion from the members here who discuss the Europa League instead posting in the Conference League thread and vice versa.If i understood you correctly, are you saying users unknowingly post about the UEFA Europa League in the thread for Europa Conference League and vise versa, if that be the case then i doubt the problem stems from the thread titles/subject as they are both clearly different for any user to see them, such users are either not reading or not paying attention. Prolly now that the thread is self moderated we would see less of that mistake.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LTU_btc",
      "created_time": "June 22, 2022, 11:01:11 PMLast edit: September 10, 2023, 10:01:46 PM by LTU_btc",
      "body": "Here is the fulll result of First qualifying round:Some teams goes directly to Second qualifying round and here is result of it:I really love to bet on these qualifiers of UEFA cups, there is so much value. When these games will be played, I'll try to share some picks. And I think that it's not bad draw for my country clubs, I hoppe that at least 2 of 3 will go to next round.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "leea-1334",
      "created_time": "July 06, 2022, 07:37:55 AM",
      "body": "I did not know a new league thread was made,,, old one led me here.Not sure if I will follow it this season since Spurs were knocked out by just defaulting on Covid (I still think Conte kind of made a mistake there but anyway health is priority).I noticed 2 draws last night happened with qualifying so no decision yet and tonight 2 more games:Inter Turku - DritaVikingur - EuropaSounds Northern Europe maybe Icelandic and,,, Eastern Europe?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LTU_btc",
      "created_time": "July 07, 2022, 10:34:36 PM",
      "body": "Damn, today in the morning I made post with some tips for Conference league qualifiers, but I simply didn't ''Post'' button. And my post didn't even got saved in drafts. Well, shit happens sometimes . Considering that we had 26 games today, nothing strange that some had unexpected outcome. Magpies from Gibraltar (first time when I hear this team) beat Crusaders from N. Ireland 1:0. Olimpija failed to beat Differdange from Luxembourg. Tre Fiori from San Marino won against Fola away 0:1. Odds for it were @9.00Estonian Paide made big upset in high scoring game and won 3:2 against Tbilisi Dinamo away. Other Estonian team won against SJK 1:0. Great day for Estonian football. Solid performance by Polish clubs, Pogon and Lechia won their games 4:1.P.S. I follow UEFA cups qualifiers for very long time, but even for me there is so many teams that I hear for the first time. It's either their debut in Europe or they return to it after very long time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "morvillz7z",
      "created_time": "July 08, 2022, 12:42:01 AMLast edit: May 13, 2023, 11:41:04 PM by morvillz7z",
      "body": "This should have been a 33-total odds winner if not for Dun. Streda's own goal, but even with a push it is still a decent win for me.Here's another winner, my \"transfermarkt parlay\", picked the biggest difference in squad market value between opponents, in today's matches it was the two Polish teams and Dunajska Streda.As you can see, i was all over Lechia Gdansk...i found info that the team from N. Macedonia lost the majority of its players in the offseason due to financial problems. Funny thing, the game was interrupted for a good 30-40 minutes due to a fight between Lechia fans. They were warned that if there was another incident after the delay, they would be forced to forfeit the game. The Lechia hooligans deserve credit for staying put the rest of the game.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "morvillz7z",
      "created_time": "July 14, 2022, 02:58:30 PMLast edit: July 15, 2022, 12:46:51 AM by morvillz7z",
      "body": "Bump!  ∆ Paide - Dinamo Tbilisi BTTS @1.61 ∆ XI watched extended highlights from the first leg and can say Dinamo is the far superior team. They are excellent at controlling the tempo and creating chances, but they are dreadful defensively. All three of the Estonian goals came after a slew of individual blunders by Dinamo defenders, i mean so many mistakes...This can't be fixed in a week or with subs, so Paide will have their chances, and the result from the first leg works in their favor. I'm positive we will see goals here...∆ Dunajska Streda DNB + FK Buducnost +0.5 @2.07 ∆  wonGiven the difference in quality between the teams, Cliftonville is fortunate to be only one goal down. The team from Northern Ireland is as close as to amateurs as it can get. Given the result of the first leg, Dun. Streda will not rotate and will field their best squad. Anything else than a victory for the visitors will come as a huge surprise.Buducnost impressed me, they have very good strikers up front and could have scored at least 2-3 goals more in the first game.∆ Decic - Dinamo Minks BTTS @1.99 ∆  wonFelt like an extremely open match (based on the highlights that i watched), can't really say which team is the favorite to advance, but i expect goals, both ways.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Boristhecat",
      "created_time": "July 14, 2022, 03:53:49 PM",
      "body": "Quote from: morvillz7z on July 08, 2022, 12:42:01 AMSo many unknown teams for me. Congratulations on your successful bet. Do you bet based only on the odds provided by the bookmakers or do you do a deeper analysis? It just seems to me that it will be difficult to find serious information on teams from the \"small\" leagues. Given the peculiarities of the League of Conferences, here among the participants there may be a team from the 2nd or even the third hundred in European football.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LTU_btc",
      "created_time": "July 14, 2022, 08:54:29 PM",
      "body": "There is some big upsets so far in Conference League qualifiers. Probably main one is club from San Marino Tre Fiori managed to beat Fola from Luxembourg (odds were @6.00). Such things doesn't happen often. St. Josephs from Gibraltar beat Larne @8.50.Good day for Faore Islands, 2 of their 3 teams reached next round. Maybe Vikingur win against Europa FC isn't surprise, but B36 Torshavn win after penalties against Borac Banja Luka isn't expected.Flora is biggest chokers today. They had 2:0 lead (3:0 total), but then conceded 2 goals, got red card, conceded another goal and game moved to extra time. In extra time they got another red card and left with 9 players conceded another goal and lost game 4:2 against SJK.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "buwaytress",
      "created_time": "July 16, 2022, 06:58:51 AM",
      "body": "Quote from: LTU_btc on July 14, 2022, 08:54:29 PMThere is some big upsets so far in Conference League qualifiers. Probably main one is club from San Marino Tre Fiori managed to beat Fola from Luxembourg (odds were @6.00). Such things doesn't happen often. St. Josephs from Gibraltar beat Larne @8.50.Good day for Faore Islands, 2 of their 3 teams reached next round. Maybe Vikingur win against Europa FC isn't surprise, but B36 Torshavn win after penalties against Borac Banja Luka isn't expected.Flora is biggest chokers today. They had 2:0 lead (3:0 total), but then conceded 2 goals, got red card, conceded another goal and game moved to extra time. In extra time they got another red card and left with 9 players conceded another goal and lost game 4:2 against SJK.6/1 is an upset, but not even as big as Spartak Moskow beating Napoli last season (Europa, but it's the result I remember well). The problem with teams from San Marino and Malta, they're so hard to tell -- mercenaries mostly and not nationals, coming up against local boys from a low-ranked nation.Does kind of happen a lot too actually, and I suspect Conference will add to those numbers.Flora killed me plenty too and I think there's good value in identifying teams who're saddled with their country's ranking (Iceland for example or even Flora for Estonia).Hope you made money!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "swogerino",
      "created_time": "July 16, 2022, 07:06:33 AM",
      "body": "Quote from: buwaytress on July 16, 2022, 06:58:51 AMQuote from: LTU_btc on July 14, 2022, 08:54:29 PMThere is some big upsets so far in Conference League qualifiers. Probably main one is club from San Marino Tre Fiori managed to beat Fola from Luxembourg (odds were @6.00). Such things doesn't happen often. St. Josephs from Gibraltar beat Larne @8.50.Good day for Faore Islands, 2 of their 3 teams reached next round. Maybe Vikingur win against Europa FC isn't surprise, but B36 Torshavn win after penalties against Borac Banja Luka isn't expected.Flora is biggest chokers today. They had 2:0 lead (3:0 total), but then conceded 2 goals, got red card, conceded another goal and game moved to extra time. In extra time they got another red card and left with 9 players conceded another goal and lost game 4:2 against SJK.6/1 is an upset, but not even as big as Spartak Moskow beating Napoli last season (Europa, but it's the result I remember well). The problem with teams from San Marino and Malta, they're so hard to tell -- mercenaries mostly and not nationals, coming up against local boys from a low-ranked nation.Does kind of happen a lot too actually, and I suspect Conference will add to those numbers.Flora killed me plenty too and I think there's good value in identifying teams who're saddled with their country's ranking (Iceland for example or even Flora for Estonia).Hope you made money!A fun fact is that teams who won the first game were eliminated in their second one while playing at home,Partizan Tirana was eliminated from a Georgian team in the extra time after penalties.They thought that they had achieved qualification since the first leg and took things to easy,result them being eliminated from penalties.It is true that Conference league will have many upset results with the passing of time as teams here are not of so much different in quality and even bookies are having hard times finding the correct odds.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "buwaytress",
      "created_time": "July 16, 2022, 11:48:41 AM",
      "body": "Quote from: swogerino on July 16, 2022, 07:06:33 AMA fun fact is that teams who won the first game were eliminated in their second one while playing at home,Partizan Tirana was eliminated from a Georgian team in the extra time after penalties.They thought that they had achieved qualification since the first leg and took things to easy,result them being eliminated from penalties.It is true that Conference league will have many upset results with the passing of time as teams here are not of so much different in quality and even bookies are having hard times finding the correct odds.Yeah, I've really been eyeing the Georgian teams in since Georgia topped their group in Nations League 2 years ago. They took me some nice big wins last year (Dinamo Tblisi especially, man those guys are so unpredictable).Rijeka because of forum friends I keep an eye on too but these 2-legged affairs are amazing to bet on the away team (bookies boost them for no reason) or on the underdog (bigger teams I think have more money on the line, so skew the odds).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "buwaytress",
      "created_time": "July 20, 2022, 09:04:41 AM",
      "body": "Missed a great opp yesterday I believe with Hibernians getting a home win, think the odds were 7/1 if I remember correctly. Today's few games are very tight, I'd stay away as they're all touch and go odds wise around 2/1.But tomorrow we have some interesting prospects:Liepeja are 136/10 against Young Boys (though the Swiss did last beat United in UCL haha).Lincoln Red Imps are 9/1 against Tobol Kostanay FC Milsami 10/1 against Kuopion PalloseuraI've already put down bets on the first 2, tomorrow another =)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Boristhecat",
      "created_time": "July 20, 2022, 02:39:32 PM",
      "body": "Quote from: buwaytress on July 20, 2022, 09:04:41 AMMissed a great opp yesterday I believe with Hibernians getting a home win, think the odds were 7/1 if I remember correctly. Today's few games are very tight, I'd stay away as they're all touch and go odds wise around 2/1.But tomorrow we have some interesting prospects:Liepeja are 136/10 against Young Boys (though the Swiss did last beat United in UCL haha).Lincoln Red Imps are 9/1 against Tobol Kostanay FC Milsami 10/1 against Kuopion PalloseuraI've already put down bets on the first 2, tomorrow another =)136/10 means 13,6 odds?At the moment there is an opportunity to bet on Liepaja with odds of 15 (on stake.com) and 12 on Milsami. You must have been a bit hasty as their quotes continue to fall. By the way, the bet on Liepaja looks tempting because they play at home and the odds are huge, but why Lincoln Red Imps and Milsami? They play away.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "buwaytress",
      "created_time": "July 20, 2022, 03:20:44 PM",
      "body": "Quote from: Boristhecat on July 20, 2022, 02:39:32 PMQuote from: buwaytress on July 20, 2022, 09:04:41 AMMissed a great opp yesterday I believe with Hibernians getting a home win, think the odds were 7/1 if I remember correctly. Today's few games are very tight, I'd stay away as they're all touch and go odds wise around 2/1.But tomorrow we have some interesting prospects:Liepeja are 136/10 against Young Boys (though the Swiss did last beat United in UCL haha).Lincoln Red Imps are 9/1 against Tobol Kostanay FC Milsami 10/1 against Kuopion PalloseuraI've already put down bets on the first 2, tomorrow another =)136/10 means 13,6 odds?At the moment there is an opportunity to bet on Liepaja with odds of 15 (on stake.com) and 12 on Milsami. You must have been a bit hasty as their quotes continue to fall. By the way, the bet on Liepaja looks tempting because they play at home and the odds are huge, but why Lincoln Red Imps and Milsami? They play away.Away teams get shafted on odds, just for being the away team -- and on this scale, I doubt there's a big difference for them. Red Imps, for example, share one stadium with all Gibraltar teams, so it's not really like they know what an away stadium is like, and not like their home stadium is like an Anfield.I'm not convinced in Europa and Conference home advantage matters so much (certainly for some clubs but not all).Yeah odds have fallen on Liepeja but it's always touch and go with that, sometimes you get it worse, I didn't mind taking one rightaway.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "morvillz7z",
      "created_time": "July 21, 2022, 02:39:35 PMLast edit: July 21, 2022, 06:52:35 PM by morvillz7z",
      "body": "∆ Basel 1HF + Antwerp ML + MOL Fehervar ML @1.93 ∆  XThere are so many matches to choose from today, but i particularly like this three-team parlay on some of the heavy favorites. Confs. League favorites have shown to be more consistent in the early rounds than in the Champions League, where there have been numerous upsets. Don't expect either of Crusaders, Drita, or Gabala to do anything away from home. MOL won a prestigious pre-season friendly against Galatasaray, while Antwerp defeated Dyn. Kyiv and Salzburg.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "buwaytress",
      "created_time": "July 21, 2022, 03:54:29 PM",
      "body": "There's another interesting underdog to take and that's Crusaders at 31/1 at Fairlay. I'm actually skipping this one though, as Basel are the opponents. It would be a perfect opp to bet on the other leg if Basel win this by 2 goals or more Liepeja were 15/1 yesterday according to Boristhecat, but are now 11/1 -- so either way, not a good take today anymore.Lincoln Red Imps were 9/1 and 11/1 today! IF you'd put money down even on both yesterday, your value evens out-ish.FC Milsami 10/1 yesterday are over 11/1 today.The safer bet of course is to take handicaps for all 3, even money, if just one of them doesn't lose, you're in profit. But since there's no fun in that, I'd rather win one of those and pocket at least 6x profit good luck on the parlay @morvillz7z, I think it's decent, just not my leaning on these tight rounds.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LTU_btc",
      "created_time": "July 21, 2022, 09:27:43 PM",
      "body": "was lazy to post my bets for today's games. In outcome I managed to make some profit. Probably most interesting game and biggest upset was Vorskla win 3:2 AIK. On paper it was home game for Vorskla, but they had to play in Sweden. AIK were favorites, but they had to equalize score twice. But in 2nd half Vorskla scored 3rd goal and won game.Not bad day for Polish clubs. Lech and Rakow won their games big, Lechia achieved draw with heavy favourite Rapid. Only Pogon isn't happy probably after draw with Brondby at home.Didn't expected that Riga FC will win so big against Ruzomberok - 0:3. What else, maybe Saburtal win against FCSB isn't expected, but it's just 1:0.In general, not many big surprises, in many games everything will be decided in 2nd leg.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Joca97",
      "created_time": "July 21, 2022, 09:33:53 PM",
      "body": "Some really bad results in this confrence league. Expected like last week to win a huge bet but now was miles away.Hopefully in the rematch round we see some wins. A lot of favorites didnt win such as Basaksehir,Rapid and others",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}