{
  "id": "topic_5460290",
  "title": "Amjado711",
  "author": "Amjado711",
  "created_time": "July 19, 2023, 06:39:00 AM",
  "content": "Hello Everyone!! I post this topic to discuss what is the best mining devise to use for mining Bitcoin from home and what is the expected time period to get the investment back? Experts please don't hesitate to share your thoughts.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5460290",
  "comments": [
    {
      "author": "Wapfika",
      "created_time": "July 19, 2023, 06:48:25 AM",
      "body": "You can check Bitmain website https://www.bitmain.com/ to seeall the miners specs and profit calculator because you are the only one that can answer what’s the best for you since your actual condition such as electricity cost, budget, target profit and other factor is highly needed to find the perfect miner that suits to your need. Asic miner is noisy if you will put this at your home. Make sure to have a profer sound proof on the room that you will place it so that it will not affect your daily life.You can use the forum marketplace if you want a second hand asic miner.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sesterceshop",
      "created_time": "July 19, 2023, 07:00:41 AM",
      "body": "That would depend on several factors, including hash rate, power consumption, and cost. Some of the most cost-efficient ones are in my opinion the Antminer S19 Pro (110 TH/s at 3250 watts), T19 (84TH/s at 3150 watts), or the Whatsminer M30S++ (112 TH/s at 3400 watts).The profitability of mining depends on various factors, such as BTC price, the difficulty of mining, and the cost of electricity. So it's crucial to do your own research and consider all factors before investing in a mining machine.To estimate the expected ROI, you can use the various calculators found online such as https://www.asicminervalue.com/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oshosondy",
      "created_time": "July 19, 2023, 08:12:33 AM",
      "body": "Quote from: Amjado711 on July 19, 2023, 06:39:00 AMI post this topic to discuss what is the best mining devise to use for mining Bitcoin from home and what is the expected time period to get the investment back? You want to mine bitcoin from home. My suggestion would be to use ASIC too, they are the only mining machines that can be used to mine bitcoin for now. Among them, buying Bitmain Antminer would be good. There are other products too but Bitmain Antminer has been the best. You need to know that ASIC are miners that make noise very well. For your home, you may need noice reducer or war that is noise proof. The noise from ASIC can really be disturbing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Crypt0Gore",
      "created_time": "July 19, 2023, 11:44:07 AM",
      "body": "You can get a online calculator for Bitcoin asic miners, use website called Whattomine you will see the most profitable asic miner on the platform and also how much they made present every 24 hours.I do have an advice for you, that's about your electricity, see, mining is more fun when your electricity is free or almost free, if your bill on electricity is very affordable then you should have been mining for a long time already, what took you this long?Electricity bill is the no1 enemy of crypto mining, do not forget this.The amount of Sats you will make depends on Bitcoin mining difficulty and in USD value that depends on the present value of Bitcoin for that day, I will like if you can start mining this year before the halving, because miners will start making less after the halving in 2024, whatever you mine till then, it's wise to HODL all your Bitcoin till the next ATH, probably in 2025.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FP91G",
      "created_time": "July 19, 2023, 01:57:30 PM",
      "body": "Quote from: Amjado711 on July 19, 2023, 06:39:00 AMHello Everyone!! I post this topic to discuss what is the best mining devise to use for mining Bitcoin from home and what is the expected time period to get the investment back? Experts please don't hesitate to share your thoughts.What is the maximum electricity consumption limit for your home and what is the price of your electricity?Then subtract your household electricity consumption from the maximum electricity consumption limit to know what limit you can use for mining. Don't forget about Litecoin and Bitcoin halving.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Amjado711",
      "created_time": "July 19, 2023, 04:07:34 PM",
      "body": "So if I have the option between ASIC or build a Mining Rig  with graphic cards which one be more beneficial?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "risingtide",
      "created_time": "July 20, 2023, 05:38:57 AM",
      "body": "You can of can check profitability using the F2pool site https://www.f2pool.com/minersThe problem with buying a miner is that you need to pay the entire machine cost up front along with hosting and cooling while keeping your electricity costs low enough to profit. Another option is to buy an NFT that represents a share of a mining farm like what Digimint is doing: https://bitcointalk.org/index.php?topic=5460406.new",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sesterceshop",
      "created_time": "July 20, 2023, 05:43:13 AM",
      "body": "Quote from: Amjado711 on July 19, 2023, 04:07:34 PMSo if I have the option between ASIC or build a Mining Rig  with graphic cards which one be more beneficial?   It depends on your goals and circumstances. If you want to mine a specific cryptocurrency that has a stable and profitable algorithm, and you have enough money to invest in an ASIC and pay for the electricity costs, then an ASIC might be a good choice for you. However, if you want to mine different cryptocurrencies or have more flexibility and adaptability in your mining operation, and you have a lower budget or cheaper electricity costs, then a GPU mining rig might be a better option for you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "prosmmservice",
      "created_time": "July 20, 2023, 02:37:20 PM",
      "body": "Quote from: Crypt0Gore on July 19, 2023, 11:44:07 AMYou can get a online calculator for Bitcoin asic miners, use website called Whattomine you will see the most profitable asic miner on the platform and also how much they made present every 24 hours.I do have an advice for you, that's about your electricity, see, mining is more fun when your electricity is free or almost free, if your bill on electricity is very affordable then you should have been mining for a long time already, what took you this long?Electricity bill is the no1 enemy of crypto mining, do not forget this.The amount of Sats you will make depends on Bitcoin mining difficulty and in USD value that depends on the present value of Bitcoin for that day, I will like if you can start mining this year before the halving, because miners will start making less after the halving in 2024, whatever you mine till then, it's wise to HODL all your Bitcoin till the next ATH, probably in 2025.Can you tell how much electricity consumption will be in an hour?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotFuzzyWarm",
      "created_time": "July 20, 2023, 03:35:14 PMLast edit: July 20, 2023, 10:38:18 PM by NotFuzzyWarm",
      "body": "Quote from: prosmmservice on July 20, 2023, 02:37:20 PMQuote from: Crypt0Gore on July 19, 2023, 11:44:07 AM...Electricity bill is the no1 enemy of crypto mining, do not forget this....Can you tell how much electricity consumption will be in an hour?Same kind of question: Can you tell me how many miles-per-gallon a car gets?Just as with a car, you need to specify what miner you are asking about. There are many many different miners and they pull anywhere from 15w/hr for a small USB stick miner to over 5kw/hr for a large over-clocked miner.These days a typical large miner will be pulling anywhere from ~2.5kWh to around 3.5kWh.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FP91G",
      "created_time": "July 20, 2023, 07:57:21 PM",
      "body": "Quote from: Crypt0Gore on July 19, 2023, 11:44:07 AMYou can get a online calculator for Bitcoin asic miners, use website called Whattomine you will see the most profitable asic miner on the platform and also how much they made present every 24 hours.I do have an advice for you, that's about your electricity, see, mining is more fun when your electricity is free or almost free, if your bill on electricity is very affordable then you should have been mining for a long time already, what took you this long?Electricity bill is the no1 enemy of crypto mining, do not forget this.The amount of Sats you will make depends on Bitcoin mining difficulty and in USD value that depends on the present value of Bitcoin for that day, I will like if you can start mining this year before the halving, because miners will start making less after the halving in 2024, whatever you mine till then, it's wise to HODL all your Bitcoin till the next ATH, probably in 2025.Electricity bills are not enemies, but the main expenses. The electricity bill affects the cost of mining, and if this cost is high, then it is better to check everything on a calculator first, and then buy bitcoin instead of ASIC. In most cases, it is impossible to mine bitcoins at home on modern ASICs due to the high power consumption.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sim_card",
      "created_time": "July 22, 2023, 04:18:18 PM",
      "body": "It depend on how much that you intend putting into mining. You should know that mining is expensive because if the cost of electricity bill is high,there is every possibility that you will not make profit. But if the cost is low or affordable, you need to buy an ASIC miner and a noise proof. In my country, the cost of electricity is very high and I would prefer buying bitcoin instead of mining bitcoin because it is very risky.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FP91G",
      "created_time": "July 22, 2023, 06:17:39 PM",
      "body": "Quote from: Sim_card on July 22, 2023, 04:18:18 PMIt depend on how much that you intend putting into mining. You should know that mining is expensive because if the cost of electricity bill is high,there is every possibility that you will not make profit. But if the cost is low or affordable, you need to buy an ASIC miner and a noise proof. In my country, the cost of electricity is very high and I would prefer buying bitcoin instead of mining bitcoin because it is very risky.A new ASIC for 100-110 terahash and a good noise box can be bought within 2200-2500 dollars. Some of the profit can be spent on electricity to buy more ASICs, and not save money to pay electricity bills. But if electricity is expensive, then it is better to buy coins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dansus021",
      "created_time": "July 25, 2023, 02:49:21 AM",
      "body": "I usually check it on https://www.asicminervalue.com/ or https://whattomine.com/minersLet me take example of what to mine website in there you can see that Antminer L7 generates 20.31$ per day and if you have 0.1$ per kwh electricity than you can still 12 $ in the pocket but ofcourse it just plain math you need to figure it out about maintenance cost and then internet cost and pool luck but most of the miner have a lot of noise but in my case L7 there is guys on youtube that made it Silent https://www.youtube.com/watch?v=nnfbY7PuyZ0",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "safar1980",
      "created_time": "July 25, 2023, 02:08:46 PM",
      "body": "Quote from: dansus021 on July 25, 2023, 02:49:21 AMI usually check it on https://www.asicminervalue.com/ or https://whattomine.com/minersLet me take example of what to mine website in there you can see that Antminer L7 generates 20.31$ per day and if you have 0.1$ per kwh electricity than you can still 12 $ in the pocket but ofcourse it just plain math you need to figure it out about maintenance cost and then internet cost and pool luck but most of the miner have a lot of noise but in my case L7 there is guys on youtube that made it Silent https://www.youtube.com/watch?v=nnfbY7PuyZ0After 10 days, your ASIC will generate $11-12 per day, but you will still pay $8 for electricity.Until August 5, you gave the correct profit data, but already on August 6, instead of 12 dollars, only 4 dollars will come into your pocket if other miners do not join the litecoin mining.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dansus021",
      "created_time": "July 26, 2023, 12:40:52 AM",
      "body": "Quote from: safar1980 on July 25, 2023, 02:08:46 PMAfter 10 days, your ASIC will generate $11-12 per day, but you will still pay $8 for electricity.Until August 5, you gave the correct profit data, but already on August 6, instead of 12 dollars, only 4 dollars will come into your pocket if other miners do not join the litecoin mining.Yeah it fluctuates because the price of crypto sometimes when the market hit a low or makes a lower low on candlestick the profitable can be minus too. or the energy prices is up like the past couple of month  Oil price seems going up again",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "KiaKia",
      "created_time": "July 26, 2023, 12:08:53 PM",
      "body": "Someone is flashing off s19 making 8$ per day on TikTok the other day, and I replied that it's going to be good for only him, because some people can't keep running their rigs with 3000+ watt drawings, so advertising that the rig makes 8$ per day without telling his buyers to do some calculation on electricity consumption and bills first is misleading.For me its all about the electricity bills, if you are already paying high amount per KW then don't do it, you are better off running a less-consuming setup, like a single GPU or set up node or something else..For many that's the case, they are better off using that money they got to buy Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FP91G",
      "created_time": "July 26, 2023, 07:33:48 PM",
      "body": "Quote from: KiaKia on July 26, 2023, 12:08:53 PMSomeone is flashing off s19 making 8$ per day on TikTok the other day, and I replied that it's going to be good for only him, because some people can't keep running their rigs with 3000+ watt drawings, so advertising that the rig makes 8$ per day without telling his buyers to do some calculation on electricity consumption and bills first is misleading.For me its all about the electricity bills, if you are already paying high amount per KW then don't do it, you are better off running a less-consuming setup, like a single GPU or set up node or something else..For many that's the case, they are better off using that money they got to buy Bitcoin. For many ASICs, there are different firmware options, from the most energy efficient to maximum performance with increased power consumption. But if electricity is more expensive than 6 cents and the miner still has additional costs, then of course the profit will not please the miner.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FP91G",
      "created_time": "August 02, 2023, 06:55:05 PM",
      "body": "Quote from: 401kbitcoin on August 02, 2023, 06:26:16 AMIf you want to mine from home using a GPU on your PC then look for a trusted and reputable mining software that will enable that for you. Cudo Miner is a good miner that can be used to set up mining farms from unused computing power.Watch here: https://youtu.be/YYnbZM2wox8In order to make money at home now on video card mining, you must have a large house and a special place to install equipment. There are no profitable coins for video cards now, so it’s better to buy asics for bitcoin mining if the cost of electricity is not more than 6 cents.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}