{
  "id": "topic_5468074",
  "title": "NakanoMann96",
  "author": "NakanoMann96",
  "created_time": "September 25, 2023, 04:08:10 PM",
  "content": "No pense que volveria a usar este foro y menos que haria una publicacion aqui pero que bien que me acorde de el. Lo que me trae hoy aqui es una duda con respecto a un sitio de NFTs.Mis padres son artistas venden su arte en fisico y entienden nada de este mundo de las crypto. Hace un par de dias una persona a traves de facebook les envio un mensaje diciendoles que estaba interesado en comprar un cuadro suyo, como yo entiendo ingles mucho mejor que ellos me pidieron que me encargara de leer y constestar sus mensajes, desde un inicio esta persona me parecio sospechosa pero la redflag de verdad fue cuando dijo que deseaba comprar las obras pero no en fisico sino como NFTs y me envio un enlace al sitio web que utilizaba para comprar y vender NFT.https://artsealtd.com/El sitio no aparece listado en Google y no encuentro informacion alguna de ese sitio en ningun otro lado, estoy casi seguro queves algun tipo de estafa pero no estoy 100% seguro.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5468074",
  "comments": [
    {
      "author": "albert0bsd",
      "created_time": "September 25, 2023, 04:20:48 PMLast edit: September 25, 2023, 04:31:32 PM by albert0bsd",
      "body": "Utiliza paginas para detectar si alguin sitio es legitimo o confiable, tal vez alguien ya lo a reportardo antes, en este caso es negativo, pero esta marcado que el sistio es muy nuevo.https://www.islegitsite.com/check/artsealtd.com/En mi opinion huele a estafaLa mayoria de los proyectos NFT de arte son un timo total.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DdmrDdmr",
      "created_time": "September 25, 2023, 05:43:05 PM",
      "body": "La site referenciada en el OP es muy similar a esta otra:Code:https[dos puntos]//mintartcraft[punto]com/index[punto]phpCon ella, comparte la disposición de los apartados, los Términos del Servicio, etc. Esto de por sí no es un indicador seguro de nada: pueden ser sites legítimas de los mismos gestores, o fraudulentas. No he encontrado más clónicos, pero en otras ocasiones pueden aparecer muchas sites con un contenido similar, denotando plantillas, lo cual es un mecanismo usual en los sitos montados para timar.La site en sí indica que \"©2020 All rights reserved\", cuando el WhoIs del site indica que el dominio fue creado el 15/09/2023 (ver https://who.is/whois/artsealtd.com). Esto es incongruente de por sí.Realmente no controlo el ámbito de los NFTs, pero puestos a venderlo en alguna plataforma (de darse el caso), no veo porqué acudir a un site de recién creación habiendo sites ya consolidados en el mercado.De ser una estafa, no acabo de ver qué ganan. Puede que te pidan criptomonedas para poder listarlo y ahí esté el quid de la cuestión, o que cobres a través de ellos y no recibas el pago (en todo caso, teniendo el arte físico, este aspecto parecería no ser de primer orden).Es interesante la última frase de los Términos de Servicio:QuoteThese Terms of Service and your use of our Website or services shall be governed by and construed in accordance with the laws of [Jurisdiction]. Insértese el valor correspondiente en la plantilla ([Jurisdiction]) …",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NakanoMann96",
      "created_time": "September 25, 2023, 08:54:34 PM",
      "body": "Quote from: DdmrDdmr on September 25, 2023, 05:43:05 PMLa site referenciada en el OP es muy similar a esta otra:Code:https[dos puntos]//mintartcraft[punto]com/index[punto]phpCon ella, comparte la disposición de los apartados, los Términos del Servicio, etc. Esto de por sí no es un indicador seguro de nada: pueden ser sites legítimas de los mismos gestores, o fraudulentas. No he encontrado más clónicos, pero en otras ocasiones pueden aparecer muchas sites con un contenido similar, denotando plantillas, lo cual es un mecanismo usual en los sitos montados para timar.La site en sí indica que \"©2020 All rights reserved\", cuando el WhoIs del site indica que el dominio fue creado el 15/09/2023 (ver https://who.is/whois/artsealtd.com). Esto es incongruente de por sí.Realmente no controlo el ámbito de los NFTs, pero puestos a venderlo en alguna plataforma (de darse el caso), no veo porqué acudir a un site de recién creación habiendo sites ya consolidados en el mercado.De ser una estafa, no acabo de ver qué ganan. Puede que te pidan criptomonedas para poder listarlo y ahí esté el quid de la cuestión, o que cobres a través de ellos y no recibas el pago (en todo caso, teniendo el arte físico, este aspecto parecería no ser de primer orden).Es interesante la última frase de los Términos de Servicio:QuoteThese Terms of Service and your use of our Website or services shall be governed by and construed in accordance with the laws of [Jurisdiction]. Insértese el valor correspondiente en la plantilla ([Jurisdiction]) …Exactamente eso es lo que me tiene intrigado, ¿que diablos ganan con todo esto?, no segui respondiendo los mensajes de la persona supuestamente interesada asi que desconozco si deseaba que yo invirtiera criptos(vaya iluso porque yo no manejo Ethereums), por curiosidad me registre en la pagina con una contraseña y nombre de usuario distintos a los que suelo usar: Lo primero que note es que no tiene ningun tipo de verificación, cosa usual para cualquier sitio de compra venta, lo segundo es que solo tiene una opcion para retirar o depositar fondos en ETH desconozco si funcione pero creo que eso descarta que se trate de physing, Lo tercero es que la persona que contacto a mis padres dijo estar dispuesta a pagar 1600 £... ¿Libras esterlinas? ¿Lightcoins? Debi preguntarle pero tampoco queria parecer demasiado interesado.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DdmrDdmr",
      "created_time": "September 26, 2023, 06:45:45 AM",
      "body": "Creo que los enlaces abajo referenciados encajan perfectamente con la descripción de tu caso. Aunque fuese a través de una red social distinta a la mencionada, la mecánica es la misma. Los artículos base no describen exactamente el timo que hay detrás, pero deja caer que te incitan a pagar un fee del gas por subir el NFT a la plataforma. En los comentarios del primer hilo hay uno más explícito, que cita como le reclamaron un equivalente a 400$ en este concepto. Otro cita lo que sospechaba: una vez hecha la venta en la plataforma, te piden cripto/dinero para poder sacar lo recibido (cosa que acabas no recibiendo). El hilo sigue, y verás amplias muestras de lo que sucede …Ver:https://artsology.com/blog/2022/12/nft-scams-directed-towards-artists-on-instagram/https://artsology.com/blog/2023/03/update-on-the-nft-scam-directed-at-artists-via-instagram/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hispo",
      "created_time": "September 26, 2023, 10:05:57 AM",
      "body": "Aparte de lo que ya han dicho mis compañeros sobre la posibilidad de que esto realmente se trate de una estafa, cabe destacar que si realmente alguien quisiera comprar un NFT de un artista, no sería necesario el enviar una página o un enlace como lo hicieron.Solo sería cuestión de que la persona interesada hiciera saber en cual red quisiera recibir el token no fungible y proporcionar una dirección. El cliente paga primero y luego se le envía a su address la obra digitalizada. Hiciste bien en preguntar por aquí.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NakanoMann96",
      "created_time": "September 27, 2023, 04:49:51 AM",
      "body": "Me alegro de que mis padres me avisaran con tiempo de esto porque en efecto es tal y como dicen mas arriba, la pagina tiene varios bugs notables una vez que haces una cuenta (no la hice al principio porque no sabia que podia encontrarme) y en efecto en el apartado donde se suben los dichosos NFT pide un fee de 0.15 ETHNo se si el estafador pensaba venderles ethereum a mis padres para luego que se lo volvieran a depositar o si de verdad creia que mis padres, un par de jubilados que apenas saben usar el telefono, tienen alguna cripto lolBueno hasta ahi llego el misterio, si se le puede llamar asi. Gracias a todos los que comentaron por su interés en ayudarme, se los agradezco.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DdmrDdmr",
      "created_time": "September 27, 2023, 07:20:13 AM",
      "body": "Quote from: NakanoMann96 on September 27, 2023, 04:49:51 AM<…>Me imagino que, si uno no tiene experiencia en criptomonedas, los timadores estarán encantados de guiarles en el proceso de adquisición y custodia, siendo, tal y como indicas, otro potencial punto para exprimir en su plan.En todo esto, entiendo que van cambiando la web que utilizan para sus timos (en los comentarios de uno de los enlaces se citan distintas alternativas a las vistas aquí), o más bien, y casi con más probabilidad, hay distintos individuos o grupos que intentan realizar este tipo de timos bajo un esquema conceptual afín, pero con una implementación distinta.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}