{
  "id": "topic_5530471",
  "title": "Yablee0",
  "author": "Yablee0",
  "created_time": "February 13, 2025, 03:07:22 AM",
  "content": "It very sad to know that despite the amazing things bitcoin has done in the crypto space many are still doubting it to be scam. Not knowing it value and potential that can change there life completely.Investing in bitcoin could bring you life time fortunes because it appreciate in value over time, however, delay in bitcoin investment due to reason best known to you is automatically setting you backwards. Message to bitcoin investors : stop the delay, keep buying (investing) bitcoin in large portion as you can, because Bitcoin is nowere close to it's peak.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5530471",
  "comments": [
    {
      "author": "SilverCryptoBullet",
      "created_time": "February 13, 2025, 03:39:35 AM",
      "body": "Quote from: Yablee0 on February 13, 2025, 03:07:22 AMIt very sad to know that despite the amazing things bitcoin has done in the crypto space many are still doubting it to be scam. Not knowing it value and potential that can change there life completely.You can doubt Bitcoin is a scam project in 2009, or some years after that but now in 2025, 16 years since 2009, it's unrealistic and too skeptical to consider it as a scam project while the world are adopting it at wider scale and with very sharp speed.QuoteMessage to bitcoin investors : stop the delay, keep buying (investing) bitcoin in large portion as you can, because Bitcoin is nowere close to it's peak. It's not too early or too late to invest in Bitcoin. People still have a lot of time, but if they can invest now, they have good advantage against later comers who will have to compete each other to buy bitcoin at higher prices.Thinking it is too late to buy bitcoin now only makes you FOMO, that's not good.Plan your personal finance, make your investment strategy like with Dollar Cost Averaging and patiently accumulate bitcoin.https://dcabtc.com/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "RagnarTheThunderer",
      "created_time": "February 13, 2025, 04:01:52 AM",
      "body": "I understand why some people still doubt bitcoin but skepticism is common with new financial technologies. Over the years, bitcoin has proven its value as a decentralized and scarce asset. While it's true that bitcoin has appreciated significantly, investing should always be a personal decision based on research and risk tolerance. Instead of rushing, it's better to stay informed and make strategic investments. Adoption will grow as more people see its long term benefits.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitzizzix",
      "created_time": "February 13, 2025, 04:08:32 AM",
      "body": "And for now, as far as I know, there has been no negative news or anything about Bitcoin and all the news that has happened about Bitcoin is positive and different from Bitcoin at that time. And for those who are still holding back from buying or getting involved with Bitcoin, I think it might be because they don't understand or comprehend Bitcoin well and also its high volatility scares them, and it seems like if they knew how to handle and understand Bitcoin, they would definitely buy it right away, especially if they knew the potential of Bitcoin for the long term. And all of that takes a process because knowledge about Bitcoin can only be obtained with the initiative to find out and also do research that not everyone has that ability, but in the end they will remain involved over time after they know the potential of Bitcoin and also the good news that continues to emerge.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Despairo",
      "created_time": "February 13, 2025, 04:38:11 AM",
      "body": "The titles remind me to so called financial advisor or marketing executive who're actually a scammer, they make people FOMO'ed by saying \"if you not do this, you're not successful\", \"if you late, you're not successful\" something like that.Quote from: Yablee0 on February 13, 2025, 03:07:22 AMMessage to bitcoin investors : stop the delay, keep buying (investing) bitcoin in large portion as you can, because Bitcoin is nowere close to it's peak. Wwwait, Bitcoin investors are people who own Bitcoin, the advice should be for non Bitcoin investors. Honestly I don't like such suggestion since it force people to all in on Bitcoin, most people can't take such risk to see their money at floating loss.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "February 13, 2025, 04:59:35 AM",
      "body": "Bitcoin is a decentralized payment system that is created to help people find that \"exit\" out of the centralized fiat system and take back their financial sovereignty. Bitcoin was not created so that people can invest in it and \"get-rich-quick\".When you start topics like this and advertise bitcoin like this, you are actually contributing to the FUD that bitcoin is just a \"get rich quick\" scheme that needs new people investing in it to survive!!!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kotajikikox",
      "created_time": "February 13, 2025, 05:42:29 AM",
      "body": "Quote from: Yablee0 on February 13, 2025, 03:07:22 AMIt very sad to know that despite the amazing things bitcoin has done in the crypto space many are still doubting it to be scam. Not knowing it value and potential that can change there life completely. At this point, if one still is hesitant in bitcoin it is no longer bitcoin's or the community's fault. They are now being ignorant on purpose. Because all kinds of information they would need to change how they think of bitcoin and crypto as a whole is on the internet and available for consumption so if they are not doing their part then there is no hope left there.QuoteInvesting in bitcoin could bring you life time fortunes because it appreciate in value over time, however, delay in bitcoin investment due to reason best known to you is automatically setting you backwards. If you are not investing in bitcoin just because you do not believe it to be valuable even after the year it's had last year then there is no more point in arguing with you but if someone has put off investing in bitcoin due to financial reasons or rather the lack of it, then I wish you good luck and for you to find the right window to still be able to buy at quite a cheap price.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EluguHcman",
      "created_time": "February 13, 2025, 06:01:18 AM",
      "body": "You don't have to be sad over their untimely decisions to Invest in but yet because every investors has a readiness made up mindedness because they invests and that could be of several reasons like they.They need to be more convinced of how truly Bitcoin is of it possessions and realistically and need as much time as they could before building up their emotions so they could be able to handle the threats that the market may proof all the well since Bitcoin is a fluctuating and a long time demanded holding asset.However, most of us here learnt Bitcoin was a scam from a begining and we doubted it all the and also made delays so, you don't expect the today's era community adoption of Bitcoin to assume they should suddenly believe in it.You don't just have to blame then that much because it is not as easy to invest on decentralized asset of no authority regulations and still can not physically feel your assets like the physical markets materials are.There is absolutely no lateness in investing on Bitcoin otherwise we would had been late nomatter the few years we have just bumped into investing in it after several doubts and delays.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oshio-man",
      "created_time": "February 13, 2025, 06:28:23 AM",
      "body": "Not that people don't know that bitcoin is not a scam, just that they are scared of the risk involved if you want to earn income from bitcoin, because bitcoin is not control by the government, but the moment they remove the fear and invest in bitcoin, they will begin to enjoy the benefits of bitcoin and they will like to introduce bitcoin to their relatives because they know is very good for people to invest in bitcoin, You make me to remember when I eliminated fear to embrace the risk to use my first salary to buy small bitcoin and hold for few weeks before I sold them off to earn income, I'm saving some funds that I will use to buy bitcoins once the price dump to $50k again.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackBoss_",
      "created_time": "February 13, 2025, 06:28:36 AM",
      "body": "Quote from: pooya87 on February 13, 2025, 04:59:35 AMBitcoin is a decentralized payment system that is created to help people find that \"exit\" out of the centralized fiat system and take back their financial sovereignty. Bitcoin was not created so that people can invest in it and \"get-rich-quick\".When you start topics like this and advertise bitcoin like this, you are actually contributing to the FUD that bitcoin is just a \"get rich quick\" scheme that needs new people investing in it to survive!!!Bitcoin is the only, and consequently best decentralized cryptocurrency. People want to find \"Bitcoin killers\", a more decentralized cryptocurrency and more things with altcoins but they don't know that they only have it with Bitcoin, especially in decentralized, no censorship, and security, it's best.\"Get rich quick\" scheme is for altcoins, and they must know another thing, if they are lucky enough to get rich quick, later they will get poor quick too. Fast comes fast goes, it's altcoins.Bitcoin is not get rich quick tool, but if you can hold bitcoin with time like several years, you will get richer easily.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fuguebtc",
      "created_time": "February 13, 2025, 07:53:24 AM",
      "body": "Quote from: Yablee0 on February 13, 2025, 03:07:22 AMIt very sad to know that despite the amazing things bitcoin has done in the crypto space many are still doubting it to be scam. Not knowing it value and potential that can change there life completely.Investing in bitcoin could bring you life time fortunes because it appreciate in value over time, however, delay in bitcoin investment due to reason best known to you is automatically setting you backwards. But you should also know that bitcoin is not the only investment or path in the world that helps people change their lives or become rich. Everyone has different preferences, tastes and mindsets so there is nothing wrong and no one is left behind if they choose not to invest in bitcoin and choose a different path. Bitcoin is a financial market, which means there will be winners and losers, and it all depends on each person's ability, knowledge and experience. Don't think everyone can change their life and become rich by investing in bitcoin, don't confuse that and give indiscriminate investment advice to others or criticize them just because they don't invest in bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fikrett",
      "created_time": "February 13, 2025, 07:57:31 AM",
      "body": "Quote from: fuguebtc on February 13, 2025, 07:53:24 AMBut you should also know that bitcoin is not the only investment or path in the world that helps people change their lives or become rich. Everyone has different preferences, tastes and mindsets so there is nothing wrong and no one is left behind if they choose not to invest in bitcoin and choose a different path. Bitcoin is a financial market, which means there will be winners and losers, and it all depends on each person's ability, knowledge and experience. Don't think everyone can change their life and become rich by investing in bitcoin, don't confuse that and give indiscriminate investment advice to others or criticize them just because they don't invest in bitcoin.Agreed. The market exists so that there would be those who have a green PNL and those who have a red one, it's the nature of it.And BTC is no magic wand - it's more than that and always had multiple sides to it, besides the investment one. Though, of course, many out there look at it only in that way.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pandorak",
      "created_time": "February 13, 2025, 08:23:25 AM",
      "body": "Quote from: Yablee0 on February 13, 2025, 03:07:22 AMIt very sad to know that despite the amazing things bitcoin has done in the crypto space many are still doubting it to be scam. Not knowing it value and potential that can change there life completely.Although Bitcoin has great potential in the future, but that's only for those who know it, on the other hand there are many people who don't even know what Bitcoin is, more precisely don't want to find out, even though in this era it is very easy to access everything.I have several friends who understand what cryptocurrency and Bitcoin are, but until now they have never bought it, there are many reasons ranging from not having capital, unwillingness to invest, fear of taking risks, etc. QuoteInvesting in bitcoin could bring you life time fortunes because it appreciate in value over time, however, delay in bitcoin investment due to reason best known to you is automatically setting you backwards. Basically nothing is certain, everything has risks including Bitcoin, but if you say to invest in a minimum of 4 years or more, which means long-term, I agree because in the future more and more people will recognize and adopt Bitcoin, it will trigger a significant price increase and have an impact on the profits of investors.Quote from: pooya87 on February 13, 2025, 04:59:35 AMWhen you start topics like this and advertise bitcoin like this, you are actually contributing to the FUD that bitcoin is just a \"get rich quick\" scheme that needs new people investing in it to survive!!!That's right buddy, if only giving advice that seems to force to buy everyone can also do it, in my opinion it is better to explain the reasons why they should buy Bitcoin and store it in the long run, this will be more useful for those who do not know yet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlockExplorer24",
      "created_time": "February 13, 2025, 08:28:41 AM",
      "body": "Quote from: Yablee0 on February 13, 2025, 03:07:22 AMIt very sad to know that despite the amazing things bitcoin has done in the crypto space many are still doubting it to be scam. Not knowing it value and potential that can change there life completely.Investing in bitcoin could bring you life time fortunes because it appreciate in value over time, however, delay in bitcoin investment due to reason best known to you is automatically setting you backwards. Message to bitcoin investors : stop the delay, keep buying (investing) bitcoin in large portion as you can, because Bitcoin is nowere close to it's peak. Investing in Bitcoin? Yes, but not blindly! This kind of message triggers **FOMO (Fear of Missing Out)**, which can be risky. Bitcoin is a volatile asset, and while its adoption and value have skyrocketed, a **DCA (Dollar-Cost Averaging)** strategy is much wiser than blindly **\"buying large portions.\"**  The key is **strategy**: understanding market cycles, managing risk, and never investing more than you can afford to lose. **Bitcoin has huge potential, but smart investing always beats reckless enthusiasm!** 🚀",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Free Market Capitalist",
      "created_time": "February 13, 2025, 08:29:34 AM",
      "body": "Well, although I share the OP's message in spirit first I have to say that saying it here right in this forum is not going to make much of an impact. Those of us who have been investing in bitcoin for a long time are not going to be influenced and forum members who don't buy because they are in a tight financial situation or are degenerate gamblers, things like that, are not going to be influenced either. But there are a lot of people out there who are investing for example in bonds or bad stock funds who could gain a lot by investing even a part in bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "john_egbert",
      "created_time": "February 13, 2025, 08:30:52 AM",
      "body": "Quote from: pooya87 on February 13, 2025, 04:59:35 AMBitcoin is a decentralized payment system that is created to help people find that \"exit\" out of the centralized fiat system and take back their financial sovereignty. Bitcoin was not created so that people can invest in it and \"get-rich-quick\".When you start topics like this and advertise bitcoin like this, you are actually contributing to the FUD that bitcoin is just a \"get rich quick\" scheme that needs new people investing in it to survive!!!Yes, totally. It's about getting an alternative to what is already here, and that is better at many factors that affect many out there, not about getting a fortune out of thin air.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tabas",
      "created_time": "February 13, 2025, 08:34:52 AM",
      "body": "Quote from: Yablee0 on February 13, 2025, 03:07:22 AMIt very sad to know that despite the amazing things bitcoin has done in the crypto space many are still doubting it to be scam. Not knowing it value and potential that can change there life completely.Investing in bitcoin could bring you life time fortunes because it appreciate in value over time, however, delay in bitcoin investment due to reason best known to you is automatically setting you backwards. We cannot please every people even if the proof are very visible and can be seen by naked eye for all of the years that Bitcoin has been there. Quote from: Yablee0 on February 13, 2025, 03:07:22 AMMessage to bitcoin investors : stop the delay, keep buying (investing) bitcoin in large portion as you can, because Bitcoin is nowere close to it's peak. There is no delaying on it. But we've got some situation for each of us that makes us able and unable to invest even if we want to. So, the freest can do whatever they can with their money, spare or not and we'd continue to invest for as long as we can because we know where this is going. As you've said, this is a life changing asset and this is gonna be our future and fortune.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hero_the_bossman",
      "created_time": "February 13, 2025, 08:36:29 AM",
      "body": "Quote from: tabas on February 13, 2025, 08:34:52 AMQuote from: Yablee0 on February 13, 2025, 03:07:22 AMIt very sad to know that despite the amazing things bitcoin has done in the crypto space many are still doubting it to be scam. Not knowing it value and potential that can change there life completely.Investing in bitcoin could bring you life time fortunes because it appreciate in value over time, however, delay in bitcoin investment due to reason best known to you is automatically setting you backwards. We cannot please every people even if the proof are very visible and can be seen by naked eye for all of the years that Bitcoin has been there. If we are happy with ourselves - it's all that matters in the end.Peace of mind in knowing that all is going according to your own plans and actions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "knowngunman",
      "created_time": "February 13, 2025, 08:50:27 AM",
      "body": "Quote from: Yablee0 on February 13, 2025, 03:07:22 AMIt very sad to know that despite the amazing things bitcoin has done in the crypto space many are still doubting it to be scam. Not knowing it value and potential that can change there life completely.Yeah it has a potential to change their life completely in either ways. Investing in bitcoin is capable of changing your life for good and at the same ruin your life if you don't do it properly or knowing the right channel. Don't be too excited about investing in bitcoin because it's risk you don't know how it ends. Oh yeah, I know no risk, no gain  Quote Investing in bitcoin could bring you life time fortunes because it appreciate in value over time, however, delay in bitcoin investment due to reason best known to you is automatically setting you backwards.No, your fortune is not tie to bitcoin investment. A larger percentage of people are not bitcoin holder, investor or trader yet doing absolutely fine. To invest in bitcoin is by choice and you can do that at your own wish and time. Quote Message to bitcoin investors : stop the delay, keep buying (investing) bitcoin in large portion as you can, because Bitcoin is nowere close to it's peak. I would rather advise to invest what you can afford to lose.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fikrett",
      "created_time": "February 13, 2025, 09:23:51 AM",
      "body": "Quote from: knowngunman on February 13, 2025, 08:50:27 AMQuote from: Yablee0 on February 13, 2025, 03:07:22 AMMessage to bitcoin investors : stop the delay, keep buying (investing) bitcoin in large portion as you can, because Bitcoin is nowere close to it's peak. I would rather advise to invest what you can afford to lose. Totally right. Because otherwise, you may need your funds back, and you may sell off your bags when they are all in red, with BTC only or not. That's when the situation may become bleak for a person.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}