{
  "id": "topic_5501540",
  "title": "Assiduous",
  "author": "Assiduous",
  "created_time": "June 30, 2024, 04:46:10 PM",
  "content": "Most people invest in Bitcoin already Financially successful. Seeing their success, many have decided to invest. But as a new investor, be careful in (ETF) investing. Robert Kiyosaki warns against investing in Bitcoin exchange-traded funds (ETFs). He prefers to invest in real bitcoins, calling bitcoin ETFs fake bitcoins.Last Thursday, Kiyosaki explained on social media platform X why he doesn't invest in bitcoin ETFs, saying he avoids them \"for the same reason\" he doesn't buy gold or silver ETFs.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5501540",
  "comments": [
    {
      "author": "Hazink",
      "created_time": "June 30, 2024, 04:53:35 PM",
      "body": "Investors who chose to invest in a bitcoin ETF are those who like doing things by the book and also fall under the category of those who don't want to take care of their own fund security; rather, they want another person to be responsible for their holding security. What Robert Kiyosaki means by saying those ETF Bitcoins are fake is not that they are scams, but he is just trying to warn the new investors that they actually don't own any real Bitcoin in reality. They pay for Bitcoin, and they get their asset fund manager to add the value they purchased to their asset dashboard; in reality, they are just figures that can be deleted and re-added.  If it's not your key, it's actually not your coin. You can't decide where to send it, when to withdraw it, or when not to. You need permission before you can do anything with your ETF holdings, which is entirely against the true purpose of bitcoin. Anyone who truly wants to own a bitcoin should just go to the market, buy the one you can afford, move it to a self-custodial wallet, and be in full control of those holdings. Only then can you be very sure that you own bitcoin and that you are fully in charge of those holdings.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mindrust",
      "created_time": "June 30, 2024, 04:55:36 PM",
      "body": "It makes no difference if he or other people ignore the ETF's completely. There are many people who won't. It is because these products are already out. There will always some people who will be using these ETF's. Even if most people ignore them, the issuer of the ETF's will be buying their own shares to manipulate the markets. That's how Goldman has been doing it on gold/silver for decades.Robert says don't touch the ETF's. Alright fine. I am not doing it. Will it change a thing? No it won't. Then why even care?Sometimes I think he is saying stuff just for the sake of saying it. It seems to me he only wants to get interaction from people.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OgNasty",
      "created_time": "June 30, 2024, 05:56:33 PM",
      "body": "Obviously not paying a management fee is better than paying a management fee. That is unless you mismanage your Bitcoin. While he has some good points, the ETFs also have advantages. I myself even own some in a retirement account for tax free gains. They serve a purpose, whether or not Rob wants to admit it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Z-tight",
      "created_time": "June 30, 2024, 06:24:22 PM",
      "body": "Institutional investors would buy BTC through spot etf's, even if we tell them that they are not buying BTC in the right way, and the only way to truly own BTC is if you have your own keys, because not your keys, is not your coins. I would not buy BTC through spot etf's, but if people find it suitable to do, then each to their own, people even do worse things, like storing their coins in centralized exchanges, i know it is similar to buying BTC through etf's, but i think it is worst.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Silberman",
      "created_time": "June 30, 2024, 07:40:36 PM",
      "body": "Quote from: Assiduous on June 30, 2024, 04:46:10 PMMost people invest in Bitcoin already Financially successful. Seeing their success, many have decided to invest. But as a new investor, be careful in (ETF) investing. Robert Kiyosaki warns against investing in Bitcoin exchange-traded funds (ETFs). He prefers to invest in real bitcoins, calling bitcoin ETFs fake bitcoins.Last Thursday, Kiyosaki explained on social media platform X why he doesn't invest in bitcoin ETFs, saying he avoids them \"for the same reason\" he doesn't buy gold or silver ETFs.This is common sense but at the end there is nothing for us to do, for years there was a struggle to get ETFs approved, so it is kind of nonsensical for all of those that waited for their approval to ignore them now, so if a person wants to use them they are free to do it, I just hope they understand the underlying risks they are taking, and they do not come to regret their decision to not invest in bitcoin directly like most of us have done for years.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "348Judah",
      "created_time": "June 30, 2024, 07:46:17 PM",
      "body": "Quote from: Assiduous on June 30, 2024, 04:46:10 PMMost people invest in Bitcoin already Financially successful. Seeing their success, many have decided to invest. But as a new investor, be careful in (ETF) investing. Robert Kiyosaki warns against investing in Bitcoin exchange-traded funds (ETFs). He prefers to invest in real bitcoins, calling bitcoin ETFs fake bitcoins.Last Thursday, Kiyosaki explained on social media platform X why he doesn't invest in bitcoin ETFs, saying he avoids them \"for the same reason\" he doesn't buy gold or silver ETFs.Bitcoin ETF is not bitcoin investment, there is difference, ETF is a centralized investment on organizational bonds and shares and this is totally outside the bitcoin network because it have to do with fiats and centralized institutions and organizations, while bitcoin is a cryptocurrency and is being decentralized, secondly on what we should know about the ETF of a thing is that they have to rely only on bitcoin price for their market price on what they offers to their clients, we shouldn't take it same as bitcoin investment, because you're not directly having the bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hamza2424",
      "created_time": "June 30, 2024, 07:49:43 PM",
      "body": "Quote from: Assiduous on June 30, 2024, 04:46:10 PMMost people invest in Bitcoin already Financially successful. Seeing their success, many have decided to invest. But as a new investor, be careful in (ETF) investing. Robert Kiyosaki warns against investing in Bitcoin exchange-traded funds (ETFs). He prefers to invest in real bitcoins, calling bitcoin ETFs fake bitcoins.Last Thursday, Kiyosaki explained on social media platform X why he doesn't invest in bitcoin ETFs, saying he avoids them \"for the same reason\" he doesn't buy gold or silver ETFs.This is not the first when someone used similar kinds of words for ETF but as people want to use it, no one can stop them actually it brings relief for the investors as they can enjoy security under others. Even though most of the Bitcoiners are here to support the narrative, not your key, not your funds, investors don't care about such things all they need is good returns. Now whether its just figures of real-time assets.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MeGold666",
      "created_time": "June 30, 2024, 07:54:22 PM",
      "body": "Robert Kiyosaki is a fake guru AKA a scammer.  https://www.youtube.com/watch?v=R8RiHTu2qUMCheers!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tabas",
      "created_time": "June 30, 2024, 10:35:42 PM",
      "body": "Quote from: Assiduous on June 30, 2024, 04:46:10 PMRobert Kiyosaki warns against investing in Bitcoin exchange-traded funds (ETFs). He prefers to invest in real bitcoins, calling bitcoin ETFs fake bitcoins.Last Thursday, Kiyosaki explained on social media platform X why he doesn't invest in bitcoin ETFs, saying he avoids them \"for the same reason\" he doesn't buy gold or silver ETFs.Whether he likes it or not, there are investors who will prefer to invest in Bitcoin ETFs than buy real Bitcoins. That's what they prefer to have and so if he talks something bad about it, it can't be helped. He's bullish on Bitcoin and keeps talking about it but with these adoptions that are happening to BTC, he can't stop it nor can the people that will choose it as their way of investing in this market. And he's free to invest to anything he prefers. I know that he's got a significant following and he's got the most popular book of \"Rich dad, poor dad\". Maybe some investors or those that are fans of his might listen to him.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PX-Z",
      "created_time": "June 30, 2024, 11:45:46 PM",
      "body": "ETFs are not for average bitcoiners and holders after all, it probably for institutional investors who always ask for insurance. Remember it was approved because there is an existing markets and target users of it. But just because it is not a good way to have Bitcoin it doesn't mean the majority will not get any benefit from it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "July 01, 2024, 12:25:00 AM",
      "body": "ETF's only benefit salary receivers where employers subtract tax at the payday.. because investors can then use their pre-tax income to buy shares exposed to the bitcoin market price movements before the employers subtracts tax thus get etf shares price exposure at a discount compared to buying bitcoin after tax deductionsbut this benefit is just about getting price exposure pre-tax for people taxed at source of income. you dont get the benefit of owning real bitcoin, nor the benefit of not needing a portfolio manager.. because buying ETF shares means your locked into agreements with portfolio managers and their fee's and suchbut for those self employed such as RK. there is no benefit of ETF's because he can use his other methods of self employed income to invest in real bitcoin before declaring tax so can buy real bitcoin and then assign tax profit/loss at the end of year",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackBoss_",
      "created_time": "July 01, 2024, 02:02:31 AM",
      "body": "Quote from: Assiduous on June 30, 2024, 04:46:10 PMRobert Kiyosaki warns against investing in Bitcoin exchange-traded funds (ETFs). He prefers to invest in real bitcoins, calling bitcoin ETFs fake bitcoins.Last Thursday, Kiyosaki explained on social media platform X why he doesn't invest in bitcoin ETFs, saying he avoids them \"for the same reason\" he doesn't buy gold or silver ETFs.Robert only said the truth that most of us knew.But from knowing about the risk, to practice against the risk, is different and not all of people knew about the risk will have practice against the risk.Not your keys, not your coins gives enough information on risk of storing bitcoin in custodial wallets like centralized exchanges. With Bitcoin Spot ETFs, risk is higher like doubled. Bitcoin Spot ETFs are not custodians, they hire other companies like Coinbase as a custodian.Reminder: do not keep your money in online accounts",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GreatArkansas",
      "created_time": "July 01, 2024, 02:49:33 AM",
      "body": "Quote from: Assiduous on June 30, 2024, 04:46:10 PMMost people invest in Bitcoin already Financially successful. Seeing their success, many have decided to invest. But as a new investor, be careful in (ETF) investing. Robert Kiyosaki warns against investing in Bitcoin exchange-traded funds (ETFs). He prefers to invest in real bitcoins, calling bitcoin ETFs fake bitcoins.Last Thursday, Kiyosaki explained on social media platform X why he doesn't invest in bitcoin ETFs, saying he avoids them \"for the same reason\" he doesn't buy gold or silver ETFs.I am with Robert Kiyosaki, Bitcoin is totally different in having its ETF, the essence of being decentralized on Bitcoin is likely becoming useless, and it can cause manipulation, especially in price.But we really can't avoid it, it's already here, just like what happened to Gold, where some people wanted ETF on Bitcoin because they believed that price could follow the Gold after ETF.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Smack That Ace",
      "created_time": "July 01, 2024, 02:57:19 AM",
      "body": "QuoteRobert Kiyosaki Cautions Against Bitcoin ETFsBut we cannot deny that without a bitcoin ETF, we would not be able to witness the huge influx of money into the market from traditional funds. Large funds such as Blackrock, ARK 21Shares, Fidelity will not invest in bitcoin if the ETF is not approved. Investing through ETFs, we will not own real bitcoin, but that is not something everyone is interested in, especially large investment funds. What they care more about is the legitimacy of bitcoin and bitcoin ETF is the proof to prove bitcoin becomes legal. We don't even need these types of warnings because as bitcoin investors before the ETF was approved, everyone understood this. Besides, what good is a warning if we don't stop the ETFs?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hd49728",
      "created_time": "July 01, 2024, 03:00:01 AM",
      "body": "Quote from: GreatArkansas on July 01, 2024, 02:49:33 AMI am with Robert Kiyosaki, Bitcoin is totally different in having its ETF, the essence of being decentralized on Bitcoin is likely becoming useless, and it can cause manipulation, especially in price.But we really can't avoid it, it's already here, just like what happened to Gold, where some people wanted ETF on Bitcoin because they believed that price could follow the Gold after ETF.Bitcoin is different than Gold. Bitcoin with blockchain technology and its design allows us to have private keys that give us control of our bitcoin.If we buy shares of Bitcoin Spot ETFs, we don't own private keys that means we don't actually own bitcoin. We spend money but must believe that these Bitcoin Spot ETF companies and their partners play as custodians like Coinbase will run their business transparently and safely, care about their business survival and do care about customers.We don't know what they do, what will happen with them that all affect our money. Believe is only believe so investors with their own money, need to make choice that should be smart one.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oshosondy",
      "created_time": "July 01, 2024, 04:06:55 AM",
      "body": "I think this is not new but an old tweet like some weeks ago.Quote from: mindrust on June 30, 2024, 04:55:36 PMRobert says don't touch the ETF's. Alright fine. I am not doing it. Will it change a thing? No it won't. Then why even care?He cares because he knows bitcoin ETF is not the real bitcoin while letting people to know that also. Some people will not even see what he posted on X but that does means the truth should not be told.Quote from: Z-tight on June 30, 2024, 06:24:22 PMInstitutional investors would buy BTC through spot etf's, even if we tell them that they are not buying BTC in the right way, and the only way to truly own BTC is if you have your own keys, because not your keys, is not your coins. I would not buy BTC through spot etf's, but if people find it suitable to do, then each to their own, people even do worse things, like storing their coins in centralized exchanges, i know it is similar to buying BTC through etf's, but i think it is worst.ETF is safe than those having their coin left on centralized exchanges but I strongly against both because as storing your coins on centralized exchanges is like not your key not your coin, bitcoin ETFs are also indirectly like that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fruktik",
      "created_time": "July 01, 2024, 05:03:00 AM",
      "body": "Quote from: MeGold666 on June 30, 2024, 07:54:22 PMRobert Kiyosaki is a fake guru AKA a scammer.  https://www.youtube.com/watch?v=R8RiHTu2qUMCheers!And why is the exact same thought spinning in my head? Yes, all because this person himself cannot decide on his path in life. If he is successful, then why bother with things where he has little understanding of what is at stake? He makes some ridiculous predictions that almost never come true. This has been happening for several years now, but he still continues to say something there.Are there really those who still listen to him? Isn't it time to move past him and start thinking with your own head?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "avikz",
      "created_time": "July 01, 2024, 05:26:58 AM",
      "body": "Quote from: Assiduous on June 30, 2024, 04:46:10 PMMost people invest in Bitcoin already Financially successful. Seeing their success, many have decided to invest. But as a new investor, be careful in (ETF) investing. Robert Kiyosaki warns against investing in Bitcoin exchange-traded funds (ETFs). He prefers to invest in real bitcoins, calling bitcoin ETFs fake bitcoins.Last Thursday, Kiyosaki explained on social media platform X why he doesn't invest in bitcoin ETFs, saying he avoids them \"for the same reason\" he doesn't buy gold or silver ETFs.Bitcoin ETF is useless! Especially when it is extremely easy to buy real Bitcoins from the market or from an exchange. If both case, the investors will have to produce KYC documents. So it really makes no difference for an investor if he/she wants to ditch ETF and move to real Bitcoin. The only concern is security. A lot of people are not tech savy or they do not want to manage their own funds. That's where ETFs come in handy. It's secure to own ETF units than real bitcoin because then the investor do not have to worry about the security of their investment. That's the only field where ETF makes sense! otherwise, it's all in the hand of a corporate.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yazher",
      "created_time": "July 01, 2024, 06:27:04 AM",
      "body": "It depends on the capability of investors because sometimes having ETFs as one of their options to invest in bitcoins is a big advantage for others and there is no problem with that if you don't want to buy bitcoins from them and make your secured wallet and keep your bitcoins for total securities. Unlike others who don't have time to do all of that, they can simply rely on ETFs and do their daily activities without stressing themselves about their bitcoins. it is just a matter of trust and capability because if others don't do it, others see it as an opportunity.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}