{
  "id": "topic_5435597",
  "title": "wolwoo",
  "author": "wolwoo",
  "created_time": "January 17, 2023, 03:50:00 PM",
  "content": "Taşları severim, az okey oynamadık Şaka bi yana elmas zümrüt yakut safir topaz gibi değerli taşlara merakım var, daha doğrusu ilgimi çekiyor, altın gümüş paladium platin vs metaller de hakeza...para bulursam alıyorum, sertifikalı falan, çok param olsa kule dikerim ama sanki bana ucuz gibi geliyor, siz ne düşünüyorsunuz, varsa bilgileri paylaşalım",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5435597",
  "comments": [
    {
      "author": "eightdots",
      "created_time": "January 17, 2023, 08:00:06 PM",
      "body": "Şöyle zengin olamadık ki elmas zümrüt falan biriktirelim  Şaka bir yana insana kendi sevdiği şeyleri alabilmek biriktirebilmek ucuz geliyor nedense. Nedense demiyim de öyle olması normal aslında. Sevdiğin şeyleri yapmadıktan sonra gerçekten zevk alamıyorsun. Bir de o kadar çok farklılık var ki dünyada kimisinin en sevdiği şeyi başkasına bedava verseler yüzüne bakmaz. Böyle değerli taşlar hakkında bilgi sahibi değilim merakım da yok ama her türlü koleksiyon yapan kişinin kendi parçalarını tek tek anlatıp ona yüklediği anlamları dinlemeyi severim. Bir yakınımın pul koleksiyonu vardı. Otur akşama kadar dinle hangi pulu nasıl nereden aldı, hikayesi nedir gibisinden.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "wolwoo",
      "created_time": "January 17, 2023, 08:20:59 PM",
      "body": "şöyle soyliym bi çeyrek altın olmuş 2k tl, elmas zümrüt yakut falan alıyorsun 10k ortalama, tabi karat falan önemli,  biz de kiloyla almıyoruz   ama yani gerçekten inanılmaz, insanın bu taşlara dokunması sahip olabilmesi ütopik değil. bizim ülkemizde herkes 22 ayar burma bilezik, çeyrek, ata, reşat vs alıyor. nedeni de şu: alış satış arasında makas az bunlarda ama yakut alırsan yarın geri ver yüzde 40 oynuyor. yani uzun vadeli ve zevk meselesi..altın alırsan ilk sıkıştığında satarsın ama mücevher öyle değil, baya baya sıkışman gerekiyor. ayrıca fiziki gümüş ile sanal arasında fark var, bankadan şurdan burdan alırsan yüzde 10 ucuz! yok ben külçe alacam dokunacam dersen piyasa fiyatından yüzde 10 fazla ödüyor ve korumak zorunda kalıyorsun.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "RaltcoinsB",
      "created_time": "January 18, 2023, 09:58:51 AM",
      "body": "Abi metalin her türlüsü iyidir bakıyoruz da kriz esnasında fiziksel olan metaller değerli hale gelir geçmişte banka hortumlama olaylarını hatırlarsın bankalardaki gram altın hesabına güvenmiyorum yine de devlet bankalarında bunu tercih ediyorum artık zaman tamamen dijital çağa döndü yine de evde güvenli saklayabilirseniz en güzeli fiziki metaller taşların bu kadar rağbetçisi yok metal toplayın bence",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "wolwoo",
      "created_time": "January 19, 2023, 11:13:33 PM",
      "body": "Quote from: RaltcoinsB on January 18, 2023, 09:58:51 AMAbi metalin her türlüsü iyidir bakıyoruz da kriz esnasında fiziksel olan metaller değerli hale gelir geçmişte banka hortumlama olaylarını hatırlarsın bankalardaki gram altın hesabına güvenmiyorum yine de devlet bankalarında bunu tercih ediyorum artık zaman tamamen dijital çağa döndü yine de evde güvenli saklayabilirseniz en güzeli fiziki metaller taşların bu kadar rağbetçisi yok metal toplayın bence taşlar bizde rağbet görmüyor doğru, belki de insanlar \"çok pahalı\" zannettiği için almıyor. pahalı göreceli bir kavram sadece gelirle de alakalı değil \"daşa o kada para mı verilir\" diebilir bazıları ama filmlerde yabancı blegesel dizi vs bakıyorsun hep taş ön planda...ayrıca metali taşımak zor ama üç beş karatı gerektiğinde yutup dolaşabilirsin   gnelde 14-8 ayar olmakla birlikte mücevherde de altın oluyor, işçilik de koyuyorlar ama denk gelirse indirim olduğunda mücevher de alınabilir bence",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ondekinecakabilirim",
      "created_time": "January 20, 2023, 08:04:41 AM",
      "body": "Bana kalırsa hiçbir şeyin değer yok aslında. Dünyada ölümden başkası yalan demiş Candan Erçetin.  Bi taş ne kadar değerli olabilir ki diğer taşlardan. Parlaklığı, nadirliği ne kadar farklı yapabilir onu diğer taşlardan. Bana göre bolluk dönemlerinde gözü dönmüş insanlar için satılıyor bu ürünler. Lale balonu gibi. Yapay, çılgın bi talep başlatıyorlar. Endüstride karşılığı olmayan taşlar, değerli mücevheratlar astronomik rakamlara ulaşıyor. Hobisi olana saygı duyarım her zaman. Zevkler, renkler tartışılmaz bana göre. Ama taş, mücevherat gerçek değer bakımından lale soğanı balonuna yakın varlıklar bana kalırsa.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Phoenix Anka",
      "created_time": "January 20, 2023, 05:35:22 PM",
      "body": "Quote from: Ondekinecakabilirim on January 20, 2023, 08:04:41 AMBana kalırsa hiçbir şeyin değer yok aslında. Dünyada ölümden başkası yalan demiş Candan Erçetin.  Bi taş ne kadar değerli olabilir ki diğer taşlardan. Parlaklığı, nadirliği ne kadar farklı yapabilir onu diğer taşlardan. Bana göre bolluk dönemlerinde gözü dönmüş insanlar için satılıyor bu ürünler. Lale balonu gibi. Yapay, çılgın bi talep başlatıyorlar. Endüstride karşılığı olmayan taşlar, değerli mücevheratlar astronomik rakamlara ulaşıyor. Hobisi olana saygı duyarım her zaman. Zevkler, renkler tartışılmaz bana göre. Ama taş, mücevherat gerçek değer bakımından lale soğanı balonuna yakın varlıklar bana kalırsa.Bu mantıkla gidersek bir çok değer verdiğimiz şeyi iptal etmemiz lazım. Mesela bitcoin de sayılardan ibaret temelinde. Onu değerli yapan bizim ona olan güvenimiz, verdiğimiz değerdi. Burada da taşlara insanların verdiği değer ve nadirliği etkiliyor. Bence de taşlara yeteri kadar ilgi göstermiyoruz taşlar daha fazla ilgiyi hak ediyor. Pırlantalar falan. Ama işçilik çok düşüyor diye biliyorum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}