{
  "id": "topic_5472597",
  "title": "taufik123",
  "author": "taufik123",
  "created_time": "November 02, 2023, 03:40:24 PM",
  "content": "Binance mengumumkan bahwa akan melakukan Penangguhan sementara penarikan Bitcoin pada tanggal 3 November 2023 jam 02:00am UTC ( 9 Pagi WIB )Tapi untuk Fitur deposit dan perdagangan pair Bitcoin tidak akan terganggu.Ini akan berlangsung dalam waktu 30 menit. Beberapa alasan kenapa Penarikan sementara ditangguhkan karena ada pemeliharaan dompet jaringan Bitcoin dan melakukan pada 25 pasangan perdagangan Spot.https://twitter.com/binance/status/171992139467766604525 daftar tersebut dihapus karena beberapa masalah seperti Volume perdagangan dan likuiditas yang rendah.Binance pertama-tama akan menghapus - At 2023-11-03 03:00 (UTC): CAKE/BUSD, COMP/BUSD, CRV/BUSD, EOS/BUSD, FIDA/BUSD, FLOW/BUSD, GLMR/BUSD, GRT/BUSD, HFT/BUSD, ICP/BUSD, KEY/BUSD, LDO/BUSD, LEVER/BUSD- At 2023-11-03 05:00 (UTC): MAGIC/BUSD, MASK/BUSD, MKR/BUSD, MULTI/BUSD, OG/BUSD, PHB/BUSD, PYR/BUSD, SANTOS/BUSD, T/BUSD, UNI/BUSD, XMR/BUSD, XVG/BUSDhttps://www.binance.me/en/support/announcement/notice-of-removal-of-spot-trading-pairs-2023-11-03-87197e1c25dc42b8b37360a1c05515d1Jadi harus bersiap-siap dengan guncangan yang akan terjadi jika anda memegang koin yang masuk pada daftar delisting tersebut.Source:https://www.binance.me/en/support/announcement/wallet-maintenance-for-bitcoin-btc-network-2023-11-03-00e8b44c6c5d4c48a94417fe5969c47a?https://coinmarketcap.com/community/articles/65433f8c89b64400c165b542/",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5472597",
  "comments": [
    {
      "author": "armanda90",
      "created_time": "November 03, 2023, 02:28:25 AM",
      "body": "Quote from: taufik123 on November 02, 2023, 03:40:24 PMBinance mengumumkan bahwa akan melakukan Penangguhan sementara penarikan Bitcoin pada tanggal 3 November 2023 jam 02:00am UTC ( 9 Pagi WIB )25 daftar tersebut dihapus karena beberapa masalah seperti Volume perdagangan dan likuiditas yang rendah.Binance pertama-tama akan menghapus - At 2023-11-03 03:00 (UTC): CAKE/BUSD, COMP/BUSD, CRV/BUSD, EOS/BUSD, FIDA/BUSD, FLOW/BUSD, GLMR/BUSD, GRT/BUSD, HFT/BUSD, ICP/BUSD, KEY/BUSD, LDO/BUSD, LEVER/BUSD- At 2023-11-03 05:00 (UTC): MAGIC/BUSD, MASK/BUSD, MKR/BUSD, MULTI/BUSD, OG/BUSD, PHB/BUSD, PYR/BUSD, SANTOS/BUSD, T/BUSD, UNI/BUSD, XMR/BUSD, XVG/BUSDhttps://www.binance.me/en/support/announcement/notice-of-removal-of-spot-trading-pairs-2023-11-03-87197e1c25dc42b8b37360a1c05515d1Jadi harus bersiap-siap dengan guncangan yang akan terjadi jika anda memegang koin yang masuk pada daftar delisting tersebut.Source:https://www.binance.me/en/support/announcement/wallet-maintenance-for-bitcoin-btc-network-2023-11-03-00e8b44c6c5d4c48a94417fe5969c47a?https://coinmarketcap.com/community/articles/65433f8c89b64400c165b542/Barusan saya cek fitur penarikan BTC suda tersedia lagi dan masa pengangguhan sudah selesai sepertinya, untuk pengguna Binance yang mau melakukan penarikan BTC ke wallet lain sudah bisa dan tidak ada maintance lagi.Sudah beberapa minggu yang lalu Binance melakukan delisting untuk beberapa altcoin besar atau kecil dengan trading pair BUSD, secara bertahap hingga tahun depan sepertinya semua pair trading BUSD akan didelist mengingat stable koin BUSD akan dihilangkan di Binance. Namun dari semua koin yang trading pair BUSD akan dialihkan ke pair baru yaitu FUSD dan nilai dari stable koin tersebut juga sama harganya dengan USDT. Cuman akhir2 ini untuk BUSD memiliki nilai lebih rendah dibandingkan USDT, ini bisa dilihat dari market lokal Tokocrypto untuk trading pair BUSD ke IDR sangat murah dan selisih lumayan dibandingkan dengan traiding langsung ke IDR.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rampagoe004",
      "created_time": "November 03, 2023, 04:13:04 AM",
      "body": "Quote from: taufik123 on November 02, 2023, 03:40:24 PMJadi harus bersiap-siap dengan guncangan yang akan terjadi jika anda memegang koin yang masuk pada daftar delisting tersebut.Source:https://www.binance.me/en/support/announcement/wallet-maintenance-for-bitcoin-btc-network-2023-11-03-00e8b44c6c5d4c48a94417fe5969c47a?https://coinmarketcap.com/community/articles/65433f8c89b64400c165b542/Beberapa altcoin yang ane pegang disana adalah crv, mkr, dan xvg. Ya jumlahnya sih tidak banyak-banyak amat. Koin itu ane pegang udah dari kapan tahun juga karena koin-koin itu masuk ke indodax dan dulu ane berpikir kalau koin yang masuk ke indodax adalah koin yang bagus-bagus. Kalau binance kan lebih banyak jenis koinnya jadi ya makanya dulu ane mikirnya gitu. Dan itu adalah salah satu kebodohan ane waktu itu. Sampe sekarang ane enggak jual karena nilainya hanya beberapa ratus ribu saja dan kemarin malah udah jadi puluhan ribu. Ane dulu belinya atas dasar harganya masih sangat murah dan ya karena bagus aja namanya. Itu adalah kenaifan ane di jaman dulu yang telah menjadi pengalaman buat saat ini.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "taufik123",
      "created_time": "November 03, 2023, 07:28:16 AM",
      "body": "Quote from: armanda90 on November 03, 2023, 02:28:25 AMBarusan saya cek fitur penarikan BTC suda tersedia lagi dan masa pengangguhan sudah selesai sepertinya, untuk pengguna Binance yang mau melakukan penarikan BTC ke wallet lain sudah bisa dan tidak ada maintance lagi.Ya semuanya sudah normal kembali, itu hanya sekedar perbaikan server yang tidak akan menggangu aktivitas trading.Quote from: armanda90 on November 03, 2023, 02:28:25 AMSudah beberapa minggu yang lalu Binance melakukan delisting untuk beberapa altcoin besar atau kecil dengan trading pair BUSD, secara bertahap hingga tahun depan sepertinya semua pair trading BUSD akan didelist mengingat stable koin BUSD akan dihilangkan di Binance. Namun dari semua koin yang trading pair BUSD akan dialihkan ke pair baru yaitu FUSD dan nilai dari stable koin tersebut juga sama harganya dengan USDT. Tentang delisting yang dilakukan secara bertahap pada Trading pair BUSD, ini memang dilakukan karena Binance tidak akan mendukung BUSD lagi dan melakukan delisting sepenuhnya. Keputusan untuk menghapus BUSD karena SEC mengumumkan rencananya untuk menggugat Paxos Trust Company, yang merupakan penerbit BUSD. Gugatan itu berdasarkan tuduhan bahwa BUSD adalah sekuritas yang tidak terdaftar, yang memicu perhatian dan ketidakpastian dalam komunitas kripto.Bukan hanya pada BUSD, SEC jga terus memantau dan bertindak terhadap proyek-proyek kripto yang dianggap melanggar aturan.Quote from: armanda90 on November 03, 2023, 02:28:25 AMCuman akhir2 ini untuk BUSD memiliki nilai lebih rendah dibandingkan USDT, ini bisa dilihat dari market lokal Tokocrypto untuk trading pair BUSD ke IDR sangat murah dan selisih lumayan dibandingkan dengan traiding langsung ke IDR. Nilai yang lebih rendah ini juga karena orang-orang mulai panik dengan kabar delisting BUSD yang dilakukan secara bertahap. Tapi CZ juga sudah memberikan jaminan bahwa konversi akan dilakukan, karena Paxos akan mengelola konversi dan menyimpan cadangan BUSD sepenuhnya di bank mereka.Quote from: Rampagoe004 on November 03, 2023, 04:13:04 AMBeberapa altcoin yang ane pegang disana adalah crv, mkr, dan xvg. Ya jumlahnya sih tidak banyak-banyak amat. Koin itu ane pegang udah dari kapan tahun juga karena koin-koin itu masuk ke indodax dan dulu ane berpikir kalau koin yang masuk ke indodax adalah koin yang bagus-bagus. Kalau binance kan lebih banyak jenis koinnya jadi ya makanya dulu ane mikirnya gitu. Dan itu adalah salah satu kebodohan ane waktu itu. Sampe sekarang ane enggak jual karena nilainya hanya beberapa ratus ribu saja dan kemarin malah udah jadi puluhan ribu. Ane dulu belinya atas dasar harganya masih sangat murah dan ya karena bagus aja namanya. Itu adalah kenaifan ane di jaman dulu yang telah menjadi pengalaman buat saat ini.LOL, Indodax gaj bisa jadi tolak ukur koin itu bagus atau enggak, mereka listing juga bayar dan indodax gak seketat Binance. Trus kenapa haru ditahan jangka panjang kalo belum tau potensi kedepannya, Kalo udah harga tinggi atau ATH apapun koinnya ya jual aja mumpung untung, dari[ada jadi abu. Ini juga jadi pelajaran, jangan cuman lihat nama proyek bagus atau enggal, jangan cuman lihat visualnya, tapi lakukan riset yang mendalam untuk mengetahui proyek yang dipilih bagus apa kagak. Banyak koin-koin scam yang cuman nipu investornya.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "erep",
      "created_time": "November 03, 2023, 09:59:22 PM",
      "body": "Quote from: taufik123 on November 03, 2023, 07:28:16 AMQuote from: armanda90 on November 03, 2023, 02:28:25 AMBarusan saya cek fitur penarikan BTC suda tersedia lagi dan masa pengangguhan sudah selesai sepertinya, untuk pengguna Binance yang mau melakukan penarikan BTC ke wallet lain sudah bisa dan tidak ada maintance lagi.Ya semuanya sudah normal kembali, itu hanya sekedar perbaikan server yang tidak akan menggangu aktivitas trading.Proses maintenance pada exchange merupakan Kegiatan rutinitas yang dilakukan tim exchange untuk memastikan sistem exchange berjalan dengan baik, proses maintenance pada binance dapat diandalkan karena proses tidak lama karena mereka memiliki tim profesional yang bekerja untuk membeli layanan terbaik kepada penggunannya.Quote from: taufik123 on November 03, 2023, 07:28:16 AMQuote from: armanda90 on November 03, 2023, 02:28:25 AMCuman akhir2 ini untuk BUSD memiliki nilai lebih rendah dibandingkan USDT, ini bisa dilihat dari market lokal Tokocrypto untuk trading pair BUSD ke IDR sangat murah dan selisih lumayan dibandingkan dengan traiding langsung ke IDR. Nilai yang lebih rendah ini juga karena orang-orang mulai panik dengan kabar delisting BUSD yang dilakukan secara bertahap. Tapi CZ juga sudah memberikan jaminan bahwa konversi akan dilakukan, karena Paxos akan mengelola konversi dan menyimpan cadangan BUSD sepenuhnya di bank mereka.Saya hanya sekilas pengumuman banyak delisting koin untuk pair BUSD namun tidak mengetahui detailnya terkait paxos yang sedang berurusan dengan SEC. Semoga CZ segera menangani masalah terkait dengan BUSD karena jika misalnya investor menukarkan dengan koin stabil USDT sekaligus akan mempengaruhi harga koin lain atau solusi lain investor menukarkan dengan koin kripto lainnya. Tapi kalau CZ sudah mengeluarkan pernyataan akan memberikan jaminan maka tidak ada yang perlu dikhawatirkan.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blue Snow",
      "created_time": "November 04, 2023, 01:02:21 AM",
      "body": "Quote from: taufik123 on November 02, 2023, 03:40:24 PMJadi harus bersiap-siap dengan guncangan yang akan terjadi jika anda memegang koin yang masuk pada daftar delisting tersebut.Kalau cuma perpindahan atau pergeseran dari BUSD ke FUSD, ane kira tidak akan begitu bergejolak dibanding jika benar-benar didelist tanpa diganti dengan coin lain. Kalau pun nahan token/coin seperti CRV, MKR, XMR , VYG, dll kayaknya gpp, kecuali jika coin tersebut dihapus. Namun, namanya market, semua bisa terjadi, kalau ane lihat di beberapa hchat di telegram, bahkan ada member yang sengaja tebar FUD kalau semua coin pair BUSD akan dump parah (mungkin maksudnya untuk membeli di harga murah) Tapi kalau member lainnya pintar dan smart tidak bakal bisa terpengaruh, karena kan sudah backup langsung sama binance dengan diganti dengan pair lain.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PytagoraZ",
      "created_time": "November 04, 2023, 02:09:45 AM",
      "body": "Quote from: taufik123 on November 02, 2023, 03:40:24 PMhttps://twitter.com/binance/status/171992139467766604525 daftar tersebut dihapus karena beberapa masalah seperti Volume perdagangan dan likuiditas yang rendah.Binance pertama-tama akan menghapus - At 2023-11-03 03:00 (UTC): CAKE/BUSD, COMP/BUSD, CRV/BUSD, EOS/BUSD, FIDA/BUSD, FLOW/BUSD, GLMR/BUSD, GRT/BUSD, HFT/BUSD, ICP/BUSD, KEY/BUSD, LDO/BUSD, LEVER/BUSD- At 2023-11-03 05:00 (UTC): MAGIC/BUSD, MASK/BUSD, MKR/BUSD, MULTI/BUSD, OG/BUSD, PHB/BUSD, PYR/BUSD, SANTOS/BUSD, T/BUSD, UNI/BUSD, XMR/BUSD, XVG/BUSDIni beneran kan gan koin-koin besar seperti EOS, UNI, dan XMR akan di delisting dari binance? atau hanya menghapus pair ke BUSD aja gan? Kalau sampe beneran di delisting berarti rawan banget ya memegang altcoin. Terkait penangguhan penarikan disebabkan maitanance ya gan? ane pernah ngalamin juga keknya hal serupa di indodax",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husna QA",
      "created_time": "November 04, 2023, 11:37:34 PM",
      "body": "Quote from: PytagoraZ on November 04, 2023, 02:09:45 AMIni beneran kan gan koin-koin besar seperti EOS, UNI, dan XMR akan di delisting dari binance? atau hanya menghapus pair ke BUSD aja gan? Kalau sampe beneran di delisting berarti rawan banget ya memegang altcoin. Terkait penangguhan penarikan disebabkan maitanance ya gan? ane pernah ngalamin juga keknya hal serupa di indodaxLihat saja pair koin-koin tersebut dengan koin lain selain BUSD masih ada tidak? Sepengetahuan saya yang sudah jelas akan di hapus BUSD nya, maka pair koin yang masih ada dengan BUSD itulah yang bertahap dihilangkan. Kalau perihal penangguhan Withdraw Bitcoin apalagi sudah diinfokan sebelumnya kalau itu termasuk salah satu maintenance Binance itu masih termasuk wajar sebagai tanggung jawab pada konsumen. Kalau yang seringnya maintenance dadakan tanpa informasi, ini yang mungkin merepotkan.Dari yang saya baca di salah satu media, sebelum ini Binance sudah pernah pula menghentikan sementara penarikan Bitcoin karena mengalami masalah pada jaringan Bitcoin dan berakibat pada volume transaksi banyak yang tertunda.Quote from: https://x.com/binance/status/1655380303383261185?s=20We've temporarily closed #BTC withdrawals due to the large volume of pending transactions.Our team is currently working on a fix and will reopen $BTC withdrawals as soon as possible.Quote from: taufik123 on November 02, 2023, 03:40:24 PMBinance mengumumkan bahwa akan melakukan Penangguhan sementara penarikan Bitcoin pada tanggal 3 November 2023 jam 02:00am UTC ( 9 Pagi WIB )Btw, karena Tanggal 3 November 2023 sudah lewat dan maintenance tersebut sudah selesai, mungkin OP bisa mempertimbangkan lock thread agar tidak ada kesalahpahaman terutama yang hanya membaca judul saja, karena disana dicantumkan kata \"Besok\" (tidak mencantumkan tanggal secara langsung).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}