{
  "id": "topic_5398523",
  "title": "montana25",
  "author": "montana25",
  "created_time": "May 13, 2022, 01:52:31 PM",
  "content": "is it possible UST recovered ?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5398523",
  "comments": [
    {
      "author": "Bitcoin_Arena",
      "created_time": "May 13, 2022, 11:36:18 PM",
      "body": "What? A stablecoin that is right now at $0.1, and you expect it to recover? Not a chance, it de-pegged, and protocols mean't to keep it up didn't work out but instead worsened the situation even for Luna Coin.Move on mate. I just hope you were not one of the victims.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DoublerHunter",
      "created_time": "May 13, 2022, 11:43:48 PM",
      "body": "Quote from: montana25 on May 13, 2022, 01:52:31 PMis it possible UST recovered ?^ The most people ask.UST is pegged by the dollar and it is a stable coin but even if it is a stable coin still it was dumped altogether with the LUNA coin. Dont expect too much from this coin, it will take a matter of time before this coin will recover and if LUNA has a good sign, for sure this coin UST will also have a sign to increase the price. If you have faith in them just keep holding but as I heard these coins are prone to become shitcoin which cannot recover anymore. So it is up to you now what is your decision.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zackgeno96",
      "created_time": "May 14, 2022, 02:15:38 AM",
      "body": "It is called stable coins but now look at its price, do you think something like this could still recover? and the price of the luna is no -99% in less than 3 days I don't think something like this could still recover, do you hold some UST? I saw it goes up around 40% and dump again around 35% yesterday.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Farma",
      "created_time": "May 14, 2022, 02:46:45 AM",
      "body": "Quote from: montana25 on May 13, 2022, 01:52:31 PMis it possible UST recovered ?I dunno, I think when the price hits $0.5 again, then a mass sale could happen. however, currently UST is very far from the word \"stable coin\". people may tend to sell the assets they own rather than keep these coins. The losses received by the holders are also very large, which allows them to immediately secure their assets when prices have started to recover. the considerations are many, like if this coin stabilizes again, there might be very little interest in it. people have started to lose the trust of this team.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MAAManda",
      "created_time": "May 14, 2022, 04:32:15 AM",
      "body": "Quote from: montana25 on May 13, 2022, 01:52:31 PMis it possible UST recovered ?The Terra Network and Ecosystem (LUNA) is dead, there is no hope of getting this network back to normal. Based on the tweets made by Do Kwon on his twitter account, they have tried their best to keep UST stable, instead of returning to normal, Terra (LUNA) and UST assets are getting destroyed, even now the UST price is only around $0,2.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kidbounty",
      "created_time": "May 14, 2022, 04:39:34 AM",
      "body": "Quote from: montana25 on May 13, 2022, 01:52:31 PMis it possible UST recovered ?To be able to recover requires a lot of reserve funds. and I don't think the UST team has that. if they had a 1:1 reserve fund in the first place, this crash would not have happened. luna will not fall, and ust can be controlled. but the fact is that terraform labs continues to minting luna to return peg ust.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FlamingFingers",
      "created_time": "May 14, 2022, 04:40:40 AM",
      "body": "Quote from: montana25 on May 13, 2022, 01:52:31 PMis it possible UST recovered ? it's not possible for ust to recover, Cz talked about burning, I feel they would do Redomination if they are ready to rebuild the project. This scenerio is like what led to Ethereum and Ethereum classic, the DAO hack exposed the flaw in ethereum blockchain. Likewise the fall in the market exposed the flaw in Luna-UST mechanism. Binance had relisted it y'all should be extremely careful trading it",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Google+",
      "created_time": "May 14, 2022, 05:01:15 AM",
      "body": "Quote from: montana25 on May 13, 2022, 01:52:31 PMis it possible UST recovered ?If the team is able to recover and develop it as before, then to recover and be on a good track I think it is still very possible, but so far how serious is the UST team in restoring it? this is what you need to know now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kemarit",
      "created_time": "May 14, 2022, 06:27:10 AM",
      "body": "Quote from: montana25 on May 13, 2022, 01:52:31 PMis it possible UST recovered ?Probably, but it will take a lot of money coming from Terra to stabilized their stable coins. It lost so much value that investors thinks this is really  rug pull coming from Do Kwon and his team.It's just really unfortunate, in the beginning it was Tether who has a bad reputation but they were able to survived and stay in the market. But with how UST and Terra has experience? I doubt though that it can recovered in short amount of time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joeperry",
      "created_time": "May 14, 2022, 06:56:14 AM",
      "body": "I am not sure actually but based on an investors perspective like me, the UST is supposed to be a stable coin but as you can see it drops... no it crashes to 0.1 which is very unlikely for a stable coins, now the question as an investor are you going to buy a stable coin that drops to 0.1? I think all of us don't trust it anymore so I think it won't recover anymore.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "The Sceptical Chymist",
      "created_time": "May 14, 2022, 09:23:21 AM",
      "body": "Quote from: Bitcoin_Arena on May 13, 2022, 11:36:18 PMWhat? A stablecoin that is right now at $0.1, and you expect it to recover? I knew nothing of this coin until yesterday and wasn't aware that it was imploding.  Now that I've seen a few people talk about the situation on Youtube and have seen the arrogance of UST's apparent leader (the Asian guy; can't recall his name), it's little wonder that the whole fucking thing turned into a giant disaster.And no, I don't think UST is going to \"recover\".  That would take a tremendous amount of trust on the part of the very same people who've just been burned to a crisp.  Never gonna happen.Quote from: joeperry on May 14, 2022, 06:56:14 AMnow the question as an investor are you going to buy a stable coin that drops to 0.1? I think all of us don't trust it anymore so I think it won't recover anymore.If that's a serious question on your or anyone else's part, I'd suggest getting checked for head trauma.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "goldkingcoiner",
      "created_time": "May 14, 2022, 09:42:07 AM",
      "body": "UST is dead and should not be invested in anymore. Do not get your hopes or anyone elses hopes up. It is a failed, dead coin and if the price wasn't a give-away, the suicide help hotlines posted on Terra Luna's social media should be more than a clue and a red flag.I feel sorry for the people who lost money, but there is no point in losing even more money by building up hope and throwing money at an obvious-looking ponzi scheme scam.If anything this should be a hard lesson that just because someone calls something a stablecoin, does not mean it actually is stablecoin. Especially if it is based on an algorithm. It was only a matter of time until someone found a weak spot in the algorithm. Maybe the owner himself knew it all this time and was just waiting for the right time to scam everyone.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LogitechMouse",
      "created_time": "May 14, 2022, 09:56:47 AM",
      "body": "I believe that anything is possible crypto and same goes with UST and LUNA as well.However what is the percentage of the project to recover. For me, its 0.00000001%. The developers need to do two things to have a higher chance of recovering1. Have a recovery plan for their project2. Gaining the trust again of the investors.The first one is on its way but the second one is the hardest part because of what happened to them. The de-pegging of UST caused so much trouble to all stablecoins and spread doubts to the investors. Well, I'm not expecting for the project to recover especially with that huge supply of 7 Trillion. The trust of investors to this project is gone already.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zasad@",
      "created_time": "May 14, 2022, 10:43:32 AM",
      "body": "UST will no longer be a stablecoin. The recovery of the price of the token may happen, because a lot of serious investors have invested in the project.But first, you need to buy back most of the coins as cheaply as possible and get ordinary holders to sell their coins as cheaply as possible.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nivia1st",
      "created_time": "May 14, 2022, 03:04:43 PM",
      "body": "Quote from: montana25 on May 13, 2022, 01:52:31 PMis it possible UST recovered ?very difficult unless they release new coins. but this method also has some risks. so I guess the chance of recovering is very low, even if done by any means. releasing a new coin without a 1:1 backed will just repeat the same problem. trying to buy back UST in the market requires a lot of money, and there will be another dump because there are already many who buy cheap. I think it's over, there's no hope for this project.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "$crypto$",
      "created_time": "May 14, 2022, 03:21:51 PM",
      "body": "Quote from: zasad@ on May 14, 2022, 10:43:32 AMUST will no longer be a stablecoin. The recovery of the price of the token may happen, because a lot of serious investors have invested in the project.But first, you need to buy back most of the coins as cheaply as possible and get ordinary holders to sell their coins as cheaply as possible.Not a stablecoin anymore as UST has crashed even though there is support behind to cover it I'm not sure it can reach $1 again and still be a shitcoin with LUNA.Although many investors have seriously invested here, many of them have had bad luck, the tokens which they say are stable are now destroyed because they cannot be defended.I just think investors have now dumped their tokens in this project.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Tony116",
      "created_time": "May 14, 2022, 03:52:03 PM",
      "body": "UST is backed by Luna, if DoKwon and his team can get luna back to the top, UST will recover but this possibility is very low because investors' confidence is lost. Can't imagine a coin in the top 10 of CMC in just 3 days has lost 100% of its value, this will be an unforgettable history for the crypto market. Luna is really dead.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "May 14, 2022, 05:20:22 PM",
      "body": "Quote from: montana25 on May 13, 2022, 01:52:31 PMis it possible UST recovered ?The question is what will currency developers/investors/POS benefit from returning that currency to $1.Reputation and trust are necessary in this market and this trust is difficult to restore.Therefore, there is no economic feasibility in burning millions of dollars and bringing this currency back to the $1 barrier, because it is difficult to find someone who trusts them in huge amounts.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sana54210",
      "created_time": "May 15, 2022, 08:24:58 PM",
      "body": "Quote from: LogitechMouse on May 14, 2022, 09:56:47 AMI believe that anything is possible crypto and same goes with UST and LUNA as well.However what is the percentage of the project to recover. For me, its 0.00000001%. The developers need to do two things to have a higher chance of recovering1. Have a recovery plan for their project2. Gaining the trust again of the investors.The first one is on its way but the second one is the hardest part because of what happened to them. The de-pegging of UST caused so much trouble to all stablecoins and spread doubts to the investors. Well, I'm not expecting for the project to recover especially with that huge supply of 7 Trillion. The trust of investors to this project is gone already. I do not believe that \"anything is possible\" is a great approach for crypto, I mean sure we could see realistic but also very high volatility, but if something goes from 80 bucks and more to suddenly drop under 1 cent then there is no way that it could be recovering. Sure, there could be some situation where the price could go back up a bit, like going from 1 satoshi to 200 satoshi looks like a 200x increase and could you make money that way? Maybe? But at the same time, I have to say that it is a rare situation to be in and I doubt that it would be that simple, it would take a while before we could see the team recover it and would be approached with some doubt.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}