{
  "id": "topic_5451146",
  "title": "thevoyager23",
  "author": "thevoyager23",
  "created_time": "May 03, 2023, 06:51:57 PMLast edit: May 03, 2023, 07:28:06 PM by thevoyager23",
  "content": "Is there anywhere on this forum where people discuss price action and emerging patterns and candle sticks?I am trying to learn technical analysis and price action, I am not too bad at it but there's always more to learn. Just don't have too many people to bounce ideas off.. I need to put my 'discoveries' forward for discussion and critique whilst learning from others.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5451146",
  "comments": [
    {
      "author": "logfiles",
      "created_time": "May 03, 2023, 11:11:13 PM",
      "body": "There is no completely dedicated place or thread for that.This board could be the right place, but not so many people discuss charts here.The speculation board could be another place, specifically the Wall Observer BTC/USD - Bitcoin price movement tracking & discussion thread if you are going to analyse Bitcoin, but again so many people make different posts there.Another option could be to get a good telegram group or discord server with like-minded traders where they can discuss technical Analysis without stupid thought of charging members for VIP groups",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotHatinJustTrollin",
      "created_time": "May 03, 2023, 11:48:17 PM",
      "body": "Quote from: thevoyager23 on May 03, 2023, 06:51:57 PM Is there anywhere on this forum where people discuss price action and emerging patterns and candle sticks?There may not be a specific topic on this forum that addresses your concerns, but you can find other forums and communities where you can discuss technical analysis, price action and candlestick patterns. Here are some options for you:TradingView: TradingView is a popular online platform where traders and investors can discuss market trends, share analysis, and collaborate on ideas. The platform includes a variety of tools for charting and technical analysis, and you can also create and publish your own trading ideas for others to see and comment on.Investopedia: Investopedia is a comprehensive online resource for all things related to investing and finance. The site includes articles, tutorials, and forums where traders and investors can discuss trading strategies, market trends, and emerging patterns.Reddit: Reddit is a popular platform for online discussion groups, and there are several subreddits dedicated to trading and investing. Subreddits like r/StockMarket and r/Trading discuss market trends, emerging patterns, and trading strategies. You can also connect with other traders and share your ideas and analysis.Forex Factory: Forex Factory is a community-driven platform for traders in the forex market. The site includes a forum where traders can discuss market trends, news, and emerging patterns. You can also access free tools for charting and technical analysis.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GreatArkansas",
      "created_time": "May 04, 2023, 02:26:53 AM",
      "body": "You can use the search box to search specific topic you want then there you can try to post and there could be some members who will continue the discussion if they find it interesting. And or if the topic does not yet exist, you can create a new topic then on that topic, the discussion will start.Because these days if you want a very active discussions, some are already using group chats or channels where it will be easy to do conversation/discussion with other trades.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MusaMohamed",
      "created_time": "May 04, 2023, 02:37:11 AM",
      "body": "Quote from: thevoyager23 on May 03, 2023, 06:51:57 PM Is there anywhere on this forum where people discuss price action and emerging patterns and candle sticks?I am trying to learn technical analysis and price action, I am not too bad at it but there's always more to learn.Try Awesome crypto tradingYou can manage technical analysis or price action well but you must always use stop loss order or stop-limit order for your trading position. It is prevention for your capital and helpful to reduce your capital loss when market goes bad. If you trade without preventive orders like those, it's better if you never trade cryptocurrency.Stop loss order. One of the Best Weapons in TradingStop limit order",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dansus021",
      "created_time": "May 04, 2023, 03:27:20 AM",
      "body": "https://bitcointalk.org/index.php?board=57.0 - Speculation Board is the best board that discussed about price of bitcoin and trading or pattern usually I or some member there share their chart there and discussed about it. There is bunch of title but wall of observer is right place to go",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}