{
  "id": "topic_5468068",
  "title": "AbuBhakar",
  "author": "AbuBhakar",
  "created_time": "September 25, 2023, 03:42:09 PM",
  "content": "Maybe the title seems confusing but main reason on asking it is I lost access to my email that I'm using to my old account on a specific casino. This casino account is dormant for a long time and I'm trying to play in this casino after the long break. My problem is I might accused of multiple account if I didn't disclose it to the support.I still can login my casino account but obviously I will not deposit on this since I have no way to recover it through email in case something happened on it. Is this possible to be approve?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5468068",
  "comments": [
    {
      "author": "Oshosondy",
      "created_time": "September 25, 2023, 03:50:22 PM",
      "body": "Quote from: AbuBhakar on September 25, 2023, 03:42:09 PMI still can login my casino account but obviously I will not deposit on this since I have no way to recover it through email in case something happened on it. Is this possible to be approve?Login to the casino site and you will see your email there. Go to the email website and click on forgot password and see if you will be able to recover your email.If you can be able to login, you should be able to edit your email. Isn't that possible on the casino that you are using?If you can not, contact the casino customer care.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wiwo",
      "created_time": "September 25, 2023, 03:54:48 PM",
      "body": "Quote from: AbuBhakar on September 25, 2023, 03:42:09 PMEdited outIn your case why don't you contact the casino support to see if you can have an email change,  because it is still possible to have your email address changed in some cases where you can provide some valid proof. Because doing otherwise may be against the casino rules and regulations and can affect the other account that you newly opened of if are caught trying to operate multiple accounts. Another thing is that if the said casino account is already verified and the casino is KYC compliant,  you may be unable to verify any other account using your documents since that will be against the casino rules of engagement on anti-multiple accounts.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AbuBhakar",
      "created_time": "September 25, 2023, 04:08:15 PM",
      "body": "Quote from: Oshosondy on September 25, 2023, 03:50:22 PMIf you can be able to login, you should be able to edit your email. Isn't that possible on the casino that you are using?If you can not, contact the casino customer care.Quote from: Wiwo on September 25, 2023, 03:54:48 PMIn your case why don't you contact the casino support to see if you can have an email change,  because it is still possible to have your email address changed in some cases where you can provide some valid proof. Changing an email is not possible on my account since I can't prove ownership without my email. I never done KYC on this casino which is why there's no point for me to prove ownership now thy I don't have access on my email.Just making sure that I'm not doing anything that will violate the ToS unknowingly. Support usually becomes aggressive once asked something controversial such as closure of account that I can't prove ownership aside from login details. Temporarily lock this thread. I will try to request now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}