{
  "id": "topic_5410561",
  "title": "eightdots",
  "author": "eightdots",
  "created_time": "August 20, 2022, 07:57:22 AM",
  "content": "Oğuzhan Uğur'un yaptığı Genç Bakış'a benzer program. 1. bölümde Zafer Partisi Genel Başkanı Prof. Dr. Ümit Özdağhttps://www.youtube.com/watch?v=aXpC6Q-XiUk2. bölümde HDP Milletvekili Ömer Faruk Gergerlioğlu konuk oldu. https://www.youtube.com/watch?v=sPAgNJwqZskProgramın bölümlerini izledim ve günümüz siyaset ortamında Oğuzhan Uğur'un çok farklı ve bence başarılı bir işe imza atmayı başardığını düşünüyorum. Diğer bölümlerde gelecek olan konukların ilk iki bölümü izledikten ve soruların sertliğini hissettikten sonra bazı bahaneler sunarak programa gelmekten vazgeçeceklerini düşünüyorum. Programın amaçlarından biri bu zaten yani gelen konuğun taraftarları katılıp soru soramaz ve karşı görüşe sahip kişiler en sert sorularını sorar. Bunun üzerine işliyor program. Çok farklı konuklar ve sorular görebiliriz. Twitter'da Oğuzhan Uğur'a alınan konuklar için farklı eleştiriler ya da övgüler yapıldı. Bir tweet'e verdiği cevap ise çok eleştirildi. Bu yanıtları, övgüleri ya da eleştirileri buraya koymuyorum. Sizlerin yorumlarınızı merak ediyorum.2. bölümü twitter'dan bildiğimiz \"lordsinov (Con Sinov)\" özetlemiş. Onu da buraya eklemek istiyorum.https://twitter.com/lordsinov/status/1560684375733374977?cxt=HHwWgsC44feK1agrAAAA",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5410561",
  "comments": [
    {
      "author": "gospodin",
      "created_time": "August 20, 2022, 12:53:05 PM",
      "body": "ümit özdağ ile olan programı izlemiştim. ilk olduğu için biraz sert olsa da hocam gayet güzel bir oturum gerçekleştirmişti. daha sonra oğuzhan uğur çok fazla soru olduğu için bunları önceden alıp bazılarını elemek lazım gibi bir şeyler söyledi. gergerlioğlu ile yapılan oturum bu şekilde mi oldu acaba? birazdan izlemeyi planlıyorum onu da. bu dönemde güzel bir iş çıkarıyorlar. https://twitter.com/OguzhanUgur/status/1560696102193610754ahmet davutoğlu gelecekmiş. büyük ihtimalle kısa bir zaman sonra da muharrem ince gelir. akp tarafından kimsenin geleceğini pek sanmıyorum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mandown",
      "created_time": "August 20, 2022, 01:03:23 PMLast edit: August 20, 2022, 01:28:22 PM by mandown",
      "body": "ilk bölümü izledim daha da izlemem.Sorulan soruların hiçbirine cevap görmedim hep laf çevirme ebeleme heceleme.Milletin gazının alındığı farklı bir program.Bir ülkede millet vekili karşısında vatandaş el pençe duruyorsa o ülkenin geleceği hiçbir zaman aydınlık olmaz. Hala neye oy vereceğinizi bilmiyor, birkaç saatlik videoyu izleyerek karar verecekseniz zaten sizin için umut yok.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SUPERSAIAN",
      "created_time": "August 20, 2022, 02:09:41 PM",
      "body": "İki programı da biraz başını izledim dayanamadım kapattım hiç doğru düzgün cevaplar vermiyorlar konuklar. Olsun Oğuzhan Uğur gerçekten cesur bir iş yapıyor seyirciyle konuk arasındaki gerilimi çok iyi yatıştırıyor kendisini tebrik etmek lazım. Programın ilerleyen dönemlerdeki konuklarını merak ediyorum şimdiden. Gergerlioğlu beni çıldırttı yok insan hakları savunucuymuş yok doktormuş her cümlesinde bu ikisini söyledi durdu.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "eightdots",
      "created_time": "August 20, 2022, 02:16:29 PM",
      "body": "Quote from: mandown on August 20, 2022, 01:03:23 PMilk bölümü izledim daha da izlemem.Sorulan soruların hiçbirine cevap görmedim hep laf çevirme ebeleme heceleme.Milletin gazının alındığı farklı bir program.Bir ülkede millet vekili karşısında vatandaş el pençe duruyorsa o ülkenin geleceği hiçbir zaman aydınlık olmaz. Hala neye oy vereceğinizi bilmiyor, birkaç saatlik videoyu izleyerek karar verecekseniz zaten sizin için umut yok.Milletin gazının alındığı bir program derken aynı şeyi mi izledik emin olamadım. Çatır çatır soru soruyorlar cevap veremeyen eveleyip geveleyen kalıyor öyle izleyen de anlıyor ne olduğunu. Olay nereye oy vermek değil hele ki birkaç saatlik video izleyip karar vermek hiç değil sende sürekli bir eleştirel yaklaşım var. Eleştirel yaklaşım dediysem de sadece eleştirmek için eleştirmek.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mandown",
      "created_time": "August 20, 2022, 03:06:51 PMLast edit: August 20, 2022, 03:31:54 PM by mandown",
      "body": "Eleştirmek kadar güzel birşey yoktur. Eleştirmek içinde eleştir en azından elimden gelen bu.Bir konudada dedimya 19 yıldır esnafım 19 yıl boyunca sokağın nabzını yoklayan birkaç olay gördüm siyasilerin ilçe temsilcileriden birisi biz kapıda sohbet ederken geldi ve işin güzel tarafı aynı görüşteniz. Neyse sohbet başladı dedim şimdi neden geziyorsunuz yıllardır gezmiyorsunuzda neymiş yukarıdan sokağa inmeleri söylenmiş. Dedimki senin sokaktan çıkmaman lazımdı zaten asıl görevin o.  Yıllardır bizim ne durumda olduğumuz görme. yukarıdan emir geldi sokağa in. Kafadan kaybetmiş durumdasın.Bu başladı işte biliyorsunuda vsvs durumlar zaten malum  hergün daha kötüye gidiyoruz vs deyip bozuk teyip gibi tekrara düştü zaten bunu yıllardır biliyoruz bilmediğimiz birşey söyle.Dedimki parti başkanları ne diyorsa aynını söylüyorsun söylediği bir konuya nasıl yapacaksınız diye sordum ve cevap olarak yapacağız dedi nasılın cevabı yok. Daha sorduğum sorunun cevabını veremiyorsunuz ve benden partinize oy vermemi bekliyorsunuz gerçek çözümden haberiniz bile yok dedim. Sonrada dediki ne yapabiliriz sen bize söyle. Dedimki yıllardır o koltuğa oturup sorduğum sorunun bile çözümünü benden bekliyorsan konuşmaya gerek yok.Arkadaş ben 19 yıl boyunca yaptığım işin her ayrıntısını öğrenmeyeyim sonra gidip sağa sola nasıl yapariz diyeyim ve o koltukta oturmaya devam edeyim bunun amacı çözüm değiş o koltuktan maaş almaya devam etmektir. yoksa kimseninçözüm ile ilgisi yokSiz videolardan net cevaplar alabildinizmi? Ümit özdağ 7-24 yok şu kadar mülteci yok bukadar bilmem ne biz göndereceğiz vsvs kardeşim biliyoruz her dakika zaten önümüze çıkıyor bunları nasıl yapacaksın onu anlat. al iktidarda göndereceğiz diyor.  Kardeşim sen adama kimlik vermişssin nasıl gönderiyorsun. Ülkede tek sorun mülteci sorunu sanki. Doğudaki siyanür olayının devamı ne oldu? Bilen yok Videolarda net cevaplar yok dinliyorsun baba dinliyorsun bozuk teyip gibiler. Yok çalışmış mışş yok kaldığı yerde yılan varmışmış. Bana hikaye anlatma  bana çözümünü anlat. bu ülke yıllardır böyle uyuyor. Ninni gibi Eskiden sanatçılar gündeme gelmek için sağa sola firikik gösterirdi millet vekilleride şuan gündemde ne varsa oraya atlıyor az çok yorum iki gün sonra o konu hiç akıllarında yok.3. programa muharrem ince gelecekmiş allahım hergün seçim günü neredeydiden öteye gidemeyen biri bunun nesini dinleyeceğim. Harcayacağım vakte cidden yazık. Sen daha oya sahip çıkmamışssın çocuklar gibi küstüm oynamıyorum de sonra vay efendim vazgeçtim o öyle değildide böyleydi.  Bana bunu o gece anlatacaktın.istersen 10 saat anlat. Gemi battıktan sorna öyle olmasaydı şöyle olacaktının önemi yok.Millet vekili dediğin  insan ben kafede otururken yanımda görmeyeceksem, ara sıra seçildiği ilde sokakta denk gelmeyeceksem. Kusura bakma onlar kendi dünyasını yaşıyor biz kendi dünyamızı yaşıyoruz.Millet vekili (vekil) sözcük anlamı.Quotebirinin, kendi adına iş görmesi için yetki verdiği ya da iş görmesi için kendi yerine bıraktığı kimse Bunlar napıyor? Vatandaştan çoğunun haberi yok.Bir millet vekili PKK bir terör örgütüdür diyemiyor. BU adamın maaşı pkk yüzünden ailesinden şehit edilen kişiler tarafından vergi olarak ödeniyor.Meclisimizin acilen toplanıp bunları temizlemesi gerekiyor. PKK terör örgütü diyemeyen birine harcayacak vaktim yok. Bu ülkede ne analar ne babalar ağladı yazıktır. Milletin aklıyla dalga geçmeyin.Şu zamana kadar ekonomik planımızı anlatan biri oldu mu? Cidden soruyorum aha seçim geliyor yok ötv kalkacakmış bilmemneymiş dalgamı geçiyorsunuz siz. Ötv kalkınca ekonomi mi düzeliyor. Bana planından bahset.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "eightdots",
      "created_time": "August 20, 2022, 03:38:38 PM",
      "body": "Quote from: mandown on August 20, 2022, 03:06:51 PMEleştirmek kadar güzel birşey yoktur. Eleştirmek içinde eleştir en azından elimden gelen bu.Bir konudada dedimya 19 yıldır esnafım 19 yıl boyunca sokağın nabzını yoklayan birkaç olay gördüm siyasilerin ilçe temsilcileriden birisi biz kapıda sohbet ederken geldi ve işin güzel tarafı aynı görüşteniz. Neyse sohbet başladı dedim şimdi neden geziyorsunuz yıllardır gezmiyorsunuzda neymiş yukarıdan sokağa inmeleri söylenmiş. Dedimki senin sokaktan çıkmaman lazımdı zaten asıl görevin o.  Yıllardır bizim ne durumda olduğumuz görme. yukarıdan emir geldi sokağa in. Kafadan kaybetmiş durumdasın.Bu başladı işte biliyorsunuda vsvs durumlar zaten malum  hergün daha kötüye gidiyoruz vs deyip bozuk teyip gibi tekrara düştü zaten bunu yıllardır biliyoruz bilmediğimiz birşey söyle.Dedimki parti başkanları ne diyorsa aynını söylüyorsun söylediği bir konuya nasıl yapacaksınız diye sordum ve cevap olarak yapacağız dedi nasılın cevabı yok. Daha sorduğum sorunun cevabını veremiyorsunuz ve benden partinize oy vermemi bekliyorsunuz gerçek çözümden haberiniz bile yok dedim. Sonrada dediki ne yapabiliriz sen bize söyle. Dedimki yıllardır o koltuğa oturup sorduğum sorunun bile çözümünü benden bekliyorsan konuşmaya gerek yok.Arkadaş ben 19 yıl boyunca yaptığım işin her ayrıntısını öğrenmeyeyim sonra gidip sağa sola nasıl yapariz diyeyim ve o koltukta oturmaya devam edeyim bunun amacı çözüm değiş o koltuktan maaş almaya devam etmektir. yoksa kimseninçözüm ile ilgisi yokSiz videolardan net cevaplar alabildinizmi? Ümit özdağ 7-24 yok şu kadar mülteci yok bukadar bilmem ne biz göndereceğiz vsvs kardeşim biliyoruz her dakika zaten önümüze çıkıyor bunları nasıl yapacaksın onu anlat. al iktidarda göndereceğiz diyor.  Kardeşim sen adama kimlik vermişssin nasıl gönderiyorsun. Ülkede tek sorun mülteci sorunu sanki. Doğudaki siyanür olayının devamı ne oldu? Bilen yok Videolarda net cevaplar yok dinliyorsun baba dinliyorsun bozuk teyip gibiler. Yok çalışmış mışş yok kaldığı yerde yılan varmışmış. Bana hikaye anlatma  bana çözümünü anlat. bu ülke yıllardır böyle uyuyor. Ninni gibi Eskiden sanatçılar gündeme gelmek için sağa sola firikik gösterirdi millet vekilleride şuan gündemde ne varsa oraya atlıyor az çok yorum iki gün sonra o konu hiç akıllarında yok.3. programa muharrem ince gelecekmiş allahım hergün seçim günü neredeydiden öteye gidemeyen biri bunun nesini dinleyeceğim. Harcayacağım vakte cidden yazık. Sen daha oya sahip çıkmamışssın çocuklar gibi küstüm oynamıyorum de sonra vay efendim vazgeçtim o öyle değildide böyleydi.  Bana bunu o gece anlatacaktın.istersen 10 saat anlat. Gemi battıktan sorna öyle olmasaydı şöyle olacaktının önemi yok.Millet vekili dediğin  insan ben kafede otururken yanımda görmeyeceksem, ara sıra seçildiği ilde sokakta denk gelmeyeceksem. Kusura bakma onlar kendi dünyasını yaşıyor biz kendi dünyamızı yaşıyoruz.Millet vekili (vekil) sözcük anlamı.Quotebirinin, kendi adına iş görmesi için yetki verdiği ya da iş görmesi için kendi yerine bıraktığı kimse Bunlar napıyor? Vatandaştan çoğunun haberi yok.Bir millet vekili PKK bir terör örgütüdür diyemiyor. BU adamın maaşı pkk yüzünden ailesinden şehit edilen kişiler tarafından vergi olarak ödeniyor.Meclisimizin acilen toplanıp bunları temizlemesi gerekiyor. PKK terör örgütü diyemeyen birine harcayacak vaktim yok. Bu ülkede ne analar ne babalar ağladı yazıktır. Milletin aklıyla dalga geçmeyin.Şu zamana kadar ekonomik planımızı anlatan biri oldu mu? Cidden soruyorum aha seçim geliyor yok ötv kalkacakmış bilmemneymiş dalgamı geçiyorsunuz siz. Ötv kalkınca ekonomi mi düzeliyor. Bana planından bahset.QuoteBir millet vekili PKK bir terör örgütüdür diyemiyor. BU adamın maaşı pkk yüzünden ailesinden şehit edilen kişiler tarafından vergi olarak ödeniyor.Meclisimizin acilen toplanıp bunları temizlemesi gerekiyor. PKK terör örgütü diyemeyen birine harcayacak vaktim yok. Bu ülkede ne analar ne babalar ağladı yazıktır. Milletin aklıyla dalga geçmeyin.2. video konusunda söylediklerine katılıyorum videonun yorumlarında zaten bizle hemfikir olanlar söylenmesi gerekenleri söylemiş.Haklısın cevaplar konusunda çok yetersiz kalındı ve sürekli tekrarladı ama yapılan işi beğendim en azından şu an için benzeri yok ve bir soru bile sorma şansımız yokken böyle bir şeyin ortaya çıkmasını doğru buldum.Birçok şeyde de eleştirel yaklaşman asıl olayı gölgede bıraktığı için böyle yazmama sebep oldu, neyse çözdük sorun yok işin güzel yanı eleştirdiğin şeylerin birçoğunu benim de kat kat fazla eleştiriyor olmam. Yanıtın için teşekkürler.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SUPERSAIAN",
      "created_time": "August 28, 2022, 09:20:20 AM",
      "body": "Mevzular Açık Mikrofon diğer bölümlerine de bu başlık altından devam edelim. 3. bölüm perşembe günü yayın olacak BabalaTv, Oğuzhan Uğur'un sunuculuğuyla beraber yeni konuk isim Memleket partisi lideri Muharrem İnce. Tam da beklediğim isim konuk alınmış perşembe gününü iple çekiyorum en azından lafı gevelemeden etmeden takır takır konuşmuştur diye düşünüyorum İnce.https://twitter.com/vekilince/status/1563623658203103233?s=20&t=PhvWgdsirErXQTjg35eltgEyşan’ın yaptıklarını da unutmadık!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gencecikmen",
      "created_time": "October 08, 2022, 05:50:47 PM",
      "body": "Oğuzhan Uğur'u çok sevmesem de \"Açık Mikrofon\" adlı programını takdir ediyorum. Bu perşembe günü de konuk olarak Ahmet Davutoğlu vardı. İlk 5 programı kendi açımdan özetlersem, ilk programda çok fazla Ümit Özdağ'ın taraftarı vardı. Sonra ki bölümlerde bu durumu gidererek programların daha sert geçmesi sağlandı. Bu yüzden ilk programdan sonra bu sorunu görüp çözmeleri program için çok olumlu oldu. Gelen konukların nerede ise hiçbirinin programa çok çalışmadığı ve açıkça yalan söylebildiklerini gördük. Hatta içlerinden soru soran kişilere bağıran, suçlayan konuklar da oldu. Ayrıca oraya giden halkın da iki kelamı bir araya getirmekten aciz olduklarını gördük. Eline mikrofonu alan çoğu konuk soru sormaktan aciz yada kendi düşüncelerini slogan atarak alkış alma peşinde. Böyle olunca program aynı soruların sorulup aynı cevapların döndüğü bir ortama dönüyor. Soru soracak insanların kalitesini de artırabilirlerse program daha zevkli ve izlenebilir olacak.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "trendcoin",
      "created_time": "October 26, 2022, 04:11:06 AM",
      "body": "fetö firarisi hakan şükür'ü \"bir zamanlar formadaki adını öptüğüm beyefendi\" falan diyerek yayına çağırmış ama gelen tepkilerden dolayı geri adım atmış sanırım veya buna yakın bir şeyler yaşanmış, ne olduğunu tam olarak anlayamadım çünkü gelen tepkilerden sonra tweetlerini de silmiş. geri adım atarak iyi bir şey yapmış ama maalesef fetö firarisi hakan şükür'ü gündeme sokmak gibi bir hata yaptığı için istemeden de olsa ilker canikligil'in fetö firarisi hakan şükür ile flutv'de ballandırmalı bir program yapmasına sebep olmuş. bence siyaset içerikli programları iyi, genel olarak karşıt görüşlü pek çok insan bir araya gelip kurtlarını dökercesine konuşuyor, formatı da sürekli iyi yönde geliştirmeye çalışıyor (herkesi memnun etmesi mümkün değil) ama ben onun şovmen yönünü ya da şu anki pozisyonu itibariyle enkırmenlik rolünü çok başarılı bulmuyorum. yani, bana göre biraz babasının ekmeğini yiyor gibi gözüküyor.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SUPERSAIAN",
      "created_time": "October 26, 2022, 04:50:52 PM",
      "body": "Oğuzhan Uğur'u tebrik etmek gerekiyor en son yaptığı programda medyadan, dijital medyadan bütün isimleri bir salona sığdırmış. Oğuzhan Uğur'a, Uğur Dündar, Okan Bayülgen, Ece Üner, Özlem Gürses, Candaş Tolga Işık, Haluk Levent, Cüneyt Özdemir, Taylan Yıldız eşlik etti ayrıca üstadlar vardı, Avukat olarak geldiler ama birbirleri arasında kendilerine üstad demeyi tercih ettiler. Spoiler burası Uğur Dündar Babala TV'de olacakmış bundan sonra öyle söylenildi gerisini bilmiyorum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Retro Harmony",
      "created_time": "October 26, 2022, 04:53:48 PM",
      "body": "Quote from: trendcoin on October 26, 2022, 04:11:06 AMfetö firarisi hakan şükür'ü \"bir zamanlar formadaki adını öptüğüm beyefendi\" falan diyerek yayına çağırmış ama gelen tepkilerden dolayı geri adım atmış sanırım veya buna yakın bir şeyler yaşanmış, ne olduğunu tam olarak anlayamadım çünkü gelen tepkilerden sonra tweetlerini de silmiş. geri adım atarak iyi bir şey yapmış ama maalesef fetö firarisi hakan şükür'ü gündeme sokmak gibi bir hata yaptığı için istemeden de olsa ilker canikligil'in fetö firarisi hakan şükür ile flutv'de ballandırmalı bir program yapmasına sebep olmuş. bence siyaset içerikli programları iyi, genel olarak karşıt görüşlü pek çok insan bir araya gelip kurtlarını dökercesine konuşuyor, formatı da sürekli iyi yönde geliştirmeye çalışıyor (herkesi memnun etmesi mümkün değil) ama ben onun şovmen yönünü ya da şu anki pozisyonu itibariyle enkırmenlik rolünü çok başarılı bulmuyorum. yani, bana göre biraz babasının ekmeğini yiyor gibi gözüküyor. Geçmiş yıllarda Hakan Şükür bir çok çocuğun efsaneydi tabi. Ancak günümüzde öyle bir durumda ki terörist firari gibi bir durumda ve geçmişteki tüm başarıları örtülüyor. Bu cümleyi kurması doğru değildi bence. Twitlerini silmesi kendisini sağlama alma yönünden yaptığı bir hareketti çünkü artık yeni geçen yasa gereği sorunlar yaşayabilirdi. Karşıt görüşleri siyasiler ile bir araya getirmesi güzel belki bir tv yayını bile yapabilir ileride bu konsept ile.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gencecikmen",
      "created_time": "October 26, 2022, 07:37:52 PM",
      "body": "Quote from: SUPERSAIAN on October 26, 2022, 04:50:52 PMOğuzhan Uğur'u tebrik etmek gerekiyor en son yaptığı programda medyadan, dijital medyadan bütün isimleri bir salona sığdırmış. Oğuzhan Uğur'a, Uğur Dündar, Okan Bayülgen, Ece Üner, Özlem Gürses, Candaş Tolga Işık, Haluk Levent, Cüneyt Özdemir, Taylan Yıldız eşlik etti ayrıca üstadlar vardı, Avukat olarak geldiler ama birbirleri arasında kendilerine üstad demeyi tercih ettiler. Spoiler burası Uğur Dündar Babala TV'de olacakmış bundan sonra öyle söylenildi gerisini bilmiyorum.Son program geçenlerde yasalaşan sansür yasası üzerine idi. Ve geleneksel medyaların ünlüleri olmak üzere, dijital medya ünlüleri de programda idi. Hatta salondaki kişilerin toplam takipçi sayısı 200 milyon olduğunu belirttiler. Sansür yasasını avukatlar ile birlikte tartıştılar. Zevkli bir program olmuş.Program linki: https://www.youtube.com/watch?v=6FNK8tKxUBM",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "trendcoin",
      "created_time": "January 18, 2023, 12:59:03 AM",
      "body": "bence oğuzhan uğur'un programları artık tamamen bozuldu; önce hakan şükür'e twitter'dan yürümeler, ardından dhkp-c'ye bile terör örgütü dememek için masallar anlatan, hdp'den seçilmiş ama şimdi tip'te vekillik yapan barış atay... hani bunları yayına alıp üç-beş tane zeki insan vasıtasıyla soru-cevap şeklinde köşeye sıkıştırsa neyse diyeceğim ama barış atay bu programda şov yaptıktan sonra ekşi sözlük denilen çukurda günlerce cilalandı; yazık, ne diyeceğimi bilemiyorum!üstelik, barış atay aynı programda çözüm sürecini bitiren iki mehmetçik'in şehit edilmesi hadisesini de \"iki askerin infaz edilmesi\" olarak yorumladı.inanın ne diyeceğimi bilemiyorum, bu ülkede bazı şeylerin çok fazla bolluğu var, allah bu bolluğu azaltmasın...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "totti67",
      "created_time": "January 18, 2023, 05:34:02 AM",
      "body": "Tamamen olmasa da birkaç programı kısa kısa izledim, genel olarak asıl sorun konuklar veya oguzhandan ziyade seyircinin konuğu sürekli mat etme çabası, soru içeriklerinden bahsetmiyorum soruların sorulma biçimi bana çok rovansist geldi genelde.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Phoenix Anka",
      "created_time": "January 18, 2023, 05:52:54 AM",
      "body": "Quote from: trendcoin on January 18, 2023, 12:59:03 AMbence oğuzhan uğur'un programları artık tamamen bozuldu; önce hakan şükür'e twitter'dan yürümeler, ardından dhkp-c'ye bile terör örgütü dememek için masallar anlatan, hdp'den seçilmiş ama şimdi tip'te vekillik yapan barış atay... hani bunları yayına alıp üç-beş tane zeki insan vasıtasıyla soru-cevap şeklinde köşeye sıkıştırsa neyse diyeceğim ama barış atay bu programda şov yaptıktan sonra ekşi sözlük denilen çukurda günlerce cilalandı; yazık, ne diyeceğimi bilemiyorum!üstelik, barış atay aynı programda çözüm sürecini bitiren iki mehmetçik'in şehit edilmesi hadisesini de \"iki askerin infaz edilmesi\" olarak yorumladı.inanın ne diyeceğimi bilemiyorum, bu ülkede bazı şeylerin çok fazla bolluğu var, allah bu bolluğu azaltmasın...Barış Atay bir numaralı yandaşlardan birisidir. Ayrıca Oğuzhan Uğur programı iyi niyetli ve farklı konsept çabasıyla açmasını anlıyorum ki baksanıza amacına ulaşmış çokça dillendirilen bir program haline gelmiş. Yine de üniversite amfisi gibi her sıradan kişinin girebileceği yerine 10 kişilik karşıt görüşlü akıllıca sorularla programı daha iyi bir hale getirebilir. Gençlerimizde zaten bilgi gittikçe azalıyor ayrıca internet mecrasında şov yapıldıktan sonra adam haklı dağılın vari sözleri duyup bu insanın terör örgütünü savunucu sözlerini çabuk unutturma işine giriştiğini de unutmamak lazım.Şehitlik lafını da evire çevire dine uydurdu yine. Şu din öyle bir şey ki istemeyen insanlar bile işine yarayacak noktada nasıl da ondan örnekler verebiliyor. Türk askerlerinin şehit olmadığını vurgulayan sözler söyledi. Bu insan insan değil.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "trendcoin",
      "created_time": "January 18, 2023, 12:01:17 PM",
      "body": "Quote from: Phoenix Anka on January 18, 2023, 05:52:54 AMQuote from: trendcoin on January 18, 2023, 12:59:03 AM...Barış Atay bir numaralı yandaşlardan birisidir. Ayrıca Oğuzhan Uğur programı iyi niyetli ve farklı konsept çabasıyla açmasını anlıyorum ki baksanıza amacına ulaşmış çokça dillendirilen bir program haline gelmiş. Yine de üniversite amfisi gibi her sıradan kişinin girebileceği yerine 10 kişilik karşıt görüşlü akıllıca sorularla programı daha iyi bir hale getirebilir. Gençlerimizde zaten bilgi gittikçe azalıyor ayrıca internet mecrasında şov yapıldıktan sonra adam haklı dağılın vari sözleri duyup bu insanın terör örgütünü savunucu sözlerini çabuk unutturma işine giriştiğini de unutmamak lazım.Şehitlik lafını da evire çevire dine uydurdu yine. Şu din öyle bir şey ki istemeyen insanlar bile işine yarayacak noktada nasıl da ondan örnekler verebiliyor. Türk askerlerinin şehit olmadığını vurgulayan sözler söyledi. Bu insan insan değil. barış atay'ın chp + hdp yandaşı olduğu çıkarımını yapabiliriz.zaten kendisi hdp'den milletvekili seçilip, chp'den milletvekili seçilen serra kadıgil ve hdp'den milletvekili seçilen ahmet şık ile birlikte bu partiyi meclise taşıdı.Quote2018 Türkiye genel seçimleri için Halkların Demokratik Partisi'nden milletvekili adayı oldu. 24 Haziran 2018 seçim sonuçlarına göre Hatay milletvekili seçildi. 11 Ekim 2018 tarihinde Türkiye İşçi Partisi'ne geçti.https://tr.wikipedia.org/wiki/Bar%C4%B1%C5%9F_Atay#QuoteSera Kadıgil kimdir? CHP’den istifa eden Saliha Sera Kadıgil Sütlü TİP’e geçtihttps://www.cnnturk.com/turkiye/saliha-sera-kadigil-sutlu-kimdir-chpden-istifa-eden-sutlu-tipe-gectiQuoteAhmet Şık (d. 9 Mayıs 1970, Adana), Türk gazeteci, yazar ve siyasetçi. Gülen Cemaati'nin kamu kurumlarında gizlice örgütlenmesiyle ilgili araştırmaları nedeniyle yargılandığı için gündeme geldi. 2018'de HDP'den İstanbul milletvekili seçildi. 4 Mayıs 2020'de HDP'den istifa etti, 19 Nisan 2021'de TİP'e katıldı.https://tr.wikipedia.org/wiki/Ahmet_%C5%9E%C4%B1k#ayrıca, aytuğ atıcı'nın ifadesine göre hdp'nin chp'den çıkma bir parti olduğunu biliyoruz. QuoteCHP'li Aytuğ Atıcı: HDP, CHP'nin içinden çıkmış bir partidirhttps://www.indyturk.com/node/596571/siyaset/chpli-aytu%C4%9F-at%C4%B1c%C4%B1-hdp-chpnin-i%C3%A7inden-%C3%A7%C4%B1km%C4%B1%C5%9F-bir-partidirşu yaşıma kadar edindiğim tecrübeye göre \"chp + hdp denklemi\" oluştuğunda şehitlik gibi dini kavramlar üzerinde her türlü manipülasyon gündeme gelebiliyor. bu yüzden, ben onun açıklamasına şaşırmadım, zaten onların söylediklerini ciddiye almayan biri olduğum için söyledikleri bir kulağımdan girdi ötekinden çıktı ama başkalarının aklını bu konuda bulandırması hoş bir netice vermez.ayrıca, oğuzhan uğur'un programlarını başlangıçta gerçekten beğeniyordum ama -samimi olmak için belirtmek istiyorum- benim verdiğim tepkiyi ya da benim yaptığım değerlendirmeyi/eleştiriyi yapan \"çok ve önemli\" insanlar da var (hani beni sightir etsek de olur ama gerçekler var aga gerçekler :d).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}