{
  "id": "topic_5433195",
  "title": "JamesDaniel90",
  "author": "JamesDaniel90",
  "created_time": "January 05, 2023, 11:10:08 PM",
  "content": "Recently I have been trying to come up with ways of making some money on the side and thinking of giving trading a go.I have zero experience and have just been looking on Coinbase at the best and worst performers of the day. I am thinking of buying coins that are 15% or more down and then selling once they pump 10% and move onto the next one that is 15% down and then again sell at 10% profit and just keep repeating.Anyone done something similar or will it just lead me to losing my money?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5433195",
  "comments": [
    {
      "author": "Oshosondy",
      "created_time": "January 05, 2023, 11:20:33 PM",
      "body": "Use little amount of money that you can afford to lose to trade. When you start to have more profit than loss, you can slightly be increasing the amount. When I started trading, I lost all my money. Be careful and do not let emotion trade for you. You need the right strategy to trade. Learn more about MA, EMA, BB, RSI and some other indicators, but those four should be enough.You need a better strategy that can help you to still have high percentage chance to make profit even after indicators fail you.I have preferred to use low leverage, averaging at times, leave trade opened for days. Trades I was losing before do come to be profit later after many days of opening position because I use small amount, low leverage and leaving position for long time if no profit for short time.Use low leverage. Read about risk management.Quote from: JamesDaniel90 on January 05, 2023, 11:10:08 PMRecently I have been trying to come up with ways of making some money on the side and thinking of giving trading a go.Look for other ways to look for money for trading not to fail you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitMaxz",
      "created_time": "January 05, 2023, 11:29:33 PM",
      "body": "I'm doing that before but it works sometimes however, you need to set up a limit if the coin/token continuously drops you can avoid losing much of your investment.I suggest since you said you are a newbie in trading there are some strategies that you can try to learn like fundamental and technical analysis and know how to use indicators for signals or the right spot when to sell or buy.Check this link below if you are looking for trading guides and strategies.- https://github.com/SpiralDevelopment/Awesome-Crypto-Trading",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ryker1",
      "created_time": "January 05, 2023, 11:59:31 PM",
      "body": "Quote from: JamesDaniel90 on January 05, 2023, 11:10:08 PM[snip]I am thinking of buying coins that are 15% or more down and then selling once they pump 10% and move onto the next one that is 15% down and then again sell at 10% profit and just keep repeating.Anyone done something similar or will it just lead me to losing my money? My question is --is there any reliable source for this? knowing the coins when to pump and dump?Perhaps none, so there is no way to predict the market price and it is very risky for you since you are a newbie. It will end up losing your money or else easily wipe out your entire portfolio. You have said that you are a newbie and don't have experience, I prefer to say that you need more experience and gain knowledge in trading because trading is not an easy way of making money, it is very risky.Study and make research first or gain experience in copy trading, find an exchange platform that allows users to copy trading, so that you can try trading or even paper trading which you can practice more without losing money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MArsland",
      "created_time": "January 06, 2023, 12:24:24 AM",
      "body": "Quote from: JamesDaniel90 on January 05, 2023, 11:10:08 PMRecently I have been trying to come up with ways of making some money on the side and thinking of giving trading a go.I have zero experience and have just been looking on Coinbase at the best and worst performers of the day. I am thinking of buying coins that are 15% or more down and then selling once they pump 10% and move onto the next one that is 15% down and then again sell at 10% profit and just keep repeating.Anyone done something similar or will it just lead me to losing my money? The opposite question is whether the coins you buy in the decline will always go back up again and again after the purchase period. certainly notYou also can't just guess and then buy only the coin drops. It could be that the coin is destroyed in the project. Trading is not just guessing to buy but must be seen from long-term prospects. Don't be too confident about coins that are considered repeated but in fact, your money chokes on them for a long time. And in the end I'm afraid you are not ready for losses. So prepare your money ready to lose. Because most beginners who think trading is easy, always come to a bad ending on crypto trading.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "January 06, 2023, 01:27:07 AM",
      "body": "It will indeed likely end you up with losing money. Not everything that goes down necessarily bounces a bit; sometimes, they go straight down to hell and never see the light of day again.Just a heads up that trading is not that simple. If it was, then majority of people would be making a lot of money. There's a reason why a huge majority of people lose money trading.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Maus0728",
      "created_time": "January 06, 2023, 01:48:51 AM",
      "body": "I believe you are oversimplifying how trading goes, which in my opinion is a mistake. Sure, looking at which cryptocurrencies are the biggest winners or losers is one indicator, but it typically isn't sufficient to dictate your choice of which coins or stocks to trade because doing so will only cause you to lose money.Maybe try checking this subreddit[1]. Although that sub focuses mainly on stocks trading, the process and technicalities involved still works in crypto. The indicators, relative strength vs weakness, basic S&R still applies in any market though..[1] https://www.reddit.com/r/RealDayTrading",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GreatArkansas",
      "created_time": "January 06, 2023, 01:52:33 AM",
      "body": "Quote from: JamesDaniel90 on January 05, 2023, 11:10:08 PMI am thinking of buying coins that are 15% or more down and then selling once they pump 10% and move onto the next one that is 15% down and then again sell at 10% profit and just keep repeating.(....)Always think that it doesn't mean that coins are dumped, they will go pump again or immediately. There are a lot of traders around the world with different strategies.Take note that you need to be aware that the value of cryptocurrencies can fluctuate significantly and there is no guarantee that you will be able to sell your coins for a profit sometimes.This is not how easy to trade.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "crwth",
      "created_time": "January 06, 2023, 02:08:55 AM",
      "body": "Going at this as a newbie, you need to understand first that it's always going to be the market that will dictate, and you can expect already to make the wrong decisions as you go along and trade with actual money.You can go at this in two waysPractice with paper money first and get a feel for itTrade with your money already. Make sure you have budgeted your capitalYou can do this automatically by trading with Gunbot. If you are interested, I can help you with that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ethereumhunter",
      "created_time": "January 06, 2023, 03:22:37 AM",
      "body": "I did something like that a few years ago, where lots of coins were moving almost simultaneously, allowing me to buy low and sell high. But for the current situation, I think it's difficult because with so many coins on the market, you need more time to analyze each coin one by one and that doesn't guarantee you can get the coin you want. And if you do it like that without having high analytical skills, you will only lose money because you can be wrong in analyzing the coins. But if you still want to try it, I suggest doing it for a small amount of money and seeing how it goes. Never use big money if you are not prepared to lose.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "wxa7115",
      "created_time": "January 06, 2023, 03:45:24 AM",
      "body": "Quote from: JamesDaniel90 on January 05, 2023, 11:10:08 PMRecently I have been trying to come up with ways of making some money on the side and thinking of giving trading a go.I have zero experience and have just been looking on Coinbase at the best and worst performers of the day. I am thinking of buying coins that are 15% or more down and then selling once they pump 10% and move onto the next one that is 15% down and then again sell at 10% profit and just keep repeating.Anyone done something similar or will it just lead me to losing my money? You seem to have a strategy in mind already, however there is no way to know beforehand if this is a profitable strategy unless someone else is doing something similar and they are willing to tell you this is the case.I recommend that before you use your limited capital in a strategy that you do not know if it works at all that you do some paper trading for a few months and evaluate your results, and if the results are positive then you can start to use your capital to trade the markets when using this strategy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rozak",
      "created_time": "January 06, 2023, 06:35:58 AM",
      "body": "Quote from: JamesDaniel90 on January 05, 2023, 11:10:08 PMI have zero experience and have just been looking on Coinbase at the best and worst performers of the day. as you said, you are a newbie. Crypto trading is very risky. it's easy to see an asset with a dip and we can buy it. then sell it when it pumps. looks very simple, but you can imagine, what happens when the value of the asset you bought then experiences a more severe decline? even to reach a 10% pump maybe it won't return your capital.I don't scare you. but crypto trading is very risky. especially for beginners. so before you start trading, equip yourself with skills in trading. it will help you.you better now buy bitcoin for the long term. this may not be as much of a trade as you think. buy and hold for a long time. you will see the benefits.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "January 06, 2023, 06:43:00 AM",
      "body": "Thats a good analogy already. Buying when its down but you need to take a broader details like if its down, how long its been down, maybe its still in the phase of going down. Thats where you learn indicators where youll find out whether that project could go bounce and reversal at particular time based on past activity. Theres too much to learn but you understand a good way on how to start and thats great.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Issa56",
      "created_time": "January 06, 2023, 06:56:31 AM",
      "body": "Quote from: JamesDaniel90 on January 05, 2023, 11:10:08 PMI am thinking of buying coins that are 15% or more down and then selling once they pump 10% and move onto the next one that is 15% down and then again sell at 10% profit and just keep repeating.You have to be very careful when using the strategy you mentioned above, their is no assurance that you are going to be making money continuously, how sure are you that if you purchase a coin when it drops by 15%, it's going to bounce back and you are going to make money? If you buy some coins it's still going to dip more and you might not be able to recover your money. Am not saying the strategy won't work for you like once or twice, but don't rely on the strategy because you won't really make money for long time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Asiska02",
      "created_time": "January 06, 2023, 07:57:43 AM",
      "body": "Quote from: JamesDaniel90 on January 05, 2023, 11:10:08 PMI am thinking of buying coins that are 15% or more down and then selling once they pump 10% and move onto the next one that is 15% down and then again sell at 10% profit and just keep repeating.Anyone done something similar or will it just lead me to losing my money? It's great that you're thinking and have brought this idea here for discussion. Trading is risky, and you may find that your expectations are not met. Your thoughts on buying and selling are similar to saying it's a speculative activity that most people engage in these days. The market is so volatile that you never know what will happen when you plan to sell at a 10% profit. Because you're new to this, just buy bitcoin and hold it like an egg for a longer period of time; I'm confident you'll profit from your investment in the long run. Consider doing your research even if others have already given you their thoughts and opinions on your plan; it will help and guide you better on the investment journey.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JamesDaniel90",
      "created_time": "January 06, 2023, 09:38:43 AM",
      "body": "I have only started with $50 as a test - I made my first trade last night after buying LCX last week at $0.033 I sold at $0.045. This is a 36% gain which is a pretty good start, now I will wait and have a look around to see what is badly down later and buy in when I feel there is a likely pump coming.LCX reached $0.055 last night so this is a 67% increase from where I bought only a week ago so makes me realize there is money to be made in this bear market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tvplus006",
      "created_time": "January 06, 2023, 09:47:48 AM",
      "body": "Quote from: JamesDaniel90 on January 05, 2023, 11:10:08 PM...I am thinking of buying coins that are 15% or more down and then selling once they pump 10% and move onto the next one that is 15% down and then again sell at 10% profit and just keep repeating...Such a strategy will not always be profitable, since many coins, after their price has decreased by 15%, contrary to your expectations, continue to decline. In this case, you should have a backup plan, which may be to use a stop loss to limit your losses.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JamesDaniel90",
      "created_time": "January 06, 2023, 09:56:15 AM",
      "body": "Quote from: tvplus006 on January 06, 2023, 09:47:48 AMQuote from: JamesDaniel90 on January 05, 2023, 11:10:08 PM...I am thinking of buying coins that are 15% or more down and then selling once they pump 10% and move onto the next one that is 15% down and then again sell at 10% profit and just keep repeating...Such a strategy will not always be profitable, since many coins, after their price has decreased by 15%, contrary to your expectations, continue to decline. In this case, you should have a backup plan, which may be to use a stop loss to limit your losses.No back up plan - I am just trading altcoins I believe will be here till the next bull run at least. If it gets to a point where we experience a crash and I buy in at a price we don't see again for another month or so then I will just hold.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OcTradism",
      "created_time": "January 06, 2023, 10:16:42 AM",
      "body": "Quote from: JamesDaniel90 on January 05, 2023, 11:10:08 PMI have zero experience and have just been looking on Coinbase at the best and worst performers of the day. Don't trade, you will lose your fund.QuoteI am thinking of buying coins that are 15% or more down and then selling once they pump 10% and move onto the next one that is 15% down and then again sell at 10% profit and just keep repeating.Anyone done something similar or will it just lead me to losing my money? Looks like it can give you profit but have you ever checked that altcoins in 2022 lost 90% to 98% and some more than 98% of their all time highs. If you are not correct with your orders, your entries are wrong and you don't cut loss, you will lose a lot. From -15% to -98% is not small difference.Trading won't help you rich but it will help exchanges richer. You give them income from your trading fees.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AicecreaME",
      "created_time": "January 06, 2023, 10:33:10 AM",
      "body": "Quote from: Ryker1 on January 05, 2023, 11:59:31 PMQuote from: JamesDaniel90 on January 05, 2023, 11:10:08 PM[snip]I am thinking of buying coins that are 15% or more down and then selling once they pump 10% and move onto the next one that is 15% down and then again sell at 10% profit and just keep repeating.Anyone done something similar or will it just lead me to losing my money? My question is --is there any reliable source for this? knowing the coins when to pump and dump?Perhaps none, so there is no way to predict the market price and it is very risky for you since you are a newbie. It will end up losing your money or else easily wipe out your entire portfolio. You have said that you are a newbie and don't have experience, I prefer to say that you need more experience and gain knowledge in trading because trading is not an easy way of making money, it is very risky.Study and make research first or gain experience in copy trading, find an exchange platform that allows users to copy trading, so that you can try trading or even paper trading which you can practice more without losing money. Correct.Technical analysis is still needed in spot trading to know the prices you must buy a coin to avoid waiting too much time just to sell it since for example, you bought at a certain price then it continues to dump even more. To make this simple, the random guesses when to buy and sell a coin to make profits will not work every single time. A single failure because of that action will lead to something chaotic, you will become addicted to that random guesses only in trading which you will not grow, meaning you will never become a good trader in the future.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}