{
  "id": "topic_5462492",
  "title": "Flexystar",
  "author": "Flexystar",
  "created_time": "August 08, 2023, 09:57:41 AM",
  "content": "****This is Not about online mining, cloud mining or stuff that spam us*****The question is about the concept of sharing our mining power to the pools using old miners. For example, over the period of time technology is getting outdated and new Bitcoin miners are continuously released on the market. This leaves us middle of no where thus making it hard to keep up the mining. All we do is heat up the miners, waste the electricity and get paid some bucks that never achieves the break even against the electricity cost and increasing difficulty. The problems: - Outdated miners can't be sold anymore- They are burden to the mining farm- No profits- Waste of electricity Pool Sharing:The only way to earn from them could be sharing them with the pool. For example, pool should have different section or protocol where they will use the hashing power from such outdated miners that connected to them and use that power altogether. In return hoping that we will receive fixed returns for sharing that hash power. Is there any system like this that pools are already following.This is about the outdated miners and their pool sharing.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5462492",
  "comments": [
    {
      "author": "Flexystar",
      "created_time": "August 08, 2023, 10:24:07 AM",
      "body": "Quote from: ETFbitcoin on August 08, 2023, 10:11:15 AMQuote from: Flexystar on August 08, 2023, 09:57:41 AMPool Sharing:The only way to earn from them could be sharing them with the pool. For example, pool should have different section or protocol where they will use the hashing power from such outdated miners that connected to them and use that power altogether. In return hoping that we will receive fixed returns for sharing that hash power. No sane/legit mining pool would guarantee fixed return which leave miner (with old ASIC) at profit. There's no point of having higher total hashrate when pool would earn less profit.I was thinking more of few bucks that will at least cover the electricity and keep the top up for running it. Since solo mining is anyways not an option, so pool is the only entity that can suck hashing power from let us say thousands of miners all over the globe and may be get success in finding full Bitcoin reward thus be able to share revenue profit to us. there share would be insignificant but it would be something for sure. The guarantee should be based on the prechecks. For example, after checking or diagnosing the ASIC for its condition and having good benchmark over the others in a pool. They will lock a price that how much it might be worth and then pay back. Just the power of bulk hashing I am talking about. OR it's just not possible at all?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "paid2",
      "created_time": "August 08, 2023, 10:25:22 AM",
      "body": "Quote from: Flexystar on August 08, 2023, 09:57:41 AMThe problems: - Outdated miners can't be sold anymore- They are burden to the mining farm- No profits- Waste of electricity Old ASICs can (almost) always be sold, you will always find someone interested to buy old ASICs, someone not paying a lot for his electricity, or doing a specific project etc.. Maybe you'll sell it at a loss, but if you've done your calculations properly when you bought it, you're supposed to have made a profit on it before selling it. The notion of \"outdated ASIC\" isn't useful to me. What really matters, is the cost of your infrastructure, your kw/h cost and how much you pay for your hardware. If you're able to make a profit taking all these costs into account, no matter how old the ASICs are, profit is profit - as long as the ASICs are able to produce a stable hashrate at least.Quote from: Flexystar on August 08, 2023, 09:57:41 AMThe only way to earn from them could be sharing them with the pool. For example, pool should have different section or protocol where they will use the hashing power from such outdated miners that connected to them and use that power altogether. In return hoping that we will receive fixed returns for sharing that hash power. Not sure why... A Th/s is a Th/s, a kw/h is a kw/h. It's up to each miner to make their own calculations and forecasts, and I don't see why we should be giving gifts to those using older generations of ASICs. If a miner can no longer make a profit from certain ASICs, he's free to sell them to someone who pays less fixed costs than he does, and I don't see why that should be the problem of pool operators.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kano",
      "created_time": "August 08, 2023, 10:27:14 AM",
      "body": "Bitcoin mining is bitcoin mining.There's no side scheme to get rich that no one knows about and you can magically use.If you mine a low hash rate, you get an equivalent low reward.Hoping that someone will pay you more, just means you don't understand what you are doing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaveF",
      "created_time": "August 08, 2023, 10:45:15 AM",
      "body": "There is no way to make something like that profitable. To give you fixed returns you are looking at a PPS payout. X TH gives you Y BTCY BTC either covers your cost of electric and gives you a little profit or it does not.Taking that all off the table if they are willing to give you Z BTC which would HAVE to be a lot less then Y because they are giving you a fixed amount. Why would you mine there as opposed to a regular PPS pool?-Dave",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FP91G",
      "created_time": "August 09, 2023, 01:09:25 PM",
      "body": "Quote from: Flexystar on August 08, 2023, 09:57:41 AM****This is Not about online mining, cloud mining or stuff that spam us*****The question is about the concept of sharing our mining power to the pools using old miners. For example, over the period of time technology is getting outdated and new Bitcoin miners are continuously released on the market. This leaves us middle of no where thus making it hard to keep up the mining. All we do is heat up the miners, waste the electricity and get paid some bucks that never achieves the break even against the electricity cost and increasing difficulty. The problems: - Outdated miners can't be sold anymore- They are burden to the mining farm- No profits- Waste of electricity Pool Sharing:The only way to earn from them could be sharing them with the pool. For example, pool should have different section or protocol where they will use the hashing power from such outdated miners that connected to them and use that power altogether. In return hoping that we will receive fixed returns for sharing that hash power. Is there any system like this that pools are already following.This is about the outdated miners and their pool sharing.I'll take an example with the old Antminer S9 asics, which cost $25-35 each. Delivery to another country may cost more than the price of the equipment, and no one will guarantee the uninterrupted operation of the device. Asic can break down and its repair can be more expensive than its cost, that is, the recipient needs to take another disposal tax from you  These asics can only be used at power plants to burn excess electricity.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yamane_Keto",
      "created_time": "August 09, 2023, 01:45:11 PM",
      "body": "Quote from: Flexystar on August 08, 2023, 09:57:41 AMThis is about the outdated miners and their pool sharing.I don't know what you mean by outdated miners, since it is bitcoin mining that does not depend on how modern the mining tools are. In the end, it is Th/s accounts for the cost of electricity, so there are no outdated miners, but they are not profitable.You can mine Bitcoin by guessing it on a piece of paper, but the probability of finding a block is almost zero, so ASICs are used.When you buy mining tools, you take into account the return on investment, the cost of electricity, cooling, and the depreciation rate, which we can describe as five years. If you cannot at least recover your capital and sell miners during 5-Years, then you are mining wrongly.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Flexystar",
      "created_time": "August 10, 2023, 03:39:14 AM",
      "body": "Thanks for the healthy discussion guys. So in my understanding and from the conversation above Summary:- Miners are never outdated - Miners can be resold - Miners can be scrapped - You can not go for actual pool sharing concept since it's not really profitable - You can still profit from the old miners if you have got free electricity at hands. - There are no pools who has this concept due to the reasons mentioned above. In short no fixed revenue, if it's old miner with less hashing power just run it if electricity costs less, otherwise it could be a good one for the new miners who wants to experiment things.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "paid2",
      "created_time": "August 10, 2023, 05:39:27 AM",
      "body": "Quote from: Flexystar on August 10, 2023, 03:39:14 AMIn short no fixed revenue, if it's old miner with less hashing power just run it if electricity costs less, otherwise it could be a good one for the new miners who wants to experiment things. Yeap absolutely, could be possible, imagine if you were in a situation where you were paying an extremely low price per kw/h, and your installation could support a high volume of electrical use (which is certainly not common, but there are people whose situation it is). In this case, what you're looking for is the cheapest possible Th/s per USD ratio more than everything else. In my opinion, this type of reasoning is only possible on a small or medium scale, but it is still possible",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yamane_Keto",
      "created_time": "August 10, 2023, 12:47:42 PM",
      "body": "Quote from: Flexystar on August 10, 2023, 03:39:14 AMThanks for the healthy discussion guys. So in my understanding and from the conversation above Summary:- Miners are never outdated - Miners can be resold - Miners can be scrapped - You can not go for actual pool sharing concept since it's not really profitable - You can still profit from the old miners if you have got free electricity at hands. - There are no pools who has this concept due to the reasons mentioned above. Like any device, there will come a time when you stop using it, either because the device needs frequent repair, or the return from its operation is less than the operating cost (maintenance, electricity, cooling, the price of bitcoin)If this happens, you can operate the device for experimentation and enjoyment, but you will definitely not continue to operate it because it is a failed project.People join mining pools because they can't afford to create a mining farm that produces a good hashrate to solo mine Bitcoint, so they prefer the possible profit rather than the near impossible profit.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FP91G",
      "created_time": "August 10, 2023, 02:11:01 PM",
      "body": "Quote from: Yamane_Keto on August 10, 2023, 12:47:42 PMQuote from: Flexystar on August 10, 2023, 03:39:14 AMThanks for the healthy discussion guys. So in my understanding and from the conversation above Summary:- Miners are never outdated - Miners can be resold - Miners can be scrapped - You can not go for actual pool sharing concept since it's not really profitable - You can still profit from the old miners if you have got free electricity at hands. - There are no pools who has this concept due to the reasons mentioned above. Like any device, there will come a time when you stop using it, either because the device needs frequent repair, or the return from its operation is less than the operating cost (maintenance, electricity, cooling, the price of bitcoin)If this happens, you can operate the device for experimentation and enjoyment, but you will definitely not continue to operate it because it is a failed project.People join mining pools because they can't afford to create a mining farm that produces a good hashrate to solo mine Bitcoint, so they prefer the possible profit rather than the near impossible profit.If the electricity is free, then the miner will most likely use a more profitable ASIC. You can use the old asic for solo mining, but it’s better to buy a new asic, and buy lottery tickets for the profit from mining  Old asics will be effective if the price of bitcoin grows 5 times and the hash rate does not increase much.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Daltonik",
      "created_time": "September 04, 2023, 01:23:39 PM",
      "body": "Quote from: Flexystar on August 10, 2023, 03:39:14 AMThanks for the healthy discussion guys. So in my understanding and from the conversation above Summary:- You can not go for actual pool sharing concept since it's not really profitable In fact, a lot depends on luck and it shows the topic that leads @willi9974 https://bitcointalk.org/index.php?topic=5434965.0 where joint mining on a rental basis can sometimes be quite profitable. It doesn't matter if you are mining on your equipment or renting, you always have a chance.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaveF",
      "created_time": "September 04, 2023, 01:28:46 PM",
      "body": "Quote from: Daltonik on September 04, 2023, 01:23:39 PMQuote from: Flexystar on August 10, 2023, 03:39:14 AMThanks for the healthy discussion guys. So in my understanding and from the conversation above Summary:- You can not go for actual pool sharing concept since it's not really profitable In fact, a lot depends on luck and it shows the topic that leads @willi9974 https://bitcointalk.org/index.php?topic=5434965.0 where joint mining on a rental basis can sometimes be quite profitable. It doesn't matter if you are mining on your equipment or renting, you always have a chance.If you are mining to make a PROFIT then you can't rely on LUCK, you have to rely on MATH.As in X hashrate will generate Y BTCYes there is luck involved, but with large pools it's a lot less of a variable due to the large amounts of hash.Someone using a 1 board S9 as a space heater on a solo pool MIGHT get lucky and get a block.People do will the lottery, just not a lot of them.The same person pointing to a larger PPLNS / PPS pool will get paid. *Using the space heater example, the PPS vs PPLNS argument it different then the full time mining PPLNS vs PPS argument.-Dave",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kano",
      "created_time": "September 08, 2023, 10:19:55 AM",
      "body": "Anyone can buy a miner and mine.If you want a quick get rich scheme, then Bitcoin mining has never been that.If you want to mine for profits, you need a very recent miner and cheap electricity.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "September 08, 2023, 07:28:52 PM",
      "body": "Quote from: DaveF on September 04, 2023, 01:28:46 PMIf you are mining to make a PROFIT then you can't rely on LUCK, you have to rely on MATH.As in X hashrate will generate Y BTCExactly, in the end, it will simply turn out that for every single guy who was lucky and found a block, there are hundreds who got nothing in return, You make the average, and over a longer period of time it will basically be the same as all those guys meaning together in a pool and finding a block.Quote from: Flexystar on August 08, 2023, 09:57:41 AMThe only way to earn from them could be sharing them with the pool. For example, pool should have different section or protocol where they will use the hashing power from such outdated miners that connected to them and use that power altogether. In return hoping that we will receive fixed returns for sharing that hash power.I knew it wasn't going to be long, and here we go, we have socialism entering bitcoin mining and demanding a minimum fixed wage for each machine. Oh god, why does it always have to be a search for something that is not making money to somehow magically get paid more than it's worth out of somebody else's pocket?Quote from: Flexystar on August 10, 2023, 03:39:14 AMSummary:- Miners are never outdated - Miners can be resold - Miners can be scrapped I would argue that each of them comes with a but- Miners are never outdated but their performance could be crap so in extreme cases you're better of selling the copper wire than running them,  for example, an S3 is earning you 3 cents before electricity costs.- Miners can be resold but again, nobody will be buying you an eight year old dusty s7 - Miners can be scrapped but I doubt there is much value in them",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dansus021",
      "created_time": "October 09, 2023, 01:49:38 AM",
      "body": "same as ETFBitcoin I don't think there will be a pool that gonna pay fixed returns for old asic it because they weren't efficient and will be difficult to find blocks since the mining difficulty of Bitcoin keeps increasing. The solution for old ASIC 1. Selling like iwantmyhomepaidwithbtc2 said because there are always people who are willing to buy at a cheap price.  2. Sell it in bulk to an electronic recycler to get valuable material but I don't think there is much material. 3. or you keep mining using abundant free electricity from renewable resources.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}