{
  "id": "topic_5464009",
  "title": "Rikafip",
  "author": "Rikafip",
  "created_time": "August 21, 2023, 07:28:06 AM",
  "content": "As the title says, yet another centralized exchange will introduce mandatory KYC starting from September 1st and seems like its just a matter of time before we are left with no non-KYC CEXes. Quote from: https://www.theblock.co/post/246462/bitget-kycCryptocurrency exchange Bitget is strengthening its know-your-customer (KYC) requirements for users, the company announced today.The crypto exchange said that starting from Sept. 1, newly signed-up users must complete level-one KYC verification to deposit and trade digital assets on Bitget. This move is “to comply with regulatory requirements in the global cryptocurrency sector and create a secure cryptocurrency trading environment,” Bitget said.For users who signed up before Sept. 1, they must meet the level-one KYC requirements before October 1. Otherwise, the exchange clarified, they will only be able to withdraw, cancel orders and close positions.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5464009",
  "comments": [
    {
      "author": "Rikafip",
      "created_time": "August 21, 2023, 08:47:36 AM",
      "body": "Quote from: Ratimov on August 21, 2023, 08:16:00 AMIt's a pity, it was a good exchange with its own advantages in terms of commissions and individual functions. I never personally used it since i am not much of a trader (I only use Binance as long time ago i had to do KYC to regain access to my account where I had decent amount of money) but i do know some people that switched to it after Kucoin introduced mandatiry KYC and they were also satisfied with it. Quote from: Ratimov on August 21, 2023, 08:16:00 AMAs I said earlier, all top exchanges will switch to KYC, so there are fewer and fewer well-known exchanges for anonymous use. Sooner or later, you will have to switch to lesser known exchanges if someone does not want to reveal their identity.Yep, that's inevitable. The only way for big exchanges to keep growing is to get more licenses to operate in big markets and you won't get that if you don't get heavily regulated. What to say other than enjoy while you can...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Synchronice",
      "created_time": "August 21, 2023, 09:23:16 AM",
      "body": "Quote from: Rikafip on August 21, 2023, 07:28:06 AMAs the title says, yet another centralized exchange will introduce mandatory KYC starting from September 1st and seems like its just a matter of time before we are left with no non-KYC CEXes. I'm afraid a lot of people will use that opportunity to create scam projects. One will pay some money to build a script, get some funds and run non-kyc exchange for a short time to do an exit scam.I think in near future, the only way to trade without KYC verification will be possibly only through decentralized exchanges but at the same time, there will always be some small instant exchanges without KYC requirement. If Tor gets faster, then everything will be alright.Quote from: https://www.theblock.co/post/246462/bitget-kycThis move is “to comply with regulatory requirements in the global cryptocurrency sector and create a secure cryptocurrency trading environment,” Bitget said.Secure in what way? I don't feel threatened when I trade without KYC. I simply don't understand this line.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rikafip",
      "created_time": "August 21, 2023, 09:44:36 AM",
      "body": "Quote from: Ratimov on August 21, 2023, 08:55:23 AMand I also liked the fact that there you can create 50 different addresses for each cryptocurrency from one account.Is that the CEX that you recently used for DAI-BTC exchange?  Quote from: Synchronice on August 21, 2023, 09:23:16 AMSecure in what way? I don't feel threatened when I trade without KYC. I simply don't understand this line.Of course you don't, that's just some bullshit wording that exchanges use to make people more willing to do KYC.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Woodie",
      "created_time": "August 21, 2023, 09:49:25 AM",
      "body": "Unfortunately this is the industry standard for today's centralized exchanges especially if they are trying to operate beyond the borders where they originate from, and all this is thanks to regulatory requirements of KYC & AML...And the worst part about exchanges today is that decentralized exchanges have lost their command because of lack of liquidity which leaves CEXs to run this show because of the liquidity and the multi coin or  blockchains they support.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yamane_Keto",
      "created_time": "August 21, 2023, 11:22:29 AM",
      "body": "Quote from: Ratimov on August 21, 2023, 08:16:00 AMNow the verification levels look like this:Do I need to change my glasses or do L1 and L2 have the same deposit and withdrawal restrictions? And 3 million per day just for ID card, passport, driver's license, and proof of residence. It is contrary to the terms of the money laundering rules of many countries. We are talking about $ 90 million per month, as soon as you upload your passport.If this is true, then it is the only platform that allows you to trade in such numbers with a minimal level of identity verification.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "August 22, 2023, 08:35:50 AM",
      "body": "Quote from: Ratimov on August 21, 2023, 11:48:59 AMUPDATE:Yamane_Keto, I contacted the support of the exchange and asked them a question, what does the second level of verification give if they look the same? The thing is, the levels and limits will completely change on September 1, so now it all seems pointless. The exchange will announce new levels and new limits on September 1st.Spent a bit of time looking at what could be different and 5 minutes after not finding Waldo on those pics I thought it might be a mistake with 3 million and 3 thousand. But an update after makes more sense, I doubt they will leave even 3k, that's $100k/month without basic KYC.Now the other thing:QuoteBitget does not provide services to users in the following countries or regions: Catalonia, Knights of Malta, The first service I ever see that mentions Catalonia, like for god's sake, why not Galicia or Basque also? Why not Flanders! But, let's ignore that cause ......what the **** is \" Knights of Malta\", did I travel back in time by going circling half the globe and it's 1571?Quote from: Woodie on August 21, 2023, 09:49:25 AMAnd the worst part about exchanges today is that decentralized exchanges have lost their command because of lack of liquidity which leaves CEXs to run this show because of the liquidity and the multi coin or  blockchains they support.I don't think that DEX ever had a command, they have always been in the shadows of CEX, from MTGox and Bitstamp times CEXs have completely dominated the scene, and, no, fake trading of billions of tokens on shitty Defi platforms don't count. Even counting those Defi makes only 4% against CEX. If we only count true Bitcoin DEX, like Bisq, well, let's not do it as it's one hundred times worse.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jrrsparkles",
      "created_time": "August 22, 2023, 09:58:30 AM",
      "body": "Even though they existed since 2018 but they came into the spotlight recently through their various kind of promotions and obviously their buzzword No-KYC exchange but they caught on the radar in no time. I bet there will be no centralized exchange that will operate with a tag name of No-KYC before 2024. Even after all the KYC restrictions the DEX liquidity level is nowhere comparable to a centralized exchange.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rikafip",
      "created_time": "August 23, 2023, 08:35:36 AM",
      "body": "Quote from: stompix on August 22, 2023, 08:35:50 AMThe first service I ever see that mentions Catalonia, like for god's sake, why not Galicia or Basque also? Maybe they are big fans of Real Madrid so they don't want those pesky Barcelona fans as their users.  Quote from: stompix on August 22, 2023, 08:35:50 AMBut, let's ignore that cause ......what the **** is \" Knights of Malta\", did I travel back in time by going circling half the globe and it's 1571?Lol, had to google that shit but at least I learned something new. It seems like that order still exists but its not like that makes any more sense. Quote from: jrrsparkles on August 22, 2023, 09:58:30 AMI bet there will be no centralized exchange that will operate with a tag name of No-KYC before 2024. Even after all the KYC restrictions the DEX liquidity level is nowhere comparable to a centralized exchange. While situation doesn't look good and it will be only worse, I don't think that we will end up without any non-KYC exchanges so soon as there will still be those that won't require that. The maybe won't offer as many features like those major ones but you will still be able to exchange the currencies.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Z-tight",
      "created_time": "August 23, 2023, 05:37:54 PM",
      "body": "Quote from: jrrsparkles on August 22, 2023, 09:58:30 AMI bet there will be no centralized exchange that will operate with a tag name of No-KYC before 2024. Even after all the KYC restrictions the DEX liquidity level is nowhere comparable to a centralized exchange. 2024 is just a short time from now for all centralized no-kyc exchanges to make kyc mandatory, but if you say most of them will eventually make kyc compulsory, then i will agree with you. Just like you said, P2p exchanges do not have as much liquidity as centralized exchanges, but that is one of the tradeoffs one has to make if they want to trade without giving their data to a third party or handing over their funds to them in order to trade.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jrrsparkles",
      "created_time": "August 23, 2023, 06:48:31 PM",
      "body": "Quote from: Z-tight on August 23, 2023, 05:37:54 PMQuote from: jrrsparkles on August 22, 2023, 09:58:30 AMI bet there will be no centralized exchange that will operate with a tag name of No-KYC before 2024. Even after all the KYC restrictions the DEX liquidity level is nowhere comparable to a centralized exchange. 2024 is just a short time from now for all centralized no-kyc exchanges to make kyc mandatory, but if you say most of them will eventually make kyc compulsory, then i will agree with you. Just like you said, P2p exchanges do not have as much liquidity as centralized exchanges, but that is one of the tradeoffs one has to make if they want to trade without giving their data to a third party or handing over their funds to them in order to trade.Kucoin, Bitget, and OKX were forced to enforce mandatory KYC in less than a month and you can count the remaining very few which could be a single figure number.Decentralized exchanges are operating too but the liquidity shows that the adoption of decentralized exchange is not happening as expected for some reasons and if people are settled with centralized KYC exchanges then the DEX may cease to exist in a short time too.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yamane_Keto",
      "created_time": "October 02, 2023, 08:20:28 AM",
      "body": "Quote from: Ratimov on October 02, 2023, 07:59:00 AMThere is one less exchange without KYC. Who is next?Why are those exchanges rushing to impose KYC so quickly? We have an average of a large/medium platform every month or a two. I have not read any new legal amendments in Europe, USA, or even the Seychelles and the Cayman Islands, from which licenses are issued for some of these exchanges.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bbc.reporter",
      "created_time": "October 03, 2023, 02:47:58 AM",
      "body": "Quote from: Yamane_Keto on October 02, 2023, 08:20:28 AMQuote from: Ratimov on October 02, 2023, 07:59:00 AMThere is one less exchange without KYC. Who is next?Why are those exchanges rushing to impose KYC so quickly? We have an average of a large/medium platform every month or a two. I have not read any new legal amendments in Europe, USA, or even the Seychelles and the Cayman Islands, from which licenses are issued for some of these exchanges.Clearly this is for the purpose of compliance. Exchanges do not want a compliance nightmare that might come to them later if they do not start imposing KYC on their users today.Also, I agree with Ratimov. This is a pity hehe. Bitget is similar to Kucoin during 2019-2020, always one of the first to list cryptocoin gems in their futures market. It appears that for people who do not want to show their ID, they will only have onchain trading without leverage through DeFi.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "KingsDen",
      "created_time": "October 03, 2023, 01:50:45 PM",
      "body": "Quote from: Yamane_Keto on October 02, 2023, 08:20:28 AMQuote from: Ratimov on October 02, 2023, 07:59:00 AMThere is one less exchange without KYC. Who is next?Why are those exchanges rushing to impose KYC so quickly? We have an average of a large/medium platform every month or a two. I have not read any new legal amendments in Europe, USA, or even the Seychelles and the Cayman Islands, from which licenses are issued for some of these exchanges.The exchanges are there to serve us, please the government and make their money. If they serve us without pleasing the government, they will run into many troubles. In the process of pleasing the government, the exchanges also enjoy some undue favour and find a way to confiscate funds either on their own or conspiring with the government.As adoption increases, the government is discovering effective ways to regulating the industry and the more the regulation, the more centralisation is winning the war against privacy and decentralisation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitcoinsGreat",
      "created_time": "October 03, 2023, 07:38:07 PM",
      "body": "Quote from: bbc.reporter on October 03, 2023, 02:47:58 AMClearly this is for the purpose of compliance. Exchanges do not want a compliance nightmare that might come to them later if they do not start imposing KYC on their users today.I recently created an account on Bitget and did the KYC. Don't know if it was mandatory or not at that time but I did it because I think KYC sometimes helps you recover your account in case of any issues. Secondly, I used Binance and FTX before, so I am used to KYC anyway.For those who do not like KYC exchanges, their options are getting limited day by day. MEXC is the only trusted exchange i know that is still now KYC free, but we never know until how long.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bbc.reporter",
      "created_time": "October 04, 2023, 03:40:20 AM",
      "body": "@BitcoinsGreat. Also, if you want to deposit large amount of funds that you certainly do not want to lose, it might be good for you to do your KYC in advance and know if the exchange will accept your identification cards and other documents. I would also suggest futures exchanges on DeFi for small minnows. I never trusted exchanges similar to MEXC or Tradeogre hehe.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitcoinsGreat",
      "created_time": "October 04, 2023, 01:57:10 PM",
      "body": "Quote from: bbc.reporter on October 04, 2023, 03:40:20 AM@BitcoinsGreat. Also, if you want to deposit large amount of funds that you certainly do not want to lose, it might be good for you to do your KYC in advance and know if the exchange will accept your identification cards and other documents. I would also suggest futures exchanges on DeFi for small minnows. I never trusted exchanges similar to MEXC or Tradeogre hehe.Yeah, that is why I did the KYC in the first place after making the account at Bitget. After the FTX hack, I do not trust any centralized exchanges and therefore i make sure that i withdraw my money once i complete the trade. That is, i deposit the money in the exchange to buy any coin in the spot for trading, if the trade may take some days to complete, i will withdraw that altcoin to my personal wallet, and when I need to sell, I transfer it again to the exchange, sell it and then move the bitcoins/ usdt back to my personal wallet.If you follow this strategy, even trading at small exchanges like MEXC becomes risk free.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bbc.reporter",
      "created_time": "October 07, 2023, 02:56:09 AM",
      "body": "Quote from: Ratimov on October 04, 2023, 02:04:51 PMQuote from: BitcoinsGreat on October 04, 2023, 01:57:10 PMIf you follow this strategy, even trading at small exchanges like MEXC becomes risk free.There are no risk-free strategiesThere is no risk-free tradingThere are no risk-free investmentsThere is no risk-free interaction with centralized servicesThere are no risk-free swaps.When it comes to financial operations, there is always a risk, especially if we are talking about such a high-risk asset as cryptocurrency. Somewhere the risk is small, somewhere the risk is big, but it exists everywhere and always.I very much agree but if someone wants the lowest risk method, I reckon swaps through DeFi and centralized swapping sites like exch.cx might be better options. There is a low chance for those exchangers to ask for identification from small minnows similar to us hehehe. However, centralized exchanges do not care. If a user creates an account with them, they will impose KYC on everyone because it is also being imposed by them by regulators.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}