{
  "id": "topic_5436573",
  "title": "Susano",
  "author": "Susano",
  "created_time": "January 24, 2023, 08:38:37 AM",
  "content": "The volatility of bitcoin won't end anytime, I think we have to give more time for more people to appreciate bitcoin and use it in daily business transactions. At the moment, I believe some form of regulation can help make things pretty much more stable than we have at the moment otherwise we shall experience more issues with volatility. The high price volatility of Bitcoin and other decentralized cryptocurrencies will never evaporate. On the perverse, if the expense of cryptocurrency will improve, the volatility will only boost, as the expense spectrum will develop.As long as the price of cryptocurrency will depend on supply and demand, the high price volatility of cryptocurrency will remain. Still think the ETF funds can solve this problem, or at least will lessen the volatility of Bitcoin. The more control of the market, the less volatility it will be, now we still don't have any rule or laws to govern this market,.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5436573",
  "comments": [
    {
      "author": "Jawhead999",
      "created_time": "January 24, 2023, 09:22:13 AM",
      "body": "Technically it's possible for government to reduce Bitcoin's volatility as long as they control almost of the exchange (centralized exchange) and they're setting the interval when the we can trade our Bitcoin similar like in stock trading.But I will be the one who against the idea to reduce Bitcoin's volatility because the reason why I invest in Bitcoin is the high volatility and low risk. High volatility will boost Bitcoin price and the reason why I say Bitcoin has low risk because Bitcoin has the lowest risk among other cryptos.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "January 24, 2023, 10:06:55 AM",
      "body": "Is it just me or these topics OP creates in quick succession look suspicious as if they were something that an AI would create...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptoPanda",
      "created_time": "January 24, 2023, 10:28:00 AM",
      "body": "Quote from: pooya87 on January 24, 2023, 10:06:55 AMIs it just me or these topics OP creates in quick succession look suspicious as if they were something that an AI would create...The posts are low quality and I’m sure OP knows he can’t merit for them. So what’s the play here? Building activity maybe?? The use of ChatGPT and other AI to make posts is a problem we are going to have to deal with. Unfortunately there is no rule to fight it yet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DooMAD",
      "created_time": "January 24, 2023, 11:30:53 AM",
      "body": "Any time I see someone writing a post discussing how to limit volatility, I tend to assume they either have little concept of price discovery, or understand it but simply don't have any respect for it.  Either way, it seems as though such people are unwittingly asking for market rigging.  Perhaps I just subscribe to a different economic philosophy to most, but I don't think anyone should be in control of that. It's only a problem when people try to meddle.  Just allow the market to do its thing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kakmakr",
      "created_time": "January 24, 2023, 11:40:18 AM",
      "body": "High volatility are caused by constant large volumes of coins being sold or bought in a short time-frame ...and this can only be reduced, if you can distribute more coins to more people. If there are not small groups of individuals that are hoarding a lot of coins and trading with those coins, then we will not see this kind of volatility. We need to put more coins in people's hands.... and not have big traders dumping large amounts of coins, when they want to profit.... or buying large amounts of coins, when the price drop.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "January 24, 2023, 11:49:40 AM",
      "body": "The only thing that could decrease volatility is more controlaccess to bitcoin for everyone — hence more trading volume and liquidity. And yea, an actual spot ETF can most definitely significantly help. Hence why it was quite questionable when a futures ETF was approved, but not a spot ETF.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "January 24, 2023, 11:53:22 AM",
      "body": "volatility is because there is a wide sentiment of peoples desires and needs and costsEG if it costs someone in norway just $16k this week to mine bitcoin and someone in hawaii upto $90k to mine itthat sets the wide window of value vs premium where everyone on the planet has their own set \"price\" they are willing to either buy or sell betweenright now its a great price for people in japan and hawaii and other islanders to buy rather then mine, and not so great price for norway to sell or buy. if they can mine it cheaper. the only true way to calm a real international currency is if everyone on the planet were working and living at the same rate of fiat expense where everyones notion of value and premium were in a more small window.. ..  but thats not how the world forex markets work thus not gonna happen in a world reaching internet currency eitherbut here is the thingin fiat when you see that milk and bread can swing from $0.90 to $2.50 depending on location too.. is fiat really \"stable\", or have we just got used to the changing offers by using words like Sale\" \"discount\" \"roll back\" \"pocket the difference\" \"convenience\" (premium)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "January 24, 2023, 12:53:22 PM",
      "body": "You can't stop the volatility artificially. Try that, and you'll get a financial situation similar to the Federal Reserve who keeps printing money to solve all their problems until there's all kind of inflation and debt problems. Instead, let it take its natural course. A little volatility is healthy, but we will just have to wait to see how the situation naturally plays out.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "January 24, 2023, 01:25:36 PM",
      "body": "Quote from: NotATether on January 24, 2023, 12:53:22 PMYou can't stop the volatility artificially. Try that, and you'll get a financial situation similar to the Federal Reserve who keeps printing money to solve all their problems until there's all kind of inflation and debt problems. Instead, let it take its natural course. A little volatility is healthy, but we will just have to wait to see how the situation naturally plays out.you cant stop it permanently.. but you can temporarilydecember seen artificial holding down of the priceyep whales managed to create a resistance line to keep the price below $17k in december and below $23k last week.. it is possible to manipulate the market temporarily. as long as they stay funded and keep their trade bots arbitraging the spot markets eating up any orders that try to buy above the set levels of the whale botsyep when on a 6 month period you see multiple straightish lines. thats manipulationbut to do it permanently.. well that involves fixing all countries labour rates where everyone on planet works for the same rough income amount to align countries into a small window of variance where things like electric and consumer price index all align too thus everyone on planet sees goods and assets within the same value:premium narrow window of affordability and cost average(not going to happen)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Z390",
      "created_time": "January 24, 2023, 01:35:19 PM",
      "body": "Volatility in Bitcoin price is a part of what drives demand, why would there be any reason to buy if there is no volatility? Even if everyone adopts Bitcoin in future the 4 years cycle will still be in tact because of dollar prints and economy situation, there will be sellers and buyers at the top price then also sellers and buyers at the bottom price. Seriously the only thing why Bitcoin and crypto makes a lot of sense to me apart from store of value in buying back at lower price in a bull market. Right now nothing beats crypto when it comes to investment and returns.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "seoincorporation",
      "created_time": "January 24, 2023, 02:35:30 PM",
      "body": "Here the question is. Do we want to end bitcoin volatility?I think volatility is the best part of bitcoin because we can make huge profits just by holding our coins, and that is how people become rich with bitcoin, buy low and sell high, that's how it works. And bitcoin without volatility wouldn't be as cool as it is right now. It's an investor's tool to hit the moon. So, no one wants to end its volatility.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Blawpaw",
      "created_time": "January 24, 2023, 02:49:21 PM",
      "body": "Quote from: Susano on January 24, 2023, 08:38:37 AMThe volatility of bitcoin won't end anytime, I think we have to give more time for more people to appreciate bitcoin and use it in daily business transactions. At the moment, I believe some form of regulation can help make things pretty much more stable than we have at the moment otherwise we shall experience more issues with volatility. The high price volatility of Bitcoin and other decentralized cryptocurrencies will never evaporate. On the perverse, if the expense of cryptocurrency will improve, the volatility will only boost, as the expense spectrum will develop.As long as the price of cryptocurrency will depend on supply and demand, the high price volatility of cryptocurrency will remain. Still think the ETF funds can solve this problem, or at least will lessen the volatility of Bitcoin. The more control of the market, the less volatility it will be, now we still don't have any rule or laws to govern this market,. Volatility is one of the main characteristics of Bitcoin. Its price is set by offer and demand so there is no fixed price for it. And thats basically the beauty of it imo.I believe that bitcoin will only see ots volatility going down once all coins have been mined. In the meantime, volatility will be a constant, so we should enjoy its volatility and speculate...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "so98nn",
      "created_time": "January 24, 2023, 03:00:53 PM",
      "body": "Last time crypto community was happy about the volatility of bitcoin because it gives amazing experience in terms of trading on short cycles or day trade. May be if we lose the bitcoin's volatility then we might just lose various characteristics and user experience along with it. The industry that we grew over the time is revolving at the center point of bitcoin, it's nature and volatility obviously. That is how everyone knows it and adopting it. The fear of bear and fun of bull, that's what making it more interesting and thrilling over the time. So I would care less about it. Quote from: CryptoPanda on January 24, 2023, 10:28:00 AMQuote from: pooya87 on January 24, 2023, 10:06:55 AMIs it just me or these topics OP creates in quick succession look suspicious as if they were something that an AI would create...The posts are low quality and I’m sure OP knows he can’t merit for them. So what’s the play here? Building activity maybe?? The use of ChatGPT and other AI to make posts is a problem we are going to have to deal with. Unfortunately there is no rule to fight it yet. Meanwhile in parallel universe, yeah we are gonna face artificial challenges real soon. This thing is spreading like virus everywhere. First it was biological pandemic, next is what? AI based pandemic screwing whole digital ecosystem. Funny.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "January 24, 2023, 03:05:49 PM",
      "body": "banks offer 0.01% savings interest.even 15% a year is acceptable. but its funny that people in crypt are not even happy with a 15% a week and are waiting for 100X like they seen in 2011 charts",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "notocactus",
      "created_time": "January 24, 2023, 03:56:45 PM",
      "body": "You can not do anything and if you can, just very small contribution.Volatility of Bitcoin is contributed by some factors like its small trading volume, small marketcap and limited regulations on this market.Bitcoin is a biggest cryptocurrency but it is still too small compares to many big tech companies.The Bitcoin market in particular is too small to be manipulated than stocks market. Institutional investors can more easily manipulate Bitcoin market with smaller capital than what they need to manipulate in stock market.Last but not least, the limited regulations on this market gives great chance for big entities to manipulate it.Educating people around you about Bitcoin is what you can contribute for Bitcoin adoption and let's say Bitcoin volatility.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DeathAngel",
      "created_time": "January 24, 2023, 05:42:30 PM",
      "body": "Bitcoin is such a young asset, volatility is natural when it’s only been around since 2009. If you’re smart about it, volatility is a good thing that you can use to your advantage. Try not to worry too much when bitcoin is down. Patience is required but bitcoin overcomes downturns & FUD, it always does. Just hang in there, buy when it’s down & sell some during bullish periods.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "justdimin",
      "created_time": "January 24, 2023, 07:15:31 PM",
      "body": "Quote from: DeathAngel on January 24, 2023, 05:42:30 PMBitcoin is such a young asset, volatility is natural when it’s only been around since 2009. If you’re smart about it, volatility is a good thing that you can use to your advantage. Try not to worry too much when bitcoin is down. Patience is required but bitcoin overcomes downturns & FUD, it always does. Just hang in there, buy when it’s down & sell some during bullish periods.  I believe that it allows us to make a lot more profit this way, but at the same time it's going away soon as well. Even right now, we are not as volatile as 10 years ago, why? Because it was cents back then, or dollars but low amount, and we were going up x10 easily.Nowadays, in order for bitcoin to go up x10, we would need to be 200k+, and even compared to bottom, it had to be 160k give or take, pretty hard to do. So at the end of the day we are talking about something that is less volatile already. So when it does reach 100k, x10 will be 1 million dollars, and even harder and this is just x10 we are talking about, it was even more volatile back in the day, and will fail to do x10 in the future, that is why I think it's less volatile already.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Synchronice",
      "created_time": "January 24, 2023, 07:37:15 PM",
      "body": "What's wrong with the volatility? I get mad when everyone thinks about this kind of topics and limitations only when price falls but everyone is silenced and paralysed when bitcoin's price skyrockets. Where were the volatility advocates when the price was rising steadily from some cents to hundreds of dollars? Where were people when it was going up to 69K USD? Oh, volatility was good then.Sorry but I love the volatility of bitcoin, it's the nature of this coin and it's what makes it unique too. If you want stable coins, then stick with USDT or some others, it may fulfill your requirements.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hZti",
      "created_time": "January 24, 2023, 07:38:50 PM",
      "body": "I have opened a few topics regarding the volatility of bitcoin and to my surprise the general response was:- People want volatility, since they want to attract people into the bitcoin world.- People want volatility, because they want to earn money with the profits it can bring.- The few people that dont want volatility want to have bitcoin stable in a few years and not now.To me this is crazy, but shows what kind of people the volatility of bitcoin largely attracts.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}