{
  "id": "topic_5453000",
  "title": "Heyui67",
  "author": "Heyui67",
  "created_time": "May 16, 2023, 10:46:58 PM",
  "content": "Stake 93% to reach platinum 3 i need strategyPlease share good dice or other strategies conditions",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5453000",
  "comments": [
    {
      "author": "Hispo",
      "created_time": "May 17, 2023, 01:03:04 AM",
      "body": "I do not quite understand what you are asking for, my friend.You want to reach a higher tier, which means you need to gamble and that means that inevitably you will have to wager your money with the possibility of facing the loss of it to bad luck. If you want my opinion, the VIP or tier system is supposed to be a plus or a feature intended to enhance the experience of people who have a huge volume or wager. It works better when the Tier system is part of the gambling experience and not the thing you are supposed to focus on all the time. Just gamble responsibly and enjoy the tiers you happen to reach naturally",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Volgastallion",
      "created_time": "May 17, 2023, 01:35:57 AM",
      "body": "Quote from: Heyui67 on May 16, 2023, 10:46:58 PMStake 93% to reach platinum 3 i need strategyPlease share good dice or other strategies conditions I dont understand your post but i deduce, you are running out of money and you are very close to reach that level, only 7% remaining, so you want to learn how or what its the best way to reach taht without ending up losing the remaining money no?.Well i dont know exactly because i never chase that kind of lvel/status, but maybe playing some \"secure\" sportsbet or playing low volatility games.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "danherbias07",
      "created_time": "May 17, 2023, 01:57:52 AM",
      "body": "Quote from: Volgastallion on May 17, 2023, 01:35:57 AMQuote from: Heyui67 on May 16, 2023, 10:46:58 PMStake 93% to reach platinum 3 i need strategyPlease share good dice or other strategies conditions I dont understand your post but i deduce, you are running out of money and you are very close to reach that level, only 7% remaining, so you want to learn how or what its the best way to reach taht without ending up losing the remaining money no?.Well i dont know exactly because i never chase that kind of lvel/status, but maybe playing some \"secure\" sportsbet or playing low volatility games.Yes, I think that is what he meant. That 7 percent is still a long way to reach the next level which in his case is Platinum 3. I am playing Stake Originals which is Crash and I think it's a good way to increase your rank faster by putting the cashout number at 1.30. In my case, it was successful but do check the history of the results for this day too as there may be a lot more lower crash than the number I gave. Others are suggesting Plinko, but I tried it and I just lost all my funds. What @Volgastallion suggested is also medium-risk betting if you know your sports. I haven't seen a game that could really boost your VIP rank without losing anything, you just want to lessen the amount that you will sacrifice.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tusandii",
      "created_time": "May 17, 2023, 02:54:08 AM",
      "body": "Each casino will provide different requirements to be able to have an account with a higher VIP rank.If the casino you use imposes wagering requirements for what you want good dice conditions or strategy for craps games, this has nothing to do with increasing VIP rank.If you want to increase your percentage on VIP rank faster then try to bet on sports betting as almost all casinos with wagering requirements for VIP rank will increase your percentage faster when betting on sports than on a game.But before that please answer what exactly is the intent of this thread, at least provide a bit more clarity and purpose in detail.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AHOYBRAUSE",
      "created_time": "May 17, 2023, 03:21:15 AM",
      "body": "Quote from: tusandii on May 17, 2023, 02:54:08 AMEach casino will provide different requirements to be able to have an account with a higher VIP rank.If the casino you use imposes wagering requirements for what you want good dice conditions or strategy for craps games, this has nothing to do with increasing VIP rank.If you want to increase your percentage on VIP rank faster then try to bet on sports betting as almost all casinos with wagering requirements for VIP rank will increase your percentage faster when betting on sports than on a game.But before that please answer what exactly is the intent of this thread, at least provide a bit more clarity and purpose in detail.He is looking for a \"safe\" wager strategy to get the remaining 7%, what's so hard to understand?If you would be familiar with stake forum or stake itself then you would understand.Most common strategy for people to create high volume wager with limited losses is if your playing \"dice\" in stake originals, playing 1.01 odds with a win chance of 98%. Of course there is always a \"recover strategy\" but if you are having a really bad seed this can turn to shit real quick.Of course house edge is always a factor so basically if you wager 1k you will lose around 10$ for ever 1000$ wagered.That being said, if you have 93% to platinum 3 this means you still have to wager 35000$, which is actually doable. If you only do sports betting that's 12k in bets, but a risk of losing a lot. If you do the 1.01 wager strat you will have a calculated loss of around 300-400$. Considering the base reward for platinum 3 is 800$ plus recent gameplay bonus plus a 42 day reload I would say this calculated loss is acceptable and worth it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Slow death",
      "created_time": "May 17, 2023, 08:27:53 PM",
      "body": "maybe it's naive on my part to say what I'm posting, but if you've been at 93% for some time and you're betting 100$ a day for example, then all you need to do is double the amount you're betting daily to 200% with that the percentage number will start to increase faster, of course it won't be a big increase, but let's say that you committed the madness of betting 300% of the daily value that you already bet, then that could make you have a big increase and for sure that in a short time you would reach 100%, at least that's what I can see looking at my accountthe more money you bet per day, the faster you level up your account, but my point is whether it's worth doing this, because you can spend a lot of money in this process and then finally get the highest vip account and find that the benefits of highest vip account have been reduced and that with that you will not be able to recover all the money you have spent and the most serious thing is that even if they have not reduced you do the calculations and realize that you will not be able to obtain a benefit that compensates for all your expenses, remember that bad luck is not things to obtain profits",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "swogerino",
      "created_time": "May 17, 2023, 08:38:20 PM",
      "body": "Quote from: Heyui67 on May 16, 2023, 10:46:58 PMStake 93% to reach platinum 3 i need strategyPlease share good dice or other strategies conditions I don't know if this will help you but I usually get 4% with a single strategy and that is using IDR as my money and buying the bonus with any rate you look on your budget,keep buying the bonus game in the Gates of Olympus and you will get a lot of fun trying to find that x5000 max win and that x500 max multiplier.I only play like 20-40 dollars weekly and I just became a mere Bronze VIP about 3 weeks ago but since I have become VIP I am already 16.60% with just 3 weeks doing this trick.I hope this helps and as I said keep using a bet value that is convenient to you so you can play as long as you can and of course you will be using a relatively high bet considering your level.By doing so you will increase also weekly boosts and of course the monthly bonus so I do that also for this other reason and with this I gave away my perfect level up building strategy  .",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "harizen",
      "created_time": "May 18, 2023, 09:47:33 PM",
      "body": "Quote from: Heyui67 on May 16, 2023, 10:46:58 PMStake 93% to reach platinum 3 i need strategyPlease share good dice or other strategies conditions Just bet on your usual, don't make it rush. Curious here, how come you only started to become concerned starting at 93% experience progress? Just continue to stick with how you progress from 1%. Maybe you just become too hyped that it's now only a few percent needed to reach the other level but as far as I can tell, that 7% is still worth a decent wagered money left to fulfill. Regardless of the dice strategies you are looking for, it will really depend on how your damn luck associates you. Aside from that, a decent bankroll is really necessary to last long. I'm sure you should already know the answer to that question of yours being a Stake Platinum II VIP not unless you are not the one who made that progress.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lanatsa",
      "created_time": "May 18, 2023, 09:54:37 PM",
      "body": "Quote from: harizen on May 18, 2023, 09:47:33 PMQuote from: Heyui67 on May 16, 2023, 10:46:58 PMStake 93% to reach platinum 3 i need strategyPlease share good dice or other strategies conditions Just bet on your usual, don't make it rush. Curious here, how come you only started to become concerned starting at 93% experience progress? Just continue to stick with how you progress from 1%. Maybe you just become too hyped that it's now only a few percent needed to reach the other level but as far as I can tell, that 7% is still worth a decent wagered money left to fulfill. Regardless of the dice strategies you are looking for, it will really depend on how your damn luck associates you. Aside from that, a decent bankroll is really necessary to last long. I'm sure you should already know the answer to that question of yours being a Stake Platinum II VIP not unless you are not the one who made that progress.If we do look on hows that Plat 3 overall wager then here's the list.Levels & Requirements Bronze: $10,000Silver: $50,000Gold: $100,000Platinum: $250,000Platinum II: $500,000Platinum III: $1,000,000Platinum IV: $2,500,000Platinum V: $5,000,000Platinum VI: $10,000,000Diamond: $25,000,000Diamond II: $50,000,000Diamond III: $100,000,000Diamond IV: $250,000,000Diamond V: $500,000,000Obsidian: $1,000,000,000https://help.stake.com/en/articles/4793501-stake-vip-program-overviewIf he's 93% then it is really nearly $1M wager overall which i could say that OP is a whale. Asking out for some strategy?Just like on what you said that it would be better that he would be sticking out into his own because he wont reallybe reaching out this far without learning something. lol",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Volgastallion",
      "created_time": "May 18, 2023, 09:57:39 PM",
      "body": "Ey Lanatsa really good info you put.I dont know what to think about this guys, seems like a gambling addict or a complete liar, you can see the other threads he had created. How any guy who play nearly 1.000.000 usd its gonna ask for strategies?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "n0ne",
      "created_time": "May 18, 2023, 10:47:54 PM",
      "body": "Quote from: Heyui67 on May 16, 2023, 10:46:58 PMStake 93% to reach platinum 3 i need strategyPlease share good dice or other strategies conditions I don't understand what you're asking for. My understanding, you've reached 93% and 7% remaining to reach the Platinum lll Level. If thats what you've requested for, then my suggestion is not to get into any urge. Just wager same as the way you do earlier. Surely there'll be more excitement to reach the level, the urge could make you loss more. Stay safe and gamble.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "boyptc",
      "created_time": "May 18, 2023, 11:13:13 PM",
      "body": "Quote from: Volgastallion on May 18, 2023, 09:57:39 PMHow any guy who play nearly 1.000.000 usd its gonna ask for strategies?I'm in between of thinking that it's legitimately being asked by a gambler who's about to reach that level. Or simply out of nowhere and tries to ask some inputs and will probably be there anytime soon. Well, @OP. You've got already inputs and suggestions from everyone so, just take time and do it naturally. You don't need to be hasty and how you've been into that 93% why change some things for the remaining 7%?As said, don't put high odds until you make it there.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ralle14",
      "created_time": "May 18, 2023, 11:52:16 PM",
      "body": "Instead of chasing the next level, i'd suggest taking it slow because it might lead to more losses. Participate in their regular promotions and wait out your monthly rewards so you don't lose as much while closing in on your Platinum 3.Quote from: Volgastallion on May 18, 2023, 09:57:39 PMI dont know what to think about this guys, seems like a gambling addict or a complete liar, you can see the other threads he had created. How any guy who play nearly 1.000.000 usd its gonna ask for strategies?OP might be in desperation mode, and I don't think he's lying since dice is one of the good games to grind your VIP progression.There's nothing wrong in asking for strategies because others might've found a better alternative that doesn't require much budget. I remember sharing mine on another thread, and it helped others avoid unnecessary losses because it was costly to wager on most of the required games. Also, gamblers can still reach that amount even if they don't have a big gambling budget.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jating",
      "created_time": "May 19, 2023, 12:03:48 AM",
      "body": "Quote from: Heyui67 on May 16, 2023, 10:46:58 PMStake 93% to reach platinum 3 i need strategyPlease share good dice or other strategies conditions You just have to ask yourself on how you reach that 93% though. For sure you just have to play on Stake for a long time and then played on your favorite, be it slot machines, sports betting, live casino games and dice.So that's it, there's no secret strategy for going up to a VIP level program in any sports casinos.Just enjoy games, put a bet (obviously you might have lost big money already on their platform if you are about to reach Platinum level). Don't rush things, again, have fun and best of luck!.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wexnident",
      "created_time": "May 19, 2023, 12:04:46 AM",
      "body": "Hey I mean assuming the 93% means you're already at 93% of the requirement, I don't think you're that far off. That's about $7,000 (assuming my math isn't off) that you have left, by the amount you've already wagered that should be peanuts (or a bit above that maybe) from your pov.No strategy in gambling really, just spend what you can. If You're having difficulties cause of that same rule, then take your time, I don't think there's a need to rush, and neither should you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "entebah",
      "created_time": "May 19, 2023, 02:39:15 AM",
      "body": "Quote from: Lanatsa on May 18, 2023, 09:54:37 PMIf he's 93% then it is really nearly $1M wager overall which i could say that OP is a whale. Asking out for some strategy?Just like on what you said that it would be better that he would be sticking out into his own because he wont reallybe reaching out this far without learning something. loli think the OP is still on Platinum II and needs 7% to get Platinum 3 if we calculate it from your list. The OP still needs 35k wager more to be able to level up to Platinum 3 and get an 800$ bonus plus daily reload for 14 days from stake.if you still have balance maybe do a sports bet on 1.01x ~ 1.09x because wagering on a sports bet when the bet is settled gives you a 3x wager.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitinity",
      "created_time": "May 19, 2023, 09:21:56 AM",
      "body": "Quote from: Heyui67 on May 16, 2023, 10:46:58 PMStake 93% to reach platinum 3 i need strategyPlease share good dice or other strategies conditions Means that $35k wager to do to reach Platinum 3. I dont think it is hard to do, but my suggestion is not to bet higher than what you usually do. It will be also depending on how much you can afford to lose to wager this $35k. If you are patient enough, you can wager $35k with flat betting strategy and bet something like $0.1-$0.5 per bet (depending how much you want to spend) and play with higher winning percentage but not too low odds (maybe 1.2x-1.75x). I think $50-$100 is more than enough for you to reach reach Plat III to receive $800 bonus + recent bonus activity. Even if you lose all your starting balance, the bonus you receive will recover it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tusandii",
      "created_time": "May 19, 2023, 09:50:21 AM",
      "body": "Quote from: AHOYBRAUSE on May 17, 2023, 03:21:15 AMQuote from: tusandii on May 17, 2023, 02:54:08 AMEach casino will provide different requirements to be able to have an account with a higher VIP rank.If the casino you use imposes wagering requirements for what you want good dice conditions or strategy for craps games, this has nothing to do with increasing VIP rank.If you want to increase your percentage on VIP rank faster then try to bet on sports betting as almost all casinos with wagering requirements for VIP rank will increase your percentage faster when betting on sports than on a game.But before that please answer what exactly is the intent of this thread, at least provide a bit more clarity and purpose in detail.He is looking for a \"safe\" wager strategy to get the remaining 7%, what's so hard to understand?If you would be familiar with stake forum or stake itself then you would understand.Most common strategy for people to create high volume wager with limited losses is if your playing \"dice\" in stake originals, playing 1.01 odds with a win chance of 98%. Of course there is always a \"recover strategy\" but if you are having a really bad seed this can turn to shit real quick.Of course house edge is always a factor so basically if you wager 1k you will lose around 10$ for ever 1000$ wagered.That being said, if you have 93% to platinum 3 this means you still have to wager 35000$, which is actually doable. If you only do sports betting that's 12k in bets, but a risk of losing a lot. If you do the 1.01 wager strat you will have a calculated loss of around 300-400$. Considering the base reward for platinum 3 is 800$ plus recent gameplay bonus plus a 42 day reload I would say this calculated loss is acceptable and worth it.Yes I know that, but no betting or strategy is completely safe to use because everything has a risk of losing.The strategy of playing craps, as you said, I tried before to be able to increase the bet to increase the percentage in the VIP rank, but playing craps takes longer because the increase is quite slow and the main choice is to bet on sports.If you take into account the number of losses, it is true that dice saves more money because the losses you get are not too big compared to sports betting.In my opinion, this is the choice of a gambler who wants to level up faster with a greater risk of losing or chooses to be patient to raise the level but with a relatively small loss rate.If I myself was a gambler who had a lot of money and wanted to level up I would much rather bet on sports betting because I am a gambler who really loves sports betting.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ryzaadit",
      "created_time": "May 19, 2023, 10:23:21 AM",
      "body": "Based of my experience, depends you're chasing.Since you're playing for chasing wagering, that's mean you're ready to sacrifice money (burn money) to chase the waggering. Most the time playing \"Dice, Limbo, Roulete\" because you can set up with higher chance win.Up to you, but try to higher chance win.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}