{
  "id": "topic_5402998",
  "title": "Smack That Ace",
  "author": "Smack That Ace",
  "created_time": "June 17, 2022, 04:49:32 PMLast edit: June 17, 2022, 07:17:48 PM by Smack That Ace",
  "content": "Someone will keep telling you that Bitcoin has collapsed… if you don't zoom out, you won't see the truth.January 2015 - Bitcoin plummets to $225July 2017 - Bitcoin plummets to $2500June 2022 - Bitcoin plummets to $20KSomeone will still tell you later, bitcoin crashed to $200K… run before it's too late.Bitcoin has been around for 13 years and for the last 13 years the negatives about bitcoin have always been there and you know bitcoin hasn't stopped yet.source: ThuanCapital",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5402998",
  "comments": [
    {
      "author": "virtualdn",
      "created_time": "June 17, 2022, 05:12:12 PM",
      "body": "Yeah, imagine when BTC will crash from $200,000 to $100,000: run for your lives, sell everything and forget about it   Such drama in this world. This is why HODLing and relaxing is the best way to handle these things. 1 BTC = 1 BTC even in 2140.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Upgrade00",
      "created_time": "June 17, 2022, 05:23:30 PM",
      "body": "At every point in the past, anyone who has held Bitcoin through market crisis has been right to hold, as the price has progressively appreciated despite inflation and global economic recession.Media houses would still release such headlines to get traffic and stay in the times. As a hodler, such reports or even the price fluctuations do not matter much. All that matters is buying and having a secure storage to hold in.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Silberman",
      "created_time": "June 17, 2022, 05:32:05 PM",
      "body": "Quote from: Upgrade00 on June 17, 2022, 05:23:30 PMAt every point in the past, anyone who has held Bitcoin through market crisis has been right to hold, as the price has progressively appreciated despite inflation and global economic recession.Media houses would still release such headlines to get traffic and stay in the times. As a hodler, such reports or even the price fluctuations do not matter much. All that matters is buying and having a secure storage to hold in.If there is an industry that cares more about the short term than the mainstream media I do not know it, there is not even a need to instruct them to do anything as by nature they will tell you about how horrible is to hold bitcoin when anyone that has done it for a significant amount of time has profited from that decision, but does that matter at all for them? Not really, all what they care about is the recent drop of bitcoin and how this is a sign this time their 1156 prediction of the death of bitcoin will finally become true.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Smartvirus",
      "created_time": "June 17, 2022, 06:00:08 PM",
      "body": "I met with a friend after months of being apart that knew that I have some bitcoin to my portfolio and she said, when the bitcoin started making the dip it's been going about now, that the first thing that came to her mind was me! I smiled and somehow told her I saw that coming, judging from our closeness. She predicted tha it was going to get worst and I should withdraw all within my crypto portfolio if any is left and I was just listening immensely and intensely for her to finish. She said, she has this guy she follows on social media that deals with stocks and have far predicted the bitcoin crash and she was thinking of giving me his user so I could follow and get fair updates. She kept going on and on until I was tired of listening and I started teaching her the little I knew.I just had to recount to her that the stories and the dips are normal. That, its not the first time we are seeing this happen, its needed for a healthy market condition as, it can't keep going up and up. A bearish market balances things off and creates room for new investors to come in and I kept pushing until she followed. It's just so much pressure in times like this and those that don't know any better would be hasty in there actions. If you don't know anything anything else just know this, \"all we face and hear now, is normal\".",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Welsh",
      "created_time": "June 17, 2022, 06:05:40 PM",
      "body": "Quote from: Upgrade00 on June 17, 2022, 05:23:30 PMMedia houses would still release such headlines to get traffic and stay in the times. As a hodler, such reports or even the price fluctuations do not matter much. All that matters is buying and having a secure storage to hold in.You only have to look at their reporting history to find out their bias. Most only produce articles that are sensationalist, so when Bitcoin returns or even goes beyond what they've previously reported as the bubble bursting, they don't post anything about it since it doesn't get the clicks, and they'll focus their attention on something else happening in the world which will. My news intake has gradually gone from semi frequent to non existent. The only time I was invested in the news somewhat was with Covid, since I needed to know what was going on, especially when it comes to business, and what was, and wasn't allowed etc. Other than that, I don't even check the weather these days. I used to search for neutral news sites, then quickly come to the conclusion that they don't really exist. Even the ones which are known for being more neutral than others, have a bias in some shape or form.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Upgrade00",
      "created_time": "June 17, 2022, 06:59:08 PM",
      "body": "Quote from: Silberman on June 17, 2022, 05:32:05 PMIf there is an industry that cares more about the short term than the mainstream media I do not know it, For some it's sponsored propaganda, for others it's a bid to align with the bias of governments, and others are just skeptical and are looking for ways to trend using catchy headlines about bitcoin's death.Journalism in general has taken a huge drop in the last decade and there seems to be no bottom yet as it becomes more about who can get more attention by being the most dramatic.Quote from: Welsh on June 17, 2022, 06:05:40 PMI used to search for neutral news sites, then quickly come to the conclusion that they don't really exist. Even the ones which are known for being more neutral than others, have a bias in some shape or form. Exactly this.How people view the world these days has greatly become a result of what news outlets you listen to as each have their own side of the story, while the actual story takes the back seat.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "The Cryptovator",
      "created_time": "June 17, 2022, 07:12:35 PM",
      "body": "Interesting title lol. We know the reason for Bitcoin's popularity and that is volatile. We are making profits by taking advantage of the volatile. So it will exist until Bitcoin exist. Why I am saying that is because a lot of institutional investors entered Bitcoin and they are accumulating at a low price. The current situation is quite bad if you compare it with ATH. But good if you compare it with a historical price. So we may see a bounce back anytime if it doesn't collapse below $20K. And I believe Bitcoin won't die at all.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "masulum",
      "created_time": "June 17, 2022, 07:47:14 PM",
      "body": "CNBC Globalversion  turns out to have the same junk article. I think it's only the local version of CNBC in my country that spreads articles that seem to assume that bitcoin is a bad asset when it drops more than 2%. However, they are also not shy about giving a positive reaction when bitcoin is bullish. This media is not fair with bitcoin, so I choose not to read articles from CNBC anymore. Their quality is very poor when spreading a news about BTC.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "btc_angela",
      "created_time": "June 17, 2022, 08:40:31 PM",
      "body": "Quote from: virtualdn on June 17, 2022, 05:12:12 PMYeah, imagine when BTC will crash from $200,000 to $100,000: run for your lives, sell everything and forget about it   Such drama in this world. This is why HODLing and relaxing is the best way to handle these things. 1 BTC = 1 BTC even in 2140.True, been saying that as well, $150k-$75k but for me it's conservative,   but at $75k a pop? damn that was a great investment still specially to investors who have been holding bitcoin for years (like you) and maybe bought it at $100 or even $1000, that is a huge return already.As for the supposedly collapse, nothing new, this is already a broken record already. They will suddenly change the tune in the next bull run, that's for sure.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Davidvictorson",
      "created_time": "June 17, 2022, 08:58:01 PM",
      "body": "News outlets and bloggers need a headline like this because if they don't get the views or the clicks, they might not get paid. This is my second time experiencing this event since I became a full-fledged Bitcoin HODLer. Nowadays, my two favorite pastimes are watching videos on the history of bitcoin and watching MTV Base. While the former gives you hope, the latter furnishes you with good music that relaxes your mind.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gyfts",
      "created_time": "June 17, 2022, 09:44:46 PM",
      "body": "Panic and hysteria articles from CNBC are just to generate clicks/revenue, though your point stands. Any time the market corrects or is shocked, there's the tendency for people to claim victory -- a \"I told you so\" moment. They fail to examine the historic price of BTC and recoveries it undergoes. Not due to any malicious intent, perhaps due to ignorance. However, this argument works both ways. Someone that bought at 66k/BTC, for example, can't \"zoom out\" of the graph in any way that would recuperate his losses. To them, Bitcoin might be dead. It'd be foolish to liquidate in this market, but some may not have had a choice.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Welsh",
      "created_time": "June 17, 2022, 09:51:20 PM",
      "body": "Quote from: Upgrade00 on June 17, 2022, 06:59:08 PMExactly this.How people view the world these days has greatly become a result of what news outlets you listen to as each have their own side of the story, while the actual story takes the back seat.It's a shame. It's even more evident with news sites, and their stance on Bitcoin. I hate it when so called economy experts talk about Bitcoin. They seem to focus on the risk involved, when I consider the risk of Bitcoin to be substantially lower than any other investment that you could make. The thing is in the same line of breath they'll go recommend some risky stock or they'll say to invest in property, saying it has historically gone up. They fail to mention that its because of inflation. Even the dedicated Bitcoin news sites I'm not a huge fan of. Most of them pull the same sort of stuff that traditional media does.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Minor Miner",
      "created_time": "June 17, 2022, 10:01:01 PM",
      "body": "Quote from: Davidvictorson on June 17, 2022, 08:58:01 PMNews outlets and bloggers need a headline like this because if they don't get the views or the clicks, they might not get paid. This is my second time experiencing this event since I became a full-fledged Bitcoin HODLer. Nowadays, my two favorite pastimes are watching videos on the history of bitcoin and watching MTV Base. While the former gives you hope, the latter furnishes you with good music that relaxes your mind. Criticism of good things is a little more. Negative things are more likely to catch people's eye, cause people like criticism. And the media manages their business by capitalizing on it. You will notice that there is more negative news about Bitcoin than there is positive news all over the online and news portals.Anyway hopefully very soon we will see a bullish phase again, now offer price is running for newcomers , so everyone should buy Bitcoin at the offer price.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ghepetto",
      "created_time": "June 17, 2022, 10:23:15 PMLast edit: June 17, 2022, 11:06:51 PM by Ghepetto",
      "body": "I'm having fun with it -when people ask if I am ok I say yes, I just got a job at the local petrol station.  We are at an all time low on crypto sentiment. After the Luna crash people new to crypto have been shaken, rightfully so.  But for people who are seasoned, the BTC drop is par for the course.  And the press is desperate for clicks these days.The press is dead, they all turned activist and forgot to tell anybody.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "D ltr",
      "created_time": "June 17, 2022, 10:34:49 PM",
      "body": "price drops like this are common, and are always balanced by negative news, sometimes publishers of articles like this, always follow the direction of the price when btc goes down they hit btc with bad news from various sources, and vice versa, but for true holders and they pioneered bitcoin from the price of 10 $ they will not worry because as long as the volume movement in the market is still there, I don't think bitcoin can be said to be dead",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "aoluain",
      "created_time": "June 17, 2022, 11:01:01 PM",
      "body": "Just like the thread title the media rely on sensationalism and at times like this Bitcoinis a popular target. Its funny that they fail to state or maybe they just dont see it that each big crash fails to go below the previous one.Quote from: Smack That Ace on June 17, 2022, 04:49:32 PMSomeone will keep telling you that Bitcoin has collapsed… if you don't zoom out, you won't see the truth.January 2015 - Bitcoin plummets to $225July 2017 - Bitcoin plummets to $2500June 2022 - Bitcoin plummets to $20KSomeone will still tell you later, bitcoin crashed to $200K… run before it's too late.Even looking at the negative prices the pull back prices they still show growth from halving to halving, the media are not going to state that.Its funny, even at times like these I find it hard in some ways to be negative.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oceat",
      "created_time": "June 17, 2022, 11:29:42 PM",
      "body": "Isn't this a normal price even if people keep telling that Bitcoin is dead everytime they see the price went deeper than what they thought? It's been a long time since I've heard that words but there are some people won't accept the fact that the market is just like this no matter what fact you gave to them. They should be lucky to have this price again because how could they buy if Bitcoin are still staying at the ATH? I bet they don't know that or they just assumed that it would go down for a bit then pump again after the dip buy they never knew that this how the market works.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cheezcarls",
      "created_time": "June 17, 2022, 11:42:49 PM",
      "body": "Yes we've heard that many times already and I just keep doing DCA'ing with Bitcoin every month! It's my commitment to build wealth overtime as I do not want to make that same mistake like in my previous years of ignoring or fearing to invest into BTC due to volatility. I don't care if it's boring it may take years to take off. As long I have extra \"not beer\" money every month to spare, I'll keep buying Bitcoin even if it goes down much further.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tabas",
      "created_time": "June 17, 2022, 11:43:08 PM",
      "body": "They will never change when it's about bitcoin dropping from its all time high. The same thing has been said when it's still on the top, they keep telling that it will go down and then it does. Now that it has came down, they'll keep telling on the same thing about its decrease and they never get tired of it.It's true that even if bitcoin goes to 6 digits and it's likely the bottom of it, they'll tell again that it's dropping and almost dead. Well, that's always been the context that they tell.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}