{
  "id": "topic_5429272",
  "title": "Marcellin9",
  "author": "Marcellin9",
  "created_time": "December 16, 2022, 07:50:20 AM",
  "content": "Former U.S President Donald Trump has recently issued his own NFTs called Trump Digital Trading Cards. The purchasing perks are abundant such as a dinner with Trump, access to his community, golfing with Trump, Zoom calls etc. It looks as normal as other celebrity's NFT issuance but also seems more than that. Personally I think it is also political and deeply related to his political campaign. The majority of potential buyers must be his political supporters and fans. This NFT thing may be another digital means to connect him with his vast fanbase. What is your opinion on this and why ?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5429272",
  "comments": [
    {
      "author": "abel1337",
      "created_time": "December 16, 2022, 11:52:24 AMLast edit: December 16, 2022, 12:08:52 PM by abel1337",
      "body": "I don't know if this the news is legit since I don't see any tweet from Donald Trump himself but if it happened to be true it will be a cringworthy NFT, I'm sure that many will agree with me. I don't see myself purchasing this kind of NFT since I'm not a fan of trump and I also don't like the possible utility he said about his card infomercial. I would personally choose a quality NFT over this if I was given a chance.Though this can convert some boomer fans into being open minded with crypto but yeah I hope that this isn't real.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "December 16, 2022, 12:37:45 PM",
      "body": "Wheres the source OP? I didnt find any tweet as well of him having these kind of perks. But I think if these are the privileges then its good also for those fanbase of trumps. There are many who likes Trump and having these kind of perks will surely hit some of the nft collector and rip of those benefits.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "posi",
      "created_time": "December 16, 2022, 12:43:16 PM",
      "body": "Quote from: abel1337 on December 16, 2022, 11:52:24 AMI don't know if this the news is legit since I don't see any tweet from Donald Trump himself but if it happened to be true it will be a cringworthy NFT, I'm sure that many will agree with me. I don't see myself purchasing this kind of NFT since I'm not a fan of trump and I also don't like the possible utility he said about his card infomercial. I would personally choose a quality NFT over this if I was given a chance.Though this can convert some boomer fans into being open minded with crypto but yeah I hope that this isn't real. As far as I know, he hasn't come back to twitter yet, so how can you see he will announce with his tweet? I also looked at the news and I think it's true.Former US President Donald Trump was once said to have no interest in cryptocurrencies, but now his release of the NFT collection on blockchain polygon shows that everyone will know about cryptocurrency and will accept it one day. Crypto is inevitable, everyone will use it and it is the future of our world.https://cryptoslate.com/former-us-president-donald-trump-launches-nft-collection/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zasad@",
      "created_time": "December 16, 2022, 01:27:09 PM",
      "body": "45,000 NFTs at $100 is a very small amount in the end. I think he started selling his NFTs at the wrong time when the hype was over. But such people always do such actions for their own benefit, maybe this is one way to appear modern in the new election campaign in 2024.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "diminizio",
      "created_time": "December 16, 2022, 02:09:07 PM",
      "body": "I can't give a personal opinion on former US President Donald Trump's NFTs or infer the underlying purpose of their publication. However, it can be argued that NFTs (non-fungible tokens) have become an increasingly popular trend in recent years, with many celebrities and other individuals issuing their own NFTs. NFTs can be a way for celebrities or other individuals to connect with the fan base and offer unique and limited content or experiences. However, as with all digital assets, it is important for potential buyers to consider the risks and evaluate whether the NFT purchase is a wise investment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "avikz",
      "created_time": "December 16, 2022, 02:30:35 PM",
      "body": "Quote from: Marcellin9 on December 16, 2022, 07:50:20 AMFormer U.S President Donald Trump has recently issued his own NFTs called Trump Digital Trading Cards. The purchasing perks are abundant such as a dinner with Trump, access to his community, golfing with Trump, Zoom calls etc. It looks as normal as other celebrity's NFT issuance but also seems more than that. Personally I think it is also political and deeply related to his political campaign. The majority of potential buyers must be his political supporters and fans. This NFT thing may be another digital means to connect him with his vast fanbase. What is your opinion on this and why ? There could be many reasons for it. Funding of his political campaigns can be one major reasons for such NFTs. Because a lot of rich people in US follows right wing political leader like him. So probably some of his associates have found this as a way to make money out of his fame. But anyway, it's a stupid step! His party may be able to sum up few millions through this NFT staff but that won't help him in connecting back with the people of US.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "uneng",
      "created_time": "December 16, 2022, 05:08:44 PM",
      "body": "His wife has already launched a NFT campaign years ago on Solana chain. He must be following the same strategy for profits. I suspect these collections are means of laundering money, since there aren't limits on how much a NFT should cost. It can cost 1$ or 1,000,000$, depending the buyer. And no one will say it doesn't worth that price, because everything on this niche is subjective, just like physical art pieces.You see many influent people creating NFTs and making huge profits by selling them, however, if an average internet user follows the recipe and creates a NFT collection on his own, he won't be able to sell it at all for a single penny...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "albon",
      "created_time": "December 16, 2022, 05:19:22 PM",
      "body": "Former President Donald Trump may have issued his group of NFTs for purely political purposes, although he denied that this group of NFTs is related to his political aspirations only to keep up with modern technology, and it is worth noting that the price of one NFT is only one hundred dollars, and this is a very cheap amount compared to many NFTs For many other famous people, and compared to the privileges that its holders will receive, they can attend a dinner party with him in Palm Beach, Florida, or even meet him. Frankly, I liked Trump's group of NFTs, but they are not professional. In these NFTs, Trump's face appears as a cartoon on the bodies of Astronauts, fighters, and superheroes, and it's good that Donald will be the second person after his wife from the Trump family to get involved in the virtual world. The arena of NFTs is constantly growing, and it is great to see many celebrities worldwide promoting and getting involved with it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kryptqnick",
      "created_time": "December 16, 2022, 06:22:06 PM",
      "body": "I just wanted to make a thread on this matter. Just yesterday, Donald Trump announced the launch of his own NFT cards, $99 each. They could be bought with Ethereum, not just fiat. There's a very weird video of Trump presenting this product, being so full of himself but also looking kind of like an old version of Homelander from the Boys, yet somehow not realizing that it isn't a good thing. According to the website, the cards are already sold out. In terms of sources, there's the official website but also legit media articles like this one.Given Trump's problematic reputation, this might not be good publicity for NFTs and Ethereum, so I'm kind of happy Bitcoin was no part of this campaign.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ryzaadit",
      "created_time": "December 16, 2022, 07:11:17 PM",
      "body": "It's funny, he sold his soul for NFTs.He already a billionaire, why need to push him self into \"NFTs\" things. I tough this of collection is just a bunch of scammer who want to using his name, but if it's a true collection from him.I don't really know, why the reason he going to NFTs.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitstar_coin",
      "created_time": "December 16, 2022, 07:22:47 PM",
      "body": "I didn't know NFTs have gone this far, if Trump will actually issue his own NFT just indicate how far this trend has really gone. Although I have seen this news in other news outlets so I can not say for certain this is legit news. it is possible it is fake news One thing I know is NFTs are still very active, those who think the hype has died down, that could be possible because what is happening now is - most of the NFT projects created for quick cash are dying and giving room for more legit and standard NFT projects.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rhomelmabini",
      "created_time": "December 16, 2022, 07:43:21 PM",
      "body": "It sold out within a short time frame, maybe people sought it or just want to flip it in the future. After all, it's not that high compare to other collections but you don't need to tokenized it maybe Trump is just living the hype of NFTs these days. To anyone, if you're a collector then it's fine but for those that wants utility maybe you need to review it first like, \"do you really need it?\".",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o48o",
      "created_time": "December 16, 2022, 08:04:50 PM",
      "body": "Quote from: ryzaadit on December 16, 2022, 07:11:17 PM-cut-I don't really know, why the reason he going to NFTs.Because he is broke and wants attention. Do we have to look deeper? I can't wait him to brag how valuable they will be in the future and because of it, whole event would be illegal sale of securities.When i got the Twitter account @nftcollector i knew NFTs would be big but this is just pathetic and surreal. We are definitely not have seen the bottom yet. This is one of the strongest signals for market crash.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Silberman",
      "created_time": "December 16, 2022, 08:22:02 PM",
      "body": "Quote from: zasad@ on December 16, 2022, 01:27:09 PM45,000 NFTs at $100 is a very small amount in the end. I think he started selling his NFTs at the wrong time when the hype was over. But such people always do such actions for their own benefit, maybe this is one way to appear modern in the new election campaign in 2024.I think this is the correct answer, Trump has been very clear about his idea that the US dollar must reign supreme over all the other currencies, so how can we interpret this move by Trump? More than the money this is to show the young people which may be interested in him that he can adapt to the times and support this market, and even if it should be clear he will never do that, he wants to give the impression he could to gain votes during the next election.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "el kaka22",
      "created_time": "December 16, 2022, 09:52:28 PM",
      "body": "Grifting? I mean this dude is famous for grifting, he sold houses twice, he kicked thousands of blacks out of their homes and built big skyscrapers to put rich people in, his entire life was about making a buck, no matter what the ethical question is all about.It means he could sell NFT's with absolutely no worth at all, no utility, no usecase, just to make sure that his followers would gobble it up and he could make some money out of it. And he is doing exactly that right now as well, he is just trying to make a buck. Some people are like that, they care about money more than they care about ethics or morality of it, and I understand, it's just in some peoples nature.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "livingfree",
      "created_time": "December 16, 2022, 10:31:28 PM",
      "body": "Thinking of early politicking can't be gone because he plans to run again after the term of Biden is done.Well, it's like any other people that are releasing their NFT so it doesn't matter a lot because everyone can issue their NFTs and have those benefits like that you've mentioned.That's the use case of it but not that odd anymore.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Marcellin9",
      "created_time": "December 17, 2022, 03:16:20 AM",
      "body": "Quote from: cryptoaddictchie on December 16, 2022, 12:37:45 PMWheres the source OP? I didnt find any tweet as well of him having these kind of perks. But I think if these are the privileges then its good also for those fanbase of trumps. There are many who likes Trump and having these kind of perks will surely hit some of the nft collector and rip of those benefits. https://twitter.com/cz_binance/status/1603446729499475968  Please check this out.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wexnident",
      "created_time": "December 17, 2022, 03:44:50 AM",
      "body": "For fun? Idk this seems just like a rich man playing with things he can play with. Maybe he's playing his cards so that NFT bros stand with him for reelections (which won't happen, unless they were already standing there in the first place) or something similar. I honestly wouldn't even consider buying NFTs, not just his, but any type really unless you want it as a collection of sorts. There are also some side benefits with his Lottery-esque system, but I honestly would not buy it just for that. Maybe as a resell to earn money, which is what most would probably do.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mr. Magkaisa",
      "created_time": "December 17, 2022, 05:29:10 AM",
      "body": "If you look at this article  Trump announces 99$ digital Trading Card it seems that the tone has changed of his speech about crypto. Former president Donald Trump released 45k NFT which he announced on his own social media platform which is TRUTH SOCIAL.And NFTs can be minted on the Polygon network for 99$, using payment in ETH or Fiat currency.Another benefit that can be obtained from these NFTs is a \"Guaranteed ticket to a Gala dinner with Trump where the condition is that you buy 45 NFTs at once. And most likely the ones who will do this are those who support Trump in the U.SI remembered that in 2019 Trump had a tweet about Cryptocurrency, at this time he did not believe in crypto. I can't even see it on his Twitter now but I have a picture.But now 2022 is what Donald Trump is sayingWell, it's a good development of acceptance, even though he didn't say literally that He supported NFT which is a part of a growing crypto ecosystem. Because it still has a good past for NFT enthusiasts who used to be critics but now promoting Their own NFTs.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}