{
  "id": "topic_5455192",
  "title": "Games.Bitcoin",
  "author": "Games.Bitcoin",
  "created_time": "June 05, 2023, 04:31:20 PM",
  "content": "We all know that it is impossible to predict the future of the crypto market. However, according to the current world economy, the market is still in a good position. Still, who knows if there is even any news or when this market will turn around again. According to the economy going down a bit too slowly can new investments be made at the moment.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5455192",
  "comments": [
    {
      "author": "Z-tight",
      "created_time": "June 05, 2023, 04:38:15 PM",
      "body": "Buying low and selling high is what every investor wants to achieve, you cannot predict the market but it is clear that the price is kind of low now, so buying now is not a bad option. But don't invest what you cannot afford to lose, instead invest wisely with the dca method, but before doing anything, do your own research.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cabron",
      "created_time": "June 05, 2023, 04:42:27 PM",
      "body": "Wait til the weekly chart shows RSI to be oversold which could happen in 25k. Before this week ends, the price may jump back to 27k again and then dumps again to 26k. Often times the last resistance which I believe was 25k will be the support level in this decline. In the fundamental side of things, I have no idea. News and fud probably causes this selling again.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "seoincorporation",
      "created_time": "June 05, 2023, 05:02:40 PM",
      "body": "Quote from: Games.Bitcoin on June 05, 2023, 04:31:20 PMWe all know that it is impossible to predict the future of the crypto market. However, according to the current world economy, the market is still in a good position. Still, who knows if there is even any news or when this market will turn around again. According to the economy going down a bit too slowly can new investments be made at the moment.You should read the news in coindesk, The markets are going down right now, it drops below the $26k line while the current price is $25,753. and the question is, will it drop more? and the answer is \"Yes\", and that's because one of the biggest exchanges gets sued by the SEC. SEC Sues Crypto Exchange Binance, CEO Changpeng Zhao Over Multiple Securities Violation Allegationshttps://www.coindesk.com/policy/2023/06/05/sec-sues-crypto-exchange-binance-ceo-changpeng-zhao/Binance Endures $69M in Net Outflows Within an Hour, Amid SEC Charge: Nansenhttps://www.coindesk.com/markets/2023/06/05/binance-endures-69m-in-net-outflows-within-an-hour-amid-sec-charge-nansen/And more people will withdraw their money from Binance, and that's why the BTC price will keep going down.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nwada001",
      "created_time": "June 05, 2023, 05:39:38 PM",
      "body": "Quote from: Games.Bitcoin on June 05, 2023, 04:31:20 PMWe all know that it is impossible to predict the future of the crypto market. However, according to the current world economy, the market is still in a good position. Still, who knows if there is even any news or when this market will turn around again. According to the economy going down a bit too slowly can new investments be made at the moment.Nothing is totally impossible in this life; it's hard to predict a perfect Bitcoin market, but there are people who can give a price prediction of what the market will look like in the coming days, but not an exact market figure.You shouldn't be looking at economist predictions regarding market change before you can make your investment decision; always look at what's best for you, which price you have in mind as your buying target, and do your own personal research since you already believe that Bitcoin's future price can't be predicted. Maybe you know what the best feature or track is that you need to see before you can make your own investment decision.For me, I will say every time is the best buying time for me, which all depends on my financial status as of that time, because I rate my investment time based on what I currently have to spare for investment and not on the current market price or what someone has predicted the market to be. I don't want to fall victim to being disappointed when the market doesn't turn out to be the way it's predicted to be.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "eightdots",
      "created_time": "June 05, 2023, 05:41:55 PM",
      "body": "Quote from: Games.Bitcoin on June 05, 2023, 04:31:20 PMWe all know that it is impossible to predict the future of the crypto market. However, according to the current world economy, the market is still in a good position. Still, who knows if there is even any news or when this market will turn around again. According to the economy going down a bit too slowly can new investments be made at the moment.Predictions can be made about the market, but there is no certainty. Because no one can be 100% sure of what they say. The things we need to pay attention to are what happened in the market before and how the markets reacted. Other than that, the estimates sometimes hold and sometimes do not. I don't think it makes sense to invest based on those estimates.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ucy",
      "created_time": "June 06, 2023, 04:13:06 PM",
      "body": "Quote from: Games.Bitcoin on June 05, 2023, 04:31:20 PMWe all know that it is impossible to predict the future of the crypto market. However, according to the current world economy, the market is still in a good position. Still, who knows if there is even any news or when this market will turn around again. According to the economy going down a bit too slowly can new investments be made at the moment.It's impossible for a human to predict the market by himself but possible with the CREATOR. So, you can actually predict the market if you rely on the ONE who knows the future market very precisely. The current situation of the market is as a result of different factors, one of which is to make sure that no human takes the credit when it hits 30,000 soon and remains at that level until it records new high which is +32,000. It was actually predicted late last year that price will hit 30,000 and it actually did. It would have stopped at 30,000 if others weren't trying to pretend they made the prediction too, then the credit that belongs to another would go to them. So the goal post was shifted to ensure that credit is given to whom it's due when it hits +30,000",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "_BlackStar",
      "created_time": "June 06, 2023, 04:13:39 PM",
      "body": "The market still looks normal as long as traders are still trading their assets. Volatility should be considered as something that cannot be separated from crypto assets and prices can move in all directions. Markets can move up and down depending on how market fundamentals affect supply and demand. No one can say for sure what will happen in the future - so you need to be wise enough to manage your investments and plan accordingly.OP - don't make other people's predictions your financial advice because basically those predictions can never guarantee you a return. Even if you believe, then you must be wise enough to manage your own risk.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jeraldskie11",
      "created_time": "June 06, 2023, 05:10:40 PM",
      "body": "I believe that no one can foresee market price movements because if they can, they can quickly get wealthy. What we really do in the market is wait for confirmation when the price reaches the zone we've been watching for a couple of hours or days if there's a sign of reversal in the lower time frame. If you start trading without first analyzing the market technically and fundamentally, you risk losing all of your money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mate2237",
      "created_time": "June 06, 2023, 05:25:22 PM",
      "body": "Quote from: Games.Bitcoin on June 05, 2023, 04:31:20 PMWe all know that it is impossible to predict the future of the crypto market. However, according to the current world economy, the market is still in a good position. Still, who knows if there is even any news or when this market will turn around again. According to the economy going down a bit too slowly can new investments be made at the moment.This should.ove to Speculation Section but before then, some people are making a guess and their predictions are going inline with the prices at all period. If they say that from next month bitcoin price will go up in some percentage and it happened on that way so to  some extent people use the market tools to predict the market and it working for them. When the price of bitcoin goes down investorscan be invested massively to their satisfaction. Just like the way I did to on p2p purchase of bitcoin. Personally I was out of cash to buy bitcoin this days but when I look at the market, bitcoin is about $25k so I bought it from the person because I know that the price is down and it will still go down. BTC price is unpredictable but we can make a guess work.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zanab247",
      "created_time": "June 06, 2023, 05:48:54 PM",
      "body": "No, you can't predict crypto future but you can set your goals in a way it will come through when you maintain the holding till the bear is over from the market. What is happening in the crypto market is a sign that the bull is very near for those that prepared well, to have something good to earn and those that didn't prepared well will surely regret which are some of the things people must experience when the time finally come. Hope you will be among the people that will earn well when the bull appear, then stop panicking about the crypto market because the green light is preparing to remain stable through out this season.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BVeyron",
      "created_time": "June 06, 2023, 06:01:27 PMLast edit: June 06, 2023, 06:11:32 PM by BVeyron",
      "body": "Quote from: Games.Bitcoin on June 05, 2023, 04:31:20 PMWe all know that it is impossible to predict the future of the crypto market. However, according to the current world economy, the market is still in a good position. Still, who knows if there is even any news or when this market will turn around again. According to the economy going down a bit too slowly can new investments be made at the moment.Unfortunately, it's impossible to predict the future of any market... For example, now there is a high risk of fiat inflation, so even in non-crypto market nobody knows what's gonna happen. I think that crypto projects are rapidly developing, but not all the project will be successful. Its impossible to find out which project is going to win the house. Also, considering fluctuations in BTC/USD price, we usually assume that USD is stable, but in case of fiat inflation not BTC but USD has the risk to become unstable, then this ratio (as well as any other crypto-to-fiat ratio) is going to mean nothing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BD Crypto",
      "created_time": "June 06, 2023, 06:04:08 PM",
      "body": "It's totally unpredictable about the future of market and we all know that. But for the best investment in market you should not invest all at a time. You should invest part by part which means DCA( Dollar Cost Average). That will increase the probability of a successful investment. If market goes more down you should enter at lower price. Anyway best wishes for you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "umbara ardian",
      "created_time": "June 06, 2023, 06:32:02 PM",
      "body": "Market predictions are inherently uncertain, and no one can accurately predict future market movements with 100% certainty. While historical patterns and market reactions can provide some insights, they do not guarantee future performance. Therefore, we need many factors to consider, such as market research or investment purposes in the market. But relying solely on predictions or estimates can be risky anyway. So keep your money secure before making an investment decision at this time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tabas",
      "created_time": "June 07, 2023, 01:31:04 AM",
      "body": "Everyone is free to predict what possibly can happen to the market but its main thing is about how precise or close to the actual happening they will be. It won't be 100% right but at least with those close calls, there are people that can guess them precisely. You'll see left and right those predictions and you'll be unsure to say if they're right or wrong and that's why you don't make someone's prediction as the basis of your investing decision. It's much better to have your own assumption and analysis to the market rather than be dependent on them because no matter how good, interesting and intriguing their predictions are, the market will always be unpredictable.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "adaseb",
      "created_time": "June 07, 2023, 03:28:51 AM",
      "body": "We rallied into the $30K area due to the bank failures in march. And in the past 24 hours we broke down to the $25.5k area because of the ongoing regulations against crypto.Ever since Ftx, many regulators have taken a very tough stance on crypto and are setting regulations. Latest was with binance and coin base listing security tokens. This is strange because they let coinbase get listed on the NYSE and knew it dealt with securities such as SOL or ADA. There is no clarity basically and this is why it’s scary.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mich",
      "created_time": "June 07, 2023, 05:36:12 AM",
      "body": "Well as you have said it is very hard for us to predict the Bitcoin market. I will say that yesterday it was a nervous time with the SEC deciding to make a example and it is now suing Coinbase after Binance exchange.But now I have more confidence it will be just a small distraction. Coinbase CEO Brian Armstrong is not worried and says they will get the job done with the SEC. If this man is not worried then I am not going to worry about it.https://cryptopotato.com/coinbase-ceo-welcomes-sec-legal-battle-well-get-the-job-done/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "waONE",
      "created_time": "June 07, 2023, 07:22:43 AM",
      "body": "Quote from: Games.Bitcoin on June 05, 2023, 04:31:20 PMWe all know that it is impossible to predict the future of the crypto market. However, according to the current world economy, the market is still in a good position. Still, who knows if there is even any news or when this market will turn around again. According to the economy going down a bit too slowly can new investments be made at the moment.The crypto market is doing very well now, after a few days ago the Bitcoin price was dumped due to the SEC bad news and now it is recovering quickly, I think Bitcoin is not that easy to be bearish anymore, and hopefully this is a sign that the crypto market has entered a bullish season.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Silberman",
      "created_time": "June 07, 2023, 08:37:05 AM",
      "body": "Quote from: mich on June 07, 2023, 05:36:12 AMWell as you have said it is very hard for us to predict the Bitcoin market. I will say that yesterday it was a nervous time with the SEC deciding to make a example and it is now suing Coinbase after Binance exchange.But now I have more confidence it will be just a small distraction. Coinbase CEO Brian Armstrong is not worried and says they will get the job done with the SEC. If this man is not worried then I am not going to worry about it.https://cryptopotato.com/coinbase-ceo-welcomes-sec-legal-battle-well-get-the-job-done/The price has recovered already after we went through that flash crash which made the price of bitcoin drop in just a matter of hours, however we need to remain vigilant, we  never know when another negative news may come up and then FUD could take over the market, still things are not as bad as they may seem as I am sure there were a lot of forum members which took advantage of the massive window of opportunity that opened and loaded their wallets with all the bitcoin they could during that time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MarjorieZimmermanGinger",
      "created_time": "June 07, 2023, 11:34:28 AM",
      "body": "Quote from: Games.Bitcoin on June 05, 2023, 04:31:20 PMWe all know that it is impossible to predict the future of the crypto market. However, according to the current world economy, the market is still in a good position. Still, who knows if there is even any news or when this market will turn around again. According to the economy going down a bit too slowly can new investments be made at the moment.There is always no certainty regarding predictions because price volatility tends to rise and fall under certain conditions, so this prediction area may only be seen from several aspects, both cycles and other conditions that have an indirect relationship. The market has been showing a decline for a few days and although for today it has shown a slight recovery, it still seems to me good enough to see an opportunity to enter the market because the pumping potential is not that great in this recovery so anyone can make up their mind for now.But it also depends on how prepared people are to take the appropriate amount and most importantly the policy in managing investments must be based on how strong their understanding and ability to assume the risk of loss is and even if they are still unsure about buying then DCA is one that can be chosen to make a purchase.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}