{
  "id": "topic_5433617",
  "title": "Spaceman1000$",
  "author": "Spaceman1000$",
  "created_time": "January 09, 2023, 01:47:34 PMLast edit: January 09, 2023, 02:36:42 PM by Spaceman1000$",
  "content": "Democracy was first introduced by the Americans, as government of the people by the people and for the people. A situation where by, whoever the majority decide's to vote, that person will be declared winner, either for election, selection or any kind contest, because there is a saying that, the voice of the people is the voice of God( Vox populi, vox Dei). This method of selection of leadership was adopted by several countries across the globe including Brazil, (theirs is representative Democracy). But Recent occasions has shown that, the modern day democracy is about undermining the will of the majority votes, a situation where the apparatus of state is unleashed to make sure the majority doesn't have their way. Today Brazil is in serious turmoil because of the actions of their electoral umpire, Which majority of Brazilian citizens believe rigged the election and announced what they claimed is not their choice. Currently there is an ongoing protest rocking the cities of Brazil, government house's have been occupied by protesters, Roads are blocked and several civil unrest currently going on now in Brazil.Brazil is not the only country to experience this kind of situation, there are lots of countries going through this.And I ask, is Democracy a tool used to undermine the people's will?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5433617",
  "comments": [
    {
      "author": "BADecker",
      "created_time": "January 09, 2023, 05:19:07 PM",
      "body": "True Democracy is a bad thing for the people. Here's why...In a Democracy, 51% win over the 49% in their voting. This makes slaves of the 49%... slaves to the desires of the 51%.In a large country, 51% of the people can't all govern the country directly. So, a handful of people are elected by the 51% to do the governing for them.Then the handful of governing people do whatever they want, and the country becomes a dictatorship by a small group.----------The above is why the people who set up the American government made two parts to it. The formal government is a Democracy, but any part of it can be nullified by the 12-person jury in any individual case. If enough various juries nullify a part or law, it will ultimately be repealed for everyone.Doing it this way makes the government a true government of all the people, while at the same time having the benefits of a formal government to keep order.The problem with the US is that the people don't understand this very much. So, they don't use what they don't understand... except a little.Btw, the American Democracy is inside of and a part of the American Republic, simply because of the above.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mate2237",
      "created_time": "January 09, 2023, 07:19:15 PM",
      "body": "Quote from: Spaceman1000$ on January 09, 2023, 01:47:34 PMDemocracy was first introduced by the Americans, as government of the people by the people and for the people. A situation where by, whoever the majority decide's to vote, that person will be declared winner, either for election, selection or any kind contest, because there is a saying that, the voice of the people is the voice of God( Vox populi, vox Dei). This method of selection of leadership was adopted by several countries across the globe including Brazil, (theirs is representative Democracy). But Recent occasions has shown that, the modern day democracy is about undermining the will of the majority votes, a situation where the apparatus of state is unleashed to make sure the majority doesn't have their way. Today Brazil is in serious turmoil because of the actions of their electoral umpire, Which majority of Brazilian citizens believe rigged the election and announced what they claimed is not their choice. Currently there is an ongoing protest rocking the cities of Brazil, government house's have been occupied by protesters, Roads are blocked and several civil unrest currently going on now in Brazil.Brazil is not the only country to experience this kind of situation, there are lots of countries going through this.And I ask, is Democracy a tool used to undermine the people's will?That is misconception of the origin of democracy, democracy was not first practice in America but democracy was first practice in the Greek City State where Socrate was also a citizen. American saw the Greek practice of democracy and adopted it in their States and formed the United States of America. And America follow the following Democratic System. True Democracy, liberal Democracy and real scholars of political science hate democracy because democracy is to sidelines the poor citizens to contest an election.What is happening in Brazil happens in the whole whole.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Spaceman1000$",
      "created_time": "January 09, 2023, 08:15:46 PM",
      "body": "The majority of the countries embraced the American style of democratic society, hence it does not matter who originally founded democracy. Let's get to the heart of the matter. Democracy, as it is meant to be, was created to bring the will of the people into reality. However, we are currently witnessing a situation in which the entire system has been underutilized in order to appease a pitiful few who are hell-bent on preventing the dividends of democracy from being delivered in opposition to the majority will.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}