{
  "id": "topic_5447204",
  "title": "bbigtart",
  "author": "bbigtart",
  "created_time": "April 02, 2023, 12:00:24 AM",
  "content": "I want to talk about the US government selling 51,000 Bitcoins, why are they doing this. Is Bitcoin going to be trashed let's talk about all this stuff and more this came out yesterday and a lot of people were talking about it what happened to these 51,000 Bitcoins.Everything is connected to the Silk Road so when the silk road closed According to reports the government has sold roughly 10,000 Bitcoins for 250 million and this was on March 14th 2023. So it looks like we had a little Spike and then dropped back down so we're up to 26,000 back to 24- 2 and then boom the market reacted by going up so did the sale of 10,000 Bitcoin really affect Bitcoin the answer is no.Heard that the government doesn't sell everything at the same time now, if they decide to sell 51,000 at once maybe Bitcoin will be affected more but they plan to sell gradually. so later in the year they'll probably finish another ten thousand another ten thousand another ten thousand something like that so right now they have 41,000 Bitcoins left.so it's a bit surprising that they did this i thought maybe they wanted to throw it all away to cause more problems around Bitcoin but they decided that they would spread it out roughly so they have 51,000 Bitcoins to start with now. they have 41,000 Bitcoins left so that's the reason why they're selling this basically they've been saving this for a while and they felt this was the right time to sell it. should we be afraid that this incident will affect the price of bitcoin?Source:https://cointelegraph.com/news/us-government-plans-to-sell-41k-bitcoin-connected-to-silk-road",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5447204",
  "comments": [
    {
      "author": "OgNasty",
      "created_time": "April 02, 2023, 01:04:20 AM",
      "body": "I read it comes out to something like $4,000,000 worth of Bitcoin being sold by the United States government per day. Pretty crazy number. This reminds me a lot of when Tim Draper bought a ton of BTC in a similar auction around 10 years ago. I think that taught me that big auctions like this usually open the door for new buyers so it might end up being a positive long term.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Tytanowy Janusz",
      "created_time": "April 02, 2023, 06:40:47 AM",
      "body": "Quote from: bbigtart on April 02, 2023, 12:00:24 AMI want to talk about the US government selling 51,000 Bitcoins, why are they doing this. Is Bitcoin going to be trashed let's talk about all this stuff and more this came out yesterday and a lot of people were talking about it what happened to these 51,000 Bitcoins.They hodled for 10 years. It's longer than most of the \"bitcoiners\" hold. Don't you think that taking down 25% of a position after doing 200x is a wise take profit strategy?Quote from: bbigtart on April 02, 2023, 12:00:24 AMso it's a bit surprising that they did this i thought maybe they wanted to throw it all away to cause more problems around Bitcoin What problems would that cause? Would the bitcoin blockchain crash? No! Bitcoin would continue to work properly. We would only see a flash crash that would be eaten by marketmakers and those waiting for a dip to buy (bitcoin broke the 200 WMA and many investors just wait for a dip). The only thing they would achieve by selling like this is to sell $1.4 billion worth of bitcoins for $1 billion.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "April 02, 2023, 06:59:41 AM",
      "body": "Quote from: Tytanowy Janusz on April 02, 2023, 06:40:47 AMThey hodled for 10 years. It's longer than most of the \"bitcoiners\" hold. Don't you think that taking down 25% of a position after doing 200x is a wise take profit strategy?Two years, those are the coins seized back in 2021https://www.justice.gov/usao-sdny/pr/us-attorney-announces-historic-336-billion-cryptocurrency-seizure-and-convictionAnd quite funny, they are selling at a loss, bitcoin was at around $60k by that time.Quote from: bbigtart on April 02, 2023, 12:00:24 AMI want to talk about the US government selling 51,000 Bitcoins, why are they doing this. Is Bitcoin going to be trashed let's talk about all this stuff and more this came out yesterday and a lot of people were talking about it what happened to these 51,000 Bitcoins.Because that's how the law works, seized property goes to auctions, and it has happened before it will happen again, the USMS has had hundred of those auctions, you can just search the news how many times those have happened.So, drop the tinfoil hat, nothing new and nothing to see.Besides, it's an auction why would the price on the spot market be affected unless somebody plans on immediately dropping those coins, and why would they do that only to lose money in a split second?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "April 02, 2023, 08:08:51 AM",
      "body": "Law is law but the US govt make this sounds like they dont care about the bitcoin, but when you think about it. The one they seize, whose the one uses the money right? They even criticize people with their crypto asset knowing they are just needing something to comfiscate and used on their own agenda. Even they dumped their coins which through an auction, market wouldnt be affectef much considering that this isnt a spot sell market on exchanges. See how hypocrite the govt for hating bitcoin that much hence they are benefiting from it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "adaseb",
      "created_time": "April 02, 2023, 03:02:13 PM",
      "body": "Are these the actual Silk Road coins from DRP or are they from that Silk Road Hacker who has an account on here by the name of \"Loaded\". He basically did some exploit back in the day where he sent like 1000 Bitcoins to his deposit address at Silk Road and then immediately did 5 withdraws of 1000 Bitcoins at once and basically sent 1000 BTC and got 5000 Back, so made a profit off 4000 BTC.I am pretty sure its these coins which they are selling. The caught the guy recently, about a year or two I believe. There is an article somewhere on twitter about how it happened. Those original DPR coins I think were auctioned off and Tim Draper bought them OTC, years ago.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "April 02, 2023, 03:15:42 PM",
      "body": "Quote from: bbigtart on April 02, 2023, 12:00:24 AMI want to talk about the US government selling 51,000 Bitcoins, why are they doing this. Is Bitcoin going to be trashed let's talk about all this stuff and more this came out yesterday and a lot of people were talking about it what happened to these 51,000 Bitcoins.~snip~When you read articles from a shitty source, then your conclusions are just as shitty (excuse the expression). As @stompix already wrote, it is not about selling 50K BTC, but only a part of what has seized two years ago. And the fact that they (the US government) sell BTC means that they informally recognize it as something that has value, and you could only worry if they destroyed all the seized BTC and thus showed the middle finger to everyone else.What you see as a problem is actually a good thing, because the US government promotes Bitcoin by doing so and also puts it back into circulation - and in return it gets what it loves most, its dollars.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rikafip",
      "created_time": "April 02, 2023, 03:29:10 PMLast edit: April 02, 2023, 04:15:43 PM by Rikafip",
      "body": "Quote from: bbigtart on April 02, 2023, 12:00:24 AMIs Bitcoin going to be trashed let's talk about all this stuff and more this came out yesterday and a lot of people were talking about it what happened to these 51,000 Bitcoins.Buddy don't worry, good guy Justin Sun decided to take one for the team and save the day by buying those government's bitcoins.   https://twitter.com/justinsuntron/status/1641862563662282753?cxt=HHwWgoDS0a_TiMktAAAAQuote from: stompix on April 02, 2023, 06:59:41 AMAnd quite funny, they are selling at a loss, bitcoin was at around $60k by that time.To be honest its kinda expected from goverment to suck at managing the money, I am just surprised that they didn't get rid of it at ~16k.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pmalek",
      "created_time": "April 02, 2023, 03:46:11 PM",
      "body": "Quote from: bbigtart on April 02, 2023, 12:00:24 AMI want to talk about the US government selling 51,000 Bitcoins, why are they doing this. There should be a question mark at the end of that sentence. I don't understand your concerns. Governments all over the world auction off seized property and assets all the time. Houses, apartments, cars, equipment, machinery, and in this case bitcoin. Why would you assume bitcoin would be treated differently? There will be an auction, people will bid on what they are interested in, and the highest bidders win. The government agencies care about the bitcoins they have seizes as they care about any other items in their depots. They don't. They want to sell it all at the best possible price and fill their coffers.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "April 02, 2023, 07:17:32 PM",
      "body": "Quote from: cryptoaddictchie on April 02, 2023, 08:08:51 AMLaw is law but the US govt make this sounds like they dont care about the bitcoin, but when you think about it. The one they seize, whose the one uses the money right? No, the US doesn't make it sound like it anyhow, it's users like OP that want to make a whole drama out of it and make it look like something completely different.If you were going by the idea that they reselling it because they hate it then they hate real estate, they hate cars, they hate art and they hate almost everything as billions are auctioned every year, it's just that bitcoiners get so easily triggered at any perspective of a price dump and start the witch hunt.Quote from: Lucius on April 02, 2023, 03:15:42 PMAnd the fact that they (the US government) sell BTC means that they informally recognize it as something that has value, and you could only worry if they destroyed all the seized BTC and thus showed the middle finger to everyone else.Probably 99% of the hodlers would have loved to see them destroyed rather than auctioned, recognition and laws and regulations are only appreciated when they cause a pump, not when it might have an adversary effect.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "April 03, 2023, 03:15:31 AM",
      "body": "Quote from: stompix on April 02, 2023, 07:17:32 PMit's just that bitcoiners get so easily triggered at any perspective of a price dump and start the witch hunt.Cause thats what the media informed the people, but how many percent of the news is the truth they were spreading. It make sense that a lot got trigger by their action, since they are pro crypto. Im sure even you doesnt like the idea how they intervene on decentralized aspect of the blockchain industry but thats something government cant tolerate as long as there are money involves and taxes.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "April 03, 2023, 09:44:48 AM",
      "body": "Quote from: stompix on April 02, 2023, 07:17:32 PMProbably 99% of the hodlers would have loved to see them destroyed rather than auctioned, recognition and laws and regulations are only appreciated when they cause a pump, not when it might have an adversary effect.Those who are only there for profit would not mind if as much BTC was \"destroyed\" as possible so that their coins would be worth more, but that is the reality we live in. However, I do not see why such sales would have any effect on the price considering that we are in the recovery phase and that the market will absorb these coins very easily.The world is full of confused people, OP is just one of them who thinks that a few thousand BTC can change something important in a market where hundreds of thousands of BTC are traded every day.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fzkto",
      "created_time": "April 03, 2023, 02:18:00 PM",
      "body": "I don't think such sales have any effect on the bitcoin price, because the government does not sell coins on the Binance or Coinbase exchanges, which could indeed negatively affect the price. But beyond the exchanges, there are OTC bitcoin trades that many people don't know about and won't know about. I think thousands of bitcoins are regularly bought and sold off-exchanges and that doesn't affect the price in any way.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "royalfestus",
      "created_time": "April 03, 2023, 02:45:29 PM",
      "body": "The US government has recently sold 9,800 Bitcoins and plans to sell the remaining from 41,500 Bitcoins that were seized from Silk Road. Despite some media outlets misrepresenting the situation as intentional dumping, it's important to note that these are confiscated coins being gradually sold to manage the market price. The US government is actively liquidating Silk Road's Bitcoins and will continue to do so throughout the year.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Franctoshi",
      "created_time": "April 03, 2023, 02:54:53 PM",
      "body": "The US government coming to selling this amount of Bitcoin will even help put more Bitcoin into the hands of ordinary people and help it become less in the hands of the Government. It could only have short term negative impact on the market, but not in the long run, market will always end up absorbing this selling pressure because there are always buyers readily available to buy Bitcoin while the other person is dumping it's bags of Bitcoin in the market. Generally, I don't see the impact having more weight than that of China dump.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dragonvslinux",
      "created_time": "April 03, 2023, 03:29:30 PM",
      "body": "Quote from: OgNasty on April 02, 2023, 01:04:20 AMI read it comes out to something like $4,000,000 worth of Bitcoin being sold by the United States government per day. Pretty crazy number. This reminds me a lot of when Tim Draper bought a ton of BTC in a similar auction around 10 years ago. I think that taught me that big auctions like this usually open the door for new buyers so it might end up being a positive long term.  Not only new buyers, but also institutional buyers via OTC (as long as there are willing buyers). Notably Tim Draper bought the previous batch at a reasonable price in previous 2014 bear market. Overall I don't think it'll effect spot price that much, it will be dependant on whether there is more supply in OTC markets than demand right now. It may well tip the balance towards more supply in the short-term though.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "KingsDen",
      "created_time": "April 03, 2023, 03:46:41 PM",
      "body": "Quote from: bbigtart on April 02, 2023, 12:00:24 AMHeard that the government doesn't sell everything at the same time now, if they decide to sell 51,000 at once maybe Bitcoin will be affected more but they plan to sell gradually. so later in the year they'll probably finish another ten thousand another ten thousand another ten thousand something like that so right now they have 41,000 Bitcoins left.so it's a bit surprising that they did this i thought maybe they wanted to throw it all away to cause more problems around Bitcoin but they decided that they would spread it out roughly so they have 51,000 Bitcoins to start with now. they have 41,000 Bitcoins left so that's the reason why they're selling this basically they've been saving this for a while and they felt this was the right time to sell it. should we be afraid that this incident will affect the price of bitcoin?Source:https://cointelegraph.com/news/us-government-plans-to-sell-41k-bitcoin-connected-to-silk-roadActually, I will be more troubled and concerned if US government keep buying bitcoin everyday in large quantity. Then I will say it is a sign that they want to buy majority of Bitcoin and hold it to disallow it from circulating in the society. But if they are selling their bitcoin, I think it's not something we are supposed to be scared of. They are selling and stronger hands are buying and holding and it is better that bitcoin be in the hands of ordinary individuals than be in the hand of a highly centralised and powerful government.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SirLancelot",
      "created_time": "April 04, 2023, 05:48:34 AM",
      "body": "Quote from: Lucius on April 03, 2023, 09:44:48 AMQuote from: stompix on April 02, 2023, 07:17:32 PMProbably 99% of the hodlers would have loved to see them destroyed rather than auctioned, recognition and laws and regulations are only appreciated when they cause a pump, not when it might have an adversary effect.Those who are only there for profit would not mind if as much BTC was \"destroyed\" as possible so that their coins would be worth more, but that is the reality we live in. However, I do not see why such sales would have any effect on the price considering that we are in the recovery phase and that the market will absorb these coins very easily.The world is full of confused people, OP is just one of them who thinks that a few thousand BTC can change something important in a market where hundreds of thousands of BTC are traded every day.You are right that people or even organizations wouldn't really care about the price if they are getting profits themselves by dumping the coins/tokens they are holding, but I think it's a different case here, because the authorities that confiscated those funds have basically planned this a few years ago and now was the right time to sell the Bitcoin as per their plan.Generally, it wouldn't have any significant impact on Bitcoin's price, but if it does and Bitcoin's price drops, that will only open the door for more investors to hop in on the journey.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BenCodie",
      "created_time": "April 04, 2023, 05:54:34 AM",
      "body": "Quote from: OgNasty on April 02, 2023, 01:04:20 AMI read it comes out to something like $4,000,000 worth of Bitcoin being sold by the United States government per day. Pretty crazy number. This reminds me a lot of when Tim Draper bought a ton of BTC in a similar auction around 10 years ago. I think that taught me that big auctions like this usually open the door for new buyers so it might end up being a positive long term.  It's definitely positive in the long term.The U.S use seized coins to make more cash available to them in the short term while hurting Bitcoin when it has the potential to grow significantly during a time of demise for the US Dollar. The sale of these 41,000 Bitcoins and the timing of which they are being sold is a strategic move to keep Bitcoin down for an extended period of time. At the end of the day, the US and its US Dollar is at war with Bitcoin! In terms of the long term and how it's positive....distribution! Less power for the US and distribution to more holders only expands the free market. It also removes a holder who entered the market at a very low price point and turns that into a new range of holders who are entering at the 20-30k mark. EXTREMELY good for Bitcoin economics. All of a sudden you have a single holder of 51,000 Bitcoins who entered the market for free at a price point of $10-$200, changed to many individual holders who entered the market at 20-30k!I knew something was coming to hinder the growth beyond 30-40k...This news is it. After the US is done selling these seized coins and have exhausted any other means of hindering price, the bull run begins. I can't wait for 2024",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sebas.tian",
      "created_time": "April 04, 2023, 06:17:03 AM",
      "body": "I think, the decision Us government made will not effect the price of Bitcoin than to encourage other governments to learn how to hold long to be able to achieve something big in the future. If US government can hold Bitcoin more than 9 years, showed that they have enough money to achieve in this period and wait for the price to decrease again before they can buy and hold for another opportunity to come. I don't think, US government will sell everything in this month of April, because the price of Bitcoin will definitely reach $60,000 before the end of this year 2023 so that they will not regret for the decision to sell the remaining Bitcoin this month.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}