{
  "id": "topic_5467950",
  "title": "ColdLava40",
  "author": "ColdLava40",
  "created_time": "September 24, 2023, 07:27:40 PM",
  "content": "I assume when you see this topic, the first thing that must have come across your mind is to figure certain errors in my post, but make we try dey rest for once so that we go fit reason sum kind matas as naija people. Bitcoin for everyone no mean say I get anyone to give you, na how we fit help out fellow citizens b de reason for this post.The economy done bad, which everyone of us are quite aware. Millions of Nigeria youths they out there they strive and still nothing to show for it. Online financial platforms don dey available for piple to dey make money. This platforms done turn some youth to self independent people. Another interesting way of having something to live for is the accumulation of Bitcoin and other crypto currency. We can all attest that this has also helped several youths among us.But the sad thing is that, there are certain people who choose to hold financial information to themselves instead of sharing it with the people around them. This issue has become the common habits of Nigerians which has increase greediness among us.Watin e go cost me if I tell you where I dey get my money ?, As long as I no put hand for bad thing, then I suppose fit give reasons to anybody why I dey buy some cryptocurrency.Money na watin we no go fit chop finish, na just information, pass it to who so ever is interested. It's better to share a financial information than to help someone financially. And note, it's not by force, so don't force anything on anyone, but only those who are interested.Abeg make I hear from una too and happy Sunday...",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5467950",
  "comments": [
    {
      "author": "Odohu",
      "created_time": "September 24, 2023, 07:39:03 PM",
      "body": "You don already know say Bitcoin na the koko... I no know wetin you dey find again. Abi you dey find insider information of coin wey go pump like PEPE? Base on say Naija no dey carry last, plenty smart guys don already dey buy Bitcoin to prepare for the next bull run. If you wan joy, begin dey buy Bitcoin small small because next bull run go dey massive... no go borrow money o!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Perfectbaby",
      "created_time": "September 24, 2023, 07:41:44 PM",
      "body": "Make e no be say I dey too hash to you on based on say you create post. E get some things we no need to put eyes why because as you dey like this you no go just out there blow your yansh say come learn this thing or carry town cryer to knack for your village say make una come see were i dey money or make una come learn how to make money.. omo with dey country be na those people wey you go call go first kill you then them go come seat for your sit begin dey benefits were you supposed dey benefits.That is why Bible talk am say \"wisdom is profitable to direct\" and you no go allow ignorant to take over you. Make I no lie, before you come here na person wey dey close to you or your brother go carry you come here onto say you don dey show interest for long time and him come decide finally to show you roads why him no go announce for your community so that everybody go come here?Wetin just dey be say you need be very careful with people you tell yours of leaving or and earnings besides before you go introduce person you need a result first and people believe in results and not efforts. Be warned!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Asiska02",
      "created_time": "September 24, 2023, 07:57:54 PM",
      "body": "Quote from: ColdLava40 on September 24, 2023, 07:27:40 PMWatin e go cost me if I tell you where I dey get my money ?, As long as I no put hand for bad thing, then I suppose fit give reasons to anybody why I dey buy some cryptocurrency.For you to wan keep your source of income to yourself and not to odas na wetin you decide and agree to your mind to do. If anoda person chose to hide and keep their own to dem self, no reason as say na bad tin d person dey do. So many hidden tins fit dey wey make am so am so wey go fit affect am if him talk am out. Helping is a choice and not mandatory, dey depend on how your mindset is built and you take dey perceive and react to tins for life.QuoteMoney na watin we no go fit chop finish, na just information, pass it to who so ever is interested. It's better to share a financial information than to help someone financially. And note, it's not by force, so don't force anything on anyone, but only those who are interested.Abeg make I hear from una too and happy Sunday...E go better for you make you help some people financially instead of showing dem how to make dat money, but wetin make sense pass na to reach dem how to make money make dem no become liability to you. You fit wan help dem and na your own dem go come later spoil. When you dey help person financially, compare, think and contrast of d after effect of it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Majestic-milf",
      "created_time": "September 24, 2023, 11:47:36 PM",
      "body": "Quote from: ColdLava40 on September 24, 2023, 07:27:40 PMWatin e go cost me if I tell you where I dey get my money ?, As long as I no put hand for bad thing, then I suppose fit give reasons to anybody why I dey buy some cryptocurrency. Nothing, my brother. But then, nah your choice be that. Before you go reason your man update, you go don study the kind person he be so you no go loose guard info wey no sopoz reach am. Some pipo no go believe say you go spend your data and your battery dey make moni on a weekly ( that's if you dey campaign); them go feel say you dey whine, and when Dem discover say e legit, no be all go get patience to run am. Some go come gum you so you go dey bread Dem, or odas for cast the thing make am public. QuoteMoney na watin we no go fit chop finish, na just information, pass it to who so ever is interested. It's better to share a financial information than to help someone financially. And note, it's not by force, so don't force anything on anyone, but only those who are interested. While I won't want to be greedy, there are some things that are not meant for everyone. Not everyone has the patience to trade in Bitcoin or even enter the forum and patiently grow in ranks so they can start earning. Even if you want to elevate the next person from hardship, some just have this dependency mentality and just as you rightly pointed, you don't force anything on anyone.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Spaceman1000$",
      "created_time": "September 25, 2023, 08:47:06 PM",
      "body": "Quote from: ColdLava40 on September 24, 2023, 07:27:40 PMI assume when you see this topic, the first thing that must have come across your mind is to figure certain errors in my post, but make we try dey rest for once so that we go fit reason sum kind matas as naija people. Bitcoin for everyone no mean say I get anyone to give you, na how we fit help out fellow citizens b de reason for this post.The economy done bad, which everyone of us are quite aware. Millions of Nigeria youths they out there they strive and still nothing to show for it. Online financial platforms don dey available for piple to dey make money. This platforms done turn some youth to self independent people. Another interesting way of having something to live for is the accumulation of Bitcoin and other crypto currency. We can all attest that this has also helped several youths among us.But the sad thing is that, there are certain people who choose to hold financial information to themselves instead of sharing it with the people around them. This issue has become the common habits of Nigerians which has increase greediness among us.Watin e go cost me if I tell you where I dey get my money ?, As long as I no put hand for bad thing, then I suppose fit give reasons to anybody why I dey buy some cryptocurrency.Money na watin we no go fit chop finish, na just information, pass it to who so ever is interested. It's better to share a financial information than to help someone financially. And note, it's not by force, so don't force anything on anyone, but only those who are interested.Abeg make I hear from una too and happy Sunday...My brother, normally you know say money dey hard to get, no were for this world way I don see way them gather people begin tell them say make Una come here oh, money dey here.If you don get the update say na bitcoin way boys dey use survive, my brother follow the queue oh no time to check time.Financial information is something you have to seek for, nobody knows it all, everyone wants to keep that part of their life a top secret, Even government for we country dey hide financial update, if government no dey hide update, everywhere for this country for don stew 🍲.So  as e be now, you don get the update say na BTC be dey Koko now, so try invest in bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ruttoshi",
      "created_time": "September 25, 2023, 09:30:14 PM",
      "body": "Exposing your means of income depends on whoever that you are telling and it is your choice of mind. Telling people to invest in bitcoin doesn't mean that you are exposing your means of income to people, because bitcoin is not a get rich quick scheme. The problem lies if the people will be patient enough to understand how bitcoin works before investing in it.After investing, another thing is for them to be patient with their investment for it to ripe for profit taking. He only take person wey understand all these to use him happy mind invest for bitcoin. I have told so many people of bitcoin but they keep on procrastinating because them see say the period we you go use make profit too long. OP, make you no also forget say my means of making money fit no work out for the other person. Na everybody dey prepare down for the bull run by accumulating and holding their bitcoin, but no be everybody to make profit from the bull run, because some people go dey wait for the price to over high and before they will know it, the bull market will be over.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hatchy",
      "created_time": "September 25, 2023, 09:45:50 PM",
      "body": "Quote from: ColdLava40 on September 24, 2023, 07:27:40 PMWatin e go cost me if I tell you where I dey get my money ?, As long as I no put hand for bad thing, then I suppose fit give reasons to anybody why I dey buy some cryptocurrency.The way you're saying this, it's important to remember that not everyone can drink water from the same cup. This is wan na parable for nija. Many people prefer not to share their source of income, and you can't force them. If you choose to share, it won't hurt you, but not everyone will be able to follow your path. Let's take Bitcoin, for example. Recently, someone asked me about my current investment, and I mentioned Bitcoin. Initially, he was interested and wanted to know more about it so I gave him things to study. However, when I later asked if he had studied Bitcoin, it was clear he didn't and lost interest. this shows that not everyone can pursue the same income generating activities. We all have different preferences and abilities.so, I don't consider it greediness, bro.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AGogi2003",
      "created_time": "September 26, 2023, 05:54:38 AM",
      "body": "Quote from: Perfectbaby on September 24, 2023, 07:41:44 PMMake e no be say I dey too hash to you on based on say you create post. E get some things we no need to put eyes why because as you dey like this you no go just out there blow your yansh say come learn this thing or carry town cryer to knack for your village say make una come see were i dey money or make una come learn how to make money.. omo with dey country be na those people wey you go call go first kill you then them go come seat for your sit begin dey benefits were you supposed dey benefits.I believe u, no be everyone you go dey tell place where you dey get money because this our country dey as him be, for this life dey get people were like u, and dey get people were want make you dey suffer and you say you go tell them where you dey get money, na for that side dey go start dey plan how dey go take you down, him better make you help them financially then to sure them the road because if you tell them place that you dey generate money, and dey ask you for fund and you didn't give them the time dey need it, you done start dey get enemies be that, so know be everybody you go dey tell secret.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Adams0001",
      "created_time": "September 26, 2023, 07:00:22 AM",
      "body": "Quote from: Majestic-milf on September 24, 2023, 11:47:36 PMQuote from: ColdLava40 on September 24, 2023, 07:27:40 PMWatin e go cost me if I tell you where I dey get my money ?, As long as I no put hand for bad thing, then I suppose fit give reasons to anybody why I dey buy some cryptocurrency. Nothing, my brother. But then, nah your choice be that. Before you go reason your man update, you go don study the kind person he be so you no go loose guard info wey no sopoz reach am. Some pipo no go believe say you go spend your data and your battery dey make moni on a weekly ( that's if you dey campaign); them go feel say you dey whine, and when Dem discover say e legit, no be all go get patience to run am. Some go come gum you so you go dey bread Dem, or odas for cast the thing make am public. QuoteMoney na watin we no go fit chop finish, na just information, pass it to who so ever is interested. It's better to share a financial information than to help someone financially. And note, it's not by force, so don't force anything on anyone, but only those who are interested. While I won't want to be greedy, there are some things that are not meant for everyone. Not everyone has the patience to trade in Bitcoin or even enter the forum and patiently grow in ranks so they can start earning. Even if you want to elevate the next person from hardship, some just have this dependency mentality and just as you rightly pointed, you don't force anything on anyone.Some people if you just tell them make them invest in Bitcoin and you told them is risk just invest money that you can afford to lose there will start saying dey can't risk there money in any investment, is better you tell them the risk involved because if you tell them the advantage of and later on in have interest on it and him invest is money in Bitcoin and the price decrease and he lose is money, and he will start saying you scam him, is better you tell them the advantage and disadvantage of the investment, if he have interest he go join u, you know go Force person make him come make money.Na person where you truest very well or your brother you fit dey tell this can things for no be everybody, because some people even you tell them they can not do it because the stress were dey no be small thing, na true you talk say know be everyone get patient to dey run Bitcoin investment, and some go just want here where you dey get money so that dey can chest you to make your life be some how, the best na just to give them money if dey need am and know be everytime you go say you get. but you see your brothers or close friends you can show them the way make them start am because they once go truest you Weller and you won't have any problem with them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EluguHcman",
      "created_time": "September 26, 2023, 07:29:34 AM",
      "body": "[And I assumed u suppose stand fit to be corrected in ur post if need be else we would have no opinions to share and not worth debating (arguing) on the post other than we just responding... YES SIR...YES SIR.However, the highest source of income with zero risk way u fit relate with people especially relatives na to link on physical hard earning source to secure doubts.U dey aware of inflation and deflation in the BTC trading industry abi? Consider this if the person get ability of understanding and also the patient demand on timing and the monitory on the trading markets with the visions to make great incomes according to time factors. Consider if the person also get the endurance capacity bcos BTC or Crypto investment no dey encourage a beginner way no get other source of finances.U just have to be careful make dem no point bad hands at u whereby, the mata no com sweet the way u sugarcoat am to them.E go mostly beta if the person walk up to u to show am way than u going to drag the person in on the sectors of crypto investment or any forms of investment as long as risk is involved.Meanwhile... I go always talk am loud.... Make we dey pave profitable ways to the people around us to minimize our responsibilities and liabilities.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mayor of ogba",
      "created_time": "September 26, 2023, 01:04:34 PM",
      "body": "QuoteWatin e go cost me if I tell you where I dey get my money ?, As long as I no put hand for bad thingTo even tell people where you dey make your money from no good self because you fit tell them say na so so place you dy work to make money and those your friends no say dem no fit do that work way you dy do to make this cool money. Jealous fit makes them spoil your hustle for you.So, I go tell you make you no dey tell people way you no trust where you dy make your money make them no go spoil am for you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Agbe",
      "created_time": "September 26, 2023, 03:27:28 PM",
      "body": "Op I no go lie for you, your subject and the content e no dey tally, or e fit be sae na me no understand weti you yan oh. How you think sae we fit use help the citizens? My man we no go fit help the citizens of Nigeria. We can only guide anyone dat comes here.  And let see weti I go fit tok for the topic \" Bitcoin for Everyone\" fit mean sae, bitcoin na for everyone but no bi everybodi go fit use am because of di technology and not everyone sabi use technology. Helping someone finally is good but teaching the person how to fish will help the person more.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dzwaafu11",
      "created_time": "September 26, 2023, 08:37:19 PM",
      "body": "Quote from: ColdLava40 on September 24, 2023, 07:27:40 PMBut the sad thing is that, there are certain people who choose to hold financial information to themselves instead of sharing it with the people around them. This issue has become the common habits of Nigerians which has increase greediness among us.Watin e go cost me if I tell you where I dey get my money ?, As long as I no put hand for bad thing, then I suppose fit give reasons to anybody why I dey buy some cryptocurrency.So helping people financially now don turn to compulsory again? Because of how the country they go bah? Because op the way you talk I no con understand the way you carry the matter for head Abi you don ask question for here nobody help you? Anybody wey come here for help we go help am, abii you wan make we they follow people around they carry them come here neh. However,  telling people our source of income is choice, if I chose to hide where I they get money no be crime. If you see say to tell people where you they geh money go help you then you can do that but for me I can’t, and even if I’ll do that not the way you are saying it. We have diverse ways of making money they should also look for another way to chop Abi e necessary say we must do the same hustle? Although we know say money hard for the country.QuoteMoney na watin we no go fit chop finish, na just information, pass it to who so ever is interested. It's better to share a financial information than to help someone financially. And note, it's not by force, so don't force anything on anyone, but only those who are interested.Abeg make I hear from una too and happy Sunday...Yes, na true say we no fit chop money finish. But did you know that is not easy as you think to let someone knows about bitcoin and invest in it? And is not just information as you said if we say bitcoin is just information that means they will just come and tell you to invest in bitcoin without any further talks and you will go do it, but this thing is gradual process how can you just tell someone to invest in bitcoin because you see him hustling but e Neva clear for am when he didn’t know anything about. You gats to teach him some things and risk that involved in this investment if they will be able to take it then make them con join the race, but if you said you go since him they suffer make him start bitcoin investment and others things related to bitcoin stuff make I no lie you if he didn’t know about this risk if anything happen to his funds you will be hold responsible.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptopreneurBrainboss",
      "created_time": "September 26, 2023, 09:43:59 PM",
      "body": "Quote from: ColdLava40 on September 24, 2023, 07:27:40 PMThe economy done bad, which everyone of us are quite aware. Millions of Nigeria youths they out there they strive and still nothing to show for it. Online financial platforms don dey available for piple to dey make money. This platforms done turn some youth to self independent people. Another interesting way of having something to live for is the accumulation of Bitcoin and other crypto currency. We can all attest that this has also helped several youths among us.The forum isn't a financially platforms, it's not one of those social media that pays you for using it and generating revenue for them. The forum no dey get one kobo from any signation campaign wey you dey advertise here so no dey think say this forum na a financial platform to come cure your financial problem, the forum fit just wake up one day talk say e no go allow signature again just as dem decide not to take any direct forum ad slots and now making all the ads wey dey show for first post all about advice and some important things wey person supposed know wey concern Bitcoin. No go introduce the forums as a way to kill poverty oh or you dey bring problem for yourself because these person fit drag you down the line as him dey go down due to him fuck up. See the earnings wey you dey get here as a privileges for been a forum member and keep things to private. QuoteBut the sad thing is that, there are certain people who choose to hold financial information to themselves instead of sharing it with the people around them. This issue has become the common habits of Nigerians which has increase greediness among us. Watin e go cost me if I tell you where I dey get my money ?, As long as I no put hand for bad thing, then I suppose fit give reasons to anybody why I dey buy some cryptocurrency.This world is a evil world, you fit go tell person the hustle wey dey pay you and dem set you up, kidnap you or rub you wetin no good. Information is meant to be shared but so is privacy meant to be protected and when dat information if you share am you go expose your privacy and expose yourself to risk dat would have been easily avoidable, e better make you close your mouth. Beside self, here no easy, you self you never fit carry yourself up you wan go bring another burden upon yourself. If you wan help person, teach am how to do the following for the cryptocurency industry; Teach dem how to buy and sell Bitcoin for a living as merchant. Teach dem how to become a Bitcoin investors and maybe small altcoins dem to use hold body but mostly bitcoin investing. Teach dem how to become traders, dis one dem fit dey trade only Bitcoin or add am small altcoins to keep the energy high. etcThis forum get nothing to do with Bitcoin investing so if you wan introduced people to cryptocurency so e for help their life, do any or all of the things wey I talk above and save yourself the stress of bringing another person wey go give our country bad name for the place, maybe when dem sabi one thing for wetin I talk you fit tell dem about the forum so dem go get something to discuss when they come here and not be a generic forum poster.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kelward",
      "created_time": "September 27, 2023, 09:15:24 AM",
      "body": "Normally e de good to help people by showing dem di way wey you de take make your money, but because of character of many people and di wey dem de take bad and evil pay person for good, e de better to shine your eyes before you go show any person your way.  Besides no go take wetin de precious go wear pig, because im no fit know di value, instead na to rubbish am. Meaning say no go share important financial information with person wey no deserve am, because im go rubbish di precious financial information and rubbish you join.For bitcoin matter, no be everybody I de share di knowledge with, na only people wey I see genuine interest in dem say dem wan learn, wey at least dem get some knowledge about internet. I go make sure say I educate dem as I sabi reach about di gains and risks wey de involved for bitcoin. So person wey i do good share better knowledge no go come became my enemy tomorrow, if im encounter lose for bitcoin or any oda cryptocurrency. Lastly, I agree with our Oga  Cryptopreneurbrainboss, say dis forum no be financial platform wey de pay people for engaging in crypto discussions, na signature campaigns de pay members for dem adverts.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Chilwell",
      "created_time": "September 28, 2023, 09:41:32 AM",
      "body": "Quote from: ColdLava40 on September 24, 2023, 07:27:40 PMMoney na watin we no go fit chop finish, na just information, pass it to who so ever is interested. It's better to share a financial information than to help someone financially. And note, it's not by force, so don't force anything on anyone, but only those who are interested.E dey good to dey share better financial information and the same time e dey risky, already people don't dey see people wey dey do cryptocurrency as bad guys, sharing this information as financial help is not easy because for someone to be engaged with cryptocurrency person need to hold money for hand and the person wey you want help no come get money. Dey get many ways wey we fit help person, for I dey help person wey I see say him pick interest to follow cryptocurrency but before that I go test the person first to see weather him go fit like am.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Versatile_choice",
      "created_time": "September 28, 2023, 10:44:37 AM",
      "body": "Quote from: ColdLava40 on September 24, 2023, 07:27:40 PMBut the sad thing is that, there are certain people who choose to hold financial information to themselves instead of sharing it with the people around them. This issue has become the common habits of Nigerians which has increase greediness among us.Watin e go cost me if I tell you where I dey get my money ?, As long as I no put hand for bad thing, then I suppose fit give reasons to anybody why I dey buy some cryptocurrency.My brother I get your point na true u they talk about withholding an information that could actually help someone improve on there financial or other things but I would say let's not view it on one direction because most at times people tend to keep some good information that could help others if shared within themselves is because sometimes showing people what you normally do could backfire in some cases for example introducing a friend into a platform that could profit the both of you and along the line the person you introduce stole from the platform so is the person that brought him that will be held responsible, I'm not disputing the facts that sharing a good information that could actually help someone is bad but I'm only trying to state some obvious reasons why most people prefer keeping there information to themselves.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Richbased",
      "created_time": "September 28, 2023, 11:10:17 PM",
      "body": "Quote from: ColdLava40 on September 24, 2023, 07:27:40 PMI assume when you see this topic, the first thing that must have come across your mind is to figure certain errors in my post, but make we try dey rest for once so that we go fit reason sum kind matas as naija people. Bitcoin for everyone no mean say I get anyone to give you, na how we fit help out fellow citizens b de reason for this post.The economy done bad, which everyone of us are quite aware. Millions of Nigeria youths they out there they strive and still nothing to show for it. Online financial platforms don dey available for piple to dey make money. This platforms done turn some youth to self independent people. Another interesting way of having something to live for is the accumulation of Bitcoin and other crypto currency. We can all attest that this has also helped several youths among us.But the sad thing is that, there are certain people who choose to hold financial information to themselves instead of sharing it with the people around them. This issue has become the common habits of Nigerians which has increase greediness among us.Watin e go cost me if I tell you where I dey get my money ?, As long as I no put hand for bad thing, then I suppose fit give reasons to anybody why I dey buy some cryptocurrency.Money na watin we no go fit chop finish, na just information, pass it to who so ever is interested. It's better to share a financial information than to help someone financially. And note, it's not by force, so don't force anything on anyone, but only those who are interested.Abeg make I hear from una too and happy Sunday...My brother wetin you talk na true too o but you see nothing good comes easy even Rome the greatest city was not built in a day. So am trying to say that it takes time to achieve great things. You know if everything is given to you whenever you want it you will find out that you won't value it that much because you don't know the pain people went through before to experience that success. So sometimes it also requires you to go through what they went through so that you will experience the sacrifices they made towards achieving greatness. It's just like sometimes ago someone wanted to introduce me to this platform but I told him I don't have a phone nor a laptop. He told me to struggle and get it that it's not as if he can't get it for me o but that if he does dat I may not take it serious because I get it very easy. That if I must succeed in life I need to be determined and hardworking.  So I struggle just to get a phone and when I got the phone I was determined to join this platform so I did, being in this platform and seeing how everything is going it's not really easy at all. Who knows had it been he was the one that bought the phone for me I wouldn't have taken it serious because I may not know the pain he went through. But being that I bought this phone with my hard earn money I brought out my mind to continue even though I know am still new on the platform but I the journey of a thousand miles begins with a step. So I don't think there's need for us to feel bad if we don't achieve things the way we expected it to be.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Richbased",
      "created_time": "October 03, 2023, 08:12:18 AM",
      "body": "Quote from: ColdLava40 on September 24, 2023, 07:27:40 PMI assume when you see this topic, the first thing that must have come across your mind is to figure certain errors in my post, but make we try dey rest for once so that we go fit reason sum kind matas as naija people. Bitcoin for everyone no mean say I get anyone to give you, na how we fit help out fellow citizens b de reason for this post.The economy done bad, which everyone of us are quite aware. Millions of Nigeria youths they out there they strive and still nothing to show for it. Online financial platforms don dey available for piple to dey make money. This platforms done turn some youth to self independent people. Another interesting way of having something to live for is the accumulation of Bitcoin and other crypto currency. We can all attest that this has also helped several youths among us.But the sad thing is that, there are certain people who choose to hold financial information to themselves instead of sharing it with the people around them. This issue has become the common habits of Nigerians which has increase greediness among us.Watin e go cost me if I tell you where I dey get my money ?, As long as I no put hand for bad thing, then I suppose fit give reasons to anybody why I dey buy some cryptocurrency.Money na watin we no go fit chop finish, na just information, pass it to who so ever is interested. It's better to share a financial information than to help someone financially. And note, it's not by force, so don't force anything on anyone, but only those who are interested.Abeg make I hear from una too and happy Sunday...Base on say we dey find wey to help one another no mean say make we no take things serious, this forum is being justified by the quality of the contents of your post that determines your rewards ( merits(s) ) so in as much as you are making the right post and giving your right views about a particular topic your award awaits you already as their are individuals in this forum that checks the quality and authenticity of post being made on this forum and offers rewards.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}