{
  "id": "topic_5411039",
  "title": "etica",
  "author": "etica",
  "created_time": "August 24, 2022, 10:26:42 AMLast edit: April 05, 2023, 06:24:03 AM by etica",
  "content": "Whitepaper:https://www.eticaprotocol.org/viewwhitepaperWhat is Etica?Etica is the first cryptocurrency for Open Source medical research without intellectual property. The whitepaper was published and sent to original Satoshi Nakomoto mailing list in October 2019 (https://www.metzdowd.com/pipermail/cryptography/2019-September/035372.html). Etica blockchain started on april 17th 2022 and until now all social activity has taken place on reddit r/etica but we think we should definitely also have a bitcointalk thread for Etica.Main features:Etica has its own blockchain. It is a proof of work blockchain, Etica is a fork of Ethereum Classic but it started its own blockchain from block 0. Only one smart contract:Etica blockchain aims to have only one smart contract and to devote its whole blockchain to the precise use case of the smart contract which is Open Source medical research. So basically imagine a blockchain with the calculation capacity of ethereum but with only one smart contract dedicated to medical research and you have Etica.Having only one smart contract enables Etica to be scalable from day one as the current capacity of ethereum technology is more than enough for Etica use case.Neutral Protocol:Etica is a neutral protocol like Bitcoin and Monero as once launched the network is completely decentralised and secured by proof of work. Currently Etica has same mining rules as the ones created for Ethereum but once we have enough technical expertise we would like to implement RandomX to secure the blockchain if that's technically possible.2 cryptocurrencies:There are two cryptocurrencies associated with Etica protocol.The first one is Etica (ETI) it is the cryptocurrency of the protocol issued by the smart contract. The initial supply is 21 Million ETI and will be mined at a rate of 2.1 Million ETI per year for 10 years.Once initial supply of 21 Million ETI has been reached there will be a fixed inflation rate. The final fixed inflation rate  (that should start in 2032) will be decided by community once there are enough people in Etica community to make that decision but a maximum limit of 2.61803% has been fixed. Indeed the maximum inflation rate that community could chose is 2.61803% so that early investors can have clear vision and most importantly ETI can retain its value over time.The ETI inflation enables Etica blockchcain to financially reward open source medical research.The second one is EGAZ, it is the equivalent of Ether on ethereum. It is used to secure the blockchain and pay for transaction fees on the Etica blockchain.How it works?Etica Protocol explained in 5 minutes video:https://youtu.be/iswq70tmyzEWebpage explaining how the protocol works:https://www.eticaprotocol.org/eticadocs/howitworks.htmlMini website with dedicated sections explaining:How to run a full node, how to mine ETI, how to interact with Etica through webapps, how to use Etica command line (Etica CLI)https://www.eticaprotocol.org/eticadocs/index.htmlWallethttps://github.com/etica/etica-gui/releasesBlockchain explorerhttps://www.eticascan.orgMining PoolsETI pools: http://eticapool.com/poolsEGAZ pools: https://miningpoolstats.stream/eticaSource codehttps://github.com/eticaA web app connected to Eticahttps://www.etica.io Eticanomicshttps://www.eticanomics.netReddithttps://www.reddit.com/r/EticaDiscordhttps://discord.gg/CrTKpETKXcTelegramhttps://t.me/eticaprotocolExchangesEtica (ETI) : https://txbit.io/Trade/ETI/USDTEGAZ: https://txbit.io/Trade/EGAZ/USDTWhitepaper extract: (https://www.eticaprotocol.org/viewwhitepaper):Etica: A type1 civilization neutral protocol for medical researchAbstract. . A purely neutral protocol for rewarding medical research would allow greaterefficiency and the sharing of early stage medical discoveries without intellectual property. Open source research can make medical research more efficient and faster but its benefits are lost if intellectual property is still required to incentivize research. I propose a solution to the intellectual property dilemma by creating a neutral protocol that encourages   multiple parts to take part in a decentralised medical research process without any intellectual property. The protocol is based on a privacy voting system in which token holders can submit proposals. The proposals are scientific articles oriented towards a specific disease. The protocol institutes   a nash equilibrium for each disease to incentivize the publication of researches that could lead to medical treatments. Proposers and voters are rewarded or penalised depending on the outcome of the proposals’ votes. For each proposal the approval choice is considered as the right choice if it gathered more votes than the protocol’s  threshold. This threshold is readjustedby the protocol every 5 weeks depending on the ratio of approved and rejected proposals. If the voters tend to approve too many proposals then the protocol’s threshold is raised, if on the contrary the voters tend to reject too many proposals then it is decreased. Users have to vote upon proposals based on their inherent properties, they can’t see other users’ votes thanks to a two step voting system with privacy. The protocol impels off-chain communications between token holders about proposals usefullness. Organisations based on a specific disease or group of diseases are likely to emerge in order to provid token holders with relevant information and analysis of proposals through forums and dedicated website explorers. Etica aims to become the neutral protocol on top of which the next generation decentralised communities will organise themselves and gain expertise to discover medical treatments without intellectual property.Feel free to engage conversation, ask any question you may have about Etica (there are no dumb questions), make positive or negative remarks",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5411039",
  "comments": [
    {
      "author": "SpeedyDale08",
      "created_time": "August 24, 2022, 10:09:13 PMLast edit: August 24, 2022, 10:49:32 PM by SpeedyDale08",
      "body": "I have configured Cosmic Miner as required. Only gives this message in miner. Error getting parameters from pool. Please check your network connection, pool/pool url and port. Network error occured contacting the pool. Network worker stopped.I have connected Etica to metamask.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tippytoes",
      "created_time": "August 24, 2022, 11:54:56 PM",
      "body": "If there will be no intellectual property attached to your medical research, would it be prone for other people to copy your concept or idea? Are you okay with it? And who are the people that will conduct your medical research? Do they have the qualifications to handle the job?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kevinwad",
      "created_time": "August 25, 2022, 02:11:27 AM",
      "body": "Quote from: SpeedyDale08 on August 24, 2022, 10:09:13 PMI have configured Cosmic Miner as required. Only gives this message in miner. Error getting parameters from pool. Please check your network connection, pool/pool url and port. Network error occured contacting the pool. Network worker stopped.I have connected Etica to metamask.Hi, We had a brief interruption on mining pool server today due to surge of shares on mining pool. The interruption took place between 2pm and 5pm Paris time. Situation is resolved please try again.Otherwise it must probably be a url issue. Make sure you use this url http://eticapool.com:8080 (if you have low hashrate) or http://eticapool.com:8081 (for higher hashrates).Also in case someone using soliditysha3miner has similar issue I want mention that for soliditysha3Miner some miners have reported that they had to remove http part and use eticapool.com:8080 or eticapool.com:8081Let me know if this doesn't solve your issue",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kevinwad",
      "created_time": "August 25, 2022, 02:34:15 AM",
      "body": "Quote from: tippytoes on August 24, 2022, 11:54:56 PMIf there will be no intellectual property attached to your medical research, would it be prone for other people to copy your concept or idea? Are you okay with it? And who are the people that will conduct your medical research? Do they have the qualifications to handle the job?People are free to copy Etica to the same degree they are free to copy Bitcoin or Monero. Though being the original project Etica should benefit from the same advantages that enabled Bitcoin or Monero to make forks irrelevant.Etica creates a financial incentive to make open source research, anybody is free to make the research and submit proposals. In my opinion the first participants are not likely to be professional researchers but students or self taught individuals. But with time as the quality of proposals increase, more and more professional researchers will eventually join these other types of researchers. The quality of proposals should increase overtime because of the open competition the protocol creates. In fact each week the protocol issues a fixed amount of ETI, the more people will compete for these ETI the higher the quality of their proposals will have to be to be rewarded",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Tarz",
      "created_time": "August 25, 2022, 04:40:29 PM",
      "body": "Big happenings here are expected by the end of august. We are on track for a large shift in adoption of low tier crypto garbage. People are expected to be tempted to buy big on funky craps for the kicks of it. With a lot of craps listed on low volume exchanges this one is the latest u would invest in even if u a habitual garbage collector.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kevinwad",
      "created_time": "August 25, 2022, 08:31:18 PM",
      "body": "Quote from: Tarz on August 25, 2022, 04:40:29 PMBig happenings here are expected by the end of august. We are on track for a large shift in adoption of low tier crypto garbage. People are expected to be tempted to buy big on funky craps for the kicks of it. With a lot of craps listed on low volume exchanges this one is the latest u would invest in even if u a habitual garbage collector.If you have constructive remarks about the protocol and how it works wheither it's positive or negative please feel free to share and I'll be glad to answer",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SpeedyDale08",
      "created_time": "August 25, 2022, 10:40:50 PM",
      "body": "Quote from: kevinwad on August 25, 2022, 02:34:15 AMQuote from: tippytoes on August 24, 2022, 11:54:56 PMIf there will be no intellectual property attached to your medical research, would it be prone for other people to copy your concept or idea? Are you okay with it? And who are the people that will conduct your medical research? Do they have the qualifications to handle the job?People are free to copy Etica to the same degree they are free to copy Bitcoin or Monero. Though being the original project Etica should benefit from the same advantages that enabled Bitcoin or Monero to make forks irrelevant.Etica creates a financial incentive to make open source research, anybody is free to make the research and submit proposals. In my opinion the first participants are not likely to be professional researchers but students or self taught individuals. But with time as the quality of proposals increase, more and more professional researchers will eventually join these other types of researchers. The quality of proposals should increase overtime because of the open competition the protocol creates. In fact each week the protocol issues a fixed amount of ETI, the more people will compete for these ETI the higher the quality of their proposals will have to be to be rewardedI have Cosmic miner running although the reported hash rate by pool is much lower than hash rate reported by Cosmic Miner. On the other hand my AMD 6700 XT is using the Solidity Sha3 Miner and gets this error.[INFO] Found solution, verifying...[2022-08-25T18:33:33] OpenCL (AMD APP) ID: 0 [INFO] Solution verified, submitting nonce 0xf132e08a4fde3a0afbc8783d7cf5d4f518000000e9e119e6675e25237f8fe76f...[2022-08-25T18:33:33] [INFO] Checking latest parameters from primary pool...[2022-08-25T18:33:33] [INFO] Miner share [3] submitted to primary pool: failed (300ms) Why are my shares failing to submit?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kevinwad",
      "created_time": "August 25, 2022, 11:48:21 PM",
      "body": "The hashrate displayed on mining pool is just to give a broad estimation and be able to compare your hashpower with other miners. But it is not used by mining pool to calculate the rewards. What matters is that your shares get accepted by mining pool. You can view your shares by going on page accounts, then click on your address and then you should see your shares and this is what is actually  used to calculate rewards. You should get your rewards within few minutes after each block found by poolFor soliditySha3 miner, can you show a screenshot with as many lines as possible so I can see if it happens several times in a row or just once? Also are you on port 8080 or 8081?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kevinwad",
      "created_time": "August 25, 2022, 11:57:49 PM",
      "body": "Quote from: SpeedyDale08 on August 25, 2022, 10:40:50 PMQuote from: kevinwad on August 25, 2022, 02:34:15 AMQuote from: tippytoes on August 24, 2022, 11:54:56 PMIf there will be no intellectual property attached to your medical research, would it be prone for other people to copy your concept or idea? Are you okay with it? And who are the people that will conduct your medical research? Do they have the qualifications to handle the job?People are free to copy Etica to the same degree they are free to copy Bitcoin or Monero. Though being the original project Etica should benefit from the same advantages that enabled Bitcoin or Monero to make forks irrelevant.Etica creates a financial incentive to make open source research, anybody is free to make the research and submit proposals. In my opinion the first participants are not likely to be professional researchers but students or self taught individuals. But with time as the quality of proposals increase, more and more professional researchers will eventually join these other types of researchers. The quality of proposals should increase overtime because of the open competition the protocol creates. In fact each week the protocol issues a fixed amount of ETI, the more people will compete for these ETI the higher the quality of their proposals will have to be to be rewardedI have Cosmic miner running although the reported hash rate by pool is much lower than hash rate reported by Cosmic Miner. On the other hand my AMD 6700 XT is using the Solidity Sha3 Miner and gets this error.[INFO] Found solution, verifying...[2022-08-25T18:33:33] OpenCL (AMD APP) ID: 0 [INFO] Solution verified, submitting nonce 0xf132e08a4fde3a0afbc8783d7cf5d4f518000000e9e119e6675e25237f8fe76f...[2022-08-25T18:33:33] [INFO] Checking latest parameters from primary pool...[2022-08-25T18:33:33] [INFO] Miner share [3] submitted to primary pool: failed (300ms) Why are my shares failing to submit?Forgot to mention you, please check my anwser above",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kevinwad",
      "created_time": "September 01, 2022, 04:27:33 AM",
      "body": "Quote from: SpeedyDale08 on August 25, 2022, 10:40:50 PMQuote from: kevinwad on August 25, 2022, 02:34:15 AMQuote from: tippytoes on August 24, 2022, 11:54:56 PMIf there will be no intellectual property attached to your medical research, would it be prone for other people to copy your concept or idea? Are you okay with it? And who are the people that will conduct your medical research? Do they have the qualifications to handle the job?People are free to copy Etica to the same degree they are free to copy Bitcoin or Monero. Though being the original project Etica should benefit from the same advantages that enabled Bitcoin or Monero to make forks irrelevant.Etica creates a financial incentive to make open source research, anybody is free to make the research and submit proposals. In my opinion the first participants are not likely to be professional researchers but students or self taught individuals. But with time as the quality of proposals increase, more and more professional researchers will eventually join these other types of researchers. The quality of proposals should increase overtime because of the open competition the protocol creates. In fact each week the protocol issues a fixed amount of ETI, the more people will compete for these ETI the higher the quality of their proposals will have to be to be rewardedI have Cosmic miner running although the reported hash rate by pool is much lower than hash rate reported by Cosmic Miner. On the other hand my AMD 6700 XT is using the Solidity Sha3 Miner and gets this error.[INFO] Found solution, verifying...[2022-08-25T18:33:33] OpenCL (AMD APP) ID: 0 [INFO] Solution verified, submitting nonce 0xf132e08a4fde3a0afbc8783d7cf5d4f518000000e9e119e6675e25237f8fe76f...[2022-08-25T18:33:33] [INFO] Checking latest parameters from primary pool...[2022-08-25T18:33:33] [INFO] Miner share [3] submitted to primary pool: failed (300ms) Why are my shares failing to submit?So did you manage to start mining? For soliditySha3 miner your issue on failed shares is likely due to wrong overrideMaxTarget value in the 0xbtcPool file.Change overrideMaxTarget=27606985387162255149739023449108101809804435888681546220650096895197184 ^ to overrideMaxTarget=26959946667150639794667015087019630673637144422540572481103610249216 ^Or leave overrideMaxTarget field blankLet me know if you still have issuesBy the way right now most Etica discussion and help is happening on discord https://discord.gg/KdEYRhSdVG and reddit https://www.reddit.com/r/etica",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "marscolony",
      "created_time": "September 13, 2022, 02:51:00 AM",
      "body": "What is the Algorithm? I am still confused.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kevinwad",
      "created_time": "September 13, 2022, 08:51:41 AM",
      "body": "Quote from: marscolony on September 13, 2022, 02:51:00 AMWhat is the Algorithm? I am still confused.Etica is a fork of Ethereum Classic so the Blockchain is based on Ethereum technology. It's only a code fork and not chain fork since it started its own blockchain from block 0. Something special is that the blockchain has only one smart contract dedicated to open source medical research. There are two coins in Etica, ETI and EGAZ. ETI is the currency of the protocol with 21 million supply reached in 10 years then fixed inflation rate, EGAZ is the equivalent of ETHER on ethereum and is used to secure the blockchain and pay for transaction fees. Hope it's more clear let me know if you have more questions",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ngenah Euy",
      "created_time": "September 13, 2022, 01:38:57 PM",
      "body": "contract=0xB6eD7644C69416d67B522e20bC294A9a9B405B31 ^is it correct?if i mine ETI, how to chect it in metamask? because the ticker is EGAZ.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "marscolony",
      "created_time": "September 13, 2022, 02:10:09 PM",
      "body": "Quote from: kevinwad on September 13, 2022, 08:51:41 AMQuote from: marscolony on September 13, 2022, 02:51:00 AMWhat is the Algorithm? I am still confused.Etica is a fork of Ethereum Classic so the Blockchain is based on Ethereum technology. It's only a code fork and not chain fork since it started its own blockchain from block 0. Something special is that the blockchain has only one smart contract dedicated to open source medical research. There are two coins in Etica, ETI and EGAZ. ETI is the currency of the protocol with 21 million supply reached in 10 years then fixed inflation rate, EGAZ is the equivalent of ETHER on ethereum and is used to secure the blockchain and pay for transaction fees. Hope it's more clear let me know if you have more questionsIs there ASIC miner? Or only CPU/GPU?Where can rent the hash?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Den11",
      "created_time": "September 13, 2022, 05:19:57 PM",
      "body": "Will there be an airdrop or faucet?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kevinwad",
      "created_time": "September 13, 2022, 08:31:24 PM",
      "body": "Quote from: Ngenah Euy on September 13, 2022, 01:38:57 PMcontract=0xB6eD7644C69416d67B522e20bC294A9a9B405B31 ^is it correct?if i mine ETI, how to chect it in metamask? because the ticker is EGAZ.No Etica contract address is: 0x34c61EA91bAcdA647269d4e310A86b875c09946fEtica is not on Ethereum Blockchain, I think the address you are refering wasa test contract deployed on ethereum mainnet but Etica has its own blockchain and the smart contract address is 0x34c61EA91bAcdA647269d4e310A86b875c09946fTo check on metamask you need to add the Etica (ETI) as a token, EGAZ is the euivalent of ether on ethereum.Check the part \"how to connect\" of this guide and let me know if you have questions: https://www.eticaprotocol.org/eticadocs/howtouse.html",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kevinwad",
      "created_time": "September 13, 2022, 10:16:56 PM",
      "body": "Quote from: Den11 on September 13, 2022, 05:19:57 PMWill there be an airdrop or faucet?No airdrop. It can only be mined or earned thanks to research reward system. There might be faucet in future but none yet. If you want some ETI or EGAZ to test and play with it just share an etica address and I'll send you some. To connect to etica and get an etica address follow first part of this guide: https://www.eticaprotocol.org/eticadocs/howtouse.html",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "marscolony",
      "created_time": "September 14, 2022, 03:32:09 AM",
      "body": "Is the algo asic resistance?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Truscram",
      "created_time": "September 14, 2022, 08:42:52 AM",
      "body": "What is the actual point of forking an Ether network? What does it brings compared to simply creating ETI tokens on ETC or ETH network?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}