{
  "id": "topic_5473629",
  "title": "BitBros_exchanger",
  "author": "BitBros_exchanger",
  "created_time": "November 10, 2023, 04:51:21 PM",
  "content": "Рады представить Вам современный, надежный, быстрый, многофункциональный сервис обмена электронных валют.У нас Вы можете выполнить вывод на карту Приватбанка и карты Visa / MasterCard банков Украины и Казахстана. Так же, мы работаем с наличными направлением, как в Украине, так и в Европе.Нашими преимуществами является не только быстрые и надежные обмены , а так же гибкая бонусная и реферальная система и индивидуальный подход к каждому нашему клиенту. Мы всегда рады вам помочь во всех интересующих Вас вопросах.Наш электронный сервис обмена валют постоянно развивается и совершенствует свои услуги.Заявки обрабатываются как автоматически так и в ручную оператором.Имеем выгодные курсы для обмена с/на фиат.Наш обменный пункт не требует у Вас дополнительной верификации.Если Вам нужно обменять сумму больше указанного лимита, либо по более выгодному курсу, свяжитесь с поддержкой, мы всегда готовы идти на встречу клиенту.На данный момент работаем с такими валютами:-Bitcoin-Etherium-Litecoin-USDT (erc20/trc20/bep20)-Cardano-Etherium Classic-Doge-Link-Tron-NearА так же фиатные валюты:-UAH-KZTНаличные:-USD-EURСписок монет и направлений постоянно пополняется.Обмены производятся исключительно через наш сайт.Наши контакты:Сайт - https://www.bit-bros.net/Наш телеграмм канал - https://t.me/BitBros_NewsПоддержка в телеграмм - https://t.me/BitBros_supportEmail - support@bit-bros.net",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5473629",
  "comments": [
    {
      "author": "light_warrior",
      "created_time": "November 10, 2023, 06:33:35 PM",
      "body": "Quote from: BitBros_exchanger on November 10, 2023, 04:51:21 PMИмеем выгодные курсы для обмена с/на фиат.Курс неплохой но есть гораздо лучше. Я вот только что зашел на бестчендж и там курс можно выбрать 38,23 а у вас 37,77. Так что не очень то и выгодный у вас курс.QuoteНаш обменный пункт не требует у Вас дополнительной верификации.Как же вы не требуете дополнительной верификации если у вас при переводе к примеру юсдт в гривну требуется ввести фамилию и имя? Есть куча обменок где кроме номера карты и мейла больше ничего не надо. Вот вам и дополнительная верификация а вы говорите нету.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitBros_exchanger",
      "created_time": "November 11, 2023, 09:15:40 PM",
      "body": "Ввод фамилии и имени это не идентификация и дополнительная верификация не нужна, указываются имя и фамилия что бы обезопасить клиента. Никто не требует вводить верное ФИО, можете указывать любое на свой страх и риск.Что касаемо курсов, у нас низкий порог лимитов и нет обязательной верификации как у некоторых обменников с лучшим курсом на Бесте.Хотим от нашего лица поблагодарить Вас за конструктивную критику, мы развиваемся и всегда готовы пойти на встречу клиенту.С уважением, команда BitBros.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "light_warrior",
      "created_time": "November 12, 2023, 03:28:52 PM",
      "body": "Quote from: BitBros_exchanger on November 11, 2023, 09:15:40 PMВвод фамилии и имени это не идентификация и дополнительная верификация не нужна, указываются имя и фамилия что бы обезопасить клиента. Никто не требует вводить верное ФИО, можете указывать любое на свой страх и риск.Интересно что значит на свой страх и риск? Можете пояснить этот момент? Как по мне так любое дополнительное окошко для ввода какой то информации клиентом обменника это не есть хорошо. Я пользую обменки где они просят только номер карты и майл и все. Вот это я считаю минимум который необходим для обмена. Почту можно понятное дело использовать какую хошь и она помогает решить какие то возникшие проблемы. Больше ничего не должно быть. Я так думаю.QuoteЧто касаемо курсов, у нас низкий порог лимитов и нет обязательной верификации как у некоторых обменников с лучшим курсом на Бесте.Так есть куча обменок где тоже не требуют обязовой верификации и курс выгодней чем у вас. Так что это не улучшает вашу обменку по отношению с другими. Да а вот лимиты у вас вкусные не спорю. Таких не встречал, вернее видел но курс там меньше. Это плюс вам.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitBros_exchanger",
      "created_time": "November 16, 2023, 04:40:43 PM",
      "body": "Дорогие друзья, а мы напоминаем что у нас действует реферальная система.С внедрением нашей новой реферальной системы наш сервис становится не только местом обмена цифровыми активами, но и платформой для Вашего финансового роста. Приглашайте друзей и получайте бонусы.С каждой успешной транзакции Ваших рефералов Вы получаете от 0.1% до 0.5% , от суммы обмена. Так же спешим Вам сообщить что мы успешно разместились на мониторинге Bitsmediahttps://bits.media/exchanger/bitbros/Обмены проводятся исключительно через наш сайтНаши контакты: Сайт - https://www.bit-bros.net/Наш телеграмм канал - https://t.me/BitBros_NewsПоддержка в телеграмм - https://t.me/BitBros_supportEmail - support@bit-bros.netInstagram - @BitBros_exchanger",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitBros_exchanger",
      "created_time": "November 16, 2023, 05:06:01 PM",
      "body": "Мы прислушались к Вашим пожеланиям и убрали ФИО.Мы постоянно развиваемся и всегда прислушиваемся к рекомендациям и пожеланиям клиентов.С уважением, команда BitBros.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitBros_exchanger",
      "created_time": "December 07, 2023, 04:33:04 PM",
      "body": "У нас отличная новость! Мы добавили множество новых городов, в которых вы можете обменять USDT на наличные доллары, евро, злотые и фунты.Посетите наш сайт, чтобы узнать подробности и совершить выгодные обмены. Перед обменом не забудьте связаться с нашим оператором, чтобы уточнить все детали. Обмен на наличные доступен во всех крупных городах Украина , Европы, а так же США.Быстро, удобно и без лишних хлопот!Обмены проводятся исключительно через наш сайтНаши контакты: Сайт - https://www.bit-bros.net/Наш телеграмм канал - https://t.me/BitBros_NewsПоддержка в телеграмм - https://t.me/BitBros_supportEmail - support@bit-bros.netInstagram - @BitBros_exchanger",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitBros_exchanger",
      "created_time": "January 09, 2024, 06:32:00 PM",
      "body": "Уважаемые друзья, наши дорогие клиенты! Мы очень рады, что вы оказываете нам свое доверие и являетесь постоянными гостями нашего сервиса. Команда BitBros выражает Вам свою благодарность и сердечно поздравляет с новогодними праздниками. В новом году Вас ждет еще больше приятных изменений, еще более выгодные курсы обмена и еще больше направлений для Вашего удобства.Каждый из вас сможет найти то что интересует, будь то обмен с/на карту любого банка Украины, направления Crypto - Crypto, а так же обмены на наличные во многих крупных городах Украины и мира.Наши операторы всегда готовы Вам помочь во всех интересующих вас вопросах .Обмены проводятся исключительно через наш сайтНаши контакты: Сайт - https://www.bit-bros.net/Наш телеграмм канал - https://t.me/BitBros_NewsПоддержка в телеграмм - https://t.me/BitBros_supportEmail - support@bit-bros.netInstagram - @BitBros_exchanger",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitBros_exchanger",
      "created_time": "February 09, 2024, 01:51:30 PM",
      "body": "Дорогие друзья, у нас отличная новость, нашим новым партнером стал мониторинг обменных сервисов Obmify.Obmify.com - это сервис, который помогает найти где безопасно и выгодно обменять криптовалюту, безнал или наличные.Они собрали десятки надежных онлайн обменников из Украины и Европы на одном сайте. Актуальные курсы обмена, отзывы об обменниках, удобный интерфейс и дружелюбная техническая поддержка.Мы продолжаем развивать наш обменный сервис и работать на быстроту, и качество сделок .Обмены проводятся исключительно через наш сайтНаши контакты: Сайт - https://www.bit-bros.net/Наш телеграмм канал - https://t.me/BitBros_NewsПоддержка в телеграмм - https://t.me/BitBros_supportEmail - support@bit-bros.netInstagram - @BitBros_exchanger",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}