{
  "id": "topic_5454099",
  "title": "btctalk-memeboss",
  "author": "btctalk-memeboss",
  "created_time": "May 26, 2023, 12:35:32 PMLast edit: June 04, 2023, 11:34:35 AM by btctalk-memeboss",
  "content": "New memecoins seem to be a great investment if you get in on them early on.# BART #DOGEAI #GREG  #DONS",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5454099",
  "comments": [
    {
      "author": "jacafbiz",
      "created_time": "May 26, 2023, 03:41:42 PM",
      "body": "Memes are always here if you know where to look but it is a game of chance and should not be played by inexperienced traders or investors because it is a pump-and-dump game, pure ponzi, there are a lot of rugs happening every day and people are losing money it to, people won't see this but only the Pepe coins and forget the other rugs. I will advise you to invest in a token with real substance or have a chance of success and not all these dog and cat coins",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lagduf",
      "created_time": "May 26, 2023, 04:09:48 PM",
      "body": "You are telling others the best way to lose their money. It's so stupid to consider meme coin as investment when you have bunch of native coins that can be trusted in the market. You were only making people to get trapped by suggesting em to take meme coin.Are you trying to fool people to consider meme coin as investment? People are really smart these days.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fvb",
      "created_time": "May 26, 2023, 06:51:00 PM",
      "body": "Well, I don't know who will invest in it. Unless, of course, people have extra money and in a bad scenario they are ready to lose it. Personally, I have never invested in such tokens and this is a personal choice for everyone",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dlightag",
      "created_time": "May 26, 2023, 07:11:44 PM",
      "body": "That is through, meme coin's trending which the percentage risk is very high, like wise the profits return, which can double you're initial capital at any given time, and also been dumped and turn the assets zero points. Therefore meme coin's investment is not much advisable to put all hope on, but it can turn someone story over night while taken the and patiently hold for long term, which Shiba Inu coin did it, and anything in cryptocurrency market is possible and every investment, entry point matter a lot.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FrozenBit",
      "created_time": "May 26, 2023, 07:13:25 PM",
      "body": "When I looked at the title, I thought, \"Oh, it would be interesting,\" but no, it has to do with waiting for the meme. It's not safe to expect the meme to pump rockets. When looking at the prices of these charts, the hype is that they are no longer evidence of their pathetic prices. So there is no reason to invest in these high-risk coins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "royalfestus",
      "created_time": "May 26, 2023, 07:26:08 PM",
      "body": "Quote from: fvb on May 26, 2023, 06:51:00 PMWell, I don't know who will invest in it. Unless, of course, people have extra money and in a bad scenario they are ready to lose it. Personally, I have never invested in such tokens and this is a personal choice for everyoneinvesting in meme coins is a risky gamble that many individuals are willing to take repeatedly. it involves a high level of risk, and i have concerns that it may be initiated prematurely. one crucial aspect to consider when it comes to meme coins is the people driving them. do they possess sufficient funds to sustain long-term pumping and have they gained experience in manipulating the coin's value on exchanges and social media platforms?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "abel1337",
      "created_time": "May 26, 2023, 07:30:56 PM",
      "body": "Not a good way to shill meme coins. But I personally don't think meme coins will thrive next bull run, there are some that will rise but I don't think there will be a massive rise will happen to majority of meme coins. I'm speculating that only the established meme coins with a solid community will experience a price bump during bull run as other top altcoins will achieve. I'm pretty sure that the trend at that time is different and the meme coin trend is degrading at that time just like the NFT hype was over. People will notice really good projects that has a real utility that will help the market go into a bull run.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ojima-ojo",
      "created_time": "May 26, 2023, 08:09:09 PM",
      "body": "Quote from: btctalk-memeboss on May 26, 2023, 12:35:32 PMNew memecoins seem to be a great investment if you get in on them early on.# BART #DOGEAI #GREG  #DONSBut buy at your own risk when the % Is over 2000% already and most investors are looking to cashout.https://coinmarketcap.com/view/memes/I have not really been a fan of altcoin talk less of memecoin cashing my attention, but i do a lot of research and readings that give me information about many coins, even though Bitcoin is my main focus as the best investment against the next bull market.There is no doubt the fact meme coins are making waves right now and there has been a lot of hype alongside that development, but then getting in at the right time is the most important thing for an investor who doesn't want to get caught up in the web when the market instability happens since meme coins are poured gamble.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jackl87",
      "created_time": "May 26, 2023, 08:24:43 PM",
      "body": "Quote from: btctalk-memeboss on May 26, 2023, 12:35:32 PMNew memecoins seem to be a great investment if you get in on them early on.# BART #DOGEAI #GREG  #DONSBut buy at your own risk when the % Is over 2000% already and most investors are looking to cashout.In general i agree that with meme-coins you have the chance to make some nice, in some cases even life-changing profits like it happened with PEPE recently even when the market as a whole is going down and all the other projects are losing value.Still i would never touch meme-coins because that chance to be an early investor in a project like PEPE is so small that it is almost non-existant. There are literally 100's of stupid meme-coins launching every day and in the last 3 years only PEPE and Shiba Inu had that big success. So everyone that is seeing this and thinking \"wow i also want to make a x1000, i will invest in meme-coins now\" will be losing money in 99,9% of the cases, because there are at least 1000 meme-coins that are scams or dead again within a few days for every one that is doing well. And a meme-coin like Shiba Inu or PEPE happens even way way rarer than that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ziskinberg",
      "created_time": "May 26, 2023, 09:46:34 PM",
      "body": "Quote from: btctalk-memeboss on May 26, 2023, 12:35:32 PMNew memecoins seem to be a great investment if you get in on them early on.# BART #DOGEAI #GREG  #DONSBut buy at your own risk when the % Is over 2000% already and most investors are looking to cashout.https://coinmarketcap.com/view/memes/People are seeing it good because it was in the hyped but what will happen next, they are not sustainable and it dumps after this hype. Now, if we think about holding them in preparation for the bull season, I can't say it was a good idea as these hyped projects like meme coins are not intended for such an idea as they are just good at short-term, not long-term investment. That is why we should never have to hold them but rather sell them during its hyped because after that, a drop is really be going to happen and less possible that it will recover.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Chainsmokers",
      "created_time": "May 26, 2023, 10:47:55 PM",
      "body": "Quote from: FrozenBit on May 26, 2023, 07:13:25 PMWhen I looked at the title, I thought, \"Oh, it would be interesting,\" but no, it has to do with waiting for the meme. It's not safe to expect the meme to pump rockets. When looking at the prices of these charts, the hype is that they are no longer evidence of their pathetic prices. So there is no reason to invest in these high-risk coins.Investing in meme coins is very risky and it's definitely not worth it to me,lots of potential coins really worth to invest in which the possibility of making profit is much bigger,it will be safer to invest in top coins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yatsan",
      "created_time": "May 26, 2023, 10:58:28 PM",
      "body": "Quote from: btctalk-memeboss on May 26, 2023, 12:35:32 PMNew memecoins seem to be a great investment if you get in on them early on.# BART #DOGEAI #GREG  #DONSBut buy at your own risk when the % Is over 2000% already and most investors are looking to cashout.https://coinmarketcap.com/view/memes/Nope. This memecoin trend should be stopped for real. Not because PEPE and FLOKI showed good price increase, it would already guarantee the same towards other memecoins to be released in the market. Just check the market prices of DOGE and SHIB which simply proves how far the market prices are away from the ATHs.Memetokens are only a good investment on its early stages given that there are no utilities to support its usage and sustain its market value as we all know. People who would invest in every memetoken to be released are more likely to just be squeezed in the middle once market prices decline as part of market volatility. Always manage the risk and check for a token's popularity to atleast draw expectation to whether it would be promising or not, not only with a single instance.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "romero121",
      "created_time": "May 26, 2023, 11:42:02 PM",
      "body": "Quote from: Chainsmokers on May 26, 2023, 10:47:55 PMQuote from: FrozenBit on May 26, 2023, 07:13:25 PMWhen I looked at the title, I thought, \"Oh, it would be interesting,\" but no, it has to do with waiting for the meme. It's not safe to expect the meme to pump rockets. When looking at the prices of these charts, the hype is that they are no longer evidence of their pathetic prices. So there is no reason to invest in these high-risk coins.Investing in meme coins is very risky and it's definitely not worth it to me,lots of potential coins really worth to invest in which the possibility of making profit is much bigger,it will be safer to invest in top coins.With each every form of investment, there'll be risk associated. With cryptocurrency based on the high volatility, iit is termed to be even more risky than other traditional methods of investment. Among the cryptocurrencies, memecoin investment were even worse. It gives the best profit as well as ends an users entire fund without profit. With memecoin investment we need to be lucky to profit good out of it. As said top cryptocurrency on the list will always the best to lower the risk.Whenever we prefer to make an investment into memecoins, it is good to spend spend what we can afford to loss same as what we do while gambling. If we were able to get good profit by the bullish move or in the short term just enjoy it or reinvest in something potential.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ultrloa",
      "created_time": "May 26, 2023, 11:50:29 PM",
      "body": "Quote from: btctalk-memeboss on May 26, 2023, 12:35:32 PMNew memecoins seem to be a great investment if you get in on them early on.# BART #DOGEAI #GREG  #DONSBut buy at your own risk when the % Is over 2000% already and most investors are looking to cashout.https://coinmarketcap.com/view/memes/Maybe meme coins are one of many options to invest, but they are not great investment to get especially by newbies since this is prone to manipulation and fast rug pull schemes. Investing in meme coins are for experience trader so if someone want to try this schemes maybe best for them to start researching and don't over expect on such coins so that they can earn and will not be a additional source of income of those scam devs.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Onset",
      "created_time": "May 27, 2023, 12:47:29 AM",
      "body": "Yeah of course, let’s “invest” some money in coins that have dog breeds or cartoon characters as their name because they’re gonna be worth something in the future. Hell no?!Doge was the original idea and the others are just trying to copy it. Most of them are copying it unsuccessfully. Stick to the known coins that deserve their price. Maybe risk $10 in a memecoin if you think it’s worth losing $10 on them, but don’t go high stakes man.. it’d ruin you so quickly you wouldn’t even have time to react",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Captain Corporate",
      "created_time": "May 27, 2023, 01:13:11 AM",
      "body": "Two things I wonder about the upcoming bull, I know it is coming and I have no idea when it will happen but I know that it is coming. The first thing I wonder is how high it will get, not just bitcoin but if you look at bitcoin price then you understand others, we won't have 100k bitcoin and 2k ethereum, which means just looking at btc would tell you, will it beat ATH? Will it beat 100k? Maybe 200k? I have absolutely no idea and I wonder how that will work. Secondly I wonder what new thing will come out, from ICOs to IEOs to NFTs to DeFis and many others I might forget, every bull brought its own thing and I would love to see how the next one will show up and what it will be. Everytime it happens, its a wonderful hype for a period and people make so much money from them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Stella Mese",
      "created_time": "May 27, 2023, 02:00:35 AM",
      "body": "investing in meme coins has the potential to get big profits, but investing in meme coins must know the knowledge and must be experienced because meme coins have a high pump when they go up and when they go down they usually go down very deep.so if you invest in meme coins, you have to be prepared to lose big, but if you succeed, of course you will get a very big profit.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Xampeuu",
      "created_time": "May 27, 2023, 02:00:41 AM",
      "body": "Quote from: romero121 on May 26, 2023, 11:42:02 PMQuote from: Chainsmokers on May 26, 2023, 10:47:55 PMQuote from: FrozenBit on May 26, 2023, 07:13:25 PMWhen I looked at the title, I thought, \"Oh, it would be interesting,\" but no, it has to do with waiting for the meme. It's not safe to expect the meme to pump rockets. When looking at the prices of these charts, the hype is that they are no longer evidence of their pathetic prices. So there is no reason to invest in these high-risk coins.Investing in meme coins is very risky and it's definitely not worth it to me,lots of potential coins really worth to invest in which the possibility of making profit is much bigger,it will be safer to invest in top coins.With each every form of investment, there'll be risk associated. With cryptocurrency based on the high volatility, iit is termed to be even more risky than other traditional methods of investment. Among the cryptocurrencies, memecoin investment were even worse. It gives the best profit as well as ends an users entire fund without profit. With memecoin investment we need to be lucky to profit good out of it. As said top cryptocurrency on the list will always the best to lower the risk.Whenever we prefer to make an investment into memecoins, it is good to spend spend what we can afford to loss same as what we do while gambling. If we were able to get good profit by the bullish move or in the short term just enjoy it or reinvest in something potential.investing in meme coins is like gambling, because the risk is higher than investing in major coins. but for speculators this can indeed provide a satisfactory return, because the increase can occur thousands of percent. so we must be prepared to experience a loss of capital if it does not match expectations, and of course the market fluctuations are very high, to the point of creating heart exercises for investors. investing in meme coins but thinking it is a lottery may not be a problem, and of course investors should be prepared for anything that happens",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TastyChillySauce00",
      "created_time": "May 27, 2023, 02:03:35 AM",
      "body": "Quote from: Stella Mese on May 27, 2023, 02:00:35 AMinvesting in meme coins has the potential to get big profits, but investing in meme coins must know the knowledge and must be experienced because meme coins have a high pump when they go up and when they go down they usually go down very deep.Remember this, high risk high return low risk low return. There's no good reason to use meme coin as investment. it's very stupid to consider meme coin as investment. Quote from: Stella Mese on May 27, 2023, 02:00:35 AMso if you invest in meme coins, you have to be prepared to lose big, but if you succeed, of course you will get a very big profit.I think that it must be suggesting others to avoid to use meme coin is investment. Don't you even know what meant the word of meme coin? It's bullishitcoin created by for fun only. People shall not use meme coin as investment. This is the sense thing. People who lose their sense used meme coin as investment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}