{
  "id": "topic_5401092",
  "title": "loongmoo",
  "author": "loongmoo",
  "created_time": "June 02, 2022, 09:07:07 AM",
  "content": "I haven't used Electrum in a while. When I open my wallet again found the message watching-only I can fix the wallet Is mine back working? Thanks.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5401092",
  "comments": [
    {
      "author": "mocacinno",
      "created_time": "June 02, 2022, 09:13:13 AM",
      "body": "Quote from: loongmoo on June 02, 2022, 09:07:07 AMI haven't used Electrum in a while. When I open my wallet again found the message watching-only I can fix the wallet Is mine back working? Thanks.  Are you 100% sure you opened the correct wallet?Do you still have the original seed phrase? It might be easyest if you just restored the wallet from the seed phrase... But converting a watch-only wallet to a \"normal\" wallet is not possible, a watch only wallet only contains addresses (or master public keys from witch addresses get derived), since a watch only wallet does not contain private keys (or master private keys), it can never be converted to a \"normal\" wallet",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pmalek",
      "created_time": "June 02, 2022, 09:16:31 AM",
      "body": "An Electrum wallet doesn't become watch-only by itself. You created such a wallet by importing a Bitcoin address or public key, or multiple. Maybe you have several wallets on your system and Electrum just opened the watch-only wallet by default. Click on File > Open and see if there are other wallet files in the default location.What are you trying to do? If you want to create a new wallet, click on Standard wallet > Create a new seed.If you want to recover a wallet from seed, click on Standard wallet > I already have a seed.If you want to import your private keys, click on Import Bitcoin addresses or private keys and import the private keys this time (not public keys or addresses).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NeuroticFish",
      "created_time": "June 02, 2022, 09:36:59 AM",
      "body": "Quote from: loongmoo on June 02, 2022, 09:07:07 AMI haven't used Electrum in a while. When I open my wallet again found the message watching-only I can fix the wallet Is mine back working? Thanks.  1. Was this wallet of yours created from an address of public key? Because then it's 100% normal to be watch only. Being watch only is not something you can fix (it's like you you show a photo with a house and want us help turning that photo back to a house).2. If point 1 is not your case, if you indeed had a proper wallet there some time ago, and you have this problem after an update to newest version (I hope that you've downloaded from Electrum.org and verified it), then maybe you have the same problem as another user had not long ago? https://bitcointalk.org/index.php?topic=5380670.0If neither of these cases is yours, maybe you can give some more details?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "June 02, 2022, 10:02:29 AM",
      "body": "On a wallet that you can spend from, you have the private key. Either the wallet generates you seed phrase then you have the private key as seed phrase generates the private key, or you have the private key directly.  Spending on a bitcoin wallet requires the seed phrase that can generate the private key or the private key itself. In a watch-only wallet, you have only the master public key or the address. The master public key, the public key or the address can not generate the private key that is needed for spending. Watch-only wallet can only be used to track transactions and to create an unsigned transactions, with watch-only wallet, you can not spend, you need the seed phrase or the private key.Electrum can not generate you watch-only directly, you setup the wallet yourself by importing either the master public key or the address(es). To be able to spend, you need the private key of that public key and the address.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "June 02, 2022, 11:39:33 AM",
      "body": "Quote from: loongmoo on June 02, 2022, 09:07:07 AMI haven't used Electrum in a while. When I open my wallet again found the message watching-only I can fix the wallet Is mine back working? Thanks.  How you get that wallet will determine how you will solve the problem. If you have created the wallet, remember where you put the seeds. If you find them on the computer, or someone sold you those coins or told you that he sent those coins, you are not the owner of those coins and therefore you will not be able to spend them .anyway, check the date of buy those coins that may refresh your memory.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitMaxz",
      "created_time": "June 02, 2022, 10:52:12 PM",
      "body": "If your wallet before was created on that device and you remember that you save the seed phrase before you can recover it but if you forgot it then you can try to check the Electrum wallet data from your PC. You can simply check this folder %appdata%\\Electrum then go to the wallet folder you should see something like \"default_wallet\" \"wallet_1\" or any name of the wallet you can restore and check those files by opening these files.To restore these wallet files you can simply open it or simply use the shortcut button \"CTRL+O\" check the image belowAnd let's hope that one of the wallet files is your wallet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}