{
  "id": "topic_5450047",
  "title": "BitcoinUpOnly",
  "author": "BitcoinUpOnly",
  "created_time": "April 24, 2023, 09:24:05 PM",
  "content": "I think one really big advantage of trading Crypto is not only the volatility but also the available data. When analyzing Bitcoin, for example, you have soo much more data to watch than with forex. Think about:On-chain data (long-term)Derivative exchange data (short-term) This is a completely new dimension of data sets that you can use for price predictions that are not available for forex. You can find a lot of data on the following websites:https://lookintobitcoin.com (On-chain, macro charts)https://whaleportal.com/ (Derivative exchange data, short-term charts) There are many more out there like CryptoQuant, Coinglass etc. If you take the time to understand these metrics, your profitability rate will significantly increase, in my experience.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5450047",
  "comments": [
    {
      "author": "Bitcoin_Arena",
      "created_time": "April 24, 2023, 11:54:18 PM",
      "body": "The Biggest advantage is volatility IMO.For example, coins/tokens like PEPE pumped by over 1000% recently in a very short time. Even a noob who bought the token and sold it off before the dump can make some good profits off a spot market with much less effort, something which is not easy with forex. In forex, you have to be good at technical and fundamental analysis.About on chain data and derivative exchange data, I barely even use it, and yet I trade everyday while using Technical Analysis only.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "duckalis",
      "created_time": "April 25, 2023, 12:36:24 AM",
      "body": "In the crypto market, the daily trading volume of any cryptocurrency can be found on monitoring websites with metrics.In contrast, it’s impossible to estimate trading volumes in Forex, because no one keeps track of all deals in this huge market. Forex intermediaries usually show traders the tick volume. This is not a real or even approximate volume, but a quantity of price changes within a specific period (i.e. oscillation counter).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "April 25, 2023, 02:04:44 AM",
      "body": "My friend are into forex and Ive teach him about crypto like cex trading and even degen trading. But I didnt do forex, he said that crypto is much flexible and has more room for gains and profits with very interesting stuff to try on. Sincr he did compare when doing forex. Now he is focus on degen trading, a risky type on crypto almost same with forex according to him but more enjoyable.Quote from: Bitcoin_Arena on April 24, 2023, 11:54:18 PMThe Biggest advantage is volatility IMO.I agreed. This is where the interest of everyone goes since in crypto a lot of liquidity and trading volume.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "April 25, 2023, 02:35:46 AM",
      "body": "Sometimes, data isn't necessarily an advantage if everyone has access to the same data. Advantages arise when you have certain good metrics/data base your decisions upon that not everyone follows.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EarnOnVictor",
      "created_time": "April 25, 2023, 08:23:44 AM",
      "body": "I trade both, not only them, other sectors of the financial market included. And with my experience, the preference of people makes them choose between Forex and Crypto trading, while many people are dealing with the two together. More opportunities are in cryptocurrencies as they are also used for payments against regular fiat, and many that are not even trading/investing it still deal with it, hence the reason for their high popularity these days.Mind you, the number of Forex traders and the market size are far beyond that of cryptocurrency. The FX market has an average daily trading volume of almost 7 trillion and it keeps growing yearly (Investopedia attests to that: Why trade forex). While the cryptocurrency market has far less trading volume. Just choose what suits your investment and trading plans and you will be okay.Besides, almost all factors that affect the forex market affect the crypto market because they can't stand in isolation and they are actually paired with fiats in most cases.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tbct_mt2",
      "created_time": "April 25, 2023, 08:23:55 AM",
      "body": "Quote from: BitcoinUpOnly on April 24, 2023, 09:24:05 PMI think one really big advantage of trading Crypto is not only the volatility but also the available data. When analyzing Bitcoin, for example, you have soo much more data to watch than with forex.Both markets are sensitive with news but with Bitcoin and its public ledger, you can analyze on-chain transactions and data to see how hidden games are playing and setting up. It is not easy even if you have analytical results (charts, data, reports) from free sources, it requires you a lot of time, experience, knowledge about Bitcoin and this market to understand it and make your plans with on-chain data.It is a big plus for Bitcoin market and cryptocurrency market than Forex.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "palle11",
      "created_time": "April 25, 2023, 08:58:13 AM",
      "body": "Quote from: mk4 on April 25, 2023, 02:35:46 AMSometimes, data isn't necessarily an advantage if everyone has access to the same data. Advantages arise when you have certain good metrics/data base your decisions upon that not everyone follows.I think so also regarding data that everyone has being a disadvantage and not advantage, this is what happens with forex trading because the datas are there for traders to analyze. The forex calendar is there to see and analyse by every trader. There are other measures like the charts but this is not the same with cryptocurrency. In crypto, data analyse is not readily available for everyone one, you have to belong to a certain community to understand the bump and dump psychology. Last two years, I remember how doge coin pumped after Elon musk adopted and make positive publicity for dogecoin and hodlers got a lift from that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Tytanowy Janusz",
      "created_time": "April 25, 2023, 09:00:57 AM",
      "body": "Quote from: Bitcoin_Arena on April 24, 2023, 11:54:18 PMFor example, coins/tokens like PEPE pumped by over 1000% recently in a very short time. Even a noob who bought the token and sold it off before the dump can make some good profits off a spot market with much less effort, something which is not easy with forex. In forex, you have to be good at technical and fundamental analysis.I don't think I can disagree more. Yea every noob can buy PEPE and dump after pump but there is the top? At +50%, at+100%? Or maybe at +100 000%? you know its +1000% because it already happend. Just like coinmarketcap list 20 000 coins. The ods for spotting x10- is super low, especially witch tokens like PEPE (which are made several dozen a day, of which 99% end with a rugpull on the second day). You might as well say that any forex noob can open a position with x500 leverage, hit the bottom perfectly and sell when the price is up 2%, thus earning 1000%. But both your example and mine are unlikely.\"According to Gopluslabs the contract owner may contain the authority to modify the transaction tax and contain Blacklist function. Please exercise caution before taking any action and DYOR\" - pepe is most likely a scam token that will go bust very soon.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "irhact",
      "created_time": "April 25, 2023, 09:39:16 AM",
      "body": "Quote from: BitcoinUpOnly on April 24, 2023, 09:24:05 PMI think one really big advantage of trading Crypto is not only the volatility but also the available data. From your options, for me it's the volatility, I don't work with data so I don't know how much of a importance that is or are you referring to technical analysis?. Also the varieties of options available to trade and how profiting they can be that's what make me choose trading cryptocurrency over forex. I have experience in both and I can say cryptocurrency trading is very easier.Forex market don't have a season but cryptocurency market do, in the bull season, if you do your research properly and make good coin selection for trading, any coin you pick to trade can make you big profits while you stay low profile during the bear market because even the good projects get hit by the fear in the market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitcoin_Arena",
      "created_time": "April 25, 2023, 11:50:13 PM",
      "body": "Quote from: Tytanowy Janusz on April 25, 2023, 09:00:57 AM>>snip<<I didn't say there are no risks when trading crypto. They are so many including scams, hacks etc. What I meant, it's much easier for one including a noob to make gains because of the price volatility as compared to trading forex.I say this because when I was a noob trading back then on Etherdelta, I actually made some good profits spot trading shitcoins. I don't think I would have made such profits trading forex without leverage.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yhiaali3",
      "created_time": "April 26, 2023, 02:25:23 AM",
      "body": "Data and its tools are very important, of course, but for me and for many like me, volatility is the most important thing. There are many people who do not depend on data or analysis, but rather rely on volatility only and then take the risk.Also, data without fluctuations is worth nothing, for example, if there are no large fluctuations that help you profit, what is the use of data? You will not gain anything from all the data if these fluctuations that give you profits do not occur.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DevilSlayer",
      "created_time": "April 26, 2023, 04:02:23 AM",
      "body": "You can trader cryptocurrency 24//7 unlike forex you can only trade during weekdays because the market is closed during saturday and sunday. The forex market is the world's largest market because the big players putting money on there and the liquidity is really big. For me there is no problem trading forex or crypto because the system that I'm using is applicable to all types of financial market. If I will compare the both, I'll say that volatility is a big difference because crypto can move 1%-100% in just a day unlike in forex you can only see small movement and the time frame that you should use is intraday for you to have a good trading performance. If you will trade, just pick one for you to master a niche. I'm against with trading a lot of assets simultaneously because it cannot give you the focus that you need to make profit in trading. Just pick one market, understand the nature of the market, research information that can help you and be consistent in order for you to become confident that will give you huge return in the future.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Tytanowy Janusz",
      "created_time": "April 26, 2023, 05:37:23 AM",
      "body": "Quote from: Bitcoin_Arena on April 25, 2023, 11:50:13 PMI didn't say there are no risks when trading crypto. They are so many including scams, hacks etc. I'm not talking about risks. I'm talking about probabilities. I think its more probable to earn on forex buying exacly the dip with 500x leverage than by giving money to stranger who just created a token thanks to 30 min youtube tutorial, bought twitter fallowers and telegram members (5$ per 1000), payed shillers (15$ per day per person) and stolen idea from other project. Quote from: Bitcoin_Arena on April 25, 2023, 11:50:13 PMWhat I meant, it's much easier for one including a noob to make gains because of the price volatility as compared to trading forex.I don't think I would have made such profits trading forex without leverage.Because you don't trade forex without leverage. You just need to remember about good position size management just like you don't buy 1 shitcoin with your entire wallet size.Quote from: Bitcoin_Arena on April 25, 2023, 11:50:13 PMI say this because when I was a noob trading back then on Etherdelta, I actually made some good profits spot trading shitcoins.you were in the right place at the right time. But I'm sure you'll agree with me that it's not a sure-fire, repeatable success.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "death69",
      "created_time": "April 26, 2023, 07:09:04 AM",
      "body": "What's data, really? Just a crazy mix of digits and graphs? Or something way cooler?Here's my two cents: data's like a VIP pass into the market's soul. It's a mirror of the wildest dreams, gnarly fears, and burning hopes of traders worldwide. And when you dive into that data, like really get all up in its business, patterns start popping up. You see the market in all its glory: a mind-blowing mosaic spun from human feels.No doubt, that wild beauty can be a major brain-bender. It's like peering into the void, trying to make heads or tails of it. But that's the trading game, right? Gazing into the market's core and coming out with something epic.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mvdheuvel1983",
      "created_time": "April 26, 2023, 08:41:32 PM",
      "body": "Quote from: Bitcoin_Arena on April 24, 2023, 11:54:18 PMThe Biggest advantage is volatility IMO.For example, coins/tokens like PEPE pumped by over 1000% recently in a very short time. Even a noob who bought the token and sold it off before the dump can make some good profits off a spot market with much less effort, something which is not easy with forex. In forex, you have to be good at technical and fundamental analysis.About on chain data and derivative exchange data, I barely even use it, and yet I trade everyday while using Technical Analysis only.Exactly. Volatility is a blessing in disguise when it comes to crypto trading. In fact the statement, win big or go home qualifies here. Profit is bigger and loss is bigger. But the person must be ready to be a high risk taker. Most crypto traders are high risk takers. And each calculated risks have been worth it. Compared with forex traders who do not want it rough.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitcoin_Arena",
      "created_time": "April 26, 2023, 11:49:08 PM",
      "body": "Quote from: Tytanowy Janusz on April 26, 2023, 05:37:23 AMI'm not talking about risks. I'm talking about probabilities. I think its more probable to earn on forex buying exacly the dip with 500x leverage than by giving money to stranger who just created a token thanks to 30 min youtube tutorial, bought twitter fallowers and telegram members (5$ per 1000), payed shillers (15$ per day per person) and stolen idea from other project. Look up my first reply, I never even talked about leverage. My reference was crypto spot trading, which is equivalent to the forex no leverage trading.Don't you see it's a little bit comical, comparing crypto spot vs Forex trading using leverage?Even someone with only $100 can turn it into $200 or more than that in crypto spot in a very short time, This is almost impossible with forex if you are not using Leverage (which is equivalent to spot)Quote from: Tytanowy Janusz on April 26, 2023, 05:37:23 AMBecause you don't trade forex without leverage. You just need to remember about good position size management just like you don't buy 1 shitcoin with your entire wallet size.¯\\_(ツ)_/¯Quote from: Tytanowy Janusz on April 26, 2023, 05:37:23 AMyou were in the right place at the right time. But I'm sure you'll agree with me that it's not a sure-fire, repeatable success. Because when one is trading forex, they don't need to be in the right place at the right time... Wooooow I am going to be a millionaire trading forex from this night forward",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GreatArkansas",
      "created_time": "April 27, 2023, 01:37:23 AM",
      "body": "Quote from: mk4 on April 25, 2023, 02:35:46 AMSometimes, data isn't necessarily an advantage if everyone has access to the same data. Advantages arise when you have certain good metrics/data base your decisions upon that not everyone follows.I think if we have a scenario like this, then it will be now based on how these data are being used or analyzed by different people. For me, using data properly based on your goals or use case then your trading decisions can be improved by having a better understanding of the underlying demand for a particular cryptocurrency.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AicecreaME",
      "created_time": "April 27, 2023, 01:57:38 AM",
      "body": "Quote from: Bitcoin_Arena on April 24, 2023, 11:54:18 PMThe Biggest advantage is volatility IMO.For example, coins/tokens like PEPE pumped by over 1000% recently in a very short time. Even a noob who bought the token and sold it off before the dump can make some good profits off a spot market with much less effort, something which is not easy with forex. In forex, you have to be good at technical and fundamental analysis.About on chain data and derivative exchange data, I barely even use it, and yet I trade everyday while using Technical Analysis only.I agree. Volatility is the number one reason why people trade cryptocurrencies instead in forex. It is much worth it in my opinion as well in the long run rather than sticking to digital fiat which is too boring to watch and takes a very long time before it could actually \"pump\". Also, fiat could be easily manipulated by the government which makes it not good for trading. Don't get me wrong, cryptocurrency could be easily manipulated as well but at least not because of the government totally controlling its whole system.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Tytanowy Janusz",
      "created_time": "April 27, 2023, 05:47:07 AM",
      "body": "Quote from: Bitcoin_Arena on April 26, 2023, 11:49:08 PMLook up my first reply, I never even talked about leverage. My reference was crypto spot trading, which is equivalent to the forex no leverage trading.Don't you see it's a little bit comical, comparing crypto spot vs Forex trading using leverage?Even someone with only $100 can turn it into $200 or more than that in crypto spot in a very short time, This is almost impossible with forex if you are not using Leverage (which is equivalent to spot)Quote from: Tytanowy Janusz on April 26, 2023, 05:37:23 AMBecause you don't trade forex without leverage. You just need to remember about good position size management just like you don't buy 1 shitcoin with your entire wallet size.¯\\_(ツ)_/¯Its like saying that walking is faster than driving a car, because you have to push the car if you don't want to refuel it. Nobody trades forex without leverage. It does not make sense. Just like no one is pushing the car. forex = leverage.Low volatility on forex makes trading on leverage no more difficult/risk than trading crypto spot, and nowhere did the OP stipulate in his question that the leverage is out. He asked about comparing crypto to forex, and you immediately castrated forex and then based on this, you said that you can't make money there or its super more complicated than on crypto by buying shitcoins (PEPE).Quote from: Bitcoin_Arena on April 26, 2023, 11:49:08 PMQuote from: Tytanowy Janusz on April 26, 2023, 05:37:23 AMyou were in the right place at the right time. But I'm sure you'll agree with me that it's not a sure-fire, repeatable success. Because when one is trading forex, they don't need to be in the right place at the right time... Wooooow I am going to be a millionaire trading forex from this night forward  You need knowlege and luck in both crypto and forex trading. I just meant that anecdotal evidence is not evidence (the fact that you once succeeded). Unless it's about PEPE type shitcoins, there is no knowledge there, only luck.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}