{
  "id": "topic_5469777",
  "title": "jeremypwr",
  "author": "jeremypwr",
  "created_time": "October 09, 2023, 04:34:55 PM",
  "content": "UFC Fight Night 230Multi Master Challenge   Prizes1st place: 3 mBTC Free Bet2nd place: 2 mBTC Free Bet3rd place: 1 mBTC Free BetThe Rules are similar to the original Sportsbet.io Multi Master that we all enjoyed so muchRulesa)  Predict the winner of each match (earn 1-2 points)b)  Predict how many matches will NOT go the Full Distance (will be adjusted accordingly if matches get cancelled)Odds @ https://sportsbet.io/sports/mma/ufc/ufc-fight-night-yusuff-vs-barboza/matchesMatches(2 points each)12. Sodiq Yusuff vs. Edson Barboza (must get 12 correct to proceed)11. Viviane Araujo vs. Jennifer Maia 10. Jonathan Martinez vs. Adrian Yanez 9. Michel Pereira vs. Andre Petroski 8. Edgar Chairez vs. Daniel Lacerda 7. Christian Rodriguez vs. Cameron Saaiman (1 point each)6. TJ Brown vs. Darren Elkins 5. Irina Alekseeva vs. Melissa Dixon4. Heili Alateng vs. Chris Gutierrez 3. Emily Ducote vs. Ashley Yoder 2. Brendon Marotte vs. Terrance McKinney 1. Tainara Lisboa vs. Ravena Oliveira NOT go the Full Distance   Make sure your Prediction is in this format    Example12. Sodiq Yusuff 11. Viviane Araujo 10. Jonathan Martinez 9. Michel Pereira 8. Edgar Chairez7. Christian Rodriguez 6. TJ Brown 5. Irina Alekseeva 4. Heili Alateng 3. Emily Ducote 2. Brendon Marotte 1. Tainara Lisboa NOT go the Full Distance 6Sportsbet.io has been kind enough to sponsor my Prediction Contests and Promos for a while now.Sportsbet.io is a sports betting website; therefore these Prediction Contests and Promos are catered to those who actually bet on/discuss sports.If you are unsure if you qualify, just shoot me a PM.  Thank you for your cooperation.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5469777",
  "comments": [
    {
      "author": "LFC_Bitcoin",
      "created_time": "October 09, 2023, 05:13:03 PM",
      "body": "12. Sodiq Yusuff 11. Jennifer Maia 10. Jonathan Martinez 9. Michel Pereira 8. Edgar Chairez 7. Christian Rodriguez 6. TJ Brown 5. Melissa Dixon4. Chris Gutierrez 3. Emily Ducote 2. Terrance McKinney 1. Tainara Lisboa NOT go the Full Distance 6",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mv1986",
      "created_time": "October 09, 2023, 05:14:00 PM",
      "body": "12. Sodiq Yusuff 11. ennifer Maia 10. Adrian Yanez 9. Michel Pereira 8. Edgar Chairez 7. Christian Rodriguez 6. TJ Brown 5. Melissa Dixon4. Chris Gutierrez 3. Emily Ducote 2. Terrance McKinney 1. Tainara LisboaNOT go the Full Distance 6",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Betwrong",
      "created_time": "October 09, 2023, 05:24:00 PM",
      "body": "12. Sodiq Yusuff11. Jennifer Maia10. Adrian Yanez9. Michel Pereira8. Edgar Chairez7. Christian Rodriguez6. TJ Brown5. Melissa Dixon4. Chris Gutierrez3. Emily Ducote2. Terrance McKinney1. Tainara LisboaNOT go the Full Distance 7",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jeremypwr",
      "created_time": "October 09, 2023, 05:26:39 PM",
      "body": "12. Edson Barboza 11. Jennifer Maia 10. Adrian Yanez 9. Michel Pereira 8. Edgar Chairez 7. Christian Rodriguez 6. TJ Brown 5. Melissa Dixon4. Chris Gutierrez 3. Emily Ducote 2. Terrance McKinney 1. Tainara Lisboa NOT go the Full Distance 5",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ajiz138",
      "created_time": "October 09, 2023, 05:29:28 PM",
      "body": "12. Sodiq Yusuff11. Jennifer Maia10. Jonathan Martinez9. Michel Pereira8. Edgar Chairez7. Christian Rodriguez6. TJ Brown5. Melissa Dixon4. Chris Gutierrez3. Emily Ducote2. Terrance McKinney1. Tainara LisboaNOT go the Full Distance 5",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jayce",
      "created_time": "October 09, 2023, 05:49:01 PM",
      "body": "12. Sodiq Yusuff11. Jennifer Maia10. Adrian Yanez9. Michel Pereira8. Edgar Chairez7. Christian Rodriguez6. TJ Brown5. Melissa Dixon4. Chris Gutierrez3. Emily Ducote2. Terrance McKinney1. Tainara LisboaNOT go the Full Distance 4",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CLS63",
      "created_time": "October 09, 2023, 06:03:40 PM",
      "body": "12. Edson Barboza11. Jennifer Maia10. Jonathan Martinez9. Michel Pereira8. Edgar Chairez7. Christian Rodriguez6. TJ Brown5. Melissa Dixon4. Chris Gutierrez3. Emily Ducote2. Terrance McKinney1. Tainara LisboaNOT go the Full Distance 6",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "notblox1",
      "created_time": "October 09, 2023, 06:50:11 PM",
      "body": "12. Sodiq Yusuff11. Jennifer Maia10. Jonathan Martinez9. Andre Petroski8. Edgar Chairez7. Christian Rodriguez6. TJ Brown5. Irina Alekseeva4. Chris Gutierrez3. Emily Ducote2. Terrance McKinney1. Ravena OliveiraNOT go the Full Distance 6",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "KTChampions",
      "created_time": "October 09, 2023, 08:35:42 PM",
      "body": "12. Sodiq Yusuff11. Jennifer Maia10. Jonathan Martinez9. Michel Pereira8. Edgar Chairez7. Christian Rodriguez6. TJ Brown5. Irina Alekseeva4. Chris Gutierrez3. Emily Ducote2. Brendon Marotte1. Tainara LisboaNOT go the Full Distance 5",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TopTort777",
      "created_time": "October 10, 2023, 08:16:43 AM",
      "body": "12. Edson Barboza11. Jennifer Maia10. Adrian Yanez9. Michel Pereira8. Edgar Chairez7. Christian Rodriguez6. TJ Brown5. Irina Alekseeva4. Chris Gutierrez3. Emily Ducote2. Terrance McKinney1. Tainara LisboaNOT go the Full Distance 4",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Barcode_",
      "created_time": "October 10, 2023, 08:40:54 AM",
      "body": "12. Sodiq Yusuff11. Jennifer Maia10. Jonathan Martinez9. Andre Petroski8. Edgar Chairez7. Christian Rodriguez6. TJ Brown5. Irina Alekseeva4. Chris Gutierrez3. Emily Ducote2. Brendon Marotte1. Tainara LisboaNOT go the Full Distance 4",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mole0815",
      "created_time": "October 10, 2023, 08:47:48 AM",
      "body": "12. Sodiq Yusuff11. Jennifer Maia10. Adrian Yanez9. Andre Petroski8. Edgar Chairez 7. Christian Rodriguez 6. Darren Elkins5. Irina Alekseeva4. Heili Alateng 3. Ashley Yoder2. Terrance McKinney1. Tainara LisboaNOT go the Full Distance 3",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "shogun47",
      "created_time": "October 10, 2023, 09:02:21 AM",
      "body": "12. Sodiq Yusuff 11. Viviane Araujo 10. Jonathan Martinez 9. Michel Pereira 8. Edgar Chairez 7. Christian Rodriguez 6. TJ Brown5. Melissa Dixon4. Chris Gutierrez3. Emily Ducote 2. Brendon Marotte 1. Tainara Lisboa NOT go the Full Distance 5",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kryptqnick",
      "created_time": "October 10, 2023, 10:58:32 AM",
      "body": "12. Sodiq Yusuff 11. Viviane Araujo10. Jonathan Martinez 9. Michel Pereira8. Daniel Lacerda7. Christian Rodriguez 6. TJ Brown 5. Melissa Dixon4. Chris Gutierrez3. Emily Ducote 2. Terrance McKinney1. Ravena OliveiraNOT go the Full Distance 5",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "morvillz7z",
      "created_time": "October 10, 2023, 03:17:18 PM",
      "body": "12. Sodiq Yusuff11. Viviane Araujo10. Jonathan Martinez9. Andre Petroski8. Daniel Lacerda7. Cameron Saaiman6. TJ Brown5. Irina Alekseeva4. Heili Alateng3. Emily Ducote2. Terrance McKinney1. Tainara LisboaNOT go the Full Distance 5",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Slissy",
      "created_time": "October 10, 2023, 05:09:03 PM",
      "body": "12. Edson Barboza 11. Viviane Araujo 10. Adrian Yanez  9. Andre Petroski 8. Edgar Chairez 7. Christian Rodriguez 6. TJ Brown 5. Melissa Dixon4. Chris Gutierrez 3. Emily Ducote 2. Terrance McKinney 1. Tainara Lisboa NOT go the Full Distance 7",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mst.Wangdan$",
      "created_time": "October 10, 2023, 07:21:51 PM",
      "body": "12. Sodiq Yusuff11. Jennifer Maia10. Jonathan Martinez9. Michel Pereira8. Edgar Chairez7. Christian Rodriguez6. TJ Brown5. Melissa Dixon4. Chris Gutierrez3. Emily Ducote2. Terrance McKinney1. Tainara LisboaNOT go the Full Distance 5",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bullrun2024bro",
      "created_time": "October 10, 2023, 08:35:57 PM",
      "body": "12. Sodiq Yusuff11. Jennifer Maia10. Jonathan Martinez9. Michel Pereira8. Edgar Chairez7. Christian Rodriguez6. TJ Brown5. Irina Alekseeva4. Chris Gutierrez3. Emily Ducote2. Brendon Marotte1. Tainara LisboaNOT go the Full Distance 7",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Harkorede",
      "created_time": "October 11, 2023, 12:23:49 AM",
      "body": "12. Edson Barboza11. Jennifer Maia10. Jonathan Martinez9. Michel Pereira8. Edgar Chairez7. Cameron Saaiman6. TJ Brown5. Melissa Dixon4. Chris Gutierrez3. Emily Ducote2. Terrance McKinney1. Tainara LisboaNOT go the Full Distance 6",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}