{
  "id": "topic_5405490",
  "title": "Boy_Feeder",
  "author": "Boy_Feeder",
  "created_time": "July 07, 2022, 09:42:19 AM",
  "content": "DEAR FRIENDS,My tronlink wallet is having more than $ 15000 and it is freezed after depositingI can not transfer but still receive $ USDT from Binance sourceI am really tired and need anyone can help then I will pay the fee ($ 2000) for you if my account can unlockhttps://ibb.co/y5VPcjPhttps://i.ibb.co/XpVLrRL/z3548761865990-449f81b7f7d0f3682e8de165c6590389.jpgEmail: Dttrung16@gmail.com",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5405490",
  "comments": [
    {
      "author": "Charles-Tim",
      "created_time": "July 07, 2022, 09:45:03 AM",
      "body": "Tether (USDT) right? Tether Limited can freeze USDT on noncustodial wallets, the reason not to use such token. [UPDATED] PSA: Most Stablecoins Can Be Frozen, Even in Your Own Wallets",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JeromeTash",
      "created_time": "July 07, 2022, 10:57:36 AM",
      "body": "But it's as if I see your USDT tokens are staked. Once you stake, it means the tokens stay frozen if you want to earn stake mining rewards. So you first have to unstake them in order to be able to withdraw. Please confirm if the tokens are staked or not",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Maidak",
      "created_time": "July 07, 2022, 11:16:51 AM",
      "body": "Quote from: JeromeTash on July 07, 2022, 10:57:36 AMBut it's as if I see your USDT tokens are staked. Once you stake, it means the tokens stay frozen if you want to earn stake mining rewards. So you first have to unstake them in order to be able to withdraw. Please confirm if the tokens are staked or notYes, as shown in the picture, he is staking USDT and enjoying the profit and the freeze is normal. OP, you can unstake your USDT and try another trade again, you are staking and you cannot use your assets while you are staking. It depends on each platform's regulations whether you will be able to trade or use your assets immediately after the unstake. However, some platforms take 15 to 20 days to complete the unstake.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zasad@",
      "created_time": "July 07, 2022, 01:53:29 PM",
      "body": "Quote from: Boy_Feeder on July 07, 2022, 09:42:19 AMDEAR FRIENDS,My tronlink wallet is having more than $ 15000 and it is freezed after depositingI can not transfer but still receive $ USDT from Binance sourceI am really tired and need anyone can help then I will pay the fee ($ 2000) for you if my account can unlockhttps://ibb.co/y5VPcjPhttps://i.ibb.co/XpVLrRL/z3548761865990-449f81b7f7d0f3682e8de165c6590389.jpgEmail: Dttrung16@gmail.comWrite me in private messages the address of your wallet, which wallet you use on your phone.According to your data, it is very difficult to understand what kind of freezing it is.Or did you accidentally press the staking button and confirm the transaction? But I don't believe in such coincidences.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jawhead999",
      "created_time": "July 07, 2022, 02:55:10 PM",
      "body": "AFAIK Tronlink only support a token that run in Tron network, even USDT is centralized and could be frozen, but this USDT is run with Tron network, so Tron team is responsible for this case. Have you ask the customer service? they should handle your case since $15K isn't a small amount money.From your screenshot I don't see anything that can be see as locked, I think you need to find the unstake button or if you didn't find it, you can explain more briefly.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ryzaadit",
      "created_time": "July 07, 2022, 08:18:59 PM",
      "body": "Still waiting for some answer for the service, web, or wallet you're using.Since @OP is only sharing the dashboard without telling full detail of the wallet/service he was using. So really a little bit confused, and the apps has some \"Invite\" feature could be @OP trying to virtual staking? while the reality he was playing a ponzi (Not actually staking, only pay the interest has been set up by site)And they pay, as long there has some new investor.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DanWalker",
      "created_time": "July 08, 2022, 04:52:08 AM",
      "body": "Quote from: Jawhead999 on July 07, 2022, 02:55:10 PMAFAIK Tronlink only support a token that run in Tron network, even USDT is centralized and could be frozen, but this USDT is run with Tron network, so Tron team is responsible for this case. Have you ask the customer service? they should handle your case since $15K isn't a small amount money.From your screenshot I don't see anything that can be see as locked, I think you need to find the unstake button or if you didn't find it, you can explain more briefly.Just OP checked his USDT status, It appears that the OP has locked his USDT for staking purposes, so USDT usage is not allowed. It is not the wallet's fault, but the OP's problem. But after all, it is quite risky for him to hold the majority of his assets in USDT, as they can be frozen at any time and are somewhat difficult to recover once they are frozen. OP! you should online and let us know whether your problem has been resolved or not.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}