{
  "id": "topic_5445066",
  "title": "Thib11",
  "author": "Thib11",
  "created_time": "March 15, 2023, 10:00:49 PM",
  "content": "Pensez-vous que les technologies d'IA comme ChatGPT4 peuvent être efficaces pour détecter les SCAM liées aux Cryptomonnaies  ? Ou pensez-vous que l'expertise humaine reste essentielle pour prendre des décisions ? Partagez vos réflexions et ouvrons le débat > https://twitter.com/CiteDeLaCrypto/status/1636116911904661506",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5445066",
  "comments": [
    {
      "author": "kopi72",
      "created_time": "March 16, 2023, 12:33:47 PM",
      "body": "aucune idée, en tout cas ils arréte pas de nous saouler avec leur chatGPT, comme si ce truc allez changer le monde, perso j'en doute fortement.alors que Bitcoin à changer le monde de la finance.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "patrickus",
      "created_time": "March 16, 2023, 01:52:28 PM",
      "body": "Quote from: kopi72 on March 16, 2023, 12:33:47 PMcomme si ce truc allez changer le monde, perso j'en doute fortement.Moi je n'ai aucun doute. Une révolution infiniment plus importante que celle d'internet AMHA.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LeGaulois",
      "created_time": "March 16, 2023, 02:01:27 PM",
      "body": "Quote from: kopi72 on March 16, 2023, 12:33:47 PMPour ma part, je dirais que Bitcoin n'a rien vraiment changé dans le cercle de la finance. On parle de la finance traditionnelle, bien entendu.Est ce que ca pourrait être le cas dans un futur proche ou éloigné. Telle est la question, mais honnêtement vu ce qu'on en fait, j'ai quand même un doute parce qu'on reproduit exactement les même erreurs, applique les même principes, et in fine la même idéologie. Ca se voit clairement dans l'évolution de l'écosystème. Au final, nous n'avons que ce que l'on mérite..Après oui, on peut argumenter sur la DeFi, la décentralisation et tout le tralala, mais force est de constater depuis des années que ce n'est pas ce qui intéresse les gens. Comme on dit en France: Ce qui compte, c'est la bouffe dans mon assiette.Mais sinon je suis d'accord avec ce truc de chatgpt, ca me saoule tout ces articles d'actualités en ce moment. On dirait qu'ils ont inventé l'eau chaude, alors que ca existe depuis belle lurette. Il y a quelques années j'utilisais ce qu'on pourrait appelé l'ancêtre de chatgpt. C'est juste de nos jours plus développé et c'est normal.Quoi qu'il en soit, une fois à maturité, ca pourrait apporter pas mal d'aide faut avouer. Et/ou nous rendre plus fainéant, je sais pas, c'est possible aussi.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "paid2",
      "created_time": "March 16, 2023, 03:29:56 PM",
      "body": "Quote from: Thib11 on March 15, 2023, 10:00:49 PMPensez-vous que les technologies d'IA comme ChatGPT4 peuvent être efficaces pour détecter les SCAM liées aux Cryptomonnaies  ? Ou pensez-vous que l'expertise humaine reste essentielle pour prendre des décisions ? Partagez vos réflexions et ouvrons le débat > https://twitter.com/CiteDeLaCrypto/status/1636116911904661506Nope je pense pas.ChatGPT ne recherche rien en ligne et ne produit pas d'analyses propres.Il traite et cherche des infos dans une grosse database, donc pour détecter un scam coin / scam project, il faudrait que celui ait été rentré en tant que scam dans sa databaseÀ mon humble avis il faudrait chercher du côté d'autres IA pour ce type de requêtes",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GrosWesh",
      "created_time": "March 16, 2023, 05:37:51 PM",
      "body": "Quote from: iwantmyhomepaidwithbtc2 on March 16, 2023, 03:29:56 PMNope je pense pas.ChatGPT ne recherche rien en ligne et ne produit pas d'analyses propres.Il traite et cherche des infos dans une grosse database, donc pour détecter un scam coin / scam project, il faudrait que celui ait été rentré en tant que scam dans sa databaseÀ mon humble avis il faudrait chercher du côté d'autres IA pour ce type de requêtesApparemment il est quand même capable d'\"auditer\" des smart contracts. Il peut même désobfusquer lorsque c'est nécessaire. Certains s'en servent déja pour remporter des bounties d'ailleurs. Donc déceler des scams, peut être pas mais trouver des trucs louches dans du code illisible pour la plupart d'entre nous ça doit être ok par contre.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "paid2",
      "created_time": "March 16, 2023, 06:19:39 PM",
      "body": "Quote from: GrosWesh on March 16, 2023, 05:37:51 PMQuote from: iwantmyhomepaidwithbtc2 on March 16, 2023, 03:29:56 PMNope je pense pas.ChatGPT ne recherche rien en ligne et ne produit pas d'analyses propres.Il traite et cherche des infos dans une grosse database, donc pour détecter un scam coin / scam project, il faudrait que celui ait été rentré en tant que scam dans sa databaseÀ mon humble avis il faudrait chercher du côté d'autres IA pour ce type de requêtesApparemment il est quand même capable d'\"auditer\" des smart contracts. Il peut même désobfusquer lorsque c'est nécessaire. Certains s'en servent déja pour remporter des bounties d'ailleurs. Donc déceler des scams, peut être pas mais trouver des trucs louches dans du code illisible pour la plupart d'entre nous ça doit être ok par contre.Je savais pas ! Punaise l'outil est si récent et je suis déjà si largué avec!Je pense que je dois pas bien savoir communiquer avec lui car à chaque fois je n'arrive pas à en faire ce que je veux..En tout cas c'est un truc à étudier, merci pour les infos",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MariePO",
      "created_time": "May 18, 2023, 11:37:57 AM",
      "body": "bonjouren fait, depuis peu, on peut accéder aux infos après 2019https://i.postimg.cc/3d4bHDWf/Capture-d-cran-2023-05-18-13-32-06.pngdonc ça se teste effectivement ;-)contact moi en mp si tu veux que je fasse (j'ai l'abonnement) : quels scam t'intéressèrent  belle journéeet vive le BEF de ce WE",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}