{
  "id": "topic_5436223",
  "title": "SmokerApeth",
  "author": "SmokerApeth",
  "created_time": "January 21, 2023, 08:49:23 AM",
  "content": "A few years ago, I sold PolkaDot at its own high point after steadily buying it.From now on, I will continue to invest in PolkaDot and Ethereum again, what do you think about the future of these two coins?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5436223",
  "comments": [
    {
      "author": "DanWalker",
      "created_time": "January 21, 2023, 09:00:18 AM",
      "body": "Quote from: SmokerApeth on January 21, 2023, 08:49:23 AMA few years ago, I sold PolkaDot at its own high point after steadily buying it.From now on, I will continue to invest in PolkaDot and Ethereum again, what do you think about the future of these two coins?I will choose ETH, DOT is not bad, but to compare the level of development and profit that both bring, ETH will still be the winner in this race. If talking about altcoins, I will only invest in ETH and BNB, in addition to ADA, DOT, ATOM… I really don't appreciate and don't necessarily invest in too many altcoins, too risky for our portfolio. You should focus mainly on bitcoin instead of choosing altcoins, altcoins can offer bigger returns than bitcoin, but the risk is too high.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rozak",
      "created_time": "January 21, 2023, 09:07:22 AM",
      "body": "both are good because you also benefit from investing in these coins. but maybe for me, it will be more and focus on ETH only. it's not that DOT isn't potential for investment, but I wouldn't hold DOT in the long term. only ETH and Bitcoin I will hold long term. if for trading, maybe I still take it into account if the market conditions support daily trading.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "January 21, 2023, 09:50:29 AM",
      "body": "Quote from: SmokerApeth on January 21, 2023, 08:49:23 AMA few years ago, I sold PolkaDot at its own high point after steadily buying it.From now on, I will continue to invest in PolkaDot and Ethereum again, what do you think about the future of these two coins?For me ethereum has a higher rate of success since most of the users have been used to the eth blockchain. I think there are a lots of difference between eth and dot but since dot has a newer technology, it has some disadvantage over eth since adoption has more seen on eth and we all knew that many have been there for eth since day 1.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "passwordnow",
      "created_time": "January 21, 2023, 09:56:16 AM",
      "body": "Ethereum is already stable as one of the top projects in the crypto market. Even though this is an unpredictable market, we can say that at least for now that it's one of the strongest altcoins that you can have. I also hold ETH and I'm not telling good things just because I also own it. But that's based on the idea that I'm looking at it because it's visible. Very firm and remained in the top 2 for the whole market for a long time and we can't remove that fact. What I just don't like is when it has become a POS. Yeah, that might affect its fundamentals but market-wise, IMO a good option.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TravelMug",
      "created_time": "January 21, 2023, 11:07:02 AM",
      "body": "Quote from: SmokerApeth on January 21, 2023, 08:49:23 AMA few years ago, I sold PolkaDot at its own high point after steadily buying it.From now on, I will continue to invest in PolkaDot and Ethereum again, what do you think about the future of these two coins?Not sure about Polkadot, but Ethereum? since it is the prime mover, then definitely it's worth to invest on it right now, or you should have invested on it like 6 months ago when the price is still cheap, nevertheless it is still below $2k, so a good buy in my opinion.For Polkadot, there are a lot of hype and sure enough, during the last bull run, it has reach ATH at $55.00, now it down to almost -90%.So we will have to see if investors are willing to put their money on Polkadot again or just look for new coins in the next bull run.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GreatArkansas",
      "created_time": "January 21, 2023, 11:37:05 AM",
      "body": "Quote from: SmokerApeth on January 21, 2023, 08:49:23 AMA few years ago, I sold PolkaDot at its own high point after steadily buying it.From now on, I will continue to invest in PolkaDot and Ethereum again, what do you think about the future of these two coins?Seems Polkadot is extremely hammered during the recent bear market we experienced. And additional to that, if you are not yet aware, Gavid Wood (CEO of Parity before) steps down from its CEO position, but he is still part of Parity a blockchain infrastructure company which also focused on Polkadot/Substrate development.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "michellee",
      "created_time": "January 21, 2023, 01:13:34 PM",
      "body": "Quote from: SmokerApeth on January 21, 2023, 08:49:23 AMA few years ago, I sold PolkaDot at its own high point after steadily buying it.From now on, I will continue to invest in PolkaDot and Ethereum again, what do you think about the future of these two coins?It's up to you. But it's a good idea to do your own research on which coin to choose. If I were you, I would still invest in Ethereum but also in PolkaDot because the price is still low. I feel the DOT could go up again, even though I don't know when that will happen.But again, that's just my opinion and you don't have to follow it if you have any doubts. Like my suggestion, you should look for more info about DOT because you already know how potential Ethereum is in the future.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "el kaka22",
      "created_time": "January 21, 2023, 02:31:02 PM",
      "body": "I can't talk about DOT, maybe it will be great and maybe it won't be but at the end of the day it's going to be something special for ETH, because it is getting better. I have always talked about the difference between miners and staking. Miners used to mine ETH and then sell it for cost, and now ETH is staking which means you do not have to sell since there is no cost, in fact there is a reason to buy more.This switch from PoW to PoS will definitely cause it to do a lot better. I am expecting insane amount of rises in ETH price when the bull run happens, the next time a bull run comes along, it will rival Bitcoin itself, there is no doubt about that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pawanjain",
      "created_time": "January 21, 2023, 02:36:10 PM",
      "body": "Quote from: SmokerApeth on January 21, 2023, 08:49:23 AMA few years ago, I sold PolkaDot at its own high point after steadily buying it.From now on, I will continue to invest in PolkaDot and Ethereum again, what do you think about the future of these two coins?Both ETH and DOT are really good coins. Both are established and have good potential.But I would prefer investing in MATIC than DOT. Polygon has been making really nice developments and partnerships lately.I guess it's good to diversify your portfolio and invest some in each of these coins if you are confused.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SmokerApeth",
      "created_time": "January 21, 2023, 02:48:08 PM",
      "body": "Quote from: el kaka22 on January 21, 2023, 02:31:02 PMI can't talk about DOT, maybe it will be great and maybe it won't be but at the end of the day it's going to be something special for ETH, because it is getting better. I have always talked about the difference between miners and staking. Miners used to mine ETH and then sell it for cost, and now ETH is staking which means you do not have to sell since there is no cost, in fact there is a reason to buy more.This switch from PoW to PoS will definitely cause it to do a lot better. I am expecting insane amount of rises in ETH price when the bull run happens, the next time a bull run comes along, it will rival Bitcoin itself, there is no doubt about that.I feel the same way as you do.I think the price of Ethereum is very low right now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o48o",
      "created_time": "January 21, 2023, 09:36:26 PM",
      "body": "Quote from: SmokerApeth on January 21, 2023, 08:49:23 AMA few years ago, I sold PolkaDot at its own high point after steadily buying it.From now on, I will continue to invest in PolkaDot and Ethereum again, what do you think about the future of these two coins?Eth is solid, but can you share your thoughts why Polkadot would be? I personally don't see parachains that interesting that i would want to put any money on speculating the value.ETH on the other hand has the network effect, most talented developers working all sort of stuff in layer 2 solutions. It has lot to give in the future and i can see potential with it way more then most \"eth killers\". And i don't think most people see what kind of mountain they have to climb to be anything like eth is building. The code is a huge beast.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BIT-BENDER",
      "created_time": "January 21, 2023, 09:46:45 PM",
      "body": "I taught Polkadot would be blown away with time, but the coin has been around and holding its ground for a while now. Although the strength of Polkadot has reduced from the energy it started with.Every time I would always choose Ethereum over any other coin because of Its market record and history, and with the bull run coming Ethereum is the most likely Altcoin to feel the positive impact.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "crzy",
      "created_time": "January 21, 2023, 09:47:33 PM",
      "body": "Quote from: SmokerApeth on January 21, 2023, 08:49:23 AMA few years ago, I sold PolkaDot at its own high point after steadily buying it.From now on, I will continue to invest in PolkaDot and Ethereum again, what do you think about the future of these two coins?The bull is coming so buying now can be a good idea also with DOT.Many are preparing now for the next bull run because it can be big and no one can stop it because this is a cycle. ETH is growing and getting better as they slowly solve the issue of their network, while DOT is also making progress. I’ll hold both if possible, but I prefer to hold more ETH than to any altcoins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Baofeng",
      "created_time": "January 21, 2023, 10:18:47 PM",
      "body": "Quote from: BIT-BENDER on January 21, 2023, 09:46:45 PMI taught Polkadot would be blown away with time, but the coin has been around and holding its ground for a while now. Although the strength of Polkadot has reduced from the energy it started with.Every time I would always choose Ethereum over any other coin because of Its market record and history, and with the bull run coming Ethereum is the most likely Altcoin to feel the positive impact.Probably it's the repeat of what we are seeing in 2017-2018 era, wherein there are a lot of good altcoins, even challenging Ethereum. However, in the next bull run, we never heard about it, some of them didn't even went to a new all time high. And this could be the case of DOT though, as we go to the eventual bull run in 2024/2025, maybe those who have enjoyed a good run in 2021 might not replicated their success again, just saying. And this could include DOT and others altcoins.So it's better to stick to Ethereum, as a prime mover, you can never get wrong this this investment.Projections could be in the 5 digits in the next bull run.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Insanity",
      "created_time": "January 22, 2023, 02:16:51 AM",
      "body": "Quote from: pawanjain on January 21, 2023, 02:36:10 PMQuote from: SmokerApeth on January 21, 2023, 08:49:23 AMA few years ago, I sold PolkaDot at its own high point after steadily buying it.From now on, I will continue to invest in PolkaDot and Ethereum again, what do you think about the future of these two coins?Both ETH and DOT are really good coins. Both are established and have good potential.But I would prefer investing in MATIC than DOT. Polygon has been making really nice developments and partnerships lately.I guess it's good to diversify your portfolio and invest some in each of these coins if you are confused.Yes I totally agree with you. I also thought I will invest some of my money in MATIC after I invest in Ethereum but I think maybe someday MATIC will gain popularity like Ethereum. I don't like DOT much because of DOT.  I don't want to make any investment. If I can keep investing in these now, I want to keep investing in the hope that after a few days there will be a lot of profit.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "wxa7115",
      "created_time": "January 22, 2023, 06:22:26 AM",
      "body": "Quote from: SmokerApeth on January 21, 2023, 08:49:23 AMA few years ago, I sold PolkaDot at its own high point after steadily buying it.From now on, I will continue to invest in PolkaDot and Ethereum again, what do you think about the future of these two coins?It is a good strategy but the most important aspect to consider is how you will split your funds when you invest in ETH and DOT.ETH is the most solid out of the two but DOT is the most undervalued, the easiest way to split your capital would be to assign to each one of those coin half of your investment, but I would probably give a greater weight to ETH as it is almost a sure thing it will reach a new ATH during the next bull run, while DOT despite its potential may fail to do so.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "crwth",
      "created_time": "January 22, 2023, 06:29:17 AM",
      "body": "Congratulations on profiting from DOT. Are you thinking you are going to do the same in the future?It would reach a point again that we will have a new ATH, and it would continuously rise in price, and you are going to be at the top and sell again. So if that's what you believe, it would be okay. For the future of the two coins, ETH would still be at the top, but no one will say that DOT cannot compete because it has many great features compared to ETH. It's more scale-able, but if we are going to only look at the parameter at hand, the price of it, DOT would only be able to compete for a short time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cvetik56",
      "created_time": "January 22, 2023, 08:20:22 AM",
      "body": "I'm not sure about DOT, but ETH seems really interesting to me. Vitalik really cares about it. Perhaps updated are not too fast, but they are here, and ETH is the second-biggest coin for a reason.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zasad@",
      "created_time": "January 22, 2023, 11:58:51 AM",
      "body": "A polkadot costs $6 and the price can go up at least 5 times or at best 10 times. Ethereum costs $1,600, with a 5x increase in price, we get a price of $9,000, or a price of $16,000 with a 10x increase in price. Which scenario do you believe in the most? I believe more in the scenario of making money on Polkadot or Kusama.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}