{
  "id": "topic_5432204",
  "title": "Blawpaw",
  "author": "Blawpaw",
  "created_time": "December 28, 2022, 07:30:37 PM",
  "content": "I do not know about you guys, but I gamble because I like it and because it is a hobby as well as an addiction. I'm good with myself, as I already admitted to having an addiction but tried to find and apply techniques to avoid getting off track and spending all of my money on gambling. It's quite easy for me to control my gambling anxiety as I already follow strict rules that help me stay on the line.What about you guys? Do you have any addiction to gambling? What drives you to gamble? Is it the long shot of having a big profit coming in or is gambling simply a way of spending time for you?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5432204",
  "comments": [
    {
      "author": "Oshosondy",
      "created_time": "December 28, 2022, 07:36:54 PM",
      "body": "Gambling should be for fun, but addiction is certain for some gamblers, the best is to just have control over it, just spend the amount of money you can afford to lose on gambling and you will enjoy it. Gambling is good when it is for fun, but bad when you are addicted by either spending too much time and money on it. I will advice you to try as much as possible to not be addicted.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zackgeno96",
      "created_time": "December 28, 2022, 07:41:59 PM",
      "body": "The answer can go many ways. Many people will say that it has to do with the kick and adrenaline. In the end I think the answer is always money related, you want to win money in the end. And what could be better than winning money from home on your computer and in which you also feel the excitement of winning money? It is then winning money and not earning it. Many gamblers consider it work, but you can't lose money in work. However, gambling does. If you spend an evening in a casino, other motives may apply, of course. But you don't gamble online for fun, that's a money issue, in whatever form.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cryptomultiplier",
      "created_time": "December 28, 2022, 07:44:38 PM",
      "body": "If we begin to recount the reasons why most of us do the things we do, many will be guilty of pleasure seeking and idleness.For me, when I get bored mostly after staying in for a long number of hours, if my phone becomes too hot from handling it too much, playing TV games or taking a stroll to hangout with my friends at the place where these live games are played, is an always viable option. While some take gambling as a livelihood, some persons like me do it for fun and would get engrossed in it at the, second or third tryouts. My continuity however depends on if I win sooner than my tryouts expire, my cash becomes exhausted or  some other thing much more interesting tickles my fancy at the moment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "acroman08",
      "created_time": "December 28, 2022, 08:21:42 PM",
      "body": "Quote from: Blawpaw on December 28, 2022, 07:30:37 PMI do not know about you guys, but I gamble because I like it and because it is a hobby as well as an addiction. I'm good with myself, as I already admitted to having an addiction but tried to find and apply techniques to avoid getting off track and spending all of my money on gambling. It's quite easy for me to control my gambling anxiety as I already follow strict rules that help me stay on the line.What about you guys? Do you have any addiction to gambling? What drives you to gamble? Is it the long shot of having a big profit coming in or is gambling simply a way of spending time for you?personally, at this moment? entertainment, a way to unwind. I used to gamble for the sole purpose of earning profit and I admit that I had a problem but that was in the past. right now I have a rule that I follow and so far I have not broken that rule, and I think I am doing great and do not have a gambling problem.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "passwordnow",
      "created_time": "December 28, 2022, 08:26:54 PM",
      "body": "Quote from: Blawpaw on December 28, 2022, 07:30:37 PMI do not know about you guys, but I gamble because I like it and because it is a hobby as well as an addiction. I'm good with myself, as I already admitted to having an addiction but tried to find and apply techniques to avoid getting off track and spending all of my money on gambling. It's quite easy for me to control my gambling anxiety as I already follow strict rules that help me stay on the line.What about you guys? Do you have any addiction to gambling? What drives you to gamble? Is it the long shot of having a big profit coming in or is gambling simply a way of spending time for you?Just like you, it's fun to gamble and turned into a hobby. But this time, it's different from before. I've got a lot of time to gamble before but not anymore these days. I just want to gamble if I want to and I just have fun whenever I'm in stress but mostly, it adds more stress because I'm losing instead of winning but that's part of it. No doubt that I've thought of gambling as a way to make a lot of money but I'm wrong with that principle when I've realized that it's only me that's losing in it but the counterpart of it is having fun.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Odusko",
      "created_time": "December 28, 2022, 08:32:46 PM",
      "body": "Quote from: Oshosondy on December 28, 2022, 07:36:54 PMGambling should be for fun, but addiction is certain for some gamblers, the best is to just have control over it, just spend the amount of money you can afford to lose on gambling and you will enjoy it. Gambling is good when it is for fun, but bad when you are addicted by either spending too much time and money on it. I will advise you to try as much as possible to not be addicted.Those who gamble for fun are also somewhat addicted to gambling one way or the other, but excessive gambling to the point of losing control over one gambling habit is what makes the difference.As a matter of fact, most gamblers, don't gamble for fun any longer there has taken gambling to another level by betting huge amounts there can't afford to lose or put themselves under due rest if there lose.So gambling should be done with some level of control because it can easily get you carried away and before you know it, you will exceed your budget..",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stomachgrowls",
      "created_time": "December 28, 2022, 08:49:29 PM",
      "body": "Quote from: Blawpaw on December 28, 2022, 07:30:37 PMI do not know about you guys, but I gamble because I like it and because it is a hobby as well as an addiction. I'm good with myself, as I already admitted to having an addiction but tried to find and apply techniques to avoid getting off track and spending all of my money on gambling. It's quite easy for me to control my gambling anxiety as I already follow strict rules that help me stay on the line.What about you guys? Do you have any addiction to gambling? What drives you to gamble? Is it the long shot of having a big profit coming in or is gambling simply a way of spending time for you?I do always put up into my mind that gambling is for fun, i dont anticipate nor make myself that expecting too much about winning because this would really drive me on getting desperate which is really something a badbehavior or something not recommendable when you are dealing with this kind of activity.Just play like normal or just act out that this is an activity on relieving out your stress but we cantdeny that losing money is more stressful thing and this is why its important that you should really set out that kind of mindset that gambling is pertaining on losing in the end.This is its important that you should make yourself that realize that winning is just a bonus if ever you are really that lucky enough.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nakamura12",
      "created_time": "December 28, 2022, 08:58:38 PM",
      "body": "I am gambling to waste time when I don't have nothing else to do but if I am busy then I gambled for fun and also rest at the same time before continuing to do what I am doing. I won't forget the amount of money I am willing to lose or to risk. I am just a small time gambler where I am mostly looking for fun and not to earn huge amount of money. After all, house always win and gamblers won't win most of the time. Some people are gambling for a chance to double or triple the amount of money they have but my guess is that it won't be long before that person lose most of the funds or lose all of it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cantsay",
      "created_time": "December 28, 2022, 09:05:04 PM",
      "body": "Quote from: Blawpaw on December 28, 2022, 07:30:37 PMI do not know about you guys, but I gamble because I like it and because it is a hobby as well as an addiction. I'm good with myself, as I already admitted to having an addiction but tried to find and apply techniques to avoid getting off track and spending all of my money on gambling. It's quite easy for me to control my gambling anxiety as I already follow strict rules that help me stay on the line.What about you guys? Do you have any addiction to gambling? What drives you to gamble? Is it the long shot of having a big profit coming in or is gambling simply a way of spending time for you?I don't gamble that much but I do know that most times when I do, I gamble just because I want to entertain myself but I always do it when I'm looking for a way to earn some cash ( but in rare occasions though). The maximum I've ever gambled was ~$50, I know it's small but I do that so as not to get addicted to it and I believe that ones I become addicted to it that fun vibes will no longer be there.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ojima-ojo",
      "created_time": "December 28, 2022, 09:17:42 PM",
      "body": "Quote from: nakamura12 on December 28, 2022, 08:58:38 PMI am gambling to waste time when I don't have nothing else to do but if I am busy then I gambled for fun and also rest at the same time before continuing to do what I am doing. I just started gambling a few weeks back and I must say, j do it just for fun and to help me ease stress. I don't gamble regularly just once in a while, that way I avoid getting used to gambling and I am enjoying myself with it. Most people become gambling addicts because of they quest to make few bulks from gambling and because that intensity they tend to lose and in the attempt to cover up the loss will land them into a situation which they can recover from.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Crypto Library",
      "created_time": "December 28, 2022, 09:21:42 PM",
      "body": "Quote from: Blawpaw on December 28, 2022, 07:30:37 PMWhat about you guys? Do you have any addiction to gambling? What drives you to gamble? Is it the long shot of having a big profit coming in or is gambling simply a way of spending time for you?Generally I am not that kind of gambler. I actually gamble occasionally for entertainment, special tournaments and matches of favorite teams attract me to gamble. But I haven't won any big bet yet, but I have won some small bets and most of them were sports betting . And I think this is how gambling should be played, because there is no guaranteed result, whether it could be for long term or short term. And it must be given only for entertainment Addiction should be eliminated as soon as possible.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fatunad",
      "created_time": "December 28, 2022, 09:31:35 PM",
      "body": "Quote from: Blawpaw on December 28, 2022, 07:30:37 PMI do not know about you guys, but I gamble because I like it and because it is a hobby as well as an addiction. I'm good with myself, as I already admitted to having an addiction but tried to find and apply techniques to avoid getting off track and spending all of my money on gambling. It's quite easy for me to control my gambling anxiety as I already follow strict rules that help me stay on the line.What about you guys? Do you have any addiction to gambling? What drives you to gamble? Is it the long shot of having a big profit coming in or is gambling simply a way of spending time for you?Honestly im not really into a gambling,if ever i do make out some bettings specially on sports then this is particularly just because i do have a knowledge about it which means that i do make out bets occasionallyand not something i do make myself that obliged on doing so.Whenever i do see that it is really that quite entertaining on doing so but if its not then i would just simply skip and wont tend to make out any more. Gambling is something should be for fun but majority of people do end up on getting addicted and become impulsive and in resulting on spending up tons of money with it which is really just a common situation and people should really be avoiding that for it not to happen to theirs.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "goaldigger",
      "created_time": "December 28, 2022, 09:35:05 PM",
      "body": "Quote from: Blawpaw on December 28, 2022, 07:30:37 PMWhat about you guys? Do you have any addiction to gambling? What drives you to gamble? Is it the long shot of having a big profit coming in or is gambling simply a way of spending time for you?Stress in work and sometimes, when I think about making some profit I gamble using some extra money.Gambling seems to be my past time, and I become more active since the pandemic started I’m not that addict though so there’s no strong reason for me to gamble from time to time. I just spend some money in gambling and when my friends invite me to gamble with them, I just go with them if I still have extra money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PX-Z",
      "created_time": "December 28, 2022, 09:36:45 PM",
      "body": "Gambling should only be for entertainment for me, for fun, or maybe to cope with stress and sometimes testing how lucky i am with a small hope to win in every bet lmao. Anything else, it should  be taken for moderation, anything that is too much is not helpful, especially when it becomes an addiction.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitcampaign",
      "created_time": "December 28, 2022, 09:48:50 PM",
      "body": "I gamble just to fill my free time, I'm not really an addict, I prefer soccer betting than playing casinos because besides the benefits it's not as big as playing casinos that rely on luck I also look for safety in gambling, what drives me to gamble is looking for extra money for my needs my life",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coin-investor",
      "created_time": "December 28, 2022, 09:58:12 PM",
      "body": "Quote from: Blawpaw on December 28, 2022, 07:30:37 PMI do not know about you guys, but I gamble because I like it and because it is a hobby as well as an addiction. I'm good with myself, as I already admitted to having an addiction but tried to find and apply techniques to avoid getting off track and spending all of my money on gambling. It's quite easy for me to control my gambling anxiety as I already follow strict rules that help me stay on the line.What about you guys? Do you have any addiction to gambling? What drives you to gamble? Is it the long shot of having a big profit coming in or is gambling simply a way of spending time for you?It has become a habit because of the excitement I'm getting from playing online casinos once you tasted the highs and lows of it you'll get hooked and it will become part of your system, I did manage how to control money spending in casinos which is good the motives is not only to make money if there's an opportunity to make, but more on a habit and excitement, you will not spend time on something that you are not attached to it, and you always looking forward to having time on it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DoublerHunter",
      "created_time": "December 28, 2022, 09:59:07 PM",
      "body": "Quote from: bitcampaign on December 28, 2022, 09:48:50 PMI gamble just to fill my free time, I'm not really an addict, I prefer soccer betting than playing casinos because besides the benefits it's not as big as playing casinos that rely on luck I also look for safety in gambling, what drives me to gamble is looking for extra money for my needs my life^This is why I gamble, to kill time when I am bored and it is a stress reliever for me after the whole day's work. Gambling should be for fun, nothing else, because if you treat gambling as a source of income, making money for your needs, that is not right because your greediness will be triggered, and becomes addicted soon. It would help if you had control of this in yourself in the first place because this is a very important thing to remember. So it means gambling is when you need to spend time while having fun, the last option could be the profit that you can get but this is not a necessary thing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptSafe",
      "created_time": "December 28, 2022, 10:54:09 PM",
      "body": "Quote from: Blawpaw on December 28, 2022, 07:30:37 PMI do not know about you guys, but I gamble because I like it and because it is a hobby as well as an addiction. I'm good with myself, as I already admitted to having an addiction but tried to find and apply techniques to avoid getting off track and spending all of my money on gambling. It's quite easy for me to control my gambling anxiety as I already follow strict rules that help me stay on the line.What about you guys? Do you have any addiction to gambling? What drives you to gamble? Is it the long shot of having a big profit coming in or is gambling simply a way of spending time for you?Gambling is quite interesting though when at the profit making side but I do gambling for fun. You can do a research on this to ascertain how addictive gambling can be to individuals as gambling is the hubby at the moment  now and can be seen going public rather than remaining secrets",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fortunecrypto",
      "created_time": "December 28, 2022, 11:12:03 PM",
      "body": "Quote from: Blawpaw on December 28, 2022, 07:30:37 PMWhat about you guys? Do you have any addiction to gambling? What drives you to gamble? Is it the long shot of having a big profit coming in or is gambling simply a way of spending time for you?Both go together have a good time and try to make money at the same time, you cannot have one without the other, it is hypocrisy if you think that you just want to have fun and don't think of making money or trying to make money only, these two motives always co-exist, and for me, it's better to enjoy playing before thinking of making money than making money a priority then try to enjoy the game, there's always pressure when you prioritize making money first.So always check your priority.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}