{
  "id": "topic_5462601",
  "title": "tech30338",
  "author": "tech30338",
  "created_time": "August 09, 2023, 03:41:48 AM",
  "content": "Dati unionbank lang ang nabalitaan natin na pumapasok na sa crypto, sa katunayan ay naglagay na sila ng bitcoin atm sa makati, along paseo,ilang beses ko narin iyang dinadaanan , tuwing pumapasok ako sa trabaho,Ngaun Bdo naman ang sunod na nagpahiwatig, sa makatuwid, hindi na talaga nila matatakasan ang crypto, na kung saan iniisip nila na kung hindinila ito mapigilan ay pakinabangan nalang nila, pero kalakip nito ay ang panganib naman sa fee's ang tingin ko maari kasi nilang dagdagan ang feehindi naman sa sinisiraan ko ang bdo pero swapang talaga sila, Maganda at masama ang hatid neto sa atin kung saan, mapapadali ang remittance natin, or mga deposit at withdrawal tingin ko pero siguradong gagatasan pa nila tayo sa fee, yan ang nakikita kong masamang epekto neto, sana lang wag nila tayong gatasan ng sobra, kaya okay parin talaga ung transactions na hindi dumadaan sa kanila.https://bitpinas.com/business/bdo-cbdc-digital-dollar-project/",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5462601",
  "comments": [
    {
      "author": "chrisculanag",
      "created_time": "August 09, 2023, 04:59:03 AM",
      "body": "Sa tingin ko mas bababa ang transaction fees dahil magkakaroon ng mga kakompetensya ang bawat banko kaya maganda rin talagang tanggapin na nila ito . Isa pa kung dadami sila mas marami din tayong pagpipilian na napakalaking tulong sa atin lalo na sa mga transaksyon. Malay natin na mas mababa ang transaksyon ni BDO dahil alam naman natin na kailangan nila humatak ng mga customer. Hindi na talaga ako nagulat kung meron na diyan sa Makati ng Bitcoin ATM dahil alam naman natin na ang Makati ang siyang pinakamalaking negosyo at maunlad na teknolohiya . Kaya posible pa na dumami ang babagsakan nila ng ganitong sistema sa paggamit ng Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tech30338",
      "created_time": "August 09, 2023, 08:24:26 AM",
      "body": "Quote from: chrisculanag on August 09, 2023, 04:59:03 AMSa tingin ko mas bababa ang transaction fees dahil magkakaroon ng mga kakompetensya ang bawat banko kaya maganda rin talagang tanggapin na nila ito . Isa pa kung dadami sila mas marami din tayong pagpipilian na napakalaking tulong sa atin lalo na sa mga transaksyon. Malay natin na mas mababa ang transaksyon ni BDO dahil alam naman natin na kailangan nila humatak ng mga customer. Hindi na talaga ako nagulat kung meron na diyan sa Makati ng Bitcoin ATM dahil alam naman natin na ang Makati ang siyang pinakamalaking negosyo at maunlad na teknolohiya . Kaya posible pa na dumami ang babagsakan nila ng ganitong sistema sa paggamit ng Bitcoin.possible na magpababaan sila kung madami sila, pero hindi naman papayag ang mga banks na wala silang kitain, magiging healthy naman ito para sa community, pero ung risk din sa tingin ko dito ay tax, at identity since banks are also selling information, alam niyo ba na benibenta nila ung mga names and contact numbers natin sa mga tumatawag satin like insurance na magtataka ka dahil wala ka nman na inaaplayan.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bhadz",
      "created_time": "August 09, 2023, 11:22:52 AM",
      "body": "Sa akin naman, open tayo sa adoption kahit itong mga bangko na ito. No choice naman na din sila kundi sumabay sa agos katulad ng pagsabay natin. Ang kaso lang mas nauna tayo at mas opinionated tayo kesa sa kanila. Maganda yan para may exposure din ang market thru them. Pero yun nga lang sa BDO gagawa at sila sarili nilang stable coin. Hati yung opinyon ko din diyan, maganda at hindi din maganda. Pero tingnan nalang natin kung hanggang saan dadalhin yan ng pagkakataon.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Johnyz",
      "created_time": "August 09, 2023, 12:55:38 PM",
      "body": "Ok ito if you still have the control over your crypto, pero sa nangyayari before with Unionbank na kung saan if ever na magtransact ka ng Crypto, irerestrict nila ito and I have a friend na pinilit isara ang account nya or else, hinde nya na makukuha ang pera nya since ang source is with crypto at maraming nagpopost ng kagaya nito online.I'm not against to this pero sana wag maging centralized masyado and magkaroon paren tayo ng freedom since ito naman talaga ang purpose ni crypto.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bettercrypto",
      "created_time": "August 09, 2023, 02:07:19 PM",
      "body": "Quote from: tech30338 on August 09, 2023, 03:41:48 AMDati unionbank lang ang nabalitaan natin na pumapasok na sa crypto, sa katunayan ay naglagay na sila ng bitcoin atm sa makati, along paseo,ilang beses ko narin iyang dinadaanan , tuwing pumapasok ako sa trabaho,Ngaun Bdo naman ang sunod na nagpahiwatig, sa makatuwid, hindi na talaga nila matatakasan ang crypto, na kung saan iniisip nila na kung hindinila ito mapigilan ay pakinabangan nalang nila, pero kalakip nito ay ang panganib naman sa fee's ang tingin ko maari kasi nilang dagdagan ang feehindi naman sa sinisiraan ko ang bdo pero swapang talaga sila, Maganda at masama ang hatid neto sa atin kung saan, mapapadali ang remittance natin, or mga deposit at withdrawal tingin ko pero siguradong gagatasan pa nila tayo sa fee, yan ang nakikita kong masamang epekto neto, sana lang wag nila tayong gatasan ng sobra, kaya okay parin talaga ung transactions na hindi dumadaan sa kanila.https://bitpinas.com/business/bdo-cbdc-digital-dollar-project/Yung sa makati matagal na yan, pero konti lang ang nakakagamit nyan dyan, siyempre konti lang naman ang crypto fanatic sa lugar na yan. Tapos sa unionbank naman ay yung latest na update ko dyan ay parang humigpit na sila ngayon kahit pagdating sa crypto, tanungin nio mga users ng unionbank na related sa crypto.Saka expected ko narin yan na darating talaga ang oras na gustuhin man nila o hindi at no choice sila to ride the trend. Kahit gaano pa katigas yung iba bibigay din yang mga yan dahil for sure mapagiiwanan sila sa huli.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "chrisculanag",
      "created_time": "August 09, 2023, 04:20:17 PM",
      "body": "Quote from: tech30338 on August 09, 2023, 08:24:26 AMQuote from: chrisculanag on August 09, 2023, 04:59:03 AMSa tingin ko mas bababa ang transaction fees dahil magkakaroon ng mga kakompetensya ang bawat banko kaya maganda rin talagang tanggapin na nila ito . Isa pa kung dadami sila mas marami din tayong pagpipilian na napakalaking tulong sa atin lalo na sa mga transaksyon. Malay natin na mas mababa ang transaksyon ni BDO dahil alam naman natin na kailangan nila humatak ng mga customer. Hindi na talaga ako nagulat kung meron na diyan sa Makati ng Bitcoin ATM dahil alam naman natin na ang Makati ang siyang pinakamalaking negosyo at maunlad na teknolohiya . Kaya posible pa na dumami ang babagsakan nila ng ganitong sistema sa paggamit ng Bitcoin.possible na magpababaan sila kung madami sila, pero hindi naman papayag ang mga banks na wala silang kitain, magiging healthy naman ito para sa community, pero ung risk din sa tingin ko dito ay tax, at identity since banks are also selling information, alam niyo ba na benibenta nila ung mga names and contact numbers natin sa mga tumatawag satin like insurance na magtataka ka dahil wala ka nman na inaaplayan.Sigurado may ganitong mangyayari dahil mas gugustuhin nilang makakuha ng maraming customer kahit na maliit lang na kita. Yes , healthy nga pero maraming maaaring mangyari na baka magkaroon na talaga ng buwis para sa gumagamit nito. Matagal na ang ganyang sistema sa banks , pinakinabangan na nila tayo syempre lulubus-lubusin na nila ito.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Eternad",
      "created_time": "August 09, 2023, 04:24:57 PM",
      "body": "Quote from: tech30338 on August 09, 2023, 03:41:48 AMhttps://bitpinas.com/business/bdo-cbdc-digital-dollar-project/As per the article, CBDC ang pinaplano ng BDO na iimplement at hindi crypto currency. Ang CBDC ay digital dollar na nagpapanggap na gumagamit ng blockchain pero centralized ito. Nakikihype lang ang mga banks sa cryptocurrency sa pamamagitan ng paggamit nila ng centralized blockchain nila pero in reality isa lang din itong digital fiat.Akala ko talaga ay papasok na ang BDO pero duda talaga ako dito dahil kahit Unionbank nga ay hindi pa dn fully committed sa cryptocurrency dahil nga wala pa dn silang debit cards para sa mga crypto users.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "chrisculanag",
      "created_time": "August 09, 2023, 11:35:24 PM",
      "body": "Quote from: Eternad on August 09, 2023, 04:24:57 PMQuote from: tech30338 on August 09, 2023, 03:41:48 AMhttps://bitpinas.com/business/bdo-cbdc-digital-dollar-project/As per the article, CBDC ang pinaplano ng BDO na iimplement at hindi crypto currency. Ang CBDC ay digital dollar na nagpapanggap na gumagamit ng blockchain pero centralized ito. Nakikihype lang ang mga banks sa cryptocurrency sa pamamagitan ng paggamit nila ng centralized blockchain nila pero in reality isa lang din itong digital fiat.Akala ko talaga ay papasok na ang BDO pero duda talaga ako dito dahil kahit Unionbank nga ay hindi pa dn fully committed sa cryptocurrency dahil nga wala pa dn silang debit cards para sa mga crypto users.Parang USDT, USDC at marami pang nakabase lang sa presyo ng dolyar. Pero kung pwede naman natin sila magamit pangpurchase sa cryptocurrencies ay may maganda rin siyang naitulong. Yun nga lang centralized ito at kayang kaya nilang hawakan at gatasan ang nga gumagamit nito.Sa ngayon hindi pa sila full support sa crypto at minimal lang yung pagtanggap ni UB. Malay natin magkaroon na ng debit cards if magkaroon ba may maganda kayang maitutulong ito sa mga crypto users.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "peter0425",
      "created_time": "August 10, 2023, 04:59:10 AM",
      "body": "Quote from: tech30338 on August 09, 2023, 03:41:48 AMDati unionbank lang ang nabalitaan natin na pumapasok na sa crypto, sa katunayan ay naglagay na sila ng bitcoin atm sa makati, along paseo,ilang beses ko narin iyang dinadaanan , tuwing pumapasok ako sa trabaho,Ngaun Bdo naman ang sunod na nagpahiwatig, sa makatuwid, hindi na talaga nila matatakasan ang crypto, na kung saan iniisip nila na kung hindinila ito mapigilan ay pakinabangan nalang nila, pero kalakip nito ay ang panganib naman sa fee's ang tingin ko maari kasi nilang dagdagan ang feehindi naman sa sinisiraan ko ang bdo pero swapang talaga sila, Maganda at masama ang hatid neto sa atin kung saan, mapapadali ang remittance natin, or mga deposit at withdrawal tingin ko pero siguradong gagatasan pa nila tayo sa fee, yan ang nakikita kong masamang epekto neto, sana lang wag nila tayong gatasan ng sobra, kaya okay parin talaga ung transactions na hindi dumadaan sa kanila.https://bitpinas.com/business/bdo-cbdc-digital-dollar-project/wala naman problema kung maningil sila ng mas mataas , dahil sa nangyayari now na tumataas na ang competition at tyak sa susunod na mga panahon mas marami na silang tatanggap ng crypto.yeah sang ayon ako sa BDO na talaga gahaman ., dati ko ding bangko yan kaya alam ko service nia.lalo na ngayong wala na yong matanda at mga anak na ang humahawak ng negosyo, masyado naging mas gahaman.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blockman",
      "created_time": "August 10, 2023, 02:50:32 PM",
      "body": "Kung iisipin natin parang magiging useless lang yan. May online transfer naman na sila at PHP at dollar din pero parang pang ride lang talaga ito ng hype. Cashless naman na din mga transactions nila at adopted na. Di ko lang magets itong mga banks na ito pati sa abroad na magi-implement ng CBDC, para masabi lang na may crypto silang inadopt? Pero yung crypto na yun, controlled nila at sila din magi-issue ng supply at sila din ang nagpi-print.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Reatim",
      "created_time": "August 11, 2023, 10:32:32 AM",
      "body": "Quote from: blockman on August 10, 2023, 02:50:32 PMKung iisipin natin parang magiging useless lang yan. May online transfer naman na sila at PHP at dollar din pero parang pang ride lang talaga ito ng hype. Cashless naman na din mga transactions nila at adopted na. Di ko lang magets itong mga banks na ito pati sa abroad na magi-implement ng CBDC, para masabi lang na may crypto silang inadopt? Pero yung crypto na yun, controlled nila at sila din magi-issue ng supply at sila din ang nagpi-print.iba pa din kasi ang rekta sa physical withdrawal kabayan , and also panong magiging useless eh sa US nga marami pa din ang mga bitcoin ATM lalo na sa mga casinos, meaning may functions pa din sila talaga.pero tama ka , sa banking system natin now na sobrang mapagsamantala? nakakawalang gana ang makipag transact sa kanila ,since may mga exchange naman at andyan ang Binance or even coins.ph .",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blockman",
      "created_time": "August 11, 2023, 04:34:31 PM",
      "body": "Quote from: Reatim on August 11, 2023, 10:32:32 AMQuote from: blockman on August 10, 2023, 02:50:32 PMKung iisipin natin parang magiging useless lang yan. May online transfer naman na sila at PHP at dollar din pero parang pang ride lang talaga ito ng hype. Cashless naman na din mga transactions nila at adopted na. Di ko lang magets itong mga banks na ito pati sa abroad na magi-implement ng CBDC, para masabi lang na may crypto silang inadopt? Pero yung crypto na yun, controlled nila at sila din magi-issue ng supply at sila din ang nagpi-print.iba pa din kasi ang rekta sa physical withdrawal kabayan , and also panong magiging useless eh sa US nga marami pa din ang mga bitcoin ATM lalo na sa mga casinos, meaning may functions pa din sila talaga.Sinabi ko parang useless katulad ng sabi mo iba pa din ang rekta sa physical na withdrawal. Dahil meron na sila niyan at itong CBDC, hindi naman rekta yan at online parang mga altcoins/bitcoin lang din. At kung tutuusin may online banking na sila kaya yun ang sinasabi kong useless na siya. Marami ngang bitcoin ATM sa US ang tanong, doon ba nakabase ang BDO? Hindi. At hindi naman Bitcoin ang ia-adopt nila kundi sarili nilang CBDC.Quote from: Reatim on August 11, 2023, 10:32:32 AMpero tama ka , sa banking system natin now na sobrang mapagsamantala? nakakawalang gana ang makipag transact sa kanila ,since may mga exchange naman at andyan ang Binance or even coins.ph .Tama ka, may mga banks na mapagsamantala at hindi natin alam kung paano yan gagawin ng bangko tulad ng BDO. May mga friendly sa crypto at meron ding hindi, kahit na sabihing magkaroon sila ng CBDC, hindi pa rin naman lahat ng staff nila aware sa crypto at parang masabi lang din na nasa crypto sila, yung CBDC nila centralized panigurado.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitcoinPanther",
      "created_time": "August 11, 2023, 08:15:28 PM",
      "body": "QuoteNgaun Bdo naman ang sunod na nagpahiwatig, sa makatuwid, hindi na talaga nila matatakasan ang crypto, na kung saan iniisip nila na kung hindinila ito mapigilan ay pakinabangan nalang nila, pero kalakip nito ay ang panganib naman sa fee's ang tingin ko maari kasi nilang dagdagan ang feehindi naman sa sinisiraan ko ang bdo pero swapang talaga sila, Naalala ko pa dati and stance ng BDO sa cryptocurrency transaction dati ay napakanegatibo.  May mga cases pa nga silang sinusupinde ang account ng mga suspected  crypto users at inalis pa nila ang service of fund transfers sa coins.ph (kung hindi ako nagkakamali).  Mukhang nagising na ang BDO at nakita nila na sila lang ang nawawalan kapag hindi nila inadopt and cryptocurrency.QuoteMaganda at masama ang hatid neto sa atin kung saan, mapapadali ang remittance natin, or mga deposit at withdrawal tingin ko pero siguradong gagatasan pa nila tayo sa fee, yan ang nakikita kong masamang epekto neto, sana lang wag nila tayong gatasan ng sobra, kaya okay parin talaga ung transactions na hindi dumadaan sa kanila.https://bitpinas.com/business/bdo-cbdc-digital-dollar-project/Sa akin tumitingin ako sa maganda epekto nito, dahil nga nagkaroon ng positive change of heart ang ilang mga bank towards Bitcoin, maaring gamitin itong isang proof sa mga taon nagdadalawang isip pa rin sa legality ni Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rhomelmabini",
      "created_time": "August 11, 2023, 09:58:48 PM",
      "body": "I think yung impact na dala ng BlackRock ang isa sa mga dahilan kung bakit ang mga bangkong ito ay gusto ng magkaroon ng CBDCs o pumasok sa crypto. Kilala naman natin ang BlackRock at Larry Fink na isang kritiko noon pero ngayon ay pumabor na siya sa crypto, sa tingin ko talaga ito ay isa sa mga dahilan. Sana hindi lang pang hype ito or dahil sa paparating na bull market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PX-Z",
      "created_time": "August 11, 2023, 10:50:45 PM",
      "body": "Wala namang pinagkaiba ang CBDC na gusto nilang i-implement sa usual stablecoin at usual wallet na ginagamit natin like Gcash, Maya, Coins etc. when it comes to transfering money, makapag sabi lang na blockchain-powered yung technology nila at makasabay sa trend, ang panget naman ng bank service nila lalo na mobile app ng BDO.Sa transfer Gcash at Maya ay almost instant yun, at cross-border na din. Di mo need mag send through/from Western union kase mahal talaga fees diyan, dami ding ways para makapag cashin ka sa gcash from other countries, may Coins.ph na din tapus send ka papunta dito or vice-versa. Worst pa since blockchain is public makikita details ng transfer mo, pero depende yan if public or private ledger gagamitin nila. At isa pa limited lang yan sa BDO users lang yan. If ang BSP ang mag issue ng CBDC at i-require na lahat ng banks na i-accept yun, yun ang mas maganda. Pero since may instapay na which you can transfer local banks to other banks is parang di ko need na ang ganyang features, since controlled din naman nila. Mas magiging advantage lang ang CBDC sa government side not to users for privacy-wise, business-wise possible na malulugi ang mga banks.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Asuspawer09",
      "created_time": "August 11, 2023, 11:35:49 PM",
      "body": "Quote from: tech30338 on August 09, 2023, 03:41:48 AMDati unionbank lang ang nabalitaan natin na pumapasok na sa crypto, sa katunayan ay naglagay na sila ng bitcoin atm sa makati, along paseo,ilang beses ko narin iyang dinadaanan , tuwing pumapasok ako sa trabaho,Ngaun Bdo naman ang sunod na nagpahiwatig, sa makatuwid, hindi na talaga nila matatakasan ang crypto, na kung saan iniisip nila na kung hindinila ito mapigilan ay pakinabangan nalang nila, pero kalakip nito ay ang panganib naman sa fee's ang tingin ko maari kasi nilang dagdagan ang feehindi naman sa sinisiraan ko ang bdo pero swapang talaga sila, Maganda at masama ang hatid neto sa atin kung saan, mapapadali ang remittance natin, or mga deposit at withdrawal tingin ko pero siguradong gagatasan pa nila tayo sa fee, yan ang nakikita kong masamang epekto neto, sana lang wag nila tayong gatasan ng sobra, kaya okay parin talaga ung transactions na hindi dumadaan sa kanila.https://bitpinas.com/business/bdo-cbdc-digital-dollar-project/Suportado dati ng Unionbank ang cryptocurrency pero hindi naman nila pinapasok sa platform nila di tulad ng Maya at gcash, ngayon medjo may mga nababasa akong article na parang ayaw na ng Unionbank sa crypto.Kumpara sa mga nakaraang taon sa cryptocurrency ay talagang sobrang taas na ng adaptasyon ng cryptocurrency at bitcoin sa mga bansa na kahit mga banko dito sa Pilipinas ay pinipili na rin na ipasok ang cryptocurrency sa kanilang mga platform, siguro ay dahil naging discusyon na rin dati na ang cryptocurrency ang papatay sa mga banko dahil na rin magagawa netong malabanan ang inflation, kaya masmakakabuti na rin para sa kanila kung sa platform nila maagkakaroon ng cryptocurrency or something like na tulad ng isang exchange dahil sa ganung paraan ay makakakuha sila ng marami pang user sa platform at lalaki ang pera na kaninang mahahawakan kung idadag pa ang mga cryptocurrency user.Sa Ngayon pati maya at gcash ay pumasok na rin mahihirapan talalga sila kung lalabanan lang nila ang cryptocurrency, if you can't defeat them join them yan siguro ang moto nila  . Dahil na rin dito ay maraming mga user ang madali ng magkakaroon ng access sa cryptocurrency malaki ang tulong neto sa adaptasyon ng cryptocurrency kaya sa susunod na Bullrun ay siguradong malaki ang iaangat ng all time high.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "abel1337",
      "created_time": "August 11, 2023, 11:41:39 PM",
      "body": "Quote from: tech30338 on August 09, 2023, 03:41:48 AMDati unionbank lang ang nabalitaan natin na pumapasok na sa crypto, sa katunayan ay naglagay na sila ng bitcoin atm sa makati, along paseo,ilang beses ko narin iyang dinadaanan , tuwing pumapasok ako sa trabaho,Ngaun Bdo naman ang sunod na nagpahiwatig, sa makatuwid, hindi na talaga nila matatakasan ang crypto, na kung saan iniisip nila na kung hindinila ito mapigilan ay pakinabangan nalang nila, pero kalakip nito ay ang panganib naman sa fee's ang tingin ko maari kasi nilang dagdagan ang feehindi naman sa sinisiraan ko ang bdo pero swapang talaga sila, Maganda at masama ang hatid neto sa atin kung saan, mapapadali ang remittance natin, or mga deposit at withdrawal tingin ko pero siguradong gagatasan pa nila tayo sa fee, yan ang nakikita kong masamang epekto neto, sana lang wag nila tayong gatasan ng sobra, kaya okay parin talaga ung transactions na hindi dumadaan sa kanila.https://bitpinas.com/business/bdo-cbdc-digital-dollar-project/Grabe yung issue ko with BDO before dahil sa cryptocurrency funds ko at finorce close ko nalang yung account ko para mailabas ko sakanila yung pera ko. Sobrang judgemental nila sa crypto at for me, yung kikitain lang talaga yung gusto nila kaya nila cinonsider ang crypto at hindi yung real adoptation. Traumatize ako sa BDO na never ko ma cinonsider ulit na mag bukas ng account sakanila, I'll stick with unionbank and other e-wallets since wala pa naman ako na eexperience na kagaya ng na experience ko sa BDO before.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cling18",
      "created_time": "August 13, 2023, 08:09:01 PM",
      "body": "Quote from: abel1337 on August 11, 2023, 11:41:39 PMQuote from: tech30338 on August 09, 2023, 03:41:48 AMDati unionbank lang ang nabalitaan natin na pumapasok na sa crypto, sa katunayan ay naglagay na sila ng bitcoin atm sa makati, along paseo,ilang beses ko narin iyang dinadaanan , tuwing pumapasok ako sa trabaho,Ngaun Bdo naman ang sunod na nagpahiwatig, sa makatuwid, hindi na talaga nila matatakasan ang crypto, na kung saan iniisip nila na kung hindinila ito mapigilan ay pakinabangan nalang nila, pero kalakip nito ay ang panganib naman sa fee's ang tingin ko maari kasi nilang dagdagan ang feehindi naman sa sinisiraan ko ang bdo pero swapang talaga sila, Maganda at masama ang hatid neto sa atin kung saan, mapapadali ang remittance natin, or mga deposit at withdrawal tingin ko pero siguradong gagatasan pa nila tayo sa fee, yan ang nakikita kong masamang epekto neto, sana lang wag nila tayong gatasan ng sobra, kaya okay parin talaga ung transactions na hindi dumadaan sa kanila.https://bitpinas.com/business/bdo-cbdc-digital-dollar-project/Grabe yung issue ko with BDO before dahil sa cryptocurrency funds ko at finorce close ko nalang yung account ko para mailabas ko sakanila yung pera ko. Sobrang judgemental nila sa crypto at for me, yung kikitain lang talaga yung gusto nila kaya nila cinonsider ang crypto at hindi yung real adoptation. Traumatize ako sa BDO na never ko ma cinonsider ulit na mag bukas ng account sakanila, I'll stick with unionbank and other e-wallets since wala pa naman ako na eexperience na kagaya ng na experience ko sa BDO before.Nakaexperience din ng ganito ang kaibigan ko at talaga namang nagcause ng hassle at trauma sa kanya lalo na at sa questions at verification ng BDO ay halos idiscriminate ka pa. Ang hirap nilang paliwanagan kahit pa iprovide mo yung mga documents na hinahanap nila. Mabuti na lang at nagexist na ang mga E-wallets ngayon at malaya na tayong nkakapagtransact galing crypto platforms dahil kung dadaan pa ito sa mga banko, malamang maiipit at mahohold lang lagi ang funds natin at malaking abala ito sa marami sa atin. Sa palagay ko, dahil alam ng mga banko na malaki ang kikitain nila since marami na ang crypto users sa bansa kaya nila tinatanggap ang crypto ngayon and yes, hindi nga sya genuine adoption dahil business pa rin ito at opportunity to earn para sa kanila.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}