{
  "id": "topic_5461841",
  "title": "bonfire66",
  "author": "bonfire66",
  "created_time": "August 02, 2023, 03:13:20 PM",
  "content": "Кто-нибудь тут может точно объяснить, в какой момент, в какой конкретный день Россия начала воевать с НАТО?  А то вот тут пропагандисты в один определенный момент получили сверху методичку, и начали вещать, что СВО идет все же «Не совсем по-плану», потому что в СВО включилась НАТО, которая помогает Украине. В какой момент это произошло? Можно назвать точную дату? Или «слабо»?   Дело в том, что в т.н. Истории ни одно событие обычно не бывает, и не происходит «просто так». Сначала есть предпосылка, потом действие (то есть, событие). И все эти данные, рано или поздно становятся известными народу (или хотя бы историкам). Например, никто не оспаривает тот факт, что 22.06.1941 года Германия напала на СССР. А вот почему она сделала это именно в этот день? А не 22.05.1941? Или на месяц позже, например 22.07.1941? А в какой момент Гитлер отдал приказ начать разрабатывать план нападения на СССР (Барбаросса) и почему? Эта дата (начала разработки Гитлером плана нападения на СССР) тоже давным-давно известна. И почему это случилось именно тогда. Гуглите или спрашиваете тут.    Почему РФ напала на Украину именно 24.02.2022? Почему именно в этот день, а не месяцем ранее или месяцем позднее? Какие события предшествовали этому событию?  В какой момент НАТО вступила в СВО против России, вступило ли или нет, а если «да», то почему? Какие есть доказательства этому на данный момент? Документы? Файлы? Видео? Свидетельства очевидцев? Да, есть четкие доказательства, что, например, американские граждане воюют на стороне Украины. Но есть и такие же доказательства, что африканские граждане воюют на стороне РФ. Значит, Украина воюет не с Россией, а с Африкой? Так получается по этой же логике? СВО, по сути, это есть война НАТО с Африкой? Так?       Это все еще цветочки. Сейчас я расскажу вам про более прикольные моменты несоответствия реальности и действительности. Скажите мне пожалуйста, ваши дети уже успели купить себе недвигу в странах НАТО? Да или нет? И почему7 И зачем? Увы, вопросов больше, чем ответов. А вот дети олигархов или правителей России уже давно живут (или хотя бы) имеют гражданство в странах НАТО. Во избежание недопонимании сразу же поясню, что у меня лично все хорошо. Я все предусмотрел И купил то что надо и там где надо. А вот если вы, уважаемые оппоненты, этого не предусмотрели, то в ошибках нужно винить прежде всего самих себя. Что вы, и именно вы недостаточно работали и старались, чтобы обеспечить ВАШИМ детям (а не детям Путина или Пескова) жительство в странах НАТО.         То есть, если вы, уважаемые читатели данного поста, до сих пор еще не купили себе квартиры во враждебных странах НАТО, то винить в этом нужно только лично самих себя. А не всяких там Путиных или Песковых. И именно поэтому, никакой войны между РФ и НАТО нет, не было и быть не может! Потому что не будет же Путин бомбить свои же (или Пескова) дворцы и виллы в странах Запада. Ведь так ведь? Логично?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5461841",
  "comments": [
    {
      "author": "russianmother",
      "created_time": "November 15, 2023, 09:46:14 AM",
      "body": "Пропагандисты вшивые лицемеры, кричат про зло на западе, хотя у самих там дети учатся и они ездят туда отдыхать, но не об этом. Вата схавает! НАТО даже сотой мощи не переправила Украине, авианосцев нет, авиации нет, контингента нет и так далее. Опять пропагандисты кремля обделались, но опять таки, поцреоты и zомби схавают",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "malaker",
      "created_time": "November 16, 2023, 09:44:10 AM",
      "body": "НАТО еще не начинало",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Snork1979",
      "created_time": "November 16, 2023, 10:55:51 AM",
      "body": "Quote from: malaker on November 16, 2023, 09:44:10 AMНАТО еще не начинало  А Украина при этом уже почти «закончилась».И правда, смешно получается",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "natotech",
      "created_time": "November 20, 2023, 09:34:46 AM",
      "body": "Почему закончилась?) Большая часть территорий при ней, добровольцев хватает. А то, что говорят о нехватке людей - пропаганда России.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "herzen888",
      "created_time": "November 20, 2023, 09:46:44 AM",
      "body": "Не парни, войну НАТО с РФ нельзя допустить, это же карачун всем. Лучше худой мир, чем хорошая война. Давайте за мир.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PatriotMira",
      "created_time": "November 20, 2023, 05:10:41 PM",
      "body": "Наши президенты не на столько плохи, чтобы разразить ад на земле.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Snork1979",
      "created_time": "November 20, 2023, 06:11:14 PM",
      "body": "Quote from: natotech on November 20, 2023, 09:34:46 AMПочему закончилась?)А вот хер его знает, почему она закончилась.По бравурным сообщениям укро-сми, ВСУки успешно наступают на всех направлениях уж больше 5 месяцев. И Крым был ими захвачен вроде как ещё в прошлом году.Но ... видимо, что-то у них пошло \"не так\" Quote from: PatriotMira on November 20, 2023, 05:10:41 PMНаши президенты не на столько плохи, чтобы разразить ад на земле. Ты про президента РФ Путина и президента Всея Украины Байдена?С первым - согласен (хоть лично мне это и неприятно признавать в отношении Путина).А вот насчёт старого маразматика Байдена я испытываю сильные сомнения, знаешь ли ...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "discusstor",
      "created_time": "December 06, 2023, 10:44:30 AM",
      "body": "НАТО при желании размотает Россию и без ЯО. Россия чем сильна - только кол-вом народа, мясом и не более. Еще фактор, что никому (кроме путлера) воевать не хочется.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Snork1979",
      "created_time": "December 06, 2023, 05:40:12 PM",
      "body": "Quote from: discusstor on December 06, 2023, 10:44:30 AMНАТО при желании размотает Россию и без ЯО.Так ведь и Украина \"размотает\" Россию, если дать им 17 млн. снарядов (которых во всём мире нету), тыщу F-16 и всё остальное вооружение НАТО.И даже Зимбабве или Сомали \"размотают\" при желании весь мир, если отдать им все ядерные боеголовки, самолёты, танки и прочее вооружение мира.В этом ни у кого даже сомнений нет никаких! А ты чего сказать то хотел?В чём твоя \"мысль\" была то? (ну, если она у тебя была, конечно, хоть какая-то ...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bageengineering",
      "created_time": "December 11, 2023, 09:54:52 AM",
      "body": "Медведев тут на днях принял и заявил, что конфликт НАТО и РФ очень близок. Кто-нибудь, отберите у него бутыль)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "herzen888",
      "created_time": "December 11, 2023, 10:39:16 AM",
      "body": "Quote from: bageengineering on December 11, 2023, 09:54:52 AMМедведев тут на днях принял и заявил, что конфликт НАТО и РФ очень близок. Кто-нибудь, отберите у него бутыль)Такие вот дятлы и ведут нашу страну в яму. Его выгнать давно пора из кремля, засела эта ОПГ крепко.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DerAlte",
      "created_time": "December 12, 2023, 11:14:47 AM",
      "body": "Даже деды президенты понимают, что конфликт НАТО и РФ не нужны, потому-что и Китай войдет и Индия и так далее.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "takewhatyouneed",
      "created_time": "December 17, 2023, 12:29:41 PM",
      "body": "Путин вот сказал, что интересов нет воевать ему. Не знаю, то что он говорит - можно зеркально развернуть.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nakitalk",
      "created_time": "December 19, 2023, 04:32:10 PM",
      "body": "НАТО это сила на самом деле, в этом альянсе и техники и народа и технологий больше чем в РФ. Китай воевать не будет и это точно, невыгодно.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AgrarniyyChel",
      "created_time": "December 21, 2023, 12:26:57 PM",
      "body": "Глупо рассуждать о столкновении, которого еще не было. Но если уж начали, то думаю, что Россия вряд ли что-то сможет против показать против реальной современной армии стран НАТО. Из личного опыта службы в армии могу сказать, что бардак был и есть в русской армии, начиная от контрактников быдловатых, заканчивая старыми глупыми пропитыми генералами.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Woyzeck",
      "created_time": "December 25, 2023, 11:52:59 AM",
      "body": "НАТО это серьезный противник, я думаю просто напросто из России будет бегство мужчин, потому-что не за что воевать во-первых (за интересы кремля? Нет, спасибо), во-вторых идти против НАТО это самоубийство, скорее всего спустя какое-то время, шойгу и его диванные генералы ахуеют и будут искать политический выход из ситуации. Ядерки не будет однозначно.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "The0ldl_lser",
      "created_time": "December 25, 2023, 02:48:08 PM",
      "body": "Quote from: Woyzeck on December 25, 2023, 11:52:59 AMНАТО это серьезный противник, я думаю просто напросто из России будет бегство мужчин, потому-что не за что воевать во-первых (за интересы кремля? Нет, спасибо), во-вторых идти против НАТО это самоубийство, скорее всего спустя какое-то время, шойгу и его диванные генералы ахуеют и будут искать политический выход из ситуации. Ядерки не будет однозначно.+Ядерки вообще в природе не существует - это кинематографическая мистификация эпохи телевизора. Ну, типа как полёт на Луну   ага, где Луна, а где Земля - за 363 тысячи километров. Как вы вообще представляете что человек в 1969 году прилетел на Луну, ручкой помахал, сфоткался, и обратно улетел, ага   Ну вам самим не смешно? Тогда транзисторы-то только что изобрели! Также и с ядеркой. Для того чтобы даже теоретически (это если вообще теоретики правы) инициировать цепную реакцию деления ядра с высвобождением энергии - нужно сначала приложить немыслимую силу, которая недостижима в простой химической реакции из набора элементов таблицы Менделеева на планете земля.  Иначе бы многие из тысяч звёзд самопроизвольно повзрывались бы, а мы бы это в телескоп наблюдали.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Snork1979",
      "created_time": "December 25, 2023, 04:23:24 PM",
      "body": "Quote from: The0ldl_lser on December 25, 2023, 02:48:08 PMДля того чтобы даже теоретически (это если вообще теоретики правы) инициировать цепную реакцию деления ядра с высвобождением энергии - нужно сначала приложить немыслимую силу, которая недостижима в простой химической реакции из набора элементов таблицы Менделеева на планете земля.Силёнок одного балбеса-неуча, вроде тебя, вполне хватит, чтобы взять в каждую руку по половинке плутониевого шарика (всего по 6 кг каждая) и свести их вместе.И получить новую Хиросиму с эпицентром в виде Хорька Quote from: The0ldl_lser on December 25, 2023, 02:48:08 PMИначе бы многие из тысяч звёзд самопроизвольно повзрывались бы, а мы бы это в телескоп наблюдали.В звёздах энергия идёт от термоядерного синтеза, а не цепной реакция деления ядер, двоешник ты недоделанный.Погугли чем они отличаются, раз уж гуглом недавно пользоваться научился ))(но меня очень радует, что ты хотя бы знаешь, что такое \"телескоп\"",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "The0ldl_lser",
      "created_time": "December 25, 2023, 04:39:55 PM",
      "body": "Quote from: Snork1979 on December 25, 2023, 04:23:24 PMСилёнок одного балбеса-неуча, вроде тебя, вполне хватит, чтобы взять в каждую руку по половинке плутониевого шарика (всего по 6 кг каждая) и свести их вместе.И получить новую Хиросиму с эпицентром в виде Хорька Я даже знаю в каком совковом учебнике ты это вычитал, у меня такой есть   (фоткать не буду)Да и в другой более научной литературе сказано, что для инициации реакции нужно в центре разместить критическую массу заряда (она некритическая в земных условиях), в форме сферы, заключить ее в прочную сферу большего диаметра, обложить максимально бризантной взрывчаткой, и синхронно со всех сторон второй сферы инициировать заряд. Цель - достичь в моменте плотности и температуры для инициации ядерной реакции. (Достигнуть критической массы). Что согласись, выглядит более убедительно. Но все равно фантастически - ну нет на Земле таких источников энергии, даже среди самых бризантных ВВ И уж от количества килограммов это точно не зависит. Ищи интервью российского физика-ядерщика, который рассказывал что \"можно было бы сделать хоть ядерную пулю. Вопрос в целесообразности\" (ну, он вашей мистификации подыгрывал просто)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}