{
  "id": "topic_5444842",
  "title": "SeeBiscuit",
  "author": "SeeBiscuit",
  "created_time": "March 14, 2023, 10:14:14 AMLast edit: May 08, 2024, 08:48:19 AM by SeeBiscuit",
  "content": "",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5444842",
  "comments": [
    {
      "author": "Cantsay",
      "created_time": "March 14, 2023, 10:30:11 AM",
      "body": "When I newly came to this forum I searched for ways to see how my post will look before I eventually post it, and I tried creating a thread in the \"archival\" section but my rank was too low as it need at least jr member.  And I got several suggestions from forum members to use the \"preview\" button. Op,  this is a great tool but I'd stick with my preview button or work with a thread at the archival section if the need ever arrives. Edit: I just checked and it does almost the same thing as the preview button (if not the same) another advantage the preview button has is that it saves your post in the draft in case you accidentally delete your post.  they both have drafts.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nheer",
      "created_time": "March 14, 2023, 02:54:13 PM",
      "body": "Good update OP but not everyone failed to notice the preview button as you did. Preview button is much more easier because what you preview is still showing on the same page and no need to visit another site and in terms of quoting someone you view everything as  it will appear after posting.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "examplens",
      "created_time": "March 14, 2023, 06:42:11 PM",
      "body": "Quote from: Cantsay on March 14, 2023, 10:30:11 AMI just checked and it does almost the same thing as the preview button (if not the same) another advantage the preview button has is that it saves your post in the draft in case you accidentally delete your post.  they both have drafts. the whole tool offers almost identical possibilities and I have not found any upgrade compared to the already existing one that comes with the forum... plus what makes this even more complicated due to switching between tabs, there is always the additional possibility of an error in copy/paste.I haven't tried it, maybe it's more practical for those who write on mobile devices. Certainly an interesting tool, but without excessive utility value.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}