{
  "id": "topic_5408749",
  "title": "IdunnoMEMES",
  "author": "IdunnoMEMES",
  "created_time": "August 04, 2022, 10:14:40 PM",
  "content": "Can you show me how to delete my account?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5408749",
  "comments": [
    {
      "author": "Charles-Tim",
      "created_time": "August 04, 2022, 10:15:44 PM",
      "body": "You can not be able to delete your Bitcointalk account, not possible.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "IdunnoMEMES",
      "created_time": "August 04, 2022, 10:21:25 PM",
      "body": "Wow that really sucks. Thanks alot",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jackg",
      "created_time": "August 04, 2022, 10:33:07 PM",
      "body": "You can freely make multiple accounts here so I don't see the reason for deleting an account (it's probably one of the main reasons why it's not an option).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "notblox1",
      "created_time": "August 04, 2022, 10:48:35 PM",
      "body": "Quote from: IdunnoMEMES on August 04, 2022, 10:14:40 PMCan you show me how to delete my account?Why did you just created account today and you are already thinking of deleting it?There is no option for deleting accounts but you can delete all your posts, log out and don't use your account anymore.You didn't say anything important in your four post, so nothing to worry about.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "August 04, 2022, 10:48:47 PM",
      "body": "Quote from: IdunnoMEMES on August 04, 2022, 10:21:25 PMWow that really sucks. Thanks alotHow?You can abandon your account.Quote from: notblox1 on August 04, 2022, 10:48:35 PMThere is no option for deleting accounts but you can delete all your posts, log out and don't use your account anymore.Topics that are not self-moderated are still posts, they can not be deleted by the topic creator, unless it is reported for deletion and deleted by a moderator. I will not suggest him to delete his posts, but he can just abandon his account.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nc50lc",
      "created_time": "August 05, 2022, 03:38:43 AM",
      "body": "Quote from: IdunnoMEMES on August 04, 2022, 10:14:40 PMCan you show me how to delete my account?If your main account is a newbie, you can try to ask a moderator to \"nuke\" it.That will wipe all of that account's posts and ban it.But it's not possible if it's a Jr member or above, only the admin can do that.Here's how to find moderators or the Admin: /index.php?topic=703657.0",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "noorman0",
      "created_time": "August 05, 2022, 03:59:03 AM",
      "body": "It is not possible to permanently delete a user account, you have a unique account ID. I'm sure there's a new user every 10 minutes to this forum, if one of them was deleted it might mess up the registration logs completely.Quote from: notblox1 on August 04, 2022, 10:48:35 PMWhy did you just created account today and you are already thinking of deleting it?Maybe the op is talking about another account, the desired username got an ipevil.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "KellyHands",
      "created_time": "August 05, 2022, 04:14:10 AM",
      "body": "Since it's impossible to delete an account from the platform once created. Is it possible for a username to be used more than ones, probably because the previous ones are not active over a long period of time?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "witcher_sense",
      "created_time": "August 05, 2022, 04:43:45 AM",
      "body": "Quote from: KellyHands on August 05, 2022, 04:14:10 AMSince it's impossible to delete an account from the platform once created. Is it possible for a username to be used more than ones, probably because the previous ones are not active over a long period of time?Only administrators can change usernames, but you'll need to provide a good reason why your username should be changed to convince them to do that. Moreover, it's unlikely that an administrator will agree to change the username of an inactive account because the inactive may suddenly become active and rightfully demand to return his username. It might work with permabanned accounts, though.Although you can't delete an account on this forum, you can take the following steps to abandon it: 1. delete all your posts; 2. ask people politely who quoted your posts to delete their posts; 3. ask people politely who maintain archive versions of this forum (LoyceV, TryNinja, ...) to delete everything that mentions you; 4. generate a long random password using a reliable password manager and use it as your account password; never save a copy of it; 5. change your account email to a disposal email; 6. change your email again to a new disposable email; 7. when the confirmation email arrives at your old disposable email, click \"lock your account\"; 8. forget about your account.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Despairo",
      "created_time": "August 05, 2022, 04:51:08 AM",
      "body": "Quote from: witcher_sense on August 05, 2022, 04:43:45 AMQuote from: KellyHands on August 05, 2022, 04:14:10 AMSince it's impossible to delete an account from the platform once created. Is it possible for a username to be used more than ones, probably because the previous ones are not active over a long period of time?Only administrators can change usernames, but you'll need to provide a good reason why your username should be changed to convince them to do that. Moreover, it's unlikely that an administrator will agree to change the username of an inactive account because the inactive may suddenly become active and rightfully demand to return his username. It might work with permabanned accounts, though.I think you're misunderstood, he mean if someone able to create new accounts that using existed username that has been created before, not about changing his username. It's impossible to create same username, so you must use a different name, if you really want to use specific name, you can using capitalized letter or combining/change with number though it's annoying.Just like how many theymos impostor accounts created so far.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bhig Daddy",
      "created_time": "August 05, 2022, 05:37:00 AM",
      "body": "You can't delete your account",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "KellyHands",
      "created_time": "August 05, 2022, 07:11:56 AM",
      "body": "Thank you so much for the explanations and direction. I have no intention of changing my username, was only being inquisitive. Just trying to get acquainted with the forum regulations and modus operandi.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "_act_",
      "created_time": "August 05, 2022, 07:45:45 AM",
      "body": "Quote from: witcher_sense on August 05, 2022, 04:43:45 AMAlthough you can't delete an account on this forum, you can take the following steps to abandon it: 1. delete all your posts; 2. ask people politely who quoted your posts to delete their posts; 3. ask people politely who maintain archive versions of this forum (LoyceV, TryNinja, ...) to delete everything that mentions you; 4. generate a long random password using a reliable password manager and use it as your account password; never save a copy of it; 5. change your account email to a disposal email; 6. change your email again to a new disposable email; 7. when the confirmation email arrives at your old disposable email, click \"lock your account\"; 8. forget about your account.There is no other steps that is necessary to be taken to abandon an account than to leave the account and not access bitcointalk ever again, this can go to the extent of using a password he can not remember and change the email to an unknown one that he can not access too. But it is not hard up to that for me, I can just leave the account alone and abandon it easily. 1. Why should he delete his posts? What benefit would it have for him? This is not advisable if he has quality posts.2. If people like him with newly registered account send to other members to delete their quote, would they answer? No. Even if a reputable member is leaving the forum and asked people to delete their quote and him also will delete his own posts, would people answer him? No. 3. Not a good idea too4, 5 and other suggestion are good ideas but not necessary.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hd49728",
      "created_time": "August 05, 2022, 05:09:17 PM",
      "body": "This question is asked many times, you can search and find answers. List of Answered Suggestions. Please don't create topics before read them all!You can not delete your account.You can not change your account username. Only theymos can approve your request and change it for you but you must have solid reason to get an approval. If you have a VIP account (50 BTC in donation), you have rights to change it by yourself.If you don't have a VIP account, don't have a solid reason, you can not delete your account or change its username.Quote from: hd49728 on June 01, 2019, 05:52:48 AMDelete Account, change usernameTopicsDatewritten by_____________________________________________________________________________________________________________________only moderators, Donators, and VIP members can change their names automatically. Other members should contact theymos28/8/2011theymosTheymos only changes username to Anonymous on request08/3/2012theymosChange email randomly, change password strongly & log out31/3/2015Vod[SAD] I delete your account12/2/2015shorenaIt's not possible. Just abandon it.04/3/2018hilariousandcoHow to edit my username?06/01/2020hilariousandco",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "decodx",
      "created_time": "August 05, 2022, 05:24:13 PM",
      "body": "Quote from: KellyHands on August 05, 2022, 04:14:10 AMSince it's impossible to delete an account from the platform once created. Is it possible for a username to be used more than ones, probably because the previous ones are not active over a long period of time?No, it is not possible to use the same username more than once, regardless of the inactivity of the previous user. Once a username is registered on the platform, it remains recorded in the database and no one else can use it again. It is possible for the admin to change the username upon request (in rare and justified circumstances), but the old username remains unavailable to prevent misuse.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "acroman08",
      "created_time": "August 05, 2022, 08:15:55 PM",
      "body": "Quote from: KellyHands on August 05, 2022, 04:14:10 AMSince it's impossible to delete an account from the platform once created. Is it possible for a username to be used more than ones, probably because the previous ones are not active over a long period of time?you can't use the same user name more than once(it should be a feature any platform should have) since if people can use the same user name again when creating an account we would see a lot of accounts with the same user name and scammers would abuse it and impersonate to be someone who has an excellent reputation in the forum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Issa56",
      "created_time": "August 05, 2022, 08:52:13 PM",
      "body": "Quote from: KellyHands on August 05, 2022, 04:14:10 AMSince it's impossible to delete an account from the platform once created. Is it possible for a username to be used more than ones, probably because the previous ones are not active over a long period of time?You can't delete your account on the forum, once you create a account on forum it remains. I don't really think you can change your username on the forum, even if the account is not active for long time you can't still change your username. the only thing I think you can do is create another account with similar username, since having multiple accounts in the forum is allowed but you must not cheat with it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LoyceV",
      "created_time": "August 06, 2022, 08:55:29 AM",
      "body": "Quote from: witcher_sense on August 05, 2022, 04:43:45 AMAlthough you can't delete an account on this forum, you can take the following steps to abandon it: ~2. ask people politely who quoted your posts to delete their posts; 3. ask people politely who maintain archive versions of this forum (LoyceV, TryNinja, ...) to delete everything that mentions you;I usually reject those requests, unless there's a good reason (such as doxing). If you don't want something to be archived on the internet: don't post it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DdmrDdmr",
      "created_time": "August 06, 2022, 12:52:38 PM",
      "body": "Quote from: noorman0 on August 05, 2022, 03:59:03 AM<…>It wouldn’t really be a technical problem at all, and the reason is more of a conceptual choice than anything else. Historical account UserIds have gaps, meaning that for some reason or other, some accounts were not created or the TX that was to created them rolled-back. These gaps do not cause any issues, and are never reassigned at a later stage if the programming is done correctly.SMF, although does allow for accounts to be deleted, as can be seen here:https://wiki.simplemachines.org/smf/Profile#Delete_This_AccountBitcointalk simply chose not to allow for accounts to be deleted.Note: I cannot state what versions of SMF it applies to, but is would seem like a feature that was there from the initial version.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}