{
  "id": "topic_5462870",
  "title": "tiredtoday",
  "author": "tiredtoday",
  "created_time": "August 11, 2023, 06:16:52 AM",
  "content": "本期访谈嘉宾：PHD Capital 共同创始人、前 Synthetix 总工程师 - Jackson Chan介绍1.首先请您介绍一下您的有关 DeFi 产品构建的背景。JC：在 2018 年，我作为Synthetix 的早期团队成员，深度介入了 DeFi 领域。该团队的核心关注点是开发可供交易的合成资产，搭建以太坊和 Optimism 链上的永续去中心化交易（DEXs）。链上 DEXs 和永续 AMM 通过智能合约以及虚拟资产的价格敞口来保证用户交易的安全性和透明性。Synthetix 是早期就在以太坊 Layer 2 扩容方案 Optimism 部署的并与之合作的项目之一。在交易量方面，Synthetix 的永续产品取得了巨大的成功，目前的日交易量达 1亿美元至 5亿美元。该交易量说明我们从零搭建起的产品被用户所接受和使用。产品开发者对衍生品的看法2. 作为曾经直接参与过第一代主要衍生品协议的开发者，您认为一个平台需要具备哪些基本要素才能吸引到交易者？JC：我认为简易的用户体验（UX）至关重要。像USDC、USDT 和 DAI 这些主流稳定币的冲币流程要简单易操作，这样交易者就能马上使用产品开始交易。另外一个重要的因素是资本效率。给抵押账户设置全仓这种功能就能大大提升交易者的潜在收益，同时极大降低不必要的清算风险。同样，杠杆价格敞口的功能能够提高资本效率，让交易者充分利用其交易头寸。第三个关键要素是产品要确保主要加密对的深度流动性和紧密利差。这能够减少滑点，保证交易者进出仓位足够简便。DeFi 领域里，跨链支持的必要性也与日俱增。想要让交易者将保证金配置在流动性最强的位置中，就需要提高产品的灵活性和可访问性。强大的分配模型至关重要。如果能够与那些交易者已经持仓的各个前端和交易平台合作，就能够扩大产品的用户群，提升平台知名度。所有上述要素的配备能够大大提高交易者对一个加密衍生品平台的兴趣。3. 那么考虑到这些因素，您为何对 Bracket 产生了兴趣并且用 Bracket 投资呢？JC：我认为 Bracket 在搭建结构化产品方面有着非常丰富的传统金融经验。他们提供价格保险为交易者的投资护航，通过承销期货保证稳定币的锚定，还满足了流通价值超过 1 千亿美元的稳定币庞大市场需求。Bracket 产品的底层是加密货币期权，很有前景的一点是这些结构性对冲产品能够通过包括 Metamask 等钱包和其他中间机构来分发。像加密货币交易所、Uniswap 这样的去中心化交易所有可能是产品未来的融合方向。Bracket 和流动性提供者（LP）共同生成了这些产品，所以 Bracket 平台可以说在 DeFi 领域独树一帜。有关波动性4. 衍生品交易在不同的市场波动性中有何不同的表现？JC：波动性是衡量资产价格随时间变动的指标，在交易中起到极为重要的作用，尤其是在永续期货等加密衍生品领域。在波动性较大时，标的资产的价格可能会在很短的时间内发生剧烈的波动。这就产生了创造巨额利润的机会，但同时也承载巨大损失的风险。交易者如果无法支付保证金，就可能会遭受频繁的清算。大的波动性对于日内交易者和波段交易者来说是个福音，能在价格的涨跌幅中获得巨大的利润。相反，在波动性较小时，价格的变化不会太剧烈。这就减少了短期内的交易机会，降低了潜在的收益。这些阶段更容易预测交易环境，也可能更适合长期的投资策略。5. 您对区间交易衍生品的概念有何看法？当下的市场中有哪些用处？JC：区间交易衍生品是一种金融工具，收益取决于标的资产的价格在一定时期是否能维持在制定的范围内。在波动性较小的市场环境下（如当下的熊市），资产的价格不太可能有大幅变化，那么区间交易衍生品就派上了很大的用处。原因是即使标的资产的价格相对稳定，没有大幅的波动，交易者也能通过这些金融工具产生投资回报。举例来说，有一个比特币的区间交易衍生品，其范围设定在下限 25,000美元和上限 35,000 美元的区间。如果BTC在合约期间内保持在这个范围，交易者就能获得回报。然而，如果价格跌破 25,000 美元或涨至 35,000 美元以上，那么交易者就无法获得回报，甚至蒙受损失。这些衍生品对交易者来说是个十分有效的工具，哪怕市场波动性较低仍然可以获得回报，因为回报不再依赖大幅的价格波动。然而，想要用好这种产品，就要充分了解市场环境和资产的价格动态，以便正确设置价格区间。区间交易衍生品对保护稳定币的锚定也起到很好的作用。如果稳定币的价格跌破下限价格，就会支付给交易者。交易小贴士6. 您见证了加密市场的几轮周期，您认为新手交易者在熊市中犯的主要错误有哪些？JC：恐慌性抛售：新手在市场低迷的时候常因为恐惧而抛售持有的产品，这就有可能深陷损失的境况。保护好自己的资产至关重要，因为基于市场情绪的抛售就可能错过市场恢复时的大好机会。忽视风险管理：未能设置止损、风险限额或没有能力管理杠杆也可能导致在熊市遭受重大损失。无视市场情绪：基本面的分析很重要，忽视市场情绪也可能导致失手。市场情绪带动加密货币市场，了解市场情绪能够帮助交易者做出更为明智的决策。叙述的变化：在熊市期间，很多团队仍然在开发新的技术，LSDfi 和 NFTfi 就是自熊市开始后出现的新机遇。这些机遇在上一个牛市的时候还未浮现，所以交易者应当意识到熊市的环境下可能孕育的新机遇。7. 下一个问题，您是否能推荐一下个人最喜欢的工具和资源，用来寻找新的产品和交易理念？JC: DefiLama.io项目协议和 DAO 的 Discord 群组加密货币推特账号Arkham IntelligenceNansen.io希望您喜欢本回访谈录系列的第一期内容，感谢您的关注。",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5462870",
  "comments": []
}