{
  "id": "topic_5432566",
  "title": "Cyber_Alien",
  "author": "Cyber_Alien",
  "created_time": "December 31, 2022, 11:42:06 PM",
  "content": "Happy New Year to Satoshi, the entire Bitcointalk Crew, Users, and their families.♥️♥️♥️Cheers to a new year.  I pray that 2023 will be a fantastic year for all of us. More Bitcoin in our wallet. I hope the price of Bitcoin rises and that more countries accept Bitcoin as legal tender.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5432566",
  "comments": [
    {
      "author": "DiMarxist",
      "created_time": "December 31, 2022, 11:51:30 PM",
      "body": "Quote from: Cyber_Alien on December 31, 2022, 11:42:06 PMHappy New Year to Satoshi, the entire Bitcointalk Crew, Users, and their families.♥️♥️♥️Cheers to a new year.  I pray that 2023 will be a fantastic year for all of us. More Bitcoin in our wallet. I hope the price of Bitcoin rises and that more countries accept Bitcoin as legal tender.The same to you but many countries have not enter into the 2023 because their calendar is different from yours.  We all hope so, more will accept Bitcoin and mainly the price should go up. But the bear market is also good for buyers while the bull market is also good for the sellers. So all are good.Happy Crossover",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LDL",
      "created_time": "January 01, 2023, 01:13:51 AM",
      "body": "I am starting the journey in 2023, wishing for the overall development of Bitcoin in the coming days, forgetting the memories of the unexpected events that happened in the previous year 2022.  No matter how sad the memories of the past may be, we will never remember them in 2023 but we will learn something from the sad memories of the past.  Finally, to all the admins, staff, DT members, and members of Bitcoin Forum, Happy New Year 2023 from Bitcoin Forum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}