{
  "id": "topic_5468729",
  "title": "digaran",
  "author": "digaran",
  "created_time": "October 01, 2023, 04:17:03 AMLast edit: January 20, 2024, 07:20:59 AM by digaran",
  "content": "🖤",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5468729",
  "comments": [
    {
      "author": "noorman0",
      "created_time": "October 01, 2023, 06:51:51 AM",
      "body": "It looks like the font you are using on your Android/iOS doesn't support those characters. Play around with the system font settings, I think the default font will support more script characters.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "October 01, 2023, 10:26:46 AM",
      "body": "Quote from: digaran on October 01, 2023, 04:17:03 AMThis doesn't happen when I copy from a windows device, so I was wondering if there is a fix for this?I noticed that some codes or even formats look different in Android encoding. Perhaps the reason for this is Unicode Transformation Format UTF-32. I am not completely sure of the cause of the error, but why not use a third-party service to host the code and then post the link here, I suggest you ---> https://pastebin.com/Can you add a link to the code you mean?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "October 01, 2023, 12:20:11 PM",
      "body": "Can you indicate which part of the code this error refers to?This error is probably a blank space (visually speaking) but in reality there is something else there that is not really blank. So you have to find out what that space is and eliminate it.I'm not an expert in Python, but I found this information that seemed very plausible to me:https://stackoverflow.com/questions/74837978/syntaxerror-invalid-non-printable-character-u00a0-in-python",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "goxcraft",
      "created_time": "October 01, 2023, 05:35:54 PM",
      "body": "I don't about python but why do you copy paste your code? One blank line causes huge problem. Instead can't a make file and save it as code.py & then imports it wherever you wanna use it?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}