{
  "id": "topic_5468764",
  "title": "Crypt0Gore",
  "author": "Crypt0Gore",
  "created_time": "October 01, 2023, 11:12:02 AM",
  "content": "I just get a new smartphone lately and I tried using metamask on the phone, but I am concerned about the access that this smartphone is asking me to approve, I don't know if this is safe to approve or not because the warning isn't feeling like a safe thing to do. App may access files without your explicit knowledge.Now that doesn't sound like something I should take lightly, have anyone get this same thing before? I don't mind getting rid of the new phone because of this, my last one isn't asking me of this access.I have ignored this access most times, and the crypto wallet, metamask functioned perfectly, I am also able to make some transactions too, but every damn time I open the wallet this same image pops up. Any solution?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5468764",
  "comments": [
    {
      "author": "Gladitorcomeback",
      "created_time": "October 01, 2023, 11:19:00 AM",
      "body": "I am using android phone and installed Metamask but I doesn't remembered that Metamask APP ever ask for this permissions. This permissions is not looking safe especially why Metamask app needed permission to delete your files. I want to know as you have installed App from trusted source. Goto notification settings, maybe you found something to remove this pop up at the start. I will recommend, not to give access.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Chilwell",
      "created_time": "October 01, 2023, 11:41:37 AM",
      "body": "I have not come across this before and this sounds strange, I also bought new phone recently and also downloaded and installed Metamask but I didn't see any thing like this, I will advise you to be careful with the phone if possible change it if their is means. Here we are talking about your funds assuming it's another app I will say you should try use it again, but it involves money keep a distance away from the phone to avoid regret.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "un_rank",
      "created_time": "October 01, 2023, 11:42:17 AM",
      "body": "That is not a permission that is necessary for the wallet to function. The most I have allowed a crypto wallet to do is to access my camera to scan QR codes for transfer of transaction data or to copy an address, any other permission required is denied.Quote from: Crypt0Gore on October 01, 2023, 11:12:02 AMI don't mind getting rid of the new phone because of this, my last one isn't asking me of this access.This should not be necessary. You just have to verify that you did not download a malicious clone of the app, in which case you will need to delete it and clean out your device.- Jay -",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EarnOnVictor",
      "created_time": "October 01, 2023, 12:47:41 PM",
      "body": "This is an unusual behaviour from your Metamask app, you might want to be extremely careful to prevent data leaks.The app is non-custodial and open source, it shouldn't ask for anything whatsoever about you or try to access your details as your privacy should be their utmost concern.Well, these days, you don't fully trust anything, even the so-called open source because at times they might quickly manipulate it and set it back to the right functions unnoticed all in the name of an open source.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "October 01, 2023, 12:52:29 PM",
      "body": "Quote from: Crypt0Gore on October 01, 2023, 11:12:02 AMI have ignored this access most times, and the crypto wallet, metamask functioned perfectly, I am also able to make some transactions too, but every damn time I open the wallet this same image pops up. Any solution?I think seeing the prompt means it wanted you to be safe since therr is a warning from it. Why not revoke access everytime you arent using that or clear cache and clear file so you wont be exposed on the danger of potential data breached.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DdmrDdmr",
      "created_time": "October 01, 2023, 01:05:34 PM",
      "body": "Quote from: Crypt0Gore on October 01, 2023, 11:12:02 AM<...>I’ve been reading through a couple of sources on the matter, and perhaps it’s related to where you’ve installed the app (the type of memory). Apparently, the permission it’s asking for could be the result of the app needing to access an external device, so I’m wondering if you’ve installed the app on an SD card or alike, as opposed to using the internal memory. It this is so, you could try moving it to internal memory to see if it is still asking you to grant the said permission.See:https://commonsware.com/R/pages/chap-scoped-007.htmlhttps://support.google.com/googleplay/android-developer/answer/10467955?hl=en",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yudi09",
      "created_time": "October 01, 2023, 01:06:29 PM",
      "body": "All applications installed on the latest generation of Android will ask for permission from the Android owner and the owner has the option to reject it if we think the user doesn't need it.I can't conclude whether it's safe or not because in my opinion the smartphone you are using is better off avoiding installing applications that you don't run often because apart from being afraid of being infiltrated by malware. As for the metamask application, I think it can be used on a PC.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EL MOHA",
      "created_time": "October 01, 2023, 01:54:18 PM",
      "body": "Quote from: DdmrDdmr on October 01, 2023, 01:05:34 PMI’ve been reading through a couple of sources on the matter, and perhaps it’s related to where you’ve installed the app (the type of memory). Apparently, the permission it’s asking for could be the result of the app needing to access an external device, so I’m wondering if you’ve installed the app on an SD card or alike, as opposed to using the internal memory. It this is so, you could try moving it to internal memory to see if it is still asking you to grant the said permission.See:https://commonsware.com/R/pages/chap-scoped-007.htmlhttps://support.google.com/googleplay/android-developer/answer/10467955?hl=enThis certainly the fitting answer to the problem, since the OP said it is a new phone and the permission is targeted to phones with android version 11 and higher it would be it. Also the reason why others with latest android phones aren’t experiencing it is probably because they installed and stored the metamask file on the phones internal storage and OP might have his on the external. So the thing to do is to delete both the file and the app from the external and then install new one, but OP needs to make sure that all new installations are set to be stored on internal storage not on external. Maybe it could work. The link says it is harmless but even google hasn’t been accepting apps on his play store that wish to have this permission. This kind of cases also sends warning to one to avoid storing large amount of funds on non-airgapped devices",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jawhead999",
      "created_time": "October 01, 2023, 03:14:04 PM",
      "body": "Quote from: yudi09 on October 01, 2023, 01:06:29 PMAll applications installed on the latest generation of Android will ask for permission from the Android owner and the owner has the option to reject it if we think the user doesn't need it.I can't conclude whether it's safe or not because in my opinion the smartphone you are using is better off avoiding installing applications that you don't run often because apart from being afraid of being infiltrated by malware. As for the metamask application, I think it can be used on a PC.I don't understand what you're actually want to say, do you think Metamask is not a safe wallet? if it's not safe then either you install in cellphone, PC, or iPad, it will not change anything. I believe Metamask is safe, but they're become more centralized and tend to update their terms to restrict some countries.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Faisal2202",
      "created_time": "October 01, 2023, 04:31:07 PM",
      "body": "This is something new, I mean, smartphones don't ask that type of permission until an external app or device do not revokes such permissions. It is confusing, I think you should start sharing the whole story from zero. Like what device are you using, and where did you install the wallet, and when did this permission notification pop up? like just after clicking the app or what? Then I might be able to get more information about it. But for the time being, It is best to not give such permissions unless you trust the smartphone you are using, one thing is for sure, that if you have big chunks of assets then don't store them on mobile phones and especially the ones that you are going to use for daily purposes. I mean, make your previous phone airgap and use it as a wallet. But making it airgap might be hard in comparison to a PC.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Broadanbig",
      "created_time": "October 01, 2023, 05:07:13 PM",
      "body": "I seem not to get your point clear mate. This seems strange though because I have not come across anything of such before. For the first time I am seeing this here. I have metamask downloaded on my android phone and nothing of this nature popped up or was a requirement before I could install it and if I may ask, how and where did you download that metamask from or is it an upgraded version or  possibly a fake metamask app you downloaded requesting for access to your phone and other details.If you say you ignore the allow access option thats okay and you have been doing transactions  without such function being in full approval it is nice but you will have to be very observant of that features as not to make any mistakes.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ZAINmalik75",
      "created_time": "October 01, 2023, 05:57:25 PM",
      "body": "No, this is not safe for your crypto world even. But we are all using smartphones blindly and they might be using our data for their explicit usage but I think it is nice that your smartphone asked from you first. What type of device did you buy though? I would like to search more about it. I tried to read many replies but none of the replies made sense despite the one of ddmr ddmr, after reading that, I think you might be installing metamask on the SD card. Because when we do that, they might ask you such permission, but just to make things clear for you, I have not faced such an issue in my life yet, and I would definitely find such a thing doubtful. Because as a crypto user, I value my money and also know the tricks of the scammers. You should go and ask the retailer or some expert in person if you don't want to share the device name, but I think sharing the device name will not get you in some trouble but other useful information will.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "passwordnow",
      "created_time": "October 01, 2023, 08:24:42 PM",
      "body": "There's this option on our android phones that we should allow unknown or unfamiliar apps installed in our phone. It's because the phone is not yet familiar to these apps, they're giving you this warning which is a good feature. But also, make sure that you're downloading from a verified source and official link because these flags could also be true and usually, all of the apps that we download really can go through our files, mic, camera, etc. Just like Facebook and other social media apps especially Google, they hear what we do and what we're typing, they know all of it so that's just like a basic feature for android phones upon downloading new and unfamiliar app to the phone.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DVlog",
      "created_time": "October 01, 2023, 08:40:08 PM",
      "body": "Try to verify that the metamask you have downloaded is official or not. If it's official it won't require any permission to operate. There is a metamask installed in my phone as well which has no permission in my phone. If you have already imported your wallet then it is advisable to change your wallet as soon as possible. The screenshot you have shared looks like its not from Metamask.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sokani",
      "created_time": "October 01, 2023, 10:02:16 PM",
      "body": "Quote from: passwordnow on October 01, 2023, 08:24:42 PMThere's this option on our android phones that we should allow unknown or unfamiliar apps installed in our phone. It's because the phone is not yet familiar to these apps, they're giving you this warning which is a good feature. But also, make sure that you're downloading from a verified source and official link because these flags could also be true and usually,I've the mobile version of metamask installed on my phone and I've never seen anything like this. Also, I've gone through some replies but your explanation makes a lot of sense. The op didn't download the app from playstore because if he does he wouldn't have gotten such a message prompt asking for access. My guess is, he used a phone browser such as chrome to download metamask from the official website, and when he was trying to install it, he got the message because the phone recognizes playstore as the only verified source for installing apps, any other sources like phone browsers needs to be granted access.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Smartvirus",
      "created_time": "October 01, 2023, 11:04:56 PM",
      "body": "Quote from: sokani on October 01, 2023, 10:02:16 PMQuote from: passwordnow on October 01, 2023, 08:24:42 PMI've the mobile version of metamask installed on my phone and I've never seen anything like this. Also, I've gone through some replies but your explanation makes a lot of sense. The op didn't download the app from playstore because if he does he wouldn't have gotten such a message prompt asking for access. My guess is, he used a phone browser such as chrome to download metamask from the official website, and when he was trying to install it, he got the message because the phone recognizes playstore as the only verified source for installing apps, any other sources like phone browsers needs to be granted access.Playstore doesn’t guarantee an app is genuine, it only means an app is registered following due procedures but, there are a lot of mirror apps on playstore too though, there is a likeliness that, you could get suggestions on what is genuine based on the most downloads on an app of interest.Also, apps that raise concerns are only later attended to as per deactivation from playstore.I’ve been off metamask for a while now but, I don’t think it did ask for such permission for modification or any permission at all while I used it and besides, it’s supposed to be a wallet and not some all controlling app. Wallets don’t seek permissions for modifications, not even an upgrade.@OP, you do have to be skeptical and it’s good your not just ‘Yes and Okay’ about all your presented with.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nakamura12",
      "created_time": "October 01, 2023, 11:31:41 PM",
      "body": "I also have metamask on my mobile phone but I didn't get anything like that or the metamask ask to have granted access to all my files and also about that \"may access files without your knowledge but I can use the metamask just fine. Just to be safe since you are worriesd about it, you should not granted access as you have done that's why you ask this if it is safe. Did you check the app if it's the metamask app and not just some take metamask and where did you downloaded it?. Also, check the details of who created it and everything.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sheenshane",
      "created_time": "October 01, 2023, 11:59:23 PM",
      "body": "The reason why I dont recommend using any mobile wallet apps is that our phone has different apps and all of these have different permissions that can be binded in our phone and could be one of them can harm other apps.  Use a PC instead when using metamask or a separate device.I found this article and I hope you've downloaded the right mobile app of metamask wallet, not this one.Hackers clone Coinbase, MetaMask mobile wallets to steal your crypto",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tech30338",
      "created_time": "October 02, 2023, 12:13:49 AM",
      "body": "Quote from: Crypt0Gore on October 01, 2023, 11:12:02 AMI just get a new smartphone lately and I tried using metamask on the phone, but I am concerned about the access that this smartphone is asking me to approve, I don't know if this is safe to approve or not because the warning isn't feeling like a safe thing to do. App may access files without your explicit knowledge.Now that doesn't sound like something I should take lightly, have anyone get this same thing before? I don't mind getting rid of the new phone because of this, my last one isn't asking me of this access.I have ignored this access most times, and the crypto wallet, metamask functioned perfectly, I am also able to make some transactions too, but every damn time I open the wallet this same image pops up. Any solution?I have tried to install Metamask in my wallet using Play Store and once I have installed it, that image of yours has never popped up, mostly those types of things popups when you install games or filter apps, since they need to access the camera, I think that's not the real Metamask apps since there are apps thatto make sure your on the right site, check if its metamask.io, if that's not the correct one I'm afraid there might been already something installed on your mobile that is suspicious, suggesting not reset your phone or don' use that wallet and remove it immediately, just to be sure, to avoid issues in the future or hacks.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}