{
  "id": "topic_5430900",
  "title": "Obari",
  "author": "Obari",
  "created_time": "December 21, 2022, 06:20:44 PM",
  "content": "Confidence is one key factor in a man's life and the ability for a man to be confident is a virtue.I've spent over 4 days on the forum and despite the criticism, one thing I've noticed in this forum Is that no matter what the response might be, one must always be confident in all the doings and activities of the forum. Qualities of a confident person ~They listen more than they speak People who are truly confident already know what they are about to say so most times they wait to hear your opinion before speaking and hence on the forum, you shouldn't be in a haste to respond to topics but rather take your time to understand the topic before making quality and meaningful contributions to the topic.Celebrating other's winsFor a true confident person also wishes to see everyone succeed rather than feeling insecure seeing others succeed. staying in pleasant mood always Confident people don't let the opinions of others tell on them and hence they don't feel insulted in any form and always want to learn from every incidence and one should imbibe such culture on the forum.not ashamed to seek help or assistance When they're challenged, they have the boldness to seek for help and not feel ashamed of it.There are lot more qualities of a confident person.So what do you think are the qualities of a confident person?Let's discuss it here in the comment.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5430900",
  "comments": [
    {
      "author": "Die_empty",
      "created_time": "December 21, 2022, 11:17:25 PM",
      "body": "Quote from: Obari on December 21, 2022, 06:20:44 PMThere are lot more qualities of a confident person.So what do you think are the qualities of a confident person?Let's discuss it here in the comment.One of the key source of confidence is your ability to be sure that you have the required or right skills or information concerning a given area or concept. A man that has prepared very well for a particular task would be confident that he would perform such responsibility effectively and efficiently. Therefore, one of the ways of becoming confident in this forum to acquire the required knowledge or information about a topic before you start posting or discussing it in the forum. If you are sure that your contribution is a quality one, it would boast your confidence. But in cases where you are not sure of your responses, you would always be sacred that your mistakes or ignorance would be discovered and you might be criticism or even cautioned.Another catalyst of confidence is the consciousness that you are doing the right thing in the forum. If you are sure that you are not breaking any of the forum's rules in your conduct or activities, it has the tendency of improving our confidence level.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sandra_hakeem",
      "created_time": "December 21, 2022, 11:25:12 PMLast edit: December 21, 2022, 11:47:03 PM by Sandra_hakeem",
      "body": "You're correct..But since you said confidence is a virtue, is it supposed to be learnt and practiced just the way you've advice? No? Anyone that'll do much better in here is supposed to have learnt that in the outside world, -- Cus we're all fuckin' humans and we all have emotions,.. okay?.. some can control them, some gets controlled by them and that's where it becomes a bug in a social gathering like this.Op wrote something 'bout staying pleasant always: everyone gets angry dude. Believe me, there's always a time a bomb shells up for whatever flimsy reasons it might be, the same in humans. You're gonna feel insulted but you're simply gonna look pass that crap; sometimes you could even take 'em too personal and -- before you realize a thing -- you'll tell anyone else to never fuck with you else they'll get the same measure as the previous dude ...lol 😂 I remember a case btw Bitcoingirlclub and ratimov? That's if memories are vivid.Sandra 🧑‍🦰",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "1miau",
      "created_time": "December 22, 2022, 01:43:38 AM",
      "body": "In general, I agree to your guidelines but: Quote from: Obari on December 21, 2022, 06:20:44 PMCelebrating other's winsFor a true confident person also wishes to see everyone succeed rather than feeling insecure seeing others succeed.It's ok to congratulate someone but we should only do it, if we have to add considerable additional constructive content. Just saying:\"I'm very happy for your win, you really deserve to win [insert price of the giveaway here]. I hope you'll be happy to receive your price soon!\"or\"Congratulations to reach a new rank! It has been hard but now you have [insert new rank achievement here]. It's really a well deserved achievement!\"etc.is production of unnecessary shitposts because such posts don't carry any insightful content and are totally generic. Should everyone do that, imagine 20 people flocking to the topic and writing 20 one-liners about such congratulations. That would be one whole site (20 comments) without providing any added value.  In addition, such posts might be considered asQuote from: mprep on July 21, 2014, 05:27:51 PM1. No zero or low value, pointless or uninteresting posts or threads.and will possibly get deleted by moderators. But I agree: your suggestions are beneficial to consider when writing a constructive post in general.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Majestic-milf",
      "created_time": "December 22, 2022, 02:01:31 AM",
      "body": "Based on your third point, I think it takes more than confidence to celebrate and bask in another's win; and that attribute is a lack of self centeredness and pride. Just like Hakeem noted, we are humans; but it takes one who is not just confident in himself but is also willing to let others grow that can do that.  It may seem funny, but dude, there are folks on here who take the forum space to a competitive one and as such miss out on it's main purpose of setup.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Obari",
      "created_time": "December 22, 2022, 02:22:14 AM",
      "body": "Quote from: Sandra_hakeem on December 21, 2022, 11:25:12 PMYou're correct..I remember a case btw Bitcoingirlclub and ratimov? That's if memories are vivid.Sandra 🧑‍🦰I guessed I missed out from the case between Bitcoingirlclub and ratimo, maybe I wasn't in here then or maybe I didn't notice it in the thread it was posted but these two are already big name in the forum and whatever their challenges might be, would be a great lesson to learn from and I hope you don't mind pointing me to the thread so I can get to see things for myself.Everyone gets fucked up along the line in one way or the other, but the truth be told that, the moment you learn how to control their emotions, they're one step ahead of the others and I hope to hear from you again on the issues above.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Razmirraz",
      "created_time": "December 22, 2022, 04:32:45 AM",
      "body": "Belief without the support of action is like putting water in a sack. Belief is the basis, actions determine the result. Criticism is a process that can make you even better, in other words the seniors in the forum really care about you, criticizing so that the same mistakes don't happen again.Someone will feel confident because he thinks he has above average abilities. Confidence is important, but don't let it make you arrogant with all the abilities you have. Here we are still in the learning stage, sharing knowledge. The knowledge that we have is not necessarily owned by other people, and vice versa.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tech30338",
      "created_time": "December 22, 2022, 04:51:26 AM",
      "body": "OP has a good point , they listen to you, but in a point that you should make sure your statement has fact and you have check everything is fine, sometimes over confidence has some flaws, for example:Because you are overly confident of what you were saying you believe that everything you say is true and has no mistake, but in reality there was flaws but you don't want to acknowledge it since other people may lost their trust in what you said.I just want to add this one learn to acknowledge or accept mistake, be humble, and open for any suggestion in the forum, will make others believe in you since you can adjust and accept, correct your mistake without arrogant toward others.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Obari",
      "created_time": "December 22, 2022, 07:40:32 AM",
      "body": "Quote from: Razmirraz on December 22, 2022, 04:32:45 AMBelief without the support of action is like putting water in a sack. Belief is the basis, actions determine the result. Criticism is a process that can make you even better, in other words the seniors in the forum really care about you, criticizing so that the same mistakes don't happen again.Someone will feel confident because he thinks he has above average abilities. Confidence is important, but don't let it make you arrogant with all the abilities you have. Here we are still in the learning stage, sharing knowledge. The knowledge that we have is not necessarily owned by other people, and vice versa.I do agree with you senior mate but one thing we should know is that being arrogant and being confident is totally different.It is true that most times, confidence can make one grow into being arrogant but on the other hand, I was referring to a situation on the forum as no matter how arrogant one would be, he or she must definitely know one or two things from the forum as long as their persons is more on the forum and with time you'll see that being arrogant doesn't really matter because no matter what you know, there are people who know even way more then you then and there are people who have strong prepositions but still learn from others as the forum has also taught me that, Learning never ends.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "December 22, 2022, 08:15:21 AM",
      "body": "Quote from: Obari on December 21, 2022, 06:20:44 PMConfident people don't let the opinions of others tell on them and hence they don't feel insulted in any form and always want to learn from every incidence and one should imbibe such culture on the forum.Someone must have patience and learn to accept whatever suggestion contradict his own since we dont known all things hence there are better idea or much clear fact that our own suggestion. Sometime people got pissed of what they read but that speak something helpful. Yeah maybe others cant show that they are embarassed but but for me its okay to comprehend such broader ideas. Its not like were being stomp if someone correct us.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Crypt0Gore",
      "created_time": "December 22, 2022, 09:50:27 AM",
      "body": "Wait till you start meeting some members in real life then you will know that many talk like they have that confidence but are shy types, how can you noticed someone with confidence online mate? From what they type? LMAO 🤣🤣🤣 that's not real, that brave word of confidence is not real online.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Queentoshi",
      "created_time": "December 22, 2022, 10:00:13 AM",
      "body": "Quote from: Obari on December 21, 2022, 06:20:44 PMnot ashamed to seek help or assistance When they're challenged, they have the boldness to seek for help and not feel ashamed of it.I don't see any reason why someone should be afraid to seek for help or assistance when if you do not seek for the help or assistance there's no way that you will be helped or assisted out of your situation. The first step to know in his first accepting that you do not know something then seeking help to know it. If you did not accept that you do not know something there is no way you would want to seek help or assistance to know more about it. Don't be ashamed if you don't know something, the forum is a place to get help and assistance especially with issues regarding bitcoins, be confident enough to ask for help.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FatFork",
      "created_time": "December 22, 2022, 10:06:09 AM",
      "body": "Confidence is important for many reasons. First and foremost, confidence helps you believe in yourself and your abilities, which can help you take on new challenges and pursue your goals even when you encounter setbacks or obstacles along the way. The more confident you are, the more likely people will be to trust your ideas and follow through on them. But, confidence isn't just about believing in yourself. It's also about believing in other people, especially when they need your support and encouragement. When you show confidence in others, it can help them feel more confident themselves.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}