{
  "id": "topic_5421075",
  "title": "mole0815",
  "author": "mole0815",
  "created_time": "November 15, 2022, 08:06:48 AM",
  "content": "Lohnt es sich Scammer zu sein? Leider ja... mehr Details im Folgenden Artikel:QuoteDie Kriminellen sollen mit betrügerischem Handel mit Kryptowährungen schätzungsweise 2,4 Milliarden Euro erbeutet haben.Quote... ein kriminelles Callcenter mit rund 800 Mitarbeitern ...Quelle: https://www.krone.at/2857023Schön wenn den Behörden so ein Schlag gegen diese Bande(n) gelungen ist. Natürlich gibt es noch viel mehr davon aber jeder Aufgriff ist ein guter Aufgriff.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5421075",
  "comments": [
    {
      "author": "Lafu",
      "created_time": "November 17, 2022, 04:55:15 AM",
      "body": "Quote from: mole0815 on November 15, 2022, 08:06:48 AMLohnt es sich Scammer zu sein? Leider ja... mehr Details im Folgenden Artikel:QuoteDie Kriminellen sollen mit betrügerischem Handel mit Kryptowährungen schätzungsweise 2,4 Milliarden Euro erbeutet haben.Quote... ein kriminelles Callcenter mit rund 800 Mitarbeitern ...Quelle: https://www.krone.at/2857023Schön wenn den Behörden so ein Schlag gegen diese Bande(n) gelungen ist. Natürlich gibt es noch viel mehr davon aber jeder Aufgriff ist ein guter Aufgriff.Hätte mir den gesamten Artikel schon mal angschaut und gelesen aber wenn ich diesen anklicke steht zwar der link in der Browsereingabeleiste aber ich bekomme nur eine weiße Seite mit nichts.Das ist aufjedenfall gut wenn den Behörden ein Schlag gegen diese Betrüger gelungen ist , aber davon gibt es glaube ich so viele.Kaum ist einer aufgeflogen kommt wo anders ein neuer zum vorschein , leider.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MinoRaiola",
      "created_time": "November 17, 2022, 08:00:00 AM",
      "body": "400€ in der Minute... in der Ukraine mit 800 Mitarbeitern, hart.In Rumänien gibt es ein \"Hackerdorf\". Das Video auf Youtube finde ich gerade leider nicht, aber dort sieht man junge Menschen mit teuren Autos und Kleidung. Sie fallen stark auf, bei einem durchschnittlichen Lohn von 600-700€ im Monat.Und hier der nächste Fall aus der Presse. Es gibt mit Sicherheit noch eine größere Dunkelziffer. Hierbei ging es um eine Online-Trading-Plattform für Finanzprodukte. Mammut-Prozess in Nürnberg: Online-Betrug in Millionenhöhe - Rädelsführer vor GerichtQuoteNÜRNBERG - Anlagebetrug in Millionenhöhe: Zwei Männer (28 und 31) sitzen als Rädelsführer einer internationalen Bande seit 16. November vor dem Landgericht Nürnberg-Fürth - sie sollen mit Hilfe von Callcenter-Agenten Anleger aus halb Europa geprellt haben.https://www.nordbayern.de/region/mammut-prozess-in-nurnberg-online-betrug-in-millionenhohe-radelsfuhrer-vor-gericht-1.12726014",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mole0815",
      "created_time": "November 17, 2022, 05:25:28 PM",
      "body": "Quote from: Lafu on November 17, 2022, 04:55:15 AM~snipHier noch eine andere Quelle: https://www.derstandard.at/story/2000140844225/milliardenbetrug-mit-kryptowaehrungen-internationale-bande-ausgehoben@MinoRaiolaDas klingt auch interessant... Du kannst den Link gerne noch hier posten wenn er dir in die Finger kommt Würde mich mir schon Mal ansehen.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MinoRaiola",
      "created_time": "November 17, 2022, 05:52:34 PM",
      "body": "Quote from: mole0815 on November 17, 2022, 05:25:28 PM@MinoRaiolaDas klingt auch interessant... Du kannst den Link gerne noch hier posten wenn er dir in die Finger kommt Würde mich mir schon Mal ansehen.Die Stadt tragt das Synonym Hackerville. Ich hab ein sehr altes Video auf deutsch gefunden: Abgezockt im Internet Eine Kleinstadt voller Krimineller = https://youtu.be/-5xRf6UypEUViele aktuelle Videos auf YouTube sind auf Rumänisch. Die Stadt schreib sich glaube so: Râmnicu Vâlcea. Auf google gibt es eine Menge Medienberichte, viele davon sehr alt.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lafu",
      "created_time": "November 18, 2022, 04:32:54 AM",
      "body": "Danke MinoRaiola und mole0815 für die weiteren links ! Wobei natürlich die Überschrift des Artikels hier : Milliardenbetrug mit Kryptowährungen:https://www.derstandard.at/story/2000140844225/milliardenbetrug-mit-kryptowaehrungen-internationale-bande-ausgehoben nicht ganz so toll,klingt und rüberkommt finde ich und Bitcoin und co hier in eine schwarze Ecke gestellt wird.Aber da steckt bestimmt einiges an organisation dahinter wenn die in sovielen Ländern bereits aktive sitze hatten.Da würde ich mal sagen haben alle behörden die dazu führten die Schurken zu schnappen mehr als eine sehr gute arbeit gemacht haben.Schade ist halt das immer wieder Leute auf diese masche reinfallen.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mole0815",
      "created_time": "November 18, 2022, 02:14:23 PM",
      "body": "Ja da gebe ich dir recht Lafu! Aber solche Schlagzeilen ziehen besser und haben mehr Wirkung… kennt man ja. Also auch wenn der Betrug (in anderer Form) ohne BTC etc. stattfinden hätte können wird jede Chance genutzt die Meinung der Leser zu beeinflussen",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}