{
  "id": "topic_5529107",
  "title": "Rich Tator",
  "author": "Rich Tator",
  "created_time": "February 05, 2025, 03:38:58 PM",
  "content": "Self-moderated topic: All decent posts will be left alone, thank you. Is anyone open to the idea that Satoshi invented a **brilliant** new type of sustainable Ponzi scheme, unlike anything the world ever saw before? Please, turn off your \"flame-throwers\", and understand there are some obvious similarities - like extreme wealth for the early participants & the way new money needs to keep coming in, or prices will fall sharply, etc. Once you understand the similarities and the way BTC is apparently sustainable, is there anything wrong with being a brilliant new type of Ponzi?     Quote from: Muba20 on February 01, 2025, 11:50:08 AMQuote from: Rasa nanas on January 30, 2025, 09:21:28 AMCurrently the price of Bitcoin is stable at around $100k, this price is the price predicted by many people several years ago. meaning it is not impossible for bitcoin to reach a price of $1M. in my opinion bitcoin will reach a price of $1M at least in 2050. the most important thing is that now we have to collect a lot of bitcoin for investment because the price of bitcoin will continue to increase.A few years ago, when some people made various negative statements about reaching 100k, they are now expecting 1 million. Although there were many doubts about the price of Bitcoin reaching this level in the past few years, that has been dispelled. Now people are just trying to accept Bitcoin and hold it. They believe that it is very natural for Bitcoin to increase several times in the next few years. Moreover, if governments start reserving Bitcoin the way they are accepting Bitcoin, then the price of Bitcoin will increase rapidly and become more bullish.Currently, Michael Saylor, a large holder of Bitcoin, is still accumulating Bitcoin and according to his estimate, there is a high possibility of Bitcoin reaching 1 million by 2050. Bitcoin predictions are such that even if they seem unrealistic at first, they later turn into reality.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5529107",
  "comments": [
    {
      "author": "odolvlobo",
      "created_time": "February 05, 2025, 07:41:10 PMLast edit: February 07, 2025, 08:29:44 PM by odolvlobo",
      "body": "Bitcoin cannot be a Ponzi scheme. People who call Bitcoin a Ponzi scheme either don't understand Bitcoin or don't know what a Ponzi scheme is.Or they have twisted the meaning of \"Ponzi scheme\" to fit their story. Some critics call it a \"natural\" Ponzi scheme (or \"sustainable\"), but a \"natural\" Ponzi scheme is not a Ponzi scheme despite including \"Ponzi scheme\" in the name. Mostly, when people call Bitcoin a Ponzi scheme, they really mean to compare it to a pyramid scheme.Ponzi schemes and pyramid schemes are similar in that they require both new investment to continue, but in a Ponzi scheme there is an operator who claims to invest the victims' money. Instead of investing the money and making real returns, the operator really just keeps it and pay fake returns.In a pyramid scheme, new members pay old members to join in the hope of getting new members to pay them to join. In a pyramid scheme, the earliest members make money while everyone else loses money, but there is no fake investment or returns.Some Ponzi schemes also include features of a pyramid scheme, so that might account for some confusion between the two.It can be argued that Bitcoin is similar to a pyramid scheme in some ways, but Bitcoin cannot be a Ponzi scheme because it is 100% transparent and there is no operator pretending to invest the victims' funds.I don't consider Bitcoin to be a pyramid scheme either, but Bitcoin does have a speculative bubble problem because its current utility does not justify its current price. That makes it more like a game of Chicken or Hot Potato, but again not a Ponzi scheme.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackHatCoiner",
      "created_time": "February 05, 2025, 08:03:37 PM",
      "body": "Bitcoin is a pyramid scheme where to participate you must not buy any bitcoin. New participants who are short on bitcoin find themselves at the lowest levels of the hierarchy. The longer they stay short, the greater the financial damage they suffer when the pyramid eventually collapses!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Stalker22",
      "created_time": "February 05, 2025, 10:37:16 PM",
      "body": "No. As others have already said, Bitcoin is neither a ponzi nor a pyramid scheme.  The idea that new money needs to keep coming in is also a misconception.  Bitcoin's price can fluctuate, but it doesnt inherently require a constant influx of new buyers to exist or to function.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptosize",
      "created_time": "February 06, 2025, 03:27:59 PM",
      "body": "The only natural, sustainable pyramid scheme is this one.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "February 06, 2025, 04:05:31 PM",
      "body": "a ponzi scheme is where some dude, lets call him Mr Ponzi holds a central reserve of investors money and when people hand in a lump of money he only pays out small % as interest/divident/profit, hoping no one takes their initial lumps out toobitcoin does not work like that.when one person buys bitcoin he is buying it from someone else who is selling... its called trading. yes services attached to bitcoin have evolved, where by users now end up treating exchanges as banks, whereby the exchanges hold onto peoples reserves and hopes everyone doesnt just withdraw their lumps+profit at the same time.. but thats a fault of the services acting as banks. not bitcoin",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "headingnorth",
      "created_time": "February 06, 2025, 04:12:43 PMLast edit: February 07, 2025, 03:51:36 PM by headingnorth",
      "body": "How could it be a Ponzi scheme when the person who started it, Satoshi, never even benefitted from the one million bitcoins that he created?I never heard of a Ponzi scheme where the creator never benefited or profited from it, so use your brain if you have one.The person(s) who started it has to derive a profit from it, thus bitcoin cannot be a Ponzi scheme. Comprende señor?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Magic ALL",
      "created_time": "February 06, 2025, 09:30:46 PM",
      "body": "Quote from: cryptosize on February 06, 2025, 03:27:59 PMThe only natural, sustainable pyramid scheme is this one.\"A pyramid of energy or pyramid of productivity shows the production or turnover (the rate at which energy or mass is transferred from one trophic level to the next) of biomass at each trophic level. Instead of showing a single snapshot in time, productivity pyramids show the flow of energy through the food chain.\"You helped me learn something new about energy and food, thank you. Here is another interesting part:\"When an ecosystem is healthy, this graph produces a standard ecological pyramid. This is because, in order for the ecosystem to sustain itself, there must be more energy at lower trophic levels than there is at higher trophic levels. This allows organisms on the lower levels to not only maintain a stable population, but also to transfer energy up the pyramid. The exception to this generalization is when portions of a food web are supported by inputs of resources from outside the local community. In small, forested streams, for example, the volume of higher levels is greater than could be supported by the local primary production.\"",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "btc78",
      "created_time": "February 06, 2025, 10:45:07 PM",
      "body": "Quote from: Rich Tator on February 05, 2025, 03:38:58 PMunderstand there are some obvious similarities - like extreme wealth for the early participants & the way new money needs to keep coming in, or prices will fall sharply, etc. Once you understand the similarities and the way BTC is apparently sustainable, is there anything wrong with being a brilliant new type of Ponzi?      i really wouldn’t say it’s just a brilliant new type of ponzi because decentralization alone makes it a lot different from ponzi schemes and new money does not need to be coming in exactly as long as there are holders or just people who are making sure the money is circulating",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tread93",
      "created_time": "February 07, 2025, 04:44:52 AM",
      "body": "Quote from: Stalker22 on February 05, 2025, 10:37:16 PMNo. As others have already said, Bitcoin is neither a ponzi nor a pyramid scheme.  The idea that new money needs to keep coming in is also a misconception.  Bitcoin's price can fluctuate, but it doesnt inherently require a constant influx of new buyers to exist or to function.  Yes and also to this extent a ponzi scheme would involve using Peters money to pay Paul in which case this is not happening at all because every transaction is public on the blockchain and cannot be manipulated or in other words corrupted! Bitcoin is the all time anti ponzi scheme on inflation!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptosize",
      "created_time": "February 07, 2025, 03:26:00 PM",
      "body": "Quote from: Magic ALL on February 06, 2025, 09:30:46 PMQuote from: cryptosize on February 06, 2025, 03:27:59 PMThe only natural, sustainable pyramid scheme is this one.\"A pyramid of energy or pyramid of productivity shows the production or turnover (the rate at which energy or mass is transferred from one trophic level to the next) of biomass at each trophic level. Instead of showing a single snapshot in time, productivity pyramids show the flow of energy through the food chain.\"You helped me learn something new about energy and food, thank you. Here is another interesting part:\"When an ecosystem is healthy, this graph produces a standard ecological pyramid. This is because, in order for the ecosystem to sustain itself, there must be more energy at lower trophic levels than there is at higher trophic levels. This allows organisms on the lower levels to not only maintain a stable population, but also to transfer energy up the pyramid. The exception to this generalization is when portions of a food web are supported by inputs of resources from outside the local community. In small, forested streams, for example, the volume of higher levels is greater than could be supported by the local primary production.\"  You're welcome, bro.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "odolvlobo",
      "created_time": "February 07, 2025, 07:29:34 PM",
      "body": "Quote from: magick on February 07, 2025, 05:44:52 PMA Ponzi scheme is an investment scam designed to provide significant returns to earlier investors ...A Ponzi scheme is not designed to reward early investors. Its purpose is to enrich the operator.A Ponzi scheme may pay high returns to early investors in order to convince more people to invest more, but eventually the operator takes all the money except for the small portion paid out in returns.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "magick",
      "created_time": "February 08, 2025, 12:16:15 AM",
      "body": "Quote from: odolvlobo on February 07, 2025, 07:29:34 PMQuote from: magick on February 07, 2025, 05:44:52 PMA Ponzi scheme is an investment scam designed to provide significant returns to earlier investors ...A Ponzi scheme is not designed to reward early investors. Its purpose is to enrich the operator.A Ponzi scheme may pay high returns to early investors in order to convince more people to invest more, but eventually the operator takes all the money except for the small portion paid out in returns.You are right the main purpose of a Ponzi scheme is to serve the person or group behind it, whom we can call the <operator> Most of the returns go back to the operator<or else why would they run such a scheme? > but my focus is on how it works. To keep the scheme running the operator must continue paying early investors to build credibility and attract more investors it's all about sustainability. The cycle will continue as long as new investors keep coming in, but the Ponzi will collapse when there aren’t enough new investors.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "xmrhopium",
      "created_time": "February 08, 2025, 06:52:18 AM",
      "body": "Coders, mathematicians and economists are not the ones you want to try a ponzi scheme on. Bitcoin works and is a open source. I have knowledge of how Bitcoin works. I don't trust a third party about how it work, can just see it. Like a mathematical proof. I'm either not worried pythagoras is going to change the length of hypotenious and make the roof fall on my head. The same way I know Bitcoin is not a ponzi scheme.Quote from: headingnorth on February 06, 2025, 04:12:43 PMSatoshi, never even benefitted from the one million bitcoins that he created?There is no proof for whatsoever. The only two transactions we know of from satoshi are the coinbase of the genesis block, and the transaction to hal finey. Only forensics say that satoshi mined one million bitcoin, there is no absolute proof. Everything is only speculations.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FirmWars",
      "created_time": "February 08, 2025, 01:27:07 PM",
      "body": "The only pyramid scheme I knew exists in religion and schools, bitcoin is far different from these two, no cap..If Bitcoin is a proof of stake project I would have supported you, but I have to exchange my electricity power to get some BTC, something that grows in value over the years? Tell me how this is ponzi please, a ponzi that failed to die when no one is giving the any attention, a ponzi that failed to die when powerful centralised leaders are talking trash about it, bro you need some explanation to do. There is no single traces that Bitcoin is ponzi, this currency benefits the new grabbers/buyers, it is all in the chart mate, every freaking four years this things adds more value like no other, the utility does what it was intended perfectly well.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "buwaytress",
      "created_time": "February 08, 2025, 01:52:33 PM",
      "body": "Definition alone disqualifies Bitcoin... no one is collecting any funds to pay off old investors. Then if we want to go into all kinds of semantics, such as commissions from recruitments, downlines, and lack of actual product, well, Bitcoin already doesn't tick any of those boxes.It's okay to have your opinion, and it might suit your narrative as a speculator but I got into Bitcoin, as did many I met, to solve our money problems. Sure, I also saved some aside for wealth, but many others who found, and then used, Bitcoin, never saw beyond its already incredble use as a working alternative for money. I sell X, you pay BTC. So you may continue to treat it as a Ponzi if that helps you speculate and sleep better. Your truths don't change the facts.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}