{
  "id": "topic_5465650",
  "title": "decades85",
  "author": "decades85",
  "created_time": "September 04, 2023, 06:14:00 PMLast edit: September 04, 2023, 06:36:14 PM by decades85",
  "content": "Dear all, Ive sold some domains and the buyer paid by Bitcoin in 2 transactions. I transfered domains, but BTC transactions are pending now for 5+ days, he seems is not doing anything to fix that, because he was cheap and sent a 1000 and 1500 satoshis fee. He said the Bitpay said that they couldnt do anything and it will confirm in a few days. My transactions went from 10K+ in a line to 100K+ in a line today, so I think this will never confirm. Ive read somewhere, the unconfirmed transactions can be reversed or resent by paying extra fee. If not will they be dropped from the pool in 21 days?thank you for all your answers in advance,BRps: here is link to the 2 transactions :https://bitaps.com/3D3SzDM2dHGj36c9rUC4z5VKSj5rFfboTJ",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5465650",
  "comments": [
    {
      "author": "bitmover",
      "created_time": "September 04, 2023, 06:19:35 PM",
      "body": "Quote from: decades85 on September 04, 2023, 06:14:00 PMDear all, Ive sold some domains and the buyer paid by Bitcoin in 2 transactions. I transfered domains, but BTC transactions are pending now for 5+ days, he seems is not doing anything to fix that, because he was cheap and sent a 1000 and 1500 satoshis fee. He said the Bitpay said that they couldnt do anything and it will confirm in a few days. My transactions went from 10K+ in a line to 100K+ in a line today, so I think this will never confirm. Ive read somewhere, the unconfirmed transactions can be reversed or resent by paying extra fee. If not will they be dropped from the pool in 21 days?thank you for all your answers in advance,BRps: here is link to the 2 transactions :https://bitaps.com/3D3SzDM2dHGj36c9rUC4z5VKSj5rFfboTJThere are two pending transactions in your address. Both of them add some bitcoin to your wallet,  about 190 USD and 330 USD.You can see your transactions here:https://mempool.space/tx/6b06bb5d532f22ffc49f9f59c41ad3b1397509477e68ea13859543a726fa2a6fhttps://mempool.space/tx/eb5ca532d2dc1468e2fe632558481ad09a749c724fab7f9ddca0a236b2a2fc9eThe payer used a low fee, which is 7 sat/vbyte.The mempool is not a exactly a line. If someone send now a 8sat/vbyte transaction, it will get confirmed earlier than yours. Miners put whatever pays more first.If you can, just wait. it willl get confirmed eventually. Don't worry, and it may take a few more days to get confirmed.You are right and they can be reversed using a higher fee. They both have RBF disabled, so you cannot \"bump\" them.But you can spend those coins, paying a much higher fee for both transactions, in a process called Child Pays for Parent (CPFP).This is how to do it in ElectrumQuoteCreate a “Child Pays for Parent” transaction. A CPFP is a new transaction that pays a high fee in order to compensate for the small fee of its parent transaction. It can be done by the recipient of the funds, or by the sender, if the transaction has a change output. To create a CPFP transaction right click on the unconfirmed transaction on the history tab and choose “Child pays for parent”. Set an appropriate fee and click on “OK”. A window will popup with the unsigned transaction. Click on “Sign” and then “Broadcast”.https://electrum.readthedocs.io/en/latest/faq.html",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Antotena",
      "created_time": "September 04, 2023, 06:25:32 PM",
      "body": "Quote from: decades85 on September 04, 2023, 06:14:00 PMps: here is link to the 2 transactions :https://bitaps.com/3D3SzDM2dHGj36c9rUC4z5VKSj5rFfboTJThese transactions raise suspicion, the buyers knew it was a deal transaction, he should have increase the fee higher so that you can get it faster but decided to use lower fee, it looks like a flash transaction.Your transaction doesn't have a replace by fee enabled, that means it will be impossible to bump the fee or for a child to pay for parent, by this you cannot do anything rather than to wait. Even the sender cannot do anything at this point, if the fee comes lower, it will confirm but I doubt if that will happen as today is just Monday(busy day), maybe you should wait if the mempool will be lower by the weekend.If the transaction refuse to confirm and dropped, then you lose the domain and the money except if you are closer to the seller, you can tell him to resend.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LoyceMobile",
      "created_time": "September 04, 2023, 06:28:35 PM",
      "body": "If your wallet allows you to send unconfirmed inputs and has coin control: just send those 2 inputs to one of your own addresses with about 20-30 sat/vbyte. That should be enough to confirm faster. I can't really calculate the exact fee on mobile, I expect something around 5000 sats to be enough.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "decades85",
      "created_time": "September 04, 2023, 06:29:14 PM",
      "body": "Thank you for all your help and effordWill simply wait than.Best Regards,Robert",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "September 04, 2023, 06:29:15 PM",
      "body": "Quote from: Antotena on September 04, 2023, 06:25:32 PMYour transaction doesn't have a replace by fee enabled, that means it will be impossible to bump the fee or for a child to pay for parent, by this you cannot do anything rather than to wait. Even the sender cannot do anything at this point, if the fee comes lower, it will confirm but I doubt if that will happen as today is just Monday(busy day), maybe you should wait if the mempool will be lower by the weekend.Even with replace by fee disabled (RBF) you can use Child Pays For Parent (CPFP).You can do it in basically any wallet. just spend the coins and use a high fee (about 26 sat/vbyte in time of writing)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hosemary",
      "created_time": "September 04, 2023, 07:49:23 PMLast edit: September 04, 2023, 08:10:19 PM by hosseinimr93",
      "body": "Quote from: decades85 on September 04, 2023, 06:14:00 PM I transfered domains, but BTC transactions are pending now for 5+ days, he seems is not doing anything to fix that, because he was cheap and sent a 1000 and 1500 satoshis fee. You did a wrong thing. You should never accept an unconfirmed transaction. There is no guarantee that an unconfirmed transaction will be finally confirmed. Quote from: decades85 on September 04, 2023, 06:14:00 PMIf not will they be dropped from the pool in 21 days?Where did you get the 21 days from?By default, transactions are dropped from the mempool, if they stay unconfirmed for 14 days.(Nodes that have dropped unconfirmed transaction from their mempool can receive them again, if they are rebroadcasted.)Quote from: decades85 on September 04, 2023, 06:29:14 PMWill simply wait than.Note that your transactions are around 40 vMB from the tip and it's unlikely that they will be confirmed soon. You didn't tell us what's the wallet you used for receiving the fund. If you own the private key of the receiving address, you can do CPFP and make transactions confirmed faster.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "decades85",
      "created_time": "September 04, 2023, 08:58:12 PM",
      "body": "Thanks for letting me know. I used Coinbase centralized wallet. Maybe I can get in touch with CB anyway.Best Regards and many thanks,",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitMaxz",
      "created_time": "September 04, 2023, 09:16:12 PM",
      "body": "Quote from: decades85 on September 04, 2023, 08:58:12 PMThanks for letting me know. I used Coinbase centralized wallet. Maybe I can get in touch with CB anyway.Best Regards and many thanks,The centralized Coinbase wallet(Coinbase exchange ) does not have a feature to do CPFP unless you use their self-custody wallet with seeds backup that you can import to Electrum and do CPFP transactions.Coinbase support can't able to help you if you use the centralized wallet so the only thing that you can do right now is to wait for the mempool to become less congested.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "decades85",
      "created_time": "September 04, 2023, 09:50:29 PM",
      "body": "Thank you Bitmaxz, will wait and if it does not confirm in the next 9 days, will simply contact the sender after.He is a reputable member of the other domainers forum and I hope he will not make the same mistake in the future.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ndabagi01",
      "created_time": "September 04, 2023, 10:05:44 PM",
      "body": "Quote from: bitmover on September 04, 2023, 06:19:35 PMThey both have RBF disabled, so you cannot \"bump\" them.But you can spend those coins, paying a much higher fee for both transactions, in a process called Child Pays for Parent (CPFP).This is how to do it in ElectrumQuoteCreate a “Child Pays for Parent” transaction. A CPFP is a new transaction that pays a high fee in order to compensate for the small fee of its parent transaction. It can be done by the recipient of the funds, or by the sender, if the transaction has a change output. To create a CPFP transaction right click on the unconfirmed transaction on the history tab and choose “Child pays for parent”. Set an appropriate fee and click on “OK”. A window will popup with the unsigned transaction. Click on “Sign” and then “Broadcast”.https://electrum.readthedocs.io/en/latest/faq.htmlWhen your RBF is disabled on both sides of the transaction while sending it, the Childs Pay for Parent (CPFP) transactions can always come in to alter the transaction fee and get it confirmed faster. Can this CPFP always ensure that you will be able to alter the parent fees to speed up the transaction? If it works on Electrum, do other wallets adhere to the same consensus?Also, can CPFP be used while transacting between two different wallets?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sheenshane",
      "created_time": "September 04, 2023, 11:21:20 PM",
      "body": "Quote from: hosseinimr93 on September 04, 2023, 07:49:23 PMQuote from: decades85 on September 04, 2023, 06:14:00 PMIf not will they be dropped from the pool in 21 days?Where did you get the 21 days from?By default, transactions are dropped from the mempool, if they stay unconfirmed for 14 days.(Nodes that have dropped unconfirmed transaction from their mempool can receive them again, if they are rebroadcasted.)Sounds frustrating if you'll wait this long. I just wanted to know if those paid services of Bitcoin transaction accelerators will help in this case like ViaBTC since it has many partners in a mining pool.Quote from: decades85 on September 04, 2023, 09:50:29 PM..if it does not confirm in the next 9 days, will simply contact the sender after.He is a reputable member of the other domainers forum and I hope he will not make the same mistake in the future.Next time you should wait at least 3 confirmations before making such deal, it's a safe indication that you are making a good transactions but anyway since it was a reputable buyer, it might worth it to wait.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "notocactus",
      "created_time": "September 05, 2023, 12:19:05 AM",
      "body": "Quote from: decades85 on September 04, 2023, 06:14:00 PMIf not will they be dropped from the pool in 21 days?21 days is not a default setting of mempool and the default figure is 14 days but remember mempool operators can customize it to longer or shorter than the default value (14 days).Transaction expirationBitcoin Core Config Generator (compatible with Bitcoin Core 25.0)Mempool expiration: 336 hours = 14 days.maxmempoolexpiry usually is set as 336 hours by most of mempools.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hosemary",
      "created_time": "September 05, 2023, 04:35:17 AM",
      "body": "Quote from: Ndabagi01 on September 04, 2023, 10:05:44 PMWhen your RBF is disabled on both sides of the transaction while sending it, the Childs Pay for Parent (CPFP) transactions can always come in to alter the transaction fee and get it confirmed faster. There is no such thing as RBF on both sides of transactions. A transaction is RBF-enabled or RBF-disabled. CPFP can be done only if you have full control over one of the receiving addresses. So, it's not that CPFP can be always done. Quote from: Ndabagi01 on September 04, 2023, 10:05:44 PMCan this CPFP always ensure that you will be able to alter the parent fees to speed up the transaction? If it works on Electrum, do other wallets adhere to the same consensus?If you have the private key of the one of the receiving addresses, you can use electrum or any other wallet that allow you to spend unconfirmed outputs to do CPFP.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nc50lc",
      "created_time": "September 05, 2023, 07:41:56 AM",
      "body": "Quote from: Ndabagi01 on September 04, 2023, 10:05:44 PMCan this CPFP always ensure that you will be able to alter the parent fees to speed up the transaction? If it works on Electrum, do other wallets adhere to the same consensus?Child-Pays-for-Parent doesn't actually increase the fee of the parent, it's just the result of current default selection of transactions used by miners.Here's the PR when it's implemented: https://github.com/bitcoin/bitcoin/pull/7600What actually happens is the parent and children transaction fees and sizes are all taken into consideration when getting the overall fee rate,Kind of like a \"bundle deal\", you sent a transaction that pays a high fee but it can't be mined unless its parent is mined as well.So the miners have to check if the overall fee rate when the parent is included is still higher than the other transactions in their mempool.With that, it's not limited to Electrum, as long as miners use the same transaction selection method, CPFP will work.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitMaxz",
      "created_time": "September 05, 2023, 05:21:48 PM",
      "body": "Quote from: sheenshane on September 04, 2023, 11:21:20 PMI just wanted to know if those paid services of Bitcoin transaction accelerators will help in this case like ViaBTC since it has many partners in a mining pool.I never had experience using the Paid service of ViaBTC accelerator but since they own a pool they can be able to speed up the transaction.By default, a pool like Viabtc prioritizes transactions that pay higher fees automatically. However, The pool owner or the pool operator can manually choose what transaction they want to add to the block.Viabtc's paid service should work in this case the only problem is the paid service is a bit expensive and not good for small transactions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "macson",
      "created_time": "September 08, 2023, 11:31:03 AMLast edit: September 08, 2023, 11:43:48 AM by macson",
      "body": "i also had a transaction that was stuck a few days ago and it was quite frustrating, i used Safepal Wallet and chose the lowest fee but it was really unlucky, the fee increased drastically and my transaction couldn't be processed quickly, i just used this as a good experience (bad) lol.Quote from: bitmover on September 04, 2023, 06:29:15 PMQuote from: Antotena on September 04, 2023, 06:25:32 PMYour transaction doesn't have a replace by fee enabled, that means it will be impossible to bump the fee or for a child to pay for parent, by this you cannot do anything rather than to wait. Even the sender cannot do anything at this point, if the fee comes lower, it will confirm but I doubt if that will happen as today is just Monday(busy day), maybe you should wait if the mempool will be lower by the weekend.Even with replace by fee disabled (RBF) you can use Child Pays For Parent (CPFP).You can do it in basically any wallet. just spend the coins and use a high fee (about 26 sat/vbyte in time of writing)QuoteTo get your transaction confirmed quicker, you will need to increase its effective feerate.If your transaction was created with RBF enabled, your stuck transaction can simply be replaced with a new one that has a higher fee.Otherwise, if you control any of the stuck transaction's outputs, you can use CPFP to increase your stuck transaction's effective feerate.If you are not sure how to do RBF or CPFP, work with the tool you used to make the transaction (wallet software, exchange company, etc). This website only provides data about the Bitcoin network, so there is nothing it can do to help you get your transaction confirmed quicker.[1] https://mempool.space/docs/faq#how-to-get-transaction-confirmed-quicklyi just read about RBF or CPFP in the article above and don't really understand the process, maybe I'll try it next week.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "September 08, 2023, 02:06:54 PM",
      "body": "Quote from: macson on September 08, 2023, 11:31:03 AMi just read about RBF or CPFP in the article above and don't really understand the process, maybe I'll try it next week.You basically just need to select those unconfirmed inputs and spend them with high fees, as @LoyceMobile described above",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "September 08, 2023, 06:32:45 PM",
      "body": "Quote from: BitMaxz on September 05, 2023, 05:21:48 PMViabtc's paid service should work in this case the only problem is the paid service is a bit expensive and not good for small transactions.For $100-$200 worth of BTC Viabtc is simply a no-go, they were charging a ton and on top of that OPs tx are not even one input one output, Viabtc was charging over 200sat/b extra the last time I looked at them for a tx. Best case scenario OP would look at a $100 worth of fee.I'm saying this approximately because, and this i a pretty weird thing, Viabtc paid service always returns an error, I tried the free one, it works perfectly it recognizes transactions, I even managed to accelerate one but the paid one give me an error all the time. It might be because I'm on mobile but I tried desktop view in FF and Chrome and it's still the same.Anyhow, seeing how both wallets are centralized, there is no way to CPFP it probably it has to be a paid tx as that 7sat/b will not get confirmed too soon and I'm not sure how much the OP can trust his business partner.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hosemary",
      "created_time": "September 08, 2023, 07:33:16 PM",
      "body": "Quote from: stompix on September 08, 2023, 06:32:45 PMViabtc paid service always returns an error, I tried the free one, it works perfectly it recognizes transactions, I even managed to accelerate one but the paid one give me an error all the time. It might be because I'm on mobile but I tried desktop view in FF and Chrome and it's still the same.I just checked that on PC and I confirm that their paid service is not working. I submitted several transaction IDs with the fee rates ranging from 8 sat/vbyte to 15 sat/vbyte to their paid service and got error for all of them. It only displays a message at top of the screen saying \"Error\" without any explanation on what causing the error.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}