{
  "id": "topic_5398815",
  "title": "toxifly",
  "author": "toxifly",
  "created_time": "May 16, 2022, 03:58:41 AM",
  "content": "I used trezor model T to make shamir shares, I used a tool to combine them into a master secret phrase, which gave me access to the root key, which I could use to import the wallet and use it in electrum wallet.However what I need is mnemonic seed as I am trying to recover my passphrase using BTCRecover, is it possible to get mnemonic seed from the master secret phrase?Is there any other way I could use BTCRecover without having mnemonic seed?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5398815",
  "comments": [
    {
      "author": "ranochigo",
      "created_time": "May 16, 2022, 04:13:29 AM",
      "body": "Trezor's Shamir Secret Sharing uses SLIP39 and from what I recall, they are not interchangable. I'm assuming that you're talking about BIP39 seeds. If that is the case, then it is not possible. BIP39 uses PBKDF2 to generate the seed which is a non-reversible function and as such you cannot generate a seed from that. SLIP39 and BIP39 are fundamentally different so they are not compatible in the first place.BTCrecover actually supports SLIP39. Refer to the documentation here: https://btcrecover.readthedocs.io/en/latest/Usage_Examples/basic_password_recoveries/#slip39-passphrases.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "May 16, 2022, 04:19:01 AM",
      "body": "In general, you can't convert a master private key back into a mnemonic phrase (as ranochigo mentioned), because the alrogithms currently in use are all irreversible.You might be able to combine the Shamir parts if they lead you to reconstruct the whole mnemonic phrase. But that depends on whether that is the contents of the secret parts.Why would you need BTCrecover though, anyway? Have you lost some of the parts (or the Trezor)?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "toxifly",
      "created_time": "May 16, 2022, 04:27:24 AM",
      "body": "Quote from: ranochigo on May 16, 2022, 04:13:29 AMTrezor's Shamir Secret Sharing uses SLIP39 and from what I recall, they are not interchangable. I'm assuming that you're talking about BIP39 seeds. If that is the case, then it is not possible. BIP39 uses PBKDF2 to generate the seed which is a non-reversible function and as such you cannot generate a seed from that. SLIP39 and BIP39 are fundamentally different so they are not compatible in the first place.BTCrecover actually supports SLIP39. Refer to the documentation here: https://btcrecover.readthedocs.io/en/latest/Usage_Examples/basic_password_recoveries/#slip39-passphrases.I didn't know it supports SLIP39, thank you for the help, it works with that! I can just enter my SLIP39 seeds there.Thank you and the thread can be closed now.Quote from: NotATether on May 16, 2022, 04:19:01 AMIn general, you can't convert a master private key back into a mnemonic phrase (as ranochigo mentioned), because the alrogithms currently in use are all irreversible.You might be able to combine the Shamir parts if they lead you to reconstruct the whole mnemonic phrase. But that depends on whether that is the contents of the secret parts.Why would you need BTCrecover though, anyway? Have you lost some of the parts (or the Trezor)?I forgot my secret phrase, but I remember enough of it that I should be able to crack it using BTCRecover.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "May 16, 2022, 06:55:56 AM",
      "body": "Quote from: toxifly on May 16, 2022, 03:58:41 AMis it possible to get mnemonic seed from the master secret phrase?Do you mean you already have the master private key (a string starting with xprv)? Because if you do, you don't need to have your mnemonic, passphrase, or anything else; all your keys are derived using this master private key.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}