{
  "id": "topic_5404622",
  "title": "Captain Corporate",
  "author": "Captain Corporate",
  "created_time": "June 30, 2022, 10:16:54 AM",
  "content": "I love pancakeswap and uniswap and all of that, but I just want to have a swap that has absolutely none of that. Obviously it will require a liquidity in order to be a DEX, but that could be attracted from all routers that is possible, and find the best rate?So what I was thinking; a swap where you can swap any token in many chains. For example if you want to make a swap in ERC20 then it could use uniswap, or any other swap and their liquidity and search for the best one and whatever would give you the best return it will use that. If you want to do BSC then it will use the list and check the best rate there and would help you swap it. It is quite similar to what metamask has, metamask has a swap feature as well where you can turn your tokens into other tokens using metamask, but they actually use other dex places liquidity to do, so you are using metamask but in reality you are swapping on 1inch for example.I just want a website like that. It would have 5 chains for now, maybe add more later. It owuld check dozens and dozens of decentralized exchanges, find the best rates for you, and help you swap your tokens to any token you want with the best rate. And it would not have any native tokens because it is using other places liquidity anyway.Is this possible?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5404622",
  "comments": [
    {
      "author": "Myleschetty",
      "created_time": "June 30, 2022, 07:32:36 PM",
      "body": "The idea of DEXes having their own token is just to enrich their ecosystem and yes, it is possible to build a tokenless DEX but the question asked seems misleading because I am not sure if you're looking for a tokenless DEXes that support multiple or planning to build one.If you're looking for one you checkHashflow supported Ethereum, Avalanche, BSC, Polygon, and Arbitrum chain with a $23.96m Total value locked",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fivestar4everMVP",
      "created_time": "June 30, 2022, 08:33:54 PM",
      "body": "Quote from: Captain Corporate on June 30, 2022, 10:16:54 AMIs this possible?Yes, it is highly possible, like what @Myleschetty said, the idea of having own token is just to enrich the ecosystem, to add to what he said, i did say that having a own token is a way that decentralized exchange raise money for their operations, it also serve as a tool which they use for their marketing.Since they need money to settle a lot of developmental expenses, pay for hosting and the rest, having own token make payment for all this easy and convenient.Now my concern is, in as much as it is possible to operate a non own token decentralized exchange, how are you going to cope? because you must be a billionaire to be able to start an exchange of this kind and keep it running for several years, but in a case where you are not a billionaire, here are my questions...1. How do you plan to keep the exchange running for long if there is no way to raise money, or, are you just going to depend on the small fees you take from users?2. Without own token, how do you plan to market your product?, you need something to use as an incentive, a reward  to encourage traders to use and keep using your exchange, how are you going to make this happen without own tokens?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yogee",
      "created_time": "June 30, 2022, 10:50:32 PM",
      "body": "Didn't Uniswap started without a token? They only airdropped UNI to qualified users at a later date. So that should be enough to say it's possible. I also know BISQ dex for bitcoin don't have a token until now.It will be tough to keep the platform running if the developer of this tokenless \"DEX\" will only rely on rewards from running their own nodes on five different chains. I would rather create a controlled a privacy-centric P2P exchange and earn from commissions than maintain a DEX.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Psynthax",
      "created_time": "June 30, 2022, 11:40:14 PM",
      "body": "Quote from: Captain Corporate on June 30, 2022, 10:16:54 AMIs this possible?That is possible. DEX is not actually need the token to build its ecosystem but the main thing that is actually needed is the profesional programmers that can execute the code. Basically token was not the main thing for the ecosystem. You can build thing and basically that's called as aggregator. 1inch is also aggregator exchange site but this is not supporting so many chain. what about forking 1inch but adding more possibilities to connect with the various chains?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blockman",
      "created_time": "June 30, 2022, 11:45:37 PM",
      "body": "Yes, very possible. I think there's a term that I've read about that before but I can't remember. It's integrated for most chains that the market has. It can be done if there are developers that are willing to do it or a project that focuses on this. Right now, they're focused on their specific chains but hopefully, soon we see something like this. It's very convenient and easy if we see a dex like this.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DoublerHunter",
      "created_time": "June 30, 2022, 11:55:55 PM",
      "body": "Quote from: blockman on June 30, 2022, 11:45:37 PMYes, very possible. I think there's a term that I've read about that before but I can't remember. It's integrated for most chains that the market has. It can be done if there are developers that are willing to do it or a project that focuses on this. Right now, they're focused on their specific chains but hopefully, soon we see something like this. It's very convenient and easy if we see a dex like this.^ But I think they also need tokens because this way they will earn a lot through the token they had use. We have a lot of DEXs that already exist that don't have their own token, the main purpose is just a DEX that operates as a decentralized exchange.I think Bisq exchange dont have tokens, they just only facilitate peer-to-peer or known us p2p trading by relying on automated smart contracts which are to do trades without an intermediary, so I think that is possible.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nurilham",
      "created_time": "June 30, 2022, 11:58:40 PM",
      "body": "It isn't a must that a DEX has its own token. In my opinion, it is optional, not fundamental.Many DEXs have their own tokens to build their ecosystem and for commercial purposes. It is only another side of DEX, not the main thing. Although, if a DEX has its own token, it seems more interesting for investors and developers to take advantage of the DEX's popularity.So, without a token, it is possible to run a DEX.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ItsNotSean",
      "created_time": "July 01, 2022, 01:01:23 AM",
      "body": "Exchange/ Swap tokens are nothing more than loyalty rewards, minus the redeemability. Right now all you can do to \"redeem\" the token is to unload it on the next \"greater fool\" who doesn't realize the token's true value.SwapSpace allows you access to multiple swap services and doesn't have a token. They started a business! and take a very small % of the trade as a fee. These \"reward tokens\" are a gimmick that was enabled by leverage-fuelled bull markets, FOMO and widespread financial and econkmic illiteracy among crypto users. It won't be long before folks learn to see the difference between protocols, currencies and applications. Then all these pointless tokens end up in the bin where they belong.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fosco333",
      "created_time": "July 01, 2022, 06:43:49 PM",
      "body": "I think it would be hard to make a decentralized swap exchange that runs between various chains.We need some kind of bridge to connect between the chains, for example between Ethereum and Binance smart chain network.And if there is one chain that have high transaction fee, then our cost to swap between chains will be high too.Basically, there are many things to consider when we deal with different chains and networks.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Captain Corporate",
      "created_time": "July 01, 2022, 09:21:27 PM",
      "body": "Why does everyone assume that making money means millions of dollars. I just wanted to considering how would building a brand feel like. With this idea, its basically what metamask does, metamask is not a swap at all, you are not going to be a swap in this idea, what I was asking is being a place that does what metamask does for swaps. I do not mean wallet by the way, do not get me wrong. Just because I said metamask, doesn't mean I mean a wallet. No. What metamask does is, you want to turn your X token to Y token in Z chain and they just go out there, check like a dozen dex places, and then they offer you the best return. For this job, they take a bit of a smalll cut.This would be the idea, its a \"swap\" but its not a swap, its just a middleman that finds the best rates for you, and in return takes a tiny bit of cut. Yes it would make a little amount, but who says I wouldn't be happy with just a few hundred dollars per month? That would be fine for me tbf, its just a hobby type of work.Would that work? Is it possible or viable?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NewRanger",
      "created_time": "July 01, 2022, 09:38:00 PM",
      "body": "Quote from: fosco333 on July 01, 2022, 06:43:49 PMI think it would be hard to make a decentralized swap exchange that runs between various chains.We need some kind of bridge to connect between the chains, for example between Ethereum and Binance smart chain network.And if there is one chain that have high transaction fee, then our cost to swap between chains will be high too.Basically, there are many things to consider when we deal with different chains and networks.it will be good project any developers make it happpen, cross chain exchange will be challanges for developers and its worth to support to realize it . Alot dev team developt this feature and so far i know woo network start it. They have zero trading fee and another feature for cross chain liquidity.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "crzy",
      "created_time": "July 01, 2022, 09:44:24 PM",
      "body": "Quote from: fosco333 on July 01, 2022, 06:43:49 PMI think it would be hard to make a decentralized swap exchange that runs between various chains.We need some kind of bridge to connect between the chains, for example between Ethereum and Binance smart chain network.And if there is one chain that have high transaction fee, then our cost to swap between chains will be high too.Basically, there are many things to consider when we deal with different chains and networks.This can be work, if the engineer is good enough most probably he can deliver the required network of the team and the project. You can operate DEX without having your own token but I believe this can only work at first because later on, you’ll realize the importance of having your own token and that could be your next big project, to introduce your own token.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TheClownSong",
      "created_time": "July 01, 2022, 11:08:41 PM",
      "body": "Quote from: crzy on July 01, 2022, 09:44:24 PMQuote from: fosco333 on July 01, 2022, 06:43:49 PMI think it would be hard to make a decentralized swap exchange that runs between various chains.We need some kind of bridge to connect between the chains, for example between Ethereum and Binance smart chain network.And if there is one chain that have high transaction fee, then our cost to swap between chains will be high too.Basically, there are many things to consider when we deal with different chains and networks.This can be work, if the engineer is good enough most probably he can deliver the required network of the team and the project. You can operate DEX without having your own token but I believe this can only work at first because later on, you’ll realize the importance of having your own token and that could be your next big project, to introduce your own token.i think it could work as long as this dex run on certain chain as use its token as transaction gas fee. dex token has no correlation with dex operation, it used only on its governance not as fee. uniswap be an example , this dex token that called UNI not used on each swap but using ethereum. so its the concept dex running on certain chain and dex utility for community itself.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "July 02, 2022, 05:33:38 AM",
      "body": "Quote from: Captain Corporate on June 30, 2022, 10:16:54 AMI just want a website like that. It would have 5 chains for now, maybe add more later. It owuld check dozens and dozens of decentralized exchanges, find the best rates for you, and help you swap your tokens to any token you want with the best rate. And it would not have any native tokens because it is using other places liquidity anyway.Is this possible?Actually its possible. There are plenty of dex that doesnt  have tokens. Its only uniswap that uses a dex that initiate to have a governance tokens. But if you use other platform there are plenty like matcha dex and others too. Most platform like metamask employed dapp to their platform for easy access but you can used their swap feature alone. But the fees is likely high, so better use the dapp and L1 that has more cheaper one than eth.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitstar_coin",
      "created_time": "July 02, 2022, 06:09:06 AM",
      "body": "Isn't what you just describe now similar to the Changelly platform? I think they operate in a decentralized way and use the best rate when exchanging your crypto. Actually, I like the extra little features inside metamask, I see it as very useful and hope that they improve on it to support more networks and more coins/tokens. If it is possible with metamask, it will be possible for a stand-alone platform to operate solely as a dex with no native tokens.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pelana vreo",
      "created_time": "July 02, 2022, 06:35:13 AM",
      "body": "I think http://swft.pro is Dex which has such features, you can exchange from different blockchains, to be precise you can Bridge and many other things, some Dex exchanges which do not have Liquidity are Forkdelta and Etherdelta, these exchanges are popular in 2017 and 2018 before Uniswap came up with the liquidity idea they developed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ice18",
      "created_time": "July 02, 2022, 06:47:24 AM",
      "body": "Yes of course why not? having a dex does not mean you need also a token its just an added feature on a dex to incentivize liquidity provider in this way they can earn this token from dex as a reward so that they can attract more lp providers, the problem with some dex without token is lack of liquidity so if you have enough money to provide a liquidity then you can create a dex with no token.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jawhead999",
      "created_time": "July 03, 2022, 03:01:56 PM",
      "body": "DEX is decentralized exchanges, mean it's literally an exchanges, not a token. In Bitcoin there's a true 100% decentralized exchange e.g. Bisq that doesn't need their own token to create it and you can still trade on there without any KYC.This is similar like a casino too, you don't need to create your own token, but if you have own token it's not wrong too e.g. Betfury, Owlgames. So it's really possible to create DEX without their own token, the thing is they want to get rich quickly.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Abiky",
      "created_time": "July 04, 2022, 01:32:01 AM",
      "body": "Quote from: Captain Corporate on June 30, 2022, 10:16:54 AMI love pancakeswap and uniswap and all of that, but I just want to have a swap that has absolutely none of that. Obviously it will require a liquidity in order to be a DEX, but that could be attracted from all routers that is possible, and find the best rate?So what I was thinking; a swap where you can swap any token in many chains. For example if you want to make a swap in ERC20 then it could use uniswap, or any other swap and their liquidity and search for the best one and whatever would give you the best return it will use that. If you want to do BSC then it will use the list and check the best rate there and would help you swap it.It is quite similar to what metamask has, metamask has a swap feature as well where you can turn your tokens into other tokens using metamask, but they actually use other dex places liquidity to do, so you are using metamask but in reality you are swapping on 1inch for example.I just want a website like that. It would have 5 chains for now, maybe add more later. It owuld check dozens and dozens of decentralized exchanges, find the best rates for you, and help you swap your tokens to any token you want with the best rate. And it would not have any native tokens because it is using other places liquidity anyway.Is this possible?It is possible to create a DEX without a token. But without any form of incentivization or way to collect fees, how do you think your DEX will survive? Some DEXs use the underlying blockchain network's native token to pay for fees and whatnot. Others have their own token that's used for governance purposes.The thing the OP said about swapping any token using other DEXs as liquidity providers sounds more like cross-chain atomic swaps to me. This already exists but I believe it's still experimental. atomicDEX is one of those DEXs where you can swap almost any coin or token by using atomic swaps. Fees are subject to the coins' underlying network congestion, though. We're still in the early stages of DEX adoption, so any idea or proposal to help improve the sector would be of great benefit to the community. Just my thoughts",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}