{
  "id": "topic_5420090",
  "title": "Mintyhd",
  "author": "Mintyhd",
  "created_time": "November 09, 2022, 10:36:47 AM",
  "content": "So, how much exposure do we think cdc will get during the world cup? An average on 700+ million people worldwide watch the world cup final alone. Cronos is obviously an up and coming chain. Do you believe that coins on cdc will get pumped for the month? There's coins like Croge, with Croatian player Brozovic speaking out about it, on the cronoschain that I have been looking at, but with the state if the market currently I'm unsure that the World Cup will help pump cdc or not.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5420090",
  "comments": [
    {
      "author": "MAAManda",
      "created_time": "November 09, 2022, 02:05:02 PM",
      "body": "The world cup is just around the corner, and yes, Crypto.com is sure to get more attention as a sponsor of one of the biggest events in football. However, due to unfavorable market conditions, maybe we can't expect the price of Crypto.com tokens or tokens on the Cronos network to match expectations.But one thing is certain, of course, the presence of Crypto.com as one of the sponsors at FIFA WC will have a good impact on the crypto space as a whole. BTW you are talking about CDC, I want to know what CDC you mean here .",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "drwhobox",
      "created_time": "November 09, 2022, 02:40:53 PM",
      "body": "Many crypto companies are involving big events from last 2 years, it is good for crypto market. New people will know about crypto currency and more publicity for crypto currency. It always good to see a crypto company involved in big events like Fifa World Cup.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lobo13hf",
      "created_time": "November 09, 2022, 02:57:26 PM",
      "body": "Quote from: Mintyhd on November 09, 2022, 10:36:47 AMSo, how much exposure do we think cdc will get during the world cup? An average on 700+ million people worldwide watch the world cup final alone. I would assume only a few percents going to pay attention to the cdc. I meant people might be familiar with crypto who would try to take it . I don't even think people who unfamiliar with it's going to pay attention to exposure that already made by cdc but getting a few percents from around 700 millions in total would be so good. It can give more traffic to the cdc. Quote from: Mintyhd on November 09, 2022, 10:36:47 AMCronos is obviously an up and coming chain. Do you believe that coins on cdc will get pumped for the month?It's hard to say if pump will come. I don't even believe if pump will come in a short time. The problem between CZ and SBF has been going even further with binance was dumping FTT to the bottom. It's even worst with FTX that was halting withdrawal for their users. Quote from: Mintyhd on November 09, 2022, 10:36:47 AM There's coins like Croge, with Croatian player Brozovic speaking out about it, on the cronoschain that I have been looking at, but with the state if the market currently I'm unsure that the World Cup will help pump cdc or not.Wolrld cup may help CDC to get more exposure but im not even sure if world cup would give hype for cdc. World cup become even closer to use but i don't even see any signal to pump cdc at least not for now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "monineklutak",
      "created_time": "November 09, 2022, 03:17:41 PM",
      "body": "Quote from: Mahirap on November 09, 2022, 02:40:53 PMMany crypto companies are involving big events from last 2 years, it is good for crypto market. New people will know about crypto currency and more publicity for crypto currency. It always good to see a crypto company involved in big events like Fifa World Cup.Yes of course that is a good thing for crypto itself let alone being involved in a big event like the FIFA World Cup,all eyes will certainly be on the world cup so it will be very easy to be in the spotlight,This will open up more crypto companies to be involved in big events in the future",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dwminer1",
      "created_time": "November 09, 2022, 03:41:17 PM",
      "body": "Let me remind you that this is not the only project from the crypto world that is among the sponsors of the World Cup. Algorand is the official blockchain platform of FIFA and provide the official blockchain-supported wallet solution. As per the sponsorship agreement, Algorand will be a FIFA World Cup Qatar 2022 Regional Supporter in North America and Europe, and a FIFA Women's World Cup Australia and New Zealand 2023 Official Sponsor.More info here: https://www.fifa.com/about-fifa/president/media-releases/fifa-announces-partnership-with-blockchain-innovator-algorand",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "eaLiTy",
      "created_time": "November 09, 2022, 04:11:52 PM",
      "body": "Quote from: lobo13hf on November 09, 2022, 02:57:26 PM~It's hard to say if pump will come. I don't even believe if pump will come in a short time. The problem between CZ and SBF has been going even further with binance was dumping FTT to the bottom. It's even worst with FTX that was halting withdrawal for their users. There is no guarantee that the price would rally simply because they are sponsoring a major tournament. FTX is one of the official sponsors for the ongoing T20 Cricket World Cup and we all know what is going on with their token. CZ is dumping their token and it is driving the entire market down.Crypto.com is sponsoring the FIFA World Cup and they were a major sponsor in some of the major tournaments for a while including the UFC and as a company they are getting the exposure.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "livingfree",
      "created_time": "November 09, 2022, 10:10:53 PM",
      "body": "Crypto.com is very aggressive in its marketing. Remember the first huge purchase and partnership they've made for the crypto.com arena, the former Staples Center?What's CDC?And is it really official that Crypto.com is the official sponsor of World Cup? AFAIK, they were not the one that's chosen by the management and it's an Indian company that was chosen.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "uneng",
      "created_time": "November 09, 2022, 10:39:54 PM",
      "body": "It seems nothing is going to be pumped this month, therefore the money invested on marketing, especially on major events like world cup, by crypto companies like crypto.com are going to be a waste. It's a pity they didn't match a precise timing between world cup and a positive season in crypto, but that is what reality is imposing to us at this time. Cronos has lost more than 20% market value today, it's bleeding side by side with every cryptocurrencies of the market and there is nothing we can do to revert this tendency right now. Moreover, native tokens are really frowned up by investors after the recent FTX's insolvency.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jawhead999",
      "created_time": "November 12, 2022, 08:05:46 AM",
      "body": "Crypto.com already launch many promotions in sports, but until now there's no much traffic come into their exchanges or people who want to buy their coins. It's make sense because crypto.com charge large fees and strict about KYC, how can anyone will want to use their exchange if they have another alternative that better than crypto.com? They need to launch promotion about their exchange, don't only think about the advertisement or marketing strategy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fuguebtc",
      "created_time": "November 12, 2022, 08:27:58 AM",
      "body": "Quote from: Mintyhd on November 09, 2022, 10:36:47 AMSo, how much exposure do we think cdc will get during the world cup? An average on 700+ million people worldwide watch the world cup final alone. Cronos is obviously an up and coming chain. Do you believe that coins on cdc will get pumped for the month? There's coins like Croge, with Croatian player Brozovic speaking out about it, on the cronoschain that I have been looking at, but with the state if the market currently I'm unsure that the World Cup will help pump cdc or not.The fact that brands in the crypto industry sponsor football teams and major tournaments around the world is not a new thing. I think this will have a positive impact on the entire crypto industry because the world cup is the biggest sports festival on the planet. But whether it has a direct impact on tokens like cro or bnb depends on a lot of factors and cannot be relied on to expect their prices to go up. It is difficult to confirm for Cro or BNB tokens but those Fan tokens are likely to get hype as WC approaches, but it is quite risky to invest in fan tokens, so this is not investment advice.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zasad@",
      "created_time": "November 12, 2022, 05:41:53 PM",
      "body": "https://www.coingecko.com/en/coins/cronosMy friend bought Cronos for the purpose of speculation a month ago. He recently decided to get rid of the asset and buy other cheap coins. He thinks that prices in the crypto market will fall, and I agree with him. Speculating on similar tokens and football team tokens is even more dangerous than buying NFT.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "evichi",
      "created_time": "November 14, 2022, 02:27:01 AM",
      "body": "Crypto.com being one of the official spnsors of FIFA WC may help the platform to gain more exposure, but IMO, such exposure may not grow the value of Cronos (CRO) appreciably if there are no use cases such as: booking flights, Hotels, etc. for the World Cup by liaising with concerned companies/institutions.  I am not sure they have deployed their coins to play such roles in the WC event which I think will help to increase the value of the coin. In any case, it is good news that a crypto platform is one of the sponsors of such world event - as it will help the crypto space gain more acceptance and popularity. In the near future, I think crypto will play roles in major events such as being used for selling tickets: Fans can buy/mint tickets for the World Cup, Olympics, etc. being powered by the blockchain.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hd49728",
      "created_time": "November 14, 2022, 03:28:24 AM",
      "body": "If they are main sponsors for World Cup, it is very great chance for them to advertise Crypto.com globally. The tournament is very big and billions of people globally will watch many matches during the tournaments directly at stadiums, online via televisions, highlights after matches.I only feel some other things. During past several months, I saw collapses of Terra, FTX which sponsored for some stadiums. I hope Crypto.com won't fall into same terrible steps of Terra and FTX.If they succeed, it is good for all crypto enthusiasts because there will be no more black swan event from exchange, panic will slowly disappear.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Maestro75",
      "created_time": "November 14, 2022, 03:52:20 AM",
      "body": "Quote from: uneng on November 09, 2022, 10:39:54 PMIt seems nothing is going to be pumped this month, therefore the money invested on marketing, especially on major events like world cup, by crypto companies like crypto.com are going to be a waste. It's a pity they didn't match a precise timing between world cup and a positive season in crypto, but that is what reality is imposing to us at this time.Do not conclude before the time that it is going to be a waste of funds advertising at the world cup because of the dump going on now. It is true that the market is down but there are some tokens that are still doing well. Look at TW token it is on high now while others are dumping. Now is not a bad time to advertise on cryptos, despite the bear season. Crypto.com is not wasting any money doing that at the world cup. This can infact turn out to be their best strategy that will later be emulated by others.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kelonmusk",
      "created_time": "November 14, 2022, 01:28:12 PM",
      "body": "I had never heard of the CDC before. I agree with some of the previous opinions namely Crypto. com is the biggest and most popular sponsor today.As the world cup approaches, many are hoping to increase the popularity of blockchain and cryptocurrencies. This will open up more crypto companies to take advantage of the profits and get involved in big events in the future.But keep in mind, generally a company that sponsors crypto at the World Cup must have a long time in sports, especially football.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Tony116",
      "created_time": "November 14, 2022, 03:27:47 PM",
      "body": "Quote from: zasad@ on November 12, 2022, 05:41:53 PMhttps://www.coingecko.com/en/coins/cronosMy friend bought Cronos for the purpose of speculation a month ago. He recently decided to get rid of the asset and buy other cheap coins. He thinks that prices in the crypto market will fall, and I agree with him. Speculating on similar tokens and football team tokens is even more dangerous than buying NFT.You are wrong, Cronos is not a football token like fantoken, cronos is native token of crypto.com exchange, it's like FTX's FTT token and binance's BNB. But I think your friend was lucky to sell Cro last month, because crypto.com and gate.io exchanges got caught up in a rumor yesterday. Both are said to be creating fake proof of their reserves of assets and the price of the cro token has dropped by 25%.Although nothing serious, there is a lot of evidence that crypto.com is having problems, so if you use this exchange, quickly withdraw all your money to your personal wallet to avoid unfortunate risks.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "StormHawk",
      "created_time": "November 14, 2022, 03:39:53 PM",
      "body": "If crypto dot com like they should sponsor NBA and Table Tennis I am still not going to invest a penny on the cronos coin.They sent billions worth of asset to other exchange and they covered it up with lies, it's always fine until things get out of hand, it was the same thing Sam said days back before FTX came crashing down.I am staying out of every centralised exchange for good, the only exchange I can consider right now is Binance.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Chainsmokers",
      "created_time": "November 14, 2022, 06:46:22 PM",
      "body": "Crypto.com is indeed part of the sponsorship of the 2022 Fifa World Cup and there is a possibility that CRO will also be affected, but because of rumors about Crypto.com which could be the next FTX which goes bankrupt I still have doubts about CRO being able to pump in the world cup event later , I don't know in the crypto world this is very high risk but if you want to buy CRO, of course now is the right time, and make sure you always look at the news on twitter because if Cypto.com is proven to be bankrupt then this is a disaster for CRO and Bitcoin again.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jaered",
      "created_time": "November 14, 2022, 07:06:55 PM",
      "body": "I think this mire that crypto.com got itself into would be their uplifting. It has somehow given it an opportunity to show it has some liquidity. Remember they finally showed it was all a lie(I mean the low liquidity accusations). Remember no publicity is bad publicity",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}