{
  "id": "topic_5524897",
  "title": "_act_",
  "author": "_act_",
  "created_time": "January 01, 2025, 06:15:45 AM",
  "content": "Switzerland is having a population of 8944699 but needs 100000 signatures from the people to determine if Swiss National Bank will add bitcoin to its reserves. Sgnature collection will end on June 30, 2026. This was decided on December 17, 2024. The publication date was December 31, 2024.https://www.fedlex.admin.ch/eli/fga/2024/3277/it",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5524897",
  "comments": [
    {
      "author": "Free Market Capitalist",
      "created_time": "January 01, 2025, 06:44:08 AM",
      "body": "It is good news but the 100K signatures will be so that a law can be processed in Congress or the corresponding Chamber, it does not mean that if 100,000 people sign (out of a population of 9 million) it will be done. In any case it is another indication of where the world is moving, towards the creation of state bitcoin reserves. And in the case of Switzerland it is the 20th largest economy in the world.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Luzin",
      "created_time": "January 01, 2025, 06:46:50 AM",
      "body": "I once read Switzerland is the number 2 best country as a crypto business. The reason is that they are friendly and open to crypto. I think it's a good move, Bitcoin reserves are starting to gain trust. Although I don't understand the exact number of crypto users in Switzerland. Lastly, I found that there are about 21% of the Swiss population using crypto. That means almost 1.8 million are using crypto. If you look at this amount, the Bitcoin Reserve should be realized soon. Although I read that they were given 18 months to get that support. Source: https://www.reuters.com/markets/currencies/swiss-central-bank-faces-call-hold-bitcoin-reserves-2024-12-31/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zlantann",
      "created_time": "January 01, 2025, 10:02:07 AM",
      "body": "Quote from: _act_ on January 01, 2025, 06:15:45 AMSwitzerland is having a population of 8944699 but needs 100000 signatures from the people to determine if Swiss National Bank will add bitcoin to its reserves. Sgnature collection will end on June 30, 2026. This was decided on December 17, 2024. The publication date was December 31, 2024.https://www.fedlex.admin.ch/eli/fga/2024/3277/itSwitzerland might come later in this Bitcoin reserve race since they will have to wait till 2026. Other nations might implement this idea this year since they don't have the same laws as Switzerland. Other might just need legislative approval and the consent of the president. The race will be fierce immediately the US implements it.Quote from: Luzin on January 01, 2025, 06:46:50 AMI once read Switzerland is the number 2 best country as a crypto business. The reason is that they are friendly and open to crypto. I think it's a good move, Bitcoin reserves are starting to gain trust. Although I don't understand the exact number of crypto users in Switzerland. Lastly, I found that there are about 21% of the Swiss population using crypto. That means almost 1.8 million are using crypto. If you look at this amount, the Bitcoin Reserve should be realized soon. Although I read that they were given 18 months to get that support. Source: https://www.reuters.com/markets/currencies/swiss-central-bank-faces-call-hold-bitcoin-reserves-2024-12-31/The news of some countries joining the Bitcoin reserve train will keep keep increasing this year. Crypto awareness in Switzerland is high, hence there is a possibility that the proposal might get the required signature. Based on this website one in nine Swiss residents invest in cryptocurrencies.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tottong",
      "created_time": "January 01, 2025, 10:08:38 AM",
      "body": "Quote from: _act_ on January 01, 2025, 06:15:45 AMSwitzerland is having a population of 8944699 but needs 100000 signatures from the people to determine if Swiss National Bank will add bitcoin to its reserves. Sgnature collection will end on June 30, 2026. This was decided on December 17, 2024. The publication date was December 31, 2024.Almost most countries are starting to consider adopting bitcoin reserves and this is happening after bitcoin started to show resilience in maintaining its value.This move will make Switzerland one of the countries that are starting to be friendly to bitcoin because previously Switzerland was also one of the countries where the development of the crypto business was quite rapid there.If the signatures are successfully collected, the ratification will cause something better for the journey of bitcoin especially there.From the total number of residents and the signatures needed, it should not be a big problem because Switzerland has long been a country with a fairly large development of the crypto business.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "apogio",
      "created_time": "January 01, 2025, 11:01:30 AM",
      "body": "Quote from: _act_ on January 01, 2025, 06:15:45 AMSwitzerland is having a population of 8944699 but needs 100000 signatures from the people to determine if Swiss National Bank will add bitcoin to its reserves. That's called \"open democracy\".Immediate votes, without intermediaries. I like it.Well, Switzerland has always been a country where valuable assets were stored.It has some of the bigger gold reserves in the world.I reckon they can have some of the biggest Bitcoin reserves as well.Fun fact is, I will be there for the next months (perhaps years). I will see how they behave and act in regards with Bitcoin. Do they support the idea, or not?! Will see.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mia Chloe",
      "created_time": "January 01, 2025, 11:17:36 AM",
      "body": "Quote from: _act_ on January 01, 2025, 06:15:45 AMSwitzerland is having a population of 8944699 but needs 100000 signatures from the people to determine if Swiss National Bank will add bitcoin to its reserves. Sgnature collection will end on June 30, 2026. This was decided on December 17, 2024. The publication date was December 31, 2024.https://www.fedlex.admin.ch/eli/fga/2024/3277/itPersonally I think the news of different countries these days planning to set up and implement bitcoin reserves is actually proof that the government is looking to take advantage of bitcoins volatility. Before now (that is actually before the most recent 100k+ pump) you hardly find countries dictate on implementing bitcoin reserves in fact most of the time bitcoins seized by the government are sold off almost immediately.Quote from: apogio on January 01, 2025, 11:01:30 AMWell, Switzerland has always been a country where valuable assets were stored. It has some of the bigger gold reserves in the world.I reckon they can have some of the biggest Bitcoin reserves as well.Fun fact is, I will be there for the next months (perhaps years). I will see how they behave and act in regards with Bitcoin. Do they support the idea, or not?! Will see.Yes Switzerland has been a good crypto currency supporting country compared to a couple of other countries but still implementing bitcoin reserves is a big move and it would definitely have a positive impact on their economy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Shishir99",
      "created_time": "January 01, 2025, 11:21:26 AM",
      "body": "Quote from: _act_ on January 01, 2025, 06:15:45 AMSwitzerland is having a population of 8944699 but needs 100000 signatures from the people to determine if Swiss National Bank will add bitcoin to its reserves. Sgnature collection will end on June 30, 2026. This was decided on December 17, 2024. The publication date was December 31, 2024.https://www.fedlex.admin.ch/eli/fga/2024/3277/itThat is a long time! 1.5 years is enough time to collect 100K signatures. I wonder if it will be possible to submit the report before the deadline if they manage to collect 100K signatures. I am more concerned about the crypto tax around the world. It seems the lowest tax on it was 22% in a country, but the rest of the countries charge more than 30%, even some of them even charge up to 50% tax.I feel like, only the government institutions are planning to take over the crypto market. Because those entities won't have to pay taxes (if I am not wrong), but the average people will pay those high taxes. Anyway, good to see some positive move from Switzerland.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yhiaali3",
      "created_time": "January 01, 2025, 11:29:16 AM",
      "body": "The irony is that I find this news strange because Switzerland contains the largest and most important banks that are considered a haven for the money of countries and individuals from all over the world and receive billions of dollars annually, as the world's richest people seek to deposit their money in Swiss banks to evade taxes in their home country.In any case, I hope that they will be able to collect the necessary signatures to pass a law to Congress to be discussed and voted on, Switzerland is one of the countries with the most open financial laws and if approved, this will be new positive news for crypto at the beginning of the new year.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "January 01, 2025, 11:37:04 AMLast edit: January 01, 2025, 12:49:19 PM by pooya87",
      "body": "Quote from: apogio on January 01, 2025, 11:01:30 AMQuote from: _act_ on January 01, 2025, 06:15:45 AMSwitzerland is having a population of 8944699 but needs 100000 signatures from the people to determine if Swiss National Bank will add bitcoin to its reserves. That's called \"open democracy\".Immediate votes, without intermediaries. I like it.That is more like a weird implementation of democracy where 1% of the population has to vote for something to become the law for 100% of the population!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NeuroticFish",
      "created_time": "January 01, 2025, 11:44:06 AM",
      "body": "Quote from: _act_ on January 01, 2025, 06:15:45 AMSgnature collection will end on June 30, 2026. This was decided on December 17, 2024. The publication date was December 31, 2024.This is a very interesting timeline because people will sign while the price goes up (bull run is expected to go on during 2025), then the buying will happen while the price may go down.I'm curious though if they will not abort this in 2026 just because the price may go down making nocoiners go back to the \"I don't buy that shit\" phase.I'm curious if they will go for it how much more expensive they'll buy, compared to the current price.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ziskinberg",
      "created_time": "January 01, 2025, 11:59:39 AM",
      "body": "It's quite hard to convince 100,000 people to sign if most of the popular crowd doesn't understand what Bitcoin is, or at least its risks and potential if the government considers it as a reserve. So, I highly doubt this will happen. Although I like the idea, is it really necessary to gather that many signatures? Maybe there's another way to approach this.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BIT-BENDER",
      "created_time": "January 01, 2025, 12:35:55 PM",
      "body": "Quote from: Poker Player on January 01, 2025, 06:44:08 AMIt is good news but the 100K signatures will be so that a law can be processed in Congress or the corresponding Chamber, it does not mean that if 100,000 people sign (out of a population of 9 million) it will be done. In any case it is another indication of where the world is moving, towards the creation of state bitcoin reserves. And in the case of Switzerland it is the 20th largest economy in the world. If the 100k signature is achieved that's a very good start to it getting achieved, I think is the signature exceeds a hundred thousand by a long distance it can also influence positively the final decision because they would have to consider the people's opinion. Switzerland has always be a financially strong nation and they have one of the best individuals account protected banking system if their is one country that would adopt Bitcoin in the coming years I would have thought about them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Davidvictorson",
      "created_time": "January 01, 2025, 12:37:50 PM",
      "body": "Switzerland is one country that deserves a standing ovation. No bs talk. Straight down to business no need to call the politician to debate it - the power lies with the people. A country that respects its people will always look out for their best interest. I have followed your previous threads, we have three countries on the list now that have made mention of adding bitcoin to its reserve, the U.S, China(a legislator pushing for this) and now Switzerland. Switzerland's approach is more direct. They will likely be the first to add bitcoin to its reserves if Trump disappoints us.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oshosondy",
      "created_time": "January 01, 2025, 01:01:38 PM",
      "body": "Quote from: Ziskinberg on January 01, 2025, 11:59:39 AMIt's quite hard to convince 100,000 people to sign if most of the popular crowd doesn't understand what Bitcoin is, or at least its risks and potential if the government considers it as a reserve. So, I highly doubt this will happen. Although I like the idea, is it really necessary to gather that many signatures? Maybe there's another way to approach this.I also think this is not necessary. Their lawmakers is enough to make things appropriate. They know what bitcoin is and they know that bitcoin is the future and it is an asset that its value is increasing and it is a hedge against inflation and also a store of value. There is no need to make their citizens to do something like this. They can easily just pass it into law if their Senate support it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kemarit",
      "created_time": "January 01, 2025, 01:15:59 PM",
      "body": "Quote from: _act_ on January 01, 2025, 06:15:45 AMSwitzerland is having a population of 8944699 but needs 100000 signatures from the people to determine if Swiss National Bank will add bitcoin to its reserves. Sgnature collection will end on June 30, 2026. This was decided on December 17, 2024. The publication date was December 31, 2024.https://www.fedlex.admin.ch/eli/fga/2024/3277/it18 months to collect the signature, and if it is successful then it will go to the Swiss Federal and then before they will decided if amendments will be made in their constitution. So it might take after 2026 for them to put Bitcoin as  their reserved.Obviously in their constitutions it is only Gold just like the rest of world.So again it's the Trump effect, I know certain people here doesn't like Trump and for sure they will dismissed the trickle down effect.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rodskee",
      "created_time": "January 01, 2025, 01:32:32 PM",
      "body": "Quote from: _act_ on January 01, 2025, 06:15:45 AMSgnature collection will end on June 30, 2026. This was decided on December 17, 2024. The publication date was December 31, 2024.the signature collection will only end in 2026 which is why i am sure that there would be enough signatures when that time comes or maybe even earlier than that more people will realize how much beneficial bitcoin can be especially when they see how it will affect usa's economy and other countries that will follow the only con here is that they might be a little later than other countries who have already started their bitcoin journey",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "freedomgo",
      "created_time": "January 01, 2025, 02:18:50 PM",
      "body": "When it comes to laws being proposed that require people’s signatures, they’re most likely to fail because people want to see instant results, things that directly address basic needs, like health insurance. I’m not entirely sure how laws work in this country, but why was it possible in El Salvador to make Bitcoin legal tender without needing such a signature campaign?As far as I know, a signature campaign is usually required when there’s a major change to the law, especially when it involves a large amount of money or has a huge impact, typically billions of dollars. While I doubt this will be realized, I’m still hoping it happens.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "2Pizza410000BTC",
      "created_time": "January 01, 2025, 02:40:10 PM",
      "body": "Quote from: Ziskinberg on January 01, 2025, 11:59:39 AMIt's quite hard to convince 100,000 people to sign if most of the popular crowd doesn't understand what Bitcoin is, or at least its risks and potential if the government considers it as a reserve. So, I highly doubt this will happen. Although I like the idea, is it really necessary to gather that many signatures? Maybe there's another way to approach this.Although it is not very important to get signatures, the government does not want it to carry everything on its own. The government may be creating an opportunity to legalize Bitcoin in its country by obtaining permission from the people of its country. There may come a time when the people of that country may criticize the government, perhaps the government is accepting signatures from the people so that the people cannot criticize them. It is not difficult to receive 100000 signatures, perhaps 100000 signatures will be received quickly. However, the question is, will the government quickly legalize Bitcoin after the quick signatures? Or will it just accept the signatures?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Free Market Capitalist",
      "created_time": "January 01, 2025, 02:41:47 PM",
      "body": "Quote from: pooya87 on January 01, 2025, 11:37:04 AMThat is more like a weird implementation of democracy where 1% of the population has to vote for something to become the law for 100% of the population! As I have commented before, the 100K signatures are not for it to be approved, it is so that it can be processed legislatively, so that it can begin its path, not so that it can be approved.I asked ChatGPT how the popular legislative initiative works and here you have the result (which is far from 1% determining what to do):QuoteIn Switzerland, popular initiative legislation is a cornerstone of its direct democracy. It allows citizens to propose changes to the Swiss Constitution through a direct vote. Here's how it works:  ### 1. **Proposal Initiation**     - A group of citizens drafts a proposal to amend the Swiss Constitution. The proposal can pertain to any subject, provided it does not violate mandatory international law.### 2. **Signature Collection**     - The initiators must collect **100,000 valid signatures** from Swiss citizens within **18 months**. Each signature must include a declaration of support and the signatory's identification details.### 3. **Submission and Verification**     - The collected signatures are submitted to the Swiss Federal Chancellery for verification. If the requirement is met, the initiative is formally submitted to the Federal Assembly.### 4. **Federal Assembly Review**     - The Federal Council and Federal Assembly analyze the initiative. They:     - Decide whether the initiative is valid (e.g., conforms to procedural requirements and mandatory international law).     - Formulate a recommendation for or against the proposal.     - Optionally draft a **counterproposal** if they believe a modified version of the initiative could address the issue better.### 5. **Public Vote**     - The initiative, along with any counterproposal, is put to a nationwide referendum. Swiss voters decide:     - Whether to accept or reject the original proposal.     - Whether to accept the counterproposal, if applicable (in a **double yes vote**, voters indicate their preference if both are approved).### 6. **Approval Requirements**     - For the initiative to pass, it requires a **double majority**:     - A majority of voters across Switzerland (**popular majority**).     - A majority of **cantons** (based on their internal vote results).### 7. **Implementation**     - If approved, the initiative becomes part of the Swiss Constitution. The Federal Assembly enacts the necessary laws or ordinances to implement it.### Key Features:  - **Binding:** Initiatives that pass must be implemented.  - **Counterbalance:** The Federal Assembly often proposes counterproposals to guide voters towards alternative solutions.  - **Inclusivity:** Allows citizens direct influence over the nation’s governance.  This system fosters political engagement but also requires balancing direct democracy with representative governance.Quote from: 2Pizza410000BTC on January 01, 2025, 02:40:10 PMIt is not difficult to receive 100000 signatures, perhaps 100000 signatures will be received quickly. However, the question is, will the government quickly legalize Bitcoin after the quick signatures? Or will it just accept the signatures?Read just what I have posted.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}