{
  "id": "topic_5407279",
  "title": "Frankolala",
  "author": "Frankolala",
  "created_time": "July 22, 2022, 06:40:25 PM",
  "content": "As a newbie who want to know more about this forum ,I want to know the highest number of activities will a newbie get no matter the numerous post and comment on a thread per day.             Rank.                 Number of activities per day      Newbie      Jnr Member       Member    Snr Member    Legendary  Hero Member     Someone can be a newbie and have 50 merits in a week does not mean you have upgraded to a member level.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5407279",
  "comments": [
    {
      "author": "OmegaStarScream",
      "created_time": "July 22, 2022, 06:42:10 PM",
      "body": "You can only gain a maximum of 14 activity points per 2 weeks period. You can find the exact dates here: https://bitcointalk.org/index.php?topic=582736.0Your activity can't be higher than your post count though, as you can see in your current situation. You have potential activity of at least 28 but you can't reach that until you make enough posts.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cookdata",
      "created_time": "July 22, 2022, 06:44:52 PM",
      "body": "Every member is limited to 14 activity in a period regardless of every number of posts, comments and replies you make. Your activity will keep counting as your number of post increases but the moment you reach 14 activity, it will stop until when another period activated. Basically, each period activate every 14 days/ 2 weeks.You can track when new period of activity activate with this spreadsheet",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Upgrade00",
      "created_time": "July 22, 2022, 08:07:15 PM",
      "body": "All the figures above are correct, but there is one point to note; New members can realistically get more than 14 activity in a 2 week period.The 2 week activity period is fixed for all member, so if one joins in closer to the end of the 14 day period and make more than 14 posts, they would get the full 14 activity points.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hosemary",
      "created_time": "July 22, 2022, 08:18:28 PM",
      "body": "Quote from: Cookdata on July 22, 2022, 06:44:52 PMEvery member is limited to 14 activity in a period regardless of every number of posts, comments and replies you make. Not quite true.Assume that you made 1 post in the first two-week activity period and 1 post in the second two-week activity period and now you are in the third period. In the third activity period, you can make 40 posts and get 40 activity.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "July 22, 2022, 09:42:03 PM",
      "body": "Quote from: Frankolala on July 22, 2022, 06:40:25 PMAs a newbie who want to know more about this forum ,I want to know the highest number of activities will a newbie get no matter the numerous post and comment on a thread per day.I think you all have all the answers needed, just know that if you are active on this forum and your posts is always more, or at least you are having one posts per day, your activity will count 14 in every 14 days. Exceptional case is when you first register an account on this forum that 1 post will count 1 activity immediately until you have 14 posts already, second is what hosseinimr93 posted about. But you do not have to focus on activity, just have good quality posts and enjoy being here with us.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dunamisx",
      "created_time": "July 22, 2022, 09:48:57 PM",
      "body": "Quote from: hosseinimr93 on July 22, 2022, 08:18:28 PMQuote from: Cookdata on July 22, 2022, 06:44:52 PMEvery member is limited to 14 activity in a period regardless of every number of posts, comments and replies you make. Not quite true.Assume that you made 1 post in the first two-week activity period and 1 post in the second two-week activity period and now you are in the third period. In the third activity period, you can make 40 posts and get 40 activity. Correct me if am wrong, base on my understanding on how the activity works, just as you've said was right but it stops at a certain point in time to begin the count after each 14 days, now when this happens, regardless if you're making 10 posts per day will not add up to your activities any longer not until after each 14 days, also remember there's no merit requirements for activities, what determines that is your post count, while ranking up required both Merits and activities, from the link provided below, you will discover some taughts about the activity requirements and calculations involved  Link to the Rank, Activity and Merit points calculator, v2 but as a beginner it is advisable to remain active on the forum, make posts but not in other to increase your activities which may result to spamming, activities is calculated every Wednesday after 14 days and you don't need to request that to be done, the forum admin have that taken care of once you're active.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DdmrDdmr",
      "created_time": "July 23, 2022, 01:37:24 PM",
      "body": "Quote from: Dunamisx on July 22, 2022, 09:48:57 PMCorrect me if am wrong <…>It’s really as was stated above: If you’ve reached the end of a 2 week Activity window, made at least 1 post, but earned less that 14 Activity points within that window, you can regain some/all of that backtracked Activity in any future Activity window by simply posting more than 14 posts. i.e. Theoretical example taken to the extreme:2 week Activity Window 1: I make 1 post   -> Activity=12 week Activity Window 2: I make 0 posts -> Activity=12 week Activity Window 3: I make 2 posts -> Activity=32 week Activity Window 4: I make 50 posts -> Activity= 42-   During the first Window I made only one post, so I got 1 Activity point (but 13 potential more to make up for in the future).-   During the second Activity window I didn’t post, so my Activity counter did not increase. Since I didn’t post in this window, I cannot reclaim any Activity from this window in the future.-   During the third Activity window I made 2 posts, gaining 2 more Activity points (total =3 now). I also earned the right to reclaim 12 additional Activity points in the future.-   On the forth Activity Window I went crazy and made 50 post. That gives me 14 Activity points from this Activity window, but also allows me to reclaim 13 Activity points from the first window and 12 from the third window. That is to say, with 39 posts during this forth Activity window I reclaimed 39 Activity points. The other 11 posts I made do not generate any past/present/future Activity points.Taken to the real extreme, unless there is a limit of which I am not aware of, If I made 1 single post in every activity window for 100 Activity periods (each consisting of 2 weeks), I could on Activity period 101 make 1314 posts and claim 1314 Activity points (14 from the current Activity Window + 100*13 Activity recoverable points). I’d also get banned for sure …",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SquirrelJulietGarden",
      "created_time": "July 23, 2022, 02:07:48 PM",
      "body": "Max 14 activities in 2 weeks of the forum activity counting. You can post more than 14 posts in 2 weeks but only 14 posts will be counted as 14 activities.The uncounted posts (15+) will be counted for the next 2 weeks with a condition that you must post at least 1 post next two weeks.Activities are not important for members to rank up. Their contribution and post quality help them to receive merit from other members including merit sources and rank up.FAQ: Everything you need to know about forum 'activity, account ranks and meritQuoteCan I get more than 14 activity in two week period?No. However, you can technically get more than 14 activity in a fortnight if you sign up in between periods, but you can't get more than 14 activity in a fortnightly period. For instance, if the period starts on a Wednesday and you sign up on Tuesday you can get 14 points on Tuesday and another 14 on Wednesday providing the period has started. You will then have 28 activity points but won't be able to get any more until two weeks' time when the new period starts.What happens if I miss a period?Nothing. You just won't get that activity and you miss that activity forever. Just make sure to post in the next period to get another 14.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "_BlackStar",
      "created_time": "July 23, 2022, 02:26:42 PM",
      "body": "Quote from: SquirrelJulietGarden on July 23, 2022, 02:07:48 PMMax 14 activities in 2 weeks of the forum activity counting. You can post more than 14 posts in 2 weeks but only 14 posts will be counted as 14 activities.Activity point are not the same as activities, I hope you understand. Don't trust the raw translation from google.  Quote from: SquirrelJulietGarden on July 23, 2022, 02:07:48 PMActivities are not important for members to rank up. Their contribution and post quality help them to receive merit from other members including merit sources and rank up.Number of posts - activity point - merit are 3 things needed to rank up. If you don't meet the required number of activity point then you won't rank up even if your post count and merit has reached thousands. Contribution and quality of posts will help you earn more merit than spammers, and will also open up opportunities for you to rank up faster than them. So because activity point, merit and number of posts are requirements for rank up, then you must meet those requirements.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SquirrelJulietGarden",
      "created_time": "July 23, 2022, 03:10:15 PM",
      "body": "Quote from: _BlackStar on July 23, 2022, 02:26:42 PMActivity point are not the same as activities, I hope you understand. Don't trust the raw translation from google.  No translation here.In forum, activities will be counted to activity point or will be skipped. On profile, you only see activity, no activity point and if you have a plural of it, it is activities.QuoteNumber of posts - activity point - merit are 3 things needed to rank up. If you don't meet the required number of activity point then you won't rank up even if your post count and merit has reached thousands. Contribution and quality of posts will help you earn more merit than spammers, and will also open up opportunities for you to rank up faster than them. So because activity point, merit and number of posts are requirements for rank up, then you must meet those requirements.I think my post is clear and the topic I gave is clear too.Quote from: theymos on September 23, 2018, 08:58:25 PMIf you want to maximize your rank, then you need to increase two statistics which are listed on your profile:Activity, which is maximized by posting once per day on average. Posting more than that is useless in raising your activity.Merit, which is gained by making good posts.If you make ten thousand posts in a week, your activity will be capped and you will still be a Newbie. If you make ten thousand useless posts over any period of time, you will gain zero merit and you will still be a Newbie. You can rank up only by making good posts consistently. It's quality over quantity.When trying to write quality posts, a lot of people act as though they're writing a book report for school: putting facts that we already know into their own words. Nobody wants to read that, and you will not get merit for it. Moreover, the length of your post and the quality of your English are only minor factors. In trying to write a quality post worthy of merit, you should offer new ideas, personal experiences, or perspectives that other forum users will actually find new and interesting.I wish you will receive merit for this post.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "_BlackStar",
      "created_time": "July 23, 2022, 03:37:27 PM",
      "body": "Quote from: SquirrelJulietGarden on July 23, 2022, 03:10:15 PMIn forum, activities will be counted to activity point or will be skipped. On profile, you only see activity, no activity point and if you have a plural of it, it is activities.What I understand is, activity points will be calculated based on the posts you made while active on the forum and the value will only be limited to 14 point for a 14 day period even if you make 15 posts or more during that period. Meanwhile, in my opinion, the activities does not require us to post because it can also be intended as active reading or something else or more precisely called being active in the forum either as a guest or with one of the accounts. But since I think you understand what I mean, then I think the discussion is enough.  Quote from: SquirrelJulietGarden on July 23, 2022, 03:10:15 PMI wish you will receive merit for this post. For what? Does my post seem to be fishing for merit?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nakamura12",
      "created_time": "July 23, 2022, 10:00:37 PM",
      "body": "The activity points that a forum user will get is the same for all no matter what rank you have. There is a thread about it which you can check by clicking the link provided above. To increase activity points is to post but all post won't help getting more activity points when you posted more than 20 for example as I have said earlier, all forum users will the same amount of activity points which is 14 for 14 days or 2 weeks.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bhig Daddy",
      "created_time": "August 09, 2022, 10:28:35 PM",
      "body": "All the given information above are correct, so I don't think there is much to say about this topic, so just keep asking questions where you feel lost or need help. This forum will always be there for you and make sure keep reading because you know information is knowledge they say.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Tellarmachine",
      "created_time": "August 10, 2022, 05:45:04 PM",
      "body": "Thanks, my dear Frankolala. Your topic question has provoked answers from matured forum members that had gone a long way to speed up my little or no knowledge of how posts could, and not add up to activity. Or, to simply put, the difference between posts and activity.But, sincerely speaking, I have to agree immensely with what said Legendary Charles-Tim:' you do not have to focus on activity, just have good quality posts and enjoy been here with us.' That is exactly my take also on the issue. And, it has been it ever since I entered the forum. I do love content writing, contributing genuine ideas and skillful trading. And that's what the Bitcointalk forum is largely all about. Correct me if I am wrong.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cryptomultiplier",
      "created_time": "August 10, 2022, 09:33:44 PM",
      "body": "I had never reasoned there were some serious calculus involved with being active on this forum till now. Nice one @Frankolala.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}