{
  "id": "topic_5428489",
  "title": "Alpha Marine",
  "author": "Alpha Marine",
  "created_time": "December 14, 2022, 08:34:09 AM",
  "content": "$1.9 billion have been reportedly withdrawn from binance in the past 24 hours. This may be just be FUD and nothing is actually going to happen but we all know no matter the times we're in it's never advisable to keep your money in exchanges. I've seen this warning so much you'll think everybody knows this by now.Please take you money off exchanges, not just binance.  https://www.reuters.com/technology/binance-sees-withdrawals-19-billion-last-24-hours-data-firm-nansen-says-2022-12-13/?utm_source=reddit.com",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5428489",
  "comments": [
    {
      "author": "avikz",
      "created_time": "December 14, 2022, 09:04:37 AM",
      "body": "I agree with you! I hope nothing bad will happen to Binance. Cz is a rock solid business tycoon so I am sure he will take necessary steps to ensure our money is safe. But there's no guarantee about US regulatory bodies who are launching probes against Binance. It's always a very good practice to withdraw your money from any exchanges and not only Binance. Unless you have the control on your own bitcoin through your own wallet, anything can happen!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Solosanz",
      "created_time": "December 14, 2022, 09:16:30 AM",
      "body": "It's really a thing? people just withdraw their coins from Binance which actually mean they're have a plan to hold the coins for long time and not sold the coins since it's not on exchange. It's just funny how you can say it's FUD when whales withdraw their coins, it wouldn't affect anything. Actually it just affect to CZ, does CZ use customers money for risky investment or trading? we only know if everyone start to withdraw their money from Binance.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Z-tight",
      "created_time": "December 14, 2022, 09:21:12 AM",
      "body": "Quote from: avikz on December 14, 2022, 09:04:37 AMCz is a rock solid business tycoon so I am sure he will take necessary steps to ensure our money is safe. But there's no guarantee about US regulatory bodies who are launching probes against Binance. The BTC network is meant to be a trustless one, and while you are correct that CZ is a business tycoon, but he surely would not hesitate to use people's money to invest and make returns for himself, or engage in other shady businesses that can sometimes go out of his control and cause problems and losses for creditors.It goes without saying that no crypto person should trust CZ (or any service or person at all) to keep their money safe for them, even if there was never a thing like this probe, only trust yourself to keep your money safe, and that is with your keys in your own self-custody, and with your recovery phrase written down on paper and backed up in more than one location.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "December 14, 2022, 09:23:18 AM",
      "body": "Withdraw your coins off exchanges if they aren't being traded in the first place regardless what the exchange is; and always use a Ledger/Trezor hardware wallet.On the other hand if you're actively trading, probably take the funds out temporarily — just to be extra sure, even though I personally doubt that Binance is insolvent.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Freddie Boyer",
      "created_time": "December 14, 2022, 09:33:22 AM",
      "body": "FUD is a very strong force in the market right now and it seems to be contagious and in my opinion as a user I don't feel worried about my funds. There are many reasons for someone to use Binance, but the most important is security. i see everything is fine only the situation is no different than before it's just that i hope it won't be shut down by any regulator.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "laurenB7742",
      "created_time": "December 14, 2022, 09:36:55 AM",
      "body": "Quote from: avikz on December 14, 2022, 09:04:37 AMI agree with you! I hope nothing bad will happen to Binance. Cz is a rock solid business tycoon so I am sure he will take necessary steps to ensure our money is safe. But there's no guarantee about US regulatory bodies who are launching probes against Binance. It's always a very good practice to withdraw your money from any exchanges and not only Binance. Unless you have the control on your own bitcoin through your own wallet, anything can happen! This isn't the first time Binance has had Fuds and to be honest, I'm not surprised those forces attacked them. Because the collapse of FTX for whatever reason, had a bit of an impact from CZ, it was inevitable that he would be hit with retaliation. I also follow this for the past few days, even though binance is facing massive withdrawals, they are still doing very well, and users have no problems. This will be a test with binance.Should not leave money on centralized exchanges, this should have been done a long time ago, don't wait until now. Don't put money on centralized exchanges, including Binance.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sayeds56",
      "created_time": "December 14, 2022, 09:37:16 AM",
      "body": "Quote from: Alpha Marine on December 14, 2022, 08:34:09 AM$1.9 billion have been reportedly withdrawn from binance in the past 24 hours. This may be just be FUD and nothing is actually going to happen but we all know no matter the times we're in it's never advisable to keep your money in exchanges. I've seen this warning so much you'll think everybody knows this by now.Please take you money off exchanges, not just binance.  https://www.reuters.com/technology/binance-sees-withdrawals-19-billion-last-24-hours-data-firm-nansen-says-2022-12-13/?utm_source=reddit.comThis news has created panic in the market and every account holder of Binance is worried and skeptical to continue holding his funds in  Binance account or withdraw them and close the account. its peroneal decision of everyone to continue with Binance or quit, but I think Binance will not collapse like FTX or LUNA because it is a cash rich company & too big to fail, however it may face some legal issues in USA but Binance representative told Reuters that they have not done anything wrong. DYOR",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Z-tight",
      "created_time": "December 14, 2022, 12:28:32 PMLast edit: December 14, 2022, 01:26:15 PM by Z-tight",
      "body": "Quote from: Freddie Boyer on December 14, 2022, 09:33:22 AMFUD is a very strong force in the market right now and it seems to be contagious and in my opinion as a user I don't feel worried about my funds.I will advise you to take every danger signs coming out of centralized exchanges seriously, do not dismiss them as fud, recent events should teach you the obvious reasons why. The latest event was ftx, and when the storm started slowly people called it fud, now their money is gone and Sam Bankman-Fried acts stupid during interviews of him being asked about what happened, while victims mourn losses of funds they can never recover from. You should feel worried about your funds if it is stored in a centralized exchange.QuoteThere are many reasons for someone to use Binance, but the most important is security. i see everything is fine only the situation is no different than before it's just that i hope it won't be shut down by any regulatorYou have to get it straight that your funds are not secured when they are in your Binance wallet. If there is a sense of danger always act in advance and take your money out of the exchange before it is too late, everything may look fine until it is not, and hence it would be late then.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "avikz",
      "created_time": "December 14, 2022, 01:27:24 PM",
      "body": "Quote from: Z-tight on December 14, 2022, 09:21:12 AMQuote from: avikz on December 14, 2022, 09:04:37 AMCz is a rock solid business tycoon so I am sure he will take necessary steps to ensure our money is safe. But there's no guarantee about US regulatory bodies who are launching probes against Binance. The BTC network is meant to be a trustless one, and while you are correct that CZ is a business tycoon, but he surely would not hesitate to use people's money to invest and make returns for himself, or engage in other shady businesses that can sometimes go out of his control and cause problems and losses for creditors.It goes without saying that no crypto person should trust CZ (or any service or person at all) to keep their money safe for them, even if there was never a thing like this probe, only trust yourself to keep your money safe, and that is with your keys in your own self-custody, and with your recovery phrase written down on paper and backed up in more than one location.People are meant to do a lot of other things but we need to look into the reality. Binance is the world's biggest crypto exchange and they have kept their position since a long time. So no matter what the ideal scenario looks like, people are still using centralized exchanges. But the problem is that, people also keep their money into those exchanges. They don't usually pull out their funds. So whenever something bad happens for an exchange, people loose money. We have so many past incidents but it seems people have not learnt the correct way.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaveF",
      "created_time": "December 14, 2022, 02:33:42 PM",
      "body": "I still don't get it. Exchange after exchange implode / do a cut and run / are just scams and people have to keep being told not to keep their coins on exchanges.Not your keys not your coins. We keep saying it, while others keep telling people to just put your money someplace else, it's all safe don't worry CZ won't run with your coins.Same as Big Vern would not, same as SBF knows what he is doing and so on.Feel like I'm talking to a wall. So yes, get your coins out of binance, and every other exchange.-Dave",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cabron",
      "created_time": "December 14, 2022, 02:44:39 PM",
      "body": "If you don't buy and sell then just get it out and let the traders trade after all it's their space.It would be interesting to see how CZ's overview of all these since it seems like an attack to them as retaliation to what he did to FTX. CZ is trying to become the leader of the crypto undermining US regulators which is more dangerous than SBF trying to rat out his backers on the congress committee.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rikafip",
      "created_time": "December 14, 2022, 03:34:43 PM",
      "body": "Quote from: DaveF on December 14, 2022, 02:33:42 PMI still don't get it. Exchange after exchange implode / do a cut and run / are just scams and people have to keep being told not to keep their coins on exchanges.Worst of all, many of them that still use Binance for hodl are not newbs or uninformed, but they simply think that Binance is too big to fail. One of my good friends have (or had) mid 5 digit number in Celsius, and even after that failure he still has probably similar amount on Binance as well. We asked him few days ago why he doesn't move it all out considering the recent news, to which he replied that he is just too bored to unstake everything that he has there. And that guy is in crypto for like 10 years, and not some ignorant newb who doesn't even have hardware wallet or doesn't know how to store his coins safely.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "December 14, 2022, 04:42:11 PM",
      "body": "Personally, I do not expect that the Binance administration will be in the same chaos as in the rest of the platforms, or at least FTX, but we are used to that anything can happen. Therefore, as a precaution, you are not supposed to leave your coins in any platform unless you need to trade, and you are supposed to keep the rest of your coins in cold storage.In general, do not be the reason for spreading these rumors, withdraw your money, and always remember not to repeat it on the platform, whether it is a real rumor or not.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "The Cryptovator",
      "created_time": "December 14, 2022, 06:36:53 PM",
      "body": "There is little skepticism surrounding Binance. Funds should not be hold to any exchange, including Binance. However, keep in mind that if Binance fails, the value of your funds will be significantly reduced due to the market crash. Whatever we're holding will be in serious trouble. The market will immediately fall, and as a result, the value of all coins will drop like a stone. I hope nothing bad happens and that this is all rumor. Binance has created a crypto ecosystem, and many things are associated with it. As a result, the collapse of Binance due to law enforcement will not bode well for the crypto industry.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sayeds56",
      "created_time": "December 15, 2022, 06:45:45 AMLast edit: December 15, 2022, 07:32:02 AM by Sayeds56",
      "body": "Quote from: The Cryptovator on December 14, 2022, 06:36:53 PMThere is little skepticism surrounding Binance. Funds should not be hold to any exchange, including Binance. However, keep in mind that if Binance fails, the value of your funds will be significantly reduced due to the market crash. Whatever we're holding will be in serious trouble. The market will immediately fall, and as a result, the value of all coins will drop like a stone. I hope nothing bad happens and that this is all rumor. Binance has created a crypto ecosystem, and many things are associated with it. As a result, the collapse of Binance due to law enforcement will not bode well for the crypto industry.Holding funds in personnel hard wallets is the most secure method to store crypto currencies and we should only connect it with trading platform when we buy or sell any asset. The history of crypto industry vindicates that everyday comes with new surprise & anything can happen to any exchange but, thinking of collapse of Binance is a horrible dream, because it is the engine of crypto train, it has grown so big that its failure will give so huge damage to crypto which will take many many years to recover. I hope it won't happen &  Binance will continue attracting new investment by its innovative projects.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Alpha Marine",
      "created_time": "December 15, 2022, 07:48:30 AM",
      "body": "Quote from: The Cryptovator on December 14, 2022, 06:36:53 PMThere is little skepticism surrounding Binance. Funds should not be hold to any exchange, including Binance. However, keep in mind that if Binance fails, the value of your funds will be significantly reduced due to the market crash. Whatever we're holding will be in serious trouble. The market will immediately fall, and as a result, the value of all coins will drop like a stone. I hope nothing bad happens and that this is all rumor. Binance has created a crypto ecosystem, and many things are associated with it. As a result, the collapse of Binance due to law enforcement will not bode well for the crypto industry.This is what scares me the most. If the government really wants to attack crypto what better way to do it than attack Binance? They know the damage a collapsed Binance will do to the industry. This strategy won't end crypto quite alright but it would be so damaging that the level of trust people have about crypto will drop drastically and it would take the industry years to recover, giving them (the government) to work on more ways to regulate the industry.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "traderethereum",
      "created_time": "December 15, 2022, 08:03:15 AM",
      "body": "Quote from: Sayeds56 on December 15, 2022, 06:45:45 AMHolding funds in personnel hard wallets is the most secure method to store crypto currencies and we should only connect it with trading platform when we buy or sell any asset. That is what we must do to secure our funds from anything that will happen, especially if we keep it from the exchange.The FTX case has emerged, and it looks like people are rocking Binance, spreading bad news, and wanting to panic people.But we can hope that Binance will not be hit by any problems and can survive any bad news that hits them.You must try to calm down and look for other news so that the negative news does not provoke you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sayeds56",
      "created_time": "December 15, 2022, 09:52:18 AM",
      "body": "Quote from: traderethereum on December 15, 2022, 08:03:15 AMQuote from: Sayeds56 on December 15, 2022, 06:45:45 AMHolding funds in personnel hard wallets is the most secure method to store crypto currencies and we should only connect it with trading platform when we buy or sell any asset. That is what we must do to secure our funds from anything that will happen, especially if we keep it from the exchange.The FTX case has emerged, and it looks like people are rocking Binance, spreading bad news, and wanting to panic people.But we can hope that Binance will not be hit by any problems and can survive any bad news that hits them.You must try to calm down and look for other news so that the negative news does not provoke you.Indeed, we should not pay much attention to the rumors being spread to create negativity about Binance which will die down after some time, because Binance management team is very responsible and follows the rules of the game. The innovative skills of Binance team, their professionalism and providing quality customer service is the strength of Binance team, which no other exchange can match & it has contributed a lot for the promotion of crypto currencies all over the world and I hope it will continue playing this role.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coupable",
      "created_time": "December 15, 2022, 08:18:53 PM",
      "body": "Quote from: The Cryptovator on December 14, 2022, 06:36:53 PMThere is little skepticism surrounding Binance. Funds should not be hold to any exchange, including Binance. However, keep in mind that if Binance fails, the value of your funds will be significantly reduced due to the market crash. Whatever we're holding will be in serious trouble. The market will immediately fall, and as a result, the value of all coins will drop like a stone. I hope nothing bad happens and that this is all rumor. Binance has created a crypto ecosystem, and many things are associated with it. As a result, the collapse of Binance due to law enforcement will not bode well for the crypto industry.This is the problem with one company monopolizing the most important and largest part of the crypto markets combined. Any doubts about Binance that may be confirmed in one way or another by any official authority, even if only as a matter of raising fears, will lead to a disaster in the entire market. On this basis, I do not imagine that Binance has withdrawn this number as a problem in the system, but rather it is most likely just rumors targeting the platform.In any case, it is never advisable to leave your money in the hands of centralized platforms, no matter how reliable they seem.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}