{
  "id": "topic_5448462",
  "title": "Epicmario71",
  "author": "Epicmario71",
  "created_time": "April 11, 2023, 09:40:15 PMLast edit: June 27, 2023, 04:14:21 PM by Epicmario71",
  "content": "https://i.imgur.com/NATe0PE.pngBLOCKYFILEDecentralized platform for secure file storage on the blockchain.About BlockyFile:We are excited to announce the launch of BlockyFile, a revolutionary decentralized platform for secure file storage on the blockchain. Our platform is built with advanced encryption and anonymity features, providing users with the highest level of privacy and security for their files.At BlockyFile, we understand the importance of protecting sensitive data from prying eyes. Our platform is designed to provide users with complete control over their files, eliminating the risk of data breaches and hacks. With BlockyFile, you can store and share files with confidence, knowing that your information is secure.BlockyFile also solves the problem of centralized file storage systems that are vulnerable to attack, censorship, and data loss. Our decentralized system ensures that your files are stored across multiple nodes, making it virtually impossible for anyone to tamper with or access your data without your permission.Our team of experienced developers and blockchain experts have worked tirelessly to create a platform that is easy to use and accessible to everyone. Whether you are a business looking for a secure file storage solution or an individual seeking a reliable and secure way to store and share files, BlockyFile is the perfect choice.To learn more about BlockyFile and our revolutionary platform, visit our website at blockyfile.org. We welcome you to join our community and experience the future of secure file storage.Why use BlockyFile Security: BlockyFile uses advanced encryption algorithms and anonymity features to ensure maximum security in file storage.Decentralization: BlockyFile's decentralized platform ensures that files are stored across multiple nodes, eliminating the risk of data loss and cyber attacks.Cost savings: With blockchain technology, BlockyFile eliminates the need for intermediaries and costly data storage services, offering a cost-effective way for file storage.Global access: BlockyFile is accessible from anywhere in the world, thanks to the decentralized nature of the platform.Ease of use: BlockyFile is easy to use, with an intuitive interface and a wide range of file management features.BlockyFile Project Details:Website: https://blockyfile.org/WhitePaper: https://blockyfile.org/pdf/WhitePaper.pdfTelegram: https://t.me/blockyfileDiscord: https://discord.blockyfile.org/Github: https://github.com/BlockyFileExplorer: https://explorer.blockyfile.org/Docs: https://docs.blockyfile.org/Mining pool: https://pool.blockyfile.org/Project Testnet publication date:27/06/2023",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5448462",
  "comments": [
    {
      "author": "Eddyc",
      "created_time": "April 12, 2023, 12:43:00 AM",
      "body": "Quote from: Epicmario71 on April 11, 2023, 09:40:15 PMBLOCKYFILEDecentralized platform for secure file storage on the blockchain.About BlockyFile:We are excited to announce the launch of BlockyFile, a revolutionary decentralized platform for secure file storage on the blockchain. Our platform is built with advanced encryption and anonymity features, providing users with the highest level of privacy and security for their files.At BlockyFile, we understand the importance of protecting sensitive data from prying eyes. Our platform is designed to provide users with complete control over their files, eliminating the risk of data breaches and hacks. With BlockyFile, you can store and share files with confidence, knowing that your information is secure.BlockyFile also solves the problem of centralized file storage systems that are vulnerable to attack, censorship, and data loss. Our decentralized system ensures that your files are stored across multiple nodes, making it virtually impossible for anyone to tamper with or access your data without your permission.Our team of experienced developers and blockchain experts have worked tirelessly to create a platform that is easy to use and accessible to everyone. Whether you are a business looking for a secure file storage solution or an individual seeking a reliable and secure way to store and share files, BlockyFile is the perfect choice.To learn more about BlockyFile and our revolutionary platform, visit our website at blockyfile.org. We welcome you to join our community and experience the future of secure file storage.Why use BlockyFile Security: BlockyFile uses advanced encryption algorithms and anonymity features to ensure maximum security in file storage.Decentralization: BlockyFile's decentralized platform ensures that files are stored across multiple nodes, eliminating the risk of data loss and cyber attacks.Cost savings: With blockchain technology, BlockyFile eliminates the need for intermediaries and costly data storage services, offering a cost-effective way for file storage.Global access: BlockyFile is accessible from anywhere in the world, thanks to the decentralized nature of the platform.Ease of use: BlockyFile is easy to use, with an intuitive interface and a wide range of file management features.BlockyFile Project Details:Website: https://blockyfile.org/WhitePaper: https://blockyfile.org/pdf/WhitePaper.pdfTelegram: https://t.me/blockyfileDiscord: https://discord.blockyfile.org/Project publication date:Summer 2023Just to strengthen and show the picture...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GeePeeU",
      "created_time": "April 14, 2023, 01:33:14 AM",
      "body": "What will the POW algorithm be ?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Vidati",
      "created_time": "April 15, 2023, 10:07:54 AM",
      "body": "ethash, Its in the white paper. OP, Maybe give more info in the original post?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Epicmario71",
      "created_time": "June 18, 2023, 09:38:26 PM",
      "body": "📢 Exciting Announcement! 📢Dear community,We are thrilled to share some amazing news with all of you! Over the past two weeks, our team has been working tirelessly to bring BlockyFile to life, and we are ecstatic to announce that we have successfully completed its development phase. We want to express our heartfelt gratitude to each and every one of you for your unwavering support and patience throughout this journey. Your enthusiasm and feedback have been invaluable in shaping BlockyFile into the powerful tool it is today.But that's not all! We have an extra special surprise for you. We are delighted to reveal that we have set an official release date for BlockyFile, and mark your calendars because it's happening on the 27th of this month! We understand how eager you all are to get your hands on BlockyFile, and we assure you that the wait will be well worth it. To make the launch even more exciting, we will be uploading the complete documentation and all the necessary programs for the blockchain's operation on GitHub next week. This will provide you with all the resources and information you need to fully explore and utilize BlockyFile's capabilities.We cannot thank you enough for your continuous support and enthusiasm. We are incredibly proud of what we have accomplished together, and we can't wait to embark on this next phase of our journey with you.Stay tuned for more updates and mark the date - the 27th of this month - for the highly anticipated release of BlockyFile TestNet!Best regards,Blockyfile Team",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "greebn9k",
      "created_time": "June 21, 2023, 11:03:12 AM",
      "body": "Did you launch the test net?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Epicmario71",
      "created_time": "June 21, 2023, 11:18:17 PM",
      "body": "Quote from: greebn9k on June 21, 2023, 11:03:12 AMDid you launch the test net?as said in the last post on the 27th we release the testnet with a mining pool and explorer already from the first day, to be more informed enter our discord",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Epicmario71",
      "created_time": "June 27, 2023, 04:12:23 PM",
      "body": "📢 Announcement: BlockyFile Testnet Launch!Hello everyone!We are excited to announce the launch of the BlockyFile Testnet! 🚀🎉The Testnet is now live and ready for you to explore. This is an important milestone in our journey towards a decentralized and secure file storage solution on the blockchain. During this testing phase, we encourage you to try out the various features and functionalities we have prepared.📚 DocumentationTo get started, we recommend referring to our comprehensive documentation available at https://docs.blockyfile.org/ . It provides detailed guides and instructions on how to use our platform effectively.🔍 ExplorerWe also have a dedicated BlockyFile Explorer for you to explore the Testnet network. You can check out the transactions, browse blocks, and view various statistics related to the Testnet. Access the BlockyFile Explorer at https://explorer.blockyfile.org/.⛏️ Mining PoolFor those interested in mining BFY tokens, we have set up a Testnet mining pool. Join the pool and contribute your mining power to support the network. Start mining now at https://pool.blockyfile.org/ .💻 GitHub RepositoriesWe have made all our programs and tools available on GitHub for easy access and collaboration. You can find the repositories at https://github.com/BlockyFile. Feel free to explore, contribute, and provide feedback.Thank you for being a part of the BlockyFile Testnet launch! Your support and participation are invaluable to us. We look forward to your feedback and suggestions as we continue to enhance and improve our platform.If you have any questions or need assistance, please don't hesitate to reach out to us here on Discord or via other communication channels.Let's build the future of decentralized file storage together! 🌐📁Best regards,EpicMario71",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GTP50",
      "created_time": "July 01, 2023, 03:53:57 AM",
      "body": "Is this project abandoned yellow? The dis website and mining pool browsers are all closed. no notice, no sound???Is this project abandoned yellow? The dis website and mining pool browsers are all closed. no notice, no sound???Is this project abandoned yellow? The dis website and mining pool browsers are all closed. no notice, no sound???",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kavelj22",
      "created_time": "July 01, 2023, 07:42:23 AM",
      "body": "Quote from: GTP50 on July 01, 2023, 03:53:57 AMIs this project abandoned yellow? The dis website and mining pool browsers are all closed. no notice, no sound???The GitHub repository was also archived yesterday, which means it's no longer maintained. This is strange to happen just three days after the last update from Op. Although this was expected from the beginning as the concept is old-fashioned and the team aims to progress without a marketing strategy but to publish updates in bitcointalk and some other social media.And as there are no updates in all channels, i don't expect this to be a pause before the big update. Just wonder why they exit in this way if no issue was encountered. I really hope that this project didn't turn into a scam after failing to collect enough budget to lunch its mainnet.I expect OP to come back to this thread to lock it as well.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MMOStars",
      "created_time": "July 03, 2023, 03:34:43 PM",
      "body": "They launched a testnet just a couple of days ago, da hell happened?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Epicmario71",
      "created_time": "July 03, 2023, 10:28:07 PM",
      "body": "Important Announcement Regarding BlockyFile ProjectDear Community,After much deliberation and discussions within our team, we have come to a difficult decision regarding the future of the BlockyFile project. We have decided to close the project, as it has been acquired by another company. As a result, BlockyFile will be rebranded and operated under a different name by the new company.We understand that this news may come as a surprise, and we want to express our gratitude for your support and participation in the BlockyFile community. We are incredibly proud of what we have achieved together, and we believe that the project is in good hands with the acquiring company.As required by the sales contract, we have had to withdraw any website put online, and for the moment, we cannot communicate the name of the company that has bought the project. However, we encourage you to keep an eye on the forum, where you will soon see a new project with a similar technology emerging.Once again, we want to thank you for being a part of the BlockyFile community and for your enthusiasm and contributions to the project. We appreciate your understanding during this transition period.Best regards,BlockyFile Team",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kgdmtd999777",
      "created_time": "July 06, 2023, 11:57:59 PM",
      "body": "Don't lose credit, mine for days, my poor coins are still in the database",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}