{
  "id": "topic_5413440",
  "title": "bossofbetting",
  "author": "bossofbetting",
  "created_time": "September 13, 2022, 05:12:30 PM",
  "content": "Hello, my name is Alex and I made an ads-free Crypto iOS App with latest news, coin data and other related content. You can download it from the App Storehttps://apps.apple.com/us/app/bfeed-breaking-crypto-news/id1643178603?What is available for nowBreaking NewsLatest NewsTop 100 CoinsBest gainers and losers (24 horus)WatchlistFear and Greed IndexSearchI need your feedback. What do you think about the App and what you would like to see there?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5413440",
  "comments": [
    {
      "author": "AlphaEther",
      "created_time": "September 14, 2022, 08:06:17 AM",
      "body": "Interesting. Is it available for Android? I'm an Android user.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bossofbetting",
      "created_time": "September 15, 2022, 07:48:34 AM",
      "body": "Hi, unfortunately, no",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AlphaEther",
      "created_time": "September 15, 2022, 08:33:56 AM",
      "body": "Quote from: bossofbetting on September 15, 2022, 07:48:34 AMHi, unfortunately, no  No problem. Is it work properly? Make sure thak it shows the exact current price and you can add more features like portfolio making where they can track their portfolio easily.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bossofbetting",
      "created_time": "September 15, 2022, 08:43:37 AM",
      "body": "Quote from: AlphaEther on September 15, 2022, 08:33:56 AMNo problem. Is it work properly? Make sure thak it shows the exact current price and you can add more features like portfolio making where they can track their portfolio easily.Hi, yes it works fine. I made an update with light/night mode, ICO calendar, best gainers and losers for the last 24 hours and custom widgets on the main Screen. Portfolio is a good idea and hope I'll make it soon (it is a little bit hard for me right now)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}