{
  "id": "topic_5449372",
  "title": "HailunBu",
  "author": "HailunBu",
  "created_time": "April 19, 2023, 02:36:06 AM",
  "content": "For example: stocks, encryption, foreign exchange and others?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5449372",
  "comments": [
    {
      "author": "Oshosondy",
      "created_time": "April 19, 2023, 02:50:04 AM",
      "body": "This is a bitcoin forum and our discussion on this trading board is about bitcoin and crypto trading. My advice is that if you can learn how to trade bitcoin, it is good. Point of correctionsKnow that bitcoin may be a commodity to many people, but cryptocurrencies are not commodities, they are securities because most of them works almost just like securities because they are somehow centralized and mined during presales.Stocks are securities, not commodities.Encryption is not related to trading at all.Foreign exchange is not also a commodity trading because fiat are not commodities.Example of commoditiesKnow that commodities are something physical like gold, crude oil, metals, diamond and many other things like that. I have seen people trading gold and crude oil but I am trading bitcoin and good few altcoins with high marketcap.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SquirrelJulietGarden",
      "created_time": "April 19, 2023, 02:59:17 AM",
      "body": "Quote from: Oshosondy on April 19, 2023, 02:50:04 AMThis is a bitcoin forum and our discussion on this trading board is about bitcoin and crypto trading.Biggest missions of the forum is to exchange ideas about Bitcoin from its technology, technical support, technical development, how to store it safely and how to use it, investment and trading.QuoteMy advice is that if you can learn how to trade bitcoin, it is good. Start with trading is bad. It is more risky than start with investment.When you start with trading, you will fall into storing your bitcoins on online accounts, on exchanges that is very risky.Reminder: do not keep your money in online accountsIf you begin with investment, you will have more reasons to store your bitcoin in non custodial wallet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oshosondy",
      "created_time": "April 19, 2023, 07:58:07 AM",
      "body": "Quote from: SquirrelJulietGarden on April 19, 2023, 02:59:17 AMMy advice is that if you can learn how to trade bitcoin, it is good. QuoteStart with trading is bad. It is more risky than start with investment.This thread is not about investment, it is about trading. Let me assume that OP knows about crypto trading already, but asking about forex, commodity and stocks trading.  But I just do not want to still leave the fact that among crypto trading, choosing bitcoin is good. Yes, trading is risky and not for everyone.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "April 19, 2023, 10:05:39 AM",
      "body": "Everything is traded on the Internet, but cryptocurrencies are traded without verification of identity and thus allowed them to spread globally and not in a limited range as was the case in the stock market and the rest of the highly regulated markets.Therefore, unless you have completed the identity verification, you will not be able to trade in those markets, as there are other disputes such as: - Bitcoin market operates 24 hours. - There are no stop-loss orders. - There is no guarantee of your money if you invest in cryptocurrency.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "monedauno",
      "created_time": "May 04, 2023, 02:36:20 PM",
      "body": "I'm not sure what you mean by \"trading online\". It's a bit hard to get a handle on it, but I'll try to explain it in a way that doesn't make it sound like you're trying to sell something.Crypto is a form of money that is used to buy and sell a variety of things., for example, and sell it for a fraction of the price. This is called crypto-currencies.The idea is that you goin order to buy a going to a store and buying an item. There are a lot of things you can do with crypto, but they're not limited to that.If you want to buy a coin, you have to buy a coin. You going to a store and buying an item. There are a lot of things you can do with crypto, but they're not limited to that.You can buy a coin by",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cute nmp",
      "created_time": "May 06, 2023, 08:11:02 PM",
      "body": "Generally prepare trading crytocurrency cause the charts are more clean and easy to analyse technical. Both I also trade forex and stock thought I don't make consistent profits from them especially forex cause it has lots of manipulations.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rin24",
      "created_time": "May 07, 2023, 10:17:07 AM",
      "body": "Stocks but risk is the same as with crypto plus most of the time lower returns than top crypto at least in this time, not worth it",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zixuan Gang",
      "created_time": "May 25, 2023, 10:17:00 PM",
      "body": "When it comes to trading commodities online, there are several options to consider. One popular choice is trading precious metals like gold and silver. These commodities have a long history of value and can provide a hedge against inflation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zixuan Gang",
      "created_time": "May 25, 2023, 10:31:21 PM",
      "body": "Another promising commodity for online trading is crude oil. Oil plays a vital role in the global economy, and its price fluctuations can present profitable trading opportunities. With BK8's affiliate program, you can not only trade oil but also earn additional income through referrals.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yong Han",
      "created_time": "May 25, 2023, 10:31:37 PM",
      "body": "Agricultural commodities, such as wheat, corn, and soybeans, are also worth considering. These commodities are influenced by factors like weather conditions, supply and demand dynamics, and geopolitical events. By trading agricultural commodities online, you can diversify your portfolio and potentially benefit from market trends.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zixuan Gang",
      "created_time": "May 25, 2023, 10:38:35 PM",
      "body": "Lastly, natural gas is an interesting commodity to trade online. It's a cleaner alternative to other fossil fuels and has its own unique market dynamics. With increasing global demand for energy, natural gas trading can offer opportunities for profit.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}