{
  "id": "topic_5475869",
  "title": "Sheque",
  "author": "Sheque",
  "created_time": "November 29, 2023, 01:44:51 AM",
  "content": "Hello everyone,I was not sure if this belongs here but i have a problem with rollbit.I have been playing at rollbit (regular slots, Hacksaw / Pragmatic)These are the stats of the day that my problem started.Casino PnL (1 Day) -343.73Your wager was 27,849.16 yesterday. (I got this information from their support)now my daily bonus was $41,41.I started a chat with support because how it is possible that i only got 41 dollars on $27,849.16 wagered.And I got the most ridiculous answers and this does not seem right to me.I had more discussions with rollbit the last couple of days wich mostly resulted in getting muted for telling the truth.I will add the complete uncut version of the chat aswell,But what it came down to:They first did not want to state how wagering was calculated for daily bonuses, i got all kinds of vague answers, eventually they told me this :The Daily Bonus is a personalised bonus based on your recent activity on Rollbit. One of the main factors is your recent P&L, lossback is included within your Daily Bonus. You can add a Daily Bonus to your calendar once every 24 hours.When adding a Daily Bonus, a Rakeboost will be activated. For a period of time, your rakeback will be increased. Rakeboosts do not stack.The Daily Bonus can be up to 50% of the house edge on wagering during the previous 24 hours.So i did the calculation for them, wich resulted in 4,25% of house edge on wagering.When i asked them about this because they advertise with \"Up to 50% of house edge on wagering\" they simply replied : Nothing further to add - you were given the accurate and correct bonus amount.How is this fair, i just get shipped off while they are clearly are not even close to delivering what they are advertising.I would like to advice people to stay far far away from this shady site because on top of the scummy calendar they added (Wich only got added to take advantage of the addiction that people have) they also do not deliver what they are advertising BY FAR.if there is a representative of Rollbit here that want to solve this issue i will be happy to talk.P.S. i have no clue how to add a file or some sort of scrollable text so i will just paste the whole conversation under here:Conversation with RollbitStarted on November 28, 2023 at 11:30 PM UTC time UTC (GMT+0000)--- November 28, 2023 ---11:30 PM | Sheque: yesterday i wagered 30000 dollars, how the hell did i only get 40 dollar from the daily11:31 PM | Operator: You’ll get replies here and in your email:✉️ Sheque  Our usual reply time🕒 A few minutes11:31 PM | Inori from Rollbit: Hey.11:33 PM | Inori from Rollbit: The reward is correct here.   Wager isn't one of the factor for daily rewards.11:33 PM | Sheque: is that a joke?!11:33 PM | Sheque: how is that not a factor!11:36 PM | Inori from Rollbit: I meant there are many factors contributing to the daily bonus.   Wager is a one of it.11:36 PM | Sheque: so then explain to me how 30000 wager can end up in 40 dollars.11:36 PM | Sheque: since i didnt withdraw or anything11:37 PM | Inori from Rollbit: It depends on your PnL, the games you play, wagers and other factors.11:38 PM | Sheque: so i lost, wagered 30000 and you are telling me that it is correct i got 40 dollar back, this story ur telling me still does not explain a single thing11:38 PM | Sheque: how about some transparency if ur so sure it is correct.11:39 PM | Inori from Rollbit: Casino PnL (1 Day) -343.73  Your wager was 27,849.16 yesterday.11:39 PM | Sheque: yes and the calculation? because i couldve just cashed the 5-6k i was on, but i like to play and build that dumbass calendar,11:40 PM | Inori from Rollbit: There are no exact percentages for those.11:41 PM | Sheque: how is that possible, you guys calculated it to 40 dollars, so gimme the calculation11:41 PM | Inori from Rollbit: It is our system calculating.11:42 PM | Sheque: you guys put up that system right, how can you try to sell this story here... are you kidding me, its not like the system thinks oh lets give this one 50 and the other one 400, there is a calculation behind it11:43 PM | Inori from Rollbit: The reward can be moved to another, such as weekly and monthly bonuses.11:44 PM | Sheque: thats a lie, ofcourse it wont get moved or anything, there is a clear calculation behind a daily bonus, there has to be.11:44 PM | Sheque: and on top of that, you clearly stated the calculation was correct, so show me the calculation11:44 PM | Sheque: its not that hard11:45 PM | Inori from Rollbit: We don't have the exact percentages, again.11:45 PM | Sheque: then how can you even tell its correct? if you dont even know how it works11:46 PM | Sheque: yo ugotta understand that this sounds absolutely ridiculous..11:46 PM | Inori from Rollbit: There is an estimate.   Everyone is aware of the estimate of their daily reward comparing to their activities within a day.11:47 PM | Sheque: so tell me how the estimate is calculated11:48 PM | Inori from Rollbit: Users were mentioning it was around 10% of your loss and some of the wager.   Feel free to ask around.11:48 PM | Sheque: you are telling me, the amount is correct, and then ur saying that the users need to tell you what the estimate is? why even have a support if the users know more then you do11:49 PM | Sheque: okay lets say its around that yeah, i lost like 350, that makes 10% around 35 bucks, ur trying to tell me that 30000 wagering gives me 5 dollar?11:49 PM | Inori from Rollbit: I'm saying that everyone is aware of the estimate, not the users need to tell me what the estimate is.11:50 PM | Sheque: come on, this whole story is absolutely ridiculous. this aint right11:50 PM | Inori from Rollbit: The reward is correct here, nothing further to add.11:51 PM | Sheque: lol, never in my life have i had this kind of a conversation, what it comes down to is, you have no clue what ur talking about, you are trying to sell some great story that does not add up at all, so either the calculation went wrong, or im getting absolutely scammed here, wich one is it11:52 PM | Sheque: is there someone else, who actually knows whats going on that can assist me?11:57 PM | Inori from Rollbit: We don't have the exact percentages, again. The percentage I mentioned above was an estimate and figured out by many users and myself when playing on Rollbit.   The system is working completely fine as the daily bonus is distributed to thousands of players daily and we found no issues.11:57 PM | Sheque: so what ur actually saying is : you are just guessing that its okay, so that makes it okay, you have no idea how to actually check if its correct...11:59 PM | Inori from Rollbit: I can check this with a higher department and let you know.--- November 29, 2023 ---12:01 AM | Sheque: well that seems like a smart idea, and i would like the actual calculations... because 40 dollar for a 350 loss and 30000 wagered is absolutely disgustingly low, seeing that your mods state that with the scummy calendar the rewards are MUCH higher, i dont wanna know what ur daily reward was before then. I mean atleast try to make it worthwhile for people to pick your casino over all those others out there.12:02 AM | Inori from Rollbit: Keep in mind that the bonuses can be moved to others.12:03 AM | Sheque: i have never heard something that ridiculous, you have a random daily bonus lol, so you can lose 100000 and wager 500000 and get 30 buck because the rest went to a weekly, i refuse to believe that statement12:04 AM | Sheque: if you actually do that, it will be time to clearly state that on your website, lets see how many people are going over to stake12:04 AM | Sheque: not even joking, the reward system is already not great how it is, but that would be the icing on the cake12:07 AM | Sheque: Platinum 1MODCubey:@ripcityenjoyer no, it would just be lower depending on the games you play and if your pnl is up12:08 AM | Sheque: litterally just asked in chat, ur mod said this. about the transfering funds to another bonus12:14 AM | Nancy from Rollbit: Hi there,   We do not observe any problems with your daily bonus. The PnL is the main factor of the daily bonus.   You got about 10% of your losses back without the house edge, which is good.12:14 AM | Sheque: how is that correct for 30000 wagered..12:14 AM | Sheque: i would like to see a calculation of some sorts how this gets to 40 dollars12:15 AM | Nancy from Rollbit: There is no precise calculation for the Daily Bonus, it's up to 50% of the house edge.   One of the main factor is your daily PnL.12:16 AM | Sheque: i lost lets say 350, that means 10% would add up to 35 dollar, how is 30000 wagered correct for 5 dollar lol12:17 AM | Sheque: i couldve cashed out 6k at some point, wich i didnt12:17 AM | Sheque: you are going to tell me that the complete 6k is not part of the loss?12:17 AM | Sheque: how is that possible12:19 AM | Nancy from Rollbit: $6k is certainly not counted in your PnL as it was your profit and not included in your capital.12:19 AM | Sheque: so when i cash out 6k, and redepo the next day 6k, i will get the daily for it12:19 AM | Sheque: that seems off12:20 AM | Nancy from Rollbit: Yeah, since it's based on your daily PnL +/-12:20 AM | Sheque: but it doesnt make sence, since i have lost alot less and got ALOT more for it in daily percentage wise12:20 AM | Sheque: sense*12:22 AM | Sheque: because the things ur saying now, tells me that wagering is not a factor AT ALL on a daily bonus12:22 AM | Sheque: and i know for a fact that that is not true12:24 AM | Nancy from Rollbit: The purpose of these bonuses are to cover some of your losses back.   Unfortunately, you only got a lesser reward because you had a lower PNL.12:24 AM | Sheque: is wagering a factor at all in a daily bonus?12:25 AM | Nancy from Rollbit: Yes it is12:25 AM | Sheque: then what is the factor12:25 AM | Sheque: because 5 dollar for 30000 seems not correct12:26 AM | Sheque: even if wagering counts for 1% im at 300,12:27 AM | Sheque: so 5 dollars would mean that the wagering is around 0.015% lol, thats not right.12:29 AM | Nancy from Rollbit: You have received $41.41, that's 10% of your losses   Please note that we do not see any issues with your daily bonus amount.12:30 AM | Sheque: once again, im asking for the calculation on it, your colleague told me, \"Users were mentioning it was around 10% of your loss and some of the wager.\"12:30 AM | Sheque: some of the wager cannot be 0.015, i refuse to believe that is correct.12:31 AM | Sheque: so i would just like to get the actual calculation, i dont think the system just randomly decides numbers.. there is a calculation behind it12:31 AM | Nancy from Rollbit: We do not have any information about the daily bonus' calculation.   ~$40 bonus is already decent for a $400 loss12:31 AM | Sheque: im not talking about the 400 loss, im talking about the wagering12:32 AM | Sheque: you also just said wagering counts on daily bonuses12:32 AM | Sheque: so where is it12:32 AM | Sheque: what kind of percentage of wagering is added on daily bonuses12:33 AM | Nancy from Rollbit: It's already included in the daily bonus.   We have nothing further to add here - you have received the correct and accurate amount.12:34 AM | Sheque: you just claim that its true, without actually telling me how its correct.. how can that be fair, all i hear is rumors, and vague percentages... like come on, im not asking you for something impossible, the things you guys say dont add up AT ALL, shouldnt be too hard to say : its calculated by around 10% of your losses, and on top of that around .5% of wagering or something like that12:35 AM | Sheque: why cant you just tell me how its calculated... you just said wagering is a part of it, why is it so difficult to explain how much of wagering is added12:37 AM | Nancy from Rollbit: Once more, there is no exact computation for those.   It is only determined by your PnL, wagering, and the house edge from the games you have played in.12:41 AM | Sheque: okay, and your colleague said that pnl is about 10%, so where is the wagering... in this conversation and the last one i had, i still have not heard where the wagering kicks in12:44 AM | Nancy from Rollbit: I mentioned it since your bonus is good, which is already 10% of the bonus, but the daily bonus is not set at 10%.   Again, wagering is already included in the amount.12:46 AM | Sheque: and again, how is the wagering added in... because if i only look at wagering without the pnl i got less then 0.125 percent back, that still seems ridiculously low to me, can you forward me to someone who can actually explain to me how wagering works for the daily12:47 AM | Nancy from Rollbit: There is no precise computation for those, as has already been stated a few times.   The daily bonus that you received already takes into account your wagering statistics.12:48 AM | Sheque: but like i said before, the least you should be able to do is tell me for example : the losses you make is calculated for something about 10% and the wagering you did should be around .5 % added to that, i think you should be able to state those numbers...12:50 AM | Sheque: so far i dont get a clear answer on how its calculated... and if you tell people in chat that the reward system is actually good here, you should be able to explain it clearly. at this point i got : you got for pnl around 10% and we think thats very nice, even tough you wagered 30000 dollars, 40 bucks is a great amount12:51 AM | Sheque: and we will not explain to you how wagering is added because we dont know, or wont tell you for whatever reason12:52 AM | Nancy from Rollbit: The Daily Bonus is a personalised bonus based on your recent activity on Rollbit. One of the main factors is your recent P&L, lossback is included within your Daily Bonus. You can add a Daily Bonus to your calendar once every 24 hours.   When adding a Daily Bonus, a Rakeboost will be activated. For a period of time, your rakeback will be increased. Rakeboosts do not stack.   The Daily Bonus can be up to 50% of the house edge on wagering during the previous 24 hours.12:52 AM | Sheque: you can link w/e u want, but there is still nothing about the wagering in there12:53 AM | Nancy from Rollbit: Please read the last paragraph12:54 AM | Sheque: yeah still very vague, up to 50% of house edge, what does that even mean, what is the house edge on 30000 dollars?12:54 AM | Nancy from Rollbit: It depends on the games you've played12:54 AM | Sheque: slots, hacksaw/pragmatic12:55 AM | Nancy from Rollbit: Most of their slots are at 3.5% house edge12:56 AM | Sheque: then 30000 divided by 100 times 3,5 makes for 1050 dollars, wich would mean i got less then 1%...12:56 AM | Sheque: wich still does not make sense12:58 AM | Sheque: that would mean i got 0.5% of house edge on wagering12:58 AM | Sheque: thats a whole lot less then up to 5012:59 AM | Sheque: if i would get 50% i would get 525 dollars from wagering, how can it be that i got 5 lol... that seems fishy01:00 AM | Nancy from Rollbit: It's up to 50%, not exactly 50%01:00 AM | Sheque: even on 20% of house edge i would have 210 dollars lol01:00 AM | Sheque: no i get that01:00 AM | Sheque: but 5 dollars i a whole lot less then 52501:00 AM | Sheque: you cannot tell me that its correct that someone gets 50% and someone else gets 0.5 %, as a daily bonus,01:02 AM | Nancy from Rollbit: You only wagered $13,465.45 yesterday01:03 AM | Sheque: Casino PnL (1 Day) -343.73Your wager was 27,849.16 yesterday.01:03 AM | Sheque: this is about the day before,01:05 AM | Nancy from Rollbit: Alright, we continue to find no problems with the daily bonus that you were given.01:05 AM | Sheque: i clearly explained to you that it cannot be right, with the calculations and percentages you gave me i clearly showed you its not correct..01:06 AM | Sheque: then just saying : we find no problems is not right.01:08 AM | Nancy from Rollbit: Even though we've already explained everything to you, you don't seem to believe us.   The amount you received is accurate and correct. Your low PnL led to low rewards.   It is stated in the rewards page that the main factor of the daily bonus is your recent PNL01:08 AM | Sheque: because you say stuff that doesnt add up01:08 AM | Sheque: as i clearly showed01:08 AM | Sheque: you showed me a thing that said, daily bonus can be up to 50% of house edge of wagering01:09 AM | Sheque: i showed you the calculations, and its clear that i did not even get 0.5 percent,01:09 AM | Sheque: only that part should already be clear that its not correct01:09 AM | Nancy from Rollbit: Please do the maths again, it's around 5%01:10 AM | Sheque: no its not, because you said that pnl was also a factor, wich gave me like 10% lossback01:11 AM | Nancy from Rollbit: They are taken into account together instead of individually.   We have looked into this a several times, and we don't find any problems with the bonus you were given.01:12 AM | Sheque: and on top of that, if i calculate only the wagering, not the actual loss included i come up to 4,25% for 41,41 dollar01:12 AM | Sheque: wich is still a FAR way from 50%01:13 AM | Sheque: so you are telling me that ur advertising with up to 50% and in reality are just giving 4,25%01:14 AM | Nancy from Rollbit: Nothing further to add - you were given the accurate and correct bonus amount.01:18 AM | Sheque: can you answer my question?01:18 AM | Sheque: Are you telling me that ur advertising with \"up to 50% house edge from wagering back\" and in reality u give 4,25?01:20 AM | Sheque: i have saved this conversation btw, i will not drop this.01:23 AM | Sheque: because this is just ridiculous, i just got muted in chat for telling the truth, i see thats the way you work. once people figure out the false advertisement, lets mute them. but i will make sure ALOT of people will see this since you are clearly not gonna give me what i deserve.---Exported from Rollbit on November 29, 2023 at 01:23 AM UTC time UTC (GMT+0000)",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5475869",
  "comments": [
    {
      "author": "Broadanbig",
      "created_time": "November 29, 2023, 08:25:23 AM",
      "body": "The Rollbit I know here is a very big and reputable casino and so far, this is like the first complaint I am seeing about them. The casino have been registered here for a long time and have a running signature campaign. To start with, you did did not drop the site of the Rollbit casino let us verify for ourselves and secondly it would have been better you screenshot the chats and upload the link here even if you are not a copper member we could help you quote it for visibility. Lastly, I think this board is not to he right place for this, you can mm one it be to reputation board there complaints of this nature are in properly attended to.https://bitcointalk.org/index.php?board=129.0",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "un_rank",
      "created_time": "November 29, 2023, 08:36:51 AM",
      "body": "Quote from: Sheque on November 29, 2023, 01:44:51 AMif there is a representative of Rollbit here that want to solve this issue i will be happy to talk.RollBit has an ANN thread here and the OP of that thread is still fairly active on the forum.Quote from: Sheque on November 29, 2023, 01:44:51 AMP.S. i have no clue how to add a file or some sort of scrollable text so i will just paste the whole conversation under here:You can add it to code tags, find it in the # option at the top icons when typing a reply.It will look like this;Code:Conversation with RollbitStarted on November 28, 2023 at 11:30 PM UTC time UTC (GMT+0000)--- November 28, 2023 ---11:30 PM | Sheque: yesterday i wagered 30000 dollars, how the hell did i only get 40 dollar from the daily11:31 PM | Operator: You’ll get replies here and in your email:✉️ Sheque  Our usual reply time🕒 A few minutes11:31 PM | Inori from Rollbit: Hey.11:33 PM | Inori from Rollbit: The reward is correct here.   Wager isn't one of the factor for daily rewards.11:33 PM | Sheque: is that a joke?!11:33 PM | Sheque: how is that not a factor!11:36 PM | Inori from Rollbit: I meant there are many factors contributing to the daily bonus.   Wager is a one of it.11:36 PM | Sheque: so then explain to me how 30000 wager can end up in 40 dollars.11:36 PM | Sheque: since i didnt withdraw or anything11:37 PM | Inori from Rollbit: It depends on your PnL, the games you play, wagers and other factors.11:38 PM | Sheque: so i lost, wagered 30000 and you are telling me that it is correct i got 40 dollar back, this story ur telling me still does not explain a single thing11:38 PM | Sheque: how about some transparency if ur so sure it is correct.11:39 PM | Inori from Rollbit: Casino PnL (1 Day) -343.73  Your wager was 27,849.16 yesterday.11:39 PM | Sheque: yes and the calculation? because i couldve just cashed the 5-6k i was on, but i like to play and build that dumbass calendar,11:40 PM | Inori from Rollbit: There are no exact percentages for those.11:41 PM | Sheque: how is that possible, you guys calculated it to 40 dollars, so gimme the calculation11:41 PM | Inori from Rollbit: It is our system calculating.11:42 PM | Sheque: you guys put up that system right, how can you try to sell this story here... are you kidding me, its not like the system thinks oh lets give this one 50 and the other one 400, there is a calculation behind it11:43 PM | Inori from Rollbit: The reward can be moved to another, such as weekly and monthly bonuses.11:44 PM | Sheque: thats a lie, ofcourse it wont get moved or anything, there is a clear calculation behind a daily bonus, there has to be.11:44 PM | Sheque: and on top of that, you clearly stated the calculation was correct, so show me the calculation11:44 PM | Sheque: its not that hard11:45 PM | Inori from Rollbit: We don't have the exact percentages, again.11:45 PM | Sheque: then how can you even tell its correct? if you dont even know how it works11:46 PM | Sheque: yo ugotta understand that this sounds absolutely ridiculous..11:46 PM | Inori from Rollbit: There is an estimate.   Everyone is aware of the estimate of their daily reward comparing to their activities within a day.11:47 PM | Sheque: so tell me how the estimate is calculated11:48 PM | Inori from Rollbit: Users were mentioning it was around 10% of your loss and some of the wager.   Feel free to ask around.11:48 PM | Sheque: you are telling me, the amount is correct, and then ur saying that the users need to tell you what the estimate is? why even have a support if the users know more then you do11:49 PM | Sheque: okay lets say its around that yeah, i lost like 350, that makes 10% around 35 bucks, ur trying to tell me that 30000 wagering gives me 5 dollar?11:49 PM | Inori from Rollbit: I'm saying that everyone is aware of the estimate, not the users need to tell me what the estimate is.11:50 PM | Sheque: come on, this whole story is absolutely ridiculous. this aint right11:50 PM | Inori from Rollbit: The reward is correct here, nothing further to add.11:51 PM | Sheque: lol, never in my life have i had this kind of a conversation, what it comes down to is, you have no clue what ur talking about, you are trying to sell some great story that does not add up at all, so either the calculation went wrong, or im getting absolutely scammed here, wich one is it11:52 PM | Sheque: is there someone else, who actually knows whats going on that can assist me?11:57 PM | Inori from Rollbit: We don't have the exact percentages, again. The percentage I mentioned above was an estimate and figured out by many users and myself when playing on Rollbit.   The system is working completely fine as the daily bonus is distributed to thousands of players daily and we found no issues.11:57 PM | Sheque: so what ur actually saying is : you are just guessing that its okay, so that makes it okay, you have no idea how to actually check if its correct...11:59 PM | Inori from Rollbit: I can check this with a higher department and let you know.--- November 29, 2023 ---12:01 AM | Sheque: well that seems like a smart idea, and i would like the actual calculations... because 40 dollar for a 350 loss and 30000 wagered is absolutely disgustingly low, seeing that your mods state that with the scummy calendar the rewards are MUCH higher, i dont wanna know what ur daily reward was before then. I mean atleast try to make it worthwhile for people to pick your casino over all those others out there.12:02 AM | Inori from Rollbit: Keep in mind that the bonuses can be moved to others.12:03 AM | Sheque: i have never heard something that ridiculous, you have a random daily bonus lol, so you can lose 100000 and wager 500000 and get 30 buck because the rest went to a weekly, i refuse to believe that statement12:04 AM | Sheque: if you actually do that, it will be time to clearly state that on your website, lets see how many people are going over to stake12:04 AM | Sheque: not even joking, the reward system is already not great how it is, but that would be the icing on the cake12:07 AM | Sheque: Platinum 1MODCubey:@ripcityenjoyer no, it would just be lower depending on the games you play and if your pnl is up12:08 AM | Sheque: litterally just asked in chat, ur mod said this. about the transfering funds to another bonus12:14 AM | Nancy from Rollbit: Hi there,   We do not observe any problems with your daily bonus. The PnL is the main factor of the daily bonus.   You got about 10% of your losses back without the house edge, which is good.12:14 AM | Sheque: how is that correct for 30000 wagered..12:14 AM | Sheque: i would like to see a calculation of some sorts how this gets to 40 dollars12:15 AM | Nancy from Rollbit: There is no precise calculation for the Daily Bonus, it's up to 50% of the house edge.   One of the main factor is your daily PnL.12:16 AM | Sheque: i lost lets say 350, that means 10% would add up to 35 dollar, how is 30000 wagered correct for 5 dollar lol12:17 AM | Sheque: i couldve cashed out 6k at some point, wich i didnt12:17 AM | Sheque: you are going to tell me that the complete 6k is not part of the loss?12:17 AM | Sheque: how is that possible12:19 AM | Nancy from Rollbit: $6k is certainly not counted in your PnL as it was your profit and not included in your capital.12:19 AM | Sheque: so when i cash out 6k, and redepo the next day 6k, i will get the daily for it12:19 AM | Sheque: that seems off12:20 AM | Nancy from Rollbit: Yeah, since it's based on your daily PnL +/-12:20 AM | Sheque: but it doesnt make sence, since i have lost alot less and got ALOT more for it in daily percentage wise12:20 AM | Sheque: sense*12:22 AM | Sheque: because the things ur saying now, tells me that wagering is not a factor AT ALL on a daily bonus12:22 AM | Sheque: and i know for a fact that that is not true12:24 AM | Nancy from Rollbit: The purpose of these bonuses are to cover some of your losses back.   Unfortunately, you only got a lesser reward because you had a lower PNL.12:24 AM | Sheque: is wagering a factor at all in a daily bonus?12:25 AM | Nancy from Rollbit: Yes it is12:25 AM | Sheque: then what is the factor12:25 AM | Sheque: because 5 dollar for 30000 seems not correct12:26 AM | Sheque: even if wagering counts for 1% im at 300,12:27 AM | Sheque: so 5 dollars would mean that the wagering is around 0.015% lol, thats not right.12:29 AM | Nancy from Rollbit: You have received $41.41, that's 10% of your losses   Please note that we do not see any issues with your daily bonus amount.12:30 AM | Sheque: once again, im asking for the calculation on it, your colleague told me, \"Users were mentioning it was around 10% of your loss and some of the wager.\"12:30 AM | Sheque: some of the wager cannot be 0.015, i refuse to believe that is correct.12:31 AM | Sheque: so i would just like to get the actual calculation, i dont think the system just randomly decides numbers.. there is a calculation behind it12:31 AM | Nancy from Rollbit: We do not have any information about the daily bonus' calculation.   ~$40 bonus is already decent for a $400 loss12:31 AM | Sheque: im not talking about the 400 loss, im talking about the wagering12:32 AM | Sheque: you also just said wagering counts on daily bonuses12:32 AM | Sheque: so where is it12:32 AM | Sheque: what kind of percentage of wagering is added on daily bonuses12:33 AM | Nancy from Rollbit: It's already included in the daily bonus.   We have nothing further to add here - you have received the correct and accurate amount.12:34 AM | Sheque: you just claim that its true, without actually telling me how its correct.. how can that be fair, all i hear is rumors, and vague percentages... like come on, im not asking you for something impossible, the things you guys say dont add up AT ALL, shouldnt be too hard to say : its calculated by around 10% of your losses, and on top of that around .5% of wagering or something like that12:35 AM | Sheque: why cant you just tell me how its calculated... you just said wagering is a part of it, why is it so difficult to explain how much of wagering is added12:37 AM | Nancy from Rollbit: Once more, there is no exact computation for those.   It is only determined by your PnL, wagering, and the house edge from the games you have played in.12:41 AM | Sheque: okay, and your colleague said that pnl is about 10%, so where is the wagering... in this conversation and the last one i had, i still have not heard where the wagering kicks in12:44 AM | Nancy from Rollbit: I mentioned it since your bonus is good, which is already 10% of the bonus, but the daily bonus is not set at 10%.   Again, wagering is already included in the amount.12:46 AM | Sheque: and again, how is the wagering added in... because if i only look at wagering without the pnl i got less then 0.125 percent back, that still seems ridiculously low to me, can you forward me to someone who can actually explain to me how wagering works for the daily12:47 AM | Nancy from Rollbit: There is no precise computation for those, as has already been stated a few times.   The daily bonus that you received already takes into account your wagering statistics.12:48 AM | Sheque: but like i said before, the least you should be able to do is tell me for example : the losses you make is calculated for something about 10% and the wagering you did should be around .5 % added to that, i think you should be able to state those numbers...12:50 AM | Sheque: so far i dont get a clear answer on how its calculated... and if you tell people in chat that the reward system is actually good here, you should be able to explain it clearly. at this point i got : you got for pnl around 10% and we think thats very nice, even tough you wagered 30000 dollars, 40 bucks is a great amount12:51 AM | Sheque: and we will not explain to you how wagering is added because we dont know, or wont tell you for whatever reason12:52 AM | Nancy from Rollbit: The Daily Bonus is a personalised bonus based on your recent activity on Rollbit. One of the main factors is your recent P&L, lossback is included within your Daily Bonus. You can add a Daily Bonus to your calendar once every 24 hours.   When adding a Daily Bonus, a Rakeboost will be activated. For a period of time, your rakeback will be increased. Rakeboosts do not stack.   The Daily Bonus can be up to 50% of the house edge on wagering during the previous 24 hours.12:52 AM | Sheque: you can link w/e u want, but there is still nothing about the wagering in there12:53 AM | Nancy from Rollbit: Please read the last paragraph12:54 AM | Sheque: yeah still very vague, up to 50% of house edge, what does that even mean, what is the house edge on 30000 dollars?12:54 AM | Nancy from Rollbit: It depends on the games you've played12:54 AM | Sheque: slots, hacksaw/pragmatic12:55 AM | Nancy from Rollbit: Most of their slots are at 3.5% house edge12:56 AM | Sheque: then 30000 divided by 100 times 3,5 makes for 1050 dollars, wich would mean i got less then 1%...12:56 AM | Sheque: wich still does not make sense12:58 AM | Sheque: that would mean i got 0.5% of house edge on wagering12:58 AM | Sheque: thats a whole lot less then up to 5012:59 AM | Sheque: if i would get 50% i would get 525 dollars from wagering, how can it be that i got 5 lol... that seems fishy01:00 AM | Nancy from Rollbit: It's up to 50%, not exactly 50%01:00 AM | Sheque: even on 20% of house edge i would have 210 dollars lol01:00 AM | Sheque: no i get that01:00 AM | Sheque: but 5 dollars i a whole lot less then 52501:00 AM | Sheque: you cannot tell me that its correct that someone gets 50% and someone else gets 0.5 %, as a daily bonus,01:02 AM | Nancy from Rollbit: You only wagered $13,465.45 yesterday01:03 AM | Sheque: Casino PnL (1 Day) -343.73Your wager was 27,849.16 yesterday.01:03 AM | Sheque: this is about the day before,01:05 AM | Nancy from Rollbit: Alright, we continue to find no problems with the daily bonus that you were given.01:05 AM | Sheque: i clearly explained to you that it cannot be right, with the calculations and percentages you gave me i clearly showed you its not correct..01:06 AM | Sheque: then just saying : we find no problems is not right.01:08 AM | Nancy from Rollbit: Even though we've already explained everything to you, you don't seem to believe us.   The amount you received is accurate and correct. Your low PnL led to low rewards.   It is stated in the rewards page that the main factor of the daily bonus is your recent PNL01:08 AM | Sheque: because you say stuff that doesnt add up01:08 AM | Sheque: as i clearly showed01:08 AM | Sheque: you showed me a thing that said, daily bonus can be up to 50% of house edge of wagering01:09 AM | Sheque: i showed you the calculations, and its clear that i did not even get 0.5 percent,01:09 AM | Sheque: only that part should already be clear that its not correct01:09 AM | Nancy from Rollbit: Please do the maths again, it's around 5%01:10 AM | Sheque: no its not, because you said that pnl was also a factor, wich gave me like 10% lossback01:11 AM | Nancy from Rollbit: They are taken into account together instead of individually.   We have looked into this a several times, and we don't find any problems with the bonus you were given.01:12 AM | Sheque: and on top of that, if i calculate only the wagering, not the actual loss included i come up to 4,25% for 41,41 dollar01:12 AM | Sheque: wich is still a FAR way from 50%01:13 AM | Sheque: so you are telling me that ur advertising with up to 50% and in reality are just giving 4,25%01:14 AM | Nancy from Rollbit: Nothing further to add - you were given the accurate and correct bonus amount.01:18 AM | Sheque: can you answer my question?01:18 AM | Sheque: Are you telling me that ur advertising with \"up to 50% house edge from wagering back\" and in reality u give 4,25?01:20 AM | Sheque: i have saved this conversation btw, i will not drop this.01:23 AM | Sheque: because this is just ridiculous, i just got muted in chat for telling the truth, i see thats the way you work. once people figure out the false advertisement, lets mute them. but i will make sure ALOT of people will see this since you are clearly not gonna give me what i deserve.---Exported from Rollbit on November 29, 2023 at 01:23 AM UTC time UTC (GMT+0000)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "acroman08",
      "created_time": "November 29, 2023, 11:24:13 AM",
      "body": "I've read the conversation you've had with their support and I am still a little confused. when they say \"up to 50% of the house edge\" does that mean that the daily bonus will be calculated based on the house edge of the game you played? if that is so, does that mean if the house edge of the game you played is 1% you have a chance for your daily bonus to be calculated up to 50% of that house edge which is 0.5% at the highest and It can go lower from that since they say \"up to\" and not a guaranteed 50% of the house edge?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wapfika",
      "created_time": "November 29, 2023, 11:32:25 AM",
      "body": "Quote from: acroman08 on November 29, 2023, 11:24:13 AMI've read the conversation you've had with their support and I am still a little confused. when they say \"up to 50% of the house edge\" does that mean that the daily bonus will be calculated based on the house edge of the game you played? if that is so, does that mean if the house edge of the game you played is 1% you have a chance for your daily bonus to be calculated up to 50% of that house edge which is 0.5% at the highest and It can go lower from that since they say \"up to\" and not a guaranteed 50% of the house edge? This is correct interpretation but the tricky part is the word “up to” which probably based on the VIP level of an account to increase the rakeback percentage to that level since 50% rakeback is too huge to be given as based percentage for every account.His current rakeback percentage is around 4% to 5% which is equivalent to average VIP rakeback percentage. I’m not how Rollbit daily bonus work but I think the VIP level play an important role to get the maximum percentage.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "iv4n",
      "created_time": "November 29, 2023, 01:00:21 PM",
      "body": "Quote from: Wapfika on November 29, 2023, 11:32:25 AM...His current rakeback percentage is around 4% to 5% which is equivalent to average VIP rakeback percentage. I’m not how Rollbit daily bonus work but I think the VIP level play an important role to get the maximum percentage.I don't play at Rollbit as well, but for sure they have ToS where everything is explained, and before posting the entire conversation (argue) with support he should post their rules about the daily bonuses.In all other casinos, VIP plays an important role, as PnL, profit/loses... nobody gets bonuses based just on wagering, can you imagine someone wagering millions and receiving a 50% bonus on that wagering? That casino would fail in a week or even faster.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kingvirtus09",
      "created_time": "November 29, 2023, 01:03:22 PM",
      "body": "Based on your narrative, it seems like you are one of the VIPs of Rollbit, right? Because you receive around 40 dollars in daily bonuses here at Rollbit Casino. That's why, for sure, you won't be given such a daily bonus amount if you're not wasting a large amount of money on Rollbit.That's why your accusation against Rollbit is hard to believe, but still try to contact their support. Rollbit has been operating in the cryptocurrency industry for a few years, if I'm not mistaken.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fivestar4everMVP",
      "created_time": "November 29, 2023, 02:22:23 PM",
      "body": "I tried the best I could to read this till the end, but I just can't because it's way too long, but then, I've gotten a glimpse of what the issue is here from the part of the chat I've read.From what I understand, based on what the Customer care said, the daily bonus has nothing to do with how much a user wagered in a day, all that matters is the accumulated profit and loss, according to their explanation, one could wager a hundred thousand dollars and still end up with a $10 daily bonus depending on how much is accumulated as the profit and loss.So, for me, I believe that if op is truly being cheated, it should be in the area of his accumulated profit and loss, this is what determines how much daily bonus he should receive, this has nothing to do with how much was wagered.I hope a Rollbit representative will come around and sort this out by the way.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "holydarkness",
      "created_time": "November 29, 2023, 04:18:29 PM",
      "body": "Let's see if this summarize your case correctly: you feel like you're being cheated because your daily bonus is lower than your expectation. You're sure you've wagered a lot, which means you should be compensated with significantly bigger daily bonus. You asked the customer service and they've explained to you that there are multiple factor that are counted towards daily bonus, there is no single exact formula, as it depends on your loss, the house edge of the game you play, and other factors.You insist that their calculation must be wrong, meanwhile, they insist that there is nothing wrong. And things goes in circle around this topic.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sheque",
      "created_time": "November 29, 2023, 06:12:26 PMLast edit: May 01, 2024, 08:33:06 PM by Mr. Big",
      "body": "Quote from: holydarkness on November 29, 2023, 04:18:29 PMLet's see if this summarize your case correctly: you feel like you're being cheated because your daily bonus is lower than your expectation. You're sure you've wagered a lot, which means you should be compensated with significantly bigger daily bonus. You asked the customer service and they've explained to you that there are multiple factor that are counted towards daily bonus, there is no single exact formula, as it depends on your loss, the house edge of the game you play, and other factors.You insist that their calculation must be wrong, meanwhile, they insist that there is nothing wrong. And things goes in circle around this topic.The problem i have with this, is that first of all they gave some weird explanation wich were just lies, like the part where they said that my daily could be lower because sometimes they transfer that to weekly and monthly, wich is absolutely ridiculous ofcourse.On top of that they were very very vague about all of this.And when i finally got all the info it still doesnt add up, they gave 4.25% of house edge on wagering without any other factor they were talking about, when you state that you reward up to 50% and then just give out 4.25 thats very misleading in my eyes. And the best part, only get 20% of the amount lol, so for 28000 wagered i got 8 dollar, and the other is stuck to be claimed in a timespan of 2 weeks.Quote from: iv4n on November 29, 2023, 01:00:21 PMQuote from: Wapfika on November 29, 2023, 11:32:25 AM...His current rakeback percentage is around 4% to 5% which is equivalent to average VIP rakeback percentage. I’m not how Rollbit daily bonus work but I think the VIP level play an important role to get the maximum percentage.I don't play at Rollbit as well, but for sure they have ToS where everything is explained, and before posting the entire conversation (argue) with support he should post their rules about the daily bonuses.In all other casinos, VIP plays an important role, as PnL, profit/loses... nobody gets bonuses based just on wagering, can you imagine someone wagering millions and receiving a 50% bonus on that wagering? That casino would fail in a week or even faster.The problem is they do not have it stated clearly, its all very vague, and its up to 50% on house edge, and the actual wins and losses get also counted in, so the 4.25% i got was actually even lower because i didnt calculate the loss in there. House edge on slots are about 3,5% so that mean according to their advertisement it should be 28000/100×3,5, wich is around 1000 dollars, and 50% of that.And then the wins and losses get added/deducted from that, Its something in that area, but since they wont answer me honestly its hard to say, what i do know is for 360loss and 28000 wagered and hours and hours played, 41bucks is ridiculous. And taking about an hour to answer such a simple question is just horrible.Rollbit advertises with good reward system, but in reality they dont even come close to what they claim and they also split it up over 2-3 weeks needing to login every single day or losing parts of the bonus. That calendar is the most disgusting thing i have ever seen in my life, how greedy can you get that you need to take advantage of people with an addiction even more..Quote from: Fivestar4everMVP on November 29, 2023, 02:22:23 PMI tried the best I could to read this till the end, but I just can't because it's way too long, but then, I've gotten a glimpse of what the issue is here from the part of the chat I've read.From what I understand, based on what the Customer care said, the daily bonus has nothing to do with how much a user wagered in a day, all that matters is the accumulated profit and loss, according to their explanation, one could wager a hundred thousand dollars and still end up with a $10 daily bonus depending on how much is accumulated as the profit and loss.So, for me, I believe that if op is truly being cheated, it should be in the area of his accumulated profit and loss, this is what determines how much daily bonus he should receive, this has nothing to do with how much was wagered.I hope a Rollbit representative will come around and sort this out by the way. First they indeed said wagering didnt do anything.Then the customer support clearly stated later in the conversation, wagering is a added factor, and then advertise with \"up to 50% of house edge\" while i got like 4%(without calculating profit/loss so the actual percentage is even lower), thats just false advertisement since its not true.I also got the feeling they were just trying to tell lies to get rid of me. The first part of the conversation was crazy...First saying we havent had a complaint so you are wrong Then trying to say sometimes the bonus gets moved to weekly/monthly,I also talked in chat with a mod who said : maybe just wait for weekly/monthly instead of actually trying to fix the issue at hand.For a website that is so trusted this is one big joke. And ofcourse first saying wagering doesnt count, and then linking a thing that says that it does...Quote from: Wapfika on November 29, 2023, 11:32:25 AMQuote from: acroman08 on November 29, 2023, 11:24:13 AMI've read the conversation you've had with their support and I am still a little confused. when they say \"up to 50% of the house edge\" does that mean that the daily bonus will be calculated based on the house edge of the game you played? if that is so, does that mean if the house edge of the game you played is 1% you have a chance for your daily bonus to be calculated up to 50% of that house edge which is 0.5% at the highest and It can go lower from that since they say \"up to\" and not a guaranteed 50% of the house edge? This is correct interpretation but the tricky part is the word “up to” which probably based on the VIP level of an account to increase the rakeback percentage to that level since 50% rakeback is too huge to be given as based percentage for every account.His current rakeback percentage is around 4% to 5% which is equivalent to average VIP rakeback percentage. I’m not how Rollbit daily bonus work but I think the VIP level play an important role to get the maximum percentage.If you calculate the daily bonus purely on wagering its around 4,25% but thats not all because you also gotta calculate losses/wins in, and since i lost its even lower then 4,25%The statement about the 50% says nothing about ranks, and clearly support was trying to get rid of me without giving me any numbers at first.They also try to convince me that the daily bonus is random or something, its weird. Wich is another lie ofcourse, there is certainly a calculation behind it the system doesnt just go, you get 50% and someone else gets 1%,Even tough rollbit is big, it doesnt make these things right, this crap and that calendar wich they clearly use to milk addicted people out even more is just wrong.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "holydarkness",
      "created_time": "November 29, 2023, 07:27:24 PM",
      "body": "As far as understand from your story here, there is no scam attempt happen, is there? They did not stole something from you or voiding your bets, or locking you from your accont and denied your balance?If I may be boldly assuming, given all of the three latest post of yours covers the same topic, the 50% house edge and that you earned a very small percentage, the root of this situation is that you're not satisfied with their bonus. May I offer a simpler solution: leave the platform and move to others that you think offer a better ones.Regarding the false advertisement, yes, I have to agree to certain degree that it can be annoying, but that is not exactly a scam attempt, or misleading, given their wording were \"up to\", I think it's more toward \"read the fine print\", same like that eye-catching \"50% off\" sign in a store, that's followed with a tiny asterix.Oh, next time, please reply in one post, consecutive posts is against forum rules. You can reply to multiple person at the same time by clicking \"insert quote\" when you compose your reply.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "khaled0111",
      "created_time": "November 29, 2023, 09:06:52 PMLast edit: November 30, 2023, 08:30:28 PM by khaled0111",
      "body": "Hey OP, you can take screenshots of your conversation with customer support and upload them to any image hosting service then post the links here. I had to read the copy-pasted conversation and here is where I stopped and I think this is the most important part:Quote from: Sheque on November 29, 2023, 01:44:51 AM12:01 AM | Sheque: well that seems like a smart idea, and i would like the actual calculations... because 40 dollar for a 350 loss and 30000 wagered is absolutely disgustingly lowCasinos do not give you a reward (daily/weekly/monthly cashback) based on how much you've wagered. They give you a small percentage of how much you have lost. Otherwise, most of them would have shut down their doors by now.You have lost $350 and they gave you $40 back (plus few bucks as a weekly + monthly bonus). Sorry, but what did you expect to get more!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hhampuz",
      "created_time": "November 30, 2023, 04:35:21 AM",
      "body": "You wager ~$27k and end up losing $350. What exactly are you expecting to get from this, $350 so you end up at even? That's not how any business who want to stay in business would or could operate.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AHOYBRAUSE",
      "created_time": "November 30, 2023, 07:07:51 AM",
      "body": "40$ bonus for 27k wager is actually pretty decent in my eyes.When playing at stake for example a 27k wager will give you maybe 10-15$ tops in rake back, that's it.Losses are calculated in the weekly/monthly but with only 350$ in losses that would be MAYBE another 10$, if not less. Ending with 20-25 at stake in this case. So I don't see anything to complain about, even if I am really not a fan of rollbit.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rohang",
      "created_time": "November 30, 2023, 04:10:08 PM",
      "body": "sites like rollbit,stake etc will never tell you the exact calculation they use to calculate bonuses ;; so that they can reduce these whenever they feel like it.Many companies use somewhat false advertising saying you get a discount of UPTO x% while hiding in the TnC or just giving some thing useless for that % discountSame thing here where they say UPTO 50% but dont mention the requirements for it, its probably only for the super duper vips who bet millions and dont care about it anywaysIts super shitty but everyone essentially does it sadly",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "holydarkness",
      "created_time": "November 30, 2023, 04:40:14 PM",
      "body": "Quote from: rohang on November 30, 2023, 04:10:08 PMsites like rollbit,stake etc will never tell you the exact calculation they use to calculate bonuses ;; so that they can reduce these whenever they feel like it.[...]I don't think that's the reason, so they can reduce it at will. It's more [like the representative explained] it is determined by the system and was calculated by many different factor that they can't specify it down. For example, for user A, the bonus is calculated from 10% of his loss because he's currently losing <10,000 USD, 3% of his wager because he wagered 250,000 USD, and x% of the house edge and other factors. As you can see, his number will constantly change depending on these three factors only, it'll change with the game he played, with the outcome of his bet, and the amount he placed. Can someone really zeroing on the exact formula to calculate a bonus if it kept changing?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rohang",
      "created_time": "November 30, 2023, 06:40:28 PM",
      "body": "Quote from: holydarkness on November 30, 2023, 04:40:14 PMQuote from: rohang on November 30, 2023, 04:10:08 PMsites like rollbit,stake etc will never tell you the exact calculation they use to calculate bonuses ;; so that they can reduce these whenever they feel like it.[...]I don't think that's the reason, so they can reduce it at will. It's more [like the representative explained] it is determined by the system and was calculated by many different factor that they can't specify it down. For example, for user A, the bonus is calculated from 10% of his loss because he's currently losing <10,000 USD, 3% of his wager because he wagered 250,000 USD, and x% of the house edge and other factors. As you can see, his number will constantly change depending on these three factors only, it'll change with the game he played, with the outcome of his bet, and the amount he placed. Can someone really zeroing on the exact formula to calculate a bonus if it kept changing?These sites highly advertise themselves as being provably fair and have detailed algorithms/calculations as to how their games are fairIf they wanted to disclose the bonus calculations they can easily do so as well",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "holydarkness",
      "created_time": "December 01, 2023, 02:10:57 PM",
      "body": "Quote from: rohang on November 30, 2023, 06:40:28 PMQuote from: holydarkness on November 30, 2023, 04:40:14 PMI don't think that's the reason, so they can reduce it at will. It's more [like the representative explained] it is determined by the system and was calculated by many different factor that they can't specify it down. For example, for user A, the bonus is calculated from 10% of his loss because he's currently losing <10,000 USD, 3% of his wager because he wagered 250,000 USD, and x% of the house edge and other factors. As you can see, his number will constantly change depending on these three factors only, it'll change with the game he played, with the outcome of his bet, and the amount he placed. Can someone really zeroing on the exact formula to calculate a bonus if it kept changing?These sites highly advertise themselves as being provably fair and have detailed algorithms/calculations as to how their games are fairIf they wanted to disclose the bonus calculations they can easily do so as wellHow do you propose they do this, to disclose bonus calculation? I can only imagine so many factors involved in that calculation which made it ever changing. If you have a good idea to simplify it yet keeping it realistic and appealing, maybe many casino will consider to do that.Let's make an illustration, let's say someone played today, 1st of December 2023, from 00.00.00-23.59.59, within that time, he played a lot of game, which house edge were as following it [I just throw random numbers] blackjack [5%] 8 times in a row, roullete [7%] 15 times, several slots [2%, 6%, 2.5%] 5, 12, 10, another blackjack [5%] for 8 times, poker [9%] 3 times, different kind of poker [3%] 1 time, another different kind of poker [7%] for another 1 time, bacarrat [12%] 4 time, going back to blackjack [5%] for 20 times.Certainly, that number also depending on the membership level, but let's say he stayed on that level. Another factor will be total loss, you're free to make up the scenario where he won or loss each of those bets, as well as determining the percentage earned from each result. Let's go with just these three factors and assuming ceteris paribus.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rohang",
      "created_time": "December 01, 2023, 02:58:03 PM",
      "body": "Quote from: holydarkness on December 01, 2023, 02:10:57 PMQuote from: rohang on November 30, 2023, 06:40:28 PMQuote from: holydarkness on November 30, 2023, 04:40:14 PMI don't think that's the reason, so they can reduce it at will. It's more [like the representative explained] it is determined by the system and was calculated by many different factor that they can't specify it down. For example, for user A, the bonus is calculated from 10% of his loss because he's currently losing <10,000 USD, 3% of his wager because he wagered 250,000 USD, and x% of the house edge and other factors. As you can see, his number will constantly change depending on these three factors only, it'll change with the game he played, with the outcome of his bet, and the amount he placed. Can someone really zeroing on the exact formula to calculate a bonus if it kept changing?These sites highly advertise themselves as being provably fair and have detailed algorithms/calculations as to how their games are fairIf they wanted to disclose the bonus calculations they can easily do so as wellHow do you propose they do this, to disclose bonus calculation? I can only imagine so many factors involved in that calculation which made it ever changing.you are right ,there are certainly many factors involved for sure.However, as i said , talking about stake here, they have big fairness page where they explain the provably fair implementation as well have a calculator where u can verify results by entering hash,nonce etc.I think you are taking it way too technical, its probably as simple as them calculating users PnL , the house edge amount his bets generated and his total wager.Whatever it is, it certainly cannot be more complicated then the provably fair games themselves",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hhampuz",
      "created_time": "December 01, 2023, 03:08:26 PM",
      "body": "Quote from: rohang on December 01, 2023, 02:58:03 PMWhatever it is, it certainly cannot be more complicated then the provably fair games themselvesI am quite confident that yes, it is more complicated since it's individually calculated. Provably fair is just provably fair across everything, for everyone. One user won't have a more provably fair hash than any other user whereas someone's gambling habits will differ A LOT between all users.Besides that, just showcasing exactly how they'd calculate rewards would never be a good idea since casinos operate on a customer retention basis and giving your competitors fuel to take those customers from you would basically be suicide.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}