{
  "id": "topic_5447003",
  "title": "GateioExchange",
  "author": "GateioExchange",
  "created_time": "March 31, 2023, 11:56:09 AM",
  "content": "Polygon’s zkEVM has just been released and it’s a game changer!  Now you can run EVM smart contracts directly on the layer 2, with zero knowledge proofs to prevent mischief.How does this compare with other Eth layer 2s with rollups such as Arbitrum and Optimism?Tune in to our brand new video which also has a crypto prize giveaway:https://www.youtube.com/watch?v=JCcSVCeYIS4",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5447003",
  "comments": [
    {
      "author": "cryptoaddictchie",
      "created_time": "March 31, 2023, 01:41:46 PM",
      "body": "Ive been seen the news about this plus they got an nft free for 1week to celebrate its release. Technically aim not sure how does this release would impact the layer 2 on eth but definitely this will be a competition when it comes to technology and innovation so while it being tested lets see what would be the outcome. But the new era of hype might revolve around layer 2 projects.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "asriloni",
      "created_time": "March 31, 2023, 03:53:17 PM",
      "body": "I think that you are wrong in this case. I meant arbitrum and optimism was layer 2 blockchain but these blockchains are not zk. It must be compared with zksynch and linea (consensys). There are three zk l2 blockchains that exist in the market now. I see if there was no big difference between one to the another. The only thing that makes it different is about how many TPS can be processed and whether the blockchain was hiding the transaction or not. I must say that if stark was the best one compared with those blockchains but these blockchains are very low even in the main net. Zksync looks better compared with polygon zkevm.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rokok lokal",
      "created_time": "April 01, 2023, 02:10:59 PM",
      "body": "Quote from: GateioExchange on March 31, 2023, 11:56:09 AMHow does this compare with other Eth layer 2s with rollups such as Arbitrum and Optimism?I think about the Polygon zkEVM Release is a significant development in the world of Ethereum Layer 2 scaling solutions. The zkEVM technology enables the execution of EVM smart contracts on Layer 2 networks, leveraging zero-knowledge proofs to provide enhanced security and prevent malicious behavior.This technology enables secure and private transactions, ensuring that the network is resilient against any form of fraudulent activity. The introduction of Polygon's zkEVM represents a major step forward in the search for scalable and secure blockchain solutions, revolutionizing the world of decentralized applications and taking the blockchain industry to new height.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "disconnectme",
      "created_time": "April 01, 2023, 06:36:59 PM",
      "body": "This would have been huge news for the Polygon ecosystem but this new release seems like a crowded trade to me and I see this as a zero-sum game for Polygon because the platform already has a token and there is no need for users to remain on the chain, and we have started seeing this with ZKSyncs which is seeing their TVL scale up significantly to farm their airdrops. The Layer two platform is likely going to be a big narrative going to the next bull run, just position yourself very well",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}