{
  "id": "topic_5460568",
  "title": "sam00",
  "author": "sam00",
  "created_time": "July 21, 2023, 01:58:47 PM",
  "content": "Einleitung und Danksagung:Am 13. Oktober 2020 habe ich mich, nach einigen Wochen oder sogar Monaten als stiller Mitleser, hier auf Bitcointalk registriert.In der Zeit konnte ich unheimlich viel lernen und bin durch die einzelnen Ränge galoppiert.Als Member dachte ich noch, dass 100 Merits für den Full-Member Rang sowieso nie erreichbar wären Genauso dachte ich mit der Erreichung des Hero-Rangs, dass ich doch ewig brauchen würde, bis ich 1000 Activity und Merit habe Heute, am 21.07.2023 stehe ich bei über 900 Activity und über 900 Merits.Was das bedeutet, liegt auf der Hand. In absehbarer Zeit werde ich den höchsten Rang erreichen und das möchte ich hier ein bisschen feiern.Wenn auch der Legendary-Rang aktuell keine direkten Vorteile mehr für mich bietet, ist das für mich ein großer symbolischer Meilenstein.Bevor wir zu den Regeln des Gewinnspiels kommen, möchte ich mich daher nochmal bei wirklich jedem hier bedanken, für die wertvollen Beiträge und die Begleitung sowie Hilfe auf diesem Weg!Zum Gewinnspiel:Ich möchte es einfach halten und lasse euch den Bitcoin Preis in Euro zu einem noch unbekannten Datum tippen.Um genau zu sein, müsst ihr den Bitcoin Kurs 10 Tage nachdem ich zum Legendary-Member aufsteige, tippen.Hierbei wird der schließende (closing) Kurs von https://coinmarketcap.com/currencies/bitcoin/historical-data/ verwendet.Sollte ich bspw. am 13.08.2023 aufsteigen, zählt der letzte Preis vom 23.08.2023.Wieso 10 Tage danach? Damit man keinen Tipp abgeben kann, mich dann schnell auf Legendary pusht und den Gewinn einsackt (auch wenn ich hier von niemandem ein missbräuchliches Verhalten so erwarten würde).Die Regeln übersichtlich:- Die Tippabgabe läuft so lange, bis ich Legendary-Member bin- Tipps müssen auf 100€ gerundet werden (z.B 28.000€, 40.300€, 47.900€) und dürfen nicht doppelt vorkommen- Eure Tippabgaben dürfen nicht editiert werden. Wenn ihr euren Tipp ändern wollt, erstellt einen neuen Post und weist mich bitte darauf hin.- Euer Account muss vor dem 01.05.2023 registriert worden sein- Ihr müsst in den letzten 120 Tagen mindestens 5 Merits erhalten haben (das dürfte für die meisten hier kein Problem sein )- Wie oben schon geschrieben, zählt der letzte Kurs auf https://coinmarketcap.com/currencies/bitcoin/historical-data/, 10 Tage nach meinem Aufstieg- Teilnahme nur mit einem Account. Wer dabei erwischt wird, mit mehreren Accounts teilzunehmen, wird von dem Gewinnspiel verbannt- Ich behalte mir das Recht vor, Teilnehmer unabhängig der oben genannten Regeln auszuschließenGewinne:1. Platz: 1mBTC2. Platz: 0,5mBTCBonus: Wenn es jemand schafft, ein Screenshot zu machen, wie ich exakt 1000 Merits habe und diesen hier hochlädt, schmeiße ich noch 0,25mBTC für den 3. Platz rein.Hinweis:Das ist kein selbstmoderierter Beitrag aber ich wünsche mir, dass hier keine Diskussionen über Offtopic, Politik etc. stattfinden, danke!Gerne darf auch über eure Reise hier berichtet werden aber versucht den Beitrag halbwegs übersichtlich zu halten",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5460568",
  "comments": [
    {
      "author": "sam00",
      "created_time": "July 21, 2023, 01:59:27 PMLast edit: July 30, 2023, 09:46:06 AM by sam00",
      "body": "Alle validen Tippabgaben: TeilnehmerTippabgabe Bitcoinpreis in Euro________________________________________________MinoRaiola25.500bullrun2020bro26.500Lakai0127.500Real-Duke28.5005tift29.000Mauser29.800mv198630.000cygan30.600AHOYBRAUSE31.400Soonandwaite32.800Unknown0133.300mole081543.200",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Unknown01",
      "created_time": "July 21, 2023, 09:34:28 PM",
      "body": "Ein sehr nettes Gewinnspiel und du hast dich hier zu einem geschätzten Mitglied unserer Community entwickelt und darüber freuen sich hier bestimmt alle. Also schön dich hier bei uns zu haben und deine Ränge hast du dir auch alle verdient Nun zum Gewinnspiel: Da ich hier denke, dass du demnächst aufsteigen wirst (durch dein Engagement) schätze oder tippe ich auf keine besonders hohe Steigung, ich sage Mal 33.300€.Vielen Dank für die Organisation und auf viele weitere Jahre!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "1miau",
      "created_time": "July 21, 2023, 10:24:57 PMLast edit: July 22, 2023, 12:13:21 AM by 1miau",
      "body": "Das ist wirklich ein überaus legendäres Gewinnspiel. Die Teilnahmefrist ist ziemlich trickig, da man natürlich leicht den Zeitpunkt verpassen kann, wenn man knapp vorher noch einen akkuraten Tipp abgeben möchte. Noch bist du ca. 75 Merit von 1.000 Stück entfernt, das kann schon noch ein Weilchen dauern, wenn man das mit deinen bisherigen, erhaltenen Merits hochrechnet. Du bist ja knapp 2 3 Jahre im Forum, da wären es hochgerechnet ca. 2 3 Monate. (Hatte mich erst verrechnet  )Der Bitcoinpreis ist aktuell eh genauso unkalkulierbar, da sich Bitcoin nicht entscheiden kann, wo es hin will. Quote from: sam00 on July 21, 2023, 01:58:47 PMBonus: Wenn es jemand schafft, ein Screenshot zu machen, wie ich exakt 1000 Merits habe und diesen hier hochlädt, schmeiße ich noch 0,25mBTC für den 3. Platz rein.Vielleicht kannst du noch einfügen, dass dazu eine Archivierung benötigt wird, weil sonst könnte man das leicht manipulieren.  Quote from: sam00 on July 21, 2023, 01:58:47 PMAls Member dachte ich noch, dass 100 Merits für den Full-Member Rang sowieso nie erreichbar wären Genauso dachte ich mit der Erreichung des Hero-Rangs, dass ich doch ewig brauchen würde, bis ich 1000 Activity und Merit habe Heute, am 21.07.2023 stehe ich bei über 900 Activity und über 900 Merits.Schön zu sehen, dass du da so erfolgreich bist. Und es ist auch ein guter Beweis, dass man rasch einiges an Merit erhält, wenn man gute Beiträge schreibt und sich bemüht.  Quote from: sam00 on July 21, 2023, 01:58:47 PM- Wie oben schon geschrieben, zählt der letzte Kurs auf https://coinmarketcap.com/currencies/bitcoin/historical-data/, 10 Tage nach meinem Aufstieg+1Gute Lösung, damit den Preis zu bestimmen. Normal gibt es ja immer Verwirrung mit der Zeitzone oder welche Tauschbörse als Referenz genommen wird etc.. Die Lösung für dein Gewinnspiel ist da eine gute Idee.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MaxMueller",
      "created_time": "July 22, 2023, 12:21:23 AM",
      "body": "Bei 970 merits kannst du dich ja bei ratimov im internationalen Faden um eine Aufstockung bemühen (kennst du ja).Das macht es für alle Teilnehmer noch schwieriger den exakten Zeitpunkt der Beförderung abzuschätzen und bringt nochmal etwas mehr Spannung ins Spiel?!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Real-Duke",
      "created_time": "July 22, 2023, 10:03:49 AM",
      "body": "Hier gibt es Gewinnspiele, für die mir selbst die Ideen fehlen würden Sehr schöner Einfall von Dir, deinen bald anstehenden und verdienten Aufstieg mit uns ein wenig zu feiern und ich denke mal, dass Du es spätestens im Herbst geschafft haben solltest.Außer natürlich, Du kommst jetzt auf die glorreiche Idee hier im nächsten Jahr nur noch Blödsinn zu schreiben, nur um uns damit ein wenig hinzuhalten Damit es sich einfacher rechnet, habe ich deinen Bestand gerade auf 930 Merits aufgerundet. Von deiner Activity her, könnte es ja auch jetzt schon reichen.Irgendwie sagt mir mein Gefühl, dass es jetzt auch sehr schnell gehen könnte und tippe daher auf: 28,500 EurViel Erfolg Dir und viel Glück uns allen!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MinoRaiola",
      "created_time": "July 22, 2023, 08:20:29 PM",
      "body": "68 Merit left, die kannst du bestimmt während der kommenden Sommerzeit einsacken und dann hast du es auch zum Legendary geschafft. Man bedenke wie wenig deutsche User in den letzten 2-3 Jahren dazu gekommen sind, also ein toller Erfolg. Danke für das Gewinnspiel. Mein Tipp: 27.900$",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sam00",
      "created_time": "July 23, 2023, 12:58:58 PM",
      "body": "Quote from: Unknown01 on July 21, 2023, 09:34:28 PM~Vielen Dank für die netten Worte, dein Tipp trage ich gleich ein Quote from: 1miau on July 21, 2023, 10:24:57 PMDas ist wirklich ein überaus legendäres Gewinnspiel. Die Teilnahmefrist ist ziemlich trickig, da man natürlich leicht den Zeitpunkt verpassen kann, wenn man knapp vorher noch einen akkuraten Tipp abgeben möchte.Danke! Ich dachte, ich bringe dadurch noch ein bisschen Schwung mit rein. Hoffe aber, dass nicht zu viele dadurch die Teilnahme verpassen.Quote from: 1miau on July 21, 2023, 10:24:57 PMVielleicht kannst du noch einfügen, dass dazu eine Archivierung benötigt wird, weil sonst könnte man das leicht manipulieren.   Leider habe ich das überhaupt nicht bedacht. Das ganze lässt sich ja super einfach sonst fälschen. Also eigentlich ist so ein Screenshot recht sinnlos.Quote from: 1miau on July 21, 2023, 10:24:57 PMSchön zu sehen, dass du da so erfolgreich bist. Und es ist auch ein guter Beweis, dass man rasch einiges an Merit erhält, wenn man gute Beiträge schreibt und sich bemüht.  Ja es gibt natürlich andere, die noch das vielfache an Merits in der Zeit sammeln aber dieser Schnitt von ~1 Merit / Tag oder Activity finde ich schonmal gut Quote from: Turbartuluk on July 22, 2023, 12:21:23 AMBei 970 merits kannst du dich ja bei ratimov im internationalen Faden um eine Aufstockung bemühen (kennst du ja).Das macht es für alle Teilnehmer noch schwieriger den exakten Zeitpunkt der Beförderung abzuschätzen und bringt nochmal etwas mehr Spannung ins Spiel?!  Ja das könnte ich natürlich machen. Ab 950 Merits würde ich einen Tipp abgeben, weil es dann echt schnell gehen kann...Quote from: Real-Duke on July 22, 2023, 10:03:49 AMHier gibt es Gewinnspiele, für die mir selbst die Ideen fehlen würden Sehr schöner Einfall von Dir, deinen bald anstehenden und verdienten Aufstieg mit uns ein wenig zu feiern und ich denke mal, dass Du es spätestens im Herbst geschafft haben solltest.Außer natürlich, Du kommst jetzt auf die glorreiche Idee hier im nächsten Jahr nur noch Blödsinn zu schreiben, nur um uns damit ein wenig hinzuhalten Damit es sich einfacher rechnet, habe ich deinen Bestand gerade auf 930 Merits aufgerundet. Von deiner Activity her, könnte es ja auch jetzt schon reichen.Irgendwie sagt mir mein Gefühl, dass es jetzt auch sehr schnell gehen könnte und tippe daher auf: 28,500 EurViel Erfolg Dir und viel Glück uns allen! Vielen Dank für die netten Worte und das Merit! Ich trage deinen Tipp gleich ein Quote from: MinoRaiola on July 22, 2023, 08:20:29 PM68 Merit left, die kannst du bestimmt während der kommenden Sommerzeit einsacken und dann hast du es auch zum Legendary geschafft. Man bedenke wie wenig deutsche User in den letzten 2-3 Jahren dazu gekommen sind, also ein toller Erfolg. Danke für das Gewinnspiel. Mein Tipp: 27.900$Vielen Dank, ich trage deinen Tipp gleich ein",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AHOYBRAUSE",
      "created_time": "July 24, 2023, 12:48:35 AM",
      "body": "Coole Sache.Allein durch diesen Thread wirst du ja auch ein paar Merit sammeln, da wird der Sprung auf Legendary nicht lange auf sich warten lassen müssen.Viele Danke und herzlichen Glückwunsch schon mal!Mein Tip: 31.400$",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mauser",
      "created_time": "July 24, 2023, 06:21:33 AM",
      "body": "Danke @sam00 für ein weiteres Gewinnspiel und schon mal ein vorzeitiges Glückwunsch für deinen baldigen Aufstieg. Sind einige Gewinnspiele jetzt mit Preisschätzungen im DE Forum, irgendwann muß doch auch mal ein blinder Vogel richtig liegen  Mein Tip: 29.800$Viel Glück an Alle",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sam00",
      "created_time": "July 24, 2023, 07:49:16 AM",
      "body": "Quote from: AHOYBRAUSE on July 24, 2023, 12:48:35 AMViele Danke und herzlichen Glückwunsch schon mal!Mein Tip: 31.400$Vielen Dank schonmal für die Glückwünsche und die Teilnahme am Gewinnspiel !:)Deinen Tipp trage ich gleich ein!Quote from: Mauser on July 24, 2023, 06:21:33 AMDanke @sam00 für ein weiteres Gewinnspiel und schon mal ein vorzeitiges Glückwunsch für deinen baldigen Aufstieg. Sind einige Gewinnspiele jetzt mit Preisschätzungen im DE Forum, irgendwann muß doch auch mal ein blinder Vogel richtig liegen  Mein Tip: 29.800$Dir auch erstmal vielen Dank für die Teilnahme und die die vorzeitigen Glückwünsche!:)Die Chance, irgendwo mal richtig zu liegen ist wirklich sehr hoch bei den ganzen Gewinnspielen, die aktuell laufen.Deinen Tipp trage ich direkt ein.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lakai01",
      "created_time": "July 24, 2023, 02:10:39 PM",
      "body": "Na da drücke ich die Daumen, dass das relativ schnell klappt bei dir Sam00! Bei welcher Activity man zum Legendary wird ist ja mWn rein zufallsbasiert, könnte auch gut möglich sein, dass das sofort mit dem Erreichen von 1000 Merits der Fall sein wird. Das Gewinnspiel ist eine top Idee! Mein nicht ganz so bullischer Tipp wären 27.500€",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sam00",
      "created_time": "July 26, 2023, 07:16:12 AM",
      "body": "Quote from: Lakai01 on July 24, 2023, 02:10:39 PMNa da drücke ich die Daumen, dass das relativ schnell klappt bei dir Sam00! Bei welcher Activity man zum Legendary wird ist ja mWn rein zufallsbasiert, könnte auch gut möglich sein, dass das sofort mit dem Erreichen von 1000 Merits der Fall sein wird. Das Gewinnspiel ist eine top Idee! Mein nicht ganz so bullischer Tipp wären 27.500€Vielen Dank fürs Daumen Drücken und die Teilnahme am Gewinnspiel Ich trage deinen Tipp gleich ein!Im Meta Bereich habe ich gerade mal nachgeschaut und es ist wohl so, dass man mit 1000 Merits und dann irgendwann zwischen 775 und 1030 Activity zum Legendary Member aufsteigt. Insofern halte ich es für recht wahrscheinlich, dass ich direkt aufsteigen würde.Spätestens in 2-3 Monaten sollte es aber dann soweit sein",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cygan",
      "created_time": "July 26, 2023, 07:41:21 AM",
      "body": "wie schon unsere AHOYBRAUSE hier geschrieben hat, wirst bzw. hast allein durch diesen faden schon etliche merits abgestaubt da ich hier noch nicht mitgemacht habe, möchte ich nun auch meine preisschätzung abgegenmein tip: $30.600",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Soonandwaite",
      "created_time": "July 26, 2023, 09:27:17 AM",
      "body": "Na dann werde ich auch mal einen Tipp abgeben. Mehr als nicht gewinnen ist ja nicht drinne. Mein Tipp wären dann die $32800 . Und ja. Einen Merit vergebe ich auch. Wenn schon sehr viele Merits vergeben werden wenn einer schreibt das er im Kurzurlaub warhat dieser Faden mindestens doppelt so viele verdient.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bullrun2024bro",
      "created_time": "July 26, 2023, 10:24:22 AM",
      "body": "Schönes Gewinnspiel @sam00! Dann hoffen wir mal, dass es mit deinem Aufstieg zum Legendary nicht mehr so lange dauert. Sind ja nicht mehr so viele Merits. Ich bin aktuell wieder OOM und kann im Moment nicht helfen.Ich würde dann auch einmal meinen Tipp abgeben:Code:User: bullrun2020broTipp: $26.500Und natürlich auch viel Glück an alle Teilnehmer, dass ihr mit eurer Schätzung richtig liegt.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "1miau",
      "created_time": "July 26, 2023, 10:58:57 PM",
      "body": "Quote from: sam00 on July 26, 2023, 07:16:12 AMIm Meta Bereich habe ich gerade mal nachgeschaut und es ist wohl so, dass man mit 1000 Merits und dann irgendwann zwischen 775 und 1030 Activity zum Legendary Member aufsteigt. Insofern halte ich es für recht wahrscheinlich, dass ich direkt aufsteigen würde.Mal sehen ob manche Teilnehmer darauf spekulieren, etwas länger zu warten, falls du tatsächlich noch keinen Legendary Rang hast, selbst bei 1.000 Merit. Wobei es natürlich gut möglich sein könnte, dass beides nah beieinander fällt und du fast gleichzeitig 1.000 Merit und 1030 Activity hättest. Die 1.000 Merit sollten aber im Normalfall eher erreicht sein als 1030 Activity, was aktuell 50 Merit in 80 Tagen entsprechen würde.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bullrun2024bro",
      "created_time": "July 27, 2023, 09:14:32 AM",
      "body": "Quote from: haloxon on July 27, 2023, 07:22:43 AMkleiner Hinweis, nachdem hier mindestens 4-5 Tipps mit Dollar-Zeichen abgegeben wurden, diese Tipps aber 1:1 mit Euro eingetragen wurden, weil die Regeln ja Euro vorsehen ... der Kurs steht derzeit bei 0,9:1 - also nicht bei 1:1 - dies nur mal so die Stimme aus dem off  Valider Punkt @haloxon. Danke dir!Weil ich meinen Tipp oben ungern nachträglich editieren möchte um nicht gegen die Spielregeln zu verstoßen, bitte ich den Spielleiter im Sinne alle Teilnehmer zu entscheiden wie mit meinem $-Tipp umgegangen werden soll. Ob dieser direkt in € übernommen oder mittels Umrechnungskurs angepasst wird, ist mir dabei relativ egal.  Quote from: sam00 on July 21, 2023, 01:58:47 PM- Eure Tippabgaben dürfen nicht editiert werden. Wenn ihr euren Tipp ändern wollt, erstellt einen neuen Post und weist mich bitte darauf hin.Ansonsten natürlich nochmal viel Glück an alle Teilnehmer!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sam00",
      "created_time": "July 27, 2023, 09:29:47 AM",
      "body": "Quote from: 1miau on July 26, 2023, 10:58:57 PMDie 1.000 Merit sollten aber im Normalfall eher erreicht sein als 1030 Activity, was aktuell 50 Merit in 80 Tagen entsprechen würde.  Davon gehe ich auch mal stark aus Quote from: cygan on July 26, 2023, 07:41:21 AMmein tip: $30.600Vielen Dank für die Teilnahme Bevor ich deinen Tipp eintrage, bitte ich dich nochmal zu prüfen, wie viel Euro du tippen möchtest oder ob ich einfach 30.600€ eintragen soll?Quote from: Soonandwaite on July 26, 2023, 09:27:17 AMNa dann werde ich auch mal einen Tipp abgeben. Mehr als nicht gewinnen ist ja nicht drinne. Mein Tipp wären dann die $32800 . Und ja. Einen Merit vergebe ich auch. Wenn schon sehr viele Merits vergeben werden wenn einer schreibt das er im Kurzurlaub warhat dieser Faden mindestens doppelt so viele verdient. Vielen Dank für die Teilnahme und die Unterstützung! Hier bitte auch auf Euro/Dollar nochmal schauen und mir Bescheid geben!:)Quote from: haloxon on July 27, 2023, 07:22:43 AMkleiner Hinweis, nachdem hier mindestens 4-5 Tipps mit Dollar-Zeichen abgegeben wurden, diese Tipps aber 1:1 mit Euro eingetragen wurden, weil die Regeln ja Euro vorsehen ... der Kurs steht derzeit bei 0,9:1 - also nicht bei 1:1 - dies nur mal so die Stimme aus dem off  Danke haloxon! Das ist mir bei den Tipps oben gar nicht aufgefallen, dass in Dollar getippt wurde...Quote from: bullrun2020bro on July 27, 2023, 09:14:32 AMWeil ich meinen Tipp oben ungern nachträglich editieren möchte um nicht gegen die Spielregeln zu verstoßen, bitte ich den Spielleiter im Sinne alle Teilnehmer zu entscheiden wie mit meinem $-Tipp umgegangen werden soll. Gib mir Einfach kurz Bescheid, ob ich die 26.500 als Euro eintragen soll oder ob du es in Euro umrechnen möchtest Danke für die Teilnahme und die Unterstützung!:)Ich warte jetzt auf eure Rückmeldungen und trage bis dahin nur die Euro-Tipps ein.@MinoRaiola @AHOYBRAUSE @Mauser bitte teilt mir ebenfalls mit, ob ich euren Tipp so in Euro stehen lassen soll, oder ob ihr nochmal nachbessern wollt. Falls ich von euch nichts mehr höre, lasse ich die Tipps so stehen.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bullrun2024bro",
      "created_time": "July 27, 2023, 09:31:13 AM",
      "body": "Quote from: sam00 on July 27, 2023, 09:29:47 AMGib mir Einfach kurz Bescheid, ob ich die 26.500 als Euro eintragen soll oder ob du es in Euro umrechnen möchtest Danke für die Teilnahme und die Unterstützung!:)Einfach direkt als Euro Tipp übernehmen. Danke dir!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}