{
  "id": "topic_5456126",
  "title": "Outhue",
  "author": "Outhue",
  "created_time": "June 12, 2023, 11:28:45 AM",
  "content": "Can you quit gambling if you make a life changing money and never go back to gambling? I asked this because those who made some money through gambling near me always go back to gamble and they end up losing everything they once made through gambling.Is it fine to say that people should not go back into gambling once they made high amount of money? Because the chance of losing that money again is very high, even if they don't use all the money to gamble at once, gambling can take it all back in time. Have you ever won a high amount of money from gambling and managed to not lose them all back to gambling? And to date, you are still gambling?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5456126",
  "comments": [
    {
      "author": "abel1337",
      "created_time": "June 12, 2023, 11:48:53 AM",
      "body": "Quote from: Outhue on June 12, 2023, 11:28:45 AMCan you quit gambling if you make a life changing money and never go back to gambling? I asked this because those who made some money through gambling near me always go back to gamble and they end up losing everything they once made through gambling.Is it fine to say that people should not go back into gambling once they made high amount of money? Because the chance of losing that money again is very high, even if they don't use all the money to gamble at once, gambling can take it all back in time. Have you ever won a high amount of money from gambling and managed to not lose them all back to gambling? And to date, you are still gambling? Ohh yes, I've been an addict before and I've experienced a downfall. Now I can consider myself as a normal gambler that can control myself and is pretty organized in using my funds. I follow my budget strictly and I can stop playing anytime I want now, in-short, I'm not an addict anymore. If I won money that can change my life and could possibly make me comfortable for the rest of my life, I would probably stop doing gambling since I've been doing it for years now and there are games that I like so much before that it makes me boring now.There will be people who won't or can't quit gambling since they haven't experienced it to the fullest but me, I've already been there and I don't want to waste the chance of quitting.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Desmong",
      "created_time": "June 12, 2023, 11:57:42 AM",
      "body": "Quote from: Outhue on June 12, 2023, 11:28:45 AMCan you quit gambling if you make a life changing money and never go back to gambling? I asked this because those who made some money through gambling near me always go back to gamble and they end up losing everything they once made through gambling.Is it fine to say that people should not go back into gambling once they made high amount of money? Because the chance of losing that money again is very high, even if they don't use all the money to gamble at once, gambling can take it all back in time. Have you ever won a high amount of money from gambling and managed to not lose them all back to gambling? And to date, you are still gambling?  Quit gambling? How possible is that because even though I make huge or the highest amount of money ever in my life, I will never quit gambling because this had become and interesting part of my existence. Gambling is a way of.life and we ought to understand that people will keep participate in gambling as far as possible.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitcoinPanther",
      "created_time": "June 12, 2023, 11:59:31 AM",
      "body": "Quote from: Outhue on June 12, 2023, 11:28:45 AMCan you quit gambling if you make a life changing money and never go back to gambling? This is dependent on the discipline of the player.   It is more on how he can control his urge to gamble after experiencing a life changing winnings from his gambling activity.  Greed also have a major factor in this decision.Quote from: Outhue on June 12, 2023, 11:28:45 AMIs it fine to say that people should not go back into gambling once they made high amount of money? That should be the case, a gambler after winning a life changing amount should stop and nurture the winning by investing it on more controllable venture not to waste the chance given.  There is a huge possibility that if a player come back to gambling, he might lose all his winning and worst he might get addicted and chase huge winnings.  Though if the player has control of his gambling, I don't think that will be a problem.Quote from: Outhue on June 12, 2023, 11:28:45 AMHave you ever won a high amount of money from gambling and managed to not lose them all back to gambling? And to date, you are still gambling? I always try to withdraw and stop whenever I won an amount I think is big enough and come back another day. And yes I am still gambling to date.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nwada001",
      "created_time": "June 12, 2023, 12:08:30 PM",
      "body": "Quote from: Outhue on June 12, 2023, 11:28:45 AMCan you quit gambling if you make a life changing money and never go back to gambling? I asked this because those who made some money through gambling near me always go back to gamble and they end up losing everything they once made through gambling.Is it fine to say that people should not go back into gambling once they made high amount of money? Because the chance of losing that money again is very high, even if they don't use all the money to gamble at once, gambling can take it all back in time. Have you ever won a high amount of money from gambling and managed to not lose them all back to gambling? And to date, you are still gambling? NO I can't, the reason why most people gamble it's not just to get Rich quick and leave their poor financial status, most people gamble because they love playing game and having fun adding together with the money which they possibly wins most times. If I win a big amount of money today from gambling that is worth changing one's financial status, for the main time I will purse gambling because of the overexcitement, not because I'm tired of gambling, but because I need a break to arrange myself with the money I have won. I need to map out how I can use it and invest it rightfully in order to not go broke again. I will still go back to gambling, but I'm not going back to gambling with all that I have won; I will still continue with the gambling habit that I was using before I won the big amount. Just because I now have millions does not mean I will increase my staking amount from the hundreds I was using before to millions. The reason I will not quite be consistent is because of consistency. Just because you made millions from Bitcoin does not mean you will sell it all off and stop trading or holding it.It's only addicts and greedy gamblers who will always waste an opportunity by wagering all their winnings back to gambling again, and I believe your friend might be one of those. Such a person will always want to use all that they have to gamble in order to earn more; they are never satisfied; they always want to win the next game; they always see the next game as an opportunity to win.Gambling is not a bad thing if you can control your emotions, know the limit to which you are gambling, and know when to stop. If gambling gives me a life-changing fortune, it's an excuse for not even quitting gambling, but it shouldn't be overused to the extent of me losing everything.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oshosondy",
      "created_time": "June 12, 2023, 12:13:34 PM",
      "body": "Quote from: Outhue on June 12, 2023, 11:28:45 AMCan you quit gambling if you make a life changing money and never go back to gambling? I am not gambling to make money, I gamble for fun, but making sure I am not wasting money on gambling. But if my work takes most of my time, I will prefer not to gamble because I put where that I make money from to be first. Quote from: Outhue on June 12, 2023, 11:28:45 AMHave you ever won a high amount of money from gambling and managed to not lose them all back to gambling? And to date, you are still gambling?Yes but not so big to make a life fortune. I do not know how to answer this than saying that I have weekly budget for gambling which is very small in amount and I do not go more than it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "purinZ14",
      "created_time": "June 12, 2023, 12:15:55 PM",
      "body": "If you were able to get a x amount of money through gambling most likely you’re gonna want to bet again and double that amount. Usually when people win they don’t feel scared but rather they feel confident and they think they’re on top of the world. The only ones I know who stopped gambling quit because they lost a what you call a life-changing amount of money. Never seen one who stopped after winning.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "UserU",
      "created_time": "June 12, 2023, 12:29:58 PM",
      "body": "Millionaires and billionaires never stop \"gambling\". It's a race to be richer/ the richest",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fivestar4everMVP",
      "created_time": "June 12, 2023, 12:32:16 PM",
      "body": "Well, for me, I've never made any money I can consider high amount from gambling, but then, must be sincere, like the op said, I also have seen people who made really big amount of money from gambling but later lost it all back to the Casino over time, with this experience, and supported by the fact that I am not a addicted to gambling, if luck locates me and I win a huge sum of money, I will quit gambling for that main time, and replan my life and come up with a very good and lucrative business I will use that money to establish..Maybe I will consider gambling again after I've established the business and its doing very well, I could discipline myself to only gamble with a small percentage of the profit made from that business, this can help that even if I don't end up winning, the losses won't affect my business in any way or cause it to crash - or better still, I will quit gambling for ever.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AbuBhakar",
      "created_time": "June 12, 2023, 12:35:55 PM",
      "body": "Quote from: Outhue on June 12, 2023, 11:28:45 AMCan you quit gambling if you make a life changing money and never go back to gambling? It’s very hard to quit when you are in profit compared when in loss because you are happy on the result of your gambling and have money at the same time to gamble more.Quote from: Outhue on June 12, 2023, 11:28:45 AMHave you ever won a high amount of money from gambling and managed to not lose them all back to gambling? And to date, you are still gambling? I always experienced scenario like this. I always winning huge amount then lose it all in the other day when I came back gambling. It’s very easy to become reckless on bets when you knew that you are on profit and the money that you are using is not part of your original bankroll until I loss it all.I still gambling and improved myself.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "xSkylarx",
      "created_time": "June 12, 2023, 12:36:56 PM",
      "body": "I don't have experience winning enormous amounts but I've heard stories online and also near our place which is about the lottery, there are others that managed it well. There are others that still continue gambling on it,  the problem with winning big is that you are now thinking that your money is unlimited, giving money to others, and throwing a party here and there. You didn't notice you already spent too much. When they saw that their money now is less they will now start to gamble again to try to double it or more as they think they are lucky. Still, there are also other people that not into gambling now I mean they haven't quit as they play occasionally and are in control like just spending their free time as they are now more focused on their business as they really hold that opportunity well.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stadus",
      "created_time": "June 12, 2023, 12:43:32 PM",
      "body": "Quote from: Outhue on June 12, 2023, 11:28:45 AMCan you quit gambling if you make a life changing money and never go back to gambling? No way, gambling is the reason why I am making life-changing money. Why would I quit gambling? In fact, there's no reason to quit gambling because you don't have to gamble all your winnings. You can enjoy your winnings and still gamble at the same time. The only risk is if you cannot control yourself, as you will surely lose what you have won if you become addicted.People would only think of quitting gambling if they view it as a burden instead of entertainment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ajiz138",
      "created_time": "June 12, 2023, 12:48:27 PM",
      "body": "It really feels hard to stop because human nature is more greedy even if you have won a large amount and that money can change your life, but still in my opinion it is still very difficult for a gambler to stop.I believe some have succeeded in getting out of gambling from big wins but most of them are still difficult to stop even though some people think that a lot of money can change their lifestyle but it depends on your discipline, but for me this is still difficult for me can't make money from gambling because this is for my pleasure in football betting and other games, so it's impossible for me to win millions of dollars because what I bet is small and it's still very far from that dream",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Doan9269",
      "created_time": "June 12, 2023, 12:49:04 PM",
      "body": "Quote from: Outhue on June 12, 2023, 11:28:45 AMCan you quit gambling if you make a life changing money and never go back to gambling? It is possible for some and not possible for others,but the good thing about either of the sides is that if you win big, then try to make an effective utilization of the money by investing them into a profitable business, you may end gambling if you so wish after taking this step, or continue but to ensure you don't use a huge amount you can't afford to loose on bet.Quote from: Outhue on June 12, 2023, 11:28:45 AMHave you ever won a high amount of money from gambling and managed to not lose them all back to gambling? And to date, you are still gambling? Am yet to experience this kind of a jackpot win in gambling over years now and am still aspiring for more opportunities to come through this anytime soon, however am still gambling moderately.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "acroman08",
      "created_time": "June 12, 2023, 12:49:18 PM",
      "body": "Quote from: Outhue on June 12, 2023, 11:28:45 AMCan you quit gambling if you make a life changing money and never go back to gambling?personally, I'd probably won't have a problem since I have been a casual gambler for a long time now but I feel like it'll harder for those who have a gambling problem since they have money that they can use to quench their urges.Quote from: Outhue on June 12, 2023, 11:28:45 AMHave you ever won a high amount of money from gambling and managed to not lose them all back to gambling? And to date, you are still gambling? I don't know what amount of money you consider \"high\" but I have won a significant amount of money(at least for me) in the past from gambling(not in online gambling though) and quickly left the establishment after cashing out, I still lost the majority of the money though, not from gambling but from paying bills and debt.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "elevates",
      "created_time": "June 12, 2023, 12:50:14 PM",
      "body": "There is a famous quote by Socrates: “He who is not contented with what he has, would not be contented with what he would like to have.” Quote from: Outhue on June 12, 2023, 11:28:45 AMI asked this because those who made some money through gambling near me always go back to gamble and they end up losing everything they once made through gambling.The greed takes over and a Gambler who made it big would again go back to give it a shot. In the end, losing everything that was won previously. If in case the gambler wins again then the greed would again force him to try his luck. It is just like a time loop, you repeat it you fail and you again try.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Shinpako09",
      "created_time": "June 12, 2023, 12:56:18 PM",
      "body": "Quote from: Outhue on June 12, 2023, 11:28:45 AMCan you quit gambling if you make a life changing money and never go back to gambling? Actually, this has been my idea for quite some time, but I have yet to implement it. I've even reduced my target amount. Although I did not deposit with my own money, if it weren't for gambling, my current life condition might be better. Before, I was able to earn 0.5 bitcoin in less than a week and, most of the time, 0.1 bitcoin per week for how many years. Maybe that's why I got stuck in gambling because beginner's luck makes me feel safe and that I can do it again. Which makes me worse.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CarnagexD",
      "created_time": "June 12, 2023, 01:10:04 PM",
      "body": "Quote from: Outhue on June 12, 2023, 11:28:45 AMCan you quit gambling if you make a life changing money and never go back to gambling? I asked this because those who made some money through gambling near me always go back to gamble and they end up losing everything they once made through gambling.Is it fine to say that people should not go back into gambling once they made high amount of money? Because the chance of losing that money again is very high, even if they don't use all the money to gamble at once, gambling can take it all back in time. Have you ever won a high amount of money from gambling and managed to not lose them all back to gambling? And to date, you are still gambling? Of course, you can. Everything is a choice. When you earn money fast and it makes you feel you don't deserve it, you will self-sabotage and give the money back by losing it all again. It just depends on how and where you put your money after winning. Say you put it on a business, and you're really dedicated to work that out. Tendencies are you won't get back to gambling again. But if you put the same mindset on your gambling practice into a business, you will fail. Because business is not easy money. So if your business fail and you still have that thinking of easy money, you will get back gambling.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lida93",
      "created_time": "June 12, 2023, 01:17:06 PM",
      "body": "Quote from: Outhue on June 12, 2023, 11:28:45 AMCan you quit gambling if you make a life changing money and never go back to gambling? I haven't had such luck to win such amount of money that could be referred to as life changing amount for me yet, but if I am luck enough to win such money then quiting gambling and replacing it with a business is the goal.QuoteI asked this because those who made some money through gambling near me always go back to gamble and they end up losing everything they once made through gambling.Is it fine to say that people should not go back into gambling once they made high amount of money? Because the chance of losing that money again is very high, even if they don't use all the money to gamble at once, gambling can take it all back in time. You shouldn't be surprised seeing such people still going back to continuous gambling despite winning such life changing amount. But then I asked, what was the main aim of them gambling? Cause I thought we all gamble to by luck be able to win an amount of money that could change our lives and never for we to have to go back to the gambling again. But I recently realized it's not same for some people.Sometime in 2019 I had a gambling mate that won an amount of money at around 7.4million in our local currency  but ended up lavishing and squandering the money that could have been a live changing money for him being in his late 20s. A apart of that squandering was exhausted in gambling with the hope that he was going to hit a high win of which he started increasing in wager 3x than normal. Today he's looking like someone that has never gotten a thousand to his name before.From his actions I gain a little experience and I also observed that what causes people to still head on to gambling after winning a life changing amount of cash is because that never had a business or project plan on ground of what and how they would use any life changing amount of money they may be lucky to win in their gambling endeavors. Hence, their spending does lack direction and purpose.QuoteHave you ever won a high amount of money from gambling and managed to not lose them all back to gambling? And to date, you are still gambling? I have managed to win good amount of money but not what I could refer to as high amount. And in every amount of money I win from gambling I always use a good proportion of the total amount to get myself a good property or invest it into my business, while I use the rest to try again...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DoublerHunter",
      "created_time": "June 12, 2023, 01:28:26 PM",
      "body": "Quote from: Outhue on June 12, 2023, 11:28:45 AMCan you quit gambling if you make a life changing money and never go back to gambling? ~snip~^ Not quitting but I think it is good to take a break, take a vacation for a week, that sounds interesting.But unfortunately, I did not experience this, on my own, it is possible for someone to quit gambling after making a life-changing amount of money, but it can be challenging. Gambling addiction is a common issue, and winning a large sum does not necessarily guarantee the ability to quit. Many individuals who have experienced success in gambling often find it difficult to resist the urge to gamble again, leading to potential losses. The reason I did not experience this is because I gamble for fun not for making money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}