{
  "id": "topic_5472532",
  "title": "red4slash",
  "author": "red4slash",
  "created_time": "November 02, 2023, 04:13:59 AM",
  "content": "Kita semua tahu bahwa transaksi online sekarang angkanya sangat fantastis dan salah satu yang berperan dalam pelonjakan ini adalah pedagang pedagang online, baik itu yang berdagang melalui e-comerce maupun di di platform platform yang menyediakan tempat untuk pedagang online. Baru baru ini BPS atau Badan Pusat Statistik merilis Peraturan BPS Nomor 4 Tahun 2023 yang mewajibkan para pedagang melaporkan data transaksi penjualan online setiap tiga bulan sekali atau perkuartal. Amalia (Plt Kepala BPS) menjelaskan, pengumpulan data transaksi perdagangan online tersebut bertujuan untuk mendorong pontensi ekonomi digital guna meningkatkan perekonomian di Indonesia. Sebab, transaksi digital Indonesia dinilai berpotensi besar menjadi akselerator perekonomian Indonesia di masa mendatang.Jangan khawatir, karena BPS juga telah mempersiapkan infrastruktur agar memudahkan pedagang online untuk melaporkan transaksi penjualan, pastinya penyampaian data secara digital.BPS pun menjamin keamanan data setiap pedagang karena kerahasiaan data ini dilindungi oleh Undang-Undang Nomor 16 Tahun 1997 tentang Statistik seperti yang disampaikan Plt Kepala BPS.Quote\"BPS akan dengan sungguh-sungguh menjamin kerahasiaan data yang telah disampaikan kepada kami. Tidak perlu khawatir, karena kerahasiaan data ini dilindungi oleh Undang-Undang Nomor 16 Tahun 1997 tentang Statistik. Kami selalu mengacu pada prinsip fundamental statistik resmi negara sesuai panduan PBB atau UN fundamental principal of official statistic. Jadi kerahasiaan data itu selalu kami jaga dari hulu hingga hilir,\"*https://www.youtube.com/watch?v=r6QlNxjr8sM*https://www.beritasatu.com/ekonomi/1074655/pedagang-wajib-lapor-transaksi-jualan-online-bps-jamin-data-terlindungiMenurut saya para pedagang harus mengindahkan dan turut andil  dalam kebijakan yang baru dikeluarkan ini. Sebab ini akan menjadi data penting untuk perkembangan ekonomi kita dimasa mendatang.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5472532",
  "comments": [
    {
      "author": "pusaka",
      "created_time": "November 02, 2023, 06:11:55 AM",
      "body": "Quote from: red4slash on November 02, 2023, 04:13:59 AMKita semua tahu bahwa transaksi online sekarang angkanya sangat fantastis dan salah satu yang berperan dalam pelonjakan ini adalah pedagang pedagang online, baik itu yang berdagang melalui e-comerce maupun di di platform platform yang menyediakan tempat untuk pedagang online. Baru baru ini BPS atau Badan Pusat Statistik merilis Peraturan BPS Nomor 4 Tahun 2023 yang mewajibkan para pedagang melaporkan data transaksi penjualan online setiap tiga bulan sekali atau perkuartal. Amalia (Plt Kepala BPS) menjelaskan, pengumpulan data transaksi perdagangan online tersebut bertujuan untuk mendorong pontensi ekonomi digital guna meningkatkan perekonomian di Indonesia. Sebab, transaksi digital Indonesia dinilai berpotensi besar menjadi akselerator perekonomian Indonesia di masa mendatang.Jangan khawatir, karena BPS juga telah mempersiapkan infrastruktur agar memudahkan pedagang online untuk melaporkan transaksi penjualan, pastinya penyampaian data secara digital.BPS pun menjamin keamanan data setiap pedagang karena kerahasiaan data ini dilindungi oleh Undang-Undang Nomor 16 Tahun 1997 tentang Statistik seperti yang disampaikan Plt Kepala BPS.Quote\"BPS akan dengan sungguh-sungguh menjamin kerahasiaan data yang telah disampaikan kepada kami. Tidak perlu khawatir, karena kerahasiaan data ini dilindungi oleh Undang-Undang Nomor 16 Tahun 1997 tentang Statistik. Kami selalu mengacu pada prinsip fundamental statistik resmi negara sesuai panduan PBB atau UN fundamental principal of official statistic. Jadi kerahasiaan data itu selalu kami jaga dari hulu hingga hilir,\"*https://www.youtube.com/watch?v=r6QlNxjr8sM*https://www.beritasatu.com/ekonomi/1074655/pedagang-wajib-lapor-transaksi-jualan-online-bps-jamin-data-terlindungiMenurut saya para pedagang harus mengindahkan dan turut andil  dalam kebijakan yang baru dikeluarkan ini. Sebab ini akan menjadi data penting untuk perkembangan ekonomi kita dimasa mendatang.Ini adalah langkah yang bagus yang dilakukan pemerintah untuk bisa lebih mentata perdagangan online agar bisa lebih terkoordinir lagi dari segi statistik. Aktivitas online ini terus tumbuh, terutama pada saat Covid19 beberapa waktu lalu. Bahkan salah satu riset mengatakan angkanya melonjak pesat, seperti yang saya kutip dari  Kompas.comQuoteHal itu terlihat dari laporan “Navigating Indonesia’s E-Commerce: Omnichannel as the Future of Retail\".  Berdasarkan laporan ini, 74,5 persen konsumen lebih banyak berbelanja online daripada berbelanja offline. Founder dan CEO SIRCLO, Brian Marshal mengatakan, hal itu terjadi lantaran pandemi membuat hampir semua pemenuhan kebutuhan pokok dan berbagai kegiatan lainnya dialihkan melalui layanan digital.Selain daripada itu salah satu indikator yang bisa kita lihat juga adalah banyaknya e-wallet atau dompet digital yang terus hadir dan memberikan kemudahan akses untuk masyarakat. Sekarang hampir setiap e-comerce memiliki dompetnya sendiri, kita tidak harus lagi menggunakan akun bank untuk transaksi secara digital. Namun ada juga yang harus diperbaiki dalam berbelanja online ini, COD atau bayar di tempat adalah salah satu fitur yang memudahkan konsumen untuk berbelanja secara online karena konsumen bisa bayar ditempat atau bayar setelah barangnya datang. Namun ini juga bukan tanpa kendala, karena dalam beberapa kasus merugikan pihak dari konsumen, seller bahkan kurir dari pari perusahaan jasa yang sebenarnya tidak tahu menahu tentang transaksi ini, mereka turut menjadi korban, seperti yang terjadi pada kasus  ini. Dan masih banyak kasus yang berkaitan dengan hal ini.Saya berharap pemerintah juga ikut andil dalam hal ini agar supaya tidak ada lagi pihak yang diirugikan saat berbelanja online, baik itu pembeli, penjual maupun pihak ke 3 dalam transaksi tersebut.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "flower12",
      "created_time": "November 02, 2023, 10:30:56 AM",
      "body": "Quote from: red4slash on November 02, 2023, 04:13:59 AMKita semua tahu bahwa transaksi online sekarang angkanya sangat fantastis dan salah satu yang berperan dalam pelonjakan ini adalah pedagang pedagang online, baik itu yang berdagang melalui e-comerce maupun di di platform platform yang menyediakan tempat untuk pedagang online. Baru baru ini BPS atau Badan Pusat Statistik merilis Peraturan BPS Nomor 4 Tahun 2023 yang mewajibkan para pedagang melaporkan data transaksi penjualan online setiap tiga bulan sekali atau perkuartal. Amalia (Plt Kepala BPS) menjelaskan, pengumpulan data transaksi perdagangan online tersebut bertujuan untuk mendorong pontensi ekonomi digital guna meningkatkan perekonomian di Indonesia. Sebab, transaksi digital Indonesia dinilai berpotensi besar menjadi akselerator perekonomian Indonesia di masa mendatang.Jangan khawatir, karena BPS juga telah mempersiapkan infrastruktur agar memudahkan pedagang online untuk melaporkan transaksi penjualan, pastinya penyampaian data secara digital.BPS pun menjamin keamanan data setiap pedagang karena kerahasiaan data ini dilindungi oleh Undang-Undang Nomor 16 Tahun 1997 tentang Statistik seperti yang disampaikan Plt Kepala BPS.Quote\"BPS akan dengan sungguh-sungguh menjamin kerahasiaan data yang telah disampaikan kepada kami. Tidak perlu khawatir, karena kerahasiaan data ini dilindungi oleh Undang-Undang Nomor 16 Tahun 1997 tentang Statistik. Kami selalu mengacu pada prinsip fundamental statistik resmi negara sesuai panduan PBB atau UN fundamental principal of official statistic. Jadi kerahasiaan data itu selalu kami jaga dari hulu hingga hilir,\"*https://www.youtube.com/watch?v=r6QlNxjr8sM*https://www.beritasatu.com/ekonomi/1074655/pedagang-wajib-lapor-transaksi-jualan-online-bps-jamin-data-terlindungiMenurut saya para pedagang harus mengindahkan dan turut andil  dalam kebijakan yang baru dikeluarkan ini. Sebab ini akan menjadi data penting untuk perkembangan ekonomi kita dimasa mendatang.Semua pihak yang berkaitan dengan ini harus berkesinambungan agar peraturan baru ini berjalan sesuai dengan apa yang diharapkan. Namun untuk BPS sendiri, meskipun mereka mengatakan telah mempersiapkan fasilitas atau infrastruktur untuk memudahkan pedagang bisa melaporkan aktivitas perdagangannya namun mereka harus benar benar serius dalam mempermudah akses untuk pedagang jangan sampai itu hanya perkataan manis saja. Pasalnya bukan saya bermaksud untuk mendiskreditkan pemerintah atau pihak terkait, namun masalah yang sering terjadi di negara kita adalah selalu dipersulit untuk mengakses sesuatu sehingga itu membuat kita menjadi malas jika ingin berkontribusi dalam kebijakan kebijakan baru yang diterapkan. Jadi bisa dikatakan bukan masyarakat tidak mendukung kebijakan, namun dengan proses yang rumit kita menjadi enggan untuk melakukannya. Saya berharap pihak terkait serius dalam mengelola ini, jangan sampai ini menjadi peraturan atau kebijakan namun pada akhirnya tidak serius untuk dikelola. Pasalnya hal ini saya melihat sangat penting, terlebih ini berkaitan dengan aktivitas ekonomi negara kita.Quote from: pusaka on November 02, 2023, 06:11:55 AMNamun ada juga yang harus diperbaiki dalam berbelanja online ini, COD atau bayar di tempat adalah salah satu fitur yang memudahkan konsumen untuk berbelanja secara online karena konsumen bisa bayar ditempat atau bayar setelah barangnya datang. Namun ini juga bukan tanpa kendala, karena dalam beberapa kasus merugikan pihak dari konsumen, seller bahkan kurir dari pari perusahaan jasa yang sebenarnya tidak tahu menahu tentang transaksi ini, mereka turut menjadi korban, seperti yang terjadi pada kasus  ini. Dan masih banyak kasus yang berkaitan dengan hal ini.Saya berharap pemerintah juga ikut andil dalam hal ini agar supaya tidak ada lagi pihak yang diirugikan saat berbelanja online, baik itu pembeli, penjual maupun pihak ke 3 dalam transaksi tersebut.Saya  memiliki pengalaman yang menarik dengan fitur COD ini, saya beberapa kali bertemu dengan penjual yang tidak bertanggung jawab. Seperti beberapa bulan lalu saya melakukan pembelian barang dan pada saat datang barangnya tidak sesuai dengan apa yang saya pesan. Untungnya saya selalu teliti ketika ada pesanan yang datang, saya akan selalu mengecek terlebih dahulu apakah nomor resinya sesuai dengan nomor resi barang yang datang atau tidak. Dan kebetulan pada saat itu barang yang saya pesan masih dalam proses seller, namun yang aneh adalah kenapa barang itu tiba tiba bisa datang ke rumah. Saya juga tidak tahu apakah memang itu dari pihak seller yang tidak bertanggung jawab, atau ada pihak lain yang melakukan hal ini, maksud saya data kita saat berbelanja bocor atau lain sebagainya. Saya sepakat dengan anda bahwa masih ada oknum oknum yang merugikan pihak lain dan ini harus diperbaiki lagi, agar kejadian yang sama tidak terulang kembali.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ryu_Ar1",
      "created_time": "November 02, 2023, 06:56:06 PM",
      "body": "Saya pernah membaca hal ini dan memang saya rasa usulan ini sebenarnya sudah di usulkan dari beberapa tahun sebelumnya karena bahkan jika saya tidak salah ketika berbicara tentang BPS yang menginginkan data semacam ini telah ada sejak 2 atau 3 tahun lalu tetapi itu terus mandek karena para pedagang sulit untuk berpartisipasi dalam hal ini sehingga setelah itu tidak ada kabar lagi sampai sekarang ada aturan baru yang mengurus hal ini.Usulan yang ada memang masih sangat bagus tetapi berkaca dari yang sudah terjadi beberapa tahun sebelumnya ketika sulitnya pemerintah (dalam hal ini BPS) untuk membuat beberapa gebrakan dalam mempelopori apa yang harus dilakukan para pedagang hal seperti ini tetap akan sama.Perlunya ada bimbingan lebih tentang hal ini karena pada akhirnya para pedagang online juga tidak akan tahu jika hal seperti ini tidak diberi pemahaman terlebih dahulu.Selain itu, saya rasa kita juga semua pasti sadar bahwa ketika wacana atau aturan seperti ini ada pasti akan banyak sekali pro dan kontra yang terjadi termasuk dari para pedagang karena beberapa tahun lalu juga hal ini mangkrak dan tidak menutup kemungkinan sekarang pun akan sama sehingga perlu adanya intervensi langsung yang harus dimiiliki pemerintah khususnya BPS jika memang mau melakukan hal seperti ini.Saya mencari beberapa sumber terkait tentang yang saya bicarakan sebelumnya diatas dan ini beberapa penunjang yang menjadi referensi saya.https://www.youtube.com/watch?v=2xBkDfDLOz0https://ekonomi.republika.co.id/berita/piqwyr382/bps-kesulitan-kumpulkan-data-ecommerce",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blue Snow",
      "created_time": "November 03, 2023, 05:41:03 AM",
      "body": "Quote from: red4slash on November 02, 2023, 04:13:59 AMBaru baru ini BPS atau Badan Pusat Statistik merilis Peraturan BPS Nomor 4 Tahun 2023 yang mewajibkan para pedagang melaporkan data transaksi penjualan online setiap tiga bulan sekali atau perkuartal. Amalia (Plt Kepala BPS) menjelaskan, pengumpulan data transaksi perdagangan online tersebut bertujuan untuk mendorong pontensi ekonomi digital guna meningkatkan perekonomian di Indonesia. Sebab, transaksi digital Indonesia dinilai berpotensi besar menjadi akselerator perekonomian Indonesia di masa mendatang.Jangan sampai data yang didapat dari pedagang online tersebut leak saja. Karena kita tahu sendiri kalau data sudah di pemerintah, akan sangat mudah dihack oleh hacker online. Ini juga harus ditopang dengan teknologi yang mumpuni, kalau dikit-dikit ngelag dan tidak bisa diakses, jangan salahkan pedagang online saja kalau mereka tidak bisa mengirim data. Ane juga tidak paham, apa maksud mereka selain untuk pertumbuhan ekonomi?. Kalau ane lihat secara kasat mata sih, banyak pedagang offline yang menangis karena jualannya kalah bersaing dengan toko online. Seharusnya peran BPS itu mempertimbangkan juga pertumbuhan ekonomi dari sisi pedagang offline dong, jangan tidak berimbang seperti ini, jadi seolah-olah, pedagang offline itu dianak-tirikan oleh pemerintah.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rat03gopoh",
      "created_time": "November 03, 2023, 08:23:49 AM",
      "body": "App marketplace yg ada seperti toped, sopi, dll bukankah berlegalitas dan diawasi institusi seperti OJK dan kominfo? Seharusnya BPS dapat memanfaatkan mereka untuk melaporkan data penjualan seller yang ada. Sisanya tinggal menjaring seller-seller yang berdagang diluar app itu, baik di sosial media atau chat app seperti FB grup jual beli/marketplace dan WA Business.Quote from: red4slash on November 02, 2023, 04:13:59 AMBPS pun menjamin keamanan data setiap pedagang karena kerahasiaan data ini dilindungi oleh Undang-Undang Nomor 16 Tahun 1997 tentang Statistik seperti yang disampaikan Plt Kepala BPS.Termasuk dilindungi dari perpajakan?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitLeap",
      "created_time": "November 03, 2023, 10:45:08 AM",
      "body": "Quote from: rat03gopoh on November 03, 2023, 08:23:49 AMApp marketplace yg ada seperti toped, sopi, dll bukankah berlegalitas dan diawasi institusi seperti OJK dan kominfo? Seharusnya BPS dapat memanfaatkan mereka untuk melaporkan data penjualan seller yang ada. Sisanya tinggal menjaring seller-seller yang berdagang diluar app itu, baik di sosial media atau chat app seperti FB grup jual beli/marketplace dan WA Business.Nah benar, kenapa mereka tidak bekerja sama langsung dengan marketplace, karena setahu saya untuk menjadi pedagang disana juga memverifikasi diri, menurut saya itu lebih memudahkan bukan hanya untuk BPS itu sendiri akan tetapi juga pedagang yang berada disana.Catatan transaksi disana jelas lebih lengkap, dan saya yakin mereka juga pasti akan bersedia untuk bekerja sama dengan BPS sebagai pihak yang akan mendata para pedagang online.Memang sebaiknya BPS bekerja sama dengan semua unsur dalam merealisasikan peraturan baru ini, termasuk dengan pihak marketplace. Menurut saya akses mereka juga akan mudah untuk bekerja sama dengan mereka, terlebih jika ini berkaitan dengan pemerintahQuote from: rat03gopoh on November 03, 2023, 08:23:49 AMQuote from: red4slash on November 02, 2023, 04:13:59 AMBPS pun menjamin keamanan data setiap pedagang karena kerahasiaan data ini dilindungi oleh Undang-Undang Nomor 16 Tahun 1997 tentang Statistik seperti yang disampaikan Plt Kepala BPS.Termasuk dilindungi dari perpajakan? Sepertinya agan ini trauma dengan perpajakan, hahah.Namun kita tahu sendirilah pemerintah kita bagaimana dalam merespon segala sesuatu. Namun itu tidak salah juga, asalkan aturan itu masuk akal dan dapat diterima saya pribadi sih akan menjadi warga negara yang baik.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "vv181",
      "created_time": "November 04, 2023, 12:47:53 AM",
      "body": "Quote from: rat03gopoh on November 03, 2023, 08:23:49 AMApp marketplace yg ada seperti toped, sopi, dll bukankah berlegalitas dan diawasi institusi seperti OJK dan kominfo? Seharusnya BPS dapat memanfaatkan mereka untuk melaporkan data penjualan seller yang ada.Sepertinya marketplace bukan ranahnya OJK dan Kominfo, khususnya perihal akses data terkait. Di sisi lain, Ditjen pajak, memang sudah bisa meminta/mengakses data keuangan pedagang. Ada beberapa kasus dimana penjual marketplace mendapatkan surat cinta dari mereka karena belum ada pelaporan pajak, jadinya langsung ditagih.Perihal akses mengakses data juga institusi pemerintahan tidak bisa semena-mena untuk meminta perusahaan terkait untuk membagikan datanya, walaupun memang bertujuan hanya sebagai pengumpulan data penjualan untuk tujuan statistik.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BigBos",
      "created_time": "November 04, 2023, 12:40:04 PM",
      "body": "Itu bisa menjadi alternatif yang bagus untuk mengetahui dan mendata para pedagang tetapi memang masalah ketika pemberlakuan hal ini juga past ada. Yang memungkinkan pasti terjadi dalam permasalahan ini adalah 1. Para pedagang online tidak akan terlalu mengindahkan hal ini karena sebagaimana kita tahu bahwa usulan ini sudah ada sejak beberapa tahun sebelumnya tetapi sampai sekarang itu masih belum membuahkan hasil dan hanya wacana saja dari pemerintah yang memperlihatkan kinerja mereka mandek dan butuh waktu hingga bertahun-tahun untuk merealisasikan hal ini.2. Data yang sudah ada di pemerintah itu tidak terbukti aman. Kita tahu berapa banyak data kita yang bocor ke internet karena keamanan cyber kita yang lemah. sehingga ketika melihat data yang terkumpul dengan banyak seperti ini maka bisa saja akan ada orang yang menyalah gunakan dan memperjual belikan data (seperti kasus yang sering terjadi di negara kita) karena keamanan kita yang buruk justru ini bisa menambah masalah.Ini harus diperhatikan dengan matang karena bagaimanapun jangan sampai usulan yang bagus dan bisa menguntungkan untuk negara dan para pedagang justru berubah menjadi bumerang yang bisa menyerang kepada tuannya.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "baenschi78",
      "created_time": "November 04, 2023, 12:49:02 PM",
      "body": "Quote from: rat03gopoh on November 03, 2023, 08:23:49 AMTermasuk dilindungi dari perpajakan? Wacana pajak pedagang online bukan nya sudah ada dari tahun 2019 https://youtu.be/YEIVolHHpEs Kalau memang tujuan utama nya untuk keadilan ya saya setuju aja dikenakan pajak. Tapi Pemerintah harus menjamin pajak tersalurkan dengan baik.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nimethasa",
      "created_time": "January 10, 2024, 06:50:15 AM",
      "body": "Quote from: rat03gopoh on November 03, 2023, 08:23:49 AMApp marketplace yg ada seperti toped, sopi, dll bukankah berlegalitas dan diawasi institusi seperti OJK dan kominfo? Seharusnya BPS dapat memanfaatkan mereka untuk melaporkan data penjualan seller yang ada. Sisanya tinggal menjaring seller-seller yang berdagang diluar app itu, baik di sosial media atau chat app seperti FB grup jual beli/marketplace dan WA Business.Quote from: red4slash on November 02, 2023, 04:13:59 AMBPS pun menjamin keamanan data setiap pedagang karena kerahasiaan data ini dilindungi oleh Undang-Undang Nomor 16 Tahun 1997 tentang Statistik seperti yang disampaikan Plt Kepala BPS.Termasuk dilindungi dari perpajakan? bukan untuk di lindungi biar tidak bayar pajak hehehetapi data itu malah di gunakan untuk narik pajak dari para pedagang online biar bisa tambah banyak sumber uang negara dari pendapatan pajak",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "red4slash",
      "created_time": "January 10, 2024, 01:18:45 PM",
      "body": "Quote from: pusaka on November 02, 2023, 06:11:55 AMNamun ada juga yang harus diperbaiki dalam berbelanja online ini, COD atau bayar di tempat adalah salah satu fitur yang memudahkan konsumen untuk berbelanja secara online karena konsumen bisa bayar ditempat atau bayar setelah barangnya datang. Namun ini juga bukan tanpa kendala, karena dalam beberapa kasus merugikan pihak dari konsumen, seller bahkan kurir dari pari perusahaan jasa yang sebenarnya tidak tahu menahu tentang transaksi ini, mereka turut menjadi korban, seperti yang terjadi pada kasus  ini. Dan masih banyak kasus yang berkaitan dengan hal ini.Fiture COD memang masih sangat cukup meresahkan untuk beberapa kasus karena memang terkadang dalam hal ini konsumen nya juga tidak terlalu mengerti tentang sistem COD disisi lain masih ada beberapa penjual yang tidak jujur yang justru ini merepotkan dan merugikan kurir sebagai pengantar.Tidak sedikit yang menjadi korban karena memang kecerobohan yang sebenarnya masih bisa dihindari. Dari hal ini juga kita tahu bahwa terkadang masih banyak sekali warga kita yang tidak terlalu mengerti aturan dan menginginkan semuanya sesuai dengan kehendak, disisi lain untuk E-commerce juga sebenarnya harus ada teguran untuk beberapa oknum pedagang yang nakal karena dalam hal ini situasi yang terjadi tidak akan rumit jika memang tidak ada pedagang online di suatu e-commerce yang nakal seperti beberapa kasus yang terjadi.Tahun lalu sepertinya saya pernah membaca tentang tuntutan untuk system COD yang dihilangkan tetapi tampaknya itu tidaklah mudah karena sampai sekarang hal itu tidak kunjung mendapatkan putusan akhir.Quote from: Ryu_Ar1 on November 02, 2023, 06:56:06 PMSaya pernah membaca hal ini dan memang saya rasa usulan ini sebenarnya sudah di usulkan dari beberapa tahun sebelumnya karena bahkan jika saya tidak salah ketika berbicara tentang BPS yang menginginkan data semacam ini telah ada sejak 2 atau 3 tahun lalu tetapi itu terus mandek karena para pedagang sulit untuk berpartisipasi dalam hal ini sehingga setelah itu tidak ada kabar lagi sampai sekarang ada aturan baru yang mengurus hal ini.Pasti akan ada beberapa hambatan karena memang bukan di Indonesia namanya jika usulan langsung disetujui karena sudah pasti itu sedikit mengganggu beberapa kepentingan lain yang berhubungan dengan uang  (kalian pasti mengerti apa yang saya maksudkan  )Selain itu memang para pedagang juga masih sulit untuk melakukan penertiban seperti ini karena beberapa kondisi juga tentunya dan memang ada sangkut paut dengan ke khawatiran tentang pajak pendapatan dan lain-lain. Tetapi pada akhirnya kemungkinan ini bisa menjadi sebuah solusi karena pada akhirnya jika memang kita ingin mnejadi sebuah negara yang maju maka hal-hal kecil seperti ini harus di data lebih awal agar tidak mengganggu karena pasti kita sadar bahwa sistem di negara kita ini masih carut marut.Quote from: blue Snow on November 03, 2023, 05:41:03 AMQuote from: red4slash on November 02, 2023, 04:13:59 AMBaru baru ini BPS atau Badan Pusat Statistik merilis Peraturan BPS Nomor 4 Tahun 2023 yang mewajibkan para pedagang melaporkan data transaksi penjualan online setiap tiga bulan sekali atau perkuartal. Amalia (Plt Kepala BPS) menjelaskan, pengumpulan data transaksi perdagangan online tersebut bertujuan untuk mendorong pontensi ekonomi digital guna meningkatkan perekonomian di Indonesia. Sebab, transaksi digital Indonesia dinilai berpotensi besar menjadi akselerator perekonomian Indonesia di masa mendatang.Jangan sampai data yang didapat dari pedagang online tersebut leak saja. Karena kita tahu sendiri kalau data sudah di pemerintah, akan sangat mudah dihack oleh hacker online. Ini juga harus ditopang dengan teknologi yang mumpuni, kalau dikit-dikit ngelag dan tidak bisa diakses, jangan salahkan pedagang online saja kalau mereka tidak bisa mengirim data. Ini juga masih menjadi sebuah hal yang perlu di perhatikan karena ada sebuah kewaswasan sebenarnya ketika kita diminta atau istilah kerennya adalah pendataan dari pemerintah justru ini membuat kita menjadi kurang nyaman. Bukan sekali 2 kali hacker menyerang bahkan merampas data kita karena memang mudahnya untuk para hacker mengakses situs yang berhubungan dengan pemerintahan karena kurangnya sumber daya disana sehingga pasti akan ada sebuah ke khawatiran tersendiri dalam hal ini selama beberapa masalah seperti ini tidak bisadiseslesaikan dengan mudah paka pasti akan banyak yang curiga takutnya hal seperti ini disalahgunakan.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CK485",
      "created_time": "January 15, 2024, 02:42:37 PM",
      "body": "Quote from: red4slash on November 02, 2023, 04:13:59 AMKita semua tahu bahwa transaksi online sekarang angkanya sangat fantastis dan salah satu yang berperan dalam pelonjakan ini adalah pedagang pedagang online, baik itu yang berdagang melalui e-comerce maupun di di platform platform yang menyediakan tempat untuk pedagang online. Baru baru ini BPS atau Badan Pusat Statistik merilis Peraturan BPS Nomor 4 Tahun 2023 yang mewajibkan para pedagang melaporkan data transaksi penjualan online setiap tiga bulan sekali atau perkuartal. Amalia (Plt Kepala BPS) menjelaskan, pengumpulan data transaksi perdagangan online tersebut bertujuan untuk mendorong pontensi ekonomi digital guna meningkatkan perekonomian di Indonesia. Sebab, transaksi digital Indonesia dinilai berpotensi besar menjadi akselerator perekonomian Indonesia di masa mendatang.Jangan khawatir, karena BPS juga telah mempersiapkan infrastruktur agar memudahkan pedagang online untuk melaporkan transaksi penjualan, pastinya penyampaian data secara digital.BPS pun menjamin keamanan data setiap pedagang karena kerahasiaan data ini dilindungi oleh Undang-Undang Nomor 16 Tahun 1997 tentang Statistik seperti yang disampaikan Plt Kepala BPS.Quote\"BPS akan dengan sungguh-sungguh menjamin kerahasiaan data yang telah disampaikan kepada kami. Tidak perlu khawatir, karena kerahasiaan data ini dilindungi oleh Undang-Undang Nomor 16 Tahun 1997 tentang Statistik. Kami selalu mengacu pada prinsip fundamental statistik resmi negara sesuai panduan PBB atau UN fundamental principal of official statistic. Jadi kerahasiaan data itu selalu kami jaga dari hulu hingga hilir,\"*https://www.youtube.com/watch?v=r6QlNxjr8sM*https://www.beritasatu.com/ekonomi/1074655/pedagang-wajib-lapor-transaksi-jualan-online-bps-jamin-data-terlindungiMenurut saya para pedagang harus mengindahkan dan turut andil  dalam kebijakan yang baru dikeluarkan ini. Sebab ini akan menjadi data penting untuk perkembangan ekonomi kita dimasa mendatang.Ane rasa dengan adanya pelaporan ke KPS memang akan membantu para pengusaha dalam bidang tertentu, dan terkait pelaporan tersebut mungkin untuk meninjau perpajakan dikemudian hari. Ane berharap para pengusaha lebih maju dalam bidang nya dan bisa membawa keberuntungan bagi orang-orang disekitar mereka seperti banyaknya lapangan pekerjaan terutama bagi mereka yang sudah berusia pensiunan tapi tidak memiliki dana pensiun, dan bisa bekerja paruh waktu dengan kemampuan mereka yang membuat mendapatkan uang dengan lebih baik.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}