{
  "id": "topic_5433198",
  "title": "TryNinja",
  "author": "TryNinja",
  "created_time": "January 06, 2023, 12:44:10 AM",
  "content": "Vi essa thread hoje, no Twitter: https://twitter.com/Cryptadamist/status/1611129612217778176Quote#Huobi seems to be melting down in real time, possibly along with His Excellency #JustinSun's fortune... Shut down all intra-employee IMs etc, maybe fired a bunch of people. Employees now angry (or Sun is ruggin') @HuobiGlobal @justinsuntron E segue o thread... recomendo a sua leitura.Como todos sabemos que esse tipo de rumor precedeu a queda da FTX, não tem por que arriscar deixando o dinheiro lá à troco de nada. Tire tudo o que tiver, se for um usuário da exchange!E se você tiver a stablecoin-ponzi do Justin Sun e da Tron, a USDD, recomendo que dumpe ela imediatamente.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5433198",
  "comments": [
    {
      "author": "nikolaspaolo",
      "created_time": "January 06, 2023, 11:33:21 AM",
      "body": "Pessoal também tem falado que esses tokens de exchages representam um mal sinal. Considerando assim, usar exchanges que nunca lançaram nada parecido a um ativo próprio para se auto financiar.O que me chamou atenção depois da queda da EFETIECS, foi que muitos Earn CeFi aumentaram demais a recompensa, alguns passado pra mais de 100% como no caso da Kucoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Disruptivas",
      "created_time": "January 06, 2023, 12:14:43 PM",
      "body": "O que eu acho mais curioso dessa história, é que parece que todos os 'salvadores da pátria'' cripto são sempre os piores e que estão em mais apuros no final do dia. O caso da FTX com o altruísmo efetivo, o Justin Sun com aquela parceria pra bancar os resgates via a moeda dele, o caso agora da Genesis e da Gemini, que congelou alguns saques e tudo começou porque ela emprestou dinheiro para ajudar a colega. Realmente parece que as ajudas ofertadas em cripto são criadas ou completamente sem pensar ou de má fé completa.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rdluffy",
      "created_time": "January 06, 2023, 08:44:17 PM",
      "body": "E lá vamos nós, novamente  Não tenho nada na Huobi, aliás, acho que só fiz cadastro uma vez pra comprar uma moeda da rede HECO pra jogar CrytobladesTorço para não dar nada errado, senão vai começar tudo de novo e já começaremos o ano mal, com o preço caindo mais uma vez e mais gente perdendo grana.Aprendi na marra que a dica é super válida, assim que pintar rumores o melhor a se fazer e tirar seu dinheiro, deixar bem guardado e observar de longe, pois o perigo de ser verdade é grande.Já consegui escapar da Negocie Coins, da Celsius, mas não da FTX.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Disruptivas",
      "created_time": "January 07, 2023, 02:03:01 PM",
      "body": "Vi essas informações hoje: A exchange Huobi confirmou planos de demitir 20% de seus funcionários como parte da reestruturação em andamento após a aquisição da empresa por Justin Sun.“A taxa de dispensa planejada é de cerca de 20%, mas não está sendo implementada agora”, disse um porta-voz da Huobi em um comunicado enviado ao Cointelegraph ontem. Pode ser que o fechamento dos grupos seja só parte de uma nova estrutura organizacional menos ''comunicativa''. A comunidade cripto nunca foi muito boa em transições e comunicação. Na melhor das hipoteses, esperamos que seja isso.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "January 08, 2023, 09:09:00 AM",
      "body": "Quote from: rdluffy on January 06, 2023, 08:44:17 PMAprendi na marra que a dica é super válida, assim que pintar rumores o melhor a se fazer e tirar seu dinheiro, deixar bem guardado e observar de longe, pois o perigo de ser verdade é grande.Já consegui escapar da Negocie Coins, da Celsius, mas não da FTX.É sempre bom seguir os alertas/rumores. Mas, acho que na grande maioria dos casos, ocorre a queda por causa dessa atitude: ouve-se um rumor, retira-se o dinheiro. Alias, a Grande Depressão, fui um pouco fruto disso. Com os rumores que os bancos não tinham dinheiro, milhares de pessoas começaram a fazer levantamentos e a vender as suas ações. Como foi tudo ao mesmo tempo, coisa incrível, o mercado em um dia simplesmente desabou!Dito isto... Acho muito bem que sempre que é detetado algo suspeito, cada um tente proteger o seu capital. Principalmente num mercado tão desregulado como o cripto.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TryNinja",
      "created_time": "January 08, 2023, 10:23:37 AM",
      "body": "Quote from: joker_josue on January 08, 2023, 09:09:00 AMÉ sempre bom seguir os alertas/rumores. Mas, acho que na grande maioria dos casos, ocorre a queda por causa dessa atitude: ouve-se um rumor, retira-se o dinheiro. Alias, a Grande Depressão, fui um pouco fruto disso. Com os rumores que os bancos não tinham dinheiro, milhares de pessoas começaram a fazer levantamentos e a vender as suas ações. Como foi tudo ao mesmo tempo, coisa incrível, o mercado em um dia simplesmente desabou!Por isso mesmo que você tem que ir junto e tirar o dinheiro o mais rápido possível. Se for o fim do mundo, você garantiu o seu dinheiro.Se for apenas um rumor, bom... você não perdeu nada e é só voltar a usar a exchange quando as aguas abaixarem.Ainda que você esteja ganhando yield na plataforma, uma taxa de 20% ao ano por 1 mês (~1.6%) nunca vai valer esse risco em um momento onde tem exchanges caindo por todos os lados.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "January 08, 2023, 10:27:42 AM",
      "body": "Quote from: TryNinja on January 08, 2023, 10:23:37 AMPor isso mesmo que você tem que ir junto e tirar o dinheiro o mais rápido possível. Como disse, concordo com essa atitude.Apenas quis referir, que muitas vezes esses rumores viram verdade, por causa dessa atitude generalizada.Se na altura da grande depressão, as pessoas não tivessem feito isso - principalmente tudo no mesmo dia, isso não tinha acontecido. Qualquer das formas, o acontecimento serviu para o mercado mudar e hoje estar um pouco mais protegido contra essas coisas - mas pode voltar acontecer.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TryNinja",
      "created_time": "January 08, 2023, 10:32:57 AM",
      "body": "Quote from: joker_josue on January 08, 2023, 10:27:42 AMApenas quis referir, que muitas vezes esses rumores viram verdade, por causa dessa atitude generalizada.Se na altura da grande depressão, as pessoas não tivessem feito isso - principalmente tudo no mesmo dia, isso não tinha acontecido. Qualquer das formas, o acontecimento serviu para o mercado mudar e hoje estar um pouco mais protegido contra essas coisas - mas pode voltar acontecer.Sim, verdade. Mas tem que se pensar que nunca deveria ser possível algo assim acontecer. Sabe como tem gente que diz que a Binance que derrubou a FTX, e que se eles não tivessem jogado a merda no ventilador, a exchange continuaria funcionando? Só que o dinheiro ainda não estaria lá, e o cofre poderia seguir a ser esvaziado. A única coisa que os rumores fizeram foi acelerar o processo de uma vez por todas. E se eles tivessem o dinheiro, rumor nenhum derrubaria a exchange.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rdluffy",
      "created_time": "January 08, 2023, 01:23:55 PM",
      "body": "Quote from: joker_josue on January 08, 2023, 09:09:00 AMÉ sempre bom seguir os alertas/rumores. Mas, acho que na grande maioria dos casos, ocorre a queda por causa dessa atitude: ouve-se um rumor, retira-se o dinheiro. Alias, a Grande Depressão, fui um pouco fruto disso. Com os rumores que os bancos não tinham dinheiro, milhares de pessoas começaram a fazer levantamentos e a vender as suas ações. Como foi tudo ao mesmo tempo, coisa incrível, o mercado em um dia simplesmente desabou!Dito isto... Acho muito bem que sempre que é detetado algo suspeito, cada um tente proteger o seu capital. Principalmente num mercado tão desregulado como o cripto.Sim, eu já pensei nisso, e concordo até certo ponto, se o fluxo de saques aumenta num nível desproporcional, a exchange provavelmente terá problemas e isso vira uma bola de neve.O caso mesmo da FTX foi um exemplo, se ninguém tivesse alertado, se o CZ não tivesse feito aquilo, acho que estaria até hoje numa \"boa\" só esperando algum outro gatilho para que desmoronasse.Mas é trabalho das exchanges garantir que possa suprir uma demanda grande de saques, e é a obrigação ter 100% dos depósitos para o saque.Até concordo que pode demorar um pouco pois as exchanges guardam em cold wallet, mas tem que ter os 100%.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "January 09, 2023, 07:58:51 AM",
      "body": "Quote from: rdluffy on January 08, 2023, 01:23:55 PMMas é trabalho das exchanges garantir que possa suprir uma demanda grande de saques, e é a obrigação ter 100% dos depósitos para o saque.Até concordo que pode demorar um pouco pois as exchanges guardam em cold wallet, mas tem que ter os 100%.É verdade, mas era preciso que as exchanges cripto fossem só para fazer câmbios. Mas, bem sabemos que não. Elas usam parte do dinheiro para fazer stake e outros investimentos. Isso é correto? Não.Mas, talvez sejamos nós que temos de começar a mudar o nome as coisas. Será que a Binance é uma exchange ou um banco? Eu quase diria que era a segunda opção.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "January 09, 2023, 03:57:45 PM",
      "body": "Quote from: joker_josue on January 09, 2023, 07:58:51 AMQuote from: rdluffy on January 08, 2023, 01:23:55 PMMas é trabalho das exchanges garantir que possa suprir uma demanda grande de saques, e é a obrigação ter 100% dos depósitos para o saque.Até concordo que pode demorar um pouco pois as exchanges guardam em cold wallet, mas tem que ter os 100%.É verdade, mas era preciso que as exchanges cripto fossem só para fazer câmbios. Mas, bem sabemos que não. Elas usam parte do dinheiro para fazer stake e outros investimentos. Isso é correto? Não.Mas, talvez sejamos nós que temos de começar a mudar o nome as coisas. Será que a Binance é uma exchange ou um banco? Eu quase diria que era a segunda opção.O que eu vejo é que muitas pessoas deixam as criptos rendendo em exchanges. Quando a pessoa deixa lá rendendo, é uma carta branca para fazer qq coisa. A exchange vira literalmente um banco.Já no caso da simples custódia e da moeda parada, é justo que as corretoras tenham liquidez para passar tudo pros saques em um tempo razoável.  Mas nessa situação ela tb atua como um banco, pois é natural que esse dinheiro tb esteja  em stake e similares, rendendo.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Disruptivas",
      "created_time": "January 11, 2023, 04:45:34 PM",
      "body": "Hoje saiu uma matéria dizendo que a Huobi Korea pretende se separar da controladora e mudar seu nome. Nessa separação, o novo presente, Cho Kook-bong também assumirá a maioria das ações anteriormente detidas pelo cofundador Leon Li.A notícia diz que essa separação foi estimulada pelas preocupação com os relatórios de prova de reservas da empresa, que apontavam que a Huobi Global tinha reservas de mais de US$ 3 bilhões, mas 43,3% dessas reservas estavam no próprio token da exchange.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}