{
  "id": "topic_5461919",
  "title": "Gencecikmen",
  "author": "Gencecikmen",
  "created_time": "August 03, 2023, 08:04:52 AM",
  "content": "TÜİK 'e göre Temmuz 2023 enflasyon oranı %9,49 iken yıllık enflasyon oranı da %47,83 olarak açıkladı. Enflasyon Ocak ayında yüzde 6,65, Şubat ayında yüzde 3,15, Mart ayında yüzde 2,29, Nisan ayında yüzde 2,39, Mayıs ayında yüzde 0,04 Haziran'da da yüzde 3,92 olmuştu.ENAG verilerine göre ise, Temmuz ayı enflasyon oranı %13,18 iken, yıllık enflasyon oranı ise %122,88 çıktı. Ayrıca Merkez Bankasının yıllık enflasyon tahmini ise yüzde 58'di. Takip ettigim birçok ekonomist, KDV zammı sebebiyle rekor seviye bir enflasyon açıklanması gerektiğini, üstüne ÖTV ve benzin zammı ile beraber sadece Temmuz ayının enflasyon oranının yüzde yirmi küsur civarında olduğunu hesaplıyorlardi. Ama TÜİK yüzde 9,49 bulmayı bir şekilde başarmış.Kaynak: https://www.ntv.com.tr/amp/ntvpara/son-dakika-haberi-temmuz-ayi-enflasyon-rakamlari-aciklandi,qG5HWbFNREKKfPjgYxAigg",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5461919",
  "comments": [
    {
      "author": "Pierre 2",
      "created_time": "August 03, 2023, 10:43:54 AMLast edit: August 03, 2023, 02:00:02 PM by Pierre 2",
      "body": "İlk defa ENAG ile TÜİK in birbirine bu kadar yakın enflasyon çıkarabildiğini görüyoruz. Muhtemelen artık TÜİK de enflasyon yüksekliğine karşı yeni formül geliştirmekte zorlanıyor keza halkta büyük tepki oluştu. Önümüzdeki ay da muhtemelen en azından %5 enflasyon görürüz diye tahmin ediyorum hiç öyle bitecek gibi değil.KDV zammı olayına ben de katılıyorum katmerli bir zam oldu o hele de akaryakıt zammı ile birleşince. 10 çıkarmaya çekinmişler ama.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SUPERSAIAN",
      "created_time": "August 03, 2023, 11:10:36 AM",
      "body": "TUİK istediği sonuca ulaşıyor, rakamları istedikleri gibi büküyorlar. Alıştık artık verilerin ne kadar da gerçeklerden uzak olduğunu çoğu vatandaş biliyor. KDV zamları vergi zamları çok ağır oldu bu ağırlıkta yapılan sistematik alımlar enflasyonu iyice uçuracaktır, verilen veriler değil hayatın akışına göre yaşıyoruz gerçeklerde akışın içerisinde. TUİK %9,49 bulmuş, ENAK'ın bulduğu oranda çok gerçekçi gelmiyor bana onca yapılan zamlardan sonra %20 lere dayanmış olmalı gerçek enflasyon.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "xzone",
      "created_time": "August 03, 2023, 12:14:13 PM",
      "body": "%10’un altında enflasyon var diyen alenen yalan söylüyordur. 2 gün önce 5 liraya aldığım ıslak mendil bugün 6.5 lira olmuş. Paket 44 lira olan peynir 62 lira, 50 lira olan zeytin 74 liraya çıkmış. Bütün bunlar sadece 2 ya da 3 gün önce oldu.Az önce bir paket ekmek aldım, 28 lira ödedim. 3 kişilik bir ailenin 1 öğünde yiyeceği boyutta bir ekmek, kilo kilo kocaman bir şey de değil. Adamlar hala çıkıp enflasyonu %10’un altında bulmayı başarıyor. 1 ay önceki benzin fiyatı ve şu anki arasındaki fark bile her şeyi gösteriyor. Hiç olmadığı kadar net hissettiğimiz bir ay oldu",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gospodin",
      "created_time": "August 03, 2023, 12:32:40 PM",
      "body": "tuik bu sefer enflasyon değerlerini yakın açıklamak zorunda kaldı. bu da bizlerin kara kaşı kara gözü için değil dostlar. faiz artırımı, merkez bankasının öncesine göre daha düzgün işlemesi, mehmet şimşek etkisi vs derken enflasyon verilerini de birkaç sefer yalandan da olsa gerçeğe yakın açıklayacaklar ki yabancılar \"piii allah belanızı versin!\" demesin. bence yine de düşük açıkladılar.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pierre 2",
      "created_time": "August 03, 2023, 02:04:03 PM",
      "body": "Quote from: gospodin on August 03, 2023, 12:32:40 PMtuik bu sefer enflasyon değerlerini yakın açıklamak zorunda kaldı. bu da bizlerin kara kaşı kara gözü için değil dostlar. faiz artırımı, merkez bankasının öncesine göre daha düzgün işlemesi, mehmet şimşek etkisi vs derken enflasyon verilerini de birkaç sefer yalandan da olsa gerçeğe yakın açıklayacaklar ki yabancılar \"piii allah belanızı versin!\" demesin. bence yine de düşük açıkladılar.Elbette Mehmet Şimşek in etkisinin olması mümkün görünüyor. O geldiği günden beri cds puanlarını düşürmeye uğraşıyor. İngilizce tweet ler dahi attı sırf yabancı yatırımcıları ikna etmek için. Belki de faizlerin düşük çıkma skandalı yabancı yatırımcıların kulağına gidip rahatsızlıklarını dile getirmiş olabilirler diye düşünüyorum. Onları ikna etmek için seferberiz adeta son yıllarda. Bir batıyla bir de Arap yarımadasıyla durmadan diplomatik adımlar atılıyor.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LGD2Business",
      "created_time": "August 03, 2023, 04:04:25 PM",
      "body": "Tüik aylık enflasyonu yüzde 10'un altında tutabilmek için planlama yapmış bu sefer. Nasıl talimat gelirse ona göre sepet oluşturup kafasına göre enflasyon açıklayan bu kurumun halkta en ufak bir geçerliliği yok. Gerçek enflasyonun ne olduğunu herkes hissediyor zaten. Sırf temmuzda çoğu şeye %100'e yakın zam gelmişken %10 altında rakam çıkartmak büyük başarı bu kişilere madalya takmalılar. Sepetin nasıl oluşturulduğunu gizlemeleri başlı başına skandalken yine kimsenin umrunda değil.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "totti67",
      "created_time": "August 04, 2023, 05:41:06 AM",
      "body": "Gözleri aşkla gülen ekonomi yönetiminden sonra, ülke ve dünya gerçekleri ile nispeten daha barışık, daha rasyonel ve realist yaklaşımı bulunan ekibin göreve gelmesi ile bazı şeyler resmi kanallar ile de tescil edilmeye başlandı. Bir kere şunu kabul edelim, gerçekten zor durumdayız kardeşim, hani gaz bulduk petrol fışkıracak vs mevzuları kenara bırakalım, gerçekten iyi durumda olan bir ülkenin başındaki adam tasarruf yapalım argümanı ile halkının karşısına çıkar mı en basitinden. Mevut durumdaki zamlar ile toplumun büyük kesimi gergin, iğneden ipliğe zam geliyor deyimi hiç olmadığı kadar gerçek artık hayatımızda. Kandırıldığını düşünenler bir daha kanmamak için hiç birşey yapmayacak, muhalefettekiler bulundukları yerden memnun, onlar da kendi koltuklarının derdinde olacak, e haliyle dönüp dolaşıp olan yine vatandaşa olacak...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Distraction",
      "created_time": "August 04, 2023, 07:14:13 PM",
      "body": "O kadar saçma bir hesap ki yani zaten akaryakıta gelen okkalı zamlar ile bile sağlam bir enflasyon artışı oldu. Kaldı ki daha bunun bir ton ayrı zammı var bir sürü alanda. Sizin de dediğiniz gibi TÜİK buna da alıştırdı artık. Tabi ki azıcık hesap yapmayı bilen birisi enflasyon oranının aşağı yukarı ne kadar olduğunu tahmin edebilir.Yıl sonu enflasyon oranının kaç olacağını merak ediyorum ben asıl. Son günlerde akaryakıta o kadar çok zam geldi ve gelmeye devam ediyor ki diğer her şeyin fiyatında da inanılmaz bir artış olacak.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Silence Scream",
      "created_time": "August 05, 2023, 12:46:03 AM",
      "body": "Quote from: xzone on August 03, 2023, 12:14:13 PM%10’un altında enflasyon var diyen alenen yalan söylüyordur. 2 gün önce 5 liraya aldığım ıslak mendil bugün 6.5 lira olmuş. Paket 44 lira olan peynir 62 lira, 50 lira olan zeytin 74 liraya çıkmış. Bütün bunlar sadece 2 ya da 3 gün önce oldu.Az önce bir paket ekmek aldım, 28 lira ödedim. 3 kişilik bir ailenin 1 öğünde yiyeceği boyutta bir ekmek, kilo kilo kocaman bir şey de değil. Adamlar hala çıkıp enflasyonu %10’un altında bulmayı başarıyor. 1 ay önceki benzin fiyatı ve şu anki arasındaki fark bile her şeyi gösteriyor. Hiç olmadığı kadar net hissettiğimiz bir ay olduZam, geçen ay yapıldı ve zammın yapıldığı ayın enflasyonunun %9 çıkması rakamlarla oynanmaya devam edildiğini gösteriyor. Yine de rakamlar Nureddin Nebati döneminde olan gibi uçuk bir farka sahip değil. Mehmet Şimşek ile Gaye hanım 2025 ortasından itibaren enflasyonun düşmeye başlamasından beklenti içerisinde olduklarını söylemişler. Oranlar gerçek oranlar olduktan sonra en azından alım gücü bir nebze daha korunaklı olur. Alım gücünü korumakta önemli bu aşamada. Enflasyon farkını anında fiyatlar yansıtan kişiler olduğu için devlette enflasyon farklarını aniden maaşlara yansıtmalı bence. Diğer zam dönemini beklerken memurun ve emeklinin elindeki para eriyor.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}