{
  "id": "topic_5458793",
  "title": "HoferBit",
  "author": "HoferBit",
  "created_time": "July 06, 2023, 03:40:05 AM",
  "content": "文/胡翌霖 2013年12月23日原文链接 https://yilinhut.net/2013/12/23/4995.html1、比特币是如何进入你世界的？你是否认为自己完全了解比特币？我在今年4月那一轮暴涨暴跌的时期进入比特币世界，虽然之前也有耳闻，但这时候才开始重视起来。我的专业是科技哲学，我发现比特币与我在科学革命、技术史、技术哲学等方面的思想暗合，是一个活生生的技术革命推动时代变革的例子，因此开始买入并学习比特币相关问题。说完全了解当然谈不上，但如果说自吹一下的话，学科哲出身的本来背景也比较杂，视野比较宽一些，所以了解比较“全面”还是可以说的。比特币相关的技术、思想、经济等诸多方面我都有一定理解，但每一个领域都谈不上专业吧。 2、有人怀疑比特币是一个“骗局”，如何证明它不是一个骗局？不用证明，我可以说：对，它就是一个骗局。这没关系。但是要注意的是，如果说比特币是骗局，那么法币（美元之类）就更是一个骗局——特点就是你必须找到另一个傻到相信这张既不能擦手又难以写字的破纸有那么高的价值的人接手，你手头的纸币才能花出去，如果没人相信了，纸币也会烂在自己手里，一名不值。而对于比特币之前的货币来说，政府是信心的保证。有人觉得因为纸币是政府发的，所以它不是骗局。但事实上这恰是庞氏骗局的必要元素：一个信念中心。但一旦这个中心垮台，信心就会一下子崩塌，整个骗局就无以为继。但政府保证了什么呢？且不说政府总有可能垮台，即便政府永葆权威，但他顶多只能保证可以不停地印发货币（或者说我们能保证政府总是能有办法让货币贬值），他能够保证10块钱一定能值10块钱，但这10块钱究竟能买到什么，政府并没有保证什么。但比特币取消了这个中心者，既然它压根不是金字塔结构，压根没有中心，那就不存在一个能够让整个骗局链条崩裂的支点。当然你可以说早期获利的矿工要把新人骗进来才能脱手，因此它们是骗局的中心。但比特币的总量是有限的，一旦它们脱手了，就不再是中心了。比特币的可靠性由数学和网络来保证，这虽然不是绝对可靠，但总比政府要牢靠一些。而比特币的价值呢，和法币一样并不是由政府保证的，而是由市场信心决定的。你可以把比特币理解为骗局，但要害是这个骗局很难会终结。你可以认为接受比特币的人都是傻子，但只要世界上始终会有被比特币思想所吸引的傻子，那么比特币就可以永远在这个傻子的世界中当作真金白银流通。这个傻子的世界至少要比任何一个政权更加稳固，比基地组织更难击破。 3、早期的比特币爱好者，是否有一个共同特点？自由主义者？无政府主义者？理性的思考者兼技术爱好者？或者，疯狂的极客们？早期的比特币爱好者和早期的互联网使用者差不多，也都是多元的。早期互联网产生于军方，但极客、学者、商人、黑客等多种文化共同参与了互联网的崛起。比特币也差不多，既有无政府主义者，黑客，也有立场更温和学者和技术爱好者，也包括一些逐利的商人。在它发展的各个阶段，作为主要推动力的群体可能会交替，但从一开始它就是多元和开放的。 4、货币的本质是一种信用，但对于比特币，人们归根结底信任的是什么？之前说了，人们相信政府，只是要相信他不会滥发货币，也就是说货币究竟有多么不值钱将取决于政府。但货币到底有多值钱这件事，是取决于市场。也就是说，不是相信“上家”而是相信“下家”，相信市场中有人会接受这一货币。在这个意义上，比特币与法币是一样的，归根结底都是信任“市场”，而市场应当是一个自下而上自由组织起来的环境，而不是自上而下地开办出来的。没有政府的地方也会有市场，而有政府的地方反而未必有市场了。如果你真的相信政府会保护市场，那反而是更糟糕的局面，例如最近委内瑞拉就出动军队控制家电市场，禁止家电涨价。但问题在于，涨价这件事情本来就归功于政府超发货币，政府让钱不值钱，然后再来强行控制价格，这并不是一件值得感激的事情。任何市场行为都以信任市场作为前提，例如我要养猪卖钱，前提是我相信等我把猪养肥了市场上还会有人买。但万一突然之间大家都不吃猪肉了呢？比如大家突然就全相信伊斯兰教了，那你的猪肉就烂在手里了。你去生产足球来卖，但大家突然就全都不喜欢踢足球了，你的足球也烂在手里了。如果大家突然都全都不喜欢比特币了，那么你的比特币也会烂在手里，这没什么奇怪的。但因为市场是由许多人以自下而上的方式组织而成的多元环境，所以这样的情况很难发生。在比特币世界，市场本来就不再需要政府在背后支撑，所以我们只需要信任市场，只需要信任约定俗成的习惯和自发形成的规则即可。 5、作为一个如果比特币想要成为一种社会化货币，现在最需要解决的问题又是什么？首先是思想和应用的普及，更多的人理解并接受比特币，它就社会化了。事实上比特币现在已然社会化了，只是这个“社会”有大小之分，比特币早已有了自己的流通圈，在这些社区之内，比特币已然成为通货。那么问题就在于去扩大这些社区，扩大它的生态圈。 6、你如何看待山寨币，哪一种山寨币你比较认可，有屯币吗？山寨币的存在是必然的，因为比特币的核心只是一种思想，而其载体也是一个开源软件。任何开源软件都可能有无数分支，许多分支都会夭折，但仍然会有一些竞争的分支与主线共荣共存。在未来，一些经过惨烈的淘汰后剩下的竞争币种可能与比特币共生，互相牵制也互相促进。但目前而言山寨币大多只是简单地复制，稍微改一些参数，然后加以炒作。真正立志与比特币竞争的币种还比较少。我个人比较认同极客大神Sunny King的两款作品，PPC和XPM，他试图解决比特币的某些问题，寻求一种差异化。我认为像生态系统那样，能够共生共荣的往往是处于不同生态位的物种，而这些不同位置的物种很难有同一个衡量标准，也就是说，山寨币与比特币并没有孰优孰劣的问题，例如比如猎豹比树懒跑得快，但这并不证明猎豹这一物种比树懒优越，树懒比猎豹更“节能”，但这也未必是更好。在比特币之后，有越来越多各具个性的币种出现，对未来的货币生态都是丰富的作用。不过我现在没怎么屯山寨币，因为我感觉现在还是比特币的高速成长期，首先要越来越多的人认识比特币的去中心化货币自由的思想，然后才谈得上新的货币生态圈的形成，所以其它币种在现阶段的发展很难追的上比特币，虽然因为盘子较小有更多炒作机会，但相应的风险也更大，所以我还是比较保守地以囤比特币为主。 7、有人说，比特币虽然伟大，但比特币必然失败？你认可吗？我没看到这人的立论依据或运思逻辑，没办法评论。这一看法似乎比较矛盾。当然，说比特币虽然伟大，但“可能失败”，这无疑是对的，任何伟大的革命都有失败的风险，即便事后看来是历史的必然趋势，在实际的历史境遇中也可能有许多曲折和反复。因此我认为像我们这样，除了投资之外，还卖力解读和宣传比特币相关思想的事情，是有意义的。我们都亲身参与在这一场伟大的时代变革之内，尽自己的力量去推动这一伟大的事业。 8、越来越多人投资比特币，如今汇率已经超过600美元，其中不乏并不了解比特币的投资者，这会给比特币未来发展造成怎样的影响？这种局面你希望看到吗？我之前提到，即便在比特币的早期参与者中间，也不乏并不了解比特币的投机者，有许多人可能2美元买进不到10美元早就套现离开了，有人可能在30美元暴跌到2美元的时候就割肉离场了，投机者的参与无论好坏，是无可避免的事情，也是比特币发展的必经之路。一直到比特币真正成功之后，我敢说仍然有大部分人不了解比特币——就好像我们大部分人并不真正了解人民币或美元的发行机制和金融原理，大部分人也不了解互联网的来龙去脉和技术原理，最终决定大家使用的是周围的环境。而比特币和任何平台性的工具一样，它的技术机制，它的历史起源，它的思想和理论，都是隐藏在其应用环境背后的东西，自始自终就只有很少的一撮人会去追根究底、去全面地理解、研究它。有人说投资者过多涌入造成汇率升值过快、波动过大，对于比特币作为日常货币的应用来说是有害的，这的确没错。但是这个问题怎么解呢？唯一的办法就是让它升值更快，只有其体量达到足够庞大的地步，它的汇率才可能比较稳定。现在即便经历了几轮暴涨，比特币的总市值也不过70亿美元，不到500亿人民币，而A股市值就十几万亿的规模，光是一个中型券商光大的乌龙指就能瞬间让A股市值产生3400亿元的波动，相比下来比特币现在的这点波动从绝对值来说又算得上什么呢？按现在的市值，一个小型机构或一个大土豪的入场，就能掀起一波大涨，所以说现阶段不可能阻挡这些投资者对比特币市场的搅动。只有等待参与者日渐增多，市值盘大之后，汇率才可能稳定下来。比特币要成为通用货币，其市值一定会远远超过现在的数量级，而这一量级不可能一蹴而就，而只能靠这样一波一波地涨上去。但如果你非要说这一成为通用货币的必经之路（波动上涨），意味着比特币波动性太大，所以不可能成为通用货币，那就是本末倒置了。实情是正因为要成为通用货币，所以必须一波波涨起来，这只能说是成长的烦恼吧。我认为比特币的汇率因为投资者的参与而大起大落，这对比特币的未来是好的，一方面这种巨大的波动会引起更多人注意到比特币，例如我就是在4月份的大波动中进入的，另一方面，汇率的推高毕竟是让比特币朝向通用货币迈进一步。当然，除了重视短期套利的投机者之外，也会有越来越多的人开始以比特币衡量自己的财富，参与到比特币应用的推广和开发中来。但就我个人来说，你如果要问我这局面是不是我希望看到的，其实我是很矛盾的。因为我现在还是学生，没有独立的经济来源更没有积蓄，所以只是拿奖学金和牙缝里挤出的一些零花钱买了几十个币，如果投资者来得慢些，币价涨得慢些，我还能够在开始工作后逐渐多拿些钱多买入一些币，但现在我论文还没写完，汇率就翻了好几番，感觉是挺惆怅的。 9、中国人为什么对比特币如此感兴趣？这个问题要分阶段来论，你指的可能是最近这一波由中国市场带动起来的大涨行情，显示出中国人对比特币很感兴趣。但其实在更早的一个阶段，中国人对比特币的参与热情就已经挺高的了。曾经在矿机业独领风骚的阿瓦隆团队和烤猫团队都是中国人，许多相关领域也有不少中国人活跃的。其实中国的极客们视野和思维在世界来说并不差，对比特币背后的自由不羁的精神也颇为向往，对于市场经济的好处也更有切身体会。另一方面，中国人更偏好未雨绸缪，更爱储蓄而不是提前消费，像西方人那样靠借贷度日，寅吃卯粮。在中国人心目中钱的储值意义更受重视，因此对比特币这样一种保值货币更容易接受。而西方人本来就不能理解中国人为什么不喜欢借钱而偏爱存钱这件事情，一看到比特币会影响以超前借贷为核心的通胀体系，就本能地反应行不通。另外，由于Q币、支付宝等电子交易工具在中国更为流行，所以中国人对接受比特币已经有了更好的文化铺垫。当然最近一个阶段，主要是以投资者的涌入为主，这可能和最近以央视为首的主流媒体的推波助澜有关，也与中国人现在钱太多没处去的金融环境有关，我也说不好。 10、如果说中国人获得了太多比特币筹码，会不会影响比特币发展？当然会有影响，但比特币本来就是趋向于去中心化的，“中国人”并不是一个单一的实体，中国人之间也有多元的分歧，同样是买比特币，目的和态度都不一样，很难说会形成一个统一的力量去偏转整个比特币的发展趋势。 11、你认为比特币现在的产业链是否足够支持它的健康发展？你信赖在线钱包与交易平台吗？你怎样保护自己的比特币？这几个问题好像不连贯啊？首先说产业链，其实产业链就是比特币的发展本身，问题其实是说现在比特币的产业链（我更愿意说生态圈）是否健康。说生态圈健康，那就是指平衡、协调的发展了，必须承认现在看来还不是特别平衡。比如前一段是矿业飙涨，但汇率滞后，这一段是汇率大涨，但知识普及和应用推广滞后一点。但这也没办法，因为目前正处于高速成长期，一个孩子可能一夜间变声了，但身高还没长起来，有可能身高很高了，但心智还不够成熟，等等。但总体来看，比特币生态系统中的各个环节互相带动，还是处于一个比较活泼的状态的。关于在线钱包，我认为blockchain.info和coinbase都算是比较可信的，其它的差一些，我把少量的币存在blockchain.info的在线钱包中，这方便我在手机或其它电脑时随时都能使用，但即便手机丢了也不会丢币。交易平台只是买卖的中介，我既然不做短线，也就不会把太多币存在上面。但主要的交易平台，特别是一些老牌的平台，还是比较可信的。我的比特币有一部分保存在电脑上，另一部分以离线纸钱包方式封存，还有少量存在在线钱包上，平台上也有点零钱。 12、比特币在未来一段时期会有怎样走势？我不清楚。当然我相信在没有大的事件的发生的情况下，仍然会持续短期波动，长线上涨的势头，短线会受到各种外来因素的影响，但决定大势的主要是矿业和应用。矿业决定新币供给的成本，采矿成本如果相比币价过低，那么币价走势将会趋熊，这就是今年五月份以来比特币汇率趋冷的主要因素，而现在采矿成本呈指数上升，已经不会再明显拖累汇率了。而应用的增加则是比特币升值的根本，因为如果人们永远只是要把比特币卖成人民币或美元才算兑现的话，那么整个交易市场就是零和游戏，有人赚就有人亏，币价的上涨是难以持续的（但仍能持续相当一段时间），但如果说我不再需要换回人民币，而是可以直接使用——收入比特币、花出比特币形成一个生态闭环，只有人民币单向去买比特币，而不再需要再买回人民币，这样的话，比特币的汇率必定会形成单边上涨的格局。如果比特币的应用范围能与人民币相当乃至超出，那么汇兑的地位终将颠倒过来。 13、比特币投资与交易，买卖与流通，有无触犯中国现行法律？的确，目前比特币方面的许多市场行为都是在法律的灰色地带运行，甚至的确有与现行法律相抵触的部分，监管部门虽然现在不管，但秋后算账的风险始终是存在的。但另一方面我们也不能完全被法律束缚，像互联网之类新事物出现之后，法律中会有很多相对时代发展显得滞后的部分，如果完全一板一眼地遵照法律，很多创新都很难展开。还有一个例子，比如我们中国之前有一个叫“投机倒把罪”，这个计划经济体制下产生的罪名直到1997年才在刑法中被废除，而且仍然存在于其它多条法规中，直到2008年才彻底删除。而可想而知，在改革开放之后，许多市场经济下的买卖行为严格说来都犯了“投机倒把罪”，如果完全只按字面刻板地遵守法律，市场经济的新秩序也很难发展起来。现在比特币市场的一些行为，的确是冒有法律风险的，也不排除被整治的可能，例如在80年代仍有许多人因投机倒把罪被审判，但另一些投机倒把的人却成了改革开放后第一代的企业家。在时代的变革期间，这样的事情是正常的。我希望相关执法机构能够更宽容一些，也希望创业者们更勇敢一些，去共同探索新的秩序。 14、交易平台被攻击事件频发，BTC用户财产安全从某种程度上说关系到比特币的存亡，你怎么看待这个问题？总的来说，虽然交易平台经常被攻击，但真正被攻破而丢币的也不太多，而且如果把比特币提取到自己手中，它恐怕比起一般的现金和网上银行更加安全。 15、你认为比特币最大的缺陷在哪里？影响它终极命运的东西是什么？没什么最大缺陷，任何缺陷都是相对而言的，首先要说相对于什么谈缺陷。比特币总量固定，这在很多人看来是缺陷，但它将引发某种金融世界的范式革命，衡量价值的标准都会发生变化。至于影响比特币终极命运的，我认为只有量子计算机。比特币所基于的密码学技术，在未来的量子计算机下是有可能攻破的。但目前谁都不知道，如果量子计算机逐渐发展起来，给比特币社区有足够的缓冲应对时间，那么即便是量子计算机真能攻破比特币的密码学机制，也不用怕。唯一可能的是高性能的量子计算机突然袭击，比特币社区措手不及，难以及时更新算法，不是没有可能全面失守。 16、比特币应用从技术角度看，能不能摆脱被监管的命运？这也是相对而言的，首先是被谁监管，其次是被怎样监管。现在我们说到监管一般都想到政府，想到自上而下的强权监管，但未必只能这样。在比特币社区，监管是自下而上，自由组织起来的。比如一家新交易所开出来，比如GBL，他首先要在社区做广告。在当时社区的网友就自发起来检查，结果发现这家网站注册信息是假的，介绍内容是抄的，总之各种不可信。后来又有种种可疑举动，早就在社区曝光出来，无数只眼睛都在“监管”着他。问题就在于有一些不看或不信社区的人，又有一些明知是骗局但因为巨大利益驱使而投入赌博的人，他们还在那里参与，最后GBL跑路，他们损失了多少多少，其实都是自找的。整个GBL跑路事件事实上证明了社区自组织的机制是多么行之有效。比特币开源、开放、去中心化的特征，迫使商家更多地考虑对下负责而不是对上负责，要对社区开诚布公，以尽可能公开透明的方式运转，接受所有人无时无刻的监管而非只要应付一些上级机构的视察，这种生态如果发展起来，社会的组织结构也可能发生变革，从金字塔式自上而下的管制结构，转变为网络状的互相牵制互相促进的形态。 17、再自由的工具，仍然将沦为专制者的工具？你认为呢？并不完全是这样，专制社会本来也是相应技术环境的产物，在原始部落社会很难有大权在握的专制者，为什么？因为没有足够的工具维系一种专制。要维系专制，需要有施展强权的武器（例如铜质战斧），维系秩序的媒介（比如文字，口传社会的权力难以辐射到另一个城市）。而新技术的出现有时会破坏在原有技术环境下建立起来的政治秩序。例如铁器的出现打破了古代的贵族制，而火药的普及又打破了西欧的封建制，印刷术让现代普选制得以可能（在洛杉矶的公民如何了解在纽约出生的候选人呢？），等等。相应的技术环境的变革将会推动社会结构的变革。我相信在互联网和比特币所揭开的新的技术环境下，整个社会组织的形式都会发生变革，即便在未来社会仍难免有专制者，但专制的形式也会变化。 18、有人研究比特币节点交易分布，认为比特币贫富分化程度极其严重，富者愈富穷者愈穷，这会不会与比特币的自由与公正本悖？还是因为现在是比特币的高速成长期，大多数人都以囤币为主，特别是那些认同比特币的理念并相信它有远大未来的人。很显然，囤币最多的人一定是那些最相信比特币未来的人，那么在他们眼中比特币当然仍处于发展初期，升值空间还远着呢，当然不会急于套现，而是会越来越坚定囤币的决心。比如我相信比特币能涨一万倍，而它现在很快就涨了十倍，那么这一事实是加强了还是削弱了我对其涨一万倍的信心呢？当然是加强了吧。所以它越涨我信心越坚定，就越是要追加投资。但那些缺乏信念和远大预期的人呢，它们浅尝辄止一下，他可能认为比特币会涨三倍，结果发现它涨了十倍，那么很可能就是赶紧套现离场。所以现在的情况就是有信心的人越囤越多，没有信心的人越分越少，这是很正常的。他们既是先行的探险家，又抱有坚定的信念，有投入那么多，他们更富有什么不妥呢？让更配享财富的人享受财富，这不是公正什么是公正呢？而这只是初始阶段，设想未来比特币趋于主流的世界中，仍然还会这么贫富分化吗？不会这样了。现在的法币世界，由于整个货币自上而下地不断增发，越接近货币源头的人越富，具体来说就是金融业，就是华尔街。在美国1%的人掌握了50%的投资市场的资产，而且这些人依靠金融业，还在不断让自己的财富增殖。恰恰是“钱生钱”的金融法则让富者愈富，穷者愈穷。但在比特币世界，这种法则就难以维系了，因为比特币本身就是保值资产，不会增发，拥有更多资金的人也无法仰央行的鼻息依靠“钱生钱”、“利滚利”来轻松增殖自己的财富。比特币很难依靠金融红利来自动增殖，而只能依靠实业赚取。积累财富的过程将是做加法，而不是乘幂。因此富人更有可能把钱越花越少，穷人则更可以凭借劳动积攒财富，而不必因为担忧积蓄贬值而不得不把辛苦所得投向金融市场而被金融大鳄们蚕食。所以在理想的比特币世界中，货币的流动将趋于平衡，富人花钱穷人挣钱，尽管现在看来还过于遥远，但肯定会比现在的世界更加“公正”。",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5458793",
  "comments": [
    {
      "author": "HoferBit",
      "created_time": "July 06, 2023, 03:48:21 AM",
      "body": "19、作为一个科学哲学领域的研究者，你怎么评价“比特币是一场社会实验”的说法？我能够从科哲领域联系上的，主要有两个理论，一是库恩的范式理论，他指出科学革命并非具体科学知识的积累和更迭，而更是一个整体的变革，整个世界观和价值标准都在发生变化。在旧范式下衡量何谓科学问题，何谓真理，何谓科学对象等等方面的价值标准都会发生变革，在新范式下认为好的、对的的东西，在旧范式下可能是错的或根本不被考虑的。很难找出一套凌驾于两种范式之上的标准（这需要第三种范式）。联系到比特币，我认为，比特币不仅仅是一个比法币更有价值或更没有价值的东西，而是说在比特币世界中，整个价值标准本身也将发生变革。在现行范式下认为是必要的好事情，或者某些不可或缺的头等大事（比如政府对市场“流动性”的干预和调节），在新范式下可能是完全无关紧要的东西；而在新范式下认为好的东西，也很难翻译给以旧范式思考的人。而在科学革命期间，旧范式和新范式的雏形在一起竞争，相互间的争论往往是鸡同鸭讲，这和比特币领域的现状相似。而坚守旧范式的人往往最终也无法说服，只能等待他们老去。另一个理论是技术哲学方面的，即技术（媒介）并非中性，而是有其价值偏向。人们有时说技术是双刃剑，能伤害好人也能维护正义，就取决于人怎么用。但这是比较浅薄的。但所谓技术的偏向也不是指某种技术一定是好的或是坏的。要害在于，关于好坏的衡量，本身也受到相应技术环境的影响。例如在剑的时代，在冷兵器的时代，形成了诸如侠义精神、武士精神、骑士精神等等价值倾向，但在热兵器取代了刀剑之后，这些文化和价值都变得无所依附了。因此当我们要衡量一种技术的价值时，除了引入一套现成的价值观去评判之外，还需要注意，这一技术本身内蕴着怎样的价值偏向。就货币来说，它不仅是一个中性的交易媒介，同时也塑造着人们的价值观念。甚至“价值”这个词汇本身也与货币息息相关。人们开始用货币的数值来衡量事物的价值，这也许是一种狭隘的拜金主义，但我们先不论这个。即便是在一个以货币数值作为价值衡量标准的文化中，我们仍然可以问：以何种货币来衡量？用美元衡量价值和用比特币衡量价值是有本质不同的。例如让你在当下获得80美元和在5年后获得100美元之间选择，你觉得那边更值呢？你很可能选择前者，因为美元不断贬值的特性，让人们更偏向于考虑眼前利益。而当下的80比特币和5年后的100比特币之间，选择可能就完全不同了。比特币让人们更倾向于目光长远、谨慎投资，而不是选择寅吃卯粮、借新钱还旧债、先污染后治理等等这样的生活方式。",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}