{
  "id": "topic_5447201",
  "title": "franciscodanconia",
  "author": "franciscodanconia",
  "created_time": "April 01, 2023, 11:45:15 PM",
  "content": "I'm really curious which wallets are in use by the community right now, to store and transfer Bitcoins and other cryptocurrencies. I use Trust and Metamask as a main hot wallets, and Trezor as a cold wallet for BTC and ETH. Please share your thoughts!",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5447201",
  "comments": [
    {
      "author": "Nwada001",
      "created_time": "April 01, 2023, 11:52:07 PMLast edit: April 02, 2023, 12:09:08 AM by Nwada001",
      "body": "Quote from: franciscodanconia on April 01, 2023, 11:45:15 PMI'm really curious which wallets are in use by the community right now, to store and transfer Bitcoins and other cryptocurrencies. I use Trust and Metamask as a main hot wallets, and Trezor as a cold wallet for BTC and ETH. Please share your thoughts!If you are already making use of Trazor wallet and you are sure it's gotten from a direct source, you have confirmed that it's safe for use. Then I don't think you have anything to worry about. You just have to keep the hardware wallet safe and protect it from infected PCs. Always make sure you don't connect it to any system that you think might be infected by any form of virus, because those can be used as vulnerabilities to attack your wallet some day.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jeraldskie11",
      "created_time": "April 02, 2023, 12:54:26 AM",
      "body": "Quote from: franciscodanconia on April 01, 2023, 11:45:15 PMI'm really curious which wallets are in use by the community right now, to store and transfer Bitcoins and other cryptocurrencies.There are so many users in this forum uses hot wallet because it's easier to trade with since it's connected to the internet. Using cold wallet is best if you are holding big assets because it's more secure than hot wallet. There are some cases already in this forum who uses hot wallet with bigger funds and got attack by hackers which loss all his funds. Since I use the money everyday, I don't need to use cold wallets. There are still many secure wallets out there but you need to choose the right one and you need to have the private key in a safe place. If the wallet you use needs to update, don't do it immediately, you have to make sure it's legit or if it's caused by a virus attack.You can also click on the link to know more the pros and cons of Hot/Cold wallets, I assure that it will help you: Hot Wallets vs. Cold Wallets",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Despairo",
      "created_time": "April 02, 2023, 03:59:34 AM",
      "body": "Trust wallet is closed source wallet, it's not really a good wallet to use except you're want to use it since it's support multiple cryptocurrencies. If you only hold Bitcoin, better to use electrum because this wallet have many features e.g. customizable fee, RBF to bump fee if you need the coins in hurry, open source and can be used as a cold storage wallet.For cold storage, for newbies it's better to buy a hardware wallet e.g. Trezor or Ledger.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hd49728",
      "created_time": "April 02, 2023, 07:54:05 AM",
      "body": "Quote from: franciscodanconia on April 01, 2023, 11:45:15 PMI use Trust and Metamask as a main hot wallets, and Trezor as a cold wallet for BTC and ETH. Please share your thoughts!Good enough butYou should store your biggest capital part in your cold wallets. A smaller part is for hot wallets that you plan to use your cryptocurrency more often like swapping, trading, paying for service, product.With hot wallets, if you are careful, you can use it on separating devices and don't use a device on which you install those hot wallets for risky things like porn watching  Try to have careful behavior by never clicking and opening strange links in email, Telegram, Discord.If you are more serious, you can set up multi signature hot wallets to use like with Gnosis Safe wallet",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fuguebtc",
      "created_time": "April 02, 2023, 08:55:47 AM",
      "body": "Quote from: franciscodanconia on April 01, 2023, 11:45:15 PMI'm really curious which wallets are in use by the community right now, to store and transfer Bitcoins and other cryptocurrencies. I use Trust and Metamask as a main hot wallets, and Trezor as a cold wallet for BTC and ETH. Please share your thoughts!Hardware wallets are the safest solution and I feel your choice is secure enough. You can use any wallet as long as they are open source and popular in the market. What's more important is how you use them and protect them from hacker or virus attacks. I have been using metamask and Electrum for the past 6 years, and I have never had any problems. I always make sure to use them on a separate computer and only connect to the internet when necessary, that way, I'm safe so far.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nullama",
      "created_time": "April 02, 2023, 10:09:13 AM",
      "body": "Quote from: franciscodanconia on April 01, 2023, 11:45:15 PMI'm really curious which wallets are in use by the community right now, to store and transfer Bitcoins and other cryptocurrencies. I use Trust and Metamask as a main hot wallets, and Trezor as a cold wallet for BTC and ETH. Please share your thoughts!Metamask doesn't work with Bitcoin. Anything you store or transfer with Metamask is an altcoin, so beware.Even if there's Bitcoin in the name, it simply isn't Bitcoin if you're using Metamask with it.There are plenty of great wallets for Bitcoin, like Electrum, Sparrow, etc, and for mobile there is Blixt, Breez, Phoenix, etc",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "S A KHAIR",
      "created_time": "April 02, 2023, 10:16:30 AM",
      "body": "Quote from: franciscodanconia on April 01, 2023, 11:45:15 PMI'm really curious which wallets are in use by the community right now, to store and transfer Bitcoins and other cryptocurrencies. I use Trust and Metamask as a main hot wallets, and Trezor as a cold wallet for BTC and ETH. Please share your thoughts!You are doing it right, all your wallets are famous and popular ones in the market. All of them are safe to use, but whether your assets are secure is mainly up to you and not entirely on which wallet. I am also using Trustwallet for my altcoins and using Electrum for bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Orpichukwu",
      "created_time": "April 02, 2023, 10:26:18 AM",
      "body": "Quote from: franciscodanconia on April 01, 2023, 11:45:15 PMI'm really curious which wallets are in use by the community right now, to store and transfer Bitcoins and other cryptocurrencies. I use Trust and Metamask as a main hot wallets, and Trezor as a cold wallet for BTC and ETH. Please share your thoughts!Store your fortune on cold safe wallet which you don't connect to device with regular and public internet server. Use trust and Metamask wallet for your daily spending and shit coins holding. Since you will be carrying it around were ever you go. For security purposes.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PrivacyG",
      "created_time": "April 02, 2023, 01:01:29 PM",
      "body": "Hot Wallet, typically Electrum.  But if we are talking other Coins as well, then there is a long list.  The most recent ones are as follows.  Phone, usually Mycelium or Unstoppable.  For browser, MetaMask.  As Cold Wallet, Trezor.I try to avoid using proprietary stuff so although my list is much larger, there are only a few I can recall as being User Friendly.  Most of them have a pretty complicated and ugly User Interface, but after all what matters most is functionality.I can guess the most popular Wallets out there are Trezor for HW, MetaMask for browsers, Electrum for desktop app and most likely Trust Wallet for phones although I would hate this being the truth.  Trust Wallet has cool UI and stuff, but it does not bring you 100 percent non custodial experience so it is worthless to me.-Regards,PrivacyG",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rupok",
      "created_time": "April 02, 2023, 01:59:16 PM",
      "body": "I use trust wallet and coinbase wallet, I find trust wallet and coinbase wallet very safe.I think trust wallet is very good for receiving different tokens. But if you want to keep more money then you can use hardware wallets as an alternative wallet.I use Coinbase wallet to hold bitcoins. Use cold wallets to hold large amounts of money. Hot Waltons are highly sought after by hackers.One has to be very careful while using the wallet and the transactions have to be very transparent. Many scammers send fake tokens and it is better not to add those tokens.You have to be very careful to keep your wallet safe. It is better not to share the sheet of the wallet and key is at the instigation of someone and avoid transactions with strangers.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cointxz",
      "created_time": "April 02, 2023, 02:05:55 PM",
      "body": "Quote from: Rupok on April 02, 2023, 01:59:16 PMI use trust wallet and coinbase wallet, I find trust wallet and coinbase wallet very safe.I think trust wallet is very good for receiving different tokens.Trust wallet is close source and your seriously categorized coinbase wallet as safe wallet? It’s not even a wallet but an exchange which you don’t have access to your private key. You literally don’t have 100% ownership of your coin once it was deposited on the coinbase wallet. You still didn’t learn on what happened to FTX users that leave their money on exchange eh?Seriously speaking, Just use electrum wallet as hot wallet and hardware wallet for cold wallet to make your life easier and away from the possible danger of centralized crypto projects. Why the need to use this shady storage while there’s free and safe open source wallet out there like Electrum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Z-tight",
      "created_time": "April 02, 2023, 02:16:34 PMLast edit: April 02, 2023, 02:42:03 PM by Z-tight",
      "body": "Quote from: Rupok on April 02, 2023, 01:59:16 PMI use trust wallet and coinbase wallet, I find trust wallet and coinbase wallet very safe.I think trust wallet is very good for receiving different tokens.Trust wallet is closed source and owned by Binance, i learnt that coinbase wallet is a self custody wallet, though i do not use it and i have not seen many members post it here as being highly recommended, so i think you should switch to a wallet that is highly recommended, like Electrum or BlueWallet, even for hot storage.Quote from: Rupok on April 02, 2023, 01:59:16 PMBut if you want to keep more money then you can use hardware wallets as an alternative wallet.I use Coinbase wallet to hold bitcoins. Use cold wallets to hold large amounts of money.Hardware wallets or a cold storage set up are the safest ways to store BTC's, though especially for large sums of BTC and for long term purpose. But even when you need a hot wallet, it is still best to use one that is recommended and open source, and the users can verify the code by themselves, just like Electrum.Quote from: Coin_trader on April 02, 2023, 02:05:55 PMand your seriously categorized coinbase wallet as safe wallet? It’s not even a wallet but an exchange which you don’t have access to your private key. You literally don’t have 100% ownership of your coin once it was deposited on the coinbase wallet. Coinbase wallet is different from the custodial wallet in coinbase[dot]com. Edit= even if the wallets are different, coinbase wallet is still not recommended, and i found a good thread on the reasons why it is not: https://bitcointalk.org/index.php?topic=5395931.msg59958482#msg59958482",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PrivacyG",
      "created_time": "April 02, 2023, 02:40:11 PM",
      "body": "Quote from: Coin_trader on April 02, 2023, 02:05:55 PMyour seriously categorized coinbase wallet as safe wallet? It’s not even a wallet but an exchange which you don’t have access to your private key.I am pretty convinced Coinbase and Coinbase Wallet are two separate things.  You are partially correct and also partially not.  Coinbase Wallet advertises itself as non custodial but I do not know what to say because it is not fully Open Source so who can verify their claims?-Regards,PrivacyG",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Little Mouse",
      "created_time": "April 02, 2023, 02:49:00 PM",
      "body": "Quote from: PrivacyG on April 02, 2023, 02:40:11 PMCoinbase Wallet advertises itself as non custodial but I do not know what to say because it is not fully Open Source so who can verify their claims?I never heard of coinbase non custodial wallet. Can you please share where did you get this info? I'm not aware any of their wallet other than their custodial wallet which I used for a few months as a main wallet when I was a total newbie in the crypto space. They don't share your private key, so it can't be non custodial. I don't know how Coinbase vault work because I have never checked it. Also, I'm not aware if they have any other wallet than this- https://www.coinbase.com/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}