{
  "id": "topic_5453383",
  "title": "phillymogul",
  "author": "phillymogul",
  "created_time": "May 20, 2023, 07:55:08 AM",
  "content": "From January to December 2017, the value of BTC rose 1500% - the largest one-year increase in history. As Bitcoin gained value and legitimacy, trading volumes increased, and hundreds of new crypto coins were issued.In 2018, however, 751 crypto coins became defunct - the most casualties of any year. Of those, 390 failed due to lack of trade volume and 237 due to issues with fraud. In order -- Lack of trade volume (66%), Scam (22%), ICO fail (10%) and Joke or no purpose (1%).See the full infographic.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5453383",
  "comments": [
    {
      "author": "Tytanowy Janusz",
      "created_time": "May 20, 2023, 08:38:36 AM",
      "body": "Quote from: phillymogul on May 20, 2023, 07:55:08 AMFrom January to December 2017, the value of BTC rose 1500% - the largest one-year increase in history. As Bitcoin gained value and legitimacy, trading volumes increased, and hundreds of new crypto coins were issued.In 2018, however, 751 crypto coins became defunct - the most casualties of any year. Of those, 390 failed due to lack of trade volume and 237 due to issues with fraud. In order -- Lack of trade volume (66%), Scam (22%), ICO fail (10%) and Joke or no purpose (1%).See the full infographic. 1- Whats the point of increasing the font size of whole post?2- 2017 was not the year with biggest price pump. Not even close\"Bitcoin has an average annual return of 1,576% and a total return of 18,912% from 2010 to 2021\"it was even below average XDThe best seams to be 2013 with more than +5000% pump3- projects does not fail because of the low trading volume of its token. It fails because there was no use case, no development, a different project delivered a better product, it was a scam or ... many more, but definitely not because of low trading volume.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "smyslov",
      "created_time": "May 20, 2023, 02:32:59 PM",
      "body": "It's already four years since that number registered but until now many coins are dropping going obsolete, or becoming shitcoin, new coins are being launched or created almost daily as if we are not getting enough new coins, all the possible concept has been created, we have exchange based token, the NFT token, the PVE token, all these become trending token then after a few months they die and become obsolete.The cycle continues and it's not going to end sooner because there are new investors coming in, many gullible investors believe in the hype, and the scammers keep getting better at creating new tokens to continue scamming new investors.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}