{
  "id": "topic_5527031",
  "title": "nullama",
  "author": "nullama",
  "created_time": "January 20, 2025, 06:46:04 AM",
  "content": "An Italian member of parliament, Marcello Coppo, said that banking foundations should start investing in Bitcoin to see great returns in the future.QuoteA banking foundation is an organization set up as a bank that uses its funds to support social, cultural, and philanthropic activities. This seems to be an unstoppable wave of new Bitcoin interest from corporations. For example, recently the largest bank in Italy, Intesa Sanpaolo, acquired $1 million worth of Bitcoin.It seems that Bitcoin is now so mainstream that is starting to be part of many, many organisations balance sheet.source: https://decrypt.co/301689/italian-lawmaker-urges-banking-foundations-to-buy-bitcoin",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5527031",
  "comments": [
    {
      "author": "betswift",
      "created_time": "January 20, 2025, 07:10:08 AM",
      "body": "Wait for the actions regarding the reserves and the US, and we will recheck your statement about how big this wave of corpo-guys going into BTC would be",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "B-BossMan",
      "created_time": "January 20, 2025, 07:24:59 AM",
      "body": "This move could be a great strategic step for Italy, because if the country invests in bitcoin, it will definitely benefit them, and the country will potentially earn massive returns; however, the country could be among the cryptocurrency market growth. As the cryptocurrency market keeps developing continuously, the Italy steps could also emulate other countries to truly navigate this fabulous opportunity.https://www.panewslab.com/en/articledetails/z0ol9n17.html",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "avikz",
      "created_time": "January 20, 2025, 06:02:54 PM",
      "body": "Quote from: nullama on January 20, 2025, 06:46:04 AMIt seems that Bitcoin is now so mainstream that is starting to be part of many, many organisations balance sheet.That is precisely the area of concern. Many countries and corporates are actively considering to invest in Bitcoin. With their deep pocket and huge cash reserve, they will be able to buy a large portion of supply which may become a playground for them where commoners like us will be suffered. Bitcoin thrived as a parallel currency system and it's always better for us if it stays so. Too much of mainstream attention will make the entire thing worse. Earlier we used to buy Bitcoin anonymously. Right now, everything requires KYC and you will need to pay taxes on it as well. I am sure we didn't want to see these. Honestly, it will be best if governments and corporates stay away from it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BIT-BENDER",
      "created_time": "January 20, 2025, 06:10:32 PM",
      "body": "Well I won't be surprised if many of these banks hasn't already started investing in Bitcoin, bankers aren't dumb people and they also have access to all information about crypto-currency and I am sure they have seen the long term benefits of it.But while these law makers makes this sort of advice let them also understand that the market is very volatile and it's not always a bed of roses here.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Faisal2202",
      "created_time": "January 20, 2025, 07:35:28 PM",
      "body": "Quote from: nullama on January 20, 2025, 06:46:04 AMThis seems to be an unstoppable wave of new Bitcoin interest from corporations. For example, recently the largest bank in Italy, Intesa Sanpaolo, acquired $1 million worth of Bitcoin.It seems that Bitcoin is now so mainstream that is starting to be part of many, many organisations balance sheet.That is good for the longevity of BTC although I should not be saying this because BTC don't need it haha, it already has so much adoption that it will last long. The amount is not that big though but still $1 million worth of BTC means around 10 BTC and they will be kept aside in their safe means now these tokens are locked for who knows how long.This has contributed more to the value of BTC because buying and then holding will increase the price of BTC drastically, we might see it touching $1 million sooner than we expect. If with time these banks try to increase their allocation for BTC then that's much better. But still don't get the idea of why even banks are investing now, why are they buying high haha, dumb people but still making a right choice.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}