{
  "id": "topic_5470648",
  "title": "kyc20040202",
  "author": "kyc20040202",
  "created_time": "October 17, 2023, 08:24:08 AM",
  "content": "After graduating high school, I saw bitcoin on youtube. At that time, it was about 60,000 dollar.I had some research about Bitcoin. I specially watched videos of Michael Saylor. For me, he sounded very logical. I checked the price, and I could see that Bitcoin is up 45950334.26% since 2009. I thought I am very late to start invest to Bitcoin, but many people said it is early. So.. I am really confused. I receive about $100 a month from my dad. I am planning to use them to buy some bitcoin. Please give me an advice to be successful Bitcoin investor in the future.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5470648",
  "comments": [
    {
      "author": "lombok",
      "created_time": "October 17, 2023, 08:30:10 AM",
      "body": "Quote from: kyc20040202 on October 17, 2023, 08:24:08 AMAfter graduating high school, I saw bitcoin on youtube. At that time, it was about 60,000 dollar.I had some research about Bitcoin. I specially watched videos of Michael Saylor. For me, he sounded very logical. I checked the price, and I could see that Bitcoin is up 45950334.26% since 2009. I think I am very late to start invest to Bitcoin. I also don't have much money to buy it.I receive about $100 a month from my dad. Please give me an advice to be successful Bitcoin investor in the future. If you are not good at trading, you should apply the long-term buy and hold method. In this market situation, you might be very lucky where the BTC price is at a discount and soon BTC will experience a halving event which usually occurs after a bullrun. Try to consistently make purchases every month and save your BTC until the BTC price reaches ATH. It's up to you how many dollars you use from the $100 your father gives you each month because that is completely under your control.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Latviand",
      "created_time": "October 17, 2023, 08:40:36 AM",
      "body": "Can we know your living conditions in South Korea? Because depending on where you're in the country, the expenses will be different and if you're in Seoul, you're going to need all the money you've got and those that's sent to you because Seoul is one of the most expensive city in the world. Check your expenses and try to maintain a 1 week routine and see if there's any money left before the next aid comes, if you're struggling to make ends meet at that 1 week routine, you probably need to focus on daily expenses first before investing in bitcoin. This advice is purely my opinion so take it with a grain of salt.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Z-tight",
      "created_time": "October 17, 2023, 08:47:07 AM",
      "body": "Quote from: kyc20040202 on October 17, 2023, 08:24:08 AMSo.. I am really confused. I receive about $100 a month from my dad. I am planning to use them to buy some bitcoin. Please give me an advice to be successful Bitcoin investor in the future. You have told us that $100 dollars is all you recieve monthly, but we do not even know if it is enough to conver all of your expenses monthly and how much you get to save from it. If you get some spare money off the $100 at the end of the month and you don't know what to use it for, you can buy BTC slowly through dca, but if you are going to be buying BTC and depriving yourself of what is essential, then no, because you will eventually end up selling it at a loss.If you aren't making your own money yet and you do not have enough to invest in BTC, you can invest in knowledge for now and understand everything about it and when you have money you buy some for yourself.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EL MOHA",
      "created_time": "October 17, 2023, 09:01:32 AM",
      "body": "Quote from: kyc20040202 on October 17, 2023, 08:24:08 AM I specially I thought I am very late to start invest to Bitcoin, but many people said it is early. So.. I am really confused. I receive about $100 a month from my dad. I am planning to use them to buy some bitcoin. Yes you are not that late to bitcoin because the potential growth of it is still at early stage even the mining of bitcoin will take time to complete. The estimated year for it to be completely mined is 2140. With this you will see that there is still time for it to grow in adoption and also in price. Investing in bitcoin doesn’t requires large amount of money like other investments will require, you can invest as little as 10$ in it and continue to stack up. But one key factor in bitcoin investment is do not invest what you can’t afford to lose. From your story you don’t earn a living yourself and depend on your dad for stipends which seriously is not an amount you can afford to lose. But if you are thinking of getting to save some money from this allowance then bitcoin offers a better advantage because it is an hedge against inflation and you will wouldn’t worry about it devaluation. But the thing is you have to make sure you’re saving for a very long time and wouldn’t panicly sale when the price is down because bitcoin is volatile.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kyc20040202",
      "created_time": "October 17, 2023, 09:18:12 AM",
      "body": "Quote from: Latviand on October 17, 2023, 08:40:36 AMCan we know your living conditions in South Korea? Because depending on where you're in the country, the expenses will be different and if you're in Seoul, you're going to need all the money you've got and those that's sent to you because Seoul is one of the most expensive city in the world. Check your expenses and try to maintain a 1 week routine and see if there's any money left before the next aid comes, if you're struggling to make ends meet at that 1 week routine, you probably need to focus on daily expenses first before investing in bitcoin. This advice is purely my opinion so take it with a grain of salt.100 dollar is for personal use. I can use it to anything I want. I use father's credit card for my expenses.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kro55",
      "created_time": "October 17, 2023, 09:23:26 AM",
      "body": "Quote from: Z-tight on October 17, 2023, 08:47:07 AMQuote from: kyc20040202 on October 17, 2023, 08:24:08 AMSo.. I am really confused. I receive about $100 a month from my dad. I am planning to use them to buy some bitcoin. Please give me an advice to be successful Bitcoin investor in the future. You have told us that $100 dollars is all you recieve monthly, but we do not even know if it is enough to conver all of your expenses monthly and how much you get to save from it. If you get some spare money off the $100 at the end of the month and you don't know what to use it for, you can buy BTC slowly through dca, but if you are going to be buying BTC and depriving yourself of what is essential, then no, because you will eventually end up selling it at a loss.If you aren't making your own money yet and you do not have enough to invest in BTC, you can invest in knowledge for now and understand everything about it and when you have money you buy some for yourself.I'm not from Korea, but I don't think 100 USD per month will be enough for a student considering all the living expenses such as accommodation, tuition, food...Korea is a developed country so I think it will be difficult for OP to live with that amount of money, let alone invest. But if he can save and has some spare money then investing in bitcoin would be ideal rather than saving in fiat currency. It cannot help him become rich, but if he persists in accumulating and can hold bitcoins for a long time, his life will improve a lot and he will even have some capital to do business after graduation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gladitorcomeback",
      "created_time": "October 17, 2023, 09:25:22 AM",
      "body": "Quote from: kyc20040202 on October 17, 2023, 08:24:08 AMAfter graduating high school, I saw bitcoin on youtube. At that time, it was about 60,000 dollar.I had some research about Bitcoin. I specially watched videos of Michael Saylor. For me, he sounded very logical. I checked the price, and I could see that Bitcoin is up 45950334.26% since 2009. I thought I am very late to start invest to Bitcoin, but many people said it is early. So.. I am really confused. I receive about $100 a month from my dad. I am planning to use them to buy some bitcoin. Please give me an advice to be successful Bitcoin investor in the future. So actually you want to ask wheather it is best time to invest or you are late so I will advise that you should invest now because btc price already down as you saw its price at 60k and history show that every time after btc crashed we seen a ATH(All time high). If you can save some $ monthly and also you understand that you will not need this money in the short time then I will suggest to go for it. People who says that you are late actually means that it will not rise like previous but we could expect 100k-500k after halving (before 2027). One fake news push btc 5% in very short time then you could imagine if many big ETF companies successful get approval. Adoption is one the way and many big companies looking to accept btc and I think we should not miss the chance if we not invested yet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ben Barubal",
      "created_time": "October 17, 2023, 09:32:23 AM",
      "body": "Quote from: kyc20040202 on October 17, 2023, 08:24:08 AMAfter graduating high school, I saw bitcoin on youtube. At that time, it was about 60,000 dollar.I had some research about Bitcoin. I specially watched videos of Michael Saylor. For me, he sounded very logical. I checked the price, and I could see that Bitcoin is up 45950334.26% since 2009. I thought I am very late to start invest to Bitcoin, but many people said it is early. So.. I am really confused. I receive about $100 a month from my dad. I am planning to use them to buy some bitcoin. Please give me an advice to be successful Bitcoin investor in the future.     Your plan is good; at least you are not wasting the money your parents give you. That is a wise decision you will make in life. Since you are a newbie here, the best thing to do is make a long-term investment. So that somehow, while you study, your Bitcoin is only in contact with your wallet balance.   Guaranteed, you will grow more than x3 of your capital if you do that, and in just one year if you maintain that, that is a huge amount when the value of Bitcoin in the market is x5.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jasonjm",
      "created_time": "October 17, 2023, 09:51:31 AM",
      "body": "Quote from: kyc20040202 on October 17, 2023, 08:24:08 AMAfter graduating high school, I saw bitcoin on youtube. At that time, it was about 60,000 dollar.I had some research about Bitcoin. I specially watched videos of Michael Saylor. For me, he sounded very logical. I checked the price, and I could see that Bitcoin is up 45950334.26% since 2009. I thought I am very late to start invest to Bitcoin, but many people said it is early. So.. I am really confused. I receive about $100 a month from my dad. I am planning to use them to buy some bitcoin. Please give me an advice to be successful Bitcoin investor in the future. I appreciate what you are thinking at a very young age. It is never too late to invest in Bitcoin. A $100 investment is a good start,  and now is the ideal opportunity to invest in Bitcoin, as the price has already crashed from ATH and is about to touch the bottom. After the 2024 halving, the price will increase, until then, you should accumulate as much Bitcoin as you can. Trust me, you will not regret your decision. To be a successful investor in the Bitcoin/ crypto market, you have be to patient, wait for the right moment and don't panic when the price plunges. Go for a long-term investment (hold for at least 5 to 10 years).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yhiaali3",
      "created_time": "October 17, 2023, 10:03:12 AM",
      "body": "For you as a student, it would be very good to start saving Bitcoin from now on. Following the DCA strategy is the best thing in the long run. You can search on the forum or the Internet to learn how to do it the right way.You can buy Bitcoin every month using the $100 you get, but it is better to buy 50% and leave the rest for your personal needs. Although the amount is not large, it will be good in the long run. You will get good capital that will be in front of you when you graduate.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kryptqnick",
      "created_time": "October 17, 2023, 10:09:46 AM",
      "body": "Okay, you gotta understand that it's important to learn making your own financial decisions instead of relying on financial advice of other people. So I'm not going to give you advice on what to do with the money. Instead, I'll just try to mention things that may be helpful to consider before making an informed decision.- Is there a good chance you might need this $100 within the next year, and it will be a big problem if it's $70 instead of $100? If so, Bitcoin might be a risky investment because the price can easily go further down.- Is there anything good you could spend this money on right now? Perhaps you can buy something or help someone with it.- How long are you willing to wait for Bitcoin to grow? Let's imagine that at the end of 2024, Bitcoin rises to $100k. It's not an impossible scenario. That's a little under 4x increase from the current price, so let's say your $100 become $350. Is that a difference-making amount of money to you? Or will you hodl for many years in a hope of higher profit? Even if Bitcoin grows 10x over some time, that'll mean you get $1k out of $100, which is nice, but again, maybe not that significant, depending on your overall financial situation.$100 might be a good experimental investment, just to see how it goes, or an initial investment that will be followed by more money being put into Bitcoin. If you intend to invest a total of $100 per month into Bitcoin, that can amount to a significant amount over time, but perhaps you need this money here and now for something else.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DabsPoorVersion",
      "created_time": "October 17, 2023, 10:11:36 AM",
      "body": "Quote from: kyc20040202 on October 17, 2023, 08:24:08 AMAfter graduating high school, I saw bitcoin on youtube. At that time, it was about 60,000 dollar.I had some research about Bitcoin. I specially watched videos of Michael Saylor. For me, he sounded very logical. I checked the price, and I could see that Bitcoin is up 45950334.26% since 2009. I thought I am very late to start invest to Bitcoin, but many people said it is early. So.. I am really confused. I receive about $100 a month from my dad. I am planning to use them to buy some bitcoin. Please give me an advice to be successful Bitcoin investor in the future. You're still young but already thinking about investment. That's a good start for someone at your age. Being curious about the things that can make you earn money. Try to do more research to earn more knowledge about it.Anyways, the money you receive from your dad is worth $100 and is probably used to provide for your needs in school. Try to figure out if you can at least save some of that money and invest it in Bitcoin. Do DCA every now and then, that way, you will reach your goal and have a decent amount of investment. While doing that, try to do research about Bitcoin, it's better not to neglect to learn about it. Always remember that knowledge will be an important key in the future.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Latviand",
      "created_time": "October 17, 2023, 10:18:54 AM",
      "body": "Quote from: kyc20040202 on October 17, 2023, 09:18:12 AMQuote from: Latviand on October 17, 2023, 08:40:36 AM~100 dollar is for personal use. I can use it to anything I want. I use father's credit card for my expenses.I'll hold you to that statement which means that I am going to tell you to look at yourself and do some self-introspection, are you the kind of person that's going to be going out to have a few drinks with your friends once in a while? Or are you the one that just wants to stay at home or invite them there to have a few drinks? Your answer to these questions would be helpful on how much of that money is going top be in bitcoin, there are other stuff besides those 2 questions that I've said but I hope you get the point. Now if you're the loner type that have a really small circle of friends, I would just carelessly advice you to invest all of it in bitcoin.Another thing to consider OP is that when you invest in bitcoin, expect price drops that would make you panic and might make you do something ridiculous like bailing out at a lower price than when you've bought your bitcoin, hodling will be a test of patience for you.Quote from: Bitcrash on October 17, 2023, 09:37:10 AMTry www.bitcrash.games where people are doubling their monies/crypto within a couple minutesThis is not the right advice for you OP, don't use that money to gamble, just invest it in bitcoin and hodl. Wth, that's a blatant and reckless way to promote your business, I guess it's normal since it's crash.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hd49728",
      "created_time": "October 17, 2023, 10:31:52 AM",
      "body": "Quote from: kyc20040202 on October 17, 2023, 08:24:08 AMAfter graduating high school, I saw bitcoin on youtube. At that time, it was about 60,000 dollar.From that time to today, it takes you two years that is long enough.QuoteI receive about $100 a month from my dad. I am planning to use them to buy some bitcoin. What is the $100 monthly for?If it is for your expense, tuition fee and things are important for your study, life, you should not use it to buy Bitcoin. If it is money your Dad gave you is to drink coffee, sweeties with your friends, as they are not too important, you can save the $100 or part of it to invest in Bitcoin.Use this website https://dcabtc.com/Input $100 monthly for a DCA and see how it worked in the last 3 or 4 years. Whatever time you want to apply Dollar Cost Averaging and see how it can work magically.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "crwth",
      "created_time": "October 17, 2023, 10:39:49 AM",
      "body": "Are you planning to just put all that money into BTC? If you would, that would be more beneficial. Make sure that you are going to be able to make up for your living expenses. Those are the important points before proceeding with investing. Maybe in the meantime, you could find work that would pay in crypto and then just earn that and have more. In that way, you don't have to shell out anything and in the future, you could have a lot of BTC.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Z-tight",
      "created_time": "October 17, 2023, 10:48:15 AM",
      "body": "Quote from: kyc20040202 on October 17, 2023, 09:18:12 AM100 dollar is for personal use. I can use it to anything I want. I use father's credit card for my expenses.Okay, if that is the case, then it may not be a bad idea to buy BTC with some of that money every month. But there are things you must learn about BTC before buying it. Take note that BTC isn't a get rich quick scheme and you have to understand how to store your BTC in the right way so you don't lose it to scammers. Let's say you store your coins in a centralized exchange or in an online device that you use for your online activities, your funds can be stolen, so things like these is what you must learn about BTC before buying it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "348Judah",
      "created_time": "October 17, 2023, 10:58:16 AM",
      "body": "Quote from: kyc20040202 on October 17, 2023, 08:24:08 AMAfter graduating high school, I saw bitcoin on youtube. At that time, it was about 60,000 dollar.I had some research about Bitcoin. I specially watched videos of Michael Saylor. For me, he sounded very logical. I checked the price, and I could see that Bitcoin is up 45950334.26% since 2009. I thought I am very late to start invest to Bitcoin, but many people said it is early. So.. I am really confused. I receive about $100 a month from my dad. I am planning to use them to buy some bitcoin. Please give me an advice to be successful Bitcoin investor in the future. You're never missing out as long as you made a decision to invest now, you can't blame yourself for those past days when things were not as they were now, but you can consider the $68,000 all time high to where we are today and where we are going sooner when a new all time high will be unfolded after the halving and bullrun follows, it's not bad neither was it too late for you to start something from where we are, the historical record will be your confirmation that bitcoin will always be a profitable investment asset, while you make use of your monthly income allocation for bitcoin investment using DCA method amd hold till after next halving.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JunaidAzizi",
      "created_time": "October 17, 2023, 11:08:56 AM",
      "body": "Quote from: kyc20040202 on October 17, 2023, 08:24:08 AMAfter graduating high school, I saw bitcoin on youtube. At that time, it was about 60,000 dollar.I had some research about Bitcoin. I specially watched videos of Michael Saylor. For me, he sounded very logical. I checked the price, and I could see that Bitcoin is up 45950334.26% since 2009. I thought I am very late to start invest to Bitcoin, but many people said it is early. So.. I am really confused. I receive about $100 a month from my dad. I am planning to use them to buy some bitcoin. Please give me an advice to be successful Bitcoin investor in the future. You heard about Bitcoin from someone and now you want a suggestion, it shows that you have zero knowledge about trading. Ok, don't worry, we are here to help you in the best possible way. The first thing is to save your money and don't waste it on things that are not important like outings with your friend, clubbing, etc. When you save money for 2 to 3 months invest it in Bitcoin and hold it this is because you are new to Bitcoin and it takes time to learn about other strategies and has more risk in it, In the long-term investment the risk is minimal, and gives you good returns. Another thing is that don't put all your money in Bitcoin it's very risky for you and is volatile. If you lose some amount in the BTC then you have the half fund that you put in Bitcoin again and this is how you will proceed with your journey.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "robelneo",
      "created_time": "October 17, 2023, 11:52:28 AM",
      "body": "Quote from: kyc20040202 on October 17, 2023, 08:24:08 AMAfter graduating high school, I saw bitcoin on youtube. At that time, it was about 60,000 dollar.I had some research about Bitcoin. I specially watched videos of Michael Saylor. For me, he sounded very logical. I checked the price, and I could see that Bitcoin is up 45950334.26% since 2009. I thought I am very late to start invest to Bitcoin, but many people said it is early. So.. I am really confused. I receive about $100 a month from my dad. I am planning to use them to buy some bitcoin. Please give me an advice to be successful Bitcoin investor in the future. I always advise those who just recently discovered Bitcoin to read everything about Bitcoin and its history, uses, potential, and security before investing in Bitcoin if you have already done that and you can secure your Bitcoin that's the start of building your portfolio, you are not late I guess you missed the part of its potential price in the future and the price we have now could be 100 or 1000 times in the future, if you dig deep you will not be confused so continue doing research, reading more materials and the latest about the market.$100 a month is a good start you are still young if you are not lavish in your spending and you want to secure your future investing in Bitcoin is the right thing to doI'm sure you have read about HODLING you can start doing this and you can make a profit after the halving, the time to take action is now, its still the best time to invest.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}