{
  "id": "topic_5500664",
  "title": "Princess Leah",
  "author": "Princess Leah",
  "created_time": "June 22, 2024, 12:10:54 AM",
  "content": "I had an opportunity to invest early in Bitcoin but ignorance and lack of funds ruined my chances. I discovered Bitcoin in the early stages but ignorance never allowed me pay attention to it back then, to be honest I felt it was a new scam to steal people's money therefore I didn't even care to learn about it when i first had the opportunity to, but along the line I picked Interest in it when Bitcoin attained a height above $10k in 2017 but I was very unwilling to invest the pocket money I earned from my dad since I didn't have any job back then and solely depended on my parents for financial support. Nevertheless, my doubt about Bitcoin got cleared when Bitcoin went beyond $17k and got to about $25k plus towards the ending of November in 2020, I had no choice but to invest with the little money I got from linear jobs I was earning from by then, and it really helped me that December when it crossed $28k and I was able to get food items and gifts for my parents with some of the profits I got from it. If only I had invested earlier or had been able to convince my parents to try invest since they were financially capable of doing so but I was so ignorant and had doubts over the future of BItcoin. However I'm so grateful for joining this great forum that's helped to enhance my knowledge concerning Bitcoin and other Cryptocurrencies at large to a certain level and currently I don't regret anymore since I've realised that it's not too late to invest more and hold for the future cause I've seen and now believe that  the chances of Bitcoin attaining more heights is still very possible.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5500664",
  "comments": [
    {
      "author": "Churchillvv",
      "created_time": "June 22, 2024, 12:19:46 AM",
      "body": "For me, No regrets. I believe everything has time, back when I heard of it, that wasn't my time to invest. Now I have a little stash it's my time. Truth is everyone here appreciates the opportunity to be here and we all do our best to buy more bitcoin especially those of us who didn't buy earlier.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kryptqnick",
      "created_time": "June 22, 2024, 04:30:53 AM",
      "body": "I think I hypothetically could have invested in Bitcoin earlier, but that would have been difficult for me at that time because of financial hurdles. I don't have any regrets regarding Bitcoin. Honestly, I don't think I have any regrets in life in general so far, as I try to look forward, not backward. There's some good stuff, some bad stuff, some very challenging stuff. But overall, I lean toward optimism in life and have hope for good outcomes.It's okay to have doubts, it's okay to make mistakes. Bitcoin is so far adopted by under 5% of the population, so we may well still be in the early stages.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "moneystery",
      "created_time": "June 22, 2024, 05:45:26 AM",
      "body": "financial issues, to be honest that was the thing that prevented me from investing in bitcoin from the start, and moreover i was a little hesitant to put my money in bitcoin because of its unstable price. but that was in the past and it is very natural for beginners to think like that, now i am more confident and believe more in the potential of bitcoin and plan to invest in the long term by seeing how its value has increased significantly since i knew about it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "boyptc",
      "created_time": "June 22, 2024, 05:57:22 AM",
      "body": "Most of us have the same story on how we ended missing the opportunity. Probably due to a lot of internet scams and that's why we're too doubtful before.Some would probably say that they've been an enthusiasts and believes on the tech of BTC but then, because of lack of funds, we can't invest. I'm on the latter when I've finally knew about it but it's fine. There's always the opportunity and window for each and everyone of us on when we should invest.To the others that haven't invested yet, this time might be your high but look at the next years, this is just going to be part of another next high.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Stepstowealth",
      "created_time": "June 22, 2024, 06:14:45 AM",
      "body": "Quote from: Princess Leah on June 22, 2024, 12:10:54 AM I discovered Bitcoin in the early stages but ignorance never allowed me pay attention to it back then, to be honest I felt it was a new scam to steal people's money...Ignorance means when you do not have any information about something, but in your own case you had information and had doubts too. So doubts and assumptions ruined your chances not ignorance. In my own case, I was very ignorant and did not know about bitcoins until I asked the proper question and got the right information. You may not get the right information if you do not ask the right question and the right people. Asking the wrong questions gets you answers that you do not need, asking the wrong people gets you the wrong or incomplete information.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Don Pedro Dinero",
      "created_time": "June 22, 2024, 06:47:53 AM",
      "body": "The first time I heard about bitcoin was the Mt.Gox scandal, and it was not a thing that invited me to invest. I guess it was mainly ignorance and seeing it at the time as being linked to scams or a Ponzi bubble. But well, in the end I invested and it hasn't been bad for me.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coiningz",
      "created_time": "June 22, 2024, 07:34:49 AM",
      "body": "The only thing that ruined my chances is me. Was not brave enough to do it earlier",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Odohu",
      "created_time": "June 22, 2024, 07:49:01 AM",
      "body": "Mine was ignorance! I never knew or had in mind that holding Bitcoin will amount to a wise investment decision. I was simply buying and using Bitcoin  to pay for services across borders. If I had known that holding those Bitcoins or part of them would make me supper rich in the future, I would have simply jettisoned those businesses, some of which turned out to be scam, and save those precious coins and be living like a king now. I don't know if I should regret because through those businesses, I saw the power and beauty of Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SFR10",
      "created_time": "June 22, 2024, 07:59:56 AM",
      "body": "@Princess LeahAs a short-term GPU miner [in 2011] who was a college student back then, my dead GPU ruined my chances, and considering that I had a small budget at my disposal, I had no choice but to forget about Bitcoin and mining as a whole.- FWIW, I strongly believe \"everything happens for a reason\" (no regrets).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Helena Yu",
      "created_time": "June 22, 2024, 08:28:36 AM",
      "body": "I disagree if you say lack of funds or didn't have a job was the reason why you not invest in Bitcoin. Don't forget with the quote \"only invest what you can afford to lose\", at that time there's no money that you can afford to lose, which make you not want to invest and there's nothing wrong with that.It's not your fault, but it just due to your condition at that time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Spaceman1000$",
      "created_time": "June 22, 2024, 08:47:12 AM",
      "body": "Quote from: Princess Leah on June 22, 2024, 12:10:54 AM I had an opportunity to invest early in Bitcoin but ignorance and lack of funds ruined my chances. I discovered Bitcoin in the early stages but ignorance never allowed me pay attention to it back then, to be honest I felt it was a new scam to steal people's money therefore I didn't even care to learn about it when i first had the opportunity to, but along the line I picked Interest in it when Bitcoin attained a height above $10k in 2017 but I was very unwilling to invest the pocket money I earned from my dad since I didn't have any job back then and solely depended on my parents for financial support. Nevertheless, my doubt about Bitcoin got cleared when Bitcoin went beyond $17k and got to about $25k plus towards the ending of November in 2020, I had no choice but to invest with the little money I got from linear jobs I was earning from by then, and it really helped me that December when it crossed $28k and I was able to get food items and gifts for my parents with some of the profits I got from it. If only I had invested earlier or had been able to convince my parents to try invest since they were financially capable of doing so but I was so ignorant and had doubts over the future of BItcoin. However I'm so grateful for joining this great forum that's helped to enhance my knowledge concerning Bitcoin and other Cryptocurrencies at large to a certain level and currently I don't regret anymore since I've realised that it's not too late to invest more and hold for the future cause I've seen and now believe that  the chances of Bitcoin attaining more heights is still very possible.In the early days of Bitcoin most of us in the sup Sahara African region didn't get the information on time, so to an extent our geographical location was a bit of hindrance for some of us. From the 2017 period you quoted that Bitcoin was above $10k, you could only have a microscopic few that could be able to afford to get Bitcoin at that time given the uncertainty that is always attached to a new commodity in this part of the world. But just like you said, that in 2020 you had to invest the amount you had with you haven seen the success stories and the growth of Bitcoin over time, that's exactly the same way some person's in this part of the world where I come from starting investing little by little, especially based on the knowledge on ground and what we've come to understand over time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DeathAngel",
      "created_time": "June 22, 2024, 09:12:59 AM",
      "body": "I started buying in 2015, I was aware of Bitcoin in 2013 but when I thought about buying the Gox crash happened. I was scared away then & only started buying in 2015. It worked out really well for me any way butcI could have had more Bitcoin if I’d had the balls to buy earlier. We all could have more Bitcoin but I guess we could have less too. I’m happy with my situation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "michellee",
      "created_time": "June 22, 2024, 09:26:48 AM",
      "body": "I don't know about Bitcoin in the early time so I don't try to buy Bitcoin. But I don't regrets for what is happened because I am still investing in Bitcoin although that is late for me. But I am happy that I can join in the Bitcoin world from the faucet.I continued my journey by buying Bitcoin from little amount and collect it into my wallets. You don't have to regrets it because you are still lucky enough that you can join in this forum and you can buy Bitcoin like other people. You can continue buying Bitcoin until you thinks it is enough. It is not too late to buy Bitcoin now as the price gets another correction. You should use this time to buy Bitcoin and holds it until the price reach new ATH so you can sell it. Bitcoin price can still increase back and attaining more heights.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "peter0425",
      "created_time": "June 22, 2024, 09:32:56 AM",
      "body": "I would say it's definitely awareness and resources. First of all, I wasn't the very first one to be aware of bitcoin. How can I invest in something that I did not know existed? When I finally knew about it, money was still an issue and I had to save up in order to actually invest.I am sure many of us can relate that it is these two that ultimately hindered our chances in investing in bitcoin in a much earlier time. Nevertheless, we are all here now and hopefully no more challenges hinder our investments.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "legendbtc",
      "created_time": "June 22, 2024, 10:59:10 AM",
      "body": "QuoteWhat ruined your chances of investing in Bitcoin earlier?In short, from what you said, what ruined your chances of investing in bitcoin was yourself. Because in the past, if you spent time learning about bitcoin and worked hard to have money to invest in bitcoin. Then you have not lost the opportunity to invest in it early. It's all our fault for turning down the opportunity to invest early in bitcoin, not anyone else's. Don't give reasons or blame anyone when we are the ones making decisions for our lives. Also, regrets never make us better, so instead take it as a lesson and find ways not to repeat that mistake. As long as bitcoin exists, the opportunity is there for us and it is up to us to seize it or not.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mirakal",
      "created_time": "June 22, 2024, 11:14:27 AM",
      "body": "Trust issue  - you can really be trusting a kind of investment when you hear bad news and huge scams. Because in the first place, bitcoin doesn't look good and interesting which makes me doubtful about it. But things change especially when the first Bullrun hits, it absolutely changes my mindset. If I was still too dumb not to see the potential profit of bitcoin, I don't own any of this. Gladly everything changed and I have a reason for investing more than anyone else. Most of us thought wrongly about bitcoin but I see it as normal because nobody takes risks in unproven profitable investment. It was just a few years after its creation makes people saw several statements saying bitcoin made them rich. It was then making some rich people and even celebrities invest which turns doubtful individuals to build trust and confidence.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jating",
      "created_time": "June 22, 2024, 11:24:09 AM",
      "body": "Quote from: Princess Leah on June 22, 2024, 12:10:54 AM However I'm so grateful for joining this great forum that's helped to enhance my knowledge concerning Bitcoin and other Cryptocurrencies at large to a certain level and currently I don't regret anymore since I've realised that it's not too late to invest more and hold for the future cause I've seen and now believe that  the chances of Bitcoin attaining more heights is still very possible.I wouldn't say that there's something that ruined us, imagine those early investors who have Bitcoin at like $30.00 sell it very early because they don't believed on it and most likely just invest because of the hype. And for sure they've known like in 2017 when we hit almost $20k and it could have made a lot of them millionaires. Or that guy that still looking for his Bitcoin, Man makes last-ditch effort to recover $280 million in bitcoin he accidentally threw out.And you have a good mindset, we shouldn't look at those missed opportunities, but instead we should move forward as they are still a lot of opportunities to us to make big money here. Price though is very high, but we have DCA as the best strategy or foolproof method as it is very easy to understand and to implement even if you are a beginner.So same for me, I don't have any regrets whatsoever and I do the best of my ability to accumulate and HODL and long for the long term. Specially that we are in a bull run already, just a matter of time before we hit a new all-time-high.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wexnident",
      "created_time": "June 22, 2024, 11:34:26 AM",
      "body": "Quote from: Princess Leah on June 22, 2024, 12:10:54 AM~Just, not knowing about it in general. I was aware of it back in say, 2014, 2015 I think. My first idea of it was when a friend of mine told me one of the tech nerds in our batch was mining Bitcoin in the schools library computer. Sadly, I had limited knowledge of crypto back then, let alone Bitcoin so I wasn't able to start researching about it early on. The next time I went ahead with fully investing in Bitcoin was pre-pandemic, like literally a few months before it. Sadly, the market crashed really badly. I was able to quit while I was ahead by a bit, but that ultimately sealed me from buying Bitcoin anymore due to it crashing down. Fast forward to the last ATH crash to 18k-ish, that was basically the time I just started doing proper DCA strategy with Bitcoin. I've profited quite a bit considering where I started really.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Princess Leah",
      "created_time": "June 22, 2024, 11:37:55 AM",
      "body": "Quote from: Stepstowealth on June 22, 2024, 06:14:45 AMYou may not get the right information if you do not ask the right question and the right people. Asking the wrong questions gets you answers that you do not need, asking the wrong people gets you the wrong or incomplete information.  Exactly, you may know about something, but lack the right  informations or understanding about it, which shows that you're ignorant about it and that was the point I was trying to make. Well the good thing is that we're opportuned to be in this great forum where we'll get the right and more informations concerning Bitcoin. Well your definition about ignorance might be to your own understanding but ignorance can also mean lack of understanding about certain things, one might have heard the world Bitcoin but don't know what it's all about, it's just like those people who still think and refer to every Cryptocurrency as Bitcoin, they know the word Bitcoin  but don't know what it's all about. Now what suitable word would you use to describe them if not ignorance, well at the early stages when I heard about it, it was ignorance that ruined my opportunity to invest, cause I lacked understanding about what it's all about which lead my doubts and assumptions concerning it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}