{
  "id": "topic_5431921",
  "title": "BenCodie",
  "author": "BenCodie",
  "created_time": "December 27, 2022, 12:16:32 AM",
  "content": "I think that this is the only way to majorly effective way to remove exploitative profiteers from the market, stop exit scams and increase transparency of trading activity. As new perpetual/margin trading options become available, like GMX and Dydx (which is unconvincingly completely decentralized, however a seemingly better option than CEXs), the possibility to boycott CEXs becomes more possible.Do you think an effective boycott campaign against CEXs could happen? What do you think would be needed to do so, other than the manpower? Or do you think that the tentacles have wrapped themselves too far around the industry?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5431921",
  "comments": [
    {
      "author": "BitcoinGirl.Club",
      "created_time": "December 27, 2022, 01:02:44 AM",
      "body": "Quote from: BenCodie on December 27, 2022, 12:16:32 AMI think that this is the only way to majorly effective way to remove exploitative profiteers from the market, stop exit scams and increase transparency of trading activity. Don't forget these centralized exchanges allow people to easily buy and sell their crypto. P2P is just not that easy. QuoteAs new perpetual/margin trading options become available, like GMX and Dydx (which is unconvincingly completely decentralized, however a seemingly better option than CEXs), the possibility to boycott CEXs becomes more possible.Centralized exchanges are fine but we need to understand that a monopoly business model is not good for anything. I see some exchanges are having large share of exchange industry which is obviously bad. They will start manipulating the crypto users very soon if they have not started yet.QuoteDo you think an effective boycott campaign against CEXs could happen? If you and me start avoiding it then it starts. But before that we need to ensure that there are enough decentralized exchanges available and accepted by the community.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BenCodie",
      "created_time": "December 27, 2022, 01:10:09 AM",
      "body": "Quote from: BitcoinGirl.Club on December 27, 2022, 01:02:44 AMQuote from: BenCodie on December 27, 2022, 12:16:32 AMI think that this is the only way to majorly effective way to remove exploitative profiteers from the market, stop exit scams and increase transparency of trading activity. Don't forget these centralized exchanges allow people to easily buy and sell their crypto. P2P is just not that easy. Yes this is true. There is a severe lack of decentralized P2P services for fiat services that are anywhere near as convenient or easy to use as centralized options. Once this gap is filled the chance might grow stronger.Quote from: BitcoinGirl.Club on December 27, 2022, 01:02:44 AMQuoteAs new perpetual/margin trading options become available, like GMX and Dydx (which is unconvincingly completely decentralized, however a seemingly better option than CEXs), the possibility to boycott CEXs becomes more possible.Centralized exchanges are fine but we need to understand that a monopoly business model is not good for anything. I see some exchanges are having large share of exchange industry which is obviously bad. They will start manipulating the crypto users very soon if they have not started yet.In my opinion, manipulation would be a well-versed activity for centralized exchange \"elites\" (if you will) by now. The discussion and suspicion of these activities date back as far as I remember. We should be suspicious that there is no talk about it now.Quote from: BitcoinGirl.Club on December 27, 2022, 01:02:44 AMQuoteDo you think an effective boycott campaign against CEXs could happen? If you and me start avoiding it then it starts. But before that we need to ensure that there are enough decentralized exchanges available and accepted by the community. I agree. Decentralized exchanges are greatly improving in terms of usability. Your point about P2P services/fiat-related services are definitely a strong point of improvement if CEXs were to be able to be boycotted successfully.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "December 27, 2022, 05:44:11 AM",
      "body": "Boycotting of CEXs have been around for a good while now. It's just that for instances like this, boycotting can only do so much. CEXs are still the most convenient way of buying/selling and holding bitcoin/crypto hence it will be the most used platform variant.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "julerz12",
      "created_time": "December 27, 2022, 10:01:53 AM",
      "body": "I'm pretty sure this won't be even remotely possible as the majority of crypto-users are still dependent on CEXs for their day to day trading. It's where the most volume is, most services offered as well such as P2P and Fiat on-ramps, etc. Some CEX even have flexible savings while most DEX platform that offers similar service just locks your coin/token for a specific period.I also feel like main problem is that most DEXs only offer a limited amount of services; trade, vaults, farms and that's it. Although you can use various services, they are not on just one platform, you would need to have multiple tabs open on your browser to use them. CEXs offers plenty of services and in some instances, all top services are in one big CEX; not to mention perks for just trading on their platforms. You basically get more bonuses out of CEXs than DEXs.Unless crypto-adoption is in a full swing, meaning, we can just go to a store and pay with any crypto or trade freely with it without the need of a P2P service that some CEXs offers, and DEXs caught up to all the services and perks offered by CEXs, this is not possible as only a limited amount of people would end up participating.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "noorman0",
      "created_time": "December 27, 2022, 12:00:24 PM",
      "body": "Maybe, first bitcoin has to be the only crypto left. CEX seems to have become the main resource supporting the crypto industry to continue to grow. Altcoins that are listed on certain CEXs can be considered an indicator that more people will come. On this basis, the boycott attempt probably won't have much power of support as long as bitcoin is not alone.Remember that people didn't just jump into this space initially thanks to bitcoin even though bitcoin was ultimately their end goal.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fortunecrypto",
      "created_time": "December 27, 2022, 12:33:36 PM",
      "body": "Quote from: BenCodie on December 27, 2022, 12:16:32 AMI think that this is the only way to majorly effective way to remove exploitative profiteers from the market, stop exit scams and increase transparency of trading activity. As new perpetual/margin trading options become available, like GMX and Dydx (which is unconvincingly completely decentralized, however a seemingly better option than CEXs), the possibility to boycott CEXs becomes more possible.Are there any moves to boycott centralized exchange, will it hold and gain momentum? there's risk in trading on Centralized exchanges but when it comes to the advantages and disadvantages of trading on exchanges traders prefer the advantages brought by trading on centralized exchanges, people who think that they should boycott CEX needs to realize that many DEXes don't support dollar-to-crypto trades, and DEXs only support cryptos on one single blockchain compared to CEX's who can support multiple chains, enabling trading one token from a different chain to another token on another chain.QuoteDo you think an effective boycott campaign against CEXs could happen? What do you think would be needed to do so, other than the manpower?Right now I don't see that happening the industry has so many tokens on multiple chains and they can only be housed on a Centralized exchange.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "December 27, 2022, 01:03:37 PM",
      "body": "Quote from: BitcoinGirl.Club on December 27, 2022, 01:02:44 AMQuote from: BenCodie on December 27, 2022, 12:16:32 AMI think that this is the only way to majorly effective way to remove exploitative profiteers from the market, stop exit scams and increase transparency of trading activity. Don't forget these centralized exchanges allow people to easily buy and sell their crypto. P2P is just not that easy. I would also add that p2p is not safe.Would you sell 10k usd to a lot of different people in p2p? One day you will see an exit scam.The best is to use cex just to trade, and they are good for that. Then you just withdrawal.  Don't hold crypto in cex. Simple as that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LeGaulois",
      "created_time": "December 27, 2022, 01:55:47 PM",
      "body": "Saying by using CEXs it helps bitcoin to be massively adopted is a joke. The currencucy has been designed without the need to a 3rd party and centralized. The only thing it does is to confirm the governments needs to regulate the marketNot even need to debate on the fact you're providing your personnal data for the KYC, because I understand some people don't give a fuck to privacy et al. I understand some people claim to not have a big amount on a CEX. That's just to feel less guilty.Preaching decentralization and privacy, and using centralized exchanges, accepting the taxes and laws,......Very efficient decentralization </sarcasmIf you're using a CEX, I hope you won't complaint when the market will be even more regulated as it is currently. You won't be eligible to complain because you think you're paying too much taxes on your gains. You can't complain because you helped to get such situation.Why should a group of devs create something while people aren't interested in decentralized stuff?5$ to join an airdrop on a CEX5$ to watch a video on coinbase.10 cts to RT a cuntAnd voilà, people are happy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Plaguedeath",
      "created_time": "December 27, 2022, 03:23:48 PM",
      "body": "Just think centralized exchange is similar like banks and fiat currency, does there's a bank collapse? yes, does there's a fiat currency collapse? yes. But does all of banks and fiat currency are get boycott and there's no countries use fiat currency anymore? nope. It will be same like centralized exchange, no matter what how bad it is and how many problem are comes from it, any countries only want centralized exchange because it's their another way to control their citizens and get money through tax.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "examplens",
      "created_time": "December 27, 2022, 03:37:03 PM",
      "body": "for any boycott to succeed, it is necessary that at least 65%+ of the users participate in it. At the same time, they are ready to boycott for a long period of time, often to their own detriment. it is certainly not feasible.I personally think the problem is that currently, all CEXs offer many options they don't just stick to their exchange priority. For example, Binance has many features like Spot Trading, Margin Trading, Derivatives Trading, Leveraged Tokens, NFT Marketplace, Strategy Trading, OTC Portal, Binance Convert, Auto Invest, DeFi Staking, Dual Investment, Binance Pool, Binance Card, Binance Launchpad, Binance Launchpool...I think they can certainly be removed from the CEX list, they are more of a trading/investment platform. yes, this is not the case only with Binance. All so-called CEXs use a similar business model.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaveF",
      "created_time": "December 27, 2022, 05:43:32 PM",
      "body": "No, not in any meaningful way. There are a lot of people here against them, but out there in the 'real world' they are just too easy and popular to use.People want the magical internet money to just appear, they don't know and they don't want to know or care. So if they have to put in effort to make it work they will push back.With the push back the people who know better can only go so far after that it's just talking to the wall.So, the more knowledgeable people will try to educate people about not using them, but they are just too popular and any real effort to boycott them will just fail.Once again, all the above in my opinion. I hope I am wrong, but I doubt it.-Dave",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "December 27, 2022, 06:04:02 PM",
      "body": "Quote from: noorman0 on December 27, 2022, 12:00:24 PMMaybe, first bitcoin has to be the only crypto left. CEX seems to have become the main resource supporting the crypto industry to continue to grow. Altcoins that are listed on certain CEXs can be considered an indicator that more people will come. On this basis, the boycott attempt probably won't have much power of support as long as bitcoin is not alone.Remember that people didn't just jump into this space initially thanks to bitcoin even though bitcoin was ultimately their end goal.Even with only bitcoin existing — though CEX usage would definitely be far lower because of far less retail speculation, CEXs will still be heavily used; though people would probably be using peer-to-peer exchanges a lot more. I remember LocalBitcoins having really high usage back then(I know they didn't require KYC back then, but yea).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dkbit98",
      "created_time": "December 27, 2022, 07:16:19 PM",
      "body": "Quote from: BenCodie on December 27, 2022, 12:16:32 AMDo you think an effective boycott campaign against CEXs could happen? What do you think would be needed to do so, other than the manpower? Or do you think that the tentacles have wrapped themselves too far around the industry?It's already happening and people withdraw record number of Bitcoins from centralized exchanges after collapse of FTX and rumors about Binance exchangeProblem is that most of the people don't know what to do next and they think that using decentralized exchanges like Bisq or other type of p2p trading is very hard and complicated, but they are wrong about it.I would also like to see more simple dumb-down cex alternatives for Bitcoin trading and I think developers are working on that with Lightning Network and atomic swaps.It's much harder to deal with all the banking crap but people still do it every day.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "aioc",
      "created_time": "December 27, 2022, 10:14:50 PM",
      "body": "I don't think I can support that given that there's no clear alternative, and if Decentralized can serve the interest of new people coming in its easy for newbies to learn and teach them how to trade on a centralized exchange than using a decentralized exchange, the point here is the easiness of use and familiarity I would have to change the chain on my metamask to be able to transact from one chain to another when centralized exchange can do this for me on their platform.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Z-tight",
      "created_time": "December 27, 2022, 11:43:20 PM",
      "body": "Quote from: mk4 on December 27, 2022, 05:44:11 AMCEXs are still the most convenient way of buying/selling and holding bitcoin/crypto hence it will be the most used platform variant.Holding BTC in a centralized exchange is only convenient for BTC users who do not know how important self custody of their keys is, and how easy it is for them to write their recovery phrase and keep it safe. Handing over your money to someone to keep for you has to be less convenient than holding your money yourself in your own custody; in my humble opinion, any money that is not for active trading should be moved into the owners own wallet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitcoinGirl.Club",
      "created_time": "December 28, 2022, 05:36:59 AM",
      "body": "Quote from: LeGaulois on December 27, 2022, 01:55:47 PMSaying by using CEXs it helps bitcoin to be massively adopted is a joke. The currencucy has been designed without the need to a 3rd party and centralized. The only thing it does is to confirm the governments needs to regulate the marketBitcoin and the entire crypto economy is far away for the real adoption. In my opinion the real adoption will only be achieved when there will be only crypto exists for your daily life trades. These days we have fiat as digital forms by paypal, visa/debit/credit cards and other digital wallets. When you are buying a bottle of water you are paying by either cash, or by card. When you are buying something online you are paying either by paypal, or visa debit or credit card. It's common for everyone. Only a very small group of people are trying to find alternatives and people like you and me and us are using crypto whenever we have chance to pay for something.Real adoption will be when these small group of people will become the common people. Right now these centralized exchanges are just helping us to be in crypto and play with it only.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "robelneo",
      "created_time": "December 28, 2022, 01:15:54 PM",
      "body": "Quote from: Plaguedeath on December 27, 2022, 03:23:48 PMJust think centralized exchange is similar like banks and fiat currency, does there's a bank collapse? yes, does there's a fiat currency collapse? yes. But does all of banks and fiat currency are get boycott and there's no countries use fiat currency anymore? nope. It will be same like centralized exchange, no matter what how bad it is and how many problem are comes from it, any countries only want centralized exchange because it's their another way to control their citizens and get money through tax.Good comparison, it's complicated for newbies and for many of us interacting with a decentralized exchange and on many chains, just like on fiats and banks, centralized makes it easy for us, it's like they are serving it all to us in a silver platter, this is the price we have to pay because of mainstream adoption they did not integrate Cryptocurrency in their system but rather, they integrate their system in Cryptocurrency, we will be like this, I don't see any effort to boycott centralized exchanges succeeding in a long term, how I wish it will.It's only a matter of time before we'll all start trading on CEX again.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "The Cryptovator",
      "created_time": "December 28, 2022, 06:52:13 PM",
      "body": "Boycotting centralized exchange would be a decision made in real time. However, I am worried about how many traders are concerned about which exchange they are using. The worst exchange I've seen among many users. Though it is impossible to completely boycott centralized exchanges, we can move our holdings to non-custodial wallets to secure our funds. As a result, we can avoid a lot of drama. To be honest, we are still not safe, because in the event of an accident, the entire crypto market collapses, and we lose our holding value.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AbuBhakar",
      "created_time": "December 28, 2022, 06:58:17 PM",
      "body": "Quote from: BenCodie on December 27, 2022, 12:16:32 AMDo you think an effective boycott campaign against CEXs could happen? What do you think would be needed to do so, other than the manpower? Or do you think that the tentacles have wrapped themselves too far around the industry?No. People will always choose convenience over complex but safe way of trading. CEX offers a lot of advantage against CEX except for not controlling the private key.The }not your keys not your coins” slogan is already existing for long time yet people still use CEX to store. People will always fall for there greed since CEX has a lot of ways to attract user to use it through bonuse, giveaways and other program that incentivize use of CEX. This kind campaign is very hard to implement to all user or even to the majority only.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}