{
  "id": "topic_5465183",
  "title": "Dzigie",
  "author": "Dzigie",
  "created_time": "August 31, 2023, 11:46:37 AM",
  "content": "Pek fazla açıklama yapmaya gerek yok aslında. Başlıkta yer alan metin her şeyi açıklıyor. Kısaca açıklamak gerekirse Coinmarketcap ilk 20 arasında bulunan kripto paraların 10 yıllık serüvenini animasyon ile görselleştirmiş. Bazı altcoinler bazen iyi yükselişler gerçekleştirmiş ama lider hep Bitcoin olmuş. Ethereum dışında ikinciliği uzun süre domine eden başka bir altcoin olmamış. Fakat ikinci ve üçüncü sırada olup sonra ilk 20 arasından duramayan coinler olmuş. Bitcoin ve Ethereum alanlar kendilerini şanslı hissetmiştir. Fakat animasyonu izlerken ilk 20 coin arasından kaybolan altcoinleri satın alanların çok talihsiz olduklarını düşündüm. Birikimlerini yanlış coinlerde değerlendirenler için sert ve acımasız bir marketteyiz.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5465183",
  "comments": [
    {
      "author": "totti67",
      "created_time": "August 31, 2023, 05:57:29 PM",
      "body": "Bitcoin ve etherium kendi sağlam  ve sadık kitlesine sahip olmuş bu süre içinde diyebiliriz sanırım. Diğerlerinde ise ligin ilk yarısında liderliğe kadar çıkmış ama ikinci yarı küme düşmüş Orduspor örneğini görebiliyoruz sanki😂 bu arada denk gelmişken bugün zamanında luna almış birinin videosunu gördüm, herif işi artık goygoya vurmuş, o kadar dip yapmış ki luna, ulan 1 lira olsa milyonerim o kadar çok var elimde diyordu. Bu ve benzeri muhabbetler epey bı altcoinde dönüyor olmalı.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ondekinecakabilirim",
      "created_time": "September 01, 2023, 04:15:40 PM",
      "body": "Bitcoin altcoinler ile aynı kümede tabiki. Ve bu kümenin yönlendiricisi pozisyonunda. Alt Coinlere karşı dominance bakımından güçlü bu nedenle. Bana kalırsa şaşırmamalı bu tabloya. Değişik bi tablo beklentisine de girilmemeli. Bitcoin uzun yıllar boyunca aynı şekil performans gösterir. Alt Coinlere karşı önemli bi pozisyon elde eder. Ama aynı grafiği son 2,3 yıldır altına karşı değerlendirmek gerekir. Veya dolar endeksine göre. Veya global borsalara göre değerlendirmek gerekir. Bana kalırsa esas ayrışmayı orada yapması gerekiyor. Global piyasalarda bağımsız bi görüntü verirse daha bi değerli olur çünkü.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "flipme",
      "created_time": "September 07, 2023, 09:27:36 PM",
      "body": "Bitcoin'in spesifik bir durumu var. Bana neden Bitcoin sorusunu soranlara kripto paraların içerisinde ilk olması dışında bir açıklama yapmakta zorlanıyorum. Nodeların dağınık yapısı onu en merkeziyetsiz coin yapıyor. Buna kesinlikle itirazım yok ama noderlara neden Bitcoin diye sorsak onlar da ilk olması dışında elle tutulur bir cevap veremezler. Bitcoin'in Tanrı gibi sorgulanamaz bir yapısı var. Ethereum'da smart contract teknolojisinde ilk. Bugün birçok smart contract odaklı coin var ama en çok talebi Ethereum görüyor. Bu markette ilk olmak çok önemli. Doge bile ilk olduğu için sıyrılıyor diğer meme coinlerinin arasından.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bthd",
      "created_time": "September 07, 2023, 10:17:32 PM",
      "body": "Quote from: flipme on September 07, 2023, 09:27:36 PMBitcoin'in spesifik bir durumu var. Bana neden Bitcoin sorusunu soranlara kripto paraların içerisinde ilk olması dışında bir açıklama yapmakta zorlanıyorum. Nodeların dağınık yapısı onu en merkeziyetsiz coin yapıyor. Buna kesinlikle itirazım yok ama noderlara neden Bitcoin diye sorsak onlar da ilk olması dışında elle tutulur bir cevap veremezler. Bitcoin'in Tanrı gibi sorgulanamaz bir yapısı var. Ethereum'da smart contract teknolojisinde ilk. Bugün birçok smart contract odaklı coin var ama en çok talebi Ethereum görüyor. Bu markette ilk olmak çok önemli. Doge bile ilk olduğu için sıyrılıyor diğer meme coinlerinin arasından.Aslında ilk olmalarından ziyade orijinal bir şey yaratmış olmaları, problem çözmüş olmaları daha değerli. Sıralamalar elbet bir gün değişebilir ama bu sıralamaların değişebilmeleri için ortaya daha iyi çözümlerin konulması gerekiyor. Sebep sadece ilk olmak olsaydı b-money, eCash, bit-gold gibi daha eski örneklerin daha değerli olmasını bekleyebilirdik ama bitcoinin çözdüğü problemleri çözemedikleri için biraz da doğru zamanda doğru yerde bulunma hikayesi sebebiyle bugün yoklar.Bitcoin nodelarına neden bitcoin diye sorsanız tek kelime ile cevap verirler; merkeziyetsizlik. Bitcoin nodeları herhangi bir ödül kazanmazlar yada getiri elde etmezler tamamen merkeziyetsizlik isteği onların node çalıştırmasını sağlar.Merkeziyetsizliği biraz değersel anlamda küçümsenmiş hissettim ki bence bu piyasada en önemli unsur ve etkisini ethereum'un onca kullanım alanına ve yarattığı ekosisteme karşı halen güçlü bir şekilde sürdürebilmesinin altında yatan sebepte bu. Ethereum'un en büyük sınavı da merkeziyetsizlik, eğer bu sınavı geçemezse aldığı tüm yol boşa gider.Ethereum ve diğerleri biraz binance ve diğer borsalar hikayesine de benziyor. Binance sürekli bir şekilde yenilik koyuyor ortaya ve diğerleri taklit ederek onu yakalamaya çalışıyor ki ortaya orijinal bir çözüm koymadıkları sürece bu imkansız o nedenle sadece taşanı topluyorlar (kucoin, gate, mexc v.b.). Benzer şekilde binance chain, solana, avalanche'de ethereumdan artanları toplamaktan öte gitmiyorlar, ortada ethereum'un çözdüğü problemlerden daha büyük bir problem çözümü yok. Doge hikayesi diğerlerinden daha farklı.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "flipme",
      "created_time": "September 08, 2023, 11:46:13 AM",
      "body": "Quote from: Bthd on September 07, 2023, 10:17:32 PMAslında ilk olmalarından ziyade orijinal bir şey yaratmış olmaları, problem çözmüş olmaları daha değerli. Sıralamalar elbet bir gün değişebilir ama bu sıralamaların değişebilmeleri için ortaya daha iyi çözümlerin konulması gerekiyor. Sebep sadece ilk olmak olsaydı b-money, eCash, bit-gold gibi daha eski örneklerin daha değerli olmasını bekleyebilirdik ama bitcoinin çözdüğü problemleri çözemedikleri için biraz da doğru zamanda doğru yerde bulunma hikayesi sebebiyle bugün yoklar.Merkeziyetsizliği biraz değersel anlamda küçümsenmiş hissettim ki bence bu piyasada en önemli unsur ve etkisini ethereum'un onca kullanım alanına ve yarattığı ekosisteme karşı halen güçlü bir şekilde sürdürebilmesinin altında yatan sebepte bu. Ethereum'un en büyük sınavı da merkeziyetsizlik, eğer bu sınavı geçemezse aldığı tüm yol boşa gider.Merkeziyetsizliği sağlayan noderlar, topluluk. Onlar toplu bir şekilde daha inovatif bir bir zincire geçse aynı denklikteki güçlü merkeziyetsizliği yine ortaya çıkarırlar. Bitcoin'den daha hızlı, Bitcoin'den daha güvenli ve Bitcoin'den daha ucuz varlık transferi imkanı sağlayan bir sisteme geçseler bu hepimiz için daha iyi olur. Fakat kimse bir yere geçmiyor ve herkes Bitcoin zinciri üzerinde işlem yapmaya devam ediyor. Ben de kendime bunu soruyorum, Bitcoin'de kalmalarını sağlayan şey ne diyorum, sonra ilk olması dışında iyi bir cevap bulamadığımı fark ediyorum. Bitcoin ilk çıktığında birçok problemi çözmüş ama bugün birçok probleme karşı yetersiz kalmasına rağmen hala en çok tercih edilen zincir çünkü çok kısa bir açıklaması var: ilk. Bu kısa açıklama bazılarına göre yetersiz veya anlamsız gelebilir ama cevap bu. Biraz döngüsel bir mevzu. 'Soru'nun cevabı, 'soru'nun kendisi gibi ve her şeyi açıklayan en makul açıklama 'ilk olmak' benim değerlendirmeme göre.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pierre 2",
      "created_time": "September 08, 2023, 12:12:59 PM",
      "body": "Kriptopara piyasası demek Bitcoin ve diğerleri demektir bu durum hiçbir zaman değişmedi değişmeyecektir. Animasyon da bunun kanıtı niteliğinde. Diğer altcoinlerde yaşanan değişimlerin pek de önemi yok. İşte en önemli 2 altcoin geçmişten gelen kitleleriyle Ethereum ve de Litecoin olmuşlar. Ne fırtınalar gördük bu piyasada en yakın örneği Luna. İlk 20 ilk 10 hatta bazen ilk 5 olmanın dahi önemi yok. Kurtlar sofrası gibi bir piyasada sağ çıkmaya çalışıyorlar kolay değil.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bthd",
      "created_time": "September 08, 2023, 11:29:35 PM",
      "body": "Quote from: flipme on September 08, 2023, 11:46:13 AMMerkeziyetsizliği sağlayan noderlar, topluluk. Onlar toplu bir şekilde daha inovatif bir bir zincire geçse aynı denklikteki güçlü merkeziyetsizliği yine ortaya çıkarırlar. Bitcoin'den daha hızlı, Bitcoin'den daha güvenli ve Bitcoin'den daha ucuz varlık transferi imkanı sağlayan bir sisteme geçseler bu hepimiz için daha iyi olur. Fakat kimse bir yere geçmiyor ve herkes Bitcoin zinciri üzerinde işlem yapmaya devam ediyor. Ben de kendime bunu soruyorum, Bitcoin'de kalmalarını sağlayan şey ne diyorum, sonra ilk olması dışında iyi bir cevap bulamadığımı fark ediyorum. Bitcoin ilk çıktığında birçok problemi çözmüş ama bugün birçok probleme karşı yetersiz kalmasına rağmen hala en çok tercih edilen zincir çünkü çok kısa bir açıklaması var: ilk. Bu kısa açıklama bazılarına göre yetersiz veya anlamsız gelebilir ama cevap bu. Biraz döngüsel bir mevzu. 'Soru'nun cevabı, 'soru'nun kendisi gibi ve her şeyi açıklayan en makul açıklama 'ilk olmak' benim değerlendirmeme göre.Bitcoin ilk kriptopara değil lakin ilk topluluk hareketi. Diğerleri para ile topluluk yaratırken bitcoin topluluğun yarattığı para. Daha inovatif dediğiniz zincirlerin %99'u seed, private sale, IDO, IPO v.b. v.b. aşamalar ile para toplamış node açmanın belirli ödüllerle teşvik edildiği aynı zamanda yine büyük çoğunluğu node kurmanın belirli sayıda marketten mal almanızı gerektirecek minimum mal kitleme şartına sahip. Ödül yada para kazanma amaçlı yapılan bir işi satın alabilir yada satabilirsiniz ancak sadece inandığı için bir işi yapan kişiyi yada ortaya çıkan ürünü satın alamazsınız. Bu bağlamda bitcoine sadece \"ilk olduğu\" için özel demek çok insafsızca. Bitcoin node kuranlar bir felsefeyi savundukları için node kuruyorlar herhangi bir ödül için değil. Aslında aradığınız cevap kendi cümlelerinizin içinde de var. Halihazırda bitcoinden daha güvenli herhangi bir birim yok. Aynı merkeziyetsiz altyapıyı oluşturabilecek alternatifte yok. Bitcoin bir felsefenin, hareketin öz çocuğu iken diğerleri maalesef büyük oranda para oyunları. Yoksa bitcoinden bir kaç sene sonra bile piyasada daha hızlı bir sürü alternatif vardı.Atladığınız çok önemli bir nokta daha var. Bitcoin topluluğun seçimlerinin sonucu oluşmuş bitcoin, şu an birebir Satoshi tarafından ilk yaratılmış halini kullanmıyoruz. Yada geçmişteki onlarca forktan başka bir tanesi topluluğun geneli tarafından kabullenilmiş olsaydı bugün bitcoin dediğimiz şey o forklardan birisi olacaktı.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitcoinTurk",
      "created_time": "September 14, 2023, 03:20:39 PM",
      "body": "Quote from: flipme on September 08, 2023, 11:46:13 AMQuote from: Bthd on September 07, 2023, 10:17:32 PMAslında ilk olmalarından ziyade orijinal bir şey yaratmış olmaları, problem çözmüş olmaları daha değerli. Sıralamalar elbet bir gün değişebilir ama bu sıralamaların değişebilmeleri için ortaya daha iyi çözümlerin konulması gerekiyor. Sebep sadece ilk olmak olsaydı b-money, eCash, bit-gold gibi daha eski örneklerin daha değerli olmasını bekleyebilirdik ama bitcoinin çözdüğü problemleri çözemedikleri için biraz da doğru zamanda doğru yerde bulunma hikayesi sebebiyle bugün yoklar.Merkeziyetsizliği biraz değersel anlamda küçümsenmiş hissettim ki bence bu piyasada en önemli unsur ve etkisini ethereum'un onca kullanım alanına ve yarattığı ekosisteme karşı halen güçlü bir şekilde sürdürebilmesinin altında yatan sebepte bu. Ethereum'un en büyük sınavı da merkeziyetsizlik, eğer bu sınavı geçemezse aldığı tüm yol boşa gider.Merkeziyetsizliği sağlayan noderlar, topluluk. Onlar toplu bir şekilde daha inovatif bir bir zincire geçse aynı denklikteki güçlü merkeziyetsizliği yine ortaya çıkarırlar. Bitcoin'den daha hızlı, Bitcoin'den daha güvenli ve Bitcoin'den daha ucuz varlık transferi imkanı sağlayan bir sisteme geçseler bu hepimiz için daha iyi olur. Fakat kimse bir yere geçmiyor ve herkes Bitcoin zinciri üzerinde işlem yapmaya devam ediyor. Ben de kendime bunu soruyorum, Bitcoin'de kalmalarını sağlayan şey ne diyorum, sonra ilk olması dışında iyi bir cevap bulamadığımı fark ediyorum. Bitcoin ilk çıktığında birçok problemi çözmüş ama bugün birçok probleme karşı yetersiz kalmasına rağmen hala en çok tercih edilen zincir çünkü çok kısa bir açıklaması var: ilk. Bu kısa açıklama bazılarına göre yetersiz veya anlamsız gelebilir ama cevap bu. Biraz döngüsel bir mevzu. 'Soru'nun cevabı, 'soru'nun kendisi gibi ve her şeyi açıklayan en makul açıklama 'ilk olmak' benim değerlendirmeme göre.Bitcoin, ilk çıkan kripto para değil başarılı olan ilk topluluğun kripto parasıdır dostum. İlk çıktığı zamanlarda hiçbir kripto para iyi bir topluluğa sahip olmadığı gibi maalesef Bitcoin gibi birçok soruna çözüm olabilecek niteliğe de sahip değildi. Bitcoin, birçok soruna karşı çözüm ürettiği için bir topluluk tarafından kabul görmeye başlamış ve başarılı olmasından kaynaklı olarak kripto para piyasasını domine edecek duruma gelmiştir. Her ne kadar günümüzde bazı sorunlar ile karşılaşıyor olsa da oldukça güçlü bir topluluğa sahip olmasından dolayı Bitcoin piyasayı domine etmeye devam etmektedir ve birinciliği de başka bir kripto paraya kaptırmamasının sebebi budur. Kripto para topluluklarınca oldukça güçlü bir destek görüyor olması aslında Bitcoin'den daha iyi bir zincirin olmadığını veya yaratılamayacağı algısını yaratabilir fakat durum böyle değildir. Elbette, şu an kabul edilmese de bazı iyi projelerin altyapıları Bitcoin'den daha iyi bir duruma gelme potansiyeline sahip olduğu gibi elbette bir gün daha iyisi de çıkacaktır fakat asıl mesele topluluğun bunu benimsemesi ve kabullenmesidir. Eğer toplum bunu kabullenmezse Bitcoin tüm piyasayı domine etmeye devam edecektir.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "flipme",
      "created_time": "September 14, 2023, 08:52:30 PM",
      "body": "Bitcoin kendine has konsensüs modeli ile sorunsuz bir şekilde merkeziyetsiz çözümler üreten ilk kripto paradır. Nick Szabo'nun fikir boyutunda kalan Bit Gold'una kadar merkeziyetsizlik sorunu aşılamamıştı. Üzgünüm ama ben Ripple'a kripto para diyemiyorum. Kodlarla yazılmış olması ve sanal bir para birimi olması Ripple'ı benim için kripto para yapmıyor. Bu nedenle Bitcoin'den önceki kripto paralara da kripto para diyemiyorum. Benimki biraz ağız alışkanlığı gibi bir şey.Bu arada bütün marketin Bitcoin'in forku olduğunu hatırlatmakta fayda var.Bu tabloya göre, Bitcoin olmasaydı market olmazdı. Yani, bütün marketi oluşturan şey Bitcoin'in topluluğu değil, Bitcoin'in kendisi.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}