{
  "id": "topic_5401010",
  "title": "Queentoshi",
  "author": "Queentoshi",
  "created_time": "June 01, 2022, 05:07:40 PM",
  "content": "In my love for bitcoin while researching, I bumped on this forum, bitcointalk. While still trying to get accustomed to the forum interface, I have an interesting question to ask. Since this forum started at about same time when bitcoin was launched, If the theme colour of bitcoin is Bitcoin Orange,Grey and White, and the name of this forum is Bitcointalk, why is the theme colour of bitcoin (orange) not reflected on the forum's interface? Why is the theme colour of the forum Blue instead of Orange?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5401010",
  "comments": [
    {
      "author": "BlackHatCoiner",
      "created_time": "June 01, 2022, 05:12:14 PM",
      "body": "Because blue is better for reading. This exists beyond SMF; see Tails, Windows 7. This light-dark blue theme rests your eyes. If you don't like it, change it with BPIP.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nakamura12",
      "created_time": "June 01, 2022, 06:11:37 PM",
      "body": "Can you read easily when the background color is orange and I think if the background is orange and the orange color is a bright color so, would it be not easy to read since the background color is noticable due to being a bright color?. Just deal with the color, I haven't known a forum user during my stay here asking why the Bitcointalk forum is not the same color as the Bitcoin logo. There is a dark mode If I remember correctly so, if you can edit the code and change it to color orange then that would be fine in my opinion.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SatoPrincess",
      "created_time": "June 01, 2022, 06:42:35 PM",
      "body": "When I was a newbie, I remember it took me a while to get used to the mobile interface, using a computer is more easier. Now I’m used to both. I didn’t really notice the color difference, bitcointalk is not like other crypto platforms and I don’t think a new interface is in Theymos plans since forum is serving its purpose, Bitcoin remains the number one discussion here and we have not deviated from that path.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "shahzadafzal",
      "created_time": "June 01, 2022, 07:00:47 PM",
      "body": "Quote from: Queentoshi on June 01, 2022, 05:07:40 PMWhy is the theme colour of the forum Blue instead of Orange?Let's see Wow not too bad... I mean my eyes hurt... but for the love of bitcoin",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "June 02, 2022, 02:58:14 AM",
      "body": "Though I'm pretty sure an orange UI can be used without making it feel like you're looking directly into the sun, not literally everything needs to be sort of \"bitcoin branded\".The blue color is fine as it is; there will no be advantages of switching to orange.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "June 02, 2022, 05:07:29 AM",
      "body": "Quote from: Queentoshi on June 01, 2022, 05:07:40 PMwhy is the theme colour of bitcoin (orange) not reflected on the forum's interface? Why is the theme colour of the forum Blue instead of Orange?I think it would not fit a good and relaxing platform if tis orange.And in anyway, its not were forgetting the love for bitcoin just by the color scheme on its forum. Bitcoin exist not with the love of colors but for its purpose right?Maybe Theymos can somehow implement an orange one just for 1 day to see people and users reaction to that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Despairo",
      "created_time": "June 02, 2022, 05:24:31 AM",
      "body": "Because blue color especially soft blue is the most convenient for eyes, a soft orange color even though wouldn't hurt our eyes, but it just not really convenient. Everytime I visit BPIP which has blue color origin, I never use other color since I doesn't feel good with it. We can take an example of Reddit, where the icon is using orange color, but the forum using white and soft grey color.Quote from: cryptoaddictchie on June 02, 2022, 05:07:29 AMMaybe Theymos can somehow implement an orange one just for 1 day to see people and users reaction to that. I think this can be an idea for the next April fools' day",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "June 02, 2022, 07:02:48 AM",
      "body": "Quote from: Queentoshi on June 01, 2022, 05:07:40 PMSince this forum started at about same time when bitcoin was launched, If the theme colour of bitcoin is Bitcoin Orange,Grey and White, and the name of this forum is Bitcointalk, why is the theme colour of bitcoin (orange) not reflected on the forum's interface? Why is the theme colour of the forum Blue instead of Orange?You have been answered, orange is not cool at all. I believe when this forum wanted to be created, many themes would be tested before the creation and they finally use this perfect and cool light blue theme.Just a point of correction. Bitcoin has no colour, it is a digital currency and it is just not tangible but fungible and can be used as a means of exchange. If you meant bitcoin logo, that is bitcoin logo, because Bitcointalk is a bitcoin forum does not mean its theme should have the colour of bitcoin logo.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nc50lc",
      "created_time": "June 02, 2022, 12:00:09 PM",
      "body": "Quote from: ETFbitcoin on June 02, 2022, 09:54:37 AMQuote from: shahzadafzal on June 01, 2022, 07:00:47 PMLet's see -snip-Wow not too bad... I mean my eyes hurt... but for the love of bitcoin I'm fairly sure it's different from what OP imagined, but thanks for the effort. If you use very light orange and red, you won't hurt your eyes that much.It actually looks neat if we follow the forum's color-scheming style but with orange palettes.Normal Mode:Night Mode:Note: That was just a simple manipulation to the forum's CSS forms for testing purposes, not a theme or plugin (not permanent).Quote from: Queentoshi on June 01, 2022, 05:07:40 PMSince this forum started at about same time when bitcoin was launched, If the theme colour of bitcoin is Bitcoin Orange,Grey and White, and the name of this forum is Bitcointalk, why is the theme colour of bitcoin (orange) not reflected on the forum's interface? Why is the theme colour of the forum Blue instead of Orange?I guess our founder just used the default theme of SMF \"Simple Machines Forum\" which is blue and didn't have the time to apply other themes.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dkbit98",
      "created_time": "June 02, 2022, 08:21:09 PM",
      "body": "Quote from: Queentoshi on June 01, 2022, 05:07:40 PMSince this forum started at about same time when bitcoin was launched, If the theme colour of bitcoin is Bitcoin Orange,Grey and White, and the name of this forum is Bitcointalk, why is the theme colour of bitcoin (orange) not reflected on the forum's interface? Why is the theme colour of the forum Blue instead of Orange?I think this is standard blue color for SMF forums, but you can always use custom themes or simple inverted dark theme like I am doing right now.I see everything in dark gray background, with white letters and golden tabs/titles, but I saw other styles are available in BPIP extension that can easily be enabled even with custom CSS style.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SatoPrincess",
      "created_time": "June 02, 2022, 10:07:25 PM",
      "body": "Quote from: shahzadafzal on June 01, 2022, 07:00:47 PMQuote from: Queentoshi on June 01, 2022, 05:07:40 PMWhy is the theme colour of the forum Blue instead of Orange?Let's see Wow not too bad... I mean my eyes hurt... but for the love of bitcoin I think this settles OP’s curiosity. OP has the option to change his interface to orange colour since he’s more passionate about bitcoin and representing what bitcoin stands for. There is so much we could do to demonstrate our undying love for bitcoin. I wonder how much can be changed with BPIP.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lovesmayfamilis",
      "created_time": "June 03, 2022, 06:34:35 AM",
      "body": "Quote from: BlackHatCoiner on June 01, 2022, 05:12:14 PMBecause blue is better for reading. This exists beyond SMF; see Tails, Windows 7. This light-dark blue theme rests your eyes. If you don't like it, change it with BPIP.Thank you. I did not know it, It really is. I have wondered many times why people use a black theme on Linux systems. Somewhere they wrote that this is the most readable and tireless topic for the eyes. But for me, it didn't work at all. just like the switching action for night mode. Also annoying are all sorts of flickering banners, with a bunch of distracting ads.So yes, the blue interface is very readable. But if you think about all the OP's preference for orange, one would be horrified at what color shades exist in being such a bitcoin fanatic.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "KingsDen",
      "created_time": "June 03, 2022, 07:31:46 AM",
      "body": "Quote from: shahzadafzal on June 01, 2022, 07:00:47 PMWow not too bad... I mean my eyes hurt... but for the love of bitcoin Not too bad and it also hurts the eyes, but if it were to be used as the default, the opacity of the orange background would be reduced. Though the background of the forum is a kind of sky blue which relates to light-background and it makes texts on black readable. Same light color background, replacing blue padding backgrounds with orange would be fine.Apart from eyes strain, another disadvantage of the orange background you posted above is that, it will interfer with the color of signature designs and render it unattractive.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "m2017",
      "created_time": "June 03, 2022, 08:34:19 AM",
      "body": "Quote from: Queentoshi on June 01, 2022, 05:07:40 PMIn my love for bitcoin while researching, I bumped on this forum, bitcointalk. While still trying to get accustomed to the forum interface, I have an interesting question to ask. Since this forum started at about same time when bitcoin was launched, If the theme colour of bitcoin is Bitcoin Orange,Grey and White, and the name of this forum is Bitcointalk, why is the theme colour of bitcoin (orange) not reflected on the forum's interface? Why is the theme colour of the forum Blue instead of Orange?It always seemed to me that the white and orange bitcoin logo was created after the appearance of this forum with blue tones and therefore their colors are different. Or am I wrong and bitcoin logo was created at the same time? Maybe one of the old forum members will be able to tell how it really happened? Also, I am still curious to know why orange was chosen as the color of bitcoin logo and not some other.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "June 03, 2022, 09:52:42 AM",
      "body": "Quote from: m2017 on June 03, 2022, 08:34:19 AMAlso, I am still curious to know why orange was chosen as the color of bitcoin logo and not some other.There wasn't any published reasoning by the person who designed it as far as I know. But it's a safe assumption that the shade of color was picked due to the color of gold(the mineral), and the gold color of some coins. Orange is just a sort of more 'modern' shade of color. At least this is how I look at it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PrinceVisser",
      "created_time": "June 03, 2022, 10:01:57 AM",
      "body": "Quote from: BlackHatCoiner on June 01, 2022, 05:12:14 PMBecause blue is better for reading. This exists beyond SMF; see Tails, Windows 7. This light-dark blue theme rests your eyes. If you don't like it, change it with BPIP.Orange is the best color for your eyes, that's why BMW, Mercedes, Audi etc use Orange inside their cars.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NeuroticFish",
      "created_time": "June 03, 2022, 10:08:56 AM",
      "body": "Quote from: nc50lc on June 02, 2022, 12:00:09 PMNormal Mode:It's not even that awfully bad as I thought.I am already using an alternate theme from the BPIP extension and even custom theme is possible there.If there's demand for such a theme (and OP likes is), I guess that maybe you should share it.However, I would not use it. OK, Orange is Bitcoin color, but let's not exaggerate... gray-ish colors are usually better for the eyes and more people like to use them when reading more text.Quote from: PrinceVisser on June 03, 2022, 10:01:57 AMOrange is the best color for your eyes, that's why BMW, Mercedes, Audi etc use Orange inside their cars.Although it's not that much useful, since the driver looks.. outside.. you know, I'll still give it a try:how many people buy cars with \"colored\" interiors vs how many buy gray/black like variations?Shocking and making people turn to look at you (no matter it's interior or exterior) is not the same as being pleasant as background for reading.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fivestar4everMVP",
      "created_time": "June 03, 2022, 10:21:22 AM",
      "body": "Quote from: Queentoshi on June 01, 2022, 05:07:40 PMIn my love for bitcoin while researching, I bumped on this forum, bitcointalk. While still trying to get accustomed to the forum interface, I have an interesting question to ask. Since this forum started at about same time when bitcoin was launched, If the theme colour of bitcoin is Bitcoin Orange,Grey and White, and the name of this forum is Bitcointalk, why is the theme colour of bitcoin (orange) not reflected on the forum's interface? Why is the theme colour of the forum Blue instead of Orange?I think you already have your answer, the forum was developed for people to learn about bitcoin and as well as teach, we all know that learning online has to do with a lot of reading, and reading online can be really stressful for the eyes without a proper color in place, the forum has to find the best color that will encourage easy reading that won't hurt the eyes, and I think the light blue color is the best for that.Even with this color, I sometimes have to still zoom in the text to enable me see them clearly, most especially when am on my mobile phone, then imagine what it will feel like when the color becomes bitcoin's orange color, that would be disastrous for people with eye problems.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "June 03, 2022, 10:55:16 AM",
      "body": "Quote from: PrinceVisser on June 03, 2022, 10:01:57 AMOrange is the best color for your eyes, that's why BMW, Mercedes, Audi etc use Orange inside their cars.You could literally apply the same argument with any other color if that's the case. And I'm not sure about you, but you don't stare at your car's interior for hours end, right? The car's interior is just something you see in your peripheral vision — obviously you look directly at the car's windshield.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}