{
  "id": "topic_5470315",
  "title": "bitnote",
  "author": "bitnote",
  "created_time": "October 14, 2023, 11:33:13 AM",
  "content": "Watching these YouTuber 'technical analysts' is like witnessing a comedy show. They just scribble lines on a Bitcoin chart and act like they're gazing into a crystal ball. But the reality is, they're about as accurate as a broken clock – right only twice a day. It's laughable how they sell this snake oil, predicting the future with squiggly lines. I wouldn't bet a Satoshi on their so-called insights!",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5470315",
  "comments": [
    {
      "author": "hugeblack",
      "created_time": "October 14, 2023, 11:53:41 AM",
      "body": "There is a person on the forum who is good enough to do some analysis, which he shares here for free. Therefore, after years of tracking the price of Bitcoin, I can say that it is possible to predict with a good degree of accuracy a certain price range for Bitcoin based on a time interval from two weeks to several months, based on current variables.The difficulty of forecasting increases if the variables become numerous and the time frame decreases, and therefore it is difficult to accurately predict the price of Bitcoin over the course of a week, especially if there are a lot of variables, but this does not mean that learning technical analysis is useful for those who want to trade, and for whom it is more important to learn and not blindly imitate these channels.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitnote",
      "created_time": "October 14, 2023, 12:04:48 PM",
      "body": "Quote from: hugeblack on October 14, 2023, 11:53:41 AM---------Predicting the future with triangles and rectangles on a chart? That's like trying to forecast the weather by watching cloud shapes—it's laughable. These so-called technical analysts act like they've cracked the code to fortune-telling, but in reality, they're just doodling. And don't even get me started on institutions; they feast on retail traders' stop losses like vultures on a carcass. You take a position, set a stop loss, thinking you're safe because of your fancy support lines. But no, institutions see it as an all-you-can-eat buffet, spiking prices just to clean you out, and then conveniently start taking profits. It's a game where the house always wins, and your precious triangles and rectangles won't save you from getting played like a fiddle.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Tytanowy Janusz",
      "created_time": "October 14, 2023, 12:22:49 PM",
      "body": "Quote from: bitnote on October 14, 2023, 11:33:13 AMWatching these YouTuber 'technical analysts' is like witnessing a comedy show. They just scribble lines on a Bitcoin chart and act like they're gazing into a crystal ball. But the reality is, they're about as accurate as a broken clock – right only twice a day. It's laughable how they sell this snake oil, predicting the future with squiggly lines. I wouldn't bet a Satoshi on their so-called insights!What amuses me the most is that there are thousands of such YouTube specialists and everyone posts predictions every day. From a mathematical point of view, there is no chance that none of them will hit the bottom of the bear market and when it happens, he suddenly become an idol because he is \"the one who predicted the bottom\" of bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oshosondy",
      "created_time": "October 14, 2023, 12:27:15 PM",
      "body": "Quote from: bitnote on October 14, 2023, 12:04:48 PMBut no, institutions see it as an all-you-can-eat buffet, spiking prices just to clean you out, and then conveniently start taking profits.Do not compare traders and big investors as you are comparing gamblers and the house. Trading is trading. Gambling is gambling. Both of them are different. Hugeblack has said this already, that the lower the time of your indicators, the lower the chance of accuracy. I can understand you too, even with the indicators, trading is very risky. Without the right strategies, indicators will fail in short term trading like scalping and day trading.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yudi09",
      "created_time": "October 14, 2023, 12:28:16 PM",
      "body": "Quote from: bitnote on October 14, 2023, 11:33:13 AMWatching these YouTuber 'technical analysts' is like witnessing a comedy show. They just scribble lines on a Bitcoin chart and act like they're gazing into a crystal ball. But the reality is, they're about as accurate as a broken clock – right only twice a day. It's laughable how they sell this snake oil, predicting the future with squiggly lines. I wouldn't bet a Satoshi on their so-called insights!You can do better than them if you are willing to make videos and upload them to YouTube. I don't know whether it is permissible if you take material for the content you create from posts related to analysis written by some of the best posters on this forum.Youtubers who review technical analysis don't care about the content being explained. They just want lots of video viewers with their own unique qualities because what video viewers are looking for in each type of content is different.Many YouTube videos that contain content about technical analysis are like watching comedy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hyudien",
      "created_time": "October 14, 2023, 12:47:32 PM",
      "body": "Quote from: bitnote on October 14, 2023, 11:33:13 AMWatching these YouTuber 'technical analysts' is like witnessing a comedy show. They just scribble lines on a Bitcoin chart and act like they're gazing into a crystal ball. But the reality is, they're about as accurate as a broken clock – right only twice a day. It's laughable how they sell this snake oil, predicting the future with squiggly lines. I wouldn't bet a Satoshi on their so-called insights!That is the importance of filtering everything that will be learned and seen by others. Not everything must be swallowed raw. So based on what I know you only take lessons and do not need to follow their invitation to drop money into Bitcoin as they estimate. So that doesn't make it as if you will look annoyed. The analysis has their respective ways to read price movements with different techniques both precisely and not will be a lesson and satisfaction for you. All you need to do is learn it first and implement it directly, because even if there are predictive errors you will not blame others. Because of the decision to place a buy and resell position to you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fara Chan",
      "created_time": "October 14, 2023, 01:04:42 PM",
      "body": "Quote from: bitnote on October 14, 2023, 11:33:13 AMWatching these YouTuber 'technical analysts' is like witnessing a comedy show. They just scribble lines on a Bitcoin chart and act like they're gazing into a crystal ball. But the reality is, they're about as accurate as a broken clock – right only twice a day. It's laughable how they sell this snake oil, predicting the future with squiggly lines. I wouldn't bet a Satoshi on their so-called insights!They have their own basic thoughts and have also experienced bad and good things in the past so they can easily draw lines on the price chart like their own thoughts. However, one thing that is very certain is that all humans cannot predict the future accurately even though everyone may have made price predictions for the future. So you also don't need to believe what everyone says if you still have doubts about their words, because you also have the time and ability to do your own research on whatever you are currently studying.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "October 14, 2023, 01:13:51 PM",
      "body": "Quote from: bitnote on October 14, 2023, 12:04:48 PMQuote from: hugeblack on October 14, 2023, 11:53:41 AM---------Predicting the future with triangles and rectangles on a chart? That's like trying to forecast the weather by watching cloud shapes—it's laughable. These so-called technical analysts act like they've cracked the code to fortune-telling, but in reality, they're just doodling. And don't even get me started on institutions; If someone tells you that he can predict the price of 100 %, he is a liar, but this does not prevent that you can get good accuracy between 50 % to 70 % most of the time if you follow simple rules for technical analysis while taking into account variables such as trading volumes, news and economic variables Even here we can say that the price will be in a range and not at a specific price. It is not a random function and even this function, and if we do not know its work mechanism, we can predict the results that come from it, especially as we are talking about a transparent market and it is possible to track the large price changes with a significant market capacity that makes trading in millions of dollars not affecting the price.In short, Long Term can be predicted by giving how the price will be inside and an acceptable accuracy between 50 % to 70 %It is impossible to predict a specific price for bitcoin in a period of time on the day to 3 days.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Unbunplease",
      "created_time": "October 14, 2023, 03:10:55 PM",
      "body": "You don't have to put a lot of trust in youtube analysts. If a person is good at trading, why should he waste his time recording videos? He will simply not have time for it. Analysts don't make money by trading anymore - they sell courses, recruit referrals, advertise any strange projects, and make money on views. Their predictions are usually worthless",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "October 14, 2023, 03:20:43 PM",
      "body": "Quote from: bitnote on October 14, 2023, 12:04:48 PMPredicting the future with triangles and rectangles on a chart? That's like trying to forecast the weather by watching cloud shapes—it's laughable. These so-called technical analysts act like they've cracked the code to fortune-telling, but in reality, they're just doodling. And don't even get me started on institutions; they feast on retail traders' stop losses like vultures on a carcass. You take a position, set a stop loss, thinking you're safe because of your fancy support lines. But no, institutions see it as an all-you-can-eat buffet, spiking prices just to clean you out, and then conveniently start taking profits. It's a game where the house always wins, and your precious triangles and rectangles won't save you from getting played like a fiddle.Not all these technical analysis people are trying to predict the future; they're just trying to look at the odds of which is a few percentage points likely to happen more.While most TA people are trash(and sometimes unethical), not all of them are.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "October 14, 2023, 03:31:25 PM",
      "body": "Quote from: bitnote on October 14, 2023, 11:33:13 AMWatching these YouTuber 'technical analysts' is like witnessing a comedy show. They just scribble lines on a Bitcoin chart and act like they're gazing into a crystal ball. But the reality is, they're about as accurate as a broken clock – right only twice a day. It's laughable how they sell this snake oil, predicting the future with squiggly lines. I wouldn't bet a Satoshi on their so-called insights!Well aside from the content they are giving or free trading tips, of course they are gonna get something in return like views and subscription from users. Well not all youtubers are smug and only using people some are actually helping others with their strategy. However since some are takign advantage of this, they only focus on the content whether sometimes its not helpful to others. Much bettet to learn trading on your own to make up for it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jeraldskie11",
      "created_time": "October 14, 2023, 03:56:04 PM",
      "body": "Honestly, most traders in YouTube are not real traders. They just do it to benefit from their viewers. I'm sure that most of them are the one who learn strategies from their mentors but they can't profit in trading. That's why we should be aware of this kind of people because all they want to do is to make money from you. They're just doing trades for contents. However, there are still good and profitable trader out there, who didn't take advantage a situation. They are taking care of their viewers and subscriber. That kind of youtuber we should looking. DYOR",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DVlog",
      "created_time": "October 14, 2023, 03:59:23 PM",
      "body": "Quote from: bitnote on October 14, 2023, 11:33:13 AMWatching these YouTuber 'technical analysts' is like witnessing a comedy show. They just scribble lines on a Bitcoin chart and act like they're gazing into a crystal ball. But the reality is, they're about as accurate as a broken clock – right only twice a day. It's laughable how they sell this snake oil, predicting the future with squiggly lines. I wouldn't bet a Satoshi on their so-called insights!Most of them are garbage i agree. They do it for fame and money. All of them are not bad and even some are quite resourceful. I know some youtuber who are not only analysis the chat but also do presentation of fact. These youtubers are highly resourceful. Sometimes they failed to predict the market behavior's accurately but their presentation of analysis and fact is enough to convince you they are right.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rat03gopoh",
      "created_time": "October 14, 2023, 04:03:08 PM",
      "body": "They make more sense than you.  So, now what about your plans to get involved in futures trading? How would you go without technical analysis?Quote from: bitnote on October 14, 2023, 10:45:17 AMThinking to start leverage trading.And before that you said:Quote from: bitnote on October 11, 2023, 11:56:05 AMHolding have low risk of losing money quickly while in trading with leverage we can lose all of our money in a short period of time, I think you should find a good place to bet, where it still gives you a chance to win.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nrcewker",
      "created_time": "October 14, 2023, 04:30:56 PM",
      "body": "Quote from: bitnote on October 14, 2023, 11:33:13 AMWatching these YouTuber 'technical analysts' is like witnessing a comedy show. They just scribble lines on a Bitcoin chart and act like they're gazing into a crystal ball. But the reality is, they're about as accurate as a broken clock – right only twice a day. It's laughable how they sell this snake oil, predicting the future with squiggly lines. I wouldn't bet a Satoshi on their so-called insights!They are youtubers as you said, so their main source of income is youtube only. They just picked the crypto trading niche for views. They just gather some basic knowledge and present it to the audience in a manipulative way. They don’t do serious trading and for them trading is like a video setup. So yes it’s wise to use their calls while trading. No I am not like them. When it’s my money at stake, I like to do the analysis and research of my own. Everyone should do this.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AnonBitCoiner",
      "created_time": "October 14, 2023, 05:42:18 PM",
      "body": "Quote from: bitnote on October 14, 2023, 11:33:13 AMWatching these YouTuber 'technical analysts' is like witnessing a comedy show. They just scribble lines on a Bitcoin chart and act like they're gazing into a crystal ball. But the reality is, they're about as accurate as a broken clock – right only twice a day. It's laughable how they sell this snake oil, predicting the future with squiggly lines. I wouldn't bet a Satoshi on their so-called insights!There are many You Tubers who have great experience and observation in crypto currency. I would never compare his technical analysis to a comedy show, because I have been watching some You Tuber's videos continuously for a long time and their technical analysis is usually correct. Crypto currency market is a volatile market, nothing can be guaranteed 100 percent here. Future predictions in the crypto currency market are made from lines. You do not have experience in the crypto currency market, because if you see the complete chart of the history of the crypto currency market, then you will understand the lines of the crypto currency market.They have different timing chart candles and each timing candle has to be seen from different angles. Estimates and analyzes are made by looking at their support and resistance. You Tubers are not doing anything new on their part, but they try to explain to us all by looking at the ups and downs and licks of the past. Satoshi is not a gamble that you will bet on but rather a long term investment in Satoshi",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fatunad",
      "created_time": "October 14, 2023, 06:38:55 PM",
      "body": "Quote from: AnonBitCoiner on October 14, 2023, 05:42:18 PMQuote from: bitnote on October 14, 2023, 11:33:13 AMWatching these YouTuber 'technical analysts' is like witnessing a comedy show. They just scribble lines on a Bitcoin chart and act like they're gazing into a crystal ball. But the reality is, they're about as accurate as a broken clock – right only twice a day. It's laughable how they sell this snake oil, predicting the future with squiggly lines. I wouldn't bet a Satoshi on their so-called insights!There are many You Tubers who have great experience and observation in crypto currency. I would never compare his technical analysis to a comedy show, because I have been watching some You Tuber's videos continuously for a long time and their technical analysis is usually correct. Crypto currency market is a volatile market, nothing can be guaranteed 100 percent here. Future predictions in the crypto currency market are made from lines. You do not have experience in the crypto currency market, because if you see the complete chart of the history of the crypto currency market, then you will understand the lines of the crypto currency market.They have different timing chart candles and each timing candle has to be seen from different angles. Estimates and analyzes are made by looking at their support and resistance. You Tubers are not doing anything new on their part, but they try to explain to us all by looking at the ups and downs and licks of the past. Satoshi is not a gamble that you will bet on but rather a long term investment in SatoshiSeems like OP had some bad experience on losing his money on following one of these Youtubers and this is why he do make out some generalization that most of  them are just clowns. Well, we do have our own insights and beliefs on things though basing up on the things that we do experience but it wouldnt really be that good to be that conclusive. If you are really that experienced enough then seeing those traders that making out some streams and making out their technical analysis then if you are that knowledgeable enough then you could really be able to see on how experienced they are or knowledgeable on the things that they are explaining on the video and not really just simply creating those support and resistance line and then it is really just like that but on the  time that they would really be making some Fibonnaci or some butterfly harmonics and makinguse of those RSI and related divergences on different time frame confirmation then this isnt something a newbie kind of knowledge towards trading.This is why you cant really be able to make out conclusions that all of them are clowns. There are still those traders or streamers who are really that making such good analysis and as long its for free then it would really be that depending on you whether you would be taking it and applying into your own too or would really be just simply skip out.You havent been forced on doing on the same decisions just like with those streamers so it does mean that it would really be always depending on your discretion.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bananington",
      "created_time": "October 14, 2023, 07:38:58 PM",
      "body": "Quote from: bitnote on October 14, 2023, 11:33:13 AMWatching these YouTuber 'technical analysts' is like witnessing a comedy show. They just scribble lines on a Bitcoin chart and act like they're gazing into a crystal ball. But the reality is, they're about as accurate as a broken clock – right only twice a day. Just because someone has a YouTube channel does not mean that they really know what they talk about. Most actions on YouTube is for views. There are many viewers that they are able to fool that they are making good analysis and these people that are fooled end up subscribing and following their channel which is basically their major aim as YouTubers. Some Youtubers are good, but you have to be extra observant and vigilant to be able to spot and differentiate between the real, and the fake and acting.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Stalker22",
      "created_time": "October 14, 2023, 07:48:25 PM",
      "body": "Haha, yeah those YouTube experts crack me up too.  I wouldnt put any money on what they say either.  But not all technical analysis is like that.  There are some skilled analysts out there who actually know their stuff and dont just spout nonsense.  You just gotta dig through the goofballs to find the real deal.  Easier said than done I know... Like trying to find a diamond in a mountain of rocks.  Most of the rocks are just rocks. . . I dont have the patience for it myself.  But for some folks sifting through all those predictions and charts is half the fun.  To each their own I guess.  Me, I just hope I can find an analyst or two I can actually trust, otherwise I would just be throwing darts blindfolded.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}