{
  "id": "topic_5465623",
  "title": "Charles-Tim",
  "author": "Charles-Tim",
  "created_time": "September 04, 2023, 01:53:42 PM",
  "content": "The link is about the state of web3 perception around the world:https://consensys.io/insight-report/web3-and-crypto-global-survey-2023#05-crypto-awarenessParticipants: 15000Age group: 18-65Languages: 9Under table of contents, the fifth (number 5) is about crypto awareness. You can click on it if it is only what that interest you. QuoteAlthough cryptocurrencies keep appearing in the media and the public sphere, do people really understand what they are? In general, there is a very high level of awareness about cryptocurrencies: 92% of respondents globally have heard about them. 50% of respondents stated that they have heard about them, and also understand what they are. The proportion of respondents who affirm they understand what cryptocurrencies are is much higher in Nigeria (78%), South Korea (63%), South Africa (61%) Brazil (59%), and India (56%), while being much lower in Indonesia and Japan, with only 1 in 3 saying they know what crypto is.The proportion of respondents who affirm they understand what cryptocurrencies are is much higher in Nigeria (78%) while those that have heard about bitcoin and other cryptocurrencies in Nigeria is 99%. I have once commented before on a post on this local board some months ago that people in my street know what bitcoin is. This is not a surprise for me. But I think this might not be accurate enough if the survey is taken in a rural area along, I am not certain.What is your take on this?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5465623",
  "comments": [
    {
      "author": "SmartGold01",
      "created_time": "September 04, 2023, 02:16:08 PM",
      "body": "Quote from: Charles-Tim on September 04, 2023, 01:53:42 PMI have once commented before on a post on this local board some months ago that people in my street know what bitcoin is. This is not a surprise for me. But I think this might not be accurate enough if the survey is taken in a rural area along, I am not certain.What is your take on this?I wouldn't be surprised about Nigeria, this is to show level of unemployment rate is in this our country as I believe to know that the percentage of Nigeria being so highly is purely the cause of no job so, amongst the youth trying to survive through bitcoin, which is often said to be ( bitcoin trading,  bitcoin investment, and bitcoin mining) I think those words are very common in our country. Believe me or not, I still have this thinking that about 1 tenth of our population are yet to discover Bitcointalk forum and imagine how here could be flooded if they found out.Still I can say those countries that knows less or heard less about bitcoin are presumed to be mostly occupied with their job at work place, meaning they had no interest in bitcoin or something similarly, those who are venturing recently are those who just developed passion and love for it otherwise I don't think they are much interested into bitcoin and cryptocurrency at large. From the statistics or data accumulated above, I am too sure that if the survey was carried out again or presented again we could have much higher number that it is now. From my local street I have heard of lot of people talking about bitcoin including our local and international musician talking of Bitcoin in their music songs and it's corresponding currencies, so I want to say we may have much higher volume in my opinion.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jegileman",
      "created_time": "September 05, 2023, 11:42:48 AM",
      "body": "Quote from: Charles-Tim on September 04, 2023, 01:53:42 PMThe proportion of respondents who affirm they understand what cryptocurrencies are is much higher in Nigeria (78%) while those that have heard about bitcoin and other cryptocurrencies in Nigeria is 99%. Dis statistics don show say Nigerians dey very updated with d happenings around the world and dem dey always look out for opportunities wry go make dem get source of income since d government no wan dey do well for dat aspect. D only problem be say most of dem no get resources to know more about dis cryptocurrency wry dem don hear about.QuoteI have once commented before on a post on this local board some months ago that people in my street know what bitcoin is. This is not a surprise for me. But I think this might not be accurate enough if the survey is taken in a rural area along, I am not certain.Dat one na true sha. Since for naija, some rural areas no really dey know wetin dey sup for city, dem no fit know about d crypto awareness. Even d people wey take dis survey, I dey sure say na people wey dey urban areas give dem feedback like dat. Even as crypto awareness don dey Nigeria wella, e never still reach 99% of people wey don hear about am before.QuoteWhat is your take on this?The statistics wey you present above no go get too much opposition because of the source wey you get am from. Wetin surprise me na im be say those countries wey dey less aware about cryptocurrency na still oyinbo countries. Me I dey reason say everybody for there go don know about am and most of dem go don dey low key investment for there to. If na low awareness about crypto, I dey expect say e go be one African country and no be Asia.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mate2237",
      "created_time": "September 05, 2023, 02:21:39 PM",
      "body": "Weti you tok na true tok. Charles-Tim I no go lie for you , as I dey like dis I no know weti be web3, so if you go make am clear for me to understand am please do am. I am not ashame to learn. I have checked di meaning to google but not seem to understand that nigga concept. For the cryptocurrency awareness, Nigeria is trying really for my new location, except the children that are in the primary schools and from the post primary school children, all k ow what is bitcoin even though, they are not using it. But for web3, it might be only 0.001% will know it. In the \"Regional discrepancies\"  the two perceptions of Japan, South Korea and other continents mentioned in the article depends on the uses of the cryptocurrencies in the areas. And Japan and South Korea perception on cryptocurrency is not up to the way American using it. Because must of the cryptocurrency laundry cased are coming from America and yet they use cryptocurrency more. So what Japan and South Korea used to stop using cryptocurrency is not clear.In \"data privacy\" Nigeria got 95% which is the highest in the table. Then they believe on the privacy of data in the internet very well. And in the \"cryptocurrency awareness survey\", Nigeria scored 99% which is a plus to the Nigerian cryptocurrency community. And for the web3, as I said, many people have not heard of it so to the 24% of Nigeria is even tried. And in summation to all. All countries at first passed through the same thing with Japan and South Korea perception on cryptocurrency but want is important there is that they should not use that to stop using it. Among all good projects will come out from it and people will benefit from it. The government can regulate and use it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "September 05, 2023, 03:05:46 PM",
      "body": "Quote from: Mate2237 on September 05, 2023, 02:21:39 PMWeti you tok na true tok. Charles-Tim I no go lie for you , as I dey like dis I no know weti be web3, so if you go make am clear for me to understand am please do am. Web3 supposed to be a decentralized means of connecting online, unlike the Web2 that most sites like social media and others are using.I do not know if the Web3 is the decentralized. What I noticed about the present Web3 is that you can use your wallet to connect online as prove that it is actually you. But if you use it to connect to to a malicious site, your wallet will be compromised and your coins on the wallet would be stolen.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hatchy",
      "created_time": "September 06, 2023, 12:36:54 AM",
      "body": "Quote from: SmartGold01 on September 04, 2023, 02:16:08 PM Believe me or not, I still have this thinking that about 1 tenth of our population are yet to discover Bitcointalk forum and imagine how here could be flooded if they found out. that's Is very true. I too also had same taught some time ago after joining Bitcointalk. The percentage of Nigerians who knows about Bitcointalk is very low. I haven't seen anyone around me who knows the website and for some reasons I think it's best if few Nigerians knows about Bitcointalk. The reason would be that some Nigeria finds a way to make bad names out of everything. If you look now on Bitcointalk some of the most recognized senior and legendary members are from Nigeria and this is giving our country a good name. If we have more Nigerias on Bitcointalk they might end up jeopardizing other peoples reputation here ,so I think it's for the best.On the other hand, Nigeria is one of the top countries whose citizens has decided to resolve to other source of income Because the rate of poverty is at its peak and up running.  Sometime when you ask a casual person about Bitcoin, they give it definitions out of what they've heard not what they know. A lot of people has described Bitcoin in different ways either as scam, but most especially the youth sees Bitcoin as a way to elevate them selves from poverty. It's very certain that there's are still people who haven't heard about it or even if they've heard, they still don't have the full story.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SmartGold01",
      "created_time": "September 06, 2023, 09:03:36 PM",
      "body": "Quote from: Hatchy on September 06, 2023, 12:36:54 AMQuote from: SmartGold01 on September 04, 2023, 02:16:08 PM Believe me or not, I still have this thinking that about 1 tenth of our population are yet to discover Bitcointalk forum and imagine how here could be flooded if they found out.On the other hand, Nigeria is one of the top countries whose citizens has decided to resolve to other source of income Because the rate of poverty is at its peak and up running.  Sometime when you ask a casual person about Bitcoin, they give it definitions out of what they've heard not what they know. A lot of people has described Bitcoin in different ways either as scam, but most especially the youth sees Bitcoin as a way to elevate them selves from poverty. It's very certain that there's are still people who haven't heard about it or even if they've heard, they still don't have the full story.They only gives out an answer that seems not reliable because of there poor mentality or lack of knowledge towards bitcoin and it's progression.But I can say they are only seeing the negatives aspect of it knowing that lots of people had used it for malicious activities which gives it a bad representation towards the general public, again here is a place of strick rules and if we have more our Nigerians trooping in I doubt the rules can easily swiped them off as I know too well that they are impatient, so this forum doesn't really belong to such class of people or persons that's why today, I guess people finds it difficult copping around this forum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ever-young",
      "created_time": "April 19, 2024, 08:54:28 AM",
      "body": "For this stuff wey dey called cryptocurrency, person no supposed enter am just like that without knowing the things involve that is the risks and the benefits involved and what it requires u to do first before agreed of joining because this thing na if u no get mind no join o, because this one na matter of mind, because of some kind things wey go dey happen on ur way and no be wetin go just make person rich overnight o, na small small u dey push am dey go and e go dey experience ups and downs, if person ask me say mk I advice am or lecture am about crypto, I get plenty things to talk mk I no hear say u no tell me this part o and also e good mk seminar about crypto dey no be only for people wey won start new even some people wey don dey inside already no still understand, so seminar go mk dem understand more better and e go put dem through too. Also e good too to dey associate with people wey don already know how far, because the more u dey dey close to them, the more u go dey learn and dey get idea too.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kelward",
      "created_time": "April 19, 2024, 03:07:42 PM",
      "body": "E no de surprise me wen I hear say Nigerians de top di list for anything in the world, because we no de carry last, so for dis crypto awareness matter, evendo say na oyibo get di technology and na dem be di originators of crypto coins, as naija people don see say profit de am, na to dominate am. Our Nigerian economy suppose give everybody sense to de search for anything wey de give money, so I believe say na im go make crypto awareness go de popular especially among our youths, unto say no job and dem gats survive. Dem say poverty de give talent and hunger go make you to search for survival means, so na we follow dem get crypto now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Proty",
      "created_time": "April 19, 2024, 04:35:39 PM",
      "body": "Crptocurrency is becoming popular among Nigerians youth but there still people living in Nigeria that doesn't know what crypto is, that is why if they see someone that cash out they begin to look at de person like someone who is into cyber crimes ( Yahoo-yahoo).I believe with time it will gain more popularity were by both the educated and uneducated will know wat crpto is all about. Even parents especially the uneducated will be able to know what crypto is.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DubemIfedigbo001",
      "created_time": "April 20, 2024, 06:49:45 AM",
      "body": "Quote from: Hatchy on September 06, 2023, 12:36:54 AM that's Is very true. I too also had same taught some time ago after joining Bitcointalk. The percentage of Nigerians who knows about Bitcointalk is very low. I haven't seen anyone around me who knows the website and for some reasons I think it's best if few Nigerians knows about Bitcointalk. The reason would be that some Nigeria finds a way to make bad names out of everything. If you look now on Bitcointalk some of the most recognized senior and legendary members are from Nigeria and this is giving our country a good name. If we have more Nigerias on Bitcointalk they might end up jeopardizing other peoples reputation here ,so I think it's for the best.I still think a good level of sensitization and awareness will go a long way to straighten up people joining the forum to behave rightly. It all depends on their mentors in the forum. I believe if the newbies are given proper orientation, they would not misbehave or engage poorly in the forum activities. Hiding the Intel is not going to help our local board. I release as much information about the forum and its activities to my friends and this crypto enthusiasts I meet regularly (apart from how much I earn from signature campaigns weekly). I think bitcoin adoption is a collective duty to  all of us here and I've not seen a learning medium about bitcoin or cryptocurrency in general that bests this forum and I think its a good fate I had by knowing about the forum and as such, everybody deserves inclusion in the moving train. Although I do take my time to properly explain the  rules of engagement to all my recruits and follow them up strictly in their early days until I'm sure they're good contributors. Having more good contributors would boost the quality of our local board and will encourage more adoption in our dear country.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cityhunter34",
      "created_time": "June 13, 2024, 07:05:15 AMLast edit: August 14, 2024, 08:14:18 AM by Cityhunter34",
      "body": "Quote from: Proty on April 19, 2024, 04:35:39 PMCrptocurrency is becoming popular among Nigerians youth but there still people living in Nigeria that doesn't know what crypto is, that is why if they see someone that cash out they begin to look at de person like someone who is into cyber crimes ( Yahoo-yahoo).I believe with time it will gain more popularity were by both the educated and uneducated will know wat crpto is all about. Even parents especially the uneducated will be able to know what crypto is.I think you're right because just as you have said earlier cryptocurrency is popular among Nigerians youth but although just like as will used to said that ignorance is a disease to some many of  our youth because most of them normally feel that we that are into cryptocurrency are doing illegal business and any time that they see you Cash out they we being seeing you as a yahoo person without noing that their are so many ways to make money online.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mr.right85",
      "created_time": "June 13, 2024, 07:27:39 AM",
      "body": "E get slogan way them dem dey use for we country to qualify a particular region way be the Warri people and that slogan be say, “Warri no dey carry last”. When you con decide to look on a wide range way be country, you go agree with me say, Nigerians no dey carry last. Them no dey full for anything.E shock me say, even as CR7 through en partnership with Binance so dey plan release NFT way e go sell and make money for the crypto industry, na once DAVIDO go bring out en own Coin to use archive some SOL from Netigens. Na so the awareness dire reach. Not so long ago, even churches carry religion con Dey archive for the crypto industry, Dey accept tithes and offerings.The awareness for this our part of the world Dey very high. With the little technology way we get, everybody Dey fine way to become self employed, an entrepreneur or even cef, to become CEO only for the online. Nobody get money for that office space or shop rent of a thing. The few way no fit be YouTuber, no ft trade FX or no get talent enough for skit, them don carry two hands hold crypto. Why? Them just wan survive the hardship and watin them sabi, them Dey teach others. So, e no hard to believe that 99% for the survey, even with the challenges way government Dey give people way Dey the industry. Na why Naija be major market, Naija to the word.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}