{
  "id": "topic_5453978",
  "title": "gordonics.com",
  "author": "gordonics.com",
  "created_time": "May 25, 2023, 10:39:23 AMLast edit: July 03, 2023, 01:36:50 PM by gordonics.com",
  "content": "I think it is very difficult to start a lending business here without a credible account.I've been thinking about doing something like this for a long time.I suppose the idea of offering small loans without guarantees (they are small amounts) to users with good credibility is the only way.Not to newbies in any case ...To be clear: I haven't started any loan services in this thread.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5453978",
  "comments": [
    {
      "author": "AB de Royse777",
      "created_time": "May 25, 2023, 11:34:07 AM",
      "body": "Quote from: gordonics.com on May 25, 2023, 10:39:23 AMI think it is very difficult to start a lending business here without a credible account.I've been thinking about doing something like this for a long time.I suppose the idea of offering small loans without guarantees (they are small amounts) to users with good credibility is the only way.Not to newbies in any case ...When you are lending to someone you need them to get back to you and pay the debt. It's an unknown place, if they never come back then have no option to chase them. For a newbie, not just newbie an old member but does not have much earning (reputation and contribution) from the community has no lose if they never log back to the account after taking your money. As a lender ultimately you lose your money.I have been in lending business and I can assure you that this is not a profitable business at all. One or two bad borrower will take everything from you that you were able to make (profit) from the entire year. Even you will lose money from your principal too.Without a collateral never think of a lending business.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Timelord2067",
      "created_time": "May 25, 2023, 01:26:57 PM",
      "body": "Insert sound effects of car skidding then crashing through the \"road ends\" sign followed by a whistling sound as Wile E. Coyote hurtles to a cataclysmic crash below.Quote from: gordonics.com on May 25, 2023, 10:39:23 AMI think it is very difficult to start a lending business here without a credible account.Code:Date Registered:  2018-02-02, 00:22:35Posts:  27 in 18 topicsQuote from: gordonics.com on May 25, 2023, 10:39:23 AMI've been thinking about doing something like this for a long time.Code:5/9/2023 2:55:39 PM  woke upQuote from: gordonics.com on May 25, 2023, 10:39:23 AMI suppose the idea of offering small loans without guarantees (they are small amounts) to users with good credibility is the only way.You've just spent the last day or two berating others now you want to offer up your services as a lender?  What's the catch?Quote from: gordonics.com on May 25, 2023, 10:39:23 AMNot to newbies in any case ...I'm just going to place this here for future reference:",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gordonics.com",
      "created_time": "May 25, 2023, 01:45:52 PM",
      "body": "Yes, I've been a member for a long time, but for other reasons.I \"woke up\" with this idea only recently and I'm trying to understand if it's possible.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DireWolfM14",
      "created_time": "May 25, 2023, 01:59:53 PM",
      "body": "Quote from: gordonics.com on May 25, 2023, 01:45:52 PMYes, I've been a member for a long time, but for other reasons.I \"woke up\" with this idea only recently and I'm trying to understand if it's possible.No one cares about the age, activity, or rank of your account if you are the one taking the risks.  Just don't be a creep, and you'll be able to conduct business without issue.  Look at the other \"newbies\" offering loans recently; many of them are suspected of pretend to give loans to themselves to feign activity and trust.  It's obvious and untrustworthy.Non-secured loans (without collateral) are all up to you, make sure to only give those out to trusted individuals that are unlikely to abscond with your money.  If you want to offer secured loans, make sure to contract with a trusted escrow provider.  Obviously you need to trust the escrow agent, and so does the borrower.  If you expect people to send their collateral directly to you, that makes you look like a scammer waiting for an opportunity.  This will change as you gain rank and activity, and the community starts to trust you.  But you must be patient, it's not going to happen over-night, or even within a few months.  It may take years.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FatFork",
      "created_time": "May 25, 2023, 02:11:03 PM",
      "body": "Quote from: gordonics.com on May 25, 2023, 01:45:52 PMYes, I've been a member for a long time, but for other reasons.If a member has been inactive for a significant amount of time, it can raise concerns as to whether they are the original owner of the account or if they are using a disposable alt account, particularly in the case of newbie accounts.Quote from: gordonics.com on May 25, 2023, 01:45:52 PMI \"woke up\" with this idea only recently and I'm trying to understand if it's possible.Sure, it's definitely possible to start a lending service as a newbie without a reputation, but you gotta think about it from the borrower's perspective. Why would they choose to borrow from you and risk their collateral when they have more established lenders to choose from? And if you offer a service without collateral, how will you protect yourself from potential scammers? It's important to consider these factors before starting a lending service.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gordonics.com",
      "created_time": "May 25, 2023, 04:45:29 PM",
      "body": "I believe an escrow is the only way to secure me and my counterpart for a newbie account.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Magoo8",
      "created_time": "June 09, 2023, 11:02:04 PM",
      "body": "If you escrow money then why do you need a loan?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DireWolfM14",
      "created_time": "June 10, 2023, 01:47:08 AM",
      "body": "Quote from: Magoo8 on June 09, 2023, 11:02:04 PMIf you escrow money then why do you need a loan?If you're bullish on Bitcoin, i.e. you don't want to sell your stash but you need some $USD right now, it's a good way to leverage your bitcoin.  Many lenders have started to offer stablecoin loans, so that may prompt someone to ask for a loan secured by bitcoin as collateral.  Conversely, if you own and are bullish on an alt-coin, but need some bitcoin you could do the same with ETH (for example) as collateral, and borrow BTC.As you've likely noticed, most of the borrowers who are granted loans are well established members who are granted relatively small loans without collateral.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GH2022",
      "created_time": "June 23, 2023, 07:58:34 PM",
      "body": "Quote from: gordonics.com on May 25, 2023, 10:39:23 AMI think it is very difficult to start a lending business here without a credible account.I've been thinking about doing something like this for a long time.I suppose the idea of offering small loans without guarantees (they are small amounts) to users with good credibility is the only way.Not to newbies in any case ...Sounds good.I had been thinking of doing something similar one day soon - a smaller loan service with Crypto with collateral up to £50.Hope your idea takes off!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ps34",
      "created_time": "June 23, 2023, 11:09:22 PM",
      "body": "GH2022 talk with me if your going to do a loan service   give me your contact details so we can discuss have collateral if needed thanks !",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GH2022",
      "created_time": "June 24, 2023, 11:46:04 AM",
      "body": "PS34, I certainly will if I can send messages (as a newbie, I'm not sure that I have those privileges at the moment..)If I can then we'll have a chat and arrange something.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Timelord2067",
      "created_time": "June 24, 2023, 12:23:03 PMLast edit: June 24, 2023, 02:08:58 PM by Timelord2067",
      "body": "Quote from: GH2022 on June 24, 2023, 11:46:04 AMPS34, I certainly will if I can send messages (as a newbie, I'm not sure that I have those privileges at the moment..)If I can then we'll have a chat and arrange something.What could go wrong? 🤔Code:Date Registered:  2020-01-25, 02:15:11 ps34Date Registered:  2020-01-27, 13:30:53 Magoo8Date Registered:  2023-06-20, 08:05:16 GH2022*edit* Misread You've already been scammed Your \"mate\" was scammed and you haven't been on the Forum for a week.Quote from: GH2022 on June 22, 2023, 07:40:57 PMDon't trade on Symlix or Paxful.Serious - mate lost £50 to a scammer on the latter.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ps34",
      "created_time": "June 24, 2023, 11:09:39 PM",
      "body": "timelord don't you get tired of those false accusations? because i am !  your telling lies  without backing this up with ANY proof shame  really",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GH2022",
      "created_time": "June 25, 2023, 10:08:25 PM",
      "body": "Whilst I welcome and appreciate Timelord's concerns about safety, I will do any trade on my terms (if I decide to go down that road) and it's up to people interested to accept the terms or not - respect has to be mutual and the understanding has to be there too as well as trust.At least that way I retain control whilst also allowing the person I deal with the freedom to have a loan accepted.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gordonics.com",
      "created_time": "June 26, 2023, 09:44:31 AM",
      "body": "Quote from: Magoo8 on June 09, 2023, 11:02:04 PMIf you escrow money then why do you need a loan?I don't need a loan. I offer money.But I'm not in hurry with this project. I can wait and learn here.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "KaosanRoad",
      "created_time": "June 28, 2023, 01:42:04 AM",
      "body": "Quote from: gordonics.com on June 26, 2023, 09:44:31 AMQuote from: Magoo8 on June 09, 2023, 11:02:04 PMIf you escrow money then why do you need a loan?I don't need a loan. I offer money.But I'm not in hurry with this project. I can wait and learn here.I think you doing 100% right, im gonna try follow what you do, sit back and observe and learn until I feel I can walk myself.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "papundekli22",
      "created_time": "June 28, 2023, 08:42:46 PM",
      "body": "the public loan request form is=> Loan Amount : 0,0032855375237955055 BTC (100$)=> My address : 3AaCZHvhu4FZAkVh3t9wPnpqJuktx345yq=> repayment amount : 0,004435475657123933 BTC (135$)=> date for repayment : 28.07.2023=> link of you profile : https://bitcointalk.org/index.php?action=profile;u=%20830783=> Your collateral [/b]: If it possible i choose no collateral option if not then i have NFT collections as collateral or my profile i can use like collateralThans a lot i waiting for transactionWaiting for your reply have a nice dayBest Regards Papundekli22",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gordonics.com",
      "created_time": "June 29, 2023, 08:31:06 AMLast edit: June 29, 2023, 09:55:39 PM by Mr. Big",
      "body": "Quote from: papundekli22 on June 28, 2023, 08:42:46 PMthe public loan request form is=> Loan Amount : 0,0032855375237955055 BTC (100$)=> My address : 3AaCZHvhu4FZAkVh3t9wPnpqJuktx345yq=> repayment amount : 0,004435475657123933 BTC (135$)=> date for repayment : 28.07.2023=> link of you profile : https://bitcointalk.org/index.php?action=profile;u=%20830783=> Your collateral [/b]: If it possible i choose no collateral option if not then i have NFT collections as collateral or my profile i can use like collateralThans a lot i waiting for transactionWaiting for your reply have a nice dayBest Regards Papundekli22Money sent. This is my first loan, so I'm still a bit slow.Also, re-check the amount received.Some clarifications on this thread: I have not started a loan service, so don't ask me for money, I must first understand how this simple loan will go.This is still just an experiment to understand the dynamics of the system.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "HedgeFx",
      "created_time": "June 29, 2023, 01:59:20 PM",
      "body": "Just my 2 cents: I think you were in too much of a hurry to grant this loan.I hope I screw up, but the guy had a neg trust released by shasan .Furthermore, if you go to check the subject's latest activities, you will see that he has received very few merits, which means that  it is an account that is worth little or nothing. I hope I'm wrong and I wish you all the best.Quote from: gordonics.com on June 29, 2023, 08:49:45 AMSome clarifications on this thread: I have not started a loan service, so don't ask me for money, I must first understand how this simple loan will go.This is still just an experiment to understand the dynamics of the system.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}