{
  "id": "topic_5398356",
  "title": "axesmith",
  "author": "axesmith",
  "created_time": "May 12, 2022, 06:06:54 PM",
  "content": "Hi.I started in bitcoin 1 year and a half ago, and i bought a few satoshis (not a lot, just to know what crypto is all about). I had it in the exchange i bought them from, but recently i decided to transfer them to a software wallet. I started learning about wallets and i came to this problem.RIGHT NOW, I HAVENT MOVED MY SATOSHIS FROM THE EXCHANGE YET. ALL I HAVE DONE IS \"playing\", \"testing\" IN TESTNET (BTC for testing).1. I made a test wallet in GREEN WALLET for android. i got some btc from the faucets. I made 2 wallets: one with 24 word seed and other with 12 word seed. i tried sending some satoshis from one to the other and viceversa. EVERYTHING OK.2. I made a test wallet in WASABI WALLET for windows 10 (with a passphrase (lets say the passphrase is Helloworld) and a 12 word seed). i got some btc from the faucets, and i tried sending some satoshis between the wallets from WASABI and GREEN wallet. EVERYTHING OK.3. PROBLEM 1: I tried to recover (back up) a wallet from green wallet (Android) in wasabi wallet (pc) by  recover wallet > write the 12 words seed and i couldnt (0.00BTC in the wallet \"recovered\". Then i tried to recover the other green wallet in wasabi wallet with the 24 words seed. Same problem:0.00 BTC. What is my mistake? Is it even possible to recover a green wallet in wasabi wallet (i mean, to recover a wallet in a different wallet like wasabi?). PD: I made sure both wasabi and green wallet were in tesnet mode.4. PROBLEM 2: In wasabi, i deleted the folders of all my wallets and tried to recover them by recover wallet > write 12 words + passphrase and after 1 hour, wasabi wallet hasnt shown me my wallet, only a blue cicle with spots like if it was \"loading something\". i dont know whats happening. Whats the way of deleting a wallet from wasabi wallet and how can i recover it with the 12 seed +- passphrase???If i understood it well, with the 12 seeds +- the passphrase i could recover any wallet, even if i lost the computer or the smartphone i had the wallet.I WANT TO TRY EVERYTHING IN THE TESTNET before trying in the real btc chain...Remember that im new!",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5398356",
  "comments": [
    {
      "author": "Cookdata",
      "created_time": "May 12, 2022, 06:56:51 PM",
      "body": "Can I ask you a question? what is the essence of these many wallets you installed, security-wise is not safe for your bitcoins, you are just still on the Testnet and it is all confusing. If your intention was to get bitcoin out of an exchange, a single wallet on your PC is okay, with that you can generate as many as many wallet addresses you want but a hardware wallet should be your plug.Now, back to your wallets, it is possible there is a mixed up in your passphrase, you should know that there is no passphrase that is wrong. There is a difference between Helloworld and helloworld, you will get two different wallet results with that two passphrases. If you are sure that the faucet transaction you did on the testnet was successful, try and view the wallet address on the testnet explorer if the bitcoin you sent is there, then from there you can check where there is mixed up in your recovery + passphrase",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Stalker22",
      "created_time": "May 12, 2022, 08:41:28 PM",
      "body": "Quote from: axesmith on May 12, 2022, 06:06:54 PM3. PROBLEM 1: I tried to recover (back up) a wallet from green wallet (Android) in wasabi wallet (pc) ~I admit that I have never used Blockstream Green wallet (if that is what you mean), but if I understood their help pages correctly, their wallet uses special Multisig Shield protection so it is impossible to recover the same wallet with a different software.Take a look at this:QuoteAlthough Blockstream Green uses industry standards for recovery phrase generation, wallets created in Blockstream Green using Multisig Shield cannot be restored on other wallet software. This is due to the unique multisig security model used for Multisig Shield wallets. ~Note: If you enter your recovery phrase from a Multisig Shield wallet into a different wallet app that supports BIP39, the recovery phrase may be accepted by the app, but it will generate an empty single-signature wallet. Any transactions sent from or received to this wallet will be completely separate from your Blockstream Green wallet.https://help.blockstream.com/hc/en-us/articles/900001550443-What-standard-does-Blockstream-Green-use-for-its-recovery-phrase-Quote from: axesmith on May 12, 2022, 06:06:54 PMIf i understood it well, with the 12 seeds +- the passphrase i could recover any wallet, even if i lost the computer or the smartphone i had the wallet.Theoretically yes, but you have to first check if the software in which you generate the wallet uses the standard way of deriving key pairs from a 12/24 word seed phrase (BIP39). BIP39 is the most common standard used for seed phrases but some wallets use their own standards or industry standard derivatives.You can find some useful information here: https://walletsrecovery.org/Quote from: axesmith on May 12, 2022, 06:06:54 PMI WANT TO TRY EVERYTHING IN THE TESTNET before trying in the real btc chain...Remember that im new!That is a good decision, and do not be shy about asking questions - we were all new once.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "khaled0111",
      "created_time": "May 12, 2022, 09:02:36 PMLast edit: May 12, 2022, 09:14:51 PM by khaled0111",
      "body": "When you created the your green wallet did you choose \"singlesig\" wallet or the other choice \"Multisig Shield\" wallet?If you've chosen the first one then you should be able to recover your wallet using any wallet app that supports the bip39 standard (I just tried it using Electrum and it worked).If you've chosen the second option (Multisig Shield) then this will create a 2of2 multisig wallet and the 12 or 24 words seed you have won't be enough to recover your wallet on any other wallet app.If you have chosen the first option and still can't recover your wallet on an app that supports bip39, then make sure you selected the right addresses format (p2wpkh or p2wpkh-p2sh) because green wallet will create two accounts for these two formats (segwit and legacy).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "axesmith",
      "created_time": "May 12, 2022, 09:23:14 PM",
      "body": "First of all. Thanks everyone for answering!!!Ok, i understand that i cant recover a Blockstream wallet in a wasabi wallet.I keep having these 2 problems:1) Recovering a wasabi wallet: I deleted my wasabi wallets by deleting the folders and when i try to recover them by Recover wallet > type the 12 seed words + passphrase (e.g. Helloword -being carefull with the capital letters etc-.), I CANT recover the wallet. i get a circle of blue spots \"loading\". (IMAGE, in the right \"prueba 5 (2)\" means \"try 5 (2)\", which means that im trying to recover (2) the \"try 5\". You can see the circle of blue spots.).  EDIT: AFTER 1 HOUR OR MORE, THE CIRCLE OF BLUE SPOTS DISSAPEARED AND I RECOVERED MY TESTNET SATOSHIS!!!!!!!!!!Another question about problem 1: I´ve seen that i can \"recover\" a wallet if i copy the \"wallet folder\" that i deleted back into the wasabi wallet folder (walletwasabi > client > wallets), with no problems. So... Would it be a good idea to \"copy\" the wallet folder in a USB and keep it??? could i recover the wallet by just copying the folder in another walletwasabi > client > wallets??? what am i doing by copying the wallet folder??? 2) I´m looking for a wallet to keep my satoshis with this features: i can write my 12 seed words (with or without a passphrase) in a paper in my house and be able to recover the wallet in another computer and eventually in another wallet. because i´m afraid about what would happen if i have my satoshis in wasabi wallet and eventually wasabi \"dissapears\", or \"Blockstream green wallet\" dissapears. I need to be able to recover my satoshis from the wasabi wallet in another wallet. Another question: what happens if i want to recover a wasabi wallet with passphrase in another wallet? do they all have the password/passphrase available??I just want a software wallet to have my satoshis for an undetermined period of time (im wont move them in months or years). I thought about wasabi wallet, but what happens with the bitcoin core wallet? is it easy??",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hosemary",
      "created_time": "May 12, 2022, 09:24:11 PM",
      "body": "Quote from: khaled0111 on May 12, 2022, 09:02:36 PMIf you have chosen the first option and still can't recover your wallet on an app that supports bip39, then make sure you selected the right addresses format (p2wpkh or p2wpkh-p2sh) because green wallet will create two accounts for these two formats (segwit and legacy). This is probably the problem. Wasabi wallet only generates native segwit addresses. If OP has created a wallet with different address format in green wallet, it can't be recovered in Wasabi. Quote from: axesmith on May 12, 2022, 09:23:14 PMAnother question: what happens if i want to recover a wasabi wallet with passphrase in another wallet? do they all have the password/passphrase available??You can use electrum. It allows you to import a BIP39 seed phrase with a passphrase.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "axesmith",
      "created_time": "May 12, 2022, 09:29:58 PM",
      "body": "Quote from: hosseinimr93 on May 12, 2022, 09:24:11 PMQuote from: khaled0111 on May 12, 2022, 09:02:36 PMIf you have chosen the first option and still can't recover your wallet on an app that supports bip39, then make sure you selected the right addresses format (p2wpkh or p2wpkh-p2sh) because green wallet will create two accounts for these two formats (segwit and legacy). This is probably the problem. Wasabi wallet only generates native segwit addresses. If OP has created a wallet with different address format in green wallet, then it can't be recovered in Wasabi. I dont know what a lot of these things mean but i suspected that that could be the problem. One of the blockstream wallet that i created had testnet btc in \"2 places\": \"Segwit account\" and \"legacy account 1\". When i tried to recover that wallet from blockstream wallet in wasabi wallet with the 12 word seed, thet wallet recovered had 0.00 BTC.I finally could recover a wasabi wallet back in wasabi wallet after deleting it. Do u know of another wallet with testnet available so i can try to recover a wallet from wasabi in that \"other\" wallet?Thx",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Stalker22",
      "created_time": "May 12, 2022, 10:53:45 PM",
      "body": "Quote from: axesmith on May 12, 2022, 09:29:58 PMDo u know of another wallet with testnet available so i can try to recover a wallet from wasabi in that \"other\" wallet?ThxElectrum is a good option, in my opinion. Here is a short tutorial on how to run Electrum in testnet mode:Quote from: gagux123 on April 06, 2022, 06:47:04 AMYou need to download the latest version of Electrum wallet https://electrum.org/#downloadFirst step, after finishing downloading and installing the wallet, you need create a shortcut for electrum.exe;In the shortcut properties, under “destination”, add to the end of the location “--testnet”.Okay, now we can access the testnet through electrum. Thus, when we access the wallet through the shortcut, we will enter the testnet, through the normal link on the mainnet.~",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "khaled0111",
      "created_time": "May 12, 2022, 11:03:56 PM",
      "body": "Quote from: axesmith on May 12, 2022, 09:23:14 PMI just want a software wallet to have my satoshis for an undetermined period of time (im wont move them in months or years). I thought about wasabi wallet, but what happens with the bitcoin core wallet? is it easy??Bitcoin core is definitely one of the most secure software wallets but I don't think it is suitable for new users. Besides, you will have to download the full blockchain (more than 400 Gb).Electrum is a good choice but keep in mind that the mobile version doesn't have a testnet mode. So to make your tests you have to install it on a desktop device first.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Marnix",
      "created_time": "May 15, 2022, 09:10:32 AM",
      "body": "Quote from: axesmith on May 12, 2022, 09:23:14 PM1. I´ve seen that i can \"recover\" a wallet if i copy the \"wallet folder\" that i deleted back into the wasabi wallet folder (walletwasabi > client > wallets), with no problems. So... Would it be a good idea to \"copy\" the wallet folder in a USB and keep it??? could i recover the wallet by just copying the folder in another walletwasabi > client > wallets??? what am i doing by copying the wallet folder??? 2) I´m looking for a wallet to keep my satoshis with this features: i can write my 12 seed words (with or without a passphrase) in a paper in my house and be able to recover the wallet in another computer and eventually in another wallet. because i´m afraid about what would happen if i have my satoshis in wasabi wallet and eventually wasabi \"dissapears\", or \"Blockstream green wallet\" dissapears. I need to be able to recover my satoshis from the wasabi wallet in another wallet. Another question: what happens if i want to recover a wasabi wallet with passphrase in another wallet? do they all have the password/passphrase available??I just want a software wallet to have my satoshis for an undetermined period of time (im wont move them in months or years). I thought about wasabi wallet, but what happens with the bitcoin core wallet? is it easy??1. Check this out for how and why you'd want to backup the wallet file https://docs.wasabiwallet.io/FAQ/FAQ-UseWasabi.html#how-do-i-back-up-my-wallet-file2. Wasabi disappearing in the next coming years is unlikely, but if for some reason you're not able to use Wasabi anymore your 12 words + passphrase can be used to recover your funds in an other wallet (using the same standard). Most other wallets allow you to enter a passphrase.Do you have any unanswered/remaining questions? If so, please highlight them out",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}