{
  "id": "topic_5517712",
  "title": "headingnorth",
  "author": "headingnorth",
  "created_time": "November 10, 2024, 03:39:51 PMLast edit: November 10, 2024, 03:49:58 PM by headingnorth",
  "content": "Let me see if I understand this correctly of how Shamir backup works. So you have to find several people you trust, and each one is supposed to hold a part of your backup key or seedphrase?Even if you trust each of these people, how do you know one or more of them won't accidentally lose it or forget about it and throw it away? Then you are screwed.They make it sound so easy to just find a few people who are willing to take on such a major responsibility for you. Bitcoin is supposed to be about avoiding counterparty risk and avoid having to trust third parties. But with Shamir backup you are introducing several third parties into the equation and entrusting them with your life savings.Yeah sure you can trust your mom or dad, but how can you trust them not to accidentally lose their secret part of the phrase? Which is very easy to do. Especially with older people who tend not to understand crypto at all or usually think of it as a scam and want nothing to do with it. Of course they will want you to explain to them exactly what you are asking them to do, which likely they won't ever understand even after you explain it. They barely understand how to use a computer. It just sounds like a dumb idea to me. When it comes to crypto you can't trust anyone but yourself.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5517712",
  "comments": [
    {
      "author": "Hatchy",
      "created_time": "November 10, 2024, 03:47:33 PM",
      "body": "I haven't heard of this before, sounds similar to mulitsig but then sharing your seed with others in piece?.. well I won't recommend it though.. as a someone who really want to enjoy the freedom of a decentralized system and being your own bank.. it's best to keep your keys your self. I don't see how difficult it is to store your seed offline and in a place where only you will be aware of..",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "November 10, 2024, 03:52:41 PM",
      "body": "SSS has pros and cons, One of its advantages is that it is safer than using a single wallet seed. In the case of the seed, if someone can access it, they will get your money, while in SSS, they may need 2 thresholds out of3 shares.But in any case, the multi-sig wallet is better and gives you multiple options according to what you want.There are many detailed discussions here: - https://bitcointalk.org/index.php?topic=5467891.msg62893823#msg62893823 - https://bitcointalk.org/index.php?topic=5433064.msg61545852#msg61545852 - https://bitcointalk.org/index.php?topic=5328606.msg56726302#msg56726302",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "November 10, 2024, 03:54:45 PM",
      "body": "Quote from: headingnorth on November 10, 2024, 03:39:51 PMSo you have to find several people you trust, and each one is supposed to hold a part of your backup key or seedphrase?You can keep the backups yourself. Quote from: headingnorth on November 10, 2024, 03:39:51 PMEven if you trust each of these people, how do you know one or more of them won't accidentally lose it or forget about it and throw it away? Then you are screwed.Assuming you generate 3 shares for it, you can set it in a way that only 2 is required for the recovery. You can even make it 1 for the recovery but no purpose of having 3 shares in this regard. I just use it to explain. Quote from: Hatchy on November 10, 2024, 03:47:33 PMI haven't heard of this before, sounds similar to mulitsig but then sharing your seed with others in piece?.. well I won't recommend it though.. as a someone who really want to enjoy the freedom of a decentralized system and being your own bank.. it's best to keep your keys your self. I don't see how difficult it is to store your seed offline and in a place where only you will be aware of.. You can keep all the shares yourself. But it can help just like multisig but it is different from multisig.Reputed members on this forum like gmaxwell does not recommend it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "headingnorth",
      "created_time": "November 10, 2024, 03:55:55 PM",
      "body": "Quote from: Hatchy on November 10, 2024, 03:47:33 PMI haven't heard of this before, sounds similar to mulitsig but then sharing your seed with others in piece?.. well I won't recommend it though.. as a someone who really want to enjoy the freedom of a decentralized system and being your own bank.. it's best to keep your keys your self. I don't see how difficult it is to store your seed offline and in a place where only you will be aware of.. Yes Shamir backup is similar to multisig. But with multisig I believe you need two or more of the keys to execute any transactions, or just sending transactions. But with Shamir you only need the backup keys to restore your wallet, ie: your hardware wallet becomes lost, stolen or destroyed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "November 10, 2024, 04:02:07 PM",
      "body": "Quote from: headingnorth on November 10, 2024, 03:55:55 PMYes Shamir backup is similar to multisig. But with multisig I believe you need two or more of the keys to execute any transactions, or just sending transactions.Assuming it is 2-of-3 multisig. If the wallet has been setup already, only 2 keys are required for making transactions. But if you want to recover the wallet, you will need the 3 keys.Quote from: headingnorth on November 10, 2024, 03:55:55 PMBut with Shamir you only need the backup keys to restore your wallet, ie: your hardware wallet becomes lost, stolen or destroyed. Not necessarily all the backups. I explained that above. It depends on the number of sheets that you set when you generate the shares. You can generate 5 shares and only set it to require 3 for the recovery.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mia Chloe",
      "created_time": "November 10, 2024, 04:02:39 PM",
      "body": "Quote from: Hatchy on November 10, 2024, 03:47:33 PMI haven't heard of this before, sounds similar to mulitsig but then sharing your seed with others in piece?.. well I won't recommend it though.. as a someone who really want to enjoy the freedom of a decentralized system and being your own bank.. it's best to keep your keys your self. I don't see how difficult it is to store your seed offline and in a place where only you will be aware of.. Although I really haven't heard of this method of seed storage, I think from what the OP is explaining it is different from how the regular multi sig wallets work. From the name, multi Sig wallets literally split the signature, meaning both Parties would have to sign a transaction from that wallet for it to be valid and have a transaction hash. Anyways with that being said, I really don't fancy the idea of splitting your seed phrase into different pieces and storing them in different places. Well  one of my reasons is because say you split  a 12 word seed into 4 places then you end up losing one piece to probably naturally disaster, you would  then need to go through a stressful recovery process to brute force what you have left.I think duplicating and storing in safe places is a better option.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "headingnorth",
      "created_time": "November 10, 2024, 04:03:32 PM",
      "body": "Quote from: Charles-Tim on November 10, 2024, 03:54:45 PMQuote from: headingnorth on November 10, 2024, 03:39:51 PMSo you have to find several people you trust, and each one is supposed to hold a part of your backup key or seedphrase?You can keep the backups yourself. Quote from: headingnorth on November 10, 2024, 03:39:51 PMEven if you trust each of these people, how do you know one or more of them won't accidentally lose it or forget about it and throw it away? Then you are screwed.Assuming you generate 3 shares for it, you can set it in a way that only 2 is required for the recovery. You can even make it 1 for the recovery but no purpose of having 3 shares in this regard. I just use it to explain. Quote from: Hatchy on November 10, 2024, 03:47:33 PMI haven't heard of this before, sounds similar to mulitsig but then sharing your seed with others in piece?.. well I won't recommend it though.. as a someone who really want to enjoy the freedom of a decentralized system and being your own bank.. it's best to keep your keys your self. I don't see how difficult it is to store your seed offline and in a place where only you will be aware of.. You can keep all the shares yourself. But it can help just like multisig but it is different from multisig.Reputed members on this forum like gmaxwell does not recommend it.Well if you keep all the shares yourself that may be a better way to do it. Just distribute shares in a bunch of different places. Then you could avoid having a single point of failure where you have the whole key in one place and it gets lost or forgotten, or stolen.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hosemary",
      "created_time": "November 10, 2024, 05:03:16 PMLast edit: November 10, 2024, 05:21:39 PM by hosseinimr93",
      "body": "Quote from: headingnorth on November 10, 2024, 03:39:51 PMSo you have to find several people you trust, and each one is supposed to hold a part of your backup key or seedphrase?No, that's not how a shamir Backup should be used. You should keep all the shares by yourself. You create a SLIP39 seed phrase, so that a single seed phrase is not enough for a thief.If you want to have a wallet in which transactions are authorized by multiple people, go for a multi-signature wallet. Quote from: headingnorth on November 10, 2024, 03:55:55 PMYes Shamir backup is similar to multisig. But with multisig I believe you need two or more of the keys to execute any transactions, or just sending transactions. Take note that if you have a shamir backup, there are still 1 signature required for any transaction you make.When you create a m of n multi-signature wallet, there are m signatures required for making transactions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kelward",
      "created_time": "November 10, 2024, 05:39:21 PM",
      "body": "Quote from: Hatchy on November 10, 2024, 03:47:33 PMI haven't heard of this before, sounds similar to mulitsig but then sharing your seed with others in piece?.. well I won't recommend it though.. as a someone who really want to enjoy the freedom of a decentralized system and being your own bank.. it's best to keep your keys your self. I don't see how difficult it is to store your seed offline and in a place where only you will be aware of.. I believe that I've heard something related to Shamir, before now, but I'm getting the full meaning of how it functions in this thread. Like you i won't recommend it either, I'd rather hide my seed phrase in different locations by myself, instead of putting it in the custody of others. True decentralization is about having total control of your keys, that is the essence of the freedom over your coins. What if the people that you entrusted with your keys loses it or decides to connive and steal your coins? The Shamir option is ok if the individuals can be trusted but it's better to hide the keys in different locations by yourself.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NeuroticFish",
      "created_time": "November 10, 2024, 05:43:41 PM",
      "body": "Quote from: headingnorth on November 10, 2024, 03:39:51 PMLet me see if I understand this correctly of how Shamir backup works. So you have to find several people you trust, and each one is supposed to hold a part of your backup key or seedphrase?You've missed the part that the \"parts\" are overlapping, so you always need a smaller number than all (eg 2 of 3) to get your coins.Plus, it's not that you have to give it to people. For example it's advised to keep your seed phrase in multiple places, geographically separated (so in case of war or natural catastrophe you're still good). While doing this with the full seed is a risk, you can do this with parts of SSS. It can be in safe, it can be at somebody you know, it can be buried underground or hidden in walls, it doesn't matter. The point is to avoid the risk that if one of the backups is getting onto wrong hands, you are not screwed (which can happen when you backup full seed).As said, SSS has pluses and minuses. Maybe other 2-3 people you give the backups can team up against you, for example. However, you can also use it smart, for your benefit. I am not super pro or anti SSS; I leave it up to you. But it's certainly not \"dumb\".",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Saint-loup",
      "created_time": "November 10, 2024, 05:52:52 PMLast edit: November 10, 2024, 06:11:45 PM by Saint-loup",
      "body": "Quote from: headingnorth on November 10, 2024, 03:39:51 PMLet me see if I understand this correctly of how Shamir backup works. So you have to find several people you trust, and each one is supposed to hold a part of your backup key or seedphrase?Even if you trust each of these people, how do you know one or more of them won't accidentally lose it or forget about it and throw it away? Then you are screwed.They make it sound so easy to just find a few people who are willing to take on such a major responsibility for you. Bitcoin is supposed to be about avoiding counterparty risk and avoid having to trust third parties. But with Shamir backup you are introducing several third parties into the equation and entrusting them with your life savings.Yeah sure you can trust your mom or dad, but how can you trust them not to accidentally lose their secret part of the phrase? Which is very easy to do. Especially with older people who tend not to understand crypto at all or usually think of it as a scam and want nothing to do with it. Of course they will want you to explain to them exactly what you are asking them to do, which likely they won't ever understand even after you explain it. They barely understand how to use a computer. It just sounds like a dumb idea to me. When it comes to crypto you can't trust anyone but yourself. You shouldn't forget the main point of the Shamir's Secret Sharing Scheme, you don't need ALL the shares generated to get back your seed or your private key, you can choose and set up to only need 2 parts among a total of 5 different shares to get back your secret for example, hence even if 3 shares are missing, you will able to get back your seed. In addition, you can rather easily find on internet objects or systems, allowing to hide USB sticks, documents, money, jewels or other precious things. So your seedphrase will only be lost, if the object is thrown away.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Stalker22",
      "created_time": "November 10, 2024, 06:30:37 PM",
      "body": "Quote from: headingnorth on November 10, 2024, 04:03:32 PMWell if you keep all the shares yourself that may be a better way to do it. Just distribute shares in a bunch of different places. Then you could avoid having a single point of failure where you have the whole key in one place and it gets lost or forgotten, or stolen.As already explained in previous comments, Shamir secret sharing lets you do more than you thought.  You should read up on it a bit more to see what I mean.  The main thing is, you dont have to keep all the shares for yourself.  Think about this - say you keep them all, and somehow you lose them. Its done deal, secrets gone.   There is no perfect backup method. Each has its own advantages and disadvantages. The whole purpose of this Shamir scheme is spreading out the risk.  Keep some shares for yourself give a couple to people you trust like friends or family, maybe stick a few in a safe place somewhere.  That way, even if you lose one or two shares or someone gets their hands on them, you can still get your secret back.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Synchronice",
      "created_time": "November 10, 2024, 08:42:26 PM",
      "body": "Quote from: headingnorth on November 10, 2024, 03:39:51 PMLet me see if I understand this correctly of how Shamir backup works. So you have to find several people you trust, and each one is supposed to hold a part of your backup key or seedphrase?You don't have to find several people if you don't want to. Shamir lets you to create multiple backups, it's up to you how you'll use them. You can create 2, 3 or more backups and save them yourself in one, two, three places or wherever you want and however you want.Quote from: headingnorth on November 10, 2024, 04:03:32 PMWell if you keep all the shares yourself that may be a better way to do it. Just distribute shares in a bunch of different places. Then you could avoid having a single point of failure where you have the whole key in one place and it gets lost or forgotten, or stolen.Shamir backup is not the best strategy, everything is individual. It might be best solution for you, worst solution for others but it's 100% guaranteed that if you keep your shares in the same place, it loses its whole meaning and value, i.e. now you have a single point of failure and there is no point in having 2 or more backups. The whole point of Shamir backup is to avoid that issue and save them in a way that in emergency case, for example, 2 out of 3 will be available.It's up to you where and how you'll save them and it's better to not talk about that details but you can find many creative ideas.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PrivacyG",
      "created_time": "November 10, 2024, 11:56:30 PM",
      "body": "My biggest issue with Shamir Backups is that I do not Trust people and I would NEVER feel safe if anybody had a piece of my Seed, even if I knew they could not steal my Bitcoin with that one piece alone.The friends I have most Trust in know each other.  And I think it is hard not to have close friends you Trust the most who know each other because I at least typically spend time in the same environment as they do.  This means they could at any given time plan to screw me up and secretly share their pieces of my Seed.I have had so many coincidences happen in this life time to think this would ever be safe.  I rather put my Seed somewhere and find it vanished than know I put pieces of my Seed in the hands of somebody else and Trust I would some day get it back.  What if they say no?  What if they go crazy mentally?  What if they die and their family does not want to interact with me?  There are so many variables that I would rather simply not.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackBoss_",
      "created_time": "November 11, 2024, 02:50:34 AM",
      "body": "Quote from: headingnorth on November 10, 2024, 03:39:51 PMLet me see if I understand this correctly of how Shamir backup works. Seed spliting for a wallet backup is terrible idea.Shamir is a method like this, and I dislike it and don't use it for my wallet backup. Some Bitcoin experts warn us about this bad backup method too with many shortcomings in this method.Shamir's Secret Sharing shortcomings.Bitcoin Q&A: Why is Seed Splitting a Bad Idea?If you want to back up your wallet rightly, readHow to back up a seed phrase?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kotajikikox",
      "created_time": "November 11, 2024, 06:38:51 AM",
      "body": "Quote from: headingnorth on November 10, 2024, 03:39:51 PMLet me see if I understand this correctly of how Shamir backup works. So you have to find several people you trust, and each one is supposed to hold a part of your backup key or seedphrase?This is my first time hearing about this and apparently it is done so that there is no single point of attack or failure. So if one part of your seedphrase it lost or taken, your funds will still stay safe because they never know the whole thing so they can't access it either way. It is quite confusing though. If one person loses a part of your seedphrase then how will you access your funds?Seems unnecessary to me. I am in support of distributing your back up keys but not to people who are also vulnerable of losing it. At the end of the day, you only should have whole access to any information valuable to you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "davis196",
      "created_time": "November 11, 2024, 07:06:10 AM",
      "body": "QuoteLet me see if I understand this correctly of how Shamir backup works.So you have to find several people you trust, and each one is supposed to hold a part of your backup key or seedphrase?I've never heard anything about this Shamir backup. It sounds really dumb. Sharing parts of a key phrase with several people is pointless.The only way to keep your seed phrase is you to write it down on a piece of paper and keep it somewhere safe. The whole point of Bitcoin/crypto is to never trust anyone, but yourself. No friends and family. No companies and third parties. Trust only yourself and be your own bank.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Plaguedeath",
      "created_time": "November 11, 2024, 08:22:01 AM",
      "body": "I read shamir backup is relying on dependent, so if you use Trezor to generate it, you need have the Trezor in order to access your coins. While in multisig, you don't have to worry if you lost your Trezor, you can still able to access it as long as you have the signatures. https://www.reddit.com/r/TREZOR/comments/1d2yp6r/comment/l650upi/For me it's not safe to use shamir backup.I would say seed phrase + passphrase is safer, you can give your seed phrase to criminal when you're under attack or hacker drain your wallet, but the main one (seed phrase + passphrase) is still safe.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hosemary",
      "created_time": "November 11, 2024, 09:49:12 AM",
      "body": "Quote from: Plaguedeath on November 11, 2024, 08:22:01 AMI read shamir backup is relying on dependent, so if you use Trezor to generate it, you need have the Trezor in order to access your coins. You don't have to use Trezor for recovering your wallet from shamir backup. Electrum supports shamir backup too.To import shamir shares in electrum, click \"options\" on \"Enter Seed\" window and select \"SLIP39 seed\".",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}