{
  "id": "topic_5459375",
  "title": "montreal1",
  "author": "montreal1",
  "created_time": "July 11, 2023, 03:56:55 AM",
  "content": "If I have a paper wallet that has .001 btc, could this be worthless in the future because when I sweep the funds the fee is so high?How about if I have a paper wallet with .005 btc, assuming it was funded with 5 separate transactions of .001trying to learn more and educate myself about the technical side of Bitcoin and sweeping and utxos and how high fees in the future could be an issue for small paper wallets like this Thank you",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5459375",
  "comments": [
    {
      "author": "Helena Yu",
      "created_time": "July 11, 2023, 05:06:36 AM",
      "body": "I don't understand what's the question you're want to ask because you're already answer it yourself.The higher your inputs, the higher you need to pay the fee. If Bitcoin price is really expensive and there are a lot people traded their coins, obviously the on chain transaction fee would be high. This situation was similar like Bitcoin on chain get attacked with BRC-20 tokens where people choose to wait until the mempool is already back to normal, there was no solution, not sure what will be in the future.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "paid2",
      "created_time": "July 11, 2023, 06:08:54 AM",
      "body": "QuoteIf I have a paper wallet that has .001 btc, could this be worthless in the future because when I sweep the funds the fee is so high?Yeah, fees go up and down, depending on how busy the mempool is. They used to be high, but are now low again, between 5 and 9 sat/vB. For example, right now :So yes, having for example 0.001 BTC is not a problem, especially if you take into account that you can use a wallet to spend your BTC which will let you choose the fees. With Electrum, for example, you can choose a low fee and just wait for the mempool to empty out a little if they're ever high when you will want to move your BTC. Your paper wallet would be far from worthless.QuoteHow about if I have a paper wallet with .005 btc, assuming it was funded with 5 separate transactions of .001In that case, you should generate a bech32 address to keep fees as low as possible, and in the event that you have a lot of incoming transactions on the same address, you can always consolidate this when fees are low. It's sending yourself the total amount of BTC on one address to another address you own - like that you will have only 1 incoming transaction on your fresh BTC address. (But I admit that the paper wallet doesn't make it the most straightforward to consolidate).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NeuroticFish",
      "created_time": "July 11, 2023, 06:10:48 AM",
      "body": "The tx fee is not always high, so a paper wallet of .001BTC should not become worthless as a result of the fees, you'll just need to find the best moment to spend it. However, that is by far not a problem yet. Even if it's 5 inputs, it's still OK. But the higher the number of inputs, the sooner it'll get you into troubles.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SeriouslyGiveaway",
      "created_time": "July 11, 2023, 06:42:26 AM",
      "body": "Quote from: montreal1 on July 11, 2023, 03:56:55 AMIf I have a paper wallet that has .001 btc, could this be worthless in the future because when I sweep the funds the fee is so high?I believe in future it will still be usable.QuoteHow about if I have a paper wallet with .005 BTC, assuming it was funded with 5 separate transactions of .001 BTCIf each 0.001 BTC is good to use for a transaction or sweep, you can use each of 0.001BTC UTXO for one transaction. You can consolidate those 5 UTXOs to one, when transaction fee is low in BTC, and use it for your transaction to another person, purchase or wallet sweep.Quotetrying to learn more and educate myself about the technical side of Bitcoin and sweeping and utxos and how high fees in the future could be an issue for small paper wallets like this Transaction fee is expensive usually because of high price of Bitcoin and high fee rate. If you hold your bitcoin, you will not feel hurry to move your coin when transaction fee is high and you can move it when fee is lower.https://bitinfocharts.com/comparison/bitcoin-transactionfees.html#3yAverage Bitcoin transaction fee is about 0.000032 BTC ($0.97) but it can be higher or lower some times. 0.000032 BTC is very smaller than 0.001 BTC.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "July 11, 2023, 06:56:03 AM",
      "body": "Bitcoin today price is $30000, 0.001 BTC equals to $30. What if bitcoin price increased increased to $100000, 0.01 BTC will become $100 in price. As bitcoin price appreciates, the value of the coin you hold appreciates. This is what you should think of, not transaction fee to make your bitcoin to become worthless which is not possible.The more the inputs, the more the transaction fee. If you want lower transaction fee in the future and you have many inputs, you can consolidate the inputs when bitcoin price is low.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hosemary",
      "created_time": "July 11, 2023, 07:41:26 AM",
      "body": "Quote from: montreal1 on July 11, 2023, 03:56:55 AMHow about if I have a paper wallet with .005 btc, assuming it was funded with 5 separate transactions of .001What type of address are you using? As you worry about transaction fee, it may worth mentioning that you should use segwit addresses, so that you can make cheaper transactions.A legacy transaction including 1 input and 1 output has the (virtual) size of around 190 vbytes and it would decrease to around 110 vbytes, if you use segwit addresses. A legacy transaction including 5 input and 1 output has the (virtual) size of around 780 vbytes and it would decrease to around 380 vbytes, if you use segwit addresses.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Z390",
      "created_time": "July 11, 2023, 09:18:03 AM",
      "body": "Even if the gas fee or transaction fees are higher in future, have you forgotten that the value of Bitcoin and Ethereum doesn't stay in one place forever? So why did you ask that your 0.001BTC would be useless in future? Here is what I believe could happen.1. Your 0.001BTC will surely be worth more than it is now, still worthless? 2. The transaction fee of Bitcoin can indeed go higher because of high value and ordinals but, that's just in few days of few weeks of massive pump, you can still sell later to avoid massive high transaction fee. 3. Transaction fees are always adjustable too, you don't have to pay what your Bitcoin wallet is asking you, always use mempool to check the lowest amount fee you can pay.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "July 11, 2023, 11:49:45 AM",
      "body": "Quote from: montreal1 on July 11, 2023, 03:56:55 AMIf I have a paper wallet that has .001 btc, could this be worthless in the future because when I sweep the funds the fee is so high?Paper wallet is a generic term.You might be talking about a single address (single private/public key pair) or a seed (with billions of addresses)If you have 12-24 words, it is a seed. So you don't have to worry about and you may transact between your generated addresses freely.If you have only one address, you will have different inputs/outputs from the same address, if you send funds to another address your paper wallet becomes worthless",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Coyster",
      "created_time": "July 11, 2023, 12:59:44 PM",
      "body": "Quote from: SeriouslyGiveaway on July 11, 2023, 06:42:26 AMTransaction fee is expensive usually because of high price of Bitcoin and high fee rate. Transaction fee is never expensive or cheap because of the price of Bitcoin, the inputs and outputs you have on a particular address is what ascertains the transaction fee that you will pay. If the mempool is also clogged it will increase the transaction fee you have to pay for fast transaction confirmation.Quote from: Z390 on July 11, 2023, 09:18:03 AMTransaction fees are always adjustable too, you don't have to pay what your Bitcoin wallet is asking you, always use mempool to check the lowest amount fee you can pay. And run the risk of waiting for days/weeks for confirmation, or it may never even be confirmed and will be dropped out of the mempool if it is clogged.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Popkon6",
      "created_time": "July 11, 2023, 05:28:10 PM",
      "body": "Here are the different types of wallets you might want to know about paper wallets. 12/24 word phrase wallet has phrases that you are located in small safe. But this paper wallet will have no value if you make bitcoin transactions.The reason Bitcoin transaction fees are high is that as the price of Bitcoin increases, more transactions occur and transaction fees increase.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cricktor",
      "created_time": "July 11, 2023, 05:29:57 PM",
      "body": "There are higher risks for a paperwallet than future transaction fees that we all don't know how they will evolve. Fees are high when there's competition for space in blocks, when mempools are filled, when there's need for too many transactions than Bitcoin's pace can handle.If I were you, I'd stay away from paperwallets. There's a lot to take care of to create them securely, keep them secure and don't get scammed by shady paperwallet generators.Then there is the UTXO transaction model: you have to spend an UTXO as input fully. If the amount of your input UTXO is too large for your transaction output(s), you have to pay back the \"change\" as an additional transaction output back to the paperwallet address (or some other address of a wallet that you own).Don't make the mistake to forget a change output if your input is too large for your transaction, especially with paperwallets. You may end up paying way too much transaction fee, because transaction fee equals inputs minus outputs!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LoyceV",
      "created_time": "July 11, 2023, 05:46:06 PM",
      "body": "Quote from: montreal1 on July 11, 2023, 03:56:55 AMIf I have a paper wallet that has .001 btc, could this be worthless in the future because when I sweep the funds the fee is so high?Yes and no:It's possible, and in 2017 we've seen times when 0.001 BTC wasn't enough to send a transaction with 1 input.But even if you can't send your funds at some moment in the future, that doesn't mean it's worthless. You'll just have to wait for fees to go down again.QuoteHow about if I have a paper wallet with .005 btc, assuming it was funded with 5 separate transactions of .001That's almost the same: the transaction will be almost 5 times larger, and so will the fee. You should read Fees are low, use this opportunity to Consolidate your small inputs!.Quotetrying to learn more and educate myself about the technical side of Bitcoin and sweeping and utxos and how high fees in the future could be an issue for small paper wallets like thisThere is no upper limits for fees.Quote from: LoyceV on January 30, 2018, 10:34:05 AMExamplesomeone made this 4909 bytes transaction with 33 inputs and 510 Satoshis/byte fee. After paying fees, his 0.033BTC turned into only 0.0079539BTC.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hosemary",
      "created_time": "July 11, 2023, 07:15:39 PMLast edit: July 11, 2023, 08:06:22 PM by hosseinimr93",
      "body": "Quote from: LoyceV on July 11, 2023, 05:46:06 PMQuoteHow about if I have a paper wallet with .005 btc, assuming it was funded with 5 separate transactions of .001That's almost the same: the transaction will be almost 5 times larger, and so will the fee. You should read Fees are low, use this opportunity to Consolidate your small inputs!.Just to be more accurate:If sending address(es) are legacy, the fee would be around 4 times bigger.If sending address(es) are nested segwit, the fee would be around 3.7 times bigger.If sending address(es) are native segwit, the fee would be around 3.5 times bigger. I assumed that there is no change address and there's exactly 1 output.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LoyceV",
      "created_time": "July 12, 2023, 07:43:48 AMLast edit: July 15, 2023, 01:39:13 PM by LoyceV",
      "body": "Quote from: hosseinimr93 on July 11, 2023, 07:15:39 PMIf sending address(es) are legacy, the fee would be around 4 times bigger.I was thinking of uncompressed legacy, the fee will be even closer to times 5 bigger.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nc50lc",
      "created_time": "July 12, 2023, 09:47:15 AM",
      "body": "Quote from: montreal1 on July 11, 2023, 03:56:55 AMIf I have a paper wallet that has .001 btc, could this be worthless in the future because when I sweep the funds the fee is so high?For your 100000sat to be all spent as fee, you're looking at a fee rate of around 900sat/vB (SegWit 1in-1out transaction)As long as the future wont be stuck at that ridiculous fee rate range, your paper wallet wont be worthless.If the future's mempool condition is your concern, then it depends on the future implementations and adaptation of the second layer.If things will be the same, it wont be too different from today's condition, if not only a bit higher/lower.If the fiat price is your concern, then the price of the fee will increase with your paper wallet's price.In this case, you're worrying for nothing because for example, a 400sat absolute fee will still be 400sat even if Bitcoin's price increase, only its fiat equivalent.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Doan9269",
      "created_time": "July 12, 2023, 12:04:19 PM",
      "body": "Quote from: montreal1 on July 11, 2023, 03:56:55 AMIf I have a paper wallet that has .001 btc, could this be worthless in the future because when I sweep the funds the fee is so high?There's nothing impossible with what you hodl when it comes to bitcoin, maybe over time when the bitcoin market would have surge higher than expected, it would have worth more amount than you left there, you may also make some additional deposits to be able to withdraw or send them together after you would have been using it Quote from: montreal1 on July 11, 2023, 03:56:55 AMHow about if I have a paper wallet with .005 btc, assuming it was funded with 5 separate transactions of .001They don't make deposit or withdrawal charges like the banks do when using a bitcoin wallet, you would have known the rate you will be charged as transaction fee before making the transaction,",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cricktor",
      "created_time": "July 13, 2023, 11:30:43 AM",
      "body": "For Bitcoiners it's an important skill to learn how to setup an appropriate transaction fee based on your needs how fast you want your transaction to be confirmed. It can make quite some difference if you want your transaction to be confirmed with the next block, withing the next few blocks or more or if you don't care and you're fine that your transaction may take some days until it gets confirmed.I don't like overpaying fees, especially when there's some mempool congestion. For fee estimation I like to look at https://mempool.space, https://bitcoinexplorer.org or https://mempool.jhoenicke.de/#BTC,24h,weight (the last one needs some understanding to interpret properly based on your needs).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jon_Hodl",
      "created_time": "July 18, 2023, 10:55:52 PM",
      "body": "Quote from: montreal1 on July 11, 2023, 03:56:55 AMIf I have a paper wallet that has .001 btc, could this be worthless in the future because when I sweep the funds the fee is so high?It shouldn't matter if you are using a wallet that gives you manual control over the miner fee that you use to sweep the paper wallet. You can set it low and then use RBF to slowly increase the miner fee if it sits in the mempool for too long for your liking. If a miner feels like it is worth it to add it to a block, then they will add it or you will need to bump the fee. Furthermore, we are likely to see more scaling methods put downward pressure on the cost of sending bitcoin on-chain. There are currently about 10 methods for scaling bitcoin in practice with multiple more in the works from various companies and FOSS projects. With so much innovation taking place, I am not worried about fees getting too high for making on-chain payments within the next decade or two.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cryptoababe",
      "created_time": "July 19, 2023, 04:56:37 PM",
      "body": "I think paper wallet or no paper wallet, the fee is general and it depends on how congested the network is. Bitcoin network is Decentralised. So, it doesn't choose which kind of wallet you are using.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}