{
  "id": "topic_5454074",
  "title": "BVeyron",
  "author": "BVeyron",
  "created_time": "May 26, 2023, 09:21:18 AM",
  "content": "Все больше испуганных  криптанских контор бегут с территории USA. По понятным и неизбежно появляющимся  причинам.Судя по всему все таки  слабоват лоббизм  американского  айти сектора по сравнению с банковским лобби. Вот и очередные довольно авторитетные парни близнецы испугались очередного наезда и судебных разборок и намылились дублировать свою штаб квартиру.Gemini выбрала Ирландию для второй штаб-квартирыforklogИ сколько ещё криптанских контор намылились сливаться с земли обетованной?Предлагаю постить новости по релокации криптанов из USA. По моему это хорошая тенденция.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5454074",
  "comments": [
    {
      "author": "BVeyron",
      "created_time": "June 28, 2023, 02:59:19 PM",
      "body": "Сальвадор старается стянуть к себе может не штаб квартиры, то хотя бы офисы крупных криптовых компаний.Вот некоторые, кто уже там стал появляться.Bitfinex - с этим понятно кто.Strike Finance -  Ethereum ориентированная  компания  который позволяет пользователям брать кредиты и предоставлять залог на платформу без централизации и контроляGaloy - Биткойн ориентированная банковская инфраструктура  для организации и запуска корпоративных приложений Bitcoin и Lightning.Ibex - инфраструктурная биткоин компания специализирующаяся на LNTiankii —  некастодиальная  платформа для продавцов, ориентированная на создание финансовых продуктов следующего поколения, с ориентацией на Биткоин и на его основе децентрализованной денежной сети по всему миру.Может это пока ещё не монстры криптоиндустрии, но уже и не плешевые дешевенькие стартапы.Интересная страна и политика тоже интересная",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Smartprofit",
      "created_time": "June 28, 2023, 03:18:24 PM",
      "body": "Quote from: BVeyron on June 28, 2023, 02:59:19 PMСальвадор старается стянуть к себе может не штаб квартиры, то хотя бы офисы крупных криптовых компаний.Вот некоторые, кто уже там стал появляться.Bitfinex - с этим понятно кто.Strike Finance -  Ethereum ориентированная  компания  который позволяет пользователям брать кредиты и предоставлять залог на платформу без централизации и контроляGaloy - Биткойн ориентированная банковская инфраструктура  для организации и запуска корпоративных приложений Bitcoin и Lightning.Ibex - инфраструктурная биткоин компания специализирующаяся на LNTiankii —  некастодиальная  платформа для продавцов, ориентированная на создание финансовых продуктов следующего поколения, с ориентацией на Биткоин и на его основе децентрализованной денежной сети по всему миру.Может это пока ещё не монстры криптоиндустрии, но уже и не плешевые дешевенькие стартапы.Интересная страна и политика тоже интересная Bitfinex это как раз монстр криптоиндустрии.  Bitfinex это знаменитый Картель, организация, которая производит эмиссию Tether (USDT).Это один из трёх основных столпов криптоиндустрии (наряду с Binance и Coinbase).Организация - это очень могущественная, и характерно, что она пытается застолбить место в Сальвадоре, а также в других южноамериканских странах.Такими темпами южноамериканские страны действительно станут очень значимы в сфере криптоиндустрии. Так и появляются на карте Земли богатые и успешные страны. Достаточно просто отслеживать тренды и не упускать возможности. В своё время Аргентина и США имели абсолютно равные стартовые возможности. Однако в результате, в Аргентине людей с вертолётов скидывали, а США стала самой могущественной страной в мире. И такие метаморфозы ещё будут и не раз.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BVeyron",
      "created_time": "June 28, 2023, 03:30:51 PM",
      "body": "Quote from: Smartprofit on June 28, 2023, 03:18:24 PMBitfinex это как раз монстр криптоиндустрии.  Bitfinex это знаменитый Картель, организация, которая производит эмиссию Tether (USDT). Да, конечно.Тем более сегодня где то попадалось, что в трех странах Латинской Америки при посредничестве Bitfinex организованы платформы для Р2Р платежей.Наверное как сливаться стал Локалбиткоин, так и свято место пусто не бывает.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BVeyron",
      "created_time": "September 04, 2023, 10:16:16 AM",
      "body": "Похоже я один чего то пишу в теме про релокацию юрлиц   Но это вообще то понятно. Тема была актуальна в связи с известными всем событиями а сейчас как то поутихла, стухла.Наступил какой то баланс. Так изредка что то звучит типа что Данон уходит, китайские автопроизводители типа Чанган приходят. Но это речь о филиалах, материнские офисы как были так и есть.Мне кажется что сложившейся баланс локации ещё очень порадовал правительства нескольких стран бывшего СССР. IT в общем то платят налоги, жрут энергию на майнинг и исправно платят за неё (а попробуй, не заплати   ). Восток дело тонкое  Вообщем ждем-с следующей волны релокации. Только вот не берусь судить в какую сторону она будет.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zasad@",
      "created_time": "September 05, 2023, 11:57:25 AM",
      "body": "В США идет драка за власть между финанстстами и промышленниками, и все высокотехнологичное производство стягивают в США для последующей войны с Китаем. Германия и Франция сильно пострадают из-за своей политики и лишатся дешевого сырья и электроэнергии, а потом станут неконкурентными с США.Новая война будет за рынки Азии, и испортит жижнь местным. Туда все побегут.Релокация из России",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BVeyron",
      "created_time": "September 06, 2023, 06:14:19 PM",
      "body": "Quote from: zasad@ on September 05, 2023, 11:57:25 AMВ США идет драка за власть между финанстстами и промышленниками, и все высокотехнологичное производство стягивают в США для последующей войны с Китаем. Германия и Франция сильно пострадают из-за своей политики и лишатся дешевого сырья и электроэнергии, а потом станут неконкурентными с США.Новая война будет за рынки Азии, и испортит жижнь местным. Туда все побегут.Да я открывая эту тему думал обсуждать не общемировые релокации, с ними как бы все знают что куда стягивает. Хотел  побсуждать ближе к теме - только IT,  и в частности криптовые конторы. Вот один мой знакомый пытался стартапик криптовый сделать где то с год назад в РФ. Вдруг сентябрь 2022 нагрянул, ну вы все знаете что тут началось. Короче  он в Турции. Вот теперь оттуда ищет в РФ ангелов  типа доинвестировать чего то. Вообщем то и немного надо. Но трудно,  лично то никак не перетереть тему, не доехать тоже по известной причине, только на иноземных тусах, где ангелов наших немного, да по видеоконференциями. Вот такая блин хрень например возникает при этой самой релокации.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "csync",
      "created_time": "September 14, 2023, 10:50:12 PM",
      "body": "Quote from: BVeyron on September 06, 2023, 06:14:19 PMQuote from: zasad@ on September 05, 2023, 11:57:25 AMВ США идет драка за власть между финанстстами и промышленниками, и все высокотехнологичное производство стягивают в США для последующей войны с Китаем. Германия и Франция сильно пострадают из-за своей политики и лишатся дешевого сырья и электроэнергии, а потом станут неконкурентными с США.Новая война будет за рынки Азии, и испортит жижнь местным. Туда все побегут.Да я открывая эту тему думал обсуждать не общемировые релокации, с ними как бы все знают что куда стягивает. Хотел  побсуждать ближе к теме - только IT,  и в частности криптовые конторы. Вот один мой знакомый пытался стартапик криптовый сделать где то с год назад в РФ. Вдруг сентябрь 2022 нагрянул, ну вы все знаете что тут началось. Короче  он в Турции. Вот теперь оттуда ищет в РФ ангелов  типа доинвестировать чего то. Вообщем то и немного надо. Но трудно,  лично то никак не перетереть тему, не доехать тоже по известной причине, только на иноземных тусах, где ангелов наших немного, да по видеоконференциями. Вот такая блин хрень например возникает при этой самой релокации.В Турции своеобразный контингент, продуктовые ангелы тут не водятся. Тут водятся те, кто не нацелен на продукт, а на быстрый разовый доход. Много очень скамеров, арбитражников.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BVeyron",
      "created_time": "September 18, 2023, 01:50:28 PM",
      "body": "Quote from: csync on September 14, 2023, 10:50:12 PMQuote from: BVeyron on September 06, 2023, 06:14:19 PMQuote from: zasad@ on September 05, 2023, 11:57:25 AMВ США идет драка за власть между финанстстами и промышленниками, и все высокотехнологичное производство стягивают в США для последующей войны с Китаем. Германия и Франция сильно пострадают из-за своей политики и лишатся дешевого сырья и электроэнергии, а потом станут неконкурентными с США.Новая война будет за рынки Азии, и испортит жижнь местным. Туда все побегут.Да я открывая эту тему думал обсуждать не общемировые релокации, с ними как бы все знают что куда стягивает. Хотел  побсуждать ближе к теме - только IT,  и в частности криптовые конторы. Вот один мой знакомый пытался стартапик криптовый сделать где то с год назад в РФ. Вдруг сентябрь 2022 нагрянул, ну вы все знаете что тут началось. Короче  он в Турции. Вот теперь оттуда ищет в РФ ангелов  типа доинвестировать чего то. Вообщем то и немного надо. Но трудно,  лично то никак не перетереть тему, не доехать тоже по известной причине, только на иноземных тусах, где ангелов наших немного, да по видеоконференциями. Вот такая блин хрень например возникает при этой самой релокации.В Турции своеобразный контингент, продуктовые ангелы тут не водятся. Тут водятся те, кто не нацелен на продукт, а на быстрый разовый доход. Много очень скамеров, арбитражников. Да, это понятно. Я вот и подозреваю, что релокация с моим знакомым сыграла злую шутку. Вероятно турецкая локация как раз и портит все из-за того, что просто такой имидж создан для вообще всего ай ти бизнеса этой страны. Наверное его создание имеет какой то смысл или по крайней мере имело несколько лет назад. Сейчас, как я понимаю, он конечно хочет ещё разок релокнутся на более благодатные земли, но дорого это, как не крути, дороже все равно получается, чем творить оттуда.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BVeyron",
      "created_time": "October 03, 2023, 07:01:20 PM",
      "body": "А вот ведь часть релокантов из РФ отправилась осенью 2022 именно  в Армению. Интересно понять, что там теперь с релокантами. Судя по событиям с Нагорным Карабахом и опять же наплывом эмигрантов, этнических армян на свою историческую родину, что то там будет меняться и для всех остальных приезжих.Или может быть я просто не в курсе событий и там уже не осталось релокантов из РФ?Интересно было бы многим, как я думаю,  если бы кто нибудь в локале написал бы что то по этому поводу, если есть достоверная информация, конечно.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BVeyron",
      "created_time": "October 21, 2023, 01:33:38 PM",
      "body": "Ну, вот  Никто ничего не постит по теме релокации. А ведь наверное в локале имеются те пользователи, что пишут из за пределов. И,  кстати, не морочатся там со всякими ВПН. Я тему то эту открыл чтоб узнать кое-что побольше о местных проблемах  с которыми  сталкиваются ребята,  вынужденные менять пребывание. Вроде Казахстан сейчас более не менее. ? Но не знаю, может и ошибаюсь и там тоже хлопот не оберешься. ?Интересно же кто откуда может писать. И описать свое новое житье бытие.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "csync",
      "created_time": "October 27, 2023, 12:58:37 PM",
      "body": "Quote from: BVeyron on October 21, 2023, 01:33:38 PMНу, вот  Никто ничего не постит по теме релокации. А ведь наверное в локале имеются те пользователи, что пишут из за пределов. И,  кстати, не морочатся там со всякими ВПН. Я тему то эту открыл чтоб узнать кое-что побольше о местных проблемах  с которыми  сталкиваются ребята,  вынужденные менять пребывание. Вроде Казахстан сейчас более не менее. ? Но не знаю, может и ошибаюсь и там тоже хлопот не оберешься. ?Интересно же кто откуда может писать. И описать свое новое житье бытие.Лучше в поиске телеграма указать \"%country_name% чат\", а лучше \"%city_name% чат\", и быстро найдете локальные чаты релокантов, там самая актуальная и свежая информация. Еще полно чатов релокантов на тему крипты, здоровья, недвижки, тусовок, еды. Так это по мне - это наиболее оперативный и достоверный источник информации. Когда лечу в какую-либо страну, мониторю локальные чаты релокантов.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BVeyron",
      "created_time": "November 04, 2023, 01:44:33 PM",
      "body": "Quote from: csync on October 27, 2023, 12:58:37 PMQuote from: BVeyron on October 21, 2023, 01:33:38 PMНу, вот  Никто ничего не постит по теме релокации. А ведь наверное в локале имеются те пользователи, что пишут из за пределов. И,  кстати, не морочатся там со всякими ВПН. Я тему то эту открыл чтоб узнать кое-что побольше о местных проблемах  с которыми  сталкиваются ребята,  вынужденные менять пребывание. Вроде Казахстан сейчас более не менее. ? Но не знаю, может и ошибаюсь и там тоже хлопот не оберешься. ?Интересно же кто откуда может писать. И описать свое новое житье бытие.Лучше в поиске телеграма указать \"%country_name% чат\", а лучше \"%city_name% чат\", и быстро найдете локальные чаты релокантов, там самая актуальная и свежая информация. Еще полно чатов релокантов на тему крипты, здоровья, недвижки, тусовок, еды. Так это по мне - это наиболее оперативный и достоверный источник информации. Когда лечу в какую-либо страну, мониторю локальные чаты релокантов.Отличный совет! Спасибо!И так то совершено правильно перед поездкой за бугор почитать что за проблемы в конкретных местах. Оно конечно так, что сильно отличается ситуация по странам и континентам и это понятно. В целом в связи с такими нашими событиями отношение со стороны местных жителей, как я понимю кардинально поменялось за полтора года. Вот об этом и речь идет, трудно становится нашему брату общаться и ассимилироваться во всяких в прошлом весьма  райских странах. Тут сто раз подумаешь, а надо ли к ним вообще заявляться или ну его нах.  Да для многих выбор то из просто плохого и очень плохого. Это вот и есть самое печальное.Вот примерно про это и хотел в этой теме пообщаться.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Smartprofit",
      "created_time": "November 04, 2023, 02:20:46 PM",
      "body": "Меня многое печалит из происходящего в стране. Тем не менее, я хотел бы отметить, что за 30 лет были достигнуты большие результаты в отношении технологического развития в стране. И даже то, что сейчас всё поворачивается в обратную сторону - всё равно определённый уровень технологического и культурного развития в стране есть и он сохраняется, это надо признать. И у меня большая надежда, что хорошее победит плохое, всё это ретроградство. Хотя и много скептиков вокруг, и у них безусловно тоже есть основания относиться ко всему пессимистично.Я вот недавно слушал видео, там чел брал интервью у людей в Москве на Патриарших прудах. Там был один парень, он долго жил в США, когда его спросили где лучше жить в Москве или в США. Он сказал, что конечно в Москве, потому что США это большая деревня. Или взять, например, Израиль. Многие его сильно хвалили, писали, что медицина там бесплатная отличная, что культурная жизнь, великолепная технологическое развитие и так далее. Но то, что мы сейчас видим, если честно, не очень нравится. Явно Израиль это не та страна, в которой хотелось бы жить. Да и вообще, сейчас любая национальная страна не подходит для проживания. А других, то и мало - Австралия, Новая Зеландия, Канада ...И к Европе уже относишься не так ярко, как раньше, потому что есть понимание, что бюрократия там невероятно мощная, а проблему с беженцами они так и не могут решить. И проблему сохранения своей культуры похоже тоже не могут решить.Про страны бывшего СНГ я и не говорю. У них потенциально все те же проблемы что и у России. Плюс ещё свои особенности.Россия вообще отличная страна, если рассматривать Россию образца двухтысячных годов, например, когда и тяга к технологическому развитию была, умеренный гламур, дружелюбие во внешней политике, - всё же было в общем-то неплохо. И сейчас, по моим наблюдениям, очень многие релоканты возвращаются назад - освоиться в чужой стране очень непросто.России сейчас не хватает прагматизма. Вот написать на знамени слово \"прагматизм\" и идеальная страна получится. Я уже не говорю про этику с моралью, ладно - проехали, но хотя бы прагматиками можно быть?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BVeyron",
      "created_time": "November 07, 2023, 03:44:18 PM",
      "body": "Quote from: Smartprofit on November 04, 2023, 02:20:46 PMРоссия вообще отличная страна, если рассматривать Россию образца двухтысячных годов, например, когда и тяга к технологическому развитию была, умеренный гламур, дружелюбие во внешней политике, - всё же было в общем-то неплохо. И сейчас, по моим наблюдениям, очень многие релоканты возвращаются назад - освоиться в чужой стране очень непросто.России сейчас не хватает прагматизма. Вот написать на знамени слово \"прагматизм\" и идеальная страна получится. Я уже не говорю про этику с моралью, ладно - проехали, но хотя бы прагматиками можно быть?Я вот не столь оптимистино настроен. Страна в целом неплохая,  начальники дрянь , а поэтому до по настоящему неплохой не дотягивает. Нищеты много при том количесиве нефти и прочего газа позорище,  просто мама нетгорюй. Трубу с газом до всех деревень, поселков не довести. Да еще с нищеты брать по 200 тонн и больше, чтоб трубу в дом провести. Это разве не позорище ?А жизнь релоканта и правда тяжела, как я понимаю. Но многие терпят, не возвращаются. По понятным причинам. Да еще прибавить,  что отношение к ним местных стало херовым. Да еще и стычки с такими же из сопредельной страны. Слишком много негатива. Эти люди, что называется \"попали\".  Не жизнь, а выживание!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "witcher_sense",
      "created_time": "November 08, 2023, 03:20:47 AM",
      "body": "Quote from: BVeyron on October 21, 2023, 01:33:38 PMНу, вот  Никто ничего не постит по теме релокации. А ведь наверное в локале имеются те пользователи, что пишут из за пределов. И,  кстати, не морочатся там со всякими ВПН. Я тему то эту открыл чтоб узнать кое-что побольше о местных проблемах  с которыми  сталкиваются ребята,  вынужденные менять пребывание. Вроде Казахстан сейчас более не менее. ? Но не знаю, может и ошибаюсь и там тоже хлопот не оберешься. ?Интересно же кто откуда может писать. И описать свое новое житье бытие.Мне лично термин \"релокант\" кажется уничижетельным, тем более не понятен тот предел времени, когда обычный отпуск в другой стране может считаться релокацией. Вот например, если уехать на пару месяцев и работать оттуда, то можно считать это релокацией? Или для релокации нужно заранее заявить, что ваша конечная цель - это освоиться в новой стране и начать там жить полноценной жизнью? А если не получается, то релокант превращается в возвращенца или еще кого-нибудь? В общем, тут сложности. А насчет вопросов VPN, то здесь надо хорошенько подумать и погуглить прежде чем куда-то релоцироваться. Например, в Турции у вас bitcointalk разве что с туристической симки откроется, а вот с домашнего WiFi вряд ли и там есть список одобренных VPN, которые напрямую контролируются государством. В ОАЭ лучше вообще не упоминать это слово, потому что есть вероятность угодить в тюрьму или получить огромный штраф. В некоторых странах очень активно блокируется протокол OpenVPN, так что тем, кто таким способом подключается к рабочей сети, приходится несладко.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "csync",
      "created_time": "November 08, 2023, 08:20:10 AM",
      "body": "Quote from: witcher_sense on November 08, 2023, 03:20:47 AMА насчет вопросов VPN, то здесь надо хорошенько подумать и погуглить прежде чем куда-то релоцироваться. Например, в Турции у вас bitcointalk разве что с туристической симки откроется, а вот с домашнего WiFi вряд ли и там есть список одобренных VPN, которые напрямую контролируются государством. В ОАЭ лучше вообще не упоминать это слово, потому что есть вероятность угодить в тюрьму или получить огромный штраф. В некоторых странах очень активно блокируется протокол OpenVPN, так что тем, кто таким способом подключается к рабочей сети, приходится несладко.В Турции год назад блокировали сервисы Яндекса, блокчейн ресурсы, порно сайты. Последний год блокировки убрали. Но внезапно заблокировали исходящий 22 порт (с гитом и ssh теперь работать сложнее)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BVeyron",
      "created_time": "November 09, 2023, 05:40:22 PM",
      "body": "Quote from: csync on November 08, 2023, 08:20:10 AMQuote from: witcher_sense on November 08, 2023, 03:20:47 AMА насчет вопросов VPN, то здесь надо хорошенько подумать и погуглить прежде чем куда-то релоцироваться. Например, в Турции у вас bitcointalk разве что с туристической симки откроется, а вот с домашнего WiFi вряд ли и там есть список одобренных VPN, которые напрямую контролируются государством. В ОАЭ лучше вообще не упоминать это слово, потому что есть вероятность угодить в тюрьму или получить огромный штраф. В некоторых странах очень активно блокируется протокол OpenVPN, так что тем, кто таким способом подключается к рабочей сети, приходится несладко.В Турции год назад блокировали сервисы Яндекса, блокчейн ресурсы, порно сайты. Последний год блокировки убрали. Но внезапно заблокировали исходящий 22 порт (с гитом и ssh теперь работать сложнее)Круто, я не знал, что даже такие ресурсы, как гит там блокируют ? Стало быть и наш форум там тоже не идет без впн ? А то я смотрю что-то турецкий локал какой-то довольно дохлый, хотя он и считается одним из крупных в БТТ.Всем известно о великом китайском фаерволе, но судя по тому, что вы пишите еще появился и великий турецкий фаервол. Понятно, что БТТ блокирован в РФ, Китае, Турции, ОАЭ,  наверное в Иране, там вообще круто со всем этим.А интересно в каких еще странах тоже так. Вот например из Гоа можно спокойно сидеть писать свои мысли на форум или тоже индийцы постарались?Кстати мне тоже не нравится слово релокант .Они и правда противное и унизительное. И не было такого слова еще полтора года назад. Придумал же какой-то \"умник\", мать его....",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "witcher_sense",
      "created_time": "November 10, 2023, 05:16:44 AM",
      "body": "Quote from: csync on November 08, 2023, 08:20:10 AMВ Турции год назад блокировали сервисы Яндекса, блокчейн ресурсы, порно сайты. Последний год блокировки убрали. Но внезапно заблокировали исходящий 22 порт (с гитом и ssh теперь работать сложнее)Не слышал про блокировку git или 22 порта, во всяком случае за небольшой промежуток времени нахождения в Турции никаких проблем при подключении не наблюдалось. Возможно, не все провайдеры их блокируют и не во всех регионах. Я пробовал подключаться через Turkcell и Turk Telecom, про остальные не скажу. Еще там есть фишка с блокировкой мобильного телефона по IMEI, после 120 дней нахождения в Турции все не оплатившие специальную пошлину теряют доступ к связи. Но опять же, если не подключаться к местным провайдерам и не светить телефон, то ничего платить не нужно. Насчет стран СНГ еще немного: в Казахстане VPN запрещают, но проблем с доступом ни к каким портам нет, все нужные ресурсы функционируют нормально. В Узбекистане вот все хуже, здесь блокируют UDP порт 1194, иногда приходится запускать VPN ради запуска другого VPN и есть такая же фишка с регистрацией телефона как и в Турции.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "csync",
      "created_time": "November 10, 2023, 02:32:06 PM",
      "body": "Quote from: BVeyron on November 09, 2023, 05:40:22 PMКруто, я не знал, что даже такие ресурсы, как гит там блокируют ? Стало быть и наш форум там тоже не идет без впн ? А то я смотрю что-то турецкий локал какой-то довольно дохлый, хотя он и считается одним из крупных в БТТ.На форуме без VPN сижу с разных провайдеров. 22й порт исходящий только Turk Telecom заблокировал.Есть специальные люди на зарплате, которые популяризируют нужные слова и тезисы: релокант, убежанец, предатель, родина. А также, подменяя и акцентирую причину эмиграции на максимально удобную - мобилизацию, а не на то, что страна в г***не, славяне начали уничтожать славян,  у власти чекисты и репрессии который год идут.Мне больше нравится термин - эвакуация.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}