{
  "id": "topic_5464994",
  "title": "bitmover",
  "author": "bitmover",
  "created_time": "August 29, 2023, 05:43:17 PM",
  "content": "https://livecoins.com.br/bitcoin-dispara-apos-juiz-dar-causa-a-grayscale-contra-a-sec/Quote“Após consideração disso, é ORDENADO e JULGADO que a petição de revisão da Grayscale seja concedida e a ordem da Comissão seja anulada, de acordo com a opinião do tribunal aqui apresentada nesta data.”Logo depois da notícia o bitcoin já está subindo 7%Será que vamos ver o tão aguardado etf , e a grayscale ver seu produto sendo o primeiro etf?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5464994",
  "comments": [
    {
      "author": "Disruptivas",
      "created_time": "August 29, 2023, 06:01:45 PM",
      "body": "Posso ter entendido errado, mas acho que isso não é tanto sobre a aprovação do ETF, mas é da SEC ter considerado que a Grayscale não podia nem pedir pra análise, que a SEC não considerava valida.E a Grayscale entrou na justiça contra essa negativa e agora ganhou, então ela ganhou o direito de submeter o pedido e ser analisado igualmente. Consideraram a posição da SEC arbitrária e ilegal. Mas não sei quanto isso impacta no aparecer favorável ao ETF em si.Agora um comentário aleatório, acho que muitos de vocês já viram Billions né? Fico imaginando as \"personas\" dessas disputas 😲",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "August 29, 2023, 06:04:42 PM",
      "body": "Quote from: Disruptivas on August 29, 2023, 06:01:45 PME a Grayscale entrou na justiça contra essa negativa e agora ganhou, então ela ganhou o direito de submeter o pedido e ser analisado igualmente. Consideraram a posição da SEC arbitrária e ilegal. Mas não sei quanto isso impacta no aparecer favorável ao ETF em si.Parece que impacta diretamente. Olha na infomoneyhttps://www.infomoney.com.br/onde-investir/tribunal-dos-eua-da-vitoria-para-grayscale-e-abre-caminho-para-etf-de-bitcoin-criptomoeda-sobe-5/QuoteUm tribunal federal dos Estados Unidos deu apoio para a Grayscale, maior gestora de ativos digitas do mundo, transformar seu principal fundo de Bitcoin (BTC), o “Grayscale Bitcoin Trust”, em um ETF (fundo negociado em bolsa) à vista da criptomoeda.Um painel de apelações de três juízes em Washington anulou nesta terça-feira (29) uma decisão da Comissão de Valores Mobiliários dos Estados Unidos, a SEC, que impedia a mudança. O regulador pode recorrer.Em 2021, a Grayscale havia enviado para a SEC um pedido para converter seu fundo de investimento em um ETF com exposição direta ao BTC. Em junho de 2022, depois de análise, a SEC rejeitou a proposta, argumentando que tal produto carecia de supervisão adequada para detectar fraudes.Após a negativa, a Grayscale entrou com uma ação para anular a decisão, alegando que existe “evidência substancial avançada” de que seu produto era semelhante aos ETFs de futuros de Bitcoin, os quais a SEC já havia aprovado anteriormente.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sabotag3x",
      "created_time": "August 29, 2023, 06:19:50 PM",
      "body": "Grayscale vai entrar na fila, como todo mundo.. e vai ser enrolada até onde der..Na minha humilde opinião, só vão aprovar um ETF de Bitcoin quando o Biden sair da presidência.. isso é ordem de cima..A brasileira Hashdex também entrou com um pedido de ETF nos EUA na semana passada, com uma proposta diferente das outras gestoras (indo direto nas questões levantadas pela SEC em outras oportunidades).. talvez tenham chance, mas também vão ser enrolados até onde o Gensler conseguir.Quote from: https://hashdex.com/en-US/insights/the-us-is-inching-closer-to-a-spot-bitcoin-etf-does-it-matterBlackRock and most other spot bitcoin ETF applicants believe a surveillance-sharing agreement with the exchange where BTC trades solves this, but there has been no evidence that this addresses the SEC’s concerns.Sobre a Grayscale, acho que seria a pior opção de todas.. eles já tem uns 600.000 BTC na mão, será que não rola um despejo? muita gente está querendo sair dali faz tempo.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "August 30, 2023, 01:56:06 AM",
      "body": "Quote from: sabotag3x on August 29, 2023, 06:19:50 PMSobre a Grayscale, acho que seria a pior opção de todas.. eles já tem uns 600.000 BTC na mão, será que não rola um despejo? muita gente está querendo sair dali faz tempo.Eu não sei não.No momento ele está sendo negociado com cerca de 16% de desconto. Ese desconto pode evaporar em poucas horas com uma aprovação do etf.https://ycharts.com/companies/GBTC/discount_or_premium_to_navEu não compraria, como também não compraria um etf de btc. Mas  existem motivos para comprar ele.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gagux123",
      "created_time": "August 30, 2023, 04:16:09 AM",
      "body": "Quote from: sabotag3x on August 29, 2023, 06:19:50 PMSobre a Grayscale, acho que seria a pior opção de todas.. eles já tem uns 600.000 BTC na mão, será que não rola um despejo? muita gente está querendo sair dali faz tempo.Então... me veio em minha mente essa possibilidade... não sei se to falando besteira, mas será que essa subida que tivemos não é algo \"artificial\" e que o mercado poderá corrigir em breve?Acredito que diversos investidores estão \"\"tentando\"\" prever o movimento de mercado e surfar nessa possivel ondaApesar que existe nexo, caso o ETF de fato seja aprovado ele poderá evaporar como o @bitmover disse acima, mas por outro lado, eu não duvido deles despejarem o \"\"pouco\"\" do BTC que eles possuem e se desfazerem dessa posição que estão atualmente.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "August 30, 2023, 06:42:52 AM",
      "body": "Quote from: gagux123 on August 30, 2023, 04:16:09 AMEntão... me veio em minha mente essa possibilidade... não sei se to falando besteira, mas será que essa subida que tivemos não é algo \"artificial\" e que o mercado poderá corrigir em breve?Acredito que diversos investidores estão \"\"tentando\"\" prever o movimento de mercado e surfar nessa possivel ondaIsso é verdade, mas todo o mercado ontem (29/08) teve uma louvada de ar fresco.Varias noticias positivas nos EUA, levaram a que as bolsas tivesse um bom impulso: esta vitoria; baixa do desemprego; possível descida ou manutenção da taxa de juro; empresas IT a subirem boas %.Vamos ver se as coisas acalma e o disco muda.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "darkv0rt3x",
      "created_time": "August 30, 2023, 11:47:54 AM",
      "body": "Só uma nota cómica. Parece que circulou por aí (internet) que o pump de Bitcoin ontem foi por causa desta notícia. lool. Bitcoin doesn't care! Isto é com cada uma que até parecem duas.Atribuir-se um pump a uma única notícia parece-me exgerado. Pode ter ajudado mas não acredito que tenha sido causa principal.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rdluffy",
      "created_time": "August 30, 2023, 12:11:14 PM",
      "body": "Quote from: sabotag3x on August 29, 2023, 06:19:50 PMNa minha humilde opinião, só vão aprovar um ETF de Bitcoin quando o Biden sair da presidência.. isso é ordem de cima..Eu ainda acredito que saia antes, mas o limite para a aprovação do ETF é só no começo de 2024, então eles podem enrolar bastante até aprovar ou não.Essa gestão do Biden não teve nada de bom para as criptos  Ontem pareceu dia de jogo decisivo no X-twitter, todos comemorando a \"derrota\" da SEC, nem foi tanto pela vitória da Grayscale, mas o pessoal pegou raiva da SEC mesmoQuote from: gagux123 on August 30, 2023, 04:16:09 AMEntão... me veio em minha mente essa possibilidade... não sei se to falando besteira, mas será que essa subida que tivemos não é algo \"artificial\" e que o mercado poderá corrigir em breve?Acredito que diversos investidores estão \"\"tentando\"\" prever o movimento de mercado e surfar nessa possivel ondaPode corrigir sim claro, mas não foi uma alta tão boa assim, foi lá dos 25.900 pros 27.900 mais ou menos e agora já está até 27.300",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "August 30, 2023, 12:58:43 PM",
      "body": "Quote from: darkv0rt3x on August 30, 2023, 11:47:54 AMSó uma nota cómica. Parece que circulou por aí (internet) que o pump de Bitcoin ontem foi por causa desta notícia. lool. Bitcoin doesn't care! Isto é com cada uma que até parecem duas.Atribuir-se um pump a uma única notícia parece-me exgerado. Pode ter ajudado mas não acredito que tenha sido causa principal.Sabes o que fez esse pump?As pessoas começaram a receber o ordenado de Agosto, e para aproveitarem a queda que o bitcoin teve, transferiram dinheiro para as exchanges e afins. Depois alguns dias desse processo, começaram as compras, que criou um pump no mercado.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sabotag3x",
      "created_time": "August 30, 2023, 01:55:14 PM",
      "body": "Quote from: darkv0rt3x on August 30, 2023, 11:47:54 AMAtribuir-se um pump a uma única notícia parece-me exgerado. Pode ter ajudado mas não acredito que tenha sido causa principal.Basta olhar a hora que saiu a decisão da corte (que pode variar dependendo da fonte) e o gráfico do Bitcoin (tanto em preço quanto volume):Não existe conscidência.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TryNinja",
      "created_time": "August 30, 2023, 02:25:20 PM",
      "body": "Quote from: darkv0rt3x on August 30, 2023, 11:47:54 AMSó uma nota cómica. Parece que circulou por aí (internet) que o pump de Bitcoin ontem foi por causa desta notícia. lool. Bitcoin doesn't care! Isto é com cada uma que até parecem duas.Atribuir-se um pump a uma única notícia parece-me exgerado. Pode ter ajudado mas não acredito que tenha sido causa principal.O preço estava parado há semanas, na hora exata que saiu a noticia ele subiu 10%… desculpa, mas desassociar os acontecimentos é loucura? Sabe quem “care”? Quem compra e vende Bitcoin e consequentemente é 100% responsável pelo preço, afinal, a rede sozinha só entende de três coisas: inputs, outputs, e blocos.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Disruptivas",
      "created_time": "August 30, 2023, 04:32:49 PMLast edit: August 30, 2023, 05:28:39 PM by Disruptivas",
      "body": "Quote from: TryNinja on August 30, 2023, 02:25:20 PMQuote from: darkv0rt3x on August 30, 2023, 11:47:54 AMSó uma nota cómica. Parece que circulou por aí (internet) que o pump de Bitcoin ontem foi por causa desta notícia. lool. Bitcoin doesn't care! Isto é com cada uma que até parecem duas.Atribuir-se um pump a uma única notícia parece-me exgerado. Pode ter ajudado mas não acredito que tenha sido causa principal.O preço estava parado há semanas, na hora exata que saiu a noticia ele subiu 10%… desculpa, mas desassociar os acontecimentos é loucura? Sabe quem “care”? Quem compra e vende Bitcoin e consequentemente é 100% responsável pelo preço, afinal, a rede sozinha só entende de três coisas: inputs, outputs, e blocos. Tem um conceito que gosto bastante, que é ''Post hoc ergo propter hoc'', que é  o nome de uma falácia lógica, também conhecida como correlação coincidente, que consiste na ideia de que dois eventos que ocorram em sequência cronológica estão necessariamente interligados através de uma relação de causa e efeito.É algo que acontece bastante com o preço/noticias Mas como o Ninja comentou, nesse caso me parece bem lógico que ocorreu devido a notícia. O BITCOIN pode não lidar, mas as pessoas ligam e são completamente incluenciadas pelo que ocorre no mercado. Maas vim aqui falar que li hoje  que os analistas de ETF da Bloomberg, Eric Balchunas e James Seyffart, aumentaram suas chances de aprovação de um ETF Bitcoin à vista pela SEC para 75% até o final deste ano e 95% até o final de 2024.“As chances de a SEC aprovar ETFs de Bitcoin à vista este ano aumentaram de 65% para 75% após a vitória da Grayscale no tribunal, acreditamos, enquanto as chances até o final de 2024 chegam a 95%”, disseram os analistas. “Os juízes repudiaram por unanimidade os argumentos da SEC, e a agência terá dificuldade para justificar novas negações enquanto enfrenta prazos, relações públicas negativas e a nova abordagem do HashDex.”",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TryNinja",
      "created_time": "August 30, 2023, 04:39:28 PM",
      "body": "Quote from: Disruptivas on August 30, 2023, 04:32:49 PMTem um conceito que gosto bastante, que é ''Post hoc ergo propter hoc'', que é  o nome de uma falácia lógica, também conhecida como correlação coincidente, que consiste na ideia de que dois eventos que ocorram em sequência cronológica estão necessariamente interligados através de uma relação de causa e efeito.É algo que acontece bastante com o preço/noticias Mas como o Ninja comentou, nesse caso me parece bem lógico que ocorreu devido a notícia. O BITCOIN pode não lidar, mas as pessoas ligam e são completamente incluenciadas pelo que ocorre no mercado. Acredito em você que isso existe e devem ter infinitos casos, mas aqui é complicado, né? Rola toda a crise do Covid e as bolsas do mundo todo despencam de forma abrupta. Vai dizer que não tem relação? É impossível. São situações como essa que é 1+1=2, ainda mais com ativos financeiros e movimentações bruscas.PS: nas aspas dos analistas de ETF da Bloomberg você traduziu “aumentar de 75% para 65%” (ordem trocada).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Disruptivas",
      "created_time": "August 30, 2023, 05:32:39 PM",
      "body": "Quote from: TryNinja on August 30, 2023, 04:39:28 PMAcredito em você que isso existe e devem ter infinitos casos, mas aqui é complicado, né? Rola toda a crise do Covid e as bolsas do mundo todo despencam de forma abrupta. Vai dizer que não tem relação? É impossível. São situações como essa que é 1+1=2, ainda mais com ativos financeiros e movimentações bruscas.PS: nas aspas dos analistas de ETF da Bloomberg você traduziu “aumentar de 75% para 65%” (ordem trocada).Exatamente. Tem várias situações em que usamos mil coisas pra dizer que ''aconteceu por isso ou por aquilo'' e não dá pra saber se foi mesmo. Mas em alguns casos, como o de ontem eu acho bastante razoável dizer que foi sim pela notícia. Boa, já ajustei",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "darkv0rt3x",
      "created_time": "August 30, 2023, 06:42:26 PM",
      "body": "Quote from: joker_josue on August 30, 2023, 12:58:43 PMQuote from: darkv0rt3x on August 30, 2023, 11:47:54 AMSó uma nota cómica. Parece que circulou por aí (internet) que o pump de Bitcoin ontem foi por causa desta notícia. lool. Bitcoin doesn't care! Isto é com cada uma que até parecem duas.Atribuir-se um pump a uma única notícia parece-me exgerado. Pode ter ajudado mas não acredito que tenha sido causa principal.Sabes o que fez esse pump?As pessoas começaram a receber o ordenado de Agosto, e para aproveitarem a queda que o bitcoin teve, transferiram dinheiro para as exchanges e afins. Depois alguns dias desse processo, começaram as compras, que criou um pump no mercado.Acredito mais na questão do pessoal que decidiu comprar em massa. Isso sim, parece-me bastante mais plausível.Quote from: sabotag3x on August 30, 2023, 01:55:14 PMQuote from: darkv0rt3x on August 30, 2023, 11:47:54 AMAtribuir-se um pump a uma única notícia parece-me exgerado. Pode ter ajudado mas não acredito que tenha sido causa principal.Basta olhar a hora que saiu a decisão da corte (que pode variar dependendo da fonte) e o gráfico do Bitcoin (tanto em preço quanto volume):Não existe conscidência.Sim, mas o que fez o preço alterar, na minha opinião, e como o @joker_josue disse, parece-me que foram as pessoas, que ao ouvirem a notícia e ao terem recebido, compraram em massa.Talvez não haja coincidências mas nem tudo é  assim tão taxativo como às vezes parece.Quote from: TryNinja on August 30, 2023, 02:25:20 PMQuote from: darkv0rt3x on August 30, 2023, 11:47:54 AMSó uma nota cómica. Parece que circulou por aí (internet) que o pump de Bitcoin ontem foi por causa desta notícia. lool. Bitcoin doesn't care! Isto é com cada uma que até parecem duas.Atribuir-se um pump a uma única notícia parece-me exgerado. Pode ter ajudado mas não acredito que tenha sido causa principal.O preço estava parado há semanas, na hora exata que saiu a noticia ele subiu 10%… desculpa, mas desassociar os acontecimentos é loucura? Sabe quem “care”? Quem compra e vende Bitcoin e consequentemente é 100% responsável pelo preço, afinal, a rede sozinha só entende de três coisas: inputs, outputs, e blocos. De acordo, mas se as pessoas não decidirem comprar, o que interessam as notícias? O preço não vai mexer só por causa de uma notícia. Mas sim pelo sentimento que a notícia pode provocar nas pessoas ou não. E até digo mais, eu por exemplo, não ando à procura de notícias para justificar as minhas compras. E aposto que há muita mais gente como eu. Compra e pronto!Quote from: TryNinja on August 30, 2023, 04:39:28 PMQuote from: Disruptivas on August 30, 2023, 04:32:49 PMTem um conceito que gosto bastante, que é ''Post hoc ergo propter hoc'', que é  o nome de uma falácia lógica, também conhecida como correlação coincidente, que consiste na ideia de que dois eventos que ocorram em sequência cronológica estão necessariamente interligados através de uma relação de causa e efeito.É algo que acontece bastante com o preço/noticias Mas como o Ninja comentou, nesse caso me parece bem lógico que ocorreu devido a notícia. O BITCOIN pode não lidar, mas as pessoas ligam e são completamente incluenciadas pelo que ocorre no mercado. Acredito em você que isso existe e devem ter infinitos casos, mas aqui é complicado, né? Rola toda a crise do Covid e as bolsas do mundo todo despencam de forma abrupta. Vai dizer que não tem relação? É impossível. São situações como essa que é 1+1=2, ainda mais com ativos financeiros e movimentações bruscas.PS: nas aspas dos analistas de ETF da Bloomberg você traduziu “aumentar de 75% para 65%” (ordem trocada).Eu insisto que não é a notícia que faz o preço mexer directamente. São as pessoas que compram com base em sentimentos que as notícias provocam nelas. Isto parece-me exactamente o que a @disruptivas falou.Senão, qualquer notícia fazia o preço alterar, independentemente se as pessoas compravam ou vendiam ou não!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TryNinja",
      "created_time": "August 30, 2023, 06:55:13 PM",
      "body": "Quote from: darkv0rt3x on August 30, 2023, 06:42:26 PMDe acordo, mas se as pessoas não decidirem comprar, o que interessam as notícias? O preço não vai mexer só por causa de uma notícia. Mas sim pelo sentimento que a notícia pode provocar nas pessoas ou não. E até digo mais, eu por exemplo, não ando à procura de notícias para justificar as minhas compras. E aposto que há muita mais gente como eu. Compra e pronto!Mas isso é obvio, a questão é exatamente essa.Saiu noticia boa -> pessoas compram por conta da noticia -> preço sobe. Inerentemente, o que causou tudo isso foi a noticia.Se alguém acha que a simples existencia da noticia magicamente altera o estado da materia para que os atomos que compoem a CPU do servidor da Binance sinalize um aumente de preço, sugiro um psicólogo imediatamente (brincadeira, já peço desculpas pela piada ).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "darkv0rt3x",
      "created_time": "August 30, 2023, 07:00:22 PM",
      "body": "Quote from: TryNinja on August 30, 2023, 06:55:13 PMQuote from: darkv0rt3x on August 30, 2023, 06:42:26 PMDe acordo, mas se as pessoas não decidirem comprar, o que interessam as notícias? O preço não vai mexer só por causa de uma notícia. Mas sim pelo sentimento que a notícia pode provocar nas pessoas ou não. E até digo mais, eu por exemplo, não ando à procura de notícias para justificar as minhas compras. E aposto que há muita mais gente como eu. Compra e pronto!Mas isso é obvio, a questão é exatamente essa.Saiu noticia boa -> pessoas compram por conta da noticia -> preço sobe. Inerentemente, o que causou tudo isso foi a noticia.Se alguém acha que a simples existencia da noticia magicamente altera o estado da materia para que os atomos que compoem a CPU do servidor da Binance sinalize um aumente de preço, sugiro um psicólogo imediatamente (brincadeira, já peço desculpas pela piada ).Claramente. Se alguém acredita nisso, precisa urgentemente de médico.No entanto, há imensas notícias boas para Bitcoin quase diariamente, e 99% delas não causa qualquer impacto. Ou seja, o que quero dizer é que a notícia, só por si, não faz nada. Indirectamente é que as pessoas podem ou não deixar-se influenciar pelo que ela pode significar em termos de mercado!Imagina que esta notícia vem pouco depois de a malta receber um ordenado + um subsídeo de férias? heheh. Se calhar o impacto era bem maior, no entanto, a notícia era a mesma!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sabotag3x",
      "created_time": "August 30, 2023, 07:06:15 PM",
      "body": "Já que o assunto migrou para compra de notícias, também ta rolando umas denúncias de que rolou um \"insider trading\": https://finbold.com/cryptic-clues-uncovering-possible-bitcoin-manipulation-before-grayscale-win/Mas não entendi direito.. um diz que enviaram 30.000 BTC para corretoras, outro diz que sacaram 15.000 BTC",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TryNinja",
      "created_time": "August 30, 2023, 07:08:16 PM",
      "body": "Quote from: darkv0rt3x on August 30, 2023, 07:00:22 PMNo entanto, há imensas notícias boas para Bitcoin quase diariamente, e 99% delas não causa qualquer impacto. Ou seja, o que quero dizer é que a notícia, só por si, não faz nada. Indirectamente é que as pessoas podem ou não deixar-se influenciar pelo que ela pode significar em termos de mercado!A aprovação da primeira ETF de Bitcoin é uma noticia 1000000000000x mais importante do que qualquer noticia boa que você fala acontecer todo dia (pode dar uns exemplos só por curiosidade?). Claro que não é toda noticiazinha positiva que vai dar um pump de 10%, mas estamos falando exatamente de uma noticia que destrona todas outras.E sinceramente, se eu nem ouço falar nessas tais noticias é por que elas não importam tanto assim. Não por que eu sou f0d@, mas simplesmente por que eu acompanho tudo e uma noticia importante realmente toma conta da timeline do crypto twitter (tipo nesse caso).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}