{
  "id": "topic_5409075",
  "title": "S3300",
  "author": "S3300",
  "created_time": "August 08, 2022, 06:36:38 AM",
  "content": "Do you think that Asic miner is a better buy at this present time? Since Ethereum is going to PoS soon and no other PoW coins is delivering the exact returns of that Ethereum I think it will be smarter to nose out for better returns this is why I am asking this question, if Asic is better then I will dish GPU for Asic",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5409075",
  "comments": [
    {
      "author": "hymperion",
      "created_time": "August 08, 2022, 07:21:29 AM",
      "body": "I sincerely believe so. I recently bought 4 used asics and am no longer buying GPUs.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GFDhd",
      "created_time": "August 08, 2022, 07:38:16 AM",
      "body": "Both GPU and ASIC miners support Bitcoin's proof-of-work SHA256 algorithm, but ASICs are more efficient.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hZti",
      "created_time": "August 08, 2022, 07:41:28 AM",
      "body": "Mining with graphics cards was a long time more profitable since many people are mining Bitcoin only and Graphics card are way harder to get. You have to consider that buying ASIC for the average user may seem hard, but for big mining companies it is way more easy than to buy graphic cards. Since Graphic Cards are now easy to get you don't get that premium anymore.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hymperion",
      "created_time": "August 08, 2022, 10:26:09 AM",
      "body": "besides the fact that you can't mine BTC with GPUs, it's terribly inefficient.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitMaxz",
      "created_time": "August 08, 2022, 11:47:35 AM",
      "body": "Take note ASIC units are power hungry compared to mining with GPU if you are planning to mine with ASIC you need to be prepared so I suggest you read this \"First time/Small miner reference for getting started.\"Quote from: GFDhd on August 08, 2022, 07:38:16 AMBoth GPU and ASIC miners support Bitcoin's proof-of-work SHA256 algorithm, but ASICs are more efficient.Mining with GPU is no longer profitable and it can no longer mine BTC maybe years ago it can still mine BTC SHA256 algo but right now GPU is no longer supported. Unless you talking about mining on Nicehash and paying you in BTC you are not mining directly with BTC you are paid due to hashrate rentals on Nicehash.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Canaan Online Shop",
      "created_time": "August 12, 2022, 09:29:35 AM",
      "body": "I vote for Asic",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "loveselenagomez",
      "created_time": "August 12, 2022, 11:13:06 AM",
      "body": "Off course ASIC miner more friendly and more profitable right now,also electricity cost more high from gpu.but i am not saying gpu mining bad, overall Asic miner best in my opinion.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Maliceprime",
      "created_time": "August 13, 2022, 09:17:10 AM",
      "body": "Asic wins this battle, any time any day, profit is higher and the hassle of managing the miner is lesser compare to a mining rig with 6-8 graphic cards, Aisc is plug and play, they work nonstop but I have to check my gpu rig from time to time, some times 6 gpu rig will reboot itself and only 5 gpu will keep working.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "philipma1957",
      "created_time": "August 24, 2022, 08:40:09 PM",
      "body": "Quote from: hymperion on August 08, 2022, 10:26:09 AMbesides the fact that you can't mine BTC with GPUs, it's terribly inefficient.yes you can but as a two step process.ie gpu to eth to btc",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Queentoshi",
      "created_time": "August 26, 2022, 06:07:33 AM",
      "body": "Quote from: S3300 on August 08, 2022, 06:36:38 AMDo you think that Asic miner is a better buy at this present time? Yes, not just because they are better and it looks like everyone's choice here, but also because since it is majorly what most miners are going for, it will be wise not to buy another not common to miners at the moment so you easily get technical support if you need and for easy repair of hardware component should any become faulty. It will be easier since it is what other miners are currently going for.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pterosaur",
      "created_time": "August 27, 2022, 10:59:14 AM",
      "body": "For me asic doesn't win a shit, Asic miners are winners in their own world of BTC mining and GPUs are also winners in their own world of altcoins mining, see I can't handle two Asic miners that's 3000watts per hour, I can just build GPU rig that takes less than 3000watts per hour, in fact I can build a rig that will only take 350watts from the wall, I cant do this with Asic miner.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}