{
  "id": "topic_5471733",
  "title": "Question:",
  "author": "BenCodie",
  "created_time": "October 26, 2023, 10:39:25 AM",
  "content": "If a bitcointalk user is wearing a paid signature for a service, should readers view them as either personal endorsements from that bitcointalk user?What is your opinion?My opinion:The advertisement should be considered as a paid advertisement, not a personal endorsement from the wearer.However, users should be responsible for ensuring that the signature they are wearing is not a scam. Similarly, readers should do their own research & due diligence before using any service, including ones within paid advertisements/signatures.  This thread is self moderated as it is for opinions on this topic only and I'd like to keep it that way. I don't want to censor people though, so I posts that are not providing an opinion or providing relevant value to the conversation will be removed and quoted in the second post.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5471733",
  "comments": [
    {
      "author": "BenCodie",
      "created_time": "October 26, 2023, 10:40:51 AMLast edit: October 26, 2023, 09:02:11 PM by BenCodie",
      "body": "Reserved for deleted posts. Deleted post: 1mau Reason: involving other threads in the topic discussion, deviating from the topic of discussion, claiming this thread is in direct response to the discussions he has pointed out (not true, I'm here to learn what the community thinks about what has been asked, so that I and others can have peace of mind from these clowns in the future)Post:Quote from: 1miau on October 26, 2023, 07:58:49 PMImportant to read: this topic was taken out of context by BenCodie in an attempt to get his preferred answers. Here's where it started: https://bitcointalk.org/index.php?topic=5115291.msg63055617#msg63055617Well, actually here already: https://bitcointalk.org/index.php?topic=5115291.msg63017210#msg63017210The question was about BenCodie's statement, while participating in a gambling signature campaign: View this as an example. Quote from: 1miau on October 18, 2023, 01:08:44 AMWhere the OP (CryptopreneuerBrainboss) pointed out that: Quote from: CryptopreneurBrainboss on February 28, 2019, 12:04:58 PM[2]: Join a campaign you agree with and not just for the payout.That's why BenCodie created the poll, to \"prove us wrong\" and to do that, he's taking the question out of context. Now, BenCodie says, that we would have said that \"the wearer encourages you to use the advertised service\". No one ever said that. What we said is: wearing a paid signature is an endorsement: The brand name appears directly right to our forum name and our forum profile. High paying campaigns are selecting the most reputable forum members for a reason.Therefore, we should select the campaigns carefully and if we hate gambling, think gambling is harmful and we oppose gambling, it's hyporitical to join such a gambling campaign just for the sake of getting a few sats. As a participant in such a campaign, we should be able to say about the service: \"yes, the advertised service is a service I can get behind\"What any viewer does, when coming over our signatures is not our issue. It's not something like \"hey, please use this service in my signature\", like written by OP. So we, as a participant in that campaign, should always be able to get behind the advertised project. Otherwise, we should not join that campaign.The solution for BenCodie: Don't join gambling signature campaigns, if you really hate gambling and think it's harmful. Otherwise, you would be \"harmful\" as well by wearing that paid signature.  And that's exactly, what CryptopreneurBrainboss pointed out in his topic.  [/size]",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "October 26, 2023, 10:53:26 AM",
      "body": "A paid signature is a form of trust in you. The user will click on the signature or prefer to use the service because he trusts you or sees that you provide high-quality posts, so what you ads will be a good thing.These are the same reasons why advertising companies pay millions to Messi and Ronaldo, so you must try as much as possible to avoid advertising for scam/HYIP, or at least stop advertising for these services whenever you are certain that they are scammers.Quote from: BenCodie on October 26, 2023, 10:39:25 AMMy opinion:The advertisement should be considered as a paid advertisement, not a personal endorsement from the wearer.However, users should be responsible for ensuring that the signature they are wearing is not a scam. If not personal endorsement, why encourage others to use it? Advertising is encouraging others to use it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jokers10",
      "created_time": "October 26, 2023, 10:54:28 AM",
      "body": "Quote from: BenCodie on October 26, 2023, 10:39:25 AMIf a bitcointalk user is wearing a paid signature for a service, should readers view them as either personal endorsements from that bitcointalk user?What is your opinion?My opinion:The advertisement should be considered as a paid advertisement, not a personal endorsement from the wearer.However, users should be responsible for ensuring that the signature they are wearing is not a scam. Similarly, readers should do their own research & due diligence before using any service, including ones within paid advertisements/signatures. Look at what's happening with those ones who wear signatures of known on the forum scam 1xbit. So right, some investigation is required.But how can we be sure that some project will become a scam before it scams? Sometimes we can get some hints, sometimes not. Whirlwind scam was unexpected. Bernard Madoff worked for dozens of years and was a respected financier. So DYOR is what expected each time.When you see a billboard you anyway think if what is advertised there is suitable for you. The same about forum signatures. Of course promoting some known scam is unacceptable, but everyone should keep in mind that each their financial decision is a matter of their own responsibility, so to recheck everything by themselves.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mocacinno",
      "created_time": "October 26, 2023, 10:59:02 AM",
      "body": "Personally, i think it's a grey area... I think it's clear to everybody that wearing a signature for whatever product or service is an advertisement and not a (very) personal endorsement. As with any advertisement, a user should use his/her due diligence.This being said, the person wearing the signature is responsible for putting the advertisement \"out there\", so if he/she is pushing an advertisement for a scam service, he remains responsible for distributing said ad (eventough it's still the enduser that should recognize an advertisement as being an advertisement, and check stuff out before he/she gets scammed).Personally, i try to only join signature campaigns for products i use myself (maybe with the exception of services that are already trusted in the community by the time i join the campaign)... This was the case for chipmixer, and it's the case for my current signature. It's possible they turn scam after i've tested/used them, and in this case it's my responsability to remove the signature as soon as i'm aware of the problems with the service in my signature space.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lovesmayfamilis",
      "created_time": "October 26, 2023, 11:09:43 AM",
      "body": "During my presence on the forum, I participated in two subscription campaigns. The first one was a long time ago and short-lived, but of course, I made my conclusions about the legality, and I also trusted the manager who carried it out. Today’s signature is fully understood and approved by me since I used the Best Change aggregator before I learned about Bitcoin and the forum, so I can say that for me, participation in this company is a great honor, and approval goes without saying.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jawhead999",
      "created_time": "October 26, 2023, 11:19:00 AM",
      "body": "I think it's not really that different between advertisement and personal endorsements? In the end you're promoting a project and you would receive negative feedback when you wear a signature from completely scam project.Someone who participated in signature campaign need to understand both advantages and disadvantages. It's not make sense when you're wear centralized exchange which have mandatory KYC rule, but you're saying if centralized exchange is bad.You're free to say anything that you want, but it's not really good for the brands you're promoting.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "examplens",
      "created_time": "October 26, 2023, 11:21:23 AM",
      "body": "Quote from: BenCodie on October 26, 2023, 10:39:25 AMIf a bitcointalk user is wearing a paid signature for a service, should readers view them as either personal endorsements from that bitcointalk user?Yes, of course. The moment you enter the signature of a business, you become part of it. You don't have the power to make decisions, but you are certainly some kind of representative. Don't the managers select the participants by selecting the best offered? Probably because the owners want the best users to represent them.What I think is a more interesting question, is how many users actually do any research about campaign owners before applying for a sig. campaign. It's a bit disappointing when I see a user in a well-paid campaign, who doesn't even know about ANN or has never visited the website of the service they promote.icopress started encouraging campaign participants to test the service they are promotingQuote from: icopress on August 21, 2023, 12:36:16 PMTherefore, please note that I will periodically ask you for favors, and please treat my words with understanding and seriousness, (for example, to begin with, I would like each of you to test MixTum and share your experience).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BenCodie",
      "created_time": "October 26, 2023, 11:30:50 AMLast edit: October 26, 2023, 12:45:52 PM by BenCodie",
      "body": "Quote from: hugeblack on October 26, 2023, 10:53:26 AMA paid signature is a form of trust in you. The user will click on the signature or prefer to use the service because he trusts you or sees that you provide high-quality posts, so what you ads will be a good thing.These are the same reasons why advertising companies pay millions to Messi and Ronaldo, so you must try as much as possible to avoid advertising for scam/HYIP, or at least stop advertising for these services whenever you are certain that they are scammers.I agree with this. Would you say the minimum requirement is that the service should be legitimate? Or more than just that?Quote from: hugeblack on October 26, 2023, 10:53:26 AMQuote from: BenCodie on October 26, 2023, 10:39:25 AMMy opinion:The advertisement should be considered as a paid advertisement, not a personal endorsement from the wearer.However, users should be responsible for ensuring that the signature they are wearing is not a scam. If not personal endorsement, why encourage others to use it? Advertising is encouraging others to use it.If it's safe to use, is that not good enough?I think everyone wearing signatures aren't encouraging gambling and mixers generally. There is nothing generally wrong with both of them if they are currently legit, so it's fine to be paid to advertise them, as people can do what they want when it comes to using them...Gambling is not good for health and mixers have a high rate of eventually becoming a scam, both of these are factual. Does that mean we, as a community, are encouraging the usage of them?I don't think so, personally, but I'd like to hopefully hear more about this topic too.Quote from: examplens on October 26, 2023, 11:21:23 AMQuote from: BenCodie on October 26, 2023, 10:39:25 AMIf a bitcointalk user is wearing a paid signature for a service, should readers view them as either personal endorsements from that bitcointalk user?Yes, of course. The moment you enter the signature of a business, you become part of it. You don't have the power to make decisions, but you are certainly some kind of representative. Interesting, so how responsible are you, for example, if they eventually scam? I think considering people are representatives adds liability that I am sure, no one wants.Quote from: examplens on October 26, 2023, 11:21:23 AMQuote from: BenCodie on October 26, 2023, 10:39:25 AMIf a bitcointalk user is wearing a paid signature for a service, should readers view them as either personal endorsements from that bitcointalk user?Don't the managers select the participants by selecting the best offered? Probably because the owners want the best users to represent them.They pick by who has contributed the most value to the forum, and the sections that the users post in. This theoretically brings the most traffic. There are probably more factors, but those two I would guess are the main factors. I don't think users would be impressed if they found out that they are representing the business, especially if that business turns into a scam. What happens then?Quote from: examplens on October 26, 2023, 11:21:23 AMQuote from: BenCodie on October 26, 2023, 10:39:25 AMIf a bitcointalk user is wearing a paid signature for a service, should readers view them as either personal endorsements from that bitcointalk user?What I think is a more interesting question, is how many users actually do any research about campaign owners before applying for a sig. campaign. It's a bit disappointing when I see a user in a well-paid campaign, who doesn't even know about ANN or has never visited the website of the service they promote.icopress started encouraging campaign participants to test the service they are promotingQuote from: icopress on August 21, 2023, 12:36:16 PMTherefore, please note that I will periodically ask you for favors, and please treat my words with understanding and seriousness, (for example, to begin with, I would like each of you to test MixTum and share your experience).Campaign managers are good marketers. I'm sure icopress is doing that more so that the business gets more reviews, than for users to \"do research\" about what they're promoting. People should be doing that anyway, and you only need to read the thread and website to understand a service, you don't also have to share your experience in order to have researched it.I would assume that users at least read the thread, website and understand the service, before they wear the signature. Quote from: Jawhead999 on October 26, 2023, 11:19:00 AMI think it's not really that different between advertisement and personal endorsements? In the end you're promoting a project and you would receive negative feedback when you wear a signature from completely scam project.Someone who participated in signature campaign need to understand both advantages and disadvantages. It's not make sense when you're wear centralized exchange which have mandatory KYC rule, but you're saying if centralized exchange is bad.You're free to say anything that you want, but it's not really good for the brands you're promoting.There is a difference.The signature I am wearing is legitimate to-date. However, I do not personally endorse people to gamble, as it is factually unhealthy. Though one you wants to use them, go ahead, conduct due diligence and gamble responsibly.Is it wrong for me to be wearing the coins.game signature with this view?Not to make this about me but it's the quickest example I could give you.Quote from: lovesmayfamilis on October 26, 2023, 11:09:43 AMDuring my presence on the forum, I participated in two subscription campaigns. The first one was a long time ago and short-lived, but of course, I made my conclusions about the legality, and I also trusted the manager who carried it out. Today’s signature is fully understood and approved by me since I used the Best Change aggregator before I learned about Bitcoin and the forum, so I can say that for me, participation in this company is a great honor, and approval goes without saying.I would be proud to personally endorse them too, I'm sure anyone would as they're a fair and useful service with a good business model and a reputation that is pretty much impeccable. Not all signature campaigns are this easy to personally endorse though, you are one of the lucky ones Quote from: mocacinno on October 26, 2023, 10:59:02 AMPersonally, i think it's a grey area... I think it's clear to everybody that wearing a signature for whatever product or service is an advertisement and not a (very) personal endorsement. As with any advertisement, a user should use his/her due diligence.This being said, the person wearing the signature is responsible for putting the advertisement \"out there\", so if he/she is pushing an advertisement for a scam service, he remains responsible for distributing said ad (eventough it's still the enduser that should recognize an advertisement as being an advertisement, and check stuff out before he/she gets scammed).Thank you for sharing, I appreciate this opinion.Quote from: mocacinno on October 26, 2023, 10:59:02 AMPersonally, i try to only join signature campaigns for products i use myself (maybe with the exception of services that are already trusted in the community by the time i join the campaign)... This was the case for chipmixer, and it's the case for my current signature. It's possible they turn scam after i've tested/used them, and in this case it's my responsability to remove the signature as soon as i'm aware of the problems with the service in my signature space.If there were no campaigns that you use for yourself for more than 1 year but there were legitimate ones with no complaints that would accept you, what would you do? I just modified and reset the poll to take into account the assumption that we are talking about legitimate campaigns. Of course, no one should be wearing campaigns advertising known scams.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaveF",
      "created_time": "October 26, 2023, 12:34:40 PM",
      "body": "Advertisement only.You are renting space nothing more. If I had a AirBnB and you rented a room it's the same thing. You are just renting space that I have.Personally I have never seen something that someone had in their signature (here are other boards) and thought that they endorsed it at all. Just generating some money from space they had.-Dave",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tvplus006",
      "created_time": "October 26, 2023, 01:24:18 PM",
      "body": "Quote from: BenCodie on October 26, 2023, 10:39:25 AMIf a bitcointalk user is wearing a paid signature for a service, should readers view them as either personal endorsements from that bitcointalk user?...A beginner, of course, will have more confidence in an advertising message that advertises by a legendary. And this is one of the reasons for the high payment of such a poster, compared to other ranks. Those who have been wearing such a paid signature for a long time understand the true reasons for choosing this or that paid advertising, which is usually determined by the price.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FatFork",
      "created_time": "October 26, 2023, 01:48:08 PMLast edit: October 26, 2023, 02:12:48 PM by FatFork",
      "body": "By definition, endorsements can be considered a form of advertising. Your forum signature space is your personal territory, and you're free to put whatever you like there, based on your own judgment. Whether you call it advertising or endorsement, the key factor is your personal moral perspective. Would you be okay with promoting something you'd never use yourself? If your answer is yes, it might suggest lower moral standards. If your answer is no, then whether it's an endorsement or another advertising form doesn't really change the ethical aspect.By the way, your poll is still a bit misleading. Endorsing and encouraging are not the same thing. Even if I were to endorse a brand or service, it doesn't mean I would encourage everyone to use it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "noorman0",
      "created_time": "October 26, 2023, 01:56:08 PM",
      "body": "I personally don't necessarily endorse it, but I can recommend it to others on several occasions and I can confirm it is legit and safe as far as my experience with it goes.I haven't joined many campaigns since I was on this forum, and what I remember is that all the services I've campaigned for in my profile attributes have been tested to some extent.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Apocollapse",
      "created_time": "October 26, 2023, 02:42:14 PM",
      "body": "I vote for advertisement only.There's no obligation for the users to try or use the project that they use in their signature. You're one of the example, you wore a gambling signature, but you have a view if gambling is bad and you're not encourage people to gamble. It sounds like a hypocrite, but isn't that the campaign manager's risk? he know you're not support gambling, but he want to accept you in gambling project. He can easily not to accept you if he feel you're not the right person or a threat for the project.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "October 26, 2023, 02:59:08 PM",
      "body": "Simple response:Complicated oneNormally it should be seen as a paid advertisement, but what happens when there is bias involved?We can take for example a very long-running campaign I was a member and did not make any demands on where we post or quota post or use bumping power yet a lot of the members including myself when finding a topic where someone was asking for advice on mixing coins we would, not surprisingly, recommend the above not to be mentioned again service which after 6 years it ended as we all know, Was that post which recommended the service personal endorsement, yup, it was!Would one person carrying a competitor sig have made the same? No, let's not kid ourselves!Would we have recommended another one and not CM? Again, let's be serious!How many users carrying a sportsbet sig would say in a topic, hey!!, roobet has better odds, 2.5 instead of 2.25 on this event!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "YOSHIE",
      "created_time": "October 26, 2023, 03:10:43 PM",
      "body": "Quote from: BenCodie on October 26, 2023, 10:39:25 AMWhat is your opinion?The signature campaign is considered as advertising or social support for individuals. For me, the response is better. I consider the signature campaign to be an advertising method, Every individual who wants to use the advertisements on their profile, always refers to sources that may be obtained from other people or outside this forum, without referring to one individual, Doing this greatly affects the welfare, especially of the individual concerned when operating and using the advertisement, the social support available outside can avoid negative actions in the future for the user.To place a signature as a method of advertising or with social support, it will make users feel that the advertisement can individually feel comfortable, accepted or stopped on the basis of advertising and social support globally.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaveF",
      "created_time": "October 26, 2023, 05:50:41 PM",
      "body": "Quote from: stompix on October 26, 2023, 02:59:08 PMSimple response:Complicated oneNormally it should be seen as a paid advertisement, but what happens when there is bias involved?We can take for example a very long-running campaign I was a member and did not make any demands on where we post or quota post or use bumping power yet a lot of the members including myself when finding a topic where someone was asking for advice on mixing coins we would, not surprisingly, recommend the above not to be mentioned again service which after 6 years it ended as we all know, Was that post which recommended the service personal endorsement, yup, it was!Would one person carrying a competitor sig have made the same? No, let's not kid ourselves!Would we have recommended another one and not CM? Again, let's be serious!How many users carrying a sportsbet sig would say in a topic, hey!!, roobet has better odds, 2.5 instead of 2.25 on this event!  I would. When wearing the CM signature and even now wearing a different mixer sig I have pointed out that there are more private ways of mixing BTC then using a centralized service. Perhaps not as quick and easy but very doable. Years ago when I was wearing a Roo signature I posted in a now deleted thread that there were better bonus options for someone. (turned out to be a scammer who left but that's not the point here)-Dave",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fausto Arta",
      "created_time": "October 26, 2023, 06:21:55 PM",
      "body": "When you are paid by a certain company, you are indirectly the person representing that company in public. You should not spit on your own plate of rice while you still want to eat it, unless your rice is stale and poisonous. So you should not promote anything that you don't actually want to support, because after all you are a representative of those who are paid in full to attract the attention of other people using their services.If you do not support gambling for any reason, do not promote gambling campaigns. It's that simple.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Coyster",
      "created_time": "October 26, 2023, 07:47:07 PM",
      "body": "Quote from: Fausto Arta on October 26, 2023, 06:21:55 PMWhen you are paid by a certain company, you are indirectly the person representing that company in public.When you are paid by a company for advertisement, i think the most important part of doing your due diligence is to ensure that the company is not a scam, potential users have to do their own research on other aspects of the company. For example you might not personally like the UI/UX of the service your promote, but does that mean you'd not promote the campaign? of course you would, because someone else might like it. Imo, i think it is just paid advertisement, and endorsing the project is when you make posts encouraging/advising users to use the service.Quote from: Fausto Arta on October 26, 2023, 06:21:55 PMIf you do not support gambling for any reason, do not promote gambling campaigns. It's that simple.  If i (correctly) think that coinjoin give users a higher level of privacy than mixers, does that mean i shouldn't advertise mixing campaigns? Mind you that there are quite a lot of users who prefer to use mixers for their own personal reasons, and what you think doesn't matter to them, as long as they can get a good mixer through your sig space.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BenCodie",
      "created_time": "October 26, 2023, 08:46:21 PMLast edit: October 26, 2023, 09:11:40 PM by BenCodie",
      "body": "Post deleted and out into 2nd post of OP. As stated in the OP, any further discussion that is not addressing the thread topic will be deleted.1mau's post is a good example of someone relating other threads to this one. It serves as a good example of someone who directly disrespected the rules of the topic.This thread is helping the community clear blur lines. Disrespecting that, as 1mau has, is disrespecting the natural opinion and voting process that helps others to understand the community better.I've cut 60% out of 1mau's post below in order to respond to what was on topic. I have put the rest of it in the second post of this thread.Quote from: 1miau on October 26, 2023, 07:58:49 PMWhat we said is: wearing a paid signature is an endorsement: The brand name appears directly right to our forum name and our forum profile. High paying campaigns are selecting the most reputable forum members for a reason.Therefore, we should select the campaigns carefully and if we hate gambling, think gambling is harmful and we oppose gambling, it's hyporitical to join such a gambling campaign just for the sake of getting a few sats. As a participant in such a campaign, we should be able to say about the service: \"yes, the advertised service is a service I can get behind\"What any viewer does, when coming over our signatures is not our issue. It's not something like \"hey, please use this service in my signature\", like written by OP. So we, as a participant in that campaign, should always be able to get behind the advertised project. Otherwise, we should not join that campaign.- Endorsement = Approval or support for a project. Which can be read as: \"I support/use this service, and so should you.\" Or \"the community uses this service, so should you\" by the person reading the ad.- Paid ad = If the content interests you, research it, and if you want, try it. No one is saying anything positive about it by having it in their profile. However if it's in someone's profile, it's probably at least legitimate. Do your own due diligence.If signatures are a personal endorsement, that is a form of encouragement for those already considering using it. Especially if we rule out that all signatures can now rightfully be read as personal endorsements.Thanks for sharing your opinion, despite being a tool about it with the other 70% of your content which forced me to delete your post.Now vote in the poll, and move on.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}