{
  "id": "topic_5412910",
  "title": "headstails",
  "author": "headstails",
  "created_time": "September 08, 2022, 05:19:54 PMLast edit: October 01, 2022, 12:28:33 PM by headstails",
  "content": "Announcing HeadsTails.xyz, a prediction betting platform on the blockchain!What is it exactly?HeadsTails is a community-powered platform for betting on the predictions of real-world events using cryptocurrency. HeadsTails is hosted on Binance Smart Chain, platform currency is BUSD BEP20. Topics span a range of categories, including politics, world events, sports, science, public health, and more.How does it work?Prediction betting allows you to place bets on the outcome of real-world events. There are other prediction betting sites, but they are needlessly complex. As the name \"HeadsTails\" implies, every topic on the platform is a simple \"yes\" or \"no\" bet, and you are free to bet as much or as little as you like.HT has to resolve the question (select a winning answer) within 7 days of the question end date. The resolution source is transparent. If we don’t, users can unstake their tokens. This feature is built into the smart contract. This ensures that when users take part in a question, it will either result in the winnings to be distributed to the users or the funds can be claimed back by the users. HT cannot keep hold of the funds incase a question is not settled and winning answer not chosen.The platform also has a points system. You get ranking points for winning bets. A global leader board shows top-ranking players. Monthly prizes will be on offer to top performers.Users can also follow and see the dashboard of other users to see what questions they are taking part in.★ Check out the websiteLINKS★ Watch the 1 minute explainer video★ Read the full documentation★ Read the Litepaper (Github alternative)★ Check out the Security Audit (Score of 96!)★ Join us on TelegramSECURITY:The platform is secured by smart contract, and all functions are verifiably secure. We are holding the launch of the platform for the release of the smart contract audit, for general transparency and security. Coming soon!TRUSTLESS TOPIC RESOLUTION:Every question has a verifiable end date. HeadsTails must resolve the question and select the winning side within 7 days of the question end date. If this is not completed on time, users can freely unstake their tokens. This feature is built into the smart contract. This ensures that when users take part in a question, it will either result in the winnings distributed to the users or the funds claimed back by the users. HeadsTails cannot keep funds in the event a resolution is not reached. USER ENGAGEMENT: The platform has a points system. A user gets ranking points for winning bets. A global leader board shows the top-ranking players. Monthly prizes will be on offer to top performers. Users can also visit and view the dashboard of other users to see what questions they are taking part in. ★ REVENUE SHARING:We are opening the platform to allow you to submit questions and topics of your own writing. If your question passes review and is selected for inclusion on the site, you will earn 1% of the entire bet pool! This is ripe for influencers and community organizers - send your community to engage your question, and earn a percentage of everything regardless of the outcome.We'd love to hear what you think!",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5412910",
  "comments": [
    {
      "author": "coin-investor",
      "created_time": "September 23, 2022, 10:09:27 PM",
      "body": "Quote from: headstails on September 08, 2022, 05:19:54 PMWhat is it exactly?HeadsTails is a community-powered platform for betting on the predictions of real-world events using cryptocurrency. HeadsTails is hosted on Binance Smart Chain, platform currency is BUSD BEP20. Topics span a range of categories, including politics, world events, sports, science, public health, and more.This announcement goes unnoticed for the last two weeks, I guess it was moved here but I don't think this is the right section for this project as they are not going to accept Bitcoin, and they are on a prelaunch it's better to move it in the altcoin section where it rightly belongs, there is no TOS, no FAQ what you posted here you should also post in your homepage, there's no readable information except your video, its very similar to Futuur but this one with a coin flip.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TimeTeller",
      "created_time": "September 23, 2022, 11:23:02 PM",
      "body": "Quote from: coin-investor on September 23, 2022, 10:09:27 PMQuote from: headstails on September 08, 2022, 05:19:54 PMWhat is it exactly?HeadsTails is a community-powered platform for betting on the predictions of real-world events using cryptocurrency. HeadsTails is hosted on Binance Smart Chain, platform currency is BUSD BEP20. Topics span a range of categories, including politics, world events, sports, science, public health, and more.This announcement goes unnoticed for the last two weeks, I guess it was moved here but I don't think this is the right section for this project as they are not going to accept Bitcoin, and they are on a prelaunch it's better to move it in the altcoin section where it rightly belongs, there is no TOS, no FAQ what you posted here you should also post in your homepage, there's no readable information except your video, its very similar to Futuur but this one with a coin flip.Yes, should not be here as they will be accepting BUSD. Their platform seems to be like futuur. However, futuur is already accepting btc, and other top alts.@headstails, as the site is not yet up and running, what would be different this time aside from using the BUSD currency?You already have competitor who's been here in the business for quite a while.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yahoo62278",
      "created_time": "September 23, 2022, 11:30:34 PM",
      "body": "Quote from: TimeTeller on September 23, 2022, 11:23:02 PM@headstails, as the site is not yet up and running, what would be different this time aside from using the BUSD currency?You already have competitor who's been here in the business for quite a while.Competition is good for sites IMO. It will drive their Developers to improve the site and introduce new and exciting features to make sure they are #1 site for the games they offer. I don't think anyone who runs a website should look at competition in a negative manner.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "robelneo",
      "created_time": "September 23, 2022, 11:50:54 PM",
      "body": "It's tempting to be on this project,  QuoteSimplified Prediction Betting w/ Revenue Sharing via Crypto but its vague there's no relevant information about the site being a revenue sharing site, yes they have a video but it's a short and it doesn't explain in full in a way that we can understand the whole concept, it's better for OP to go on details create an FAQ or a whole page to explain the concept, you are in a hurry to monetize that you already have a dedicated page for advertising instead of the concept.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nrcewker",
      "created_time": "September 24, 2022, 01:23:42 AM",
      "body": "Quote from: coin-investor on September 23, 2022, 10:09:27 PMQuote from: headstails on September 08, 2022, 05:19:54 PMWhat is it exactly?HeadsTails is a community-powered platform for betting on the predictions of real-world events using cryptocurrency. HeadsTails is hosted on Binance Smart Chain, platform currency is BUSD BEP20. Topics span a range of categories, including politics, world events, sports, science, public health, and more.This announcement goes unnoticed for the last two weeks, I guess it was moved here but I don't think this is the right section for this project as they are not going to accept Bitcoin, and they are on a prelaunch it's better to move it in the altcoin section where it rightly belongs, there is no TOS, no FAQ what you posted here you should also post in your homepage, there's no readable information except your video, its very similar to Futuur but this one with a coin flip.Also these guys are using a free domain?I mean .xyz seriously? If they aren’t able to afford domain, how they gonna pay for the predictions?Moreover OP also don’t care about the replies and suggestions here from Bitcointalk. After creating the announcement thread, the op has went invisible. So waste of giving suggestions here.And yes this thread needs to be moved to the Marketplace(Altcoins) section, as the site doesn’t accept Bitcoins in any form.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Docnaster",
      "created_time": "September 24, 2022, 08:51:28 AM",
      "body": "Quote from: Nrcewker on September 24, 2022, 01:23:42 AMAlso these guys are using a free domain?I mean .xyz seriously? If they aren’t able to afford domain, how they gonna pay for the predictions?Moreover OP also don’t care about the replies and suggestions here from Bitcointalk. After creating the announcement thread, the op has went invisible. So waste of giving suggestions here.And yes this thread needs to be moved to the Marketplace(Altcoins) section, as the site doesn’t accept Bitcoins in any form.Did you say free domain? One thing is that people most times don't pay attention to details, they can do anything they think that works. But this shouldn't be the same when a group or a team is working on a project. Atleast one person should be able to point out some flaws. A project that is out for competition for customer and for reputation shouldn't use a free domain and even if it is paid, it should be paid for atleast 2yrs and more before we can take them seriously.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Slow death",
      "created_time": "September 24, 2022, 10:02:58 AM",
      "body": "The idea is very good, but I have these criticisms:1 - This thread was created on the 8th of this same day and the OP didn't make any other posts in this thread, that is, OP didn't care to know how people are reacting to this idea, OP didn't care to know that doubts or questions people have for him to answer and everyone is clear about what he is doing2 - OP created an account on the 8th and only made 1 post, but he joined the forum on the 14th, I don't understand why he didn't post on the 14th?Name: headstailsPosts: 1Activity: 1Merit: 0Position: NewbieDate Registered: September 08, 2022, 04:38:01 PMLast Active: September 14, 2022, 10:02:36 PM3 - Why did you rush to post a site that is still not working? when I say it's not working I mean the fact that it's not possible to make deposits, forecasts and withdrawals on your site",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nakamura12",
      "created_time": "September 24, 2022, 10:14:32 AM",
      "body": "The idea seems good where they made it easy as to choose yes and no bet where you don't have to do everything yourself. I think they are not serious enough to even launch their project. They didn't even consider buying copper membership to have attractive ann thread and also they use free domain. We can't force them but if they are looking for people to use their platform then atleast they should buy a domain right from the start.Anyway, didn't anyone noticed LUCKMCFLY reply?. The reply seems to mistakenly posted in this thread as it was supposedly in moonbet thread. If I am not wrong about it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "decodx",
      "created_time": "September 24, 2022, 11:08:36 AM",
      "body": "Quote from: Nrcewker on September 24, 2022, 01:23:42 AMAlso these guys are using a free domain?I mean .xyz seriously? If they aren’t able to afford domain, how they gonna pay for the predictions?I don't like .xyz domains either, and I don't think it's a good top level domain for business, but I'm not sure they're free. Maybe some registrars offer a promotional price for the first year, but after that I believe they are paid domains like any other.Quote from: Nrcewker on September 24, 2022, 01:23:42 AMMoreover OP also don’t care about the replies and suggestions here from Bitcointalk. After creating the announcement thread, the op has went invisible. So waste of giving suggestions here.And yes this thread needs to be moved to the Marketplace(Altcoins) section, as the site doesn’t accept Bitcoins in any form.I agree. Since they don't accept bitcoin, this thread is better suited for the altcoins board.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "theskillzdatklls",
      "created_time": "September 24, 2022, 11:23:28 AM",
      "body": "I always think markets like this are always a really cool concept but I never really see them with high liquidity or trust. Usually because of this, volume throughput is poor, and then these sites collapse.But I hope one succeeds sooner or later in a bigger way. It'd be great if there were a major dex out there that operated on a sick level.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hamphser",
      "created_time": "September 24, 2022, 11:43:42 PM",
      "body": "So this one really looks like Fuutur which you would really be betting with some events but this one could really potentially submit out topic which people could really make out a bet.Heads or tails just basically pertaining about yes and no.Just like the rest been saying that this concept or idea had been materialized but ending up on getting not soo much attention.Why? the only issue or main problem with these kind of gambling platforms or betting is that people cant really just wait up that long for them to see their bet results or simplypertaining about patience issues.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fortunecrypto",
      "created_time": "September 25, 2022, 05:26:25 AM",
      "body": "Quote from: headstails on September 08, 2022, 05:19:54 PMHello everyone! I am here to announce the imminent launch of HeadsTails.xyz, a prediction betting platform on the blockchain. We are a team of web3 builders who have been silently putting this together, and are ready to share it!The majority of members do not like the domain extension.xyz because there are many scams associated with this domain extension, although .xyz is now considered a top-level domain the fact still remains that this extension was at one time abused by scammers because many available names are on itQuoteWhat is it exactly?HeadsTails is a community-powered platform for betting on the predictions of real-world events using cryptocurrency. HeadsTails is hosted on Binance Smart Chain, platform currency is BUSD BEP20. Topics span a range of categories, including politics, world events, sports, science, public health, and more.We already have something like that here it is a project called Futuur, it's much better because there is no betting involved other than predicting what will be the result of the events.Quote★ REVENUE SHARING:We are opening the platform to allow you to submit questions and topics of your own writing. If your question passes review and is selected for inclusion on the site, you will earn 1% (up to 2% in the future) of the bet pool! This is ripe for influencers and community organizers - send your community to engage your question, and earn a percentage of everything regardless of the outcome.We'd love to hear what you think! Sounds good but you need to complete the site as it lacks the most important features and information like terms of service, privacy policy, and of course an FAQ one look on your site and I'm lost as I usually begin on the FAQ, TOS, and detailed information about the project, if you don't have it I don't think people will take your site seriously.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dimonstration",
      "created_time": "September 25, 2022, 05:30:26 AM",
      "body": "I though this is a Cara Y Cruz game like because of the name of the casino. This casino is like Futuuur prediction website on any events and price in crypto. The name is not appealing since it’s not relevant to the service that you are offering because there’s an other gambling that has this kind of mechanics which might mistaken for your casino.Profit sharing is good but since you are new and many casino done this before and turn to scam, I doubt many investor will be interested.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "un_rank",
      "created_time": "September 25, 2022, 06:43:20 AM",
      "body": "Quote from: headstails on September 08, 2022, 05:19:54 PMHow does it work?Prediction betting allows you to place bets on the outcome of real-world events. There are other prediction betting sites, but they are needlessly complex. As the name \"HeadsTails\" implies, every topic on the platform is a simple \"yes\" or \"no\" bet, and you are free to bet as much or as little as you like.First reality is that majority of users would come from sports, not politics or science, or world events, so limiting your wager options to just yes or no in sport events, would not be attractive to most gamblers. Having multiple options does not make a website \"complex\" as you call it, it creates options for those who are unsure it team A would win Team B.Focus of simplicity should be the site interactiveness, support for customers, claiming rewards.Quote from: headstails on September 08, 2022, 05:19:54 PMHT has to resolve the question (select a winning answer) within 7 days of the question end date. The resolution source is transparent. If we don’t, users can unstake their tokens. This feature is built into the smart contract. This ensures that when users take part in a question, it will either result in the winnings to be distributed to the users or the funds can be claimed back by the users. HT cannot keep hold of the funds incase a question is not settled and winning answer not chosen.Can you explain more on this?- Jay -",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Daltonik",
      "created_time": "September 25, 2022, 12:29:11 PM",
      "body": "Quote from: headstails on September 08, 2022, 05:19:54 PMHello everyone! I am here to announce the imminent launch of HeadsTails.xyz, a prediction betting platform on the blockchain. We are a team of web3 builders who have been silently putting this together, and are ready to share it!What is it exactly?HeadsTails is a community-powered platform for betting on the predictions of real-world events using cryptocurrency. HeadsTails is hosted on Binance Smart Chain, platform currency is BUSD BEP20. Topics span a range of categories, including politics, world events, sports, science, public health, and more.In my opinion, it is quite an interesting idea to extend the betting system to the social sphere as well, but how in this case the coefficients for this or that event in the life of society will be set, this requires conducting or relying on social surveys, including, well, in any case, it will be interesting to look at the implementation of the HeadsTails project.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cabron",
      "created_time": "September 25, 2022, 12:35:36 PM",
      "body": "There is a reason why this betting platform's announcement was left unnoticed for two weeks because its just not interesting and I thought this is related to flipping a coin. Submitting a question and from there we can bet? I'm sure everyone who know how to use google will really know answers. They are reviewing the questions too and it needs to pass to their criteria. Idk if anyone won't see it as a problem or not really?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AmoreJaz",
      "created_time": "September 25, 2022, 11:36:11 PM",
      "body": "Quote from: cabron on September 25, 2022, 12:35:36 PMThere is a reason why this betting platform's announcement was left unnoticed for two weeks because its just not interesting and I thought this is related to flipping a coin. Submitting a question and from there we can bet? I'm sure everyone who know how to use google will really know answers. They are reviewing the questions too and it needs to pass to their criteria. Idk if anyone won't see it as a problem or not really?they are not yet up so right now, we can't tell yet how they will do in the gambling market. as their payment method is very limited, i believe they will add btc later on as it is the most popular cryptocurrency used in gambling. they have advertisement section also, so we will see if they can really attract some companies here that will pay just to promote by their platform.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "davis196",
      "created_time": "September 26, 2022, 06:31:52 AM",
      "body": "Prediction betting platforms usually don't get the same attention as online casinos and sports betting platforms.I think that it will be really hard for you to build a large customer base of active gamblers. Most sports betting platforms and even crypto casinos can offer the same thing you are offering, but they don't offer such services because they don't see any benefit, probably because 90% of the gamblers don't care about betting on events.1% of the prize pool for submitting event suggestions doesn't seem that much and I don't think anyone would be incentivized to join the platform and suggest any event. I assume that the prize pool will be very small, most of the time.Anyway, good luck with this project, OP.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "headstails",
      "created_time": "October 01, 2022, 12:38:18 PM",
      "body": "Quote from: coin-investor on September 23, 2022, 10:09:27 PMThis announcement goes unnoticed for the last two weeks, I guess it was moved here but I don't think this is the right section for this project as they are not going to accept Bitcoin, and they are on a prelaunch it's better to move it in the altcoin section where it rightly belongs, there is no TOS, no FAQ what you posted here you should also post in your homepage, there's no readable information except your video, its very similar to Futuur but this one with a coin flip.Thanks for your comments!TOS can be read here: https://headstails.xyz/terms-of-useFAQ and documentation can be read here: https://docs.headstails.xyz/These are both accessible from the footer of the homepage.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}