{
  "id": "topic_5444052",
  "title": "Cryptomultiplier",
  "author": "Cryptomultiplier",
  "created_time": "March 08, 2023, 08:30:43 PM",
  "content": "I don't know if am the only one who has had problems recently when trying to complete transactions using mobile apps or USSD codes. Things weren't like this till the new monetary policies and the just concluded presidential  elections came. Am not attributing the poor network reception as the main factor for failed transactions, but it is contributory to why there is consistent failed transactions.*Could there be any other better explanation to why even online transactions and the recent online apps for swift money transfer and other transactions, OPAY, PALMPAY are experiencing same network issue, although it is not as severe as that affecting bank apps and their USSD codes?*What other apps can enable swift transactions without network delay or scammers/hackers issues?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5444052",
  "comments": [
    {
      "author": "Wiwo",
      "created_time": "March 08, 2023, 10:52:37 PM",
      "body": "Due to the poor banking system and the problems experienced by Nigerians from commercial banks, with long queues of unconfirmed transactions to unavailability of the banking services from commercial banks in recent times, millions of Nigerians have now migrated to only digital wallets and other digital microfinance banks such as Opay, Kuda, palm pay and the rest of what have you. -This increase in demands from Nigerians for the digital wallet which has become the best alternative to a commercial bank, has forced many of them to experience overcrowded network congestion since everyone now relies on their networks to carry out transactions without facing any issues. -This overwhelming turnout of events due to the new monetary policy has made those digital wallet networks to become slower and highly congested, so aside from bad internet networks this also contributes largely to what causes the bad and slow transaction process experienced lately by those banks.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptSafe",
      "created_time": "March 09, 2023, 02:17:35 AM",
      "body": "Poor internet service in Nigeria is not a new thing though but ever since the naira swap saga, it became obvious that the Nigerian banks  could not really maintain internet banking service as there was lots of network failure which resulted to failed transactions, delay in crediting  and other banking palava which the citizens need to hurdle through. As a result of the new digital transfer policy, people opted for internet banking service which became overcrowded and caused delay as most banking servers could not be able to contain the traffic hence the errors in transactions, failures and lots more. Banking apps experience is terrible not to talk of the USSD codes. Just yesterday i had to make payment for goods purchased upon payment, i used the banking app and just a click for transaction confirmation, i was debited twice and the receiving bank did not credit the seller till it was evening. I was fast enough to inform the seller so he could be aware before i left and when he received it, he had to return the excess. This should be a good avenue  for massive awareness and adoption of bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Alphakilo",
      "created_time": "March 09, 2023, 05:50:41 AM",
      "body": "The new Naira policy we are facing is the major cause of all banks app failed transaction because the network is congested, a lot of people try to make a transfer at the same time and the banks don't have strong network system that can serve everybody at the same time. USSD is the worst of it. I have multiples of failed transactions that has not been refunded till date. It makes life so difficult because when you want to buy anything you will have to make a transfer. Presently, i think Opay is one of the best financial institution that the network is a bit better than other banks app. I have been using Opay for long now and i have not experienced a failed transactions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Chilwell",
      "created_time": "March 09, 2023, 06:45:43 AM",
      "body": "It has even turned to serious prayer now any time you want to make any transactions been transfer or withdraw. It is no easy in this country we were told there is no white collar job it took us time to adapt with the conditions, now that we have all moved on to survive on our own personal hustling, they still don't want that, that is when the redesign of new naira note comes in, the banks then started having issues saying it is network problem. Then we decided to live their banks for them to join wallet account like Opay, PalmPay and many more, now they have started disturbing our wallet account again. The issues have never experienced in my Opay wallet account is what am facing now. I perform one transaction three days ago I was debited and the receiver place it was still showing pending and it even Opay to Opay. Now you will make a transaction it will be successful but you will not see the transaction in the transaction history. Truly this is getting out of hand.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Obari",
      "created_time": "March 09, 2023, 10:11:24 AM",
      "body": "Quote from: Dr.Bitcoin_Strange on March 08, 2023, 09:45:46 PMWell, that's not a new issue with Nigerian banks; This very period I think the issues are new because if you could agree with me, you'll understand that the network has been so down beyond normal even with virtual banks which wasn't so in the previous times.Just as @chilwell said, it has become a prayer point when making transactions and this things aren't supposed to be so and I think the government rather than making things hard for us, should help lias with Musk to help provide more stable network.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Merit.s",
      "created_time": "March 09, 2023, 04:34:16 PM",
      "body": "Quote from: Cryptomultiplier on March 08, 2023, 08:30:43 PM*Could there be any other better explanation to why even online transactions and the recent online apps for swift money transfer and other transactions, OPAY, PALMPAY are experiencing same network issue, although it is not as severe as that affecting bank apps and their USSD codes?*What other apps can enable swift transactions without network delay or scammers/hackers issues?Poor network and poor banking system is the cause,Emefiele needs Nigeria to go into cashless policy without making sure that the banks upgrade their banking system to meet up with the system, neither did he tell the banks to upgrade their network so that transactions will be easy and faster because there must be congestion in the banking network. We should all relax and hope that all this delay in transactions or poor network is sorted out soon,if not we will be left with no choice than to adapt. Fela say una suffering and smiling. I dey suggest say right now we need to dey reason 5G network.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptopreneurBrainboss",
      "created_time": "March 09, 2023, 05:35:21 PM",
      "body": "Quote from: Wiwo on March 08, 2023, 10:52:37 PM-This increase in demands from Nigerians for the digital wallet which has become the best alternative to a commercial bank, has forced many of them to experience overcrowded network congestion since everyone now relies on their networks to carry out transactions without facing any issues. This na the koko but wait oh, all those banks and digital wallets wan tell me say dem no get maintenance team wey dey look how traffic dey to advice for the increase of system capacity. Okay wait you wan tell me say this banks get customers pass Binance or other cryptocurency apps wey dey transact billions daily from millions of users? The truth be say this banks don't value customer review as they have no effect in the Nigerian market, if na outside make dem mumu this thing and dem go see how their stock go just fall and wipe them out of business.How many months now and the banks never upgrade dem servers, you wan tell me say all those maintenance awof dem dey chop wetin dem dey use am do. So dem no get cash to use maintain their network for a clean transaction. Wetin come dey pay me na this digital wallets, they're meant to be digital yet they're following the footsteps of the banks. See kuda wey been dey do everybody well but from no where dey dun Join dem even OPay of all people. Why this digital banks no go get better server. We dey truely surfer for this country, e just be like dem all gather hold meeting for our head to frustrate us.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wiwo",
      "created_time": "March 09, 2023, 05:43:35 PM",
      "body": "Quote from: CryptopreneurBrainboss on March 09, 2023, 05:35:21 PMHow many months now and the banks never upgrade dem servers, you wan tell me say all those maintenance awof dem dey chop wetin dem dey use am do. So dem no get cash to use maintain their network for a clean transaction. Wetin come dey pay me na this digital wallets, they're meant to be digital yet they're following the footsteps of the banks. See kuda wey been dey do everybody well but from no where dey dun Join dem even OPay of all people. Why this digital banks no go get better server. We dey truely surfer for this country, e just be like dem all gather hold meeting for our head to frustrate us. The thing be say I no believe say Nigerian banks go ever upgrade their services since their still depend largely on ledger and manual book keeping to keep track of transaction, and the digital wallets that managed to integrate some element of e-book keeping and other online features that make them look near ok for Nigerians and since the traditional banking system are designed poorly just to suite the desires of the burgiioagies and influential and corrupt government officials. -the reason why blockchain stands out in transaction processing and networks consumption Binancee fall in this category and trying to compare binance to any traditional banking system,  is like comparing the speed of an aeroplane vs a bicycle.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fivestar4everMVP",
      "created_time": "March 09, 2023, 06:21:53 PM",
      "body": "Quote from: CryptopreneurBrainboss on March 09, 2023, 05:35:21 PMQuote from: Wiwo on March 08, 2023, 10:52:37 PM-This increase in demands from Nigerians for the digital wallet which has become the best alternative to a commercial bank, has forced many of them to experience overcrowded network congestion since everyone now relies on their networks to carry out transactions without facing any issues. How many months now and the banks never upgrade dem servers, you wan tell me say all those maintenance awof dem dey chop wetin dem dey use am do. So dem no get cash to use maintain their network for a clean transaction. Wetin come dey pay me na this digital wallets, they're meant to be digital yet they're following the footsteps of the banks. See kuda wey been dey do everybody well but from no where dey dun Join dem even OPay of all people. Why this digital banks no go get better server. We dey truely surfer for this country, e just be like dem all gather hold meeting for our head to frustrate us. Everything wey you yarn na correct my man, just like op dey ask whether na only him dey experience the really bad network thing when transacting using his banking app or ussd, the truth of the matter be say na general something, the one wey dey pain me pass na opay, opay na where I run enter as a safe heaven from all this major banks brouhaha, e surprise me say Opay self don dey act up small small.I get account with zenith bank, GT bank, and Access bank, I leave all of them switch to opay for better service, but now, the thing don dey really become really frustrating..And one question wey I dey always ask be say, na this kind network na im federal government and central bank say make we take enter cashless society???I really tire for Nigeria make I no lie 🤥.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wiwo",
      "created_time": "March 09, 2023, 08:39:40 PM",
      "body": "Quote from: Fivestar4everMVP on March 09, 2023, 06:21:53 PMAnd one question wey I dey always ask to be say, na this kind network na im federal government and central bank say make we take enter cashless society???I am realtiredire of Nigeria make I no lie 🤥. Baba the mata tie rapper oooo, because with the way things dey go now, we really need an overhaul upgrade of our traditional banking systems because the level of hustle Nigerians dey goes through now done double e come to be like say when you work to make the money, you go do x2 work to spend the money again this na inside life for 9ja 4all of us ooo. -Now the question where I dey asks myself be said if thing dey hard for is were get knowledge about alternative currencies such as Bitcoin we're we dey use do transaction now if not we're we for end up. -How are those who are unbanked surviving at the moment our every transaction na either through transfer or pos? -The 5G network fit help with this matter?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cryptomultiplier",
      "created_time": "March 09, 2023, 08:54:45 PMLast edit: March 12, 2023, 09:33:16 PM by Cryptomultiplier",
      "body": "As the matter be, some places around Lagos are reported to have started accepting the old Naira notes, while some are still contemplating, waiting for who would begin the collection. Even bank sef no get network, as the matter be so. Is this the kind of network the BVAS capture machine would use in uploading results of oncoming governorship elections?Let's be praying sha. It will soon be over I believe.*For those who use Access bank, the USSD code for transfer is *710#. It is no longer the former which was *901#.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wiwo",
      "created_time": "March 10, 2023, 11:24:40 PM",
      "body": "Quote from: Cryptomultiplier on March 09, 2023, 08:54:45 PMAs the matter be, some places around Lagos are reported to have started accepting the old Naira notes, while some are still contemplating, waiting for who would begin the collection. Even bank sef not get network, as the matter be so. Is this the kind of network the BEVAS capture machine would use in uploading results of oncoming governorship elections?Let's be praying sha. It will soon be over I believe.*For those who use Access bank, the USSD code for transfer is *710#. It is no longer the former which was *901#.The issue with recycling of the old naira note have been greeted with a lot of misconceptions and this has resulted in divided conclusion as regards that subject matter, and I saw from my inner eyes that both the CBN, and Supreme Court are working hand in hand, if not why will it take supreme court thos long to make this judgement and what are the measures put in place to ensure strick adherence to the Supreme Court judgement by the cbn. -I go access the bank on Monday and the bank offered to pay me the old naira notes in 1000 denominations but with a condition that I could not return it back to the bank if rejected by the general public if I want to deposit it back I will have to go to CBN to do so, so I had to reject their offer and walk away, what Nigerians want fo to hear is a statement from the central bank governor or Buhari on the status of the old Naira notes. 3",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zanab247",
      "created_time": "March 11, 2023, 06:04:45 AM",
      "body": "Infact, d network failure is adding to the hardship cashless policy is causing in our country. Network will not allow transaction to be successful, and some people will send money to their love ones but they will not receive the money and the sender will be debited which is really causing some fear to people not to accept transfer in their various businesses. If dis bad network continue till next month, I guess there will be a massive damage in people business and it will also affect many POS business too. If bank and opay can lack network in this season, what is the way forward? Hope MTN, GLO and Airtel will not experience the same thing soon.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SatoPrincess",
      "created_time": "March 12, 2023, 06:59:00 PM",
      "body": "I’ve had bad experiences with USSD code before and promised myself never to use it again. It’s a shame that the banks have not been able to perfect the ussd transfer, most times wire transfers done through this method have problems. For this reason I only use mobile bank apps, the transaction receipt on mobile app always put to rest doubts or disputes. Some banks have a WhatsApp bot where you can make wire transfers, and personally I haven’t had problems with that either.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BIT-BENDER",
      "created_time": "March 12, 2023, 08:40:45 PM",
      "body": "How far guys how una Dey, I no understand the levels the country they head to anymore. First them been talk say the cash less issues, na to better the country economy and on the side prevent election corruption.The presidential election is over, no be only just that The Supreme Court has ordered the use of the old note until December 31st but yet the presidency hasn’t said anything yet now coupled with network and transactions problems.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hyphen(-)",
      "created_time": "March 12, 2023, 09:30:26 PM",
      "body": "Quote from: Cryptomultiplier on March 08, 2023, 08:30:43 PMI don't know if am the only one who has had problems recently when trying to complete transactions using mobile apps or USSD codes. Things weren't like this till the new monetary policies and the just concluded presidential  elections came. Am not attributing the poor network reception as the main factor for failed transactions, but it is contributory to why there is consistent failed transactions.*Could there be any other better explanation to why even online transactions and the recent online apps for swift money transfer and other transactions, OPAY, PALMPAY are experiencing same network issue, although it is not as severe as that affecting bank apps and their USSD codes?*What other apps can enable swift transactions without network delay or scammers/hackers issues?This network problem don de promote go to another level, I know say this cashless policy no go last long because we know to say we no get a better network wey go fir run am; Every working day now, if you go bank, you go see crowed and 90% of them come to complain of incomplete transactions.Bank apps no de work again for the afternoon, sometimes person need to wait for the night before they fit do a successful transaction, I just hope say Government go do something about this cashless policy after the election.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cryptomultiplier",
      "created_time": "March 12, 2023, 09:40:59 PMLast edit: March 13, 2023, 10:20:10 PM by Cryptomultiplier",
      "body": "Quote from: Wiwo on March 10, 2023, 11:24:40 PMQuote from: Cryptomultiplier on March 09, 2023, 08:54:45 PMAs the matter be, some places around Lagos are reported to have started accepting the old Naira notes, while some are still contemplating, waiting for who would begin the collection. Even bank sef not get network, as the matter be so. Is this the kind of network the BEVAS capture machine would use in uploading results of oncoming governorship elections?Let's be praying sha. It will soon be over I believe.*For those who use Access bank, the USSD code for transfer is *710#. It is no longer the former which was *901#.The issue with recycling of the old naira note have been greeted with a lot of misconceptions and this has resulted in divided conclusion as regards that subject matter, and I saw from my inner eyes that both the CBN, and Supreme Court are working hand in hand, if not why will it take supreme court thos long to make this judgement and what are the measures put in place to ensure strick adherence to the Supreme Court judgement by the cbn. -I go access the bank on Monday and the bank offered to pay me the old naira notes in 1000 denominations but with a condition that I could not return it back to the bank if rejected by the general public if I want to deposit it back I will have to go to CBN to do so, so I had to reject their offer and walk away, what Nigerians want fo to hear is a statement from the central bank governor or Buhari on the status of the old Naira notes. 3I think us waiting for the President or any other superior to make a statement is like waiting for snow to fall in hell. Would their ego or pride let them admit to the current hardship they have put Nigerians in? E no concern them. They have access to the new Naira notes, why would they bother about the plight of the common man who needs cash, but is offered old notes which can't be spent easily instead?Na we go begin dey campaign to traders or merchants that they should start accepting the old notes, because na watin bank give us o. I have succeeded in spending my old #500naira today, without much convincing. Infact, it was the trader telling me to come and buy, he accepted the old notes joyfully as well.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sokani",
      "created_time": "March 13, 2023, 01:30:04 PM",
      "body": "Before now, many banks have poor banking infrastructures and the new CBN cashless policy brought about a surge in online transactions as individuals and SMEs are resorting to online transactions like POS and bank transfers. As such there are lot of traffic which is one of the reasons for the poor network, delay and failed transactions. I was debited 5k by UBA last 2weeks when I wanted to make a transfer, I was lucky it got reversed after 5days. I've three digital wallets Opay, Alat and Chippercash, so far I think I'm more satisfied with Opay services as I rarely encounter issues when performing transactions with it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Belarge",
      "created_time": "March 13, 2023, 04:35:32 PM",
      "body": "Due to the way the country be na wey be say money no dey anywhere and the kind charge wey POS people dey collect don make people dey do only online transactions, and the level of online banking transactions wey people dey do now come plenty well well pass before nai come dey make bank network dey worry, (na so me I think o)because every body come dey buy and sale their commodities just with online banking transactions only, so now e don choke...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}