{
  "id": "topic_5470731",
  "title": "ben-adembaba",
  "author": "ben-adembaba",
  "created_time": "October 17, 2023, 10:19:49 PMLast edit: March 03, 2024, 12:15:26 AM by ben-adembaba",
  "content": "Php ile geliştirmekte olduğum botu sizlere kısaca özetlemek isterim.Tabiiki proje geliştiriliyor ve sizlerin fikirlerine ihtiyacım var.Modüler şekilde tasarladım. İstenilen borsa eklenebilir.Yani sadece tek bir borsaya yönelik değil.Checkers Diye Modül bölümü koydum.Burayada Pump Dump ve Fiyat Karşılaştırması gibi 2 eklenti koydum.Yani başka şeylerde eklenebilir.Websocket Destekli.Yani Çalışma mantığı şu şekildeÖnce Sunucu çalışıyor.Sonrasında Borsa eklentileri çalışmaya başlıyor.Güncel fiyatlar önbelleğe kaydediliyor.Sonrasında Sunucu bu bilgileri Checker Modüllerine gönderip orda analiz edilip bilgi verilmesini sağlıyor.Yazılacak olan Checker modüllerini tipine göre veri oluşturulup gösteriliyor.Telegram vs gibi platformlara auto gönderim yapılabiliyor.İstenirse Uzaktaki sunuculardanda Sunucuya veri gönderilebiliyor.Test etmek için bir telegram kanalı açtım.https://t.me/FaalSoftCoinBot@FaalSoftCoinBotPump & Dump Price Differencehttps://t.me/FaalSoftCoinBotDiffBakıp fikirlerinizi yazarsanız çok makbule geçer.Ekran Görüntülerihttps://gcdnb.pbrd.co/images/n7J8sQu7IrUL.jpg?o=1https://gcdnb.pbrd.co/images/lAkeAyJ55GWn.jpg?o=1Saygılarımla Adem Çelik",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5470731",
  "comments": [
    {
      "author": "Vispilio",
      "created_time": "October 18, 2023, 12:15:46 AM",
      "body": "Fikir temel olarak güzel, ancak şunu belirtmeliyiz herhangi bir botun işe yaraması için insan faktörünü minimize etmesi gerekiyor, yani burada karşılaştırmayı yaptık, bir sonraki adım alım satım yapmak olmalı ki bot hız avantajını kullanabilsin, özellikle bu tarz stratejilerde rakipleriniz diğer botlar olduğu için hız çok önemli.Kullanıcı seçtiği çiftlerde belli parametreler girmeli, onlara göre bot belli bir yüzde farkı oluştuğu anda işlem açmalı ki gerçek anlamda bir test olsun. Örnek: Loom'da bir borsada 3% ve üzeri artış olursa, diğerinde al gibi... bu şekilde bir özelliği mutlaka eklemenizi tavsiye edebilirim.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "wolwoo",
      "created_time": "October 25, 2023, 10:38:35 AM",
      "body": "benim kafamda da binance future ile sınırlı \"yapay zeka botu\" var. 10k$ atıp her pairde seri şekilde 50 dolar ile işlem yapabilecek ve sınırlı kar marjı ile hareket edecek öğrenme yeteneği olan bi bot gerekiyor. PARA BASAR AQ Geçmiş verileri yükleyeceksin, tüm teknik temel analiz ve sosyal medya verilerini eklenti yapacaksın. hatta duygusal zeka da ekleyeceksin. iki güne kalmaz anaparayı alırsın, sonra marjı biraz daha arttırırsın, manyaq bişi olur",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ben-adembaba",
      "created_time": "October 26, 2023, 02:51:13 PM",
      "body": "Son olarak pump dumpa düşen coinlerin diğer borsalarla fiyat karşılaştırmasını ekledim.Yeni bir kanal açtım.Pump & Dump Price Differencehttps://t.me/FaalSoftCoinBotDiffYorumlarınızı bekliyorum",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}