{
  "id": "topic_5474614",
  "title": "alegotardo",
  "author": "alegotardo",
  "created_time": "November 19, 2023, 03:04:36 AM",
  "content": "Acabei de ler o título dessa notícia que me deixou intrigado: El Salvador não sai do vermelho mesmo após Bitcoin disparar mais de 100%E segue falando que a perda com esse investimento ainda é de US$ 16 milhões.Achei bem estranho porque eu já havia lido reviews contrários de que El Salvador finalmente estava começando a \"colher frutos\" de seu investimento visionário em Bitcoin, o qual infelizmente foi feito em um péssiomo momento pois o Bitcoin despencou nos anos seguintes, mas que com essa recuperação tudo estava entrando no eixo.Mas então, oque está acontecendo!?A matéria não é muito clara, mas pelo pouco que diz, parece que essa subida do Bitcoin realmente ajudou, porém pelo preço médio com que Bukele comprou Bitcoin nesse tempo todo, essa recuperação no preço do Bitcoin ainda não foi o suficiente.Além de que, a poppulação não ajudou o presidente, muitos poucos adotaram o Bitcoin como moeda, bem diferente da visão que nós estrangeiros temos vendo aqui de fora.Será que El Salvador ainda irá operar no verde? Eu tenho certeza de que sim, mas quando?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5474614",
  "comments": [
    {
      "author": "tg88",
      "created_time": "November 19, 2023, 01:08:56 PM",
      "body": "Acho que não errou ao investir em BTC mas errou um pouco a mão no momento das entradas e acabou ficando sem recursos para comprar BTC a preços mais baixos não conseguindo um bom preço médio. Acredito que o pior momento já passou, difícil foi segurar todo esse tempo e daqui pra frente deve se encaminhar para um caso de sucesso. Logo teremos eleições por lá e vamos ver como ficam as coisas.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "November 19, 2023, 05:20:06 PM",
      "body": "Quote from: alegotardo on November 19, 2023, 03:04:36 AMAcabei de ler o título dessa notícia que me deixou intrigado: El Salvador não sai do vermelho mesmo após Bitcoin disparar mais de 100%E segue falando que a perda com esse investimento ainda é de US$ 16 milhões.16 milhões de dólares não é absolutamente nada para um país, por menor que seja. O gasto mensal com salários de qq repartição publica chega em milhões de dólares por mês.Não sei de onde veio esse dado, mas isso não faz sentido.De qq forma , a adoção de bitcoin pode trazer muito pro país, em turismo,  investidores, empresas  etc,  em uma ordem de grandeza de centenas de vezes esse valor",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "November 20, 2023, 01:54:19 PM",
      "body": "Mas isso é muito subjetivo.Se eles não venderem, não tem o dinheiro em caixa para pagar as suas despesas.Isso só faria sentido dizer, se eles pagassem as contas em BTC, coisa que não fazem, até porque os compromissos internacionais não aceitam bitcoin.Por outro lado, qual foi a rentabilidade que tiveram de investimento estrangeiro e turismo, por causa dessa medida?Acredito que só em turismo, já recuperaram bastante. Porque mesmo que os turistas não paguem em Bitcoin, o simples facto de terem aparecido mais nas noticias, deve ter motivado muitos a irem visitar o país.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Paredao",
      "created_time": "November 20, 2023, 03:37:01 PM",
      "body": "Quote from: joker_josue on November 20, 2023, 01:54:19 PMMas isso é muito subjetivo.Se eles não venderem, não tem o dinheiro em caixa para pagar as suas despesas.Isso só faria sentido dizer, se eles pagassem as contas em BTC, coisa que não fazem, até porque os compromissos internacionais não aceitam bitcoin.Por outro lado, qual foi a rentabilidade que tiveram de investimento estrangeiro e turismo, por causa dessa medida?Acredito que só em turismo, já recuperaram bastante. Porque mesmo que os turistas não paguem em Bitcoin, o simples facto de terem aparecido mais nas noticias, deve ter motivado muitos a irem visitar o país.Continuam sendo uma republiqueta de bananas da America Central. Quem vai querer visitar um País onde se tem a maior prisão da america  Deve ser um País ótimo para se visitar. Não é por causa que o Governo apoia o Bitcoin que vou achar que aquilo é um paraíso. Isso não é. Quase 2% da população está na cadeia. Terrível.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rdluffy",
      "created_time": "November 20, 2023, 05:56:17 PM",
      "body": "Eu acho difícil de medir a adoção do BTC por lá, porque não é só a valorização / desvalorização que deve ser levada em contaTem bastante coisa a maisJá divulgaram que ajudou bastante o turismoPerda de 16 milhões não parece muito falando de um país e essa \"perda\" também é bem subjetiva já que o objetivo do país não é fazer tradeTem a mineração de BTC do país que tem que ser levado em consideração, já que irão gerar BTC com custo mais baixo e poderão vender com lucros ou injetar na economia do país",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "November 20, 2023, 07:41:46 PM",
      "body": "Quote from: Paredao on November 20, 2023, 03:37:01 PMContinuam sendo uma republiqueta de bananas da America Central. Quem vai querer visitar um País onde se tem a maior prisão da america  Deve ser um País ótimo para se visitar. Não é por causa que o Governo apoia o Bitcoin que vou achar que aquilo é um paraíso. Isso não é. Quase 2% da população está na cadeia. Terrível.Olha a violência no México ou no Brasil? E não é por isso que as pessoas deixam de visitar esses países.O ponto aqui é que El Salvador tem aparecido muito mais vezes nas noticias, do que antes. E isso normalmente atrai as pessoas a visitar, mesmo que não tenham nada relacionado com o Bitcoin. Simplesmente visitam, porque é falado.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Paredao",
      "created_time": "November 20, 2023, 07:45:47 PM",
      "body": "Quote from: joker_josue on November 20, 2023, 07:41:46 PMO ponto aqui é que El Salvador tem aparecido muito mais vezes nas noticias, do que antes. E isso normalmente atrai as pessoas a visitar, mesmo que não tenham nada relacionado com o Bitcoin. Simplesmente visitam, porque é falado.Agora estou curioso. Muitos lugares são falados e nem por isso recebem visitas. Me diga o que tem de ponto turístico em El Salvador ? Alguma ruína dos tempos dos Maias ? Algum paraíso ecológico? Algum lugar para prática de algum esporte radical ? Ou apenas a maior prisão das Américas",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "November 20, 2023, 07:59:39 PM",
      "body": "Quote from: Paredao on November 20, 2023, 07:45:47 PMAgora estou curioso. Muitos lugares são falados e nem por isso recebem visitas. Me diga o que tem de ponto turístico em El Salvador ? Alguma ruína dos tempos dos Maias ? Algum paraíso ecológico? Algum lugar para prática de algum esporte radical ? Ou apenas a maior prisão das Américas Nunca fui lá... não pesquisei a fundo, mas tem pontos que atrai muito turista, tais como praias e parques naturais vulcânicos.Mas também tem pontos relacionados com os Maias, como Sítio arqueológico de Joya de Cerén (patrimônio da UNESCO), e o Tazumal, ou o San Andres.Isto foi só um apanhado rápido que fiz aqui: https://www.tripadvisor.pt/Attractions-g294475-Activities-oa30-El_Salvador.htmlSe me convence a visitar? Bem, isso já é outra questão. Historicamente falando, tenho muita coisa excelente para ver mais perto.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "November 20, 2023, 10:53:32 PM",
      "body": "Quote from: joker_josue on November 20, 2023, 07:41:46 PMOlha a violência no México ou no Brasil? E não é por isso que as pessoas deixam de visitar esses países.Concordo que o bitcoin pode trazer muitos benefícios de turismo pra El Salvador,  assim como de investidores.Mas segurança é um grande problema no Brasil  e em toda a América Latina, e perdemos muitos turistas por ano por isso.Em viagens já falei com muitos estrangeiros de países desenvolvidos que sempre me perguntam sobre a segurança (e muitos deixam de vir por isso) e se é seguro vir aqui. E sempre digo o mesmo: vale a pena vir, mas aqui não é seguro.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tg88",
      "created_time": "November 20, 2023, 11:11:29 PM",
      "body": "Quote from: Paredao on November 20, 2023, 07:45:47 PMAgora estou curioso. Muitos lugares são falados e nem por isso recebem visitas. Me diga o que tem de ponto turístico em El Salvador ? Alguma ruína dos tempos dos Maias ? Algum paraíso ecológico? Algum lugar para prática de algum esporte radical ? Ou apenas a maior prisão das Américas El salvador é super famoso entre o pessoal do Surf, o rdluffy já tinha comentado aqui que já \"conhecia\" El Salvador devido a sua grande fama neste esporte. Aposto que deve ter muita coisa para conhecer sim, se a sua fundação liberar uma pequena verba posso  ir lá mapear e garimpar pontos turísticos além de fazer um guia especial para brasileiros  .",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Paredao",
      "created_time": "November 23, 2023, 07:35:46 PM",
      "body": "Quote from: tg88 on November 20, 2023, 11:11:29 PMse a sua fundação liberar uma pequena verba posso  ir lá mapear e garimpar pontos turísticos além de fazer um guia especial para brasileiros  .Não vai dar. Ultimamente minha fundação cuida em tratar os viciados em shitcoins para que eles tentem sair do vício. O vício em shitcoins é algo bem pesado. O sujeito compra a porcaria, perde dinheiro com ela e continua comprando outras shitcoins. Desse modo enriquecendo desenvolvedores que criam a porcaria e depois somem do mapa. Deveriam criar leis mais rigorosas contra essas pessoas. Deveriam ter penas equiparadas a traficantes.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "criptoevangelista",
      "created_time": "November 23, 2023, 10:45:26 PM",
      "body": "Quote from: Paredao on November 23, 2023, 07:35:46 PMQuote from: tg88 on November 20, 2023, 11:11:29 PMse a sua fundação liberar uma pequena verba posso  ir lá mapear e garimpar pontos turísticos além de fazer um guia especial para brasileiros  .Não vai dar. Ultimamente minha fundação cuida em tratar os viciados em shitcoins para que eles tentem sair do vício. O vício em shitcoins é algo bem pesado. O sujeito compra a porcaria, perde dinheiro com ela e continua comprando outras shitcoins. Desse modo enriquecendo desenvolvedores que criam a porcaria e depois somem do mapa. Deveriam criar leis mais rigorosas contra essas pessoas. Deveriam ter penas equiparadas a traficantes.   Existem dois tipos de shitcoinheiros, um que ainda é leigo e acha que comprar uma baby doge, baby luna e baby bnb da vida ele vai ficar rico, achando que um dia essas porcarias irão valer 1 dolar, esses ainda tem salvação, basta fazer uma evangelização de precisão para salvar a alma da criatura.... E tem o shitcoinheiro profissional, este conhece a verdade mas o amor pelo dinheiro e pelas coisas fúteis o corrompe... este é o tipo que mais vemos no youtube por exemplo.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "darkv0rt3x",
      "created_time": "November 23, 2023, 10:57:23 PM",
      "body": "Quote from: alegotardo on November 19, 2023, 03:04:36 AMAcabei de ler o título dessa notícia que me deixou intrigado: El Salvador não sai do vermelho mesmo após Bitcoin disparar mais de 100%E segue falando que a perda com esse investimento ainda é de US$ 16 milhões.Achei bem estranho porque eu já havia lido reviews contrários de que El Salvador finalmente estava começando a \"colher frutos\" de seu investimento visionário em Bitcoin, o qual infelizmente foi feito em um péssiomo momento pois o Bitcoin despencou nos anos seguintes, mas que com essa recuperação tudo estava entrando no eixo.Mas então, oque está acontecendo!?A matéria não é muito clara, mas pelo pouco que diz, parece que essa subida do Bitcoin realmente ajudou, porém pelo preço médio com que Bukele comprou Bitcoin nesse tempo todo, essa recuperação no preço do Bitcoin ainda não foi o suficiente.Além de que, a poppulação não ajudou o presidente, muitos poucos adotaram o Bitcoin como moeda, bem diferente da visão que nós estrangeiros temos vendo aqui de fora.Será que El Salvador ainda irá operar no verde? Eu tenho certeza de que sim, mas quando?Acho que os resultados vão depender muito de quem os publicar! Imagina que quem está a publicar resultados, vê Bitcoin como uma má aposta. Certamente que vai dar foco aos aspectos menos positivos que Bitcoin pode introduzir numa sociedade ainda não habituada a determinados conceitos digitais. Lemrbo-me de ver várias manifestações da população contra Bitcoin. Porque é complicado, porque é preciso mexer em telefones e os mais velhos tinham dificuldades, porque é uma criptomoeda por si só etc, etc.Se for alguém pro-Bitcoin, certamente que se vai focar em publicar tudo o que é positivo, e então acaba sempre por ser um bocado subjectiva a interpretação dos resultados por parte de quem os publica/estuda/etc.Na minha opinião, essa lenga-lenga de estar a perder ainda 16 milhões, é só farsa, porque só existe perda efectiva se o governo vender Bitcoin e acabar com menos 16 milhões do que aquilo que investiu e isso não aconteceu!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tg88",
      "created_time": "December 04, 2023, 04:28:12 PM",
      "body": "Com a alta do BTC deste fim de semana Bukele aproveitou para tuitar e comemorar que finalmente o preço do BTC voltou a ficar acima do preço médio das compras realizadas por El Salvador. Ele postou esse gráfico indicando todos os aportes feitos fechando um PM de (US$ 40.479), atualmente eles estão com um \"lucro\" de + - 3% totalizando 3 milhões de dólares no positivo.Claro que se for fazer as contas desde de 2021 esse investimento está longe de bater a inflação, mas no longo prazo deve dar bastante resultado.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "December 04, 2023, 07:13:33 PM",
      "body": "Quote from: tg88 on December 04, 2023, 04:28:12 PMCom a alta do BTC deste fim de semana Bukele aproveitou para tuitar e comemorar que finalmente o preço do BTC voltou a ficar acima do preço médio das compras realizadas por El Salvador. Ele postou esse gráfico indicando todos os aportes feitos fechando um PM de (US$ 40.479), atualmente eles estão com um \"lucro\" de + - 3% totalizando 3 milhões de dólares no positivo.Esse gráfico é bem interessante. É apenas imagem, ou tem link oficial para ver em tempo real?O único ponto chato é que a primeira compra ocorreu semanas antes da alta acabar e o preço descer a pique. Apesar de ter sido bom para novas compras, criou um preço médio alto. Mas, daqui a uns tempos já terá recuperado.Só volta mesmo começarem aparecer mais iniciativas em El Salvador ligados ao Bitcoin. Mas, isso as vezes demora, e muita coisa já pode estar a ser feita.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sabotag3x",
      "created_time": "December 04, 2023, 07:19:58 PM",
      "body": "Quote from: joker_josue on December 04, 2023, 07:13:33 PMEsse gráfico é bem interessante. É apenas imagem, ou tem link oficial para ver em tempo real?O site é esse: https://nayibtracker.com/O Bukele esperou 2 anos para comemorar e já voltou pro vermelho  Aos interessados por El Salvador, recomendo essa leitura de um cara que foi lá visitar: https://twitter.com/MacroScope17/status/1731152754372903134",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "December 04, 2023, 07:58:42 PM",
      "body": "Quote from: sabotag3x on December 04, 2023, 07:19:58 PMQuote from: joker_josue on December 04, 2023, 07:13:33 PMEsse gráfico é bem interessante. É apenas imagem, ou tem link oficial para ver em tempo real?O site é esse: https://nayibtracker.com/Pelo o que percebi o site não foi feito por ele, mas apresenta a informação de forma simples, com base nas informações que o Bukele publica.O facto de ele referenciar esse site, é porque confirma que os dados estão corretos.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Paredao",
      "created_time": "December 04, 2023, 08:09:53 PM",
      "body": "Quote from: sabotag3x on December 04, 2023, 07:19:58 PMAos interessados por El Salvador, recomendo essa leitura de um cara que foi lá visitar: https://twitter.com/MacroScope17/status/1731152754372903134Li o twitter do cidadão. Realmente, parece que El Salvador é o \"paraíso na terra\". Fiquei até tentado a ir fazer uma visita por lá. Será que eles gostam de brasileiros? Acredito que basta balançar umas doletas nas caras dos nativos e eles te tratam como um Rei. Mais um Republiqueta Bananeira da America Central.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sabotag3x",
      "created_time": "December 05, 2023, 09:11:45 PM",
      "body": "Quote from: Paredao on December 04, 2023, 08:09:53 PMLi o twitter do cidadão. Realmente, parece que El Salvador é o \"paraíso na terra\". Fiquei até tentado a ir fazer uma visita por lá. Será que eles gostam de brasileiros? Acredito que basta balançar umas doletas nas caras dos nativos e eles te tratam como um Rei. Mais um Republiqueta Bananeira da America Central.     concordo que deve conter um pouco de exagero.. mas deve ser mais atrativo que as notícias do Brasil, onde estão taxando tudo que enxergam..Espero que algum dia o Brasil tome um rumo parecido.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}