{
  "id": "topic_5456356",
  "title": "Question:",
  "author": "OgNasty",
  "created_time": "June 14, 2023, 05:53:56 PM",
  "content": "With the Fed set to make an announcement today on the future of their overnight rate, investors are all watching and waiting to see how the market will react.  What do you think the Fed should do?  Should they continue raising rates until inflation is completely squashed and the job market sees an increase in unemployment to above desired levels? or should they stop raising rates out of fear of sending the economy into a recession and causing another real estate crash?  Maybe you think they should get ahead of a recession and lower rates to keep the economy booming?  What do you think?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5456356",
  "comments": [
    {
      "author": "dansus021",
      "created_time": "June 15, 2023, 01:02:44 AM",
      "body": "Either they should be lowering the interest rate or they should keep the interest right now the economy still up and down after what is going on in the world especially in the United States pandemic hit, ongoing war, global supply disrupt, bank collapse, US hit the debt ceiling well I think there is lot other things too. According to BBC \"Raising interest rates helps to control inflation by making it more expensive to borrow money\" https://www.bbc.co.uk/news/business-57764601 tho in the current situation I think is not a good idea.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "adaseb",
      "created_time": "June 15, 2023, 04:14:30 AM",
      "body": "They paused but they said they would raise 2 more times before the end of the year. But the bond markets are saying otherwise. They don’t think they will hike and they are saying the fed will lead the US into a recession but the inverted yield curve is widening again like in March.It means traders believe that the fed will lead the country into a deep recession and the yield curve will revert where the long dated bonds are priced higher than the short dated bonds. However we need more economic data like the employment numbers to see if this will happen.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Tytanowy Janusz",
      "created_time": "June 15, 2023, 09:02:26 AM",
      "body": "Lowering interest rates will affect in similar scenario to 1970 and 1940 - another, even greater wave of inflation, even harder to stop. So should they rise more? I don't think so because real interest rates (CPI adjusted) are positive and above 1% which is the best in like 15 years starting from last financial crysis. There is no need to rise it higher especially that next month CPI  is expected to go below 3.5% bringing real interest rates to around 2% - best in 25 years. They should stop and wait for 6-12 months not doing anything.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "btc_angela",
      "created_time": "June 15, 2023, 12:33:40 PM",
      "body": "Is this the reason why the price suddenly drops again? Although they said that they are going to hold off for now and there are 2 more coming this year.  i'm not based on the US though so I might not be familiar with the subject matter.And it just interesting though on the effects on the price of crypto and maybe the stock market as well.So let's see, the price of bitcoin is <$25k as of this writing so yeah, it seems that even it if paused for now, the effects have been felt already.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Tytanowy Janusz",
      "created_time": "June 15, 2023, 02:38:26 PM",
      "body": "Quote from: btc_angela on June 15, 2023, 12:33:40 PMIs this the reason why the price suddenly drops again?It was not the reason for the dump, because the market was convinced that such a decision of the federation would be made. The CME fedwatch tool showed over 95% probability of FED stopping rate hikes. So the fed's decision did not surprise anyone and it should have been priced in long ago. Proof of this can be the fact that both the SP500 and gold did not record pump/dump, there was only a short period of increased volatility.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "el kaka22",
      "created_time": "June 15, 2023, 03:22:46 PM",
      "body": "I think it shouldn't really matter at this pace because they can make it as high as they want, it is going to bankrupt a lot of banks, and when the banks are bankrupting left and right, that will weaken the economy and when the economy is weakened we are going to see bitcoin price go a lot higher. People are looking at the price today and making a prediction, but imagine what's going to happen in a year. In a year either the rates will be lowered, or if they keep it high a lot of banks will bankrupt, and we will have a halving as well, combine all these together and we are going to have a super skyrocketing breakout price that will be above ATH without a question. This is a wrong move but their wrong move works very well for us in the end.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "thecodebear",
      "created_time": "June 15, 2023, 03:29:01 PM",
      "body": "Was very surprising the price dropped $1000 due to the Fed's statements. I expected an immediate $1000 increase to $27k, instead it was an immediate $1000 drop.They didn't hike the rate, which is what people expected, and would have likely led to a $1000 or more boost in Bitcoin's price in the aftermath, which is what I expected. But I guess everyone is freaking out because the Fed said two more rate hikes are likely later this year. Basically the Fed just wants people to know they are still open to the possibility of a couple more hikes if inflation doesn't keep going down steadily in the coming months in the absence of rate hikes. But this apparently reallllly freaked out the Bitcoin market, which is why we got the $1000 drop. Alternatively maybe just some big whales used that news as a reason to try to scare people and sold en masse to drop the price and get in lower and the market reacted by getting scared. Either way, I would expect $25k to not last long and we'll see the price at least come back to $26k in the coming days as there is really no reason to be scared.But of course the SEC attacking crypto will drag on until Congress actually does something about crypto regulations so Bitcoin price growth should be expected to be more of a grind upward than a jump upward in at least the mid-term than from what we would normally expect at this point in the market cycle when the bear market has ended and Bitcoin is recovering into the next big bull market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "thecodebear",
      "created_time": "June 15, 2023, 03:34:05 PM",
      "body": "Quote from: el kaka22 on June 15, 2023, 03:22:46 PMI think it shouldn't really matter at this pace because they can make it as high as they want, it is going to bankrupt a lot of banks, and when the banks are bankrupting left and right, that will weaken the economy and when the economy is weakened we are going to see bitcoin price go a lot higher. People are looking at the price today and making a prediction, but imagine what's going to happen in a year. In a year either the rates will be lowered, or if they keep it high a lot of banks will bankrupt, and we will have a halving as well, combine all these together and we are going to have a super skyrocketing breakout price that will be above ATH without a question. This is a wrong move but their wrong move works very well for us in the end.Hopefully banks don't start going bankrupt. But next year should be especially nice because we're gonna have the halving and all the hype surrounding that, and then also probably at some point next year the Fed will start lowering interest rates some which will be a boon for all investors and will make people pile into Bitcoin even more. As long as this SEC stuff can be dealt with positively, and especially if Congress actually does their job and makes (sensible) crypto regulations to overrule the chaos the SEC is trying to cause, even if the rest of this year has slow growth for Bitcoin, next year should be really great for Bitcoin. Halving, presumably interest rates lowering, and if by some chance Congress gets their game together and makes good regs for crypto industry, that's a winning combo to lead to a very strong bull run in 2024/2025, probably stronger than the segmented bull run of 2021 where we got a crash in the middle cuz of Musk-worship/China-ban.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Popkon6",
      "created_time": "June 15, 2023, 03:49:13 PM",
      "body": "The Bitcoin market is leaning more bearish which is why we and should reduce inflation. Then the bitcoin market will again be in the right search and in various cases it is seen that the unemployment of people employment is increasing due to various reasons such as banks, interest rates, bank bankruptcies. So the Bitcoin market will turn bearish whenever inflation remains low. Now in the current situation, the price of Bitcoin is constantly declining due to various reasons, investors are in a state of unconsciousness. In my own personal opinion, if inflation definitely decreases, the Bitcoin market will take the right direction and turn bearish.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Aanuoluwatofunmi",
      "created_time": "June 15, 2023, 03:50:37 PM",
      "body": "Quote from: OgNasty on June 14, 2023, 05:53:56 PMWith the Fed set to make an announcement today on the future of their overnight rate, investors are all watching and waiting to see how the market will react.  What do you think the Fed should do?  Should they continue raising rates until inflation is completely squashed and the job market sees an increase in unemployment to above desired levels? or should they stop raising rates out of fear of sending the economy into a recession and causing another real estate crash?  Maybe you think they should get ahead of a recession and lower rates to keep the economy booming?  What do you think?We cannot avoid the rise of interest rate by the security and exchange commission under the influence of government and same way the role of inflation cannot be overemphasized which means the two are bound to always happens and will be a continuous thing to do because that's one of the key factors that make the USD dominance and it's acceptability as part of the requirements for it global use as reserve currency, it's now their own duty and responsibility to make this balance not to cause excessive rise that could lead to recession on economy global demands.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cabron",
      "created_time": "June 15, 2023, 04:05:16 PM",
      "body": "Quote from: Aanuoluwatofunmi on June 15, 2023, 03:50:37 PMQuote from: OgNasty on June 14, 2023, 05:53:56 PMWith the Fed set to make an announcement today on the future of their overnight rate, investors are all watching and waiting to see how the market will react.  What do you think the Fed should do?  Should they continue raising rates until inflation is completely squashed and the job market sees an increase in unemployment to above desired levels? or should they stop raising rates out of fear of sending the economy into a recession and causing another real estate crash?  Maybe you think they should get ahead of a recession and lower rates to keep the economy booming?  What do you think?We cannot avoid the rise of interest rate by the security and exchange commission under the influence of government and same way the role of inflation cannot be overemphasized which means the two are bound to always happens and will be a continuous thing to do because that's one of the key factors that make the USD dominance and it's acceptability as part of the requirements for it global use as reserve currency, it's now their own duty and responsibility to make this balance not to cause excessive rise that could lead to recession on economy global demands. Maybe it's time to stop it already which FED did just yesterday. They may resume also so there is no guarantee that they will lower and or raise still. But there are more risks in raising the interest rate. If they expect something will break, then it better be the one they expect. Being the global reserve currency is also the reason why other countries are also abandoning the USD. There are risks in every way, the FED moves but the recent at least will make people at ease for a moment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tabas",
      "created_time": "June 15, 2023, 11:12:16 PM",
      "body": "Maybe based on their outlook on the economy, it's not yet time for them to decrease the rates or are they waiting for the next POTUS to come before doing actions that will entirely show a boost to the economy again? Right now, it's all tough and hard and as we deal with all of these. SEC is busy tackling with the exchanges that it's suing. Well, concerning the economy impact that they do, will there be another period of time somewhere in the next years that the inflation will be decreased thanks to them?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "adaseb",
      "created_time": "June 16, 2023, 04:25:46 AM",
      "body": "The reason why they shouldn’t pause is because if you take Canada for example. They hiked very aggressively last year and paused in January. They paused because it looked like inflation was stopping from rising.However a few months later inflation started to go back up and they had to do a surprise hike. This is why it’s important to not pause at the wrong time because all you are doing is prolonging the issue.I think they should hike 2 more times and then see if inflation is finally beat.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Tytanowy Janusz",
      "created_time": "June 16, 2023, 05:17:52 AM",
      "body": "Quote from: thecodebear on June 15, 2023, 03:29:01 PMWas very surprising the price dropped $1000 due to the Fed's statements. I expected an immediate $1000 increase to $27k, instead it was an immediate $1000 drop. That's exacly why price dumped. Because average investor though it will pump ... so smart money started to front run this news like half year ago. I was talking about that a lot. My post from february:Quote from: Tytanowy Janusz on February 24, 2023, 12:00:27 PMQuote from: BinhTrader on February 24, 2023, 07:15:11 AMThe way to identify the money coming back is a very important and difficult thing to realize, but if we can identify it, we will have a very nice position and an extremely good profit, so to receive the cash flow, we usually You will see the following signs.Mostly you have to look at 6-18 months ahead and ask yourself a question what type of news we will read that day because market is never pricing current day. Retails do financial decision based on today news. They are always wrong. just like we've seen it last years:2020 - broken supply chains, covid  - Retail sell at the bottom based on current news, how bad it is for economy. Smart money see money printing acceleration combined with production limitations and knows that we will have inflation spike 2 years later. Everything pumps2021 - inflation spike. Retail buys the top of gold, the top of stocks and the top of bitcoin to find a \"inflation hedge\" to save their savings. Smart money knows that everything is cyclical and after inflation spike there will be disinflation (among others thanks bullwhip effect) and most likely a recession.2022 - retails scared of recession sell at big loss waiting for FED pivot to buy back - printing will save asset they think. Smart money buys the dip right after news from big companies about redundancies2023  - retails buys FED pivot - smart money sells the news.Treating the amount of negative news as an indicator of the bottom can be good only if the future in the perspective of  0.5-1.5 year is not gonna be worse.Quote from: thecodebear on June 15, 2023, 03:29:01 PMThey didn't hike the rate, which is what people expected, and would have likely led to a $1000 or more boost in Bitcoin's price in the aftermath, which is what I expected. But I guess everyone is freaking out because the Fed said two more rate hikes are likely later this year. Smart money is taking profit. That was a reason not the fact that there will be 2 more rate hikes.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "June 16, 2023, 06:51:39 AM",
      "body": "It is likely that we will witness a rate hike twice in the coming sessions, which represents a 25 basis point hike for each meeting. As a whole, the interest will be about 6% in the worst conditions, and then a relatively long period of stability before it starts to cut interest rates.The cryptocurrency market has become less affected by monetary tightening policies, so we will not see a difference in prices, and the price of Bitcoin will not be affected by the interest rate in the future unless the change is sharp, which may not happen soon. the markets will be either in a state of stability below $30,000 or a relative rise to $35,000, with long-term support at $25,000.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EarnOnVictor",
      "created_time": "June 16, 2023, 08:30:31 AM",
      "body": "I voted for a stoppage of the rake hike, they've done well already with the manner in which they were aggressive with it last year. This is a very good measure as a result of the threatening inflation. However, this time that inflation is subsiding, it's a good act to stop it or slow it down to the lowest pace.The rate hike is very good during bitting inflation times, but when done too quickly, that's where the problem is, including your concern on real estate. That's your concern but generally, it could reduce demand and prices would crash in every sector causing another problem. Still, it has its own advantages on Credit Default Swaps, Savings and others, so it should be done with caution.And at this point, the FED still holds the Federal Funds Rate at 5.25% on Wednesday. I hope it won't go higher than this, no thanks to inflation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yaunfitda",
      "created_time": "June 16, 2023, 09:09:21 PM",
      "body": "Quote from: EarnOnVictor on June 16, 2023, 08:30:31 AMI voted for a stoppage of the rake hike, they've done well already with the manner in which they were aggressive with it last year. This is a very good measure as a result of the threatening inflation. However, this time that inflation is subsiding, it's a good act to stop it or slow it down to the lowest pace.I'm not really sure if US inflation is subsiding, it might be that the numbers is not really updated as there are a lot of financial issues. So it's a surprised that they paused it right now. But I doubt it, maybe next month there will be another increase. Perhaps they are just observing as to what effect the pause will be for this month. But then again, as I have said, the economy still look very bleak, so this might not be a effective measures.And even with this news, it hasn't had that much effect on crypto market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OgNasty",
      "created_time": "June 16, 2023, 09:42:46 PM",
      "body": "Quote from: Yaunfitda on June 16, 2023, 09:09:21 PMQuote from: EarnOnVictor on June 16, 2023, 08:30:31 AMI voted for a stoppage of the rake hike, they've done well already with the manner in which they were aggressive with it last year. This is a very good measure as a result of the threatening inflation. However, this time that inflation is subsiding, it's a good act to stop it or slow it down to the lowest pace.I'm not really sure if US inflation is subsiding, it might be that the numbers is not really updated as there are a lot of financial issues. So it's a surprised that they paused it right now. But I doubt it, maybe next month there will be another increase. Perhaps they are just observing as to what effect the pause will be for this month. But then again, as I have said, the economy still look very bleak, so this might not be a effective measures.And even with this news, it hasn't had that much effect on crypto market.Inflation is definitely subsiding. The problem is that the Fed always looks backwards at trailing data instead of forward to what will happen. Forward metrics are showing things like a negative money supply and deflation. The Fed is causing a recession and if they raise rates at all from here it will be a worse one than is already coming. If I were a smart man I would sell all my assets like I said I would next time this happened back in 2008, but here I am, holding like an idiot and waiting to see how much it will cost me.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "justdimin",
      "created_time": "June 17, 2023, 06:23:31 AM",
      "body": "Quote from: EarnOnVictor on June 16, 2023, 08:30:31 AMI voted for a stoppage of the rake hike, they've done well already with the manner in which they were aggressive with it last year. This is a very good measure as a result of the threatening inflation. However, this time that inflation is subsiding, it's a good act to stop it or slow it down to the lowest pace.The rate hike is very good during bitting inflation times, but when done too quickly, that's where the problem is, including your concern on real estate. That's your concern but generally, it could reduce demand and prices would crash in every sector causing another problem. Still, it has its own advantages on Credit Default Swaps, Savings and others, so it should be done with caution.And at this point, the FED still holds the Federal Funds Rate at 5.25% on Wednesday. I hope it won't go higher than this, no thanks to inflation.I agree with this, it was a needed thing to slow down the inflation and they did it, it's a good job and kudos to them. But they have already done it so there is no reason to keep doing it over and over again, we are quite happy with what we got already and that should be enough. I know that there are a lot of people who are still worried about it but that doesn't mean that they are right.I hope that it's not going to be like this each time and it gets better, because if they keep increasing the rates a lot more then we are going to seer trouble starting. Recession is no joke, everyone putting their money in the banks means a lot less employment available and a lot worse situation for investors who wouldn't grow their profits because nobody would invest.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}