{
  "id": "topic_5398629",
  "title": "Hyphen(-)",
  "author": "Hyphen(-)",
  "created_time": "May 14, 2022, 08:35:22 AM",
  "content": "The Argentina 🇦🇷 Senate passed a bill this morning imposing a tax on its people' assets in foreign nations and cryptocurrency in order to pay off the country's IMF debt, which is estimated to be worth $40 billion. According to the country's Economy Minister, the funds raised by Argentina's citizenry will help to pay off nearly half of the IMF obligations. The citizens' reaction to the bill's passage is negative because it will affect many traders in the country.Source: https://news.bitcoin.com/argentinian-senate-passes-bill-that-would-tax-assets-held-in-foreign-countries-including-crypto/What is your thoughts about this bill, reasoning how government are trying to inforce too much task in cryptocurrency? I feel its not proper to put the responsibility of paying the Country's half IMF debt on cryptocurrency and foreign assets alone.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5398629",
  "comments": [
    {
      "author": "Jawhead999",
      "created_time": "May 14, 2022, 09:26:23 AM",
      "body": "According to the articles:QuoteDepending on the time period and the goods owned, if approved, Argentinian citizens will have to pay up to 50% on these assets.Up to 50% tax fee is really ridiculous, some people who get taxed only below 10% already don't want to pay and seek any way to avoiding tax lol. The debt was caused by the government, but they're wanted their citizens to solve it. I wouldn't surprised if Argentinian will move to other country and change their nationally due to this reason.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Moneyprism",
      "created_time": "May 14, 2022, 11:30:35 AM",
      "body": "it is very unreasonable to impose a tax of up to 50% for ownership of assets and cryptocurrencies ... this is not taxing, but plundering citizens' assets with the appendage of \"taxes\" .. I am sure that this regulation will surely spark the anger of citizens in argentina",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dunamisx",
      "created_time": "May 14, 2022, 11:46:15 AM",
      "body": "Quote from: Hyphen(-) on May 14, 2022, 08:35:22 AMThe Argentina 🇦🇷 Senate passed a bill this morning imposing a tax on its people' assets in foreign nations and cryptocurrency in order to pay off the country's IMF debt,I don't now how some government do reason when it comes to tax payment and any financial obligations requiring payment to them, 50% is by all means an unacceptable rate and fair enough to hook the neck of the cryptocurrency industries, they (government) should find a means to clear their indebtedness and not enforcing a payback on the citizens at all cost.This isn't good enough because governments are expected to give to the community and not taking away from it, there are many other means they could come up with in generating money aside tax as a result of service renderd and inventions to the country, IGR is a big term which can be diversify in different dimensions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "_act_",
      "created_time": "May 14, 2022, 01:18:56 PM",
      "body": "Quote from: Hyphen(-) on May 14, 2022, 08:35:22 AMWhat is your thoughts about this bill, reasoning how government are trying to inforce too much task in cryptocurrency? I feel its not proper to put the responsibility of paying the Country's half IMF debt on cryptocurrency and foreign assets alone.It is true it will discourage traders, crypto traders will be among, but it will also be a way some crypto traders will like to look for ways to trade cryptocurrencies in a way they will not be taxed by bypassing tax. This will also only applies to those using centralized exchanges. I am still thinking that some exchanges that do not make kyc necessary to people to certain withdrawal limit will move to those exchanges and use noncustododial means to exchange their cryptocurrencies in a way to evade tax. If citizens are taxed too much, they will find alternatives which is even not far from them if they know how to do it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "so98nn",
      "created_time": "May 14, 2022, 05:06:46 PM",
      "body": "Nothing new. In India, we are already obligated to pay 30% taxes against any bitcoin transaction that will be done during the financial year. With rising concerns of using crypto currency every government is going nuts about the taxes. They are government and they have job to do. We feel like our freedom is being taken away but obviously if we slowly transfer our funds to overseas with such options then they will be bankrupt. They will need to print more money to pay national development funds and then it will turn into inflation. I think it’s in the best interest of Argentina as nation, because $40 billion in debt is huge and that too in the current economic crisis!!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Leviathan.007",
      "created_time": "May 15, 2022, 11:25:35 AM",
      "body": "I was very much expecting to see most of the governments and almost all of them trying to milk money from the bitcoin and cryptocurrency investors and the reason is clear. Since the cryptocurrencies and bitcoin as becoming more used and there is more demand for them many people will try to hide they're found from the governments and save their assets in bitcoin and other cryptocurrencies, so a big part of the assets will be unreachable for the governments to receive tax from it. That's why they should try to milk money from the bitcoiners and people who are using cryptocurrencies, However, I guess there are many other ways like using mixers to stay away from the governments for the bitcoiners.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fortify",
      "created_time": "May 15, 2022, 05:01:11 PM",
      "body": "Quote from: Hyphen(-) on May 14, 2022, 08:35:22 AMThe Argentina 🇦🇷 Senate passed a bill this morning imposing a tax on its people' assets in foreign nations and cryptocurrency in order to pay off the country's IMF debt, which is estimated to be worth $40 billion. According to the country's Economy Minister, the funds raised by Argentina's citizenry will help to pay off nearly half of the IMF obligations. The citizens' reaction to the bill's passage is negative because it will affect many traders in the country.Source: https://news.bitcoin.com/argentinian-senate-passes-bill-that-would-tax-assets-held-in-foreign-countries-including-crypto/What is your thoughts about this bill, reasoning how government are trying to inforce too much task in cryptocurrency? I feel its not proper to put the responsibility of paying the Country's half IMF debt on cryptocurrency and foreign assets alone.It works both ways and it seems unfair to frame this as a negative thing, when most developed countries have the same laws. It seems like they are just playing catch up and creating a legal framework where they can pursue all kinds of undeclared assets including property and stocks - not just cryptocurrency. There is no reason why the Argentine government should not seek to close loopholes that rob it of tax revenues and it has a duty to do so in fairness to all their citizens. They seem a little late in imposing such laws, but it's better late than never. They should be applauded for seeking to repay their debts to the IMF and it is nothing shameful to do so.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "y5",
      "created_time": "May 15, 2022, 07:00:55 PM",
      "body": "Quote from: Fortify on May 15, 2022, 05:01:11 PMThere is no reason why the Argentine government should not seek to close loopholes that rob it of tax revenues and it has a duty to do so in fairness to all their citizens. They seem a little late in imposing such laws, but it's better late than never. Is the new bill really motivated by the wish to close existing tax loopholes? I highly doubt that!I´d argue that they have been pressured by the IMF to crackdown on crypto.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "d5000",
      "created_time": "May 18, 2022, 12:50:04 AM",
      "body": "I'll give a bit of context.The bill is not targeting all cryptocurrency / foreign assets holdings, but those which were (illegally) undeclared from subjects who have the obligation to declare their funds. In Argentina (like in many other countries which have some kind of wealth tax), if you have any kind of property which exceeds certain values, then you have to declare it and pay a wealth tax for it (called Impuesto a los Bienes Personales). The threshold is currently at 6 million Argentine Pesos (approximately 50.000 US dollars, depending on the exchange rate you apply, there are big differences between \"official\" and \"unofficial\" rates), but a house you're really using is not included (at least if it's not worth more than 30 million, or ~200.000 US dollars).The new bill is a way to \"legalize\" formerly undeclared/evaded funds paying an extra tax on it. It is, however, only applied for funds exceeding $500.000 USD. Of course you can try to continue to not declare your wealth but the longer you wait the higher the tax will become, and when they discover you still hiding something, then a fine (or even prison, in extreme cases) is added.In fact, the bill is criticized by the opposition because it gives tax evaders an easier, less harmful way to \"legalize\" their funds ...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}