{
  "id": "topic_5467297",
  "title": "jordanw21",
  "author": "jordanw21",
  "created_time": "September 19, 2023, 08:33:21 AM",
  "content": "I'm a reactive gambler - this is the reason why I stake crypto with no chance to withdraw it or why I withdraw money to cash. So I tried a lot of casinos and self-exclude myself after a few deposits. And that makes me always look for new casinos - bitcointalk is like a ycombinator for crypto casinos. So let's share our experience about casinos that were found here. Before going on with naming casinos, I'll share why I think whether a casino is good or bad for me.What gets me tilted in casinos:1. Useless support. When they provide inaccurate information or can't assist you with anything.2. Half of games are unavailable even with VPN (Pragmatic Play, Evolution).3. Withdrawal time is too long (hello Crashino with 2 days withdrawal).4. Bonuses that I never asked. When I deposit and see a bonus active I need to contact support to cancel it.5. Technical issues.My experience at casinos that I found at bitcointalk:1. Flush - the only casino I saw with really instant withdrawal. However, their technical issues made me tilted.2. Blackjack.fun - good casino, their blackjack were much better than in Stake (when we talk about fairness).3. LTC Casino - no kyc, have evolution live games, but doesn't have popular games by hacksaw, push, nolimit.4. Sherbet - interesting promotions, easy to get prize tournament. But withdrawal time is more than 12 hours (however you can't cancel request).5. Crashino - most like scam, as withdrawal time on average is 2 days and you can cancel the request. 6. vBetFTN - i had an issue there with yggdrasil, which is very common for betconstruct casinos. In rest, nothing bad.7. richy.casino - did exit scam (as I didn't have rule#1).2 out of 7 casinos - scam (not only for me!)3 out of 7 - had technical issues, unreliable.2 out of 7 - had claims from other players, but never happened to me.In my case, I had 25% to get scammed by playing in new casinos.Please share your experience of playing in crypto casinos that you found here.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5467297",
  "comments": [
    {
      "author": "swogerino",
      "created_time": "September 19, 2023, 08:36:59 AM",
      "body": "I only play in two casinos not mentioned here,I play at Stake my main one and then at Bitcasino which both offer me the slots from Pragmatic Play without a VPN so it depends where you are since you cannot access Pragmatic Play slots even with a VPN.Both such casinos offer me all I need,in terms of bonuses,promotions,instant withdrawals and fairness,I even hit near the max win of x10000 last week at Stake hitting x9833 multiplier on Fish Eye slot which is from Pragmatic provider in partnership with Reel Kingdom so for me these two casinos are enough and I don't go to search for others.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ZuitaBuild",
      "created_time": "September 19, 2023, 09:14:49 AM",
      "body": "fortune jack seized my funds and scammed me, don't play there",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zoomic",
      "created_time": "September 19, 2023, 09:40:06 AM",
      "body": "Quote from: jordanw21 on September 19, 2023, 08:33:21 AM4. Bonuses that I never asked. When I deposit and see a bonus active I need to contact support to cancel it.Most time people look for reliability and transparency and not bonuses. I do not like the bonuses as I always think something is attached to it. I always go straight placing my bets.Quote from: jordanw21 on September 19, 2023, 08:33:21 AM5. Crashino - most like scam, as withdrawal time on average is 2 days and you can cancel the request. Be careful of this casino. Any casino that frustrates your efforts to withdraw your money and willing to allow you cancel your withdrawal obviously do not want you to withdraw, rather to deposit more. It is a red flag for me.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "piebeyb",
      "created_time": "September 19, 2023, 10:13:19 AM",
      "body": "I saw some of these new casinos on your list, but I haven't tried them recently, usually I often try new sites to find luck, but I've visited some of their ANNs on this forum and most of their users have complained. Regarding withdrawals, there are also those who complain about other problems, but usually I wait a few months to see how they interact with user complaints. If they are very responsive, I will definitely try to make a deposit to play there.But it's nice for you to share your experience on the sites on the list and it deserves appreciation, if possible you need to add more to share your other experiences, so far I've only tried a few sites but they're not on the list, maybe I'll share my experiences When I finished playing there, sometimes reputation is very important in this forum because many fraudulent sites have recently come to the forum just to steal money. So always be careful when gambling, especially on new sites.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tsaroz",
      "created_time": "September 19, 2023, 10:25:08 AM",
      "body": "I personally am reluctant to try new casinos without a reason. Generous deposit bonus is something that may attract me if the casino is flashy enough.For sports betting site, it's easier to switch if you get better odds but odds of popular gambling are generally same and slightly better on larger and older casinos. Newer casinos are more likely to get problematic than older ones. Of all the games, I'm a fan of dice and crash. I do slots only when I get free rolls. So, my favorite still are primedice, bustabit and likes. There were some bad experience of myself in some casinos but all of them are now dysfunctional. And a couple of disaster due to missing my 2FA code, some casinos don't reset them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yaunfitda",
      "created_time": "September 19, 2023, 10:37:12 AM",
      "body": "Thanks for this review, I haven't try any casino that you mentioned though, I heard about them, some of them have signature campaigns already and so for sure there are gamblers that might have tried and played on their platform.But it's going to be interesting if someone will collaborated what you have experience, either good or bad so that it will somewhat a credibility on your reviews on them. So hopefully we will see some members here, specially those who have been here in the community for so long to give us the feedback as well.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jordanw21",
      "created_time": "September 19, 2023, 07:01:45 PM",
      "body": "Quote from: ZuitaBuild on September 19, 2023, 09:14:49 AMfortune jack seized my funds and scammed me, don't play thereI wish I had any relevant experience with FortuneJack to share, but the casino didn't inspire me to lose more than one 300 usdt dep. However, as I remember, they closed my account almost instantly.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "carlfebz2",
      "created_time": "September 19, 2023, 07:34:31 PM",
      "body": "You wont really be finding yourself get scammed if you do make out some research my friend. The only ones that i do know basing up on the list is Blackjack.fun,Sherbet and vBetFTN(New) and the rest i havent heard of or simply i just missed them.Casino experiences would really be totally that opposite and that what differs them and why people would make out choices because they do have reasons to neither stay or would be finding for another one.If you do really want to have some testing on more legit sites then you could always check out the ff sites;https://www.btcgosu.comhttps://gamblingbro.comThey do have reviews and these sites are really that been known into this forum and one that would be recommended in terms of real time or legit reviews and feedback or suggestions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Slow death",
      "created_time": "September 19, 2023, 09:26:38 PM",
      "body": "Quote from: ZuitaBuild on September 19, 2023, 09:14:49 AMfortune jack seized my funds and scammed me, don't play thereIt's strange that you haven't created a thread accusing Blackjack Fun of stealing your money, you were wrong not to have opened a thread explaining your problem and showing proof. I believe that with this the casino representative would have taken some action to correct your problem and you would have received your money. I honestly can't understand why you chose to remain silent, this way other people will go through the same thing and if they do the same thing you did and stay silent then the casino will operate this way for a long time. I hope you, if you still have proof, open a thread in the scam accusation section and post prooftalking about how many casinos I have used, I have used many casinos that are on this forum although most of them I used for a very short time, but I must say that all of them I felt that I didn't like their designer and how they organized the site, I I had to spend a long time looking for games to bet on and when I bet it was a headache because I had to enter the values in a different way, after placing a bet I also had the problem with locating my bet and I also couldn't cancel my bet, so These were things that made me very angryNot to mention that the fact that at that time these casinos only had deposit options for bitcoin and altcoin minus usdt was another headache because when the price of bitcoin dropped a lot I also lost a lot even when I got my bets right. Then I discovered stake.com and at that moment I said to myself: here is the ideal casino. and I started using only stake.com for a long time until today, I like everything about stake.com and I think they are the best casino in this market, whether in everything: bonus, design, deposit and withdrawals they have a low value, they have a friendly kyc is much more advantageous than these other casinos.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sandra_hakeem",
      "created_time": "September 19, 2023, 09:30:38 PM",
      "body": "Quote from: ZuitaBuild on September 19, 2023, 09:14:49 AMfortune jack seized my funds and scammed me, don't play thereDid you file any reports on the reputation section with valid proofs on what you just said?.. how do you expect anyone to believe you without 'em proves??... IMHO, alot of times y'all complain about a casino scamming you, it's most definitely you tryna pull off a stunt with the casino, which infringes and endangers thiers rules and domain in general... I'm not also saying that was the case anyways...Quote from: jordanw21 on September 19, 2023, 07:01:45 PMI wish I had any relevant experience with FortuneJack to share, but the casino didn't inspire me to lose more than one 300 usdt dep. However, as I remember, they closed my account almost instantly. Again, was that as a result of infringement of rules?? Like staking and misusing the cash out options more frequently etc..??Sandra 🧑‍🦰",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Minor Miner",
      "created_time": "September 20, 2023, 04:48:07 AM",
      "body": "Quote from: Zoomic on September 19, 2023, 09:40:06 AMQuote from: jordanw21 on September 19, 2023, 08:33:21 AM4. Bonuses that I never asked. When I deposit and see a bonus active I need to contact support to cancel it.Most time people look for reliability and transparency and not bonuses. I do not like the bonuses as I always think something is attached to it. I always go straight placing my bets.Quote from: jordanw21 on September 19, 2023, 08:33:21 AM5. Crashino - most like scam, as withdrawal time on average is 2 days and you can cancel the request. Be careful of this casino. Any casino that frustrates your efforts to withdraw your money and willing to allow you cancel your withdrawal obviously do not want you to withdraw, rather to deposit more. It is a red flag for me.I think many of the casinos are actually made that way. They want you to bring money to perform gamble. The gambling scene and all the casinos in the world are based on somehow operating people's money and giving a share to some particular lucky winner. You couldn't call it a scam in itself in my opinion cause they are giving entertainment and taking their operating fees.Yes, I agree most of them are definitely not going to try to give the best transparency to the people who bring money in to gamble. Because if they do not give transparency, there is a high likelihood that they will be able to keep more money. Just for example, if you have a bank account, you go into that bank saying that you need to withdraw $50. The bank says if you have to withdraw $50. You would have to wait for two days. Because the bank does not have that money right now. But right now you can withdraw $45. You would most likely withdraw the $45 because you need the money right now. Anyone who has millions of dollars in their bank account definitely has to face this type of situation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Text",
      "created_time": "September 20, 2023, 09:46:25 AM",
      "body": "It's good to know that you're sharing your experience with crypto casinos found here in this forum. It's important to have a community where people can share their honest feedback, both positive and negative so that others can make informed decisions about where to play.I've played at a few crypto casinos that I found here, such as Bitsler, Wolf.bet, Roobet, Duelbits, Stake, Primedice, FreeBitco.in, CryptoGames, and my experience has been mixed. Some of the casinos have been great, while others have been disappointing.From the casinos you mentioned, I am only familiar with Blackjack.fun. I had a good experience with it. The blackjack games were fair, and the customer support was responsive, but the casino doesn't offer a wide variety of other games to choose from.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "wiss19",
      "created_time": "September 20, 2023, 01:09:40 PM",
      "body": "It would have been more interesting if you had tried more reputable casinos and had them reviewed in your thread just like how you did it with smaller ones. Your thread doesn't include some of the oldest and most reputable casinos available on the forum such as Stake, FortuneJack, Rollbot, Sportbet.io, etc. I would have loved it more if you had reviewed all those casinos because I'm not really a fan of joining smaller and new casinos only to try them out.I always recommend new users to only join casinos that they find trustworthy after collecting community feedback so that they can avoid facing big issues such as scams or too much delay for withdrawals which is the most reported issue in casino platforms, that's why, it's better to stick with the best.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jawhead999",
      "created_time": "September 20, 2023, 01:27:17 PM",
      "body": "There are so many casinos that I've gamble and have no problem until now e.g. Freebitco.in, Roobet, Duelbits, Rollbit, BK8, Fortunejack, Stake and Sportsbet.io. As long as you gamble in a casino where the signature campaign or the representative is active, you will be fine.Quote from: jordanw21 on September 19, 2023, 08:33:21 AM5. Crashino - most like scam, as withdrawal time on average is 2 days and you can cancel the request. Crashino was used to be a good casino, but now their representative in this forum is inactive, so you need to be careful.Quote from: ZuitaBuild on September 19, 2023, 09:14:49 AMfortune jack seized my funds and scammed me, don't play thereIf you don't have any proof it's better to shut your mouth rather than spreading false information.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "len01",
      "created_time": "September 20, 2023, 01:43:55 PM",
      "body": "of all the popular casinos on this forum, I have tried them and have had almost no problems, even withdrawals and deposits are always smooth and without problems.the reason I never had this problem is because before I try to register and start depositing my budget to the casino I always carefully do research and almost all the casinos I try already have trust and good research from several trusted members here so there are no doubts and never had this problem.It seems like its a lesson for you after I read the whole thing It seems like you had a little disappointment after being tricked by a new casino and yeah it was your bad luck but its a valuable lesson that you can use in the future to always be careful with new casinos. BTW, on this forum there are many choices of trusted casinos, so instead of risking a new casino, its better to gamble at an old casino that has been around for a long time with great trust from its users, such as Stake.com.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jordanw21",
      "created_time": "September 20, 2023, 02:14:56 PM",
      "body": "Quote from: carlfebz2 on September 19, 2023, 07:34:31 PMYou wont really be finding yourself get scammed if you do make out some research my friend. The only ones that i do know basing up on the list is Blackjack.fun,Sherbet and vBetFTN(New) and the rest i havent heard of or simply i just missed them.Casino experiences would really be totally that opposite and that what differs them and why people would make out choices because they do have reasons to neither stay or would be finding for another one.If you do really want to have some testing on more legit sites then you could always check out the ff sites;https://www.btcgosu.comhttps://gamblingbro.comThey do have reviews and these sites are really that been known into this forum and one that would be recommended in terms of real time or legit reviews and feedback or suggestions.I can't trust any affiliate website without live-reviews by real players there. As such webistes are not aware of all gambling business issues. For example, I'm from Ukraine, and all SoftSwiss-based casinos with Curacao license are prohibited from accepting me as a player (by white-label itself) and one of this site tells that Bitstarz accepts Ukrainian players. It could cost me at least 300 usdt (which I dep to test casino, before dealing with them).I rather trust casino.guru, because they really helped me a few times to get my money back after \"Our final decision is not to pay you, as you violated our rules.\".Quote from: len01 on September 20, 2023, 01:43:55 PMof all the popular casinos on this forum, I have tried them and have had almost no problems, even withdrawals and deposits are always smooth and without problems.the reason I never had this problem is because before I try to register and start depositing my budget to the casino I always carefully do research and almost all the casinos I try already have trust and good research from several trusted members here so there are no doubts and never had this problem.It seems like its a lesson for you after I read the whole thing It seems like you had a little disappointment after being tricked by a new casino and yeah it was your bad luck but its a valuable lesson that you can use in the future to always be careful with new casinos. BTW, on this forum there are many choices of trusted casinos, so instead of risking a new casino, its better to gamble at an old casino that has been around for a long time with great trust from its users, such as Stake.com.Can you please share, how much of them offered \"instant withdrawal\"? I mean without manual approval, you withdraw and get link to your transaction instantly?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Davidvictorson",
      "created_time": "September 20, 2023, 03:48:21 PM",
      "body": "Quote from: jordanw21 on September 19, 2023, 08:33:21 AMWhat gets me tilted in casinos:1. Useless support. When they provide inaccurate information or can't assist you with anything.2. Half of games are unavailable even with VPN (Pragmatic Play, Evolution).3. Withdrawal time is too long (hello Crashino with 2 days withdrawal).4. Bonuses that I never asked. When I deposit and see a bonus active I need to contact support to cancel it.5. Technical issues.So far I have gambled on two casinos here - Livecasino and MegaPari. I hope to try the others soon enough. With the two mentioned casinos, I had a great playing experience. The support staff where quick to respond and resolve any issues I had. The withdrawal process was fast too. I got my funds paid to my wallet in less than an hour after withdrawal requests. In the later casino, I was informed that I had an active bonus, and to be able to withdraw I either had to use up the bonus or cancel it. I didn't contact support to do it for me. Zero technical issues and I submitted KYC. I was totally fine with it although the later asked for my personal phone number which I wasn't so comfortable with albeit I enjoy playing there.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "maydna",
      "created_time": "September 20, 2023, 04:32:17 PM",
      "body": "I don't play at the casinos you mentioned, so I don't know much about it because I gamble at Stake, LiveCasino, Betfury, and Duelbit. So far, I haven't had any problems because perhaps I'm just a small player who doesn't use much money to gamble and doesn't gamble too often like other people. I usually encounter when someone uses a lot of money at several casinos and ends up having problems when they want to withdraw their money.And my experience of gambling at these casinos was very good, even though I didn't win often. But they all provide different experiences. Perhaps you should try the casinos I use so you know what the difference is.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cointxz",
      "created_time": "September 20, 2023, 05:09:53 PM",
      "body": "Quote from: jordanw21 on September 19, 2023, 08:33:21 AM2. Half of games are unavailable even with VPN (Pragmatic Play, Evolution).Using VPN to bypass games that restricted your will make your account in jeopardy once you caught. Tilting on the casino that protecting you to avoid violating the ToS is not fair if you think about it. You should avoid playing games that restrict you using your normal IP because the casino can seize your profit once they find out that you are supposed to be restricted on these providers.Quote from: jordanw21 on September 19, 2023, 08:33:21 AMPlease share your experience of playing in crypto casinos that you found here.You play most on new casino or not that popular probably due to chasing down good bonuses. If you want a hassle free casino then try the well known brand such as Livecasino, Bitcasino and Sportsbet. These casino is my personal choice aside that I’m promoting it on my signature space. I play on these casino most of the time because I trust their superb service.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}