{
  "id": "topic_5476403",
  "title": "BlackHatCoiner",
  "author": "BlackHatCoiner",
  "created_time": "December 03, 2023, 05:59:49 PM",
  "content": "Γράφω αυτό εδώ (κι όχι επί του προσωπικού), γιατί ο συγκεκριμένος με έχει μπλοκάρει στα PM. Αν θέλει μπορεί να το αγνοήσει, κανένα θέμα. Δε με νοιάζει να διαβαστεί από τρίτους. Θέλω απλά να ξεκαθαρίζω τους λογαριασμούς μου. Τελευταία βλέπω μια ιδιαίτερη αντιπάθεια εναντίον μου. Το καταλαβαίνω ότι δε τα βρίσκουμε, αλλά δε νιώθω πως σου έχω κάνει κάτι κακό. Να πω πως σου έχω φερθεί άσχημα, να μου τη \"μπαίνεις\" δικαιολογημένα, αλλά δε νομίζω πως σου έχω φερθεί. Αν σου έχω φερθεί, ζητώ συγγνώμη. Το λέω γιατί πετάς κάτι υπονοούμενα (που αντιλαμβάνομαι ότι αναφέρεσαι σε μένα), λέγοντας πως είμαι υπέρ του WEF (που ουδέποτε δεν έχω πει τέτοιο πράγμα), ή λες στο άκυρο πόσα έβγαζα παλιότερα απ' το ChipMixer (το οποίο είναι δημόσια πληροφορία btw). Αν υπάρχει πρόβλημα σε παρακαλώ πες το μου να το λύσουμε σαν ενήλικες.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5476403",
  "comments": [
    {
      "author": "alani123",
      "created_time": "December 04, 2023, 03:08:01 AM",
      "body": "Έχει επιτεθεί και σε άλλους χρήστες της Ελληνικής κοινότητας εδώ, και ας είμαστε ελάχιστοι εναπομείναντες λίγοι έχουμε μείνει απ' έξω. Προσωπικά δεν με ενόχλησε αλλά σίγουρα το κλίμα που δημιουργεί δεν είναι και εύθυμο ας πούμε. Quote from: cryptosize on November 13, 2023, 01:03:47 AMΔυστυχώς ή ευτυχώς δεν μπαίνω για φιλίες εδώ μέσα, ούτε θα έκανα παρέα με nerds που θα με ρεζίλευαν με το social awkwardness τους στην πραγματική ζωή, με γυναίκες κλπ.Πλήρωσε 1 BTC και θα μάθεις ποιός είμαι και τι έχω γράψει αλλού, με ονοματεπώνυμο.  Αν τολμάς...  Διαβάζοντας κάτι τέτοια απλά πιστεύω ότι τρολλάρει. Απλά θέλω να αναφέρω και μια άλλη πτυχή. Μου κάνει εντύπωση που τα λες εσύ αυτά BlackHatCoiner γιατί ευθύνεσαι αυτοπροσώπως για το γεγονός ότι ο cryptosize κατάφερε να ανέβει βαθμίδα στο bitcointalk με όλα τα merit που του έστειλες.  Τόσο πολύ κατάληξε να σου σπάει τα νεύρα και πήγες απ' το 100 στο μηδέν με δαύτον; χαχαΠιστεύω το topic θα ήταν αχρείαστο αν απλά τον αγνοούσες; Δεν υπάρχει ανάγκη νομίζω να λυθεί κάτι, το trolling δεν απαγορεύεται. Καλοπροαίρετα το λέω γιατί έχουμε κάνει καλές συζητήσεις. Και για να κάνεις τέτοιες εδώ πρέπει να αγνοεί κανείς διάφορα.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackHatCoiner",
      "created_time": "December 04, 2023, 09:22:38 AMLast edit: December 04, 2023, 01:07:57 PM by BlackHatCoiner",
      "body": "Τον αγνοώ ήδη, και θα συνεχίσω να τον αγνοώ. Το νήμα αυτό δεν το έκανα για να αλλάξει η γνώμη μου, αλλά για καθαρά από απορία αν του έχω κάνει κάτι και τρελαίνεται τόσο να αποδεικνύει πως είμαι ο κακός. Όπως είχα πει σε παλιότερο ποστ, δεν έχω κάνει κάτι να μου επιτίθεται, ούτε αυτός σε εμένα (αν εξαιρέσουμε δηλαδή τα τελευταία ποστς που με κάνει public doxxing και συνεχώς αναφέρεται σε εμένα αρνητικά). Αν δε το γνωρίζει ο ίδιος, το doxxing οδηγεί στο ban με τον τρόπο που το χρησιμοποιεί. Το ότι δεν έχω απαντήσει στο doxxing σημαίνει πως είναι ασήμαντη πληροφορία, ή πως υπάρχει ήδη δημόσια. Quote from: alani123 on December 04, 2023, 03:08:01 AMΑπλά θέλω να αναφέρω και μια άλλη πτυχή. Μου κάνει εντύπωση που τα λες εσύ αυτά BlackHatCoiner γιατί ευθύνεσαι αυτοπροσώπως για το γεγονός ότι ο cryptosize κατάφερε να ανέβει βαθμίδα στο bitcointalk με όλα τα merit που του έστειλες.Το ξέρω, γιατί συμφωνούσα σε παλαιότερα ποστς μαζί σου. Άλλωστε το έχω πει πως συζητούσαμε συχνά επί του προσωπικού στο παρελθόν. Έχω απολογηθεί για το συγκεκριμένο, και δυστυχώς φταίω κι εγώ αυτό που συμβαίνει (ίσως φέρω και το μεγαλύτερο μερίδιο ευθύνης; ή βαριές κουβέντες;). Φαντάζομαι θα είναι παράξενο να μιλάς καθημερινά με κάποιον (εμένα) που ξαφνικά διαφωνεί σχεδόν με ό,τι λες (που κι αυτό σχετικό είναι, γιατί περί οικονομικών στέκουν πολλά απ' όσα λέει). Αυτό που συνέβη είναι το εξής: ξεκίνησα να διαβάζω κάποια πράγματα λίγο μόνος, άρχισα να συμμετέχω σε συζητήσεις με άτομα στον κλάδο της βιολογίας και του περιβάλλοντος / καιρού. Και τότε ξαφνικά που άλλαξε η γνώμη μου άρχισαν οι επιθέσεις. Και πάρε πως οι επιστήμονες είναι πληρωμένοι για να λένε ψέματα, και πάρε πως οι Bitcoiners δεν πιστεύουν σε \"woked\" επιστήμη. Κλπ. Ξέρετε, το ίντερνετ ενώ είναι ένα ανεκτίμητο εργαλείο, μας έχει κάνει όλους ένα τεράστιο κακό. Οι άνθρωποι δεν κάνουν αποφάσεις βασισμένες στο τι είναι αληθινό, αλλά στο τι ικανοποιεί τα συναισθήματά τους. Οι περισσότεροι δεν γκουγκλάρουμε αυτό που είναι αληθινό και δυσάρεστο για μας, αλλά αυτό που είναι ευχάριστο και fake news. Πιστεύεις πως τα εμβόλια είναι επικίνδυνα και πως επιβάλλονται για να μειώσουν τον πληθυσμό; Εδώ δίπλα υπάρχει ένα φόρουμ με ένα σκασμό άλλους που επιβεβαιώνουν την πεποίθησή σου. Η γυναίκα σου σε παρατάει κι αρχίζεις να πιστεύεις πως οι γυναίκες είναι εγωίστριες; Μέσα σε ένα λεπτό θα έχεις βρει 10 άρθρα που  \"εξηγούν\" γιατί είναι λογικό να είσαι μισογύνης. (το πρώτο είναι χαρακτηριστικό παράδειγμα για αυτόν)Quote from: alani123 on December 04, 2023, 03:08:01 AMΔεν υπάρχει ανάγκη νομίζω να λυθεί κάτι, το trolling δεν απαγορεύεται.Βασικά απαγορεύεται, απλά το moderation είναι τόσο ανεπαρκές που φαίνεται πως επιτρέπεται.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptosize",
      "created_time": "December 04, 2023, 08:05:25 PMLast edit: December 04, 2023, 10:34:33 PM by cryptosize",
      "body": "Έχω απαντήσει σε όλα εδώ, δεν θέλω να επαναλαμβάνομαι συνέχεια και κάτι μου λέει πως πάλι δεν θα λάβω ουσιαστικές απαντήσεις:https://bitcointalk.org/index.php?topic=5465675.msg63167966#msg63167966Quote from: alani123 on December 04, 2023, 03:08:01 AMΈχει επιτεθεί και σε άλλους χρήστες της Ελληνικής κοινότητας εδώΠοιός επιτίθεται πρώτος; Εγώ; Να σου θυμίσω ποιός ξεκίνησε πρώτος τις προσωπικές επιθέσεις στο CBDC νήμα;Είστε τόσο biased ή «ξεχνάτε» τόσο εύκολα;Να σου θυμίσω και ποιός μπήκε μετά για να κάνει επίθεση; (ο εχθρός του εχθρού μου είναι φίλος μου)Γιατί εγώ ένα σοβαρό επιχείρημα υπέρ της νέας ταυτότητας δεν είδα... αντιθέτως εγώ κατέθεσα πολλά κατά (και τα αγνοήσατε). Σας είπα ότι το δίπλωμα οδήγησης σε πλαστική κάρτα είναι ασφαλές και ΔΕΝ έχει RFID chip. Είπατε κάτι; Όχι! Είχε κολλήσει η κασέτα στην παλιά αστυνομική ταυτότητα. Ποιός είναι biased εδώ;Αν σου φαίνεται επίθεση το \"nerds\" (η πικρή αλήθεια είναι), να σου θυμίσω και το παρακάτω:Quote from: HmmMAA on November 18, 2023, 07:07:22 PMOf course , there are some users that love validating their transactions ( i wonder how many transactions these users do on L1 ) and they keep the network hostage to their nerdy needs . And these users are the new legendary legion that every newbie admires when entering this space .Εκεί δεν σας είδα να είπατε κάτι...Περιέργως ο HmmMAA λέει ότι δεν με διαβάζει, αλλά μια χαρά συμφωνεί με αυτό που έγραψα. Τελικά φαίνεται ότι όσο μισητός και να του είμαι, κάποια πράγματα βγάζουν μάτι εδώ μέσα...Quote from: alani123 on December 04, 2023, 03:08:01 AMκαι ας είμαστε ελάχιστοι εναπομείναντες λίγοι έχουμε μείνει απ' έξω.Και θα μείνετε ακόμα λιγότεροι, αφού μπαίνετε εδώ μέσα για να βγάλετε λεφτά από signature/avatar campaigns. Καιρός να ξεβρωμίσει το forum ο theymos.Εγώ δεν μπαίνω για να βγάλω χαρτζιλίκι... δεν με ενδιαφέρει.Quote from: alani123 on December 04, 2023, 03:08:01 AMΠροσωπικά δεν με ενόχλησε αλλά σίγουρα το κλίμα που δημιουργεί δεν είναι και εύθυμο ας πούμε.Φιλική συμβουλή: να εκτιμάς αυτόν που σου λέει (δυσάρεστες) αλήθειες και όχι αυτόν που σου κάνει πατ-πατ στην πλατούλα με γλυκά ψέματα.Ξέρει ποιός κάνει πατ-πατ στην πλατούλα; Ο πολιτικός που θέλει την ψήφο σου (βλ. Μητσοτάκης και Ελεύθεροι Επαγγελματίες). Πρώτα σε χαϊδεύει και μετά σε γαμάει.Αυτός που θα σου πει ότι θα «πέσουν» οι τιμές των ακινήτων με κρατική επιδότηση των επιτοκίων σε στεγαστικά δάνεια. Πού πήγαν τελικά οι τιμές των σπιτιών;Έγραψα σε άλλο νήμα τα εξής (με πηγές και απ' όλα):https://bitcointalk.org/index.php?topic=5475602.msg63229382#msg63229382Προβληματίστηκε κανείς;Αλλά ξέχασα, η μείωση πληθυσμού είναι «θεωρία συνωμοσίας»... βρίσκεστε σε άρνηση και πυροβολείτε τον αγγελιοφόρο! Δεν χάνω εγώ, άλλοι θα χάσουν. Ο χρόνος θα δείξει σε όλα ποιός έχει δίκιο και ποιός έχει άδικο.Θα συνεχίσω να γράφω πικρές/δύσπεπτες αλήθειες, ακόμα κι αν δεν σου φαίνεται «εύθυμο». Ακριβώς επειδή δεν έχω ανάγκη την ψήφο κανενός.Αν θες κάτι εύθυμο, δες το τελευταίο post εδώ: https://bitcointalk.org/index.php?topic=5465675.msg63170692#msg63170692Ούτε αυτό σου άρεσε όμως...Quote from: alani123 on December 04, 2023, 03:08:01 AMΔιαβάζοντας κάτι τέτοια απλά πιστεύω ότι τρολλάρει.Δεν τρολλάρω.Είμαι πρόθυμος να βάλω στοίχημα (όχι χαρτζιλίκι, γερά ποσά) για ό,τι λέω. Εσείς δεν τολμάτε να δεχτείτε την πρόκληση. Εγώ φταίω;Quote from: alani123 on December 04, 2023, 03:08:01 AMΑπλά θέλω να αναφέρω και μια άλλη πτυχή. Μου κάνει εντύπωση που τα λες εσύ αυτά BlackHatCoiner γιατί ευθύνεσαι αυτοπροσώπως για το γεγονός ότι ο cryptosize κατάφερε να ανέβει βαθμίδα στο bitcointalk με όλα τα merit που του έστειλες.  Σε ευχαριστώ που μου αποδεικνύεις ότι η συντριπτική πλειοψηφία εδώ μέσα είστε nerds άνευ κοινωνικής ζωής...Εγώ μπορεί να είμαι 6 χρόνια εδώ μέσα (τουλάχιστον με αυτό το account, κανείς δεν μπορεί να ξέρει με 100% σιγουριά αν έχω κι άλλα) όπως είπε κάποιος, αλλά δεν κάθομαι να προσέχω μικρολεπτομέρειες του τύπου ποιός δίνει τα πιο πολλά merit σε ποιόν ή τι σημαίνει Copper Member.Σου ακούγεται κουφό το παραπάνω, έτσι; Όχι και τόσο κουφό αν σκεφτείς ότι δεν παίρνω τόσο σοβαρά το forum όσο εσείς, δεν βιοπορίζομαι από αυτό, έχω και πραγματική ζωή να ασχοληθώ (από εκεί βγάζω λεφτά)...Σε γενικές γραμμές δεν θα κάτσω να σκαλίσω πράγματα, εκτός και αν προκληθώ να το κάνω.Ακόμα και το forum να κλείσει ο theymos, δεν θα κλάψω (σε αντίθεση με εσάς που θα χάσετε λεφτά). Το ξέρω και το ξέρεις.Quote from: alani123 on December 04, 2023, 03:08:01 AMΠιστεύω το topic θα ήταν αχρείαστο αν απλά τον αγνοούσες; Δεν υπάρχει ανάγκη νομίζω να λυθεί κάτι, το trolling δεν απαγορεύεται.Αν απαγορεύεται το trolling/shitposting, ο πρώτος που θα πρέπει να φάει ban είναι ο BlackHatCoiner. Κατά δήλωση του προβαίνει σε ακατάσχετο shitposting με franky1/HmmMAA και άλλους με σκοπό να ανεβάζει post count/merits και να βγάζει λεφτά από τα signature/avatar campaigns. Αυτό είναι νόμιμο άραγε;Έχει χεστεί πάνω του (για αυτό άνοιξε νήμα, για να μου τραβήξει την προσοχή, ενώ εγώ δεν είχα καμία όρεξη για κουβέντα μαζί του) που ξέρει ότι έχω ατράνταχτες γραπτές αποδείξεις (κι ας το παίζει τρελίτσα/ανήξερος) και ότι αν τραβήξει το σχοινάκι, θα πάνε στους αρμόδιους και θα χάσει και τις τελευταίες εβδομάδες χαρτζιλικιού που έμειναν μέχρι το τέλος του έτους.Quote from: BlackHatCoiner on December 03, 2023, 05:59:49 PMΤο λέω γιατί πετάς κάτι υπονοούμενα (που αντιλαμβάνομαι ότι αναφέρεσαι σε μένα)Αυτό μπορείς να το αποδείξεις; Όχι με υποψίες/εικασίες. Να αναφέρομαι σε εσένα ονομαστικά (όχι αόριστα/υπονοούμενα).Αν ΔΕΝ μπορείς, τότε είσαι ένας υποκριτάκος ολκής.Γιατί από την μια κατηγορείς εμένα ότι δεν έχω επαρκείς αποδείξεις εναντίον των εμβολίων (αστείο εν έτει 2023, σε λίγο μπαίνουμε στο 2024, στο χέρι σου είναι να ενημερωθείς ΑΝ θες), αλλά από την άλλη εσύ έχεις την μύγα να νομίζεις ότι αναφέρομαι σε εσένα.Για να δεχτώ την λογική σου, θα δεχτείς και εσύ αναγκαστικά την δική μου λογική. Όχι μονά-ζυγά δικά σου.Ακόμα και μια απάντηση του τύπου «ξέρεις κάτι cryptosize, έχω αφιερώσει ΟΛΗ μου την ζωή στα Μαθηματικά, στην Κρυπτογραφία, στον Προγραμματισμό, στο Bitcoin και συνεπώς ΔΕΝ έχω τον ίδιο χρόνο όπως εσύ να ψάξω εις βάθος τα της COVID πλανδημίας και αν τα εμβόλια είναι απάτη ή όχι, στην τελική δεν με ενδιαφέρει, άσε που είμαι χεσμένος πάνω μου μην έκανα μαλακία με τις 2 δόσεις, οπότε δεν με συμφέρει να το ψάξω και να μελαγχολήσω, ήδη είμαι αρκετά ευάλωτη χιονονιφάδα» να ξέρεις θα γίνει αποδεκτή από εμένα, διότι θα την εκλάβω ως ειλικρινή απάντηση. Δυσάρεστη μεν, ειλικρινής δε.Quote from: BlackHatCoiner on December 04, 2023, 09:22:38 AMΑν δε το γνωρίζει ο ίδιος, το doxxing οδηγεί στο ban με τον τρόπο που το χρησιμοποιεί.Αγαπητέ Άγγελε χρησιμοποιώ fora (και BBS πιο πριν, αν ξέρεις τι είναι αυτό) πολύ πριν καν γεννηθείς εσύ. Δεν χρειάζομαι μαθηματάκια. Επίσης δεν φοβάμαι κανένα ban, ειδικά σε ένα μισο-πεθαμένο forum. Αλλού οι απειλές σου, θα σου βγουν ξινές αν συνεχίσεις να το τραβάς.Επειδή έχω μαζέψει αρκετά στοιχεία για πάρτη σου (και δυστυχώς για εσένα δεν γνωρίζεις με ποιόν μιλάς), θέλω να μου πεις αν είναι νόμιμο να συμμετέχεις σε mixer (Sinbad) ο οποίος κατά 50% είχε κεφάλαια από παράνομες δραστηριότητες.Όταν λέω στοιχεία, γνωρίζω και επώνυμο και σε ποιό Πανεπιστήμιο φοιτείς και τα στοιχεία των γονέων σου και αρκετά screenshots (κάποια εκ των οποίων μου τα έχουν στείλει «φίλοι» σου).Θες να μας πεις τι θα συμβεί αν αυτά τα στείλω στους γονείς σου και στην Αστυνομία; Πώς ακριβώς θα εξηγηθείς; Γιατί είμαι σίγουρος ότι δεν έχεις πει το παραμικρό για mixers στους γονείς σου, παρά μόνο γενικούρες ότι ασχολείσαι με Bitcoin γενικά και αόριστα.Όχι τίποτα άλλο, αλλά μένεις και σε σπίτι που σου πληρώνουν όλα σου τα έξοδα (πλην delivery) και θα είναι κρίμα να σε πετάξουν έξω με τις κλωτσιές αν μάθουν πως ακριβώς βγάζεις λεφτά από το internet...Εντελώς φιλικά (επειδή βλέπω από φιλικές προειδοποιήσεις δεν καταλαβαίνεις, ήδη σου είπα στο άλλο νήμα ότι δεν σε συνέφερε να το κάνεις bump, για αυτό και το κλείδωσα, αφού κιόλας δεν είδα κάποιο επιχείρημα για τις ταυτότητες, παρά μόνο προσωπικές επιθέσεις ότι είμαι ψεκασμένος συνωμοσιολόγος) σκέψου ποιός έχει να χάσει περισσότερα από αυτή την ιστορία.Εσύ νομίζεις ότι σε προστατεύει η ανωνυμία και να το να κρύβεσαι πίσω από μια οθόνη, εγώ σου λέω ότι δεν είσαι και τόσο ανώνυμος όσο νομίζεις, παρά το Tor/mixer usage. Θα υπάρξουν συνέπειες στον πραγματικό κόσμο για εσένα vs ban για εμένα (αμφίβολο, προσπάθησες -κατά δήλωσή σου- να κάνεις ban τον franky1 και ΔΕΝ τα κατάφερες).Γενικά σε έχω παρατηρήσει ότι αρέσκεσαι να στήνεις λαϊκό δικαστήριο στο forum για όποιον αντιπαθείς (ένα παράδειγμα είναι ο franky1).Το ότι εγώ δεν σπαμάρω όπως εσύ γιατί θέλω να γράφω ουσιαστική πληροφορία (και όχι shitposting με franky1) δεν σημαίνει ότι δεν μιλάω με κόσμο εδώ μέσα χρόνια τώρα (και με PM)... είμαι πιο παλιός από εσένα, μην μπερδεύεσαι.Στην θέση σου θα ζητούσα ταπεινά συγνώμη, θα εξαφανιζόμουν δια παντός όχι μόνο από το bitcointalk, αλλά γενικά από όλα τα fora και θα παρακαλούσα να ξεχαστεί η όλη ιστορία, διότι είσαι μπλεγμένος σε εγκληματική οργάνωση ξεπλύματος χρήματος (κατά συρροή κιόλας, όχι μόνο σε έναν mixer). Δεν μπορείς να δηλώσεις άγνοια νόμου. Αυτά στα λέω γιατί μου φαίνεσαι wannabe νομοταγής πολίτης (εξού και το εμβόλιο που έκανες, εξού και η αποδοχή της νέας ταυτότητας -κατά δήλωσή σου-).Όσο για το WEF/Great Reset, αρκετές φορές προσπάθησα να σε προστατέψω από την βλακεία σου, αλλά ούτε το κατάλαβες, ούτε το εκτίμησες. Ο ορισμός της αχαριστίας!Για να στο πω ωμά: οι ίδιοι που κρύβονται πίσω από το Digital ID και τα πειραματικά mRNA (Transhumanism Agenda), οι ίδιοι κρύβονται πίσω από το μαζικό κλείσιμο mixers. \"No privacy in 2030\"Θες να το καταλάβεις; Έχει καλώς. Δεν θες (επειδή το θεωρείς «ψεκασμένη θεωρία συνωμοσίας»); Δεν χάνω εγώ κάτι. Εσύ θα τα χάσεις ΟΛΑ (και το τελευταίο σατόσι) αν σε καλέσουν από την Αστυνομία για ανάκριση, σε βάλουν σε ένα ανήλιαγο υπόγειο και ξεράσεις μόνος σου τις 12-24 λέξεις.«Μα-μου δεν ήξερα, είμαι αθώο/ευάλωτο/μικρό παιδί, με εξαπάτησαν» να ξέρεις ΔΕΝ περνάνε ούτε σε εμένα, ούτε σε αυτούς.-Ευχήσου να μην χρειαστεί να μάθεις ποιός είμαι στην πραγματική ζωή...Γενικά για εσένα ένα πράγμα έχω καταλάβει πολύ καλά: δεν είσαι preemptive thinker, ΔΕΝ σε νοιάζει ΤΙ θα συμβεί στο μέλλον, μέχρι να σου μπει το ζεστό αυγό στον κώλο (το κλείσιμο των mixers είναι μόνο η αρχή). Επίτηδες στα γράφω κάπως ωμά, για να σε ξυπνήσω/ταρακουνήσω! Με το πατ-πατ στην πλατούλα ποτέ κανείς δεν ξύπνησε...Ούτε το εμβόλιο που έκανες σε προβληματίζει, γιατί δεν έχεις δει παρενέργειες (μέχρι τώρα). Στο μέλλον; Βάζεις στοίχημα ότι δεν θα δεις ποτέ; Σε 5-10-20 χρόνια;Quote from: BlackHatCoiner on December 04, 2023, 09:22:38 AMΦαντάζομαι θα είναι παράξενο να μιλάς καθημερινά με κάποιον (εμένα) που ξαφνικά διαφωνεί σχεδόν με ό,τι λεςΔεν με ενδιαφέρει αυτό. Με ενδιαφέρει να μην είσαι ΟΦΑ.Επειδή είσαι νεαρός, είναι λογικό να αλλάζεις συνέχεια απόψεις, αλλά ταυτόχρονα είναι λογικό να μην μπορεί να σε εμπιστευτεί κάποιος.Εσύ αύριο-μεθαύριο (σε 5 χρόνια) μπορεί (υποθετικό σενάριο) να βρεις δουλειά στο σύστημα με €20.000/μήνα (ψηφιακά/CBDC), να γίνεις ο μεγαλύτερος υποστηρικτής του CBDC/e-euro και ταυτόχρονα ο μεγαλύτερος πολέμιος του Bitcoin (μεγαλύτερος και από τον anon). Το αποκλείεις κατηγορηματικά ότι ΔΕΝ θα συμβεί αυτό το σενάριο;Τι συμπέρασμα να βγάλω εγώ μετά για σένα; Ότι είσαι ιδεολογικά συνεπής; Ή ότι είσαι ΟΦΑ;Quote from: BlackHatCoiner on December 04, 2023, 09:22:38 AM(που κι αυτό σχετικό είναι, γιατί περί οικονομικών στέκουν πολλά απ' όσα λέει).Ούτε αυτό με ενδιαφέρει. Τίποτα δεν έχεις καταλάβει για μένα.Εγώ λέω κάποια πράγματα τώρα (2023) και αφήνω τον χρόνο (ο πιο δίκαιος κριτής) να περάσει και να αποδείξει αν είχα δίκιο ή όχι.Δεν είναι δυνατόν να ξέρει κάποιος αν αυτά που λέω τώρα στέκουν ή όχι, εκτός αν έχει χρονομηχανή και μπορεί να το επαληθεύσει.Θυμάσαι τι έγραφα σε άλλο forum το 2020 περί πληθωρισμού λόγω COVID QE; Θυμάσαι πόσοι (δεν) με πίστεψαν;Θυμάσαι τι έγραφα (έχεις δει links) εδώ μέσα τέλη 2018 για μεγάλο bull run το 2021, που θα κορυφωνόταν τέλη του έτους (όπως και έγινε);ΠΩΣ μπορεί κάποιος να ξέρει από τώρα αν στέκουν αυτά ή όχι; Πώς μπορεί να ξέρει αν όντως θα έχουμε μεγάλο bull run το 2025; Έχει χρονομηχανή;Εγώ ήλπιζα οι Bitcoiners (μια ομάδα ανθρώπων που εκτιμούσα πολύ κάποτε, πλέον όχι και τόσο, μετά από αρκετές απογοητεύσεις την ψιλοαπομυθοποίησα) να έχετε καταλάβει την αξία του delayed gratification. Να έχετε την υπομονή να περιμένετε κάμποσα χρόνια να δείτε αν επαληθευτώ ή όχι.Όχι να ουρλιάζετε ότι δεν ισχύουν/δεν στέκουν αυτά που γράφω, επειδή είστε ανυπόμονοι (instant gratification).Τι σχέση έχει το instant gratification με την φιλοσοφία του Bitcoin; Καμία! Ίσα-ίσα που καίγονται άσχημα όσοι είναι ανυπόμονοι.Quote from: BlackHatCoiner on December 04, 2023, 09:22:38 AMΑυτό που συνέβη είναι το εξής: ξεκίνησα να διαβάζω κάποια πράγματα λίγο μόνος, άρχισα να συμμετέχω σε συζητήσεις με άτομα στον κλάδο της βιολογίας και του περιβάλλοντος / καιρού. Και τότε ξαφνικά που άλλαξε η γνώμη μου άρχισαν οι επιθέσεις. Και πάρε πως οι επιστήμονες είναι πληρωμένοι για να λένε ψέματα, και πάρε πως οι Bitcoiners δεν πιστεύουν σε \"woked\" επιστήμη. Κλπ.Αν θέλεις αντικειμενική άποψη περί mRNA, θα ρωτήσεις εργαζόμενο της Pfizer/Moderna; Όχι, γιατί ξέρεις ότι έχουν conflict of interest. Δεν πρόκειται να πουν κάτι κάτι κακό για το προϊόν του εργοδότη τους. Ούτε εσύ θα έλεγες (αν τα έπαιρνες), ούτε εγώ θα έλεγα. Ναι ή ου;Αν θέλεις αντικειμενική άποψη περί «ανθρωπογενούς» κλιματικής αλλαγής, θα ρωτήσεις κλιματικούς επιστήμονες που βιοπορίζονται από αυτό το αφήγημα;Αν θέλεις αντικειμενική άποψη περί Bitcoin, θα ρωτήσεις εργαζόμενους (BTC developers) της BlockStream; (φυσικά δεν ισχυρίζομαι ότι πρέπει να πας να ρωτήσεις τον Craig Wright και τους BSV groupies του )Κατάλαβες τώρα πως πάει η δουλειά;Είσαι μικρός ακόμα και έχεις να μάθεις πολλά για το πως δουλεύει ο καπιταλιστικός κόσμος: https://en.wikipedia.org/wiki/Conflict_of_interest",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptosize",
      "created_time": "December 04, 2023, 08:17:18 PM",
      "body": "Quote from: BlackHatCoiner on December 04, 2023, 09:22:38 AMΞέρετε, το ίντερνετ ενώ είναι ένα ανεκτίμητο εργαλείο, μας έχει κάνει όλους ένα τεράστιο κακό. Οι άνθρωποι δεν κάνουν αποφάσεις βασισμένες στο τι είναι αληθινό, αλλά στο τι ικανοποιεί τα συναισθήματά τους. Οι περισσότεροι δεν γκουγκλάρουμε αυτό που είναι αληθινό και δυσάρεστο για μας, αλλά αυτό που είναι ευχάριστο και fake news. Πιστεύεις πως τα εμβόλια είναι επικίνδυνα και πως επιβάλλονται για να μειώσουν τον πληθυσμό; Εδώ δίπλα υπάρχει ένα φόρουμ με ένα σκασμό άλλους που επιβεβαιώνουν την πεποίθησή σου.Μου αρέσει που μιλάς για συναισθήματα, αλλά δεν καταλαβαίνεις (ξανά, για πολλοστή φορά!) ότι κάνεις ψυχολογική προβολή πάνω μου.Ιδού τι εννοώ: https://i.imgur.com/KQMHwB4.pngΒλέπεις αυτός ο τύπος (Covidiot/υπέρ των πειραματικών mRNA) να μιλάει με επιστημονικά επιχειρήματα; Γιατί εγώ φουλ συναίσθημα (morality, empathy) βλέπω.Δυστυχώς είσαι μικρός και ανήκεις στην «ψυχοπονιάρικη» GenZ γενιά (δεν φταις εσύ φυσικά, δεν διαλέγουμε το πότε θα γεννηθούμε) και ναι, πέφτεις θύμα του wokeness.Κάνε εσύ ο νέος το πειραματικό εμβόλιο, για να μην σκοτώσεις τον παππού και την γιαγιά... κι ας μην αποτρέπει την μετάδοση το εμβόλιο!Αν δεν είναι αυτό συναίσθημα γούτσου-γούτσου/πατ-πατ στην πλατούλα, ΤΙ είναι; Επιστημονικό επιχείρημα σίγουρα ΔΕΝ είναι.-Quote from: BlackHatCoiner on December 04, 2023, 09:22:38 AMΗ γυναίκα σου σε παρατάει κι αρχίζεις να πιστεύεις πως οι γυναίκες είναι εγωίστριες; Μέσα σε ένα λεπτό θα έχεις βρει 10 άρθρα που  \"εξηγούν\" γιατί είναι λογικό να είσαι μισογύνης. (το πρώτο είναι χαρακτηριστικό παράδειγμα για αυτόν)Εντελώς φιλικά δεν πρόκειται να τον βρέξεις αν δηλώνεις Φεμινιστής (δηλαδή simp/cuck) σε γυναίκα (είτε woke, είτε based).Επειδή (αν θυμάμαι καλά) παρακολουθείς τον Andrew Tate (και καλά κάνεις, δεν σε ψέγω!), ο οποίος δεν είναι απλά φανατικός Bitcoiner, anti-woke, αλλά και «ψημένος» στην πραγματική ζωή (έχει εμπειρία με γυναίκες κλπ.), ο όρος «μισογύνης» είναι απλά μια ενοχική νεοταξίτικη παπάτζα για αφελείς GenZ νεαρούς (οι οποίοι δεν θα γαμήσουν ποτέ όπως το πάνε και ΔΕΝ εννοώ σε μπουρδέλο, αλλά ούτε και μπάζα/χοντρές).Να συνεχίσεις να τον παρακολουθείς τον Andrew Tate αν θες να γίνεις άντρας κάποια στιγμή, είναι καλό influence και το ότι τρώει πόλεμο από το σύστημα (φυσικά και ΔΕΝ στηρίζει ούτε εμβόλια κλπ.) δείχνει ότι κάτι κάνει καλά. Περίπου όπως και το Monero...Quote from: BlackHatCoiner on December 04, 2023, 09:22:38 AMQuote from: alani123 on December 04, 2023, 03:08:01 AMΔεν υπάρχει ανάγκη νομίζω να λυθεί κάτι, το trolling δεν απαγορεύεται.Βασικά απαγορεύεται, απλά το moderation είναι τόσο ανεπαρκές που φαίνεται πως επιτρέπεται.Άγγελε έχεις κάνει πολύ περισσότερο trolling/shitposting και μάλιστα για να βγάλεις λεφτά από εγκληματικές δραστηριότητες. Δεν σε συμφέρει να σε αναφέρω στον theymos... το ξέρεις και το ξέρω. ΥΓ: Αν δεν έχετε σκοπό να απαντήσετε αναλυτικά και με ειλικρίνεια σε κάθε point μου, μην μπείτε στον κόπο καν. Είναι καλύτερο να εξαφανιστείτε (ειδικά όσοι έχετε ράμματα στην γούνα σας με mixers κλπ.)Ειδικά εσύ BlackHatCoiner την προηγούμενη φορά στριμώχθηκες και την έκανες με ελαφρά: https://bitcointalk.org/index.php?topic=5465675.msg63168320#msg63168320",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "alani123",
      "created_time": "December 04, 2023, 08:31:39 PM",
      "body": "Αρχικά cryptosize μην μας τσουβαλιάζεις όλους στο ίδιο γκρουπ. Δεν έχω κάποια κόντρα μαζί σου και ούτε με πολυενδιαφέρει αν υπάρχει κάποια κόντρα.Μιας και ρώτησες, η νέα ταυτότητα είναι ΑΙΣΧΡΗ από κάθε άποψης και προσωπικά θα την αποφύγω όσο μου περνάει απ' το χέρι. Αλλά αν ήθελα να είμαι ΠΡΟΒΑΤΟ είναι δικαίωμα μου. Θα δεχόμουν να με ειρωνευτείς, να με χλευάσεις άντε και να με βρίσεις... Αλλά αν ήξερες το όνομα μου θα ήταν ασέβεια να το δημοσιοποιείς χωρίς την άδεια μου. Αν και δεν διαφωνώ σε κάποια πράγματα που λες, π.χ. το WEF είναι επίσης αισχρό, καταλήγουμε σε άλλα συμπεράσματα και γι' αυτό δεν με ενδιαφέρει να το αναλύω πολύ. Πρόβλημα μου. Αλλά αν θες να είσαι κύριος καλό είναι να μην πετάς το όνομα του OP αριστερά δεξιά. Μπορείς απλά να διαγράψεις αναφορές σ' αυτό και λέγε ότι θες, άποψη μου. Πιστεύω ούτε εσένα θα σ' άρεσε να στο κάνουν.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptosize",
      "created_time": "December 04, 2023, 08:37:12 PM",
      "body": "Quote from: alani123 on December 04, 2023, 08:31:39 PMΑρχικά cryptosize μην μας τσουβαλιάζεις όλους στο ίδιο γκρουπ. Δεν έχω κάποια κόντρα μαζί σου και ούτε με πολυενδιαφέρει αν υπάρχει κάποια κόντρα.Μιας και ρώτησες, η νέα ταυτότητα είναι ΑΙΣΧΡΗ από κάθε άποψης και προσωπικά θα την αποφύγω όσο μου περνάει απ' το χέρι. Αλλά αν ήθελα να είμαι ΠΡΟΒΑΤΟ είναι δικαίωμα μου. Θα δεχόμουν να με ειρωνευτείς, να με χλευάσεις άντε και να με βρίσεις... Αλλά αν ήξερες το όνομα μου θα ήταν ασέβεια να το δημοσιοποιείς χωρίς την άδεια μου. Αν και δεν διαφωνώ σε κάποια πράγματα που λες, π.χ. το WEF είναι επίσης αισχρό, καταλήγουμε σε άλλα συμπεράσματα και γι' αυτό δεν με ενδιαφέρει να το αναλύω πολύ. Πρόβλημα μου. Αλλά αν θες να είσαι κύριος καλό είναι να μην πετάς το όνομα του OP αριστερά δεξιά. Μπορείς απλά να διαγράψεις αναφορές σ' αυτό και λέγε ότι θες, άποψη μου. Πιστεύω ούτε εσένα θα σ' άρεσε να στο κάνουν. Επειδή δεν πόσταρες στο νήμα με το CBDC (τώρα το τσέκαρα), όντως δεν σε αφορά εκείνη η συζήτηση (με την έννοια ότι δεν συμμετείχες στην επίθεση εναντίον μου). Θες να το διαβάσεις για να έχεις άποψη τι έχει εκτυλιχθεί; Be my guest.Σου είπα δεν ασχολούμαι τόσο πολύ με το forum να θυμάμαι τον καθένα εδώ μέσα ονομαστικά... όμως με τον τρόπο που έγραψες (επιθετικά εναντίον μου) στο παρόν νήμα μου έδωσες την εντύπωση ότι συμμετείχες και στο άλλο νήμα.Πριν γράψεις κάτι για μένα, διάβασε το άλλο νήμα να σχηματίσεις άποψη ποιός ξεκίνησε το πατιρντί... όχι εγώ πάντως.Όσο για το όνομα, έχει ποσταριστεί σε 500 μεριές (και από άλλους και από τον ίδιο). Ας μου κάνει μήνυση αν έχει πρόβλημα, εγώ δεν φοβάμαι κάτι.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptosize",
      "created_time": "December 04, 2023, 08:44:25 PM",
      "body": "Quote from: alani123 on December 04, 2023, 08:31:39 PMΑρχικά cryptosize μην μας τσουβαλιάζεις όλους στο ίδιο γκρουπ. Δεν έχω κάποια κόντρα μαζί σου και ούτε με πολυενδιαφέρει αν υπάρχει κάποια κόντρα.Μιας και ρώτησες, η νέα ταυτότητα είναι ΑΙΣΧΡΗ από κάθε άποψης και προσωπικά θα την αποφύγω όσο μου περνάει απ' το χέρι. Αλλά αν ήθελα να είμαι ΠΡΟΒΑΤΟ είναι δικαίωμα μου. Θα δεχόμουν να με ειρωνευτείς, να με χλευάσεις άντε και να με βρίσεις... Αλλά αν ήξερες το όνομα μου θα ήταν ασέβεια να το δημοσιοποιείς χωρίς την άδεια μου. Αν και δεν διαφωνώ σε κάποια πράγματα που λες, π.χ. το WEF είναι επίσης αισχρό, καταλήγουμε σε άλλα συμπεράσματα και γι' αυτό δεν με ενδιαφέρει να το αναλύω πολύ. Πρόβλημα μου. Αλλά αν θες να είσαι κύριος καλό είναι να μην πετάς το όνομα του OP αριστερά δεξιά. Μπορείς απλά να διαγράψεις αναφορές σ' αυτό και λέγε ότι θες, άποψη μου. Πιστεύω ούτε εσένα θα σ' άρεσε να στο κάνουν. Όσο για το αν είναι δικαίωμά σου να είσαι πρόβατο, διαφωνώ και εξηγούμαι:Αν δεχτείς το εμβόλιο και το QR/COVID/Green Pass (για να πίνεις καφέ στα μαγαζιά), κάνεις κακό και σε εμένα που δεν θέλω να βάλω πρόγραμμα mRNA στον οργανισμό μου.Αν δεχτείς την νέα ταυτότητα (Digital ID) και γίνει απαραίτητη για είσοδο σε εργασιακούς χώρους/Πανεπιστήμια/Νοσοκομεία/super market/αεροπλάνα/τρένα/social media, κάνεις κακό και σε εμένα που δεν θέλω να δεχτώ το \"No privacy in 2030\".ΔΕΝ είναι δικαίωμα σου να είσαι πρόβατο και φυσικά θα σε ψέξω! Μην σου πω ότι θα σε κάνω στιφάδο (γιατί στην Φύση αυτή είναι η μοίρα του προβάτου -aka useless eater που λέει ο αγαπητός Χαράρι-, να το τρώει ο λύκος). ΥΓ: Από ότι κατάλαβα είσαι κατά του WEF και συνολικά εναντίον της ατζέντας. Αν θες γράψε περισσότερα περί αυτού, μην γράφω μόνο εγώ. Μόνο έτσι θα ζωντανέψει το forum, όχι με spam posts για sig campaigns.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptosize",
      "created_time": "December 04, 2023, 08:54:13 PM",
      "body": "Quote from: alani123 on December 04, 2023, 03:08:01 AMΈχει επιτεθεί και σε άλλους χρήστες της Ελληνικής κοινότητας εδώΑν θες γράψε ποιοί είναι οι άλλοι χρήστες. Με στοιχεία/links. Εγώ πάντα με στοιχεία μιλάω.Ο HmmMAA που με αποκάλεσε γιδογάμη; (ή ο Ultegra134 που του έδωσε merit για τις βρισιές εναντίον μου?) Εγώ του έκανα επίθεση πρώτος;Αυτά άραγε έχει τα κότσια να τα πει στην πραγματική ζωή; Εμένα δεν με έχετε δει στην πραγματική ζωή... δεν είμαστε όλοι nerds.Εγώ έχω επιθετικό avatar; -> https://disqus.com/by/geo_gou/Ένα απλό προφίλ άνευ avatar/signature έχω... μην μπερδεύεις την επίθεση με την άμυνα.ΥΓ: Ορισμένοι μου θυμίζετε τους δυτικόφιλους που ισχυρίζονται ότι η Ρωσία μπήκε αναίτια στην «αθώα» Ουκρανία και τα έκανε λαμπόγυαλο.Αν πας σε μια αρκούδα και την τσιγκλάς με ένα μυτερό ξύλο, θα φταίει η αρκούδα αν αμυνθεί και σε ξεσκίσει άραγε;Μην τσιγκλάτε και κανείς δεν θα ασχοληθεί μαζί σας. Είναι τόσο απλό και αποτελεί νόμο της φύσης.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}