{
  "id": "topic_5432224",
  "title": "Silence Scream",
  "author": "Silence Scream",
  "created_time": "December 28, 2022, 10:47:34 PM",
  "content": "Bu konuda daha önce de çalışma yapmıştım. Yine çalışma yapmak istedim. Bu zamana kadar ki en büyük savlar Bitcoin doğayı kirletiyor diye geliyordu ve büyük ülkeler bu yüzden bitcoini çevreci olmamakla suçluyordu. Evet belki bitcoin tam çevreci bir sisteme sahip değil Ancak; Kendilerini Şam şeytanı zanneden bu kişiler bazı istatistikleri hep görmezden geliyorlar. Biraz araştırınca bununla ilgili onlarca makale olduğu, grafik olduğu özellikle yabancı kaynaklarda görülüyor. Biz ise grafikler üzerinden açıklamaya çalışalım :Bu grafikte gördüğünüz şey bize Karbondioksit Emisyonlarını gösteriyor. Bankacılık sisteminin Karbondioksit emisyonu Bitcoin sisteminden 4 kat fazla.Bu grafikte ise yıllık ekonomik maliyetleri görüyorsunuz. Değerler Milyar dolar cinsinden ifade ediliyor. Ayrıca alt tarafta yer alan enerji grafiğinde ise Bankacılık sisteminin 2340 Milyon Gigajul kullanırken, Bitcoin ile Altın madenciliği hemen hemen aynı ve 1/4 oranında kullandığını görüyoruz.Ülkelere göre enerji kullanımında Bitcoin, Arjantin’den biraz yukarıda yer alıyor.Ayrıca Bitcoinin yenilebilir enerji ile harcadığı elektriğin %78’ini tekrar ekosisteme kazandırıyor. Bu görselde de görüldüğü gibi dünya enerjisinin komik bir oranının Bitcoin enerjisi ile harcandığını görebiliriz.Yani sistem biraz daha gerçekçi sebeplere dayanarak bunu iddia ederse gerçekçilik kazanır. Aksi taktirde hepsi birer iddia olarak kalacaktır. Kaynaklar : 1- https://knoema.com/infographics/hatanue/what-about-the-carbon-footprint-of-fiat-money-elon-musk2- https://www.google.com.tr/amp/s/theecobahn.com/ideas/bitcoin-carbon-footprint-the-future-of-online-payments/amp/3- https://news.bitcoin.com/bitcoin-energy-consumption-is-far-more-efficient-and-greener-than-todays-banking-system/4- https://cointelegraph.com/news/bitcoin-mining-council-survey-estimates-a-56-sustainable-power-mix-in-q2/amp",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5432224",
  "comments": [
    {
      "author": "Bthd",
      "created_time": "December 28, 2022, 11:05:57 PM",
      "body": "Bitcoini enerji harcadığı için eleştiren bir kişiye hak veririm. Eleştirilmeli ve mutlaka daha temiz enerji harcayacağı bir şekilde doğayı daha az kirleteceği çözümler bulunmalı. Bitcoini sevmemin sebeplerinden birisi gelişime açık olması ve topluluk olarak biz de elimizden geleni yapmalıyız.Bitcoini tükettiği enerji üzerinden vurmaya çalışarak başarısız olacağını söyleyen insanlar ise mantık dairesinin tamamen dışındalar. Bu savı ortaya koyan kişiler geleneksel finans kuruluşlarının bitcoinden çok daha fazla enerji tükettiğini ve çok daha fazla kirlilik yarattıklarını bilmelerine rağmen bu argümanı ortaya koyuyorlar. Gerçekleri değiştiremeyecekleri için çok önemli değiller. Sadece fiat paralar ile oynadıkları oyunun bozulmasından korkuyorlar. Bu savın diğer versiyonları bitcoini sadece suçlular kullanır yada bitcoin ile gizli işlem yapılabileceği için suça açık olduğu gibi saçma fikirler. Şeffaflık alanında bitcoin ile fiat paralar mukayese dahi edilemez.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gospodin",
      "created_time": "January 01, 2023, 01:32:18 PM",
      "body": "şu an için tüm dünyanın entegre olduğu bankacılık sistemi ile bitcoin'i karşılaştırmak sizce mantıklı mı? her şeyi geçtim ikisinin elektrik tüketimi aynı nedenler üzerine değil. btc madenciliğinin elektrik sarfiyatını olumlu göstermek için bir şeyler öne süremeye gerek yok. ama henüz yolun başında olduğumuzu düşünürsek ileride çok farklı durumlar yaşayabiliriz. bunun için btc'ye de gerek yok. o sadece kıvılcımı ateşleyen bir \"ata\" olarak kalbimizde yaşayabilir.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}