{
  "id": "topic_5428055",
  "title": "bonfire66",
  "author": "bonfire66",
  "created_time": "December 12, 2022, 02:58:35 PM",
  "content": "А вот еще такая тема… Если вдруг настанет то славное время, когда законы РФ вдруг по волшебству вдруг начнут работать, то сколько миллионов человек граждан РФ тогда придется посадить реально в тюрячку? Согласно (официальным текущим законам РФ, а не будущим возможно гипотетическим законам). Сколько?     Вот если бы вот сейчас (допустим) применить хотя бы РЕАЛЬНЫЕ действующие законы по всей строгости. То кого придется посадить? Почти всех ментов, почти всех росгвардейцев, почти всех ОМОНовцев, почти все ФСБ, почти все ФСО, почти всех судей, почти всех чиновников, учителей, таможенников, прокуроров, почти всех военных… сколько получится в итоге? Статья 353 УК РФ о планировании, подготовке и ведении захватнической войны. Как только войну с Украиной признают захватнической, то сколько тогда граждан РФ попадут под эту статью? Есть предположения? ИМХО, это будет явно больше 50 миллионов человек в возрасте от 20 до 80. Тюрем точно хватит на всех? А если не хватит на всех тюрем, то что?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5428055",
  "comments": [
    {
      "author": "Snork1979",
      "created_time": "December 13, 2022, 06:35:36 PM",
      "body": "Quote from: bonfire66 on December 12, 2022, 02:58:35 PMА вот еще такая тема… Если вдруг настанет то славное время, когда законы РФ вдруг по волшебству вдруг начнут работать, то сколько миллионов человек граждан РФ тогда придется посадить реально в тюрячку?Бонифаций, да не сцы ты!Никто в РФ старых бухариков и дрочеров, вроде тебя не сажает пока что.Вот если тебя угораздит в Дурдоину угодить - тогда сочувствую тебе. Там за любое инакомыслие нынче СБУ приходит и сажает.Нацистский режим, однако ...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bonfire66",
      "created_time": "December 14, 2022, 10:15:46 AM",
      "body": "Большая просьба, в ответах на мои посты пожалуйста, не упоминайте меня как личность. Я же написал этот пост не про вас лично. И не про себя лично. А про общество. Так и пишите тоже про общество. Пожалуйста!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Snork1979",
      "created_time": "December 14, 2022, 02:26:25 PM",
      "body": "Quote from: bonfire66 on December 14, 2022, 10:15:46 AMБольшая просьба, в ответах на мои посты пожалуйста, не упоминайте меня как личность. Я же написал этот пост не про вас лично. И не про себя лично. А про общество. Так и пишите тоже про общество. Пожалуйста!Бонифаций, я пишу посты от себя и за себя.Пиши, пожалуйста, и ты тоже только за себя, а не «за всё общество».",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "antiark",
      "created_time": "December 16, 2022, 01:08:55 AM",
      "body": "Сядем, обязательно сядем. Но потом!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bonfire66",
      "created_time": "December 16, 2022, 09:36:34 AM",
      "body": "Никто так пока и не ответил на мой вопрос данного топика. Если текущие законы РФ применить ко всем Россиянам... ОК, хорошо. Хотя бы не все законы а только УК. То сколько человек придется посадить? Хотя бы примерно? Есть предположения?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Snork1979",
      "created_time": "December 16, 2022, 06:08:04 PM",
      "body": "Quote from: bonfire66 on December 16, 2022, 09:36:34 AMНикто так пока и не ответил на мой вопрос данного топика.Бонифаций, тебе давно уж ответили и на этот твой вопрос и на твои другие тупые вопросы в других твоих топиках.Но ты, в силу своей тупости, этого упорно \"не замечаешь\" ...Quote from: bonfire66 on December 16, 2022, 09:36:34 AMЕсть предположения?Есть, конечно: предлагаю тебе научиться хоть немного думать.Вряд ли это реализуемо, но, может быть, ты хотя бы попытаешься это сделать?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}