{
  "id": "topic_5461233",
  "title": "bitmover",
  "author": "bitmover",
  "created_time": "July 27, 2023, 05:47:01 PM",
  "content": "Hoje fui usar a binance e fui informado de que preciso fazer minha declaração de fonte de renda, senão minha conta será congelada em breve.Fui olhar a declaração,  e começam com algumas perguntas que não são nada demais https://www.binance.com/pt-BR/support/faq/como-preencher-a-declara%C3%A7%C3%A3o-de-fonte-de-renda-e-patrim%C3%B4nio-c22109193d1247b3af1027e72fa0d5b7Eu não terminei de preencher , e resolvi olhar na Internet se iria precisar de algo mais além de responder perguntas. Daí me deparei c esse site da binance, onde falam que pedem documentos super invasivos.Contracheque do empregador do último mês, declaração de imposto de renda e outros absurdos.Eu adoro usar a binance, uso desde 2017, e fico triste de ver isso rolando. Já vi que chegou a hora de procurar outra corretora.Tenho contas nas principais corretoras do mundo, tanto de criptomoedas quanto do mercado de capitais, e nunca vi exigências desse nível.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5461233",
  "comments": [
    {
      "author": "joker_josue",
      "created_time": "July 27, 2023, 06:53:58 PM",
      "body": "Essa mensagem aparece na conta mesmo?A mim apareceu essa informação semelhante na seção do Cartão Binance. Diz que tenho de completar o registo para não ficar com o cartão bloqueado.Mas, depois a informação acaba por ser contraditoria.Na mensagem que me aparece, diz que tenho de fazer o comprovativo de morada, o que seria o nível dois do KYC. Mas, esse é o nível que eu já estou.Por sua vez, ao clicar no link para dar inicio ao processo, ele pede essas informações que você citou, que será o nível três.Esta um pouco confuso. Acho que essa mensagem é generalizada, e que por sua vez o sistema não filtra o nível em que você esta. Pede e pronto, se não tiver no nível máximo.Por isso, vou esperar para ver. Como uso muito poucas vezes o cartão, por isso dá para ver o que vai acontecer.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rdluffy",
      "created_time": "July 27, 2023, 07:04:31 PM",
      "body": "Cara eu acho bastante invasivo também e não quero ter que enviar esses dados para a BinanceEu estou bem apreensivo esses dias pois tinha uma grana lá na FTX e me pediram KYC (eu já tinha na ftx), e pediram mais ou menos essas opções que você mostrou da BinancePorém eu sou isento de IR e minha empresa é um MEI, não tenho praticamente nenhum desses documentos, acabei mandando um extrato de 90 dias do banco. Não tenho outra escolha nesse casoJá com a Binance vou ficar de olho, não vou deixar nada por lá pra não ter risco de ser obrigado a fazer isso novamente, a nossa solução é procurar outras corretoras, e talvez seja hora de usarmos nossos BTC diretamente sem ter que ficar trocando por fiat",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Paredao",
      "created_time": "July 27, 2023, 08:05:53 PM",
      "body": "Estão agora ameaçando de congelar a conta ? Essa cobrança por declaração de fonte de renda já me fazem há mais de um ano. É que o negócio fica meio escondido. Basta você clicar no user e logo aparece a conta como verificada e pede para terminar a declaração de fonte de renda. Eu também não terminei de preencher justamente por causa que tinha certeza que iriam pedir cópias de comprovantes. Não vou passar isso. Estou contigo nessa. Nem bancos tradicionais e que movimentam valores altos exigem tal documentação. Ainda por cima via internet. Se me exigirem, vou deixar congelar. Já não tenho nada lá mesmo.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "July 27, 2023, 09:49:57 PMLast edit: July 28, 2023, 12:43:56 AM by bitmover",
      "body": "Quote from: Paredao on July 27, 2023, 08:05:53 PMEstão agora ameaçando de congelar a conta ? Essa cobrança por declaração de fonte de renda já me fazem há mais de um ano. A mensagem dizia q minha verificação esta expirando em breve. Devo clicar pra regularizar a situação. Só serão permitidos saques na minha conta se eu não regularizar Contudo , nenhum documento está expirando e quando clico no botão aparece apenas essa mensagem da fonte de renda...Não vou mandar, e vou escolher outra corretora se acontecer isso...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "alegotardo",
      "created_time": "July 27, 2023, 11:35:20 PM",
      "body": "Quote from: bitmover on July 27, 2023, 09:49:57 PMQuote from: Paredao on July 27, 2023, 08:05:53 PMEstão agora ameaçando de congelar a conta ? Essa cobrança por declaração de fonte de renda já me fazem há mais de um ano. A mensagem dizia q minha verificação esta expirando em breve. Devo clicar pra regularizar a situação. Só serão permitidos na minha conta se eu não regularizar Contudo , nenhum documento está expirando e quando clico no botão aparece apenas essa mensagem da fonte de renda...Não vou mandar, e vou escolher outra corretora se acontecer isso...Então, pelo que entendi você ainda está conseguindo operar lá \"normalmente\", certo?Um cenário bem melhor do que outras corretoras que deixam você depositar o valor e vem com a \"boa notícia\" após o trade e tentativa de saque.Realmente é uma pena deixar de usar a Binance, é uma corretora com um volume gigantesco, até então sem burocracia para operar, estável e que conseguiu agitar bastante o mercado abusivo que tínhamos aqui no Brasil. Mas, cobrar declaração de IR realmente é algo que justifica/dá razão ao ato de abandonar essa corretora, eu apoio nisso e faria o mesmo.Só por curiosidade, se possível, qual o montante que você movimentava por lá mensalmente?Algo que possa ter acendido o alerta da Binance ou você acredita que foi mero sorteio/acaso ter caído essa exigência pra você também e todos nós devemos esperar pelo mesmo a qualquer dia?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "July 27, 2023, 11:51:45 PM",
      "body": "Quote from: bitmover on July 27, 2023, 09:49:57 PMContudo , nenhum documento está expirando e quando clico no botão aparece apenas essa mensagem da fonte de renda...Não vou mandar, e vou escolher outra corretora se acontecer isso...Decidi investigar mais um ponto, e reparei numa coisa...No meu caso, o alerta que dá é sempre que falta a confirmação de morada. Mas, quando eu clico no botão que eles colocam, levam para a pagina de validação de dados, que indica que eu já estou no nível 2 - confirmado morada. Então quanto se tenta fazer o processo de validação, ele inicia os passos do nivel 3, que envolve então os dados fiscais. E isso logicamente não quero fazer.Então, voltei a pesquisar, e encontrei esta tópico:Como verificar o meu endereço residencial na Binance (aplicável a todos os utilizadores)Eu enviei o comprovativo de morada já foi a 2 anos atras. Logo talvez seja isso que eles alega \"estar desatualizado\", visto que atualmente todos os clientes tem de ter um comprovativo de morada.No final dessa pagina tem um link para \"[Modificar comprovativo de endereço]\". Eu cliquei ai, e ele pede novamente para enviar um comprovativo de morada.Enviei então um novo comprovativo, e eles dizem que dentro de 2 dias fica concluído analise.Veremos se a mensagem desaparece ou não.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "July 28, 2023, 12:47:00 AM",
      "body": "Quote from: alegotardo on July 27, 2023, 11:35:20 PMSó por curiosidade, se possível, qual o montante que você movimentava por lá mensalmente?Algo que possa ter acendido o alerta da Binance ou você acredita que foi mero sorteio/acaso ter caído essa exigência pra você também e todos nós devemos esperar pelo mesmo a qualquer dia?Meu volume é pequeno.Em 2022 movimentei menos de 30mil reais no ano.Em 2021 fiz realizações maiores, mas sempre na isenção mensal de 35k brl (Exceto em um mes que vendi mais de 35k num unico mês,  mas nada muito maior q isso nao.)Esse ano não movimentei nem 10 mil reais lá.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "July 28, 2023, 06:54:55 AM",
      "body": "Analise foi mais rápida!Foi aceite e já não aparece a mensagem.Resumindo, o que eles querem é só um comprovativo de morada. A questão é que como a pessoa já fez isso antes, o sistema automaticamente lança o processo para o nível seguinte, onde solicita dados fiscais.Por isso, a forma de resolver isso, é seguir os passos que indiquei no post anterior, e só revalidar a morada.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "darkv0rt3x",
      "created_time": "July 28, 2023, 10:00:31 AMLast edit: July 28, 2023, 10:17:10 AM by darkv0rt3x",
      "body": "Isto está a ficar descontrolado. Cada vez pedem mais dados e a desculpa é sempre que têm regulamentos que são obrigados a cumprir. Já o outro dia na app Relai, onde eu também costumo comprar, notei que aqueles burros, usam sempre a mesma address para nos enviarem o Bitcoin que a gente lá compra. Questionei o suporte da razão de estarem a usar sempre a mesma address e a resposta foi algo desse género, quando eles podiam bem usar uma address diferente para cada compra de Bitcoin. Enfim, uma falha bem grande no OpSec de qualquer um!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "July 28, 2023, 05:40:57 PM",
      "body": "Quote from: darkv0rt3x on July 28, 2023, 10:00:31 AMIsto está a ficar descontrolado. Cada vez pedem mais dados e a desculpa é sempre que têm regulamentos que são obrigados a cumprir. Já o outro dia na app Relai, onde eu também costumo comprar, notei que aqueles burros, usam sempre a mesma address para nos enviarem o Bitcoin que a gente lá compra. Questionei o suporte da razão de estarem a usar sempre a mesma address e a resposta foi algo desse género, quando eles podiam bem usar uma address diferente para cada compra de Bitcoin. Enfim, uma falha bem grande no OpSec de qualquer um!Toda corretora Faz isso. Nem adianta reclamar... é ruim pra sua privacidade,  mas Quem deve cuidar da sua privacidade é você. A corretora tem obrigação apenas de respeitar seu saldo e organizar da forma q for melhor pra ela.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Paredao",
      "created_time": "July 28, 2023, 06:46:44 PM",
      "body": "Quote from: bitmover on July 27, 2023, 09:49:57 PMA mensagem dizia q minha verificação esta expirando em breve. Devo clicar pra regularizar a situação. Só serão permitidos saques na minha conta se eu não regularizar Contudo , nenhum documento está expirando e quando clico no botão aparece apenas essa mensagem da fonte de renda...Não vou mandar, e vou escolher outra corretora se acontecer isso...Eu acredito que seja uma mensagem padrão. Não creio que a partir do momento que sair a norma reguladora pelo Banco Central, sobre Exchanges em território nacional, eles continuarão com isso. Aqui temos o Sigilo Fiscal, O Sigilo Bancário e a LGPD (Lei Geral de Proteção de Dados). Ou a Binance se enquadra com as normas brasileiras ou terá que deixar de operar no Brasil. Vamos esperar para ver.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "July 28, 2023, 07:33:59 PM",
      "body": "Quote from: darkv0rt3x on July 28, 2023, 10:00:31 AMIsto está a ficar descontrolado. Cada vez pedem mais dados e a desculpa é sempre que têm regulamentos que são obrigados a cumprir. Mas é de facto uma obrigação legal. Acontece o mesmo na banca tradicional, você deve atualizar os seus dados a cada 2 anos, mesmo que nada tenha mudado.Claro que a maioria das pessoas não o faz, até ao dia que vão ao banco tratar de alguma coisa.Agora com o homebanking esse tipo de solicitação torna-se cada vez mais fácil, e mais pessoas fazem essa atualização com maior regularidade.Quote from: Paredao on July 28, 2023, 06:46:44 PMEu acredito que seja uma mensagem padrão. É mesmo isso. Pelo menos foi a conclusão que eu cheguei.Eles tiveram de atualizar os termos, porque agora todo os utilizadores precisam de ter a morada registada. Quem fez esse registo há mais de 2 anos, tem de voltar atualizar. Mas, o link da mensagem, leva logo a pessoa para o registo de nível 3, em vez de para atualizar a morada, porque em teoria você já é nível 2 e não precisa da morada. Então em vez de seguir esse link, tem de ir a opção de atualizar morada, existente na conta do cliente.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rdluffy",
      "created_time": "July 29, 2023, 01:25:27 AM",
      "body": "Por curiosidade entrei na minha conta da Binance agora há pouco e:Também já tem uma ação necessária ali, eu nem cliquei ainda.Desde que fiz KYC na Binance eu movimentei pouquíssimo",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "July 29, 2023, 11:24:03 AMLast edit: July 29, 2023, 11:34:14 AM by bitmover",
      "body": "Quote from: rdluffy on July 29, 2023, 01:25:27 AMPor curiosidade entrei na minha conta da Binance agora há pouco e:Também já tem uma ação necessária ali, eu nem cliquei ainda.Desde que fiz KYC na Binance eu movimentei pouquíssimoEssa é exatamente minha situação, mas com essa mensagem em cima:Sobre a opção de atualizar o endereço como o joker_josue falou que fez no caso dele.. Eu fiz e não deu.Eu sou nível 1, e a verificação de endereço é nível 2.Mesmo assim eu fiz, e na hora que fiz o upload do documento de conta de telefone, ele me pediu imediatamente a prova de fonte de renda. Mesmo eu apertando salvar e sair, ele nem salvou o endereço...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "darkv0rt3x",
      "created_time": "July 29, 2023, 12:41:49 PM",
      "body": "Quote from: bitmover on July 28, 2023, 05:40:57 PMQuote from: darkv0rt3x on July 28, 2023, 10:00:31 AMIsto está a ficar descontrolado. Cada vez pedem mais dados e a desculpa é sempre que têm regulamentos que são obrigados a cumprir. Já o outro dia na app Relai, onde eu também costumo comprar, notei que aqueles burros, usam sempre a mesma address para nos enviarem o Bitcoin que a gente lá compra. Questionei o suporte da razão de estarem a usar sempre a mesma address e a resposta foi algo desse género, quando eles podiam bem usar uma address diferente para cada compra de Bitcoin. Enfim, uma falha bem grande no OpSec de qualquer um!Toda corretora Faz isso. Nem adianta reclamar... é ruim pra sua privacidade,  mas Quem deve cuidar da sua privacidade é você. A corretora tem obrigação apenas de respeitar seu saldo e organizar da forma q for melhor pra ela.Sim, eu tenho conhecimento disso, mas nada me garante que os meus dados não acabam em bases de dados de sites que apenas pretendem esses dados para targetted marketting. A mim ninguém me convence que isso não acontece, no mínimo, de vez em quando.E temos que nos convencer de outra coisa. As exchanges existem para fazerem dinheiro para elas. Tudo se desenvolve à volta disso. Isso de elas \"respeitarem o meu saldo\" e de \"fazerem o que é melhor para o cliente\" e etc, é só fachada. Ah e tal, há regras. Até ao dia que sofrem hacks ou abrem falências e depois já não há garantias para ninguém nem regras nem leis para seguir.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tg88",
      "created_time": "July 29, 2023, 12:55:07 PM",
      "body": "Na minha conta ainda não está solicitando mas talvez está sendo requisitado em lotes, parece que a Binance está saindo de um ambiente bem pouco comprometido com KYC e partindo para um cenário onde solicitam todos os dados possíveis. Parece que a pressão do governo dos EUA está pressionando bastante o modo de operação deles mas isso pode fazer com que eles percam muitos clientes.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "July 29, 2023, 02:46:44 PM",
      "body": "Quote from: bitmover on July 29, 2023, 11:24:03 AMEssa é exatamente minha situação, mas com essa mensagem em cima:Sobre a opção de atualizar o endereço como o joker_josue falou que fez no caso dele.. Eu fiz e não deu.Eu sou nível 1, e a verificação de endereço é nível 2.Mesmo assim eu fiz, e na hora que fiz o upload do documento de conta de telefone, ele me pediu imediatamente a prova de fonte de renda. Mesmo eu apertando salvar e sair, ele nem salvou o endereço...Mesmo seguinte este link: https://www.binance.com/pt-PT/my/settings/profile/reset-poaEste link, pelo o que percebi, apenas trata da morada. Pelo menos foi o link que eu segui e não pediu mais nada.Será que essa exigência da fonte de renda, surge por alguma imposição do Banco Central?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "July 29, 2023, 03:58:09 PM",
      "body": "Quote from: joker_josue on July 29, 2023, 02:46:44 PMMesmo seguinte este link: https://www.binance.com/pt-PT/my/settings/profile/reset-poaEste link, pelo o que percebi, apenas trata da morada. Pelo menos foi o link que eu segui e não pediu mais nada.aparece essa tela:QuoteSerá que essa exigência da fonte de renda, surge por alguma imposição do Banco Central? Esse documentação não é exigida no brasil em nenhum serviço parecido (apenas para envio de $ pro exterior , em situações bem específicas, e a binance não faz esse serviço). As outras corretoras de criptomoedas do país não exigem esses dados.Quote from: darkv0rt3x on July 29, 2023, 12:41:49 PMSim, eu tenho conhecimento disso, mas nada me garante que os meus dados não acabam em bases de dados de sites que apenas pretendem esses dados para targetted marketting. A mim ninguém me convence que isso não acontece, no mínimo, de vez em quando.Sim, mas você é o único responsável por cuidar da sua privacidade. A corretora agrega todos os seus envios/saques no mesmo endereço. Cabe a você fazer mix ou outro tipo de controle da sua parte para se proteger.No momento que você resolve usar uma corretora centralizada, na qual voce faz KYC e etc, você está concordando com isso.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "darkv0rt3x",
      "created_time": "July 29, 2023, 05:20:07 PM",
      "body": "Quote from: bitmover on July 29, 2023, 03:58:09 PM...No momento que você resolve usar uma corretora centralizada, na qual voce faz KYC e etc, você está concordando com isso.E tinhas outra escolha, para usar a exchange? Não tinhas pois não? Logo, isso para mim é coercivo mas disfarçado. Se queres usar, tens que aceitar dar todos os teus dados! E depois nós dizemos que não passamos dados nenhuns a terceiros, mas tu não sabes se realmente passamos dados a terceiros ou não.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}