{
  "id": "topic_5439867",
  "title": "mx12.levins",
  "author": "mx12.levins",
  "created_time": "February 14, 2023, 07:30:16 PMLast edit: October 30, 2024, 10:34:31 AM by mx12.levins",
  "content": "Hello Bitcointalk community member and Bitcoin art collector I am creating bitcoin art since 2017. This creation of art will speak for itself:) We all know....Introducing the \"Orange Pilling with Crystal Rush: A Journey into the World of Bitcoin\" .01Limited Edition Prints - Hand-Signed and verified The world was in chaos. Money bills were burning, people were struggling to survive, and the only hope for salvation seemed to be a mysterious digital currency called Bitcoin.In the midst of this chaos stood a woman named Crystal Rush. She had always felt that something was missing from her life, that there had to be more to existence than just working, paying bills, and struggling to get by. And then, one day, she was offered a choice.It was the choice between the green pill and the orange pill. The green pill promised to keep things the way they were, to let her continue living her life as it was, with all of its struggles and disappointments. But the orange pill was different. The orange pill promised to take her down the rabbit hole, to show her the truth about the world and the potential for true freedom.Without hesitation, Crystal Rush chose the orange pill. And as she did, she felt herself being lifted up into the sky, surrounded by the flames of burning money bills. But she was not afraid. Instead, she felt a sense of clarity and purpose that she had never felt before.As she rose higher and higher, she looked down and saw the rising Bitcoin in the background. And on her chest, she saw the tattoo that she had gotten just before taking the orange pill: the number 21,000,000, a reminder of the maximal amount of Bitcoin that would ever exist.Crystal Rush had taken the orange pill, and now there was no turning back. She was on a mission to spread the word about Bitcoin, to help others see the truth and find their own path to freedom. And with each passing day, she felt herself getting stronger, more powerful, and more confident.The world may be in chaos, but with the orange pill and the power of Bitcoin, anything was possible. Crystal Rush was ready to take on the world, and nothing would stand in her way.Availability:1. 2.3.4.5.6.7.8.9.10.11.12.Sale DetailsOnly 12 unique pieces availablePayment address: [3NgKv4DWEgpahRvRBYXL1vk94QNSFiGt7y]Pricing:Framed Aluminium panel: 44x44cmif you don't see the price ticker refresh the page BTC= per piece (approx. $350 USD)US shipping: 50-70$EU shipping: 20$[/b][/color]if the price ticker is not loading then update the link  approx 950$ + Shipping (WORLDWIDE - FREE SHIPPING)^^^^^^^^^^^^We can explore frame options together within a different price range.^^^^^^^^^^^^Price update: There are already some collaborations happening, and photographers are selling their prints and doing different exhibitions, but there’s nothing like mx12Art, and there won’t be anything like it (especially with Bitcoin). This is legendary artwork! Still working on the second piece in this series.Bitcointalk strong together   ———————Feel Free to visit mx12Art Bitcoin Art Threadhttps://bitcointalk.org/index.php?topic=5362071.0",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5439867",
  "comments": [
    {
      "author": "Hookzup1",
      "created_time": "February 15, 2023, 08:55:10 PM",
      "body": "I see .01 in the title description, does this mean this art is tied to an opendime funded or fundable with .01?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "owlcatz",
      "created_time": "February 16, 2023, 03:33:00 AM",
      "body": "That's awesome, but I think my wife would pretty likely object to it hanging on my wall!  Good luck with sales - if you dont' have a piece of Mx12's work yet, get on it, you won't be disappointed. He puts a very personal touch to all his works to you, the buyer. Very impressive stuff, all of it TBH! 💥💥🔥🔥Quote from: Hookzup1 on February 15, 2023, 08:55:10 PMI see .01 in the title description, does this mean this art is tied to an opendime funded or fundable with .01? Yes it looks it, but usually it's .012 for his other works... I'll ask him on twatter and let ya know bud.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mx12.levins",
      "created_time": "February 16, 2023, 10:34:37 AM",
      "body": "Quote from: Hookzup1 on February 15, 2023, 08:55:10 PMI see .01 in the title description, does this mean this art is tied to an opendime funded or fundable with .01? The number indicates the edition, similar to my lightning ⚡️ artwork series. I am dividing my themed artworks and this is the first in the series, titled .01 - the beginning of the orange pill theme in the space of the adult industry.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mx12.levins",
      "created_time": "February 16, 2023, 10:36:01 AM",
      "body": "Quote from: Hookzup1 on February 15, 2023, 08:55:10 PMI see .01 in the title description, does this mean this art is tied to an opendime funded or fundable with .01? Artwork is also fundable 🔥🧡",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mx12.levins",
      "created_time": "February 16, 2023, 10:40:48 AM",
      "body": "Quote from: owlcatz on February 16, 2023, 03:33:00 AMThat's awesome, but I think my wife would pretty likely object to it hanging on my wall!  Good luck with sales - if you dont' have a piece of Mx12's work yet, get on it, you won't be disappointed. He puts a very personal touch to all his works to you, the buyer. Very impressive stuff, all of it TBH! 💥💥🔥🔥Quote from: Hookzup1 on February 15, 2023, 08:55:10 PMI see .01 in the title description, does this mean this art is tied to an opendime funded or fundable with .01? Yes it looks it, but usually it's .012 for his other works... I'll ask him on twatter and let ya know bud. Haha, I totally understand! My artwork is not for everyone, but I am  glad you appreciate the talent and creativity behind it. Maybe you can sneak it into a man cave or a private study? Or perhaps it can be a conversation starter at your next house party. The possibilities are endless!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hookzup1",
      "created_time": "February 16, 2023, 05:16:32 PM",
      "body": "Quote from: mx12.levins on February 16, 2023, 10:36:01 AMQuote from: Hookzup1 on February 15, 2023, 08:55:10 PMI see .01 in the title description, does this mean this art is tied to an opendime funded or fundable with .01? Artwork is also fundable 🔥🧡Qr tied to opendime or is a pk on it somewhere?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mx12.levins",
      "created_time": "February 16, 2023, 08:04:42 PM",
      "body": "Quote from: Hookzup1 on February 16, 2023, 05:16:32 PMQuote from: mx12.levins on February 16, 2023, 10:36:01 AMQuote from: Hookzup1 on February 15, 2023, 08:55:10 PMI see .01 in the title description, does this mean this art is tied to an opendime funded or fundable with .01? Artwork is also fundable 🔥🧡Qr tied to opendime or is a pk on it somewhere?there is a QR code on the artwork and the public key itself is written on the back of the frame. Additionally, there is an Opendime attached to the back of the frame",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mx12.levins",
      "created_time": "October 21, 2024, 03:21:26 PM",
      "body": "Price update, There are already some collaborations happening, and photographers are selling their prints and doing different exhibitions, but there’s nothing like mx12Art, and there won’t be anything like it (especially with Bitcoin). This is legendary artwork! Still working on the second piece in this series.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mx12.levins",
      "created_time": "October 30, 2024, 10:34:03 AM",
      "body": "Here we go! There’s more to come with Crystal Rush. I've been working a long time on the second version in this series. I want to point out that there will never be another first Bitcoin artist like me who began these Bitcoin series with Crystal Rush. If all goes well, and I’m able to host an exhibition in Las Vegas, then both Crystal Rush and I will be able to attend, giving you the chance to pick up the artwork directly from us. This makes the first artwork in the series even more valuable, as the story continues to build.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}