{
  "id": "topic_5458727",
  "title": "cafter",
  "author": "cafter",
  "created_time": "July 05, 2023, 02:09:31 PM",
  "content": "is it allowed to open two accounts with same ip,  two account of different house members like two brothers with same phone.i searched but not got any specific answer of this question. please answer if anyone of you handle two different binance account with same phone or same IP.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5458727",
  "comments": [
    {
      "author": "OmegaStarScream",
      "created_time": "July 05, 2023, 02:11:02 PM",
      "body": "You shouldn't have any issues using multiple accounts with the same IP address, otherwise people using VPNs would've already had issues doing so. Besides, Binance requires KYC which is a more reliable way to know if someone have another account or not.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "July 05, 2023, 02:17:57 PM",
      "body": "Quote from: cafter on July 05, 2023, 02:09:31 PMis it allowed to open two accounts with same ip,  two account of different house members like two brothers with same phone.i searched but not got any specific answer of this question. please answer if anyone of you handle two different binance account with same phone or same IP.Thats super strict if using a trading account would be restricted upon family members. Of course they would allow that, a business like that encourage more users and in a house with 5 or more users using the same internet isnt an issue. Besides, they would do their own KYC at all even though they are using the same IP. I believe they only restricting accounts with suspicious deposits and withdrawal that are linked with known scam wallet address or notorious sites.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cafter",
      "created_time": "July 05, 2023, 02:18:24 PM",
      "body": "Quote from: OmegaStarScream on July 05, 2023, 02:11:02 PMYou shouldn't have any issues using multiple accounts with the same IP address, otherwise people using VPNs would've already had issues doing so. Besides, Binance requires KYC which is a more reliable way to know if someone have another account or not. yes, with kyc of two different people with different documents.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "_act_",
      "created_time": "July 05, 2023, 02:22:18 PM",
      "body": "Trying to have an exchange account when not capable to get a smart phone or computer that he can use? I will prefer to have my account on my phone or computer with only me able to access it, not to manage it with any other person, not even a family member. Tell your brother to get his own phone or computer for it. Over 18 years people suppose to have at least a mobile phone that can browse.I do not think Binance will do anything too. You have different identification documents, no problem. But what I am concerned about is privacy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cafter",
      "created_time": "July 05, 2023, 02:25:22 PM",
      "body": "Quote from: _act_ on July 05, 2023, 02:22:18 PMTrying to have an exchange account when not capable to get a smart phone or computer that he can use? I will prefer to have my account on my phone or computer with only me able to access it, not to manage it with any other person, not even a family member. Tell your brother to get his own phone or computer for it. Over 18 years people suppose to have at least a mobile phone that can browse.I do not think Binance will do anything too. You have different identification documents, no problem. But what I am concerned about is privacy.this is just an example for better understanding.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BD Crypto",
      "created_time": "July 05, 2023, 02:50:35 PM",
      "body": "Quote from: cafter on July 05, 2023, 02:09:31 PMis it allowed to open two accounts with same ip,  two account of different house members like two brothers with same phone.Including Binance many other exchanges support subaccounts or same ip for another account but not all. You can easily use multiple accounts in Binance for only trading with the same ip without any issue but there might be a problem. You will be probably disqualified from their different campaigns like Play Wodl, Quize Answer and many more.So many exchanges will disqualify you from their some of the campaigns where you should join one account with one IP and obviously unique devices. I saw that Coinw exchange disabled withdrawal option for multiple users who wanted grab promotion rewards. So it's risky for some of the exchanges. So why you should miss those profitable campaigns just for using multi accounts with the same IP?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "_act_",
      "created_time": "July 05, 2023, 03:08:21 PM",
      "body": "Quote from: BD Crypto on July 05, 2023, 02:50:35 PMIncluding Binance many other exchanges support subaccounts or same ip for another account but not all. You can easily use multiple accounts in Binance for only trading with the same ip without any issue but there might be a problem. You will be probably disqualified from their different campaigns like Play Wodl, Quize Answer and many more.He is not talking about having subaccount, he is talking about him and one of his siblings to have Binance account on the same device, using the same IP to connect. That means that they will have different identication documents and different accounts, but using the same device and IP addresses.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BD Crypto",
      "created_time": "July 05, 2023, 03:15:27 PM",
      "body": "Quote from: _act_ on July 05, 2023, 03:08:21 PMHe is not talking about having subaccount, he is talking about him and one of his siblings to have Binance account on the same device, using the same IP to connect. That means that they will have different identication documents and different accounts, but using the same device and IP addresses.I know that In Binance for different accounts you have to submit different identification documents. But still now he will be disqualified from some of the campaigns in Binance as he used same ip or same device for different accounts as I said previously. I just told it before and just added sub accounts word for more clarification about other exchanges.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nwada001",
      "created_time": "July 05, 2023, 04:02:25 PM",
      "body": "Quote from: cafter on July 05, 2023, 02:09:31 PMis it allowed to open two accounts with same ip,  two account of different house members like two brothers with same phone.i searched but not got any specific answer of this question. please answer if anyone of you handle two different binance account with same phone or same IP.It's fully allowed; in fact, there are no rules against that. If you check very carefully about the Binance referral program, it says to refer family and friends. which means you can also be in the same house as the person you are referring to. The only place you are going to have the same IP issue is when you try to login to an account that was not originally created with your country's IP. That's when extra security measures will be required of you in order to prove that it's really the real owner trying to access the account.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zaguru12",
      "created_time": "July 05, 2023, 04:46:40 PM",
      "body": "Quote from: BD Crypto on July 05, 2023, 03:15:27 PMI know that In Binance for different accounts you have to submit different identification documents. But still now he will be disqualified from some of the campaigns in Binance as he used same ip or same device for different accounts as I said previously. I just told it before and just added sub accounts word for more clarification about other exchanges.I doubt that because even on two different phones an IP address can be the same if they are even connected to the same network (WiFi) so imagine a house or company where people connected, do you say they will be restricted from participating in some campaigns? I doubt. Because even on the same phone all you have to do is to log out from one every time you want to log into another. With both accounts having different KYC it will not be a problem.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Faisal2202",
      "created_time": "July 05, 2023, 07:56:22 PM",
      "body": "Quote from: cafter on July 05, 2023, 02:09:31 PMis it allowed to open two accounts with same ip,  two account of different house members like two brothers with same phone.i searched but not got any specific answer of this question. please answer if anyone of you handle two different binance account with same phone or same IP.I think yes, you could open two accounts but not at the same time because to use 2nd account you have to log out of the previous one and then signed in to the 2nd one. Or maybe you could use the parallel app to run both accounts on two different Apps on the same account. I never tried it but I think your two account will work.But why are you trying to make your brothers account on same smartphone, while you could make it on your brother's phone. Well, I am looking forward to know from you once you checked either two accounts works or not.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jossiel",
      "created_time": "July 05, 2023, 09:40:51 PM",
      "body": "As mentioned about being verified(KYCed) that shouldn't be a problem if both of you and your brother can provide separate identities to them.But having the same phone, much better if both of you has got their own phones so that you can have no problem just for verification purposes like having code through SMS. However, you can easily have this solved through the other one through email and yours on your phone but this isn't a big problem at all although it's just recommended to have each of you have your own phone numbers.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rikafip",
      "created_time": "July 05, 2023, 09:46:14 PM",
      "body": "Quote from: cafter on July 05, 2023, 02:09:31 PMis it allowed to open two accounts with same ip,  two account of different house members like two brothers with same phone.If you meant registering account using the same mobile phone number, I don't think that you will be able to do that but you shouln't have issues having two accounts registered on the same IP.I have Binance account since 2017, and few years ago I visited my brother who created his own Binance account while I was visiting him, meaning both of us had the same IP address and we didn't have any issues whatsover so I don't think that you will have either. After all, you have to go through KYC in order to use Binance so there's no worry that same person will create both accounts. At least not theoretically that because I know that there people who created more Binance accounts using their family members ID so they can get more Binance debit cards and that way circumvent daily ATM withdrawal limit.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "logfiles",
      "created_time": "July 05, 2023, 10:59:05 PM",
      "body": "It's a little confusing as per their terms of serviceHere it's as though they are not strict on opening multiple accounts but still maintain that each user should have only 1 account.Quote from: https://www.binance.com/en/termsa. RegistrationEach User (including natural person, business or legal entity) may maintain only one main account at any given time. However, Users can open one or more subaccounts under the main account with the consent of Binance. For certain Binance Services, you may be required to set up a specific account independent from your Binance Account, based on the provisions of these Terms or the Supplementary Terms. The registration, use, protection and management of such trading accounts are equally governed by the provisions of this Section and Section VI, unless otherwise stated in these Terms or the Supplementary Terms.Quoteb. EligibilityBy registering to use a Binance Account, you represent and warrant that: (i) as an individual, you are at least 18 or are of legal age to form a binding contract under applicable laws; (ii) as an individual, legal person, or other organization, you have full legal capacity and sufficient authorizations to enter into these Terms; (iii) you have not been previously suspended or removed from using the Binance Platform or the Binance Services; (iv) you do not have an existing Binance Account;The good thing is that you will be asked to perform KYC verification, so they will eventually know that you are two different individuals from one home.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "examplens",
      "created_time": "July 05, 2023, 11:06:15 PM",
      "body": "Quote from: logfiles on July 05, 2023, 10:59:05 PMIt's a little confusing as per their terms of serviceHere it's as though they are not strict on opening multiple accounts but still maintain that each user should have only 1 account.I believe that this term was written before they introduced mandatory KYC. Now the whole thing with the rules about creating multiple accounts seems pointless because it is only possible to pass KYC once with the same documents.I assume that everyone is aware of the risk of using fake ID's or documents of another person without their knowledge. I mean the risk of freezing funds until the \"original\" person confirms access to the account.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "virasog",
      "created_time": "July 06, 2023, 11:55:45 AM",
      "body": "Quote from: examplens on July 05, 2023, 11:06:15 PMQuote from: logfiles on July 05, 2023, 10:59:05 PMIt's a little confusing as per their terms of serviceHere it's as though they are not strict on opening multiple accounts but still maintain that each user should have only 1 account.I believe that this term was written before they introduced mandatory KYC. Now the whole thing with the rules about creating multiple accounts seems pointless because it is only possible to pass KYC once with the same documents.I assume that everyone is aware of the risk of using fake ID's or documents of another person without their knowledge. I mean the risk of freezing funds until the \"original\" person confirms access to the account.This becomes even more dangerous if you have opened one account with your original documents and you open another account wit fake documents using the same IP and device of your original account. Once got caught they may not only block the fake account but also your original account will be at risk.I am sure if there is brother / sister in the home, he or she may have the same IP but the devices (phone) will not be same. Don't think anyone shares their mobile phones with others in these days.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ultrloa",
      "created_time": "July 06, 2023, 12:25:06 PM",
      "body": "Quote from: cafter on July 05, 2023, 02:09:31 PMis it allowed to open two accounts with same ip,  two account of different house members like two brothers with same phone.i searched but not got any specific answer of this question. please answer if anyone of you handle two different binance account with same phone or same IP.Binance don't mind that as long as you didn't do a Kyc using the same identity for two accounts since for sure they will not allow that. But its confusing why would you create a two accounts while one account is fine since you can use their service without any problem and limits on one account is fine. Also don't do any illegal activities since provably you can easily get flagged by them and might you encounter some problem on their platform.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "July 06, 2023, 01:43:53 PM",
      "body": "Quote from: cafter on July 05, 2023, 02:25:22 PMthis is just an example for better understanding. Even your service provider will not give you a unique IP address, and therefore you will find people accessing binance with the same IP address as yours. If you need to create more than one account, binance provides you with the option to create several sub-accounts within your main account, but do not try to create more than one account by using a new phone number or email address because when your providing documents the same ID files will be submitted, and thus the new account will be closed.BTW, Dont try to use VPN to access KYC exchange. It will make things worse.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fullhdpixel",
      "created_time": "July 06, 2023, 02:18:05 PM",
      "body": "Quote from: cafter on July 05, 2023, 02:09:31 PMis it allowed to open two accounts with same ip,  two account of different house members like two brothers with same phone.i searched but not got any specific answer of this question. please answer if anyone of you handle two different binance account with same phone or same IP.I'm not really sure if you can have two accounts on the same device or not, but if you live under the same roof but using different devices, you should have no issues at all since IP address for each device will be different and doing KYC verification is mandatory for every user of Binance, so when you both do KYC verification on your accounts with different documents, there wouldn't be any issues at all as that will be enough proof that there are two different people.Even if one uses two accounts in the same device but have KYC verification completed for both accounts, they shouldn't have any issues since all they need is that there are two accounts with different KYC verifications, but since a single IP address is being used for both, that might make it a little bit suspicious.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}