{
  "id": "topic_5449222",
  "title": "DeGooL",
  "author": "DeGooL",
  "created_time": "April 17, 2023, 11:25:40 PM",
  "content": "Hello everyone,Im thinking in building a mining pool for multi crypto currencies projects.My question is what are the requirement's for building a pool that can handle a high numbers of miners and Actually i don need a developers that's are able to help in building it.Thanks all",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5449222",
  "comments": [
    {
      "author": "BitMaxz",
      "created_time": "April 17, 2023, 11:59:42 PM",
      "body": "I think you are pointing to a server that can handle many miners.  Then you need to host it on a VPS that doesn't have bandwidth limitation with 4GB of ram and enough disk space of 50GB and it must be fast there are some company offers fast server like Aws and Google and DigitalOcean.The very important is don't limit the bandwidth because it can cause traffic limitations if you have many miners mining in your pool.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DeGooL",
      "created_time": "April 18, 2023, 06:58:10 PM",
      "body": "Quote from: BitMaxz on April 17, 2023, 11:59:42 PMI think you are pointing to a server that can handle many miners.  Then you need to host it on a VPS that doesn't have bandwidth limitation with 4GB of ram and enough disk space of 50GB and it must be fast there are some company offers fast server like Aws and Google and DigitalOcean.The very important is don't limit the bandwidth because it can cause traffic limitations if you have many miners mining in your pool.I would prefer to use other hosting services.Thanks for the info.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "paid2",
      "created_time": "April 23, 2023, 07:40:58 PM",
      "body": "Quote from: DeGooL on April 18, 2023, 06:58:10 PMQuote from: BitMaxz on April 17, 2023, 11:59:42 PMI think you are pointing to a server that can handle many miners.  Then you need to host it on a VPS that doesn't have bandwidth limitation with 4GB of ram and enough disk space of 50GB and it must be fast there are some company offers fast server like Aws and Google and DigitalOcean.The very important is don't limit the bandwidth because it can cause traffic limitations if you have many miners mining in your pool.I would prefer to use other hosting services.May I ask if you know better options than AWS or DigitalOcean ?DigitalOcean is very good in my humble opinion. You can even pay with BTC/XMR.If you want some opensource examples of solo pools :-CKpool code : https://bitbucket.org/ckolivas/ckpool/src/master/-Self-hosted pool, open source : https://github.com/tpruvot/yiimp-P2pool : https://github.com/jtoomim/p2poolIt could give you some ideas about the software part.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nioctib_100",
      "created_time": "April 23, 2023, 10:10:09 PM",
      "body": "Just a little business strategy thinking... it's going to be pretty tough to get any miners on your pool if it starts out with Bitcoin mining. If I were to start a mining pool, I'd aim to build the #1 mining pool for some mid-level altcoin, which probably could be easily accomplished with just some good web design and discussion in that altcoin's community for a few weeks. Then, you'll have a core set of fans and followers and can branch out into larger coins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "paid2",
      "created_time": "April 26, 2023, 07:58:14 PM",
      "body": "Quote from: nioctib_100 on April 23, 2023, 10:10:09 PMJust a little business strategy thinking... it's going to be pretty tough to get any miners on your pool if it starts out with Bitcoin mining. If I were to start a mining pool, I'd aim to build the #1 mining pool for some mid-level altcoin, which probably could be easily accomplished with just some good web design and discussion in that altcoin's community for a few weeks. Then, you'll have a core set of fans and followers and can branch out into larger coins.Yeah you're right, from a strategic point of view it makes sense. But there is a real market with small Bitcoin pools. Especially now that mmpool.org doesn't exist anymore, we still have the Kano pool, and the solo pool of CK.Apart from that there is Laurentiapool, but their membership system is not intuitive I think. At my knowledges there is no other very small pool existing?A lot of people like to send a lot of shares to small pools via rental (MRR or Nicehash), and then let an S19 or something else run on it until the block solved. Philipma has already written about this on the forum and he is right. There are good potential profits to be made with small pools, especially if after doing what I described above, the block is found quickly with a lot of luck, it can generate good payouts quickly.Personally I will always welcome a new small pool with open arms, but there will always be the question of the legitimacy of the owner. On that point you are totally right, but OP could very well pay dozens of altcoins blocks to its users, and then exit scam with the first BTC block when it switches to BTC. It wouldn't give any guarantee even with some success with altcoins blocks.Small pools are always a risk for miners. (mmpool example is a perfect example unfortunately, of why small pools are a risk for miners...)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "moneystery",
      "created_time": "April 27, 2023, 07:09:18 AMLast edit: June 14, 2023, 07:12:08 PM by moneystery",
      "body": "It will require quite a large amount of resources for your pool to run properly with a high number of users. And that will definitely require a good team to be able to ensure that your pool will continue to run and find no problems. You won't be able to build a pool by yourself, you need a reliable team that understands computer hardware and mining software",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}