{
  "id": "topic_5467458",
  "title": "Hewlet",
  "author": "Hewlet",
  "created_time": "September 20, 2023, 12:35:12 PM",
  "content": "While you consume all the juicy and great meals at home, how seriously do you take your water consumption rate?Do you know that men need an average of 3.7 liters of water (that's about 15 cups) a day while women need at least 2.7 liters (about 11 cups)?Of these, do you even meet up with 50%?  Do you know that water intake 1. Prevent kidney damage2. Help maintain blood pressure 3. Helps the digestive system and reduce dehydration4. Boost skin and health and beauty5. Cushion the brain and help with proper thinking.Do you also know that failure to take enough water can lead to 1. Persistent headache2. Lead to doled skinned3. Unnecessary fatigue4. Increase risk of stroke. EtcWhen next you think about eating a great meal that is of a balanced diet, remember water is one major thing you shouldn't joke with for any reason.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5467458",
  "comments": [
    {
      "author": "DeathAngel",
      "created_time": "September 20, 2023, 03:51:46 PM",
      "body": "I know you’re supposed to have 6-7 full glasses of water every day but if I am perfectly honest, I rarely ever meet the required daily intake. I know I should do much better but I drink too much fizzy cola etc which I am aware is not good for me. Maybe my New Year Resolution should be to drink much more water.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pixie85",
      "created_time": "September 20, 2023, 04:53:07 PM",
      "body": "Quote from: Hewlet on September 20, 2023, 12:35:12 PMDo you know that men need an average of 3.7 liters of water (that's about 15 cups) a day while women need at least 2.7 liters (about 11 cups)?Of these, do you even meet up with 50%? I didn't know I needed that much and that there's a difference between men and women. I've always thought it's about the work you do and the temperature in which you work. The way I see it a woman that works at a restaurant and needs to walk and talk a lot will need more water than a man who sits in an office all day. I once saw recommendations of 2 l a day if you don't do sports and that's what I try to reach, although I often have to force myself to drink even that. If it's a workout day I drink an additional 0.5.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OgNasty",
      "created_time": "September 20, 2023, 05:41:13 PM",
      "body": "I try to drink a lot of water. I don’t drink soft drinks or alcohol very often. First thing I do when I wake up and the last thing I do before bed is drink water. I also have water delivered to my house to make sure I’m getting the best water I can. I think water and oxygen are important so I also have always had an air purifier in my house.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ndabagi01",
      "created_time": "September 20, 2023, 05:50:13 PM",
      "body": "I know that drinking water is really excellent for your health, therefore I try to drink as much as possible every day. However, my water consumption is still determined by the weather at the time. On a sunny day, you'll need to drink more water than on a cold day, which is natural. During those times, your body will need water without consent from you.  Sometimes you don't feel the urge to consume juice or carbonated beverages, you simply sense that your body requires water and nothing else.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gozie51",
      "created_time": "September 20, 2023, 05:54:58 PM",
      "body": "This thread reminds me of the promise I made to consume more water but I have not been able to keep to it. I made that promise because every research on water says water is very important to the body and that means there are really lots of benefits in it. Some research say water works as remedy to certain health issues and prevent certain avoidable health challenges too.Really, the times I keep to water therapy for a long time I don't witness incessant health complaint. There have been recommendations to take water in the morning before eating as it could be medicinal but that seem difficult to keep. Water is very important to the system.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Frankolala",
      "created_time": "September 20, 2023, 05:59:16 PM",
      "body": "Among everything that we consume as human, water is the only thing that can never be excess in our body, no matter the quantity that one drinks. The rest will have one or two effect in our system. I was in the routine of taking water every morning, the moment I wake up but I find it difficult to do that now, because all I think after waking up, is to rush to the bathroom and prepare for work.Although, I am the kind of person that loves drinking enough water when I am eating, and I always drink a glass cup of water before I start eating. I think it is only during meal that I do drink enough water. Also there is the kind of meal that you will eat, that will make you feel taste frequently, if it happens that I eat such meal, I do drink a lot of water during that period before the next meal.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ultegra134",
      "created_time": "September 20, 2023, 06:13:21 PM",
      "body": "Quote from: Hewlet on September 20, 2023, 12:35:12 PMWhile you consume all the juicy and great meals at home, how seriously do you take your water consumption rate?Do you know that men need an average of 3.7 liters of water (that's about 15 cups) a day while women need at least 2.7 liters (about 11 cups)?Of these, do you even meet up with 50%?  Do you know that water intake 1. Prevent kidney damage2. Help maintain blood pressure 3. Helps the digestive system and reduce dehydration4. Boost skin and health and beauty5. Cushion the brain and help with proper thinking.Do you also know that failure to take enough water can lead to 1. Persistent headache2. Lead to doled skinned3. Unnecessary fatigue4. Increase risk of stroke. EtcWhen next you think about eating a great meal that is of a balanced diet, remember water is one major thing you shouldn't joke with for any reason.Where are you getting your sources from? I find it hard to believe that men need almost four liters of water daily; that's absurd. An average adult should drink approximately 1.5 to 2 liters at most. From what I know, there's no scientific study that proves that consuming more water than you actually need is beneficial, nor is there a fixed amount for how much you need to drink. Drinking whenever you're thirsty should be fine.I don't believe that I'm drinking more than 4-5 glasses per day; I was drinking more when it was extremely hot and I was constantly busy with chores. I haven't noticed any significant benefits of consuming greater amounts of water, apart from clearer skin.Here's a video from the series \"Adam Ruins Everything\" that explains everything in detail.https://www.youtube.com/watch?v=OWASUMMQjj8",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coolcoinz",
      "created_time": "September 20, 2023, 06:46:04 PM",
      "body": "Quote from: Ultegra134 on September 20, 2023, 06:13:21 PMWhere are you getting your sources from? I find it hard to believe that men need almost four liters of water daily; that's absurd. An average adult should drink approximately 1.5 to 2 liters at most. From what I know, there's no scientific study that proves that consuming more water than you actually need is beneficial, nor is there a fixed amount for how much you need to drink. Drinking whenever you're thirsty should be fine.I also read about that 2 liter rule somewhere, but they explained that it doesn't mean you have to drink that much, just get that much liquid in any form. When you eat soup - you drink. When you eat a watermelon or any other juicy fruit - you drink. I don't count the amount I drink, but my body tells me to. I just make sure that if I feel thirsty I get something to drink ASAP. My usual day is 2 cups of coffee, 2 - 3 cups of tea since a cup is around 250 ml that makes it 1 liter. I usually drink at least 2 glasses of water or juice and a 0.5 l glass of beer in the evening so that makes it more or less 2 liters of liquid every day, (not counting any soup or fruit).In extreme situations like a night out, this could turn into 2l of beer alone, so depends on the day and weather.Forcing yourself to drink too much may be bad for you, just as well as drinking too little.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ultegra134",
      "created_time": "September 20, 2023, 10:21:59 PMLast edit: September 20, 2023, 10:33:13 PM by Ultegra134",
      "body": "Quote from: coolcoinz on September 20, 2023, 06:46:04 PMQuote from: Ultegra134 on September 20, 2023, 06:13:21 PMWhere are you getting your sources from? I find it hard to believe that men need almost four liters of water daily; that's absurd. An average adult should drink approximately 1.5 to 2 liters at most. From what I know, there's no scientific study that proves that consuming more water than you actually need is beneficial, nor is there a fixed amount for how much you need to drink. Drinking whenever you're thirsty should be fine.I also read about that 2 liter rule somewhere, but they explained that it doesn't mean you have to drink that much, just get that much liquid in any form. When you eat soup - you drink. When you eat a watermelon or any other juicy fruit - you drink. I don't count the amount I drink, but my body tells me to. I just make sure that if I feel thirsty I get something to drink ASAP. My usual day is 2 cups of coffee, 2 - 3 cups of tea since a cup is around 250 ml that makes it 1 liter. I usually drink at least 2 glasses of water or juice and a 0.5 l glass of beer in the evening so that makes it more or less 2 liters of liquid every day, (not counting any soup or fruit).In extreme situations like a night out, this could turn into 2l of beer alone, so depends on the day and weather.Forcing yourself to drink too much may be bad for you, just as well as drinking too little.That's correct; you don't need to force yourself to drink more water. We consume liquids, such as water, in a variety of ways, such as milk, vegetables, or fruits, that also hydrate our body. That's why it's false and inaccurate to claim that we need an X glasses of water. I'm not sure about the coffee you mentioned, because I've read that it actually dehydrates you, but I might be wrong. Even when I tried to increase my water consumption, I couldn't keep up for more than a few days, and as I mentioned earlier, it doesn't have any significant benefits. I only noticed that my acne cleared up. Drinking a few glasses of water when you feel like it in normal conditions is perfectly fine. Except we're talking about cases of extreme heat or during exercise. On top of that, even whenIt'd be interesting for the OP to post the source about his claims, is it by a scientific magazine or research, or is it a random blog making such statements?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wiwo",
      "created_time": "September 20, 2023, 11:34:28 PM",
      "body": "Water is necessity for human body and mental states and if you are from region where the wether condition is harsh such as sub Saharan Africa,  countries you will inclined with this practice of water intakes,  I consume as much water as possible on daily bases,  but the problem is how consistent I become with this practice of daily water consumption. As we have all noticed that this thread was very essential and serves as a reminder to our responsibility in water intake,  and more so as we consume water we should also consume fruits and other vegetables too.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "September 21, 2023, 12:25:59 AM",
      "body": "Quote from: Hewlet on September 20, 2023, 12:35:12 PMDo you know that men need an average of 3.7 liters of water (that's about 15 cups) a day while women need at least 2.7 liters (about 11 cups)?3+ litres is overkill and can actually cause more harm than good to some people2 litres are the normsif you already have heart, high blood pressure, or bladder/kidney issues where you retain water. even 2 litres can be too much if you are not excreting an equal amountif you are sweating alot due to excessive exercise then yes more can help. but for majority of normal people 1.5-2 litres is the norm. its also worth noting 2 litres of fluid is not the same as two litres of waterso dont include things like milk, orange juice, gravy, roast beef grease and many other 'fluids'  as part of the count",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EluguHcman",
      "created_time": "September 21, 2023, 11:36:54 AM",
      "body": "Most persons don't find consume water interesting the way they are supposed to simply because they think the intake of water is just about satisfying tastiness.They basically don't see the reasonable benefits in water intakes to the body due to it colorless, orderless and tasteless being.But I can categorically state it that water is the most necessary consumable substances required in the human body for a healthy and maintenance being.Logically, water serves as an oil to lubricate and nourishes the sensitive and insensitive parts of the body systems just like an  \"engine oil\" is essentially to the \"mechanical machines \"engines\" for lubrications.Hence... Water is tends to be consumed either at a tasty or not in other to take preventive measures of dehydrations which can lead to a \"heat injury\" to the body.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "WillyAp",
      "created_time": "September 21, 2023, 12:29:33 PM",
      "body": "Most people are not aware of the importance of water. Some believe its better to drink softdrinks. Same with food, quality is not important for most.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blockman",
      "created_time": "September 21, 2023, 05:59:05 PM",
      "body": "I know that too much is also bad even if it is water. Not sure if I'm taking a lot or if this is too much but I'm sure that I am intaking more than the 7-8 glasses of water on a daily basis. Quote from: WillyAp on September 21, 2023, 12:29:33 PMMost people are not aware of the importance of water. Some believe its better to drink softdrinks. Same with food, quality is not important for most. Those that believe that softdrinks are better, someday they will realize that it's only going to give them diabetes. I am guilty of it and honestly it's delicious when your drink has got a flavor. But whenever I intake juices or softdrinks or any flavored drink, I am taking as much water as I can.I always crave for water and wherever I go, it's what I am looking for when I got home but at most times I have my own water bottle but it's not enough and that's why I drink a lot at home just to retrieve that thirst from outside especially when the weather is hot or humid.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LTU_btc",
      "created_time": "September 21, 2023, 07:36:16 PM",
      "body": "I can't say that I take it seriously. I drink a lot of water every day, especially on summer when it's hot, but I never tried to count how much exactly I simply drink when I want to drink.I drink in average 3 cups of cofe/tea each day, about 1.5 l of mineral water (much more when it's hot), 1-1.5 l of soft drinks like coke. And offcourse, at least several cans of beer on weekends. Yeah, I know that I drink too much soft drinks, I should drink a bit less it and try to replace it with water. I'm trying not to drink energy drinks too much as it's not helthy for heart. But I still need it sometimes - my work starts very early in morning and energy drinks helps me to wake up, cofe doesn't helps me at all.Quote from: WillyAp on September 21, 2023, 12:29:33 PMMost people are not aware of the importance of water. Some believe its better to drink softdrinks. Same with food, quality is not important for most. Are you sure about? I think that most people is aware about these things, but they still pick soft drinks because simply it's more tasty.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LoyceMobile",
      "created_time": "September 21, 2023, 07:51:48 PM",
      "body": "I like ice cold water, and drink roughly 1 m3 per year. Or probably a bit more, mostly in summer.We're lucky in having high quality tap water, so no mineral water or filtration needed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OgNasty",
      "created_time": "September 21, 2023, 08:41:20 PM",
      "body": "Quote from: WillyAp on September 21, 2023, 12:29:33 PMMost people are not aware of the importance of water. Some believe its better to drink softdrinks. Same with food, quality is not important for most. I think people know the importance of water, they just don’t care. I’m sure we all know people who live on soft drinks. It’s just that people think companies wouldn’t sell them products if they were bad for them. It’s actually no different than people thinking the government wouldn’t do anything to hurt them. Thats why I avoid tap water. I think if people saw the pipes carrying that water or read their water reports, they’d avoid it too.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Smartgoat",
      "created_time": "September 22, 2023, 06:39:19 AM",
      "body": "water is very important in human life. is good to take water early in the morning and night before going to bed. but for me, I'm not that type that take much water. but this trend has open my eyes to know the much important of taken much water.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LoyceV",
      "created_time": "September 22, 2023, 07:17:27 AM",
      "body": "Quote from: OgNasty on September 21, 2023, 08:41:20 PMIt’s actually no different than people thinking the government wouldn’t do anything to hurt them. Thats why I avoid tap water. I think if people saw the pipes carrying that water or read their water reports, they’d avoid it too.It must suck to live in a place where you think government is hurting you through tap water. I've seen old pipes in the water supply dunes: they were calicified for about 70%. But that doesn't mean I wouldn't drink it, it's natural and totally fine. The water reports are fine too, tap water is approved for new born babies. Even better: bottled water is not recommended for babies, unless it states so on the packaging (which I've never seen).The only exception is old houses with lead plumbing, that's toxic.The quality of water comes with colder climates. In Nevada, tap water smells worse than swimming pools, and hurts my eyes. In France, they have signs not to drink it everywhere. In Belgium, it's probably still safe to drink, but smells like chlorine, so I realized how much we drink after buying 60 liter for a few days. In Luxembourg, it tastes great! In Denmark even better. In Germany, it's fine. In Austria and Switzerland too. New Zealand tap water tastes great. In the Netherlands, it's high quality everywhere but the taste depends on the water hardness, which varies strongly throughout the country. In Norway, I've been drinking straight from ice cold mountain streams (although that's not always safe). The tap water is great. In Asia, I'd even use bottled water to brush my teeth, and drinking tap water (thanks to a bad restaurant that served it) means sitting on a toilet for a week See Countries with the Best Drinking Water to see what you're missing out on.I'd still like to try the tap water in Iceland. It comes highly recommended.Rule of thumb while traveling: do as the locals do. If supermarkets have long aisles filled with bottled water in large packages, you should probably not drink the tap water.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}