{
  "id": "topic_5455883",
  "title": "Zanab247",
  "author": "Zanab247",
  "created_time": "June 09, 2023, 06:37:45 PM",
  "content": "I was thinking the sacrifices Satoshi nakamoto made in the past to break many protocol to ensure BTC come to stay and spread around the whole world so that governments, men, women and youths will enjoy the impact in their various environment. Now we have seen many countries that accepted BTC because they saw great future in it that it will reduce so many negative things from their countries and they are enjoying the benefits that attached to it. Now that BTC has go round globally, I believe many governments that rejected it some years ago will now convince with what El Salvador government and other governments are doing with BTC in their countries today.Your option is highly welcome.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5455883",
  "comments": [
    {
      "author": "mendace",
      "created_time": "June 09, 2023, 08:23:54 PM",
      "body": "Satoshi didn't break any rules but simply created a set of rules or a protocol that Bitcoin must always execute.  As far as governments are concerned, if someone were to look at El Salvador they would only see a hole in the water, while if one looks at the adoption from below like the bitcoin jungle then one can speak of success.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "serjent05",
      "created_time": "June 09, 2023, 10:43:37 PM",
      "body": "Satoshi dead break many sweats in order to come up with what we know Bitcoin.  He ensures that Bitcoin will have people that will support and develop further it in time when he is not around.  And because of that Bitcoin had proliferated globally.  And those government that is somehow hostile to Bitcoin now sees the benefits and possible profit they can have if they start adopting while setting a regulation to Bitcoin specially the taxation that can give them profit.  It may take some time but I believe the government will eventually accept BTC as an alternative and will adopt it to help their country economy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sheenshane",
      "created_time": "June 09, 2023, 11:12:32 PM",
      "body": "Quote from: Zanab247 on June 09, 2023, 06:37:45 PMI believe many governments that rejected it some years ago will now convince with what El Salvador government and other governments are doing with BTC in their countries today.Your option is highly welcome.I hope so and wish them that they'll open their mind to this.But the fact wasn't, governments have different approaches and perspectives when it comes to crypto like Bitcoin. Some governments may have reservations about the decentralized nature of crypto and the potential risks they perceive, such as volatility, money laundering, or tax evasion.  As we can see, others may be cautious due to concerns about the impact on their existing financial systems or the potential loss of control over monetary policies.There's nothing our governments can do if we want to have or use Bitcoin, we can still have it anonymously and this is why Bitcoin was created, to have full control over our funds and there's no need intermediary.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackBoss_",
      "created_time": "June 10, 2023, 01:23:51 AM",
      "body": "Quote from: Zanab247 on June 09, 2023, 06:37:45 PMI was thinking the sacrifices Satoshi nakamoto made in the past to break many protocol to ensure BTC come to stay and spread around the whole worldSatoshi Nakamoto did not break any protocol, any law when he/she/they made Bitcoin Protocol and mined the Bitcoin Genesis block.Satoshi Nakamoto is a game changer so is Bitcoin but they all did not make anything illegal.In addition, legal and illegal are temporarily. Illegal in the past can be legal now or in future like sex industry, cannabis industry ... There are countries that does not accept or even prohibit Bitcoin now but they can change in future.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BenCodie",
      "created_time": "June 10, 2023, 01:34:06 AM",
      "body": "Even though countries like El Salvador have adopted Bitcoin, it does not mean that all other countries will follow suit (even though it would be the wisest decision to). The more developed the country, the more involved they are with debt and banking, the more they are invested in keeping their inferior systems alive and the less likely they are to evolve and adopt Bitcoin into their system. I believe that developing countries will thrive over the next 5 - 10 years and countries that want to exit the grip of USD will be able to, which is great. What is bad is the ramifications that the US will place on these countries for doing so, and additionally watching their system crumble before making changes.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yhiaali3",
      "created_time": "June 10, 2023, 01:40:10 AM",
      "body": "What protocols did Satoshi break? Also governments don't enjoy bitcoin?Your words sound a little strange. Satoshi created Bitcoin according to a protocol or general rules that ensure the survival of Bitcoin as an integrated peer-to-peer financial system for a long time. He did not break the protocol, he simply abandoned the old system and created a new one.As for the government, yes, most of them currently do not want to adopt bitcoin, but they are facing a fait accompli that they must eventually accept, sooner or later.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zanab247",
      "created_time": "June 10, 2023, 03:01:42 PM",
      "body": "Quote from: yhiaali3What protocols did Satoshi break? By making BTC centered of anonymity and privacy to the users global that is the protocol I mean.QuoteAlso governments don't enjoy bitcoin? They do, because any Governments that accepted BTC in their countries enjoy BTC. If I may ask who are government? The people in a particular country are government, since the people that have idea on BTC are using it to grow their business and also use it to attract more customers by purchasing goods and pay with BTC. Like country  El Salvador are you trying to tell me that they don't enjoy BTC.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Despairo",
      "created_time": "June 10, 2023, 03:13:55 PM",
      "body": "You're just like saying Satoshi create Bitcoin in order to replace fiat, if Satoshi able to break many protocol we will not see any fiat until now because Bitcoin is already successful. But it's, because Bitcoin isn't create to replace fiat and not many people are use Bitcoin as a currency yet, although the adoption is already high.Bitcoin isn't create to save people too, it's not a charity where Satoshi is giving away free Bitcoin for people who need it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bittraffic",
      "created_time": "June 10, 2023, 03:27:39 PM",
      "body": "Theres only one country for now that we can see following the steps of El Salvador and its The Kingson of Bhutan who will be using their waterfalls to generate electricity to mine Bitcoin. Both country are just banking that BtC will win, they may really be in the right path though. And we could see this because even US is not banning BTC nor considering BTC as Security.The result of the adoption of BTC in the country will need to prove it help the people otherwise it won't make much difference. But if its doing positive effect, many will see it good.It only need one countryIf one country using the Congo river to generate power and mine BTC and I think more countries in Africa will also follow. Its possible.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "June 10, 2023, 04:23:09 PM",
      "body": "Quote from: Zanab247 on June 10, 2023, 03:01:42 PM They do, because any Governments that accepted BTC in their countries enjoy BTC. If I may ask who are government? The people in a particular country are government, since the people that have idea on BTC are using it to grow their business and also use it to attract more customers by purchasing goods and pay with BTC. Like country  El Salvador are you trying to tell me that they don't enjoy BTC.Obviously not all government likes the fact that their people are using bitcoin/cryptocurrencies, hence the tight regulations. The likes of Venezuela are just a small minority of countries that wants to take the risk of losing control over their people.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Asiska02",
      "created_time": "June 10, 2023, 04:30:21 PM",
      "body": "Quote from: Zanab247 on June 09, 2023, 06:37:45 PMI was thinking the sacrifices Satoshi nakamoto made in the past to break many protocol to ensure BTC come to stay and spread around the whole world so that governments, men, women and youths will enjoy the impact in their various environment.Santoshi Nakamoto didn’t break any protocol either existing or non existing before he brought about the idea of bitcoin. He only thought of a way for us to be financially free and independent of any financial institution or government to take care of our funds. QuoteNow we have seen many countries that accepted BTC because they saw great future in it that it will reduce so many negative things from their countries and they are enjoying the benefits that attached to it. Not so many of the countries accepted bitcoin because of what it is and how it operates, some did that to enjoy the taxation that’ll come with it when citizens of their countries use them for transactions.QuoteNow that BTC has go round globally, I believe many governments that rejected it some years ago will now convince with what El Salvador government and other governments are doing with BTC in their countries today.Your option is highly welcome.I believe some of them didn’t just rejected it because they don’t want it or like the idea about bitcoin. Some did that in order not to be the first nation to adopt it and later fails. Some are just skeptical to see how it’ll eventually becomes of nations that first legalise them in order for them to take the next step. El Salvador has taken the bold step, in no time in the future, they’ll reap the rewards of their investment in bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jrrsparkles",
      "created_time": "June 10, 2023, 04:48:13 PM",
      "body": "Quote from: Zanab247 on June 09, 2023, 06:37:45 PMI was thinking the sacrifices Satoshi nakamoto made in the past to break many protocol to ensure BTC come to stay and spread around the whole world so that governments, men, women and youths will enjoy the impact in their various environment. Now we have seen many countries that accepted BTC because they saw great future in it that it will reduce so many negative things from their countries and they are enjoying the benefits that attached to it. Now that BTC has go round globally, I believe many governments that rejected it some years ago will now convince with what El Salvador government and other governments are doing with BTC in their countries today.Your option is highly welcome.Satoshi broke the stereotype of monetary system by successfully integrated the blockchain technology which was invented a long back in 90s if I am not wrong into the monetary system which is not under control of central authority like banks and governments. He designed it in a way that people can use it and can't be tampered and irreversible.Still we are far from reaching the stage such all governments accepted bitcoin but atleast some of the nations legalized it as assets which gives courage for the users.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DoverDoane",
      "created_time": "June 11, 2023, 07:29:11 PM",
      "body": "Quote from: bittraffic on June 10, 2023, 03:27:39 PMTheres only one country for now that we can see following the steps of El Salvador and its The Kingson of Bhutan who will be using their waterfalls to generate electricity to mine Bitcoin. Both country are just banking that BtC will win, they may really be in the right path though. And we could see this because even US is not banning BTC nor considering BTC as Security.The result of the adoption of BTC in the country will need to prove it help the people otherwise it won't make much difference. But if its doing positive effect, many will see it good.It only need one countryIf one country using the Congo river to generate power and mine BTC and I think more countries in Africa will also follow. Its possible.I also share the same opinion. If a country is lacking in terms of economy, such as in Africa, large-scale Bitcoin mining can boost the economic value of that country. In my opinion, this is the best and most effective way for a country to transform itself quickly. If the regulations and policies for Bitcoin mining are allowed and the proceeds from mining are used for the welfare of the people and the development of infrastructure, it can significantly improve the country's situation. Ultimately, it is up to the country itself to decide whether they want to pursue this approach or not.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Baofeng",
      "created_time": "June 11, 2023, 10:00:30 PM",
      "body": "Quote from: Zanab247 on June 09, 2023, 06:37:45 PMI was thinking the sacrifices Satoshi nakamoto made in the past to break many protocol to ensure BTC come to stay and spread around the whole world so that governments, men, women and youths will enjoy the impact in their various environment. Now we have seen many countries that accepted BTC because they saw great future in it that it will reduce so many negative things from their countries and they are enjoying the benefits that attached to it. Now that BTC has go round globally, I believe many governments that rejected it some years ago will now convince with what El Salvador government and other governments are doing with BTC in their countries today.Your option is highly welcome.He took inspiration from others, as you can in the \"References\" in the Whitepaper. So not sure what you meant by breaking protocols, he just take everyone and make it perfect, or have a working digital payment.It doesn't matter though if governments are going to reject it, Bitcoin can't be stop, it's too big to fall.And as time goes by, it will continue to grow and we might be closer to the global adoption that we wanted to see.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "passwordnow",
      "created_time": "June 11, 2023, 10:11:33 PM",
      "body": "It doesn't have to imitate what El Salvador just did. El Salvador's president and probably some of its high local authorities have come to understand what Bitcoin really is. That's why it should be made for most countries and people, to understand what Bitcoin is doing and what it is used for. Whether there is or there is no government intervention and adoption, Bitcoin is for people and people is for Bitcoin. That's why it's here to stay and it just keeps on growing over time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "robelneo",
      "created_time": "June 11, 2023, 10:41:25 PM",
      "body": "Quote from: BlackBoss_ on June 10, 2023, 01:23:51 AMQuote from: Zanab247 on June 09, 2023, 06:37:45 PMI was thinking the sacrifices Satoshi nakamoto made in the past to break many protocol to ensure BTC come to stay and spread around the whole worldSatoshi Nakamoto did not break any protocol, any law when he/she/they made Bitcoin Protocol and mined the Bitcoin Genesis block.But he did not foresee that in the future the use of mining pool and ASIC hardware in mining BitcoinQuoteSatoshi Nakamoto is a game changer so is Bitcoin but they all did not make anything illegal.In an era where restriction, compliance, and taxation by the government are imposed, governments think Satoshi created something illegal, this could be the reason why he secluded himself he knows that he created a disruption in a system and he knows that it will be adopted so he left it open source for those who want to adopt and promote its usage.QuoteIn addition, legal and illegal are temporarily. Illegal in the past can be legal now or in future like sex industry, cannabis industry ... There are countries that does not accept or even prohibit Bitcoin now but they can change in future.That's what exactly is happening now there is usage there is freedom and there is anonymity where privacy is a big concern Bitcoin came at the right time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pidgeon",
      "created_time": "June 11, 2023, 10:48:33 PM",
      "body": "Quote from: Zanab247 on June 09, 2023, 06:37:45 PMYour option is highly welcome.Read a book and stop writing first grade scribble!\"Satoshi the breaker of protocols\", maybe the breaker of your ***** ass!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "uche6215",
      "created_time": "June 11, 2023, 10:52:48 PM",
      "body": "Satoshi Nakamoto is a great philosopher who discovered bitcoin to save mankind specifically the lower artisans. With bitcoin the poor uses the rich people to make money. Because as the price of bitcoin goes up the little the poor has become bigger. Bitcoin is life changer for the poor citizens in the world. With bitcoin all things are possible.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dothebeats",
      "created_time": "June 11, 2023, 11:01:21 PM",
      "body": "Satoshi only helped realize an idea that has been proposed for decades. He just made things possible for the likes of Wei Dai, Nick Szabo, and countless other cryptographers that put forth ideas on decentralized currencies to coexist with fiat. There isn't any protocol broken, nor any laws bent on the creation of bitcoin. Those things only happened when bitcoin started to have some valuation, and people began to trade it with fiat currency. Those are completely different things.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}