{
  "id": "topic_5460096",
  "title": "bonfire66",
  "author": "bonfire66",
  "created_time": "July 17, 2023, 12:46:41 PM",
  "content": "В Москве запустили в оборот новые купюры в 5 и 10 рублей, летом появятся обновленные банкноты в 100 рублейПервый вопрос: НАХРЕНА?Второй...  Просто смешно. Все эти истории про купюры России и СССР. Хотя бы за последние примерно 120 лет.        На сайте битновости (рекламирую бесплатно) еще несколько лет было опубликовано пару статей. Гуглите подробности, если кому интересно. Одна статья называется «Советский Рубль – история конфискаций и девальваций» - там точно, подробно, и со всеми доказательствами доказано, что за последние примерно 120 лет рубль в России обесценился примерно в 500 ТРИЛЛИОНОВ раз. По отношению (не к доллару) а к самому себе. Если взять и пересчитать весь тот путь рубля от Николаевских червонцев до купюр Путина в 10 рублей, то там четко все указано, есть все расчеты, почему червонец Путина дешевле червонца Николая второго Кровавого примерно в 500 ТРИЛЛИОНОВ раз.       И это я еще тут не упоминаю даже курс рубля к Доллару. Например, за время существования Современной России рубль к доллару обесценился примерно в 45 тысяч раз. Гуглите курс рубля к доллару (неофициальный) в 1991 году к курсу рубля к доллару (биржевому) в 2023 году.        Но это еще не все. Если вы возьмете доллар 1923 года (допустим) и придете с этой купюрой в современной магазин в США – то ту купюру у вас ПРИМУТ! А даже скорее всего даже по бОльшему курсу, как исторический артефакт. А вот если придти с купюрой СССР в современный магазин – то вам тут же дадут по-морде. Чтобы не выеживались!      И это я еще тут не затронул тему гособлигаций! На том же сайте (битновости) была несколько лет назад статья, как совецких людей (отчасти насильственно) дурили на облигациях. Статья называется «Советские облигации – как государство обирало своих граждан». Это еще одна дополнительная тема, весьма  важная, но выходящая за рамки данного поста.          ВЫ все еще хотите хранить ваши деньги в рублях? Впрочем... Это просто судьба этого народа, который не помнит своей истории, хотя бы за последние несколько десятков лет. И опять наступает на те же грабли. Почему? Объясню. А потому что Член ГКЧП Валентин Павлов, проведший самую грабительскую реформу рублей за последние лет 50 – так спокойно умер в своей постели, не был посажен или расстрелян. Добрая Россия! Она добра ко всем, кто ее грабит и разоряет. Но почему-то недобра к тем, кто пытается говорить правду!",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5460096",
  "comments": [
    {
      "author": "Richterdark",
      "created_time": "February 28, 2024, 08:57:37 AM",
      "body": "Наличкой почти не пользуюсь, поэтому не замечал даже. А вообще странно все это, по всем направлениям возвращение в совок идет.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}