{
  "id": "topic_5463898",
  "title": "itchiba",
  "author": "itchiba",
  "created_time": "August 20, 2023, 09:14:25 AM",
  "content": "Hi guys ! I'm following up on my previous thread \"Opinion on crypto casino project\". It's pretty clear that building a decentralised crypto casino isn't viable. Therefore, going for a centralised platform is the way to go. Now, in order to differentiate ourselves from the crowd it seems that providing a world class customer experience is the most realistic opportunity. So the purpose of this thread is very simple, as a crypto casino player what particular challenges, problems, or complaints do you have ? Or what particular improvements would you wish to see in your favorite casinos ?Thanks for the help !",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5463898",
  "comments": [
    {
      "author": "Solosanz",
      "created_time": "August 20, 2023, 09:33:39 AM",
      "body": "1. Have a lot budget.2. Run a long term signature campaign and if possible also run a seasonal promotion.3. Offer higher odds, add many events, add many providers, give higher cashback, promotions etc.After all it's related to advantage for the gambler and advertisement, creating something new has no guarantee you will success, you need to attract old gamblers to gamble in your site.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Porfirii",
      "created_time": "August 20, 2023, 09:49:34 AM",
      "body": "Quote from: Solosanz on August 20, 2023, 09:33:39 AM1. Have a lot budget.2. Run a long term signature campaign and if possible also run a seasonal promotion.3. Offer higher odds, add many events, add many providers, give higher cashback, promotions etc.After all it's related to advantage for the gambler and advertisement, creating something new has no guarantee you will success, you need to attract old gamblers to gamble in your site.Apart from the signature campaigns Solosanz mentioned in the 2nd point, review campaigns are also popular these days, so I think that the return for these actions is also good. Apart from the clear advertising effect these reviews have in the forum, with them you also get direct insight from experienced users' feedback, which is what you seem to be looking for with your last two threads.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JackpotRacer",
      "created_time": "August 20, 2023, 09:49:56 AM",
      "body": "Quote from: itchiba on August 20, 2023, 09:14:25 AMHi guys ! I'm following up on my previous thread \"Opinion on crypto casino project\". It's pretty clear that building a decentralised crypto casino isn't viable. Therefore, going for a centralised platform is the way to go. Now, in order to differentiate ourselves from the crowd it seems that providing a world class customer experience is the most realistic opportunity. So the purpose of this thread is very simple, as a crypto casino player what particular challenges, problems, or complaints do you have ? Or what particular improvements would you wish to see in your favorite casinos ?Thanks for the help !you need to offer a new game, or an old game with a new twist that no one else is offering. this will give you an advantage until others copy you, and even then you have the first mover advantage.trust me I know what I am talking about. good luck!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Eternad",
      "created_time": "August 20, 2023, 01:34:03 PM",
      "body": "Quote from: itchiba on August 20, 2023, 09:14:25 AMSo the purpose of this thread is very simple, as a crypto casino player what particular challenges, problems, or complaints do you have ? Or what particular improvements would you wish to see in your favorite casinos ?Thanks for the help !Most complain here is the slow fixing of the support on the problem of players especially those investigation part that involves KYC. Some casino have a 6 months period just to solve cases like while it can be done for a short period of time if the support will just dedicate time on it.If you want to catch player’s attention here, give a bonus reward that will give back a good percentage amount of your profit to the players. Players stay on a casino that has a good loyalty reward for all their bets.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitcoinGirl.Club",
      "created_time": "August 20, 2023, 02:06:47 PM",
      "body": "Quote from: itchiba on August 20, 2023, 09:14:25 AMwhat particular improvements would you wish to see in your favorite casinos ?Transparent. Clear publicly available bankroll to verify you are able to pay player if they win big.The rest are all same. You need a website, you need a sportsbook provider, you need game providers. You can not come with much difference than others that already existed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mate2237",
      "created_time": "August 20, 2023, 02:28:40 PM",
      "body": "And also, fair games, customer friendly services and smoothly withdrawal services. Your services must be friendly for gamblers to use. And as other has said, the review campaign thread will be of a good help to you because it will bring out the advantages and the disadvantages of the casino website. And your casino must be accountable for all the activities will be happening in the site, because people will complain one thing to the other. Therefore your customer care service personnels should be on standby always to attend to customers. Be a reliable casino provider. Then you have to know how much you are going to spend in the various activities you are going to render. Because at the first time of launching the casino you have to spend your personal money to pay gamblers who will win games. So you just need to prepare your budget on all that. You are welcome.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coinerer",
      "created_time": "August 20, 2023, 02:35:07 PM",
      "body": "Quote from: Solosanz on August 20, 2023, 09:33:39 AM1. Have a lot budget.2. Run a long term signature campaign and if possible also run a seasonal promotion.3. Offer higher odds, add many events, add many providers, give higher cashback, promotions etc.After all it's related to advantage for the gambler and advertisement, creating something new has no guarantee you will success, you need to attract old gamblers to gamble in your site.A signature campaign is a medium of marketing. And this is not the only marketing that alone can make a gambling site successful. Running a casino site requires big budgets and they must be spent in proper places. If we talk about marketing in this forum, then signature, Ann, Review campaign, Banner ads have a lot of potential and there are many other things like Google ads, Video Ads, Facebook/Instagram Ads etc. and the biggest promotion is sponsoring in different sports.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Helena Yu",
      "created_time": "August 20, 2023, 02:42:53 PM",
      "body": "If you want to become a good crypto casino, just being transparent, have a friendly rule, active communicate with the gamblers, solving someone else problem ASAP etc.If you want to become the greatest crypto casino, it's mean you need to beat every casinos in this forum in terms about anything. This forum is very popular about the signature that promoting a project, if you want to monopoly and make every users to promote your project, you need to set the highest payrate, open for unlimited participants and long term",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wiwo",
      "created_time": "August 20, 2023, 02:47:36 PM",
      "body": "First I have to deviate a little from the points of many here who have replied to the thread,  I have seen that many of them mentioned signature campaign or other marketing promotion to be the means to building a successful casino, but let me tell you that even if you run the longest signature campaign, but does not have good reputation and advance services on your casino you will still end up being bad actor in the gambling industry. So the most important thing to build is a good reputation and and building a team that can work around the club to provide good customers services and also monitoring players' activities to give them the best service that can keep them as loyal players.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "robelneo",
      "created_time": "August 20, 2023, 02:49:06 PM",
      "body": "Quote from: itchiba on August 20, 2023, 09:14:25 AMHi guys ! I'm following up on my previous thread \"Opinion on crypto casino project\". It's pretty clear that building a decentralised crypto casino isn't viable. Therefore, going for a centralised platform is the way to go. Now, in order to differentiate ourselves from the crowd it seems that providing a world class customer experience is the most realistic opportunity. It's good that you're listening to the community it will save a lot of money and no waste of effort, we have a saying don't invent the wheel and if it's not broken don't fix it, just make an improvement.QuoteSo the purpose of this thread is very simple, as a crypto casino player what particular challenges, problems, or complaints do you have ? Or what particular improvements would you wish to see in your favorite casinos ?Long-term marketing and great support, you should brand yourself so that gamblers will think that you are reliable and you are here in the long term, a better way to do this is by having great support and full and long-term marketing, being in line with the best casinos here and when you have the same standard like the top casinos then you can implement new method to attract additional players, these top casinos have already fave the way on how to be on top, all you have to do is to follow these leaders.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hispo",
      "created_time": "August 20, 2023, 02:55:13 PM",
      "body": "You could have easily continue this discussion in the previous thread, by the way. But I do not blame you, since there could be people who may not read your post asking to move the topic towards centralized casino instead a decentralized one. Anyways ...To me the most important thing when comes to online casinos is the visual style of their games, the speed or their withdrawals and the coins supported, so I can have the option to deposit some remaining alts which I would not move anywhere otherwise.If you have enough funds, a team and this is a serious project you wish to carry in the long term, I would advice you not to make non-KYC a priority in the long term, because whether you end up having enough success, it would be matter of time before you are forced to comply with such legal measures, as other services had to. So doing such feature part of your identity as a business may hurt you once that feature cannot be longer available for your public. I would try to support monero if I was you, though, at least during your first year or so.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coin-investor",
      "created_time": "August 20, 2023, 03:15:31 PM",
      "body": "I'm proud to be in a campaign of the most popular and reputable Crypto casino online, if your goal is to be the greatest casino online you need a huge budget and a well-coordinated team, and your goal should be to establish the most reputable casino, just one legit scam casino is enough to stop you on track to be the greatest casino.It's easy to integrate the best game provider but the focus should be on marketing and being reputable, The majority of gamblers are looking for reputation and capability and that capability is paying all withdrawals and launching a long marketing campaign.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "m2017",
      "created_time": "August 20, 2023, 03:31:23 PM",
      "body": "Quote from: itchiba on August 20, 2023, 09:14:25 AMHi guys ! I'm following up on my previous thread \"Opinion on crypto casino project\". It's pretty clear that building a decentralised crypto casino isn't viable. Therefore, going for a centralised platform is the way to go. Now, in order to differentiate ourselves from the crowd it seems that providing a world class customer experience is the most realistic opportunity. So the purpose of this thread is very simple, as a crypto casino player what particular challenges, problems, or complaints do you have ? Or what particular improvements would you wish to see in your favorite casinos ?Thanks for the help !Tell us in more detail what is the problem of the inexpediency of creating a decentralized casino. Very often, casinos scam along with the deposits of their players, so the idea of a decentralized casino is not so bad. Is it technically feasible?A decentralized casino would immediately stand out from the rest, and this feature would become a trump card.All casinos have the same problem: players lose, casinos earn on their losses. An improvement that I would like to see is an increase in RTP. But this is all from the category of fantasy, which will never be realized.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Beparanf",
      "created_time": "August 20, 2023, 03:38:58 PM",
      "body": "Quote from: coin-investor on August 20, 2023, 03:15:31 PMIt's easy to integrate the best game provider but the focus should be on marketing and being reputable, The majority of gamblers are looking for reputation and capability and that capability is paying all withdrawals and launching a long marketing campaign.All that you mention is necessary for the casino overall profitability but what makes the casino popular these days are those rakeback and other VIP rewards for players since marketing is useless if a casino offer a bullshit rewards system. On your example casino, Stake offers one of the best offer that gives back money to all players that contribute huge wager volume in the casino. Their strong marketing compliment to their feature that make Stake successful.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "maydna",
      "created_time": "August 20, 2023, 03:43:05 PM",
      "body": "A casino must have a lot of games, and if a casino has slot games, it must provide slot games from various slot service providers because many people like slot games.Don't forget to make promotions as often as possible to attract visitors' attention. That is the essence of developing a new site and providing great customer services, such as instant deposits and withdrawals, so there is no long wait. Not too strict in implementing KYC and only apply KYC to gambling players who use big money because I only gamble with small money",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "uneng",
      "created_time": "August 20, 2023, 04:02:41 PM",
      "body": "I guess what most differentiate casinos nowadays is the marketing efficiency and not exactly the features offered, which are pretty similar among them. The most efficient casinos reaching more potential gamblers in more diversified platforms and methods of advertisement have the advantage on the industry.However, that demands a lot of money which is invested to pay promoters who will wear your company's banners and do lives playing your games in real time to awake the interest of the audience. Depending the size of the public of a respective promoter, the marketing campaign will become even more expensive.You have to make sure you are confortable with the risk taken when investing so much money in a new project which may have positive or negative outcomes. Does it really worth to enter a heavily competitive niche of crypto market with a brand new company right now?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cabron",
      "created_time": "August 20, 2023, 04:45:35 PM",
      "body": "What you need is making small timers win  You know that when users try out your casino, they expect to win. That's what you need to do, let them win and withdraw. Right now, they don't even care about KYC or anything that relates to regulations that you need to implement for your casino but having some promotions like double after a deposit or free spins, lets them withdraw their winning. That will give them the impression.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "panjul07",
      "created_time": "August 20, 2023, 04:51:25 PM",
      "body": "What you need to provide:1. Both provably fair games (create yourself) and probably fair games (from 3prd party providers) and maybe also sportsbook. 2. Attractive offers such as promotions, VIP program, affiliate program. 3. Many payment method, at least add those cryptos which has been proven being used by many gamblers (do your own research).4. Instant withdrawal and low withdrawal fee (free is better). 5. Live support agent (not bot) as well as support email but real human who can communicate with players.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Eureka_07",
      "created_time": "August 20, 2023, 05:05:59 PM",
      "body": "Quote from: itchiba on August 20, 2023, 09:14:25 AM<snip>So the purpose of this thread is very simple, as a crypto casino player what particular challenges, problems, or complaints do you have ? Or what particular improvements would you wish to see in your favorite casinos ?-What irritates me about some casinos is the occasional late response from their support, coupled with their poor quality. Additionally, it's frustrating when a site loads slowly, not due to the user's internet connection but because the website isn't optimized. Moreover, it's important to enable users to play in demo mode; some sites don't allow it, and I can't understand why they would do that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}