{
  "id": "topic_5473359",
  "title": "Cityhunter34",
  "author": "Cityhunter34",
  "created_time": "November 08, 2023, 02:20:33 PM",
  "content": "My people I greet una o, As our people say person wey ask for road direction no dey lost and as I no wan lost and be left behind na em I say make I ask small questions for directions.I've often seen posts that says a newbie should read more and I've been doing just that, I don read, read, read sotey my eye dey turn me. But what is a student without a teacher? Make senior men Dem for here help me out with replies wey go butter my bread, make I know if I dey on the right track. I've been reading and going through posts of legends to learn how to make quality post as required of me but how do I learn if I don't get feedbacks to know if am doing the right thing? And talking about spamming and plagiarism, how do I know if the post am about to post has been posted here before?Una say as a newbie make person dey ask questions, I don ask my own o, and I hope it makes sense. I just need some help to grow.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5473359",
  "comments": [
    {
      "author": "Nwada001",
      "created_time": "November 08, 2023, 02:26:40 PM",
      "body": "Quote from: Cityhunter34 on November 08, 2023, 02:20:33 PMAnd talking about spamming and plagiarism, how do I know if the post am about to post has been posted here before?First you need to stay away from to they copy post from internet, if you stay away from that one and no even copy something from any body way u feel say sabi the thing or get idea about Watin u wan talk. Just carry your bear offer Watin ur head fit carry, our brain they different so we not fit talk same thing all at ones come be say the sentence go still be the same so eh no possible, if you they alway right from your head then you no net worth about plagiarism, plagiarism nah to copy from Watin another person talk here or aside here, come present am like say nah ur own.For the side of quality post, my own be say person no fit talk pass the way him brain go carry, so you just gat they original and organic, write Watin you sabi forget the one way you no sabi, ask question where you confuse and leave the rest, the more you they read and come across things for the forum nah the more your brain go they learn more nah so u go they carry those idea grow your post too, nah just matter of time eh don finish, just learn how to train and educate your self and way of thinking eh go help.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Makus",
      "created_time": "November 08, 2023, 03:15:21 PM",
      "body": "Quote from: Cityhunter34 on November 08, 2023, 02:20:33 PM My people I greet una o, As our people say person wey ask for road direction no dey lost and as I no wan lost and be left behind na em I say make I ask small questions for directions.I've often seen posts that says a newbie should read more and I've been doing just that, I don read, read, read sotey my eye dey turn me. But what is a student without a teacher? Make senior men Dem for here help me out with replies wey go butter my bread, make I know if I dey on the right track. I've been reading and going through posts of legends to learn how to make quality post as required of me but how do I learn if I don't get feedbacks to know if am doing the right thing? And talking about spamming and plagiarism, how do I know if the post am about to post has been posted here before?Una say as a newbie make person dey ask questions, I don ask my own o, and I hope it makes sense. I just need some help to grow.Op na the right place wey you come so to ask help from our baba, wen I read reach where you say you don read until your eye don dey turn you, I first weak because I understand your pain, na exactly wattin I pass through as I join this forum new, make I no lie, e nor easy at all to dey read about 23 posts before you reply though person fit short cut oo but e nor too good, if person really wan grow em account  for this forum the only way out na to love reading because na the only way be that. As I dey like this people around me don dey complain say my phone and laptop nor dey gree commot for my eye, and na true because I get goal to achieve, I gats learn enough na for my own benefit no be for other alone.So I go encourage you make you no give up, provided say you know wattin carry you come, make that thought dey ring for your head. Concerning the spamming and plagiarism matter, you fit make use of the search button to take know weda person don write the same thing before.Though for the search e dey very wide and confusing most times buy na the only remedy wey I get be that maybe our boss dem fit get another alternative wey dem dey use. If you check loycev post for meta about to report plagiarism you go also see the wey dem take dey catch plagiarist, them dey use some online plagiarism detector take dey find those people wey dey do plagiarism, so on the other hand if you dey suspect your post to fit get some plagiarism content you fit just try am out with those site to confirm before you post am for here.This na the one wey I know when dey work well:Quetext.com",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "November 08, 2023, 03:25:53 PM",
      "body": "To know better about this forum, read what established posters are posting and read than post. With time, you will understand more about this forum and your post will become more constructive.Quote from: Cityhunter34 on November 08, 2023, 02:20:33 PMAnd talking about spamming and plagiarism, how do I know if the post am about to post has been posted here before?If it is news related, first check the first page of the local board. If not seen on the first page, also if not news related on local board, or you want to post it on English board, use search engine. Read this: Useful information for Nigerian newbiesRead number 4 and 5 of the above link which are about search engines that you can use.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mate2237",
      "created_time": "November 08, 2023, 05:56:32 PM",
      "body": "Quote from: Cityhunter34 on November 08, 2023, 02:20:33 PM My people I greet una o, As our people say person wey ask for road direction no dey lost and as I no wan lost and be left behind na em I say make I ask small questions for directions.I've often seen posts that says a newbie should read more and I've been doing just that, I don read, read, read sotey my eye dey turn me. But what is a student without a teacher? Make senior men Dem for here help me out with replies wey go butter my bread, make I know if I dey on the right track. I've been reading and going through posts of legends to learn how to make quality post as required of me but how do I learn if I don't get feedbacks to know if am doing the right thing? And talking about spamming and plagiarism, how do I know if the post am about to post has been posted here before?Una say as a newbie make person dey ask questions, I don ask my own o, and I hope it makes sense. I just need some help to grow.You dey welcome to di local board and weti you do e make sense. And now that you have read, it is time to understand what you have read and ask questions base on what you read. This one won wey create sef e good but na from general knowledge from the reading. So u have to ask on the area wey you no understand from the reading and when other people wey understand the question respond to you and u come understand weti dem tell you then learning don start be dat. And to know whether di thread has been created. Na very simple something, as oda people don tok am. You just type di topic in Google search bar plus Bitcointalk.org. example. Newbie alert, my people I need help to know more about this platform. in Bitcointalk.org and you click search then all the topics related to that topic will appear and if there is non then you create yours. Talking about to grow. Read and make contributions which is of quality. Merit go come if you dey post quality post. Even in dis local board you go get merit Wella.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dr.Bitcoin_Strange",
      "created_time": "November 08, 2023, 11:13:40 PM",
      "body": "There's a saying that when you go to a foreign land, you do like they do there. It is not possible to learn when you cannot take the time to read what others are saying. If you go onto the beginners and help board, you will see some newbies create threads on how to know their way around the forum, and they are always referred to some helpful links. If you read through those links, you will learn about the forum and also about Bitcoin. On this forum, you are open to different boards and threads to which you can contribute positively with your own thought (logic), or if you have had experience with the topic, you can share. Don't copy and paste; it's called plagiarism, and you can be banned for such an act.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Roseline492",
      "created_time": "November 09, 2023, 12:06:14 AM",
      "body": "OP Just like what everyone here have said, the only way to stay safe is by reading carefully on every bit of the instructions given to you by the above comments, so however in addition to what everyone has said is that OP try to read other higher members post to learn more and also in every platform there are rules and regulations that govern them so do well to go through the forum guidelines to know there rules and regulation and most importantly avoid copying from others, just comment based on the little you understand instead of copying from others.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Samlucky O",
      "created_time": "November 09, 2023, 12:54:49 AM",
      "body": "Quote from: Cityhunter34 on November 08, 2023, 02:20:33 PM My people I greet una o, As our people say person wey ask for road direction no dey lost and as I no wan lost and be left behind na em I say make I ask small questions for directions.My brother as you ask questions no bad na Good thinig. But one thing for sure be say no body wey Dem born wey sabi everything for belle no body be island of knowledge, we all dey learn everyday. But were de problem dey no be the question but how to work on the answer wey dem give you. Most people go ask question people go reply but them no dey get time to really understand wetting people dey try communicate to them.if you dey here and you want to learn, you go learn if you no want you fit remain stagnant.Quote from: Cityhunter34 on November 08, 2023, 02:20:33 PMI've often seen posts that says a newbie should read more and I've been doing just that, I don read, read, read sotey my eye dey turn me. But what is a student without a teacher? Make senior men Dem for here help me out with replies wey go butter my bread, make I know if I dey on the right track. I've been reading and going through posts of legends to learn how to make quality post as required of me but how do I learn if I don't get feedbacks to know if am doing the right thing? Definitely the forum requires you to read well well. Infact you must take reading to another level as you don come here. You never even read anything your eye don dey pain you.if person dey always fear make you no make mistake den you no ft chuk mouth for anything people dey talk na. You must definitely contribute to discussion wey people dey talk, anyone you talk wey no good people go correct you rather Dan not saying anything because of fear. When you don dey follow involve yourself for serious discussion you Know the difference between shitpost and quality Post.Quote from: Cityhunter34 on November 08, 2023, 02:20:33 PMAnd talking about spamming and plagiarism, how do I know if the post am about to post has been posted here before?I think no be everything you go need to know for our 9ja local board. Make you dey also spread hands go to beginners and help tooQuote from: Cityhunter34 on November 08, 2023, 02:20:33 PMUna say as a newbie make person dey ask questions, I don ask my own o, and I hope it makes sense. I just need some help to grow.Every necessary tools to carry learn don dey here, thousands of related topics of newbie just as our brother @mate2237 say make you use the search bar to check wether wetting you dey ask dey, say if e no dey before you go creat thread naim be that. I think if you wan learn you go learn. One thing wey people dey hate na when dem devote there time, trying to educate you for some things and you no dey communicate naim be where the problem dey com.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Justbillywitt",
      "created_time": "November 09, 2023, 04:58:32 AM",
      "body": "No be to read be the problem. The question be say you dey read the right things wey you supposed? e just be like say you get mathematics exam you come dey read biology text book my brother e no go work. So make sure say you dey read the right articles wey you suppose read at the right time. Another thing about reading be say when you dey read try make you calm down and understand watin the person dey talk, keep dictionary near your bodi so that if the person use words wey you no understand so that you go fit find the meaning. As you dey read too, try calm down and no read under hurry hurry sake of say you just wan read, no read under pressure and where noise dey. Noise and book no be friends at all. As you dey read too try pratice watin the person dey talk, no be to read another thing come dey do another thing. Some people go read finish but over sabi wey dey worry them go make them want to add salt and maggi for the thing, but them no go know say that maggi and salt na in go come spoil am.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptSafe",
      "created_time": "November 09, 2023, 02:44:56 PM",
      "body": "Welcome to our local board. Ma true you talk on person wey ask questions go get answers. As it stands now, you really done show say you take this platform matter serious and as e be men don show face here to help put you through as things dey go on here. This platform na big platform wey people of different walks of life all over the world dey so and Na platform wey be say you go learn plenty things about blockchain and crypto as a whole. You go also get small work dem too if you get IT skills like graphic design, programming, software development etc wey most projects dey look for people who wey get those IT skills here.However, as you done ask question based on plagiarism and spamming, e good too make you know as those offence dey take happens For plagiarism, when you copy something wey person don already do for instance article or write up without say you quote the person or you site the person or link from where you copy that write up from then e be say you dey claim ownership for write up wey no be your own wey you for put reference make people for see where you copy am from and that one Na offence wey dey punishable by banning while that of spamming Na say you dey create unnecessarry posts wey no get meaning for platform possibly just to chase merit or post count for pay which no good and if them notice am, them fit tag your account for you here so you gats be careful as you dey journey for here so that so that nobody go out eye for where you dey.Lastly, I believe say other members go don tell you like one or two things about wetin I want to add up to am and e be say make you dey read pinned post for any board wey you visit because na from there you go get more information and rules wey they govern that board and thread wey you enter so. The rules on how to go about your activities for that board dey for the pinned message when you read am, you go see am.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zanab247",
      "created_time": "November 09, 2023, 03:31:43 PM",
      "body": "I believe you have seen many replies on your topic, show that you are in the right place, and you can start learning from thoss example they show to you in this trend and it will guide you and help you to do the right thing that will improve you in quality post which is the major thing that promote newbies in this Bitcointalk platform. Well, you sound like someone that is ready to learn from their people and we are hear to impact you the little one we know, which we know that it will go a long way to make you stand well in this local board other platform discussion.If u spam in dis platform people go no in dis big community u dey so, because anyone that created a topic no d topic he or she created in d platform, and if u creat topic wey person don creat before dem go tell u to block that topic which your mind go judge u say person don first creat that topic.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cityhunter34",
      "created_time": "November 09, 2023, 03:37:55 PM",
      "body": "Quote from: Nwada001 on November 08, 2023, 02:26:40 PMQuote from: Cityhunter34 on November 08, 2023, 02:20:33 PMAnd talking about spamming and plagiarism, how do I know if the post am about to post has been posted here before?First you need to stay away from to they copy post from internet, if you stay away from that one and no even copy something from any body way u feel say sabi the thing or get idea about Watin u wan talk. Just carry your bear offer Watin ur head fit carry, our brain they different so we not fit talk same thing all at ones come be say the sentence go still be the same so eh no possible, if you they alway right from your head then you no net worth about plagiarism, plagiarism nah to copy from Watin another person talk here or aside here, come present am like say nah ur own.For the side of quality post, my own be say person no fit talk pass the way him brain go carry, so you just gat they original and organic, write Watin you sabi forget the one way you no sabi, ask question where you confuse and leave the rest, the more you they read and come across things for the forum nah the more your brain go they learn more nah so u go they carry those idea grow your post too, nah just matter of time eh don finish, just learn how to train and educate your self and way of thinking eh go help.Thank you very much my brother for everything wey you talk, I don go through everything wey you talk and I go use am Wella, e no really easy for me I don Waka for this platform searching for answer na em I say make I ask questions make I for no lost, true true e better make person no go do pass em self, I no go do pass wetin my brain no reach but I can only hope for improvement.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rachael9385",
      "created_time": "November 09, 2023, 03:38:37 PM",
      "body": "The picture below will show you how you can browse this forum and get easy understand.Without say I talk too much, I already believe say many pipo for here done give some little explanations and some kind of guild lines way you go fit take pass through this forum without any cuma, so as you read the rules, e still dey good when you go abide by them and not to the otherwise, penalty dey if you go against the rules.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Smartvirus",
      "created_time": "November 09, 2023, 04:55:56 PM",
      "body": "Quote from: Cityhunter34 on November 08, 2023, 02:20:33 PMAnd talking about spamming and plagiarism, how do I know if the post am about to post has been posted here before?Una say as a newbie make person dey ask questions, I don ask my own o, and I hope it makes sense. I just need some help to grow.The both way you write here being “Spamming and Plagiarism” na international act, no be watin person no Dey know before e commit am. The thing be say, we from a part of the world way be say, most of these no Dey actioned so, e con make we no too Dey conscious of the act.Spamming no Dey accepted not just on the forum but, the plenty forums out there and where literally works are being taken into account.No be lie say person way ask question no dey miss road. One thing way dey preached here be say, make beginners try dey search out some topics before them create new one. The matter here be say, forum search function no go carry watin you Dey search paste for you in exact but, you fit read from the many options way them paste for you and see related threads on watin you Dey fine, from there you got get your answer.Meanwhile, if I ho advice you on way forward, I no go say make you try to sabi everything one time but, approach am gradually and allow watin you Dey try learn sink in before you jump to the next.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Franctoshi",
      "created_time": "November 09, 2023, 05:41:05 PMLast edit: November 10, 2023, 10:37:27 AM by Franctoshi",
      "body": "You did the right my brother by seeking advice and clear direction to navigate your way safely in this forum, I would advise you to stick to writing a post that is only coming from you, and which could be from your life experiences or knowledge within and outside the cryptocurrency space, don't go copying anything aside from what you have to offer and if you do so provide a link to where you copied such articles or material from to spare your account from being flag as committed plagiarism. Furthermore, to succeed here find areas where you are good at learning if you don't have much to offer and develop your knowledge. Take you for instance, some are good with trading just like me, while some have good knowledge about Bitcoin, and some are good when it comes to economics, politics, gambling, etc, whichever one you find easy to learn or contribute then go for it and have quality contribution in those boards, but never forget the main purpose of this forum is aimed at spreading information about Bitcoin.   Then after you have done that, start practicing and passing that knowledge or information to those whom you would find in your shoes in the future.I hope this little contribution can be of help to you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Makus",
      "created_time": "November 10, 2023, 07:54:49 AM",
      "body": "Quote from: Cityhunter34 on November 09, 2023, 03:54:00 PMThank you my brother, you don talk wetin motivate me the more, as you say you don go through wetin I dey go through now e really means a lot to me, you just needed more grease to my elbow to keep pushing.You are welcome op, you don talk well, na wattin be the need to hold back knowledge wey you no say fit help your fellow brother if you share am? Na the little wey I fit do be this, I go also advice you make you commot body for any thing plagiarism or any thing or write up wey AI generate oo, because some persons just dey for this forum wey dey find wey to burst people account, and dem dey use AI detector, immediately dem copy paste your post for there e go just show the originality percentage of the post and before you ho know dem don report your account. Most especially their eyes dey for newbies, jr member, and member rank account, though dem still dey burst legendary, hero, senior, and full member account oo but e dey rear unlike the wey dem dey burst the other ranks, so abeg dey very careful any thing you dey copy from anywhere abeg no forget to put source wey you get am from.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hewlet",
      "created_time": "November 11, 2023, 12:18:31 PM",
      "body": "Quote from: Cityhunter34 on November 08, 2023, 02:20:33 PMUna say as a newbie make person dey ask questions, I don ask my own o, and I hope it makes sense. I just need some help to grow. like our people take talk am, \"who ask question no de miss road\", na better thing when you do as you take ask question make you for no loss for the forum. This forum na better place when you fit take learn plenty things as e take concern bitcoin matter and if you be person when de inquisitive to learn, the forum de basically for you. But as you talk about the plagiarism matter, I believe say you already know say the forum get rules and regulation when de guide members and one of the most important thing you go need do na to get yourself acquainted with this regulations so people no go misunderstand you ignorance as a celebrate act from you to defaulting the forums rules. Just like this board de when we nija people de take talk about bitcoin related stuff for our country and de use the forum educate and encourage our members, other board de when go also also you weller most especially as e be say you be new person for the forum and the board I se talk about na bigginers and help. That board contain so many thread when go clear almost all your doubt as e take concern navigating through the forum and also general bitcoin knowledge. Make sure say you make the best use of it.The search engine na another legit friend you need get for the forum so that whenever you have any question you want to ask, you can easily make use of it to check for similar thread and if the topics you see there no clear your doubt, you fit still create your own thread concerning the topic and I know say answers go boast out asap.In summary, make the forum your friend and enjoy your ride and the whole learning and blending process with little or no pressure",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Perfectbaby",
      "created_time": "November 11, 2023, 12:25:58 PM",
      "body": "I won't talk much about what to do but I understand that everything we need is in a written form is just for me and you to read them before knowing what to do and what not to do, if you look every board they have childboard and every childboard there is a rules that guides them what to do or not, and remember them always put am for first pages so it's better you clicked on any of dem and read to know how to go about this forum. I know say here no easy oo as a beginner to immediately know everything but with time you go sabi am gradually so no need to rush the thing is just bring your mind to read i hope say here go dey easy for you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Su-asa",
      "created_time": "November 11, 2023, 06:18:07 PM",
      "body": "E dey clear to all of us say me self nah one of the newbies both for crypto aspect and for this forum I be newbie but I believe say me and you done already see one or two things way we go do so that we self go dey aline with others for the forum too. For the reading side, yes we must read so thst we go also get better understanding about crypto currency and other stuffs way dey related to crypto and politics, for I done observe something for this forum and the thing be say the search icon no dey give me watin j really need unless say I go use Google search, so for me I go like tell you the same thing, say make you use the Google search if you really want search something here because watin dey for here nah still the same thing na dey for Google search.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dripplurd",
      "created_time": "November 13, 2023, 11:08:27 AM",
      "body": "Quote from: Cityhunter34 on November 08, 2023, 02:20:33 PM My people I greet una o, As our people say person wey ask for road direction no dey lost and as I no wan lost and be left behind na em I say make I ask small questions for directions.I've often seen posts that says a newbie should read more and I've been doing just that, I don read, read, read sotey my eye dey turn me. But what is a student without a teacher? Make senior men Dem for here help me out with replies wey go butter my bread, make I know if I dey on the right track. I've been reading and going through posts of legends to learn how to make quality post as required of me but how do I learn if I don't get feedbacks to know if am doing the right thing? And talking about spamming and plagiarism, how do I know if the post am about to post has been posted here before?Una say as a newbie make person dey ask questions, I don ask my own o, and I hope it makes sense. I just need some help to grow.I am also a newbie mate,but talking about  spamming, 1 of the main thing that bring about spamming the most is that you should avoid copy and paste from the internet you should be trying your possibe best to be making quotes from your head, i know that our head is not the same but still i believe you can be doing something about that,and Talking about plagiarism, for me ooo how i use to avoid plagiarism is that i use to give my sef enough time for a post that i want to reply to check page to pages to see if the reply that i am about to made as been done before that how i avoid spamming and plagiarism as a newbie.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}