{
  "id": "topic_5422166",
  "title": "Shymaa-Arafat",
  "author": "Shymaa-Arafat",
  "created_time": "November 19, 2022, 06:32:01 AM",
  "content": "Just exploring your opinion here about the discussion I think from mins 17-30 inhttps://youtu.be/kYtwxtCPIik or speculations as economists about Bitcoin after 2041 in general.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5422166",
  "comments": [
    {
      "author": "Tytanowy Janusz",
      "created_time": "November 19, 2022, 06:22:39 PM",
      "body": "Quote from: Shymaa-Arafat on November 19, 2022, 06:32:01 AMJust exploring your opinion here about the discussion I think from mins 17-30 inhttps://youtu.be/kYtwxtCPIik or speculations as economists about Bitcoin after 2041 in general.I started at 15 min and stopped 1 min after when guy said that deflationary currencies are bad because \"they encourage hoarding of money and they discourage consumption\" which is a lie that was created to justify existence of hidden tax. There is nothing good in consumig stuff you don't need. Its bad for you, bad for enviroment, bad for economy. Inflation is bad (even 2-5%) because it create misallocation of resources and discourage wise investments and wise spending. Its super funny how elites call consumption bad because of environment impact, global warning etc and in next interview say that inflation is good because it encourage spending/consumption.Interview is not worth the time. If you want to talk about year 2041. Write in few sentences why is it so special.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "serjent05",
      "created_time": "November 19, 2022, 09:31:01 PM",
      "body": "I don't understand people looking way forward to the future discussing the possible event that will happen when they can't even predict perfectly what will happen in the next 5 months.  Instead of worrying about the future why not establish ourselves today?  The bear market gives us an opportunity to buy Bitcoin at a very low price, why worry about 2041 when we haven't prepared ourselves yet for the next Bull run of BTC and the bear market after that?  For me, this kind of video is just a waste of time.Quote from: Tytanowy Janusz on November 19, 2022, 06:22:39 PMI started at 15 min and stopped 1 min after when guy said that deflationary currencies are bad because \"they encourage hoarding of money and they discourage consumption\" which is a lie that was created to justify existence of hidden tax. There is nothing good in consumig stuff you don't need. Its bad for you, bad for enviroment, bad for economy. Inflation is bad (even 2-5%) because it create misallocation of resources and discourage wise investments and wise spending. Its super funny how elites call consumption bad because of environment impact, global warning etc and in next interview say that inflation is good because it encourage spending/consumption.In the end, the video is all about personal perspectives that can be reputed multiple times.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bestcoins1",
      "created_time": "November 19, 2022, 09:37:42 PM",
      "body": "Quote from: Shymaa-Arafat on November 19, 2022, 06:32:01 AMJust exploring your opinion here about the discussion I think from mins 17-30 inhttps://youtu.be/kYtwxtCPIik or speculations as economists about Bitcoin after 2041 in general.Considering that it is still 2022, and 2041 is a year that is still very far from being achieved by everyone from now on, I as an ordinary person who has no knowledge of forecasting about anything makes it difficult to predict the condition of Bitcoin after 2041. Because there are many things that can happen where the mutual influence on the market and Bitcoin will always be around as long as the bad news makers and optimistic buys are around after that year.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cryptomultiplier",
      "created_time": "November 19, 2022, 10:36:52 PM",
      "body": "Quote from: Shymaa-Arafat on November 19, 2022, 06:32:01 AMJust exploring your opinion here about the discussion I think from mins 17-30 inhttps://youtu.be/kYtwxtCPIik or speculations as economists about Bitcoin after 2041 in general.We first got to pray to be alive by then before we make projections or predictions about happenings by the year or after 2041.Well, there should be an eclipse. Not just an eclipse of the sun which should, if am right, happen around that time or within three years from that time. Also an eclipse of cryptocurrency over Fiat currency should be in revolution at that time, for fact that the news, both bad and good about crypto currency never seizes to trend daily. This has created ripple effect of informing and educating us in every way possible, both on how to manage well with access to less cash and to trade over shores and borders without too much restrictions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "odolvlobo",
      "created_time": "November 19, 2022, 11:18:14 PMLast edit: November 19, 2022, 11:32:53 PM by odolvlobo",
      "body": "Quote from: Shymaa-Arafat on November 19, 2022, 06:32:01 AMJust exploring your opinion here about the discussion I think from mins 17-30 in https://youtu.be/kYtwxtCPIik or speculations as economists about Bitcoin after 2041 in general.Your question is what might happen when no more bitcoins are produced in 2140 (and not 2041). The discussion starts here: https://youtu.be/kYtwxtCPIik?t=1493 (at 24:53).There are too many factors and possibilities to make any kind of reasonable prediction. Any honest prediction should be preceded with \"Nobody knows, but ...\", and followed by one of many speculations on what could happen.Roughgarden's response begins with \"[the hard cap] makes the future of Bitcoin unclear\", and he describes issues and factors that I think are all very valid.I would like to point out that we don't have to wait until 2140 to find out. Every 4 years the subsidy is halved and its value should be exceeded by transaction fees within a decade  (assuming they don't go to 0).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hamphser",
      "created_time": "November 19, 2022, 11:48:50 PM",
      "body": "Quote from: bestcoins1 on November 19, 2022, 09:37:42 PMQuote from: Shymaa-Arafat on November 19, 2022, 06:32:01 AMJust exploring your opinion here about the discussion I think from mins 17-30 inhttps://youtu.be/kYtwxtCPIik or speculations as economists about Bitcoin after 2041 in general.Considering that it is still 2022, and 2041 is a year that is still very far from being achieved by everyone from now on, I as an ordinary person who has no knowledge of forecasting about anything makes it difficult to predict the condition of Bitcoin after 2041. Because there are many things that can happen where the mutual influence on the market and Bitcoin will always be around as long as the bad news makers and optimistic buys are around after that year.Even if we do talk in next years possible situation or even on the nearest halving or whatsoever in relation about supply then no one really knows on what would happen.Everything would really be that dependingon community demand and recognition.Speaking about economical problems then we dont know on whats ahead but pretty sure that we are aware on what things could possibly happen and other factors which would really be that influencing possible scenarios or events which might really that contribute into these situations.2041 is really too far off for us to talk on what the world would look like specially on economic aspect or even simply talks with Bitcoins existence on that time.So its better not to make yourself get stressed on whatever things that do talk about future. No man on this world could able to preciselytell on whats ahead.So its better not to bother for now and sustain yourself on whatever things you do encounter.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "chaser15",
      "created_time": "November 19, 2022, 11:57:46 PM",
      "body": "Sorry but it will just create speculative thoughts and imaginary situations.2041 is still a long way to go and even just for discussions, I can't really say what to do.Just go with the flow and ride the trend.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Shymaa-Arafat",
      "created_time": "November 20, 2022, 12:24:11 PM",
      "body": "I'm sorry maybe my Q or topic didn't contain enough details:The students question about Bitcoin starts at min 22:24 I think, and it's about what will happen when the mining reward approaches zero.Tim Roughgarden ended his thoughts by describing it as existential risk for the only way out is if TX fees exceeded mining costs, and TX fees depend on demand curves and other factors not something that  miners can control and determine solely.I also recalled the Crypto Climate Accord named the year 2040 to achieve net zero carbon footprints from crypto related activities, and I wondered is it just a coincidence or is it because the Bitcoin community nearly do nothing to become more eco-friendly. So I tried to explore what the other side (Bitcoin community) have to say about that",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}