{
  "id": "topic_5438123",
  "title": "goku88",
  "author": "goku88",
  "created_time": "February 05, 2023, 07:19:33 AMLast edit: February 05, 2023, 07:30:45 AM by goku88",
  "content": "Buy Trustpilot review for 5 usd in btc i need good review for my site will pay 5 usd .take you 1 min to publish, pm me and I give you text. add me in discord for dealing adesanya#9077",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5438123",
  "comments": [
    {
      "author": "Betfair23",
      "created_time": "February 05, 2023, 07:25:03 AM",
      "body": "Send me a pm I do them also with Google reviews my telegram is on My profile",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oshosondy",
      "created_time": "February 05, 2023, 07:46:10 AM",
      "body": "Quote from: goku88 on February 05, 2023, 07:19:33 AMBuy Trustpilot review for 5 usd in btc i need good review for my site will pay 5 usd .take you 1 min to publish, pm me and I give you text. add me in discord for dealing adesanya#9077This is not how it is done, you can invite people to make use of your website so that they can review it for you, they will be the one that will tell you in honesty if your website is good or not or need improvement. Saying it takes one minute to publish only means you want fake positive reviews and that your site can be a scam site.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "goku88",
      "created_time": "February 05, 2023, 07:48:18 AM",
      "body": "Quote from: Oshosondy on February 05, 2023, 07:46:10 AMQuote from: goku88 on February 05, 2023, 07:19:33 AMBuy Trustpilot review for 5 usd in btc i need good review for my site will pay 5 usd .take you 1 min to publish, pm me and I give you text. add me in discord for dealing adesanya#9077This is not how it is done, you can invite people to make use of your website so that they can review it for you, they will be the one that will tell you in honesty if your website is good or not or need improvement. Saying it takes one minute to publish only means you want fake positive reviews and that your site can be a scam site.No is not agree. Many  big companies today buy reviews and shill buy shill comments to promote hteir business.There is a good product good reviews just make more people buy it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oshosondy",
      "created_time": "February 05, 2023, 07:53:15 AM",
      "body": "Quote from: goku88 on February 05, 2023, 07:48:18 AMNo is not agree. Many  big companies today buy reviews and shill buy shill comments to promote hteir business.There is a good product good reviews just make more people buy it. Because you think big companies are buying fake reviews, that makes you to also want to buy fake reviews. How did you know that big companies are buying fake reviews when they are already big companies? People are ready to give free review of their experience while using big companies website and services.You have started bad on this forum and I expect no good member will take your offer. It is better you let people to test your website for you and check your product to review it for you, instead of looking for fake reviews. It is not my website but yours, but it would be good to start business with honesty and not in a suspicious way which you are doing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Saisher",
      "created_time": "February 05, 2023, 01:21:46 PM",
      "body": "Quote from: goku88 on February 05, 2023, 07:19:33 AMBuy Trustpilot review for 5 usd in btc i need good review for my site will pay 5 usd .take you 1 min to publish, pm me and I give you text. Fake reviews in Trust Pilot are very rampant but it's better that you start your business with good service or good products, and ask your buyers and clients for reviews, not from people you are paying and have not tested and experienced your service if you have a bad service or products and you are paying people to give good reviews, your real clients who experience your bad service or products will give bad reviews.People are checking more on bad reviews than good reviews, so make your product or service a good one so you will have no problem paying people to give you good reviews.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Edwardard",
      "created_time": "February 05, 2023, 01:50:27 PM",
      "body": "Asking for paid reviews is completely fine until they are unbaised. But you are asking to post only \"good reviews\" which is not a great sign. You might even get a red trust by a DT member soon for this and anyone involved in such fake activites should too. Fake positive reviews gives a negative impact. Hope you'll understand this.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husires",
      "created_time": "February 05, 2023, 02:12:24 PM",
      "body": "If you want to buy positive feedback, why not do it yourself?You are not trying to obtain positive comments, but to delude the second party that there are actual experiences of the service that you provide, which gives the impression that you are planning to scam or provide a poor level in the future as long as you do not want to diligently in personal experiences.If I find a new service and all trustpilot reviews are positive, I will be skeptical, but I will feel comfortable if there are positive and negative experiences.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptSafe",
      "created_time": "February 05, 2023, 02:13:45 PM",
      "body": "Quote from: Saisher on February 05, 2023, 01:21:46 PMQuote from: goku88 on February 05, 2023, 07:19:33 AMBuy Trustpilot review for 5 usd in btc i need good review for my site will pay 5 usd .take you 1 min to publish, pm me and I give you text. Fake reviews in Trust Pilot are very rampant but it's better that you start your business with good service or good products, and ask your buyers and clients for reviews, not from people you are paying and have not tested and experienced your service if you have a bad service or products and you are paying people to give good reviews, your real clients who experience your bad service or products will give bad reviews.People are checking more on bad reviews than good reviews, so make your product or service a good one so you will have no problem paying people to give you good reviews.You are very correct. People who pay for reviews are not in any way delivering as per expected per time based on the time at which they entered or start up their business. Paying people to review your site for you is more or less you building on a shallow ground. It is just like You promoting a scam and that would not go down well if the reviews are not organic and natural with honest minds and commendable from reliable source. I will suggest you create another thread with the website or product which you want to get a review then allow members to assess it and give you a honest review and if the review gotten is ok then you are good to go but if not, you will have to work by putting more efforts in the development of your products so as to grow it naturally from the review gotten. I think that would save you some funds that way instead of paying to get game review and at the entire end it turns out to be a night mare.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "robelneo",
      "created_time": "February 05, 2023, 02:31:48 PM",
      "body": "Quote from: Husires on February 05, 2023, 02:12:24 PMIf you want to buy positive feedback, why not do it yourself?You are not trying to obtain positive comments, but to delude the second party that there are actual experiences of the service that you provide, which gives the impression that you are planning to scam or provide a poor level in the future as long as you do not want to diligently in personal experiences.If I find a new service and all trustpilot reviews are positive, I will be skeptical, but I will feel comfortable if there are positive and negative experiences.When buying a product or getting a service and checking the reviews I am more on checking bad reviews because Im sure it's not paid reviews and clients that are getting bad products or services will tell in the reviews what they did not like about the service or products, because they are the actual buyers or clients.What OP should do is ask real users to give reviews positive and negative, don't deceive your potential clients because of paid reviews because it will backfire later, positive and negative reviews are part of running a legit business.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Eureka_07",
      "created_time": "February 05, 2023, 02:54:35 PM",
      "body": "Quote from: goku88 on February 05, 2023, 07:19:33 AM<snip>You should have done better. It'll be best if you allow genuine reviews from users who experienced using your service. You should had also asked us to experience your  service first and provide honest reviews afterwards in exchange of $5. Above all, buying paid reviews is a big red flag to a service/product.  Are you desperate?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sujonali1819",
      "created_time": "February 05, 2023, 04:21:59 PM",
      "body": "In past, there are some users who got negative feedback for asking for this service / providing this unethical service. I have got some of them in the quick search Buying Positive reviews!! ,    BUY POSITIVE or NEGATIVE REVIEWS FOR GOOGLE - TRUSTPILOT and PLAYSTORESo OP also deserves this. Since the OP is very new here , so I think OP has still some time to change his mind.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yahoo62278",
      "created_time": "February 05, 2023, 08:34:49 PM",
      "body": "The guy used a newbie account. He didn't mention the name of his site. You guys really think he gives a damn if you tag his account? Cmon, act like you have some sense. I don't mind people having an opinion but at least put some thought behind it.If you think he deserves a tag, then tag him even though it's worthless. If not, then why reply? Would have been smarter for someone to accept the job, see what the hell his site was, and report it to trustpilot. Hmmmmm",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dkbit98",
      "created_time": "February 05, 2023, 09:09:38 PM",
      "body": "And this is why you should never trust any reviews seen on Trustpilot and similar websites.they mostly contain reviews from people who got paid either to praise some service or to write bad things about them, small percentage of people write bad reviews, and even less people write genuine good reviews.Quote from: goku88 on February 05, 2023, 07:19:33 AMi need good review for my site will pay 5 usd .How much reviews you want to have on Trustpilot, 10, 50, 100?Maybe you can get whole extended families to write your reviews for a discount  Quote from: goku88 on February 05, 2023, 07:48:18 AMMany  big companies today buy reviews and shill buy shill comments to promote hteir business.Even if everyone is doing this, it doesn't make it ok... especially comparing yoursef with ''big'' companies.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "goku88",
      "created_time": "February 06, 2023, 12:51:34 AM",
      "body": "still relevant. i dont care about your neg rep and people dont care too.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}