{
  "id": "topic_5445942",
  "title": "HedgeFx",
  "author": "HedgeFx",
  "created_time": "March 22, 2023, 05:05:17 PM",
  "content": "Buonasera,Finalmente anche i giornali iniziano a cambiare registro, seppur timidamente, in merito alle notizie relative alle cryptovalute. Non più FUD ma articoli in qualche modo costruttivi e realmente interessanti, anche perchè con le banche si sono sputtanati allagrande. Si parla addirittura di preludio di bene rifiuglio! Ma la cosa davvero bella è che non si tratta di un articolo a pagamento  La rivincita del Bitcoin mentre il sistema tradizionale va in difficoltà. Ma è presto per definirlo un bene rifugio\"Durante la crisi delle banche tradizionali, la regina delle cripto ha ritrovato vitalità. Per alcuni è il segnale che si attendeva da tempo: è un asset alternativo in grado di proteggere quando il resto va male. Ma secondo altre analisi, a ben vedere la sua performance è legata al rimbalzo inatteso del Nasdaq, dopo che tutte le ultime convinzioni si sono sgretolate\"Qui l'articolo completo (riservato agli abbonati): https://www.repubblica.it/economia/2023/03/22/news/svb_bitcoin-393167690/?ref=RHVS-BG-I330891680-P3-S6-T1",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5445942",
  "comments": [
    {
      "author": "usque_ad_finem",
      "created_time": "March 23, 2023, 12:54:40 PM",
      "body": "Ne è anche apparso uno a tema identico sul Sole (anche questo per gli abbonati):https://www.ilsole24ore.com/art/bitcoin-balza-28mila-dollari-mentre-banche-sono-crisi-e-rivincita-satoshi-nakamoto-AEKshS8C",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "m.lov",
      "created_time": "March 23, 2023, 02:34:30 PM",
      "body": "Quote from: usque_ad_finem on March 23, 2023, 12:54:40 PMNe è anche apparso uno a tema identico sul Sole (anche questo per gli abbonati):https://www.ilsole24ore.com/art/bitcoin-balza-28mila-dollari-mentre-banche-sono-crisi-e-rivincita-satoshi-nakamoto-AEKshS8CSe volete la versione free penso sia identico a quanto detto da Vito Lops nel suo podcast \"Cripto\" di cui vi allego il link:https://www.spreaker.com/user/ilsole24ore/cripto-puntata-22-03-2023",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitbollo",
      "created_time": "March 23, 2023, 03:22:03 PM",
      "body": "imho non ne azzeccano mai una. bitcoin pompa? articoli negativi. ieri flash crash improvviso? escono articoli positivi (ormai li avevano preparati....)ora, se tutta la stampa/informazione viene gestita nello stesso modo...  ma da un paio di avvenimenti degli ultimi anni è difficile avere dubbi.....",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hymperion",
      "created_time": "March 30, 2023, 04:09:17 PM",
      "body": "devono seguire le correnti momentanee di fiducia/sfiducia, articoli che vanno controcorrente generano polemiche e una sorta di perdita di \"affidabilità\" d'altronde se 5 giornali scrivono che questo è bianco e soltanto 1 scrive che questo è nero, chi avrà ragione per la massa? sempre e comunque la maggioranza anche se non si tratta magari di realtà.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ale88",
      "created_time": "March 31, 2023, 01:50:42 AM",
      "body": "Sono d'accordo con i post precedenti, sono articoli che vanno dove tira il vento. Probabilmente se non ci fosse così tanta attenzione sulle banche a causa dei recenti fallimenti non li avrebbero mai scritti anche se BTC avesse performato bene. Oserei dire che magari l'hanno pure fatto per sviare un po' l'attenzione, chissà...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fillippone",
      "created_time": "April 03, 2023, 08:07:01 AM",
      "body": "Comunque curioso, data la campagna denigratoria mei confronti di Bitcoin fatta da quella serie di articoli a firma Boeri.Ma forse avete ragione voi: inutile provare a leggere una stragia o piano editoriale dove invece regna la casualità.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "giammangiato",
      "created_time": "April 03, 2023, 08:30:03 AM",
      "body": "Quote from: fillippone on April 03, 2023, 08:07:01 AMComunque curioso, data la campagna denigratoria mei confronti di Bitcoin fatta da quella serie di articoli a firma Boeri.Ma forse avete ragione voi: inutile provare a leggere una stragia o piano editoriale dove invece regna la casualità.Non so, forse hai ragione tu. A me sarebbe piaciuto essere come gli anziani di una volta giornale sotto braccio e andare al bar a prendersi il caffettino.Purtroppo per una serie di cose non credo oggi si possa fare ancora. Sia per i costi, che per il tempo, che per quello che leggi.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ale88",
      "created_time": "April 03, 2023, 04:16:16 PM",
      "body": "Quote from: giammangiato on April 03, 2023, 08:30:03 AMNon so, forse hai ragione tu. A me sarebbe piaciuto essere come gli anziani di una volta giornale sotto braccio e andare al bar a prendersi il caffettino.Purtroppo per una serie di cose non credo oggi si possa fare ancora. Sia per i costi, che per il tempo, che per quello che leggi.Non è mai stata una mia abitudine andare al bar a prendere il caffè ma se dovessi mai farlo l'unico giornale che eventuale potrei leggere sarebbe qualcosa di sportivo giusto per rilassarmi e per prendere le notizie con una certa tranquillità, l'ultima cosa che vorrei fare sarebbe iniziare la giornata leggendo le porcate che scrivono sui principali quotidiani.La differenza principali con gli anziani di una volta è che non c'erano molte alternative, leggevi il giornale e ti fidavi, oggigiorno direi che le cose sono parecchio cambiate.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}