{
  "id": "topic_5399718",
  "title": "handsome_latino",
  "author": "handsome_latino",
  "created_time": "May 22, 2022, 12:40:19 PMLast edit: May 23, 2022, 08:56:17 AM by handsome_latino",
  "content": "Hi everyone, my third fourth Bitcoin project this year is a crossword puzzle:bitcoin-crossword.comIf you solve it, the words will decrypt a message which contains a 0.01 BTC or One Million Sats Bounty that you can sweep. Code is open source and the encrypted message is open to the public.Took me a few months to finalize and I decided to launch it today, Pizza Day, in honor of the legendary Laszlo Hanyecz who bought large pizzas and enjoyed them with no regrets.Feel free to discuss potential solutions. I will be releasing a few clues if the puzzle remains unsolved.Enjoy your pizza!",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5399718",
  "comments": [
    {
      "author": "Xal0lex",
      "created_time": "May 22, 2022, 12:52:44 PM",
      "body": "What language is the crossword puzzle in? English?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mbitr",
      "created_time": "May 22, 2022, 12:57:58 PM",
      "body": "Great idea  Just had a quick go - no win for me Good luck all",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LoyceMobile",
      "created_time": "May 22, 2022, 01:11:48 PMLast edit: May 22, 2022, 04:13:54 PM by LoyceMobile",
      "body": "Quote from: handsome_latino on May 22, 2022, 12:40:19 PMIf you solve it, the words will decrypt a message which contains a 0.01 BTC or One Million Sats Bounty that you can sweep. Code is open source and the encrypted message is open to the public.Does it show the decrypted solution automatically once the correct words are entered? If so: that's genius!Or do you need the cypher from github?I've never solved a crossword puzzle without clues before. I'm collecting words:btcbitkeysatfeeareusedueodeawesignhashtxidpizzablockchainspendafteroftenoffersatoshiandreasaddressconfirmprivate",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "handsome_latino",
      "created_time": "May 22, 2022, 01:35:22 PM",
      "body": "Quote from: Xal0lex on May 22, 2022, 12:52:44 PMWhat language is the crossword puzzle in? English?English, yes.Quote from: LoyceMobile on May 22, 2022, 01:11:48 PMDoes it show the decrypted solution automatically once the correct words are entered? If so: that's genius!Yes, automatically, since only the right key would produce a valid message. It even throws confetti at you",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Xal0lex",
      "created_time": "May 22, 2022, 01:37:09 PM",
      "body": "Any hints?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "handsome_latino",
      "created_time": "May 22, 2022, 02:40:04 PM",
      "body": "Quote from: Xal0lex on May 22, 2022, 01:37:09 PMAny hints?  First hintEdit: It's night time here, I'm off to bed. Good luck. More clues to come when I wake up.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LoyceMobile",
      "created_time": "May 22, 2022, 04:23:04 PM",
      "body": "Quote from: handsome_latino on May 22, 2022, 02:40:04 PMFirst hintGoing with the BIP-39 theory, I get:Code:ageeyefeeiceonetoeuseI like fee most That brings me to:Code:offeroftenI like offer most:Code:amateuranotherbrotherchapterclusterdeliverdespairempowerhamsterlobstermonitormonsterneithernuclearoctoberoutdoorpantherpioneerpopularprosperquarterregularscatterseminarsimilarslendersoldiersponsorthundertoddlertriggeruncoverwarriorweatherwhisperToo many permutations for confetti!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dkbit98",
      "created_time": "May 22, 2022, 08:03:38 PM",
      "body": "Quote from: handsome_latino on May 22, 2022, 12:40:19 PMTook me a few months to finalize and I decided to launch it today, Pizza Day, in honor of the legendary Laszlo Hanyecz who bought large pizzas and enjoyed them with no regrets.It looks very good and I appreciate your made it with open source code, but some more hints and help would be greatly appreciated.Should we consider this crossword has anything related with Pizza Day and Laszlo Hanyecz?I would suggest if you can make website with dark theme switch similar like on your other website btc2fiat.me",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "handsome_latino",
      "created_time": "May 23, 2022, 03:02:28 AM",
      "body": "UPDATE #1:I have added a few clues on the crossword page (refresh to see them) -- will add more if needed!Also, someone has generously added a small tip on top of the total reward.  Quote from: dkbit98 on May 22, 2022, 08:03:38 PMIt looks very good and I appreciate your made it with open source code, but some more hints and help would be greatly appreciated.Should we consider this crossword has anything related with Pizza Day and Laszlo Hanyecz?I would suggest if you can make website with dark theme switch similar like on your other website btc2fiat.me Initially I got lazy to program dark mode, but definitely it was needed. It's done   let me know what you think!Quote from: LoyceMobile on May 22, 2022, 04:23:04 PMGoing with the BIP-39 theory, I get:...Too many permutations for confetti!From the new clues added to the crossword:No knowledge about the BIP-39 wordlist is needed or was used as a reference for this crossword.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LoyceMobile",
      "created_time": "May 23, 2022, 05:24:25 AM",
      "body": "Thanks for the hints, that makes me think BAILOUT. Which leads me to ADAPT or ADOPT and something like DUE (DIE isn't friendly enough), but the context for DUE doesn't make sense.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "iceland2k14",
      "created_time": "May 23, 2022, 07:38:41 AM",
      "body": "How coin ensures ? areSearch is on.....",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o_e_l_e_o",
      "created_time": "May 23, 2022, 08:38:25 AM",
      "body": "I just won. Here's proof (signed using Electrum):-----BEGIN BITCOIN SIGNED MESSAGE-----o_e_l_e_o solved the puzzle!-----BEGIN SIGNATURE-----bc1qe926cfhzyh438fyvn9snyrcrsfujp6ur3zcrrnHzgQNIxDWZyDHnzMLB5ImhAeFxaVweRCA0i6EmU5k9NuQ7ENA1YLC1uJh6Y720ZE5JU7A0RuH1dlqI5 d7DrqGrQ=-----END BITCOIN SIGNED MESSAGE-----I'll wait until the transaction confirms before I reveal the answer. Tried various combinations of Satoshi, Bitcoin, January (genesis block) as the seven letter word to no success. Ended up clicking on OP's other site - https://handsomelatino.com - read the little blurb he wrote about himself at the top, which gave me a clue. Specifically this phrase: \"savings had effectively become an increasing liability.\"Great puzzle, great fun, and thanks for the bitcoin!Edit: The answer is \"Banks are not your friends\".",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LoyceMobile",
      "created_time": "May 23, 2022, 08:49:24 AM",
      "body": "Congrats!I can now confirm the solution and announcing the winner works on Tor browser too.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dkbit98",
      "created_time": "May 23, 2022, 11:26:05 AM",
      "body": "Quote from: handsome_latino on May 23, 2022, 03:02:28 AMInitially I got lazy to program dark mode, but definitely it was needed. It's done   let me know what you think!This looks much better, my eyes said thank you. I guess you will need to create new crossword and make it a bit more harder next time.Can you confirm o_e_l_e_o won reward, and make change on website?Quote from: o_e_l_e_o on May 23, 2022, 08:38:25 AMI just won.Oh that was super quick, and I have no idea how you did it so fast Congrats on winning nice amount of Bitcoin... and maybe you should post some screenshot.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "handsome_latino",
      "created_time": "May 23, 2022, 11:35:42 AMLast edit: May 23, 2022, 12:01:38 PM by handsome_latino",
      "body": "Quote from: o_e_l_e_o on May 23, 2022, 08:38:25 AMI just won. I'll wait until the transaction confirms before I reveal the answer. Tried various combinations of Satoshi, Bitcoin, January (genesis block) as the seven letter word to no success. Ended up clicking on OP's other site - https://handsomelatino.com - read the little blurb he wrote about himself at the top, which gave me a clue. Specifically this phrase: \"savings had effectively become an increasing liability.\"Great puzzle, great fun, and thanks for the bitcoin!Edit: The answer is \"Banks are not your friends\".Congratulations! Wow, that was fast, 20 hours since published. It feels bittersweet that the hard work of so many evenings is gone, but as my wife said, better than people had interest than if no one cared and it faded away on the internet.I'm also curious as to what was the clue or first word that you found out! Impressive work, and well, I'm happy you're probably the first person to ever read my bio!Quote from: dkbit98 on May 23, 2022, 11:26:05 AMI guess you will need to create new crossword and make it a bit more harder next time.Can you confirm o_e_l_e_o won reward, and make change on website?OP signed a message which you can verify. I've added since that it's been solved by o_e_l_e_o -- but only if you enter the words I was not planning on releasing any clues, but decided to do so because I think it would have been way too hard and no one would have cared. Unless it's the year 2030 and 1 million sats becomes $50,000 or something crazy; by that time someone would have brute forced it (someone on reddit already tried all 33 million combinations of BIP-39 words yesterday).Not to worry -- my fifth project and its reward are already on the works. Will need to find a special date in June / July related to Bitcoin or the financial world, so I'm open to suggestions.Finally, there was a hidden hint on the project's icon (favicon.svg), which I was hoping someone would find.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o_e_l_e_o",
      "created_time": "May 23, 2022, 12:22:17 PM",
      "body": "Quote from: handsome_latino on May 23, 2022, 11:35:42 AMI'm also curious as to what was the clue or first word that you found out! Impressive work, and well, I'm happy you're probably the first person to ever read my bio!I tried a variety of seven letter words first as I mentioned above, as I figured that would have the least number of possibilities. Managed to fit in another couple of words, but nothing that made sense as a \"simple sentence\". Then I read your bio, and figured that actually we are very similar and you hold in high regard many of the same things I do - I am hugely outspoken on these forums in terms of protecting your privacy and not trusting third parties. So then I went back to the clues, and with Genesis Block in bold I decided to start trying different words from the message within. I tried \"bailout\" first, but again, couldn't find anything that made sense. So then I tried \"banks\", which made the next word obviously \"are\". From there various attempts at \"banks are ... enemies\", before landing on the right answer.Probably helped that it is an exact phrase I've used myself several times before:Quote from: o_e_l_e_o on May 20, 2021, 06:45:38 PMMy underlying point is the government is not your friend.Quote from: o_e_l_e_o on August 27, 2020, 07:29:45 AMExchanges are not your friendAnd then the text which pops up when it was solved, again, I've spoken about many of those exact things on this forum before:Federal Reserve reserve requirement being dropped from 10% to 0%: https://bitcointalk.org/index.php?topic=5243789.msg54312381#msg54312381Canadian censorship: https://bitcointalk.org/index.php?topic=5387401.0Privacy is a fundamental human right: https://bitcointalk.org/index.php?topic=5349899.msg57557108#msg57557108So it seems we both think very similarly about the world in general. Perhaps that why I was successful in solving it. Quote from: handsome_latino on May 23, 2022, 11:35:42 AMWill need to find a special date in June / July related to Bitcoin or the financial world, so I'm open to suggestions.How about the anniversary of this tweet: https://nitter.net/rockerest/status/91885405368098816 Or maybe the anniversary of the first bitcoin faucet: https://bitcointalk.org/index.php?topic=183.0",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OgNasty",
      "created_time": "May 23, 2022, 08:01:42 PM",
      "body": "Very cool project.  I enjoyed doing it and found the site to be responsive and easy to use.  Thanks for building this.  I'll have to check back occasionally and see if I can get them all right in the future.  It's great to see that people are still building cool things related to Bitcoin and this one even has a blockchain element with the prize.  I can appreciate your effort here and hope that you'll keep the cool projects coming in the future.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Welsh",
      "created_time": "May 24, 2022, 11:27:15 AM",
      "body": "Late to the party, but I quite like these little games as a educational resource. Also, the website was very slick, not too over complicated. As for the night time mode implemented, I see no issues with it, and works as long slick as the normal mode. I kind of wish we saw more work like this done, even if it didn't include a reward, obviously I know that's a motivating factor, especially for newbies. Quote from: o_e_l_e_o on May 23, 2022, 12:22:17 PMOr maybe the anniversary of the first bitcoin faucet: https://bitcointalk.org/index.php?topic=183.0Would be quite fitting if there's another reward being offered.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nullama",
      "created_time": "May 24, 2022, 12:18:54 PM",
      "body": "Absolutely fantastic job handsome_latino  and o_e_l_e_o!I recommend everyone to go and solve the puzzle(banks are not your friends), and read the message, it's actually quite an important and deep message that a lot of people don't realize. And well, the execution of the confetti was flawless as well  So glad to be part of a community with people so talented.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}