{
  "id": "topic_5465358",
  "title": "ZeeshanTrade",
  "author": "ZeeshanTrade",
  "created_time": "September 02, 2023, 05:28:27 AM",
  "content": "Please let me know about Exchanges that allow deposit/withdrawal without KYC and their limits if possible.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5465358",
  "comments": [
    {
      "author": "Little Mouse",
      "created_time": "September 02, 2023, 05:41:48 AM",
      "body": "Right now, there's no better option than MexC. They have a 30 BTC 24-hour withdrawal limit for non-KYC users. That's a lot. Besides, they have a significantly low fee on the trades. Possibly they are going to be one of the top market leader exchanges in the next bull. Feel free to DM me for a referral link  There was Kucoin as the best but if I'm correct they have set new rules for the new users affecting from last month that KYC is compulsory. Please have a little investigation on this. I can't confirm exactly.Coinstore.com has a limit of daily $10k for non-KYC users.Right now I'm using MexC and coinstore as non-KYC exchanges. Both looks good from the user experience sense.Quote from: Jocuserious on September 02, 2023, 05:32:48 AMHere is all exchange list in this crypto market so you can choice anyone. https://coinmarketcap.com/rankings/exchanges/This list only displays the exchanges but not KYC free exchanges which OP is actually looking for.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hosemary",
      "created_time": "September 02, 2023, 05:42:12 AMLast edit: September 02, 2023, 06:01:41 AM by hosseinimr93",
      "body": "I recommend you to visit the topic created by Ratimov.Current list of exchanges without KYCSince exchanges can change their rules at any time, I recommend you to read their terms and conditions before using any of them.Always do your own research and before making any deposit, make sure that you will be able to withdraw your fund. Edit:The topic I linked to is no longer active. Read Ratimov's explanation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oshosondy",
      "created_time": "September 02, 2023, 05:42:51 AM",
      "body": "Quote from: ZeeshanTrade on September 02, 2023, 05:28:27 AMPlease let me know about Exchanges that allow deposit/withdrawal without KYC and their limits if possible.This is what you are looking for: No-KYC Exchange Encyclopedia. They are centralized exchanges though, which means they can force you to KYC.If you need a decentralized exchange, you can use Bisq, Agoradesk or hodlhodl.For list of decentralized exchanges: https://www.coingecko.com/en/exchanges/decentralized",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gladitorcomeback",
      "created_time": "September 02, 2023, 06:53:32 AM",
      "body": "Quote from: Ratimov on September 02, 2023, 05:58:29 AM I opened a more expanded topic: No-KYC Exchange Encyclopedia. This topic will contain hundreds of different exchanges without KYC in the future.OP you can check this and there is no other best Thread to check real time update of current live exchanges without KYC. Some exchange has stop doors for non kyc users , if you read any other article then very possible that most of exchanges changes their rules now like Kucoin now stop service for non-KYC uses. In above thread many users sharing new non kyc exchange and also sharing update about any changes in listed exchange. I would like to give one advice here that if you want to use these exchanges for big fund than most of the time these exchanges seized your fund and ask for KYC to withdraw. My friend experience such kind of situation with Mexc where he deposited 5000$ but mexc seized withdraw and asked for KYC so always be careful with this.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ojima-ojo",
      "created_time": "September 02, 2023, 06:58:53 AM",
      "body": "Quote from: Little Mouse on September 02, 2023, 05:41:48 AMRight now, there's no better option than MexC. They have a 30 BTC 24-hour withdrawal limit for non-KYC users. That's a lot. Besides, they have a significantly low fee on the trades. Possibly they are going to be one of the top market leader exchanges in the next bull. Feel free to DM me for a referral link  Question is will there allow p2p without kyc, if the probability of that is higher then it means that their become the best alternative to to centralized exchange more so because of the low trading fee you mentioned.QuoteFeel free to DM me for a referral link  I will sure dm you for the link to follow up i have being looking such info.QuoteThere was Kucoin as the best but if I'm correct they have set new rules for the new users affecting from last month that KYC is compulsory. Please have a little investigation on this. I can't confirm exactly.Kucoin have updated the policy on the 31-8-2024 and have set limits on non kyc excluding them from p2p trading just as it has always been.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "virasog",
      "created_time": "September 02, 2023, 02:07:04 PM",
      "body": "Quote from: Gladitorcomeback on September 02, 2023, 06:53:32 AMI would like to give one advice here that if you want to use these exchanges for big fund than most of the time these exchanges seized your fund and ask for KYC to withdraw. My friend experience such kind of situation with Mexc where he deposited 5000$ but mexc seized withdraw and asked for KYC so always be careful with this. Isn't it strange as Mexc exchange claims that they allow up to 30 BTC without KYC withdrawals but here they are asking for the KYC for mere 5,000? So what was the end result of that case ? Was he able to withdraw after doing the KYC or did the exchange never approved their KYC? (as it happens often in order to scam people for money).I would be careful now to send money to non-KYC exchanges, It is better to do the KYC than to lose our money",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rikafip",
      "created_time": "September 02, 2023, 03:53:40 PM",
      "body": "Quote from: virasog on September 02, 2023, 02:07:04 PMIsn't it strange as Mexc exchange claims that they allow up to 30 BTC without KYC withdrawals but here they are asking for the KYC for mere 5,000? All non-KYC centralized exchanges reserve right to ask for KYC for whatever amount they want so people should be extra careful when they are using them. Quote from: virasog on September 02, 2023, 02:07:04 PMI would be careful now to send money to non-KYC exchanges, It is better to do the KYC than to lose our money  When you are using non-KYC centralized exchange, you shoudl always be aware of the fact that they can ask for KYC at any time, meaning unless you are readsy to do KYC, you should only send amount that you are ready to lose. I used Kucoin for years in excatly that way, never sendng more than a few hundreds of dollars knowng that if they ask me for KYC, I will simply refuse it and leabve the money there. Luckily they never asked me, at least not until they made KYC mandatory for all users.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MURONDI",
      "created_time": "September 03, 2023, 02:18:30 AM",
      "body": "Here are some of the most popular exchanges that allow KYC-free deposits and withdrawals:MEXC: Hong Kong-based exchange with multiple cryptocurrencies, no KYC for deposits and withdrawals of up to 5 BTC per day.CoinEx: Seychelles-based exchange with a suite of cryptocurrencies similar to MEXC, without KYC for deposits and withdrawals of up to 10 BTC per day.dYdX: A decentralized exchange that allows users to trade cryptocurrency without the need for third parties, without KYC for deposits and withdrawals.ByBit: Singapore based exchange specializing in derivatives trading, no KYC for deposits and withdrawals up to 2 BTC per day.PrimeXBT: A Seychelles-based exchange that also specializes in derivatives trading, without KYC for deposits and withdrawals of up to 100 BTC per day.It is important to do your own research before choosing an exchange that does not require KYC. Some of these exchanges may be more vulnerable to fraud.If you're considering using an exchange that doesn't require KYC, it's important to weigh the risks and benefits carefully.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "adaseb",
      "created_time": "September 03, 2023, 04:10:19 AM",
      "body": "My advice is you should just start using Defi instead. Because while there are some exchanges right now, usually after a few months they are all forced to KYC. It happened with bybit, then kucoin and now with bitget. And eventually whatever exchange you are using will most likely enforce KYC.Hence you should just start and see if defi is right for you. Unless you are some large whale the liquidity won’t be an issue for you. And you can use a hardware wallet along with Metamask to sign your transactions for security.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hosemary",
      "created_time": "September 03, 2023, 05:36:38 AMLast edit: September 03, 2023, 06:08:57 AM by hosseinimr93",
      "body": "Quote from: MURONDI on September 03, 2023, 02:18:30 AMCoinEx: Seychelles-based exchange with a suite of cryptocurrencies similar to MEXC, without KYC for deposits and withdrawals of up to 10 BTC per day.This is wrong. According to an article on Coinex website, the withdrawal limit for the users who have completed Mobile/TOTP and haven't verified their identity is 10,000 dollars in every 24 hours. Quote from: How to Get Higher Withdrawal Limit24H Withdrawal LimitComplete Mobile/TOTP binding: 10,000 USDComplete Personal ID verification: 1,000,000 USDTo any newbie reading this post:Centralized exchanges can force you to pass KYC at any time, regardless of your balance and the amount you request to withdraw.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mvdheuvel1983",
      "created_time": "September 03, 2023, 07:41:47 AM",
      "body": "Quote from: Oshosondy on September 02, 2023, 05:42:51 AMFor list of decentralized exchanges: https://www.coingecko.com/en/exchanges/decentralizedIf you are concerned about submitting KYC documents to these exchanges which are mostly centralized, your best bet would be to use a decentralized exchange. Even though some of the exchanges that have been listed are centralized exchanges that are non-kyc, believe me very soon, they'll definitely start to request for kyc. They always do, talk about Kucoin, AscendEX and others. If you can, use decentralized exchanges. A link to them have been provided by this user -Oshosondy -",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "September 03, 2023, 08:11:25 AM",
      "body": "Quote from: virasog on September 02, 2023, 02:07:04 PMIsn't it strange as Mexc exchange claims that they allow up to 30 BTC without KYC withdrawals but here they are asking for the KYC for mere 5,000? So what was the end result of that case ? Was he able to withdraw after doing the KYC or did the exchange never approved their KYC? (as it happens often in order to scam people for money).I would be careful now to send money to non-KYC exchanges, It is better to do the KYC than to lose our money  I'm not sure if the numbers are right, but always remember that these exchanges can adjust their limits literally any time they want to; especially when being questioned by the authorities. Heck, we got some centralized exchanges in the past that did shotgun KYC to all their users without any prior notice at all. A change of these limits is bad, but definitely not the worst thing ever.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "wallet4bitcoin",
      "created_time": "September 03, 2023, 10:02:04 AM",
      "body": "Quote from: Ratimov on September 03, 2023, 06:12:59 AMQuote from: MURONDI on September 03, 2023, 02:18:30 AMMEXC: Hong Kong-based exchange with multiple cryptocurrencies, no KYC for deposits and withdrawals of up to 5 BTC per day.CoinEx: Seychelles-based exchange with a suite of cryptocurrencies similar to MEXC, without KYC for deposits and withdrawals of up to 10 BTC per day.ByBit: Singapore based exchange specializing in derivatives trading, no KYC for deposits and withdrawals up to 2 BTC per day.MEXC - 30 BTC per day, it is not in Hong Kong, but based in the Seychelles.CoinEx - Not in Seychelles, but in Samoa, and there the limit for unverified users is $10,000, not 10 BTC.ByBit - A year ago introduced KYC for all users.Throw away the crap from which you copied this incorrect data and do not distribute it anymore on the network.The data provided by MURONDI might have been true but its outdated, he didn't check to get it updated before peddling them.Not much expectation from a newbie though.I mostly love verifying informations before disseminating them",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sim_card",
      "created_time": "September 03, 2023, 02:28:49 PM",
      "body": "Those centralized exchanges will always ask for KYC in the nearest future to come if they claim that they are non KYC exchanges. The way the crypto market is moving now is to a centralized system because the government wants to regulate crypto. If you are not cool with these exchanges, I wil advice you to use Dex for privacy with no KYC. Some exchanges claim to be a non KYC exchange,but the moment you want to withdraw a certain amount,you will be asked to provide KYC. This is why it is up to you to conclude which part you will be on,the KYC or not.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nrcewker",
      "created_time": "September 03, 2023, 04:22:58 PM",
      "body": "Quote from: ZeeshanTrade on September 02, 2023, 05:28:27 AMPlease let me know about Exchanges that allow deposit/withdrawal without KYC and their limits if possible.KuCoin used to be the best Non-KYC exchange earlier. But they recently changed their policies I guess. Do check them out and if possible reach their support team. They will surely tell you what exactly required in order to trade in their exchange. Moreover I haven’t traded anywhere else to be honest. Binance, Kucoin and Okex were the ones where I have traded before and I can vouch for them. But before depositing funds anywhere do check their terms and conditions, so that in future you won’t face any troubles.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Eternad",
      "created_time": "September 03, 2023, 04:27:01 PM",
      "body": "Quote from: Nrcewker on September 03, 2023, 04:22:58 PMQuote from: ZeeshanTrade on September 02, 2023, 05:28:27 AMPlease let me know about Exchanges that allow deposit/withdrawal without KYC and their limits if possible.KuCoin used to be the best Non-KYC exchange earlier. But they recently changed their policies I guess. Do check them out and if possible reach their support team. They will surely tell you what exactly required in order to trade in their exchange. Moreover I haven’t traded anywhere else to be honest. Binance, Kucoin and Okex were the ones where I have traded before and I can vouch for them. But before depositing funds anywhere do check their terms and conditions, so that in future you won’t face any troubles.Kucoin already imposed mandatory KYC recently that makes them join the exchange like Binance that requires full KYC in able to use the exchange.Huobi and Bitget are the current top exchange that still doesn’t require KYC but I’m not confident any of them since Huobi is owned by Sun while Bitget is using paid shill here in the forum to create fake interactions to promote the exchange.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "crwth",
      "created_time": "September 03, 2023, 04:29:14 PM",
      "body": "I think the major exchanges now mostly require KYC but some have their limits set to at least a certain amount of BTC or any coin that you are using to be exchanged if you are non-KYC. I think it would be hard to have right now some exchange that supports Non-KYC. I think it's better to use P2P instead.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "armanda90",
      "created_time": "September 03, 2023, 06:21:59 PM",
      "body": "Regarding some respond above have recommended with exchange allow deposit and withdrawing without KYC you need research to know its true or some exchange have change their rule for withdrawing need to verify account firstly. Based on my experience when arbitrage altcoin from one exchange to other exchange I know with LBANK and KUCOIN are exchange not allowed KYC for withdrawing assets. But have limited amount withdrawing only under 2 BTC in daily day for LBANK and Kucoin. Some respond said about Huobi is allowed for withdrawing assets without KYC, I doubt with this statement because my account have been verified for using to withdraw assets there.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ajiz138",
      "created_time": "September 03, 2023, 06:43:46 PM",
      "body": "Quote from: armanda90 on September 03, 2023, 06:21:59 PMRegarding some respond above have recommended with exchange allow deposit and withdrawing without KYC you need research to know its true or some exchange have change their rule for withdrawing need to verify account firstly. Based on my experience when arbitrage altcoin from one exchange to other exchange I know with LBANK and KUCOIN are exchange not allowed KYC for withdrawing assets. But have limited amount withdrawing only under 2 BTC in daily day for LBANK and Kucoin. Some respond said about Huobi is allowed for withdrawing assets without KYC, I doubt with this statement because my account have been verified for using to withdraw assets there. Kucoin has now enforced full KYC for its users since July but the Lbank exchange can still withdraw without KYC with certain withdrawal limits as discussed by Ratimov.I am currently using Mexc as a CEX that is not KYC as well as some other exchanges still not KYC can see in this thread.[1] No-KYC Exchange EncyclopediaAbout the announcement of Kucoin enforcing KYC here:[2] Kucoin to introduce mandatory KYC",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}