{
  "id": "topic_5464037",
  "title": "chigo",
  "author": "chigo",
  "created_time": "August 21, 2023, 10:49:55 AM",
  "content": "masih banyak yang menganggap aktifitas trading hanyalah main2 dan bukanlah sebuah pekerjaan namun trading adalah pekerjaan, trading di kategorikan ke dalam self-employed atau dalam kamus besar nya -> orang orang yang bekerja dengan dirinya sendiri, maka itu untuk para trader segera bantah mereka yang menganggap anda pengangguran hanya karena mereka tidak melihat anda memiliki seorang bos, anda adalah bos untuk diri anda sendiri, jangan patah semangat dengan omongan mereka, jika anda sudah sangat nyaman dan mendapatkan profit konsisten maka pertahankan itu karena ketika anda berupaya mencari pekejraan di luar sana, anda hanya akan membuang buang kesempatan anda menjadi seorang trader profesional.namun para trader di sarankan unutk memiliki penghasilan samping yang cukup stabil, untuk menopang finansial karena pasar selalu bergerak bebeas dan tak terduga.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5464037",
  "comments": [
    {
      "author": "Chikito",
      "created_time": "August 22, 2023, 01:32:49 AM",
      "body": "Quote from: chigo on August 21, 2023, 10:49:55 AMjika anda sudah sangat nyaman dan mendapatkan profit konsisten maka pertahankan itu karena ketika anda berupaya mencari pekejraan di luar sana, anda hanya akan membuang buang kesempatan anda menjadi seorang trader profesional.Banyak sekali stigma di masyarakat kalau bekerja itu harus keluar rumah, pergi pagi pulang sore, dan capek. Padahal initinya, Sesuatu yang menghasilkan uang itu disebut pekerjaan, jadi tidak hanya di luar rumah, di dalam rumah pun jika ngasilin uang 100 ribu/hari dengan berforum pun itu disebut pekerjaan. Jadi kalau trader itu bukan pekerjaan, jadi Warren Buffet itu apa?, hidup dia itu full 100% sebagai trader saham. Harta yang dia timbun di bawah ranjang emasnya itu semua dia dapat dari trading saham sejak remaja. Jadi ya sulit kalau masyarakat itu masih belum paham jenis-jenis pekerjaan. Jadi saya harap nyinyir negative masyarakat \"di rumah saja\" itu segera buang jauh-jauh terhadap orang lain. [1].Misal Ada tetangga reseh: \"jangan-jangan dia itu pelihara tuyul\", \"Karena dia tidak bekerja, suaminya cuma di rumah doang, tapi bisa ngasilin duit banyak dan beli perabotan terus.\". Padahal bekerja sebagai trader ya memang di rumah, di depan laptop, penghasilannya tentu diatas dua digit, dimana jelas lebih besar dibanding tetangganya yang hanya sebagai pejabat pemerintahan.[1]. https://idws.id/portal/hiburan/unik/5321/Curhat-YouTuber-di-Bondowoso--Sempat-Dituduh-Pesugihan-Hingga-Pelihara-Tuyul",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husna QA",
      "created_time": "August 22, 2023, 04:18:20 AM",
      "body": "Quote from: Chikito on August 22, 2023, 01:32:49 AMQuote from: chigo on August 21, 2023, 10:49:55 AMjika anda sudah sangat nyaman dan mendapatkan profit konsisten maka pertahankan itu karena ketika anda berupaya mencari pekejraan di luar sana, anda hanya akan membuang buang kesempatan anda menjadi seorang trader profesional.Banyak sekali stigma di masyarakat kalau bekerja itu harus keluar rumah, pergi pagi pulang sore, dan capek. Padahal initinya, Sesuatu yang menghasilkan uang itu disebut pekerjaan, jadi tidak hanya di luar rumah, di dalam rumah pun jika ngasilin uang 100 ribu/hari dengan berforum pun itu disebut pekerjaan. Jadi kalau trader itu bukan pekerjaan, jadi Warren Buffet itu apa?, hidup dia itu full 100% sebagai trader saham. Harta yang dia timbun di bawah ranjang emasnya itu semua dia dapat dari trading saham sejak remaja. Jadi ya sulit kalau masyarakat itu masih belum paham jenis-jenis pekerjaan. -snip-Kurang lebih kejadian oleh saya sendiri karena memang kerjanya di rumah dan PC kantor pun di remote dari rumah. Anggapan masyarakat awam umumnya memang kalau kerja itu yang kelihatan oleh kasat mata semisal berangkat keluar atau kalaupun di rumah ya dagang dan semisalnya yang ketara aktifitas sehari-harinya. Tapi ketika ada pandemi Covid, istilah kerja dari rumah/Work from Home jadi populer sehingga ketika diberi penjelasan kerjanya WFH tidak terasa aneh lagi seperti awal-awal dulu.Btw, terkait trading beberapa kali saya belajar teori (diantaranya di udemy) baik dari analisa teknikal maupun strategi investasi lainnya masih saja belum paham banget sampai detailnya; Mungkin bagi sebagian orang yang lebih kurang sama, bisa jadi perhatian juga untuk mengukur kemampuan terlebih dulu dan mempelajari segala macam kemungkinan resiko dari jenis pekerjaan tersebut, jadi tidak 'asal' tanpa ilmunya dan perencanaan matang.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "aylabadia05",
      "created_time": "August 22, 2023, 08:40:56 AM",
      "body": "Quote from: Chikito on August 22, 2023, 01:32:49 AMJadi saya harap nyinyir negative masyarakat \"di rumah saja\" itu segera buang jauh-jauh terhadap orang lain. [1].Misal Ada tetangga reseh: \"jangan-jangan dia itu pelihara tuyul\", \"Karena dia tidak bekerja, suaminya cuma di rumah doang, tapi bisa ngasilin duit banyak dan beli perabotan terus.\".Padahal bekerja sebagai trader ya memang di rumah, di depan laptop, penghasilannya tentu diatas dua digit, dimana jelas lebih besar dibanding tetangganya yang hanya sebagai pejabat pemerintahan.[1]. https://idws.id/portal/hiburan/unik/5321/Curhat-YouTuber-di-Bondowoso--Sempat-Dituduh-Pesugihan-Hingga-Pelihara-TuyulKecurigaan yang berujung ke kegelisahan tetangga terhadap orang-orang lain termasuk kepada kita yang mungkin memiliki penghasilan tetap tiap bulan sulit dihilangkan. Paradigma seperti itu saya anggap sebagai kebiasaan turun menurun apalagi yang tinggal di pedesaan. Kesulitan menghilangkannya seperti sulitnya memberantas korupsi.Saya sepakat kalau dugaan \"jangan-jangan dia itu pelihara tuyul\" kepada orang lain perlu dibuang ke sungai atau titip sama anak yang sedang mandi sungai untuk bantu membuangnya.Kalau disekitar saya, mungkin kalimat \"jangan-jangan dia itu pelihara tuyul\" saya menduga kalau itu tidak lagi menjadi kalimat yang mereka gunakan terhadap dugaan kepada kita yang melakukan trading, tetapi kalimat yang muncul dari mereka yang menjadi praduganya adalah \"jangan-jangan lakinya jualan beras putih (s.bu) makanya enak\".",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mu_enrico",
      "created_time": "August 22, 2023, 12:59:52 PM",
      "body": "Trading bisa jadi pekerjaan itu betul, tapi masalahnya untuk sampai ke tahap \"trading for living\" itu ngga mudah. Jualan sembako juga termasuk trading, hanya saja lebih pasti daripada trading kripto, saham, forex, dsb. Kalau agan sudah sampai pada tahap hidup dari trading, ya berarti julukan pengangguran tidak tepat.Dalam dunia usaha memang ada pasang dan surut, untung dan rugi, tapi tidak seliar trading. Ane hanya tau sedikit sekali orang yang bisa hidup dari trading, makanya ane juga pun menganggap trading bukanlah pekerjaan utama, at least bagi kebanyakan orang. Kebanyakan yang hidup dari trading itu juga adalah broker/marketer di suatu sekuritas yang tugasnya jadi pengepul duit orang-orang kaya.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "moneystery",
      "created_time": "August 22, 2023, 01:35:42 PM",
      "body": "stigma yang sudah terpaku di pikiran masyarakat kita pada umumnya mengatakan bahwa trading bukan sebuah pekerjaan melainkan itu hanya sampingan bahkan ada yang menyebut bahwa itu adalah perjudian. memang kita tidak bisa menyalahkan masyarakat kita yang kebanyakan masih berpikiran konservatif dan tidak paham mengenai pekerjaan yang ada di internet. menurut mereka bahwa pekerjaan itu harus keluar rumah jam 7 pagi dan pulang pada jam 5 sore, padahal sebenarnya pekerjaan di internet itu ada banyak dan penghasilannya bahkan lebih lumayan dibandingkan dengan karyawan pada umumnya. bahkan ada satu kasus di depok yang dimana seorang pemuda disana dituduh menjalankan praktik babi ngepet di rumahnya, padahal dia bekerja secara online dan sialnya banyak orang yang mempercayai tuduhan ini karena melihat kondisi pemuda tersebut yang lumayan kaya, dan masih banyak kasus lainnya. dari hal ini kita bisa melihat bahwa masyarakat kita kebanyakan itu masih awam tentang pekerjaan online dan ini menunjukkan kualitas SDM kita yang masih cukup tertinggal dibandingkan dengan negara tetangga.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Juse14",
      "created_time": "August 23, 2023, 03:38:40 AM",
      "body": "Quote from: Chikito on August 22, 2023, 01:32:49 AMQuote from: chigo on August 21, 2023, 10:49:55 AMjika anda sudah sangat nyaman dan mendapatkan profit konsisten maka pertahankan itu karena ketika anda berupaya mencari pekejraan di luar sana, anda hanya akan membuang buang kesempatan anda menjadi seorang trader profesional.Banyak sekali stigma di masyarakat kalau bekerja itu harus keluar rumah, pergi pagi pulang sore, dan capek. Padahal initinya, Sesuatu yang menghasilkan uang itu disebut pekerjaan, jadi tidak hanya di luar rumah, di dalam rumah pun jika ngasilin uang 100 ribu/hari dengan berforum pun itu disebut pekerjaan. yaa.. benar yang anda katakan tentang stigma masyarakat bahwa bekerja harus keluar rumah dan bekerja dirumah, didepan layar dapat meinmbulkan kecurigian tersendiri dari masyarakat terhadap kita yang bekerja sebagai pedagang. dan berhubung saya tinggal masih di pedesaan, stigma ini masih sangat kentalNamun saya tidak peduli dengan itu semua, dengan apa yang mereka katakan tentang saya. Jika saya harus menjelaskan tentang apa yang saya kerjakan hanya akan menguras waktu karena mereka belum memahaminya. Yang saya lakukan hanya perlu menutup kuping saya rapat-rapat dan terus terabang lebih tinggi. Jika anda mengurusi hal receh seperti itu waktu anda akan terbuang sia-sia, akan lebih baik jika yang kita lakukan adalah dengan terus meningkatkan kemampuan kita dalam dunia perdagangan agar bisa meningkatkan penghasilan kita dan nantipun seiring waktu berjalan mereka akan mengerti dengan sendirinya tentang apa yang kita lakukan.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zaim7413",
      "created_time": "August 23, 2023, 04:07:13 AM",
      "body": "Era digitalisasi telah memudahkan siapapun dalam melakukan kegiatan yang dapat menghasilkan uang. Bekerja tidak mesti harus banting tulang, pergi pagi pulang pagi seperti dalam lirik lagu Armada, duduk di depan Laptop sambil ngopi dengan menjalankan kegiatan trading juga disebut pekerjaan. Duduk di rumah sambil menjalankan Trading atau menyelesaikan tugas harian forum juga bagian dari pekerjaan, rejeki orang berbeda-beda maka pekerjaan orang juga berbeda-beda.Orang-orang yang berpendapat yang melakukan aktifitas trading bukan pekerjaan ulang perlu di scan ulang otaknya, mereka masih belum mampu mencerna bagaimana cara memanfaatkan digitalisasi dalam mencari uang. Banyak sekali pekerjaan ringan yang bisa mendatangkan penghasilan besar, selama kegiatan yang saya lakukan tidak menggangu dan merugikan orang lain saya tidak pernah peduli dengan omongan negatif dari orang lain.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "retreat",
      "created_time": "August 23, 2023, 09:24:09 AM",
      "body": "Benar seperti yang agan bilang bahwa trader itu bukanlah sebuah pengangguran melainkan itu adalah sebuah pekerjaan sama halnya seperti pekerjaan yang lain, hanya saja itu pekerjaan online yang bisa dilakukan di mana saja. Karena banyak sekali orang indo yang mengatakan bahwa trader itu adalah pengangguran dan saya sendiri merasakan hal tersebut, dikatain sebagai pengangguran oleh tetangga hanya karena saya bekerja dari rumah. Bahkan lebih parahnya ada tetangga yang bilang bahwa saya main judi slot dirumah dan itu cukup membuat saya tertawa. Memang inilah suka dukanya bekerja dari rumah dan saya tidak mau ambil pusing untuk hal tersebut, mau mereka bilang saya pengangguran mau tidak, itu urusan mereka, yang penting saya bekerja secara halal dan tidak perlu capek keluar rumah untuk mendapatkan uang.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitinity",
      "created_time": "August 23, 2023, 09:43:07 AM",
      "body": "Quote from: retreat on August 23, 2023, 09:24:09 AMBenar seperti yang agan bilang bahwa trader itu bukanlah sebuah pengangguran melainkan itu adalah sebuah pekerjaan sama halnya seperti pekerjaan yang lain, hanya saja itu pekerjaan online yang bisa dilakukan di mana saja. Karena banyak sekali orang indo yang mengatakan bahwa trader itu adalah pengangguran dan saya sendiri merasakan hal tersebut, dikatain sebagai pengangguran oleh tetangga hanya karena saya bekerja dari rumah. Bahkan lebih parahnya ada tetangga yang bilang bahwa saya main judi slot dirumah dan itu cukup membuat saya tertawa. Memang inilah suka dukanya bekerja dari rumah dan saya tidak mau ambil pusing untuk hal tersebut, mau mereka bilang saya pengangguran mau tidak, itu urusan mereka, yang penting saya bekerja secara halal dan tidak perlu capek keluar rumah untuk mendapatkan uang. Ya karena memang mindset kebanyakan orang di negara kita ini khususnya yang hidup didesa seperti itu om. Kebanyakan orang mengartikan bahwa \"orang bekerja\" itu harus kelihatan, harus keluar rumah (ke kantor), harus punya slip gaji, atau mungkin harus punya seragam. Terlepas dari dunia pertradingan, didunia online ini masih banyak lagi yang bisa memberikan pendapatan ke orang contohnya affiliate2 macam ditiktok, atau jadi content creator, atau jadi online freelance dll. Banyak orang khususnya yang didesa (termasuk didesa saya) yang belum punya pengetahuan tentang dunia online yang bisa menghasilkan. Jeleknya adalah mereka menggunakan standar mereka (standar yang bisa dikatakan sudah jadul), diterapkan ke dunia yang sudah lebih jauh modern dan digital ini. Beruntungnya saya adalah saya punya pekerjaan tetap didunia nyata jadi jarang dapat nyinyiran dari orang2 sekitar  Tapi seumpama saya diposisi teman2 yang bekerja secara online ntah apapun itu, saya juga cuma akan bilang bodo amat sama ucapan orang sekitar toh kita kan ga merugikan mereka. Tetap semangat buat teman2 yang bekerja didunia digital, tapi kalau harus ngasih saran sih saya akan bilang kalau bisa memang cari yang didunia nyata juga atau buka usaha kecil2an buat sampingan.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jcojci",
      "created_time": "August 23, 2023, 02:13:06 PM",
      "body": "Saya setuju dengan judulnya. Walaupun banyak yang mengatakan bahwa tidak mudah untuk bisa menghasilkan uang dari perdagangan ataupun dari internet. Dan itu memang benar adanya. Seseorang yang memiliki komitmen untuk mencari atau menghasilkan uang dari internet atau dari trading harus bisa menguasai banyak hal dan membutuhkan proses yang tidak sebentar. Tapi banyak yang mengeluh ketika mereka merasa sudah belajar banyak dan sudah lama dalam belajar belum bisa menghasilkan uang dari apa yang mereka kerjakan. Mereka lupa bahwa untuk bisa berhasil dalam setiap bidang pekerjaan yang mereka lakukan memerlukan waktu.Jadi jika ada yang berhasil menghasilkan uang dari trading, itu adalah sebuah contoh untuk kita supaya kita bisa belajar lebih keras dan lebih baik dari orang-orang lain. Dan walaupun tetangga mengira kita tidak bekerja seperti orang-orang lain yang bekerja di kantor, selama kita bisa memenuhi kebutuhan hidup dan tidak meminta dari orang lain, ya kita jalani aja toh kita juga tidak mengganggu hidup mereka. Dan kalau ada orang yang bilang kita kerjaannya nuyul, ya kita perjelas aja sekalian dengan bilang, Iya Pak. Saya lagi nuyul ini, Bapak mau ikut?   Paling nanti santer beredar kabar kalau kita beneran dikira nuyul soale ada teman saya yang kerja online gitu tapi dia ga keliatan kerjanya. Trus didatengin sama Pak RTnya katanya ada rumor kalau teman saya kerjanya nuyul. Setelah dijelasin ke Pak RT nya, akhirnya paham juga kalau apa yang dikerjain teman saya itu dari online dan tidak bisa disamakan dengan orang-orang yang bekerja di kantoran. Yang penting dapatnya uang halal",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sarah Azhari",
      "created_time": "August 24, 2023, 06:15:27 AM",
      "body": "Quote from: chigo on August 21, 2023, 10:49:55 AMnamun para trader di sarankan unutk memiliki penghasilan samping yang cukup stabil, untuk menopang finansial karena pasar selalu bergerak bebeas dan tak terduga.Perekonomian suatu negara yang semakin sempit seperti sekarang ini memang membutuhkan kerja sampingan sebagai penopang pekerjaan utama, Ku akui, gaji yang kuterima di kerja utama saja tidak cukup untuk kebutuhan sebulan, aku harus ngambil dari gaji di signature campaign untuk beli token listrik, tagihan indihome, Air, Gas dan pulsa. Ini cukup memberatkan kalau negara tidak turun langsung mengatasi permasalahan ini ke swasta. Apa lagi, tidak meratanya UMR/UMK membuat kesenjangan jelas antara daerah dan pusat, sehingga jika ada pekerjaan di luar dari daerah yang kita diami itu akan terasa banget kalau duit kita itu kecil.Jadi Trader dan bermain forum ini suatu keharusan mengatasi permasalahan ini. Kalau kedua hal ini dianggap bukan pekerjaan, tentu akan banyak sekali priuk nasi yang kosong di luar sana.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CageMabok",
      "created_time": "August 25, 2023, 01:03:09 AM",
      "body": "Quote from: chigo on August 21, 2023, 10:49:55 AMMenanggapi apa yang tertulis di gambar ini, sebenarnya penghasilan sebanyak dua sampai tiga juta itu sudah tidak lagi terlihat banyak untuk saat ini walaupun seseorang hanya tinggal di desa saja, karena tingkat pengeluaran sehari-hari yang dimiliki oleh setiap orang itu sudah mulai mendekati angka seratus ribuan dalam per harinya dan bahkan bisa lebih dari itu bagi mereka yang telah berkeluarga serta memiliki anak. Jadi penghasilan sebanyak itu bukan lagi jumlah yang begitu fantastis sekarang walaupun memiliki nilainya om, sehingga pekerjaan sampingan masih harus ada dan juga menjadi fokus utama demi bisa mendapatkan penghasilan tambahan selain dari trading. Karena kalau seseorang bisa fokus pada dua pekerjaan berbeda, tingkat penghasilannya akan sangat luar biasa serta perkembangan didalam hidupnya akan lebih terlihat om.Quotemasih banyak yang menganggap aktifitas trading hanyalah main2 dan bukanlah sebuah pekerjaan namun trading adalah pekerjaan, trading di kategorikan ke dalam self-employed atau dalam kamus besar nya -> orang orang yang bekerja dengan dirinya sendiri, maka itu untuk para trader segera bantah mereka yang menganggap anda pengangguran hanya karena mereka tidak melihat anda memiliki seorang bos, anda adalah bos untuk diri anda sendiri, jangan patah semangat dengan omongan mereka, jika anda sudah sangat nyaman dan mendapatkan profit konsisten maka pertahankan itu karena ketika anda berupaya mencari pekejraan di luar sana, anda hanya akan membuang buang kesempatan anda menjadi seorang trader profesional.Biarkan orang lain menganggap kita sebagai pengangguran karena orang lain hanya melihat kita dari sisi luarnya saja tanpa tahu apa yang kita kerjakan sehari-hari, begitu juga dengan halnya trading. Jika seseorang masih menganggap trading itu bukan sebagai sebuah pekerjaan, hal itu juga tidak akan menjadi sebuah masalah karena selama kita masih cukup nyaman untuk terus menjalani pekerjaan tersebut tanpa bergantung pada orang lain, maka tidak perlu memikirkan apa yang dianggap oleh orang lain terhadap kita. Dan untuk hal pekerjaan selain trading, selama pekerjaan tersebut yang ada diluar sana masih bisa memberikan tingkat penghasilan kepada kita, itu bukanlah upaya untuk buang-buang waktu dan kesempatan karena hal itu termasuk kedalam sebuah kesempatan untuk mencari penghasilan.Quotenamun para trader di sarankan unutk memiliki penghasilan samping yang cukup stabil, untuk menopang finansial karena pasar selalu bergerak bebeas dan tak terduga.Seperti yang saya katakan diatas om, pekerjaan sampingan yang masih bisa memberikan penghasilan kepada adalah hal yang sangat penting untuk dikerjakan meskipun seseorang telah mendapatkan profit secara konsisten lewat trading di bursa-bursa kripto dan lainnya. Jadi tidak ada yang rugi dengan bekerja pada dua tempat berbeda selama hal itu adalah untuk menghasilkan uang secara lebih banyak kepada dirinya sendiri.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitLeap",
      "created_time": "August 25, 2023, 12:06:54 PM",
      "body": "Quote from: Juse14 on August 23, 2023, 03:38:40 AMQuote from: Chikito on August 22, 2023, 01:32:49 AMQuote from: chigo on August 21, 2023, 10:49:55 AMjika anda sudah sangat nyaman dan mendapatkan profit konsisten maka pertahankan itu karena ketika anda berupaya mencari pekejraan di luar sana, anda hanya akan membuang buang kesempatan anda menjadi seorang trader profesional.Banyak sekali stigma di masyarakat kalau bekerja itu harus keluar rumah, pergi pagi pulang sore, dan capek. Padahal initinya, Sesuatu yang menghasilkan uang itu disebut pekerjaan, jadi tidak hanya di luar rumah, di dalam rumah pun jika ngasilin uang 100 ribu/hari dengan berforum pun itu disebut pekerjaan. yaa.. benar yang anda katakan tentang stigma masyarakat bahwa bekerja harus keluar rumah dan bekerja dirumah, didepan layar dapat meinmbulkan kecurigian tersendiri dari masyarakat terhadap kita yang bekerja sebagai pedagang. dan berhubung saya tinggal masih di pedesaan, stigma ini masih sangat kentalNamun saya tidak peduli dengan itu semua, dengan apa yang mereka katakan tentang saya. Jika saya harus menjelaskan tentang apa yang saya kerjakan hanya akan menguras waktu karena mereka belum memahaminya. Yang saya lakukan hanya perlu menutup kuping saya rapat-rapat dan terus terabang lebih tinggi. Jika anda mengurusi hal receh seperti itu waktu anda akan terbuang sia-sia, akan lebih baik jika yang kita lakukan adalah dengan terus meningkatkan kemampuan kita dalam dunia perdagangan agar bisa meningkatkan penghasilan kita dan nantipun seiring waktu berjalan mereka akan mengerti dengan sendirinya tentang apa yang kita lakukan.Sepertinya kita memiliki pandangan yang sama akan hal ini dan memang stigma itu masih sangat melekat  di masyarakat. Jika anda bekerja, maka anda harus terlihat pergi, dan harus terlihat pulang, jika tidak maka kita akan dianggap sebagai pengangguran.Mengenai kecurigaan masyarakat tentang kita yang menghasilkan uang padahal tidak pernah ke luar rumah, itu yang pernah saya alami, dan bahkan lebih mengerikan lagi ketika kita di anggap melakukan pesugihan dan hal yang berbau mistis. hahahahah itu lelucon yang sangat lucu.Ini zaman modern bung, yang segala hal bisa diakses dengan sangat mudah asalkan kita memiliki pengetahuan yang cukup untuk itu. Anda benar sangat sulit menjelaskan kepada orang yang sudah tertanam dalam pemikirannya bahwa yang kita lakukan itu tidak sesuai dengan kebanyakan orang lain lakukan, dan memang terkadang kita harus masa bodo akan hal itu. Namun tidak semua orang seperti itu, ada juga diantara mereka yang mengerti dan bahkan mereka sampai ingin belajar  tentang apa yang kita lakukan.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "komisariatku",
      "created_time": "August 25, 2023, 12:54:03 PM",
      "body": "Quote from: Chikito on August 22, 2023, 01:32:49 AMBanyak sekali stigma di masyarakat kalau bekerja itu harus keluar rumah, pergi pagi pulang sore, dan capek. Padahal initinya, Sesuatu yang menghasilkan uang itu disebut pekerjaan, jadi tidak hanya di luar rumah, di dalam rumah pun jika ngasilin uang 100 ribu/hari dengan berforum pun itu disebut pekerjaan. Iya gan, apapun yang dilakukan asalkan menghasilkan uang bisa disebut sebagai pekerjaan. Mungkin saat ini masih proses tranformasi zaman, dari zaman non teknologi menuju zaman teknologi, dan itu berjalan sangat cepat sehingga masih banyak orang yang menganggap bahwa dirumah saja itu bukan pekerjaan.Meskipun trader memiliki resiko tinggi, tetapi tetap saja itu pekerjaan, sama seperti pedagang kelontongan atau pedagang sembako, yang membedakan hanyalah fisiknya (jualannya) dan resikonya.Tapi sekarang masih banyak orang yang dari pada ribet njawab mending seolah-olah kerja, saya kenal seorang freelancer yang sampe nyewa ruko buat ngantor.. disana kadang cuma tidur-tiduran atau garap job. Intinya dia butuh alasan jika di tanya orang dan butuh pergi agar di anggap kerja normal. Biar ga dikira nuyul mungkin..",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nurilham",
      "created_time": "August 25, 2023, 09:57:32 PMLast edit: August 25, 2023, 10:37:34 PM by nurilham",
      "body": "Quote from: chigo on August 21, 2023, 10:49:55 AMmasih banyak yang menganggap aktifitas trading hanyalah main2 dan bukanlah sebuah pekerjaan namun trading adalah pekerjaan, trading di kategorikan ke dalam self-employed atau dalam kamus besar nya -> orang orang yang bekerja dengan dirinya sendiri,-snip-Biasanya yang seperti ini di lingkungan masyarakat yang pendidikannya kurang dan tidak update perkembangan jaman. Kalau masyarakatnya familiar dengan teknologi baru dan sudah modern, pasti tidak akan menganggap trading itu cuman main-main. Perlu dipahami bahwa trading itu bukan cuman trading crypto, tapi juga ada trading stock (saham). Malah dulunya trader-trader itu kesannya orang-orang tertentu saja (karena trading saham agak rumit), tapi dengan adanya crypto semua orang bisa jadi trader.Quote from: chigo on August 21, 2023, 10:49:55 AMjangan patah semangat dengan omongan mereka, jika anda sudah sangat nyaman dan mendapatkan profit konsisten maka pertahankan itu karena ketika anda berupaya mencari pekejraan di luar sana, anda hanya akan membuang buang kesempatan anda menjadi seorang trader profesional.Kalau masih gampang patah semangat dengan omongan orang, berarti mental tradernya masih lemah. Sepemahaman saya menjadi trader itu wajib punya mental kuat, jadi sudah terbiasa dengan hal yang tidak terduga. Apalagi jika ingin menjadi trader profesional, berarti kudu totalitas tradingnya. Totalitas di sini bukan hanya dalam hal alokasi waktu yang diperuntukkan untuk tradingnya tapi juga terkait dengan kesiapan mental dan resiko menjadi seorang trader. Salah satu resikonya yaitu mungkin lebih banyak waktu di rumah, sehingga bisa jadi dicap pengangguran oleh orang-orang yang tidak paham.  Quote from: komisariatku on August 25, 2023, 12:54:03 PMMungkin saat ini masih proses tranformasi zaman, dari zaman non teknologi menuju zaman teknologi, dan itu berjalan sangat cepat sehingga masih banyak orang yang menganggap bahwa dirumah saja itu bukan pekerjaan.Dari dulu tekologi itu sudah ada gan, mungkin bentuk teknologinya saja yang berbeda.Kalau saat ini trader masih belum dianggap sebuah profesi, itu karena masyarakat belum familiar dengan trading. Ini hanya masalah waktu saja, pekerjaan-pekerjaan online seperti ini kan belum terlalu terekspos dulunya. Nanti kalau pekerjaan-pekerjaan online sudah menjadi hal umum di masyarakat, dengan sendirinya stigma buruk tersebut akan hilang.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "abhiseshakana",
      "created_time": "August 25, 2023, 10:59:19 PM",
      "body": "Kalo menurutku, dianggap pengangguran atau bukan tergantung pada income yang didapat. Jikalau seorang trader mampu menghasilkan income yang dapat digunakan untuk menopang kebutuhan hidup sehari-hari, maka trader tersebut bukanlah seorang pengangguran. Namun jika hasil yang didapat jauh dari kata layak maka trader tersebut masih masuk dalam kategori penggangguran.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husna QA",
      "created_time": "August 25, 2023, 11:27:36 PM",
      "body": "Quote from: nurilham on August 25, 2023, 09:57:32 PMQuote from: komisariatku on August 25, 2023, 12:54:03 PMMungkin saat ini masih proses tranformasi zaman, dari zaman non teknologi menuju zaman teknologi, dan itu berjalan sangat cepat sehingga masih banyak orang yang menganggap bahwa dirumah saja itu bukan pekerjaan.Dari dulu tekologi itu sudah ada gan, mungkin bentuk teknologinya saja yang berbeda.Kalau saat ini trader masih belum dianggap sebuah profesi, itu karena masyarakat belum familiar dengan trading. Ini hanya masalah waktu saja, pekerjaan-pekerjaan online seperti ini kan belum terlalu terekspos dulunya. Nanti kalau pekerjaan-pekerjaan online sudah menjadi hal umum di masyarakat, dengan sendirinya stigma buruk tersebut akan hilang.Trading bukan hanya pada cryptocurrency, jauh sebelum itu sudah ada trading saham; Yang mengenal ini sebagai profesi cenderung menengah ke atas seperti contoh orang-orang yang biasa di Bursa efek; Jadi bisa dimaklumi kalau masyarakat awam ke bawah belum terlalu familiar dengan jenis profesi ini padahal sudah lama ada.Untuk pekerjaan online lainnya yang dulu dianggap aneh lama kelamaan juga sudah mulai dimaklumi, contoh sekarang sudah banyak yang jual-beli via online, bahkan untuk transportasi sudah lebih mudah dipesan melalui aplikasi ojek online, dll.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "arimamib",
      "created_time": "August 25, 2023, 11:27:54 PM",
      "body": "Saya rasa adalah 4 istilah yang ada dalam hal ini terutamaScalpingDay traderSwing traderPosition traderhttps://www.investasiku.id/eduvest/saham/tipe-tipe-traderJadi setiap pilihan tersebut memiliki makna masing masing yang mungkin tidak asing lagi bagi kita pelaku pedagang.Nah jika saya melihat gambaran yang anda bagikan tentu saja seseorang tersebut lebih memilih berhenti untuk mencari pekerjaan dan memilih melakoni perdagangan crypto yang di nilai bisa mendapatkan keuntungan yang signifikan baik itu perhari atau perminggu bahkan perbulannya.Tapi pada umumnya setiap traders pasti mengalami kerugian dan apakah dia sudah memikirkan itu. Katakanlah dia memiliki keuntungan yang siginfikan dalam hari itu dan menganggap kalau dirinya bukanlah seorang pengganguran karena bisa mendapatkan yang lebih mudah dari ber trading dari pada harus bekerja keras seperti kerja di bangunan. Saya masih melakoni trading dan bekerja di dunia nyata, saya bisa mengatur waktu itu secara bersamaan mungkin itu lebih baik bukan. Perdagangan spot lebih mudah kita kontrol apalagi menggunakan dca sehingga bisa di lakukan tanpa harus difokuskan begitu dalam.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blue Snow",
      "created_time": "August 26, 2023, 12:37:39 PM",
      "body": "Quote from: arimamib on August 25, 2023, 11:27:54 PMSaya masih melakoni trading dan bekerja di dunia nyata, saya bisa mengatur waktu itu secara bersamaan mungkin itu lebih baik bukan. Perdagangan spot lebih mudah kita kontrol apalagi menggunakan dca sehingga bisa di lakukan tanpa harus difokuskan begitu dalam. Ane juga sama, melakukan kedua hal tersebut berbarengan, akan tetapi mungkin waktu ane lebih banyak di dunia nyata dikarenakan sering pergi ke luar kota. Sebenarnya, trading itu sangat dinamis, apa lagi sudah banyak aplikasi exchange yang ready di store phone, sehingga ketika lagi break atau sedang tidak begitu sibuk di kerjaan utama, ane bisa sesekali memantau pergerakan harga, bahkan pernah take 10x profit pada waktu coffe break.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}