{
  "id": "topic_5476493",
  "title": "FirmWars",
  "author": "FirmWars",
  "created_time": "December 04, 2023, 12:24:17 PM",
  "content": "I don't consider this to be a stupid question, I just want to know why. I can see that some crypto wallets this days are giving their users the option to create new wallet using 12 recovery seeds or 24 recovery seed, but I am confused to which one is safer and more stronger than the other. Reading a lot about crypto wallet on this forum, I have seen where some said that 12 recovery seed is better and some said that the higher the number of the words the better.I don't know which is which, but I trust that keeping your recovery seed safe either 12 or 24 is the most important thing to do. Now what do you think that I am missing here right now? Anything at all? Which one would you prefer out of these two and why?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5476493",
  "comments": [
    {
      "author": "Charles-Tim",
      "created_time": "December 04, 2023, 12:27:17 PM",
      "body": "12 words seed phrase is secure enough to protect your coins.24 word seed phrase is having 128 bits of security just like 12 word seed phrase. If you do not let your seed phrase be seen by an attacker, both are secure enough.Quote from: FirmWars on December 04, 2023, 12:24:17 PMI can see that some crypto wallets this days are giving their users the option to create new wallet using 12 recovery seeds or 24 recovery seedIt is worth knowing that seed phrase can be in 12, 15, 18, 21 or 24 words.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hatchy",
      "created_time": "December 04, 2023, 01:08:12 PM",
      "body": "Quote from: FirmWars on December 04, 2023, 12:24:17 PM I can see that some crypto wallets this days are giving their users the option to create new wallet using 12 recovery seeds or 24 recovery seed, but I am confused to which one is safer and more stronger than the other. If you prioritize maximum security and are willing to handle the longer seed, a 24 word recovery seed is a more robust option. The 12 word seed is considered secured enough, and Security in the context of recovery seeds is about making it computationally infeasible for an attacker to guess or generate the correct seed. The additional words in a 24 word seed significantly increase the number of possible combinations, making it more resistant to brute-force attacks.Both the 12 word or 24 word seed phrases generated by reputable wallets typically provide 128 bits of entropy, making them equally secure from a cryptographic standpoint. So Regardless of the word count, following best practices for secure storage and handling of the seed phrase is crucial to maintaining the security of your funds",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yaunfitda",
      "created_time": "December 04, 2023, 02:26:14 PM",
      "body": "Quote from: FirmWars on December 04, 2023, 12:24:17 PMI don't consider this to be a stupid question, I just want to know why. I can see that some crypto wallets this days are giving their users the option to create new wallet using 12 recovery seeds or 24 recovery seed, but I am confused to which one is safer and more stronger than the other. Reading a lot about crypto wallet on this forum, I have seen where some said that 12 recovery seed is better and some said that the higher the number of the words the better.I don't know which is which, but I trust that keeping your recovery seed safe either 12 or 24 is the most important thing to do. Now what do you think that I am missing here right now? Anything at all? Which one would you prefer out of these two and why? 12 seeds is enough in my opinion, it's 132 bits of entropy:https://electrum.readthedocs.io/en/latest/seedphrase.html#security-implicationsQuoteElectrum currently use the same wordlist as BIP39 (2048 words). A typical seed has 12 words, which results in 132 bits of entropy in the choice of the seed.Following BIP39, 2048 iterations of key stretching are added for the generation of the master private key. In terms of hashes, this is equivalent to adding an extra 11 bits of security to the seed (2048=2^11).From the point of view of an attacker, the constraint added by imposing a prefix to the seed version hash does not decrease the entropy of the seed, because there is no knowledge gained on the seed phrase. The attacker still needs to enumerate and test 2^n candidate seed phrases, where n is the number of bits of entropy used to generate the seed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Marvelman",
      "created_time": "December 04, 2023, 02:35:52 PM",
      "body": "Quote from: FirmWars on December 04, 2023, 12:24:17 PMI don't consider this to be a stupid question, I just want to know why. I can see that some crypto wallets this days are giving their users the option to create new wallet using 12 recovery seeds or 24 recovery seed, but I am confused to which one is safer and more stronger than the other. You say you don't consider this is a stupid question, which is kind of understandable since you're the one who asked it. But the way you put it, it kind of is. Let's say that instead of seed phrase we are talking about passwords. If you had to choose between a 12-character password and a 24-character password, which one do you think is more secure and \"stronger\"? It's kind of obvious, right?Quote from: FirmWars on December 04, 2023, 12:24:17 PMWhich one would you prefer out of these two and why? I personally prefer the 12-word seed phrase because it's shorter and easier to write down and keep safe. While, at the same time, it provides sufficient protection.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "un_rank",
      "created_time": "December 04, 2023, 03:36:31 PM",
      "body": "Quote from: Yaunfitda on December 04, 2023, 02:26:14 PM12 seeds is enough in my opinion, it's 132 bits of entropy:It is 132 bits when generated through electrum, but 128 bits for BIP39.Quote from: Marvelman on December 04, 2023, 02:35:52 PMLet's say that instead of seed phrase we are talking about passwords. If you had to choose between a 12-character password and a 24-character password, which one do you think is more secure and \"stronger\"? It's kind of obvious, right?It has the same consequence, with passwords it depends on what mix up of characters were used to generate it, does it have upper case, lower case, special characters, numbers? If it does, then 12 characters can provide sufficient security making 12 more words redundant to protect against brute force, this is the same equivalence with seed phrases, 12 words generated properly is impossible to brute force, so 12 extra words are redundant.When you have passed the threshold level it is not necessary to go higher.- Jay -",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o_e_l_e_o",
      "created_time": "December 04, 2023, 04:14:10 PM",
      "body": "Quote from: Hatchy on December 04, 2023, 01:08:12 PMThe additional words in a 24 word seed significantly increase the number of possible combinations, making it more resistant to brute-force attacks.Both 12 and 24 word seed phrases are impossible to brute force from scratch. How impossible they are is irrelevant.Quote from: Hatchy on December 04, 2023, 01:08:12 PMBoth the 12 word or 24 word seed phrases generated by reputable wallets typically provide 128 bits of entropy, making them equally secure from a cryptographic standpoint.24 word seed phrases provide 256 bits of entropy. They both provide 128 bits of security.Quote from: Yaunfitda on December 04, 2023, 02:26:14 PM12 seeds is enough in my opinion, it's 132 bits of entropy:Only for Electrum seed phrases. For BIP39 seed phrases its 128 bits of entropy. Either way, 12 words is perfectly safe.Quote from: Marvelman on December 04, 2023, 02:35:52 PMLet's say that instead of seed phrase we are talking about passwords. If you had to choose between a 12-character password and a 24-character password, which one do you think is more secure and \"stronger\"? It's kind of obvious, right?This is a false analogy. Obviously a longer password is better, because when picking passwords most people will use a limited character set of somewhere between 26 characters (lowercase letters) and 95 characters (printable ASCII characters). A seed phrase picks from a set of 2,048 possibilities, and will always have a maximum security of 128 bits, since this is the maximum security of any private key on the secp256k1 curve that bitcoin uses.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackBoss_",
      "created_time": "December 05, 2023, 10:41:30 AM",
      "body": "Quote from: Marvelman on December 04, 2023, 02:35:52 PMLet's say that instead of seed phrase we are talking about passwords. If you had to choose between a 12-character password and a 24-character password, which one do you think is more secure and \"stronger\"? It's kind of obvious, right?Please don't make OP confusing between words for a wallet seed phrase and characters for a password.A password is to protect that wallet file. Like the wallet file is here, you can see it but to access it, you must have a password. Access here means accessing private keys in that wallet file.You can lose your wallet password but you can still recover your wallet if you have the wallet seed phrase. If you lose the wallet seed phrase, very unfortunately, you are mostly done.For how to create a strong password, readGUIDE] How to Create a Strong/Secure PasswordAre your passwords in the green?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "robelneo",
      "created_time": "December 05, 2023, 02:57:39 PM",
      "body": "Quote from: FirmWars on December 04, 2023, 12:24:17 PMI don't know which is which, but I trust that keeping your recovery seed safe either 12 or 24 is the most important thing to do. Now what do you think that I am missing here right now? Anything at all? Which one would you prefer out of these two and why? Both are good but I prefer the 12-word, I have memorized one of my main wallet recovery seeds, besides keeping it in a safe place wallet, and it is easier to memorize the 12 words than the 24-word, the one thing that you should think about more than choosing 12 or 24 recovery seed is the security of your recovery seed, making sure that it is in a place where only you or loved one can access and not even fire or floods can destroy it, this is a big concern of all Bitcoin holders and you should take it as a concern too.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lamkuthang",
      "created_time": "December 05, 2023, 04:00:16 PM",
      "body": "Quote from: FirmWars on December 04, 2023, 12:24:17 PMI don't know which is which, but I trust that keeping your recovery seed safe either 12 or 24 is the most important thing to do. Choose what is most comfortable with you and take care of it well. For me, 12 is safe and 24 is quite safe again because there are lots of characters. But if you forget to save it, it's all the same.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}