{
  "id": "topic_5475054",
  "title": "flukyone",
  "author": "flukyone",
  "created_time": "November 22, 2023, 12:30:41 PM",
  "content": "FlukyOne stands out as a comprehensive online gaming hub, offering an exciting array of options. The online casino boasts a vast selection of games, ensuring endless entertainment. The sportsbook is a betting enthusiast's paradise, with competitive odds and a seamless interface. The live casino brings the thrill of real-time action to your screen, complete with professional dealers. Skill games add an extra layer of excitement for those seeking a strategic challenge. FlukyOne impresses with its user-friendly platform, secure transactions, and responsive customer support. With a winning combination of variety and reliability, FlukyOne is a top choice for gaming enthusiasts.Make a Deposit and Withdraw easily & fast with debit card and Crypto ( Bitcoin, Ethereum, Dogecoin, Tether USDT Erc20, Tether USDT Trc20, XRP and TRX this moment.This moment we have the following promotions :Welcome Slot Deposit Bonus 150% Up To 1500€Welcome Live Casino Bonus 100% Up To 200€Wednesday Slot Bonus 50% Up To 150€Daily Cashback 10%Join now with a click in https://flukyone.com",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5475054",
  "comments": [
    {
      "author": "Jawhead999",
      "created_time": "November 22, 2023, 12:55:42 PM",
      "body": "Welcome to the forum, the UI/UX looks really familiar. When I access your site, I thought your casino is under maintenance or underdevelopment because it's full of text. I think it's better to make it simple by mentioning the important keywords e.g. \"Over 1000 games\", \"150% Welcome bonus - up to 1500€\".After I scroll down, there's still a big space without anything, you can improve that and make the site looks more solid.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cantsay",
      "created_time": "November 22, 2023, 01:15:03 PMLast edit: November 22, 2023, 02:34:21 PM by Cantsay",
      "body": "Welcome to the forum.I just tried to go through your site to know how it works and on clicking on “terms and conditions” I was brought to this blank page. I currently do not know it’s just on my end or if it’s general. But if the latter is the case then you should hurry up and fix it. Because I won’t want a situation where I would sign up for something that I don’t know the ToS of, and if any issue should arise you could use it against me and make some edit there. Someone should please confirm if the error is just on my end alone. Edit: I have been able to access it, it turns out that it was just my network and not the site’s fault.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sunderland",
      "created_time": "November 22, 2023, 02:29:41 PM",
      "body": "Quote from: Cantsay on November 22, 2023, 01:15:03 PMWelcome to the forum.I just tried to go through your site to know how it works and on clicking on “terms and conditions” I was brought to this blank page. I currently do not know it’s just on my end or if it’s general. But if the latter is the case then you should hurry up and fix it. Because I won’t want a situation where I would sign up for something that I don’t know the ToS of, and if any issue should arise you could use it against me and make some edit there. - snip -Someone should please confirm if the error is just on my end alone. No issue for me here (desktop and mobile), the terms and condition loading properly.Perhaps check your connection or restart the phone? Btw this is a screenshot from my phone:- edit: FYI im using chrome browser -",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cantsay",
      "created_time": "November 22, 2023, 02:33:26 PM",
      "body": "Quote from: Sunderland on November 22, 2023, 02:29:41 PM~~I have been able to access it now, it seems like my network lagged at that point in time because when I went back to that page to recheck the ToS had already appeared, so I was supposed to come back here and add a little note and the bottom of my post to notify those that might have been interested in checking if it was a general error. Btw, thanks.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tbct_mt2",
      "created_time": "November 22, 2023, 02:49:27 PM",
      "body": "If you are a representative, owner of the casino, you can pay small fee to enable imagesIt's a Copper Membership that can be bought there https://bitcointalk.org/index.php?action=credit;promoteA simple step to wear it.Quote from: theymos on November 11, 2017, 06:01:16 AMOnce you have it, you get the choice:",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "seoincorporation",
      "created_time": "November 22, 2023, 03:26:34 PM",
      "body": "Is important to mention some of the terms and conditions on the site:Quote4. The minimum deposit per account is 10€ or its equivalent in any other currency. 5. All deposits must be wagered at least 3 times before a withdrawal can be requested. 7. Maximum withdrawal amount is 3.000 Euro /Usd per day. Why there is a minimum amount on the depo? if the min bet is $0.1 why users can't depo $5 and have fun?The x3 rollover on the deposit is just cruel, i understand a x1 wager to avoid money laundering, but an x3 is an excuse to make the users risk their money. Not cool.And the max withdrawal of $3k/day is a limit that will scare the high rollers. Quote9. All customers must always ensure that: - That they provide their true home address - That they register in their own name - That they provide their true email address - That they are providing their true home telephone and mobile telephone numbers - That they are not acting on behalf of or for the account of another person - That they will not deposit money derived from criminal activity - That they are not using their account to 'launder' money Looks like all users need to do KYC, which again, is not attractive for new users.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "robelneo",
      "created_time": "November 22, 2023, 03:36:41 PM",
      "body": "The platform is only four months old, and there is still a lot of improvement needed for it to call itself the Ultimate Online Casino Experience license certificate is very visible and can be verified which is good, I just noticed that there's a lag when accessing the site, like all the rest recommendation here if they want to create a good impact here get a copper for a start and create a well designed and professional looking announcement, your current look will not do.Looking forward to the representative being more active here.https://verification.curacao-egaming.com/validateview.aspx?domain=flukyone.comQuoteDomain Name: flukyone.comRegistry Domain ID: 2798895052_DOMAIN_COM-VRSNRegistrar WHOIS Server: whois.godaddy.comRegistrar URL: https://www.godaddy.comUpdated Date: 2023-07-17T08:28:21ZCreation Date: 2023-07-17T08:28:21ZRegistrar Registration Expiration Date: 2024-07-17T08:28:21Z",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "so98nn",
      "created_time": "November 22, 2023, 05:33:18 PM",
      "body": "The website looks a little bit lagging for me as well. A few sections are not opening properly. Sometimes it feels like a few blocks are blank and I have to refresh it many times before it displays. Is it associated with the laggy server that flukyone is using? I think you guys need a strong hosting service that will boost the performance of the entire casino. I mean it seems you have just launched it but still, with fewer users, it has started to lag. However, in the future let's say you get a higher number of users playing at the same time then it could crash. By the way, you should really create an interesting ANN for your casino. Better higher some talent from the forum itself who can create one for you. It will make it more appealing for forum users.  Good luck.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TimeTeller",
      "created_time": "November 22, 2023, 08:35:27 PM",
      "body": "Quote from: robelneo on November 22, 2023, 03:36:41 PMThe platform is only four months old, and there is still a lot of improvement needed for it to call itself the Ultimate Online Casino Experience license certificate is very visible and can be verified which is good, I just noticed that there's a lag when accessing the site, like all the rest recommendation here if they want to create a good impact here get a copper for a start and create a well designed and professional looking announcement, your current look will not do.Looking forward to the representative being more active here.--Let us appreciate the fact that even if their site is just 4 months old, they managed to get their license before launching here.There may be some features on the site that need improvement, but if they are serious in this business, they will address those.And as you said, it is too early to claim to be the ultimate online casino experience, but most casinos have their own claim on their name.So it is up to them how they will prove such claim in the years to come. By the way, people should take note of their kyc policy here.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Odusko",
      "created_time": "November 22, 2023, 08:56:50 PM",
      "body": "Welcome and nice to see another licensed casino getting launched and establishing a presence here in the forum, and most importantly getting launched at a time when there is high demand for new casinos since a lot of times, new casinos always have with lot of bonuses to build a customer base for themselves, and just like others have mentioned, ops need to pay for a copper member account and get things started in proper manners and ways to keep the ops updated and cleans with images and other content that will increase their visibility here in the gambling market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "acroman08",
      "created_time": "November 22, 2023, 10:09:09 PM",
      "body": "has anyone tried depositing on the gambling site using bitcoin or other cryptocurrency? I checked how their depositing works on cryptocurrency and it is a bit different from what I am used to. basically, if you want to deposit BTC you'll need to click the \"crypto\" payment method and pick how much you want to deposit, after you pick the amount and click the \"deposit\" you will be redirected to \"merchant.coxicard.com\", in there you will pick which cryptocurrency you want to deposit, the options were btc, doge, eth, usdt(erc20), usdt(trc20), xrp and trx, after picking which cryptocurrency you want and then clicking \"checkout\" you will then again be redirected to another website called \"pay.0xprocessing.com\" where they will ask you to \"Send BTC to the wallet address by copying it or scan the following QR code\". has anyone experienced this type of depositing method before using cryptocurrency?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lionheart78",
      "created_time": "November 22, 2023, 10:19:26 PM",
      "body": "Quote from: seoincorporation on November 22, 2023, 03:26:34 PMIs important to mention some of the terms and conditions on the site:Quote4. The minimum deposit per account is 10€ or its equivalent in any other currency. 5. All deposits must be wagered at least 3 times before a withdrawal can be requested. 7. Maximum withdrawal amount is 3.000 Euro /Usd per day. Why there is a minimum amount on the depo? if the min bet is $0.1 why users can't depo $5 and have fun?It is normal for some casinos to require a minimum deposit.  As far as I know other casino are also requiring for $10 minimum deposit.  We can just skip casinos that have high minimum deposit and choose the casinos that have our preferences.QuoteThe x3 rollover on the deposit is just cruel, i understand a x1 wager to avoid money laundering, but an x3 is an excuse to make the users risk their money. Not cool.True that, most of the casino I know only requires 1x wagering requirement, I hope Flukyone will take notice of the reply here and adjust their wagering requirement lower to compete with other casinos existing in this forum.QuoteAnd the max withdrawal of $3k/day is a limit that will scare the high rollers. Yeah that is the drawback of having limited fund, but at least this will ensure the casino to not get bankrupt instantly, probably they will remove this once they have established their service and have huge fund in their pool.Quote from: seoincorporation on November 22, 2023, 03:26:34 PMQuote9. All customers must always ensure that: - That they provide their true home address - That they register in their own name - That they provide their true email address - That they are providing their true home telephone and mobile telephone numbers - That they are not acting on behalf of or for the account of another person - That they will not deposit money derived from criminal activity - That they are not using their account to 'launder' money Looks like all users need to do KYC, which again, is not attractive for new users.  Well, there is nothing we can do since KYC is now the trend of new casinos.  I wonder if there is a mandatory KYC before one can play in their platform.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wiwo",
      "created_time": "November 22, 2023, 11:49:00 PM",
      "body": "Quote from: TimeTeller on November 22, 2023, 08:35:27 PMQuote from: robelneo on November 22, 2023, 03:36:41 PMThe platform is only four months old, and there is still a lot of improvement needed for it to call itself the Ultimate Online Casino Experience license certificate is very visible and can be verified which is good, I just noticed that there's a lag when accessing the site, like all the rest recommendation here if they want to create a good impact here get a copper for a start and create a well designed and professional looking announcement, your current look will not do.Looking forward to the representative being more active here.--Let us appreciate the fact that even if their site is just 4 months old, they managed to get their license before launching here.There may be some features on the site that need improvement, but if they are serious in this business, they will address those.And as you said, it is too early to claim to be the ultimate online casino experience, but most casinos have their own claim on their name.So it is up to them how they will prove such claim in the years to come. By the way, people should take note of their kyc policy here.Some times,  I kind of wonder what really the big deal for a casino to gain liciesed before launching? Is not like their are the first to take such steps anyways and still they won't be the last to get license ready before lunch and what matters most is the team's behaviour towards the players and what reputation they are willing and ready to build over time,  the license may be the last thing that attract gamblers,  since many will not even consider the casino it their be fully KYC at a go because many will rather want to play in a decentralized casino where they privacy will be of utmost concern for the casino and not licenses.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nwada001",
      "created_time": "November 22, 2023, 11:52:59 PM",
      "body": "Quote from: seoincorporation on November 22, 2023, 03:26:34 PMIs important to mention some of the terms and conditions on the site:Quote5. All deposits must be wagered at least 3 times before a withdrawal can be requested. 7. Maximum withdrawal amount is 3.000 Euro /Usd per day.  This is a fucked up T&C, and it's really going to mess most people up, as they might not even be able to see this before making a deposit. Why three times wager? 1 X is what we all know of and have been familiar with, and we have been good with that for some reputable casino in here; for a fresh casino, this does not really look good for them to start this way. On top of the above, the minimum daily withdrawal is also very small, which shows how small the casino payout budget is. There is a higher possibility that before wagering their deposit up to three times, they can either lose everything or double their deposit, which could amount to more than the maximum daily withdrawal. Op I think you guys should do some justice to some of your rules. If you need people to consider your casino, this is just my one piece of advice.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Quidat",
      "created_time": "November 22, 2023, 11:59:23 PM",
      "body": "Welcome into this forum FlukyOne.com!Just like on what that next post or comment made out by a member on which i do second the motion of it, tons of text and really needs up more furnishing to make it looks nice.Too much wasted space and it would rather be nice if you do put up some banners on top potion rather than on showing some long text.The thing i dont like on what i have searched.Consequences of Repeated Refusal If a player refuses to pass the KYC verification for a second time, the Casino reserves the right to take the following actions: 1. The player's account may be closed, and access to the Casino's services will be revoked.2. Any winnings, bonuses, or funds in the player's account may be confiscated and forfeited by the Casino. Source: https://flukyone.com/en/company/content/106",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sunsilk",
      "created_time": "November 23, 2023, 01:19:28 AM",
      "body": "Welcome to bitcointalk, flukyone! Honestly, the welcoming or landing page you have don't need to have a lot of words. Few to no gambler would like to read them before depositing. What's best is to just get straight to the point and the games that you're boasting.Your casino isn't so bad at all but I guess that you've got the same provider as the others because the design feels like that I've seen it before. And hopefully, you're not the same as the other thread starters of their casinos that just posts and never get to reply to the people here.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rodskee",
      "created_time": "November 23, 2023, 03:34:00 AM",
      "body": "Welcome FlukyOne.com , well it has been said that you should acquire Copper Member to have a great ANN sending here with Photos/pictures  and also you need to be active also .and also yes your KYC verification is mandatory? in this you will have small chance of luring players here .better to be slow in KYC or at least ask if the amount is too high to withdraw .Quote from: sunsilk on November 23, 2023, 01:19:28 AMWelcome to bitcointalk, flukyone! Honestly, the welcoming or landing page you have don't need to have a lot of words. Few to no gambler would like to read them before depositing. What's best is to just get straight to the point and the games that you're boasting.Your casino isn't so bad at all but I guess that you've got the same provider as the others because the design feels like that I've seen it before. And hopefully, you're not the same as the other thread starters of their casinos that just posts and never get to reply to the people here.actually it is annoying having those lot of words when they only tell how good their company is.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Helena Yu",
      "created_time": "November 23, 2023, 05:01:11 AM",
      "body": "Quote from: seoincorporation on November 22, 2023, 03:26:34 PMLooks like all users need to do KYC, which again, is not attractive for new users.  Some centralized sites are asking like this where they force you to use your real name and your main email address, definitely not friendly. They need to think as a customer's POV, how can he interested to gamble in an unknown casino that has a strict KYC rule, when there are many friendly trusted casino?Quote from: Quidat on November 22, 2023, 11:59:23 PMThe thing i dont like on what i have searched.Consequences of Repeated RefusalIsn't this is normal? you only have two options whether agree or disagree. If the gambler isn't want to complete their KYC for a long period of time, it's safe to assume they don't want to verify their account.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fivestar4everMVP",
      "created_time": "November 23, 2023, 08:20:42 AM",
      "body": "First, let me join others in welcoming fluckyone to this forum, I am always excited when new businesses are introduced to this forum.Anyways, I tried accessing the site, and to be honest, I think it's kind of really slow for me, and it's also causing my browser to lag, I don't know why but I guess is may be the load on the site is too heavy.I visited the site using my mobile phone, I will visit with my pc later when I am ready to sign up, and hopefully, the experience will be much better on pc than it is with my mobile phone.Once again, welcome to the forum, consider buying a copper membership so you can give users a better and much more professional ann, and also consider lunching a signature to promote your casino on the forum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}