{
  "id": "topic_5421207",
  "title": "Crypt0Gore",
  "author": "Crypt0Gore",
  "created_time": "November 16, 2022, 08:23:58 AM",
  "content": "Few decentralised trading exchanges like Posi and Serum are surging in price, it seems people are now moving their funds to start using decentralised exchanges, what's your take on this? Have centralised exchanges finally ruined their own reputation and people are tried of their games? I doubt this happened in the past when mt.gox faced the same fate, I really hope that's what happening presently. I hope it's finally over for centralised exchanges",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5421207",
  "comments": [
    {
      "author": "Rikafip",
      "created_time": "November 16, 2022, 08:37:51 AM",
      "body": "Quote from: Crypt0Gore on November 16, 2022, 08:23:58 AMFew decentralised trading exchanges like Posi and Serum are surging in price, it seems people are now moving their funds to start using decentralised exchanges, what's your take on this? Wasn't Ferum developed by FTX and got rekt bad by the recent happenings?Quote from: Crypt0Gore on November 16, 2022, 08:23:58 AMHave centralised exchanges finally ruined their own reputation and people are tried of their games? While its true that a lot of funds have been withdrawn from CEXes lately, soon all this will be forgotten and people will go back to their old habits, like they did in the past after MtGox fiasco. The important thing is to understand that every time you send money to CEX you can lose it, and if even after that people are still willing to use it, so be it. Quote from: Crypt0Gore on November 16, 2022, 08:23:58 AMI hope it's finally over for centralised exchanges Not gonna happen. They will be more regulated though and that's about it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "_act_",
      "created_time": "November 16, 2022, 08:46:12 AM",
      "body": "How are traders going to continue trading easily with short term and derivative trading? Those decentralized exchanges using smart contract are not also safe for traders which is the alternative they can go for, hackers can attack just like those DeFi, I will discourage people to use it. Trading on centralized exchanges are challenges for short term traders, but no yet alternative for centralized exchanges, but only your trading money should be left on the exchanges if using it to do the short term trading, but if not, move it to a noncustodial wallet and we should keep warning traders and other people about not being ones key, not ones coins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Aanuoluwatofunmi",
      "created_time": "November 16, 2022, 09:21:28 AM",
      "body": "Quote from: Crypt0Gore on November 16, 2022, 08:23:58 AMHave centralised exchanges finally ruined their own reputation and people are tried of their games? I doubt this happened in the past when mt.gox faced the same fate, I really hope that's what happening presently. I hope it's finally over for centralised exchanges It's now a turn by turn show and the ques to be asked is about who is next for hunt? https://twitter.com/Bitcoin/status/1590945438659923968?t=uo6g5Ald20uFa4PWPxlGMQ&s=19",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Z-tight",
      "created_time": "November 16, 2022, 09:41:20 AM",
      "body": "Quote from: Crypt0Gore on November 16, 2022, 08:23:58 AMI hope it's finally over for centralised exchanges It is not, the people who had their money in FTX before the collapse happened believed their money was safe there, FTX was one of the biggest crypto exchange, and they felt they had nothing to worry about, that is the same feeling people who currently have their money in Binance and other large crypto exchanges have right now, people are never going to leave centralized exchanges. Do not be too concerned about how other people want to keep their funds, just make sure yours isn't in any online account and leave people to make their own mind up on the warning going around, you can't force them into doing what's right.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cointxz",
      "created_time": "November 16, 2022, 09:52:17 AM",
      "body": "Quote from: Crypt0Gore on November 16, 2022, 08:23:58 AMI hope it's finally over for centralised exchanges Nahh. This will never gonna happened since centralized exchange is the only way which government will allow crypto to trade legally. There is no such thing as DEX if there is no CEX that’s being regulated. View centralized exchange as barrier from regulator since there eyes is more focus on CEX insteadof DEX.Do you think regulators will alow traders freely trading without being taxed/regulated? I believe what will happened nextwas regulators will be more stricter on CEX and probably will add law for protection of consumer. Finger crossed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "November 16, 2022, 09:55:46 AM",
      "body": "Quote from: Crypt0Gore on November 16, 2022, 08:23:58 AMI hope it's finally over for centralised exchanges Even if you hope surely they will just increase. Its always good to use decentralized but the government are more in favor of cex and some people likes the convenient of it since they dont have some knowledge on dexes.There are lots of news about cex going down and there will be more fear but as time passes by, you could see that the news will eventually slow down and not gonna materialize and will go back to normal routine.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Crypt0Gore",
      "created_time": "November 16, 2022, 09:56:21 AM",
      "body": "Quote from: Z-tight on November 16, 2022, 09:41:20 AMQuote from: Crypt0Gore on November 16, 2022, 08:23:58 AMI hope it's finally over for centralised exchanges It is not, the people who had their money in FTX before the collapse happened believed their money was safe there, FTX was one of the biggest crypto exchange, and they felt they had nothing to worry about, that is the same feeling people who currently have their money in Binance and other large crypto exchanges have right now, people are never going to leave centralized exchanges. Do not be too concerned about how other people want to keep their funds, just make sure yours isn't in any online account and leave people to make their own mind up on the warning going around, you can't force them into doing what's right.Then they should enjoy getting rekt when they least expected.With decentralised exchange you don't have to send your coins into a wallet that doesn't belong to you, nothing beats trading from your very own wallet.If people are smart this FTX scam should be the last one EVER but I guess that's not going to happen, just like you said and there is no point feeling sorry for them if they lose their money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fullcoinese",
      "created_time": "November 16, 2022, 10:08:51 AM",
      "body": "Quote from: Crypt0Gore on November 16, 2022, 08:23:58 AMI hope it's finally over for centralised exchanges such a mindset would probably only be up and running in a short amount of time. some traders may be traumatized by what happened to FTX. but it won't make the trader leave CEX. it deals with crypto exchange platforms that are regulated by the government of a country. where do they get the taxes for this business? while setting up a DEX, it's going to be very difficult to get government control. and this can also be related to regulation and lead to a ban on the crypto industry.CEX still has power today.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OmegaStarScream",
      "created_time": "November 16, 2022, 10:13:17 AM",
      "body": "I wouldn't say it's over, but people seem to be finally waking up. I remember seeing people getting downvoted to oblivion on Reddit whenever they discouraged the use of services like Celsius and Voyager and now that's all you see. It's also showing on the charts[1][2][1] https://www.coindesk.com/business/2022/11/14/binance-users-withdrew-135b-of-bitcoin-in-days-following-ftx-collapse/[2] https://www.thenewsminute.com/article/bitcoin-btc-moves-exchanges-it-good-sign-169925",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Solosanz",
      "created_time": "November 16, 2022, 10:29:46 AM",
      "body": "What the fuck is POSI and SERUM shitcoins that claim to be a dEcENtrAlIZed ExChANGe while the coins is centralized since they're track through IP address and have staking feature which lock into centralized pools. Those aren't a real decentralized exchanges! the truly decentralized exchange is only Bisq, this exchange has a Tor network and there's no such staking option, also the coins isn't stored on their hot wallet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "November 16, 2022, 10:32:11 AM",
      "body": "The title suggests that cex are a bad thing and dex can just replace them. But in reality,  Dex cannot replace cex, because they have different use cases.Dex are basically for crypto x crypto conversions. It is amazing to get stablecoins ,which are centralized. However, you cannot transfer fiat in a dex without trust. Cex are safer for higher volumes,  or when you need the money fast. Good cex allow you to convert bitcoin to fiat and have the fiat in your bank account is just a few minutes.For volumes such as 10-30 k usd and higher, would you just sent it to a third party you don't know  or a good cex ?The problem is that most people ignore the risks in keeping your funds in an exchange. Most of them keep their cryptocurrencies in cex to get 4-5% yield per year, which is ridiculous.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ryker1",
      "created_time": "November 16, 2022, 12:05:55 PM",
      "body": "Quote from: bitmover on November 16, 2022, 10:32:11 AM[snip]Cex are safer for higher volumes,  or when you need the money fast. Good cex allow you to convert bitcoin to fiat and have the fiat in your bank account is just a few minutes.For volumes such as 10-30 k usd and higher, would you just sent it to a third party you don't know  or a good cex ?Perhaps in a popular cex but in an unknown cex, we are always doubtful.This is the advantage of the cex that dex was not had --it is the [Volume or High Liquidity]. People always looking for a quick profit that seems like gambling their money in trading, that is what they want.I am sure besides this recently happened on FTX and binance people will still using popular cex like binance. My question is --is it possible that dex will increase the volume?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "notocactus",
      "created_time": "November 16, 2022, 02:34:29 PM",
      "body": "Quote from: Crypt0Gore on November 16, 2022, 08:23:58 AMFew decentralised trading exchanges like Posi and Serum are surging in price, it seems people are now moving their funds to start using decentralised exchanges, what's your take on this? It is a hype on decentralized exchanges during this chaos but things must be noted. Decentralized exchanges we have now are not truly decentralized and people are getting hyped on DEX without that awareness.QuoteHave centralised exchanges finally ruined their own reputation and people are tried of their games? I doubt this happened in the past when mt.gox faced the same fate, I really hope that's what happening presently. I hope it's finally over for centralised exchanges It's not an ending for CEX. The story and fighting between CEX and DEX is like between fiat currency and cryptocurrency. They will both survive and exist together and they are supplements for the another to be improved and grew up.If you like Bitcoin, you will say Bitcoin will replace fiat currency in future, but it is not true. The opposite if you are fiat currency supporter, you will say Bitcoin will die in future. Same support and opposition for CEX and DEX.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "aysg76",
      "created_time": "November 16, 2022, 02:46:32 PM",
      "body": "If you are saying that people will now take off their funds from CEX then you are probably wrong because that's not going to happen anytime soon as you will see Binance is leading exchange with billion of dollars volume and people are not withdrawing funds from there and they would not have done it from FTX also it was just they got bankrupt due to their own mistakes.What actually I am trying to say is people get aware or panicked for some time but has CEX dead from a long time? We still see lot of users there and it will keep happening unless they realise how risky it is and now we also have announcement from @theymos also but how many take care to read it with understanding and not leave their funds on these exchange? So you see we will still see CEX around the market with these people.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dkbit98",
      "created_time": "November 16, 2022, 03:52:08 PM",
      "body": "Quote from: Crypt0Gore on November 16, 2022, 08:23:58 AMFew decentralised trading exchanges like Posi and Serum are surging in price, it seems people are now moving their funds to start using decentralised exchanges, what's your take on this? This crap has nothing to do with decentralized exchanges, it only has DEX sticker and it's most likely connected with scammers like Sam Bankaman.Nothing that is built on most altcoin blockchains is not really decentralized, because all nodes are operated by few people, and blocks are OFAC compliant that is supporting censorship, like in case with ethereum.One and only real dex exchange I know is called Bisq, but you can also use other p2p platforms for trading.Some people are working on Lightning Network exchanges and I hope this will get more attention now.Quote from: Crypt0Gore on November 16, 2022, 08:23:58 AMI hope it's finally over for centralised exchanges Oh this circus show is far from over, and it's just getting started for this cex exchanges.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PrivacyG",
      "created_time": "November 16, 2022, 06:48:05 PM",
      "body": "Sadly, not the case.  CEX's will continue to exist for at least a few reasons.  The many big Exchanges falling off ever since Mt Gox have decided this by now.  It is not a reason for users to start avoiding the Centralized.Show me a DEX that is as easy to sign up for, use and trade as Binance is.  There is none, I can ensure you.  And I mean actual DEX's such as Bisq, not these Centralized Exchanges calling themselves Decentralized.Long as there will be daytrading and traders choosing money and profits over whatever a DEX offers as advantage, there will be CEX's.  Bisq has evolved a LOT in the past few years yet I still do not think asking a Crypto newbie to learn using it it is an easy task.  It is what it is.  We have a long way to go before we can even consider this a possibility.  Truth is, almost everyone wants to trade instantly and without much of a hassle, straight off their phones.-Regards,PrivacyG",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nakamura12",
      "created_time": "November 16, 2022, 07:05:44 PM",
      "body": "It seems you are against CEX. I don't think that It's the end of CEX. You could say that it's CEX disadvantage right now due to attack but what if its DEX got attack or having problem then, wouldn't people use CEX if that's the case?. It's up to them where they put their funds either if it is cex or dex to do what they must do. Do you think that there won't be new CEX if ever a big cex is shutdown or file for bankruptcy?. As far as I can tell, those cex having trouble will be solved later on. Don't underestimate the battle between CEX and DEX. It is much alike the discussion about ETH taking over BTC (to be the next number 1 Crypto).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "decodx",
      "created_time": "November 16, 2022, 07:19:20 PM",
      "body": "Sorry to say this but I don't think exchanges are really in a danger of collapsing as well. You see, professional traders use exchanges, miners use exchanges and even casual users like me use some exchanges. I have several wallets, but since I'm not a big holder so used to keep some of my funds on Binance. But it was an eye opener for me when I saw what the FTX exchange was doing with the money. They were using it to make money on their own! I'm not sure if this is legal or not but it's certainly not ethical. I'm sure there are other exchanges out there doing the same thing.I have always traded on Binance and was never really worried about my funds, but this event has made me change my mind. The first thing that occurred to me was how easy it was to lose everything! This is why I advise new traders to start small and keep their funds safe until they learn how the game works. Don't put all your eggs in one basket and never leave funds on an exchange that you don't use for trading.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "salad daging",
      "created_time": "November 16, 2022, 07:30:49 PM",
      "body": "It won't end centralized exchanges will still have a lot of interest than DEX even though we know about the collapse of FTX but for me it doesn't make them switch to DEX just out of doubt limit.As mentioned, CEX is higher than trading volume, we can exchange it to fiat and make withdrawals at any time, while DEX does not make more use of CEX, so for me CEX will not end because it has its own regulation compared to DEX.I don't like trading on DEX even though it's safe there because we use our own wallet but we ourselves know how DEX cases that happen a lot have the same chance of being hacked.CEX will be their trading place, but if to save a long time I don't do that at CEX.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}