{
  "id": "topic_5398353",
  "title": "koiora",
  "author": "koiora",
  "created_time": "May 12, 2022, 05:46:22 PM",
  "content": "Hello Everyone,After so many years do you think  the lottery game freebitco.in  is a scam?On bitcointalk forum in 2017 people were saying no but in 2022 ?i m sorry, i just saw i put it in the wrong topic",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5398353",
  "comments": [
    {
      "author": "_BlackStar",
      "created_time": "May 12, 2022, 05:58:38 PM",
      "body": "First, move your topic to: Scam AccusationsSecond, complete valid evidence when you want to make scam Accusations against any service on this forum. You didn't come here just to say this and that is scam without evidence, because when accusations are made then something must have cost you or someone else financially and you have to prove it. So, do you feel cheated or are you asking if someone has been scammed by the service during 2022?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "koiora",
      "created_time": "May 12, 2022, 06:05:59 PM",
      "body": "I m a newbie in crypto world. And i discovered this website but i do no manage to know if it is worth to play or not",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "_BlackStar",
      "created_time": "May 12, 2022, 06:40:53 PM",
      "body": "Quote from: koiora on May 12, 2022, 06:05:59 PMI m a newbie in crypto world. And i discovered this website but i do no manage to know if it is worth to play or notThen why don't you try it first before you say that the service is a scam?I've seen a lot of users promote the site through signature campaign during this time on the forum. They seem to pay without issue for all their participants, maybe the site has a good reputation but you still need to do some testing to prove it. Do your test for the amount of money you can afford to lose.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "koiora",
      "created_time": "May 12, 2022, 06:48:05 PM",
      "body": "Quote from: _BlackStar on May 12, 2022, 06:40:53 PMQuote from: koiora on May 12, 2022, 06:05:59 PMI m a newbie in crypto world. And i discovered this website but i do no manage to know if it is worth to play or notThen why don't you try it first before you say that the service is a scam?I've seen a lot of users promote the site through signature campaign during this time on the forum. They seem to pay without issue for all their participants, maybe the site has a good reputation but you still need to do some testing to prove it. Do your test for the amount of money you can afford to lose.English is not my mother tongue.I just wanted to ask  a question",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "acroman08",
      "created_time": "May 12, 2022, 07:25:48 PM",
      "body": "probably not, because if they are, people would start complaining about their website. also, although I haven't seen someone post that they won on their lottery(and if there are I hope someone posts it here), there is a thread about their hourly faucet and there are people posting that they won from it. here's the link to the thread that I am talking about Big wins at FreeBitco.in",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yogee",
      "created_time": "May 12, 2022, 09:37:00 PM",
      "body": "Quote from: koiora on May 12, 2022, 05:46:22 PM... After so many years do you think  the lottery game freebitco.in  is a scam?On bitcointalk forum in 2017 people were saying no but in 2022 ?What do you think is wrong with their lottery system? Do have any problem how the winning numbers are selected? I have not read issues against it other than the obvious that it's hard to win it. You should probably focus your attention on their actual games if you plan to play here. Their lottery is just a bonus feature.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BayAreaCoins",
      "created_time": "May 12, 2022, 09:47:01 PM",
      "body": "Math please",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PX-Z",
      "created_time": "May 12, 2022, 10:54:54 PM",
      "body": "You know what, once a platform is known as a scam, have shady behaviour, people will boycot it no matter what industries they are in. Rights of players/users is more viable on this forum. Putting red tags, flag that can hurt the websites reputation once proven.Freebitco run so many years already, although issues are unavoidable but most of them were solved already, and the site is still running, so asking if they are scam, it's NOT.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TimeTeller",
      "created_time": "May 12, 2022, 10:58:52 PM",
      "body": "Quote from: PX-Z on May 12, 2022, 10:54:54 PMYou know what, once a platform is known as a scam, have shady behaviour, people will boycot it no matter what industries they are in. Rights of players/users is more viable on this forum. Putting red tags, flag that can hurt the websites reputation once proven.Freebitco run so many years already, although issues are unavoidable but most of them were solved already, and the site is still running, so asking if they are scam, it's NOT. The OP has no valid evidence if the lottery in freebitco is a scam or not.Maybe only a hearsay or doubt, whatever it is, he/she should have done the research first.Also, if the OP wants this to be formal complaint, he/she can follow the scam report format -https://bitcointalk.org/index.php?topic=260073.0Anyway, freebitco has been here for years already, and actually generous to its users giving free satoshis and other promos.So don't know where the OP is coming from, but maybe one is the results of the lottery???",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Taskford",
      "created_time": "May 13, 2022, 10:34:26 AM",
      "body": "Quote from: koiora on May 12, 2022, 05:46:22 PMHello Everyone,After so many years do you think  the lottery game freebitco.in  is a scam?On bitcointalk forum in 2017 people were saying no but in 2022 ?i m sorry, i just saw i put it in the wrong topicYour question is simple to answer and that is No, We answer in this manner because there's no solid evidence of people getting in trouble for using them and for what we see freebitco.in is doing a good run also having good support, so maybe if you want to ask something related to their casino better if you ask the support so that you can get an answer legitimately coming from them. Also if you have a problem with them post some evidence and let the people decide whether your claim is valid or not.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mahdirakib",
      "created_time": "May 14, 2022, 08:37:37 PM",
      "body": "Quote from: koiora on May 12, 2022, 05:46:22 PMAfter so many years do you think  the lottery game freebitco.in  is a scam?Freebitco lottery draw is provably fair. They publish the lottery data on their twitter account in every week. And the details of the lottery draw system is available at their site. Try to verify them each week. Then post the proof here if you find anything wrong. Seems like you have some doubts about their lottery draw system. This thread doesn't meet any requirement to stay in ‘scam accusations’ section. I have an account at freebitco since 2017, and I had lottery tickets in almost every round. But I haven't won prizes from their lottery draw yet. It doesn't mean their lottery is scam or freebitco is scam. They have huge number of active users, so the probability is very low to win prizes. Recently I haven't seen anyone to mention that he has won prizes from freebitco lottery. However, I had found 4 lottery winners here in the forum and I have posted about it in this topic.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ScamViruS",
      "created_time": "May 14, 2022, 11:47:46 PM",
      "body": "Quote from: koiora on May 12, 2022, 06:05:59 PMI m a newbie in crypto world. And i discovered this website but i do no manage to know if it is worth to play or not When you do not have any valid proof that this website is a scam then such posting is baseless. This website has been in the market for a long time and they want to continue their website but no such report has been received or seen in this forum yet. If you want to run a casino, you have to face many problems and you have to solve them, Freebitcoin solves those problems. So if you have any more proofs that could prove this website to be a scam, present all here.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Stalker22",
      "created_time": "May 15, 2022, 03:11:10 PM",
      "body": "Quote from: koiora on May 12, 2022, 06:48:05 PMI just wanted to ask  a questionNo matter of your motives, I am saying it is wrong.The point is, if you already want to accuse, or even suspect, someone of scam you better have valid evidence or at least know your facts. As far as I know, the freebitco.in lottery has a provably fair mechanism to determine the winner. Is there any reason to doubt this?By the way, you could have formulated your question differently. The question you ask may be really unfair as it assumes that there is a scam. This is not a good way to start a discussion.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Slow death",
      "created_time": "May 15, 2022, 08:04:43 PM",
      "body": "Name: koioraPosts: 3Activity: 3Merit: 0Position: NewbieDate Registered: May 11, 2022, 10:55:30 PMLast Active: May 14, 2022, 08:08:27 AMIt's very strange that you asked this question and you didn't go to the freebitco.in thread to ask that question, I will give you the following advice.1 - go to their thread:  FreeBitco.in-$200 FreeBTC⭐Win Lambo🔥0.2BTC DailyJackpot🏆$32,500 Wager Contest2 - ask these questions, read the previous posts that are in their thread and with that you will have enough data to draw your own conclusions from the questions you have",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JeromeTash",
      "created_time": "May 15, 2022, 09:34:04 PM",
      "body": "Quote from: koiora on May 12, 2022, 06:05:59 PMI m a newbie in crypto world. And i discovered this website but i do no manage to know if it is worth to play or not They are not scammers. If they were, being one of those old bitcoin related gambling/faucet site (I think it must be close to 10 years now) you would see so many scam accusations about them.A few accusations pop up, but they have been able to handle them accordingly.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Erdogan",
      "created_time": "May 15, 2022, 09:40:52 PM",
      "body": "Quote from: koiora on May 12, 2022, 06:05:59 PMI m a newbie in crypto world. And i discovered this website but i do no manage to know if it is worth to play or not There will always be unsatisfied users, as on every website and in every gambling platform. However, the overall opinion about freebitco.in is quite positive, so in my opinion you shouldn't worry. However, as always with money in the internet, be very careful and double-check everything.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}