{
  "id": "topic_5470133",
  "title": "taufik123",
  "author": "taufik123",
  "created_time": "October 13, 2023, 12:17:53 AMLast edit: October 13, 2023, 05:23:06 AM by taufik123",
  "content": "Recently received news about the Bitcoin Lightning Network which experienced quite rapid growth in 2023 with a growth of 1212% in the last 2 years. Bitcoin financial service River Financial reported on the growth of the Lightning Network, from 503.115 transactions routed now soaring to 6.599.553 transactions in August 2023. Sam Wouters, River's research analyst said the figure was \"surprising\" due to the drop in Bitcoin (BTC) price and loss of interest in online searches.The report revealed that Bitcoin's price has fallen by 44%, while online searches for the top cryptocurrency have fallen by 45% since then, yet Lightning Network continues to grow.The research analyst highlighted that Lightning Network has achieved a lot despite the market downturn and only having 5,000 BTC locked on the network. Source:https://cointelegraph.com/news/bitcoin-lightning-network-growth-surges-over-two-yearshttps://x.com/SDWouters/status/1711758161042866231?s=20",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5470133",
  "comments": [
    {
      "author": "Upgrade00",
      "created_time": "October 13, 2023, 03:35:34 AM",
      "body": "Some people use a decimal point '.' to represent a thousandth place, but it is not so common and you cannot use that for sums like percentage AFAIK.Readers see 1% and what comes after the decimal place, but the real figure is 1,212% as can be seen on the image you shared.That said, the growth of the LN is massive and shows promise that it can take huge load off on chain transactions in the future to keep fees at a reasonable amount.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "albert0bsd",
      "created_time": "October 13, 2023, 03:43:28 AM",
      "body": "Quote from: Upgrade00 on October 13, 2023, 03:35:34 AMReaders see 1% and what comes after the decimal place, but the real figure is 1,212% as can be seen on the image you shared.I am one of those, but when i see the graph i undertand that the OP is using dot for thousand seperator instead of comma. AnywayVery impresive the growth of the Lightning Network, i would like to participate on it, but in my city there is no bussines that accept bitcoin, even less LN.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "adaseb",
      "created_time": "October 13, 2023, 04:45:52 AM",
      "body": "Yeah I also read the 1% and I assumed this would of been a negative article towards lightning network. No idea why some countries use . Instead of the , symbol to mean it’s a number in the thousands or millions. I think the reason why the usage is up is due to the higher fees and the fact that many exchanges finally added lightning network. Years ago almost no exchanged used it because fees went down and it wasn’t really needed at the time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FinneysTrueVision",
      "created_time": "October 13, 2023, 05:22:25 AM",
      "body": "This growth in transactions could have to do with there being more things to do on Lightning. I don't know if the growth in users is as impressive as the transaction count increase. Nostr is an interesting protocol that has attracted many developers to create Lightning focused apps. There are also several play to earn games and apps that let you earn some sats and withdraw through Lightning. There is still many improvements needed for users to have a better experience but it is certainly promising to see a huge growth in activity.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Helena Yu",
      "created_time": "October 13, 2023, 05:22:50 AM",
      "body": "In general it looks like there's a huge adoption toward lightning network because the total transaction increase really high. But if we look at the total channels, it's not really increase as high as the total transactions. So it seems only small a group are use lightning network, which I think it's a centralized exchange and centralized wallet that integrated with lightning network, where the user only need to use it without need to open a new channel.Pretty much like people who use and hold Bitcoin in CEX.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "davis196",
      "created_time": "October 13, 2023, 05:38:29 AM",
      "body": "QuoteSam Wouters, River's research analyst said the figure was \"surprising\" due to the drop in Bitcoin (BTC) price and loss of interest in online searches.The report revealed that Bitcoin's price has fallen by 44%, while online searches for the top cryptocurrency have fallen by 45% since then, yet Lightning Network continues to grow.The research analyst highlighted that Lightning Network has achieved a lot despite the market downturn and only having 5,000 BTC locked on the network.Is there supposed to be a correlation between LN's growth and the Bitcoin price growth? I don't know why Sam Wouters is searching for such correlation. LN is supposed to be growing in times of high transaction fees, when the BTC blockchain is congested. There was such time frame(due to the Bitcoin Ordinals, I guess). The Bitcoin price and the online searches about BTC has little to do with this.5000 BTC being locked in the Lighting Network proves that there's no actual growth of LN. It's just a bunch of channels inside LN, that are transacting more often between each other.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "taufik123",
      "created_time": "October 13, 2023, 06:30:15 AM",
      "body": "Due to some debate about the decimal point \".\", I chose to remove it.So that it would be clearer that it is thousands according to the graphical increment in the image that I have included.Quote from: Upgrade00 on October 13, 2023, 03:35:34 AMThat said, the growth of the LN is massive and shows promise that it can take huge load off on chain transactions in the future to keep fees at a reasonable amount.Lightning network transaction fees are cheaper and transactions are also faster. There are many adoptions made with Bitcoin's Lightning network for several payments for credit purchases, vouchers, and other payments.Quote from: albert0bsd on October 13, 2023, 03:43:28 AMVery impresive the growth of the Lightning Network, i would like to participate on it, but in my city there is no bussines that accept bitcoin, even less LN.If regulation becomes an obstacle it is already a rule that cannot be changed.My country also does not allow Bitcoin as a payment transaction, but I can buy Bitcoin in Rupiah currency with a ATM Bitcoin Mainan made by local people in my country.You can visit it at this link. https://btcln.app/and I also discussed about this ATM Bitcoin Mainanhttps://bitcointalk.org/index.php?topic=5404778.0Quote from: adaseb on October 13, 2023, 04:45:52 AMI think the reason why the usage is up is due to the higher fees and the fact that many exchanges finally added lightning network. Years ago almost no exchanged used it because fees went down and it wasn’t really needed at the time.Yes, that's one of them, many exchanges have added Lightning Network Bitcoin, especially Binance, which makes transactions increase due to cheaper and more efficient fees.List of Exchanges that Support Lightning Network.https://github.com/theDavidCoen/LightningExchangesQuote from: FinneysTrueVision on October 13, 2023, 05:22:25 AM-snip- There are also several play to earn games and apps that let you earn some sats and withdraw through Lightning. There is still many improvements needed for users to have a better experience but it is certainly promising to see a huge growth in activity.Lightning Network is developed in various sectors, one of which is like a game that allows users to get Sats in every game. Thanks to the Lightning network it can be done with fairly minimal transactions and this will be the future of Bitcoin layer 2 adoption. There needs to be a lot more development for the Lightning Network.Quote from: Helena Yu on October 13, 2023, 05:22:50 AMIn general it looks like there's a huge adoption toward lightning network because the total transaction increase really high. But if we look at the total channels, it's not really increase as high as the total transactions. So it seems only small a group are use lightning network, which I think it's a centralized exchange and centralized wallet that integrated with lightning network, where the user only need to use it without need to open a new channel.It is uneven, indeed after several large exchanges such as Binance began to support the Lightning network, there was a significant increase in transactions. and Coinbase also plans to integrate the Lightning Network, after Brian Armstrong CEO of Coinbase said \"Lightning is great and something we'll integrate\"https://twitter.com/brian_armstrong/status/1644794656570617856Quote from: davis196 on October 13, 2023, 05:38:29 AMIs there supposed to be a correlation between LN's growth and the Bitcoin price growth? I don't know why Sam Wouters is searching for such correlation. LN is supposed to be growing in times of high transaction fees, when the BTC blockchain is congested. There was such time frame(due to the Bitcoin Ordinals, I guess). The Bitcoin price and the online searches about BTC has little to do with this.5000 BTC being locked in the Lighting Network proves that there's no actual growth of LN. It's just a bunch of channels inside LN, that are transacting more often between each other.I don't have an opinion on it, but Bitcoin Ordinal is indeed the cause of the surge in transactions that are getting denser, and because of that people are starting to use the Lightning Network so as not to get stuck on Bitcoin transactions with fees that are also quite expensive. It also makes the big exchanges want to support the lightning network.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "October 13, 2023, 06:31:02 AM",
      "body": "Quote from: taufik123 on October 13, 2023, 12:17:53 AMSam Wouters, River's research analyst said the figure was \"surprising\" due to the drop in Bitcoin (BTC) price and loss of interest in online searches.The report revealed that Bitcoin's price has fallen by 44%, while online searches for the top cryptocurrency have fallen by 45% since then, yet Lightning Network continues to grow.There is a good lesson in this statement that one can not speculate on bitcoin price and adoption based on the drop from the ATH and the number of searches in search engines. The real adoption takes place in terms of usage of bitcoin, number of transactions both on-chain and on second layer, number of merchants that start accepting bitcoin, etc.This significant growth in usage of Lightning Network is a clear indication of how bitcoin adoption has been increasing non-stop.It also indicates how bitcoin current price is below its intrinsic value which makes the market state a manipulated one.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kakmakr",
      "created_time": "October 13, 2023, 06:34:01 AM",
      "body": "Well, it can be one of several things...Lightning Network transactions are very cheap, compared to normal transactions on the Blockchain.... so people see this as a viable alternative to traditional payment options and they are actually using it as a currency... ORThe transactions are cheap and someone are \"cooking\" the statistics by making MANY transactions to distort the real picture. I hope this is \"real\" world use and not some hidden agenda that are being pushed, by the people who wants to boost the LN technology.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MusaMohamed",
      "created_time": "October 13, 2023, 07:13:48 AM",
      "body": "Number of open channels drops but sum of channel values increases a lot after a deep fall since July.https://txstats.com/d/000000012/lightning-network?orgId=1&from=now-6y&to=nowtxstats.com (the announcement) is a product with cooperation between BitMEX and Coinmetrics.com. You can customize time range to see some stats for Lightning Network.Their guide for time range control.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "moneystery",
      "created_time": "October 13, 2023, 07:20:31 AM",
      "body": "Quote from: pooya87 on October 13, 2023, 06:31:02 AMThere is a good lesson in this statement that one can not speculate on bitcoin price and adoption based on the drop from the ATH and the number of searches in search engines. The real adoption takes place in terms of usage of bitcoin, number of transactions both on-chain and on second layer, number of merchants that start accepting bitcoin, etc....i agree that speculation on bitcoin is not only based on bitcoin ATH, online searches, etc. direct adoption by people, number of transactions, applications on online platforms, etc., are the most important factors to look at.the increasing growth of the bitcoin lightning network in the last 2 years could indicate that the growth of bitcoin adoption is increasing. even though there are some who say that this growth is only transactions between channels on the network, i think it's not only that, there are definitely transactions from ordinary users that are increasing and this should be welcomed positively.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Plaguedeath",
      "created_time": "October 13, 2023, 02:21:49 PM",
      "body": "Quote from: moneystery on October 13, 2023, 07:20:31 AMthe increasing growth of the bitcoin lightning network in the last 2 years could indicate that the growth of bitcoin adoption is increasing. even though there are some who say that this growth is only transactions between channels on the network, i think it's not only that, there are definitely transactions from ordinary users that are increasing and this should be welcomed positively.But the question is why people now adopt lightning network? remember lightning network is cheaper than on chain network in terms of transaction numbers, since open a new channel need fees. So it should be a businessman are adopting lightning network.I doubt Bitcoin holders are adopting lightning network when they still treat Bitcoin is an investment which they're not regularly spend their coins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "philipma1957",
      "created_time": "October 13, 2023, 02:38:26 PMLast edit: October 13, 2023, 02:51:44 PM by philipma1957",
      "body": "I was posting with the largest LN node owner.And with 17 btc staked off which 8 was his He earns 80 bucks a month.  What this means is exchanges may be doing it to save money but it is not a real solution for fees being too small for miners in 2056.Here is my conversation with him and frankly his earnings are disappointing to say the least.They clearly show that we are heading for a mining collapse in or about 2056Quote from: philipma1957 on October 11, 2023, 02:01:30 PMQuote from: Krubster on October 08, 2023, 06:37:38 PMQuote from: philipma1957 on October 07, 2023, 11:40:49 PMQuote from: Krubster on October 07, 2023, 10:44:00 PMWhat's up WO folks.I haven't frequent this corner of the internet for quite some time. The spamming of ChartBuddy sure doesn't help. He need to shut up...I fricking did it though, amboss.space rank my lightning node as #1The node has a total capacity of ~17 BTC, and is routing on average 0.5 BTC per day. Happy routing!What kind of earning do you get with that size?And how much of your coin stays in the pot?I am curious 👀 because I want to get an ides how easy it will be for bitcoin to scale rewards down the road.The earnings are ridiculously low, considering the btc I stake. I did try to maximize my earnings for a while. By that, I provided liquidity to the LOOP channel, which provides a lightning/on-chain swap service at a very favorable fee for the node who open to them. In order to do that, I constantly have to open a channel with LOOP, since they close the channel once it's drained on their side. This activity would quickly make me run out of inbound liquidity unless I can get lightning to on-chain btc at a cheaper price than LOOP. For that I used Nicehash and Kraken. The increased activity with Kraken got me audited though. They questioned me about the source of funds, even though I've been a customer of theirs for close to a decade.During this time, my earnings was close to 300k sats ($80) per month. Now, after I've stopped this aggressive channel opening with LOOP, it's closer to 100k sats ($27) per month. 6-8 months more at this rate and my hardware investment will pay off.My node is fairly balanced, so out of the 17 BTC capacity it has, 8 BTC or so is provided by me. So, like I said, the earnings are ridiculously low. It's self-hosted though. I don't need to trust my funds with any 3rd part.Thank you for the service you are offering to others as you provide liquidity to many..But fuck $80 in coin when you have $216,000 staked so to speak is brutal.And the $80 earned was when you were aggressive.Only $27 earned when mellow.I was hoping you were going to say better numbers.P.S. sorry I missed your reply.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Upgrade00",
      "created_time": "October 13, 2023, 04:36:11 PM",
      "body": "Quote from: Plaguedeath on October 13, 2023, 02:21:49 PMBut the question is why people now adopt lightning network? For cheaper and faster transactions.Quote from: Plaguedeath on October 13, 2023, 02:21:49 PMremember lightning network is cheaper than on chain network in terms of transaction numbers, since open a new channel need fees. So it should be a businessman are adopting lightning network.Lightening network is not a payment processor which is limited to businesses accepting Bitcoin. It is an off chain alternative to high fees for smaller transactions. On average Bitcoin has hundreds of thousands of transactions daily, many of which can be routed through LN.Quote from: Plaguedeath on October 13, 2023, 02:21:49 PMI doubt Bitcoin holders are adopting lightning network when they still treat Bitcoin is an investment which they're not regularly spend their coins.Bitcoin holders use LN too.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hatshepsut93",
      "created_time": "October 13, 2023, 05:39:48 PM",
      "body": "I think it's incorrect to label transaction count growth as network growth. Network growth is something like a node count growth, open channels growth, user growth. Transaction count is important, but it's not network growth.Also, 6.5 million tx per month is an incredibly low number. Visa has 660 million per day. So the 1212% growth is not impressive, when you go from a tiny number to a still tiny number in the grand scheme of things.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "serveria.com",
      "created_time": "October 13, 2023, 05:56:56 PM",
      "body": "Quote from: taufik123 on October 13, 2023, 12:17:53 AMRecently received news about the Bitcoin Lightning Network which experienced quite rapid growth in 2023 with a growth of 1212% in the last 2 years. Bitcoin financial service River Financial reported on the growth of the Lightning Network, from 503.115 transactions routed now soaring to 6.599.553 transactions in August 2023. Sam Wouters, River's research analyst said the figure was \"surprising\" due to the drop in Bitcoin (BTC) price and loss of interest in online searches.The report revealed that Bitcoin's price has fallen by 44%, while online searches for the top cryptocurrency have fallen by 45% since then, yet Lightning Network continues to grow.The research analyst highlighted that Lightning Network has achieved a lot despite the market downturn and only having 5,000 BTC locked on the network. Source:https://cointelegraph.com/news/bitcoin-lightning-network-growth-surges-over-two-yearshttps://x.com/SDWouters/status/1711758161042866231?s=20Thanks, very nicely compiled and presented info. And of course I'm happy LN is growing strong and it seems like it's going parabolic. It will take some pressure off the mempool, particularly taking care of those Ordinals, BRC20 tokens and what not...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "October 13, 2023, 06:09:25 PM",
      "body": "Quote from: pooya87 on October 13, 2023, 06:31:02 AMThis significant growth in usage of Lightning Network is a clear indication of how bitcoin adoption has been increasing non-stop.It also indicates how bitcoin current price is below its intrinsic value which makes the market state a manipulated one.usage has not grown. the liquidity has not moved muchbitcoins intrinsic value is at the low $20k range while prices are over $26kall this shows is that river financial is shuffling more funds back and forth(payments AND rebalancing) more often as for the 6,599,553 payments in 2 years (1,051,200 minutes) is only 6.278113584payments a minutebitcoin still does ~300transactions a minuteLN has existed for more then 6 years but is no where near the amount of payments bitcoin done per minute in 2015(its 6th anniversary)infact there are other subnetwork bridges that do far more then LNits also funny how they say there are 1.1million lightning network users but only 64k channels. meaning 1.04m users are centralised exchange balance holders. not lightning balance holders. (nor bitcoin holders)yes i know out of the 84m utxos of bitcoin there are hundreds of millions of bitcoin centralised exchange balance holders. but based on percentages it seems lightning users are more centralised than bitcoiners.. and bitcoiners use bitcoin more than lightningnow if we took away all those upto 6million population of el salvadorians \"free $30\" of crypto that routed(and failed) via lightning within these 2 years i wonder how much left would be for genuine LN usage in the last 2 yearsshowing that river represents 10% of nodes(6.4k) and 29% of liquidity(1.5k btc locked) just shows how lightning (the so called solution to bitcoin) is not meeting its promises even after 6 years.but hey people will just want to shout and scream how LN is great and perfect, ignore all the flaws, bugs, real stats and just want to pump the fluffy media pieces which state things which do not actually compliment a network once you put them into context",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "philipma1957",
      "created_time": "October 13, 2023, 06:16:23 PM",
      "body": "And it will not bode well in 20-30 years. It will simply cause miners to abandon BTC blockchain and move to Scrypt.When the largest node in the world with 17 btc  capacity only generates 87 a month in income  (when pushed hard) and 30 a month in income do the math.170 btc is 300-870 a month1700 btc is 3000-8700 a month17000 btc is 30000-87000 a month170000 btc is 300000-870000 a month1700000 btc is 3,000,000- 8,700,000 a month this would be 100,000 x bigger than now3 million x 12 = 36 million a year8,700,000 x 12 = 104.4 million a yeartoday mining does 23,587,200 a daylooks like a fucking mess is coming right at BTC  due to scaling.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackHatCoiner",
      "created_time": "October 13, 2023, 06:40:48 PM",
      "body": "The report is this: https://river.com/learn/files/river-lightning-report-2023.pdfIn short, they have got data from various lightning-accepting companies, companies that produce lightning software, and from their own lightning node. As they say, 1,212% increase is based on data from 52% of the public capacity, which gives a somewhat confident level of accuracy. Quote from: philipma1957 on October 13, 2023, 06:16:23 PMtoday mining does 23,587,200 a dayDon't you find it a little ignorant to compare the entire mining sector with just one lightning operator? Also, since when does the largest in capacity node have only 17 BTC?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}