{
  "id": "topic_5469660",
  "title": "BADecker",
  "author": "BADecker",
  "created_time": "October 08, 2023, 04:40:14 PM",
  "content": "Ukraine ‘very cheap way’ to fight Russia, NATO state claimshttps://www.naturalnews.com/2023-10-06-ukraine-very-cheap-way-to-fight-russia.htmlArming Kiev is a cost-effective way of preventing Moscow from threatening NATO, Dutch Defense Minister Kajsa Ollongren said on Wednesday at the Warsaw Security Forum.(Article republished from RT.com)Ollongren was asked whether the US and its allies can continue supporting Ukraine “for as long as it takes,” given the political in-fighting in Washington.“We cannot pretend that we’ll just wait and see how the American elections are going,” she said. “Because they have the same interest, in a way. Of course, supporting Ukraine is a very cheap way to make sure that Russia with this regime is not a threat to the NATO alliance. And it’s vital to continue that support.”“It is very much in our interest to support Ukraine, because they are fighting this war, we are not fighting it,” Ollongren noted, while admitting that NATO has “skin in the game.”Ollongren explained that she had recently visited the US and that political developments there are cause for concern, but that Western Europeans need to talk with their American colleagues and persuade them to stay the course. ...",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5469660",
  "comments": [
    {
      "author": "Joeyp",
      "created_time": "October 09, 2023, 06:12:34 PMLast edit: October 09, 2023, 09:00:32 PM by Joeyp",
      "body": "US leaders do not think especially about Ukraine, they have a lot of US taxpayers money for spending, why not. Weapons for Ukraine are manufactured in US, so they just put the budget money in the private company, who manufacture the weapons. Or may be there are some politics too.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hispo",
      "created_time": "October 13, 2023, 10:44:11 AM",
      "body": "Quote from: Joeyp on October 09, 2023, 06:12:34 PMUS leaders do not think especially about Ukraine, they have a lot of US taxpayers money for spending, why not. Weapons for Ukraine are manufactured in US, so they just put the budget money in the private company, who manufacture the weapons. Or may be there are some politics too.Unfortunately, I agree with you that there other dark motives behind the defense of Ukraine than the sole and pure wish to defend a democracy in Eastern Europe. Sure, The United States have some political reasons to defend Ukraine as a nation, also ideological reasons. But I must wonder what is the company or entity manufacturing all those weapons and providing the arsenal to Zelensky. Even the United States army get their equipment from private contracts, so if they replenish their own storage of ammo and technology, those who are going to be the most benefited will be the shareholders of military stocks or the CEOs of privately owned factories.If any of that is true, then it is a disgrace neither side of the mainstream media is talking about it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BADecker",
      "created_time": "May 30, 2024, 02:52:07 AM",
      "body": "Poor Zelensky. Biden is starting to ignore him.Trouble In Paradise: Zelensky Insults Biden Over Absence At Peace Summithttps://www.zerohedge.com/geopolitical/trouble-paradise-zelensky-insults-biden-over-possible-absence-peace-summitUkraine's President Volodymyr Zelensky has increasingly of late lashed out publicly at the proverbial hand that feeds him. He and his top officials have long complained that the billions in approved Western defense aid and shipments have been much too slow to reach Ukraine, giving the superior-armed Russians a clear advantage.But now as things get more desperate especially in the Kharkiv region where Russian forces are fast advancing, Zelensky is going after President Biden himself. There's a major Ukraine-backed peace summit in Switzerland set for next month, and it's looking very unlikely that Biden will attend, leaving Zelensky deeply unhappy.During a visit to Belgium on Tuesday, Zelensky told reporters that it would not be \"a strong decision\" if Biden failed to attend the summit, which is to take place June 15-16 outside Lucerne. He went so far as to say it would be tantamount to a standing ovation for Putin....",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blckhawk",
      "created_time": "May 30, 2024, 05:31:25 AM",
      "body": "Quote from: BADecker on October 08, 2023, 04:40:14 PMUkraine ‘very cheap way’ to fight Russia, NATO state claimsIn a financial standpoint, this actually make sense because with how the current war is going on, it's chipping away at Russia's resource and with the sanctions involved, it's a matter of time before Russia gives up and does something about their own economy because if the whole world is against them and their few remaining allies are in a tight spot to help them out, they've got no choice but to end the campaign. It's not just that too, it's also a really good testing grounds for NATO and USA to test their new weapons systems because with the guise of military aid, they can easily do things that would probably take them years if it was during times of peace, that's why most media have the Russia-Ukraine war as a focus despite all of the genocides of Israel in Palestine, they want us to focus on the one that's hating on the Russians specifically.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hispo",
      "created_time": "May 30, 2024, 10:33:39 AM",
      "body": "Quote from: BADecker on May 30, 2024, 02:52:07 AM✂️I would not give it much importance in the context of the politicals and military relations between Ukraine and the United States, to be honest.Biden is going through one for the most important phases of the presidential campaign which could define the course of the country for the next four years.  He has many places to go and many voters to rally on. Only because does not make appearance at an specific place does not mean the congress will continue to approve funds for the defense of Ukraine and the defense of it's sovereignty. Though, in honor of the truth, Joe Biden could have also calculated that appearing in just meeting with the president of Ukraine while the war as enter a long and tiring stage, could bring attention to the failure to quickly and shifty deflect the invaders, leaning some independent voters to abstain to give him their trust in November. it is both a mixture of political and military manouver. That is how the current politics work.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BADecker",
      "created_time": "May 30, 2024, 05:48:08 PM",
      "body": "Quote from: Hispo on May 30, 2024, 10:33:39 AMQuote from: BADecker on May 30, 2024, 02:52:07 AM✂️I would not give it much importance in the context of the politicals and military relations between Ukraine and the United States, to be honest.Biden is going through one for the most important phases of the presidential campaign which could define the course of the country for the next four years.  He has many places to go and many voters to rally on. Only because does not make appearance at an specific place does not mean the congress will continue to approve funds for the defense of Ukraine and the defense of it's sovereignty. Though, in honor of the truth, Joe Biden could have also calculated that appearing in just meeting with the president of Ukraine while the war as enter a long and tiring stage, could bring attention to the failure to quickly and shifty deflect the invaders, leaning some independent voters to abstain to give him their trust in November. it is both a mixture of political and military manouver. That is how the current politics work. Personally, I don't think that US politicians care much about other nations. They don't even seem to care about the people of their own country. There might be benefit in what they are doing, for Americans. But it will only be incidental.If you want to see what is really going on in US politics regarding Ukraine and other countries, WATCH: Tucker: Smartest take on U.S. foreign policy ever caught on tape - https://x.com/TuckerCarlson/status/1795500379578253729?ref_src=twsrc%5Etfw%7Ctwcamp%5Etweetembed%7Ctwterm%5E1795500379578253729%7Ctwgr%5Eaab08ef99baa211df8a254af16afea6b29e6224a%7Ctwcon%5Es1_&ref_url=http%3A%2F%2Fwww.freedomsphoenix.com%2FNews%2F363133-2024-05-29-watch-tucker-smartest-take-on-u-s-foreign-policy-ever.htm",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kentrolla",
      "created_time": "May 30, 2024, 06:45:43 PM",
      "body": "Man, this is a dirty politics and war between two evil regime one is USA and other one is Russia as both of them have already invaded so many nations and has the history of brutality and committing genocides in foreign lands and Ukraine is just made scapegoat i guess both should come to stalemate and let Ukraine breathe but the problem here is we cannot trust Russia as they may try taking over Ukraine with a surprise. But at the moment Russia should be stopped else it would be impossible from stopping them from capturing entire Ukraine.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Freeesta",
      "created_time": "May 30, 2024, 08:26:23 PM",
      "body": "The Ukrainian government is now very dependent on money. Due to the fact that the forces are unequal, weapons and people are running out, if Ukraine is not supported by EU countries, most likely, the war between Russia and Ukraine will end very soon. The only thing that can somehow affect the financing of the Ukrainian army is elections in America. Maybe Trump can end this war.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hispo",
      "created_time": "May 31, 2024, 12:45:15 AM",
      "body": "Quote from: Freeesta on May 30, 2024, 08:26:23 PMThe Ukrainian government is now very dependent on money. Due to the fact that the forces are unequal, weapons and people are running out, if Ukraine is not supported by EU countries, most likely, the war between Russia and Ukraine will end very soon. The only thing that can somehow affect the financing of the Ukrainian army is elections in America. Maybe Trump can end this war.Trump will likely end the war in Ukraine by forcing Ukraine to give up on part of their territory to Russia, to be honest. That is not exactly the outcome which is being pursued by the western allies. What would be the lesson to be learn from giving Russian territory it does not belong to the Russian Federation? The lesson would be authoritarian countries could get their way with stealing and taking over land which does not belongs to them and (perish the thought) a defeat of Ukraine could be de beginning of other authoritarian countries to try to take over democratic republics. Chine may go after Taiwan, North Korea would feel tempted to unigmfybthwirncluntry by their infamous political system and Venezuela could try to forcibly take over the disputed land with Guyana, etc. Authoritarian governments are supposed to be kept on check and not allow to kill fredoommim neighbor republic..it is simply not right. In my opinion.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mr. Tom",
      "created_time": "May 31, 2024, 03:12:34 AM",
      "body": "US wanted to deplete the manpower and military resources of Russia at the expense of European cash and Ukranian lives but they were not ready for Russia ramping up the manpower as well as arms and ammunition capabilities at this pace.  US also wanted to make Europe more depended to itself. Both of which seem to be failing at the moment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hispo",
      "created_time": "June 01, 2024, 12:39:01 AM",
      "body": "Quote from: BADecker on May 30, 2024, 05:48:08 PMQuote from: Hispo on May 30, 2024, 10:33:39 AMQuote from: BADecker on May 30, 2024, 02:52:07 AM✂️I would not give it much importance in the context of the politicals and military relations between Ukraine and the United States, to be honest.Biden is going through one for the most important phases of the presidential campaign which could define the course of the country for the next four years.  He has many places to go and many voters to rally on. Only because does not make appearance at an specific place does not mean the congress will continue to approve funds for the defense of Ukraine and the defense of it's sovereignty. Though, in honor of the truth, Joe Biden could have also calculated that appearing in just meeting with the president of Ukraine while the war as enter a long and tiring stage, could bring attention to the failure to quickly and shifty deflect the invaders, leaning some independent voters to abstain to give him their trust in November. it is both a mixture of political and military manouver. That is how the current politics work. Personally, I don't think that US politicians care much about other nations. They don't even seem to care about the people of their own country. There might be benefit in what they are doing, for Americans. But it will only be incidental.If you want to see what is really going on in US politics regarding Ukraine and other countries, WATCH: Tucker: Smartest take on U.S. foreign policy ever caught on tape - https://x.com/TuckerCarlson/status/1795500379578253729?ref_src=twsrc%5Etfw%7Ctwcamp%5Etweetembed%7Ctwterm%5E1795500379578253729%7Ctwgr%5Eaab08ef99baa211df8a254af16afea6b29e6224a%7Ctwcon%5Es1_&ref_url=http%3A%2F%2Fwww.freedomsphoenix.com%2FNews%2F363133-2024-05-29-watch-tucker-smartest-take-on-u-s-foreign-policy-ever.htmAre you actually going to quote such unsavory character as Tucker Carlson? Someone who is obviously doing propaganda in favor of the Russian government and attacking the same country where he is from.and guarantees all the right he has? He if was a born Russian citizen living in Russia, ironically when would have already been been imprison or killed because of badmouthing the local government. Also, let us not forget he is the same person who interviewed a guy who claimed to have casual gay sexual relations with Obama some years ago. He is also the same person who told his viewers a couple of years ago the country was going to run out of diesel and it would be the end of the supply change. No if it happen by the way. next time, try to quote anyone who is clearly a wacky puppet of the established power in the east of the planet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BADecker",
      "created_time": "June 01, 2024, 12:51:19 AM",
      "body": "Quote from: Hispo on June 01, 2024, 12:39:01 AMQuote from: BADecker on May 30, 2024, 05:48:08 PM~Personally, I don't think that US politicians care much about other nations. They don't even seem to care about the people of their own country. There might be benefit in what they are doing, for Americans. But it will only be incidental.If you want to see what is really going on in US politics regarding Ukraine and other countries, WATCH: Tucker: Smartest take on U.S. foreign policy ever caught on tape - https://x.com/TuckerCarlson/status/1795500379578253729?ref_src=twsrc%5Etfw%7Ctwcamp%5Etweetembed%7Ctwterm%5E1795500379578253729%7Ctwgr%5Eaab08ef99baa211df8a254af16afea6b29e6224a%7Ctwcon%5Es1_&ref_url=http%3A%2F%2Fwww.freedomsphoenix.com%2FNews%2F363133-2024-05-29-watch-tucker-smartest-take-on-u-s-foreign-policy-ever.htmAre you actually going to quote such unsavory character as Tucker Carlson? Someone who is obviously doing propaganda in favor of the Russian government and attacking the same country where he is from.and guarantees all the right he has? He if was a born Russian citizen living in Russia, ironically when would have already been been imprison or killed because of badmouthing the local government. Also, let us not forget he is the same person who interviewed a guy who claimed to have casual gay sexual relations with Obama some years ago. He is also the same person who told his viewers a couple of years ago the country was going to run out of diesel and it would be the end of the supply change. No if it happen by the way. next time, try to quote anyone who is clearly a wacky puppet of the established power in the east of the planet. Are you actually slandering such a wonderful guy as Tucker Carlson?Why don't you look at what he and his guests say, and what he is doing? He makes more sense than anybody. Are you trying to get me to be an apologist for him? Or are you simply ignorant?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BADecker",
      "created_time": "July 23, 2024, 04:26:07 PM",
      "body": "In the light of Trump probably becoming President, Ukraine is starting to accept the idea of peace talks.Ukraine Might Actually Be Semi-Serious About Resuming Peace Talks With Russiahttps://www.zerohedge.com/geopolitical/ukraine-might-actually-be-semi-serious-about-resuming-peace-talks-russiaThe conventional thinking is that Ukraine isn't interested in resuming peace talks with Russia unless the latter capitulates to its unacceptable ultimatums, otherwise it'll continue fighting \"until the last Ukrainian\", but that might be about to be turned on its head as a result of recent developments. In the span of less than a week: Trump talked to Zelensky about his peace plan; the Vatican's top diplomat visited Ukraine; and Ukraine's Foreign Minister is visiting China, the last two for the first time since 2022.From the looks of it, Ukraine is fretting about Trump's likely return to power and wants to get ahead of the curve by exploring paths to peace, which are intended to give it a chance to shape the process instead of being completely controlled by it if the US suddenly decides to end its latest \"forever war\". The supplementary developments that led up to the three aforementioned ones are Orban's peace missions and the unveiling of former British Prime Minister Johnson's peace plan....",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}