{
  "id": "topic_5403796",
  "title": "FranklinExchange",
  "author": "FranklinExchange",
  "created_time": "June 23, 2022, 04:53:34 PMLast edit: June 24, 2022, 10:15:10 AM by FranklinExchange",
  "content": "Команда Franklin Exchange приветствует Вас!Franklin Exchange – это надежный сервис для обмена электронных валют, позволяющий в самые краткие сроки конвертировать Ваши средства.Получи 100 USD за отзыв о нашем сервисе!Условия:▪️ Соверши сделку на нашем сервисе Franklin.Exchange, учитывается даже минимальная сумма обмена;▪️ Напиши отзыв о сервисе или качестве предоставляемых услуг Franklin.Exchange;▪️ Отправь скриншот или ссылку на отзыв по адресу нашей почты.▪️ Учитываются абсолютно все зафиксированные отзывы на любом из представленных ресурсов в нашем треде. Чем больше обменов вы совершите - тем больше Вы сможете оставить отзывов о нашем обменнике, это значит, - больше шансов получить 100 USD.▪️ Одна сделка - один уникальный отзыв, но оставлять его Вы можете на любом количестве предложенных сайтов. При этом каждая последующая сделка увеличивает шанс на выигрыш. В розыгрыше участвуют только отзывы написанные в текущем месяце.С более подробными условиями розыгрыша вы можете ознакомиться у нас на сайте: Franklin.ExchangeТакже, в рамках представленного проекта действует Программа Лояльности - накопительная скидка и партнерская программа, воспользовавшись преимуществами которых, Вы сможете совершать обмен электронных валют на более выгодных условиях, а также зарабатывать вместе с нами благодаря партнерской программе.Для этого нужно просто зарегистрироваться на сайте.Готовы помочь Вам с 10:00 до 22:00 (GMT+3)Наш сайт: Franklin.ExchangeНаш e-mail: benjamin@franklin.exchangeНаш саппорт в Telegram: @Franklinexchangebot",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5403796",
  "comments": [
    {
      "author": "xandry",
      "created_time": "June 23, 2022, 06:47:55 PM",
      "body": "Quote from: FranklinExchange on June 23, 2022, 04:53:34 PMС более подробными условиями розыгрыша вы можете ознакомиться у нас на сайте: Franklin.Exchange1. Ссылочка кривая. правильная вот: https://franklin.exchange/dobro-pozhalovat/2. Сайт работает просто ужасно медленно. От перехода по ссылкам внутри сайта может пройти примерно до 20 секунд.3. В заголовке темы написали с ошибкой \"Exchanage\", можете тоже исправить редактированием поста.4. Предлагать писать отзывы на фишинговом сайте это вообще конец. Ознакомьтесь: bitcointalk.com - осторожно, фишинг!5. Да и ссылка на \"наш сайт\" тоже кривая, с каким-то дополнительным url в конце.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FranklinExchange",
      "created_time": "June 24, 2022, 10:26:56 AM",
      "body": "Здравствуйте! Благодарим за замечания, информация была скорректирована!Мы учтем Ваш комментарий, а сайт будет оптимизирован в ближайшее время.Хорошего дня!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}