{
  "id": "topic_5411784",
  "title": "Hydrogen",
  "author": "Hydrogen",
  "created_time": "August 30, 2022, 09:23:01 PM",
  "content": "QuoteSkyrocketing prices for natural gas have Europeans scrambling for alternative energy sources. In Germany, where households face a 480 euro rise in their gas bills, people are resorting to stockpiling firewood.The fallout from Russia’s invasion of Ukraine has sunk Europe into the worst energy crisis in decades. From Italy to the UK, governments are racing to replace natural gas supplies from Russia and curtail the higher costs for industry and households. But consumers, too, are having to adapt, from cutting back on showering to firing up the chimney.The German word for firewood, “brennholz”, reached peak search volume on Google in mid-August:Image link:  https://i.ibb.co/Hqm5Mbd/zeroone.jpgThe rising cost of natural gas and firewoodAlmost 50% of homes in Germany are heated by natural gas, with another 25% using heating oil. In the past, less than 6% used firewood.That share is set to be higher this year. As natural gas prices soared, so have those for firewood and wood pellets:Image link:  https://i.ibb.co/Qmx9rBz/zerotwo.jpgHeating furnaces and wood stoves are also selling out.Suppliers of the raw material are struggling to keep up, leading to scarcity of firewood. Earlier this summer, Germany’s Federal Firewood Association said the market was all out of wood.The lion’s share of firewood used in Germany—80% according to the association—is typically sourced domestically. Now German firewood suppliers are buying from Poland, leaving some residents in both countries to collect brushwood. To prevent panic-buying, one seller has been rationing purchases to three boxes of wood at a time.The process for drying out wood is long, compounding the ability to meet demand. Ideally, it takes six months to a year, because the more moisture wood contains, the less efficient it is at burning.Over the long run, the firewood rush also raises environmental concerns. Trees do not replenish quickly and are not a viable substitute for replacing oil and gas, according to scientists. The fumes from burning wood also contain toxic chemicals.Although Germany’s government deems burning wood for fuel as carbon-neutral, experts say the designation is not clear-cut. The combination of burning wood and cutting down forests may increase carbon emissions.https://qz.com/germans-are-looking-to-firewood-for-energy-as-natural-g-1849461406....Beautiful uptrend charts for firewood.Is it possible that firewood is the new bitcoin? How long before start ups roll out stablecoins pegged to the value of firewood commodities internationally?Domestically cultivating swathes of fast growing bamboo or paulownia tree for use in wood stoves during winter could help to regrow and regenerate firewood in a way that is sustainable. The worst scenario here is for old growth forests to be targeted. Those would take decades to replace and their greater size would lead to larger quantities of carbon emissions as the wood is burned.Its also been said that smaller diameter bamboo dries faster than larger diameter trees. Bamboo is a type of grass. Which could translate to it being more carbon neutral in contrast to most trees. Bamboo can also be used for many other applications aside from firewood. Which makes it a good investment even if the firewood application dries up, eventually.The article mentions that burning wood releases toxic chemicals. Burning termite treated lumber will release arsenic fumes into the air. I'm not certain about naturally grown wood having toxic substances however.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5411784",
  "comments": [
    {
      "author": "odunybiz",
      "created_time": "August 30, 2022, 09:55:30 PMLast edit: August 30, 2022, 10:17:56 PM by odunybiz",
      "body": "For every problem in a country, some people take the advantage to become rich. They identify the problem and creat wealth from it. Just like bitcoin was created to solve some problems and this also make alot of people rich till today. Firewood may be the Bitcoin of some German that will make then wealthy. Although it will be an opportunity for some citizen to create wealth but may foster a great problem to the government, citizens and the country as a whole. As this may later cause climate change, soil erosion, desertification, habitat loss and increased greenhouse gases in the atmosphere over a long time as trees are being cut down for firewoods.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cabron",
      "created_time": "August 30, 2022, 10:06:08 PM",
      "body": "The need for gas to heat up the house is really bad and they are preparing for it. The Germans know, they are not going to get enough supply of gas this winter so its best to just prepare. The government itself has the obligation warn its citizen since they approve energy-saving measures for the winter that will limit heating and lighting for public buildings according to this recent news.While you are freezing, you won't really mind about that carbon neutral woods, you need more than just a blankee.Like the shortage of toilet paper, someone will make money out of it. In Poland, people line Up For Coal Fearing Energy Shortages.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AjithBtc",
      "created_time": "August 30, 2022, 11:01:52 PM",
      "body": "Already the country is experiencing drought situation. This too a big problem as water levels fall to below 40cm on Rhine river, the route of transporting fuel and other necessary commodities. This is supposed to fall even lower and the same have made the ships to reduce the loads. The heat of the water is very high and this leads to death of fishes and floating all around. The climate change is being experienced in a large scale. Now for the lack of required fuel people moving towards the firewood leads to deforestation. The same could have its effects on the environment over time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coupable",
      "created_time": "August 30, 2022, 11:56:51 PM",
      "body": "This is how the result is when relying on a single source of energy without taking into account the possibility of crises. Germany could have bought liquefied gas from other suppliers at a higher cost, but it neglected this option and did not build transfer stations. With winter approaching, Germany will not hesitate to use all possible solutions including the recently launched hydrogen-powered train.And the other hypothesis is that it retracts the economic sanctions on Russia to ensure its survival, albeit temporarily, during the winter .",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Moneyprism",
      "created_time": "August 31, 2022, 01:38:22 AM",
      "body": "so the Paris agreement is just a formality huh? they blame developing countries for still using fossil energy,, while they developed countries are starting to use fossil energy again and it doesn't matter.. very hypocritical.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zlantann",
      "created_time": "August 31, 2022, 02:20:44 AM",
      "body": "Quote from: Hydrogen on August 30, 2022, 09:23:01 PMIts also been said that smaller diameter bamboo dries faster than larger diameter trees. Bamboo is a type of grass. Which could translate to it being more carbon neutral in contrast to most trees. Bamboo can also be used for many other applications aside from firewood. Which makes it a good investment even if the firewood application dries up, eventually.The article mentions that burning wood releases toxic chemicals. Burning termite treated lumber will release arsenic fumes into the air. I'm not certain about naturally grown wood having toxic substances however.Bamboo trees are a very good source of heat considering their short maturity period, less toxic nature, and ability to dry fast. But it doesn't have the ability to retain heat for a long time. One needs to have plenty of it to heat a house for a very long time which might increase the amount of fume and ashes produced. Bunning itself releases toxic substances and it is very obvious that even natural grown woods are also toxic. Research showed that harmful substances suchbenzene and dioxins are by-products of natural wood burning.   Quote from: AjithBtc on August 30, 2022, 11:01:52 PMAlready the country is experiencing drought situation. This too a big problem as water levels fall to below 40cm on Rhine river, the route of transporting fuel and other necessary commodities. This is supposed to fall even lower and the same have made the ships to reduce the loads. The heat of the water is very high and this leads to death of fishes and floating all around. The climate change is being experienced in a large scale. Now for the lack of required fuel people moving towards the firewood leads to deforestation. The same could have its effects on the environment over time.Yes, Europe is in dire need of an alternate source of heat and any option would be accepted regardless of the effect on the environment. But it was the same EU that portrays itself as the champion of the environment. They claim to love the environment and that they can do anything to preserve it. They would quickly point accusing fingers at Bitcoin as one of the enemies of the environment. The question now is where is the love?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Darker45",
      "created_time": "August 31, 2022, 02:45:38 AM",
      "body": "To some, firewood could probably even be more important than Bitcoin. But to elevate the value of firewood globally simply because of this doesn't make sense. Many countries don't have winter seasons. Many countries don't need heaters. And if there is a really huge demand for firewood, a lot of countries could export. Stablecoins pegged to the value of firewood is another absurd idea. It's even a misnomer in the face of what's happening right now. Its value would be anything but stable. When the violence brought by Russia will come to pass, all these firewood exaggerations will vanish.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "August 31, 2022, 03:07:18 AM",
      "body": "This proves once again that all the nonsense the Europeans have been saying about caring about the environment, green shit, global warming, etc. all meant nothing. The moment they felt a little pressure they started cutting down trees and burning coal like 1800s!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sithara007",
      "created_time": "August 31, 2022, 03:14:49 AM",
      "body": "This is the story from all around the EU. Here is a case from Ireland:https://twitter.com/DolanGeraldine/status/1564392353300889603The electricity prices are fast approaching €1 per KWh. And remember that the winter is still a good 2-3 months away. Update from Finland: https://twitter.com/mtmalinen/status/1564542671061909510 (claims that electricity prices are up by 10-12x). Leicester: https://twitter.com/CallumMckeefery/status/1564202870706143235 (increase from £10,000 to £55,000). Norway: https://twitter.com/PeterSweden7/status/1563913228618440707 (Norway is an exporter of gas)Germany: https://twitter.com/DrEliDavid/status/1563598130847039488France seems to be the only country where the electricity prices are remaining stable.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "amishmanish",
      "created_time": "August 31, 2022, 03:24:03 AM",
      "body": "I think this is only a temporary trend the firewood can't be always used for heating up the whole country. Firstly it's costly. It's bullky, transportation cost is high and it need huge logistics support system. So yes until there is war there could be gas issues and firewood might be used as an alternative, but it cant be a saviour. Ultimately we will gonbacknto gas..",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "noorman0",
      "created_time": "August 31, 2022, 05:15:04 AM",
      "body": "Quote from: Moneyprism on August 31, 2022, 01:38:22 AMso the Paris agreement is just a formality huh? they blame developing countries for still using fossil energy,, while they developed countries are starting to use fossil energy again and it doesn't matter.. very hypocritical.It's a household need as an emergency alternative, and I don't think the people there have any other choice.I thought Germany was more skilled at tackling the energy crisis because historically they were pioneers in fighting climate change as I saw articles everywhere about their recycling technology. I see a lot of something against the previous assessment from this point on.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BRINIRHA",
      "created_time": "August 31, 2022, 05:28:39 AM",
      "body": "In my country which is still developing, using firewood is still a common thing for residents here. possible for people living in urban areas far from forests and plantations. It will be very difficult to find firewood. they have to buy from villagers who are still looking for firewood. and this can be a business opportunity for people who live in rural areas. to collect firewood and sell it to urban areas far from the forest.for developed countries who are accustomed to using gas and oil. Of course, it will be very difficult to adapt to find other alternative energy. but for developing countries and people living in rural areas. then we are used to the situation without gas and oil.city ​​people who have never used firewood will surely think that the firewood that is burned is entirely from large wood trees that are cut down and axed into small pieces. it's not wrong. but actually rural people who are accustomed to using firewood are not looking for firewood by cutting down large wood trees. but in the forest we will find many small trees that grow around large trees that can be used as firewood. kind of bush. one example of wild trees that are commonly used as firewood is called Kaliandra. If this tree is cut down, within a month it will grow as before. even the branches will be more and more. so that this tree is used by many people around me to be used as firewood.so I hope people stop cutting down big trees just to get firewood. because the big trees will not grow back in a short time. but they will grow back in a long time even up to years or decades. and it can damage the environment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LoyceV",
      "created_time": "August 31, 2022, 05:45:54 AM",
      "body": "Quote from: pooya87 on August 31, 2022, 03:07:18 AMThis proves once again that all the nonsense the Europeans have been saying about caring about the environment, green shit, global warming, etc. all meant nothing. The moment they felt a little pressure they started cutting down trees and burning coal like 1800s!It's mainly politicians feeling good about themselves when they make unrealistic climate deals. Tax payers already know we'll just be paying for it.The good thing about coal is that you can actually have your own storage. It's not really possible to store gas for the winter at home, but a few tonnes coal fits in any basement. I wouldn't want it though: it's heavy, it's dirty and it creates thick smoke. Car emissions are strictly regulated, but fireplaces are still free for all.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kakmakr",
      "created_time": "August 31, 2022, 05:54:19 AM",
      "body": "I hope they are not cutting down indigenous wood for this? In my country we use firewood, but the wood we are using are from invasive trees. These invasive trees are taking large amounts of water from the ground and they also kill other indigenous trees, because they take their water.  I guess the wood briquettes industry are making a killing in Europe now.. and also briquettes that are being imported from other countries. (What is cheaper.... Gas or briquettes that are being imported?)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Free Market Capitalist",
      "created_time": "August 31, 2022, 05:57:54 AM",
      "body": "I don't see the point of looking for firewood unless they mean going to look for firewood themselves, not buying it, because firewood is expensive. Very expensive. And the ideal firewood for fireplaces, such as oak or walnut, is the most expensive. Is it allowed in Germany to go to the forest and cut firewood? With so many environmental regulations, I wouldn't be surprised if it was forbidden or you had to ask for permission and pay a fee. Quote from: Zlantann on August 31, 2022, 02:20:44 AMBamboo trees are a very good source of heat considering their short maturity period, less toxic nature, and ability to dry fast. But it doesn't have the ability to retain heat for a long time. One needs to have plenty of it to heat a house for a very long time which might increase the amount of fume and ashes produced. That's what I thought. I hadn't heard of bamboo as firewood, but being a thin shrub that grows fast, it's not likely to last long.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mauser",
      "created_time": "August 31, 2022, 06:41:01 AM",
      "body": "This winter is going to be very difficult in Germany. Even though the gas tanks are almost full again, things are looking very bad for the average household this year. Just this morning I read that the energy suppliers expect 15-20% of the household not be able to pay their energy bills this year. Buying firewood seems like one solution for some families, because many houses have a fireplace inside. In modern houses a fireplace is not so common anymore and usually is only built in for design and optics and not really to be used to heat homes. In older houses, especially from the 1950-80s it was very common to have a fireplace even in the smallest flats. Many of them have not been used for years, but they are fully functional as they need to be checked yearly in Germany. I know this from my friends that most of them never once used their fireplace and usually don't even have wood at home, rather put a candle inside or some fake fire lights. Firewood got very expensive now if you buy it in the store, an alternative is to buy it locally from a forrest when they cut down trees. The problem is that the wood will be wet and it needs to be stored and dried for a few months before being able to use it. But if you have space to store it then now is a good time to stock up for the winter. The only good thing this year could be if it will be a warm winter without snow.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "August 31, 2022, 06:45:13 AM",
      "body": "Quote from: LoyceV on August 31, 2022, 05:45:54 AMThe good thing about coal is that you can actually have your own storage. It's not really possible to store gas for the winter at home, but a few tonnes coal fits in any basement. I wouldn't want it though: it's heavy, it's dirty and it creates thick smoke. Car emissions are strictly regulated, but fireplaces are still free for all.The disadvantages of coal are far more than any advantage it may have, apart from disadvantages you mentioned another one for a lot of countries is that they also have to import coal like they import gas. One of the big sources for coal is also Russia!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blue_hurricanger",
      "created_time": "August 31, 2022, 09:31:29 AM",
      "body": "If only Germans start to take the nuclear energy pill sooner. Look at France, it took them the 1973 oil crisis where oil has risen nearly 300% to shallow the nuclear energy pill. Today, France derives about 70% of its electricity from nuclear energy. The amount of CO2 emission from fossil fuels for energy is another reason to consider nuclear energy. Yes, the disposal of nuclear wastes, as well as other byproducts (contaminated water from the cooling nuclear reactor,...) is risky but heavily regulated. Compared to the dramatic climate change from CO2 emissions and the indebted to the oil cartel/fossil fuel control, I rather take my chance at nuclear energy. If more countries start to switch to nuclear energy, more money into the industry to push for more innovations, technologies and such. Really, this is our wake-up call now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LoyceV",
      "created_time": "August 31, 2022, 09:59:51 AM",
      "body": "Quote from: blue_hurricanger on August 31, 2022, 09:31:29 AMIf only Germans start to take the nuclear energy pill sooner.They did that, see this image on Wikipedia (hotlinking the image from Wiki doesn't work).Then, after the Fukushima nuclear disaster, they decided to get rid of them quicker. And coal too, because of the climate. Natural gas consumption on the other hand went up, because of the lower emissions and higher flexibility (needed to deal with the increasing share of wind and solar). And that's in a nutshell how we ended up where we are.But even if they'd do use nuclear power for heating, using electricity for resistor heating is quite wasteful. You'd need a lot more power plants.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}