{
  "id": "topic_5441247",
  "title": "maudo",
  "author": "maudo",
  "created_time": "February 25, 2023, 07:17:11 PM",
  "content": "i was moving to another apartment, and i found my old IDE HDD that supposed to be dead , well out of curiosity i connected to with IDE to usb adapter and is worked, i have found so many old photos that is was lost and together walled.dat file , instaly i opened it with bitcoin core and yeah there are some btc in it https://mempool.space/address/1FJgMhFcd9zt8JJ8BoLVAS8QruZhbenHqg , but don't remember password of the wallet , tried EVERYTHING.  so these btc will be there forever now ?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5441247",
  "comments": [
    {
      "author": "DaCryptoRaccoon",
      "created_time": "February 25, 2023, 08:03:26 PM",
      "body": "Did you save a seed anywhere or save the private keys for the wallet?I would advise to sit with a pen and paper and try think back to the time when you were using it, try recall what you were doing, who you were with when you last used the wallet. Try think of password write them down make a list so you don't end up trying the same ones over and over. Something like this might be worth looking into.https://github.com/gurnec/btcrecover/blob/master/TUTORIAL.md#btcrecover-tutorial",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o_e_l_e_o",
      "created_time": "February 25, 2023, 08:27:16 PM",
      "body": "Quote from: MagicByt3 on February 25, 2023, 08:03:26 PMDid you save a seed anywhereBitcoin Core has never used seed phrases, so this would not be possible.Quote from: MagicByt3 on February 25, 2023, 08:03:26 PMSomething like this might be worth looking into.I would also suggest using btcrecover to attempt to brute force the password, but not that the link you have provided is to a very old version of the software which has not been updated in 6 years. OP will have a much better chance of recovering using the updated and optimized version available here: https://btcrecover.readthedocs.io/en/latest/If you have absolutely no idea what the password is, then if it is anything more than a handful of a characters then you will almost certainly be wasting your time trying to brute force every possible combination. You will need to remember as much about the password as you can. What kind of passwords were you using at the time? Were you including words or strings of numbers? Lowercase/uppercase/digits/symbols? Any common patterns. Etc.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dkbit98",
      "created_time": "February 25, 2023, 08:42:56 PM",
      "body": "Quote from: maudo on February 25, 2023, 07:17:11 PMbut don't remember password of the wallet , tried EVERYTHING.  so these btc will be there forever now ? Did you by any chance wrote your password anywhere, either in digital form or on paper, and do you have private key?If you didn't do that it's going to be hard to recover your coins, but you can always hire someone to bruteforce and crack that password, especially if it was not strong and with many characters.In many cases weak passwords can be cracked instantly or in few hours, so I wouldn't say your coins are lost forever.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaveF",
      "created_time": "February 25, 2023, 10:03:34 PM",
      "body": "Obligatory comment. There are scammers everywhere so be very careful of what you do and what advice you take. Don't send your wallet file out to others.Also, make a backup before you do anything. Just in case, it's an older drive that already gave you issues you don't want it to stop working again and take the wallet (And your pictures) with it. Attempting to jog your memory: Did you have any alt coins back then? 2014 was during their boom, could you have used the same password between coins? Could you have messed up and used your alt coin password to secure your BTC wallet?-Dave",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitMaxz",
      "created_time": "February 25, 2023, 11:41:49 PM",
      "body": "If you don't remember or if you forgot where you save your password then there is no other way to access your wallet unless the wallet.dat password only contains 4 characters you can brute force the wallet. above 4 characters depending on your PC specs can take years before you find the right password but if you still remember some parts of your password you can speed up the process.Here's the guide below if ever you want it to try.- BTCreocovery Guide",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nc50lc",
      "created_time": "February 26, 2023, 05:01:57 AM",
      "body": "Quote from: maudo on February 25, 2023, 07:17:11 PM-snip- but don't remember password of the wallet , tried EVERYTHING.That's a start, you can use the passwords that you've tested as \"tokens\" and add a small number of random characters, typo check, etc.If you find it hard to set-up a bruteforce hardware/software, try to contact www.walletrecoveryservices.comHere's his Bitcointalk thread: https://bitcointalk.org/index.php?topic=240779.0The service is quite popular but it costs a fraction of the recovered amount. (not upfront)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "maudo",
      "created_time": "February 26, 2023, 11:04:40 AM",
      "body": "impossible to remember password, but i am sure it was using symbols , something like    \"!!!Bicointalk?!##\" how long would take to crack password like this !!!Bicointalk?!## ? or i must wait 30+ years for quantum PCs ?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ABCbits",
      "created_time": "February 26, 2023, 11:26:09 AMLast edit: February 27, 2023, 09:31:56 AM by ETFbitcoin",
      "body": "Quote from: maudo on February 26, 2023, 11:04:40 AMimpossible to remember password, but i am sure it was using symbols , something like    \"!!!Bicointalk?!##\" how long would take to crack password like this !!!Bicointalk?!## ? or i must wait 30+ years for quantum PCs ? Not possible if you have to brute-force all 19 characters. Here's the rough calculation following detail,7 symbol character which need to be brute forced.There are 33 symbol character on ASCII format.12 lower/upper case character which need to be brute forced.There are 52 lower/upper character on ASCII format.1 (One) Nvidia RTX 2080 Ti. Speed data is taken from https://btcrecover.readthedocs.io/en/latest/Usage_Examples/2020-10-06_Multi-GPU_with_vastai/Example_Multi-GPU_with_vastai/#performance.Total possible password combination = 33^7 * 52^12 = 16658569411954712980493426491392 (about 1.66E31)Speed of RTX 2080 Ti = 6.4 kP/s or 6400 password per seconds.1 day in seconds = 60 * 60 * 24 = 86400 seconds.Brute force time (in days) = 1.66E31 / 6400 / 86400 = about 3E22 days.You'll have to either wait for faster hardware or remember more parts of the password to reduce possible combination. But i have doubt about quantum PC since Bitcoin Core use AES 256 encryption, https://security.stackexchange.com/a/103560.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o_e_l_e_o",
      "created_time": "February 26, 2023, 01:17:06 PM",
      "body": "Quote from: maudo on February 26, 2023, 11:04:40 AMhow long would take to crack password like this !!!Bicointalk?!##It depends just how \"like this\" you are talking about.ETFbitcoin has given you the upper limit of brute forcing every combination of symbols and letters. That would be impossible and not worth trying.However, perhaps you can narrow things down significantly. Were the letters in the middle random letters, or was it definitely a single word? A single English word? Do you have any idea how many characters? Are you sure only the first letter was capitalized? You could potentially narrow this down from billions upon billions of possibilities to a few tens of thousands of possibilities.And what about the symbols? Are you sure about how many were before and after? Did you repeat the same symbol several times? Do we have to search every possible symbol, or are you sure it would only be one of a smaller subset?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sheenshane",
      "created_time": "February 26, 2023, 11:52:35 PM",
      "body": "Quote from: maudo on February 26, 2023, 11:04:40 AMhow long would take to crack password like this !!!Bicointalk?!## ? or i must wait 30+ years for quantum PCs ? More worst, you won't open your wallet but it's worth trying that big amount. Attempting to brute-force a 19-character Bitcoin wallet would be an extremely difficult task, even for a powerful computer you've said (quantum computers).  The number of possible combinations for a 19-character password is incredibly large, making it virtually impossible to crack without knowing some information about the password beforehand.I may advise you to seek a trusted service to help you crackling down your password or brute force your password.  But take note it should be a trusted service and IMO, it was suggested above.  Go to their ANN thread and contact OP but of course, this is not free.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}