{
  "id": "topic_5410110",
  "title": "DashingAgent",
  "author": "DashingAgent",
  "created_time": "August 16, 2022, 04:19:18 PMLast edit: August 17, 2022, 03:52:36 PM by DashingAgent",
  "content": "Note: binance has removed reef/BTC trading pairs and can delist this token soonReef is ready to beat ADA in next quarterReef Will beat ADA in next quarter and will become a popular currency to build blockchains due to its fast transaction speed, lowest transaction cost, available tools (all tools which are created for Ethereum are now available to reef@for more information you can read developer docs) reef supports solidity so it is easy for developers to build nfts and r20 tokens)Reef has less supply comparing to Cardano and it is created to beat Ethereum but due to its available supply around 19.8 billion, we cannot compare it with Ethereum. My price prediction for reef is around $2.50 within next 6 months as developers may move to reef.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5410110",
  "comments": [
    {
      "author": "poodle63",
      "created_time": "August 16, 2022, 04:51:51 PM",
      "body": "It's better if you are making a sense comparison for reef. Comparing it with ADA or even ethereum didn't even make sense. The second layer blockchain must be compared with second layer blockchain like polygon or BNB but yeah BNB is not even comparable with it as it's the best second layer blockchain as for now. Your expectation was to good to be true. Im sorry to say but that will not happen.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ryzaadit",
      "created_time": "August 16, 2022, 09:07:22 PM",
      "body": "One thing, I learn from Crypto.Never trusted a buzz word marketing with \"beat\" word ~XD. Are the feature you're say is not on ETH? even Ethereum have high transaction fee is still the first crypto who created a smart contract. Another reason is the volume too.If your token want to use a \"beat\" word, better to passed the volume from ADA or ETH first ~LOL.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dave1",
      "created_time": "August 17, 2022, 01:44:42 AM",
      "body": "Lol, this is 2022 already, not like in 2017 wherein every project released is supposedly gonna kill this X project, specially Ethereum. Gone are the days wherein you will hype your project with this tagline because this has been exposed already.And most of the time, it will backfire bigtime when investors seeing that supposedly Reef will beat ADA next quarter. So most likely this is not going to happen, sorry to burst the bubble. Maybe there could be few occasions wherein it will be pump, but then again, after that there will be huge incoming dump as well.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoperkele",
      "created_time": "August 17, 2022, 09:41:36 AM",
      "body": "Quote from: DashingAgent on August 16, 2022, 04:19:18 PMReef is ready to beat ADA in next quarterReef Will beat ADA in next quarter and will become a popular currency to build blockchains due to its fast transaction speed, lowest transaction cost, available tools (all tools which are created for Ethereum are now available to reef@for more information you can read developer docs) reef supports solidity so it is easy for developers to build nfts and r20 tokens)Reef has less supply comparing to Cardano and it is created to beat Ethereum but due to its available supply around 19.8 billion, we cannot compare it with Ethereum. My price prediction for reef is around $2.50 within next 6 months as developers may move to reef.What do you mean by beating? The marketcap? Price growth? Or adoption? Because everything you are predicting is nearly impossible.Your price prediction in 6 months would mean 56718% growth and that's just silly. It would make the marketcap to $47,500,000,000 and that's almost bnb mc. And that's 6 months?I am not saying Reef wouldn't be a good bet. I am saying that OP is delusional. And without looking at the code i would say it's easy to have fast transaction speed or \"low fees\" with small activity in a chain or having them in layer 2, with unsustainable tokenomic game theory or having a centralized system.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitterguy28",
      "created_time": "August 17, 2022, 11:11:01 AM",
      "body": "Quote from: DashingAgent on August 16, 2022, 04:19:18 PMReef is ready to beat ADA in next quarterReef Will beat ADA in next quarter and will become a popular currency to build blockchains due to its fast transaction speed, lowest transaction cost, available tools (all tools which are created for Ethereum are now available to reef@for more information you can read developer docs) reef supports solidity so it is easy for developers to build nfts and r20 tokens)Reef has less supply comparing to Cardano and it is created to beat Ethereum but due to its available supply around 19.8 billion, we cannot compare it with Ethereum. My price prediction for reef is around $2.50 within next 6 months as developers may move to reef.after long time of inactivity ? this is the first post that you will deliver? wondering what is behind this thread and if you are part of the team or just a shill account.and yes imagine that you are trying to bear ADA here? lol Cardano is a well supported currency with large team and investors , while your reef is staying at almost rank 300 from Coinmarketcap?https://coinmarketcap.com/currencies/reef/this is a Joke right?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Reatim",
      "created_time": "August 17, 2022, 11:13:12 AM",
      "body": "Sorry but is there any support from your claim here mate? at least some good news to come about the update and the team?because I checked the movement of this coin and shows nothing but red moving?i don't know where did you get that Idea or how do you know this happen but I will continue supporting ADA than this one.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DashingAgent",
      "created_time": "August 17, 2022, 03:51:29 PM",
      "body": "Sorry, binance has removed reef/BTC trading pairs and can delist reef Quote from: Reatim on August 17, 2022, 11:13:12 AMSorry but is there any support from your claim here mate? at least some good news to come about the update and the team?because I checked the movement of this coin and shows nothing but red moving?i don't know where did you get that Idea or how do you know this happen but I will continue supporting ADA than this one.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kelvinid",
      "created_time": "August 17, 2022, 11:33:41 PM",
      "body": "It is just an assumption, a baseless statement means nothing. You can't just simply think this NEW project that you have mentioned will become known and beat old coin ADA. In fact, only a few people just know about Reef, I actually don't even know it. But I don't go digging about this project as it looks like a scam thing. I guess OP you need to know more about ADA and know more about your project. Then, please come back and tell us why.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GreatArkansas",
      "created_time": "August 18, 2022, 01:36:41 AM",
      "body": "Quote from: Kelvinid on August 17, 2022, 11:33:41 PMIt is just an assumption, a baseless statement means nothing. You can't just simply think this NEW project that you have mentioned will become known and beat old coin ADA. (.....)Exactly, that's why Cardano (ADA) is still on top even how many years passed by, before Cardano (Ada) versus Ethereum (Eth). But for me, Ada is really far away with Ethereum.But now, Ada versus any smart contract platforms. For me, Reef could be a quality project but for me, it's too early to assume, Cardano (Ada) is already far away ahead compare to other non-ethereum blockchain platform.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bittraffic",
      "created_time": "August 18, 2022, 02:18:58 AM",
      "body": "So many ETH killers being proclaimed in the past and they all failed. Even ADA, EOS, or AVAX had been said to be an ETH killer but looking at thier stats now, they just are another token. The Reef is not very close to what OP is saying but probably the same investors looking for suckers so they could make money when these new suckers buy the Reef.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bittick",
      "created_time": "August 19, 2022, 03:16:41 AM",
      "body": "Quote from: DashingAgent on August 17, 2022, 03:51:29 PMSorry, binance has removed reef/BTC trading pairs and can delist reef No doubt binance will be delisting shit coin like reef soon. Are you drunk? you are making a comparison with ADA which is top coin. This coin is also having marketcap lower than 100 millions USD. It needs billionaire like musk to pump this. Yeah only a few people used reef. I didn't even think another ADA killer may come. You didn't even aware if we are still in the big bearish market. Bitcoin has not even recovered from its dump. how can reef beat ADA? that was a non sense thing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "peter0425",
      "created_time": "August 19, 2022, 03:55:11 AM",
      "body": "Quote from: DashingAgent on August 16, 2022, 04:19:18 PMNote: binance has removed reef/BTC trading pairs and can delist this token soonReef is ready to beat ADA in next quarterhow this can be possible when this shitcoin is being removed by binance and soon to be delisted?Am not sure what you are telling here but what i can see from the project is a dying coin instead of seeing an increase.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "judaspriest",
      "created_time": "August 19, 2022, 03:35:41 PM",
      "body": "REEF in my opinion is a very good project, Binance is also listing this coin and the progress of the project is also always updated on their social media, so I have no doubts about this project, but it is still very early compared to Cardano, Cardano is still the best in my opinion.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SirLancelot",
      "created_time": "August 19, 2022, 03:45:43 PM",
      "body": "Quote from: poodle63 on August 16, 2022, 04:51:51 PMIt's better if you are making a sense comparison for reef. Comparing it with ADA or even ethereum didn't even make sense. The second layer blockchain must be compared with second layer blockchain like polygon or BNB but yeah BNB is not even comparable with it as it's the best second layer blockchain as for now. Your expectation was to good to be true. Im sorry to say but that will not happen. Or we can disregard the layer stuff's but let's look only about their popularity and age. This reef will have no chance to compete or to compare with ada because this coin is unpopular and probably just a new coin that came out of nowhere. We don't even know if it will gather much supporter for it to become a little stronger. He is saying that reef will beat ada in the next quarter but next quarter is going to be a strong quarter for the established cryptos because they are close to the last and final quarter or to the year end. That means ada will become more stronger leaving this reef coin behind. What's more unrealistic is when he says that the coin can also beat eth but even ada itself can't beat eth, so how much more this new/unpopular coin?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SlimShadyMmp",
      "created_time": "August 19, 2022, 11:00:56 PM",
      "body": "I highly doubt that mate I mean reef have been around for like a while now and seriously they really have less dapps like ADA and have much less popularity and users Almost if not everyone on the crypto space knows about ADA But thats not thesame for Reef I have hold reef before even followed their update for a while but recently the havent got any crazy dapps or nft on their ecosystem for me to fancy Even their ecosystem seems quite these days We all know what that means in Crypto",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "masterrex",
      "created_time": "August 20, 2022, 06:35:01 AM",
      "body": "Quote from: DashingAgent on August 16, 2022, 04:19:18 PMNote: binance has removed reef/BTC trading pairs and can delist this token soonReef is ready to beat ADA in next quarterReef Will beat ADA in next quarter and will become a popular currency to build blockchains due to its fast transaction speed, lowest transaction cost, available tools (all tools which are created for Ethereum are now available to reef@for more information you can read developer docs) reef supports solidity so it is easy for developers to build nfts and r20 tokens)Reef has less supply comparing to Cardano and it is created to beat Ethereum but due to its available supply around 19.8 billion, we cannot compare it with Ethereum. My price prediction for reef is around $2.50 within next 6 months as developers may move to reef.IMO, I believe Cardano or ADA has been in this industry since 2017, and already survive in the most crucial times of the crypto market, and then suddenly a newcomer in this industry wants to overtake ADA just like that, I don't think so, Im not judging the Reef project but I think it's just too early to think about it Reef has not been fully tested by the market forces so for now, it's not possible but maybe in the future who knows.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "X-ray",
      "created_time": "August 21, 2022, 12:10:13 PM",
      "body": "There are huge gaps between both. Im not sure if you aware about that caused by even when you ask ordinary people about the possibility for reef to be the same like ada and they would be saying a big no. There are so many differences between both. 1. In term of adoption2. Protocol usage3. Price and community4. Exchange support 'many more. If you aware about those things and im sure that if you will not make a non sense comparison like that. There will be no chance to beat ada. Whole of crypto exist in the market to be co exist from one to the each other and no to beat one to the each other.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fuguebtc",
      "created_time": "August 21, 2022, 02:03:58 PM",
      "body": "Quote from: bittraffic on August 18, 2022, 02:18:58 AMSo many ETH killers being proclaimed in the past and they all failed. Even ADA, EOS, or AVAX had been said to be an ETH killer but looking at thier stats now, they just are another token. The Reef is not very close to what OP is saying but probably the same investors looking for suckers so they could make money when these new suckers buy the Reef.And we will hear it hundreds of times in the future, all new projects want to be ethereum killers. The downside of ETH is high gas fees and slow processing speed but once ETH completes the upgrade to POS, I would love to know if they still want to kill ETH and replace ETH. I haven't even heard of the coin OP is referring to, The Reef is really strange to me, how a coin with no reputation becomes the next ETH killer.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SaveOurSea",
      "created_time": "August 21, 2022, 03:29:40 PM",
      "body": "Cardano is still very difficult to beat I think so, because we know how Cardano is performing, yes they are able to be in 8th position according to coinmarketcap, while Reef is at rank 289 coinmarketcap, from there we know who is the best, its okay if Reef becomes a candidate to shift ADA, but remember it takes a lot of marketcap.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}