{
  "id": "topic_5470314",
  "title": "forceoffog",
  "author": "forceoffog",
  "created_time": "October 14, 2023, 11:12:12 AM",
  "content": "Bence bu artma gidisati biraz daha articak ve yeni yila girince biraz stabillenicek ondan sonrada cok ani bir yukselme bir daha olabilir umarim olmaz.Benim tahminim Euro - 34Dolar - 32",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5470314",
  "comments": [
    {
      "author": "Vispilio",
      "created_time": "October 14, 2023, 01:01:00 PM",
      "body": "Quote from: forceoffog on October 14, 2023, 11:12:12 AMBenim tahminim Euro - 34Dolar - 32İkisi de 50'nin üzerine çıkarsa hiç şaşırmayın, kırılma noktasına doğru gidiyor Türkiye ekonomisi, faizlerin arttırılması hiçbir işe yaramadıkça dış dünya da reel enflasyonun 100% üzerinde olduğuna, TÜİK'in sahte bir kurum olduğuna iyice ikna olacak, kur hareketlerini ondan sonra izleyin...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "totti67",
      "created_time": "October 14, 2023, 01:12:20 PM",
      "body": "Beklentiler ve gerçekler, hükümet kanadının ekonomik yanlislarda uzun süre ısrar etmeleri neticesinde çok da uzun sayılmayacak sürede döviz kuru neredeyse 7 katına geldi. Nas burada dururken size ne oluyor ile yola çıkıp, zorda kalınca u dönüşü istikamet değiştirenlere aslında sormak lazım biz nasıl bu hale geldik diye. Hepimizin elbette bir öngörüsü var konuya ilişkin ama tünelin henüz en karanlık yerini görmedik, sonundaki ışığı hiç dusunemiyoruz o yüzden.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bthd",
      "created_time": "October 14, 2023, 07:53:41 PM",
      "body": "Bir şeyin öngörülebilir olması için onu şekillendirecek şeyinde öngörülebilir olması gerekir. Döviz kurlarını birinci dereceden etkileyen kurum merkez bankamız ve dünya üzerindeki hiç kimsenin öngöremeyeceği hareketler sergilediler geçtiğimiz bir kaç senede. Tüm dünya tarafından kabullenilmiş bilimsel yöntemler yerine enflasyon artarken hızla faiz düşürerek, para basımını arttıracak KKM benzeri uygulamaları başlatarak Türk Lirasının tüm diğer paralar karşısında rekor değer kaybına uğramasına sebep oldular.Geçtiğimiz genel seçimlerden beri Mehmet Şimşek'in varlığı ve seçim ekonomisinin geride bırakılması sonucu tekrar bilimsel yöntemlere dönülmüş görünüyor olsa da burasının Türkiye olduğu bir gecede çok şeyin değişebileceği göz önüne alındığında (bakanın görevden alınması, siyasi krizler v.b.) yapılan tahminlerin hepsi boş çıkar. Geçmişte defalarca olduğu gibi sabit kur rejiminde olmasak bile tek gecede birilerinin hayatını değiştirecek değişiklikler görebiliriz.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "püsür",
      "created_time": "October 15, 2023, 06:52:50 AM",
      "body": "Bence de akp'nin yapacağı hiçbir şeye artık şaşıramayız. Bakanı da gönderebilirler, savaşa da girebilirler vs. Ama yerel seçimlere kadar gene ne yapıp edip tutacaklardır. Gene saçma sapan vaatler ve işler göreceğiz muhtemelen. Bu seçimde istanbul ve ankara'yı almak için her şeyi yapacaklardır. Eğer muhalefetin oyları yüksek gelecekse daha çarpıcı şeyler görebiliriz ama bunların faturasını da seçimden sonra çok acı şekilde biz ödeyeceğiz. Seçim sonrası ekonomide tam sıkılaşma ve kaçınılmaz bir yükseliş olabilir. Ama önümüzdeki haftada bile Mehmet Şimşek gönderilebilir yani akp bu...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "verbakalim",
      "created_time": "October 15, 2023, 07:49:12 AM",
      "body": "Seçime kadar bir değişiklik olmaz. Söylenen dolar karşılığı ne ise o satışlar ile tutulmamalar devam eder. Faiz konusu yüksele bilir. Bize etkisi aynı olacaktır. Mevcut yönetim dışarıya ve gelecek olan yatırımlar için pembe tablo çizileceğinden güven verileceğinden dolayı kolayce gözden çıkarılmaz. Sonuç Anayasanın değiştirilmesi çabası var. Ekonomi nasıl isterse öyle olsun. Önemli olan halka açıklanmayan gizli ajandalar.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gospodin",
      "created_time": "October 15, 2023, 09:40:55 AM",
      "body": "2,5 ay + 365 günden bahsediyorsak ne olacağını kestirmek çok zor. ocak 2023'te dolar kuru 19 lira idi ve türlü hareketlere rağmen yalan dolar kuru şu an 28 lira. kkm'ye yeni girişler kapatıldı ama içeridekiler hala devam edebiliyor yine de oradan çıkışlar devam edecektir. bist bir yere kadar insanların tl'de kalmasına olanak tanır ama önümüzdeki süreçte bizimle alakalı olmasa da çevremizde çıkacak, özellikle balkanlar'da, bir savaş ile ortalık yine kaynayabilir. paranıza sahip çıkın dostlar. ister kripto ister fiat para olsun sıkı sarılın.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ZekiBeyy",
      "created_time": "October 15, 2023, 11:56:45 AM",
      "body": "2024 yılı yıl başı olarak mı kast ettiniz yoksa ocak ayı ile aralık ayı arasında kur da ciddi fark oluşuyor. Döviz kuru için hükümetin söz sahibi olduğunu düşünmüyorum, döviz rezervi -65 milyar doların üzerinde yani hiç dolarımız olmanası için 65 milyar dolar lazım. Yıl sonuna 2,5 ay kaldı olağan üstü bir durum olmazsa dolar kuru yılı 29-30 liradan kapatır. 2024 yılı ile birlikte maaş zamları sonrası döviz kuruda hareketlenmeye başlayacağını düşünüyorum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zonefloor",
      "created_time": "October 15, 2023, 03:29:39 PM",
      "body": "Genel olarak yorumlara baktığımda herkes yükseleceğinden yana bir düşünceye sahip. Açıkçası bende bu düşünceye sahibim. Seçimden sonra piyasada ki herşey serbest bırakılacak diye düşünüyorum ve bu da hem piyasanın hemde ekonomik olgulrın çok kötü yükseleceğini gösteriyor.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "flyingcarpet",
      "created_time": "October 15, 2023, 04:09:35 PM",
      "body": "Quote from: forceoffog on October 14, 2023, 11:12:12 AMBence bu artma gidisati biraz daha articak ve yeni yila girince biraz stabillenicek ondan sonrada cok ani bir yukselme bir daha olabilir umarim olmaz.Benim tahminim Euro - 34Dolar - 32Ülkemizde öngöremediğimiz şeylerden biri ile ilgili soru sormuşsunuz. İnatla sürdürülen politikaların sonunda dolar yürüdü gitti ve şimdi toparlanmaya çalışılıyor. Tekrardan yanlış bir politika izlenmeyeceğinin bir garantisi yok. Şimdi yapılan politikalar gerekli etkiyi göstermedi ve etkiyi göstermesi için tarih veriliyor. Yani hal böyleyken tahmin yapmak çok zor. Önümüzde seçimler var ve seçimlerde birçok şey değişebilir. O yüzden yapacağımız tahminlerin tutma olasılığı çok düşük. Doların ve euronun yükselmemesini temenni ediyorum deyip konuya yorumumu bırakıyım.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EFS",
      "created_time": "October 15, 2023, 04:14:52 PM",
      "body": "Yeni yılda Dolar ve Euro kurlarının şimdikinden yüksek olacağı aşikar ancak nereye kadar gideceği konusunda yapılan tahminler basit birer sayıdan ibaret kalıyor. Açıklanan orta vadeli program sonrası 2024 yılı dolar tahmini 36.80 TL olarak öngörüldü. Yarın ne olacağı bile tahmin edilemeyen bir ortamda bir sayı vermem gerekirse benim tahminim:1 Dolar = 42 TL1 Euro = 44 TL (Pariteyi 1,05 olarak hesapladım)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "totti67",
      "created_time": "October 15, 2023, 05:42:56 PM",
      "body": "Quote from: EFS on October 15, 2023, 04:14:52 PMYeni yılda Dolar ve Euro kurlarının şimdikinden yüksek olacağı aşikar ancak nereye kadar gideceği konusunda yapılan tahminler basit birer sayıdan ibaret kalıyor. Açıklanan orta vadeli program sonrası 2024 yılı dolar tahmini 36.80 TL olarak öngörüldü. Yarın ne olacağı bile tahmin edilemeyen bir ortamda bir sayı vermem gerekirse benim tahminim:1 Dolar = 42 TL1 Euro = 44 TL (Pariteyi 1,05 olarak hesapladım)Hocam JPMorgan a göre paramızın ucuz olduğu ile ilgili konu paylaşmıştım, habere göre paramızın adil değeri şu anda bile 37.5 olarak değerlendiriliyordu. Mevcut ekonomi yönetiminin aldığı kararlarin uzun vadede devam etmesi gerekiyor, Mart seçimi ister istemez birçok kararlarına aykırı hareket etmelerini gerektirecek, seçmeni kendilerine konsolide edebilmek için her seçim öncesi kullandıkları argümanlara yine sarilacaklar şüphesiz ama bunun her anlamda etkilerini çok geçmeden görmeye de başlarız. 2024 un ilk yarısı bitmeden dovizde sizin belirttiğiniz rakamları görmemiz muhtemel her halükarda.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mandown",
      "created_time": "October 16, 2023, 08:11:47 AM",
      "body": "Seçime kadar para tutulmaya devam edilecek seçimden sonra korkulacak birşey kalmayacağı için tutulmaktan vazgeçilecek sonuçta hala para basılmaya devam ediliyor. Birde hala yabancı ülkelerin çoğu hala ülkemizi yatırım yapılabilir durumda olduğunu düşünmüyor. Paramız gerçek değerine ulaşana kadar yükselmee malesef devam edecek. Bu yükseliş sanırım ciddi anlamda yukarıda bir yer.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Distraction",
      "created_time": "October 16, 2023, 09:40:17 AM",
      "body": "Sata sata rezerv kalmadı da anca dolar ve euro bu seviyelerde kaldılar. Yoksa örneğin doların gerçek değerinin ben şu an 35 liradan aşağı olduğunu düşünmüyorum. Hatta yanlış hatırlamıyorsam Goldman Sachs da bu yönde açıklamada bulunmuştu. Şu an hala 28 lira civarında seyrediyor olması bile bana göre bir mucize.Arka planda neler oluyordur şu an bilemiyorum. Artık rezerv satma gibi bir şey yapabildiklerini de sanmıyorum. O yüzden yeni yıla herhalde doların 30 lira üzerine çıktığı bir senaryoda gireriz.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MostarCoin",
      "created_time": "October 16, 2023, 05:30:42 PM",
      "body": "Dolar 30-35-41-48 Euro 32-36-43-492024 çeyrek dönemlerde dövizin gidişatı olacak.Şimdiden hepimize geçmiş olsun.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "halloweenn666",
      "created_time": "October 20, 2023, 03:19:35 PM",
      "body": "Normalde çoktan 40 lira olmasi gerekiyordu Olmadığı için 2024 te 100 TL üstü bekliyorum ytd",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "W Jr.",
      "created_time": "October 21, 2023, 06:25:51 AM",
      "body": "Ekim ayındayız ve şimdiden dolar 28, Euro 30 lira olmuş durumda.26 Ekim tarihinde yeni faiz kararı açıklanacak.Bu karara göre hareket edebilir elbette.2024 için işler yolunda giderse sizin verdiğiniz rakamlara ulaşılabilir eğer işler yolunda gitmezse daha kötü senaryolar gerçek olabilir, daha yukarıda rakamları konuşabiliriz.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "totti67",
      "created_time": "November 18, 2023, 05:37:47 PM",
      "body": "Kasım ayı ortasını geçtiğimiz bu günlerde USD 29 liraya, Euro ise 31 liraya dayandı gibi, bu seviyeleri ne kadar korur bilmiyorum ama emin olduğum birşey var ki önümüzdeki yılın ilk yarisinda dolar 32 lirayı Euro ise 36 lirayı görebilir. Yıl sonunda ise 37-40 rakamlarını görmüş olabiliriz.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Silence Scream",
      "created_time": "November 19, 2023, 01:36:00 PM",
      "body": "Quote from: totti67 on November 18, 2023, 05:37:47 PMKasım ayı ortasını geçtiğimiz bu günlerde USD 29 liraya, Euro ise 31 liraya dayandı gibi, bu seviyeleri ne kadar korur bilmiyorum ama emin olduğum birşey var ki önümüzdeki yılın ilk yarisinda dolar 32 lirayı Euro ise 36 lirayı görebilir. Yıl sonunda ise 37-40 rakamlarını görmüş olabiliriz.Euro 31 lirayı geçti hocam takip edememiş olabilirsiniz. 31.25 lira gibi bir fiyata sahip şimdilerde ve hala fiyat olarak yukarıya çıkma potansiyelini taşıyor. Benim için ve sizin için Dolar veya Euro yatırım aracı olamaz. Eğer paramızı enflasyondan korumak istiyorsak çevireceğimiz emtia olur. Paramızı değerlendirmek istiyorsak Bitcoin en doğru tercihlerden birisi olur. Bunun dışında da altın güzel bir seçenek olur. Konu, 2024 tahminine gelirse Dolar 35, Euro 38 liranın üstüne rahatlıkla çıkar diye düşünüyorum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kriminall",
      "created_time": "November 19, 2023, 02:45:14 PM",
      "body": "İlk mesajdaki tahmin sanırım bayağı aşağıda kalacak 2024 yılında, çünkü yeni mali düzenle birlikte kurumlara gönderilecek milyarlarca lira tedavüle girecek, bunun dışında dolaşıma sokulan paralar, yapılan zamlar neticesinde piyasada ciddi Türk lirası dolaşımda artacak, bunun sonucunda bence Euro 40 olur, dolar 38 liralar civarında seyreder bence, bu fiyatlarda tutulması yeni yıldan sonra çok zor,",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}