{
  "id": "topic_5402061",
  "title": "PUSS Token",
  "author": "PUSS Token",
  "created_time": "June 10, 2022, 09:46:48 AMLast edit: June 15, 2022, 01:54:55 PM by PUSS Token",
  "content": "Hello commeownity!  If you're a hunter of gems which are not yet listed on either Coinmarketcap or Coingecko, then I invite you to check our project out:ANN thread: https://bitcointalk.org/index.php?topic=5402054.0Website: https://pussdao.com/Twitter: https://twitter.com/PussDAOTelegram: https://t.me/pussDAOEnjoy!   Let me know if you think this is a new gem in the cryptocurrency market..",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5402061",
  "comments": [
    {
      "author": "keyscore44",
      "created_time": "June 10, 2022, 11:27:18 PM",
      "body": "I found your project some time ago. I have to admit that you have created memecoin with a lot of use cases. I really like the DAO option and the fact that a small % of each transaction goes to the hodlers. Thanks to this, the longer someone keeps tokens, the more they earn. This is definitely a very good way to encourage investors to keep your tokens as long as possible. I also like your charity idea.In my opinion, your project is a real gem at the moment!Good luck!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Xal0lex",
      "created_time": "June 11, 2022, 10:30:43 PM",
      "body": "Real Gems rarely advertise openly at the start  Token issue is just huge, why such huge amounts, it's better to conduct denomination and remove a few extra zeros, and it will affect the price too. Because tokens which price looks like that (for example 0.000000003670) very rarely succeed, except maybe shib with its big issue. In general, when you look at such projects, which have a huge issue, they do not inspire much trust.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptomaniac_xxx",
      "created_time": "June 11, 2022, 10:48:49 PM",
      "body": "Of course, we all are gem hunter here, those projects that can give us 100x minimum in the future. But it's hard to find because new projects doesn't have use case and then just boarding the hype train.I haven't check your project yet, but then again, every investors should do their due diligence first to investigate and see it for them and not listen to anyone. Gem or not, hopefully, your project will thrive because it's hard right now specially that we are in a bear market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yogee",
      "created_time": "June 11, 2022, 10:52:43 PM",
      "body": "Hehe just because your project is unknown doesn't mean it's already a gem. It will probably stay unpopular until you abandon it because it's not profitable. Just because it has \"use case\" still doesn't mean it's a gem. There are plenty of similar tokens out there that have similar concept and probably copied some of them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Desmong",
      "created_time": "June 11, 2022, 10:55:21 PM",
      "body": "Wow, that could be a good project with strong features and utility. Currently with the look of the market, I am not after any gem coin that are in the market. We don't know the next move  of the market right now whether Bitcoin will be continuing the bull trend or the bear will take over. I will try and checkout your project later and get more information about it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "June 12, 2022, 09:18:00 AM",
      "body": "Quote from: PUSS Token on June 10, 2022, 09:46:48 AMLet me know if you think this is a new gem in the cryptocurrency market..  It is not a gem until it proven some potential on the market. Any project can be called like that asbling as the price would increase and has a super low marketcap. Buy a real gem should be something that even without market manipulations would panned out the best in it.Observing the project not really impress though.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joeperry",
      "created_time": "June 12, 2022, 10:03:35 AM",
      "body": "Not really a good gem hunter, but I got curious by this coin. I would like to ask why do you think his coin is a gem? I mean what are the criteria to consider a token to be a gem? By gem meaning that it would possibly pump, right? Or do you mean a really good project?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tvplus006",
      "created_time": "June 12, 2022, 10:56:31 AM",
      "body": "Quote from: PUSS Token on June 10, 2022, 09:46:48 AM...Let me know if you think this is a new gem in the cryptocurrency market..  Before inviting users to visit your site, you need to install the HTTPS protocol, since many users avoid visiting such sites. You obviously know that all browsers mark sites using HTTP connections as unsafe and can lead to data theft. So, you need to get an SSL certificate, and after that we will examine your \"gems\".",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "goaldigger",
      "created_time": "June 12, 2022, 11:21:55 AM",
      "body": "Quote from: tvplus006 on June 12, 2022, 10:56:31 AMQuote from: PUSS Token on June 10, 2022, 09:46:48 AM...Let me know if you think this is a new gem in the cryptocurrency market..  Before inviting users to visit your site, you need to install the HTTPS protocol, since many users avoid visiting such sites. You obviously know that all browsers mark sites using HTTP connections as unsafe and can lead to data theft. So, you need to get an SSL certificate, and after that we will examine your \"gems\".I also hesitant to visit their site because of this and claiming as a new gem in this market is quiet an old trick here to attract traffic and investors. Finding a gem is too hard nowadays since most of them are just living with the hype and then after that, they will exit the market along with the money of the investors. Better to be careful on dealing with the project claiming to be good, do your due diligence to analyze this project don't rush to invest and make time to analyze, this is very important.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kesmex",
      "created_time": "June 12, 2022, 11:39:35 AM",
      "body": "Quote from: joeperry on June 12, 2022, 10:03:35 AMNot really a good gem hunter, but I got curious by this coin. I would like to ask why do you think his coin is a gem? I mean what are the criteria to consider a token to be a gem? By gem meaning that it would possibly pump, right? Or do you mean a really good project?GEM altcoins do come from us speculating according to price, and fundamentals of course, and one of the requirements for GEM altcoins is to have a ranking below the top 100 coinmarketcap or even below the top 200 coinmarketcap,because many speculate about gem altcoins have a low marketcap, and when marketcap up 10x that's the GEM altcoin",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fedelowe",
      "created_time": "June 12, 2022, 09:47:22 PM",
      "body": "Quote from: PUSS Token on June 10, 2022, 09:46:48 AMHello commeownity!  If you're a hunter of gems which are not yet listed on either Coinmarketcap or Coingecko, then I invite you to check our project out:ANN thread: https://bitcointalk.org/index.php?topic=5402054.0Website: www.pussdao.comTwitter: https://twitter.com/PussDAOTelegram: https://t.me/pussDAOEnjoy!   Let me know if you think this is a new gem in the cryptocurrency market..  i would like you to see the gem which i found, the project name \"reptile chronicles\", check that, reply with your opinion will be cool",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Piesel",
      "created_time": "June 12, 2022, 10:22:57 PM",
      "body": "Am done with hunting gems now, since most of the new projects end up as scams or never meet up with their road maps. So I don't find new projects attractive anymore.  But all the same, I wish you Goodluck with the development and progress as you go.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jating",
      "created_time": "June 12, 2022, 10:24:34 PM",
      "body": "Quote from: tvplus006 on June 12, 2022, 10:56:31 AMQuote from: PUSS Token on June 10, 2022, 09:46:48 AM...Let me know if you think this is a new gem in the cryptocurrency market..  Before inviting users to visit your site, you need to install the HTTPS protocol, since many users avoid visiting such sites. You obviously know that all browsers mark sites using HTTP connections as unsafe and can lead to data theft. So, you need to get an SSL certificate, and after that we will examine your \"gems\".Lol, so it means that the website was not yet fully operational and I'm afraid that majority of investors are not going to trust any site without at least an HTTPS protocol because it's very dangerous and unsafe.And with that, I think the OP has lot of understanding to need in this community. Specially like shilling for a supposedly new project and call it a gem On the other hand it could really not help them in the long run, and it could boomerang on their reputation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gozie51",
      "created_time": "June 12, 2022, 11:04:53 PMLast edit: June 12, 2022, 11:17:15 PM by Gozie51",
      "body": "It is more like it is going to be pump coin and after awhile it gets abandoned to fall out of the market. It is not yet in the market and so it popularity is yet to be tasted. It looks like sometimes if I could remember a token called dogdata or something but I'm sure it has dog as the name, it had a bounty hunting two years back but I don't remember if they distributed tokens to hunters or not, or exited. I checked on CMC now, is not there. Such names associated with domestic animals have been heard and they are just memecoins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TelolettOm",
      "created_time": "June 12, 2022, 11:15:36 PM",
      "body": "I am not sure if it is exactly a gem project or not. I am also not a gem hunter because it is too risky, isn't it? if we think that a new project is considered a gem, how can they ensure it? And if we have put our money into them, will it guarantee that it is truly a gem? I don't think so. So, it is more to gambling when putting our money into such a project, because we don't know whether it is really a gem or shit project. That is why, for me, especially the one who doesn't really know or understand how to analyze a project a gem or not, will be better to be more careful and wiser. but here, I appreciate your effort and for your project, I hope that your team will really work hard to do it and hope your project will really develop very well.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Slow death",
      "created_time": "June 12, 2022, 11:27:39 PM",
      "body": "I'm not a gem hunter, in fact even established altcoins got scared after seeing what happened to Luna. I saw your site and I couldn't find who the team members are, can you tell us why the team members are anonymous? I also didn't find any date for when this altcoin will be listed on some exchange, and on coingecko and coinmarketicap, about altcoin use case, in and something that other projects offer and knowing that we are in a bear market allied to the recent case of related heartbreak to Luna I would say that it is not a good time to launch a new project and hope that it has some good results, the whole market is undergoing eviction so people would not be spending money to invest in new projects, they are selling altcoins to keep stablecoins",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "uneng",
      "created_time": "June 13, 2022, 12:52:16 AM",
      "body": "Well, that is another meme coin, which is being developed to contrast the dogs thematic of doge and shiba inu, through a new cats theme on this case. Besides this simple explanation, another purpose mentioned by the project to exist is the goal of donating to help cats around the world which aren't treated properly and live precariously. It's a mix of memecoin and charity.I just think if your goal is to help cats, couldn't you adopt an existing altcoin or bitcoin in order to ask for donations from the public? Is it really necessary to create a new altcoin to help animals?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PUSS Token",
      "created_time": "June 16, 2022, 10:04:30 AMLast edit: June 16, 2022, 10:31:30 AM by PUSS Token",
      "body": "Thank you for such a great interest in our project. We are sorry that you have to wait for replies, but the current market situation make that we had to deal with some very urgent cases first. I will try to answer all questions and doubts, if I missed something, you can ask a question directly in our ANN thread at any time: [ANN] PUSS Token 😺 Cats together strong! Global meme currency is finally here!Quote from: Xal0lex on June 11, 2022, 10:30:43 PMReal Gems rarely advertise openly at the start  Token issue is just huge, why such huge amounts, it's better to conduct denomination and remove a few extra zeros, and it will affect the price too. Because tokens which price looks like that (for example 0.000000003670) very rarely succeed, except maybe shib with its big issue. In general, when you look at such projects, which have a huge issue, they do not inspire much trust.Memecoins are famous for token issuance in large numbers, it has been conceived by DOGE and has been continued by other memecoins ever since. There are several successful tokens on the market with trillions or quadrillions in circulation, including FLOKI, BABYDOGE, SAFEMOON, KISHU and DOGELON and the total addressable market for memecoins is probably still the biggest vertical in the cryptocurrency. The unit bias almost all memecoins utilise enables individuals to buy billions of tokens for a fraction of price of other cryptocurrencies. This has a large and positive effect on many people who just start their journey with crypto.  Our team wants to meet “industry” standards in this regard.Quote from: cryptomaniac_xxx on June 11, 2022, 10:48:49 PMI haven't check your project yet, So let me know when you do..  Quote from: Yogee on June 11, 2022, 10:52:43 PMHehe just because your project is unknown doesn't mean it's already a gem. It will probably stay unpopular until you abandon it because it's not profitable. Just because it has \"use case\" still doesn't mean it's a gem. There are plenty of similar tokens out there that have similar concept and probably copied some of them. While many new memecoins have almost  zero use case, being inherently speculative assets in nature, we aspire to build a sustainable  foundation of PUSS. First and foremost, with every buy and sell of a token our DAO treasury tops-up. The funds raised will be used to buy metaverse land, metaverse items and NFTs, flipping these goods for profit. While most cryptocurrency users don’t have the purchasing power to buy these assets themselves, we believe in the collective ability of our holders to buy non-fungible assets,  lowering the entry barrier and reducing the amount of capital needed for individuals to purchase expensive and remarkable blockchain goods.$PUSS can also serve as a crowdfunding tool to buy and own scarce physical/digital cat-related items that  will later be utilised as fractional NFTs (like DogeNFT, NyanCat NFT - $ArbiNYAN).In addition, PussDAO, by design, is also charitable in nature. We will use a portion of the funds raised trades to help cats in need, both  locally and globally. As the  community grows, members can shape the direction in which charitable donations will go. Quote from: tvplus006 on June 12, 2022, 10:56:31 AMBefore inviting users to visit your site, you need to install the HTTPS protocol, since many users avoid visiting such sites. You obviously know that all browsers mark sites using HTTP connections as unsafe and can lead to data theft. So, you need to get an SSL certificate, and after that we will examine your \"gems\".The SSL was up and running all the time, but I incidentally included the link which directs to the version of the site without SSL. The issue has been fixed already and the proper link is included in the beginning of this thread. Quote from: uneng on June 13, 2022, 12:52:16 AMWell, that is another meme coin, which is being developed to contrast the dogs thematic of doge and shiba inu, through a new cats theme on this case. Besides this simple explanation, another purpose mentioned by the project to exist is the goal of donating to help cats around the world which aren't treated properly and live precariously. It's a mix of memecoin and charity.I just think if your goal is to help cats, couldn't you adopt an existing altcoin or bitcoin in order to ask for donations from the public? Is it really necessary to create a new altcoin to help animals?Every PUSS buy, sell and transfer tops-up the charity wallet. The funds raised this way can be spent according to the choice of the community thanks to PussDAO, our decentralized autonomous organization. PUSS team does not ask for donations, we simply intend to use funds from PUSS trading volume and peer to peer exchange within the community.Provided that PUSS entitles governance rights to the cat-focused charity fund and each trade is taxed 1%, that goes directly to the fund, it is much easier for us to do this in native token than Bitcoin and altcoin. While there are many memecoins which successfully contribute to the charity, PUSS aims to focus solely on cat-related purposes.If you feel that your question has been omitted or you have not received a sufficient answer, please specify your question or contact the administrators of our Telegram chat: https://t.me/pussDAORegards, PUSS Token Team",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "keyscore44",
      "created_time": "June 17, 2022, 11:20:22 PM",
      "body": "I have read your articles on Medium, but I have not been able to find any details about staking of your tokens. I understand that this is not possible at the moment, but do you have in your plans to make an option of staking Puss Token in the future?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}