{
  "id": "topic_5411850",
  "title": "calvinweight",
  "author": "calvinweight",
  "created_time": "August 31, 2022, 08:55:27 AM",
  "content": "Bitcoin will close the monthly candle tomorrow night and we are on track for a serious train wreck. If we close on the 2017 high, we are looking to breakdown. A $14,000 BTC is very realistically on the table. We want to be ready for that. For further data on why I believe this listen to this: https://youtu.be/r2-vGFKCUng",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5411850",
  "comments": [
    {
      "author": "Oshosondy",
      "created_time": "August 31, 2022, 09:07:12 AM",
      "body": "This may be more of sentiment:Lowest bitcoin price in June: $17600Lowest price in July: $18800In August as of now: $19510Maybe the lowest price in September would be over $20000, I am not thinking that bitcoin price would decrease lesser, but I am thinking that $27000 can be the highest price while over $20000 to be the lowest price. Just a prediction, but I believe if you buy bitcoin now, it would be profitable for swing trading.I did not just make this conclusion, but also by comparing 2018 bear market with this time bear market. Bitcoin may never go below $17600 again.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "crwth",
      "created_time": "August 31, 2022, 09:14:25 AM",
      "body": "Better be careful with what could happen if that's what you think. I think it's still best that you have plans in case whetherBTC would rise in priceBTC would decline in priceSo if it's the first one, you need to have BTC stored in your wallet.It's better that it's your wallet. For the second one, you need to have converted your BTC so you could profit as much as you could.For me, I'm just going to keep BTC stored because I would want to HODL it more and more as time goes by because that's what I believe in.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "calvinweight",
      "created_time": "August 31, 2022, 09:24:12 AM",
      "body": "Having notice like this can help a lot emotionally if the worst happens. I am a proponent of long term hodling. Times like this also provide really nice entry points for averaging in or buying chunks.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "buwaytress",
      "created_time": "August 31, 2022, 09:39:49 AM",
      "body": "Quote from: crwth on August 31, 2022, 09:14:25 AMBetter be careful with what could happen if that's what you think. I think it's still best that you have plans in case whetherBTC would rise in priceBTC would decline in priceThere are times I really wish I would have some sort of plans for BTC decline, think objectively, when I see the way I've just held all the way (liquidating when I need, rather than when I think it's going to fall), I feel like I missed a lot of opportunities.Then again, once new ATH is reached -- be it next year or in 2 or 3 years -- all that regret's wiped away.Feels strange to see higher lows in 3 consecutive months and yet sentiment has, at best, remained neutral.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "wagmi",
      "created_time": "August 31, 2022, 02:02:41 PM",
      "body": "Can only get better because we know about Bitcoin's potential. When you see how so many weak hands have sold for obviously no reason and so much unproven FUD was produced, you can be sure how Bitcoin will go up again and it will be MASSIVE. It's not anymore 2 years until it is halving time again and at least when halving is in sight, price will be up again. 20k for one BTC is still veery low.   Quote from: calvinweight on August 31, 2022, 09:24:12 AMI am a proponent of long term hodling. Long term hodling is best and easiest way to make a big profit.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Marykeller",
      "created_time": "August 31, 2022, 02:30:06 PM",
      "body": "Being sad doesn't help in crypto. The Crypto market is unpredictable to figure out her next line of action. The current price of bitcoin is not necessarily what you and I anticipated but we are supposed to hold on and trust her next movement Am just seeing all this price fluctuation of bitcoin as another vast move of bitcoin. Presently Now, bitcoin is not steady in price(fluctuating up and down)Peradventure if bitcoin manages to stay above $22k then it is most likely that it will skyrocket to $24K. Am hopeful that there will be a positive movement in the price of bitcoin in a couple of weeks or thereabouts. Nevertheless, anything is possible to happen before then",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dragonvslinux",
      "created_time": "August 31, 2022, 02:40:53 PM",
      "body": "Call me an optimist, but personally closing above $20K doesn't make the monthly close too bearish in my view. Similar to how July's close of +16% (highest since October) wasn't that bullish in the immediate term either, despite anticipation of further upside. The real concern for me will be follow through next month moving below the July open around $20K, then continuation of the downtrend becomes much more likely, though notably buyers have defended this level for the past few days. Until then, this month has merely neutralised the bullish momentum of last month, making prices more neutral within the bear market structure. Quote from: Oshosondy on August 31, 2022, 09:07:12 AMLowest bitcoin price in June: $17600Lowest price in July: $18800In August as of now: $19510I otherwise think another way to look at this would be with the monthly closes, rather than lows:June close: $19,985July close: $23,310August close: >$20K?Therefore a monthly close below June's close would be bearish, but otherwise finding buyers below the lowest monthly close in the past 20 months is somewhat less bearish...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Baofeng",
      "created_time": "August 31, 2022, 10:18:13 PM",
      "body": "Quote from: crwth on August 31, 2022, 09:14:25 AMBetter be careful with what could happen if that's what you think. I think it's still best that you have plans in case whetherBTC would rise in priceBTC would decline in priceSo if it's the first one, you need to have BTC stored in your wallet.It's better that it's your wallet. For the second one, you need to have converted your BTC so you could profit as much as you could.For me, I'm just going to keep BTC stored because I would want to HODL it more and more as time goes by because that's what I believe in. Yeah, I think the best plan is to do nothing, just simply HODL, don't liquidate anything and accumulate.I think if we close above $20k, there's nothing to worry though short term, this is the average monthly closes for the last 3 months so we are still in the boundary and limit of the bear market and I don't think that we are going to see another lower lows at the end of the year.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kawetsriyanto",
      "created_time": "August 31, 2022, 10:47:47 PM",
      "body": "Quote from: Oshosondy on August 31, 2022, 09:07:12 AMThis may be more of sentiment:Lowest bitcoin price in June: $17,600Lowest price in July: $18,800In August as of now: $19,510Maybe the lowest price in September would be over $20000, I am not thinking that bitcoin price would decrease lesser, but I am thinking that $27000 can be the highest price while over $20,000 to be the lowest price.If we analyze the monthly ATL of Bitcoin price in the last 3 months, the ATL of next month should be above $20000. But don't forget that Bitcoin price move is surprisingly sometimes, it doesn't always return the same patterns. Moreover, we are heading Q4 of 2022 (the first year of bearish season), I am sure there is a chance that Bitcoin to drop again below $20,000 before we have a new year. We must realize that whales have a power to manipulate the Bitcoin price to drop again and they can buy more to fill their bags before they close it and wait for the bullrun.Quote from: Oshosondy on August 31, 2022, 09:07:12 AMI did not just make this conclusion, but also by comparing 2018 bear market with this time bear market. Bitcoin may never go below $17600 again.What do you compare between 2018 bear market and 2022 bear market?I don't get the point about the way you determine BTC won't drop again around $17,600.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OgNasty",
      "created_time": "September 01, 2022, 12:17:10 AM",
      "body": "It could have been a lot worse.  We're still comfortably above the lows as we approach the time we'd typically see a bottom in the 4-year cycle.  Regardless of how ugly things may appear, I believe people would be wise to start accumulating and dollar cost averaging back into the market if you've been on the sidelines or got out at higher levels.  I think in another couple months the upward march will begin anew.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kemarit",
      "created_time": "September 01, 2022, 12:34:55 AM",
      "body": "Quote from: OgNasty on September 01, 2022, 12:17:10 AMIt could have been a lot worse.  We're still comfortably above the lows as we approach the time we'd typically see a bottom in the 4-year cycle.  Regardless of how ugly things may appear, I believe people would be wise to start accumulating and dollar cost averaging back into the market if you've been on the sidelines or got out at higher levels.  I think in another couple months the upward march will begin anew. I agree, we are still on the $20,000 and didn't go down that low for this month, so it could be a lot worse and thankfully the bulls was able to put up a good fight at the last day of the month.For sure, we have been preaching that we should do DCA in this bear market and just continue to accumulate. Specially for others who don't want to trade daily. It will just make sense to buy and then HODL and have a lot of patience. Sooner or later this will be over for us, bull run will eventually have to enter the picture. And so we should take advantage right now. Wealth is build on this bear market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "crwth",
      "created_time": "September 01, 2022, 02:40:55 AM",
      "body": "Quote from: buwaytress on August 31, 2022, 09:39:49 AMThere are times I really wish I would have some sort of plans for BTC decline, think objectively, when I see the way I've just held all the way (liquidating when I need, rather than when I think it's going to fall), I feel like I missed a lot of opportunities.I think that's the downside of just HODL-ing and you are not going to do anything about it. You can't maximize all the opportunities given by the market. Quote from: buwaytress on August 31, 2022, 09:39:49 AMThen again, once new ATH is reached -- be it next year or in 2 or 3 years -- all that regret's wiped away.That's true for sure but still it can be maximized but the problem there is the timing of the market is just really hard and unpredictable.Quote from: Baofeng on August 31, 2022, 10:18:13 PMYeah, I think the best plan is to do nothing, just simply HODL, don't liquidate anything and accumulate.That's the safest way that you could do it because you won't be risking anything other than the amount you are investing in. It's up to you if you are going to be affected by the fluctuation of the market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fundamentals Of",
      "created_time": "September 01, 2022, 03:04:52 AM",
      "body": "Of course we'd be closing in the 2017 high or at least around that price. What do you expect? It's just a matter of hours before the monthly closing candle would be known and the price is just playing around $20,000. Whatever happens, it is definitely hard for the price to let go of it. So more or less we'd have to settle with $20,000. But it is somehow good that $20,000 is now serving as a strong support. So it could also be a platform for a rebound anytime soon.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}