{
  "id": "topic_5447074",
  "title": "thecodebear",
  "author": "thecodebear",
  "created_time": "March 31, 2023, 11:23:35 PM",
  "content": "Do you all consider Bitcoin the best asset in the world or do you think there are other assets with as much potential for safe long term appreciation?By best asset I mean potential for long term return on investment versus potential for risk. Return vs risk.Just curious to see what people think.Personally I think Bitcoin is easily the best asset in the world. Ethereum is probably the second best asset in the world but it is far riskier due to centralization and lack of clear purpose or utility and lots of possible future competition form other L1s and I think its days of growing significantly faster in price appreciation than Bitcoin are mostly over so the growth possibilities compared to the much greater risk I think leaves it far below Bitcoin when considering which is a better financial asset. I guess the one benefit it now has is income through staking but that isn't nearly enough to make up for the other disadvantages.And beyond that I can't think of anything else that would even be in the conversation for best asset outside of like owning a really good rental property in a booming city but that is very specific and requires good financing and a fair bit of luck and work to accomplish.Think of it this way, if you had to put all your money in a single asset, would you put it in anything but Bitcoin? I already made that decision years ago by putting just about all my money in Bitcoin. But how about you all? Where do you land on this question?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5447074",
  "comments": [
    {
      "author": "hatshepsut93",
      "created_time": "March 31, 2023, 11:33:04 PM",
      "body": "No, I think real estate is the best asset. People will always need a place to live, so there will always be demand for it. While Bitcoin's value is impossible to calculate. We don't even not if it's overpriced or underpriced today. There's no good model for calculating Bitcoin's price. The worst case scenario is that Bitcoin is overpriced and it will return to previous levels because that's its objective value.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "thecodebear",
      "created_time": "March 31, 2023, 11:51:15 PM",
      "body": "Quote from: hatshepsut93 on March 31, 2023, 11:33:04 PMNo, I think real estate is the best asset. People will always need a place to live, so there will always be demand for it. While Bitcoin's value is impossible to calculate. We don't even not if it's overpriced or underpriced today. There's no good model for calculating Bitcoin's price. The worst case scenario is that Bitcoin is overpriced and it will return to previous levels because that's its objective value. Real estate is a good answer. But to play devil's advocate here, the caveat there is all real estate is different. A piece of desert in the middle of nowhere is very different than prime real estate in a city. The good pieces of real estate are much harder to get though. Bitcoin is fungible so its much simpler to invest in Bitcoin. Also physical changes over time can change the value of real estate. If a fire destroys a house, or a food destroys a whole section of a city, suddenly that real estate is worth a lot less. Or even if a house just needs lots of repairs suddenly its worth a whole lot less. Or if crime goes up in an area the real estate is going to be worth less. That's part of the risk built into real estate investments.Which is why I said a contender could be \"owning a really good rental property in a booming city but that is very specific and requires good financing and a fair bit of luck and work to accomplish.\" Real estate is a much riskier and complex investment than stacking Sats. But I agree real estate in general, when done well and when avoiding bad luck, is in the conversation for best asset.I guess it also depends on the context. If someone needs to generate income a rental property would be preferred over Bitcoin which doesn't have cash flow. Real estate also has the advantage of mortgages where you can buy things for a fraction of the price up front, and then use credit to keep stacking properties and cover the mortgage with rental income. That of course requires lots of work. On the other hand for just growing wealth passively Bitcoin would be far superior.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Quidat",
      "created_time": "March 31, 2023, 11:59:32 PM",
      "body": "Gold, Real Estate, BitcoinThis would be my best asset for my opinion or in personal choice.If you do have the money to spend on and accumulate as serve as investment then it would definitelybe doing this.It is really just that these things turns out to be expensive if  you would turn to buy it as a whole but we know that as long we do live,theres always a chance for us to acquire and accumulate it out.Depends on how you would really be that serious into your goal.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitcoinBunny",
      "created_time": "April 01, 2023, 12:00:17 AM",
      "body": "Quote from: hatshepsut93 on March 31, 2023, 11:33:04 PMNo, I think real estate is the best asset. People will always need a place to live, so there will always be demand for it. While Bitcoin's value is impossible to calculate. We don't even not if it's overpriced or underpriced today. There's no good model for calculating Bitcoin's price. The worst case scenario is that Bitcoin is overpriced and it will return to previous levels because that's its objective value. Real estate isn't even keeping up with inflation right now. There is no telling where it is headed. Sure over a super LOOOOONG term it may work out, but even 10 years out it could be a terrible investment right now since in most parts of the world it is over priced and beyond the means of many people.On top of that it is usually not divisible and you have head aches such as maintenance, taxes and tenants and often terrible regulation always voting in their favour, that can even drive you to suicide. With interest rates rising any monthly gain may have been wiped out. Many landlords in my part of the world are in fact selling up, that will drive the price of real estate down further.With BTC there is usually only a tax when you sell and have made profit. Worst case scenario you lose it or make a loss. With real estate there is far more responsibility and far more things can go wrong and it is usually out of reach for the average Joe, unlike a small piece of BTC.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Tytanowy Janusz",
      "created_time": "April 01, 2023, 07:14:56 AM",
      "body": "Quote from: hatshepsut93 on March 31, 2023, 11:33:04 PMNo, I think real estate is the best asset. People will always need a place to live, so there will always be demand for it. While Bitcoin's value is impossible to calculate. We don't even not if it's overpriced or underpriced today. There's no good model for calculating Bitcoin's price. The worst case scenario is that Bitcoin is overpriced and it will return to previous levels because that's its objective value. People will always need a place to live, that's a fact, but it doesn't make real estate the best possible investment in terms of risk/reward. Firstly, real estate prices are inflated like before 2008 and way off the neutral levels (talking about house price to earnings ratio). The WEF shows that it seeks to deprive us of property (including real estate). It may turn out that in a few years we will see high Cadastral tax or unrealized gains taxes. Simply pay us 5% of your real estate each year or sell it.Demographics of developed countries, the risk of World War 3, nuclear escalation, the collapse of society makes investing in real estate a high-risk investment in virtually half of the globe.You need to know the industry and the region in which you are buying a property, because there is nothing more important than a good location.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "crwth",
      "created_time": "April 01, 2023, 07:20:45 AM",
      "body": "Quote from: thecodebear on March 31, 2023, 11:23:35 PMDo you all consider Bitcoin the best asset in the world or do you think there are other assets with as much potential for safe long term appreciation?I think in terms of the returns and what it can do for people in general, it's one of the best assets since it's a great hedge against inflation. It shouldn't be everything in one asset but you still need to diversify your assets. There are a lot of assets but it's not the only one that is good for you for sure. It's better to have multiple ones in order to have a great return on your money. Managing my allocation to BTC would be important for me and not everything.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DanWalker",
      "created_time": "April 01, 2023, 08:40:59 AM",
      "body": "Quote from: hatshepsut93 on March 31, 2023, 11:33:04 PMNo, I think real estate is the best asset. People will always need a place to live, so there will always be demand for it. While Bitcoin's value is impossible to calculate. We don't even not if it's overpriced or underpriced today. There's no good model for calculating Bitcoin's price. The worst case scenario is that Bitcoin is overpriced and it will return to previous levels because that's its objective value. I agree with you, real estate is the best asset in the world. I forgot about that article, but as far as I remember the survey results, real estate is the most searched and invested asset by the rich, while cryptocurrencies are only 2%. But for those with little initial capital and who want to get rich through investment, bitcoin is the best choice because, thanks to its volatility, many people can take full advantage of it for the best return. I love real estate, but with limited capital, I cannot invest in real estate. So my portfolio is also mostly bitcoin as I also hope that bitcoin will make it possible for me to earn some substantial capital.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "livingfree",
      "created_time": "April 01, 2023, 08:48:21 AM",
      "body": "I'm invested in real estate and bitcoin and I'd say that they're the best assets that I've got. Why two? They've got differences and tangible and intangible assets and I think that's justifiable to say that they're both the best assets.And I'd say that because I've got them, whoever owns these assets or other assets that have been generating them money will totally say that they're the best.But to answer the question about putting all of my money to bitcoin, I wouldn't. Its volatility needs to have a counter through another asset to balance my investments and wealth.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Adbitco",
      "created_time": "April 01, 2023, 09:26:34 AM",
      "body": "QuotePersonally I think Bitcoin is easily the best asset in the worldThere is no way you could compared bitcoin to ethereum, bitcoin is more trusted, secure and reliable than any other altcoin out there usually i don't even give attention to those coin. In some special cases if there were no bitcoin as option then i have to go for Ethereum, BNB, Matic. QuoteThink of it this way, if you had to put all your money in a single asset, would you put it in anything but Bitcoin?No i won't dare that because is extremely risky put one's life savings into in single assets not even bitcoin or any other assets out there.QuoteI already made that decision years ago by putting just about all my money in Bitcoin. But how about you all?We live in a world where we are free to make any forms of decisions we think that is good for us in as much as it won't violates the government rules or go against them then you are good to go.QuoteWhere do you land on this question? We should learned not to put all our resources into a single business, rather splitting it to more businesses maybe at least into 3 to 5 different ways in other to thoroughly safeguard our future since we may not know what it holds for us.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o48o",
      "created_time": "April 01, 2023, 11:54:14 AM",
      "body": "Quote from: thecodebear on March 31, 2023, 11:23:35 PM-cut-By best asset I mean potential for long term return on investment versus potential for risk. Return vs risk.-cut-I would rather go and buy land and estate. Land is going to be scarcer as population grows and it's needed for every sector of life. It might not bring anything to me in my life time but it also could be worth more eventually. That is if i want to invest safely, which i don't do in real life. In real life i don't trust just one asset. I buy and sell low caps as i don't have enough capital for huge purchases. Those have been very profitable to me. It's kind of like gambling as in small bets i can get huge rewards, but unlike in gambling i can sometimes be part of the team and work in grass root level.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nrcewker",
      "created_time": "April 01, 2023, 12:01:01 PM",
      "body": "Quote from: hatshepsut93 on March 31, 2023, 11:33:04 PMNo, I think real estate is the best asset. People will always need a place to live, so there will always be demand for it. While Bitcoin's value is impossible to calculate. We don't even not if it's overpriced or underpriced today. There's no good model for calculating Bitcoin's price. The worst case scenario is that Bitcoin is overpriced and it will return to previous levels because that's its objective value. The assets which are limited in number, can definitely be added to the race of best asset in the world. You can consider here non-renewable resources like coal, petroleum, gold etc. Real estate can also be considered as great asset to hold. But if we talk about digital assets, then definitely Bitcoins should be placed at number one. Physical assets take long maintenance and hard to store for long term holdings, but if we compare digital assets like Bitcoins, it can be stored anywhere and can be accessed any time. Now the decision should be yours only. Which one should be said as the best asset?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Minecache",
      "created_time": "April 01, 2023, 12:05:51 PM",
      "body": "Many people think that real estate is the best asset, this is true because with the increasing population density and the never-ending demand for housing, real estate is really the best asset. But for me, bitcoin is the asset that gives me the most profit as well as a better life since I invested in it. Both are very good, so anyone with economic conditions should not compare but should diversify and should own both of these properties.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rat03gopoh",
      "created_time": "April 01, 2023, 02:54:39 PM",
      "body": "My version of the best asset is a business that runs with consistent income.The best assets should not only be viewed in terms of value growth, while you also run the risk of losing ownership. In its 1 decade journey, bitcoin has experienced pros and cons which prove that it isn't ideal aset for certain people.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LogitechMouse",
      "created_time": "April 01, 2023, 03:29:36 PM",
      "body": "No. For me, there no best asset because all of them are the best in their own ways.Real Estate for example is best for it being very limited therefore, price is increasing, but with what's happening right now, it isn't going the way it needs to, but nevertheless, real estate's price goes up in the long term because of it's limited supply. Gold and Silver on the other hand is proven to be one of the best assets because they've been there for a very long time. Even Robert Kiyosaki holds a lot of gold and silver. Business on one hand is the best because of how much profit it can give. As long as you are successful in your business venture, it will give you profit. Bitcoin on the other hand is best because of it's volatility. Volatility makes an average investor a rich investor. Volatility can make an Average Joe a millionaire, but on the other hand, it can also make an Average Joe a beggar after a few days because of it's capital being gone. I don't want to say that Bitcoin is the best asset in the world, but if we will just look on it's returns on the past decade, no doubt Bitcoin is the best at that category.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fullhdpixel",
      "created_time": "April 01, 2023, 05:18:54 PM",
      "body": "Quote from: Minecache on April 01, 2023, 12:05:51 PMMany people think that real estate is the best asset, this is true because with the increasing population density and the never-ending demand for housing, real estate is really the best asset. But for me, bitcoin is the asset that gives me the most profit as well as a better life since I invested in it. Both are very good, so anyone with economic conditions should not compare but should diversify and should own both of these properties.I've seen so many common individuals and celebrities who have invested in real estate so you might be right with that but I think investing in real estate is not easy, not instant and may require a bigger capital. Selling it is not also instant.This is where Bitcoin becomes a better alternative, not only for real estate but also on other investment assets/instruments. Bitcoin's supply is also very limited which makes its price rise into a whole new level. No other assets including real estate can match it. If I were to diversify I will still pick crypto and I will only add some good altcoins or tokens in my bag. There is no need to look for other assets out there.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "$crypto$",
      "created_time": "April 01, 2023, 05:26:46 PM",
      "body": "Not only bitcoin there are still some assets that are more important than that and I agree with the others Real estate is the best investment where we have to diversify, of course not only in bitcoin but some assets that are important for the long term.In fact, I'm not brave enough to put everything in bitcoin, even though I believe this increase will be even sharper, but the proof is that bitcoin still has high volatility, which at any time the price will drop again, of course we don't expect that, but at least with other assets it's enough to balance it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ajiz138",
      "created_time": "April 01, 2023, 06:15:17 PM",
      "body": "Quote from: thecodebear on March 31, 2023, 11:23:35 PMDo you all consider Bitcoin the best asset in the world or do you think there are other assets with as much potential for safe long term appreciation?Of course I think bitcoin is the best asset in the world but I will not forget about other assets which are more important than bitcoin we have to be able to balance where we have to invest not just in 1 asset because for me it is not a good management stay outside of bitcoin there must be control to make a reserve asset, if you make bitcoin as the main asset it doesn't matter because you already have more important reserves too.Quote from: thecodebear on March 31, 2023, 11:23:35 PMBy best asset I mean potential for long term return on investment versus potential for risk. Return vs risk.Bitcoin is one of them, long term bitcoin is pretty good at higher returns while behind that there is a bigger risk where when the market crashes the price falls more freely isn't that a big risk too? So this is only balanced in bitcoin, while in contrast to assets that tend to be more stable, for example property, gold, or other assets that can maintain a higher price behind all of that, with the assets mentioned, of course there is no bigger risk than bitcoin.Quote from: thecodebear on March 31, 2023, 11:23:35 PMThink of it this way, if you had to put all your money in a single asset, would you put it in anything but Bitcoin? I already made that decision years ago by putting just about all my money in Bitcoin. But how about you all? Where do you land on this question?Actually it has to be a decision that is ready to take risks, I believe of all the investors who put in one bitcoin asset and do not trust other assets except for this coin, but this is not done by me, I don't dare to do it, but I believe in the prospect of achieving bitcoin in the future.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AnonBitCoiner",
      "created_time": "April 01, 2023, 06:31:53 PM",
      "body": "Bitcoin is a good asset and it increases the money if handled accurately but in my opinion property work is also a best idea to enhance money. There is always losses with gaining and no field is here which is 100 percent secure like property work also possess some risk and that of bitcoin is also a risky investment due to its volatility.It's a wise idea to make investment in Bitcoin and think it as a part time job because money in Bitcoin is that portion which you cannot spend in daily uses. Getting job is not easy these days therefore investment and trading are two option which you can easily involved in without any restrictions.Putting whole money in single asset is not good in my opinion so you can also select different coins and also you can invest your money in real estate which is the best option.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "imamusma",
      "created_time": "April 01, 2023, 06:55:44 PM",
      "body": "Quote from: thecodebear on March 31, 2023, 11:23:35 PMDo you all consider Bitcoin the best asset in the world or do you think there are other assets with as much potential for safe long term appreciation?I would rate bitcoin as one of the best assets due to its performance so far, but bitcoin is not the only good investment destination. Gold, Real Estate and anything that generates returns is best, and now it comes down to individual preferences and goals.Quote from: thecodebear on March 31, 2023, 11:23:35 PMThink of it this way, if you had to put all your money in a single asset, would you put it in anything but Bitcoin? I already made that decision years ago by putting just about all my money in Bitcoin. But how about you all? Where do you land on this question?I have bitcoin, altcoin and gold as my investment assets so far. I understand what investment risk is and anything I invest has a risk. Bitcoin is the dominant one in my investment portfolio, and so far I'm hoping it will generate a decent return in the long term. Putting your investment in a single asset is also fine, but I wouldn't do it with just bitcoins because none of us know what the future. Don't just have one investment asset, if something happens then you lose everything. So have some assets including altcoin or gold or something else that you think is profitable.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}