{
  "id": "topic_5403925",
  "title": "Agbe",
  "author": "Agbe",
  "created_time": "June 24, 2022, 04:42:08 PMLast edit: June 30, 2022, 10:57:59 AM by Agbe",
  "content": "It is no longer a news that education (information) is the key to human life. If you are not informed definitely you must be deformed. So last week I took a bold step by meeting my village high school principal and discussed with him to teach the school students \"bitcoin\" from junior classes to senior classes, and I told him the numerous benefits. The students will be also exposed to the cryptocurrency ecosystem, license (liberty) to own any amount of bitcoin, make transactions to any country without limit, there will be no central authority or bank (intermediary) control of the assets. Individuals control their bitcoin through seed phrase. They can use it to buy and sell goods and services online with ease, investing and the etc. And the principal accepted my request. So yesterday, I entered the class to start the teaching. In fact the students really enjoyed the class. In the evaluation time, the students respond well. I believe that is a good development. And the following scheme of work and the lesson note was form to start the almost gone academic session.Scheme of work and lesson note and the behavioral objectives on notebookLesson note on the chalk black boardStudents in the classroom",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5403925",
  "comments": [
    {
      "author": "mk4",
      "created_time": "June 24, 2022, 04:48:48 PM",
      "body": "I suggest doing a bit more reading due to the slight sort of 'inaccuracies' in your presentation.- it's not confirmed that Satoshi Nakamoto is actually a group- Bitcoin isn't the first cryptocurrency- Bitcoin isn't under the \"stock exchange market\" categoryTotally appreciate the effort and the enthusiasm though. Hopefully the rest of your presentation are accurate and focused on the fundamentals rather than the \"invest and get rich!\" kind of presentation.* If you like reading articles: https://coindesk.com/learn* If you like reading books: https://theinternetofmoney.info/* If you like watching videos: https://www.youtube.com/playlist?list=PLPQwGV1aLnTuN6kdNWlElfr2tzigB9Nnj",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Agbe",
      "created_time": "June 24, 2022, 05:13:03 PM",
      "body": "Quote from: mk4 on June 24, 2022, 04:48:48 PMI suggest doing a bit more reading due to the slight sort of 'inaccuracies' in your presentation.- it's not confirmed that Satoshi Nakamoto is actually a group- Bitcoin isn't the first cryptocurrency- Bitcoin isn't under the \"stock exchange market\" categoryTotally appreciate the effort and the enthusiasm though. Hopefully the rest of your presentation are accurate and focused on the fundamentals rather than the \"invest and get rich!\" kind of presentation.* If you like reading articles: https://coindesk.com/learn* If you like reading books: https://theinternetofmoney.info/* If you like watching videos: https://www.youtube.com/playlist?list=PLPQwGV1aLnTuN6kdNWlElfr2tzigB9NnjThanks you very much for the links. Really it will help me in my next presentations. But even Satoshi Nakamoto also used, \"We\", that means, he was not alone in the project.Quote from: satoshi on July 19, 2010, 04:01:38 PMWe're working on a release soon that puts a password on the JSON-RPC interface, but until then, avoid using the -server switch, and don't web browse on the same machine where bitcoind is running.https://bitcointalk.org/index.php?topic=479.msg4263#msg4263https://bitcointalk.org/index.php?topic=1007.msg12262#msg12262https://bitcointalk.org/index.php?topic=841.msg9813#msg9813https://bitcointalk.org/index.php?topic=765.msg8402#msg8402",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MArsland",
      "created_time": "June 24, 2022, 05:16:43 PM",
      "body": "In the midst of limited educational facilities, I admit that initial education comes from those who want to know the world of Bitcoin. despite the material you present and some things that may still not match the factual sources, so far I appreciate your actions. It's just that the theories collected must be taken from the curriculum of government programs. Initiative alone will not be in line with your country's educational goals. Because basically, a learning process at the education unit level refers to the curriculum. If you may know what learning model is applied? because usually in schools the learning process will focus on the chosen method is the intelligence of a teacher so that the material presented can be more easily understood.Whether it is inquiry based, Problem Based Learning, Cooperative Learning, and many more The choice of methods will make it very easy for you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "June 24, 2022, 05:28:57 PM",
      "body": "Quote from: Agbe on June 24, 2022, 05:13:03 PMThanks you very much for the links. Really it will help me in my next presentations. But even Satoshi Nakamoto also used, \"We\", that means, he was not alone in the project.Quote from: satoshi on July 19, 2010, 04:01:38 PMWe're working on a release soon that puts a password on the JSON-RPC interface, but until then, avoid using the -server switch, and don't web browse on the same machine where bitcoind is running.https://bitcointalk.org/index.php?topic=479.msg4263#msg4263https://bitcointalk.org/index.php?topic=1007.msg12262#msg12262https://bitcointalk.org/index.php?topic=841.msg9813#msg9813https://bitcointalk.org/index.php?topic=765.msg8402#msg8402Yes, it was worked on by multiple people (a.k.a. contributors) because Bitcoin is an open-source project after all, but Satoshi Nakamoto initially launched it. Satoshi launched the software first, then the contributors jumped in and helped.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tjtonmoy",
      "created_time": "June 24, 2022, 05:30:55 PM",
      "body": "This the step we have to take to make the future a better one! slowly but surely we will reach that destination one day! We may not get the full benefits but our next generation will get that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jackg",
      "created_time": "June 24, 2022, 05:31:01 PM",
      "body": "This is quite impressive to see you've managed to do it and incorporating it with financial education would be a good idea. I hope someone has access to the Internet in those rooms in case you get an interesting question and need to look more into it.  Quote from: Agbe on June 24, 2022, 05:13:03 PMBut even Satoshi Nakamoto also used, \"We\", that means, he was not alone in the project.Quote from: satoshi on July 19, 2010, 04:01:38 PMWe're working on a release soon that puts a password on the JSON-RPC interface, but until then, avoid using the -server switch, and don't web browse on the same machine where bitcoind is running.In this example, \"we\" probably meant the community (ie someone pointed this out to me and told me how to fix it).There were likely always more contributors than the one person working on this but I don't think satoshi was a group but rather a figurehead type person (especially considering they corresponded quite a bit with individuals at the start).There were definitely other groups and other developers working on the software and making forks by 2011 (eg electrum).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "maxbtc82",
      "created_time": "June 24, 2022, 05:41:05 PM",
      "body": "This initiative of yours is very good. If all the boys and girls are taught about winning in all the educational institutions, then they will be able to work with bitcoin and in this way they will be able to improve their lives. Thank you for your kind thinking",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hyphen(-)",
      "created_time": "June 24, 2022, 07:01:49 PM",
      "body": "Quote from: Agbe on June 24, 2022, 04:42:08 PM And the principal accepted my request. So yesterday, I entered the class to start the teaching. In fact the students really enjoyed the class. In the evaluation time, the students respond well. I believe that is a good development. And the following scheme of work and the lesson note was form to start the almost gone academic session.That's a great idea, and the principal tried to help by giving you the opportunity to educate secondary school students about Bitcoin and cryptocurrency. If enough people take their time and do something like you, our local communities will be aware of Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Welsh",
      "created_time": "June 24, 2022, 07:07:27 PM",
      "body": "Always nice to see things like this, however I'm curious if this was a compulsory class or is this something that's optional? I'm glad to hear they responded well to it. I'm just not completely sold on the idea of teaching Bitcoin to children quite yet. Honestly, that might just be because our culture here, they probably wouldn't benefit from it, but I suppose in certain other cultures, Bitcoin is actually becoming pretty much something they'll encounter on the daily. So, I'll admit it might be the culture gap. I'm not bashing the idea, I love it that there's people out there doing this sort of stuff, and I know in my teenager years I would've been absolutely loving a class like this. However, for any younger children I don't think teaching them quite yet what Bitcoin is, and what it can be used for will be that useful. Although, I tend to think we teach the concept of money too early to children anyway.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Doan9269",
      "created_time": "June 24, 2022, 07:32:15 PM",
      "body": "Quote from: Agbe on June 24, 2022, 04:42:08 PMmake transactions to any country without limitOne of the most important aspect in bitcoin that i love to hear is in this aspect, this have solved the lingering challenges of cross boarder transactions fee amd delay, this was made easy to use anytime anywhere with the help of the introduction of bitcoin, nkw taking a firther step to enlighten the teenage students in schools is a good and a welcome idea that could help create kore understanding about bitcoin and its need for adoption.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Upgrade00",
      "created_time": "June 24, 2022, 07:35:00 PM",
      "body": "Great initiative and kudos to you for taking out the effort to do this. In my experience schools do not require this course in the curriculum, so it's most likely an elective which you added for the pupils; if they are interested, which I feel most teenagers would be.If you plan to teach  things like this to kids, I believe a kid friendly approach should be used. The idea should not be to make them aware of who invested Bitcoin or what is the first cryptocurrency, rather they should try their knowledge in understanding some concepts like decentralization which I feel, would peak their interest.Also, images, graphs and charts could be used to further simplify the concept to them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Davidvictorson",
      "created_time": "June 24, 2022, 08:05:42 PM",
      "body": "Well done Agbe. In my estimation this is a step in the right direction. The village high school principal seems like someone who is open to new ideas by giving you a chance to educate the kids on Bitcoin. Kids in junior high and senior high should be in their teenage years so as a teacher you have done well by giving them an intro. Also, I hope for two things one an assessment at the end of the school term to test their knowledge. Secondly, please be do not punish those who fail to grab the concepts by adding their scores to their school or class performance sheet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fivestar4everMVP",
      "created_time": "June 24, 2022, 08:06:00 PMLast edit: June 24, 2022, 08:20:22 PM by Fivestar4everMVP",
      "body": "This is a great initiative and congratulations for taking the bold step to bring more young people to the knowledge of Bitcoin and Blockchain,  though i understand this might be an initiative you have started on your own and not getting paid for it, I believe that in no distance future from today, the subject of Blockchain, Bitcoin and Cryptocurrencies can become a course which our children can study in school, just like they study Medicine to become Doctors and Nurses, Law to become lawyers, Mass communication to become Tv and Radio station AOPs etc. , our children can study Blockchain to become Blockchain Engineers, Blockchain Developers, Blockchain Analysts, etc. , the potentials are endless.And by the way @Agbe, please resize the images, I don't know the kind of device you are using but they are too large on mine, and I believe its large for some other users too, you probably have posted images on the forum before, I believe you know how to resize.But just incase...HERE's how Code:[img height=enter number from 100 up width=enter number from 100 up]-image link[/img]",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oluwa-btc",
      "created_time": "June 25, 2022, 06:31:58 AMLast edit: July 07, 2022, 05:43:22 AM by Oluwa-btc",
      "body": "Bravo Brother! Good to see it's finally going down to your village, Ensure information been shared is well assimilated and it sink's in.Bitcoin shouldn't be seen as a way to get quick funds but serves and a store house of wealth, I believe that must be higher classes, teach them in advance how to use Bitcoin in really life application. To use Bitcoin in them day to day activities.Financial literacy is another thing Brother, Think about, Our previous Generations have been playing by the old rule's ( Go too school, get good grades and get a good job, fvck the Rat race ) and all of that don't prepare them for Real life Ahead. Let em know how money works, how to make money work for them and that having more money isn't the problem.Accounting, investing and understanding the law will be a good guide to them, these are my little additions-  Learning that from a tender age will prepare the ahead. Please, punishment and mockery shouldn't be given when they fail, it's the best way to learn. I don't know how to explain this further. Even the best fail and makes mistakes.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "June 25, 2022, 07:28:13 AM",
      "body": "This is something Schools should include. Even a small portion of topic in any major ones could help everyone understand how the blockchain works especially the bitcoin technology. There are some countries pobably considering this and some might have implemented it already to give general knowledge on this. Even basic one can help anyone grasp even the tiniest detail out of it and the rest will be easier.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "aoluain",
      "created_time": "June 25, 2022, 08:14:33 AM",
      "body": "Quote from: Welsh on June 24, 2022, 07:07:27 PMAlways nice to see things like this, however I'm curious if this was a compulsory class or is this something that's optional? I'm glad to hear they responded well to it. I'm just not completely sold on the idea of teaching Bitcoin to children quite yet. Honestly, that might just be because our culture here, they probably wouldn't benefit from it, but I suppose in certain other cultures, Bitcoin is actually becoming pretty much something they'll encounter on the daily. So, I'll admit it might be the culture gap. I'm not bashing the idea, I love it that there's people out there doing this sort of stuff, and I know in my teenager years I would've been absolutely loving a class like this. However, for any younger children I don't think teaching them quite yet what Bitcoin is, and what it can be used for will be that useful. Although, I tend to think we teach the concept of money too early to children anyway. Yea I agree with Welsh and everyone here more or less, its a great idea and a great initiative by the OP to educate others about Bitcoin. Its a bold step and I'm impressed with the schoolprincipal for allowing this to happen.Like Welsh I'm not sure teaching 'Junior' classes the concept, they may be too young,but definitely students preparing for their next level of education or going into the workforceafter high school is beneficial for sure.From the images it looks like a different sort if learning, students have to use their imaginationand visualisation differently without computers.This is great. Its deserves more Merit im out unfortunately",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ImThour",
      "created_time": "June 25, 2022, 08:28:49 AM",
      "body": "This is a huge step in the adoption of technology and every country should at least help their citizens understand the difference between Crypto and Bitcoin.Bitcoin is the first decentralized currency on the blockchain, Crypto is mostly shitcoin with the same work, and different names.Take Ethereum and Polygon (Matic) for an example. I am sure they both do the same thing right?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Darker45",
      "created_time": "June 25, 2022, 08:34:14 AM",
      "body": "This is good. But I'm quite interested to know how Bitcoin came into the subject. It seems it came out of nowhere. It might help if it is included in the subject in such a way that students know where it is coming from. The technology of Bitcoin might have more impact on them; they'll probably appreciate it more if it is put into a context. With the way it is inserted in the subject, I simply can't connect the dots. Perhaps the sub-topic Bitcoin fits well under the topic Money or How Money Works or Our Monetary System or any related topic within your Economics class. Bitcoin needs a sort of an introduction or a set-up. After all, it is a technology that came out as a reaction. So, what was it reacting to? Why did Satoshi came out of it? The answer to these questions should be the topic prior to Bitcoin. I'm simply saying the subject should have a proper flow. It appears to me everything is out of structure.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hZti",
      "created_time": "June 25, 2022, 08:35:58 AM",
      "body": "It is very good that you teach about new technologies like blockchain and bitcoin. It will help your students later to be able to judge if they want to invest money in bitcoin or use the payment system. More importantly it will help them to not get scammed by a shitcoin or loose their money because they do a mistake. So it is very important to teach them about back up solutions and also about potential scams.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}