{
  "id": "topic_5453763",
  "title": "floridaman86",
  "author": "floridaman86",
  "created_time": "May 23, 2023, 11:43:01 AM",
  "content": "I have a future it Apollo Btc miner. It is only about a year old. It malfunctioned and got disconnected from the mining pool twice in the past 24 hours.Any thoughts on what would typically cause this? The only thing hThat it tells me, is that the hardware errors spiked pretty high, but no specifics.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5453763",
  "comments": [
    {
      "author": "BitMaxz",
      "created_time": "May 23, 2023, 12:45:15 PM",
      "body": "What pool do you mine?It maybe the pool server is recently down?It would be better if you check the logs of your unit and post the logs here and maybe you can get more idea what the cause of this problem.Sometimes high spike of hardware error is cause by overheating issue.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "floridaman86",
      "created_time": "May 23, 2023, 02:35:48 PM",
      "body": "Quote from: BitMaxz on May 23, 2023, 12:45:15 PMWhat pool do you mine?It maybe the pool server is recently down?It would be better if you check the logs of your unit and post the logs here and maybe you can get more idea what the cause of this problem.Sometimes high spike of hardware error is cause by overheating issue.I mine with Braiins Poolthe pool server was not down. during the 8 hours my miner was down last night, the pool found two blockshow do I check the logs? I looked at the dashboard, and the closest thing I found was something called \"raw stats\"I was thinking it was an overheating issue too when it got knocked offline yesterday too. it was a hot day, and the house got up to 82 degrees. but last night, the AC was running, and i bring the house down to 72degrees.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitMaxz",
      "created_time": "May 23, 2023, 04:42:23 PM",
      "body": "Have you ever tried to mine on other pools to test?Have you tried to check the system for logs?I don't know how to pull out the logs from this unit so I think it would be better if you bring this issue to futurebit support section from this link below.- https://bitcointalk.org/index.php?topic=5340015.0",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "floridaman86",
      "created_time": "May 23, 2023, 05:47:03 PM",
      "body": "Quote from: BitMaxz on May 23, 2023, 04:42:23 PMHave you ever tried to mine on other pools to test?Have you tried to check the system for logs?I don't know how to pull out the logs from this unit so I think it would be better if you bring this issue to futurebit support section from this link below.- https://bitcointalk.org/index.php?topic=5340015.0I have not tried a different pool, I might try that to see what happens.It seems like its mechanical though. When it happens, the fan gets real loud, and the machine gets \"knocked off the network\". When I try to turn the monitor on to reset it, the monitor doesnt get a signal from the miner, so I have to turn the power off manually (such as pulling the plug), to reboot the miner.thank you for your help, I think I will email futurebit to see if this is known issue",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}