{
  "id": "topic_5415875",
  "title": "Robert518",
  "author": "Robert518",
  "created_time": "October 04, 2022, 08:29:06 AM",
  "content": "Kim Kardashian to Pay $1.26 Million for Unlawful Touting Crypto SecurityAs per SEC release, Kim Kardashian shared a promotional content on her Instagram page regarding Emax token in 2021 that contains links to EthereumMax website and provided instructions for potential investors to buy EMAX token, a crypto asset security offered by EthereumMax.The reality TV star and influencer, Kim Kardashian has agreed to pay the US Securities and Exchange Commission $1.26 Million charges for illegitimate crypto promotion.Crypto scrutiny is on the rise by financial watchdogs, this, of course, is an indication that more investors will be getting more interested in the space as more regulators’ scrutiny will render crypto a more trusted security, be miles ahead of others through the information and education from experts that will propel you ahead of others.Meanwhile, the US federal stated clearly that any celebrity or individual who promotes crypto security must disclose the nature, source, and amount of compensation they received in exchange for the promotion.Kardashian however received a sum of $250,000 for promoting the content through her Instagram handle which she refused to disclose and as a result of this, she faces SEC charges of over $1 million including approximately $260,000 in disgorgement, which represents her promotional payment, plus prejudgment interest, and a $1,000,000 penalty, in addition to this, she will not promote any crypto-related content on her page for the next three years.News: https://mycryptoparadise.com/sec-charges-kim-kardashian-1-26-million-for-unlawful-crypto-promotion/",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5415875",
  "comments": [
    {
      "author": "DeathAngel",
      "created_time": "October 04, 2022, 09:49:57 AM",
      "body": "I saw this & it’s all very amusing as not many people like her much but really the SEC is ridiculous & they should be concentrating on much more serious things like Congress insider trading, central banks laundering money for terrorists.There are many more serious things for the SEC to protect investors from. I really don’t have much respect for Gensler & the SEC, will they ever approve a bitcoin ETF?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Robert518",
      "created_time": "October 05, 2022, 10:46:45 AM",
      "body": "Quote from: DeathAngel on October 04, 2022, 09:49:57 AMI saw this & it’s all very amusing as not many people like her much but really the SEC is ridiculous & they should be concentrating on much more serious things like Congress insider trading, central banks laundering money for terrorists.There are many more serious things for the SEC to protect investors from. I really don’t have much respect for Gensler & the SEC, will they ever approve a bitcoin ETF?I'm 100% with you. They should be focusing more on serious matters.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mich",
      "created_time": "October 07, 2022, 07:34:08 AM",
      "body": "I feel good that she is getting what she deserves for using her celebrity status, power as a social media influencer, and manipulating her following through her looks to allow her fans to get scammed. In doing so, she violated the anti-touting provision of federal securities law. So hopefully she loses some fan base because she took advantage of them and should go to jail.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}