{
  "id": "topic_5453656",
  "title": "DaNNy001",
  "author": "DaNNy001",
  "created_time": "May 22, 2023, 11:12:13 AM",
  "content": "HISTORICAL EVENTToday being may 22nd marks 13 years since the famous bitcoiner Laszlo Hanyecz paid 10000 BTC for two papa John's pizza which was delivered to him and looking at that same figure today records a whooping sum of 268000000k $ in today's market price cap. Funny enough this historical event is marked as a symbol in the crypto world today so am using this medium to remind everyone in the forum about this Wonderful event that happened 13years ago @ may 22nd 2010.So once again happy bitcoin pizza day to everyone in the forum.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5453656",
  "comments": [
    {
      "author": "nakamura12",
      "created_time": "May 22, 2023, 11:41:53 AM",
      "body": "It is indeed a historical event but I think it would be more fun if there's an event for us to enjoy or have fun which I think the best way to celebrate the event. I think a baking contest or an art contest about the event. Well, it's up to anyone to start a contest but since I am not a merit source then I wouldn't have enough smerit to reward those who want to participate in the contest. Anyway, happy bitcoin pizza day to everyone and also this makes me want to eat pizza .",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "notocactus",
      "created_time": "May 22, 2023, 01:04:30 PM",
      "body": "Quote from: nakamura12 on May 22, 2023, 11:41:53 AMIt is indeed a historical event but I think it would be more fun if there's an event for us to enjoy or have fun which I think the best way to celebrate the event. I think a baking contest or an art contest about the event. Well, it's up to anyone to start a contest but since I am not a merit source then I wouldn't have enough smerit to reward those who want to participate in the contest. Anyway, happy bitcoin pizza day to everyone and also this makes me want to eat pizza .No Pizza baking contest so far but stay tuned, you might see surprising news!Keep watching https://twitter.com/BtcTalkShow/status/1660389498184691715.What is BtcTalkShow (BitcoinTalkShow)?QuoteThe BitcoinTalkShow is a Youtube Bitcoin Talk Show about #BicoinTalk!The forum where #Bitcoin and crypto spawned.And this one [Bitcointalk Party - Discord sv] Bitcoin Pizza bake-off contest! Enter by 29 May. The first Bitcoin Pizza contest was hosted by Cyrus in 2020.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "John Abraham",
      "created_time": "May 22, 2023, 01:10:11 PMLast edit: May 22, 2023, 01:22:11 PM by John Abraham",
      "body": "Quote from: nakamura12 on May 22, 2023, 11:41:53 AMIt is indeed a historical event but I think it would be more fun if there's an event for us to enjoy or have fun which I think the best way to celebrate the event. I think a baking contest or an art contest about the event. Well, it's up to anyone to start a contest but since I am not a merit source then I wouldn't have enough smerit to reward those who want to participate in the contest. Anyway, happy bitcoin pizza day to everyone and also this makes me want to eat pizza . We had two three contests in the last two three years. Rikafip and Rikafip and Nionion Shared two prize in 2020 and 2021. fillippone won The latest contest. It's not late yet. As far as I know, Cyrus is preparing the content, and we may see the announcement soon. For more information, join the Bitcoin Discord server and BitcoinTalk Party Discord Server Thread. At first, they said the Pizza badge was temporary. But, Nobody knows how long it will be under the winner's name. I am happy it's been a year, and the badge still shines under fillippone's name. I am very much tempted to see the new content and everyone's creative pizzas. I may join the contest as well. For now, waiting for the announcement because there might be a slight change in the contest rules this year.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rikafip",
      "created_time": "May 22, 2023, 01:17:17 PM",
      "body": "Quote from: John Abraham on May 22, 2023, 01:10:11 PMWe had two contests in the last two years. Rikafip and fillippone won each of them. ItJust a small correction: there were actually three pizza contests organised by Cyrus and first two nionio and me shared the first spot and fillippone won the 3rd.Happy bitcoin pizza day everyone!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "John Abraham",
      "created_time": "May 22, 2023, 01:40:40 PM",
      "body": "Quote from: Rikafip on May 22, 2023, 01:17:17 PMQuote from: John Abraham on May 22, 2023, 01:10:11 PMWe had two contests in the last two years. Rikafip and fillippone won each of them. ItJust a small correction: there were actually three pizza contest organised by Cyrus and first two nionio and me shared the first spot and fillippone won the 3rd.Thanks, Rikafip! Indeed I already got it, but you posted before I edited the post. At first, I was checking the Discord server forum thread, and there was no announcement of the winner for 2020. So, I thought maybe this was abandoned due to a small number of participants. Moreover, there was no activity from 26th May 2020 to 14th July 2020. Right after that, I started to dig into the Discord server and noticed three events archived. So, I wondered if I could find the winner list here. Then I found this; I was surprised that you and Nionio shared two contest prizes in a row. Huh? Same Winners, Same result, isn't it surprising? It seems both of you guys like to compete in pizza baking. fillippone is another king. I am tempted to see new pizzas from all over the world. Moreover, excited to submit my pizza with the worst decorating skills.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tjtonmoy",
      "created_time": "May 22, 2023, 02:13:04 PMLast edit: May 22, 2023, 09:22:00 PM by tjtonmoy",
      "body": "Celebrating Bitcoin pizza day with a pizza... though I bought it from a shop.... I'll make one if there's any competition....! Happy bitcoin pizza day! Cheers :",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaNNy001",
      "created_time": "May 22, 2023, 02:22:16 PM",
      "body": "Quote from: tjtonmoy on May 22, 2023, 02:13:04 PMCelebrating Bitcoin pizza day with a pizza... though i bought it from a shop.... I'll nake one if there's any competition....! Happy bitcoin pizza day! Cheers : Nice to see someone already in the pizza day spirit  . And thats some fine pizza you are enjoying over there, well for me the day has been quite busy and so restless maybe when am free abit I would also join you in getting some nice pizza myself but hopefully am not going to pay 10000$  for it like the Laszlo did. And yes we are still anticipating for some kind pizza making contest so everyone can join in the celebration of the first ever real transaction made withBTC",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Agbe",
      "created_time": "May 22, 2023, 09:19:45 PM",
      "body": "Quote from: nakamura12 on May 22, 2023, 11:41:53 AMIt is indeed a historical event but I think it would be more fun if there's an event for us to enjoy or have fun which I think the best way to celebrate the event. I think a baking contest or an art contest about the event. Well, it's up to anyone to start a contest but since I am not a merit source then I wouldn't have enough smerit to reward those who want to participate in the contest. Anyway, happy bitcoin pizza day to everyone and also this makes me want to eat pizza . Pizza day was a very much fun for everyone in the forum in the past three years although I have participated once only. I believe Laszlo Hanyecz will be surprised of the 10 BTC used to buy one Pizza at that time. We are still waiting for any information from the organizer to make the pizza day fun for Laszlo Hanyecz to console the bitcoin he used to buy the one Pizza. The baking contest would be the best than the art contest. Some user will learn how to bake pizza through this mean.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coin-investor",
      "created_time": "May 22, 2023, 10:50:47 PM",
      "body": "This is a historical event that will not die every single year this pizza day has been celebrated, can't wait to see that, that Pizza is worth $ 1 billion or even more in the future, and Laszlo Hanyecz and his generation will be forever part of this event, only Bitcoin has this historical event, this is always a big attraction whenever I'm inviting a friend to look at Bitcoin whenever we are eating pizza.Looking forward to another thread about Pizza Day, hopefully, I get the chance to create a thread and announced it here in the future.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nakamura12",
      "created_time": "May 23, 2023, 12:56:58 AM",
      "body": "Quote from: Agbe on May 22, 2023, 09:19:45 PMPizza day was a very much fun for everyone in the forum in the past three years although I have participated once only. I believe Laszlo Hanyecz will be surprised of the 10 BTC used to buy one Pizza at that time. We are still waiting for any information from the organizer to make the pizza day fun for Laszlo Hanyecz to console the bitcoin he used to buy the one Pizza. The baking contest would be the best than the art contest. Some user will learn how to bake pizza through this mean. Who wouldn't get surprised of the value of the BTC paid for buying pizza?. I think no one won't be surprised if it ever happened to someone where the total of BTC paid for buying pizza is not the same as before. Some people even said that it's a waste of money when he bought pizza with BTC without thinking that during the transaction the price of BTC is not what they think it is. Time flies so fast, I never thought I celebrated Bitcoin Pizza Day 6 times already.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Majestic-milf",
      "created_time": "May 23, 2023, 01:46:33 AMLast edit: May 23, 2023, 02:01:54 AM by Majestic-milf",
      "body": "Quote from: DaNNy001 on May 22, 2023, 11:12:13 AMToday being may 22nd marks 13 years since the famous bitcoiner Laszlo Hanyecz paid 10000 BTC for two papa John's pizza  A memorable day indeed as there won't have been any Bitcoin Pizza day to remember if Laszlo hadn't splurged on such an item with an amount that in today's time would seem like a reckless waste of money. But I guess his love for pizza overruled that absurdity. But while we are giving credit to Laszlo for his seeming lack of prudence spending Bitcoin, I think it's fair if we acknowledge  Jeremy Sturdivant , the recipient of the $10k who also went ahead and blew it! If he only knew how much he'd have been worth if he had decided to hodl! I feel like crying now... ..but well, we're still in the Bitcoin Pizza mood, so I'd just swallow and blame it all on price then and naivete.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zaim7413",
      "created_time": "May 23, 2023, 03:59:25 AM",
      "body": "This historical event began on May 18 2010 when Laszlo Hanyecz made a challenge on the BTT Forum with the topic entitled Pizza for bitcoins?. In his upload he offers 10,000 Bitcoin for anyone who is willing to send him two pizza. Four days after the topic was created on May 22, 2010, Laszlo Hanyecz reported that he had successfully traded 10,000 bitcoins for 2 pizza, this transaction marked the first time Bitcoin was used as a means of payment.QuoteI just want to report that I successfully traded 10,000 bitcoins for pizza.Pictures: http://heliacal.net/~solar/bitcoin/pizza/Thanks jercos!Proof of the transaction:Address used by Laszlo1XPTgDRhN8RFnzniWCddobD9iKZatrvH4Address used by Jercos17SkEw2md5avVNyYgj6RiXuQKNwkXaxFyQMay 22 is always remembered as Bitcoin Pizza Day because on that day a great event occurred which marked Bitcoin as a new transaction tool. I think this special day needs to be celebrated as it has been done in previous years like the Pizza baking contest.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Popkon6",
      "created_time": "May 23, 2023, 06:32:52 AM",
      "body": "10,000 bitcoins to buy a pizza is a very historic event that is now history. The price of two pizzas 13 years ago is a mountain of wealth today (about $268,000,000). This gentleman Lazlo made this history in 2010. Farewell Today we are celebrating this memorable day. (If he had left some wealth, his personal small mountain of wealth would have built up) and we will celebrate this memorable day with our art competition and our handiwork designs.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mpamaegbu",
      "created_time": "May 23, 2023, 02:20:25 PM",
      "body": "10,000 BTC could only be exchanged for just two pizzas. 13 years later, 1 BTC can get more than 10,000 pizzas. Though, I read somewhere Lazlo said he didn't regret his action when juxtaposed with the current Bitcoin high price. I just hope he meant it. Otherwise, I don't think such is easy not to be a regrettable action. I know he's getting mentioned every time Bitcoin marks its anniversary but that's a life changing amount of money there in today's world.Quote from: tjtonmoy on May 22, 2023, 02:13:04 PMThat picture has left me salivating. Should I fax a delivery address to you 🤪",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "May 23, 2023, 02:58:57 PM",
      "body": "Quote from: Mpamaegbu on May 23, 2023, 02:20:25 PMI read somewhere Lazlo said he didn't regret his action when juxtaposed with the current Bitcoin high price. I just hope he meant it. Otherwise, I don't think such is easy not to be a regrettable action. I think he doesnt own only the 10k bitcoin. Probably he did have some more during that time thats why he sold off bitcoin and no one ever have the idea that bitcoin would be a lots of worth before. For other people maybe they cant take that scenario and possibly do worse or got depress badly. But seeing him calmly as now, probably he made some fortune on bitcoin before and who knows maybe more now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mpamaegbu",
      "created_time": "May 23, 2023, 03:27:49 PM",
      "body": "Quote from: cryptoaddictchie on May 23, 2023, 02:58:57 PMQuote from: Mpamaegbu on May 23, 2023, 02:20:25 PM~snipped~I think he doesnt own only the 10k bitcoin. Probably he did have some more during that time thats why he sold off bitcoin and no one ever have the idea that bitcoin would be a lots of worth before.There's a saying where I come from that making more money doesn't get anyone tired. Even if he did have more of that in triple or raised to the power of ten, in gravitas I'm not sure he would've risked that much if he had an idea what Bitcoin would be worth a decade later. I consolidate with the later part in your comment as quoted. Nonetheless, like it's argued in several quarters that action kick started the real Bitcoin transaction as we've it today. While someone like me sees it as a loss for Lazlo, I believe it's a plus for the industry as a whole. So, I like to conclude that it should be seen as a win–win for all since the dude in question didn't fall into depression because of that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tjtonmoy",
      "created_time": "May 23, 2023, 03:33:29 PM",
      "body": "Quote from: Mpamaegbu on May 23, 2023, 02:20:25 PMThat picture has left me salivating. Should I fax a delivery address to you 🤪I will fax you mine. Come to my place. We will celebrate together. BTW making my own pizza today. Will update soon.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "aysg76",
      "created_time": "May 23, 2023, 03:50:05 PM",
      "body": "Quote from: tjtonmoy on May 22, 2023, 02:13:04 PMCelebrating Bitcoin pizza day with a pizza... though I bought it from a shop.... I'll make one if there's any competition....! Happy bitcoin pizza day! CheersAs you can see above mentioned by @tranthidung there is another pizza baking contest organised by @Cyrus this year also so if you are interested in participating submit your entry and see if you can have some pizza skills to compete with others who are already in the line to come up with something pizzish Quote from: Rikafip on May 22, 2023, 01:17:17 PMJust a small correction: there were actually three pizza contests organised by Cyrus and first two nionio and me shared the first spot and fillippone won the 3rd.And see his pizza badge lasted this long that we are seeing another contest in a row which is amazing so are you ready for this one?  Happy Bitcoin Pizza to all of you..",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "salad daging",
      "created_time": "May 23, 2023, 04:36:59 PM",
      "body": "Quote from: tjtonmoy on May 22, 2023, 02:13:04 PMCelebrating Bitcoin pizza day with a pizza... though I bought it from a shop.... I'll make one if there's any competition....! Happy bitcoin pizza day! Cheers :Same bro yesterday I also bought Pizza from the shop to enjoy this celebration.That pizza is really delicious.Quote from: salad daging on May 22, 2023, 02:15:00 PMQuote from: tjtonmoy on May 23, 2023, 03:33:29 PMBTW making my own pizza today. Will update soon. I would love to see your work, I also plan to make it back like last year.This contest will last for 10 days.Quote from: aysg76 on May 23, 2023, 03:50:05 PMHappy Bitcoin Pizza to all of you..We celebrate it for Bitcoin Pizza Day.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}