{
  "id": "topic_5449181",
  "title": "Philpsticks",
  "author": "Philpsticks",
  "created_time": "April 17, 2023, 03:02:37 PM",
  "content": "One of the reasons be say, binance been de one of early exchanges to be launched, which they launched in 2017, that time wey crypto currency still de grow, so with this, they were able to pull a lot of crowd to themselvesAnother reason fit be say, as binance take get plenty trading pairs, e de also attract traders, because most traders de very versatile, and them go want place wey them go fit develop their trading skillsAnother reason wey I feel be say, binance de also offer very low gas fee, like their gas fee on transactions are relatively low compared to other Centralized exchanges.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5449181",
  "comments": [
    {
      "author": "CryptoHeadlineNews",
      "created_time": "April 17, 2023, 07:36:54 PM",
      "body": "Those na really beta points wey you sama for there my dear, bcos another vital reason wey make Binance to be the most successful centralized exchange na there presence of very active customer support team wey dey ever always dey available to resolve any issue you get very fast & amicably. Secondly, be say another reason why Binance dey do well today was there ability to be the first exchange to allow people deposit their local currencies directly on their exchange for trading and also the first to have offered a very reliable & fast p2p transactions wey people go fit dey buy Bitcoin without any trace. Wey become very popular back then when our CBN been ban banks from processing anything wey get to do with Bitcoin transactions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptopreneurBrainboss",
      "created_time": "April 22, 2023, 07:49:51 PM",
      "body": "Quote from: Philpsticks on April 17, 2023, 03:02:37 PMOne of the reasons be say, binance been de one of early exchanges to be launched, which they launched in 2017, that time wey crypto currency still de grow, so with this, they were able to pull a lot of crowd to themselvesBinance wasn't the first or even one of the first cryptocurrency exchange to come out, we get plenty sites dem dat year wey dey run Bitcoin exchange. Wetin blow Binance na say 2017 was the year of the rise of altcoins and dey came into the market with focusing on provided trading ground to altcoins but other exchange na Bitcoin dem dey focus on and to list altcoins was war. I remember when exchanges lik bittrex go dey do guy when we dey beg dme to list a particular altcoins but Binance go run am asap. Binance no play with their plans and na so so competition you go dey see the platform as per trading competitive wey dey attract traders.Also the user interface was crazy compared to wetin be dey before, binance come into the industry with full force and dem come even add their own coin Join. I think na Binance first introduced that exchange coin thing and dem be come run ico wey dey hot that time like mad. Na Binance make exchanges begin take customer support serious and begin listing altcoins which started the whole altcoins season wey we dey hear so. I think  the most important thing na say, binance no joke with their customers and dey steadily run innovations as new things dey enter the industry like lending, staking etc.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "April 23, 2023, 11:27:30 AM",
      "body": "You asked an almost irrelevant question and you answered the question yourself. But the main thing is that what is the main purpose of this thread? Quote from: Philpsticks on April 17, 2023, 03:02:37 PMAnother reason wey I feel be say, binance de also offer very low gas fee, like their gas fee on transactions are relatively low compared to other Centralized exchanges.You mean transaction fee? Bitcoin withdraw fee on Binance is very high. For altcoins, there are many other exchanges with low fee as well. Binance UI is excellent and trading on it is smooth with excellent users experience. They are offering zero trading fee for some pairs and also having low trading fee if compared to some exchanges.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Agbe",
      "created_time": "April 23, 2023, 05:11:26 PM",
      "body": "Op u no do enough research before u create dis thread. U just make ur own assumption. Binance na just recent platform wey come. Well let me tok small of ur points. Why Binance e dey popularNo be because di gas fee e day cheap. If na like dat u want take tok am wat of Ramitano exchange platform, imsef no dey collect anything for transactions. One of di reason why piple, personally me dey use binance na bcos di price to fiat is higher dan others. Though some times, Ramitano price e dey di same with binance but not always.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Amphenomenon",
      "created_time": "April 24, 2023, 02:38:05 AM",
      "body": "One reason I still trust binance exchange is that, they have been faced issues of hacks  (successful / unsuccessful) sometimes but are still standing tall. Also the effort they put to make their customers more knowledgeable to cryptocurrency and Blockchain.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cryptomultiplier",
      "created_time": "April 24, 2023, 05:12:45 PM",
      "body": "The Binance app has provided a very easy to understand interface to that makes its operation easy to navigate as well as good security and its ability to accommodate other cryptocurrencies other than Bitcoin. I also think its fees are much lower compared to other exchanges. This is why it remains top above the others for now, unless they relent in their service. I don't need stress further because I use it and its efficiency despite network issues is simply superb.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nwada001",
      "created_time": "April 24, 2023, 09:25:44 PM",
      "body": "Quote from: Agbe on April 23, 2023, 05:11:26 PMNo be because di gas fee e day cheap. If na like dat u want take tok am wat of Ramitano exchange platform, imsef no dey collect anything for transactions. Unless say nah now remitano stop to take something from there customers. If not back then remitano na the first place way I start to they exchange my coins to naira, for every deposit way you send inside before them go credit the coin put for your wallet, them don remove their fee first. Them no they carry that fee play, eh they among the things way make me run from them come start to they use Luno then.So the deposit fee way them they charge alone nah enough reason for people to avoid them, the fee dy enough to cover both watin them suppose charge for the trading part too. And their minimum deposit self they higher.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}