{
  "id": "topic_5456558",
  "title": "Becassine",
  "author": "Becassine",
  "created_time": "June 16, 2023, 12:43:26 PM",
  "content": "Hello,I understood that Trustwallet is closed source, so it's not great. Atomic wallet has just been hacked. Ledger offers a recovery service that raises questions.How can we be sure that our private keys have been generated securely?Thank you",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5456558",
  "comments": [
    {
      "author": "Charles-Tim",
      "created_time": "June 16, 2023, 12:46:35 PM",
      "body": "Use open source wallets like Electrum, Bluewallet or Passport hardware wallet for bitcoin, or Unstoppable or Trezor hardware wallet for altcoins. Open source code are available for the public to verify.Trustwallet, close sourceAtomic wallet, close sourceLedger Nano, close source.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ever-young",
      "created_time": "June 16, 2023, 12:49:12 PM",
      "body": "Quote from: Becassine on June 16, 2023, 12:43:26 PMHow can we be sure that our private keys have been generated securely?Thank youI doubt there is a way for one to know how secured a close source wallet key generation is. Since you don't know what's behind the wallet and no developer could be able to check through the code. So no way to know, they might actually have a backup of all users generated keys and phrase. It's only when we have news of hack that we will eventually know.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "June 16, 2023, 12:55:35 PM",
      "body": "Quote from: Ever-young on June 16, 2023, 12:49:12 PMI doubt there is a way for one to know how secured a close source wallet key generation is. Since you don't know what's behind the wallet and no developer could be able to check through the code. So no way to know, they might actually have a backup of all users generated keys and phrase. It's only when we have news of hack that we will eventually know.Exactly, but beyond doubts because you will definitely not know what is included in the code which can be vulnerabilities like spyware or pre-generated seed phrase. Like Ledger Nano, Trustwallet and other close source wallets, nobody knows how the seed phrase is generated. A reason not to use such wallets.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "safar1980",
      "created_time": "June 16, 2023, 01:17:36 PM",
      "body": "Quote from: Becassine on June 16, 2023, 12:43:26 PMHello,I understood that Trustwallet is closed source, so it's not great. Atomic wallet has just been hacked. Ledger offers a recovery service that raises questions.How can we be sure that our private keys have been generated securely?Thank youIt is impossible to make the necessary knowledge and checks in a security company.Specialists connect wallets to their servers to check the data sent and the entropy of the seed phrase.An open source application is easier to hack than a closed source application.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Coyster",
      "created_time": "June 16, 2023, 01:25:34 PM",
      "body": "Quote from: Becassine on June 16, 2023, 12:43:26 PMHow can we be sure that our private keys have been generated securely?Do not trust; verify. That's the only way to be sure of how your private keys have been generated, in closed source wallets you have to trust, because there is no way to verify, thus choose open source wallets that give you the opportunity to verify their codes yourself and be certain that there is nothing malicious in them.Many Atomic wallet users were hacked for over two weeks now, but because it is closed source nobody can tell what caused it, only Atomic wallet developers can tell what happened, if it were to be open source, the cause would have been known and those who are affected/unaffected would know what went wrong and what to do next.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ever-young",
      "created_time": "June 16, 2023, 02:52:55 PM",
      "body": "Quote from: safar1980 on June 16, 2023, 01:17:36 PMQuote from: Becassine on June 16, 2023, 12:43:26 PMHello,I understood that Trustwallet is closed source, so it's not great. Atomic wallet has just been hacked. Ledger offers a recovery service that raises questions.How can we be sure that our private keys have been generated securely?Thank youAn open source application is easier to hack than a closed source application.It's easier to hack but it's a little less risky for users because they will be aware of what they are about to go in before they could eventually go into it. That's to say, using an open source wallet means you already know if the wallet data is back up into any online cloud or not. Won't it be completely useless for for hackers to penetrate an open source wallet which they won't fine any data stored inside. Or will they re-write the code for newly generated wallet data to be transfer to their data base ?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hosemary",
      "created_time": "June 16, 2023, 03:04:21 PM",
      "body": "Quote from: safar1980 on June 16, 2023, 01:17:36 PMAn open source application is easier to hack than a closed source application.Are you saying hacking electrum is easier than hacking Atmoic wallet, trust wallet, Exodus, etc?If so, you are completely wrong. Electrum is open-source. The code has been reviewed by many people and no vulnerability has been found. When it comes to a close source wallet like trust wallet, it's possible that there's a vulnerability which makes the attack easier for hackers.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lida93",
      "created_time": "June 16, 2023, 06:50:07 PM",
      "body": "That's why verification is necessary as a way to be sure you're on a secure source about whatever you're doing. And that's why open source wallet is one of such gateway to avoid issues of insecure address cause there's a provided avenue for you to verify and be sure of your security.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "paid2",
      "created_time": "June 16, 2023, 06:58:20 PM",
      "body": "Quote from: safar1980 on June 16, 2023, 01:17:36 PMAn open source application is easier to hack than a closed source application.I totally disagree with you on this. On the contrary, for me the whole point of open source, is that dozens - if not hundreds - of developers have access to the code and can test it. And this on an ongoing basis, not just a series of tests to validate a project which is then no longer studied (as happens in some companies).It's the same for OSes, and I sincerely believe that it has been proven many times over that open source is much safer than closed source. Compare Debian and Windows, Electrum and Atomic, etc..etc.. When it comes to security, for me, open source is king.As hosseinimr93 said, Electrum is open source and is probably one of the safest wallet imaginable.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hyphen(-)",
      "created_time": "June 16, 2023, 07:29:44 PM",
      "body": "Quote from: Becassine on June 16, 2023, 12:43:26 PMHello,I understood that Trustwallet is closed source, so it's not great. Atomic wallet has just been hacked. Ledger offers a recovery service that raises questions.Thank youAll of the wallets you mentioned are closed-source wallets; they appear weak and can be easily hacked because the developers can be the source of the hack because the public did not verify the codes given to us as private keys; thus, if the developers do anything to compromise them, we will not know, and our wallets may be hacked, just like the Atomic wallet was hacked with no known reason for information about the hackers.QuoteHow can we be sure that our private keys have been generated securely?The best option is to switch to open-source wallets because you can verify your private keys and be sure they are safely generated.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kelvinid",
      "created_time": "June 16, 2023, 07:42:01 PM",
      "body": "I use only the Electrum wallet for many years and I have no idea how the private keys are generated but because I trust this wallet and I use the right site, I'd feel safe and no worries. And if you think and doubted that your private keys are not safe, then never use them but look for another. It was you to keep what makes you comfortable but if you are using the right site, I'm very certain that those keys are safe and just only for you as the owner of the wallet. Hacks happened when you share your keys with another person or someone got into your computer and found your keys there. Better stored it separately for more security.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Becassine",
      "created_time": "June 16, 2023, 08:58:18 PM",
      "body": "Quote from: Charles-Tim on June 16, 2023, 12:46:35 PMUse open source wallets like Electrum, Bluewallet or Passport hardware wallet for bitcoin, or Unstoppable or Trezor hardware wallet for altcoins. Open source code are available for the public to verify.Trustwallet, close sourceAtomic wallet, close sourceLedger Nano, close source. Atomic wasn't open-source ?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "paid2",
      "created_time": "June 16, 2023, 08:58:57 PM",
      "body": "Quote from: Kelvinid on June 16, 2023, 07:42:01 PMI use only the Electrum wallet for many years and I have no idea how the private keys are generated but because I trust this wallet and I use the right site, I'd feel safe and no worries. And if you think and doubted that your private keys are not safe, then never use them but look for another. It was you to keep what makes you comfortable but if you are using the right site, I'm very certain that those keys are safe and just only for you as the owner of the wallet. Hacks happened when you share your keys with another person or someone got into your computer and found your keys there. Better stored it separately for more security. That's why it's important to always verify with the PGP signatures when downloading wallets. This gives you peace of mind afterwards.Quote from: Becassine on June 16, 2023, 08:58:18 PMAtomic wasn't open-source ?Why is Atomic Wallet not open source?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Becassine",
      "created_time": "June 16, 2023, 09:20:17 PM",
      "body": "Quote from: iwantmyhomepaidwithbtc2 on June 16, 2023, 08:58:57 PMThat's why it's important to always verify with the PGP signatures when downloading wallets. This gives you peace of mind afterwards.You always have great tips that seem insurmountable to me.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "paid2",
      "created_time": "June 16, 2023, 09:25:26 PM",
      "body": "Quote from: Becassine on June 16, 2023, 09:20:17 PMQuote from: iwantmyhomepaidwithbtc2 on June 16, 2023, 08:58:57 PMThat's why it's important to always verify with the PGP signatures when downloading wallets. This gives you peace of mind afterwards.You always have great tips that seem insurmountable to me.  It's not very difficult and it is always very good for your security to be familiar with PGP!If you are interested by verifying your Electrum, here is an excellent topic from DireWolfM14 about it :     [GUIDE] How to Safely Download and Verify Electrum  and here is a Youtube video I found on bitcointalk some time ago, which is cool too if you prefer video tutorials",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Becassine",
      "created_time": "June 16, 2023, 09:37:37 PM",
      "body": "Quote from: iwantmyhomepaidwithbtc2 on June 16, 2023, 09:25:26 PMQuote from: Becassine on June 16, 2023, 09:20:17 PMQuote from: iwantmyhomepaidwithbtc2 on June 16, 2023, 08:58:57 PMThat's why it's important to always verify with the PGP signatures when downloading wallets. This gives you peace of mind afterwards.You always have great tips that seem insurmountable to me.  It's not very difficult and it is always very good for your security to be familiar with PGP!If you are interested by verifying your Electrum, here is an excellent topic from DireWolfM14 about it :     [GUIDE] How to Safely Download and Verify Electrum  and here is a Youtube video I found on bitcointalk some time ago, which is cool too if you prefer video tutorialscool merci !",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hatshepsut93",
      "created_time": "June 16, 2023, 11:59:08 PMLast edit: June 17, 2023, 10:42:58 PM by hatshepsut93",
      "body": "I use Electrum because it's a wallet with very good reputation that has been around for many years and generally it didn't fail. It has been reviewed many times by the best experts in the field, so it's very unlikely that there are any critical vulnerabilities or backdoors. In my opinion the only wallet better than Electrum is Bitcoin Core, but it requires full blockchain sync, which has been for some reason going very slowly for me, so for convenience I'm using Electrum instead.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yamane_Keto",
      "created_time": "June 17, 2023, 01:59:57 AM",
      "body": "Quote from: Becassine on June 16, 2023, 12:43:26 PMHow can we be sure that our private keys have been generated securely?You want to ensure that your coins are safe from whom? For example, all wallets fail to protect you from physical attacks or social attacks, as hackers can collect information about you and use it to access your computer and know the password for decryption. Therefore, keep your investments silent and always use an airgapped wallet that will not connect to the Internet.Then, the open source wallets, which have been reviewed by thousands of developers, are safer than the closed source wallets, which may not be reviewed by many, so your use of well-reviewed open source wallets reduces the risk of losing your investment.using open-source airgapped wallets better than hot wallet.Increasing your technical knowledge, following the news reduces the possibility of losing any coins if any vulnerability is discovered.Thus, it is an ongoing process of reducing risks to be closer to zero.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dzungmobile",
      "created_time": "June 17, 2023, 03:31:11 AM",
      "body": "Quote from: Becassine on June 16, 2023, 12:43:26 PMHow can we be sure that our private keys have been generated securely?You only can know it if that wallet is open-sourced.If it has an open source code, you can check code and see that wallet as backdoors or not. If you can not check codes, you will have to rely on reviews from others but Bitcoin community is big and if an open-sourced wallet has backdoors, many developers in community will warn us about that.[LIST] Open Source Hardware Wallets[LIST] Open-source Lightning wallets",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}