{
  "id": "topic_5420508",
  "title": "bonfire66",
  "author": "bonfire66",
  "created_time": "November 11, 2022, 11:38:54 AM",
  "content": "Как матерый специалист по срачу в интернете со стажем примерно лет 25 (начинал еще через диалап 28800 бод, если что), хочу дать немного рекомендаций, как культурно унизить своего оппонента по инет-дискуссии. Не благодарите, данная инфа абсолютно бесплатна и ее можно (и нужно) распространять по сети совершенно свободно в неограниченном количестве.    Итак, прежде всего, рекомендую относиться к обсираемому респонденту с максимальной вежливостью. И звать его на «вы» – обязательно! Типа «да, сэр», «конечно, сэр», «отсосите с проглотом, сэр» или что-то в этом роде.   Во вторых, нужно сначала усыпить бдительность обсираемого, и стараться всегда начинать свой ответ со слов «да, вы абсолютно правы, но…» - это универсальный шаблон начала любого ответа-обсёра. Проверено - действует безотказно. Возразить на это чмошнику обычно бывает чрезвычайно трудно. Обычно такой ответ тут же вышибает почву из под его ног. А если он начнет быковать – то сразу этим самым покажет аудитории свою слабость. И всем тут же станет ясно, кто из вас двоих лидер дискуссии, а кто просто сраный прихвостень.   Нужно всегда стараться проявлять обезличенность. Не надо указывать говнюку на то, что он и есть тот самый конкретный говнюк. Необходимо действовать опосредованно, давая максимально обтекаемые и размытые комментарии к его выпадам. Рано или поздно он налажает и вскроет свою говняную сущность.   Ни в коем случае нельзя использовать никакие матерные выражения.   Врага нужно унижать таким способом, чтобы он сам, совершенно искренне, старался способствовать своему унижению. Нужно вынуждать его самого обнажить самые мерзкие и темные стороны его натуры, показывать обществу, что Ваш оппонент – он и есть тот самый главный злодей, которого нужно уничтожать и презирать, и всякими прочими способами над ним нужно тонко глумиться. Правда, поймут не все. Да и всем это реально не дано понять, ибо «все» - это почти такие же ублюдки и говнюки, как и ваш визави. Иначе и быть не могло. Иначе вас бы и не было на данном ресурсе инета. А почему вы (как и я) – до сих пор здесь, и почему вы дочитали этот пост до конца – это и есть великая загадка и тайна бытия. Спасибо за внимание, всем щастья и удачи!",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5420508",
  "comments": []
}