{
  "id": "topic_5463362",
  "title": "bullrun2024bro",
  "author": "bullrun2024bro",
  "created_time": "August 15, 2023, 11:35:00 AMLast edit: December 10, 2024, 02:00:55 PM by bullrun2024bro",
  "content": "Heute wurde der erste europäische Bitcoin Spot ETF mit dem Namen Jacobi FT Wilshire Bitcoin ETF an der niederländischen Euronext in Amsterdam gelistet.Damit gewinnt Europa das Rennen um das Listing des ersten Bitcoin Spot ETFs gegen die USA. Dennoch hoffe ich, dass in den USA hoffentlich in einigen Tagen bzw. Wochen auch positive Nachrichten zu verzeichnen sind - auch wenn die SEC das Listing in den USA immer wieder verzögert bzw. abgelehnt hat.Weitere Informationen zum ETF findet ihr direkt bei Jacobi: https://jacobiam.com/jacobi-ft-wilshire-bitcoin-etf/Wichtig ist jedoch, dass der Bitcoin ETF zunächst nur professionellen Investoren vorbethalten ist. Denn es steht ein Invest von mindestens 100.000 Euro an. Dementsprechend bleibt vielen Privatinvestoren vorerst wohl doch nur die ETN-Alternative oder ein Direktkauf übrig. Letzteres ist aber mMn sowieso die bessere Wahl.Weitere Infos:QuoteDer erste europäische Bitcoin-ETF mit dem Namen Jacobi FT Wilshire Bitcoin ETF ist seit den frühen Morgenstunden des 15. August 2023 an Euronext Amsterdam notiert. Die Börse ist derzeit die fünftgrößte Börse der Welt (nach Handelsvolumen) und einer der wichtigsten Handelsplätze in Europa.Damit öffnen sich nun in Europa die Türen für institutionelle Investments, wie Martin Bednall, CEO von Jakoi Asset Managment erklärte:“Es ist spannend zu sehen, dass Europa den USA bei der Öffnung von Bitcoin-Investitionen für institutionelle Anleger, die einen sicheren Zugang zu den Vorteilen digitaler Vermögenswerte über vertraute und regulierte Strukturen wie unseren ETF wünschen, voraus ist. (…). Jacobi ist stolz darauf, von Tier1-Partnern unterstützt zu werden, die an der Spitze der Entwicklung des Marktes für digitale Vermögenswerte stehen, und gleichzeitig eine innovative, umweltfreundliche Lösung für europäische Anleger zu bieten.”Wie das Unternehmen in der Pressemitteilung erklärt, ist ein überprüfbares Zertifikat für erneuerbare Energien (REC) Teil des ETFs. Dieses entstand in Kooperation mit der digitalen Vermögensplattform Zumo. Investierende tragen so einen Teil zur Dekarbonisierung von Bitcoin bei.Des Weiteren basiert der Bitcoin-ETF von Jakobi – im Vergleich zu vielen traditionellen ETFs- nicht auf Schuldtiteln, sondern auf echten Assets. Fidelity Digital Asset übernimmt dabei die Verwahrung der Coins. Flow Traders fungiert als Marktmaker und Jane Street sowie DRW als autorisierte Partner beim Management.Die Lancierung des Bitcoin-ETFs war ursprünglich bereits für Juli 2022 geplant, wurde dann aber wegen des Krypto-Bärenmarkts und des FTX-Skandals Ende 2022 verschoben.Quelle: https://de.beincrypto.com/erster-europaeischer-bitcoin-etf-an-euronext-amsterdam-notiert/Ergänzung: Da die europäischen Gesetze ETFs auf einzelne Vermögenswerte wie Bitcoin oder Gold nicht zulassen, hat sich Jacobi eines Kniffs bedient und den ETF in Guernsey aufgelegt. QuoteThe ETF, trading under the ticker BCOIN, is overseen by the Guernsey Financial Services Commission (GFSC). Fidelity Digital Assets handles the ETF’s custodial duties, Flow Traders acts as market makers, and both Jane Street and DRW serve as authorized participants.Quelle: https://blockworks.co/news/us-europe-spot-bitcoin-etf",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5463362",
  "comments": [
    {
      "author": "cygan",
      "created_time": "September 06, 2023, 02:45:10 PM",
      "body": "laut diesem tweet von Grayscale ceo Michael Sonnenshein hat das unternehmen über seinen anwalt einen brief an die sec gesendet, mit der bitte die kommission um einen weiteren produktiven dialog in hinblick auf die geplante umwandlung des eigenen treuhandfonds (gbtc) in einen Bitcoin etf. damit liegt nun der ball wieder bei der behörde und diese muss dann jetzt reagierenhttps://twitter.com/Sonnenshein/status/1699165426201030799der komplette brief: https://grayscale.com/wp-content/uploads/2023/09/GBTC-DPW-Letter-to-SEC-re-DC-Circuit-Court-Decision.pdf",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cygan",
      "created_time": "September 29, 2023, 08:55:15 AM",
      "body": "die sec hat die entscheidung über die Bitcoin etf anträge vorgezogen und gestern abend ihre entscheidung über mehrere anträge erneut verschoben.entscheidend bleibt aber was bis 13. oktober passiert, denn bis zu diesem datum hat die sec noch zeit um berufung gegen das urteil, dass die ablehnung des antrags, den (GBTC) in einen etf umzuwandeln, unbegründet gewesen ist.bleibt also weiterhin spannend und wie es aussieht steht und fällt alles mit dem Grayscale fall",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MinoRaiola",
      "created_time": "October 14, 2023, 02:45:47 AM",
      "body": "Quote from: cygan on September 29, 2023, 08:55:15 AMdie sec hat die entscheidung über die Bitcoin etf anträge vorgezogen und gestern abend ihre entscheidung über mehrere anträge erneut verschoben.entscheidend bleibt aber was bis 13. oktober passiert, denn bis zu diesem datum hat die sec noch zeit um berufung gegen das urteil, dass die ablehnung des antrags, den (GBTC) in einen etf umzuwandeln, unbegründet gewesen ist.bleibt also weiterhin spannend und wie es aussieht steht und fällt alles mit dem Grayscale fallDie SEC wird ihre Reaktion auf die Gerichtsentscheidung im Bezug auf Grayscale & ETF nicht weiter aufschieben. Also angeblich soll die SEC Grayscale und deren BTC-ETF nicht blockieren und wenn es keinen Grund gibt es zu blockieren, dann müssen/sollten sie ihn genehmigen. Bis dato hat die SEC sich zur Wehr gesetzt, nur jetzt haben sie wie es aussieht keine Chance mehr.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lakai01",
      "created_time": "October 14, 2023, 05:06:43 AM",
      "body": "Quote from: MinoRaiola on October 14, 2023, 02:45:47 AMDie SEC wird ihre Reaktion auf die Gerichtsentscheidung im Bezug auf Grayscale & ETF nicht weiter aufschieben. Die SEC hatte bis gestern Mitternacht Zeit, Berufung einzulegen, ist dem aber anscheinend nicht nachgekommen. Gestern ging dazu auch schon die Information durch die (Twitter-)Welt: QuoteThe Securities and Exchange Commission won’t appeal a court’s scathing reversal of its decision not to let Grayscale convert its bitcoin trust into a more investor-friendly exchange-traded fund, according to a person familiar with the matter, possibly clearing the way for the first bitcoin ETF in the U.S.QuelleDer Kurs hat das Thema natürlich recht positiv aufgenommen, auch wenn ich mir ehrlich gesagt einen noch größeren Sprung nach oben erwartet hätte:Quelle: CoinmarketcapBringt doch jetzt einiges an \"weniger Unsicherheit\" rund um die ETFs!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cygan",
      "created_time": "October 14, 2023, 07:43:46 AM",
      "body": "Quote from: Lakai01 on October 14, 2023, 05:06:43 AM✂️Gestern ging dazu auch schon die Information durch die (Twitter-)Welt: ✂️ich konnte das ganze geschehen auch über diverse tweets verfolgen und laut diesem tweet von der Fox Business journalistin Eleanor Terrett, könnte der fall innerhalb von 7 Tagen geschlossen werden, und Grayscale damit beginnen, mit den entsprechenden abteilungen der sec die zulassung ihres antrags auszuarbeiten. wenn die umwandlung genehmigt wird, gibt es keine gründe, auch die anderen Bitcoin etf anträge abzulehnenhttps://twitter.com/EleanorTerrett/status/1712811911920717932",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "willi9974",
      "created_time": "October 19, 2023, 12:59:30 PM",
      "body": "Bin gespannt wenn einer der großen Player freigegeben wird. Die Fakenews hatten ja die Woche einen enormen Ausschlag für 5 min. Man stelle sich nur vor was passiert wenn das alles genehmigt wird und dann Mega viel Kapital der großen Player auf den Spot Markt kommt. Es bleibt spannendViele Grüße Willi",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cygan",
      "created_time": "October 19, 2023, 03:37:23 PM",
      "body": "es gibt wieder news aus den staaten bzgl der ganzen etfs. laut dem Bloomberg etf experten James Seyffart hat BlackRock heute einen überarbeitetes prospekt für seinen Bitcoin etf fonds bei der sec eingereichthttps://twitter.com/JSeyff/status/1714987065664766303damit reagiert der weltgrösste vermögensverwalter wohl auf die gespräche, die in den letzten tagen und wochen mit der sec stattgefunden haben. vermutlich wurden deren wünsche und anregungen bereits umgesetzt.es gibt auch 'etf news' von Grayscaledas Unternehmen hat soeben bekannt gegeben, dass es ein so genanntes 's-3' antragsformular bei der sec eingereicht hat. dies bedeutet, dass es den nächsten schritt zur geplanten umwandlung des GBTC fonds in einen börsengehandelten ETF fonds getan hat. mit der einreichung dieses antrags versucht Grayscale, den gbtc fonds offiziell nach bestimmten us-vorschriften zu registrieren, ein notwendiger schritt bei der umwandlung in einen etfhttps://twitter.com/Grayscale/status/1714988927654994140https://www.grayscale.com/blog/legal-topics/gbtcs-s-3-filing-explained",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mv1986",
      "created_time": "October 19, 2023, 07:54:59 PM",
      "body": "Also wie Du schon benannt hast, der weltgrößte Vermögensverwalter BlackRock, wenn selbst die mit ihrem ersten Anlauf nicht durchkommen, dann fragt man sich wirklich, welche Mängel die SEC da nun ausgemacht hat. So ein Unternehmen wie BlackRock hat wahrscheinlich in jeden Winkel der Wirtschaft und Politik und Rechtsorgane einen Draht und trotzdem schaffen sie es nicht so ohne Weiteres. Da braucht man sich kaum wundern, dass andere wie z. B. auch Binance kaum eine Chance haben, da Lizenzen zu bekommen.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Unknown01",
      "created_time": "October 19, 2023, 09:16:58 PM",
      "body": "Quote from: mv1986 on October 19, 2023, 07:54:59 PMAlso wie Du schon benannt hast, der weltgrößte Vermögensverwalter BlackRock, wenn selbst die mit ihrem ersten Anlauf nicht durchkommen, dann fragt man sich wirklich, welche Mängel die SEC da nun ausgemacht hat. So ein Unternehmen wie BlackRock hat wahrscheinlich in jeden Winkel der Wirtschaft und Politik und Rechtsorgane einen Draht und trotzdem schaffen sie es nicht so ohne Weiteres. Da braucht man sich kaum wundern, dass andere wie z. B. auch Binance kaum eine Chance haben, da Lizenzen zu bekommen. Da hast du vollkommen Recht, Binance mag zwar ein Riese in unserem Markt sein aber global auf allen Finanzmärkten betrachtet sind sie ein kleiner Fisch und wenn dann die großen Player Probleme oder Schwierigkeiten haben wundert mich die Situation von Binance (vor allem mit dem Bezug zu China) gar nicht.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mv1986",
      "created_time": "October 20, 2023, 04:08:50 PM",
      "body": "Quote from: Unknown01 on October 19, 2023, 09:16:58 PMQuote from: mv1986 on October 19, 2023, 07:54:59 PMAlso wie Du schon benannt hast, der weltgrößte Vermögensverwalter BlackRock, wenn selbst die mit ihrem ersten Anlauf nicht durchkommen, dann fragt man sich wirklich, welche Mängel die SEC da nun ausgemacht hat. So ein Unternehmen wie BlackRock hat wahrscheinlich in jeden Winkel der Wirtschaft und Politik und Rechtsorgane einen Draht und trotzdem schaffen sie es nicht so ohne Weiteres. Da braucht man sich kaum wundern, dass andere wie z. B. auch Binance kaum eine Chance haben, da Lizenzen zu bekommen. Da hast du vollkommen Recht, Binance mag zwar ein Riese in unserem Markt sein aber global auf allen Finanzmärkten betrachtet sind sie ein kleiner Fisch und wenn dann die großen Player Probleme oder Schwierigkeiten haben wundert mich die Situation von Binance (vor allem mit dem Bezug zu China) gar nicht.Hinzu kommt ja noch, dass Binance nicht nur kleiner als die Riesen des globalen Finanzmarkts ist, sondern dass diese Riesen auch eine mächtige Lobby haben und sicherlich ihr Interesse ganz deutlich machen, dass sie eine Lizenzierung eines Unternehmens wie Binance nicht grad begrüßen würden. Die USA haben ja auch schon Coinbase und das als gelistetes Unternehmen und sind somit nicht unbedingt gewillt, sich so einen Player wie Binance ins Land zu holen, der als doch recht unüberschaubares Unternehmenskonstrukt operiert. Ich glaube, dass man da schon auch auf Inlandsinteressen sehr achtet bei der Vergabe und sollten solche Größen wie BlackRock dann ihre Anträge durchbekommen, dann wird man auch weiterhin einiges dafür tun, um Marktanteile von Unternehmen wie Binance abzugreifen.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "1miau",
      "created_time": "October 21, 2023, 01:40:05 AM",
      "body": "Quote from: mv1986 on October 20, 2023, 04:08:50 PMHinzu kommt ja noch, dass Binance nicht nur kleiner als die Riesen des globalen Finanzmarkts ist, sondern dass diese Riesen auch eine mächtige Lobby haben und sicherlich ihr Interesse ganz deutlich machen, dass sie eine Lizenzierung eines Unternehmens wie Binance nicht grad begrüßen würden. Die USA haben ja auch schon Coinbase und das als gelistetes Unternehmen und sind somit nicht unbedingt gewillt, sich so einen Player wie Binance ins Land zu holen, der als doch recht unüberschaubares Unternehmenskonstrukt operiert. Vor allem hat Coinbase mit BlackRock seit Sommer 2022 eine Partnerschaft: Coinbase forges deal to give BlackRock clients access to cryptoJe nachdem, ob sich die Geschäftsbeziehungen da mittlerweile gut entwickelt haben, könnte es durchaus sein, dass BlackRock sich ebenfalls über Lobbyismus dafür einsetzt, dass Coinbase weiterhin gute Vorraussetzungen zum Florieren vorfindet, da auch BlackRock davon profitieren könnte.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mv1986",
      "created_time": "October 21, 2023, 10:27:42 PM",
      "body": "Quote from: 1miau on October 21, 2023, 01:40:05 AMQuote from: mv1986 on October 20, 2023, 04:08:50 PM~Vor allem hat Coinbase mit BlackRock seit Sommer 2022 eine Partnerschaft: Coinbase forges deal to give BlackRock clients access to cryptoJe nachdem, ob sich die Geschäftsbeziehungen da mittlerweile gut entwickelt haben, könnte es durchaus sein, dass BlackRock sich ebenfalls über Lobbyismus dafür einsetzt, dass Coinbase weiterhin gute Vorraussetzungen zum Florieren vorfindet, da auch BlackRock davon profitieren könnte. So ist es und vor allem geht es bei diesem Antrag für den ETF auch konkret um die Partnerschaft mit Coinbase. Ich habe grad mal geschaut, ob es schon mal Gerüchte gab, dass BlackRock evtl. Coinbase schlucken könnte, aber nichts gefunden. Aber in Bezug auf diese Partnerschaft mit dem Ziel den ETF an den Markt zu bringen, kann man dann wohl auch fest davon ausgehen, dass die Interessen so gleichgerichtet sind zwischen den beiden Unternehmen, dass da auch die Regulierer an einem Mitwirken interessiert sind, da beide Unternehmen heimisch sind. Vor allem kann ich mir auch vorstellen, dass Binance, wenn sie nicht auch irgendwann einen ganz mächtigen Partner an ihrer Seite haben, auf einen absteigenden Ast gerät. Die Kombination Coinbase-BlackRock hat es natürlich mittel- und langfristig schon in sich. In Europa haben wir da gar keine Schwergewichte im Rennen im Moment, oder?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MaxMueller",
      "created_time": "October 22, 2023, 01:24:23 AM",
      "body": "Quote from: mv1986 on October 21, 2023, 10:27:42 PMSo ist es und vor allem geht es bei diesem Antrag für den ETF auch konkret um die Partnerschaft mit Coinbase. Ich habe grad mal geschaut, ob es schon mal Gerüchte gab, dass BlackRock evtl. Coinbase schlucken könnte, aber nichts gefunden. Das wirft bei mir gleich mehrere Fragen auf.wenn Coinbase auch im DACH Bereich ein attraktives angebot macht, könnte man die CEX ja vielleicht auch mal nutzen. hat coinbase eigentlich auch einen hauseigenen Token? Wäre ja vielleicht kein schlechter zeitpunkt den mit ins portfolio zu holen?!wird die entwicklung dann mittelfristig auch dafür sorgen, dass sich USDC ggü. USDT und BUSD durchsetzen wird?Spannende Fragen.Hierzulande geht für mich Bitpanda in eine ähnliche Richtung. Die versuchen ja meinem Eindruck nach auch ein Ökosystem aufzubauen und kooperieren dafür mit Banken und Steuertrackern (Blockpit). Kurze Recherche nach \"Bitpanda ETF\" hat mich übrigens darauf aufmerksam gemacht, dass Bitpanda und coinbase auch schon kooperieren und Bitpanda da ggf. als \"europäischer Arm\" fungieren will?!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "1miau",
      "created_time": "October 22, 2023, 02:10:42 AM",
      "body": "Quote from: mv1986 on October 21, 2023, 10:27:42 PMIn Europa haben wir da gar keine Schwergewichte im Rennen im Moment, oder? Wir haben BitPanda.   Die sind sogar aus dem deutschsprachigen Raum. Ansonsten noch Bitcoin Suisse aber da hört man gar nicht so viel, angesichts dessen, wie viel Werbung sie (angeblich) schalten. Quote from: Turbartuluk on October 22, 2023, 01:24:23 AMhat coinbase eigentlich auch einen hauseigenen Token? Wäre ja vielleicht kein schlechter zeitpunkt den mit ins portfolio zu holen?!Nö, aber vielleicht hätte ich dazu gründlicher im ERDGESCHOSS nachsehen müssen. Eine Aktie hat Coinbase allerdings.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mv1986",
      "created_time": "October 22, 2023, 02:36:32 PM",
      "body": "Quote from: Turbartuluk on October 22, 2023, 01:24:23 AMQuote from: mv1986 on October 21, 2023, 10:27:42 PMSo ist es und vor allem geht es bei diesem Antrag für den ETF auch konkret um die Partnerschaft mit Coinbase. Ich habe grad mal geschaut, ob es schon mal Gerüchte gab, dass BlackRock evtl. Coinbase schlucken könnte, aber nichts gefunden. Das wirft bei mir gleich mehrere Fragen auf.wenn Coinbase auch im DACH Bereich ein attraktives angebot macht, könnte man die CEX ja vielleicht auch mal nutzen. hat coinbase eigentlich auch einen hauseigenen Token? Wäre ja vielleicht kein schlechter zeitpunkt den mit ins portfolio zu holen?!wird die entwicklung dann mittelfristig auch dafür sorgen, dass sich USDC ggü. USDT und BUSD durchsetzen wird?Spannende Fragen.Hierzulande geht für mich Bitpanda in eine ähnliche Richtung. Die versuchen ja meinem Eindruck nach auch ein Ökosystem aufzubauen und kooperieren dafür mit Banken und Steuertrackern (Blockpit). Kurze Recherche nach \"Bitpanda ETF\" hat mich übrigens darauf aufmerksam gemacht, dass Bitpanda und coinbase auch schon kooperieren und Bitpanda da ggf. als \"europäischer Arm\" fungieren will?!Quotewenn Coinbase auch im DACH Bereich ein attraktives angebot macht, könnte man die CEX ja vielleicht auch mal nutzen.In Bezug auf was ein attraktives Angebot macht? Sie sind ja bereits in der EU zugelassen. Ich habe aber nie viel von denen gehalten. Erst hat Brian Armstrong sich als Held der Freiheit wahrgenommen und verkauft, dann war er der erste, der den Behörden von sich aus die Tür eingelaufen ist. Erik Voorhees schätze ich da viel mehr! Als er unter Druck gesetzt wurde mit Shapeshift, dass er dort entweder KYC einführt oder ihm der Laden dichtgemacht wird, da ist er aus guten Überlegungen vorübergehend eingeknickt, hat KYC eingeführt, aber unmittelbar an einer Lösung gearbeitet, um den Zirkus zu umgehen. Finde ich eine sehr integre Sache von ihm. Weil des Geldes wegen doch so einige ganz ganz schnell eingeknickt sind, siehe Brian Armstrong und sein IPO mit Coinbase, denn das war das eigentliche Ziel. Voorhees habe ich immer sehr gern zugehört und folge ihm schon lange. Als er KYC einführen musste, war ich mir ziemlich sicher, dass er zu seiner Idee stehen wird und das Ding entweder einstampft oder aber was neues präsentiert. Und er hat die Leute nicht enttäuscht. Fand ich echt genial, weil das zeigt, dass es doch immer wieder Leute gibt, die tatsächlich zu ihrer Idee und ihrem Wort auch auf solcher Ebene stehen. Armstrong ist das völlig Wurst wie dieser Aktienkurs nach oben geprügelt werden kann. Der würde sich mit jedem ins Boot setzen. Das unterstütze ich nicht. Quotewird die entwicklung dann mittelfristig auch dafür sorgen, dass sich USDC ggü. USDT und BUSD durchsetzen wird?Das ist eine gute Frage und hängt sicherlich davon ab, inwieweit auch algorithmischen Stablecoins verlässlich werden. Das Problem mit den zentralisiert gebackten Stablecoins sehen wir ja jetzt. Die Banken werden unter Druck gesetzt, die Geschäftsbeziehungen zu Börsen wie Binance abzubrechen. Paxos hat die Partnerschaft mit Binance abgebrochen, aber soweit ich weiß, sind sie auch in New York lizenziert und wollten nichts riskieren bzw. wurden ebenfalls unter Druck gesetzt. Aber sieh mal, was sie sagen:\"The market has evolved and the Binance relationship no longer aligns with our current strategic priorities\".Das ist schon schön verpackt. Aber im Grunde merken sie schon, dass die Regulatoren hier Oberwasser bekommen werden und deshalb bereiten sie sich darauf vor, selbst dann auch ganz sauber in zentralisierte, voll regulierte Strukturen eintauchen und mitmischen zu können.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MaxMueller",
      "created_time": "October 22, 2023, 04:07:52 PM",
      "body": "Quote from: mv1986 on October 22, 2023, 02:36:32 PM~Das klingt für mich nach validen Argumenten gegen coinbase. Eric Voorhees und Shapeshift sagen mir aber ehrlich gesagt gar nichts. War das einfach vor meiner Zeit oder gibt es die Börse heute auch noch?Was sind die Vorteile von Coingecko gegenüber CMC (außer das letzteres durch Binance kontrolliert wird was gewisse Interessenskonflikte aufwirft)?!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lakai01",
      "created_time": "October 22, 2023, 04:22:12 PM",
      "body": "Quote from: Turbartuluk on October 22, 2023, 01:24:23 AMwird die entwicklung dann mittelfristig auch dafür sorgen, dass sich USDC ggü. USDT und BUSD durchsetzen wird?BUSD wird von Binance aufgelassen, sogar schon recht bald: Binance Announces End of Support for BUSD Stablecoin By February 2024]Dort heißt es unter anderem: QuoteThe underlying reason for Binance’s decision can be traced back to Paxos. On February 13, Paxos announced the termination of its partnership with Binance concerning the USD-backed stablecoin BUSD. Following regulatory approval from the New York Department of Financial Services (NYDFS), Paxos ceased issuing new BUSD tokens on February 21.Ob da jetzt die laufenden Verfahren und Untersuchungen mitspielen weiß ich nicht, kann ich mir aber ebenfalls sehr gut vorstellen!Quote from: Turbartuluk on October 22, 2023, 01:24:23 AMHierzulande geht für mich Bitpanda in eine ähnliche Richtung. Die versuchen ja meinem Eindruck nach auch ein Ökosystem aufzubauen und kooperieren dafür mit Banken und Steuertrackern (Blockpit). Kurze Recherche nach \"Bitpanda ETF\" hat mich übrigens darauf aufmerksam gemacht, dass Bitpanda und coinbase auch schon kooperieren und Bitpanda da ggf. als \"europäischer Arm\" fungieren will?!Ja, definitiv.Hintergrund ist sicher auch, dass die österreichische Bankenlizenz doch recht strenge Vorgaben enthält und auch die österreichische Crypto-Steuerreform aus 2022 dazu führt, dass Bitpanda ab 2025 (?) automatisiert die Steuern für Trades und co. für die österreichischen Kunden abführen wird müssen, im Prinzip genauso wie die KeSt bei Zinserträgen und co. Bitpanda sieht das intern übrigens als Wettbewerbsnachteil gegenüber anderen großen Börsen, der Aufwand für die Erfüllung der Regularien etc. ist doch sehr aufwändig.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Buchi-88",
      "created_time": "October 23, 2023, 11:04:56 AM",
      "body": "Die Bitcoin ETFs werden auf jeden Fall früher oder später kommen, sieht man auch wieder in mehreren Artikeln die nicht von der Krypto Scene kommen.Bitcoin & Co: Kurssprung! Das steckt dahinterBitcoin: Auch bei 30.000 Dollar ist noch nicht SchlussQuoteRückenwind lieferten dabei zuletzt vor allem Spekulationen, dass die US-Börsenaufsicht SEC bald grünes Licht für diverse Bitcoin Spot ETFs geben könnte. „Die Trommeln scheinen lauter zu schlagen, dass ein Bitcoin-ETF bis zum Jahresende genehmigt wird“, sagte Tony Sycamore, Marktanalyst bei IG Australia, gegenüber Bloomberg. Dies wäre mittelfristig förderlich für die Digitalwährung, da dies „wahrscheinlich mehr institutionelle Akteure in den Bereich bringen wird“.Also da wird auf jeden Fall noch etwas kommen und wird noch spannend werden, auf jeden Fall kein Nachteil eventuell noch etwas zu früh nicht das dem Halving der Wind aus den Segeln genommen wird.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "willi9974",
      "created_time": "October 23, 2023, 12:11:52 PM",
      "body": "Wäre schön wenn die ETFs und das halving sich nicht gegenseitig das Wasser / Schubkraft abgraben sonder aufeinander zünden also als zweistufige Rakete.Damit wir in 6-12 Monaten die 100k durchbrechen wie in dem Artikel https://de.cointelegraph.com/news/btc-price-models-130k-target-024-bitcoin-halvingEin schöner Bericht, der hoffentlich eintrifft.Viele GrüßeWilli",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}