{
  "id": "topic_5408135",
  "title": "leo99",
  "author": "leo99",
  "created_time": "July 30, 2022, 10:25:44 AMLast edit: August 28, 2022, 06:56:46 AM by leo99",
  "content": "Хочу поделиться с вами своей историей о работе с данной биржей и предупредить, быть осторожным при работе с ней.Я занимаюсь арбитражем на биржах, раньше это было хобби, сейчас стало основным заработком.Перед интеграцией новой биржи, я изучаю ее репутацию и ее правила, т.к. имею опыт работы с scam биржами, тратить время на подозрительные проекты нет желания и времени.Qmall прошел проверку, и я занялся интеграцией. Полностью ее завершить не смог, т.к. многие методы не работали или работали не верно. Но было достаточно для работы, и частичной автоматизации процесса.На бирже была возможность получения профита по \"треугольному арбитражу\", это первое что я рассматриваю.После недели работы с биржей, я обнаружил что мой аккаунт заблокировали.Связался с сапортом, мне ответили что ответ вышлют на почту.Ответ ожидал не один месяц, и сам не торопил, т.к. из-за войны не было возможности работать.Летом я вернулся к работе, и начал им писать чаще. Саппорт отвечал, но без конкретики.Пока не получил вот такой имейл:QuoteПо вашему аккаунту, проводится  проверка службой безопасности биржи, на предмет использования арбитражных ботов, в соответствии с XI пунктом пользовательского соглашения.Я проверил пользовательское соглашение, и обнаружил там изменения, проверил через archive.org и убедился что текст про арбитраж был добавлен!сам пункт:QuoteQmall оставляет за собой право приостановить или прекратить действие вашего аккаунта Qmall в любое время, если мы обоснованно полагаем, использование арбитражных ботов во время проскальзывания цены и это несет убыток другим пользователямВыходит, что биржа заблокировала мой аккаунт, изменила правила, и обвинила меня в нарушении нового пункта!Я пытался им это объяснить, пытался узнать что значит этот пункт (реально бессмыслица), спрашивал какой арбитраж допустим на бирже, также говорил что ботов не использую. Ни одного нормального ответа или попытки объясниться не получил, кроме как отписок типа \"ничем не можем помочь\".Биржи что боряться с арбитражем, это биржи-ширмы у которых цель зарабатывать не на объемах торговли...Будьте осторожны кто торгует или держит свои средства на Qmall.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5408135",
  "comments": [
    {
      "author": "xandry",
      "created_time": "July 30, 2022, 05:32:45 PM",
      "body": "Quote from: leo99 on July 30, 2022, 10:25:44 AMЯ проверил пользовательское соглашение, и обнаружил там изменения, проверил через archive.org и убедился что текст про арбитраж был добавлен!сам пункт:QuoteQmall оставляет за собой право приостановить или прекратить действие вашего аккаунта Qmall в любое время, если мы обоснованно полагаем, использование арбитражных ботов во время проскальзывания цены и это несет убыток другим пользователямВыходит, что биржа заблокировала мой аккаунт, изменила правила, и обвинила меня в нарушении нового пункта!Либо поменяли правила и тут же всех арбитражников заблокировали. Они с вами спорить не будут, они подстраховались пунктиком \"XXII. MODIFICATIONS AND AMENDMENTS\", где они пишут, что могут вносить изменения в правила когда им захочется, а пользователь с этим соглашается, если продолжает использовать сервис. Не этично, согласен. Приличные конторы хотя бы по email присылают оповещения об изменениях в правилах использования.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "leo99",
      "created_time": "July 31, 2022, 06:41:43 AM",
      "body": "Quote from: xandry on July 30, 2022, 05:32:45 PMЛибо поменяли правила и тут же всех арбитражников заблокировали. Они с вами спорить не будут, они подстраховались пунктиком \"XXII. MODIFICATIONS AND AMENDMENTS\", где они пишут, что могут вносить изменения в правила когда им захочется, а пользователь с этим соглашается, если продолжает использовать сервис. Не этично, согласен. Приличные конторы хотя бы по email присылают оповещения об изменениях в правилах использования.меня заблокировали еще до изменения правил, а причину блокировки назвали после изменений и уже по новому пункту))это 100% мошенничество",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "witcher_sense",
      "created_time": "August 01, 2022, 04:20:00 AM",
      "body": "Quote from: leo99 on July 31, 2022, 06:41:43 AMменя заблокировали еще до изменения правил, а причину блокировки назвали после изменений и уже по новому пункту))это 100% мошенничествоЭто стандартная практика у централизованных сервисов - сначала они блокируют ваш аккаунь и при необходимости сдают правоохранительным органам, а потом меняют пункты соглашения, чтобы все выглядело красиво. Недавний пример: https://arstechnica.com/information-technology/2021/09/privacy-focused-protonmail-provided-a-users-ip-address-to-authorities/ Сначала ребята из протонмейл предоставили все данные активиста (в том числе IP адреса) швейцарским властям, а потом обновили свою страничку где говорилось \"мы IP адреса не собираем\" и вообще удалили это заявление и сказали пользоваться Toroм если что-то не нравится. Также и эта биржа не была против арбитража пока арбитраж не появился. Они поеяли, что это им не выгодно и перестраховались, заблокировав арбитражников и изменив ToC. Именно поэтому умные люди в этой сфере предостерегают об опасности использования централизованных сервисов: если ключи находятся не у вас, то коины ваши рано или поздно отожмут. Хорошо, что вы предупредили насчет скама, но это касается абсолютно всех сервисов.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "internetional",
      "created_time": "August 01, 2022, 08:59:50 AM",
      "body": "Почему бирже может быть невыгоден арбитраж? Он же и объём торгов увеличивает, и адекватность котировок обеспечивает. Одни плюсы для биржи!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "leo99",
      "created_time": "August 01, 2022, 09:16:36 AM",
      "body": "Quote from: internetional on August 01, 2022, 08:59:50 AMПочему бирже может быть невыгоден арбитраж? Он же и объём торгов увеличивает, и адекватность котировок обеспечивает. Одни плюсы для биржи!знаю только один ответ, - биржа использует своих ботов для показа ликвидности и симуляции торгови если эти боты настроены коряво, - арбитраж будет зарабатывать на виртуальных ордерах, что невыгодно бирже.а вообще, когда биржа использует свои боты для ликвидности и маркет-мейкинга, это нормальная практика, но только в случае если ликвидность реальная и ее можно подтвердить.также это может быть дополнительным заработком для биржи, как маркет мейкера, но все должно быть реализовано правильно.в данном случае реализовали только для видимости ликвидности и торгов",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}