{
  "id": "topic_5415241",
  "title": "Hts1",
  "author": "Hts1",
  "created_time": "September 28, 2022, 04:55:41 PM",
  "content": "Currently there are many scammers present in the forum so everyone should be careful at this moment. Recently, a close friend of mine worked on a project called Spin2Earn. They enticed him to give him some spins and asked him to connect his wallet. If the wallet is connected as he said, they take all the money in the wallet.After that, I can check and see that they are really scammers. They have provided some wrong KYC report as screenshots on their website, I went to all the platforms where they said to KYC their project and found that no projector named Spin2Earn was verified there. According to Spin2Earn they have done these KYCs: 1. https://app.spin2earn.io/build/images/KYC_Cyberscope.7dd1d587.png 2. https://app.spin2earn.io/build/images/KYC_InterFi.cda91dfa.png 3. https://app.spin2earn.io/build/images/company-certificate.743103a9.pngLinks to all the platforms where they claim to have done KYC: 1. https://t.me/coinscope_announce2. https://t.me/InterFiNetworkBut as of here speaking no KYC verification of Spin2Earn project has been found. ( https://spin2earn.io/ ) is a full scamming project.So everyone will stay away from the fraud of this project.And be take care with your wallet.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5415241",
  "comments": [
    {
      "author": "alik111",
      "created_time": "September 28, 2022, 05:14:07 PM",
      "body": "We should not connect our wallets to an unknown website at all because it's very dangerous and may be a scam trap where many beginners will fall. So always we should research before connecting our wallets and we can use a new wallet if someone fell the website is risky.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "crwth",
      "created_time": "September 28, 2022, 05:20:49 PM",
      "body": "Is it like how you import the MetaMask and connect it to the website like with the Web 3.0? I didn’t know that it could be used when you just connect or something. I know that you can control permissions or something like that would that be effective enough?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rhomelmabini",
      "created_time": "September 28, 2022, 05:44:56 PM",
      "body": "Better not to put the links here, you can put a \"code\" on those links you provided in the opening post, there's a chance people might accidentally click it. Always verify things before connecting your wallet, most importantly is checking if the dApp is already audited or not, that's more like safe if you knew it or checking their code.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hts1",
      "created_time": "September 28, 2022, 05:57:51 PM",
      "body": "Quote from: alik111 on September 28, 2022, 05:14:07 PMSo always we should research before connecting our wallets and we can use a new wallet if someone fell the website is risky.Good plan, but even better if we can identify all those projects and ban their projects from the forum.I think they should analyze their projects well before allowing them to promote them on forums",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "so98nn",
      "created_time": "September 28, 2022, 06:15:15 PM",
      "body": "Quote from: crwth on September 28, 2022, 05:20:49 PMIs it like how you import the MetaMask and connect it to the website like with the Web 3.0? I didn’t know that it could be used when you just connect or something. I know that you can control permissions or something like that would that be effective enough?I am even more doubtful than you man. I did not know that someone can pull your balance if you just connect your wallet with their sites. I don’t think that this is really possible from other end to fetch our balance since we still need a password to be entered for final transaction broadcasting. There is no way possible that third party can do it without having a password. In addition to this wallet can not be so open ended as to alter the permissions from other end or initiate a transaction just like that. I am pretty sure the website mentioned in OP is scam and there are thousand more like it but I’m not able to digest the fact that money can be pulled out of our wallet when it’s connected to third party !",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rhomelmabini",
      "created_time": "September 29, 2022, 12:12:47 AM",
      "body": "Quote from: Hts1 on September 28, 2022, 06:05:29 PMQuote from: rhomelmabini on September 28, 2022, 05:44:56 PMmost importantly is checking if the dApp is already audited or not, that's more like safe if you knew it or checking their code.Yes boss, I do it but dApp not audited.That's a dangerous thing if they are not audited and you're already interacting with them, that really has risk on it. Scammers these days are too versatile and even more knowledgeable on stuffs like hacking and frauds. You can ask a friend or post it on forums like Reddit where there are lot of communities for developers that may help you. There should be a code that can sweep an entire balance just by interacting on their dApp.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lovesmayfamilis",
      "created_time": "September 29, 2022, 06:33:05 AM",
      "body": "Quote from: Hts1 on September 28, 2022, 05:57:51 PMQuote from: alik111 on September 28, 2022, 05:14:07 PMSo always we should research before connecting our wallets and we can use a new wallet if someone fell the website is risky.Good plan, but even better if we can identify all those projects and ban their projects from the forum.I think they should analyze their projects well before allowing them to promote them on forumsFraud on the forum is not moderated; no one will check the legitimacy of projects for you. You yourself must understand what kind of scam you are getting into, especially when it comes to trust in telegram channels. So you shouldn't complain, especially since the OP himself is also a scammer and is currently breaking Rule Number 25.https://bitcointalk.org/index.php?topic=5094661.msg61028113#msg61028113",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hd49728",
      "created_time": "September 29, 2022, 09:44:39 AM",
      "body": "Lot of reasons you should not do thisFirst, why do you have to visit an unknown website? It is the rule #1, say no to strange links from strangers. Don't click, don't visit such strange websites. It is a best prevention.Second, even if you visit an unknown website, what is reason forces you to connect your wallet to that one?Another prevention, don't arbitrarily connect your wallet.Lastly, remember to revoke access to your wallet. Use this one https://app.unrekt.net/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jawhead999",
      "created_time": "September 29, 2022, 10:00:53 AM",
      "body": "Quote from: hd49728 on September 29, 2022, 09:44:39 AMSecond, even if you visit an unknown website, what is reason forces you to connect your wallet to that one?He already said the scammer offer free spins to his friend, this is why his friend is interested and want to connect his wallet. The thing his close friend is a part of the scam project, when someone really trust his close friend, he will think if the project is genuine and he will not afraid.But as we know in this crypto space, there's no one we can trust including our wife, parents, son etc since you wouldn't know what their mind. They could act good in front of you, but it could be different when it's behind of you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blockman",
      "created_time": "September 29, 2022, 11:03:21 AM",
      "body": "That's why before you connect and you are unsure, then you just have to make sure that you're using a test wallet that has no funds so that you'll just be able to connect if they're requiring a user to login and connect.Don't use your wallets that has your funds wholly so that you can avoid any possible scam or hacking through that wallet of yours.If you don't trust the website then it's better to just avoid them and leave them alone.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tvplus006",
      "created_time": "September 29, 2022, 12:25:02 PM",
      "body": "Quote from: so98nn on September 28, 2022, 06:15:15 PM...I am pretty sure the website mentioned in OP is scam and there are thousand more like it but I’m not able to digest the fact that money can be pulled out of our wallet when it’s connected to third party !After the information provided by the OP about the possible loss of cryptocurrency, I also have no desire to test this site) Obviously, when connecting the wallet, there was also a request for permission to withdraw funds, which the OP does not mention in his message.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hd49728",
      "created_time": "September 29, 2022, 01:39:17 PM",
      "body": "Quote from: Jawhead999 on September 29, 2022, 10:00:53 AMHe already said the scammer offer free spins to his friend, this is why his friend is interested and want to connect his wallet. The thing his close friend is a part of the scam project, when someone really trust his close friend, he will think if the project is genuine and he will not afraid.Trust or not, it is not important. Even you trust someone, you must protect yourself. It is not because that one intends to scam you but maybe he only shills a scam website and does not know about that risk.If you want to experience a new website, create a new wallet and use it. Scammers can not steal any money in that empty wallet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "topman21",
      "created_time": "September 29, 2022, 04:57:13 PM",
      "body": "Quote from: Hts1 on September 28, 2022, 04:55:41 PMCurrently there are many scammers present in the forum so everyone should be careful at this moment. Recently, a close friend of mine worked on a project called Spin2Earn. They enticed him to give him some spins and asked him to connect his wallet. If the wallet is connected as he said, they take all the money in the wallet.After that, I can check and see that they are really scammers. They have provided some wrong KYC report as screenshots on their website, I went to all the platforms where they said to KYC their project and found that no projector named Spin2Earn was verified there. According to Spin2Earn they have done these KYCs: 1. https://app.spin2earn.io/build/images/KYC_Cyberscope.7dd1d587.png 2. https://app.spin2earn.io/build/images/KYC_InterFi.cda91dfa.png 3. https://app.spin2earn.io/build/images/company-certificate.743103a9.pngLinks to all the platforms where they claim to have done KYC: 1. https://t.me/coinscope_announce2. https://t.me/InterFiNetworkBut as of here speaking no KYC verification of Spin2Earn project has been found. ( https://spin2earn.io/ ) is a full scamming project.So everyone will stay away from the fraud of this project.And be take care with your wallet.We should never connect our wallets to any unknown website. There are many scammer websites that will take all your money under their control if you connect a wallet.You should always refrain from such activities as these are very dangerous.Do not connect your wallet anywhere, as doing so may put you in danger.I have seen many people fall for this kind of scam and they lost a lot of their money. Always research and do your due diligence before connecting. thank you",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BobK71",
      "created_time": "September 29, 2022, 06:00:00 PM",
      "body": "I saw the pre sale campaign of this project where they were showing it graph of BNB collection via bot. There I saw that BNB accumulates after a certain period of time. And those who through spin used to display the winning reward. I was shocked to see how it was possible to get a big reward one after another? Then I was pretty sure it was a scam project. Moreover, they did not have any social media accounts or any information. At the end, that came true.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Johnyz",
      "created_time": "September 29, 2022, 09:39:12 PM",
      "body": "Some site already have this before but as far as I know if you will just connect it, you are still safe since they can’t make any transactions with your wallet if you didn’t approve it and since this is just connecting wallet, they still have no access with your private keys. Anyway, just to be sure and be safe if you think the site might put you on bigger risk by just connecting your wallet then I suggest not to do it, try to look for other good site where you can find peace and security.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wexnident",
      "created_time": "September 29, 2022, 11:38:44 PM",
      "body": "Seems like even the bounty project in the forum has been stopped? Didn't see any explanation but the thread title got changed to \"DISCONNECT YOUR WALLETS SCAM PROJECT!!\" so I'm assuming there's really a problem with the wallet connection thing that they can take advantage of, not that I'm aware of the hows. And even if they weren't, I'd still stay away from it for now, any projects that have the word scam surrounding them always have some form of reason for happening.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "chaser15",
      "created_time": "September 29, 2022, 11:47:49 PM",
      "body": "Technically, just connecting your wallet to an unknown website doesn't mean they will freely control your money there. Most cases are totally done thru pishing wherein the user is inputting their passphrase or seed into a third party where the user thinks that's the original wallet interface. I don't see how scammers can go thru our coins just by connecting our wallets with them. They need our passphrase to do it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "melody82",
      "created_time": "September 29, 2022, 11:50:44 PM",
      "body": "I just assume that nothing is safe, and therefore would never trust anyone with my password or anything. Stay safe and don't give your wallet info to strange websites! But as others have said, they need your password right? I don't know, I would never connect my wallet to a site like that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "worle1bm",
      "created_time": "September 30, 2022, 05:06:44 AM",
      "body": "The first thing we should avoid is connecting our wallet to these unknown sites and then grant them permission to our wallets and some are ignorant enough to connect their main account only.When you do this you are already at risk that wallet will be drained out easily with all your savings and collectibles in it.But why should you to these sites and connect your wallet if you are aware about the consequences?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}