{
  "id": "topic_5472600",
  "title": "ZekiBeyy",
  "author": "ZekiBeyy",
  "created_time": "November 02, 2023, 04:09:18 PM",
  "content": "Yıl sonu yaklaştı her yıl olduğu gibi bu yılda Kasım ayı ile birlikte online satış sitelerinde çeşitli indirimler yapılıyor. Geçen sene kasım aralık ayında bilgisayar toplamıştım fakat ocak ayında bazı ürünlerde kasım ayına göre daha uygun fiyatlar ile satılıyordu.Kasım ayı ile birlikte çeşitli kampanyalardan sizleri haberdar etmek istiyorum. N11 de saat: 00.00, 09.00, 14.00, 20.00 saatlerinde tık hızında kuponlar veriliyor. 100/300 - 150/40 - 200/50 - 300/60 - 400/65 - 500/70 ......... çeşitli indirim kuponlarını hesabınıza yükleyip alışverişte kullanabilirsiniz.Nays ile e-ticaret alışverişinde kullanırsanız %15 oranında 200 liraya kadar iade alabiliyorsunuz. Ayrıca 50 lira üzeri harcamaya şimdi kazanla ekstra nakit kazanıyorsunuz (günde 1 haftalık en fazla 4 kez)İhtiyacınız olan ürünleri uygun fiyattan almış olursunuz. Daha fazla indirim ve kampanyalı ürün gördüğüm zaman ekleme yaparım.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5472600",
  "comments": [
    {
      "author": "gospodin",
      "created_time": "November 02, 2023, 04:13:43 PM",
      "body": "tam bir ölücü olarak ölücülerin mekanından link bırakayım: https://forum.donanimhaber.com/kasim-indirimleri-basladi-black-friday-indirimleri-nereden-takip-edilir--157223923ben pek bir bok bulamadım ama dün meyveli soda siparişi verdim. normalde sevmem ama karadutlu vs tadı çok iyi olduğu için yalandan aldım. asıl indirimler amazon yurt dışından olur. beklemek lazım.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "meser#",
      "created_time": "November 02, 2023, 04:47:54 PM",
      "body": "Quote from: gospodin on November 02, 2023, 04:13:43 PMtam bir ölücü olarak ölücülerin mekanından link bırakayım: https://forum.donanimhaber.com/kasim-indirimleri-basladi-black-friday-indirimleri-nereden-takip-edilir--157223923ben pek bir bok bulamadım ama dün meyveli soda siparişi verdim. normalde sevmem ama karadutlu vs tadı çok iyi olduğu için yalandan aldım. asıl indirimler amazon yurt dışından olur. beklemek lazım.Bu donanımhaberin ölücüleri yok mu adamlar sineğin yağını çıkartır üstüne yağının yağını çıkartıp satarlar. Önceki senelerde ufak tefek şeyleri onların telegram kanalından takip edip güzel fiyata almıştım. Bu sene de sonunda pert olan laptopum için pusuda bekliyorum bakalım güzel ne yakalayabileceğim. Telegram ve whatsapp kanallarını takip etmek güzel kazandırır bu zamanda.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kriminall",
      "created_time": "November 02, 2023, 05:11:19 PM",
      "body": "Quote from: gospodin on November 02, 2023, 04:13:43 PMtam bir ölücü olarak ölücülerin mekanından link bırakayım: https://forum.donanimhaber.com/kasim-indirimleri-basladi-black-friday-indirimleri-nereden-takip-edilir--157223923ben pek bir bok bulamadım ama dün meyveli soda siparişi verdim. normalde sevmem ama karadutlu vs tadı çok iyi olduğu için yalandan aldım. asıl indirimler amazon yurt dışından olur. beklemek lazım.Donanım haber ölücüleri diye bir tabir bile oluştu, oradaki ölümcü tayfanın üstüne çıkabilecek kimseyi tanımıyorum, bir ara hatalı fiyatlara takmışlardı ve sipariş iptal olunca tüketici hakem heyetine gidip parayı alanları bile görmüştüm, ürünlerin teslimatıyla kafayı bozmuşlardı, çok tehlikeli bir grup, kasım indirimlerinde onları takip etmek gerekiyor aslında",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ZekiBeyy",
      "created_time": "November 02, 2023, 07:29:27 PM",
      "body": "Fiyat takibinin iyi yapılması gerekiyor bence. Geçen sene bir abimize laptop sipariş ettim indirime girmiş dedi şu kadar gün daha indirimde bir an önce al dedi ne kadar bekleyelim biraz daha desemde ikna edemedim. Kasım indirimleri biter bitmez 20k olan ürünü 18k civarına alınabiliyordu. Bir çok firma insanların kasım indirimine üşüşmesinden ötürü fiyatları çok fazla indirmiyor kampanya bitiminde satıların hızını devam ettirmek isteyenler daha uygun fiyatlardan listeleme yapabiliyorlar öncelikle bu gibi durumlara dikkat etmek gerekiyor.Kaliteli ürünleri ucuza bulduğum zaman kaçırmamaya çalışıyorum bunun için favorim amazon.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "emrecemsan",
      "created_time": "November 02, 2023, 07:55:42 PM",
      "body": "Steam'in kendi sitesinde yayınladığı makalede kasım ayında yapılacak bir Sonbahar indirim dönemi olduğu yazıyor. 21-28 Kasım tarihleri arasında eğer oyun oynamayı seven birisiyseniz bir göz atmanızı tavsiye ederim.  Fakat şöyle bir durum da var. 20 Kasım'da Steam artık oyun fiyatlarını doğrudan dolara göre hesaplayacak ve bakiyeler de dolara dönüştürülecek. Yeni fiyatlar ne olur ve bu indirim dönemi ne kadar etkili olur bilmiyorum ama herhalde halihazırda pahalı oyunlar yine aynı düzeylerde kalır ve indirim döneminde satın alması mantıklı bir seviyeye inebilir.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kriminall",
      "created_time": "November 02, 2023, 08:47:45 PM",
      "body": "Quote from: emrecemsan on November 02, 2023, 07:55:42 PMSteam'in kendi sitesinde yayınladığı makalede kasım ayında yapılacak bir Sonbahar indirim dönemi olduğu yazıyor. 21-28 Kasım tarihleri arasında eğer oyun oynamayı seven birisiyseniz bir göz atmanızı tavsiye ederim.  Fakat şöyle bir durum da var. 20 Kasım'da Steam artık oyun fiyatlarını doğrudan dolara göre hesaplayacak ve bakiyeler de dolara dönüştürülecek. Yeni fiyatlar ne olur ve bu indirim dönemi ne kadar etkili olur bilmiyorum ama herhalde halihazırda pahalı oyunlar yine aynı düzeylerde kalır ve indirim döneminde satın alması mantıklı bir seviyeye inebilir.Artık steamin eski görkemli dönemi geride kalmış olabilir, dolara döndükten sonra güncel dolar kuruyla tl hesapları dolara çevrilip oyunlar dolar üzerinden ücretlendirileceği için artık sonbahar indirimlerinin de bir anlamı kalmadı desek yanılmış olmayız, steam yerine sanırım artık oyunseverler daha fazla olarak epicgames kullanacaktır,",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "püsür",
      "created_time": "November 03, 2023, 03:49:23 PM",
      "body": "Bunun en efsanesi 2021 kasım indirimleriydi. Burada da çok konuşulmuştu. KKM'nin hemen öncesi, doların günde 1-2 lira artmasına alışmıştık. Herkes psikopat gibi stok yapmıştı. Benim o zaman aldığım traş köpükleri ve traş bıçakları hala bitmedi, yenisinin fiyatlarını da gördüm inanamadım. Bu sene black friday olayları çok sönük geçti benim gördüğüm kadarıyla. Bir de zaten her şeyin fiyatı çok pahalı. Lüks tüketimi geçtik normal tüketimden bile kısıyoruz. Çok zaruri şeyleri alıyoruz. Ondam eski havası kalmadı bence.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "verbakalim",
      "created_time": "November 03, 2023, 04:54:47 PM",
      "body": "Bu indirim zamanı geldiğinde iki tarafta kendine en iyi fiyat aralığında mal almaya ve satmaya çalışıyor. Bir kaç yıldır bu dönemde evde kullandığımız deterjan sabun türlerini takip edip sipariş veriyorum yıl sonuna kadar bu ürünlerden bir daha almıyorum. Aldığınız ürün çoğalınca gerçek indirim olan yer bulunuyor. Bu yıl için durum ne olur gerçekten merak ediyorum. Aynı elektrik satış fiyatının hesaplandığı gibi fiyatlar var ortamda. Mal + Malın iki katı kar + kdv nasıl bir piyasa olacak göreceğiz.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gospodin",
      "created_time": "November 03, 2023, 05:54:27 PM",
      "body": "telegram'da uzun zamandır takip ettiğim onual kanalında bile tuvalet kağıdı, peçete ve maden suyu dışında düzgün bir ilan çıkmadı. bu saydıklarım da öyle indirim falan değil anasını satayım. sanırım indirim olmaması bir yandan iyi oluyor. böylece kredi kartımız artmayıp yerinde duruyor. her zaman olaylara iyi yanından bakmanızı öneririm:)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Silence Scream",
      "created_time": "November 05, 2023, 10:56:34 AM",
      "body": "Quote from: gospodin on November 03, 2023, 05:54:27 PMtelegram'da uzun zamandır takip ettiğim onual kanalında bile tuvalet kağıdı, peçete ve maden suyu dışında düzgün bir ilan çıkmadı. bu saydıklarım da öyle indirim falan değil anasını satayım. sanırım indirim olmaması bir yandan iyi oluyor. böylece kredi kartımız artmayıp yerinde duruyor. her zaman olaylara iyi yanından bakmanızı öneririm:)İhtiyacımız yoksa alışverişin mantıklı bir tarafı yok. Bugünlerde yapılan indirimler daha çok fiyatların ucuzluğu ile alma düşüncesi olmayan kişileri alışverişe teşvik etmek. Başka para kazanmasını beklemiyorum onlardan. O yüzden kasım indirimlerini alacağım bazı şeyler için beklemiştim ama ekonomi yüzünden veya başka bir sebepten doğru düzgün kuponlar verilmez oldu. Artık meşhur 11.11 indirimleri de suyunu çekmiş oluyor.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kriminall",
      "created_time": "November 08, 2023, 02:45:02 PM",
      "body": "Arkadaşlar, getir mobil uygulaması fiyatları neredeyse aynı yapmış dışarısıyla, eğer market alışverişi yapacaksanız size şiddetle tavsiyem bu sıralarda kupon verildiyse getir üzerinden sipariş vermeniz, bir örnek vereyim 700 gram içim kaşar bimde galiba 174 mü neydi, getirde 170 lira civarı bir de kupon kullanırsanız avantajlı alışverişi kapınıza kadar getiriyorsunuz haberiniz olsun,",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}