{
  "id": "topic_5422347",
  "title": "BitcoinSpoon",
  "author": "BitcoinSpoon",
  "created_time": "November 20, 2022, 02:17:28 PM",
  "content": "Salut à tousCe message pour tenter d'avoir des conseils sur ce que je pourrais faire pour résoudre un soucis.Je cherche à obtenir un accès à ce site payant : http://www.0dayvinyls.orgProposition de paiement : neteller, perfect money, skrill, bitcoin Or à l'heure actuelle je n'ai aucun de ceux la. J'ai un peu d'ETH mais pas assez.Etant donné que le site propose un service semi legal, j'aimerais arrivé à obtenir environ 60 € (plan B de leur offre) en solution proposée sans avoir à passer de KYC pour une aussi petite somme.Quel sont vos conseils pour que je puisse y arriver svp ?Sachant qu'avant j'acheter mes bitcoins ici à un membre qui ne propose plus ce service, et que suite à cela j'avais tester le service Paxful et que je me suis fait arnaqué par un vendeur... Du coup ça m'a un peu déçus. Voila merci bien",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5422347",
  "comments": [
    {
      "author": "LeGaulois",
      "created_time": "November 20, 2022, 05:07:15 PM",
      "body": "Il n'y a pas de KYC avec Perfect Money, du moins à l'époque ou je l'utilisais.- Tu vas sur bestchange.com et tu trouves un échangeur pour faire ETH>>Perfect Money.ou- tu convertis ETH en BTC (avec Flyp.me ou autre) et tu télécharges Bisq pour acheter des BTC par virement SEPA. Tes BTC serviront de \"caution\", tu la récupères à la fin",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitcoinSpoon",
      "created_time": "November 20, 2022, 06:10:32 PM",
      "body": "Merci beaucoup de tes conseils mais je n'ai pas assez de ETH. Et pas moyen d'en ravoir sans KYC non plus.Je vais regarder bisq car je connaît pas .",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "elma",
      "created_time": "November 20, 2022, 07:21:21 PM",
      "body": "Si t'es pas loin d'une frontière, tu peux aller vers un distributeur de crypto.Localbitcoin permet de trouver des vendeurs, je ne sais plus s'il faut un kyc désormais",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "F2b",
      "created_time": "November 21, 2022, 09:00:06 AMLast edit: November 21, 2022, 11:56:56 PM by F2b",
      "body": "Après si tu ne recherches pas l'anonymat complet et que c'est surtout pour éviter la paperasse, y a Relai apparemment qui est bien et simple à utiliser. C'est un exchange centralisé Suisse, donc light-KYC (ils ont ton identité par ton compte bancaire, mais ne demandent pas de document supplémentaire).Sinon, comme toujours +1 pour Bisq, si on cherche de la décentralisation et du vrai non-KYC.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LeGaulois",
      "created_time": "November 21, 2022, 11:24:26 PM",
      "body": "@elmaLocalbitcoins a mis en place le KYC (avec plusieurs niveaux) malheureusement. Mais pour celui qui est un petit peu malhonnête et qui compte faire <1 000€ par an, il lui suffit d'obtenir un numéro bidon (du type Lebara ou ON/OFF) et d'utiliser des faux nom/prénomPour les ATMsIl y en a toujours en France apparemment. Je croyais ca disparu.https://coinatmradar.com/country/73/bitcoin-atm-france/Au kebab  @BitcoinSpoonDans l'idée c'était d'envoyer le reste de tes ETH sur Perfect money et de rajouter de l'argent avec ton compte bancaire ou je ne sais quoi.En vérité la solution donnée avec Relai est même mieux que Bisq. C'est moins prise de tête (parce que bisq peut être trèèèès pénible a utiliser. tu risques de faire plus de cauchemars qu'avec le croque-mitaine)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitcoinSpoon",
      "created_time": "November 23, 2022, 01:20:10 PM",
      "body": "Ok merci de vos conseils je vais étudier cela attentivement.@LeGaulois :en dessous de 1000€ de transac par an LocalBitcoins ne demande qu'un numéro ?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LeGaulois",
      "created_time": "November 23, 2022, 06:12:07 PMLast edit: November 23, 2022, 11:54:52 PM by LeGaulois",
      "body": "Quote from: BitcoinSpoon on November 23, 2022, 01:20:10 PM@LeGaulois :en dessous de 1000€ de transac par an LocalBitcoins ne demande qu'un numéro ?Apparemment cela a changé depuis https://localbitcoins.com/guides/verification-guideAlors qu'avant: https://i.imgur.com/mc4Em6s.pngTu as hodlhodl.com comme alternative sans KYC. Sinon comme on disait bisq ou relaiedit:en y pensant lorsque l'on voit que la question ou/comment acheter du btc revient souvent, on peut se dire que bitcoin a encore du chemin à faire.(je ne dis pas que c'est mal de demander hein, mais juste que ce n'est pas encore si facile/évident que ca, surtout pour des petits montants)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitcoinSpoon",
      "created_time": "December 05, 2022, 01:11:35 PM",
      "body": "Bon ba j'ai tenter Relai.Impossible de faire un virement ou de payer via CB via une grande banque FR. Leur compte CH est sous surveillance...Dommage il va falloir trouver autre chose.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Saint-loup",
      "created_time": "December 08, 2022, 07:55:15 PM",
      "body": "Quote from: BitcoinSpoon on December 05, 2022, 01:11:35 PMBon ba j'ai tenter Relai.Impossible de faire un virement ou de payer via CB via une grande banque FR. Leur compte CH est sous surveillance...Dommage il va falloir trouver autre chose. T'as Mt Pelerin sinon. Ils sont aussi basés en Suisse et c'est sans KYC jusqu'à 1000€/jour environ. Tu peux payer par virement ou par carte bancaire. Je ne sais pas si ils sont blacklistés par les banques francaises mais ca m'étonnerait que meme les transactions par carte ne passent pas. https://www.mtpelerin.com/frFais un petit retour si tu essayes.Sinon tu peux t'ouvrir un compte sur une neobanque pour ne pas être embêté.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitcoinSpoon",
      "created_time": "December 11, 2022, 06:16:46 AM",
      "body": "Merci bien c'est sympa,  je vais voir ça .",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}