{
  "id": "topic_5473700",
  "title": "Gormicsta",
  "author": "Gormicsta",
  "created_time": "November 11, 2023, 11:34:41 AM",
  "content": "They claim that because the Bitcoin blockchain can only handle a specific amount of transactions and data within a predetermined amount of time, transferring bitcoin on-chain has proven to be a very costly, inefficient, and lengthy operation. I firmly believe that developments that make the network more useful and efficient are necessary if Bitcoin is to stay competitive and ahead of other blockchains.I've come to understand that the Bitcoin Blockchain's scalability issues are the reason for this. There are now limits on how many transactions the Blockchain can process in a second. Furthermore, there are also continuing discussions about how to increase the blockchain's scalability without compromising its decentralization and security. which brings me to my query. Is it possible to enhance the Blockchain such that it can handle an infinite number of transactions every second without jeopardizing its decentralization and security?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5473700",
  "comments": [
    {
      "author": "noonesh",
      "created_time": "November 11, 2023, 11:45:04 AM",
      "body": "Quote transferring bitcoin on-chain has proven to be a very costly, inefficient, and lengthy operation. This is just not true.Until las week I was transferring satoshis here and there for as low fees as 3 sats per byte, 5 sats per byte.QuoteI firmly believe that developments that make the network more useful and efficient are necessary if Bitcoin is to stay competitive and ahead of other blockchains.Bitcoin is better than any other shitcoin if you run the first version of it. \"More useful\" blockchain is just a way to pervert the purpose that this thing was created in the first place.A bunch of people were worried about how to transact with each other without having a State bureaucrat  on your neck seeing everything and able to censor if they don't agree with what you use your money for.If you want other utilities, go somewhere else. Leave the thing that is working fine alone and create your own thing.1. Transfer money freely between free individuals2. Make impossible to States and Governments and any institution to prevent you from having what is yours or using your money as you wish.3. Useful commands to make business transactions, complex transactions between business and individuals to be more efficient and secureNow we have:3. Use it like a cloud storage to save stupid low resolution images4. Use it like a notebook to save useless jsons for useless imaginary tokensSee how the thing is degrading slowly? Just stop messing with what is working peacefully.I would not be surprised if the incredible Ordinals idea had come from a Government agency seeking to destroy the real purpose of Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zaguru12",
      "created_time": "November 11, 2023, 11:55:56 AM",
      "body": "Quote from: Gormicsta on November 11, 2023, 11:34:41 AMI firmly believe that developments that make the network more useful and efficient are necessary if Bitcoin is to stay competitive and ahead of other blockchains.Even now that it is still not scalable to some people it is still not in competition With other blockchains like TON who are fast because of its decentralization. QuoteIs it possible to enhance the Blockchain such that it can handle an infinite number of transactions every second without jeopardizing its decentralization and security?No because of possible two reason, 1. Miners feed on block reward and transaction fees as incentives for we to have decentralized network we need More miners if one mining pool mines a block and gets all the rewards from with consisting of large amounts of transactions others wouldn’t benefit too. The transaction fees will be very small and seriously on a selfish level miners wouldn’t like them and we wouldn’t see many of them running a mining node again and as said affects decentralization of the network. 2. It will discourage many from running their own full node because with larger block space many will just spam the network with dust transactions and so on",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gormicsta",
      "created_time": "November 11, 2023, 11:59:45 AM",
      "body": "Quote from: noonesh on November 11, 2023, 11:45:04 AMI would not be surprised if the incredible Ordinals idea had come from a Government agency seeking to destroy the real purpose of Bitcoin.Well I couldn't agree more in this. Of course we know that a lot of government and financial institutions are a 100% against Bitcoin and whatever it's promising to offer due to its decentralized nature. Bitcoin has removed complete financial control from their hands and the fast rising of Bitcoin poses more threat to them, millions and more are choosing Bitcoin as the day go by so it wouldn't be a thing of surprise if the whole idea of ORDI is from these said Government and Financial Agencies.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Blitzboy",
      "created_time": "November 11, 2023, 12:12:27 PM",
      "body": "Look, the core issue here is the blockchain trilemma: decentralization, security, and scalability – picking two often means compromising the third. Infinite transactions per second? Thats a pipe dream as of now. Why? Because every solution has its trade-offs.For instance, take the Lightning Network. Its an off-chain solution that boosts transaction speed, sure, but its not a panacea. The more you rely on off-chain solutions, the more you're moving away from the core principles of decentralization. Then there's the issue of security. Increased throughput can potentially open more avenues for attacks. Its nearly impossible to maintain the integrity of the blockchain and push its limits.Lastly, consider this: maybe the pursuit of infinite scalability is a problem. Bitcoin wasnt designed to be a high-frequency transactional currency but a digital gold. The real question isnt about pushing transactions to an infinite scale, but optimizing what we have without turning Bitcoin into something it was never meant to be. New protocols and altcoins are exploring this, but Bitcoin’s role as a secure, decentralized digital asset is its real strength",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gormicsta",
      "created_time": "November 11, 2023, 12:16:47 PM",
      "body": "Quote from: Zaguru12 on November 11, 2023, 11:55:56 AMEven now that it is still not scalable to some people it is still not in competition With other blockchains like TON who are fast because of its decentralization. An undisputed professional world heavyweight boxing champion was once asked in an interview why he still woke up every 4am to train even while he was an undisputed champion, his response was that, he wakes up that time to train because he knows by that time all his opponents would probably be busy sleeping and gaining weight, despite being a heavyweight champion he wouldn't make the mistake of underestimating his opponents. And that if he ever discovers that any of his opponents are waking up by 4am to train like he does, he'd start waking up by 2am, to make sure he stays at the top.My point is that, being at the top of all the Blockchains is the more reason why Bitcoin should keep making improvements to make sure they stay there.Quote from: Zaguru12 on November 11, 2023, 11:55:56 AM2. It will discourage many from running their own full node because with larger block space many will just spam the network with dust transactions and so on Thanks for your contribution, this was truly informative and educative, I wasn't at first aware of this fact but now I do. Thank you",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SquirrelJulietGarden",
      "created_time": "November 11, 2023, 12:53:39 PM",
      "body": "Quote from: Gormicsta on November 11, 2023, 11:34:41 AMThey claim that because the Bitcoin blockchain can only handle a specific amount of transactions and data within a predetermined amount of time, transferring bitcoin on-chain has proven to be a very costly, inefficient, and lengthy operation.Transaction fee with Bitcoin blockchain is not a cheapest way to move your money but it is a safest way.Why it is a safest way of moving money?Because Bitcoin network is very strong and decentralized. Your transaction after get a confirmation or some confirmations will not be reverted by miners. It's harder when your transaction has more confirmations and it will be impossible if it already has many confirmations.How many Bitcoin confirmations is enough?https://jlopp.github.io/bitcoin-confirmation-risk-calculator/https://web.archive.org/web/20181231045818/https://people.xiph.org/~greg/attack_success.htmlCompare transaction fees of Bitcoin and Ethereum blockchains. Bitcoin blockchain is better.https://bitinfocharts.com/comparison/transactionfees-btc-eth.html#alltimeHow many confirmations of other blockchains are equivalent to 6 confirmations on Bitcoin blockchainhttps://howmanyconfs.com/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "November 11, 2023, 01:01:07 PM",
      "body": "Quote from: noonesh on November 11, 2023, 11:45:04 AMQuote transferring bitcoin on-chain has proven to be a very costly, inefficient, and lengthy operation. This is just not true.Until las week I was transferring satoshis here and there for as low fees as 3 sats per byte, 5 sats per byte.If someone think that paying 2-5 sat/byte (less than 0.5 usd) to make a permitionless/borderless/pseudoanonymous transaction is less than 30minutes is expensive..  well, that person doesn't understand bitcoin. For the rest of the world, we all find bitcoin very cheap and useful.If you dont care about decentralization,  Just go for visa. Don't use shitcoins. I once heard antonopoulos saying something like that:  \" bitcoin wasn't made for you to buy a coffee at Starbucks,  but to help you buy a bus ticket when flying away from war\"About scalability, second layer solutions will come, and we already have LN",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lombok",
      "created_time": "November 11, 2023, 01:06:29 PM",
      "body": "Quote from: SquirrelJulietGarden on November 11, 2023, 12:53:39 PMQuote from: Gormicsta on November 11, 2023, 11:34:41 AMThey claim that because the Bitcoin blockchain can only handle a specific amount of transactions and data within a predetermined amount of time, transferring bitcoin on-chain has proven to be a very costly, inefficient, and lengthy operation.Transaction fee with Bitcoin blockchain is not a cheapest way to move your money but it is a safest way.I think BTC transaction fees are very cheap compared to others, to move funds of $100,000-$1,000,000 or even more. Maybe if we use wire it will cost more than the bitcoin fee.And I think Bitcoin fees are still relatively reasonable with increasing adoption and the number of transaction fees are still relatively cheap, in contrast to Ethereum which has unreasonable transaction fees, because I haven't followed and found out about ETH for a long time, what actually makes ETH have such high transaction fees. ?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptomaniac_xxx",
      "created_time": "November 11, 2023, 01:33:32 PM",
      "body": "Quote from: Gormicsta on November 11, 2023, 11:34:41 AMThey claim that because the Bitcoin blockchain can only handle a specific amount of transactions and data within a predetermined amount of time, transferring bitcoin on-chain has proven to be a very costly, inefficient, and lengthy operation. I firmly believe that developments that make the network more useful and efficient are necessary if Bitcoin is to stay competitive and ahead of other blockchains.Lol, this has been discussed since 2017 and that's why we have a lot of Bitcoin forks. And guess what happened to those big blockers? Yeah, you are correct, no one even remember them and majority has died down already.Quote from: Gormicsta on November 11, 2023, 11:34:41 AMI've come to understand that the Bitcoin Blockchain's scalability issues are the reason for this. There are now limits on how many transactions the Blockchain can process in a second. Furthermore, there are also continuing discussions about how to increase the blockchain's scalability without compromising its decentralization and security. which brings me to my query. Is it possible to enhance the Blockchain such that it can handle an infinite number of transactions every second without jeopardizing its decentralization and security?You are wrong, 6 confirmations are the best to secure the network, and they are still up to this day and we have seen bitcoin's blockchain being more secure than ever. In fact, it's uptime it's almost 100%.If you wanted to check bitcoin's confirmation as compare to other altcoins? you might want to read it here:https://github.com/lukechilds/howmanyconfs.com",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DapanasFruit",
      "created_time": "November 11, 2023, 01:44:33 PM",
      "body": "One of the big lessons here is that Bitcoin is not the solution for everything and maybe not also for everyone. For sure, if our goal is to be able to use BTC on very minute purchases like buying a coffee, a candy or a pack of diaper and everybody will be doing it then scalability will be question...but on my side why really use BTC for small purchases when we have fiat currency for that matter? Though right now, experts are working on this area but they are making sure that security is not compromised in any way because if it is then we are just fooling ourselves. Security comes first so we can experience the benefits of decentralization.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Apocollapse",
      "created_time": "November 11, 2023, 02:06:08 PM",
      "body": "Quote from: lombok on November 11, 2023, 01:06:29 PMI think BTC transaction fees are very cheap compared to others, to move funds of $100,000-$1,000,000 or even more. Maybe if we use wire it will cost more than the bitcoin fee.And I think Bitcoin fees are still relatively reasonable with increasing adoption and the number of transaction fees are still relatively cheap, in contrast to Ethereum which has unreasonable transaction fees, because I haven't followed and found out about ETH for a long time, what actually makes ETH have such high transaction fees. ?It's correct if you move big amount of money, but it's expensive when it's used regularly for pay something that only worth $1-$10 multiple times.Currently gas fee isn't really that expensive, it's similar like the current fee in Bitcoin on chain network.Quote from: https://etherscan.io/gastrackerLow26 gweiBase: 25 | Priority: 1$1.26 | ~ 3 mins: 0 secsAverage26 gweiBase: 25 | Priority: 1$1.26 | ~ 3 mins: 0 secsHigh29 gweiBase: 25 | Priority: 4$1.43 | ~ 30 secsQuote from: https://mempool.space/Low Priority 24 sat/vB $1.25Medium Priority 25 sat/vB $1.30High Priority 25 sat/vB $1.30Quote from: DapanasFruit on November 11, 2023, 01:44:33 PMbut on my side why really use BTC for small purchases when we have fiat currency for that matter? Correct, it because of people who always praising Bitcoin like Bitcoin is their God or Bitcoin who gave birth to him.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "titular",
      "created_time": "November 11, 2023, 02:30:18 PM",
      "body": "Quote from: noonesh on November 11, 2023, 11:45:04 AMNow we have:3. Use it like a cloud storage to save stupid low resolution images4. Use it like a notebook to save useless jsons for useless imaginary tokensSo you're saying that some peoples transactions are not as valuable as other's?There are some serious dangers in that statement. The fundamental principle of Bitcoin lies in the freedom to engage in transactions according to individual discretion. Whether this entails the inclusion of what might be perceived as \"stupid low-resolution images\" on the blockchain, it is imperative to refrain from passing judgment on the acceptability of others transactions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "edmundduke",
      "created_time": "November 11, 2023, 02:57:33 PM",
      "body": "Quote from: noonesh on November 11, 2023, 11:45:04 AMNow we have:3. Use it like a cloud storage to save stupid low resolution images4. Use it like a notebook to save useless jsons for useless imaginary tokensAs the age old saying goes: its not spam as long as the person doing it is paying the fee. Same goes for any other transaction done on the chain. As for it causing issues for Bitcoin, sure that can happen. Solutions must/will be found to combat this, or something else will take over the day to day transaction part of the chain (which is already kind of has)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Faisal2202",
      "created_time": "November 11, 2023, 04:49:19 PM",
      "body": "Quote from: noonesh on November 11, 2023, 11:45:04 AMI would not be surprised if the incredible Ordinals idea had come from a Government agency seeking to destroy the real purpose of Bitcoin.The founder of Ordinals is some dude named Supernestnet who is also a developer of the Lightning network and according to this website he was playing around with the BTC blockchain's Ordinal theory and he found a bug in it or I should say, a way to inscribe images in the blockchain. Although he might be a member or might have some links to the government but IMHO he is not a government person as he is a BTC enthusiast but I don't know what good was brought out of this discovery, maybe he/she did not realize the impact of it. Overall, another LN developer might confirm if he is some government dude or not.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hamza2424",
      "created_time": "November 11, 2023, 05:40:38 PM",
      "body": "Quote from: Gormicsta on November 11, 2023, 11:34:41 AMIs it possible to enhance the Blockchain such that it can handle an infinite number of transactions every second without jeopardizing its decentralization and security?Definitely, No.To process the infinite transactions per second we need infinite resources as simple as 2 + 2. Try to catch the point the Infinity cant be achieved even if we cant predict the approach to Infinity.When it comes to the Blockchain to achieve the triangle (Secure, Scalable & Decentralized) we have the L2 solutions on the Base-Chian It is not possible to achieve this triangle cheaply. I would like to quote and explain what I've learned a couple of days before in this section posted by the senior, to achieve better security you need to pay better.You cant expect a secure environment for cheap.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "philipma1957",
      "created_time": "November 11, 2023, 05:54:45 PM",
      "body": "Quote from: Hamza2424 on November 11, 2023, 05:40:38 PMQuote from: Gormicsta on November 11, 2023, 11:34:41 AMIs it possible to enhance the Blockchain such that it can handle an infinite number of transactions every second without jeopardizing its decentralization and security?Definitely, No.To process the infinite transactions per second we need infinite resources as simple as 2 + 2. Try to catch the point the Infinity cant be achieved even if we cant predict the approach to Infinity.When it comes to the Blockchain to achieve the triangle (Secure, Scalable & Decentralized) we have the L2 solutions on the Base-Chian It is not possible to achieve this triangle cheaply. I would like to quote and explain what I've learned a couple of days before in this section posted by the senior, to achieve better security you need to pay better.You cant expect a secure environment for cheap.Well LTC and Doge are secure and you can move them easy peasy on the cheap.If you think of BTC as an oil tanker or a cargo ship. Moving millions of wealth safely  for a few grand is fine.If you think of Ltc as a single box truckand Doge as a pickup truckall three can move freight.The problem is people refuse to do this thought pattern.I certainly am not going to pay a freighter (btc) to move 1 car as it is too costly.I may pay a tow truck (ltc or doge) to move 1 carLike it or not business is going to keep trying to make btc for large moves.If you believe in BTC and No Doge/LTC you are simply being stubborn and hurting the network.I mine sha 256 and scrypt on a daily business and I hodl all 3 coins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hatshepsut93",
      "created_time": "November 11, 2023, 11:58:20 PM",
      "body": "Quote from: noonesh on November 11, 2023, 11:45:04 AMQuote transferring bitcoin on-chain has proven to be a very costly, inefficient, and lengthy operation. This is just not true.Until las week I was transferring satoshis here and there for as low fees as 3 sats per byte, 5 sats per byte.There has been a lot of periods when fees where high, which is kinda bad for a payment system, because it makes it unreliable. So it's better to assume the worst case and just accept that onchain transactions are expensive.And by design they will be getting more expensive, because blockspace is quite limited and can't be expanded to satisfy all demand. Plus miners will have to have fees as main source of reward in the future when block reward will get too small.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "davis196",
      "created_time": "November 12, 2023, 07:06:22 AM",
      "body": "Quote Is it possible to enhance the Blockchain such that it can handle an infinite number of transactions every second without jeopardizing its decentralization and security?Do you know about a fiat payment system, that can handle \"infinite\" amount of transactions? I don't know about such system.Do you know about an altcoin blockchain, that can handle \"infinite\" amount of transactions? I don't know about such altcoin blockchain.Your question about enhancing the Bitcoin blockchain to infinite amount of transactions without sacrificing security should be pointed towards the Bitcoin developers. Most of the users on this forum aren't Bitcoin developers. They are buyers/traders/investors.Maybe your forum thread should be moved to the Technical Discussion forum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SquirrelJulietGarden",
      "created_time": "November 12, 2023, 10:45:10 AM",
      "body": "Quote from: lombok on November 11, 2023, 01:06:29 PMI think BTC transaction fees are very cheap compared to others, to move funds of $100,000-$1,000,000 or even more. Maybe if we use wire it will cost more than the bitcoin fee.You can compare them with real data and charts.https://bitinfocharts.com/comparison/transactionfees-btc-eth-doge-xrp-ltc.html#3yhttps://blockchair.com/compare (Choose altcoins you want to compare with Bitcoin)QuoteAnd I think Bitcoin fees are still relatively reasonable with increasing adoption and the number of transaction fees are still relatively cheap, in contrast to Ethereum which has unreasonable transaction fees, because I haven't followed and found out about ETH for a long time, what actually makes ETH have such high transaction fees. ?Ethereum is a paradise for scam projects that can easily hype greedy people. When those people become greedy, they will naturally join a transaction fee race with other people just to want to get their transactions have quick confirmations. Because they don't want to missing out great chances with scam projects and feel like $10, $20 or more cost for a transaction is not a big issue if they will get big profit from scam project later.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}