{
  "id": "topic_5438380",
  "title": "maxist23",
  "author": "maxist23",
  "created_time": "February 06, 2023, 04:28:20 PM",
  "content": "Bom dia a todos.Apresentando um serviço de monitoramento de contas on-line fácil de usar e muito útil para trocas de criptomoedas.Com ele, você pode acompanhar o status de sua conta ou grupo de contas quase em movimento. Saldo, drawdown, pares abertos, ROE para eles, estatísticas do dia, semana, mês. E tudo isto com um atraso de 1 a 5 segundos, ou seja, essencialmente online.Vários tipos de relatórios e a possibilidade de modelá-los, facilidade de registro (apenas chaves são necessárias para leitura), tarifas para todos os gostos e carteiras, também há uso gratuito, possibilidade de congelamento, programa de bônus, tecnologia consciente. suporte 24/7.Até agora, apenas futuros. E apenas Binance e ByBit.Num futuro próximo: à vista, outras bolsas, uma seção de mídia para uma exibição visual e o mais simples possível dos resultados da negociação, armazenando o histórico em nossos servidores e suas várias análises.Bem-vindo ao crimonitor.onlineNossa exibição:https://crmonitor.online/cdn/files/crm-02.jpg",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5438380",
  "comments": [
    {
      "author": "joker_josue",
      "created_time": "February 14, 2023, 08:21:16 PM",
      "body": "Obrigado por vir aqui apresentar esse serviço.Mas é impressão minha ou o site não funciona? Eu pelo menos não consigo entrar no site.Não teste VPN, mas será que esta limitado a localização do utilizador?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "alegotardo",
      "created_time": "February 15, 2023, 02:10:48 AM",
      "body": "Quote from: joker_josue on February 14, 2023, 08:21:16 PMObrigado por vir aqui apresentar esse serviço.Mas é impressão minha ou o site não funciona? Eu pelo menos não consigo entrar no site.Não teste VPN, mas será que esta limitado a localização do utilizador?Aqui abriu de boa, mas tive que utilizar o seguinte endereço: https://help.crmonitor.online/en#plansEstive dando uma olhada nos planos, e achei o \"Free\" meio fraquinho para um site que está começando agora com seus serviços:1 account, Simple view, Simple notifications, Update data in less than 10 minute.Uma sugestão seria de lançar alguns cupons de desconto ou versão de avaliação por tempo limitado de alguns recursos.Pois se o recurso for bom e útil, é sempre provável que o usuário acabe pagando por ele para que não perca algo que gostou.Enfim, sendo idôneo/hones, desejo sempre bons negócios e sucesso.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "February 15, 2023, 07:51:40 AM",
      "body": "Quote from: alegotardo on February 15, 2023, 02:10:48 AMAqui abriu de boa, mas tive que utilizar o seguinte endereço: https://help.crmonitor.online/en#plansAgora também consegui.  Mas, acredita que quando escrevi o post eu não conseguia aceder.Outra coisa que lembrei, que garantias eles dão, de proteção de dados e quanto as informações recolhidas ficam encriptadas?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "February 15, 2023, 02:24:44 PM",
      "body": "Fazendo quote para todos veremQuote from: maxist23 on February 06, 2023, 04:28:20 PMBem-vindo ao crimonitor.onlineNossa exibição:Quote from: joker_josue on February 15, 2023, 07:51:40 AMOutra coisa que lembrei, que garantias eles dão, de proteção de dados e quanto as informações recolhidas ficam encriptadas? Pois é,  isso é muito sério.Pessoalmente,  eu nunca colocaria meus dados num site assim para ser monitorado.  Colocar dados bancários, dados de contas de corretoras, etc, acho que são dados muito sensíveis para colocar assim num site pequeno.Mas entendo o apelo que serviços desse tipo tem, inclusive existem sites que ajudam a fazer o pagamento de impostos e etc.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "maxist23",
      "created_time": "February 17, 2023, 10:51:51 PM",
      "body": "Peço desculpas pelo longo silêncio - eu estava em trânsito entre os paísesEm relação à segurança - para usar nosso serviço, você precisa inserir uma chave somente leitura. Com a ajuda desta chave, não é possível negociar nem fazer transferências... mesmo se formos hackeados e as chaves caírem em mãos erradasAlém disso, em Binance, recentemente, também é necessário vincular endereços IP à chave API, que fornecemos aos nossos usuários ... Solicitações de outros endereços IP não passarão",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "maxist23",
      "created_time": "February 17, 2023, 11:01:08 PM",
      "body": "Quote from: alegotardo on February 15, 2023, 02:10:48 AMAqui abriu de boa, mas tive que utilizar o seguinte endereço: https://help.crmonitor.online/en#plansEstive dando uma olhada nos planos, e achei o \"Free\" meio fraquinho para um site que está começando agora com seus serviços:1 account, Simple view, Simple notifications, Update data in less than 10 minute.Uma sugestão seria de lançar alguns cupons de desconto ou versão de avaliação por tempo limitado de alguns recursos.Pois se o recurso for bom e útil, é sempre provável que o usuário acabe pagando por ele para que não perca algo que gostou.Enfim, sendo idôneo/hones, desejo sempre bons negócios e sucesso.Muito obrigado.Na verdade, oferecemos acesso gratuito a todas as funcionalidades do CRmonitor por uma semana. Para fazer isso, basta escrever para mim no telegrama @MaximS23",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "February 18, 2023, 02:16:39 AM",
      "body": "Quote from: maxist23 on February 17, 2023, 10:51:51 PMEm relação à segurança - para usar nosso serviço, você precisa inserir uma chave somente leitura. Com a ajuda desta chave, não é possível negociar nem fazer transferências... mesmo se formos hackeados e as chaves caírem em mãos erradasAlém disso, em Binance, recentemente, também é necessário vincular endereços IP à chave API, que fornecemos aos nossos usuários ... Solicitações de outros endereços IP não passarãoO problema não é a chave ser só de leitura. Normalmente as API para essa finalidade, só servem para isso mesmo.A questão aqui, é terceiros poderem ter acesso a nossa informação de saldos e afins nas exchanges.Que garantia dão que os vossos funcionários, não conseguem ver essa informação?É bom a Binance ter esse vinculação, mas as outras exchanges não tem, como lidam com esses dados?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "maxist23",
      "created_time": "February 18, 2023, 10:21:51 AM",
      "body": "Quote from: joker_josue on February 18, 2023, 02:16:39 AMO problema não é a chave ser só de leitura. Normalmente as API para essa finalidade, só servem para isso mesmo.A questão aqui, é terceiros poderem ter acesso a nossa informação de saldos e afins nas exchanges.Que garantia dão que os vossos funcionários, não conseguem ver essa informação?É bom a Binance ter esse vinculação, mas as outras exchanges não tem, como lidam com esses dados?Não oferecemos tais garantias.No momento, não temos uma grande equipe de funcionários. Fazemos o projeto para nós e nosso uso...Em primeiro lugarQuanto ao acesso por link, existe uma configuração que proíbe a visualização de informações.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "February 18, 2023, 12:49:27 PM",
      "body": "Quote from: maxist23 on February 18, 2023, 10:21:51 AMNão oferecemos tais garantias.No momento, não temos uma grande equipe de funcionários. Fazemos o projeto para nós e nosso uso...Em primeiro lugarQuanto ao acesso por link, existe uma configuração que proíbe a visualização de informações.Entendo, o projeto ainda esta no inicio.Mas seria bom, desenvolver algo a esse respeito, pois essa questão pode ser o maior entrave para atraírem mais clientes.São brasileiros ou portugueses?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "maxist23",
      "created_time": "February 19, 2023, 09:44:17 AM",
      "body": "Quote from: joker_josue on February 18, 2023, 12:49:27 PMEntendo, o projeto ainda esta no inicio.Mas seria bom, desenvolver algo a esse respeito, pois essa questão pode ser o maior entrave para atraírem mais clientes.São brasileiros ou portugueses?Rússia, Israel, Espanha",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}