{
  "id": "topic_5412450",
  "title": "Alik Bahshi",
  "author": "Alik Bahshi",
  "created_time": "September 05, 2022, 10:56:06 AMLast edit: October 31, 2022, 04:50:38 PM by Alik Bahshi",
  "content": "Alik BakhshiThe reason for the aggressiveness of the \"Russian world\"        As a result of the First World War, Russia lost almost all of its colonies in Eastern Europe: Finland, Estonia, Latvia, Lithuania, Poland became independent countries, and Bessarabia (Moldova) returned to Romania. Thanks to the merciless exploitation of the population and Western aid in the field of modern technology and the organizational talent of Stalin, the Soviet Union achieved huge economic successes in the period before the outbreak of World War II, especially in the field of industrialization. First of all, attention was paid to the construction of the army and navy. The disenfranchised population lived in poverty, not a small part was in concentration camps, but in terms of the number of tanks, aircraft, artillery, the Soviet Union was ahead of all the armies of the World. The Russian Empire in the Soviet version was preparing for revenge, just like Germany. The world did not know that two countries with totalitarian regimes of power, having concluded a secret agreement, divided Poland between themselves in advance. A very important circumstance should be noted, namely, that a month after the partition of Poland, and when the Second World War was already underway, the aggressors signed among themselves, this time openly, without hiding their allied relations from the World, the next treaty of friendship, mutual assistance and cooperation. Here is an excerpt from the speech of the Minister of Foreign Affairs Comrade. Molotov at a meeting of the Supreme Soviet of the USSR on October 31, 1939. on the foreign policy of the USSR:    “First, we must point out the changes that have taken place in relations between the Soviet Union and Germany. Since the signing of the Soviet-German non-aggression pact on August 23, an end has been put to the abnormal relations that had existed for a number of years between the Soviet Union and Germany. The enmity, which was in every possible way fueled by some European powers, was replaced by a rapprochement and the establishment of friendly relations between the USSR and Germany. Further improvement of these new, good relations found expression in the German-Soviet treaty of friendship and border between the USSR and Germany, signed on September 28 in Moscow. The sharp turn that took place in relations between the Soviet Union and Germany, between the two largest states in Europe, could not but affect the entire international situation.”(http://www.oldgazette.ru/lib/propagit/21/01.html)    In the future, relations between Stalin and Hitler were overshadowed by Stalin's stubbornness in negotiations on the division of spheres of influence and delaying the signing of the so-called \"Axis Pact\". Germany was in dire need of oil, and Hitler counted on the fact that the USSR would move troops towards Iran and India, which were under the influence of England. Stalin, on the other hand, saw great value in mastering the Black Sea straits; it was not for nothing that the USSR in 1940 presented Turkey with an ultimatum on granting the right to create naval bases on the Bosphorus and the Dardanelles. Stalin also counted on the countries of the Balkan region - Bulgaria, Greece, Romania, Yugoslavia. However, Hitler clearly did not want to slaughter a former ally in the First World War, Turkey, as well as oil-rich Romania. Stalin, as a person with an Eastern mentality, dragged on with the negotiations, hoping to put the squeeze on Hitler. Germany, which was in a state of war for two years, it was important to know Moscow's future plans. Negotiations between the aggressors, which have been going on for almost a year, without an unclear final result, when time is a decisive factor, raised Hitler's doubts about Stalin's reliability and led to the decision to attack the USSR. Of course, the fact that the aggressors grappled with each other in a deadly fight contributed to the victory of the coalition over Nazi Germany. It is terrible to imagine what would have happened if Stalin had signed the \"Axis Pact\", fortunately Stalin made a fatal mistake, giving the World a chance to defeat Nazi Germany. (1)       However, having emerged victorious from the war, the USSR did not abandon its revanchist goals. Stalin, taking advantage of the gullibility of Roosevelt, who did not want to take into account Churchill's warnings about the perfidy of the ally (2), returned to the bosom of the empire all the lost territories, except for Finland, whose people heroically defended their freedom. In addition to the returned territories, after the defeat of Japan, the Russians got South Sakhalin in addition to the Kuril Islands. It should be noted that during the war, when America and Great Britain were exclusively occupied with the war with Germany, Moscow could not resist the habit of seizing some other weak country at that moment, it turned out to be Tuva, whose population in 1944 was at the height of war voluntarily, as Moscow usually presents, expressed a desire to become part of the USSR. The only thing that Stalin failed to do was to convince Roosevelt at the Potsdam Conference to give Moscow the Black Sea Straits and part of the eastern territories of Turkey, as well as South Azerbaijan, located in Iran, where Moscow sent troops in September 1941, allegedly to prevent Turkey's alleged attack on the Soviet Union. . Yielding to Churchill's insistent demand, the Russians had to leave Iran in 1946. Here are the vicissitudes of historical fate, if Stalin had not yielded to Churchill, then today Azerbaijan, which became an independent state after the collapse of the USSR, would not be divided into two parts. An important detail, territorially South Azerbaijan with a population of 25-35 million is superior to independent North Azerbaijan with a population of just over 10 million.      At this historical stage, the design of the borders of the Russian Empire in the post-war version of the USSR, which existed unchanged until 1991, ended. True, unable to withstand too long, unusual for the Russian Empire without a military period, the Russians attempted to seize Afghanistan, located at the very underbelly of the empire, but the attempt, which lasted for ten whole years (1979 - 1989), was unsuccessful. The Afghans repeated the feat of the Finns. Having no planes, no tanks, no artillery, the Afghan people, at the cost of losing more than two million people, forced the Russian invaders to retreat in disgrace, leaving the skeletons of burnt tanks and planes in the Afghan land.     Unable to withstand the confrontation in the Cold War with the democratic countries, the Empire of Evil, as Ronald Reagan very accurately defined Russia, partially disintegrated. Communist ideology has not stood the test of time. To quote Reagan's prophetic words: “I have always believed that the struggle taking place in the world now will never be resolved by bombs and missiles, by army or military power. We are dealing with a spiritual crisis; it is a test of moral will and faith.” \"I believe that communism is another sad and strange section of the history of mankind, the last page of which is being written now.\"       Referring to the population of the USSR, Reagan said: “Let us lift up prayers for the salvation of all those who live in this totalitarian darkness, so that they discover the joy of knowing God. But until they do this, we will be sure that they preach the superiority and omnipotence of the state, triumphant over the individual, and intend to assert their superiority over all the peoples of the world. And that they are the center of evil in the modern world.”      Yes, Reagan was right, indeed the communist regime did not fall as a result of military actions, the reason was in a vicious social and economic system, which in the end could not withstand the competition with a free market economy and could no longer fulfill the ever-increasing military demands of the empire. Fearing food riots and inevitable chaos, Moscow withdrew its troops from Eastern Europe in exchange for Western help and was unable to resist the centrifugal aspirations of the former socialist republics, for there was no longer socialism as such, which led to the collapse of the Soviet Union. At the same time, the Warsaw Pact, in which the Soviet army occupied a dominant position, also ceased to exist.     Unfortunately, with the disappearance of the Soviet Union, the Evil Empire did not disappear anywhere. Alas, the leaders of the democratic countries of the West, not understanding the uniqueness of Russia, and the mentality of the Russian people with its relic great-power worldview and Great Russian chauvinism, helped Russia to rise in the hope that, having become a democratic state, Russia will change and become a European country, similar to countries in which human life and his freedom is the greatest value. But the Russian people and democracy is nonsense. The Russian people cannot exist outside the empire and are ready for hardships for the sake of the empire. Needless to say, the Russian people greeted with glee the return of recalcitrant Chechnya to the bosom of the empire and the annexation of Crimea, and also supported the invasion of Russian troops into Georgia and Ukraine. All this would not have happened if the West, having won the Cold War, had been consistent and liquidated Russia as an empire, which, even after the collapse of the USSR, remains a prison of peoples and has not lost its predatory essence. (2) Realizing that the Russian people, who have no experience , but rather incapable of active political as well as organizing rational labor activity, democracy is contraindicated, Putin took the course “Back to the empire.” (3) Putin essentially emasculated the attributes of democracy, leaving only names from them. After repeatedly mocking the Constitution by Putin, the Russian people finally got an emperor in the hope that he would return the lost territories to the empire. The reason for the constant aggressiveness of Russia lies not in the regime and not in ideology, but in the mentality of the Russian people, which is a hereditary component, coupled with the imperial worldview. (4)         In the post-Soviet space, all countries have abandoned the communist ideology and, except for the Baltic countries, are in approximately the same position in terms of democracy, but only Russia has remained, as before, a country that poses a threat to its neighbors. All countries that were colonies of Russia, which, as Putin says, has risen from its knees, are faced with a choice - either you are a vassal or an enemy. However, in both cases, according to the plan of the Kremlin revanchist, they are all candidates for a “voluntary outpouring of will” to become part of the “Russian world”.   From the very first steps, as soon as the revanchist Putin was in the Kremlin, he began with the war in Chechnya. The democratic West silently watched how “friend Putin” (as the amateur politician American President Bush Jr. called him) ruthlessly drenched the Chechen people in blood, according to the St. Petersburg hooligan, who offended the Russians with a desire to be free. This was followed by wars in Georgia and Ukraine with the exclusion of territories, the elimination of citizens of other countries objectionable to Putin by the hands of sent assassins. There was no reaction from the West to Putin's antics. And today, Western leaders are racking their brains on how to appease \"Putin's friend\" in his revanchist frenzy. The current situation is very reminiscent of Europe on the eve of World War II, when the leading European countries inactively accompanied the aggressive steps of Nazi Germany, fearing to provoke Hitler to a big war, and they got it. Putin's political course, in principle, does not differ from Hitler's revanchist plans to redistribute the political map of Europe.    The Russian people saw in Putin a leader capable of restoring the empire to its former glory. Propaganda of military patriotism, victory in the form of pompous military parades, the militarization of the country and the annexation of foreign territories testify to the maturity of fascism that has been established in Russia. The Russian Fuhrer copies all Hitler's revanchist methods, which led to the outbreak of World War II, one to one (5). And yet Russian fascism differs from German. Putin had neither a party nor a party ideology, unlike Hitler, who had to create a party, organize powerful propaganda of the fascist ideology, so that the German people, believing, would follow him. Putin, however, only opened the floodgates to Great Russian chauvinism, the crest of a wave of which, and brought him to power. Putin used what has always been and emerged from the depths of the people's consciousness at the moment when the empire began to crumble like a house of cards. So Stalin, who was well versed in the people's mentality, was a hundred times right when he spoke of Great Russian chauvinism. (6) Ronald Reagan also pointed this out when he spoke of Russia as \"the center of evil in the modern world.\" The Russian's imperial outlook is so great that, even while in another country where he moved in search of a better life, he supports Putin's revanchist aspirations.    Putin and the Russian people are one, and this is the uniqueness of the situation that Western democracy has to deal with. Late, but it looks like the West finally realized the need to stop Putin, who lost his perception of reality, who decided to dictate his will to the World, just as he is doing it in Russia. The future of the World today is being decided in the battle with Russia for the freedom of Ukraine, and the people of the free World must realize this circumstance in all seriousness and prepare for the difficulties that accompany wartime conditions as a forced inevitability, otherwise George Orwell’s warnings will become reality and the darkness of the “Russian world” will cover too cautious and indecisive Europeans, and a cage of lies from a detachment of Putin's mongrels like Simonyan and Solovyov will entangle their consciousness, turning them into mankurts.    In the event of a Russian defeat, which is very likely given the cohesion of Western democracies, it will not be possible to repeat the past mistake in helping the empire. Let the prehistoric monster die in isolation. The Russian people will not forgive the defeat of Putin and his friends in the organized criminal group, and in the inevitable chaos that has come, the empire will begin to collapse like a house of cards, dozens of peoples will gain their long-awaited freedom. Maybe then, being within the boundaries of their original territory, which is Muscovy (7), the Russian people will be forced to discard the imperial worldview and, following the example of the Finns, will be engaged in the arrangement of their country without threatening their neighbors.       1. Stalin's fatal mistake that saved the world. https://alikbahshi.livejournal.com/20036.html   2. Russia is the most aggressive country. https://alikbahshi.livejournal.com/32531.html   3. Back to the empire, or the restoration of historical justice according to Putin. https://alikbahshi.livejournal.com/22792.html   4. People's fate or each cricket has its own hearth. https://alikbahshi.livejournal.com/28564.html   5. Пpизpaк Гитлepa бpoдит пo Eвpoпe. https://alikbahshi.livejournal.com/38049.html    6. Beликopyccкий шoвинизм, и Пyтин eгo фюpep. https://alikbahshi.livejournal.com/21133.html    7. Пepвый пpeзидeнт пocлe Пyтинa бyдeт пpeзидeнтoм Mocкoвии. https://alikbahshi.livejournal.com/83920.html    05.09.2022",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5412450",
  "comments": [
    {
      "author": "BADecker",
      "created_time": "September 06, 2022, 02:01:44 AM",
      "body": "Almost all of what you say is ancient history BS. It may have been true at one time, but now it is the reverse... other countries doing things like this in the direction of Russia. With the number of nukes they have, and the size of the nukes, all Russia has to do is sit back and take over the world through friendly trade relations... BRICS. The nukes act as a deterrent to any nation that is having thoughts about attacking her.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Alik Bahshi",
      "created_time": "September 06, 2022, 06:12:23 AM",
      "body": "Quote from: BADecker on September 06, 2022, 02:01:44 AMAlmost all of what you say is ancient history BS. It may have been true at one time, but now it is the reverse... other countries doing things like this in the direction of Russia. With the number of nukes they have, and the size of the nukes, all Russia has to do is sit back and take over the world through friendly trade relations... BRICS. The nukes act as a deterrent to any nation that is having thoughts about attacking her. It is difficult to comment on vagueness. What other countries and what do they do the opposite? Under such a combination of uncertainties, you can shove anything. In my article, everything is specifically stated in accordance with the title.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Alik Bahshi",
      "created_time": "October 31, 2022, 06:29:13 AM",
      "body": "\"Russian World\" because of its aggressiveness falls into more and more isolation. The West finally understood the need to cut off all contacts with Russia as an empire of Evil and Lies. It is useless and dangerous to sign any agreements with Russia. One hope is that in isolation this prehistoric monster will die and civilization will be freed from the fear of being destroyed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BADecker",
      "created_time": "November 01, 2022, 01:24:38 PM",
      "body": "The reason for Russian aggressiveness is quite simple. It's the way any country is when things happen like this.- The United States along with a bunch of US wealthy people and companies started modern Russia. The US did this by financing the Bolshevik Revolution in 1917. Further, the US financed Russia for a long time after the Revolution, with money and machinery (the same way they are financing Ukraine, today).- The Bolsheviks and their followers thought that the US did this to give freedom to Russia. But the unspoken reason was to make Russia a puppet of the US... probably to get them to put down the German uprising that made WW2... which Russia did.- Russians are smart. They figured out that the US was enslaving them under the guise of something that looked like freedom. When the Russians realized that they weren't really being given freedom by the US, they rebelled against the US.And that is how it is right now.The more important question is, \"What will Ukraine do when they realize that the US isn't really helping them, but rather is making them into a puppet of the US?\"In all the police actions and other wars the US has been doing around the world, often the US loses the war. But the US banking system wins the war by converting the other countries into puppet money systems... like the European Euro, a puppet of the US Federal Reserve Bank.Russia simply understands that this is what it is all about, and they don't want anything to do with the US, but especially with the lying and cheating US banking system. That's why they are pushing for BRICS.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "worldofcoins",
      "created_time": "November 13, 2022, 02:06:38 PM",
      "body": "Russia must learn from its past and the past of others as well. Violence is not and cannot be the solution for anything. All the issues must be resolved by mutual consent and agreements. War has not had many outcomes for the governments, but for the people, it's most dangerous as they have to pay for the effects of the war and violence.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BADecker",
      "created_time": "November 13, 2022, 04:54:56 PM",
      "body": "Quote from: worldofcoins on November 13, 2022, 02:06:38 PMRussia must learn from its past and the past of others as well. Violence is not and cannot be the solution for anything. All the issues must be resolved by mutual consent and agreements. War has not had many outcomes for the governments, but for the people, it's most dangerous as they have to pay for the effects of the war and violence. That's the big point, but not for Russia. Rather, for the US. The US has gone around the world, and inside the American lands, and killed and manipulated many nations for over 100 years. The US was behind the Ukrainian government coups since at least 2014.For years and years the world leaders have called US military actions around the world... called them police actions to bring peace to an area. Finally when Russia does it to help Ukraine by ousting the US political regime, Russia is said to be the bad country.This double standard that the US media preaches, where the US can do no bad, but the rest of the world that tries to do like the US is bad... this double standard is conquering the whole world for the US banking system, which is the biggest Ponzi scheme the world has ever known. It's all about money, and fake money (the USD) at that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Alik Bahshi",
      "created_time": "November 13, 2022, 08:57:45 PM",
      "body": "Quote from: worldofcoins on November 13, 2022, 02:06:38 PMRussia must learn from its past and the past of others as well. Violence is not and cannot be the solution for anything. All the issues must be resolved by mutual consent and agreements. War has not had many outcomes for the governments, but for the people, it's most dangerous as they have to pay for the effects of the war and violence. Alas, Russia does not learn from its own mistakes, much less from the mistakes of others. Since the war with Napoleon, Russia has lost every war except World War II, and it would have lost if it were not for the allies. Russia will also lose the war with Ukraine.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Alik Bahshi",
      "created_time": "July 24, 2023, 08:38:35 AM",
      "body": "Russians have one distinguishing feature in their character, namely, unhealthy envy, if the well-being of a neighbor causes some to achieve it, then the Russian causes a desire to destroy this well-being. One of the reasons for Russia's aggressiveness towards neighboring countries that were colonies of the Russian Empire.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "paxmao",
      "created_time": "July 24, 2023, 12:19:39 PM",
      "body": "Most of what I am reading here is crap, and at the same time quite a bit is true. All the motivation, references to \"sacred missions\", problems with envy,... That is just coverup. The naked truth is that nations are always on a constant struggle to compete with each other, and that will continue while they exist.Religion, Communism, \"freeing the world\" are just excuses to impose conditions to others. In the current situation, the Russian Federation needs Crimea to have a good access to the Mediterranean and for trade in general and that is the real reason of the war - if Ukraine aligns and allies with Europe / US, it is a matter of time that Sebastopol becomes an US base. Putin could not allow this.The caveat on this reasoning is that Crimean and the \"land bridge\" are inhabited by people whose opinion matters nothing to Putin (and possibly not that much for the US). So... just a naked meatgrinder between the Mafia state that is the RF and the \"Land of the Lobby\" that is US.This could be solved by having a proper European army and gaining a much higher degree of independence of Europe from US and having Ukraine freely deciding if they want to establish links with Europe. Western Europe is possible the most pacific and less imperialistic of the blocks in the world, because people still remember WW II and have no interest in repeating.Europe is the path.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Alik Bahshi",
      "created_time": "July 24, 2023, 02:21:43 PM",
      "body": "Quote from: paxmao on July 24, 2023, 12:19:39 PMMost of what I am reading here is crap, and at the same time quite a bit is true. All the motivation, references to \"sacred missions\", problems with envy,... That is just coverup. The naked truth is that nations are always on a constant struggle to compete with each other, and that will continue while they exist.Religion, Communism, \"freeing the world\" are just excuses to impose conditions to others. In the current situation, the Russian Federation needs Crimea to have a good access to the Mediterranean and for trade in general and that is the real reason of the war - if Ukraine aligns and allies with Europe / US, it is a matter of time that Sebastopol becomes an US base. Putin could not allow this.The caveat on this reasoning is that Crimean and the \"land bridge\" are inhabited by people whose opinion matters nothing to Putin (and possibly not that much for the US). So... just a naked meatgrinder between the Mafia state that is the RF and the \"Land of the Lobby\" that is US.This could be solved by having a proper European army and gaining a much higher degree of independence of Europe from US and having Ukraine freely deciding if they want to establish links with Europe. Western Europe is possible the most pacific and less imperialistic of the blocks in the world, because people still remember WW II and have no interest in repeating.Europe is the path. You write: \"The naked truth is that nations are always on a constant struggle to compete with each other, and that will continue while they exist.\"  Then you assert that there is peace and tranquility in Europe. And that there are no more nations in Europe? After all, they must compete and fight among themselves, according to your statement. You write nonsense, devoid of the simplest logic.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BADecker",
      "created_time": "July 24, 2023, 05:49:42 PM",
      "body": "Quote from: Alik Bahshi on September 06, 2022, 06:12:23 AMQuote from: BADecker on September 06, 2022, 02:01:44 AMAlmost all of what you say is ancient history BS. It may have been true at one time, but now it is the reverse... other countries doing things like this in the direction of Russia. With the number of nukes they have, and the size of the nukes, all Russia has to do is sit back and take over the world through friendly trade relations... BRICS. The nukes act as a deterrent to any nation that is having thoughts about attacking her. It is difficult to comment on vagueness. What other countries and what do they do the opposite? Under such a combination of uncertainties, you can shove anything. In my article, everything is specifically stated in accordance with the title.Solomon explained, Ecclesiastes 6:11: \"The more the words, the less the meaning, and how does that profit anyone?\" - https://biblehub.com/ecclesiastes/6-11.htm.I haven't seen anybody simply dump a bunch of words into threads on this forum more than you. Are you a fast typist? Or do you have a lot of people doing your typing for you?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "swogerino",
      "created_time": "July 24, 2023, 09:33:21 PM",
      "body": "Quote from: Alik Bahshi on July 24, 2023, 08:38:35 AMRussians have one distinguishing feature in their character, namely, unhealthy envy, if the well-being of a neighbor causes some to achieve it, then the Russian causes a desire to destroy this well-being. One of the reasons for Russia's aggressiveness towards neighboring countries that were colonies of the Russian Empire.That is the main factor,they cannot accept that they are not the great Soviet Union USSR anymore.The leaders of Russia has been quiet most of the time but since Putin came to power he had only one ill imperial dream fantasy of getting every single country they lost when the USSR was dissolved to get back and to bring back the great Soviet Union empire.He has already acknowledged this in front of all world when he said that the biggest sadness in his life was when USSR was dissolved and that he dreamed of getting that empire back,this is the root of all evil from Russia.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pidgeon",
      "created_time": "July 25, 2023, 01:27:25 PM",
      "body": "Quote from: BADecker on November 01, 2022, 01:24:38 PMBut the unspoken reason was to make Russia a puppet of the US... probably to get them to put down the German uprising that made WW2... which Russia did.Ok, right, makes sense in reverso world, it was the US that rescued Russia with a shitload of money and weapons from the Nazi, that Russia was actually allied with at the start of ww2?They helped the Russians kick Germany ass in ww2 but at the same time they instigated the revolution in 1917 so that suddenly Germany had no enemy on the eastern front and could move dividiosn after division to the western front to kill us soldiers. How high are you right now that you can still throw around stupid claims like this?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BADecker",
      "created_time": "July 25, 2023, 04:47:12 PM",
      "body": "Quote from: Pidgeon on July 25, 2023, 01:27:25 PMQuote from: BADecker on November 01, 2022, 01:24:38 PMBut the unspoken reason was to make Russia a puppet of the US... probably to get them to put down the German uprising that made WW2... which Russia did.Ok, right, makes sense in reverso world, it was the US that rescued Russia with a shitload of money and weapons from the Nazi, that Russia was actually allied with at the start of ww2?They helped the Russians kick Germany ass in ww2 but at the same time they instigated the revolution in 1917 so that suddenly Germany had no enemy on the eastern front and could move dividiosn after division to the western front to kill us soldiers. How high are you right now that you can still throw around stupid claims like this?Just curious. Why did you repeat some of the things that I said, and then tell me that I had to be 'high' to think that way? History shows us that the things that I said happened. Does this mean that I showed all of the history of the area? No, of course not. Here is a little more.Every nation has heard of Siberia. The Tarter nations have been around in Russia and Siberia for a long time before the US even existed. But historians show us very little about Tartaria, because the Zionist Jews don't want us to know about Tartaria, which once ruled almost all of the Northern Hemisphere. But the US - mostly the Zionist Jews - want to take over Siberia to control the wealth there. This has been their goal for at least a couple hundred years.This is what was behind and under WW1 and WW2. This is what's behind the US forming Nato. It's all about stealing Russian and Siberian lands from the people who live there. It's the reason why US financiers placed the Bolsheviks into power, to take down the Czar Empire, to steal their lands from them. But the Bolsheviks are people with their own goals, and they wouldn't agree to being ruled by the Zionists.Hitler and his comrades understood much of this. If they had beaten the Zionists back in WW2, we wouldn't have the wars that the US was using to control the world since then. And we wouldn't have the Ukraine war today. Why not? Because we wouldn't have the Zionist controlled banking system that is being used to steal money from everybody who uses world money, the USD. But, even if Hitler had won WW2, he and his would have ultimately failed, because the people of the free world would have found ways to take him down. As it was, the Zionists did it as part of their plan to control the whole world... in this case Russia through Ukraine.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Alik Bahshi",
      "created_time": "July 25, 2023, 04:59:14 PM",
      "body": "Quote from: Pidgeon on July 25, 2023, 01:27:25 PMQuote from: BADecker on November 01, 2022, 01:24:38 PMBut the unspoken reason was to make Russia a puppet of the US... probably to get them to put down the German uprising that made WW2... which Russia did.Ok, right, makes sense in reverso world, it was the US that rescued Russia with a shitload of money and weapons from the Nazi, that Russia was actually allied with at the start of ww2?They helped the Russians kick Germany ass in ww2 but at the same time they instigated the revolution in 1917 so that suddenly Germany had no enemy on the eastern front and could move dividiosn after division to the western front to kill us soldiers. How high are you right now that you can still throw around stupid claims like this?  You correctly said about the inverted world, where consciousness is also inverted. It is believed there, at the suggestion of Putin, that Ukraine attacked Russia, they believe that the Boeing of flight MH-17 was shot down by Ukraine, and so on. In continuation of the childish babble, Moscow says that the Ukrainians themselves destroyed the Christian Cathedral in Odessa. A reasonable person cannot perceive this, but in the Empire of Lies, which is Russia, this is considered the norm. The Russian people have lived their entire history in a lie and cannot imagine any other life. See my topic \"Empire of Lies and its chief liar\" here on the forum: https://bitcointalk.org/index.php?topic=5408234.0",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pidgeon",
      "created_time": "July 26, 2023, 04:22:24 PM",
      "body": "Quote from: BADecker on July 25, 2023, 04:47:12 PMJust curious. Why did you repeat some of the things that I said, and then tell me that I had to be 'high' to think that way? Because your dumber than a bold eagle brushing his teeth with Gillette cream to grow his balls.Quote from: Alik Bahshi on July 25, 2023, 04:59:14 PM You correctly said about the inverted world, where consciousness is also inverted. It is believed there, at the suggestion of Putin, that Ukraine attacked Russia, they believe that the Boeing of flight MH-17 was shot down by Ukraine, and so on. This is you how Russian history works- we beat the mongols but without them raping our asses 4 centuries- we conquered Siberia killing everyone but it wasn't a genocide- we beat Napoleon, but somehow there were 5 battles in the winter campaign in which we didn't won A single one- deleted page about the Crimean war when Napoleon the 3rd kicked their asses- deleted page about the Japanese war- deleted page about ww1 because it was the Russian empire that was defeated not the USSR, which of course doesn't apply to the witner campaign- the great patriotic war which is not the same as ww2 because it misses the invasion of Poland and Romania as Nazi allies- deleted page about Afghanistan which they invaded before the USAND SO ON AND ON that ony a bainwashed moron like baldecker here would gulp down that shit so no wonder they believe every crap!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coolcoinz",
      "created_time": "July 26, 2023, 05:29:57 PM",
      "body": "You should read about the homo sovieticus. In short, it's how the Russian society marked by communism was evolving into what it is now. A bunch of sociologists and philosophers used this term in their works, mainly Zinovyev, Kolakowski, and others. The Soviets were focused on simply killing their political adversaries and Stalin excelled at that. Decades of living \"under the boot\" changed Russian politicians into what they are: scheming, lying opportunists, full of envy and hate towards their neighbors. That's why we're so surprised by what they're saying. In the West we don't lie as openly. When you get caught lying you either admit it, or try to cover it up somehow. Russians double down on the lie by repeating it and adding even more on top. There's a number of good examples out there, like the way they denied shooting down the Malaysian flight 17, or historically how they tried to blame the Katyn massacre on the Nazis.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BADecker",
      "created_time": "July 26, 2023, 06:46:54 PM",
      "body": "The simple reason for the aggressiveness of the Russian world is, nobody else will do it for them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Alik Bahshi",
      "created_time": "July 26, 2023, 07:11:36 PM",
      "body": "Quote from: BADecker on July 26, 2023, 06:46:54 PMThe simple reason for the aggressiveness of the Russian world is, nobody else will do it for them. Bravo! I'm amazed! It's like a killer saying I killed a man because no one else would.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}