{
  "id": "topic_5446043",
  "title": "MrAndras",
  "author": "MrAndras",
  "created_time": "March 23, 2023, 12:31:34 PM",
  "content": "Is this the CEO if the fraud company Localbitcoins.com?https://twitter.com/saraleppanen/status/1206842226992721920If not I will delete this post.Looking forward to get more detailed information about these scammers. - So I can hire somebody to arrest them, and get back my bitcoins.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5446043",
  "comments": [
    {
      "author": "Oshosondy",
      "created_time": "March 23, 2023, 12:46:40 PM",
      "body": "First, you do not need to delete this, but you have have construction discussion about it.Localbitcoins was a good and trustworthy p2p trading platform, but because the bitcoin exchange was unable to maintain their customers and provide the services that can bring more customers, their customers reduced and probably the exchange was not profitable again for those that created it. The exchange has been shot down by those that created it.But how were you scammed? Or why saying Localbitcoins CEO defraud you, with proof?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "shasan",
      "created_time": "March 23, 2023, 01:27:24 PM",
      "body": "Quote from: MrAndras on March 23, 2023, 12:31:34 PMIs this the CEO if the fraud company Localbitcoins.com?https://twitter.com/saraleppanen/status/1206842226992721920If not I will delete this post.Looking forward to get more detailed information about these scammers. - So I can hire somebody to arrest them, and get back my bitcoins.You are accusing LocalBitcoins of a scam but you have not provided any detailed information on how they are frauds. Have you any proof against them which can prove they are frauds? Also, where you were when they announced they will stop their service. You came here long after that and you have accused without providing any proof.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MrAndras",
      "created_time": "March 23, 2023, 03:38:12 PM",
      "body": "Quote from: Oshosondy on March 23, 2023, 12:46:40 PMFirst, you do not need to delete this, but you have have construction discussion about it.Localbitcoins was a good and trustworthy p2p trading platform, but because the bitcoin exchange was unable to maintain their customers and provide the services that can bring more customers, their customers reduced and probably the exchange was not profitable again for those that created it. The exchange has been shot down by those that created it.But how were you scammed? Or why saying Localbitcoins CEO defraud you, with proof?If course I need to delete this, if its not the profile of the CEO Localbitcoins.Yes I got scammed, I cant withdrawal my bitcoins.The reason why Localbitcoins is shutting down, because it receive so many complains, because they steal the Bitcoins of some of their costumers. They are too busy with deleting complains in their comments.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cantsay",
      "created_time": "March 23, 2023, 07:00:48 PM",
      "body": "Quote from: MrAndras on March 23, 2023, 03:38:12 PMThe reason why Localbitcoins is shutting down, because it receive so many complains, because they steal the Bitcoins of some of their costumers. They are too busy with deleting complains in their comments. If what you Claim is true then you should proceed to create a scam accusation thread or probably edit this one and use the proper scam report format. Check out this thread for the format: Scam Report Format (Use it to make scam reports properly)I don't know if they really scammed you or not but you should provide more evidence and that should help those who are using or who planned on using it to know what to do next.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "shasan",
      "created_time": "March 23, 2023, 09:11:42 PM",
      "body": "Quote from: MrAndras on March 23, 2023, 03:38:12 PMThe reason why Localbitcoins is shutting down, because it receive so many complains, because they steal the Bitcoins of some of their costumers. They are too busy with deleting complains in their comments.From where you came to know that they have received a lot of complaints? I have never and nowhere seen any complaints against them through a lot of complaints stand for the fraud activity of the users of LocalBitcoins. Users made from by reversing their payment and also providing fake screenshots as well as fake messages of the payment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "logfiles",
      "created_time": "March 23, 2023, 10:22:15 PMLast edit: July 19, 2023, 08:19:38 PM by logfiles",
      "body": "Quote from: MrAndras on March 23, 2023, 03:38:12 PMIf course I need to delete this, if its not the profile of the CEO Localbitcoins.Yes I got scammed, I cant withdrawal my bitcoins.The reason why Localbitcoins is shutting down, because it receive so many complains, because they steal the Bitcoins of some of their costumers. They are too busy with deleting complains in their comments. have you tried to delete your localbitcoins profiles? They still won't let you withdraw BitcoinsIn my accounts, I see there is that option, though what I have in the account is way below the withdrawal limit.Go to settings and then click on security. Below the security tab, you will see an option that says Account deletionSomething like this will come up",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MrAndras",
      "created_time": "March 24, 2023, 06:19:35 AM",
      "body": "Quote from: shasan on March 23, 2023, 09:11:42 PMQuote from: MrAndras on March 23, 2023, 03:38:12 PMThe reason why Localbitcoins is shutting down, because it receive so many complains, because they steal the Bitcoins of some of their costumers. They are too busy with deleting complains in their comments.From where you came to know that they have received a lot of complaints? I have never and nowhere seen any complaints against them through a lot of complaints stand for the fraud activity of the users of LocalBitcoins. Users made from by reversing their payment and also providing fake screenshots as well as fake messages of the payment.LOL you are paid by Localbitcoins.com or what? Its hilarious what you are saying. I deposit my Bitcoins to Localbitcoins.com I did not trader since and waited after the price went up.Of course they are not scamming every single user, but just a certain percentage. I saw a lot of complains already in their social media comments, but they get deleted very quick. Thats why they have so less comments, and if you see their comments you see they are paid comments/likes. And again I did not make any suspicious transactions, in my trading history its reflecting. Did you ever wonder what happen with the Bitcoins they steal from the users? - And also the Bitcoins in Localbitcoins are not reflected on the blockchain, this is part of the scam, they steal the bitcoins but you can not see it through the blockchain explorer.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "logfiles",
      "created_time": "March 25, 2023, 09:44:34 PM",
      "body": "Quote from: MrAndras on March 24, 2023, 06:19:35 AMLOL you are paid by Localbitcoins.com or what?Nobody paid anybody, you are probably biased or made a mistake in the past, are you are now attempting a smear campaign. I never verified my account after Localbitcoins imposed mandatory KYC verification and I had in my account a tinny bit of Bitcoins from around 2018/2019, but I can still see an option to withdraw it via account deletion.What is stopping you from doing the same?Quote Its hilarious what you are saying. I deposit my Bitcoins to Localbitcoins.com I did not trader since and waited after the price went up.Rookie mistake number 1. What do they always tell you about keep coins in an exchange for a long time?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}