{
  "id": "topic_5469892",
  "title": "BADecker",
  "author": "BADecker",
  "created_time": "October 10, 2023, 03:27:29 PM",
  "content": "The whole Covid scare was a setup. There probably was a literal Covid disease - man-made, of course - just to make an excuse to sell the vaccines. But the major point is (and it's REALLY BIG) that all the leading people in medicine and government absolutely KNEW that the vaccines were damaging and killing people. They knew it then, and they know it now. yET, they are still promoting the vaxxes.THEY KNEW--FOIA Emails Sent To Daily Clout Team Reveal WHO/CDC/NIH KNEW Covid Shots Were Causing Deadly Blood Clots And Myocarditis In MAY 2021—Senior WHO Team Colluded To LIE To TButhe American Peoplehttps://celiafarber.substack.com/p/they-knew-foia-emails-sent-to-dailyNaomi Wolf: \"It's So Huge. I Hope You're All Sitting Down.\"\"Dr. Fauci lied and lied and lied subsequent to this crisis meeting. They knew that they were lying.\"\"The White House Is freaking out. Freaking out.\"\"Blood clots, lung clots, leg clots, problems with platelets, clots in your brain…They know it's happening…These are scientists and message people. This is the message shop.\"\"I've never seen anything like this in the history of our country.\"—Naomi Wolf, interview here, describing the bombshell work of her colleagues, Amy Kelly and attorney Edward Berkovich.Amy Kelly article here.My friend Kristina Borjesson just made the point that NOW what has to happen next is litigation by FOIA expert attorneys to get those 46 pages UNREDACTED.This is my thought:Every American citizen must be given access to this complete set of communications, and the guilty must be prosecuted in a special court arranged by the victims' families.Do not let this go by as more of the same—it is indeed a bombshell but in addition—it contains yet to be detonated secondary bombs that we REALLY need to get hold of.WHAT do those 46 redacted pages traced to the WH say? We must refuse to wait for this, and refuse to be gaslit or guilt tripped by some smug Press Secretary condescendingly telling us she's \"…not going there,\" or \"…not doing it.\"SPREAD The Kelly-Berkovich report and the Wolf interview on The War Room (all linked here) far and wide, assuming upon review, you agree how significant this is....",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5469892",
  "comments": []
}