{
  "id": "topic_5477380",
  "title": "Bit_Happy",
  "author": "Bit_Happy",
  "created_time": "December 11, 2023, 03:47:59 AM",
  "content": "Most of you have heard of Bitcoin Pizza day originally on May 22 2010. At that time mining was still so easy that virtually no one paid cash for Bitcoin. Another historical milestone happened a bit later in 2010 > I started here in April/May 2011. This next info I learned from an old thread which was discussing an even older thread, I've lost those bookmarks now, but might find them again someday. One amazing thing about this forum is the really old threads, have you ever studied/looked at any?   The first ever \"record\" of someone <~exact quote from the thread>\"selling Bitcoin for Paypal(!)* payments and keeping records on a spreadsheet\" was also in 2010. That's right, BTC was still so close to free, it was safe for \"the only guy doing it\" to accept Paypal (lol?), despite the obvious risk of reversed transactions. The price he was selling them for will be a big surprise for some of you: The discussion in the old thread was about him selling BTC at the price of 300BTC/dollar! This actually happened in the real world, so how does the math look?To make it a bit more believable let's go with \"only 200 BTC\"/$, a half a penny each. Now, I'm not saying many people bought that low and held on all the way. Let's say you invested only $100, then proceeded to eventually spend, give away*, and/or gamble away 95% of your long-term stash. Now you have only 5% of your original amount left.  *(people were extremely generous back then, and no crime here either) 200BTC/$ * $5 = $1,000BTC! If you where one of the lucky people to sell near the current all-time high how much would you have made?Even at \"only $20k/BTC\" :::: 1,000BTC * $20,000  = $20,000,000! If my math is off, please let me know. At 200btc/$ every One Dollar turned into 4 Million, you do not see that many times in your lifetime, but that is what actually happened with Bitcoin. At $40k that same person has $40,000,000 today, and near the all-time high you are looking at $70 Million coming from only 5% of a $100 investment.We can all see there is often an \"high - sometimes insane - level of greed\" in this community. People are often trying to find the next thing which will produce huge profits. One reason I Love the old threads in this forum is the way people helped each other \"figure out the hard stuff\" with no motive of short-term profits. The alpaca socks kidOne more early Bitcoin milestone, related to internet eCommerce was the alpaca socks kid. This guy's parents owned a small farm and made alpaca socks. He talked his parents into accepting BTC. That family is so rich now, they probably had to relocate to someplace they \"were not so famous.\" History class in school can be really boring, but BTC history is amazing! Have a great night. Thomas-Soellner/Getty ImagesOne great thing about this forum is the really old threads, have you ever studied/looked at any?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5477380",
  "comments": [
    {
      "author": "adaseb",
      "created_time": "December 11, 2023, 05:01:54 AM",
      "body": "Back in those days I think you could sell and buy bitcoins but as soon as the popularity gained they no longer allowed it. Don’t know if it was because you needed a money transmitter license or due to the fact that they were extremely easy to reverse.I remember what people did instead years later was basically buy some mining rig time slots and you would basically rent someone’s GPUs, they would mine for like an hour or 24 hours and you paid them by PayPal and they just mined into any address you wanted. I think that was like 10 years ago, time sure flies.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BabyBandit",
      "created_time": "December 11, 2023, 03:20:36 PM",
      "body": "Quote from: Bit_Happy on December 11, 2023, 03:47:59 AMMost of you have heard of Bitcoin Pizza day originally on May 22 2010. At that time mining was still so easy that virtually no one paid cash for Bitcoin. Another historical milestone happened a bit later in 2010 > I started here in April/May 2011. This next info I learned from an old thread which was discussing an even older thread, I've lost those bookmarks now, but might find them again someday. One amazing thing about this forum is the really old threads, have you ever studied/looked at any?   The first ever \"record\" of someone <~exact quote from the thread>\"selling Bitcoin for Paypal(!)* payments and keeping records on a spreadsheet\" was also in 2010. That's right, BTC was still so close to free, it was safe for \"the only guy doing it\" to accept Paypal (lol?), despite the obvious risk of reversed transactions. The price he was selling them for will be a big surprise for some of you: The discussion in the old thread was about him selling BTC at the price of 300BTC/dollar! This actually happened in the real world, so how does the math look?To make it a bit more believable let's go with \"only 200 BTC\"/$, a half a penny each. Now, I'm not saying many people bought that low and held on all the way. Let's say you invested only $100, then proceeded to eventually spend, give away*, and/or gamble away 95% of your long-term stash. Now you have only 5% of your original amount left.  *(people were extremely generous back then, and no crime here either) 200BTC/$ * $5 = $1,000BTC! If you where one of the lucky people to sell near the current all-time high how much would you have made?Even at \"only $20k/BTC\" :::: 1,000BTC * $20,000  = $20,000,000! If my math is off, please let me know. At 200btc/$ every One Dollar turned into 4 Million, you do not see that many times in your lifetime, but that is what actually happened with Bitcoin. At $40k that same person has $40,000,000 today, and near the all-time high you are looking at $70 Million coming from only 5% of a $100 investment.We can all see there is often an \"high - sometimes insane - level of greed\" in this community. People are often trying to find the next thing which will produce huge profits. One reason I Love the old threads in this forum is the way people helped each other \"figure out the hard stuff\" with no motive of short-term profits. The alpaca socks kidOne more early Bitcoin milestone, related to internet eCommerce was the alpaca socks kid. This guy's parents owned a small farm and made alpaca socks. He talked his parents into accepting BTC. That family is so rich now, they probably had to relocate to someplace they \"were not so famous.\" History class in school can be really boring, but BTC history is amazing! Have a great night. Thomas-Soellner/Getty ImagesOne great thing about this forum is the really old threads, have you ever studied/looked at any? This is actually very interesting and funny information and I like the quote \"Do You Know The First Times Bitcoin Ever Had Real World Value?\"  that has been said many times regarding crypto. To bad I am to stupid to understand anything tho and out of sMerits to send you merit but regardless of my sMerit balance this was interesting.  One great thing about this forum is the really old threads, have you ever studied/looked at any No.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Casdinyard",
      "created_time": "December 11, 2023, 03:50:41 PM",
      "body": "Pretty sure that 50 cent also sold an album of his in 2009-2010-ish with bitcoin payment, and some domestic starcraft tournaments in the past around the same time also offered as much as 250 bitcoins as CONSOLATION PRICES mind you. Goes to show how different people and things could be as time went by. 50 cent became affluent not only in fiat and in fame but also in bitcoin, and if you went so much as to participate in these starcraft tournaments, provided that you forgot about them or never sold these back in 2010 you might have been swimming in money like Scrooge Mcduck right now. Way back then bitcoin had value already, it's not going to be called currency in the first place if it weren't. It just so happened that its value shot up quicker than one would expect and now here we are, reaping the benefits.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Faisal2202",
      "created_time": "December 11, 2023, 04:28:26 PM",
      "body": "Quote from: Bit_Happy on December 11, 2023, 03:47:59 AMOne amazing thing about this forum is the really old threads, have you ever studied/looked at any? I keep getting the chance to read old topics like I read the following two made by tranthidung Do you know a first Bitcoin exchange? What is it, How it looks like? Bitcoin Proof of Work Difficulty Adjustment (Retarget) historyYou said you read a thread that talked about PayPal, the first thread in the above list also talked about PayPal, in the clarification of how they calculate the price of BTC in dollars well, for more convenience here it is.QuoteWe Sell 1,578.76 Bitcoins for $1.00 USD Plus PayPal Transaction Fee.We Buy1,578.78 Bitcoins for $1.00 USD Minus PayPal Transaction Fee.$100.00 USD Available15,100.00 Bitcoins AvailablePayPal Transaction Fee Calculator12/28/2009Well, I might help you to find the topic you were referring to but I did not get any much idea of that topic from your statements, so it is you do read that topic and you should have some words in your brain like keywords, which you already mention no doubt, but using ninjastic tool and entering the keyword you can find that thread plus don't forget to enter your username if you also posted on that thread, in this way, you can find that thread quickly than me who have no idea about that topic you are talking about.Quote from: Bit_Happy on December 11, 2023, 03:47:59 AMOne great thing about this forum is the really old threads, have you ever studied/looked at any? Again yes, I even bookmark them in a section named Important Threads, I have almost 41 topics bookmarked in that section.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "electronicash",
      "created_time": "December 11, 2023, 06:31:53 PM",
      "body": "i've seen some old threads and giveaways. but even as old as 2014 there were already lots of people scamming and impostors are common. someone even used the username THEYRNOS (Theyrnos) to deceive someone. but haven't heard of that alpaca kid. if he made lots of coins as early as 200BTC/$ then it makes sense to keep their identity private. the old thread mostly viewed this time i guess is Satoshi's first posts. probably analyzing his thoughts again trying to identify him.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bit_Happy",
      "created_time": "December 11, 2023, 08:55:28 PM",
      "body": "Quote from: Faisal2202 on December 11, 2023, 04:28:26 PMWe Sell 1,578.76 Bitcoins for $1.00 USD Plus PayPal Transaction Fee.Faisal2202 that is much more dramatic than my examples, and you helped teach me something thank you!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joniboini",
      "created_time": "December 12, 2023, 02:04:37 AM",
      "body": "Quote from: Casdinyard on December 11, 2023, 03:50:41 PMWay back then bitcoin had value already, it's not going to be called currency in the first place if it weren't. It just so happened that its value shot up quicker than one would expect and now here we are, reaping the benefits. I believe nobody expects Bitcoin to ever reach $10k per coin and beyond though. I remember reading old threads and social media posts, saying that $100 per Bitcoin is way too good already and people should sell their funds quickly. I'm pretty sure stories like people holding thousands of Bitcoin out of curiosity, forgetting about it, and then selling it after they made millions are quite common too. Obviously, not everyone tells that to the internet. Life is better when nobody is knocking on your door to $5 attack you anyway.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "notocactus",
      "created_time": "December 12, 2023, 08:30:10 AM",
      "body": "Some early trades of bitcoins for physical things you need to know.Pizza for bitcoins?. It is a legendary trade, everyone in Bitcoin market knows it.Raw Thai Honey (First 40 BTC of profits go to the forum!) 8 KG for sale!. It is like a missing story that is less popular than the pizza story. It took me 5 years in this forum to know about it.theymos sold bitcoin for $0.003/ BTC. See",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PrivacyG",
      "created_time": "December 12, 2023, 02:31:09 PM",
      "body": "These historical threads are very interesting to say the least.  It is interesting nonetheless to see old posts of the beginning times of this Forum.  Feels like some sort of time machine.Quote from: tranthidung on December 12, 2023, 08:30:10 AMtheymos sold bitcoin for $0.003/ BTC.I wonder if theymos feels sad, happy or a mix of the two feelings about this historical achievement.  It is sad he sold for that low.  But it is one of the first ever Transactions that made Bitcoin propel to where it is now.  Probably feels like when we look at any of our Transactions from years ago when Bitcoin was worth much less.It would be interesting to know if any of the first guys who purchased Bitcoin still hold on to a big chunk of what they held back then.  Such stories would be a very good read.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wind_FURY",
      "created_time": "December 12, 2023, 03:42:55 PM",
      "body": "Quote from: tranthidung on December 12, 2023, 08:30:10 AMSome early trades of bitcoins for physical things you need to know.Pizza for bitcoins?. It is a legendary trade, everyone in Bitcoin market knows it.Raw Thai Honey (First 40 BTC of profits go to the forum!) 8 KG for sale!. It is like a missing story that is less popular than the pizza story. It took me 5 years in this forum to know about it.theymos sold bitcoin for $0.003/ BTC. SeeBut I believe the first actual realization of Bitcoin's real value as a payment network was when the Silk Road was built by Ross Ulbricht. There was a gap in the online drugs market, which obviously no financial institution would service. Bitcoin filled that gap - plus made that market more efficient and payments became a little less frictionless.Many people in BitcoinTalk probably consider Ross Ulbricht a mere criminal because he built something illegal. But from another point of view, he's also an accelerationist who wanted to change the exisiting state of affairs.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Faisal2202",
      "created_time": "December 12, 2023, 04:21:12 PM",
      "body": "Quote from: Bit_Happy on December 11, 2023, 08:55:28 PMFaisal2202 that is much more dramatic than my examples, and you helped teach me something thank you!Always at your service.Quote from: tranthidung on December 12, 2023, 08:30:10 AMtheymos sold bitcoin for $0.003/ BTC.Damn!!! I wish I have a time machine so I could go there and buy BTC from Theymos, hehe theymos be like, can't you just tell me not to sell, you time travelers, hehe. Well, it is what it is, everything takes time to reach to a position (a high one) where BTC is currently going to rest.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "December 12, 2023, 05:02:58 PM",
      "body": "bitcoin pizzaalpaca socksbitcoin cupcakessilkroadwere 4 main real world first notable use casesthe exchanges were more internal market things, giving (economic: speculative pricing) pricing above mining cost(economic: value)even the faucets giving free bitcoin were a popular internal thing that gave real value(mining cost) for free to those that valued/values bitcoin(social: utility need) but could find a way to get bitcoin using money. people would even trade their human time clicking adds to earn faucet bitcoin and then that developed into other economics of labourprice, value,  (economic) are 2 separate thingsvalued, values (social: utility/desire) are social choices separate from economic value",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dr.Bitcoin_Strange",
      "created_time": "December 12, 2023, 10:23:25 PM",
      "body": "You know... With the current price of bitcoin now or even looking at the previous ATH, I used to imagine sometimes if it was actually real that 1 bitcoin was less than $1 during the early days, but the fact is true. I know we still have some old holders like franky1, who has obviously been holding since 2011, but indeed, not all of those old adoptees of bitcoin were able to hold it till now; some sold at the price they were satisfied with, and they still got the price they deserved. The bitcoin pizza day was the first event about bitcoin, and I got to know about the bitcoin world's value.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wind_FURY",
      "created_time": "December 13, 2023, 07:37:56 AM",
      "body": "Quote from: franky1 on December 12, 2023, 05:02:58 PMbitcoin pizzaalpaca socksbitcoin cupcakessilkroadwere 4 main real world first notable use casesThe first three were very notable for the promotion of Bitcoin, but the Silk Road was where it was demonstrated as a real, viable currency for unregulated market-places. Plus with a real sustainable economy behind Bitcoin, \"the coin\" stopped being a \"natural-occurring ponzi\", which is also what Gold is, and it was actualized as a currency, THE currency of choice by the users of the Dark Markets. We haven't seen its full potential, and in what direction it could influence the evolution of money. But once it starts weakening political strong-holds, then nation-states themselves MUST buy and own it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "notocactus",
      "created_time": "December 14, 2023, 02:02:15 PM",
      "body": "Quote from: Wind_FURY on December 12, 2023, 03:42:55 PMBut I believe the first actual realization of Bitcoin's real value as a payment network was when the Silk Road was built by Ross Ulbricht. There was a gap in the online drugs market, which obviously no financial institution would service. Bitcoin filled that gap - plus made that market more efficient and payments became a little less frictionless.Many people in BitcoinTalk probably consider Ross Ulbricht a mere criminal because he built something illegal. But from another point of view, he's also an accelerationist who wanted to change the exisiting state of affairs.I did not research too much about Silk Road and Roll Ulbricht. I read some documents about it but only occasionally when someone shared information about it. I can not discuss too much about it with you but I agree early Bitcoin adopters played important role for Bitcoin community in the past and how it has grown so far, exclusively Silk Road and Ross Ulbricht.Quote from: Faisal2202 on December 12, 2023, 04:21:12 PMDamn!!! I wish I have a time machine so I could go there and buy BTC from Theymos, hehe theymos be like, can't you just tell me not to sell, you time travelers, hehe. Well, it is what it is, everything takes time to reach to a position (a high one) where BTC is currently going to rest.  If it is another person, I think there are more reasons to regret because he likely sold all bitcoins he had at very cheap price.This one is about theymos, who is a very strong Bitcoiner and he has still been here with us, took over the forum administration from Satoshi Nakamoto and lit the forum up over the years. I believe theymos actually reserved some bitcoins he mined when it was easily to mine and price was cheap, for his future fortune. I also believe now he already got a fortune. No big regret from theymos, is what I believe.By the way, seeHow did theymos know about Bitcoin?Quote from: theymos on December 03, 2014, 10:15:15 PMQuote from: newIndia on December 03, 2014, 09:58:19 PMHow did you came to know about Bitcoin first ?I saw someone mention it on 4chan. They were complaining about the long block download time. Do you see it is a legendary thinking style?Most of us start to be interested in something when there are good news about it but years ago, theymos started to interested in Bitcoin when he saw someone complained about it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "roller33",
      "created_time": "December 17, 2023, 01:51:26 AM",
      "body": "Quote from: Bit_Happy on December 11, 2023, 03:47:59 AMMost of you have heard of Bitcoin Pizza day originally on May 22 2010. At that time mining was still so easy that virtually no one paid cash for Bitcoin. Another historical milestone happened a bit later in 2010 > I started here in April/May 2011. This next info I learned from an old thread which was discussing an even older thread, I've lost those bookmarks now, but might find them again someday. One amazing thing about this forum is the really old threads, have you ever studied/looked at any?   The first ever \"record\" of someone <~exact quote from the thread>\"selling Bitcoin for Paypal(!)* payments and keeping records on a spreadsheet\" was also in 2010. That's right, BTC was still so close to free, it was safe for \"the only guy doing it\" to accept Paypal (lol?), despite the obvious risk of reversed transactions. The price he was selling them for will be a big surprise for some of you: The discussion in the old thread was about him selling BTC at the price of 300BTC/dollar! This actually happened in the real world, so how does the math look?To make it a bit more believable let's go with \"only 200 BTC\"/$, a half a penny each. Now, I'm not saying many people bought that low and held on all the way. Let's say you invested only $100, then proceeded to eventually spend, give away*, and/or gamble away 95% of your long-term stash. Now you have only 5% of your original amount left.  *(people were extremely generous back then, and no crime here either) 200BTC/$ * $5 = $1,000BTC! If you where one of the lucky people to sell near the current all-time high how much would you have made?Even at \"only $20k/BTC\" :::: 1,000BTC * $20,000  = $20,000,000! If my math is off, please let me know. At 200btc/$ every One Dollar turned into 4 Million, you do not see that many times in your lifetime, but that is what actually happened with Bitcoin. At $40k that same person has $40,000,000 today, and near the all-time high you are looking at $70 Million coming from only 5% of a $100 investment.We can all see there is often an \"high - sometimes insane - level of greed\" in this community. People are often trying to find the next thing which will produce huge profits. One reason I Love the old threads in this forum is the way people helped each other \"figure out the hard stuff\" with no motive of short-term profits. The alpaca socks kidOne more early Bitcoin milestone, related to internet eCommerce was the alpaca socks kid. This guy's parents owned a small farm and made alpaca socks. He talked his parents into accepting BTC. That family is so rich now, they probably had to relocate to someplace they \"were not so famous.\" History class in school can be really boring, but BTC history is amazing! Have a great night. Thomas-Soellner/Getty ImagesOne great thing about this forum is the really old threads, have you ever studied/looked at any? Wow, that trip down Bitcoin's memory lane is wild, isn't it? I remember hearing about that 300 BTC/dollar deal and just thinking, \"Wow, we've come a long way.\" The whole Bitcoin Pizza Day thing always blows my mind. Imagine if you'd held onto just a fraction of those coins!And yeah, those old threads are gold mines of info and nostalgia. It's crazy to think about how generous and experimental everyone was back then, just giving away and trading Bitcoin like it was nothing. That story about the alpaca socks kid is a classic. It's like everyone back then who took a chance on BTC turned into accidental millionaires!Your math on the investment gains is spot-on and absolutely mind-boggling. It's like the ultimate 'what if' scenario for anyone who's ever kicked themselves for not getting into Bitcoin sooner. And it’s a reminder of how crazy and unpredictable the crypto world can be. Makes you wonder what the next big thing could be, right?Anyway, it's cool to see someone else who appreciates the wild history of Bitcoin. Makes for way more interesting stories than any history class I've ever taken! Have a great one yourself! 🌙✨",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yhiaali3",
      "created_time": "December 17, 2023, 02:42:33 AM",
      "body": "I love reading old topics about Bitcoin, in those beautiful days when the price of Bitcoin was very low and mining was very easy, but those days have passed and precious opportunities are rarely repeated.It is not just about buying Bitcoin at a very cheap price in those days but about holding Bitcoin to the peak time. Many people bought Bitcoin at a cheap price at that time but very few have hold it until now because most of them were not believers or did not expect the price to reach this level one day.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Darker45",
      "created_time": "December 17, 2023, 03:43:42 AM",
      "body": "I love reading old threads, but I probably love more interacting with an OG, somebody who was actually there during those good old times. So, so much about those old days with other people. How about those old times with yourself, OP? You're probably a piece of history yourself. I assume you got to know Bitcoin way before you came to this forum. You were certainly a part of the community already back when it was so small, when the price per coin was not even a dollar. When you came here more than 10 years ago, you were already talking about trading. You probably knew Bitcoin a lot already. So I suppose you've also got a beautiful story to share.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ale88",
      "created_time": "December 17, 2023, 04:13:38 AM",
      "body": "Quote from: joniboini on December 12, 2023, 02:04:37 AMQuote from: Casdinyard on December 11, 2023, 03:50:41 PMWay back then bitcoin had value already, it's not going to be called currency in the first place if it weren't. It just so happened that its value shot up quicker than one would expect and now here we are, reaping the benefits. I believe nobody expects Bitcoin to ever reach $10k per coin and beyond though. I remember reading old threads and social media posts, saying that $100 per Bitcoin is way too good already and people should sell their funds quickly.It was a completely different situation back then: the average person would have hundreds if not thousand of bitcoins so if you sell 1,000 BTC at $100 it's $100k, and if you got those BTC almost for free, or maybe you even mined them, I mean, those are big money, especially because I guess the average age of the bitcoiner was pretty low, probably many of them were students or people who recently started their first job. Maybe in 20 years we'll look back at the people who during these years sold 1-10 BTC for $50k the same way we're doing now with that people.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}