{
  "id": "topic_5465851",
  "title": "_act_",
  "author": "_act_",
  "created_time": "September 06, 2023, 11:57:12 AM",
  "content": "We can see how traditional banking has helped in creating employment. Many people are employed in the banks. The banks and their employees are paying taxes.I read this today: CBDCs will gradually displace private banks, says Russian lawmakerIt is about a Russian lawmaker that believes CBDCs will gradually displace fiat and traditional banking.Can this be what would later happen?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5465851",
  "comments": [
    {
      "author": "coupable",
      "created_time": "September 06, 2023, 12:21:51 PM",
      "body": "In the best-case scenario, this will happen decades from now because it is not logical at all to think about changing the traditional banking system in our world today, which is still governed by banks and major financial institutions.CBDC coins are a new form of digital copy of fiat money, and their issuance is like the issuance of script money that is supposed to have a cash reserve from which to derive its value. It is expected that the matter will become dangerous if banks succeed in issuing their own CBDC currencies, because this will create unhelpful diversification in the market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MusaMohamed",
      "created_time": "September 06, 2023, 01:29:52 PM",
      "body": "Quote from: _act_ on September 06, 2023, 11:57:12 AMWe can see how traditional banking has helped in creating employment. Many people are employed in the banks. The banks and their employees are paying taxes.Central banks are tools of governments to create more inflation. Banks can create more jobs but can cause unemployment too. When bank system has serious problems with many banks go bankruptcies, a national economy will be affected a lot. You will not be able to say banks are creating more jobs in that economic chaos.QuoteIt is about a Russian lawmaker that believes CBDCs will gradually displace fiat and traditional banking.If they want, they will do this. Simply because CBDC is created by government and if they want to end lifespan of their fiat currency, they can do this. However, there are many factors to consider because if the whole world still use fiat currencies, only Russia will not want to quarantine themselves from global system. Even the Russia invasion in Ukraine changed a lot of things in their economy and bank system.Russian Federation Digital Rubble progress.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dunamisx",
      "created_time": "September 06, 2023, 01:36:45 PM",
      "body": "Quote from: _act_ on September 06, 2023, 11:57:12 AMWe can see how traditional banking has helped in creating employment. Many people are employed in the banks. The banks and their employees are paying taxes.I read this today: CBDCs will gradually displace private banks, says Russian lawmakerIt is about a Russian lawmaker that believes CBDCs will gradually displace fiat and traditional banking.Can this be what would later happen?There's likely possibilities that digital currency will take over the traditional fiat note with time but am not sure this is going to happen with CBDC because that's not the answer to the people's request, what they want is not a digital fiat currency which is also centralized but a decentralized network that would place the users priority first in using the monetary system and grant what they want, i also see that CBDC will rather render some people unemployed since most of the work force needed in fiat currency hard notes are done in physical appearance while and digital currency like CBDC will make many of them looses their job since everything is mostly programmed on the digital network and there's no dealings with fiat notes for us in making transaction as before.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "September 06, 2023, 01:40:03 PM",
      "body": "Quote from: _act_ on September 06, 2023, 11:57:12 AMWe can see how traditional banking has helped in creating employment. Many people are employed in the banks. The banks and their employees are paying taxes.I read this today: CBDCs will gradually displace private banks, says Russian lawmakerIt is about a Russian lawmaker that believes CBDCs will gradually displace fiat and traditional banking.Can this be what would later happen?I think one of the reasons why cbdc won't have a significant adoption in the economy is because nobody (even government) wants a banking and financial system crisis.Cbdc has the potential to displaced banks. But governments won't allow that, because nobody wants that to happen.Maybe in dictatorships like China and Cuba (maybe russia) we see more adoption, but I personally don't think cbdc will go very Farr in democracies..",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Juse14",
      "created_time": "September 06, 2023, 02:02:10 PM",
      "body": "I strongly believe that what is the discussion is about business competition and the community will prefer effective and efficient products, as well as small cases such as public transportation or taxis which drivers will wait in a place that has been provided in the pickup, but the day This uses an application to make a call to a taxi without going through a particular agent or company, other cases such as, the sender of every person in ancient times did communication by writing sentences on paper and at that time there were also many workers sending letters to send the number of letters at that time But as it went on at that time it turned out because there were products that could send letters or communicate using telepone homes and to this day using mobile phones, there were certainly many people who lost their jobs when all customers had switched to new products that were more effective and efficient at that time.The name of the development of the era must be left behind somthing, I cannot deny it because that is the fact, and every development gives birth to new opportunities, so in the mechanism humans must continue to adapt to something new.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Davidvictorson",
      "created_time": "September 06, 2023, 02:24:11 PM",
      "body": "The answer to this question is NoBanks are not going anywhere. They have been here for centuries and they will continue to be here. What we would witness is an evolution of the fiat and traditional banking to match the latest technological trend. Aside this nothing else. However, what would happen during that time is an increase in cybersecurity attacks on CBDCs owners.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jrrsparkles",
      "created_time": "September 06, 2023, 02:34:14 PM",
      "body": "Even without CBDC the banking system is going to cut loose their employees sooner or later due to the technology developments and in my opinion, banks are already paying their employees for nothing since most of the things are automated and the employees are just doing more than nothing.Unemployment is not happening due to the CBDC, we already know Facebook, twitter, Google, and a lot of others laid off their employees this year but it doesn't mean they can't find jobs anywhere. It just act as a reminder that there will be no such thing called job security in future, if employee fails to meet the high standards then the employer will replace them with better person or a technology so as an individual we need to keep ourselves updated with skills and knowledge to survive in the completetive world.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jawhead999",
      "created_time": "September 06, 2023, 02:40:40 PM",
      "body": "@OP the link of the news you use are broken, replace with this one https://www.bitcoininsider.org/article/225632/cbdcs-will-gradually-displace-private-banks-says-russian-lawmakerCBDCs aren't created for unemployment purpose, if private banks are replacing the traditional or conventional banks, do you think all of employment who're work on conventional banks don't have to work anymore? it's just only replacing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "passwordnow",
      "created_time": "September 06, 2023, 03:22:31 PM",
      "body": "I'll compare this to the feeling that most of us got when we first met Bitcoin/crypto. The thought of it replacing the traditional banking system was intense and there. However, upon realizing that it's hard to replace the traditional banking system, there were thoughts and ideas that we share about it being co-existing. There could be new technologies that the banks will meet but they can remain to the traditional system that they can and stay as is. Or, if the trend and new emerging technologies are fairly beneficial to their business, that's possible to happen and we still don't know if this applicable with CBDCs, maybe it is and maybe not.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sayeds56",
      "created_time": "September 06, 2023, 03:31:42 PM",
      "body": "Quote from: _act_ on September 06, 2023, 11:57:12 AMWe can see how traditional banking has helped in creating employment. Many people are employed in the banks. The banks and their employees are paying taxes.I read this today: CBDCs will gradually displace private banks, says Russian lawmakerIt is about a Russian lawmaker that believes CBDCs will gradually displace fiat and traditional banking.Can this be what would later happen?I think it would be premature to conclude that Central Bank Digital Currencies (CDBC) could potentially replace the traditional banking system, considering that it is still in development stage and many crucial details are yet to be revealed The future of CDBC will depend on may factors, such as technological developments, regulatory decisions, public acceptance and the choices made by individual countries. There is strong possibility that both systems, traditional banking and CDBC will coexist in the financial system.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Free Market Capitalist",
      "created_time": "September 06, 2023, 03:40:01 PM",
      "body": "Quote from: Jawhead999 on September 06, 2023, 02:40:40 PM@OP the link of the news you use are broken, replace with this one https://www.bitcoininsider.org/article/225632/cbdcs-will-gradually-displace-private-banks-says-russian-lawmakerCBDCs aren't created for unemployment purpose, if private banks are replacing the traditional or conventional banks, do you think all of employment who're work on conventional banks don't have to work anymore? it's just only replacing.I totally agree with that (also that the OP has to change the link). CBDCs eliminate the need for bank employment, and thus will cause unemployment, and not the opposite, which is what the title states. What happens is that the socialist politicians do not like this and what they are going to do is to maintain banking jobs that are not needed with CBDCs artificially so that these jobs are not lost. At least in the first stages, in the same way that jobs were maintained in mining or other sectors with strong unions, but over time traditional banking will gradually change until it has nothing to do with what it is today.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rat03gopoh",
      "created_time": "September 06, 2023, 03:47:20 PM",
      "body": "A visible example, over the decades since the advent of ATM machines, the role of bank tellers has been replaced by those machines. But to this day I can still see tellers at nearby banks to serve me.Banking will not be that simple to remove, I also believe that banks also provide a lot of income to the country. CBDC will be given limited characteristics where you'll need a role of the bank to solve those limits.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "September 06, 2023, 04:00:16 PM",
      "body": "Quote from: Poker Player on September 06, 2023, 03:40:01 PMCBDCs eliminate the need for bank employment, and thus will cause unemployment, and not the opposite, which is what the title states. What happens is that the socialist politicians do not like this and what they are going to do is to maintain banking jobs that are not needed with CBDCs artificially so that these jobs are not lost. No, they won't.Automated teller machines and banking apps have killed most of what CBDC could have erased, the rest of the jobs in banks can't be replaced by any blockchain. You need support, you need credit approvals, you need a ton of other services, you need managers for private funds and pensions funds, what will be replaced completely will be the cash to digital cash flow, the rest will still be as before.I can tell you for sure, directly from the source, ING has killed around 30 local branches here,  but despite laying off over one thousand in that department they've hired an extra 200 for their other services.Banks will keep working with CDBC just as they did with digital $ or euro, nothing will change for them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tjtonmoy",
      "created_time": "September 06, 2023, 04:37:59 PM",
      "body": "People will always try to blame their faults on others. Why do you think people keep money in banks? For the interest? That's too low to count for. Safety? What about bankruptcy? People do know this and they still keep money in banks. So that if anything happens, they can blame that on banks. CBDC is just another version of regular fiat money. The central bank will still control it and they will need people to do it. There will still be people who won't be able to use CBDC. Those who lack knowledge of technology will need help. I guess more people with technological knowledge will be employed. Some may lose jobs but that depends on how they will operate. That's a thing to worry about in the future.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Spaceman1000$",
      "created_time": "September 06, 2023, 04:50:50 PM",
      "body": "Government of various nations are having their own CBDCs currency, the whole thing is that the those coins are Government controlled. If this CBDCs are that reliable, just maybe that can replace fiat but it won't be that easy because CBDCs are not that used currently.Don't be surprised that commercial Banks might still find a loophole to be at the centre of attraction if this concept is fully optimize.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Iroh",
      "created_time": "September 06, 2023, 05:32:09 PM",
      "body": "CBDCs, whenever it’s implemented won’t be taking away jobs in the banking sector. It would be replacing the traditional paper money system but banks would still require personnel for all sorts of duties to enable the bank work smoothly. ATMs and online banking services would have taken the cashiers job in the bank but cashiers are still with a job. There would always be people working for the banks and CBDCs being implemented in the near/far future won’t change much. I also think if/when CBDCs are implemented for use, paper money won’t be totally eliminated and may still be used alongside.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mahanton",
      "created_time": "September 06, 2023, 05:41:20 PM",
      "body": "Quote from: _act_ on September 06, 2023, 11:57:12 AMWe can see how traditional banking has helped in creating employment. Many people are employed in the banks. The banks and their employees are paying taxes.I read this today: CBDCs will gradually displace private banks, says Russian lawmakerIt is about a Russian lawmaker that believes CBDCs will gradually displace fiat and traditional banking.Can this be what would later happen?CBDC's would displace fiat and traditional banking? Come in mind on where these cbdc's really be that getting their value into? which is on fiat itself and come or bare in mind on where these CBDC's would really be that allowed to be used? Of course it would really be that relevant and be considered by banks since its heavily regulated and centralized which means that it is really that totally contradictory if we do speak about on going against or trying out to erase these two things on its existence which it is really just that too impossible. Banks and fiat would really be that remaining no matter what this world could happen.CBDC's could really not able to exist or having that relevance but with those traditional things been mentioned then it is really just that hard to believe on that it would be eradicated.As long that government would exist then it cant really just that let these things to happen. It would really be remaining still and would really be staying up and would really be entirely be that existing through ages.There's nothing we can do and if there would be some adjustments and new innovations then it could be simply applied and recognized but doesnt mean that it would really be totally replacing those things which we know that its really that heavily backed up.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "avikz",
      "created_time": "September 06, 2023, 05:58:47 PM",
      "body": "Quote from: _act_ on September 06, 2023, 11:57:12 AMWe can see how traditional banking has helped in creating employment. Many people are employed in the banks. The banks and their employees are paying taxes.I read this today: CBDCs will gradually displace private banks, says Russian lawmakerIt is about a Russian lawmaker that believes CBDCs will gradually displace fiat and traditional banking.Can this be what would later happen?Traditional banking will never go obsolete! They are the pillars of the society. If banking system collapses, the social structure will also collapse. So any government will not take the risk to replace traditional banking using any means. CBDC is here to reduce the cost of the government as well as it is an exceptional surveillance tool. If fiat is replaced, it will become extremely difficult for anyone to not pay tax. There are definite benefits of using CBDC from the perspective of the government. Banking will never collapse, ever. It will go up and down but never get eradicated.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gozie51",
      "created_time": "September 06, 2023, 06:21:18 PM",
      "body": "Well that looks like the face value or literal conclusion of it that CBDC could phase out fiat and banks, I could be tempted to move towards that allusion but what about the influence of government and control they always want to have on the economy majorly through financial and payment platforms which is fiat and not crypto. So government won't give such leverage for digital currency to take over entirely. Therefore, the banks are going nowhere but we could have reduced staffs at the time CBDC is fully implemented.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}