{
  "id": "topic_5477098",
  "title": "jerry0",
  "author": "jerry0",
  "created_time": "December 08, 2023, 08:45:14 PM",
  "content": "I'm curious about this.  For the people who are long term holders of btc and they either never sold any btc to coinbase to convert to fiat and just holding it until btc hits their price target, do people like that not cash out big amounts at once when they are ready to sell?  Imagine someone who is a long term holder of btc and they either never sold any btc to fiat or sold only a tiny amount and then transferred it to their US bank account.But then btc hits a huge price and now they want to sell a good portion of it.  Well if you are a coinbase customer for a while but you never cashed out any btc or only traded small amounts, isn't there going to be an issue if someone was to send some btc from their hardware wallet or trustwallet or electrum to it and then trade it for usd and then cashout?  Like imagine someone goes to transfer 1 btc to their coinbase account when their biggest btc transfer could been only $2000 worth from back then.  Then they convert it all to usd.  Then they do an ACH bank transfer to their US bank account or a bank wire transfer.  Isn't coinbase or whatever exchange they are using might ask them questions like how did you acquire this much of BTC for someone who never transferred this much btc to their wallet before?  And even if they did, they never ever sold it to usd so that would be deemed strange to them?  Or imagine someone who have 1 million dollars worth of btc now in their wallet and they want to send it to coinbase to cash out.  But their biggest transfer to coinbase could been $2000 worth at the most or even $50 even.  And say the biggest amount they ever sold or converted btc to or from could be something like $25 only.  Wouldn't that person who wants to convert their btc to cash and then to their US bank account have to be careful to not send too much btc at once or trade too much at once or send an ACH or wire transfer back to their US bank account at once because coinbase or the exchange they could have an account in for years but never or rarely use it could flag them?  This is all assuming this person's btc is legitimate.  Would coinbase ask prove of your crypto in situations like this if they suspect something fishy?  However, couldn't they just check the blockchain and then there would be no issue?  The one issue here seem to be if you have lot of btc from back then or even now and want to cash out and never sent this amount of btc to coinbase before or sold this amount before, then you should do small amounts first and then go higher?  The thing is if these were the same amount or similar amount of btc you bought from coinbase many years ago and you had sent this to a hardware wallet or trustwallet or electrum, well obviously it wouldn't be fishy to them.  But if these coins are from where you acquired it from somewhere else and now sending it to coinbase to cashout and it's legitimate coins, does one need to be careful not to send to much or sell too much at once?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5477098",
  "comments": [
    {
      "author": "serveria.com",
      "created_time": "December 08, 2023, 10:56:52 PM",
      "body": "Quote from: jerry0 on December 08, 2023, 08:45:14 PMI'm curious about this.  For the people who are long term holders of btc and they either never sold any btc to coinbase to convert to fiat and just holding it until btc hits their price target, do people like that not cash out big amounts at once when they are ready to sell?  Imagine someone who is a long term holder of btc and they either never sold any btc to fiat or sold only a tiny amount and then transferred it to their US bank account.But then btc hits a huge price and now they want to sell a good portion of it.  Well if you are a coinbase customer for a while but you never cashed out any btc or only traded small amounts, isn't there going to be an issue if someone was to send some btc from their hardware wallet or trustwallet or electrum to it and then trade it for usd and then cashout?  Like imagine someone goes to transfer 1 btc to their coinbase account when their biggest btc transfer could been only $2000 worth from back then.  Then they convert it all to usd.  Then they do an ACH bank transfer to their US bank account or a bank wire transfer.  Isn't coinbase or whatever exchange they are using might ask them questions like how did you acquire this much of BTC for someone who never transferred this much btc to their wallet before?  And even if they did, they never ever sold it to usd so that would be deemed strange to them?  Or imagine someone who have 1 million dollars worth of btc now in their wallet and they want to send it to coinbase to cash out.  But their biggest transfer to coinbase could been $2000 worth at the most or even $50 even.  And say the biggest amount they ever sold or converted btc to or from could be something like $25 only.  Wouldn't that person who wants to convert their btc to cash and then to their US bank account have to be careful to not send too much btc at once or trade too much at once or send an ACH or wire transfer back to their US bank account at once because coinbase or the exchange they could have an account in for years but never or rarely use it could flag them?  This is all assuming this person's btc is legitimate.  Would coinbase ask prove of your crypto in situations like this if they suspect something fishy?  However, couldn't they just check the blockchain and then there would be no issue?  The one issue here seem to be if you have lot of btc from back then or even now and want to cash out and never sent this amount of btc to coinbase before or sold this amount before, then you should do small amounts first and then go higher?  The thing is if these were the same amount or similar amount of btc you bought from coinbase many years ago and you had sent this to a hardware wallet or trustwallet or electrum, well obviously it wouldn't be fishy to them.  But if these coins are from where you acquired it from somewhere else and now sending it to coinbase to cashout and it's legitimate coins, does one need to be careful not to send to much or sell too much at once? Exchanges are going crazy with their withdrawal rules and limitations. If your have large enough amount of BTC your should perhaps consider selling it OTC way? Here's an article which can be helpful: https://cryptonews.com/exclusives/otc-bitcoin-brokers.htm",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husires",
      "created_time": "December 09, 2023, 04:25:11 PM",
      "body": "CEXs give additional restrictions if your account performs a sudden operation, such as suddenly depositing a large amount or withdrawing an unusual amount, but they often ask you for more data, such as the source of the funds or re-verifying your previous data, especially if you request a 2FA change or attempt to withdraw with a different IP address.as long as your amounts are within the range of $50,000 and you trade less than $500,000 per month, you can ask and inform the support team before depositing. As for larger amounts, it is better to go to OTC.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "December 09, 2023, 04:44:03 PM",
      "body": "It's very possible, and it's definitely happening. The United States is pretty tight when it comes to financial regulations and AML/KYC so these things are to be expected. There's a reason why a lot of people here recommend P2P exchanges, so the cash transfer is going to come from a person's bank account, not Coinbase or whatever centralized exchange.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "348Judah",
      "created_time": "December 09, 2023, 04:56:33 PM",
      "body": "Quote from: jerry0 on December 08, 2023, 08:45:14 PMI'm curious about this.  For the people who are long term holders of btc and they either never sold any btc to coinbase to convert to fiat and just holding it until btc hits their price target, do people like that not cash out big amounts at once when they are ready to sell?  Imagine someone who is a long term holder of btc and they either never sold any btc to fiat or sold only a tiny amount and then transferred it to their US bank account.Bitcoin holders or whales to say are very smart enough not to use the exchanges for their holdings, they are not the kind that will needed to make use of an exchange to sell little bit by bit for their sustainability, they are Investing for real with huge sum of money that can be used for an established enterprise and invest, this their asset can only be moved from one wallet to another, they can also decided to sell some oart of it if not all at the same time to avoid being suspected for money laundering when such amount bounce into their account, they pretty know the kind of bank account they use, how they exchange their asset as well as where they store them.This first aspect of the questions is good enough in explaining your intended questions as a summary than the other side of the long story.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TimeTeller",
      "created_time": "December 09, 2023, 06:25:20 PM",
      "body": "Quote from: 348Judah on December 09, 2023, 04:56:33 PMQuote from: jerry0 on December 08, 2023, 08:45:14 PMI'm curious about this.  For the people who are long term holders of btc and they either never sold any btc to coinbase to convert to fiat and just holding it until btc hits their price target, do people like that not cash out big amounts at once when they are ready to sell?  Imagine someone who is a long term holder of btc and they either never sold any btc to fiat or sold only a tiny amount and then transferred it to their US bank account.Bitcoin holders or whales to say are very smart enough not to use the exchanges for their holdings, they are not the kind that will needed to make use of an exchange to sell little bit by bit for their sustainability, they are Investing for real with huge sum of money that can be used for an established enterprise and invest, this their asset can only be moved from one wallet to another, they can also decided to sell some oart of it if not all at the same time to avoid being suspected for money laundering when such amount bounce into their account, they pretty know the kind of bank account they use, how they exchange their asset as well as where they store them.This first aspect of the questions is good enough in explaining your intended questions as a summary than the other side of the long story.I can agree that these large bitcoin holders won't put themselves in a compromised situation. If they have been here for so long along with their stash, definitely, they know the possible repercussions if they will sell their large amount of coins.So they would only unload small amount and maybe, spread it in various trading platforms, they can even employ other family members so the KYC is not entirely provided by the holder.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Renampun",
      "created_time": "December 09, 2023, 06:49:40 PM",
      "body": "That might happen, and that's why long-term investors usually use P2P systems to exchange their Bitcoins because they are worried that they will be subject to KYC and other hassles just to sell the Bitcoins they hold on a centralized exchange. Or they can sell at a smaller value on some exchange platforms that do not impose KYC on their users, although it is more complicated and time consuming, but this is not too much of a problem.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jerry0",
      "created_time": "December 09, 2023, 07:11:16 PM",
      "body": "What are the otc and p2p you are talking about here?So anyone that is from the US who finally wants to cashout their btc and they been holding it for a long time and say even though they might have cashed out an exchange, if say it could be small amounts only like 3 figures or so, they should never send 5 figures at once correct?  I always wondered like imagine someone who just wants to cash a lot of btc like say it could be 6 figures but either they never cashed that amount on coinbase or kraken or whatnot and if they have to do smaller amounts first.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BIT-BENDER",
      "created_time": "December 09, 2023, 07:20:57 PM",
      "body": "Well good question but Crypto-currency is not like your regular banking system where all your moves is questioned and many time there is an amount of your money you requested for that the bank won't give out to you.Firstly using a centralized exchange has it's risks, this exchange can at any time freeze your funds if they discovered there is any issues, on centralized exchanges you aren't in full ownership of your funds but $2000 isn't the type of amount to get issues using an exchange like Coinbase you may have the issue when you are receiving Fiat for the Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "wallet4bitcoin",
      "created_time": "December 09, 2023, 09:54:25 PM",
      "body": "Quote from: mk4 on December 09, 2023, 04:44:03 PMIt's very possible, and it's definitely happening. The United States is pretty tight when it comes to financial regulations and AML/KYC so these things are to be expected. There's a reason why a lot of people here recommend P2P exchanges, so the cash transfer is going to come from a person's bank account, not Coinbase or whatever centralized exchange.It's gradually becoming the norms. Financial institutions in the US are actually the ones grinding the institutional finance patronage of US citizens and residents to a halt. When people finally understand the possibility of boycotting these financial institutions via p2p system, I just hope regulators learn to enjoy the process.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "wallet4bitcoin",
      "created_time": "December 09, 2023, 09:55:25 PM",
      "body": "Delete",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jerry0",
      "created_time": "March 05, 2024, 10:41:03 AM",
      "body": "So what happens if people who are long term holders start cashing out decent amounts of btc in exchanges like coinbase or gemini or kraken?  Thus they send the btc from their wallet to their exchange account and then sell and these are for big amounts or amounts?  Now whether they kept their btc in their hardware wallet or electrum for a long time, there should be no issue right? The thing is with btc price going up so much, well what happens if someone wants to sell an amount that is like 5 or even 6 figures worth of usd on coinbase or gemini or kraken?  Like imagine someone that trades btc for fiat and vice versa for hundreds of dollars but never sold for a long time because they just hold.  But now they want to sell a lot of btc that could be 5 figures worth of usd or even higher.  Do they have to be concerned if the exchanges freeze their account because they have never done a transaction like that before?  The thing is if someone is a long term holder, well they will have a good amount of btc etc.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joniboini",
      "created_time": "March 05, 2024, 10:46:29 AM",
      "body": "Well either they need to do additional KYC, or they can request OTC trades so that their trading doesn't affect the spot market directly. If they want to do KYC they'd need to fulfill various documents, and I'm sure no exchange will allow you to trade 6 figures without doing any KYC/AML check. Most non-KYC exchanges that I've ever used and know of have a much lower limit after all. He can also simply sell it in batches if they don't want to trigger any flags on the platform that he uses. I'm sure most of those big holders are aware of the risk and would rather do that tbh, unless he has reliable OTC access. CMIIW.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jerry0",
      "created_time": "March 05, 2024, 11:12:11 AM",
      "body": "So if your coinbase and gemini and kraken account has already been verified, that isn't enough correct?  So that would be additional KYC?   The thing is if you are someone who bought from coinbase a long time ago when it was very low price and now sending btc to coinbase to sell, well they would have a history of you buying it from them years ago correct? Thus they wouldn't ask you KYC?However, if you were someone that got btc years ago like from a gambling website or things like that or how some people get paid in btc, that would be completely different then right?  They would ask you for your occupation and things like that correct?   But what if you earned btc years ago from surveys from years ago or gambling website or got paid in btc years ago when btc price is low?  You tell them that and show them a screenshot of the wallet?  They could easily verify this on the blockchain right so they probably don't even need more information?  The thing is with how much btc price is going up, someone who is holding a long time could have 5 btc or even more etc.  So say btc price goes to 100k.  Now say that person wants to sell 2 btc.  That person should never send 2 btc at once to their coinbase or gemini or kraken account correct?  Or that amount doesn't matter... it's the amount of btc to usd one sell each time?  Also that person probably doesn't want to send 0.1 btc once so many times because of the btc sending fees and because they might want to sell a set amount at a certain price. So that person should just send smaller amounts of btc to coinbase and sell it each time to build history then?  Or that person could send 2 btc to coinbase at once but then sell smaller amounts each time?  Like 0.1 btc one week, then a bit more the next week etc?  Then again that person doesn't want to do smaller amounts because if they do that, the price might go lower and they probably don't want to sell for less than the amount they want.  So what happens there?  So people who are long term holders and have their btc in their hardware wallet or software wallet and finally sends the btc to an exchange like coinbase or gemini or kraken and wants to sell 6 figures worth of btc is for sure going to get KYC?  There is nothing wrong with getting KYC but obviously that person rather get KYC when they send 0.1 btc to the exchange compared to say 2 btc etc.f",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "passwordnow",
      "created_time": "March 05, 2024, 11:18:47 AM",
      "body": "Quote from: jerry0 on March 05, 2024, 11:12:11 AMSo if your coinbase and gemini and kraken account has already been verified, that isn't enough correct?  So that would be additional KYC? I don't use them but you check your limit based on the KYC that you've provided to them. Each exchange has their own limits based on the level that your account is eligible. But typically, the more you comply with their kyc, the higher limits that they're going to provide but still, you might even be asked for your withdrawal if they're going to be quite high. That means that there's no assurance that they'll just let you go easily if you cash out big from them because they might question you out of nowhere and might halt the transaction that you're doing.Quote from: joniboini on March 05, 2024, 10:46:29 AMHe can also simply sell it in batches if they don't want to trigger any flags on the platform that he uses. This is what I am planning to do if ever I start selling. I wouldn't do big sums of withdrawals but will do it in batches because usually, it's not just the exchange that will be triggered with these withdrawals that aren't normal to our accounts but also the bank accounts where you'll withdraw that money.Quote from: joniboini on March 05, 2024, 10:46:29 AMI'm sure most of those big holders are aware of the risk and would rather do that tbh, unless he has reliable OTC access. CMIIW.I know some good OTC markets but they are also requiring KYC and they're like an exchange as well with levels depending on the documents you'd provide for them. This is on my area, I have no idea for the others.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "barto123",
      "created_time": "March 05, 2024, 11:21:19 AM",
      "body": "Always go the non-KYC route. Blockchain is forever, you may regret it in the future as the digital surveillance system comes online.Personally I coinjoin then swap/atomic swap to Monero. Then exit with a P2P trade to fiat using Bisq, Basicswap, Localmonero/Agoradesk",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sunderland",
      "created_time": "March 05, 2024, 11:28:13 AM",
      "body": "Quote from: jerry0 on March 05, 2024, 10:41:03 AMSo what happens if people who are long term holders start cashing out decent amounts of btc in exchanges like coinbase or gemini or kraken?  Thus they send the btc from their wallet to their exchange account and then sell and these are for big amounts or amounts?  Now whether they kept their btc in their hardware wallet or electrum for a long time, there should be no issue right? The thing is with btc price going up so much, well what happens if someone wants to sell an amount that is like 5 or even 6 figures worth of usd on coinbase or gemini or kraken?  Like imagine someone that trades btc for fiat and vice versa for hundreds of dollars but never sold for a long time because they just hold.  But now they want to sell a lot of btc that could be 5 figures worth of usd or even higher.  Do they have to be concerned if the exchanges freeze their account because they have never done a transaction like that before?  The thing is if someone is a long term holder, well they will have a good amount of btc etc.Coinbase user able to apply a request to increase the withdrawal limit, after they agree about it then the user will be asked to provide additional documents.https://help.coinbase.com/en-au/coinbase/trading-and-funding/buying-selling-or-converting-crypto/limits-and-account-levelsTo withdraw 5 or 6 digits they must be asked for the source of funds or/and source of income to make sure the legality of the crypto you sell to them.Coinbase do not limit how much crypto you can sell but there is a withdrawal limit $100k limit per day.Someone ever asked how to wd $1M from coinbase on reddit, and the coinbase representative there answers like this:QuoteGiven the current limit of $100,000 per transaction, you would need to make 10 separate transactions to cash out $1 million. Please note that each transaction may be subject to fees as outlined in the context. It's always a good idea to plan your transactions ahead of time to ensure a smooth process.source: link",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jerry0",
      "created_time": "March 05, 2024, 11:33:00 AM",
      "body": "I recall coinbase and gemini showed daily and weekly and monthly limits.  I recall it was for deposits and withdrawals.  But what if you are sending btc from a hardware wallet or software wallet?  Surely there are limits for that?  Or it's only after your receive btc to your coinbase or gemini or kraken account, you might get flagged if you never received that much amount of btc at once?  Or it's only if you sell for fiat?Like if someone who never sold more than a few hundred dollars of crypto once wants to finally sell a good amount of btc they have kept in their hardware or software wallet and want to sell, then they shouldn't send more than 4 figures even if they never did that once?  The thing is in the example I'm using.  Say someone held btc for a while and say they have 5 btc.  They want to sell 2 btc.  Say btc is 100k.  Well even sending 0.1 btc would get account locked?  So how in the world do people who are long term holders who never sold able to cashout without issues then?  The big thing here is a person who never sold would rather have their account frozen on the exchange with say 0.1 btc as oppose to 2 btc.  So that person should never send that much btc at once to the exchange?  Now imagine btc goes to 1 million dollars.  Now that person can't send more than 0.01 btc before getting flagged/frozen?  The issue is getting questioned and KYC isn't an issue but obviously you don't want your balance on the exchange to be more than you want it to be when that happens because I heard when there is KYC, it could take a long time.So most people say you should do batches at once to build history then?  Why would anyone go to the non KYC route?  I'm confused with that route.  Don't most people go the regular KYC route?  Thus selling to coinbase, gemini or kraken?  Well as long as that person's btc is legit, why would one have to be concerned though?  In my example, I am talking about someone who is a long term holder of btc and their btc is legit and they earned it whether it could been from surveys, gambling or just being paid in btc etc.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jerry0",
      "created_time": "March 05, 2024, 11:39:30 AM",
      "body": "The limits thing is a bit confusing.  So someone could send 5 or 6 or even 7 figures worth of btc to their coinbase account without any issue at all?  It's only when they withdraw to their bank account is when they will get asked questions?  Or it's when they are selling for firat?   At first I thought if you send a lot of btc to your coinbase account, you would get your account locked and asked for more KYC.  So if someone wants to send their 5 btc balance from their hardware wallet to their coinbase account because they want to keep their btc in coinbase instead... is their account going to be locked because they never had that much money in their coinbase account?  Or it's only when they sell?  Or when they withdraw?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "temple",
      "created_time": "March 05, 2024, 12:55:42 PM",
      "body": "Quote from: jerry0 on March 05, 2024, 11:39:30 AMThe limits thing is a bit confusing.  So someone could send 5 or 6 or even 7 figures worth of btc to their coinbase account without any issue at all?  It's only when they withdraw to their bank account is when they will get asked questions?  Or it's when they are selling for firat?   At first I thought if you send a lot of btc to your coinbase account, you would get your account locked and asked for more KYC.  So if someone wants to send their 5 btc balance from their hardware wallet to their coinbase account because they want to keep their btc in coinbase instead... is their account going to be locked because they never had that much money in their coinbase account?  Or it's only when they sell?  Or when they withdraw?  I think you should consider this scenario from a more general perspective. I would assume that as soon as amounts are out of the ordinary for a certain customer, questions may be asked. But if you went through their full KYC process, there is not much reason for you to fear that your account gets locked unless the funds come from an address that has a suspicious transaction history. Does Coinbase ask for the origin of funds these days? If they do then that would be another reason for them to ask questions if you have usually been a low volume trader or HODLer and out of a sudden you are dealing with 6 or 7 figures. But this is no different with banks and Coinbase is pretty much a standard bank these days with all the regulations. If you have a normal bank account handling 4 or maybe 5 figures at times and then you send a few million to your bank account, be sure to be asked questions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}