{
  "id": "topic_5400481",
  "title": "Zlantann",
  "author": "Zlantann",
  "created_time": "May 28, 2022, 08:26:41 AMLast edit: May 28, 2022, 09:57:59 AM by Zlantann",
  "content": "El Salvador and Central African Republic are the two nations that have adopted Bitcoin as a legal tender. They have well established laws that gives inhabitants of these nations the freedom to pay taxes, debt and carryout other financial transaction using Bitcoin. Apart from other  challenges such as low internet connection, epileptic power supply, infrastructural deficits, poverty, etc, one of the major challenges to the success of Bitcoin adoption in this nations is lack of bitcoin education. Majority of the citizens of these nations lack basic knowledge of Bitcoin terms such as wallet, recovery phrases or a wallet’s public address. Some of them even know nothing about Bitcoin. For these nation to be successful as Bitcoin countries they need the assistance and partnership of key players in the Bitcoin industry such as cryptocurrency exchanges, payment processors, and wallet providers. But more importantly, they also need volunteers from Bitcoin Foundations and Nonprofit organizations that would engage in massive Bitcoin education of the nation’s population. If I have opportunity to be part of a volunteering team or organization I can give up-to four weeks free service in El Salvador or CAR. El Salvador and CAR are all positive additions to the Bitcoin community but much work needs to be done. If you have the opportunity, would you volunteer to teach Bitcoin education in El Salvador or Central African Republic?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5400481",
  "comments": [
    {
      "author": "noorman0",
      "created_time": "May 28, 2022, 08:42:23 AM",
      "body": "The question is, are special classes really needed in those countries? In fact bitcoin basic lessons are now easily accessible on the internet in their respective languages. Another problem if their government demands people to use bitcoin payment mechanism according to their rules like using certain wallets, they will prepare their own instructors with that.If you mean giving them a mental lesson in dealing with volatile markets and get-rich-quick schemes, it's possible. But I'm not so confident that I have mastered my mental well.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Alisha-k",
      "created_time": "May 28, 2022, 10:09:17 AM",
      "body": "What is the point teaching about bitcoin when the information on how to use, manage and own the digital decentralized currency is all over the internet. What this two countries should rather focus on should be strengthening their internet service and providing more Bitcoin ATM. Certainly once the begin to use the coin  they will want to know more about it",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jawhead999",
      "created_time": "May 28, 2022, 10:14:23 AM",
      "body": "When the countries already accept Bitcoin as a legal tender, obviously the president, business and medias already told or ask anyone to use Bitcoin. Obviously they will teach their citizens to use it, at least in simple way with his own wallet e.g. Chivo wallet in El Salvador. Some people who against Bitcoin and doesn't/can't use Bitcoin are mostly an old people or not interested.The best way to teach someone is when you're completely understand about it and can speak their local language, do you can speak Spanish, Sango or French? If you can only speak your own local and English, then it doesn't have any difference if they learn through internet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fortify",
      "created_time": "May 28, 2022, 12:30:26 PM",
      "body": "Quote from: Zlantann on May 28, 2022, 08:26:41 AMEl Salvador and Central African Republic are the two nations that have adopted Bitcoin as a legal tender. They have well established laws that gives inhabitants of these nations the freedom to pay taxes, debt and carryout other financial transaction using Bitcoin. Apart from other  challenges such as low internet connection, epileptic power supply, infrastructural deficits, poverty, etc, one of the major challenges to the success of Bitcoin adoption in this nations is lack of bitcoin education. Majority of the citizens of these nations lack basic knowledge of Bitcoin terms such as wallet, recovery phrases or a wallet’s public address. Some of them even know nothing about Bitcoin. For these nation to be successful as Bitcoin countries they need the assistance and partnership of key players in the Bitcoin industry such as cryptocurrency exchanges, payment processors, and wallet providers. But more importantly, they also need volunteers from Bitcoin Foundations and Nonprofit organizations that would engage in massive Bitcoin education of the nation’s population. If I have opportunity to be part of a volunteering team or organization I can give up-to four weeks free service in El Salvador or CAR. El Salvador and CAR are all positive additions to the Bitcoin community but much work needs to be done. If you have the opportunity, would you volunteer to teach Bitcoin education in El Salvador or Central African Republic? It doesn't actually make much sense. Part of the reason that these countries were able to adopt Bitcoin is they are relatively poor and had very little left to lose economically-speaking. I very much doubt that there is much incentive to enter these countries to teach such a niche topic, when it can easily be done via a few slides explained by existing teachers there. People who are truly interested in the tech will look into those topics and figure it out themselves, however the vast majority are unlikely to be interested in this cryptocurrency that they will likely not be able to afford in large amounts. The most knowledgeable people are likely to stay away from such countries as they might very well be a target for the small criminal elements within.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "May 28, 2022, 01:55:59 PM",
      "body": "Mass adoption will only happen if governments recognize Bitcoin as an official currency, then many people will think about buying for nothing but that it is legal.Therefore, it is currently difficult to help someone understand Bitcoin and he does not want to.Currently, all you can do is guide people who definitely want to invest, teach them the basics of saving your currencies, and then we can talk about Bitcoin as an investment.For El Salvador, I expect it will happen much faster once more middle-class people use Bitcoin, which is something that takes more time and patience than an educational culture.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dunamisx",
      "created_time": "May 28, 2022, 02:57:10 PM",
      "body": "Quote from: Zlantann on May 28, 2022, 08:26:41 AMMajority of the citizens of these nations lack basic knowledge of Bitcoin terms such as wallet, recovery phrases or a wallet’s public address. Some of them even know nothing about Bitcoin.i believe by now bitcoin knowledge in El-Savador is a thing of default by an average man and not untill it is mandatorily included in academic syllabus before the citizens can know the whereabouts, take a look at it this way, we easily get aquatinted to what we often see frequently, this can be regarded as unconscious learning, El-Savador bitcoin adoption is all over the nooks and crannies within the region and no one will point out a lack of knowledge about bitcoin, am not saying it education isn't good but with or without bitcoin been taught in El-Savador the citizens understands the whole logic behind it since bitcoin is the most common spoken word in action over the region and many make use of it to run their financial and economic lives. Quote from: Zlantann on May 28, 2022, 08:26:41 AMIf you have the opportunity, would you volunteer to teach Bitcoin education in El Salvador or Central African Republic?if such will be needed then i think it will be the responsibility of NGOs and bitcoin enthusiast who finds the satisfaction in reaching out on others about bitcoin and some little financial aid will be as well needed to make this a reality, but nevertheless, i think Central African Republic will be in need of this most than El-Savador when we consider the Involvement and experience after adoption they both had.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Don Pedro Dinero",
      "created_time": "May 28, 2022, 03:05:54 PM",
      "body": "I read the first post and basically thought what the first three answers said. Zlantann probably means well about volunteering, but I imagine that in those countries there is another type of volunteering that could be more useful for them. The information is on the internet. Nowadays, even in poor countries, people have a mobile phone with internet and can access information. Surely some kind of information has been given from governments as noorman says 0, so although I see good intentions, I don't think this will happen.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "palle11",
      "created_time": "May 28, 2022, 05:50:36 PM",
      "body": "Quote from: Zlantann on May 28, 2022, 08:26:41 AMIf you have the opportunity, would you volunteer to teach Bitcoin education in El Salvador or Central African Republic? This is very possible and a good thing to do to those who need the knowledge of bitcoin. It will attract more volunteers if the service is going to be paid for. The challenges of teaching and passing of knowledge to target users is still same challenge that is existing in those countries like bad network to mention a few. But right now I believe that these countries have taken a very bold step to give their people a choice for freedom.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zlantann",
      "created_time": "May 28, 2022, 06:36:37 PM",
      "body": "Quote from: Don Pedro Dinero on May 28, 2022, 03:05:54 PMI read the first post and basically thought what the first three answers said. Zlantann probably means well about volunteering, but I imagine that in those countries there is another type of volunteering that could be more useful for them. The information is on the internet. Nowadays, even in poor countries, people have a mobile phone with internet and can access information. Surely some kind of information has been given from governments as noorman says 0, so although I see good intentions, I don't think this will happen.Online learning has many advantages such as is accessible, affordable, flexible and can be access any time by learners but it has some pitfalls. It is prone to technical which would be the main problem with CAR that has a very low internet access. A country like CAR that has high illiteracy level and might not have the skills to access online learning, hence face-face learning might be the best. Practical knowledge might be difficult to pass through online learning especially when the target students have low computer education. These international volunteers can help train other national trainees that can reach more inhabitants. Recently a non-governmental organization;  Bitcoin Argentina in partnership with Paxful and Built With Bitcoin Foundation started a project to educate high school students on the importance of Bitcoin starting with 4,000 students across 40 schools.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kavelj22",
      "created_time": "May 28, 2022, 07:02:54 PM",
      "body": "Whether this is for El Salvador or Central Africa. We are talking about countries whose peoples do not even have anything to feed on and the country has a worn-out economy. What would the use of Bitcoin change in your opinion? Failed governments offer options in a kind of circumvention to evade the devaluation of the local currency, and we almost did not read about the position of those governments about their debts abroad and how they will pay them with Bitcoin. What happened in El Salvador was in the form of a black comedy where the government made a central wallet (forgot its name) and everyone who downloads it gets 30 dollars for free on his wallet, which made the majority of the people carry it and then get rid of it after spending the reward amount, and according to statistics, those who use this wallet It does not exceed 16% of those who download the wallet, which in turn represents the percentage of people who have received training to use Bitcoin. I recently read about protests against the use of Bitcoin in El Salvador.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Leviathan.007",
      "created_time": "June 01, 2022, 07:07:01 AM",
      "body": "Quote from: Zlantann on May 28, 2022, 08:26:41 AMIf you have the opportunity, would you volunteer to teach Bitcoin education in El Salvador or Central African Republic? I guess many people have an interest in teaching new technologies like bitcoin to other people and they enjoy it, talking about myself I'm also interested to teach about bitcoin and cryptocurrencies to people who are interested to learn about it because we can help them to get familiar with new technologies and change their economic lives, but in the other hand having a trip to El Salvador and Central African will not be easy and cheap for anyone in the other hand these countries are not really safe like the other europian counties, so I guess they can start teaching from the internet which can be a better option.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NeuroticFish",
      "created_time": "June 01, 2022, 07:14:16 AM",
      "body": "Quote from: Zlantann on May 28, 2022, 08:26:41 AMIf you have the opportunity, would you volunteer to teach Bitcoin education in El Salvador or Central African Republic? No.If you're young, if you have no family that relies on you then it's a great opportunity: you travel, you see new places, you meet new people, you work in a field with great future, you do what you like.But I'm not young and doing this would mean to either stay away from my family for (too) long, either get them with me, meaning also the children have to start school in another language.I guess that OP is young, but he should realize that this is quite a niche opportunity, it's great for some, but a clear no-go for most.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hydrogen",
      "created_time": "June 01, 2022, 11:38:42 PM",
      "body": "Quote from: Zlantann on May 28, 2022, 08:26:41 AMIf you have the opportunity, would you volunteer to teach Bitcoin education in El Salvador or Central African Republic? El salvador has beautiful beaches, a tropical climate and well developed tourist areas. There are many who would pay real money to vacation there much less travel and stay there as a volunteer. That could be a good opportunity for those who enjoy travelling, meeting new people and making connections. Regions of africa as well are beautiful and have wildlife preserves and good areas for tourists. I think most of bitcoin and blockchain is easy to understand using block diagrams and basic principles. The content is easier and has a lower learning curve than becoming fluent in a foreign language.The only thing that could make things dicey is COVID, travel restrictions, inflation and economic crisis. Crime is on the rise in many areas and tourists are usually a prime target considering they carry a lot of funds on them for emergencies.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "South Park",
      "created_time": "June 02, 2022, 01:03:30 AM",
      "body": "Quote from: Zlantann on May 28, 2022, 08:26:41 AMEl Salvador and Central African Republic are the two nations that have adopted Bitcoin as a legal tender. They have well established laws that gives inhabitants of these nations the freedom to pay taxes, debt and carryout other financial transaction using Bitcoin. Apart from other  challenges such as low internet connection, epileptic power supply, infrastructural deficits, poverty, etc, one of the major challenges to the success of Bitcoin adoption in this nations is lack of bitcoin education. Majority of the citizens of these nations lack basic knowledge of Bitcoin terms such as wallet, recovery phrases or a wallet’s public address. Some of them even know nothing about Bitcoin. For these nation to be successful as Bitcoin countries they need the assistance and partnership of key players in the Bitcoin industry such as cryptocurrency exchanges, payment processors, and wallet providers. But more importantly, they also need volunteers from Bitcoin Foundations and Nonprofit organizations that would engage in massive Bitcoin education of the nation’s population. If I have opportunity to be part of a volunteering team or organization I can give up-to four weeks free service in El Salvador or CAR. El Salvador and CAR are all positive additions to the Bitcoin community but much work needs to be done. If you have the opportunity, would you volunteer to teach Bitcoin education in El Salvador or Central African Republic? I feel it would be way more efficient to just create a series of videos explaining with the most simple language possible about the virtues of bitcoin and why it makes sense to use it and then reproduce those videos over and over again, while this would not allow those which are learning more about bitcoin to have feedback, this will allow to disseminate bitcoin education way faster and cheaper than any other method, so it makes more sense for me for things to be this way.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Darker45",
      "created_time": "June 02, 2022, 02:47:05 AM",
      "body": "I would, who wouldn't? That is, if I really have something to offer. But since I've only got the basics, I'd rather not present myself. But I don't think the main problem is Bitcoin education. It must be a problem, of course, but a minor one I suppose. To ordinary citizens of El Salvador and the Central African Republic, there must be a lot more pressing concerns and issues, ones which directly involve their day-to-day lives, that they need to devote their energy and time into. So the question of which currency is better and why will have to take the backseat.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dave1",
      "created_time": "June 02, 2022, 03:48:23 AM",
      "body": "If the opportunity presents itself then why not? But then again, it's the question of do we really need them to teach about bitcoin itself? They've made it legal tender as in the case of El Salvador so I'm under the impression that before the government made it to law, they have like do a survey because it's doesn't make sense to accept it as legal tender with their population is uneducated about it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dataispower",
      "created_time": "June 02, 2022, 07:18:59 AM",
      "body": "Quote from: Alisha-k on May 28, 2022, 10:09:17 AMWhat is the point teaching about bitcoin when the information on how to use, manage and own the digital decentralized currency is all over the internet. What this two countries should rather focus on should be strengthening their internet service and providing more Bitcoin ATM. Certainly once the begin to use the coin  they will want to know more about itNot everybody who can understand the system of understanding cryptocurrency through online reading, teaching is the best option because is a voice and demonstration which is passing directly from the teacher to a learner, why studying everything through online video and article you will not be opportune to ask questions you feel you misunderstood and at times when you want to apply any method how will you feel and what will be the result also. With teacher of cryptocurrency all your questions will breakdown one after the another",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}