{
  "id": "topic_5443407",
  "title": "2girls",
  "author": "2girls",
  "created_time": "March 05, 2023, 05:02:18 PM",
  "content": "Hi. I have been tagged by 2 DT Members, (The Sceptical Chymist) and (yahoo62278) The reasons are engaging in account sales. I want to request to those DT Members to consider removing their feedback or changing them to neutral. because It has been almost 5 years. I didn't break any roles or did anything wrong. (even account selling was not against forum rule that time) I see a lot of users who were engaged in account farming and selling have their negative feedback removed. so I think I also deserver a 2nd chance from DT members and Forum Community. Please support this thread and Help me Get my account back to normal.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5443407",
  "comments": [
    {
      "author": "NeuroticFish",
      "created_time": "March 05, 2023, 05:08:41 PM",
      "body": "I've just read one of your old posts related to those giving you negative tag:Quote from: 2girls on March 23, 2018, 05:59:14 PMSo Now Trust Spammer and abuser \" The Pharmist\" Back on business and he will again start his mission to give Red trust to each and every one on this forum. He was previously been removed as default trust because of his abusive behavior.Since Once this shity person, give negative Trust, he never removes it even if that person is doing no more shit posts or account selling and no second chance is given.Why does he given a second chance to prove himself a responsible Default trust member ?All I can add is, yeah, I would have no expectations on getting your tag removed (you may even gather some more).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "_BlackStar",
      "created_time": "March 05, 2023, 05:09:22 PM",
      "body": "Also check your feedback to UltraElite, I think you should give them second chance too instead you expect others to forgive you. I'm just sorry it's so easy for you to forget why DT doesn't like sales account. But let me quote it for you.Quote from: https://bitcointalk.org/index.php?action=trust;u=809589 TheUltraElite    2018-01-20        Account sales encourage scams, spam, and account farming.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JeromeTash",
      "created_time": "March 05, 2023, 05:14:52 PM",
      "body": "Why now?Because you now want to join bounties and signature campaigns?  Account selling is not against the forum rules but that does not mean that the DT members won't tag you and the reasons are pretty valid. Accounts sales encourage:1. Scam2. Spam and account farming 3. Account thief/hackingHow sure are we that the new owner of the account will be as trustworthy as the old user?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dimonstration",
      "created_time": "March 05, 2023, 05:17:40 PM",
      "body": "Quote from: 2girls on March 05, 2023, 05:02:18 PMI didn't break any roles or did anything wrong. (even account selling was not against forum rule that time) To clarify your concern. Account is not against the rules here even until now. DT is just unmoderated and they find account selling as unethical because it’s the cause of a lot of problem like what the negative tag description.It’s very hard to convince DT to remove if you don’t do anything to contribute in the forum aside from waiting for 5 years to request for the removal of negative tag. Trust feedback has no expiration though and DT decision can’t be affected by the time. Good luck with this bud.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "examplens",
      "created_time": "March 05, 2023, 05:34:39 PM",
      "body": "Quote from: 2girls on March 05, 2023, 05:02:18 PMHi. I have been tagged by 2 DT Members, (The Sceptical Chymist) and (yahoo62278) The reasons are engaging in account sales. I'm not sure what it looks like for you, but it's not just two negative tags. I saw five on the Trusted feedback page.Quote from: https://bitcointalk.org/index.php?action=trust;u=809589 Timelord2067    2018-05-07    Reference    Trying to buy UID's.http://archive.is/65xVG#selection-2681.0-2681.67Quote from: https://bitcointalk.org/index.php?action=trust;u=809589 yahoo62278    2018-03-23    Reference    Bought account/farmed accountQuote from: https://bitcointalk.org/index.php?action=trust;u=809589 TheUltraElite    2018-01-20    Reference    Account sales encourage scams, spam, and account farming.Quote from: https://bitcointalk.org/index.php?action=trust;u=809589 Lauda    2018-01-20    Reference    Account sales encourage scams, spam, and account farming.Quote from: https://bitcointalk.org/index.php?action=trust;u=809589 The Sceptical Chymist    2016-06-07    Reference    Account sales encourage scams, spam, and account farming.If I may ask, why do you want those negative feedbacks to be removed after 5-7 years? why did you wait so long until now?is it perhaps an attempt to clean up the account in order to sell it, or is it a new owner who wants to have a reputable account for a little money?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "2girls",
      "created_time": "March 05, 2023, 06:04:25 PM",
      "body": "Quote from: examplens on March 05, 2023, 05:34:39 PMIf I may ask, why do you want those negative feedbacks to be removed after 5-7 years? why did you wait so long until now?is it perhaps an attempt to clean up the account in order to sell it, or is it a new owner who wants to have a reputable account for a little money?i just launched one bounty Compaign and red flags has very bad impact on this. if i escrow fund (token or busd) , People will not still believe because this negative flag showing at the very top that Op is scammer.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "The Sceptical Chymist",
      "created_time": "March 05, 2023, 06:17:52 PM",
      "body": "Quote from: NeuroticFish on March 05, 2023, 05:08:41 PMQuote from: 2girls on March 23, 2018, 05:59:14 PMSo Now Trust Spammer and abuser \" The Pharmist\" Back on business and he will again start his mission to give Red trust to each and every one on this forum. He was previously been removed as default trust because of his abusive behavior.Since Once this shity person, give negative Trust, he never removes it even if that person is doing no more shit posts or account selling and no second chance is given.Why does he given a second chance to prove himself a responsible Default trust member ?All I can add is, yeah, I would have no expectations on getting your tag removed (you may even gather some more).Dang, OP.  Anything you'd like to say about what you wrote above?  It's been a long time and I don't remember reading that, but you obviously did not understand why I was red-tagging people engaged in account sales, which can have seriously negative effects on the forum.I wasn't removed from DT for my \"abusive behavior\" as far as I know.  It just so happened that I sided with Vod in his opinions about OgNasty, so I got excluded from the latter's trust list, and then Tomatocage did likewise.  Oh, the good old days.Quote from: 2girls on March 05, 2023, 06:04:25 PMi just launched one bounty Compaign and red flags has very bad impact on this. if i escrow fund (token or busd) , People will not still believe because this negative flag showing at the very top that Op is scammer. Hey, good luck with that.  Everyone knows I value bounties very highly, so I'll give the feedback removal some serious thought, OK?  You'll know if I've changed my mind if and when that feedback disappears.**NEVER!!**",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "examplens",
      "created_time": "March 05, 2023, 07:33:59 PM",
      "body": "Quote from: 2girls on March 05, 2023, 06:04:25 PMi just launched one bounty Compaign and red flags has very bad impact on this. if i escrow fund (token or busd) , People will not still believe because this negative flag showing at the very top that Op is scammer. I'm not sure you understand, but that's exactly what the trust page is for. says a lot about someone who accepts being represented on the forum by someone with negative trust based on bad behaviour. it seems like a big NO, even if they change campaign managers after all.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yahoo62278",
      "created_time": "March 05, 2023, 08:41:55 PM",
      "body": "Quote from: 2girls on March 05, 2023, 06:04:25 PMQuote from: examplens on March 05, 2023, 05:34:39 PMIf I may ask, why do you want those negative feedbacks to be removed after 5-7 years? why did you wait so long until now?is it perhaps an attempt to clean up the account in order to sell it, or is it a new owner who wants to have a reputable account for a little money?i just launched one bounty Compaign and red flags has very bad impact on this. if i escrow fund (token or busd) , People will not still believe because this negative flag showing at the very top that Op is scammer. I don't normally tag account sales these days as it's technically legal on the forum. That does not however mean that I trust everyone who has bought/sold an account. Some people have earned trust here based on previous actions and not everyone who has bought/sold an account is a bad person. You I put on the list of people who have not shown any care for the forum, have not shown yourself to be genuine about anything except yourself, and you try to be vindictive when caught For these reasons, I cannot remove the tag.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JeromeTash",
      "created_time": "March 05, 2023, 09:53:03 PM",
      "body": "Quote from: 2girls on March 05, 2023, 06:04:25 PMi just launched one bounty Compaign and red flags has very bad impact on this. if i escrow fund (token or busd) , People will not still believe because this negative flag showing at the very top that Op is scammer. Well, you might be one… Who knows?The account could have been hacked, bought/sold. Who knows what the new owner might be up to. The projects thinking of dealing without should have a chance of thinking they might be dealing with a scammer because of the red flags she/he has shown so far.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitcoinGirl.Club",
      "created_time": "March 06, 2023, 03:36:08 AM",
      "body": "This kind of case when you brought in the public the chances for it to work is very little. Everyone have their own opinion to leave. If you would PMed them then you would at least discuss with better focus.Quote from: JeromeTash on March 05, 2023, 05:14:52 PMWhy now?Because you now want to join bounties and signature campaigns?  5 years is a long time. Nothing wrong with joining bounties and signatures.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "virasog",
      "created_time": "March 06, 2023, 04:02:25 AM",
      "body": "Quote from: 2girls on March 05, 2023, 05:02:18 PMHi. I have been tagged by 2 DT Members, (The Sceptical Chymist) and (yahoo62278) The reasons are engaging in account sales. I want to request to those DT Members to consider removing their feedback or changing them to neutral. because It has been almost 5 years. I didn't break any roles or did anything wrong. (even account selling was not against forum rule that time) I see a lot of users who were engaged in account farming and selling have their negative feedback removed. so I think I also deserver a 2nd chance from DT members and Forum Community. Please support this thread and Help me Get my account back to normal.Sure you should get a second chance provided your intentions are clear and also when you confess your first mistakes clearly So we would like to know how did it all started? Did you bought this account and what other accounts you have at this moment. Since you were involved in account sales, surely either you have bought his account or this maybe your first account and you have bought other accounts. If you can list all of your accounts, it will be a first step letting us know that you have learned your mistakes and may not do them again.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}