{
  "id": "topic_5427763",
  "title": "BADecker",
  "author": "BADecker",
  "created_time": "December 10, 2022, 05:55:22 PMLast edit: December 11, 2022, 07:05:46 PM by BADecker",
  "content": "Basically, this has been known for a long time. But it has been concerned with telomers and the enzyme telomerase in the past. The problem is that lengthening telomeres can cause bad genes in the DNA to last longer, thereby causing crippling to be extended. BTW, this article doesn't seem to talk about telomeres at all.However, the idea of living for another couple hundred years, even in imperfect form, is a tempting idea. Soon a pill? What will Bill Gates do with this, considering that he and many other 'elite' are against a large world population?Length of genes decides how long you live: Scientists say they've cracked secret of aging - and it could lead to 'fountain of youth pill'Quote from: https://www.dailymail.co.uk/health/article-11520949/Shorter-genes-equals-shorter-life-Scientists-say-theyve-cracked-aging.htmlScientists believe they've cracked the secret of aging.A major genetic analysis of people, rodents and fish found the length of their DNA was directly linked to their biological age.Shorter genes were associated with shorter lifespans, while longer genes were linked to better health and longevity. Scientists believe if they can hijack this mechanism, it could pave the way for a fountain of youth drugs that could slow — or even reverse — aging.Dr Thomas Stoeger, lead author of the study from Northwestern University in Illinois, said: 'I find it very elegant that a single, relatively concise principle seems to account for nearly all of the changes in the activity of genes that happen in animals as they age.'The length of a gene is based on the number of nucleotides within it. Each string of nucleotides translates to an amino acid, forming a protein.Therefore a very long gene yields a large protein, and a short gene yields a small protein. A cell needs to have a balanced number of small and large proteins to achieve homeostasis, and problems occur when that balance gets out of whack. In the study, researchers looked at genetic data from several large datasets, including the Genotype-Tissue Expression Project, a National Institutes of Health-funded tissue bank that archives samples from human donors for research purposes.The research team first analyzed tissue samples from mice, rats and killifish of various ages....",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5427763",
  "comments": []
}