{
  "id": "topic_5404187",
  "title": "Abiky",
  "author": "Abiky",
  "created_time": "June 27, 2022, 02:00:18 AM",
  "content": "I've noticed one of my Polymerbit notes have some kind of error on the printing. It's an ETH banknote, but it has a text which reads \"Bitcoin 2017 Document\". I was wondering if this error makes the note valuable or something. I'm not sure what the asking price would be, so I'd appreciate your help on this. Thanks in advance.   (click thumbnails to enlarge)",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5404187",
  "comments": [
    {
      "author": "MoparMiningLLC",
      "created_time": "June 27, 2022, 02:35:04 AM",
      "body": "I have that same note - one has the line that reads \"2017 Bitcoin Document\" and the other reads \"2017 Ethereum Document\" The one I have with \"2017 Bitcoin Document\" is numbered A01 000000 and is marked as \"sample\" \"test print\"The one I have with \"2017 Ethereum Document\" is numbered A01 000063, only 8 sequentially after yours",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Abiky",
      "created_time": "June 27, 2022, 12:10:16 PM",
      "body": "Quote from: MoparMiningLLC on June 27, 2022, 02:35:04 AMI have that same note - one has the line that reads \"2017 Bitcoin Document\" and the other reads \"2017 Ethereum Document\" The one I have with \"2017 Bitcoin Document\" is numbered A01 000000 and is marked as \"sample\" \"test print\"The one I have with \"2017 Ethereum Document\" is numbered A01 000063, only 8 sequentially after yoursCool. I guess your \"2017 Bitcoin Document\" note is rarer than mine because of the serial number. Not sure what would be the market price for these, but I'm guessing they're in the triple digits due to their scarcity (not being sold anywhere online as far as I'm aware). I've not decided if I'm going to sell it for BTC or hold onto it a little longer. The bear market has made Bitcoin quite an attractive investment, so it's most likely I'll be making an auction thread soon. If anyone else has additional info about these kind of Polymerbit notes, feel free to share it here. Thanks!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "owlcatz",
      "created_time": "June 27, 2022, 06:01:42 PM",
      "body": "Yeah I have 2 of these, - Sample/Polymer Test - A01 000000- Regular (non-test) - A01 000049The other 4 I have are all marked with the \"fixed\" Ethereum strip (2 Test, 2 regular (serials 58 & 74). That said, I have no idea how many exist either, so thanks for asking! Cheers!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "buckrogers",
      "created_time": "June 27, 2022, 09:28:15 PM",
      "body": "Quote from: Abiky on June 27, 2022, 02:00:18 AMI've noticed one of my Polymerbit notes have some kind of error on the printing. It's an ETH banknote, but it has a text which reads \"Bitcoin 2017 Document\". I was wondering if this error makes the note valuable or something. I'm not sure what the asking price would be, so I'd appreciate your help on this. Thanks in advance.   (click thumbnails to enlarge)Ive seen them sell for upwards of $200 in BTCHope that helps.thanks!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "owlcatz",
      "created_time": "June 28, 2022, 12:17:12 AM",
      "body": "Quote from: buckrogers on June 27, 2022, 09:28:15 PMIve seen them sell for upwards of $200 in BTCHope that helps.thanks!Thanks! Interesting, didn't know that! I still have to wonder how many are out there and how many are test vs regular etc ... So many polymerbit notes, so little time... If anyone is looking for any of these, just let me know, but of course abiky has first dibs!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MoparMiningLLC",
      "created_time": "June 28, 2022, 03:36:08 AM",
      "body": "Quote from: owlcatz on June 28, 2022, 12:17:12 AMQuote from: buckrogers on June 27, 2022, 09:28:15 PMIve seen them sell for upwards of $200 in BTCHope that helps.thanks!Thanks! Interesting, didn't know that! I still have to wonder how many are out there and how many are test vs regular etc ... So many polymerbit notes, so little time... If anyone is looking for any of these, just let me know, but of course abiky has first dibs! as the error was corrected by my number, 63, that means at most 62 of them, I would assume. as for the test series, unsure of how many there were of those.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "polymerbit",
      "created_time": "June 28, 2022, 03:08:12 PM",
      "body": "That was definitely an early lesson in QC....While we don't have the full number of notes produced; they were definitely under 100 pcs.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Abiky",
      "created_time": "June 29, 2022, 01:50:41 AM",
      "body": "Quote from: owlcatz on June 27, 2022, 06:01:42 PMYeah I have 2 of these,- Sample/Polymer Test - A01 000000- Regular (non-test) - A01 000049The other 4 I have are all marked with the \"fixed\" Ethereum strip (2 Test, 2 regular (serials 58 & 74).That said, I have no idea how many exist either, so thanks for asking! Cheers!I guess these Polymerbit notes were a limited edition run. They're extremely rare as far as I can tell. We'd be lucky if we hold onto our notes until BTC hits $1m. Mine is in mint condition as I've never taken it out of the protective plastic sleeve. I'm not sure whenever to load it with ETH or just leave it as is. I've heard that PCGS graded some Polymerbit notes in the past, so I think I'll give them a shot. Quote from: buckrogers on June 27, 2022, 09:28:15 PMIve seen them sell for upwards of $200 in BTCHope that helps.thanks!Not bad. I bet you can get more bang for your buck by selling it on eBay. I've seen sellers selling BTC collectibles there at a higher premium than what you see here. If I do that, I will take the extra cash to buy more Bitcoin. Maybe I'll get lucky when BTC hits $1m?Quote from: polymerbit on June 28, 2022, 03:08:12 PMWhile we don't have the full number of notes produced; they were definitely under 100 pcs.Awesome!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "owlcatz",
      "created_time": "June 29, 2022, 02:05:47 AM",
      "body": "I wouldn't load it myself. No clue how no hologram would or if it would even affect grading, as I have a LOT of notes with no holograms...Another example, kinda off-topic but not really I guess...Anybody seen these before and if so, which one is the rare one?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hox",
      "created_time": "June 29, 2022, 02:13:09 AMLast edit: June 29, 2022, 11:01:43 PM by Hox",
      "body": "From my research I think the final serialised version of this note had about half with the error. The test notes are rarer with only about 30 made before the error was noticed. More info here: https://wiki.coin.community/Polymerbit_-_10_mETH_(Polymer_Test_Print)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "aoluain",
      "created_time": "June 29, 2022, 12:02:09 PM",
      "body": "Quote from: owlcatz on June 29, 2022, 02:05:47 AMI wouldn't load it myself. No clue how no hologram would or if it would even affect grading, as I have a LOT of notes with no holograms...Another example, kinda off-topic but not really I guess...Anybody seen these before and if so, which one is the rare one?   I had a look also on the Polymerbit Reference Thread here on the forum createdby Xprim77 but couldnt make out the rarity.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MoparMiningLLC",
      "created_time": "June 29, 2022, 01:33:53 PM",
      "body": "Quote from: owlcatz on June 29, 2022, 02:05:47 AMI wouldn't load it myself. No clue how no hologram would or if it would even affect grading, as I have a LOT of notes with no holograms...Another example, kinda off-topic but not really I guess...Anybody seen these before and if so, which one is the rare one?   for this series I have the 1 btc, .5 btc .1 btc and .05 btc - I do not have this note",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hox",
      "created_time": "June 29, 2022, 11:26:00 PM",
      "body": "Quote from: owlcatz on June 29, 2022, 02:05:47 AMI wouldn't load it myself. No clue how no hologram would or if it would even affect grading, as I have a LOT of notes with no holograms...Another example, kinda off-topic but not really I guess...Anybody seen these before and if so, which one is the rare one?   The top one is the v2 Polymer test (Quantity 100), the bottom one looks like the Teslin Test version (quantity 50). These were very early tests and there were only 2 other releases that used this material:  Polymerbit - 20 mBTC (Teslin Test Print)Polymerbit - 50 mBTC (Teslin Test Print)The teslin notes were some of the first notes made in house which is why they were experimenting with different materials.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "polymerbit",
      "created_time": "June 30, 2022, 06:53:02 AM",
      "body": "That is correct. Our first note, the 0.1 BTC was designed by me, but produced in Canada by a third party and took nearly a year to arrive. Naturally, that left me wishing for more flexibility.The Teslin notes were the first in house experiment and actually allowed us to rent the equipment to print on Polymer for the first time. We sure did quite a lot of test prints during that area. But they were instrumental in gaining an understanding of origination (colour correction, printing) and the supply chain. Not to mention they helped to make Polymerbit viable long term. It took us a long time to be comfortable in actually making keys. I like to keep one of the 20 Mbtc teslin notes next to my workstation as a reminder of how far we've come.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MoparMiningLLC",
      "created_time": "June 30, 2022, 11:41:52 AM",
      "body": "I need to find one of the .2's to add to my collection.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}