{
  "id": "topic_5416804",
  "title": "ramanlop0",
  "author": "ramanlop0",
  "created_time": "October 12, 2022, 01:17:16 AM",
  "content": "Hello friends, I am a platinum 4 player at stake.Today my account was suspended and I was asked to submit proof of funds as I am already verified upto level 3 and proof of funds comes in as level 4I have asked support and they have confirmed that they do not deem any crypto earnings as legal and valid source of income apart from income made through mining. This means if you are a service provider, a seller or simply a trade you cannot provide proof of funds at stake as they only deem mining earnings as legal and everything else is illegal and invalid.So if you have money at stake.com and you don't have any of these ready (https://help.stake.com/en/articles/5328395-acceptable-documents-for-source-of-funds) , please withdraw your money right now.It is really confusing why stake is disrespecting people who work hard and earn their money from small crypto taskshttps://i.imgur.com/GYTC70i.pngI earn my money from trading, selling some services and sometimes airdrops and stake tells me I am invalid",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5416804",
  "comments": [
    {
      "author": "cabron",
      "created_time": "October 12, 2022, 01:29:12 AM",
      "body": "2 consecutive days of stake attacking threads, doesn't that sound coordinated?I have somewhat the same issue though with my local crypto wallet that asked my source of funds, they don't accept earnings from online employment agreement which they prefer to look into a salary record with my IDs on it. Maybe they are just complying what government told them. I uninstalled that wallet after it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ramanlop0",
      "created_time": "October 12, 2022, 01:34:13 AM",
      "body": "Quote from: cabron on October 12, 2022, 01:29:12 AM2 consecutive days of stake attacking threads, doesn't that sound coordinated?I have somewhat the same issue though with my local crypto wallet that asked my source of funds, they don't accept earnings from online employment agreement which they prefer to look into a salary record with my IDs on it. Maybe they are just complying what government told them. I uninstalled that wallet after it.I am telling my problem and I still love stake but they should change their terms",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jackg",
      "created_time": "October 12, 2022, 02:48:32 AM",
      "body": "If it's worth claiming (either fund wise or spite wise) have you checked to see if you can file a tax return and if they'll accept one. From what I've read about proof of earnings for the UK, it looks like the second most document that's used for things like this (the first being letters of proof from a person's employer).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Flexystar",
      "created_time": "October 12, 2022, 03:17:46 AM",
      "body": "Quote from: jackg on October 12, 2022, 02:48:32 AMIf it's worth claiming (either fund wise or spite wise) have you checked to see if you can file a tax return and if they'll accept one. From what I've read about proof of earnings for the UK, it looks like the second most document that's used for things like this (the first being letters of proof from a person's employer). That’s correct. If the amount worth it then he could probably go for notarised documentation duly signed by legal representative. This is also one of the solid proof for such work and it adds up the legality since it is witnessed in front of the legal which is far more strict. At least in my country that would be far better proof. When it comes to the employer proof well that can mix up with your personal life a bit and everyone might get buzz that we gamble and shit. Just making point here nothing else. If OP really wants to get over this then they have to follow the stake rules I guess.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Don Pedro Dinero",
      "created_time": "October 12, 2022, 05:20:19 AM",
      "body": "Quote from: ramanlop0 on October 12, 2022, 01:17:16 AMI have asked support and they have confirmed that they do not deem any crypto earnings as legal and valid source of income apart from income made through mining. Can you provide proof of that? A screenshot or something? I find that hard to believe, and if any kind of proof other than mining is going to be considered illegal and they're going to block your funds, what they're doing is stealing. I say this hypothetically because I find it hard to believe what you are saying and even more so when it comes to Stake who has been on the forum for a long time. Quote from: Flexystar on October 12, 2022, 03:17:46 AMQuote from: jackg on October 12, 2022, 02:48:32 AMIf it's worth claiming (either fund wise or spite wise) have you checked to see if you can file a tax return and if they'll accept one. From what I've read about proof of earnings for the UK, it looks like the second most document that's used for things like this (the first being letters of proof from a person's employer). That’s correct. If the amount worth it then he could probably go for notarised documentation duly signed by legal representative. This is also one of the solid proof for such work and it adds up the legality since it is witnessed in front of the legal which is far more strict. The problem I see here is that they will want to see proof of funding in cryptocurrencies. It won't be enough to submit that you earn a certain amount of fiat money with a regular job if you don't have some way of proving that you have moved it into cryptocurrencies, and the OP says he earns those cryptocurrencies for doing certain tasks, I understand without a contract or invoice.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Haunebu",
      "created_time": "October 12, 2022, 05:42:48 AM",
      "body": "This is a weird case. It's tough to believe Stake not recognising crypto earnings just like some of the posters above mentioned op which is why proper proof is the only way to clear all of these doubts completely.If you manage to legitimise your claims, Stake would definitely need to clarify themselves in this case since it's ironic that a crypto casino wouldn't recognise crypto earnings.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kakmakr",
      "created_time": "October 12, 2022, 06:17:35 AM",
      "body": "Well, most of your \"Brick n Mortar\" casinos will also not recognize Crypto earnings as \"legal\" income, because it does not reflect on a \"Pay slip\" from a company that can be validated. The paper trail must lead to some legitimate company that can be verified to confirm that it is from a legal source.  I think the \"Verification team\" are some old school auditors that work with Fiat \"rules\" and \"regulations\" to guide them in determining what \"legal\" documents are for \"Proof of funds\"",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "swogerino",
      "created_time": "October 12, 2022, 06:38:46 AM",
      "body": "Quote from: cabron on October 12, 2022, 01:29:12 AM2 consecutive days of stake attacking threads, doesn't that sound coordinated?I have somewhat the same issue though with my local crypto wallet that asked my source of funds, they don't accept earnings from online employment agreement which they prefer to look into a salary record with my IDs on it. Maybe they are just complying what government told them. I uninstalled that wallet after it.Same with me from Cex.io located in UK,we don't consider earnings from different websites as valid source of income,also I sent them proof of mining and they ignored that too by claiming to not be valid while I sent them,pictures and videos,something which I regret deeply as I invaded my privacy by doing this.However regarding Stake I have seen people withdraw huge amounts of money in Stake without problems,I know Stake is the top casino at the moment with huge offerings and bonuses and most likely that is why only newbie accounts start threads about having issues with them.I think the best would be to offer legal proof as mentioned above in order to clear all doubts,I think Stake has a huge budget and does not care for any amount if proven validity of what are they requiring.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "noorman0",
      "created_time": "October 12, 2022, 07:59:54 AM",
      "body": "If they start to distrust you, close the account, go somewhere else. I think their rules starting to give you this kind of special attention will lead you to the verification procedure to the next level of complication. Don't mean to go against Stake's policy, to me it's already not very comfortable to bet long term for any casino.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Awaklara",
      "created_time": "October 12, 2022, 08:25:31 AM",
      "body": "I just found out about this from you, OP. how come crypto casinos don't recognize crypto income as you do?it will make you uncomfortable if you do not succeed in verifying your claim. funny if what is considered legitimate is only income from mining.I know this is Stake's policy. but, even the local exchange I use also accepts crypto income like trading. does not intend to further interfere with the rules established by Stake. but it looks like this certainly needs clarification.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Saint-loup",
      "created_time": "October 12, 2022, 09:43:02 AM",
      "body": "Quote from: Awaklara on October 12, 2022, 08:25:31 AMI just found out about this from you, OP. how come crypto casinos don't recognize crypto income as you do?it will make you uncomfortable if you do not succeed in verifying your claim. funny if what is considered legitimate is only income from mining.I know this is Stake's policy. but, even the local exchange I use also accepts crypto income like trading. does not intend to further interfere with the rules established by Stake. but it looks like this certainly needs clarification.I agree with you, it's totally insane to see a crypto casino, asking highly private documents like that and not recognizing crypto incomes as a proof of funds. If the funds deposited come from that source, I don't understand why this customer would need to lie and to invent something else.Stunna or anyone from Stake should clarify that here, because it looks like a scam to steal customers funds, like a random poor scammy casino would do.Ramanlop0 you should open a thread in the Scam accusation section, leave reviews on review gambling sites as you seem to say in your screenshot and report your case to some gambling authorities to let them know what they are doing to their customers.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "traderethereum",
      "created_time": "October 12, 2022, 10:29:27 AM",
      "body": "Quote from: noorman0 on October 12, 2022, 07:59:54 AMIf they start to distrust you, close the account, go somewhere else. I think their rules starting to give you this kind of special attention will lead you to the verification procedure to the next level of complication. Don't mean to go against Stake's policy, to me it's already not very comfortable to bet long term for any casino.I will do this if I don't believe it anymore and I think there are many other casinos we can trust by not asking for too many documents just to play gambling.Well, maybe some people make gambling a place to make money and they succeed so the casino thinks that they have to know that person's details.But still, it's unfair for people who play gambling there because it's like there's no place for them to be able to hide where their income source is coming from, be it in real life or online life.It seems that online life will also sooner or later want to enforce the rules as we experience in real life.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Extrarakeback",
      "created_time": "October 12, 2022, 10:40:01 AM",
      "body": "Quote from: jackg on October 12, 2022, 02:48:32 AMIf it's worth claiming (either fund wise or spite wise) have you checked to see if you can file a tax return and if they'll accept one. From what I've read about proof of earnings for the UK, it looks like the second most document that's used for things like this (the first being letters of proof from a person's employer). Who said he is from UK ?Also for UK residents they cannot open account at Stake.com.  they can open at another domain stake.co.uk with different regulations.However  Stake became more strict since the owners made tons of money now all they care about is the legalPart and the regulations . Aslo since they added the Fiat for deposit or withdrawals  Stake is no more a crypto casino its just a casino that accept crypto",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "IIrik11",
      "created_time": "October 12, 2022, 11:19:35 AM",
      "body": "well i was looking to play upcoming t-20 world cup there but was on the edge but now i am not.i would love to be a miner but i don't have the money to buy expensive miners and electricity is too expensive at my place.so, i'll just stick to trading and working to earn as much as crypto as i can.i wonder though, the crypto earning that they themselves make from all the crypto deposits, do they consider themselves to be illegal too?because they're not mining either.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Saint-loup",
      "created_time": "October 12, 2022, 11:47:34 AMLast edit: October 12, 2022, 12:03:29 PM by Saint-loup",
      "body": "Quote from: Extrarakeback on October 12, 2022, 10:40:01 AMQuote from: jackg on October 12, 2022, 02:48:32 AMIf it's worth claiming (either fund wise or spite wise) have you checked to see if you can file a tax return and if they'll accept one. From what I've read about proof of earnings for the UK, it looks like the second most document that's used for things like this (the first being letters of proof from a person's employer). Who said he is from UK ?Also for UK residents they cannot open account at Stake.com.  they can open at another domain stake.co.uk with different regulations.However  Stake became more strict since the owners made tons of money now all they care about is the legalPart and the regulations . Aslo since they added the Fiat for deposit or withdrawals  Stake is no more a crypto casino its just a casino that accept crypto I'm afraid to think you're a little bit too naive IMO. If it was just a matter of regulation, ramanlop0 would have not been allowed to deposit his money there and to gamble it until reaching the platinum 4 rank that requires $2,500,000 to be wagered according to this page https://help.stake.com/en/articles/4793501-stake-vip-program-overviewThe bear market has hit many crypto companies, Stake could be one of them and could encounter difficulties to pay out customers winnings now.IIrik11's comment is right. And we can also wonder why do they accept deposits without asking anything if some origins of them are not valid for them? Why there are only issues for withdrawing those funds?Quote from: IIrik11 on October 12, 2022, 11:19:35 AMi wonder though, the crypto earning that they themselves make from all the crypto deposits, do they consider themselves to be illegal too?because they're not mining either.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "robelneo",
      "created_time": "October 12, 2022, 12:12:48 PM",
      "body": "Quote from: Awaklara on October 12, 2022, 08:25:31 AMI just found out about this from you, OP. how come crypto casinos don't recognize crypto income as you do?it will make you uncomfortable if you do not succeed in verifying your claim. funny if what is considered legitimate is only income from mining.I know this is Stake's policy. but, even the local exchange I use also accepts crypto income like trading. does not intend to further interfere with the rules established by Stake. but it looks like this certainly needs clarification.Yes many are not aware of this I'm surprised that they do not accept trading because there are more traders than miners now, people prefer to trade, stake, or offer service than mine, because it's more profitable to do those things than mining, is Stake the only one that implements this and consider the mining as the only source of income when it comes to Cryptocurrency, the only way to get verified is to prove that you can sustain through your business offline, or you have a job that you can sustain their threshold, I hope they can add other valid ways to earn through Cryptocurrency, not just mining.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mu_enrico",
      "created_time": "October 12, 2022, 12:45:39 PM",
      "body": "The way I see it, Platinum 4 is a high rank with a high amount of wager requirement. With that amount of money for gambling, it should be pretty easy to prove your source of funds (for most whales) since you are expected to have six+ figures job, legitimate businesses, etc. Without that proof, there are only drug dealers and the like. Trading should be fine though if you have the record, should be treated fairly similar to this:QuoteSales of shared or other investments / liquidation of investment portfolio / bondsSource: ToSAnyway, there's nothing to worry about for small-time gamblers since who cares about the origin of $100? It is only applicable to whales.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Slow death",
      "created_time": "October 12, 2022, 01:23:27 PM",
      "body": "Quote from: swogerino on October 12, 2022, 06:38:46 AMSame with me from Cex.io located in UK,we don't consider earnings from different websites as valid source of income,also I sent them proof of mining and they ignored that too by claiming to not be valid while I sent them,pictures and videos,something which I regret deeply as I invaded my privacy by doing this.this is very strange because last year at cex.io they asked me for income statement and i said i won at stake.com casino and i showed all transactions and cex.io just told me i could no longer make deposits from one casino for their website but that I was allowed to withdraw from binance to cex.io that is, they accept exchanges, maybe they just don't accept casinos I don't understand why they accept deposits in cryptocurrencies when they know that people won't be able to deliver declaration documents income?Quote from: swogerino on October 12, 2022, 06:38:46 AMHowever regarding Stake I have seen people withdraw huge amounts of money in Stake without problems,I know Stake is the top casino at the moment with huge offerings and bonuses and most likely that is why only newbie accounts start threads about having issues with them.The OP needs to clarify this whole story better, this part he told doesn't make sense, the ocasino wouldn't wake up and out of nowhere ask the OP to deliver an income statement, there has to be something serious for them to get to ask thisOP did you deposit in cryptos only and how often and what amounts (minimum and maximum)?how often did you win and when did you check level 1 and 2?what was your last bet and you won the bet and how much had you bet?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Saisher",
      "created_time": "October 12, 2022, 01:36:40 PM",
      "body": "Quote from: ramanlop0 on October 12, 2022, 01:17:16 AMI earn my money from trading, selling some services and sometimes airdrops and stake tells me I am invalidThe industry is already more than ten years old and it's a very old concept to make money through mining Cryptocurrency, they should accept trading, investing and even bounty hunting as a source of income from Cryptocurrency, casinos I'm playing have not asked me yet a full detailed of my source of income, I think casinos should include in their terms what means of income in Cryptocurrency they are accepting, its injustice for players who play with their income coming from trading, selling services because these are already legal ways to make money in Cryptocurrency industry.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}