{
  "id": "topic_5526425",
  "title": "Botnake",
  "author": "Botnake",
  "created_time": "January 14, 2025, 02:06:41 PMLast edit: January 15, 2025, 04:43:43 AM by Botnake",
  "content": "Another company has invested in Bitcoin, and it’s for a great reason - to boost its liquidity. This is fantastic news because they’re recognizing how Bitcoin can help with liquidity since it’s easy to trade and convert into fiat anytime.It seems they also see Bitcoin’s potential to grow in the future. Their main concern is liquidity, not its volatility, which shows they’re optimistic about Bitcoin.https://crypto.news/hong-kong-construction-firm-ming-shing-invests-47m-in-bitcoin-to-boost-liquidity/Quote“The company considers that Bitcoin market is highly liquid and the Bitcoins can be easily disposed to fund the company’s wet trade works business, if required.”Ming Shing",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5526425",
  "comments": [
    {
      "author": "Ambatman",
      "created_time": "January 14, 2025, 03:47:33 PM",
      "body": "According to their statement they are in it for the short term and gain from its appreciation.Well atleast they honest about it And their view on its liquidity is true compared to most assets.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "January 14, 2025, 03:51:59 PM",
      "body": "I don’t think they’re looking for liquidity as much as it’s an investment so I’ll quote this part of the article:QuoteMing Shing said the funds came from idle reserves and viewed the Bitcoin purchase as a “short-term investment to capture the potential appreciation of Bitcoin and increase its assets.”Most likely their plan is to sell Bitcoin by the end of Q1/Q2 and take some profits.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nwada001",
      "created_time": "January 14, 2025, 04:53:45 PM",
      "body": "They invested $47 million to acquire 500 bitcoin at an average price of $94,375 per bitcoin and not $200 million.  As stated above, their move and intention are already very clear: they want to make a profit and pull off that announcement alone, which has made their share experience a 10% gain in a few days. Anytime they see enough profit from bitcoin, let's expect them to dump either all or take profit on a few, depending on what their target is.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "moneystery",
      "created_time": "January 14, 2025, 05:27:40 PM",
      "body": "Quote from: Botnake on January 14, 2025, 02:06:41 PMAnother company has invested in Bitcoin, and it’s for a great reason - to boost its liquidity. This is fantastic news because they’re recognizing how Bitcoin can help with liquidity since it’s easy to trade and convert into fiat anytime.It seems they also see Bitcoin’s potential to grow in the future. Their main concern is liquidity, not its volatility, which shows they’re optimistic about Bitcoin.https://crypto.news/hong-kong-construction-firm-ming-shing-invests-47m-in-bitcoin-to-boost-liquidity/Quote“The company considers that Bitcoin market is highly liquid and the Bitcoins can be easily disposed to fund the company’s wet trade works business, if required.”Ming ShingI didn't find any number that said they invested $200m in bitcoin, what they did was just a short term investment of $47m in bitcoin to diversify their investment. well.. it's a good move that they thought of diversifying their investment to bitcoin, but unfortunately they only did it for a short period of time, if they thought of investing for a longer period of time like 5-10 years, I think they could have made better profit than just investing in it for a short period of time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "avikz",
      "created_time": "January 14, 2025, 06:33:23 PM",
      "body": "Quote from: Botnake on January 14, 2025, 02:06:41 PMAnother company has invested in Bitcoin, and it’s for a great reason - to boost its liquidity. This is fantastic news because they’re recognizing how Bitcoin can help with liquidity since it’s easy to trade and convert into fiat anytime.It seems they also see Bitcoin’s potential to grow in the future. Their main concern is liquidity, not its volatility, which shows they’re optimistic about Bitcoin.https://crypto.news/hong-kong-construction-firm-ming-shing-invests-47m-in-bitcoin-to-boost-liquidity/Quote“The company considers that Bitcoin market is highly liquid and the Bitcoins can be easily disposed to fund the company’s wet trade works business, if required.”Ming ShingThere's no doubt that the Bitcoin is liquid. There's always buyers in the market so the investment in Bitcoin can be always converted into fiat whenever they need. It's volatile as well but the buying and selling needs to be timed right. The only concern is that the company is registered in Hongkong. So it can be considered as a Chinese investment. I hope they won't act like an expansionist similar to what they do with land.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Doan9269",
      "created_time": "January 14, 2025, 06:42:11 PM",
      "body": "Quote from: Botnake on January 14, 2025, 02:06:41 PMAnother company has invested in Bitcoin, and it’s for a great reason - to boost its liquidity. This is fantastic news because they’re recognizing how Bitcoin can help with liquidity since it’s easy to trade and convert into fiat anytime.It seems they also see Bitcoin’s potential to grow in the future. Their main concern is liquidity, not its volatility, which shows they’re optimistic about Bitcoin.https://crypto.news/hong-kong-construction-firm-ming-shing-invests-47m-in-bitcoin-to-boost-liquidity/Quote“The company considers that Bitcoin market is highly liquid and the Bitcoins can be easily disposed to fund the company’s wet trade works business, if required.”Ming ShingThis year is going to be an improvement over the previous ones concerning institutions and governments that will be taking into consideration the adoption of bitcoin as an investment or their major reserve digital currency, from the recent activities seen and the circulars on social media, this will be the second consideration for the use of bitcoin within this week am going to be coming across, the first is the proposal coming from Meta to make use of bitcoin as their reserve currency, while this thread serves as the second where Hong-Kong company had already invested on bitcoin on the same reason of strengthening their liquidity.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Faisal2202",
      "created_time": "January 14, 2025, 07:21:03 PM",
      "body": "Quote from: Botnake on January 14, 2025, 02:06:41 PMAnother company has invested in Bitcoin, and it’s for a great reason - to boost its liquidity. This is fantastic news because they’re recognizing how Bitcoin can help with liquidity since it’s easy to trade and convert into fiat anytime.It seems they also see Bitcoin’s potential to grow in the future. Their main concern is liquidity, not its volatility, which shows they’re optimistic about Bitcoin.Are you saying they come to realize that now? And still invested $200 million, I guess they did not have proper guidance before about BTC if they want to invest a big amount, how can they do that and how to keep it safe, and will they be able to get their money back with profit or loss? Well, these are actually generic questions for big investors. This is a good thing for them but it's Hong Kong and they have been into crypto for a long time, still showing it like they did not know. Well, whatever this is, it is good news and they must have bought this recent dip, although to get the entry they must be prepared from long ago. They surely are not here for profit, it is another meaning of their statement. Instead, they want to invest in a source to save them from inflation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "serjent05",
      "created_time": "January 14, 2025, 07:55:57 PM",
      "body": "Quote from: Botnake on January 14, 2025, 02:06:41 PMAnother company has invested in Bitcoin, and it’s for a great reason - to boost its liquidity. This is fantastic news because they’re recognizing how Bitcoin can help with liquidity since it’s easy to trade and convert into fiat anytime.It seems they also see Bitcoin’s potential to grow in the future. Their main concern is liquidity, not its volatility, which shows they’re optimistic about Bitcoin.https://crypto.news/hong-kong-construction-firm-ming-shing-invests-47m-in-bitcoin-to-boost-liquidity/Quote“The company considers that Bitcoin market is highly liquid and the Bitcoins can be easily disposed to fund the company’s wet trade works business, if required.”Ming ShingIt looks like the company recognizes the 4-year cycle of Bitcoin, although they are a little late on putting in such investment to take advantage of this bullish run of Bitcoin, they will surely take profit when they decide to sell their stash on the day when Bitcoin is nearing its peak or reaches its peak since they are open about their goal of a short-term investment to take profit in the Bitcoin market. The company is right about the high liquidity of Bitcoin and it is not wrong to have confidence in the market due to that reason.  And if the predicted price of $200k at a peak in 2025 before BTC transitions to a bear market, the company can double its investment in just a short span of time. It is indeed a wise move for the company.Quote from: Faisal2202 on January 14, 2025, 07:21:03 PMQuote from: Botnake on January 14, 2025, 02:06:41 PMAnother company has invested in Bitcoin, and it’s for a great reason - to boost its liquidity. This is fantastic news because they’re recognizing how Bitcoin can help with liquidity since it’s easy to trade and convert into fiat anytime.It seems they also see Bitcoin’s potential to grow in the future. Their main concern is liquidity, not its volatility, which shows they’re optimistic about Bitcoin.Are you saying they come to realize that now? And still invested $200 million, I guess they did not have proper guidance before about BTC if they want to invest a big amount, how can they do that and how to keep it safe, and will they be able to get their money back with profit or loss? Well, these are actually generic questions for big investors. This is a good thing for them but it's Hong Kong and they have been into crypto for a long time, still showing it like they did not know. Probably they had this in mind for some time but were hesitant until the recent event where many politicians got involved in Bitcoin and the plans of some countries to make a Bitcoin reserve dissolved that hesitation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JiiBs",
      "created_time": "January 14, 2025, 08:19:27 PM",
      "body": "Quote from: Ambatman on January 14, 2025, 03:47:33 PMAccording to their statement they are in it for the short term and gain from its appreciation.Well atleast they honest about it And their view on its liquidity is true compared to most assets. This is the path many companies that are coming into the innovation are taking and it doesn’t seem like a great news. Maybe for the short run as, it would make Bitcoin a little scares which would reflect in the price but, being in it for the gain and pulling out after a short while gives the honey pot Bitcoin digger feeling. In the same way, US governments are making plans of a reserve which isn’t actually a reserve. It’s not ment to rescue them in dire situations but, to reap Bitcoin for the gains.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rodskee",
      "created_time": "January 15, 2025, 04:32:58 AM",
      "body": "Quote from: Ambatman on January 14, 2025, 03:47:33 PMAccording to their statement they are in it for the short term and gain from its appreciation.Well atleast they honest about it to me this shows that they truly understand bitcoin and knows what it can do for them they might not be in this for the long term but maybe because they are aware of the following cycles and knows that it would not do them the best if they keep holding bitcoin for years to come but hey it is their company and i am sure many individuals are doing the same by taking advantage of bitcoin for short term profit at least instead of trying to push bitcoin away and denying its evident and very obvious benefits, they are accepting it and trying to integrate it to the company's visions to the best of their abilities other companies should take notes",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Botnake",
      "created_time": "January 15, 2025, 04:51:32 AM",
      "body": "Quote from: Ambatman on January 14, 2025, 03:47:33 PMAccording to their statement they are in it for the short term and gain from its appreciation.Well atleast they honest about it And their view on its liquidity is true compared to most assets. It’s a short mention in the news, but I think they might be eyeing Bitcoin for long-term investment too.It feels like they’re just testing the waters for now, and if the results turn out good, I’m sure they’ll consider holding Bitcoin long-term. After all, their main purpose seems to be liquidity so they can easily dispose of it anytime they need to.Quote from: hugeblack on January 14, 2025, 03:51:59 PMI don’t think they’re looking for liquidity as much as it’s an investment so I’ll quote this part of the article:QuoteMing Shing said the funds came from idle reserves and viewed the Bitcoin purchase as a “short-term investment to capture the potential appreciation of Bitcoin and increase its assets.”Most likely their plan is to sell Bitcoin by the end of Q1/Q2 and take some profits.actually both.. QuotePublic construction firm Ming Shing Group has joined the list of non-tech companies diversifying into cryptocurrency, investing $47 million in Bitcoin to enhance liquidity and boost asset value.Quote from: avikz on January 14, 2025, 06:33:23 PMThe only concern is that the company is registered in Hongkong. So it can be considered as a Chinese investment. I hope they won't act like an expansionist similar to what they do with land. Regardless, it doesn’t really matter since there are Chinese investors who are actively involved anyway. They operate in Hong Kong, where Bitcoin is legal, unlike in mainland China.@Nwada001  (corrected, THANKS)>",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}