{
  "id": "topic_5415797",
  "title": "Free Market Capitalist",
  "author": "Free Market Capitalist",
  "created_time": "October 03, 2022, 02:56:58 PM",
  "content": "I am going to paste here an excerpt from this news published in El Corriere de la Sera, previously translated with Deepl.com.\"Electricity bills totaled about 500,000 euros, in August alone. This is the reason that prompted Caroli Hotels, an Apulian chain consisting of four hotels between Gallipoli and Santa Maria di Leuca, to close its operations. \"It is shutting down, due to high electricity costs, our historic hotel chain after almost sixty years of uninterrupted activity,\" announced Attilio Caputo, the general manager.Unsustainable costsThe chain has a history and tradition it has carried on for nearly 60 years, employs 275 people and operates several other businesses in the hospitality industry. \"Although we regret the disservice we will create to guests, partners and suppliers,\" Caputo explained, \"the disproportionate and unsustainable costs, which have totally eroded profit margins, make it impossible to guarantee the continuation of the business, even if we resort to the opportunities offered by the credit system and the implementation of photovoltaic systems, the installation of which has not yet been authorized. The decision to discontinue all hotel and restaurant services for new clients, honoring until expiration only existing and already signed contracts, has already been forwarded to the prefecture of Lecce.\"If energy costs are not reduced, much productive activity will come to a standstill in Europe. I understand that it is something difficult in the midst of the war between Ukraine and Russia, and that efforts are being made for it, but if this is not solved in a short time in Europe there will be people going hungry and cold as it has not happened for many decades.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5415797",
  "comments": [
    {
      "author": "jackg",
      "created_time": "October 03, 2022, 03:14:56 PM",
      "body": "Looks like electricity prices have tripled in Italy too so that would have taken a bill that was probably around €160K and made it the €500k.Considering most of the EU was meant to be half renewable and is on paper, I don't know why these rates are going up so much and why larger companies can't take advantage of it and make renewable sources a lot cheaper. At this current rate, the whole of Europe's economy might end up hibernating or moving in order to sustain production costs (put uprooting whole manufacturing plants and transporting them to countries like Canada would be expensive to do quickly).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "d5000",
      "created_time": "October 03, 2022, 04:05:48 PMLast edit: October 03, 2022, 04:46:21 PM by d5000",
      "body": "Quote from: jackg on October 03, 2022, 03:14:56 PMConsidering most of the EU was meant to be half renewable and is on paper, I don't know why these rates are going up so much and why larger companies can't take advantage of it and make renewable sources a lot cheaper.The increase of electricity prices has to do a lot with the way the wholesale electricity prices are calculated in Europe (merit-order pricing system), and due to current problems which are partly, but not all, related to the Ukraine crisis.Basically, if you have a certain demand of electricity, there will be a number of producers willing to cover the demand for a certain price, some will be cheaper (renewables, nuclear, coal) and some will be more expensive (currently, above all gas). These producers are then ranked, starting with the cheapest, and the price of the most expensive producer who is needed to cover the demand is paid to all producers.There are now two problems currently which have increased prices:1) High gas prices, due to the Russian war in Ukraine.2) Problems in France's electricity sector: several nuclear plants shut down due to technical problems (partly, but not only, due to the heat wave in July/August), so they need electricity from other, more expensive sources, primarily gas.Both reasons combined with the merit-order pricing system are driving electricity prices high currently. And the EU is an interconnected market, so France's problems influence the market in neighboring countries, including Italy.What I don't understand is how you think that \"large companies\" could \"make renewable sources a lot cheaper\" (if you want, elaborate  ). Renewable energy producers currently are among the cheapest, together with nuclear and coal, so the problem is not their price but the availability, even if the installed power is growing at a good pace.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "darkangel11",
      "created_time": "October 03, 2022, 04:14:13 PM",
      "body": "It's only going to get worse because nuclear power plants also have a refit or shutdown schedule and for instance in Germany refits were being neglected for many years because they were trying to be green and thought nuclear and coal power are becoming obsolete. Now that a demand has increased they're starting to fire up their coal power plants once again, but it's not going to be enough if they're forced to shut down a nuclear plant for refit. IMO countries that decided to pursue green energy at all cost have shot themselves in the knee and this wasn't done willingly. Many countries opposed this but were forced into submission by the EU council that kept reducing their CO2 emission limits. In other words, the EU put its members in a crisis situation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "adaseb",
      "created_time": "October 03, 2022, 08:30:50 PM",
      "body": "All over twitter and reddit there are stories of many small and medium type of businesses closing due to electricity costs. At first when the costs went up, they increased their prices, and then they went up again, and there was no point in increasing prices because nobody would buy a 20EUR cup of coffee. I think they got energy caps in place for residential but it doesn't apply appartely to commercial businesses. Hence when the PPI comes out of these countries its no wonder its in the double digits. Because its very expensive being a producer these days and all these costs are past on and it increases inflation everywhere.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mindrust",
      "created_time": "October 03, 2022, 08:35:07 PM",
      "body": "Why don't Italy invest in green energy? Greta said solar panels and wind turbines provide free and clean energy. Why not give it a try?   I guess Russia kicked Europe where it hurts the most and it seems to me Russia isn't suffering for not selling its gas at all. Only the Europeans are getting hurt. Is it too late to remove sanctions on Russia and get a deal with Putin? Meh that's probably not going to happen any time soon. First, you'll have to suffer more because that's the European way.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "samcrypto",
      "created_time": "October 03, 2022, 10:11:43 PM",
      "body": "Quote from: bitgov on October 03, 2022, 09:41:46 PMQuote from: mindrust on October 03, 2022, 08:35:07 PMWhy don't Italy invest in green energy? Greta said solar panels and wind turbines provide free and clean energy. Why not give it a try?   I guess Russia kicked Europe where it hurts the most and it seems to me Russia isn't suffering for not selling its gas at all. Only the Europeans are getting hurt. Is it too late to remove sanctions on Russia and get a deal with Putin? Meh that's probably not going to happen any time soon. First, you'll have to suffer more because that's the European way.Italy was in trouble during COVID - it is trouble due to inflation The whole world is going crazy due to electricity bill and other daily expenses. Now we all are the brink of nervous break down. This inflation beast is  not going to sleep anytime sooner. The pandemic make things worst, and now we are dealing with a threat of economic recession and there’s no doubt why many businesses files their closure. Green energy might not be enough to sustain a business, because honestly it can also cost you a lot of money. Italy is experiencing a huge inflation as well, while the gas issue are still on top priority though they are able to acquire a deal with other countries, I think that is still not enough.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AmoreJaz",
      "created_time": "October 03, 2022, 10:22:19 PM",
      "body": "Quote from: samcrypto on October 03, 2022, 10:11:43 PMQuote from: bitgov on October 03, 2022, 09:41:46 PMQuote from: mindrust on October 03, 2022, 08:35:07 PMWhy don't Italy invest in green energy? Greta said solar panels and wind turbines provide free and clean energy. Why not give it a try?   I guess Russia kicked Europe where it hurts the most and it seems to me Russia isn't suffering for not selling its gas at all. Only the Europeans are getting hurt. Is it too late to remove sanctions on Russia and get a deal with Putin? Meh that's probably not going to happen any time soon. First, you'll have to suffer more because that's the European way.Italy was in trouble during COVID - it is trouble due to inflation The whole world is going crazy due to electricity bill and other daily expenses. Now we all are the brink of nervous break down. This inflation beast is  not going to sleep anytime sooner. The pandemic make things worst, and now we are dealing with a threat of economic recession and there’s no doubt why many businesses files their closure. Green energy might not be enough to sustain a business, because honestly it can also cost you a lot of money. Italy is experiencing a huge inflation as well, while the gas issue are still on top priority though they are able to acquire a deal with other countries, I think that is still not enough. this is the period where basically everyone is not experiencing the effect of inflation. or maybe only the rich people don't bother about this crisis. each country has their own crisis owed to this global pandemic. now, it is how they will attack this crisis to overcome this yet another change in humanity. for sure, each country has their own strategic plans on how to tackle this situation. on a personal level, you should list things that you think you can do to survive this situation, you can reduce your unnecessary expenses for one.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "romero121",
      "created_time": "October 03, 2022, 11:35:34 PM",
      "body": "The increase in the electricity charges were due to the oil price increase. Most of the western nations have been experiencing it. In our country for political reasons the price hasn't been increased for a long providing subsidies and now after a long the price have been increased. If this has been increased over the years in a gradual way, this couldn't have affected much.The need for renewable energy have come and countries have begun to focus much on it than depending on oil.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "STT",
      "created_time": "October 03, 2022, 11:46:28 PM",
      "body": "If they are in Italy but not using Solar panels for power I got to attribute some of their costs to misallocation of resources.   Every country and company within its own economy must make the most of its own advantages and bias and surely Italy has the sun where not every country can count good weather as a positive they can rely on.   Its not exactly fair but business and competition is a harsh reality to deal with.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zlantann",
      "created_time": "October 04, 2022, 12:27:22 AM",
      "body": "Quote from: Poker Player on October 03, 2022, 02:56:58 PMIf energy costs are not reduced, much productive activity will come to a standstill in Europe. I understand that it is something difficult in the midst of the war between Ukraine and Russia, and that efforts are being made for it, but if this is not solved in a short time in Europe there will be people going hungry and cold as it has not happened for many decades. Most businesses in my location depend solely on generators to power their machines and other appliances because of unstable power supply and the high cost of power. The government has always subsidized the cost of fuel making it very affordable. But the global economic crisis has skyrocketed the cost of subsidies and the government cannot sustain it anymore. The government is scared that removing fuel subsidies would lead to public unrest, hence they are even borrowing to sustain it. This has really affected the economy negatively because a large chunk of the country's income goes to debt servicing.   The government has given a timeline for the removal of these subsidies and when that happens businesses would start shutting down. 50% of businesses in my locality might not be able to afford the cost of powering their machines with generators if the subsidy on fuel is scraped. Switching to renewable would be very slow because of its cost, except the government also subsidizes the price. Our hope now is the quick peaceful resolution of the war in Ukraine.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "wxa7115",
      "created_time": "October 04, 2022, 01:47:34 AM",
      "body": "Quote from: adaseb on October 03, 2022, 08:30:50 PMAll over twitter and reddit there are stories of many small and medium type of businesses closing due to electricity costs. At first when the costs went up, they increased their prices, and then they went up again, and there was no point in increasing prices because nobody would buy a 20EUR cup of coffee. I think they got energy caps in place for residential but it doesn't apply appartely to commercial businesses. Hence when the PPI comes out of these countries its no wonder its in the double digits. Because its very expensive being a producer these days and all these costs are past on and it increases inflation everywhere. Unfortunately this is nothing more but the system trying to find some sort of equilibrium, and only businesses which find a way to be more efficient are going to survive.And it is unfortunate because all of those people which started those businesses did so with the very best intentions but now they are finding that due to circumstances which are completely out of their control most likely their business is not going to survive, because if we are honest there is not really a solution which can be implemented right now which is going solve the problem Europe has with high energy prices.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "adaseb",
      "created_time": "October 04, 2022, 02:19:18 AM",
      "body": "Green energy wouldn’t be enough. You just can’t manufacture enough equipment and install enough equipment to make a difference. Wind energy you can only put it in certain areas. And solar energy is very expensive to produce and install.We already got tons of green energy everywhere pretty much but we still rely on the old energy. It’s not going anywhere. Not anytime soon.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sithara007",
      "created_time": "October 04, 2022, 02:45:30 AM",
      "body": "Quote from: adaseb on October 03, 2022, 08:30:50 PMAll over twitter and reddit there are stories of many small and medium type of businesses closing due to electricity costs. At first when the costs went up, they increased their prices, and then they went up again, and there was no point in increasing prices because nobody would buy a 20EUR cup of coffee. I think they got energy caps in place for residential but it doesn't apply appartely to commercial businesses. Hence when the PPI comes out of these countries its no wonder its in the double digits. Because its very expensive being a producer these days and all these costs are past on and it increases inflation everywhere. I don't know whether they need to increase the price of coffee to €20, for the business to remain profitable. But in case if that happens, then there are few scenarios. The most likely scenario is this:In a small town, there were 10 cafeterias, selling on average 1,000 coffees per day (100 coffees per shop). Let's assume that price of a cup of coffee is €10. Daily revenues stand at €10,000 (€1,000 per shop). Because of high energy prices, they are forced to increase the prices to €20. Now 50% of the customers will be forced to stop their habit of having coffee. But the remaining 50% will be willing to buy coffee at a higher cost. And instead of 1,000 coffees per day, the total sales now stand at 500 coffees per day. Let's assume that half of the shops close down and only the other half survives. So that means that each shop still has a business of 100 coffees per day. So it is not all bad.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "d5000",
      "created_time": "October 04, 2022, 06:20:39 AMLast edit: October 04, 2022, 06:52:57 AM by d5000",
      "body": "Quote from: darkangel11 on October 03, 2022, 04:14:13 PMIMO countries that decided to pursue green energy at all cost have shot themselves in the knee and this wasn't done willingly. Many countries opposed this but were forced into submission by the EU council that kept reducing their CO2 emission limits. In other words, the EU put its members in a crisis situation.Incorrect, because 1) nuclear energy, which you mention, is viewed as \"green\" by the EU, and 2) the problem lies in the natural gas prices, and renewables are driving down them, but the installed power in most countries is not enough.Quote from: adaseb on October 03, 2022, 08:30:50 PMAll over twitter and reddit there are stories of many small and medium type of businesses closing due to electricity costs. At first when the costs went up, they increased their prices, and then they went up again, and there was no point in increasing prices because nobody would buy a 20EUR cup of coffee. I think you're in principle right but greatly exaggerating here.  You cite the example of a restaurant/coffee shop, but energy/electricity isn't the main cost of this kind of business, so even if electricity costs triple, they don't have to increase their prices _that_ much. However, there are definitively industries, for example aluminium production, which are suffering a lot in the present conditions in Europe.Quote from: wxa7115 on October 04, 2022, 01:47:34 AMUnfortunately this is nothing more but the system trying to find some sort of equilibrium, and only businesses which find a way to be more efficient are going to survive.Good point with the equilibrium. Some businesses will most certainly close; the recession could be as deep as in 2008/09, even deeper if the situation in Ukraine extends in time. But I guess many will also see new opportunities to increase efficiency in a scenario where energy is more scarce and expensive.We can compare that to the way the Bitcoin difficulty works. If electricity prices rose in the whole world, and all other constants were equal, then there would be less profitability, until all unprofitable miners cease mining; but after the difficulty adjustment, for the rest of the miners the profitability will be restablished.Some would however innovate, for example generating their own electricity, or finding ways to use less, and could survive even if they not so competitive in other areas. In various countries you can see offices, factories and warehouses with solar panels on them.Quote from: adaseb on October 04, 2022, 02:19:18 AMGreen energy wouldn’t be enough. You just can’t manufacture enough equipment and install enough equipment to make a difference. Wind energy you can only put it in certain areas. And solar energy is very expensive to produce and install.You can, but of course not in a single year (or a few years). But in a decade you can significatively increase renewable production. China for example, between 2011 and 2021, has made x8 in wind energy production, x20 in solar and x2 in hydro. In total renewable production almost tripled, increasing the renewable percentage from 17% to 27% in a period when China almost doubled total electricity production/consumption due to its strong economic growth. See the table here.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DrBeer",
      "created_time": "October 04, 2022, 07:22:30 PM",
      "body": "A completely expected situation, after Merkel and some other EU politicians began to fulfill the will of \"their masters\" and promote the topic of closing nuclear power plants in Europe, pumping their energy resources into the EU. Well, what did you want? WHAT would the \"oil and gas drug dealer\" help? No - his task is to put him on his \"drugs\", remove alternative options, and pull out money ... The short-sightedness of some European politicians and their venality, only this is the main reason for what this post is about. And many more will suffer, otherwise life cannot",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "avikz",
      "created_time": "October 04, 2022, 07:32:32 PM",
      "body": "I can safely say the main reason is the ongoing Russia Ukraine war and the sanctions that some western countries have imposed on Russia. But do you understand who is playing the main game from behind? It's US! After the war started US has imposed multiple sanctions on Russia and some EU countries like France or UK also followed through without understanding what game US is playing with them from the disguise of NATO. US people is not paying the price of the war, rather EU countries are facing huge issues. But who wanted to reach to Russian border in the disguise of NATO? - It's US! Russia has pushed back because no one wants their enemies to reach to their border. This entire war is prompted by US and look who is paying the price - EU.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gyfts",
      "created_time": "October 04, 2022, 07:54:47 PM",
      "body": "I understand this is a hotel chain but consider all the smaller hotels before it that have closed down already for which no one has batted an eye.The operating costs will hurt small businesses the most. Larger corporations might have the resources to temporarily foot the bill, or lobbying power to pull strings on a governmental level that may help alleviate financial burdens. Small businesses will be stuck with nothing. You're seeing the COVID effect all over again. During COVID lockdowns and supply chain constrictions, small businesses weren't able to keep up with government regulations or labor shortages that resulted from the lockdowns (that is, for the businesses that were given the luxury of remaining open). Businesses went under, the corporations prevailed.Energy costs operate in a similar fashion. It's the bigger players that will incur these cost and they will gladly take the markets share away from the businesses that can't keep up. I suppose after a while, not even the corporations will be able to keep up.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fortify",
      "created_time": "October 04, 2022, 08:48:11 PM",
      "body": "Quote from: Poker Player on October 03, 2022, 02:56:58 PMI am going to paste here an excerpt from this news published in El Corriere de la Sera, previously translated with Deepl.com.\"Electricity bills totaled about 500,000 euros, in August alone. This is the reason that prompted Caroli Hotels, an Apulian chain consisting of four hotels between Gallipoli and Santa Maria di Leuca, to close its operations. \"It is shutting down, due to high electricity costs, our historic hotel chain after almost sixty years of uninterrupted activity,\" announced Attilio Caputo, the general manager.Unsustainable costsThe chain has a history and tradition it has carried on for nearly 60 years, employs 275 people and operates several other businesses in the hospitality industry. \"Although we regret the disservice we will create to guests, partners and suppliers,\" Caputo explained, \"the disproportionate and unsustainable costs, which have totally eroded profit margins, make it impossible to guarantee the continuation of the business, even if we resort to the opportunities offered by the credit system and the implementation of photovoltaic systems, the installation of which has not yet been authorized. The decision to discontinue all hotel and restaurant services for new clients, honoring until expiration only existing and already signed contracts, has already been forwarded to the prefecture of Lecce.\"If energy costs are not reduced, much productive activity will come to a standstill in Europe. I understand that it is something difficult in the midst of the war between Ukraine and Russia, and that efforts are being made for it, but if this is not solved in a short time in Europe there will be people going hungry and cold as it has not happened for many decades. We are going to see this happen more and more because many businesses are yet to really adapt to their first year running at much higher energy costs - at least throughout places like Europe, but it affects even the poorest countries worldwide. It feels like we're currently in a very volatile situation and consumers are starting to watch where they spend, so there isn't even room to raise prices too much or you will simply drive away custom. There was a slight bounce back in fortunes after Covid, but Russia's war against Ukraine has really ruined life for many people. However these situations can also prove which companies are more resourceful and trim out the most wasteful.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "famososMuertos",
      "created_time": "October 05, 2022, 01:03:16 AM",
      "body": "-/Although the future reality and its consequences cannot be ignored, we must not echo the bad omen, we must always see the cause and the effect objectively, and based on this, expose our best thinking on the solution, especially in times when it is easy predict darkness./-This hotel is perhaps not the best example to take as a flag in a situation that has been in Europe for years, more in some countries less in others, but in the case of hotel chains, the \"adjustment\" of rates allows them to survive more than others areas or companies such as manufacturing where it is complex to implement variables to the final product... as a trite phrase says in times of crisis, \"companies have to reinvent themselves,\" a phrase that is obviously successful in certain sectors and does not apply in the complex conglomerate economic and business of a country.That hotel is part of the tourism branch, it was one of the areas most affected by those almost two and a half years of the pandemic...Be careful, understand the point, the situation is \"f.k.d up\", but for a hotel to come out as the flag of the real, evil situation that exists in the electrical issue in Europe, it is somewhat ironic when they are one of the sectors that spend the most electricity, not now , not even a few years ago.Ecological concept; it is something that has existed in hotels for many years, in fact they were ambassadors of the \"green\" or \"ecological\" concept at the beginning of the new century that one could get in many hotels and Europe has always been in the hotel industry with that concept.In some hotels there are things like \"please, help us to wash less,\" something like that . Hotel laundries generate a high electrical cost, among other things obviously.Sometimes this type of news is an unnecessary catalyst to say negative things about a real issue, I repeat it, but this hotel instead of reinventing itself and announcing reductions, they do the simple; ...\"we close and when things improve maybe we will open again,\"... it's okay, it's a logical business decision, perhaps framed in not being able to sustain prices in the face of the competition? not wanting to lower the status of the hotel?... the price of electricity in the tourist sector, like in many other sectors, is badly hit, but without a doubt it is one of those that can perhaps be better reinvented, most than other areas.I leave the article from an English source: https://pledgetimes.com/bills-of-500-thousand-euros-historic-hotel-chain-closes-in-puglia/Some of what I mention:QuoteIn addition, the survey highlights that serviced apartments – fully furnished apartments available for short and long-term stay, providing amenities similar to hotels - become the most attractive European asset in which to invest in 2021, due to positive demand fundamentals and leaner costs.Source:https://www2.deloitte.com/ro/en/pages/about-deloitte/articles/studiu-deloitte-industria-hoteliera-europeana-estimeaza-ca-va-ajunge-din-nou-la-nivelurile-de-performanta-din-2019-incepand-din-2023.htmlQuoteThe study also emphasizes that senior bank lending is expected to remain the most common source of debt financing in the European hotel market, according to two-thirds (66%) of the respondents, followed by the real estate investment funds (40%) and distressed debt funds (36%).Source:https://www2.deloitte.com/ro/en/pages/about-deloitte/articles/studiu-deloitte-industria-hoteliera-europeana-estimeaza-ca-va-ajunge-din-nou-la-nivelurile-de-performanta-din-2019-incepand-din-2023.htmlQuoteHotel facilities rank among the top five in terms of energy consumption in the tertiary building sector (minor only to food services and sales, health care and certain types of offices). Although no collective data is available on global energy consumption in the hotel sector, it is estimated that 97,5 TWh of energy was used in hotel facilities worldwide in 2001. Furthermore, the CHOSE project estimated that European hotels – which are reported to provide nearly half of the world total hotel rooms – used a total of 39 TWh (terawatt hours) in 2000, half of which is in the form of electricity.Most of this energy is derived from fossil sources, and the hotel sector’s contribution to global warming and climate change, is estimated to include annual releases between 160 and 200 kg of CO2 per m2 of room floor area, depending on the fuel mix used to provide energy. Global hotel-based CO2 emissions were assumed to be at the level of 55.7 Mt in 2001, while the estimated annual energy consumption for European hotel of 39 TWh, would result in emissions of more than 10 Mt of CO2 each year.Although no specific data have been reported for small and medium size hotels, a large proportion of CO2 emissions can be attributed to them. The hotel accommodation sector in Europe is dominated by small businesses, which provide around 90 per cent of the total number of rooms, and studies show that small independent hotels are less proactive about the environment than large hotel chains. Only 10 per cent of rooms are provided by large hotel chains, and it is these chains which have made most of the energyefficiency improvements in the hotel sector.source:https://www.e-unwto.org/doi/pdf/10.18111/9789284414970Whatever the matter is, the current situation definitely brings to the fore an issue that has always been resolved by bringing the costs to the end consumer and the polluting consequences to the environment. That is the true reality.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}