{
  "id": "topic_5420985",
  "title": "joker_josue",
  "author": "joker_josue",
  "created_time": "November 14, 2022, 05:57:53 PM",
  "content": "O CZ anunciou hoje que esta a prepara a criação de um fundo de resgate, que será aberto a todos outros co investidores.Tem o objetivo de “reduzir ainda mais os efeitos negativos em cascata do colapso da FTX para ajudar projetos que são fortes, mas estão em crise de liquidez”, segundo o twitter dele: https://twitter.com/cz_binance/status/1592044496174612482O anuncio deu um ligeiro animo ao mercado.Pessoalmente, acho esta ideia bem interessante, a criação desse tipo fundo, desde que o mesmo seja bem gerido e nunca seja usado como sistema de investimento.Vocês acham que esta ideia?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5420985",
  "comments": [
    {
      "author": "rdluffy",
      "created_time": "November 14, 2022, 06:43:18 PM",
      "body": "Será que vai funcionar como um seguro?Eu já vi uns projetos de DeFis que ofereciam um seguro, você pagava um valor X para ter um seguro de X caso acontecesse algum hack ou falha no contrato.Eu não consegui captar a ideia do CZ e desse novo fundo.Vamos ficar de olho, depois desses últimos acontecimentos da FTX vei ter bastante efeitos, mais pessoas irão ter a custódia das moedas, acho que as corretoras irão ficar com menos criptos, e novos serviços e soluções como essa deverão surgir.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "November 14, 2022, 11:21:08 PM",
      "body": "Quote from: rdluffy on November 14, 2022, 06:43:18 PMEu não consegui captar a ideia do CZ e desse novo fundo.Também ainda não sabemos muito sobre o assunto. Ele disse que dentro de dias daria mais detalhes. Veremos.Mas acho que deveria servir de um fundo, onde não eram os utilizadores a suportar, mas sim as exchanges e outras empresas. Caso um estilo FMI.Onde as empresas pagariam um fee para fazer parte do fundo e quando acontecia algo parecido ao que aconteceu ao FTX, o fundo iria ajudar a dar liquidez.Acredito que era algo que iria trazer mais estabilidade ao mercado, porque as pessoas iriam sentir-se de alguma forma mais protegidas.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TryNinja",
      "created_time": "November 25, 2022, 06:18:54 AM",
      "body": "A Binance lançou oficialmente o seu \"Web3 Industry Recovery Initiative\".Mais infos no post que eles fizeram: https://www.binance.com/en/blog/ecosystem/web3-leaders-join-binance-to-spearhead-web3-industry-recovery-initiative-5285759314040744618O valor inicial é de $1b em BUSD!! https://etherscan.io/address/0x043a80999cEe3711D372FB878768909fbE7F71E6#tokentxnsEles também estão aceitando a ajuda de outros grupos para crescer o fundo, e tem o objetivo de alcançar os $2b em um futuro próximo.\"Initially, Binance will commit USD 1 billion to IRI-themed investment opportunities with an intent to ramp up that amount to USD 2 billion in the near future if the need arises. So far, Jump Crypto, Polygon Ventures, Aptos Labs, Animoca Brands, GSR, Kronos and Brooker Group have also committed to participating with an initial aggregate commitment of around USD 50 million, and we expect more participants to join soon.\"",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Disruptivas",
      "created_time": "November 25, 2022, 10:30:49 AM",
      "body": "Quote from: TryNinja on November 25, 2022, 06:18:54 AMA Binance lançou oficialmente o seu \"Web3 Industry Recovery Initiative\".Mais infos no post que eles fizeram: https://www.binance.com/en/blog/ecosystem/web3-leaders-join-binance-to-spearhead-web3-industry-recovery-initiative-5285759314040744618O valor inicial é de $1b em BUSD!! https://etherscan.io/address/0x043a80999cEe3711D372FB878768909fbE7F71E6#tokentxnsEles também estão aceitando a ajuda de outros grupos para crescer o fundo, e tem o objetivo de alcançar os $2b em um futuro próximo.\"Initially, Binance will commit USD 1 billion to IRI-themed investment opportunities with an intent to ramp up that amount to USD 2 billion in the near future if the need arises. So far, Jump Crypto, Polygon Ventures, Aptos Labs, Animoca Brands, GSR, Kronos and Brooker Group have also committed to participating with an initial aggregate commitment of around USD 50 million, and we expect more participants to join soon.\"Me assusta um pouco a diferença entre o fundo da Binance e o valor agregado dos outros competidores. É uma diferença realmente muito grande.Outra coisa que fiquei pensando, não sei como vocês leram essa notícia. Mas parece uma estratégia muito bem marketizada de compra acionária a preços sub-valorizados . É quase um:Ei, me enviem sua submissão via forms se você tem um projeto muito bom e vai estar disposto a me vender parte por um valor super baixo  porque enfrenta problemas financeiros. Os critérios que eles estão analisando é inovação no longo prazo e um modelo de negócios super bom, não empresas com grande potencial de quebrar e aumentar os problemas do mercado. Não sei, o IRI me parece uma estratégia muito bem pensada da Binance aumentar seu poder no longo prazo. Mas talvez to bem errada.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "November 25, 2022, 10:41:46 AM",
      "body": "Quote from: TryNinja on November 25, 2022, 06:18:54 AMA Binance lançou oficialmente o seu \"Web3 Industry Recovery Initiative\".Obrigado pela atualização.Achei interessante eles deixarem claro que não é um fundo de investimento, e irão analisar caso a caso, para dar o financiamento/investimento as solicitações.Outro ponto interessante é eles estarem disponíveis para aceitar a banca tradicional em entrar no fundo.Quote from: Disruptivas on November 25, 2022, 10:30:49 AMMe assusta um pouco a diferença entre o fundo da Binance e o valor agregado dos outros competidores. É uma diferença realmente muito grande.Outra coisa que fiquei pensando, não sei como vocês leram essa notícia. Mas parece uma estratégia muito bem marketizada de compra acionária a preços sub-valorizados . É quase um:Não podes esperar que eles venham resgatar a tua empresa, sem nenhum contra partida, isso não faz qualquer sentido.Alias, tu para receberes o apoio, também tens de contribuir para o fundo.É quase como fosse um FMI para as empresas cripto.A questão agora é, quem gosta do FMI!?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gagux123",
      "created_time": "November 25, 2022, 10:54:43 PM",
      "body": "Bom, confesso que com relação a esse quesito eu esteja um pouco desatualizado.Assim como outros comentários nesse tópico, não consegui identificar com clareza a objetividade da criação desse fundo que o CZ esta querendo criar.Mas será mesmo que esse \"fundo de resgate\" poderá dar certo? E ou pelo menos isso poderá amenizar o estrago que a FTX causou no mercado!!?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TryNinja",
      "created_time": "November 25, 2022, 11:02:40 PM",
      "body": "Quote from: gagux123 on November 25, 2022, 10:54:43 PMMas será mesmo que esse \"fundo de resgate\" poderá dar certo? E ou pelo menos isso poderá amenizar o estrago que a FTX causou no mercado!!?A FTX já se foi. Parece que o foco deles vai ser em desastres futuros onde o erro vai além da pura incompetencia e malicia dos responsáveis ().Outro detalhe é que, pelo que eu entendi do post deles, alguns participantes poderão (deverão?) ter uma parceria bilateral com o fundo (i.e se der merda com outro projeto, vão ajudar): \"We expect some deals will be invested in unilaterally and others will be co-investments with all or some of the IRI participants\"",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "November 26, 2022, 12:50:26 AM",
      "body": "Quote from: gagux123 on November 25, 2022, 10:54:43 PMAssim como outros comentários nesse tópico, não consegui identificar com clareza a objetividade da criação desse fundo que o CZ esta querendo criar.Mas será mesmo que esse \"fundo de resgate\" poderá dar certo? E ou pelo menos isso poderá amenizar o estrago que a FTX causou no mercado!!?Pensa assim, tu és uma empresa e pretendes ter algum suporte caso ocorra problemas. Então colocas um X de dinheiro nesse fundo.Quando, por algum motivo, começas a ter problemas - antes de chegar a um ponto de rotura, solicitas apoio ao fundo. O fundo irá analisar o teu caso, e decidir dar ajuda ou não. Mas pelo menos tens o X dinheiro que lá colocas-te para aumentares a tua liquidez no imediato.É tipo o capital social de uma empresa, que alegadamente é \"obrigatório\" toda a empresa ter esse valor sempre guardado, para o caso de algum problema surgir ser um fundo que poderá ser usado.Claro que isto não resolve problemas já ocorridos. Mas poderá minimizar eventos semelhantes ao FTX, se as empresas solicitarem apoio antes de chegarem o ponto sem volta.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Disruptivas",
      "created_time": "November 26, 2022, 10:55:24 AM",
      "body": "Quote from: TryNinja on November 25, 2022, 11:02:40 PMOutro detalhe é que, pelo que eu entendi do post deles, alguns participantes poderão (deverão?) ter uma parceria bilateral com o fundo (i.e se der merda com outro projeto, vão ajudar): \"We expect some deals will be invested in unilaterally and others will be co-investments with all or some of the IRI participants\"Pra mim parece realmente o CZ buscando estruturar uma joint venture com os maiores players do setor, pra analisarem uns deals juntos e arcarem juntos com o risco de investir em empresas com bastante potencial e risco. Pra todo mundo ganhar ou perder junto. Mas ainda não ficou claro pra mim se as empresas que recebem esse fundo dão em troca equity ou alguma coisa para aqueles que injetam liqidez ou não. Eles analisam pontualmente, decidem se vale a pena ou não, se vale eles ainda entram com suporte de capital imaterial como citaram, mas ai será que criam um plano, se a empresa nao cumpri tem termos? To curiosa pra ver os detalhes desses ''resgates''. Quote from: joker_josue on November 25, 2022, 10:41:46 AMNão podes esperar que eles venham resgatar a tua empresa, sem nenhum contra partida, isso não faz qualquer sentido.Alias, tu para receberes o apoio, também tens de contribuir para o fundo.HMMMNão havia entendido essa parte, pra tu receber apoio tu tem que contribui pro fundo em que sentido?E não acho nada errado a contra-partida, só que pra mim ainda não ta tão claro esses detalhes.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "November 26, 2022, 12:12:39 PM",
      "body": "Quote from: Disruptivas on November 26, 2022, 10:55:24 AMHMMMNão havia entendido essa parte, pra tu receber apoio tu tem que contribui pro fundo em que sentido?E não acho nada errado a contra-partida, só que pra mim ainda não ta tão claro esses detalhes. Imagina um seguro. Tens de pagar uma mensalidade/anuidade para poderes ter acesso as condições contratadas.Se acontecer alguma coisa, coberta pelo seguro, você já não tem de pagar nada e usufruir das mesmas.Qual é a contrapartida? Tem de pagar uma mensalidade/anuidade regularmente, e ainda pode ter de pagar uma franquia para poder acionar o seguro.Aqui é a mesma coisa, a empresa tem de transferir capital para o fundo. E depois, caso precise de apoio, também tem de aceitar condições que sejam acordadas para receber o apoio (alem do seu próprio capital). Condições essas que pode envolver, restruturação da empresa, alterações de gestão, cortes de despesas, etc.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gagux123",
      "created_time": "November 27, 2022, 09:32:48 AM",
      "body": "Quote from: joker_josue on November 26, 2022, 12:50:26 AMÉ tipo o capital social de uma empresa, que alegadamente é \"obrigatório\" toda a empresa ter esse valor sempre guardado, para o caso de algum problema surgir ser um fundo que poderá ser usado.Quote from: TryNinja on November 25, 2022, 11:02:40 PMA FTX já se foi. Parece que o foco deles vai ser em desastres futuros onde o erro vai além da pura incompetencia e malicia dos responsáveis ().Outro detalhe é que, pelo que eu entendi do post deles, alguns participantes poderão (deverão?) ter uma parceria bilateral com o fundo (i.e se der merda com outro projeto, vão ajudar): \"We expect some deals will be invested in unilaterally and others will be co-investments with all or some of the IRI participants\"Então, a grosso modo eles estão criando algum tipo de medida preventida/corretiva com esse ocorrido da FTX...@joker_josue, Hmm... bom, pelo que entendi, a grosso modo falando, isso nada mais é do que um tipo de seguro veicular (fazendo uma rápida analogia com a realidade brasileira)Uma duvida, por exemplo, se caso eu sou uma exchange, não seria muito mais prático de eu mesmo criar esse tipo de reserva de emergencia/contingencia em minha corretora, e estar sempre fazendo auditoria e sendo transparentes com meus clientes?Deixar uma quantidade exorbitante de dinheiro/cripto, custodiado por um terceiro, não é algo arriscado? (mesmo que esse fundo esteja sendo regido por diversas empresas e várias autoridades por de tras)E se alguns desses administradores desse fundo, ser um SBF/Caroline Ellison da vida e f*der com tudo?E se alguma corretora der uma \"migué\" e inventar algum tipo de insolvencia somente para pegar essa grana dos demais membros desse fundo e fugir por ai sem dar nenhuma pista!!?  Não sei se estou falando alguma besteira, mas eu acredito que é interessante de se amadurecer melhor essa ideia!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "November 27, 2022, 12:07:42 PM",
      "body": "Quote from: gagux123 on November 27, 2022, 09:32:48 AMUma duvida, por exemplo, se caso eu sou uma exchange, não seria muito mais prático de eu mesmo criar esse tipo de reserva de emergencia/contingencia em minha corretora, e estar sempre fazendo auditoria e sendo transparentes com meus clientes?Deixar uma quantidade exorbitante de dinheiro/cripto, custodiado por um terceiro, não é algo arriscado? (mesmo que esse fundo esteja sendo regido por diversas empresas e várias autoridades por de tras)E se alguns desses administradores desse fundo, ser um SBF/Caroline Ellison da vida e f*der com tudo?E se alguma corretora der uma \"migué\" e inventar algum tipo de insolvencia somente para pegar essa grana dos demais membros desse fundo e fugir por ai sem dar nenhuma pista!!?  Não sei se estou falando alguma besteira, mas eu acredito que é interessante de se amadurecer melhor essa ideia! Tem toda a razão. A questão aqui é que fazer auto-costodia, por mais transparente que seja, não vai resolver o problema por dois motivos: pode sempre criar desconfiança por parte dos clientes; o valor pode não ser suficiente para suprir o rombo.Por sua vez, quem entra no fundo, acaba também por fazer parte da sua administração. Ou seja, tem uma palavra a dizer de como e quando o dinheiro é usado.Acho que a forma mais acertada de olhar para isto é como fosse um FMI cripto. No FMI todos os países aderentes, contribuem e tem poder de voto, conforme o seu nível contributivo. Depois quando tem um problema, solicitam o apoio, da qual o FMI \"empresta\" o dinheiro.Agora, se perguntares, se será assim que irá funcionar esse fundo? Bem, isso já não tenho a certeza, porque a informação não é muito clara. Mas também ainda só tem um membro, a Binance. As negociações devem surgir agora, para definir essas coisas.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gagux123",
      "created_time": "November 30, 2022, 10:15:35 PM",
      "body": "@joker_josue, complementando a nossa conversa, \"saca só\", saiu uma publicação bem interessante sobre esse fundo (não sei se alguem já viu)Bom, resumindo, ela nada mais vai ser que um FGC (Fundo Garantidor de Crédito)  (claro, fiz essa analogia superficialmente)Mais informações...\"FGC de criptos? Veja como vai funcionar o fundo bilionário liderado pela Binance\" https://trademap.com.br/agencia/criptoativos/fgc-de-criptos-veja-como-vai-funcionar-o-fundo-bilionario-liderado-pela-binance",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "alegotardo",
      "created_time": "December 01, 2022, 01:45:27 AM",
      "body": "Quote from: joker_josue on November 14, 2022, 11:21:08 PMQuote from: rdluffy on November 14, 2022, 06:43:18 PMEu não consegui captar a ideia do CZ e desse novo fundo.Também ainda não sabemos muito sobre o assunto. Ele disse que dentro de dias daria mais detalhes. Veremos.Mas acho que deveria servir de um fundo, onde não eram os utilizadores a suportar, mas sim as exchanges e outras empresas. Caso um estilo FMI.Onde as empresas pagariam um fee para fazer parte do fundo e quando acontecia algo parecido ao que aconteceu ao FTX, o fundo iria ajudar a dar liquidez.Acredito que era algo que iria trazer mais estabilidade ao mercado, porque as pessoas iriam sentir-se de alguma forma mais protegidas.Rapaz, imagina umas 2 ou três exchanges grandes quebrando na sequência..... você acha algum fundo salvaria?No Brasil também existe algo parecido que o Banco Central mantém para todas as instituições financeiras, onde, se não me engano, eles pagam até 250 mil por conta para cada um que for lesado pela quebra de algum banco.Já para criptos vejo grandes problemas.....- Primeiro que não tem como obrigar nenhuma exchange à participar, o que deve complicar um pouco a arrecadação de valores para o fundo.- Segundo, que provavelmente iria ter muito golpe de exchange \"pilantra\" falindo, e usuários fake querendo resgataresse fundo.Mas enfim... é preciso aguardar mais detalhes para saber ao certo como é que isso irá funcionar.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TryNinja",
      "created_time": "December 01, 2022, 03:00:25 AM",
      "body": "Quote from: alegotardo on December 01, 2022, 01:45:27 AM- Segundo, que provavelmente iria ter muito golpe de exchange \"pilantra\" falindo, e usuários fake querendo resgataresse fundo.Mas isso também só funcionaria em exchanges bem regulamentadas e auditáveis. Não é como se não existisse a possibilidade de um \"banco fake\" falir e vários usuários fakes querendo seus R$ 250k... (Claro que devido as várias regras e regulamentações do BC, isso acaba não sendo possível. O mesmo poderia ser aplicado com as exchanges.)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "December 01, 2022, 08:12:32 AM",
      "body": "Quote from: alegotardo on December 01, 2022, 01:45:27 AMJá para criptos vejo grandes problemas.....- Primeiro que não tem como obrigar nenhuma exchange à participar, o que deve complicar um pouco a arrecadação de valores para o fundo.- Segundo, que provavelmente iria ter muito golpe de exchange \"pilantra\" falindo, e usuários fake querendo resgataresse fundo.Tens toda a razão, são problemas bem reais.Mas, na minha visão de como a coisa devia funcionar minimamente, quem não participar, também não tem direito a pedir um resgate ao fundo. E se eventualmente, o fundo estiver disponível para fazer o resgate, antes terá de fazer uma auditoria para verificar a viabilidade da ajuda ou não.Por sua vez, ajuda nunca é sem contrapartidas. A primeira contrapartida, tem de ser a devolução do dinheiro ao fundo, pelo menos o valor que não era seu. E depois, poderia haver contrapartidas de restruturação, partilha de participação na empresa com as empresas do fundo, etc.Dai ver com algumas reticencias se uma exchange conseguiria dar o golpe. Podia acontecer, mas seria muito baixa probabilidade.Em relação haverem 2 ou 3 exchanges ao mesmo tempo a caírem, infelizmente não há mesmo muito a fazer. Mas, isso só acontece se as empresas deixarem ir até ao limite a sua má situação. Tem de existir uma mentalidade de solicitar ajuda logo quando o fogo começa, e não apenas quando a casa já está toda arder.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}