{
  "id": "topic_5401070",
  "title": "paxmao",
  "author": "paxmao",
  "created_time": "June 02, 2022, 06:57:17 AM",
  "content": "This was published in 2021 in the official EU portal:https://ec.europa.eu/commission/presscorner/detail/es/ip_21_2685QuoteToday, the European Commission is presenting to the Council its outline for a comprehensive plan of economic support to a future democratic Belarus. The plan, of up to €3 billion, reflects the European Union's commitment to support the Belarusian people's wishes for a peaceful democratic transition in the country following the Presidential elections of August 2020, which were neither free nor fair.Once Belarus embarks on a democratic transition, the EU will activate the €3 billion package, a mix of grants and loans leveraging public and private investments, to help Belarus to stabilise its economy, reform its institutions to make them more democratic and help increase the economy's resilience, growth potential and job creation.Just to put it in context, Belarus has 9 million habitants. This investment would be very significant.Is the opportunity gone? Lukashenko has shown that, while having the RF as largest commercial partner at the moment, the EU may be the future. It may catch you as a surprise but there are actual EU funded projects ongoing.https://euprojects.byDo you think the support to the Russian cause will cause these aids to cease? Is the relationship broken forever?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5401070",
  "comments": [
    {
      "author": "cabron",
      "created_time": "June 02, 2022, 07:24:22 AM",
      "body": "Not completely gone, countries need to trade with each other with products, its the progress but they don't need to be democratic to execute trade and build projects together.Why should a country really need to be democratic?  Why do we need them to be democratic, its their government, its not for EU or Us to do that. Its too obvious that they are now trying to lift the sanctions to Belarus, its just like what happen to Venezuela which its sanctions are also lift because they need its gas. Russia sits beside Belarus. The tables are turned actually, its the rest of EU who needed to be friendlier with Belarus and Russia.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NeuroticFish",
      "created_time": "June 02, 2022, 07:37:29 AM",
      "body": "Quote from: paxmao on June 02, 2022, 06:57:17 AMDo you think the support to the Russian cause will cause these aids to cease? Is the relationship broken forever?If it was not \"broken\" when the Ryanair flight hijack was done, I don't see what this war can change. Both have identical root cause: they have there a a dictatorship and that man has obviously chosen Putin's ways, instead of allowing in the \"western\" democracy.The only problem I see is that this kind of funds are allocated for certain financial cycles and the people of Belarus may still have that ruler there when the curent cycle ends.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "_act_",
      "created_time": "June 02, 2022, 07:54:36 AM",
      "body": "Quote from: paxmao on June 02, 2022, 06:57:17 AMDo you think the support to the Russian cause will cause these aids to cease? Is the relationship broken forever?The EU indirectly working against the plan of Lukashenko as he wants to completely be ruling Belarus, as he is very friendly with Russia, EU will still try better approach to make this possible but it is getting more difficult and getting more impossible especially if Russia dominates in the present Ukraine war.Quote from: cabron on June 02, 2022, 07:24:22 AMWhy should a country really need to be democratic?  Why do we need them to be democratic, its their government, its not for EU or Us to do that.It is Belarusian government not EU, that is true, but when many countries break away from USSR, the countries did not break away to be dictators or to practise dictatorial system of government, Belarus is not a dictatorial government, but their present president makes it dictatorial with the power he has.Quote from: cabron on June 02, 2022, 07:24:22 AMIts too obvious that they are now trying to lift the sanctions to Belarus, its just like what happen to Venezuela which its sanctions are also lift because they need its gas.As it is stated in the OP, it is published in 2021 before the Ukraine war started, Ukraine war started in 2022. The question Pamax is asking is that, what will happen after Belarus strongly supports Russia, will the EU plan to provide aid in support for democratic government in Belarus possible?Quote from: cabron on June 02, 2022, 07:24:22 AMRussia sits beside Belarus. The tables are turned actually, its the rest of EU who needed to be friendlier with Belarus and Russia.Russia is not friendly with NATO, Nato is like a threat to Russia, where will the friends come when one see one as enemy?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LoyceV",
      "created_time": "June 02, 2022, 07:57:29 AM",
      "body": "Quote from: paxmao on June 02, 2022, 06:57:17 AMQuoteOnce Belarus embarks on a democratic transition, the EU will activate the €3 billion package, a mix of grants and loans leveraging public and private investments, to help Belarus to stabilise its economy, reform its institutions to make them more democratic and help increase the economy's resilience, growth potential and job creation.EU buys influence in many countries, and it's one of the things I don't like about EU.QuoteLukashenko has shown that, ~, the EU may be the future.How did he show that? From what I've seen, he wants the opposite.QuoteDo you think the support to the Russian cause will cause these aids to cease? Is the relationship broken forever?No. EU continuously wants to expand (which is another thing I don't like about EU). There is no \"forever\". If Russia would play their cards right, I have no doubt EU would send them money too. A new \"EU friendly\" president in either of those countries would change everything again.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "paxmao",
      "created_time": "June 02, 2022, 08:44:31 AM",
      "body": "Quote from: LoyceV on June 02, 2022, 07:57:29 AMQuote from: paxmao on June 02, 2022, 06:57:17 AMQuoteOnce Belarus embarks on a democratic transition, the EU will activate the €3 billion package, a mix of grants and loans leveraging public and private investments, to help Belarus to stabilise its economy, reform its institutions to make them more democratic and help increase the economy's resilience, growth potential and job creation.EU buys influence in many countries, and it's one of the things I don't like about EU.QuoteLukashenko has shown that, ~, the EU may be the future.How did he show that? From what I've seen, he wants the opposite.QuoteDo you think the support to the Russian cause will cause these aids to cease? Is the relationship broken forever?No. EU continuously wants to expand (which is another thing I don't like about EU). There is no \"forever\". If Russia would play their cards right, I have no doubt EU would send them money too. A new \"EU friendly\" president in either of those countries would change everything again.I considered myself Belarus a puppet regime, cosy with Adolf Putin and all that. It turns out that is not that much. The opposition in Belarus is much stronger than in the RF and Putin has put Lukash in a very difficult positions. Sanctions have killed the dream of having a tech-hub in the country, the army has opposed strongly any order to help Putin in Ukraine and, on top of that, the opposition has actually sent soldiers to Ukraine... to fight on the Ukrainian side.Lukash has been accepting cooperation with EU, perhaps I overreached when saying he would accept democratic reforms.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Moneyprism",
      "created_time": "June 02, 2022, 09:36:01 AM",
      "body": "Quote from: cabron on June 02, 2022, 07:24:22 AMNot completely gone, countries need to trade with each other with products, its the progress but they don't need to be democratic to execute trade and build projects together.Why should a country really need to be democratic?  Why do we need them to be democratic, its their government, its not for EU or Us to do that. Its too obvious that they are now trying to lift the sanctions to Belarus, its just like what happen to Venezuela which its sanctions are also lift because they need its gas. Russia sits beside Belarus. The tables are turned actually, its the rest of EU who needed to be friendlier with Belarus and Russia.honestly, Belarus and Russia also need Europe because their trade mostly comes from European countries.. if they choose to trade with Asian countries or those they are friendly with, they need to give them discounts and the distance they have to travel also further away than to European countries",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "davis196",
      "created_time": "June 02, 2022, 10:39:24 AM",
      "body": "Belarus would never break the union with Russia and get close to the European Union. Even Lukashenko's successor won't be able to escape Russia's dominance.If Lukashenko somehow gets replaced by a pro-western president, Belarus will turn into Ukraine 2.0 and Russia will find an excuse to invade the country and start a war. Nobody wants that(maybe except USA).3 billion euro for a country with 9 million people are just peanuts, but those money would be enough to buy the loyalty of members of the Belarusian political elite. Anyway, I don't think that Lukashenko and his regime will be replaced anytime soon. The Belarusian opposition has been successfully oppressed and Lukashenko has the support of Putin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fiulpro",
      "created_time": "June 02, 2022, 12:25:10 PM",
      "body": "Currently I do think all of the EU countries will be heavily affected by the situation that's been happening in Ukraine, with the problem with the import of grains they would be dealing with short lived inflation which ofc would be somehow taken care of but one must understand that what they are doing is deplorable and is getting immense criticism. You think Belarus will keep associating with them ? -Well till now they have been helping them out with the drills and everything but I do think when any big body steps in they would be out faster than a rabbit. Russia have very few allies that they are supplying with cheap oil and other things, selling it in their currency, I think they both are benefiting from that but they have to stop otherwise they would get intense criticism, BUT some of the people from the country are coming together for Ukraine as well. Read here about their ties with Russia:  https://www.google.com/amp/s/www.independent.co.uk/news/world/europe/belarus-support-russia-why-ukraine-b2070413.html%3famp  https://www.npr.org/2022/05/31/1101265753/russia-ukraine-belarus-belarusian-volunteers-poland?t=1654172676400 I don't think we can be sure of anything of any sort right now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "June 02, 2022, 12:40:45 PM",
      "body": "Quote from: paxmao on June 02, 2022, 06:57:17 AMThis was published in 2021 in the official EU portal:https://ec.europa.eu/commission/presscorner/detail/es/ip_21_2685You didn't highlight the important part:QuoteThe massive financial assistance package that we can provide Belarus in the case of its democratic transition should be a genuine incentive for the current authorities to change their course.Basically, Belarus has to prove itself to be a democracy before even smelling that money, how many chances do you think it has with Lukaseshnko still in power? Second, why would he give up power for 3 billion that will help his country, and just like any EU cooperation funds are harder to be diverted and stolen when he could simply take like before whatever he wants.This was just a political move to show we are ready to do something once he is visiting the pet cemetery, so the people would know there will be no complete vacuum, but it matters zero in the actual context. The chances of Belarus changing are the same as North Korea, even if by a god's miracle Lukashenko would have an epiphany in one week there will be another special operation and no more Belarus.So, we could talk about China buying F35 with BTC from the US, it has the same chance of happening.Quote from: LoyceV on June 02, 2022, 07:57:29 AMNo. EU continuously wants to expand (which is another thing I don't like about EU). As a guy living in a country that joined the EU half a century after the Netherlands did, and who has benefited immensely from this, can I say that forum Switzerland should do something really naughty with his non-neutral opinions ??",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DrBeer",
      "created_time": "June 02, 2022, 12:51:13 PM",
      "body": "The problem of Belarus is that its, today’s illegitimate ruler, wants everything at once, and as the popular proverb says, “sit ass on two chairs at once”, and in Lukashenka’s version, it looks like it’s on five chairs at once  He wants with the EU (there money and other amenities), at the same time he is with Russia - because you can beg for money from Putin in exchange for all sorts of garbage. And in general, he wants to be a kind of pocket Fuhrer in his own country, because. on the one hand, he is envious that Putin managed to make a \"controlled biomass\" out of the population, on the other hand, he is very scared that in Belarus there is a massive rejection of him as a ruler. Another side is the situation with Ukraine. The army of the Republic of Belarus essentially refused to fight against Ukraine, helping the world terrorist Russia. Part of the population of the Republic of Belarus generally helps Ukraine in the fight against terrorists. Both the army and volunteers (these are not tame dogs from the police and riot police) can turn their barrels in his direction, and then his head will fly separately from the body, and very quickly! And all this in the complex suggests that he does not have long left, no matter what nonsense he carries on the air of Belarusian channels. Yes, and the EU, I want to see normal power on its borders, and not like Lukashenka. Therefore, the change of power and its normalization in Belarus is a matter of fairly close prospects. The people of Belarus deserve a good life and normal government. Жывe Бeлapycь !",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "June 02, 2022, 01:05:22 PM",
      "body": "Quote from: LoyceV on June 02, 2022, 07:57:29 AMEU buys influence in many countries, and it's one of the things I don't like about EU.And tell me who is not buying influence today, if we take into account the most powerful countries in the world? If you look at what China or the US are doing on this issue, but also what Russia has been doing for 20-30 years, then I would say that the EU is very incompetent in its efforts. Quote from: LoyceV on June 02, 2022, 07:57:29 AMNo. EU continuously wants to expand (which is another thing I don't like about EU). There is no \"forever\". If Russia would play their cards right, I have no doubt EU would send them money too. A new \"EU friendly\" president in either of those countries would change everything again.I also do not think it is wise for the EU to expand to the east, especially not for countries that are far from any cultural and civilizational norms to become part of the EU. If you look at the example of Serbia, which is a candidate country and has already closed a good part of the negotiating chapters while pursuing the same policy within the country with which they committed the greatest war crimes since WW2, then it is clear that all Russian crimes and actions will be forgotten in the future. In fact, Putin does not need bigger allies than the current French president or German chancellor, and the latter is one of the main obstacles in the EU's attempt to tighten its grip on Russia - new sanctions after 100 days of war? They do not help anyone, but only keep the patient alive and the enemies at a safe distance.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zlantann",
      "created_time": "June 02, 2022, 01:05:42 PMLast edit: June 02, 2022, 01:20:39 PM by Zlantann",
      "body": "Quote from: paxmao on June 02, 2022, 06:57:17 AMDo you think the support to the Russian cause will cause these aids to cease? Is the relationship broken forever?Even without the outbreak of this Ukraine invasion President Alexander Lukashenka would never have accepted this €3 billion package. It is like a bait or a Greek gift. The requirement to access this grant or support is a democratic transition and this means Lukashenka will be voted out as president. In a free and fair transition process Sviatlana Tsikhanouskaya or her husband Siarhei Tsikhanouski would clearly defeat him. Putin would be willing to double the sum EU is offering because Lukashenka is a worthy and strategic ally. Don't forget that Lukashenka owes Putin, hence the former is totally loyal to the later. Accepting the grant would be disloyalty to Russia. And for now Russia is a strategic trading partners Belarus and the later depends on the former in almost every sector of its economy and military.Russia accounts for 49 percent of the Belarusian foreign trade. Last year trade between both countries amounted to $ 40.1 billion, with exports to Russia reaching $ 16.4 billion and imports from Russia — $ 23.7 billion. For now, the autocratic government of Russia would not want top displease Russia.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ultegra134",
      "created_time": "June 02, 2022, 01:10:38 PM",
      "body": "I don't see a reason for Belarus to have any relations with the European Union. They have chosen their side by being allied with Russia and supporting the Ukrainian invasion and even held and supported Russian troops near the borders. First of all, their government is Russian-friendly and that would cause an outrage from Putin and secondly, I highly doubt that Belarus wants to have relations with the EU.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DrBeer",
      "created_time": "June 02, 2022, 01:16:10 PM",
      "body": "Quote from: davis196 on June 02, 2022, 10:39:24 AMBelarus would never break the union with Russia and get close to the European Union. Even Lukashenko's successor won't be able to escape Russia's dominance.If Lukashenko somehow gets replaced by a pro-western president, Belarus will turn into Ukraine 2.0 and Russia will find an excuse to invade the country and start a war. Nobody wants that(maybe except USA).3 billion euro for a country with 9 million people are just peanuts, but those money would be enough to buy the loyalty of members of the Belarusian political elite. Anyway, I don't think that Lukashenko and his regime will be replaced anytime soon. The Belarusian opposition has been successfully oppressed and Lukashenko has the support of Putin.Do you seriously believe in the existence of Russia after it loses the war to Ukraine? And after the entire civilized world, in fact, will erase this territory of evil from the world map? I do not recommend believing in fairy tales! True, this will not happen \"tomorrow\", but most likely in 2023. I confess honestly - I thought that already this year, assuming that Putin is even smarter. But it turned out that I was wrong in this assumption  I assumed that this parody of the Fuhrer would be smart enough to save the army (after all, he is afraid of everything that surrounds him), but he decided to completely destroy it about Ukraine. Well, so be it, it will be easier to deputinize and de-Russian them later",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fortify",
      "created_time": "June 02, 2022, 01:21:45 PM",
      "body": "Quote from: paxmao on June 02, 2022, 06:57:17 AMThis was published in 2021 in the official EU portal:https://ec.europa.eu/commission/presscorner/detail/es/ip_21_2685QuoteToday, the European Commission is presenting to the Council its outline for a comprehensive plan of economic support to a future democratic Belarus. The plan, of up to €3 billion, reflects the European Union's commitment to support the Belarusian people's wishes for a peaceful democratic transition in the country following the Presidential elections of August 2020, which were neither free nor fair.Once Belarus embarks on a democratic transition, the EU will activate the €3 billion package, a mix of grants and loans leveraging public and private investments, to help Belarus to stabilise its economy, reform its institutions to make them more democratic and help increase the economy's resilience, growth potential and job creation.Just to put it in context, Belarus has 9 million habitants. This investment would be very significant.Is the opportunity gone? Lukashenko has shown that, while having the RF as largest commercial partner at the moment, the EU may be the future. It may catch you as a surprise but there are actual EU funded projects ongoing.https://euprojects.byDo you think the support to the Russian cause will cause these aids to cease? Is the relationship broken forever?Lukashenko is cut from the same cloth as Putin and was actually trying to position himself to take over from Yeltsin before Putin got a grip on power. Once these two greedy and selfish old men run out of time it will free an opportunity up a small window of opportunity for these countries yet again. Unfortunately these windows often get seized by the next dictator instead of offering a chance for democracy and innovation to thrive.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "be.open",
      "created_time": "June 02, 2022, 01:34:32 PM",
      "body": "Quote from: Fortify on June 02, 2022, 01:21:45 PMLukashenko is cut from the same cloth as Putin and was actually trying to position himself to take over from Yeltsin before Putin got a grip on power. Once these two greedy and selfish old men run out of time it will free an opportunity up a small window of opportunity for these countries yet again. Unfortunately these windows often get seized by the next dictator instead of offering a chance for democracy and innovation to thrive.What really surprises me about the adherents of Western democracy is their absolute intolerance to alternative forms of government and their aggressive attitude towards any manifestation of dissent in the sphere of government. Why try to equate everyone with the same brush, ignoring natural diversity for historical reasons and differences in cultural traditions?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DrBeer",
      "created_time": "June 02, 2022, 01:51:42 PM",
      "body": "Quote from: Lucius on June 02, 2022, 01:05:22 PMI also do not think it is wise for the EU to expand to the east, especially not for countries that are far from any cultural and civilizational norms to become part of the EU. If you look at the example of Serbia, which is a candidate country and has already closed a good part of the negotiating chapters while pursuing the same policy within the country with which they committed the greatest war crimes since WW2, then it is clear that all Russian crimes and actions will be forgotten in the future. ....Be kind - and inform in which country you live, we will understand who is close to culture and civilized norms!  Well, seriously - it's very interesting to understand what you put into these concepts. But let it be on the example of your country, as they say \"a living example\"! I'm sure there will be many \"surprises\" if we delve into the study of \"culture\" ...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "June 02, 2022, 03:13:20 PM",
      "body": "Quote from: DrBeer on June 02, 2022, 01:51:42 PMBe kind - and inform in which country you live, we will understand who is close to culture and civilized norms!  Well, seriously - it's very interesting to understand what you put into these concepts. But let it be on the example of your country, as they say \"a living example\"! I'm sure there will be many \"surprises\" if we delve into the study of \"culture\" ...I hate to repeat things, and most already know what country I come from - the thing is pretty obvious to anyone who wants to know it. I think that my country is also very far from the standards that would classify it as an appropriate member of the EU, but Brussels bureaucrats considered it a desirable cube in their mosaic because of its geostrategic position and of course cheap labor. I know that you strongly represent the interests of your country and I have nothing against Ukraine becoming a member of the EU one day, but in less than 10 years since my country become EU member we lost over 400 000 people, paid a lot of money into the EU budget and fell on the bottom of the same EU. If you are naive to think that the EU will solve Ukraine's problems now or in the future, then you live in that belief - in 100 days of war they hardly did anything concrete - without US military aid, where would Ukraine be today?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mometaskers",
      "created_time": "June 02, 2022, 04:55:39 PM",
      "body": "Only if the Belarussians rise up and get rid of their dictator, like what Ukrainians did. And then just like Ukraine they'd probably be attacked by Russia too. I'm actually surprised how Latvia and Estonia managed to get into both NATO and EU. Finland also managed to get into EU but it seems in also joining NATO would be what would finally piss of Russia. I guess Ukraine is just too important to allowed into EU/NATO or it's just unlucky with the timing (Russian aggression tend to peak during high oil prices).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}