{
  "id": "topic_5404544",
  "title": "Question:",
  "author": "Boristhecat",
  "created_time": "June 29, 2022, 04:53:46 PM",
  "content": "Continuation of a topic [CHESS] World Championship 2021: Carlsen Vs. Nepomniachtchi that has turned into a global discussion of chess. Now with voting. So, now the Candidates Tournament is underway, the winner of which will fight against Carlsen. If Carlsen refuses, then the top 2 of the tournament will play the crown among themselves.https://www.chess.com/article/view/fide-candidates-chess-tournament-2022Current results: https://www.chess.com/events/2022-fide-candidates-chess-tournament/resultsCarlsen said last year that he would not defend the title unless Aliza Firouzja was the challenger. Judging by the table, Firouzja had almost no chance left. Will we see a vacant champion seat at the end of this tournament and a match for the crown without a reigning champion?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5404544",
  "comments": [
    {
      "author": "Boristhecat",
      "created_time": "June 30, 2022, 12:12:13 PM",
      "body": "After yesterday's defeat by Caruana, Nepomniachtchi is 1.5 points ahead and now it is almost guaranteed to win the tournament - there has never been a case in the history of chess when the leader did not win the Candidates Tournament with a 1.5 point advantage. Quotes bookmakers, by the way, are very generous:Win in tournament Yes NoNepomniachtchi Jan 1.22 3.80Nakamura X 4.70 1.15Ding Liren 10.00 1.03Caruana F 10.00 1.03",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "KTChampions",
      "created_time": "June 30, 2022, 04:55:05 PM",
      "body": "Nepomniachtchi has just beaten Firuja for the second time and I would say that the tournament has already ended ahead of schedule (although given the behavior of Magnus, the importance of second place cannot be denied).If Nepomniachtchi scores 1.5 points in the remaining three games, then this will be an absolute record - at the moment, the record is 9 points.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "South Park",
      "created_time": "July 01, 2022, 03:11:43 AM",
      "body": "Quote from: KTChampions on June 30, 2022, 04:55:05 PM  Nepomniachtchi has just beaten Firuja for the second time and I would say that the tournament has already ended ahead of schedule (although given the behavior of Magnus, the importance of second place cannot be denied).If Nepomniachtchi scores 1.5 points in the remaining three games, then this will be an absolute record - at the moment, the record is 9 points.2 months ago I read an article in which Carlsen stated that it was unlikely he will play against the winner of the candidate tournament and at the time he did not even mention Firouzja at all, so unless he goes through a change of heart then most likely we are not going to see Carlsen defend his title at all, however if that is the case then there is still interest in the candidate tournament as there is only a distance of half a point between Ding and Nakamura.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "qwertyup23",
      "created_time": "July 01, 2022, 10:00:26 AM",
      "body": "Thank you very much for creating this thread! This is badly needed given the fact that the reputation of chess has been steadily increasing over the years.With that being said, Nepo has been dominating the candidates again this year. He plays so dynamic and fundamental- even if his opponents are very well prepared, he seems to create ideas on the board which makes further complications.While there may have been speculations and news regarding Carlsen's withdrawal of the WCC match, I doubt that he will hand it out easily to Nepo, if the latter would win this year again. Though I was specifically rooting for Caruana and Rapport, seeing a rematch between Carlsen and Nepo would still be a fun thing to watch!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "l3pox",
      "created_time": "July 01, 2022, 01:00:59 PM",
      "body": "great continuation, last topic was really goodDo you think Carlsen will maintain his word and play only if it is Aliza Firouzja?why do you think he wants that?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "KTChampions",
      "created_time": "July 01, 2022, 06:25:34 PM",
      "body": "Quote from: South Park on July 01, 2022, 03:11:43 AMQuote from: KTChampions on June 30, 2022, 04:55:05 PM  Nepomniachtchi has just beaten Firuja for the second time and I would say that the tournament has already ended ahead of schedule (although given the behavior of Magnus, the importance of second place cannot be denied).If Nepomniachtchi scores 1.5 points in the remaining three games, then this will be an absolute record - at the moment, the record is 9 points.2 months ago I read an article in which Carlsen stated that it was unlikely he will play against the winner of the candidate tournament and at the time he did not even mention Firouzja at all, so unless he goes through a change of heart then most likely we are not going to see Carlsen defend his title at all, however if that is the case then there is still interest in the candidate tournament as there is only a distance of half a point between Ding and Nakamura.Magnus has long talked about how he felt happier before he became world champion so he would like to get rid of this burden, but Firouzja (as a representative of the new generation) could motivate him. In recent interviews, he evaded the direct question of whether he would defend the title, but said that \"he, like everything else, changes his mind, but if he goes to something for a long time, then no.\" Looks like he's going to give up title defense after all.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "STT",
      "created_time": "July 01, 2022, 08:23:54 PM",
      "body": "Chess always had good reputation, its just recently it got a bit more popular and been recognized by another generation.QuoteCarlsen said last year that he would not defend the title unless Aliza Firouzja was the challenger.Only Firouzja is a worthy opponent or somehow he finds that potential game less tiresome from an opponent who will be good practice to beat?  Must be nice to be so successful you can decline games as not worth your bother    I guess I can understand the preference for more interesting challenges and some people are better to spar against then others whose moves are blunt, slightly arrogant attitude but he's earnt that.Nakaumura streams games on twitch I think, he would be refused I know Carlsen has played casually vs some relatively minor twitch streams",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MonsterV",
      "created_time": "July 01, 2022, 08:53:31 PM",
      "body": "The concept still remains extremely curious. The current world champion in classic chess, Magnus Carlsen, does not have to complete any qualifying series and basically only has to play a final against the challenger who wins this tournament. Firouzja started the tournament very badly and basically eliminated himself with that. The notable name I'm missing from this tournament is Anish Giri. Actually, it should be a normal formula, just like playing football. Protective status is ridiculous.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Boristhecat",
      "created_time": "July 02, 2022, 10:01:27 AM",
      "body": "Quote from: qwertyup23 on July 01, 2022, 10:00:26 AMThank you very much for creating this thread! This is badly needed given the fact that the reputation of chess has been steadily increasing over the years.With that being said, Nepo has been dominating the candidates again this year. He plays so dynamic and fundamental- even if his opponents are very well prepared, he seems to create ideas on the board which makes further complications.While there may have been speculations and news regarding Carlsen's withdrawal of the WCC match, I doubt that he will hand it out easily to Nepo, if the latter would win this year again. Though I was specifically rooting for Caruana and Rapport, seeing a rematch between Carlsen and Nepo would still be a fun thing to watch!My level of play does not allow me to make serious conclusions, but I see that commenting grandmasters who cover this tournament say that the level of the tournament is low. Kramnik, Polgar and some others spoke about this. But this is not Nepomniachtchi's fault - if Firouzja plays 250 games with minute time control at night instead of a normal rest before the game with him, then these are his problems.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "KTChampions",
      "created_time": "July 02, 2022, 03:01:11 PM",
      "body": "Quote from: MonsterV on July 01, 2022, 08:53:31 PMThe concept still remains extremely curious. The current world champion in classic chess, Magnus Carlsen, does not have to complete any qualifying series and basically only has to play a final against the challenger who wins this tournament. Firouzja started the tournament very badly and basically eliminated himself with that. The notable name I'm missing from this tournament is Anish Giri. Actually, it should be a normal formula, just like playing football. Protective status is ridiculous.This format has long been criticized (including by the current champions), but it has historically developed and so far there have been no shifts in changing it. And by the way, if you look deep into history, this is a much better format than it was before - once the current champion appointed his own opponents or could put forward absolutely unrealistic conditions for a duel.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TopT3ns",
      "created_time": "July 02, 2022, 03:40:59 PM",
      "body": "Quote from: KTChampions on July 02, 2022, 03:01:11 PMQuote from: MonsterV on July 01, 2022, 08:53:31 PMThe concept still remains extremely curious. The current world champion in classic chess, Magnus Carlsen, does not have to complete any qualifying series and basically only has to play a final against the challenger who wins this tournament. Firouzja started the tournament very badly and basically eliminated himself with that. The notable name I'm missing from this tournament is Anish Giri. Actually, it should be a normal formula, just like playing football. Protective status is ridiculous.This format has long been criticized (including by the current champions), but it has historically developed and so far there have been no shifts in changing it. And by the way, if you look deep into history, this is a much better format than it was before - once the current champion appointed his own opponents or could put forward absolutely unrealistic conditions for a duel.I think a formation like this is also very balanced because all chess pieces already have their respective duties and can have the opportunity to protect each other, if it is changed to another formation I think it will make the chess master strategize again because until now the game of chess has a key point that can make the enemy lose with a few small steps.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zackgeno96",
      "created_time": "July 02, 2022, 08:58:17 PM",
      "body": "It will also be a hassle to adjust. Of course you also have all kinds of similarities and moreover the current world champion (Magnus Carlsen) will not feel like it either. He will then complain that it will cost him too much energy and that it will be at the expense of his level. In a way he is right, but all players suffer from this, right? I don't really understand why they never changed those rules. Now he has a big advantage because he only has to eliminate 1 opponent.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dothebeats",
      "created_time": "July 02, 2022, 09:04:20 PM",
      "body": "Ding is on fire lately. Alireza is playing new lines, and Nakamura is, IMO, not entirely prepared based on how he develops his pieces. Nepomniachtchi also amazes me with how he handles his end game fairly recently. Ding, Alireza, and Nakamura are my top 3 contenders in this tournament, not so much about Nepo although he's been playing a stellar chess in his recent matches. I hope Magnus accepts the challenge, and let us, the viewers, see some more tricks hidden up these GM's sleeves when facing the world champion.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "KTChampions",
      "created_time": "July 03, 2022, 02:18:47 PM",
      "body": "Quote from: South Park on July 01, 2022, 03:11:43 AMQuote from: KTChampions on June 30, 2022, 04:55:05 PM  Nepomniachtchi has just beaten Firuja for the second time and I would say that the tournament has already ended ahead of schedule (although given the behavior of Magnus, the importance of second place cannot be denied).If Nepomniachtchi scores 1.5 points in the remaining three games, then this will be an absolute record - at the moment, the record is 9 points.2 months ago I read an article in which Carlsen stated that it was unlikely he will play against the winner of the candidate tournament and at the time he did not even mention Firouzja at all, so unless he goes through a change of heart then most likely we are not going to see Carlsen defend his title at all, however if that is the case then there is still interest in the candidate tournament as there is only a distance of half a point between Ding and Nakamura.After I read your message I checked your trust and I was not surprised to read what it says   You should be more careful when you reply to messages  Nepomniachtchi plays against Rapport with White, has a better position and the advantage of two bishops. Given that he is satisfied with a draw today, he will become the official winner of the tournament.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "l3pox",
      "created_time": "July 04, 2022, 01:03:21 PM",
      "body": "Quote from: STT on July 01, 2022, 08:23:54 PMChess always had good reputation, its just recently it got a bit more popular and been recognized by another generation.<..>I wonder how much the Netflix series \"Queen's gambit\" affected chess' reputationwe know media can shape the culture in really interesting (and sometimes bad ways), in this case it probably affected it but not sure if we can measure how much and in which countries.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cryptock",
      "created_time": "July 04, 2022, 05:15:15 PM",
      "body": "Quote from: Lucasgabd on July 04, 2022, 01:03:21 PMQuote from: STT on July 01, 2022, 08:23:54 PMChess always had good reputation, its just recently it got a bit more popular and been recognized by another generation.<..>I wonder how much the Netflix series \"Queen's gambit\" affected chess' reputationwe know media can shape the culture in really interesting (and sometimes bad ways), in this case it probably affected it but not sure if we can measure how much and in which countries.Queen Gambit is a fine series and in another forum there was so much discussion made on it. I don't think chess has been affected by the series it came recently but it is good to see how kids can choose a good line and stick to it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "l3pox",
      "created_time": "July 05, 2022, 03:53:33 PM",
      "body": "Quote from: Cryptock on July 04, 2022, 05:15:15 PMQuote from: Lucasgabd on July 04, 2022, 01:03:21 PMQuote from: STT on July 01, 2022, 08:23:54 PMChess always had good reputation, its just recently it got a bit more popular and been recognized by another generation.<..>I wonder how much the Netflix series \"Queen's gambit\" affected chess' reputationwe know media can shape the culture in really interesting (and sometimes bad ways), in this case it probably affected it but not sure if we can measure how much and in which countries.Queen Gambit is a fine series and in another forum there was so much discussion made on it. I don't think chess has been affected by the series it came recently but it is good to see how kids can choose a good line and stick to it. maybe it wasn't that much, but would be nice to look at the datait was the series that really motivated me to learn more about chess theory and technique and to play more often same thing for some of my friendsbut would love to check online chess websites number of users over time to try to see if there are any correlations",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "qwertyup23",
      "created_time": "July 06, 2022, 10:53:23 PM",
      "body": "So this year's candidates, Nepo actually won again and he will be facing Magnus for the 2nd time! What are your thoughts on this?I see that on the chess community, a lot of people are upset that Nepo won. Maybe this is due to the fact that they wanted to see a new opponent facing Magnus since Nepo got destroyed last year after he crumbled from his loss on Game 6 of their match on 2020 WCC. Do you guys think that Magnus will participate in this year's candidates despite him telling not to?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hydrogen",
      "created_time": "July 06, 2022, 11:35:03 PM",
      "body": "Quote from: MonsterV on July 01, 2022, 08:53:31 PMThe concept still remains extremely curious. The current world champion in classic chess, Magnus Carlsen, does not have to complete any qualifying series and basically only has to play a final against the challenger who wins this tournament. Firouzja started the tournament very badly and basically eliminated himself with that. The notable name I'm missing from this tournament is Anish Giri. Actually, it should be a normal formula, just like playing football. Protective status is ridiculous.The champion is the biggest draw.His name is the one, people come to see. He draws the largest crowds. Giving the competition the most authenticity and legitimacy.And so they make efforts to give him an advantage in the game.The same thing happens in boxing where names like Canelo are protected and given advantages in judging.It also happens in MMA to an extent. Where the champion in past japanese Pride tournaments would know who they would be fighting. While their opponent would not know until the last second who their opponent would be.It could be considered logistics or statistics, moreso than unfairness to some extent.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}