{
  "id": "topic_5457084",
  "title": "JamesDaniel90",
  "author": "JamesDaniel90",
  "created_time": "June 21, 2023, 12:01:13 PM",
  "content": "2024/25 will be my first bull run and I have been patiently buying and holding for over a year now. Just wondering for those who were in the last bull run what it was like and how fast prices pump during the peak bull times? Any advice on how to prepare when it comes to being ready to take profit?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5457084",
  "comments": [
    {
      "author": "swogerino",
      "created_time": "June 21, 2023, 12:23:20 PM",
      "body": "Quote from: JamesDaniel90 on June 21, 2023, 12:01:13 PM2024/25 will be my first bull run and I have been patiently buying and holding for over a year now. Just wondering for those who were in the last bull run what it was like and how fast prices pump during the peak bull times? Any advice on how to prepare when it comes to being ready to take profit? I have been in 2021 bull run and it happened at least 3 times back then,first February 2021,I sold everything and I suggest you do the same as I don't know if 2025 will have another 3 bull runs,then it was in April/May 2021 and then in October 2021,the first one in February lasted about 2 weeks and that was also the case with the other ones with that of April/May maybe 3 weeks and some days but the average time the bull runs remain is from 2 weeks to 4 weeks and a few days max,so I think you have enough time to sell your coins at a huge profit.Congrats for being such patient,very few people have this kind of patience.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kelvinid",
      "created_time": "June 21, 2023, 12:47:10 PM",
      "body": "Quote from: JamesDaniel90 on June 21, 2023, 12:01:13 PM2024/25 will be my first bull run and I have been patiently buying and holding for over a year now. Just wondering for those who were in the last bull run what it was like and how fast prices pump during the peak bull times? If you heard about x1000, that something will happen to some altcoins that got hyped or even more. In fact, even shitcoins have the chance and it pumps more than these potential and leading coins in the CMC. QuoteAny advice on how to prepare when it comes to being ready to take profit? Just imagine that, if you are too lucky to get the coins that hyped during the bull season, you'd be rich instantly. If you have noticed, many people are accumulating new projects which they believe will give them fortune during Bullrun but I should also warn you not to spend more money on them, choosing Bitcoin and potential altcoins are still safe choices.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tvplus006",
      "created_time": "June 21, 2023, 01:36:00 PM",
      "body": "Quote from: JamesDaniel90 on June 21, 2023, 12:01:13 PM2024/25 will be my first bull run and I have been patiently buying and holding for over a year now. ..It would be interesting to know from you which coins you are buying, in the hope that they will bring profit in the bull market. As a rule, altcoins bring more profit than BTC, but the risk of losing your money by buying altcoins is much higher. Therefore, I do not recommend keeping all your capital in altcoins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rhomelmabini",
      "created_time": "June 21, 2023, 02:27:35 PM",
      "body": "Quote from: JamesDaniel90 on June 21, 2023, 12:01:13 PM2024/25 will be my first bull run and I have been patiently buying and holding for over a year now. Just wondering for those who were in the last bull run what it was like and how fast prices pump during the peak bull times? Any advice on how to prepare when it comes to being ready to take profit? Unless you'll be patient on when will it comes, that's still a rope you need to hold so you wouldn't fall on that steep cliff, by saying that it's your first bull run. Patience is the key and it may test you a lot of times. A year might be long but you need another year or so. Just remember Bitcoin always be the main driver of this bull run, major altcoins, and then these shitcoins will follow. You may think it's already enough but as far as my two bull runs, there will be waves of pump and not just one but to time if it's the top will be the hardest. To be prepared to take profit, don't expect a lot and plan a little. Plan on getting out will be the main key, so you need to mark those levels.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hd49728",
      "created_time": "June 21, 2023, 02:44:57 PM",
      "body": "Quote from: JamesDaniel90 on June 21, 2023, 12:01:13 PM2024/25 will be my first bull run and I have been patiently buying and holding for over a year now. I wish you luck but in bear market, many risk with altcoins and let's hope good things for altcoin projects you invested in. Take caution if you are storing your altcoins in exchange accounts. Those projects can be fine but you will lose your coins if exchanges go down.QuoteJust wondering for those who were in the last bull run what it was like and how fast prices pump during the peak bull times? It is hard to say when the market reaches its peak, when altcoin season comes to over and what is peak of an altcoin price. You can not know all those things exactly and you will have to take profit when you feel it is good enough.Taking profit is a good practice and you must do it. You should try to take profit and get your original capital back as it is a safe capital management. If you want to try with luckiness, you can hold rest amounts to wait for higher price but doing this with afford to lose it all.QuoteAny advice on how to prepare when it comes to being ready to take profit? When you see a price rises x2 from your entry price, it's time to consider taking profit and get original capital for safety first.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "masulum",
      "created_time": "June 21, 2023, 02:55:52 PM",
      "body": "Of the several bullish times in the past, bitcoin bullish times will be followed by bullish altcoins. Then, if bitcoin reaches a new ATH, the alt season will start in a few weeks from 1 - 3 months, depending on market conditions as well. However, during the bullish process before ATH, we will see how altcoins start to show pumping. if this pattern repeats, then we will see an alternating market, after BTC corrections in that period, altcoin will start to rise.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Doan9269",
      "created_time": "June 21, 2023, 03:09:54 PM",
      "body": "Quote from: JamesDaniel90 on June 21, 2023, 12:01:13 PM2024/25 will be my first bull run and I have been patiently buying and holding for over a year now. Just wondering for those who were in the last bull run what it was like and how fast prices pump during the peak bull times? Any advice on how to prepare when it comes to being ready to take profit? If you truly want to partake of the bullrun when it comes, try and maintain this safety precautions, know the kind of currency you will buy because not all cryptocurrencies can be regarded as a digital currency, if the coin you've invested has a good market potential and the developers and investors are very active in giving it the support needed to keep alive the existence of the coin, you can go ahead investing on them after taking your own research about them using various parameters to serve as an indication to wether or not a good potential coin to invest, then you will have to hodl and sell when youre desired aim is achieved.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "el kaka22",
      "created_time": "June 21, 2023, 05:02:33 PM",
      "body": "Depends on the altcoin, I have seen ones that fail to break their previous ATH, and I have seen ones that went 100x as well, so it depends on what you are asking.The biggest ever I saw was 1000x, and I am not even joking, I have seen someone making 1000x return with it, of course that wasn't just the increase in price, but they were staking it, so they got some more after they bought it and made more of the same token, and the price of the token went up a lot too, combining those two together made it 1000x, but this is so rare that it would probably only happen like once or twice per huge bull run, which means there will be TENS OF THOUSANDS of projects, and every 4 years we only get 1 or 2 of them do something like this, please try to not aim at that, it probably won't happen.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "woez",
      "created_time": "June 21, 2023, 05:10:44 PM",
      "body": "Quote from: masulum on June 21, 2023, 02:55:52 PMOf the several bullish times in the past, bitcoin bullish times will be followed by bullish altcoins. Then, if bitcoin reaches a new ATH, the alt season will start in a few weeks from 1 - 3 months, depending on market conditions as well. However, during the bullish process before ATH, we will see how altcoins start to show pumping. if this pattern repeats, then we will see an alternating market, after BTC corrections in that period, altcoin will start to rise. It makes a lot of sense, I think there are several objective reasons that can support your statement regarding altcoins following the bullish trend of Bitcoin namely that if you look at it Historically, there have been trends that show that when Bitcoin is experiencing strong bullish times, altcoins also tend to experience significant growth. This is due to many investors making profits from Bitcoin and then looking for investment opportunities in the altcoin market.Then When Bitcoin reaches a new All-Time High (ATH), some investors may take profits by selling some of their Bitcoins. That capital can then flow into the altcoin, creating higher demand and driving up the price. This could happen because investor interest is shifting from Bitcoin to altcoins in an effort to seek higher profit opportunities.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bittraffic",
      "created_time": "June 21, 2023, 05:17:48 PM",
      "body": "It's always like the market learns that when people starts dumping, the market adjusts and suddenly shows prices are climbing up again. One piece of advice that I listen to is that watch out for the BTC chart all the time in the monthly chart because if it peaks there like ATH, regardless of the price still rising up, you sell already because it's just a matter of time. Hold your stablecoin for good before deciding to so something about it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jackl87",
      "created_time": "June 21, 2023, 05:41:32 PM",
      "body": "Quote from: JamesDaniel90 on June 21, 2023, 12:01:13 PM2024/25 will be my first bull run and I have been patiently buying and holding for over a year now. Just wondering for those who were in the last bull run what it was like and how fast prices pump during the peak bull times? Any advice on how to prepare when it comes to being ready to take profit? Well first of all i am surprised that you are so sure that there will be a bullrun coming in 2024/25. I know the BTC halving had good effects on the prices the last few times it happened but that does not automatically mean that it will happen in the same way again.Usually a bull run starts with rising prices of bitcoin itself this will go on for quite a while until the pump stops. Then the big altcoins are starting their run and even after that the small altcoins also begin to pump.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Natalim",
      "created_time": "June 21, 2023, 06:08:42 PM",
      "body": "I will tell you OP that the most interesting part of crypto is during the bull season and why? Because this is the time to see the unexpected happen in most altcoins which also includes worthless coins. Those who have had a remarkable experience in the past 2 bullrun where they can see altcoins that pump x1000, we can still expect this time again. That is why when the bull season is coming, people are buying more on altcoins, not Bitcoin because of that possible situation. Honestly, I was excited to check MyEther wallet, especially for my airdrop coins during the bull season, and hoping for something.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "livingfree",
      "created_time": "June 21, 2023, 06:32:22 PM",
      "body": "Quote from: JamesDaniel90 on June 21, 2023, 12:01:13 PM2024/25 will be my first bull run and I have been patiently buying and holding for over a year now. Just wondering for those who were in the last bull run what it was like and how fast prices pump during the peak bull times? Any advice on how to prepare when it comes to being ready to take profit? Just don't time the market, everyone has got different experiences during the bull run. Many have sold too early before the actual came in because that's already profit and that's fine instead of missing a moment to take profits.You've said that you've been buying and holding so, there's no more advice that I can give to you but just be consistent and hopefully the cryptos that you're holding are the top notch. E.g Bitcoin",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "$crypto$",
      "created_time": "June 21, 2023, 06:55:07 PM",
      "body": "Quote from: tvplus006 on June 21, 2023, 01:36:00 PMQuote from: JamesDaniel90 on June 21, 2023, 12:01:13 PM2024/25 will be my first bull run and I have been patiently buying and holding for over a year now. ..It would be interesting to know from you which coins you are buying, in the hope that they will bring profit in the bull market. As a rule, altcoins bring more profit than BTC, but the risk of losing your money by buying altcoins is much higher. Therefore, I do not recommend keeping all your capital in altcoins.He must understand what coin he is holding, whether the coin has the potential to be bullish next, if he only buys a coin that is not very popular, then don't expect too much because it tends to be a higher risk than bitcoin, even though it's not 1000x the increase from the next bullish.I myself won't be brave enough if it's just all altcoins, especially with a new project, of course, that's a risk, unless a few other top coins have the possibility to go higher and for OP, you have to have a target to sell at a price that will come in the following year.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Furious 7",
      "created_time": "June 21, 2023, 07:33:05 PM",
      "body": "Quote from: JamesDaniel90 on June 21, 2023, 12:01:13 PM2024/25 will be my first bull run and I have been patiently buying and holding for over a year now. Just wondering for those who were in the last bull run what it was like and how fast prices pump during the peak bull times? Any advice on how to prepare when it comes to being ready to take profit? It all comes back to the coins you buy, I think because if you look at the altcoins, when there is an increase, they will slowly follow suit and the profits may be bigger, but things like this will only happen to coins that are quite good in terms of popularity, and you could say big coins in altcoins but if it's just shitcoins I think something like that don't expect much because they won't care about bullish or bearish because all they care about is pump and dump whenever when they're ready to do so don't expect too much about that matter because in the end this will only make you disappointed by itself if you believe too much in something like this.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o48o",
      "created_time": "June 21, 2023, 07:53:27 PM",
      "body": "Quote from: JamesDaniel90 on June 21, 2023, 12:01:13 PM2024/25 will be my first bull run and I have been patiently buying and holding for over a year now.I congratulate you for your fresh optimism that there will be a bull run then for your alts.Quote from: JamesDaniel90 on June 21, 2023, 12:01:13 PMJust wondering for those who were in the last bull run what it was like and how fast prices pump during the peak bull times? You'll most likely get wrong answers only. But you haven't told us what you are hodling. There's really not any good estimate for that. You can take a look from your coin's history you have from the coinmarketcap. How long took it last time, and after that you just wish it would repeat. It however doesn't do that, history in the chart doesn't repeat itself, it can be similar but not exactly same. Your altcoin might also just die while others grow.Quote from: JamesDaniel90 on June 21, 2023, 12:01:13 PMAny advice on how to prepare when it comes to being ready to take profit? This is always hard. Don't assume you can sell the top. Very few people can. Settle for profit you can get and don't look back that because you might regret selling. Also looking back will most likely make you buy back too early as you think the bear is just a dip.Best signals to me are delusional people. Influencers popping up everywhere, high level coverage in press of people who made it, jealousity all around and everyone selling will be called fudsters, and everyone around you is telling that you are crazy to sell. And i am now talking a top of altcoin bull market, not just one single altcoin.Selling in the top reminds me of leap of faith in indiana jones. Your whole body tells you it's insane to sell now, but you need to take a leap of faith to an invisible ledge and hope it holds and you didn't make a mistake by believing in yourself.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Quidat",
      "created_time": "June 21, 2023, 07:59:21 PM",
      "body": "Quote from: JamesDaniel90 on June 21, 2023, 12:01:13 PM2024/25 will be my first bull run and I have been patiently buying and holding for over a year now. Just wondering for those who were in the last bull run what it was like and how fast prices pump during the peak bull times? Any advice on how to prepare when it comes to being ready to take profit? When that bull run happens then you would definitely see that most coins in the market specially to those top rankers on CMC or CG would really be climbing up into their prices. It would really be simply like a tug of war on placing themselves on top of the rank. There are old  coins who would really be be increasing like hell when it comes into its value but there are some new coins that would really be climbing out too. There's no way that we could really be able to predict on which one but for sure there would really be projects would be like that. How fast?You would be seeing for yourself and this would really be giving out that good feeling. For now the best time to do is to accumulate coins while we are still that in bear or accumulation phasebecause once bull run kicks in then you would really be finding yourself that getting left behind.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DeathAngel",
      "created_time": "June 21, 2023, 08:10:50 PM",
      "body": "Quote from: JamesDaniel90 on June 21, 2023, 12:01:13 PM2024/25 will be my first bull run and I have been patiently buying and holding for over a year now. You’ve been doing the right thing, you’re half way there by just having that discipline. Human nature means most people buy in the mania phase at the top & sell in panic on the way down. Not all of us are winners in life hey buddy My advice to a newbie would be that to get rich you’ll probably need to hold for a few cycles but that doesn’t mean you can’t scalp some off the top of your stash in 2025 & buy back in the next bear market or even just enjoy some profits. Sell 25% in 2025, 20% in fiat or stables & buy 4 or 5 x the amount you sold in 2026/27. Maybe you can have some fun with the remaining 5% of what you sold.You’ll then be in a really good position for future cycles.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Johnyz",
      "created_time": "June 21, 2023, 08:59:48 PM",
      "body": "It can be a quick pump and I’m telling you, most of the projects are being hyped and you will be tempted to buy more. Many project will have its new ATH and you can have the chance on making more profit. The way you prepared right now will matter the most, so better to start planning and do your best to accumulate more this bear trend, because in bull market its all about securing profit.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}