{
  "id": "topic_5465815",
  "title": "larry_vw_1955",
  "author": "larry_vw_1955",
  "created_time": "September 06, 2023, 05:00:18 AM",
  "content": "https://decrypt.co/154580/tethers-stablecoin-usdt-has-a-peg-stability-problem-claims-analystIn response to these findings, Carey suggested that Tether should consider removing its redemption fee and minimum requirements.\"The redemption fee is a USDT-specific problem. USDC does not have such a fee; stablecoin issuers currently make most of their money from the yield they earn on the USD deposits that they hold,\" Carey told Decrypt. \"Given the U.S.'s high rate environment, I see no reason why USDT keeps its redemption fee intact unless it is actually intended to reduce redemptions. If that's the case, it's short-sighted because it makes USDT's peg worse.\"and then this:Another catch is that users have to pay a non-refundable amount of $150 for “verification,” which, according to Tether, “is intended to ensure that only those who are serious about establishing an account apply.”good luck with using tether everyone. you're going to need it if this thing depegs.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5465815",
  "comments": [
    {
      "author": "Apocollapse",
      "created_time": "September 06, 2023, 08:49:32 AM",
      "body": "It's ridiculous if USDT asking for redemption fee or pay $150 for verification.With Binance asking everyone to convert their BUSD to other stable coin, this give USDT price increase since current 24 hours BUSD trading volume, there are around 15% convert to USDT, so this give USDT price increase.If USDT price pegged back to $1, no one will care about de-peg, centralization, not fully backed, and any other problems.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Tytanowy Janusz",
      "created_time": "September 06, 2023, 10:32:24 AM",
      "body": "Quote from: larry_vw_1955 on September 06, 2023, 05:00:18 AMI see no reason why USDT keeps its redemption fee intact unless it is actually intended to reduce redemptions.Another catch is that users have to pay a non-refundable amount of $150 for “verification,” which, according to Tether, “is intended to ensure that only those who are serious about establishing an account apply.”USDT price is stable thanks to big marketmakers and arbitrage traders. You can sell your USDT on almost every single crypto exchange for other stable coin or $$. There is no reason for tether to have to serve small retail investors, because all it does is increase the company's operating costs and contribute to the formation of holes in the balance sheets. For me it is completely understandable that the company, when it does not have to, avoids unnecessary costs, which would be hiring thousands of employees to handle the kyc of each investor with 100USDT in the wallet free of charge and to handle tickets created on the basis of \"I sent to the wrong wallet, now what?\"the whole, both the article from the link and the entire OP, I consider nothing more than creating FUD and confusing insolvency / liquidity problems with cutting unnecessary costs. At the moment, tether FUD has been with us for years and yet, no large investor has ever had a problem with payout.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o48o",
      "created_time": "September 06, 2023, 08:44:32 PM",
      "body": "Quote from: larry_vw_1955 on September 06, 2023, 05:00:18 AM-cut-Another catch is that users have to pay a non-refundable amount of $150 for “verification,” which, according to Tether, “is intended to ensure that only those who are serious about establishing an account apply.”-cut-I am assuming that this has been the case whole time and i just never noticed it. I assume that most people are trading it against something else in exchanges anyway, so it doesn't really concern majority of people, and whom it concerns are so rich that they wouldn't care about 150 dollarsBut just in princible this is not good. In fact how is this even legal? Imagine banks doing this? Withdrawing physical from cash from ATM would cost $150 and people would riot and lose their minds. So how is tether getting away with this crap?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blockman",
      "created_time": "September 06, 2023, 11:29:51 PM",
      "body": "I don't like Tether even before but at some point of my life, I have to use it and that had helped me a lot with my transactions and holdings as well. Some may misunderstood that this is pertaining to each user, no. Because if you don't have an account on their website, you don't have to. Please read the whole details on Tether's website.Quote from: https://tether.to/en/fees/Verification fee150 USD in Tether TokensThis amount is non-refundable but can be part of your Redemption. The verification fee is intended to ensure that only those who are serious about establishing an account apply. The fee also helps offset a portion of the incurred costs from the execution of a robust verification process. To comply with applicable laws Tether maintains the sole discretion to approve or not approve accounts. By submitting a verification request you agree that the 150 USD₮ deposit is non-refundable. Read carefully here before proceeding.* This represents the current minimum amount required for a fiat withdrawal or deposit.Note: Please exercise extreme care when depositing tokens. In cases where token recovery is needed due to a deposit mistake, Tether may, in certain limited cases and in its sole discretion, attempt to assist you to recover your token(s) and will charge you fees as determined here.Tether does not offer wallet functionality for any digital tokens. Withdrawal requests for digital tokens held by Tether are evaluated per request and can take several days to process.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GreatArkansas",
      "created_time": "September 07, 2023, 01:28:48 AM",
      "body": "Quote from: Apocollapse on September 06, 2023, 08:49:32 AM(...)With Binance asking everyone to convert their BUSD to other stable coin, this give USDT price increase since current 24 hours BUSD trading volume, there are around 15% convert to USDT, so this give USDT price increase.We are not sure, Binance seems advertising this new stablecoin called FDUSD (First Digital USD) and they also open a promo for a pair of BUSD/FDUSD like converting your BUSD to FDUSD.I agree with you that there could be some people will convert BUSD to USDT but there are lot of stablecoins now like USDC or DAI and some could start buy it with Bitcoin as Bitcoin is kinda cheap right now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "larry_vw_1955",
      "created_time": "September 07, 2023, 04:27:20 AM",
      "body": "Quote from: Tytanowy Janusz on September 06, 2023, 10:32:24 AMUSDT price is stable thanks to big marketmakers and arbitrage traders. You can sell your USDT on almost every single crypto exchange for other stable coin or $$. There is no reason for tether to have to serve small retail investors, because all it does is increase the company's operating costs and contribute to the formation of holes in the balance sheets. For me it is completely understandable that the company, when it does not have to, avoids unnecessary costs, which would be hiring thousands of employees to handle the kyc of each investor with 100USDT in the wallet free of charge and to handle tickets created on the basis of \"I sent to the wrong wallet, now what?\"if tether is real money then you should be able to redeem it without paying any fee at all.Quotethe whole, both the article from the link and the entire OP, I consider nothing more than creating FUD and confusing insolvency / liquidity problems with cutting unnecessary costs. At the moment, tether FUD has been with us for years and yet, no large investor has ever had a problem with payout.this seems problematic though:“USDT has a peg stability problem. Its redemption fee and minimum means it’s often rational for USDT holders to sell the token on the market rather than redeem it for USD with Tether,” wrote Carey. “As liquidity has dwindled, the market is no longer able to absorb significant USDT selling.”did you read the article?Quote from: o48oBut just in princible this is not good. In fact how is this even legal? Imagine banks doing this? Withdrawing physical from cash from ATM would cost $150 and people would riot and lose their minds. So how is tether getting away with this crap?yeah imagine your bank saying they won't give you your money until it reaches $100,000 amount! that would be BS.from the article:Currently, Tether charges a 0.1% fee for fiat withdrawals over $1,000, meaning that USDT is redeemable at $0.99, with the minimum fiat withdrawal or deposit set at $100,000.and just imagine your bank telling you they don't want your money unless it is $100,000 or more, no deposits allowed! find some untrusted third party like FTX that you can deposit your hard earned money but not with us.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Tytanowy Janusz",
      "created_time": "September 07, 2023, 07:32:17 AMLast edit: September 07, 2023, 12:57:49 PM by Tytanowy Janusz",
      "body": "Quote from: larry_vw_1955 on September 07, 2023, 04:27:20 AMif tether is real money then you should be able to redeem it without paying any fee at all.this is nonesense. 1- why would a private company provide you with services for free2- no one claims tether is real money3- even if they do, that still doesn't mean they can't charge you for delivering the product4- define \"real money\"Quote from: larry_vw_1955 on September 07, 2023, 04:27:20 AMthis seems problematic though:“USDT has a peg stability problem. Its redemption fee and minimum means it’s often rational for USDT holders to sell the token on the market rather than redeem it for USD with Tether,” wrote Carey. “As liquidity has dwindled, the market is no longer able to absorb significant USDT selling.”did you read the article?yes i read the article and it is nothing but FUD written to get more views.This is not problematic at all. This is how it was invented and, as you can see, it works, because the spread between the dollar and USDT exchange rate is negligible. and this happens thanks to the fact that small amounts can be exchanged between users on centralized exchanges, which does not require tether intervention. only when sentiment pulls the price in one direction, large marketmakers and arbitrage traders start to act, for whom the $100,000 minimum transaction is like nothing. They kill the spread for small profit and everyone is happy.Quote from: larry_vw_1955 on September 07, 2023, 04:27:20 AMyeah imagine your bank saying they won't give you your money until it reaches $100,000 amount! that would be BS.from the article:Currently, Tether charges a 0.1% fee for fiat withdrawals over $1,000, meaning that USDT is redeemable at $0.99, with the minimum fiat withdrawal or deposit set at $100,000.and just imagine your bank telling you they don't want your money unless it is $100,000 or more, no deposits allowed! find some untrusted third party like FTX that you can deposit your hard earned money but not with us.  Tether is not a bank. it's like saying a bicycle is worse than a tomato because you can't make ketchup out of a bicycle. the transaction fee using Visa reaches 5%, but it is solved so cleverly that this cost is borne by the product seller not the customer. The customer lives in ignorance that the visa is free. The truth is that the entrepreneur has included this cost in the price of the product thus making it 5% more expensive. but you're right, it's better to write FUD articles that tether imposes a 0.1% fee XDXD and if its \"real money\" it should be free XD\"Currently, Tether charges a 0.1% fee for fiat withdrawals over $1,000, meaning that USDT is redeemable at $0.99, \" this would be correct with 1% fee. With 0.1% its 0.999$ not 0.99$",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "September 07, 2023, 08:16:01 AM",
      "body": "For sure this will not be implemented. Thats 0.1% is really pain in the ass if someone would withdraw to fiat. Plus what this redemption fee? Im not sure everyone using or cashing out on tether would like this. They will definitely lose users once they go and try this path.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "larry_vw_1955",
      "created_time": "September 08, 2023, 03:47:29 AM",
      "body": "Quote from: Tytanowy Janusz on September 07, 2023, 07:32:17 AMthis is nonesense. 1- why would a private company provide you with services for freebecause it is my moneyQuote2- no one claims tether is real moneyeveryone pretends like it is including tether so yeah it is real money just as real as any printed money like the us dollar.Quote3- even if they do, that still doesn't mean they can't charge you for delivering the productso it's ok for my bank to charge me a withdrawal fee just to get some of my own money? i won't do business with them if they treat me like that most likely.  Quote4- define \"real money\"usdt, usdc, anything that pretends like it is backed up by the us dollar would be a good start.Quoteyes i read the article and it is nothing but FUD written to get more views.then try this article instead they can't all be lying can they?https://zycrypto.com/despite-usdts-recent-depeg-tethers-market-share-is-larger-than-its-ever-been/QuoteThis is not problematic at all. This is how it was invented and, as you can see, it works, because the spread between the dollar and USDT exchange rate is negligible. and this happens thanks to the fact that small amounts can be exchanged between users on centralized exchanges, which does not require tether intervention. only when sentiment pulls the price in one direction, large marketmakers and arbitrage traders start to act, for whom the $100,000 minimum transaction is like nothing. They kill the spread for small profit and everyone is happy.it works until it doesn't work but by then it's too late to save alot of people from losing their money. so it works but that doesn't guarantee it will always work.QuoteTether is not a bank. it's like saying a bicycle is worse than a tomato because you can't make ketchup out of a bicycle. they are in a more powerful position than a bank. they're like the federal reserve where they can print money. out of thin air.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Tytanowy Janusz",
      "created_time": "September 08, 2023, 05:32:52 AMLast edit: September 08, 2023, 06:40:41 AM by Tytanowy Janusz",
      "body": "Quote from: larry_vw_1955 on September 08, 2023, 03:47:29 AMbecause it is my moneyso it's ok for my bank to charge me a withdrawal fee just to get some of my own money? i won't do business with them if they treat me like that most likely.  So use it however you want. Just don't use their service, you wont have to pay fee. USDT is not mandatory. It's just a company product. You can use or not. And you can cash out for free even 10$ just use intermediary. If they would introduced free KYC for everyone and no minimum transactions, it would end up with high fees or balance sheet hole. What they did was nothing more than outsourcing this utility to the market and cexs. The market is known for performing such operations cheaper and better.Once again. Tehter is not a bank. it doesn't have a 0% fractional reserve, it doesn't have infinite liquidity from the Fed, deposits are not FDIC backed, it can't generate \"real\" dollars out of thin air using accounting manipulations between several banks, and banks are not free too, thy charge account maintenance fees if certain criteria are not met (at least in my country).. Once again. Don't compare a tomato to a bicycle.Quote from: larry_vw_1955 on September 08, 2023, 03:47:29 AM2- no one claims tether is real moneyeveryone pretends like it is including tether so yeah it is real money just as real as any printed money like the us dollar.4- define \"real money\"usdt, usdc, anything that pretends like it is backed up by the us dollar would be a good start.you are confusing money with currency. USDT, USDC, BUSD, TUSD is not money. Even US dollar is not \"real money\" because it does not meet the criterion of storing value over time.Quote from: larry_vw_1955 on September 08, 2023, 03:47:29 AMthen try this article instead they can't all be lying can they?https://zycrypto.com/despite-usdts-recent-depeg-tethers-market-share-is-larger-than-its-ever-been/welcome to the better side of the force. YES THEY ALL LY. ALL THE TIME. modern journalism means writing paid articles - $0.03 per character on a given topic by a sponsor.Do you remember the recent Bitcoin dump from 29k to 25k? What news hit the market at a low? I will remind you:Breaking: SpaceX Unloads $373M Worth of Bitcoin HoldingsBTC it previously acquired by $373 million and sold the cryptocurrencySpaceX sold $373M worth of Bitcoin acquired in 2021-2022Elon Musk's SpaceX Liquidates Entire $373000000 BitcoinUnpacking SpaceX Bitcoin 2021-2022 sales worth $373MBitcoin Crashes Below $25k As SpaceX Sells All BTCThat day, it turned out that all these websites (coingape, cointelegraph, investing.com and more) were spreading fake news, because spaceX did not sell even 1 bitcoin. The only thing spaceX did was record a paper loss in its books.I do not say I'm convinced that the tether is indestructible and that it is 100% secure. I'm just saying that the fact, that their \"unit generation/burning service\" is used by large players only is not evidence of any problems.Quote from: larry_vw_1955 on September 08, 2023, 03:47:29 AMit works until it doesn't work but by then it's too late to save alot of people from losing their money. so it works but that doesn't guarantee it will always work.you are talking about a case in which all market makers, as one man, seeing a 5% spread between the USDT rate on the market and the USDT to USD exchange rate on the tether platform will say to themselves... screw it, I have already earned enough, I don't need more money... and no one in the world will decide to replace them, because no one will have $100,150 to earn $5,000 in 5 minutes by doing 1 simple arbitrage. If you think this crazy scenario is likely, then tether TOS may actually be problematic.Quote from: larry_vw_1955 on September 08, 2023, 03:47:29 AMthey are in a more powerful position than a bank. they're like the federal reserve where they can print money. out of thin air.1XDXDXD",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "larry_vw_1955",
      "created_time": "September 09, 2023, 06:47:58 AM",
      "body": "Quote from: Tytanowy Janusz on September 08, 2023, 05:32:52 AMyou are talking about a case in which all market makers, as one man, seeing a 5% spread between the USDT rate on the market and the USDT to USD exchange rate on the tether platform will say to themselves... screw it, I have already earned enough, I don't need more money... and no one in the world will decide to replace them, because no one will have $100,150 to earn $5,000 in 5 minutes by doing 1 simple arbitrage. If you think this crazy scenario is likely, then tether TOS may actually be problematic.how is someone going to earn $5000 in 5 minutes without someone else losing it? that's the problem. so yeah the whole thing is problematic about losing peg. whether it goes down to $0.95 or up to $1.05 neither is good and somebody is going to lose money.  if it's worth $0.95 then obviously people holding tether are getting screwed. if it's worth $1.05 well then guess what? no one wants to buy their tether from them at $1.05 because guess why not. they can't sell it to tether for that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nutildah",
      "created_time": "September 09, 2023, 07:51:40 AM",
      "body": "Quote from: larry_vw_1955 on September 06, 2023, 05:00:18 AMgood luck with using tether everyone. you're going to need it if this thing depegs.  No one in crypto will be safe if Tether depegs... the ramifications will be bad for every single coin, including Bitcoin. Tether's market cap is twice as large as all other stablecoins put together:https://coinmarketcap.com/view/stablecoin/Some precedence for this lies in what happened with Luna's stablecoin, TUSD. The failure of LUNA/TUSD had far-reaching effects that culminated in the insolvency of FTX. While a lot of systemic risk was exposed last year, the negative effects of a USDT depeg would be far greater in magnitude.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Tytanowy Janusz",
      "created_time": "September 09, 2023, 08:08:37 AMLast edit: September 09, 2023, 11:18:25 AM by Tytanowy Janusz",
      "body": "Quote from: larry_vw_1955 on September 09, 2023, 06:47:58 AMhow is someone going to earn $5000 in 5 minutes without someone else losing it? that's the problem. so yeah the whole thing is problematic about losing peg. whether it goes down to $0.95 or up to $1.05 neither is good and somebody is going to lose money.  if it's worth $0.95 then obviously people holding tether are getting screwed. if it's worth $1.05 well then guess what? no one wants to buy their tether from them at $1.05 because guess why not. they can't sell it to tether for that. So what? my example was to prove to you that the fact that you need to have $100,000 to work with tether is not a \"Peg Stability Problem\", because there will always be a big arbitrage trader who will bring the USDT price very close to the USD value as long as tether is solvent. Arbitrage traders have huge competition and fight each other for hundredths of a cent. So you started the entire thread to warn people (or rather create FUD) that USDT on the market may temporary drop to USD 0.998, i.e. by 0.2%. and you tell this to people who put their life savings into meme coins that can drop by 99% in one day.Tether may have many problems, such as insolvency in the way singature bank turned out to be insolvent (bank run combined with a temporary paper loss on bonds becasue of rising interest rates). Situation when they will be forced to sell bonds on loss even though it would bring guaranteed profits in a few months/years (guaranteed by the US government). It would be good to discuss this topic, rather than tether small clients policy - outsourcing them to CEXs and arbitrageurs.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "larry_vw_1955",
      "created_time": "September 10, 2023, 04:25:10 AM",
      "body": "Quote from: nutildah on September 09, 2023, 07:51:40 AMSome precedence for this lies in what happened with Luna's stablecoin, TUSD. The failure of LUNA/TUSD had far-reaching effects that culminated in the insolvency of FTX. While a lot of systemic risk was exposed last year, the negative effects of a USDT depeg would be far greater in magnitude. i'm not sure there is a huge difference between tether and luna but i guess some people would disagree. they were both depending on companies. sure tether has a longer stronger track record \"seems\" more competent but no one really knows for sure what's going on behind the scenes. Quote from: Tytanowy JanuszSo what? my example was to prove to you that the fact that you need to have $100,000 to work with tether is not a \"Peg Stability Problem\", because there will always be a big arbitrage trader who will bring the USDT price very close to the USD value as long as tether is solvent. i don't know that tether is \"solvent\". so i think you're making an assumption. i also don't know how long the company behind tether will last. could be a long time might not be we don't know do we? but one thing is for sure which is that it won't last as long as bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Tytanowy Janusz",
      "created_time": "September 10, 2023, 05:30:58 AM",
      "body": "Quote from: larry_vw_1955 on September 10, 2023, 04:25:10 AMi'm not sure there is a huge difference between tether and luna but i guess some people would disagree. they were both depending on companies. sure tether has a longer stronger track record \"seems\" more competent but no one really knows for sure what's going on behind the scenes. Luna and TUSD was an algorithmic stablecoin that was not backed by any deposits from the real world. TUSD volatility (deviation from the value of $1) was stabilized by transferring volatility from TUSD to LUNA, through the TUSD burning and LUNA minting system and vice versa. So basically the stability of BUSD depended on the stability of the protocol and the collapse was caused by fragility on a black swan event (bear market combined with bank run). There was not a single dollar backing TUSD.USDT works completely differently and its stability depends on the amount of reserves in the vault.Quote from: larry_vw_1955 on September 10, 2023, 04:25:10 AMi don't know that tether is \"solvent\". so i think you're making an assumption. i also don't know how long the company behind tether will last. could be a long time might not be we don't know do we? but one thing is for sure which is that it won't last as long as bitcoin.I agree here, but I would like to point out that the fact that tether does not support small customers and forces people to pay for KYC is not an indicator of problems that may or may not exist.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "larry_vw_1955",
      "created_time": "September 10, 2023, 05:45:25 AM",
      "body": "Quote from: Tytanowy Janusz on September 10, 2023, 05:30:58 AMLuna and TUSD was an algorithmic stablecoin that was not backed by any deposits from the real world. TUSD volatility (deviation from the value of $1) was stabilized by transferring volatility from TUSD to LUNA, through the TUSD burning and LUNA minting system and vice versa. So basically the stability of BUSD depended on the stability of the protocol and the collapse was caused by fragility on a black swan event (bear market combined with bank run). There was not a single dollar backing TUSD.ok then i guess a better thing to compare tether to would be usdc then.https://forkast.news/circle-customers-could-redeem-all-usdc-in-one-day/I wonder if tether could say the same. saying and doing is 2 different things but if you can't even say it then you probably can't do it at all! at least usdc is saying it.QuoteUSDT works completely differently and its stability depends on the amount of reserves in the vault.it also depends on a group of people, namely the people running tether. they can do whatever they want to. hopefully they always do the right things.QuoteI agree here, but I would like to point out that the fact that tether does not support small customers and forces people to pay for KYC is not an indicator of problems that may or may not exist.well the $150 for kyc is really not the big barrier as compared to the $100,000 minimum withdrawal/deposit is it? what if they upped the kyc fee to $100,000 and the minimum withdrawal/deposit to $1,500,000? at what point does it become a scam? and who makes that determination.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Xal0lex",
      "created_time": "September 10, 2023, 02:25:55 PM",
      "body": "Another scary cautionary tale about Tether? Except history shows that USDT has the ability to recover quickly from all sorts of de-pegs, and it doesn't have much impact on its capitalization and level of dominance among other stablecoins. History shows us that no matter how bad things are said about USDT, it still shows much better reliability than USDC, BUSD, TUSD, etc.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "larry_vw_1955",
      "created_time": "September 12, 2023, 12:29:03 AM",
      "body": "Quote from: Xal0lex on September 10, 2023, 02:25:55 PMAnother scary cautionary tale about Tether? Except history shows that USDT has the ability to recover quickly from all sorts of de-pegs, and it doesn't have much impact on its capitalization and level of dominance among other stablecoins. History shows us that no matter how bad things are said about USDT, it still shows much better reliability than USDC, BUSD, TUSD, etc.why does a company need to be involved in tether though. people have to trust a company! isn't that like the antithesis of bitcoin? you would think with all the high tech blockchain stuff we wouldn't have to rely on a company. even relying on a government would be an improvement over that, i would think. but who wants to rely on a government. so it's really bad. bad all around. tether could just stop redeeming tethers and the value of usdt would go to 0. because no one else redeems it except tether!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bluebit25",
      "created_time": "September 12, 2023, 04:06:40 AM",
      "body": "Quote from: larry_vw_1955 on September 12, 2023, 12:29:03 AMwhy does a company need to be involved in tether though. people have to trust a company! isn't that like the antithesis of bitcoin? you would think with all the high tech blockchain stuff we wouldn't have to rely on a company. even relying on a government would be an improvement over that, i would think. but who wants to rely on a government. so it's really bad. bad all around. tether could just stop redeeming tethers and the value of usdt would go to 0. because no one else redeems it except tether!More realistic to this story would be that you see things like trading btc/food, water, fire, cigarettes, electricity,... but no it's not happening like that and what people is using and the desire I see here is harmony from bitcoin, not isolation from theory. The terms decentralization, or centralization label many things. I see sometimes people just want to prove a stance on an issue they support, the general view here is that Tether is still very important anyway. In this market and in the future after all the FUD or negative opinions from someone, it is still the main choice of users.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}