{
  "id": "topic_5403679",
  "title": "AB de Royse777",
  "author": "AB de Royse777",
  "created_time": "June 22, 2022, 08:14:10 PMLast edit: June 22, 2022, 10:25:11 PM by Royse777",
  "content": "To be exact, on September 4th last year (https://ibb.co/Jp60CpB) Lucy approached me and asked about me wearing his affiliate signature, then slowly the development was to have a signature campaign for his affiliate link. Bitcointalk user Zwei on October 6th (https://ibb.co/1q6S6br) was hired to design the signature set. I started by giving the exact date and will try to continue with the dates where it's possible or I will write from my memory with possible references I can use. I contacted several reputable forum users to hire them for the signature campaign. Everything was ready. Lucy was ready to spend over $10k  on this campaign. But at some point, It did not look right to me because spending $10k on an affiliate link without having any website of your own or not having at least a lead capturing page is just a waste of money (anyone experienced with affiliate marketing will understand what I mean here). I told Lucy that do you think it worth spending that amount of money just on an affiliate link? We had long conversations, in fact from the beginning we talked to each other (on chat) almost most of the days. He always left me the impression that he is a very wealthy man and also open minded. We continued and he decided not to launch the campaign.We continued talking to each other until December 11th 2021 (https://ibb.co/pxLVhHS)On April 17th (https://ibb.co/x6SHBvr) he came back after a long time and offered me a full time job with the link of BitLucy that the site is almost ready. He decided to launch his own casino. I was happy to realize that this man valued my words and was even smarter enough that he came up with a better plan than I was thinking.The site was not up yet but after a few hours it went up. And it was looking great. However I was not ready for such offers for myself so I asked him to give me time to think about his offer. In the meantime he told me to be on call the next morning. I was not ready for that either. It's the habit of a usual Bitcoin user. My privacy was important to me.I had to think the entire night. The beginning, development of the relationship between him and me with so many other factors just to convince myself to trust him. It was not easy but the next morning we were on a call. We talked about the project, future plans and everything. At the end he gave me a better offer of being his partner and he will share a 10% GGR of total review. I did not have an idea of GGR at that time but he explained. Although I wanted something to start with a fixed salary so once the project becomes bigger and revenue starts coming then my plan was to ask for a small share. But since he was saying it's a better offer then I did not deny. That's how I started with BitLucy.We launched on bitcointalk. Everyone was excited. I was asked to build up a team. He was busy with other sides (development, providers, site back office etc). All was going well. In the meantime from a promotion we had over 13k or 20k registrations in just one day. My side was busy handling customers' load and his side was busy keeping the site up and running because the overload was crashing up the site. We were facing massive abuse by the visitors. Most of them were multi accounting and we really did not have any idea how they were doing it. We realized the abuse after processing around 400 withdrawals (according to Lucy). We had to stop promotion. And restructure the plan. In the meantime we had issue with payment processor coinpayment and moved to a new one nowpaymets. Staff were due to pay and the first signature campaigners too. Since we were having bad time with processors he sent me $28** to pay them all. All staff received 25% bonus. Even some of them were awarded extra bonuses for their hard work.At some point we moved from the current provider. He sent me some lose money around 39** Euro to convert in usdt and pay to an address. After trying a few more providers we settled with the current one we have.Meanwhile we were having regular meetings with different people/companies. I was present in some of them and some of them were without me. It was not necessary for me to attend everything. Providers, streamers, influencers, agents of x footballers, singers etc. All those developments never looked unreal.With us Lucy was sharing even his personal life. Trip to Disney with his wife and son, time in the zoo. Everyday we were becoming closer to each other like a small family. There was no reason to even think that he does not have money to run the business. All we were seeing is a man having some problems running the business but still he is not stopping from it. People were complaining about withdrawals. We were looking into it. Some were getting paid and more were coming with complaints. Since we moved to a new provider many people were coming for balance transfer too. Time was going fast. Everyone needs money. The Staff were waiting for it. In the 2nd signature campaign x1 and avatar campaign x3, when things were not going as planned I had to pay them out of my own pocket. Several times Lucy asked me for money and I sent them to his given address too.In the meantime Lucy missed several dates to pay the staff, processing withdrawals and me. For the record I spent over $3.2k out of my pocket, from GGR I was supposed to receive around $1.5k plus and for the current month, since we were having problems with the site we decided to give me $2k salary not the GGR. Today is the 22nd. He sent me 400$ and 200$ but after a few days he needed some payments done and took $240 from me. That $600 that I received from him all together. The above $3.2+$1.5+whatever it is from $2k for the month are still due. I was not stressing for my money but stressing for staff and customers withdrawals. This was important for me more than anything.Things were starting to change. This time I was pressuring for all the dues (everyone including withdrawals). Few days ago when I was angry and was insisting him he ordered btc 0.22* to my wallet via his bank. But after waiting few days he said since btc was dropping from $29** to somewhere at $22** or $23** the order was canceled. Then he decided to pay the staffs who are in the Philippines via their bank. But again after waiting for 5 working days it did not hit their bank until yesterday. In the meantime I told him to send me Western Union but even after ordering it and showing me a screenshot he never was able to give me a tracking number. Meanwhile the withdrawals were to process at GMT 10am and 6 PM but it never happened. Staff were told they will get withdrawals including all customers in 24 hours which never happened and the last was today at 6 pm his local time.The last few days were a complete disaster for me. It crossed my limit. It can not be continued anymore. So I resigned yesterday. He is insisting on me but it's impossible for me anymore. The deadline for his last promise passed. I was even giving him these options:Quote1. Pay all debt including withdrawals for clients2. Show me proof of funds, sign a message from a btc address that has enough btc3. Allow me to process withdrawals in the back office by giving me access.And then maybe I will reconsider being with him again. However, it's all done now. I am not with bitlucy anymore. I needed to be sure and it took me a while for that.PS: I have tried to give a brief of what happened inside bitlucy and my situation with BitLucy. I had to skip personal information of anyone involved but in the meantime I had to say what I wanted to say. If any users have doubt of what I said then I am open to share some conversation data and possibly the transaction records of the payments. I can not share these things in public and you will have to be someone who I will trust too.A copy (https://drive.google.com/drive/folders/1uWn7zePH5XjnBzU8laYr53Byuv3WBrJW?usp=sharing) of my last long message which was sent to Lucy of me being done with BitLucy will help understand the situation too. (I have edited some parts which I thought not necessarily to be in public)I have deposit data from the site. It's a few weeks old but I do not think many people deposited on the site for last few weeks. When I closed the form it’s still 4 people even after I had advertised it in several posts including ANN (https://bitcointalk.org/index.php?topic=5395791.msg60373594#msg60373594), reputation(https://bitcointalk.org/index.php?topic=5402179.msg60335332#msg60335332), (https://bitcointalk.org/index.php?topic=5402179.msg60389114#msg60389114) and yesterday in the service (https://bitcointalk.org/index.php?topic=5403487.0) board. The form is closed now since I do not want anyone to take advantage of it and fill it out with random data after this post. All these users will be checked and I will send their deposit back (I don't know how much will it be, if this is out of my limit then I will come to a contract with them to pay in installment). I will email you for a deposit transaction ID, and if it matches the given ID then you will get your coins back. Sorry for all the inconvenience that you had because of me.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5403679",
  "comments": [
    {
      "author": "Wildsyy",
      "created_time": "June 22, 2022, 09:18:30 PM",
      "body": "Royse.As per my message to you on Telegram irrc around 10 days ago, the man is a scammer.Sadly for you, you have been dragged into this.I also appreciate your email and your kind words, but, this will not fix what this man has done.He has no business acumen. He gloats about paying his staff $100 a week and calls it slave labour.You seem genuine based on our chats, and, I am glad you listened.Could you please respond to my email so we can put this to bed.Regards,Wildsy",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LoyceV",
      "created_time": "June 22, 2022, 09:20:43 PM",
      "body": "Disclaimer: I've been in contact with Royse777 on Telegram in the past days. Part of what I'm typing here, I've said to him already.To me, it sounds like \"Lucy\" got the idea to create a casino without having funding for a bankroll and promotion. I've seen people like that, also in real life. Typically, the promises keep piling up and it's always \"tomorrow\" or \"in a few days\" to keep you waiting without coming through. People like that can be very convincing, and I've seen many people fall for that for a long time. By the time they've had enough, others get stuck in the same web of lies and it continues to make new victims.For what it's worth: I believe you (Royse777) didn't have bad intentions. But I also believe you messed up big time by not seeing the red flags. If a campaign can't be paid up-front, and if the campaign manager has to pay for things out of his own pocket, you can bet there's no money in the casino. The moment the campaign couldn't be paid should have been the moment to put the campaign on HOLD. As an experienced campaign manager, you should have seen the red flags. By continuing the promotion with your forum reputation tied to it, I can imagine that made people believe the site could be trusted.I think you waited too long to pull the plug, and you waited too long to come clean here. I wish you the best though.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ShowOff",
      "created_time": "June 22, 2022, 09:36:01 PM",
      "body": "I literally had to spend 5 minutes to understand what really happened to you and the casino all this time. It seems that everything you talk about in the thread is something to be trusted even if someone will think that it is your attempt to increase your reputation. For a manager like you, of course it will take up a lot of time and jeopardize your reputation if you have to continue to leave this issue unresolved.I was even surprised when many people began to doubt the clarity of the payouts for your new campaign because your reputation has deteriorated as a result of this issue. By the way, I think you've got the right attitude to withdraw from the ranks of the casino team that has put you in trouble. You get paid for the job based on your explanation in the OP, I believe you are not a shareholder in it. Wish you all the best.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "June 22, 2022, 09:40:27 PM",
      "body": "I feel that here in bitcointalk all we have is our reputation. We take years to build it, and it may be lost at once.Personally, I would be very reluctant to make an association with someone I barely know, risking my reputation, my money and hard work.This might be a good lesson for all of us, to avoid associations with people we barely know .",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yahoo62278",
      "created_time": "June 22, 2022, 09:54:19 PM",
      "body": "Quote from: bitmover on June 22, 2022, 09:40:27 PMI feel that here in bitcointalk all we have is our reputation. We take years to build it, and it may be lost at once.Personally, I would be very reluctant to make an association with someone I barely know, risking my reputation, my money and hard work.This might be a good lesson for all of us, to avoid associations with people we barely know .I don't know that I can agree. None of us here really know each other, we know the persona we have created in our time on the forum. Not all successful companies are made from long time friendships either. It's ok to try and make a business with people you may barely know, but you always make sure you protect yourself. In this situation Royse should have pulled the plug when funds started being late. Ok, I can understand he/she may not have wanted to be hasty, but red flag #2 is when they had to pay from their pocket. We are talking about a casino here, not a nickel lottery or something. They either had funds or they didn't. It seems you let yourself(Royse777) be fooled and took way to long to respond to users on this forum. I don't think you personally are at fault for users getting scammed, but I can no longer trust your judgement as your actions likely cost other users more money by not closing shop/ warning the community sooner.I'll remove my red flag and make it a neutral, but I think some sort of warning should stay on you for awhile. Good luck in the future.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "decodx",
      "created_time": "June 22, 2022, 10:26:17 PM",
      "body": "Royse, I have no doubt that you are a good man, but I find that you have acted too naively in this matter, which I find hard to believe given your experience. Even though some will say that it is easy to be a general after a battle, I believe you shouldn't have allowed this to happen. I reviewed the whole bitlucy thread, and I think you had plenty of red flags to respond to. But you didn't. Furthermore, you asserted that bitlucy is the victim of scammers and abusers. Even after rebuilding the entire system and resetting all user balances (twice), you continued to complain that a number of users are abusing the system. In fact, even when you decided to stop promoting them on the forum and to lock the bitlucy ANN topic, you did not warn community about a possible scam, and your last words to the community were vague and could be misinterpreted. All of this indicates that you've worked only in your own interests throughout the whole process and never displayed any sense of responsibility towards the rest of the community. I agree with LoyceV that you waited too long, and your inability to be open about things here didn't help either.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Z-tight",
      "created_time": "June 22, 2022, 10:53:19 PM",
      "body": "Quote from: Royse777 on June 22, 2022, 08:14:10 PMWith us Lucy was sharing even his personal life. Trip to Disney with his wife and son, time in the zoo. Everyday we were becoming closer to each other like a small family. There was no reason to even think that he does not have money to run the business. All we were seeing is a man having some problems running the business but still he is not stopping from it.I am not too sure how other campaign managers handle their business with their employers, and how close and comfortable they get with them, i know those who have worked with a particular manager for a long time might get a bit close to the person, but other managers can correct me if i am wrong that getting too personal with your employer, especially when your 'contract' is over the internet can affect and becloud your judgement when necessary. I feel Royse became too close to Lucy and it became very difficult to draw the line even when it was suspicious.I feel if you didn't get too comfortably close with Lucy, you would have smelt that something was wrong, if everything was kept strictly at business level, meaning no funds everything should be put on hold, and even if you have to pay from your pocket, it should be only once, and that is when everything has been put on hold by yourself, then you can use your funds to settle the initial problems created and mitigate further problems in the future. If you fail to put it on hold, further problems will arise that could supercede the strength of your pocket and you find it hard to pay or solve.We often have good hearts, and we think people over the internet would behave and be as good as us, but that is not always the case, trust is a hard virtue to come by these days, and if you must trust someone, it should be because you have seen their good and trustworthy deeds over time, but if you are just working for the first time, treat every red flag as a scam, unless proven otherwise. I am very sorry Royse.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Timelord2067",
      "created_time": "June 22, 2022, 11:09:58 PM",
      "body": "I'm late to this issue - thanks for the update.  I'm reading my way through the threads.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JollyGood",
      "created_time": "June 22, 2022, 11:15:25 PM",
      "body": "Quote from: bitmover on June 22, 2022, 09:40:27 PMI feel that here in bitcointalk all we have is our reputation. We take years to build it, and it may be lost at once.Personally, I would be very reluctant to make an association with someone I barely know, risking my reputation, my money and hard work.This might be a good lesson for all of us, to avoid associations with people we barely know .It is very difficult to argue with what you have stated based on what we have read in this thread but yahoo62278 (below) has valid points.Quote from: yahoo62278 on June 22, 2022, 09:54:19 PMQuote from: bitmover on June 22, 2022, 09:40:27 PMI feel that here in bitcointalk all we have is our reputation. We take years to build it, and it may be lost at once.Personally, I would be very reluctant to make an association with someone I barely know, risking my reputation, my money and hard work.This might be a good lesson for all of us, to avoid associations with people we barely know .I don't know that I can agree. None of us here really know each other, we know the persona we have created in our time on the forum. Not all successful companies are made from long time friendships either. It's ok to try and make a business with people you may barely know, but you always make sure you protect yourself. In this situation Royse should have pulled the plug when funds started being late. Ok, I can understand he/she may not have wanted to be hasty, but red flag #2 is when they had to pay from their pocket. We are talking about a casino here, not a nickel lottery or something. They either had funds or they didn't. It seems you let yourself(Royse777) be fooled and took way to long to respond to users on this forum. I don't think you personally are at fault for users getting scammed, but I can no longer trust your judgement as your actions likely cost other users more money by not closing shop/ warning the community sooner.I'll remove my red flag and make it a neutral, but I think some sort of warning should stay on you for awhile. Good luck in the future.I think you have have pretty much covered most of what could be said here.It would be a difficult thing to face having covered payments from his pocket to the tune of several thousand USD$ but there is a line that should not be crossed between campaign managers and website owners/operators. I am surprised someone such as Royse777 allowed himself to be manipulated to the point where all this happened and he did not send out warnings to the community when he first ran in to issues. It seems there have been multiple errors on his part and that is unacceptable conduct from a campaign manager.Going through some posts in the Bitlucy withdrawal problem, does this acceptable? thread I still am unsure if Royse777 was a purely a campaign manager or much more than that because of the multiple roles he seems to have taken on. Was he also a part-owner or investor in the Bitlucy website too? I know stated here he was working full-time for Bitlucy (whatever that may entail) but was there more to his involvement?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Smack That Ace",
      "created_time": "June 23, 2022, 12:02:24 AM",
      "body": "Very big event to read.The whole thing would have been believable if it hadn't come from a Legendary. The judgment of a Legendary escrow/campaign manager who has 1700+ potential earned-merit is so weak that I have to believe it again in the bitcointalk forum where everyone fights against scams 24/7 days!I don't know how credible the incident is to everyone else but I really want Royse to refrain from associating herself with any big project in the future. we should understand that others should not be harmed for our stupidity.RegardsDuke",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Little Mouse",
      "created_time": "June 23, 2022, 04:20:16 AM",
      "body": "It’s sad how this ended up. I can't see any bad intention from Royse. But being an old member here with enough experience of how things can turn into, Royse must not have gone with this.Almost same thing happened with me. Back in 2019, I was asked to look for escrow service to hold 1 BTC for a campaign. I had contacted with Hhampuz and everything was okay. Suddenly, the guy disappeared. After few months (can't remember, it can be a year too), he suddenly came and share me a casino he was building. He offered me % from the profit for being a part of the project. Everything was up and I was asked to launch a campaign. Some can remember that I had posted the campaign thread too as I was asked to create. Once again I contacted with Hhampuz. But the guy once again disappeared after showing some excuses when I was asking for escrow the BTC for the campaign. I was lucky that I didn’t work on his promises.Good Luck Royse. I really wish you to get back whatever you have lost, from the monetary loss to the reputation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Free Market Capitalist",
      "created_time": "June 23, 2022, 05:46:49 AM",
      "body": "Quote from: yahoo62278 on June 22, 2022, 09:54:19 PMI'll remove my red flag and make it a neutral, but I think some sort of warning should stay on you for awhile. I think the same. We can give her the benefit of the doubt because of her previous reputation and the explanations given, but I think they are not enough, at least for the moment, to wipe the slate clean. And even if she had no intention of deceiving anyone and was somehow involved in that mess, I think she should have ceased all collaboration before, as there were some very clear red flags.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o_e_l_e_o",
      "created_time": "June 23, 2022, 07:45:30 AM",
      "body": "I've been holding off on making any comment on this situation until all the facts were available.While I agree with the points made above by Loyce and yahoo (namely, you were too slow in pulling the plug and too slow in explaining the situation), I also agree that you had no intention to scam anyone. Unfortunately, given what you have told us, it seems highly unlikely the scammed users will ever see their winnings, but I do think you deserve commendation for your offer to reimburse their deposits from your own pocket.While I can understand and don't necessarily disagree with the trust ratings you have been left, I don't feel it necessary to add to them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NeuroticFish",
      "created_time": "June 23, 2022, 08:47:21 AM",
      "body": "Everything I can say was already said. LoyceV was completely spot-on. Royse777 has fallen into a scam and was a little slow in assessing the red flags and stop everything.I've had in the past (in completely different situations) the impression that he/she is a bit forgiving with people, but I never thought that this kind of disaster is at the horizon.All in all I don't think that Royse777 is a scammer, even if the handling of the problem was... bad... and even this topic came a little late.And, as I said, this mess will be costly to get cleaned. It will probably leave a stain on Royse777 reputation, whether people will or will not be reimbursed from own pocket (and may also end up reimburse scammers too, only because they're vocal).I am really sorry about the way all this turned out. As o_e_l_e_o also said, the existing trust feedback already tell the story, there's no need to add anything there.@Royse777 good luck, you need it. I think/hope that the worse has passed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Solosanz",
      "created_time": "June 23, 2022, 09:01:36 AM",
      "body": "I'd say this is mismanagement from your behalf for not verify the Bitlucy team and only trust his word even though you're already go too far from it does. When you have use your own pocket money to pay the operational expenses, then I will say the man who talked with you are a scammer and seems like he doesn't have enough money for his project. Skepticism is a must when you need to deal a financial related activities, I would advice to use an escrow to prevent from this kind problem, or at least multisig wallet.Royse777 you're not a scammer nor intentionally to scam anyone, but you're a team from a scam project which is you're still obliged to pay your clients including the winning, as long as they didn't break any TOS, I don't think the gamblers are wrong here. If you're only the campaign manager, then I would agree if you not need to pay the clients since you're not manage the scam project, but you're only promoting and you can close the campaign after there's a complain about the project.I know you've pay with your own pocket money and resign from Bitlucy team, but that's not enough for the clients have been scammed so far. Sad to say, I demand you need to pay the whole winning amount except you're successfully negotiated with the clients to pay the initial deposit amount or other agreement. I'm going to leave you negative tag as you haven't successfully solved the case, I will wait until all the 4 clients that have fill the google form data confirming already receiving the money from you. However I don't think it's only 4 users to be honest, probably there's few users missed this news, if in a month(s) they will comeback and asking their money, I don't think they should be blamed due to late contacting you.I hope you're understand my point and I hope you're in a good health to resolving this problem.With this problem, anyone should learn an experienced and trustworthy campaign manager have nothing to do with the project itself, if the project is scam, then it will scam no matter what.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BetHunter",
      "created_time": "June 23, 2022, 12:03:39 PM",
      "body": "Well isnt this funny when the very man ROYSE who scammed others out of their deposits to BITLUCY is now on the short end of the stick chasing his own money.This BITLUCY bookmaker is run by a SCAMMER. DO NOT deposit any funds there.Just to sum it up (as the screenshot below shows) and this chat occured on their website directly with ROYSE who admitted the following:1. They Lost all customer Balance data when moving their site2. They can just about gather your DEPOSIT data... which means if you had deposited 1000 and won 3000 they would only ackowledge the 1000!https://ibb.co/ydgt07N   <--- proof of this.  I have had 600 stolen from me, sent them my deposit transaction IDS but totally ingored.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JollyGood",
      "created_time": "June 23, 2022, 12:35:44 PM",
      "body": "I have no idea whether you lost $600 or not but I am posting here just to display the image you posted. What happened in this situation should be an example to any and all would-be campaign managers. Those with a long standing campaign management history would probably never get themselves in to this situation.Any losses that could have been curtailed or avoided (but were not because Royse777 did not raise the alarm sooner) are missed opportunities to stop the scam earlier therefore it is negligence on part of the campaign manager. I do not know where you fit in to this as far as losses are concerned but if what you said is true I am sorry for your loss.Quote from: BetHunter on June 23, 2022, 12:03:39 PMWell isnt this funny when the very man ROYSE who scammed others out of their deposits to BITLUCY is now on the short end of the stick chasing his own money.This BITLUCY bookmaker is run by a SCAMMER. DO NOT deposit any funds there.Just to sum it up (as the screenshot below shows) and this chat occured on their website directly with ROYSE who admitted the following:1. They Lost all customer Balance data when moving their site2. They can just about gather your DEPOSIT data... which means if you had deposited 1000 and won 3000 they would only ackowledge the 1000!https://ibb.co/ydgt07N   <--- proof of this.  I have had 600 stolen from me, sent them my deposit transaction IDS but totally ingored.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dkbit98",
      "created_time": "June 23, 2022, 12:48:13 PM",
      "body": "I am glad you finally explained your situation in public Royse.I watched one documentary about scammer who tricked and scammed many people (mostly females), and this case from Royse reminds me a lot about that documentary.To know how scammers work you need to study and learn their behavior, and I think that Royse didn't have much experience with this, so it's understandable how Lucy scammer tricked him.Pattern is the same, scammers like this are professional liars that usually live luxury lifestyle, they travel a lot around the world, and they are documenting this with photos and social media.I think it is now clear for everyone that Royse is not a scammer here and red flags against him should be removed or at least turned to neutral, but Royse is guilty for being naive and for not asking help and second opinion from other forum members earlier.He is just a human and it's not like all of us didn't make mistakes before in our lives, but maybe Royse can still help scammed customers with information from Bitlucy onwer.Maybe they can report him to authorities and stop him before he recycles and rebrands his website into some new moneygrab scheme.Good luck Royse.PSMaybe it's time to open Investigation topic about Bitlucy owner with more personal information.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "suchmoon",
      "created_time": "June 23, 2022, 01:09:27 PM",
      "body": "Royse777, I know you're a good person but damn... you gotta do the right thing before red tags start piling on. Keep in mind that most people are very reluctant to neg-trust someone of your reputation, so if you start getting those tags you messed up hugely.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}