{
  "id": "topic_5459990",
  "title": "mvdheuvel1983",
  "author": "mvdheuvel1983",
  "created_time": "July 16, 2023, 10:40:45 AM",
  "content": "There are many diverse opinions about following one's passion and wealth. I read two stories of people who followed their passion, and in a short period of time, the businesses became very profitable.In story 1, Defossey left a job at Apple to open a BBQ restaurant in Mexico City. It made $9 million in sales last year. In story 2, Sean Audet, a 30-year-old, spent $0 launching a food photography side hustle, and now he brings in $134,000 a year.The people in these stories followed their passion and created wealth through it. What is your opinion on following one's passion in relation to wealth? Can your passion lead to an increase in your net worth? If yes, what is stopping you from following it?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5459990",
  "comments": [
    {
      "author": "_act_",
      "created_time": "July 16, 2023, 10:46:41 AM",
      "body": "Do you know the question you supposed to ask your? Is what you have passion at what people need? Like in examples that you said. People need to eat and need restaurant. People need some of the things people are selling. If you know that people depend on what you have passion for, you can go ahead. You have passion for it and it would be fun. If it is not what people are requiring, do not go for it.But you need to also think of ways to let people buy more of your product or service. You need to make them satisfied and show that you are better than most people doing the same business. If you are good in customers satisfaction, you will have more customers and earn more money. Some people will have a problem. You may have passion in something but not able to setup that thing because of lack or insufficient money.In business, it is important to have it in a good location and nearer to important things that you need to make the business function.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Y3shot",
      "created_time": "July 16, 2023, 11:17:58 AM",
      "body": "Quote from: mvdheuvel1983 on July 16, 2023, 10:40:45 AMThere are many diverse opinions about following one's passion and wealth. I read two stories of people who followed their passion, and in a short period of time, the businesses became very profitable.In story 1, Defossey left a job at Apple to open a BBQ restaurant in Mexico City. It made $9 million in sales last year. In story 2, Sean Audet, a 30-year-old, spent $0 launching a food photography side hustle, and now he brings in $134,000 a year.The people in these stories followed their passion and created wealth through it. What is your opinion on following one's passion in relation to wealth? Can your passion lead to an increase in your net worth? If yes, what is stopping you from following it? if you check yourself very well things that came out well with excellent results was have a results of passion. The people who find themselves in a career or business which they don't even have passion for, it's always synthesis they are struggling with what they are doing but immediately day quit to go into what they have passion for you see them having a good results without no struggle and they do what they found themselves into with joy and happiness. Passion in career or business is one of the secrete to succeed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DanWalker",
      "created_time": "July 16, 2023, 11:37:25 AM",
      "body": "Quote from: mvdheuvel1983 on July 16, 2023, 10:40:45 AMThere are many diverse opinions about following one's passion and wealth. I read two stories of people who followed their passion, and in a short period of time, the businesses became very profitable.In story 1, Defossey left a job at Apple to open a BBQ restaurant in Mexico City. It made $9 million in sales last year. In story 2, Sean Audet, a 30-year-old, spent $0 launching a food photography side hustle, and now he brings in $134,000 a year.The people in these stories followed their passion and created wealth through it. What is your opinion on following one's passion in relation to wealth? Can your passion lead to an increase in your net worth? If yes, what is stopping you from following it?There are many more passionate and successful stories like the two you mentioned above. But not everyone who follows their passion will have such success, not every pursuit of your passion will be rewarded. I am a witness to following my passion but with no good results. I used to want to be a hairstylist, but while pursuing my passion, I encountered more economic difficulties than the advantages I had dreamed of. But when I switched to another field that I didn't love, it brought me a lot of money. For me, with a difficult life like now, as long as I have a job that helps me earn a lot of money, I will pursue it, I am no longer passionate about my passions. Because passion cannot be more important than wife and children and family.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "slapper",
      "created_time": "July 16, 2023, 11:40:26 AM",
      "body": "These tales really are priceless, right? Inspires one to begin work on his or her own dream project immediately. Sure, why not? See how much money these people made by using this strategy! The connection between enthusiasm, drive, effort, and ultimate success (or, in this case, $$$) seems obvious to meBut remember that these are outliers; success rates like these are one in a million at best. Numerous others may have tried, but were ultimtely unsuccessful. Following your passion requires a leap of faith, but you need also have a strategy. Do what you love; I'm not telling you not to. That's the kind of hustle you should be in if it would keep you working hard every day. It doesn't hurt to exercise caution, though",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EarnOnVictor",
      "created_time": "July 16, 2023, 11:54:16 AM",
      "body": "Look around you my friend, and in case you are not paying close attention, what you see is money. I don't think there is anything anywhere that can't generate money, even the sand you always step upon. It's how you view, create, harness and manage them that determines what they offer/give to you.Quote from: mvdheuvel1983 on July 16, 2023, 10:40:45 AMWhat is your opinion on following one's passion in relation to wealth? Can your passion lead to an increase in your net worth? If yes, what is stopping you from following it?Talking about passion involvement, it's another opportunity to earn money through what you do. I can't imagine myself doing what I don't have a passion for, and doing what I have passion for is like making money while I live my life to the fullest because I can even live longer doing what I love doing because I actually enjoy doing it.Personally, I engage in what I love doing and I do not leave any stone unturned. Doing what you are passionate about will surely make you do it better and that will naturally amount to more money.Only that you might need to learn and be more creative about it in this largely competitive world.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ajiz138",
      "created_time": "July 16, 2023, 12:05:03 PM",
      "body": "Many people follow their desires to pursue the field they like, of course this must have skills including in the strategy they run when there is an opportunity where desires come true in the sense that they can produce something net worth, this will be an inspiration for everyone where they are sure that what they are doing will produce without dependence on other jobs because by following their desires it is more enough for them.Why haven't they dared to try this; because they are afraid of failure, do not have the skills they are working on whether the opportunities they have will have a more positive impact, so most of those who have not followed their desires are because they lack confidence in their potential.In a business that will be started, you must have a strategy and be ready to continue when you fail, you must not give up.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jatiluhung",
      "created_time": "July 16, 2023, 12:18:49 PM",
      "body": "Actually I am one who follows the passion/hobby that I have so far. and even I work in a field that matches my hobby. Actually it is about comfort in work. And when we work in a field that is our hobby, doing work becomes enjoyable. But at one point boredom is sometimes present in life. but that's only temporary.Following passion is not always successful. Everything has its own risk. It's just that to follow desires, we also must not be careless. we still have to have careful planning and preparation. And not all who follow passion will become filthy rich and make a lot of money. but what is certain is that people who follow their passions will be much comfortable in their work.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jrrsparkles",
      "created_time": "July 16, 2023, 12:21:24 PM",
      "body": "Quote from: mvdheuvel1983 on July 16, 2023, 10:40:45 AMThere are many diverse opinions about following one's passion and wealth. I read two stories of people who followed their passion, and in a short period of time, the businesses became very profitable.In story 1, Defossey left a job at Apple to open a BBQ restaurant in Mexico City. It made $9 million in sales last year. In story 2, Sean Audet, a 30-year-old, spent $0 launching a food photography side hustle, and now he brings in $134,000 a year.The people in these stories followed their passion and created wealth through it. What is your opinion on following one's passion in relation to wealth? Can your passion lead to an increase in your net worth? If yes, what is stopping you from following it?You can find 2 or even 100 but there are thousands unknown stories of others who didn't make it so we only recorded about the people who made money. First of all your passion can make you millionaire or even billionaire but you can ask anyone who did that their intention of quitting the job and choosing their path is only to pursue their passion which will give the ultimate self satisfaction. Let's talk about Mr.Beast who became billionaire already by making videos on youtube alone apart from all his other business still he says that he didn't came to youtube to make money its just something which will drives to keep doing it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joniboini",
      "created_time": "July 16, 2023, 12:27:52 PM",
      "body": "Quote from: mvdheuvel1983 on July 16, 2023, 10:40:45 AMThe people in these stories followed their passion and created wealth through it. What is your opinion on following one's passion in relation to wealth? Can your passion lead to an increase in your net worth? If yes, what is stopping you from following it?I mean, don't your stories already answer your question? I don't think most people disagree that we can be rich if we follow our passion, but the success rate is incredibly low due to many factors. Counting passion as your only drive won't be reliable. For example, people need the skill to manage a business or launch a website like you shared above, does everyone have that? Do they have the time to learn while not having the pressure to provide food for their family? At the end of the day, your luck, connection, skills, etc plays a part. If you are not prepared from your early days, trying to follow your passion might become painful especially if you need to endure years without getting any decent earnings.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "komisariatku",
      "created_time": "July 16, 2023, 12:30:49 PM",
      "body": "Quote from: mvdheuvel1983 on July 16, 2023, 10:40:45 AMThe people in these stories followed their passion and created wealth through it. What is your opinion on following one's passion in relation to wealth? Can your passion lead to an increase in your net worth? If yes, what is stopping you from following it?I think passion is one of the motivations that must be owned to achieve a goal. While reading a bit of your story, it may sound quite extraordinary and we want to do the same. However, in their success there must be a steep and winding road. They didn't magically leave Apple, open a restaurant, and become successful. We don't know how many failures he experienced and he kept trying until he finally succeeded. We must also not forget, that many people who try to start a business and fail, mostly give up and don't want to start again, so they never experience success.But I agree with you. One of the keys to success is a strong desire to achieve a goal. Also, never stop when you encounter failure, try again and try again. Maybe we will find many failures, but one success is enough to pay off all the failures that you have experiencedI honestly feel motivated by their success stories. But I'm realistic, I believe that success will come because of hard work, not because of luck and miracles. So, let's try to get success",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "demonica",
      "created_time": "July 16, 2023, 01:01:03 PM",
      "body": "For me it actually depends on one's opportunity. There are people who became successful by following their passion because there are a lot of opportunities around them. But for others who tried following their passion but it ended not being profitable, it's because there's not much opportunity around them, or they are in the wrong market. For example, a person living in my country is passionate about arts. A lot of people especially older ones here think that being an artist will not bring you money. Also, it's very common here that when artists try to offer commission, some customers will say that their pricing is too expensive (when it's not). Others don't see how much time and effort artists put in making art. And the money spent on the materials. But if they tried looking for a better market. Mostly in foreign countries, they get paid bigger than the average profit they can get here.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Baofeng",
      "created_time": "July 16, 2023, 01:12:47 PM",
      "body": "Quote from: mvdheuvel1983 on July 16, 2023, 10:40:45 AMThere are many diverse opinions about following one's passion and wealth. I read two stories of people who followed their passion, and in a short period of time, the businesses became very profitable.In story 1, Defossey left a job at Apple to open a BBQ restaurant in Mexico City. It made $9 million in sales last year. In story 2, Sean Audet, a 30-year-old, spent $0 launching a food photography side hustle, and now he brings in $134,000 a year.The people in these stories followed their passion and created wealth through it. What is your opinion on following one's passion in relation to wealth? Can your passion lead to an increase in your net worth? If yes, what is stopping you from following it?I think it's more on that they are enjoying what they are doing that's why they become successful. And that's why they left their jobs in the first place, because not only that they are not happy with their jobs, but it simply put too much stressed on them everyday that they have to resign from it and then pursue what they wanted to do in life.Perhaps there are others that is not willing to take the risk to go out and pursue what they want that's why they are stuck in a 9-5 job in their whole life. So it depends on each one of us to go reach for your dreams specially if you are still young.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "July 16, 2023, 01:22:12 PM",
      "body": "Quote from: mvdheuvel1983 on July 16, 2023, 10:40:45 AMWhat is your opinion on following one's passion in relation to wealth? Can your passion lead to an increase in your net worth? If yes, what is stopping you from following it?Same I guess on some people you mentioned. The only problem is the confidence and luck to do that. As you can see its easy to start a business but not in the way you could see that success easily. You need perseverance and a lot of things before getting that achievement. I wonder how many have failed too but it doesnt mean they didnt follow their passion too.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "adiksau0414",
      "created_time": "July 16, 2023, 01:47:45 PM",
      "body": "Not all passion could lead into success. This need to be paired with knowledge, great ideas, marketing, great timing and luck. Your examples might have two or more factor of this. Im not trying to give negative impact about being passionate about ideas and talent, just trying to be ideal on one point.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "killerfrost",
      "created_time": "July 16, 2023, 01:51:24 PM",
      "body": "What I see here is competence, passion or not, it's clear that if they don't have the ability to do it well or are passionate about what they love, they won't be able to do a perfect job. As a story without rosy, whether people say that they are passionate about anything, but that passion is different or just similar to other people's interests, and the expression is not much. So if we like anything and are serious about taking a stance to find a solution, then success is just a result sooner or later.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "icalical",
      "created_time": "July 16, 2023, 02:07:48 PM",
      "body": "I have a very weird experience and story about passion, I used to passionate about Graphic Design and Animation. I really like to learn about it, keep getting better, digging deep on the technique and several style, but right after I turn my passion into a job and I earned money from this passion, I became less and less passionate about this. What I did next is finding a new hobby and turn it into passion, I am into music now, I learn it, keep digging on it, but now I have a fear if I am actually getting money from this new passion I will lose the passion again.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ultegra134",
      "created_time": "July 16, 2023, 02:33:57 PM",
      "body": "Personally, making your passion your full-time job sounds unrealistic, at least for the majority of people. I find it very challenging to accomplish that only few end up achieving it in their lifetime. Usually, the majority of us will have a regular job, with one or two days off and the only thing we'll be looking for would be the weekend to have some personal time. I'm not sure if I'm being too pessimistic and depressive, but depending on your financial status and your residence, it may seem like an inconceivable dream.Back when I was a teenager, my passion was bicycles, creating my own company and designing my own bikes and products, which even if we suppose that I attempt now, it requires great knowledge, craftmanship and capital. On top of that, it sounds too demanding and I have no clue on how to start such a thing. The worse of all, I'm still not sure what my true passion is.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mu_enrico",
      "created_time": "July 16, 2023, 02:43:18 PM",
      "body": "Passion can only take you to some level, it's especially good at the beginning when you grind the new topic and try to get better. But you'll not be passionate if you do the same thing every day for the last x years. You'll get bored and you'll see your passion gradually vanish. To earn big, you'll have to be the best, and that's beyond passion. It's more like you want to be the best and beat other people a.k.a your competitive nature is the dominant force.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yatsan",
      "created_time": "July 16, 2023, 03:47:40 PM",
      "body": "Well yes, but depends on how you would work for it. Some people are passionate of something that they are willing to do things still for the sake of passion even if it is not financially benefiting. Well, it has a long term benefit bit for sure things should still be paid. This instance  I guess is more evident with artists. I am one myself but I am seeing others to allow people to buy their service at a low price just because they're passionate of creating arts but it should not be that way. However, this tendency is not absolute and as we all know, many people succeeded to their passions, it just depends on how we will act on it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}