{
  "id": "topic_5511107",
  "title": "BrotherMencius",
  "author": "BrotherMencius",
  "created_time": "September 28, 2024, 08:26:16 PM",
  "content": "Hi guys, I hope you're all well :-)I was wondering if any members here have any experience of profit-taking from BTC in Canada, and in particular, which Canadian banks are most likely to be OK with customers withdrawing cash from BTC sales into their accounts?This is the first BTC bull cycle I've experienced (not counting the tail end of the 2020 cycle when I first started investing) so I've yet to try making any sales / taking profit, so I want it to be as hassle-free as possible.Thanks :-)",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5511107",
  "comments": [
    {
      "author": "Z-tight",
      "created_time": "September 28, 2024, 08:39:23 PM",
      "body": "So if i understood you correctly, you want to sell your BTC for fiat, you can sell your BTC on a p2p exchange and receive fiat from the buyer directly into your bank account, bisq is a good choice for that. However, if you want to use a centralized exchange, take note that you must pass their kyc requirement before trading in their platform, and if i am not wrong, you can convert your BTC for fiat in Canada using Coinbase.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BrotherMencius",
      "created_time": "September 28, 2024, 08:53:09 PM",
      "body": "Yeah, I was thinking I'd likely sell through an exchange. My primary concern is that when I withdraw fiat from whichever exchange I use, the bank I withdraw to might want to put a hold on the fiat I try to deposit. Is this something to be concerned with? I've never tried before so I don't know for sure.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Aanuoluwatofunmi",
      "created_time": "September 28, 2024, 09:54:33 PM",
      "body": "My first advise is for you to know the current state of regulations in your country, maybe crypto currency is being allowed or not, trading shouldn't be anything serious, especially when you're trying to exchange exchange with the use of the p2p network, though going through the centralized exchange may not be a perfect way of being anonymous in making transactions, but we may have to consider the using of a decentralized exchange or a physical one in doing it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Russlenat",
      "created_time": "September 28, 2024, 10:19:13 PM",
      "body": "All banks in Canada are essentially the same since they're regulated by the same agencies. If you come across a bank that operates differently, especially if it's not well-known, consider that a red flag...you could be at risk of losing money. KYC is the main requirement for banks, and eventually, they'll ask for proof of your source of funds. Make sure you have that documentation ready to avoid any issues down the road.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coupable",
      "created_time": "September 28, 2024, 10:20:10 PM",
      "body": "Quote from: BrotherMencius on September 28, 2024, 08:53:09 PMYeah, I was thinking I'd likely sell through an exchange. My primary concern is that when I withdraw fiat from whichever exchange I use, the bank I withdraw to might want to put a hold on the fiat I try to deposit. Is this something to be concerned with? I've never tried before so I don't know for sure.I usually advise people to use Binance because it is almost the largest peer-to-peer exchange space, but I was surprised from sources on the web that Binance does not support Canada and you will not be able to create an account using Canadian identity. The information is not confirmed and you can search for it yourself. It will be possible to give you better advice if you tell us the amount you want to exchange. If the amount is large, your best option is to use Bisq platform where you will find many traders who are able to transfer money to your account in the best way for you. You can also use bitcointalk forum if you want more options to compare later. In both cases, I advise you to divide the amount into small transfers to avoid being tracked by the authorities.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Potato Chips",
      "created_time": "September 28, 2024, 11:23:16 PM",
      "body": "Quote from: BrotherMencius on September 28, 2024, 08:53:09 PMYeah, I was thinking I'd likely sell through an exchange. My primary concern is that when I withdraw fiat from whichever exchange I use, the bank I withdraw to might want to put a hold on the fiat I try to deposit. Is this something to be concerned with? I've never tried before so I don't know for sure.It is always best to err on the side of caution. I do regular crypto <-> fiat transactions and I personally prefer crypto friendly banks. And if I have no idea about a bank's stance on crypto, I try not to do larger transactions. I do believe some banks could have more friction with crypto.I'm not from Canada though nor familiar with Canadian banks. I'd say you're better off asking a local. Maybe you'll meet some here otherwise you can try at r/BitcoinCA -- subreddit for bitcoiners in Canada.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hd49728",
      "created_time": "September 29, 2024, 02:06:11 AM",
      "body": "You can check the lists10 Crypto-friendly banks in CanadaThe 11 Best Crypto-Friendly Banks in Canada (and Some of the Worst)Best cryptocurrency exchanges in Canada.You have to double check it, and if possible you can ask Canadians about this, like this advice.Quote from: Potato Chips on September 28, 2024, 11:23:16 PMI'd say you're better off asking a local. Maybe you'll meet some here otherwise you can try at r/BitcoinCA -- subreddit for bitcoiners in Canada.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Die_empty",
      "created_time": "September 29, 2024, 05:56:04 AM",
      "body": "Quote from: BrotherMencius on September 28, 2024, 08:53:09 PMYeah, I was thinking I'd likely sell through an exchange. My primary concern is that when I withdraw fiat from whichever exchange I use, the bank I withdraw to might want to put a hold on the fiat I try to deposit. Is this something to be concerned with? I've never tried before so I don't know for sure.You should spend some time studying the crypto laws of your country. In my country, banks are restricted from dealing in cryptocurrencies. Bank accounts can be frozen, and banks sanctioned for engaging in such transactions. But there are still ways we bypass these restrictions. We ensure that there is no mention of anything crypto in the transactions, and we ensure that the amount doesn't include our lowest money denomination. Another technique is not to send a big transaction at once; it could be split and made in badges or bits. However, I think you should ask trusted members of the crypto community how they safely engage in crypto-to-fiat exchange.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oluwa-btc",
      "created_time": "September 29, 2024, 03:07:33 PM",
      "body": "Quote from: BrotherMencius on September 28, 2024, 08:26:16 PMHi guys, I hope you're all well :-)I was wondering if any members here have any experience of profit-taking from BTC in Canada, and in particular, which Canadian banks are most likely to be OK with customers withdrawing cash from BTC sales into their accounts?Well first thing first is to be sure your country is crypto friendly to be sure you are safe in making such transactions with any bank in your country, because transacting in crypto have been a huge problem in some countries due to the fact that they are scared Bitcoin would take over other currencies in the near future,but a situation where cryptocurrency use is banned you need to be careful in your dealings and possibly to undergo any transactions you'll need an online exchange to do just that,But I'm not familiar with any of that so I'll advice once you've discovered your country is allowed to transact freely with BTC then you're good to go.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rruchi man",
      "created_time": "September 29, 2024, 04:48:04 PM",
      "body": "Quote from: Potato Chips on September 28, 2024, 11:23:16 PMIt is always best to err on the side of caution. I do regular crypto <-> fiat transactions and I personally prefer crypto friendly banks. And if I have no idea about a bank's stance on crypto, I try not to do larger transactions. I do believe some banks could have more friction with crypto.In my country, we do not trust the banks, even if we know that they can permit transactions in crypto. It is best to make any transaction from an exchange to your bank without using the description indicating it to be a crypto transaction. Quote from: Potato Chips on September 28, 2024, 11:23:16 PMI'd say you're better off asking a local. Maybe you'll meet some here otherwise you can try at r/BitcoinCA -- subreddit for bitcoiners in Canada.OP should be careful on Reddit of people who may claim to be locals just to gain trust. There are still lots of scammers there.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NeuroticFish",
      "created_time": "September 29, 2024, 07:40:07 PM",
      "body": "Quote from: Potato Chips on September 28, 2024, 11:23:16 PMIt is always best to err on the side of caution. I do regular crypto <-> fiat transactions and I personally prefer crypto friendly banks. And if I have no idea about a bank's stance on crypto, I try not to do larger transactions. I do believe some banks could have more friction with crypto.I'm not from Canada though nor familiar with Canadian banks. I'd say you're better off asking a local. Maybe you'll meet some here otherwise you can try at r/BitcoinCA -- subreddit for bitcoiners in Canada.I will add that it may be a good idea to not do tests on crypto stance on the bank your main account (salary) is at, just to avoid really unpleasant surprises.And yes, I agree with Potato Chips: asking your fellow Canadians is the proper way to go forward (but even if you get recommendations, smaller amounts are recommended).And something more: you may want to also consider crypto cards, since you can then just spend in any shop for daily needs. Then you don't go through the hassle of withdrawing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "l99l",
      "created_time": "September 29, 2024, 07:44:07 PM",
      "body": "I don't know the current regulations in the country. I heard from a software friend working in Canada that the current conditions for buying and selling Bitcoin are difficult there. He said he would buy when he returned to Europe.  I think there may be an easy way, but there is. I believe you will find a good way if you research.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Potato Chips",
      "created_time": "September 29, 2024, 10:17:10 PM",
      "body": "Quote from: Rruchi man on September 29, 2024, 04:48:04 PMOP should be careful on Reddit of people who may claim to be locals just to gain trust. There are still lots of scammers there.Yup. Sadly, many crypto communities I've been in is infested with scammers lol e.g. those at reddit, twitter, tg, discord. I'm glad it is less crazy in bitcointalk lol.My advise it to not entertain DMs from randoms and just keep the discussion in public-- start a thread. This way, someone slippin' a scam trick will most likely be downvoted to oblivion and/or will be called out.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dificanovi",
      "created_time": "September 30, 2024, 11:51:41 PM",
      "body": "Quote from: BrotherMencius on September 28, 2024, 08:26:16 PMHi guys, I hope you're all well :-)I was wondering if any members here have any experience of profit-taking from BTC in Canada, and in particular, which Canadian banks are most likely to be OK with customers withdrawing cash from BTC sales into their accounts?This is the first BTC bull cycle I've experienced (not counting the tail end of the 2020 cycle when I first started investing) so I've yet to try making any sales / taking profit, so I want it to be as hassle-free as possible.Thanks :-)If you are someone who lives in Canada then you don't need to be afraid to withdraw cash or deposit money for Bitcoin. From the information I got that Canada is one of the countries that has a policy approach that tends to be friendly to bitcoin. If it is true that you are in Canada then you can use several crypto exchanges such as NDAX, Kraken Canada and CoinSmart. Some of the exchanges that I mentioned you can withdraw and deposit cash in Canada through Banks in Canada.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Doan9269",
      "created_time": "October 01, 2024, 08:14:21 PM",
      "body": "Quote from: coupable on September 28, 2024, 10:20:10 PMQuote from: BrotherMencius on September 28, 2024, 08:53:09 PMYeah, I was thinking I'd likely sell through an exchange. My primary concern is that when I withdraw fiat from whichever exchange I use, the bank I withdraw to might want to put a hold on the fiat I try to deposit. Is this something to be concerned with? I've never tried before so I don't know for sure.I usually advise people to use Binance because it is almost the largest peer-to-peer exchange space, but I was surprised from sources on the web that Binance does not support Canada and you will not be able to create an account using Canadian identity. The information is not confirmed and you can search for it yourself. It will be possible to give you better advice if you tell us the amount you want to exchange. If the amount is large, your best option is to use Bisq platform where you will find many traders who are able to transfer money to your account in the best way for you. You can also use bitcointalk forum if you want more options to compare later. In both cases, I advise you to divide the amount into small transfers to avoid being tracked by the authorities.Upon the popularity with the centralized exchange like binance, it world ranking and global recognition, reputation and trust it has with so many organizations and crypto users, some countries still finds it hard for them to cope with the acceptability for the exchange full operation, which most are likely linked to regulations changes, which is still something far different from the risk associated from what a centralized exchange could give, some other countries follow same and restrict this same exchange among others.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OgNasty",
      "created_time": "October 01, 2024, 08:16:48 PM",
      "body": "Friendly bank and Canada are oxymorons.  I wouldn't trust any bank in Canada ever again after what they did during the trucker protests.  They were literally seizing people's bank accounts just for donating to help truckers stay warm and fed.  The evil taking place in Canada right now is far beyond what ever the conspiracy theorists are saying.  If you're Canadian, move south and west as quickly as you possibly can.  The future does not look like it will be kind to those in Canada, unless you're looking for a handout for doing nothing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ojima-ojo",
      "created_time": "October 01, 2024, 09:49:58 PM",
      "body": "The bigger question is, how will the Bank know you are withdrawing your Bitcoin if you use p2p method to sell the Bitcoin to another person and have the equivalent amount sent to your bank account, I think there is no Bank that have such detection tool a d that is why most Bitcoin trader's option in to use the p2p method to sell their coin and most people are already aware in the risk of lebeling your transactions as cryptocurrency related since such words are seen as red flag words.Unless if there is Coinbase operation in Canada, so for sure their could offer direct Bitcoin bank withdrawal, and also in countries were Bitcoin is legalize and banks engage in Bitcoin direct transactions processing, such country like El Salvador will definitely have such banks that you mentioned.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cryptomultiplier",
      "created_time": "October 01, 2024, 10:13:31 PM",
      "body": "Am sorry that you haven't yet been a part of the issues some oldies have had to face with selling and withdrawal of their BTC mostly in countries where it isn't regulated or considered a legal activity of such.Am sure the use of fintech banks has made regular banks in most regions become only mandatory for some kind of earners, otherwise there are various online banks and decentralized exchanges that anyone can register on, and withdraw the returns of their BTC sales there before sending it to the main banks for use.In all, it's just for you to figure out the best approach to follow to either buy or sell or withdraw your crypto currency and stick with it while you keep an eye on government policies that may impose sometimes.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaveF",
      "created_time": "October 01, 2024, 10:46:19 PM",
      "body": "Keep in mind it does not matter if the bank is crypto friendly or not if the bank sucks.https://bitcointalk.org/index.php?topic=5502270Chase is very crypto friendly, however they are are also very incompetent. So it's something to think about. As I said in the above topic, I messed up, I admit I messed up, all I wanted them to do was fix the issue. But all they wanted to do was sell me more services.When I finally went to a local branch, it still took the better part of 2 hours to fix it.I have another bank that I use that is known to be crypto unfriendly, however every time I have had an issue over the last 20+ years of banking it has never taken more then a couple of minutes to resolve the problem.So you don't just want crypto friendly, you want crypto friendly and competent. -Dave",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}