{
  "id": "topic_5417400",
  "title": "MrDave",
  "author": "MrDave",
  "created_time": "October 17, 2022, 10:07:08 AM",
  "content": "2022 is going to be the worst year for crypto investors. Any thoughts guys?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5417400",
  "comments": [
    {
      "author": "asriloni",
      "created_time": "October 17, 2022, 10:21:34 AM",
      "body": "The first year during the bearish trend will always become the worst year for crypto, the price of crypto will be going to the lowest price and then it will be starting to recover slowly during the next year. I think that 4 year cycle has been explaining a lot about how it will be going on. This is the worst year not only for investors but for so many countries and regulators caused by we are facing crisis at the same time combined with various problems.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "batang_bitcoin",
      "created_time": "October 17, 2022, 10:53:38 AM",
      "body": "Quote from: MrDave on October 17, 2022, 10:07:08 AM2022 is going to be the worst year for crypto investors. Any thoughts guys?Take a look at 2018. That might be the worst for those investors that have a lot of holdings but, a true investor won't look at how bad the market is. They'll look at the market the way they're looking the same as the bullrun. This is the time for all of us to accumulate as much as we can and don't take it negatively because that's not how investing works. The best that you can make will be planted during the worst year of the market although, the look of it doesn't really good for most but that's the reality of it. You have to look the best and good part of it even if for majority, it's the worst.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "maydna",
      "created_time": "October 17, 2022, 11:32:20 AM",
      "body": "Quote from: MrDave on October 17, 2022, 10:07:08 AM2022 is going to be the worst year for crypto investors. Any thoughts guys?That could be true because after experiencing a tremendous increase in the last year, the crypto market is experiencing a slump, and many have left the market with heavy profits or losses. And many also do not want to return to investing in crypto because of the trauma they have experienced. If new investors research this, they will know when to enter the market and start investing their money by buying potential coins. But only a few can do it, while others buy when the price is experiencing a correction and continues to decline as it is now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Beparanf",
      "created_time": "October 17, 2022, 01:13:26 PM",
      "body": "Quote from: MrDave on October 17, 2022, 10:07:08 AM2022 is going to be the worst year for crypto investors. Any thoughts guys?Worst? Maybe you didn’t experience other crypto winter before that print huge loss percentage than this especially altcoins that become useless even though it has a huge market cap before. It’s not worst if you invest on high marketcap altcoins right now because it will surely recover later on since they have a working product already unlike before that most crypto projects is just under development and no actual output that can be seen besides the whitepaper.Don’t all in when buying and avoid low caps altcoin as much as possible because they are always the one who’s value goes to zero.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mpamaegbu",
      "created_time": "October 17, 2022, 01:23:57 PM",
      "body": "Quote from: MrDave on October 17, 2022, 10:07:08 AM2022 is going to be the worst year for crypto investors. Any thoughts guys?Lol... You should've been here in 2018 or early part of 2019 to draw an experience and then compare and contrast this. In fact, it was after Bitcoin survived that horrific dump that I concluded it's a Phoenix. Whatever dip that happens now with Bitcoin, I'm not perturbed. I've seen it rise from near death before and I know 2022 won't be an exception. You might think it's the worst year for investors but that will depend where and how you're investing. Trust me, there will be investors who think otherwise because of the so much profit they've made from crypto this year. So, it's different strokes for different folks.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "koang",
      "created_time": "October 17, 2022, 02:22:06 PM",
      "body": "The economy is down the drain. Everybody knows that.The problem right now is the economic market, not crypto itself. No coin is making any moves right now. The best now is to research your favorite crypto and keep accumulating using DCA. One day for sure, the cycle of the bull will come. That is unquestionable. Buy in a bear market and sell in a bull market",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Slow death",
      "created_time": "October 17, 2022, 02:41:19 PM",
      "body": "Quote from: MrDave on October 17, 2022, 10:07:08 AM2022 is going to be the worst year for crypto investors. Any thoughts guys?bear market has always existed, look at 2018 the price also dropped a lot, but after months the price started to rise a lot to the point of reaching 67000. but before it went up a lot people kept saying that it was impossible for the price to go up much again , I even remember that there were some analysts who predicted that the price would reach 25000$ but many people laughed at this and said that it was impossible for the price to reach 20,000$ so soon, so they ridiculed the price predictions of 25000$, but we all saw the price reach 67000$. That's why we shouldn't be too worried about the current low price, as soon as the market looks good the price will start to recover. I believe that the central problem is in the ukraine war against russia, it is wreaking havoc on the economy that was already affected by covidQuote from: koang on October 17, 2022, 02:22:06 PMThe economy is down the drain. Everybody knows that.The problem right now is the economic market, not crypto itself. No coin is making any moves right now. The best now is to research your favorite crypto and keep accumulating using DCA. One day for sure, the cycle of the bull will come. That is unquestionable. Buy in a bear market and sell in a bull market It's true, but it's good that when the person buys, he knows that he has to use money that he won't need so soon, because the market can stay like this for years, so it's better for the person before buying to take note of this so he doesn't have regrets in the future , something like selling at a loss because you need money urgentlyQuote from: Beparanf on October 17, 2022, 01:13:26 PMDon’t all in when buying and avoid low caps altcoin as much as possible because they are always the one who’s value goes to zero.I honestly don't understand why there are still people who believe that investing in altcoins can be a good option, the risk is too high and people ignore it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DeathAngel",
      "created_time": "October 17, 2022, 02:44:36 PM",
      "body": "Quote from: MrDave on October 17, 2022, 10:07:08 AM2022 is going to be the worst year for crypto investors. Any thoughts guys?Some see disaster, others like myself see opportunity. Now is the time to buy assets whilst they are low. You can plant seeds that will give you amazing profits by buying now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jawhead999",
      "created_time": "October 17, 2022, 03:09:02 PM",
      "body": "Investors? Investors are holding their coins for long time since they're believe the fundamental of the coins will perform good after the market is recovering. Actually it's a disaster or worst year of traders since they're trying to beat the market which actually in bear season, now I wonder is there any traders can still make a stable profit by trading? I really doubt it. 2023 might worst than 2022 since the economic sectors are declining.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TheUltraElite",
      "created_time": "October 17, 2022, 03:18:01 PM",
      "body": "Quote from: MrDave on October 17, 2022, 10:07:08 AM2022 is going to be the worst year for crypto investors. Any thoughts guys? Uhh, in case you have not noticed yet, 2022 is just 2months 13days from ending, so you should use words like \"has been\" and not \"going to be\". Besides every year sees bull and bear trends, what happened this year does not mean it is the worst, it is relative how much \"bad\" quotient you are going to give a year. I believe that saying bad because it was bearish is a wrong approach, since these are two sides of the same coin. Because it was bearish you know how good the bull is. Hence you have to capitalize on the distress, by buying bitcoin during the bear and sell during the bull.The market is never good or bad, it cycles. How you catch and use the cycle is upto you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Smitty Werben Man Jensen",
      "created_time": "October 17, 2022, 03:48:32 PM",
      "body": "Quote from: inanilujimi on October 17, 2022, 03:32:00 PMNot sure if 2022 is the worst year the crypto market has ever experienced, now we are in the end of year visitors and I still see the market having a large trading volume which indicates that people's interest in crypto is still there.I believe that if all the problems that exist today have improved the market will also receive the impact.Apart from the condition of the crypto market in 2022 it is experiencing a decline but for me it's not the worst,we must respond to it by remaining calm and wise because panic will only add to the problem,It's true that until now there are still many crypto enthusiasts and that's the truth",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "crwth",
      "created_time": "October 17, 2022, 04:01:47 PM",
      "body": "Imagine having invested into crypto and then losing more than half or even worse, almost all of it this year. I think a lot of people have experienced that and that’s why there are a lot of people who know Cryptocurrency already, but they don’t want to deal with it anymore because of their bad experience. I think it is not just for crypto investors, but also with tangible assets, like the real estate or something. Do you have probably have a bad experience as well With all the inflation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Xal0lex",
      "created_time": "October 17, 2022, 07:15:36 PM",
      "body": "Quote from: MrDave on October 17, 2022, 10:07:08 AM2022 is going to be the worst year for crypto investors. Any thoughts guys?Worse than what? If compared to last year, yes. If compared to all years, it is unlikely, because this crypto winter has not yet lowered coin prices as much as it did in the past bearish trends. Cryptocurrency investing will never show new records every year, it never has and never will. The market cannot go up all the time, bear markets will always exist because investors also fix profits and new investors need a low price to start their investments, or an option to reinvest profits.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "el kaka22",
      "created_time": "October 17, 2022, 07:49:59 PMLast edit: October 17, 2022, 08:42:52 PM by el kaka22",
      "body": "I feel like this is still far better than 2018 for some reason, maybe I am remembering that wrong but the feeling during those times (or at least my feelings) was that it would never recover from that, we were looking at bitcoin as \"how did it even reach 20k to begin with\", and saw that 3k was more than enough, we assumed it would go from few hundred dollars to 3k and that was normal.The unreal part was reaching 20k in between, and now we realize that it's normal for it to be 20k, because we \"dropped\" to 20k right now, we peaked at 68k meaning that it could be 100k one day too, or 200k, or 500k, these are all possible for bitcoin, we didn't feel like that back in the day.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bounceback",
      "created_time": "October 17, 2022, 08:00:44 PM",
      "body": "Quote from: MrDave on October 17, 2022, 10:07:08 AM2022 is going to be the worst year for crypto investors. Any thoughts guys?Maybe for some investors this year is a little bad for them because as long as the bear market has made their portfolio value decrease significantly, but there is also a possibility that some of their investors will think that this year is a good year for them to buy bitcoin because they realize that if they make a purchase now then they can get more bitcoin with less capital and then hold it for long term.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "milewilda",
      "created_time": "October 17, 2022, 08:25:15 PM",
      "body": "Quote from: MrDave on October 17, 2022, 10:07:08 AM2022 is going to be the worst year for crypto investors. Any thoughts guys?Not that exactly because everytime we do experience bad times then this is where we do really make those words but speaking about worst year then it cant be denied that this one is included.Its really a very longbearish market same goes into that year of 2018-2020/21 as far as i remember or something on those times which after we've crashed then the price is moving sideways for too long.This is why on the time you do make out investments then be sure that you are really that prepared or ready for such conditions.You have stepped your foot into this market then you shouldexpect the unexpected which market could really make these kind of movements which would really be causing up some panic if you arent that prepared.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "wheelz1200",
      "created_time": "October 17, 2022, 08:55:30 PM",
      "body": "Quote from: MrDave on October 17, 2022, 10:07:08 AM2022 is going to be the worst year for crypto investors. Any thoughts guys?Ypu have not seen 2015 then lol.  Seriously it hasn't been as bad as then.  Prices were so low and crypto was still a joke to the mainstream.  At least now ypu know there is big money in it and its only a matter of time before it turns around.  2023 might end up being worse than 2022 honestly.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ultrloa",
      "created_time": "October 17, 2022, 09:14:02 PM",
      "body": "Quote from: MrDave on October 17, 2022, 10:07:08 AM2022 is going to be the worst year for crypto investors. Any thoughts guys? Although we experience a bearish trend at the moment we cannot still say that this is bad for investor but in fact this is good opportunity for them to accumulate cheap top coins in the market. You can only say that its worst year if you go with the shitcoin since for sure they all die in current situation so think smart and pick the best which can survive the harsh since they can potentially give you a profit once bull run or great recovery will happen.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MainIbem",
      "created_time": "October 17, 2022, 09:42:14 PM",
      "body": "Most of the investors don't see it as a threat anymore, those who knows about crypto are always aware of the risk and also knows about the dip/bull. Few people are investing in this period knowing that bull might be around the corner so they always utilizes the bear.That's why the whales always remains the whale because at all dip the kept buying while those who panics sells at cheap price.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}