{
  "id": "topic_5470489",
  "title": "alastantiger",
  "author": "alastantiger",
  "created_time": "October 16, 2023, 05:01:06 AM",
  "content": "I hate wars. I hate conflicts. Both they are almost unavailable. Wars and conflicts disrupts lives. It kills people - men, women, babies. Businesses are shot down. Schools are shot down. Boys become father's and look after their moms and siblings because their father has gone to war. Daughters become mothers and have to care for their siblings because they lose their mothers to war. Children with perfectly normal lives become refugeesWars and conflicts doesn't give you the time to plan. It happens fast and it happens suddenly. It comes with a huge economic cost. And for us in the cryptocurrency, we are not exempted too. If you are a miner, your mining operation is affected because if you are caught up in the conflict, you have to abandon it and flee so that you do not get killed. I am deeply saddened by these wars. I am not taking sides because there are human causalities in both sides. - do you have any survival tips during war period?- are there any business that I can do during a period of war so as to sustain my family? Can I still budget, save and earn in Bitcoin?- What is the economic impacts on individuals with families and how do I sustain them during war period.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5470489",
  "comments": [
    {
      "author": "Despairo",
      "created_time": "October 16, 2023, 05:30:37 AM",
      "body": "I wonder how you can think about business when there's a war in your country.Most of countries will use their armed forces to handle it, but if they lack of participants, they will force their civilians especially 18+ years old men to join in war and they also open for volunteers. The country will give a support about foods, place to sleep, and weapon, while the women and kids will stay in the most safest place.So when there's a tension in your country, it's better to fly to other country. Don't too late because civilians will not able to escape except you have a duty to escape.War is inevitable because there are few organizations that earn profit during war e.g. weapon seller.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Chilwell",
      "created_time": "October 16, 2023, 06:26:59 AM",
      "body": "Quote from: alastantiger on October 16, 2023, 05:01:06 AM- do you have any survival tips during war period? The only survival advice I can think of is to hide in a safe place since, from what I gather, war is different from conflicts in that it is very difficult for someone to survive because it involves security personnel from other nations and communities. This also depends on how well-equipped the enemy is; if they are, I can't offer any advice on how to live. War is deadly, and we should avoid it at all costs. Quote- are there any business that I can do during a period of war so as to sustain my family? Can I still budget, save and earn in Bitcoin?Yes, but only in the event that there is no attack on the network in the surrounding environment. Bitcoin is also helpful in such circumstances, but all you can do with it is know that you have it; you cannot spend it or place any orders with it. During this time, no physical business will be permitted as everyone is frantically trying to survive. I don't believe you can engage in any business.Quote- What is the economic impacts on individuals with families and how do I sustain them during war period.War is not only about killing; it involves many other things as well. During this time, it will be difficult to the point where even the president or other national leader will find it frustrating. There won't be any food, water, hospitals, markets, or electricity during a war, and there will be killings everywhere; the only thing that will matter is risk.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Tytanowy Janusz",
      "created_time": "October 16, 2023, 07:01:25 AM",
      "body": "Quote from: alastantiger on October 16, 2023, 05:01:06 AM- do you have any survival tips during war period?Sell local currency, buy dollar and gold (and gold-plated jewelry). the local currency will probably go to waste, the dollar will be good, but it takes up space and it is difficult to bribe the border guard with it, because the light will turn on for him to search you for more. A gold-plated wedding ring given out of desperation as if it were the last and most important souvenir your wife has left of you leaves the guard with no illusions that you have nothing more and he will either let you pass and earn money or nothing at all.Bitcoin will also be good, and probably better than anything I described above for escaping without the risk of funds being seized (just remember 12 words).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Strongkored",
      "created_time": "October 16, 2023, 10:05:25 AM",
      "body": "I don't know for sure how to survive when the country is at war because everything that comes to mind is how to stay safe and also have food supplies until the war is over, and I'm sure only people who survived the war can give the right tips the rest is just guessing.However, if we talk about the impact of war on the world economy, of course, it will be very large, and usually the price of oil and food will have an impact so that we will get higher prices, live more simply and don't buy things whose value will quickly fall and keep holding fiat because this is really needed when buying groceries.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Negotiation",
      "created_time": "October 16, 2023, 10:40:41 AM",
      "body": "During the war only business is not possible to do any work properly the developing world is suffering the most from the embargoes and counter embargoes caused by the war. While the global economic situation was on the way to return to normal after the corona pandemic the war has put the global economic situation in a deep crisis and stress. Controlling wartime inflation is our greatest challenge at present in terms of the impact on banks the only way out of this crisis is to invest in bitcoin because the war will not have any impact on bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lombok",
      "created_time": "October 16, 2023, 11:13:05 AM",
      "body": "Quote from: alastantiger on October 16, 2023, 05:01:06 AMI hate wars. I hate conflicts. Both they are almost unavailable. Wars and conflicts disrupts lives. It kills people - men, women, babies. Businesses are shot down. Schools are shot down. Boys become father's and look after their moms and siblings because their father has gone to war. Daughters become mothers and have to care for their siblings because they lose their mothers to war. Children with perfectly normal lives become refugeesWars and conflicts doesn't give you the time to plan. It happens fast and it happens suddenly. It comes with a huge economic cost. And for us in the cryptocurrency, we are not exempted too. If you are a miner, your mining operation is affected because if you are caught up in the conflict, you have to abandon it and flee so that you do not get killed. I am deeply saddened by these wars. I am not taking sides because there are human causalities in both sides. - do you have any survival tips during war period?- are there any business that I can do during a period of war so as to sustain my family? Can I still budget, save and earn in Bitcoin?- What is the economic impacts on individuals with families and how do I sustain them during war period.Are you and your family in a war zone? To answer that, if you mean we live in a country involved in conflict, I have no comments, to be honest, I have no experience like living in a region/country involved in conflict or war. To survive in a conflict/war area is like gambling, especially since we also set up a business in that place too. Maybe evacuating or moving to a safer place is the first solution and thinking about business, investment and so on is the next number. It's useless to think about business but our lives and those of our families are threatened.I live in a country that I think is safe from war conflict, but the cost of living has increased, oil prices have also increased, and there will definitely be other increases, especially as crises and wars continue to occur in other parts of the world, this will definitely affect everyone. country. My anticipation regarding this is of course investing in what I believe in my way, for example Bitcoin investment. I still have high hopes that after the halving in April 2024, BTC will be able to rise to reach its latest ATH. This is investment money and my only hope.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fuguebtc",
      "created_time": "October 16, 2023, 12:33:46 PM",
      "body": "Quote from: alastantiger on October 16, 2023, 05:01:06 AMI hate wars. I hate conflicts. Both they are almost unavailable. Wars and conflicts disrupts lives. It kills people - men, women, babies. Businesses are shot down. Schools are shot down. Boys become father's and look after their moms and siblings because their father has gone to war. Daughters become mothers and have to care for their siblings because they lose their mothers to war. Children with perfectly normal lives become refugeesWars and conflicts doesn't give you the time to plan. It happens fast and it happens suddenly. It comes with a huge economic cost. And for us in the cryptocurrency, we are not exempted too. If you are a miner, your mining operation is affected because if you are caught up in the conflict, you have to abandon it and flee so that you do not get killed. War is something no one wants because it brings no benefits, but for politicians, those who crave power see it as necessary to prove their power, a hobby. War will never go away and those politicians will never care about our life or death so let's find a way to take care of ourselves if war happens in our country. The war between Russia and Ukraine is not over yet, we continue to witness the war between Israel and Hamas, I don't expect there will be another war from China and Taiwan in the future. I don't want world war 3 to happen but we can't do anything else if they want it to happen.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yamane_Keto",
      "created_time": "October 16, 2023, 12:43:11 PM",
      "body": "What kind of war are you talking about? There is a war in which your country participates, but it is far from the borders of the country. There is a war inside your country that leads to the disruption of part of the economy, or devastation inside the capital that leads to the destruction of most of the economy, or a war inside your region that makes the priority of being alive as your first thought. Some countries in the first state, as their countries support a war somewhere, and some countries ignite wars within the country.If there was an expectation of war, then1) Leave your money in the form of dollars and withdraw it from the bank.2) Store your money in several safe places in several regions.3) Try to have your economic activity linked to services such as water, food, and electricity4) The speed of converting civil manufacturing activity to military and vice versa will determine your profits",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gozie51",
      "created_time": "October 16, 2023, 12:58:22 PM",
      "body": "Quote from: alastantiger on October 16, 2023, 05:01:06 AM- do you have any survival tips during war period?Stay in a safe place, look for refugee camp and safe your life first.Quote from: alastantiger on October 16, 2023, 05:01:06 AM- are there any business that I can do during a period of war so as to sustain my family? Yes if the internet is not destroyed yet. Crypto traders will still do businessQuote from: alastantiger on October 16, 2023, 05:01:06 AMCan I still budget, save and earn in Bitcoin?Yes if you are in a safe region and the internet facility is still available.Quote from: alastantiger on October 16, 2023, 05:01:06 AM- What is the economic impacts on individuals with families and how do I sustain them during war period.I think you already know this. The discomfort for those who are alive in a war zone area doesn't allow for normal planning. All you can do is to improvise and hope that things get back to normal. Usually in war areas, daily jobs are not visible only if you have internet and you are already savvy with it already.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Faisal2202",
      "created_time": "October 16, 2023, 05:09:33 PM",
      "body": "Quote from: alastantiger on October 16, 2023, 05:01:06 AM- do you have any survival tips during war period?- are there any business that I can do during a period of war so as to sustain my family? Can I still budget, save and earn in Bitcoin?- What is the economic impacts on individuals with families and how do I sustain them during war period.I am too young and have never been in a war, so I don't think if my tips would be of any good to you, but one thing I can say for sure is, that survivability is a thing that is present in almost every person, in any conditions, people make bold moves, to save themselves, some give priority to themselves, some give priorities to save others. Overall, survival tips, are to look after yourself and others too, try not to be panic, think wisely, seek shelter, and try to save your family first. This would be my survival to-do list but I pray that a war never comes to us and to anyone. And if a war occurs, then we might not get access to the internet or maybe the electricity would be gone, and I cannot do physical business also, because the existing business would be ruined then how can I run one? And for the third question, the answer varies from person to person, because if a person has nothing to lose like his family is dead or has no one in his family, then his priorities and actions in the war will be totally different from a person who has a family. I mean, if a person is alone, then he can easily find something to eat, and a place to live, etc. for himself, but he might not find all the things for his family. And when that happens then we can say that the economy is being ruined.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blockman",
      "created_time": "October 16, 2023, 05:41:33 PM",
      "body": "No one wants to get involved in a war, only the arms dealers and those people that are earning when there's one.Quote from: alastantiger on October 16, 2023, 05:01:06 AM- do you have any survival tips during war period?It's not on my mind but if it ever happens wherever I am right now, I'll just flee as far as I can but will I be able to do that on my own, no. I've got a family that I have to take with me and I don't know if they'll agree with whatever sudden plan that I'll come up on the spot.Quote from: alastantiger on October 16, 2023, 05:01:06 AM- are there any business that I can do during a period of war so as to sustain my family? Can I still budget, save and earn in Bitcoin?Possible. For Bitcoin, if you have holdings now then you have to keep holding it but much better that don't broadcast or tell that to anybody at that time because everyone is for survival.Quote from: alastantiger on October 16, 2023, 05:01:06 AM- What is the economic impacts on individuals with families and how do I sustain them during war period.Honestly, I don't want to think of these possibilities and future plans if ever it happens. Because I just don't have the nerve to think of it that it might actually come.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rasel29@#",
      "created_time": "October 16, 2023, 07:34:55 PM",
      "body": "Please removed my trust sir..",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "uchegod-21",
      "created_time": "October 16, 2023, 08:33:00 PM",
      "body": "Quote from: alastantiger on October 16, 2023, 05:01:06 AMI hate wars. I hate conflicts. Both they are almost unavailable. Wars and conflicts disrupts lives. It kills people - men, women, babies. Businesses are shot down. Schools are shot down. Boys become father's and look after their moms and siblings because their father has gone to war. Daughters become mothers and have to care for their siblings because they lose their mothers to war. Children with perfectly normal lives become refugeesWars and conflicts doesn't give you the time to plan. It happens fast and it happens suddenly. It comes with a huge economic cost. And for us in the cryptocurrency, we are not exempted too. If you are a miner, your mining operation is affected because if you are caught up in the conflict, you have to abandon it and flee so that you do not get killed. I am deeply saddened by these wars. I am not taking sides because there are human causalities in both sides. - do you have any survival tips during war period?- are there any business that I can do during a period of war so as to sustain my family? Can I still budget, save and earn in Bitcoin?- What is the economic impacts on individuals with families and how do I sustain them during war period.War destroys lives and properties, It disrupts peace of mind, businesses crumble,  loved ones are lost in the battle field your freedoms is restricted.  If your mind  can be at rest to think of a business to do other than staying safe, then you are a super human. The only survival tip that should be on anyone's mind at this point is staying safe. Good for you if you still have access to wifi/Internet and power supply to trade online which I doubt will be available.  Otherwise,  hodl your coins till everything normalises.During wars, civilians are moved to refugee camps. The government,  NGOs and even government of other countries offer paliatives to alleviate the hardship faced during that period.  At this point, there are no bosses. Struggle to stay alive, Obey the rules at the camp. No one likes war, but when it happens we should try to protect ourselves.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coupable",
      "created_time": "October 16, 2023, 08:35:20 PM",
      "body": "Quote from: alastantiger on October 16, 2023, 05:01:06 AM- do you have any survival tips during war period?- are there any business that I can do during a period of war so as to sustain my family? Can I still budget, save and earn in Bitcoin?- What is the economic impacts on individuals with families and how do I sustain them during war period.- There is no solution except to leave the place of conflict or conflict areas as soon as possible. Any other solution cannot be guaranteed, no matter who the guarantor is.- There are those known as the \"war rich\" or they also call them \"crisis merchants\", who are a group whose business flourishes in areas of tension. We find among them arms dealers, for example, contraband dealers, and all those involved in smuggling, because they benefit from the state of chaos imposed by the reality of war. I do not advise you to be one of them because they are more blood brokers than real entrepreneurs.- If you live in a country that has crises that could cause war or potential internal conflict, it is best to prepare yourself and your family for what might happen before it happens. It means, for example, to secure sufficient savings and provide a place to live outside the conflict zone.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dzwaafu11",
      "created_time": "October 16, 2023, 09:02:55 PM",
      "body": "Quote from: alastantiger on October 16, 2023, 05:01:06 AM- do you have any survival tips during war period?Well, there is not much to say here because once a war starts, there is nothing to do but have a place to hide to escape death, injuries, and other disasters that will affect you, your family, business, and other useful things that belong to you. So what I mean here is that the only tip you should know and utilise when there is war is to hide. If you do not have the mind to save other people, you should hide yourself, and I think that's just it. Quote from: alastantiger on October 16, 2023, 05:01:06 AM- are there any business that I can do during a period of war so as to sustain my family? Can I still budget, save and earn in Bitcoin?For the first time you said that during the war you listed things that were affected and you included businesses that were shut down due to the war, so why did you bring business here again? There is no way you are running for your life; you will still be looking for money, especially during the war. When there is war, how can you think about doing business?However, the only time I think you can do business in this period is when maybe people who were affected immigrate from where the war was booming now have someplace to hide for the main time. Then definitely, you may decide to open even a small store there, and you may get paid using BTC if there are people among them that have bitcoin since they may lack the local currency due to the war.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bananington",
      "created_time": "October 16, 2023, 09:03:35 PM",
      "body": "Quote from: coupable on October 16, 2023, 08:35:20 PMQuote from: alastantiger on October 16, 2023, 05:01:06 AM- do you have any survival tips during war period?- are there any business that I can do during a period of war so as to sustain my family? Can I still budget, save and earn in Bitcoin?- What is the economic impacts on individuals with families and how do I sustain them during war period.- There is no solution except to leave the place of conflict or conflict areas as soon as possible. Any other solution cannot be guaranteed, no matter who the guarantor is.- There are those known as the \"war rich\" or they also call them \"crisis merchants\", who are a group whose business flourishes in areas of tension. We find among them arms dealers, for example, contraband dealers, and all those involved in smuggling, because they benefit from the state of chaos imposed by the reality of war. I do not advise you to be one of them because they are more blood brokers than real entrepreneurs.- If you live in a country that has crises that could cause war or potential internal conflict, it is best to prepare yourself and your family for what might happen before it happens. It means, for example, to secure sufficient savings and provide a place to live outside the conflict zone.Unless our dear OP decides to sells weapons or their parts to the waring bodies, then the only business you should be more concerned with, is how to leave the place and settle where it would be more peaceful to source for jobs and look after a family. BTC is one sure way to earn in these times because of the campaigns and signature business ongoing. Take a cue and learn how to tradd using bots as well.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Spaceman1000$",
      "created_time": "October 16, 2023, 10:08:23 PMLast edit: October 17, 2023, 08:51:57 PM by Spaceman1000$",
      "body": "Quote from: alastantiger on October 16, 2023, 05:01:06 AMI hate wars. I hate conflicts. Both they are almost unavailable. Wars and conflicts disrupts lives. It kills people - men, women, babies. Businesses are shot down. Schools are shot down. Boys become father's and look after their moms and siblings because their father has gone to war. Daughters become mothers and have to care for their siblings because they lose their mothers to war. Children with perfectly normal lives become refugeesWars and conflicts doesn't give you the time to plan. It happens fast and it happens suddenly. It comes with a huge economic cost. And for us in the cryptocurrency, we are not exempted too. If you are a miner, your mining operation is affected because if you are caught up in the conflict, you have to abandon it and flee so that you do not get killed. I am deeply saddened by these wars. I am not taking sides because there are human causalities in both sides. - do you have any survival tips during war period?- are there any business that I can do during a period of war so as to sustain my family? Can I still budget, save and earn in Bitcoin?- What is the economic impacts on individuals with families and how do I sustain them during war period.Nobody benefits from war as lives are destroyed and  economic reality is always on the downtrend, that is why it is always said that, it better to jaw-jaw than to war-war. Dialogue is always the solution to any conflict because even after the war the both warring factions will still come to a round table to dialogue, so why not dialogue in the first place before going to war, because dialogue will prevent the war from happening.There are hardly survivor tips in war, because everywhere will be destroyed, except you have to move over to remote areas that are not known by your enemies to stay low, if not everywhere is almost brought to the ground level, they say whatever you do in war is fair.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Twentyonepaylots",
      "created_time": "October 16, 2023, 10:55:32 PM",
      "body": "Being in war is being at chaos.It is almost impossible to get your business running during war, especially if the whole country is involve in war like landlock countries in Asia and Europe. It's always the people who suffer for the aftermath. Timely, I just watched a survivor from Israel, they are so innocent partying just dancing along during the festival moments after they are running with bullets and for their lives. From there I can already assume that living in war is such a traumatic experience that you can't even think about opening a business or doing stuff by yourself.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kingvirtus09",
      "created_time": "October 16, 2023, 11:07:50 PM",
      "body": "Quote from: alastantiger on October 16, 2023, 05:01:06 AMI hate wars. I hate conflicts. Both they are almost unavailable. Wars and conflicts disrupts lives. It kills people - men, women, babies. Businesses are shot down. Schools are shot down. Boys become father's and look after their moms and siblings because their father has gone to war. Daughters become mothers and have to care for their siblings because they lose their mothers to war. Children with perfectly normal lives become refugeesWars and conflicts doesn't give you the time to plan. It happens fast and it happens suddenly. It comes with a huge economic cost. And for us in the cryptocurrency, we are not exempted too. If you are a miner, your mining operation is affected because if you are caught up in the conflict, you have to abandon it and flee so that you do not get killed. I am deeply saddened by these wars. I am not taking sides because there are human causalities in both sides. - do you have any survival tips during war period?- are there any business that I can do during a period of war so as to sustain my family? Can I still budget, save and earn in Bitcoin?- What is the economic impacts on individuals with families and how do I sustain them during war period.Who wants war, right? except for the leaders of each country who have this desire or those who have bad intentions. During the war, can you still think of doing business if your surroundings are full of gunfire, explosions, and killings? Of course, that thing cannot be thought of first.Your main goal will be to save your family's life, if you have one, or your own. And hide in a place that is far from the battle and killing; this will be your way to survive and escape this deluge. And there are some countries that have conflicts with each other, and I hope they will not increase.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}