{
  "id": "topic_5420167",
  "title": "zasad@",
  "author": "zasad@",
  "created_time": "November 09, 2022, 02:28:11 PM",
  "content": "https://www.wsj.com/articles/401-k-plans-now-let-workers-put-retirement-money-into-cryptocurrency-11667480401\"A small group of workers is finding something new in their 401(k) plan: the option to invest in cryptocurrency.Momentum has been building to allow workers to invest retirement savings in bitcoin, ether and other cryptocurrencies, despite crypto’s sharp dives and warnings from regulators.Retirement-plan providers have moved ahead, and some of the 24,500 401(k) plans that Fidelity Investments administers began offering bitcoin in their investment menus this fall, the company said. ForUsAll Inc., a San Francisco-based 401(k) provider that caters to small companies and has $1.4 billion in retirement-plan assets, says 50 of its 550 clients began allowing workers to invest some of their retirement savings in cryptocurrency, including bitcoin and ether, about eight weeks ago.\"",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5420167",
  "comments": [
    {
      "author": "NeuroticFish",
      "created_time": "November 09, 2022, 02:41:44 PM",
      "body": "Quote from: zasad@ on November 09, 2022, 02:28:11 PMMomentum has been building to allow workers to invest retirement savings in bitcoin, ether and other cryptocurrencies, despite crypto’s sharp dives and warnings from regulators.If the crypto assets are legal (and they are), I see no reason to not be added into investment and pension funds, especially as the pension funds are meant to be very-long-term investments and bitcoin, at least, has a history of being very good investment if it's held for 4 or more years.Of course, regulators will be crying. Of course it's young assets and rather risky ones - altcoins have a bad reputation as long term investments, even bitcoin history is too short to draw really good conclusions.On the other hand.. what makes stocks or even government bonds that much better? Shit can happen with those too.I guess that people can at least choose their pension fund, and some will pick those with crypto in the portfolio and others will not. I find it good to give people a real choice.I talk from the logic of the private pension funds I know in my country. If US pensions are much different and I'm wrong, please correct me.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Coin-Keeper",
      "created_time": "November 12, 2022, 08:55:59 PM",
      "body": "You could argue that BTC is \"on sale\" right now.  For X money you are buying more coins than last year.  This all depends upon your risk adversity and where you think coin value will be long term.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NeuroticFish",
      "created_time": "November 13, 2022, 09:38:26 AM",
      "body": "Quote from: Coin-Keeper on November 12, 2022, 08:55:59 PMYou could argue that BTC is \"on sale\" right now.  For X money you are buying more coins than last year.  This all depends upon your risk adversity and where you think coin value will be long term.Even more, the lower the price is, the bigger the chance it won't go much lower. So buying now can be a very good business.However, this is arguably more a Speculation than being on-topic...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kakmakr",
      "created_time": "November 14, 2022, 05:48:23 AM",
      "body": "I say why not? Every investment portfolio should have a good balance between Low / Medium / High risk investment options. If a person invest say 50% of their funds in low risk and 30% in medium risk and then 20% in high risk Crypto investments.... then I will not have a problem with that. Pension on average... do not grow aggressively, because the investment structure are pumped into low risk investments with slow growth... so exposure to some high risk Crypto investments... can help to boost it with good growth.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaveF",
      "created_time": "November 14, 2022, 04:10:41 PM",
      "body": "What I could not find, anywhere on either of the sites (and it may not be available if you are not a plan member) are the fees and rates and other things.Yes, it's GREAT news that people can do this. But if they are getting a 5% commission, it's less great. Since it's held by somebody else you fall into the not your keys, not your coins issue, also less great. If where they are holding your BTC get's hacked / collapses what are your options. Even if Fidelity implodes, if I bought stock it's still mine. Might have to jump through some hoops to get it, but I can still get it.All in all it's better then not being able to put some money from your 401k into BTC, but without more info it's tough to say how much better.-Dave",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "philipma1957",
      "created_time": "November 14, 2022, 07:41:54 PM",
      "body": "At the moment flight to safety is big.Many are draining their exchange wallets.Or converting coins to cash.I think investing my pension in a btc fund is too risky = a pretty common belief at the moment.Which usually means do some and be a contarian.My self I am 65 so setting a pension fund up 🆙 is not in my plans.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NeuroticFish",
      "created_time": "November 15, 2022, 08:52:29 AM",
      "body": "Quote from: philipma1957 on November 14, 2022, 07:41:54 PMI think investing my pension in a btc fund is too risky = a pretty common belief at the moment.You have the know-how to keep your bitcoins in a cold storage. Most don't even understand good enough what Bitcoin is.They will just pick a fund, and if that fund also invests into Bitcoin, or more likely into some Bitcoin related financial product, they may have a bit bigger pension.This can be good for both the elderly and bitcoin ecosystem too, if along the route at least one of those entities must keep real bitcoins in their stash, and the full amount, not a fractional reserve.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SFR10",
      "created_time": "November 15, 2022, 02:27:03 PM",
      "body": "Quote from: DaveF on November 14, 2022, 04:10:41 PMWhat I could not find, anywhere on either of the sites (and it may not be available if you are not a plan member) are the fees and rates and other things.I'm not sure if what I'm about to post is from the official website of ForUsAll or not, but I found the following information concerning fees:Quote from: https://www.forusall.com/pricingCrypto user platform fee:0.083% of crypto balance/moCrypto user transaction fee:0.15% per tradeQuote from: https://www.forusall.com/crypto-401kWhat are the fees for the Self-Directed Crypto Window?Custody and administration fee: An annual fee of 1% of the average daily balance in the crypto window once the crypto window is activated with funds. This fee will be billed quarterly.Plan services fee: In addition to the 1% annual custody and administration fee, the employee will continue to pay a plan services fee on the assets they hold in the Self-Directed Crypto Window.Cryptocurrency trades: When you place a trade, you will be charged a trading fee that is based on the monthly trading volume of all of ForUsAll’s clients during the prior month. The maximum trading fee is 0.50%.I just found out that employees have to pass a quiz [17:57 to 18:14] in order to access the crypto window [I haven't checked recently what Fidelity has done, but AFAICR, they didn't have such a thing in place].",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cr1776",
      "created_time": "December 06, 2022, 03:16:44 PM",
      "body": "Quote from: philipma1957 on November 14, 2022, 07:41:54 PMAt the moment flight to safety is big.Many are draining their exchange wallets.Or converting coins to cash.I think investing my pension in a btc fund is too risky = a pretty common belief at the moment.Which usually means do some and be a contarian.My self I am 65 so setting a pension fund up 🆙 is not in my plans.I'd have to say that long term, bitcoin IS safety if you have a longer attention span that a fly.  :-)  Sure, if you bought at 60k you are down now, but if history turns out to be any guide, you just need to give it time.  There isn't a guarantee that bitcoin will always go up.  People tend to panic at the exact wrong time and buy high and sell low which is a sure way to lose.  The mantra for > 12 years now is: mine or buy some and put it in cold storage.  Check the price in 5 years and for most retirement plans (except in your case being 65! :-)  ) the timeframe for an investment is decades.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "karabiber",
      "created_time": "December 12, 2022, 05:25:25 PM",
      "body": "When you retire the money you have saved for years should make you feel safe. You've worked for years and now it's time to retire to the comfort of your own. Let's face it, risk still exists for cryptocurrencies. For this reason, you may feel like you are alone on a deserted island in the middle of the ocean in a big crypto drop that will occur at retirement time. But even if you lose, you can deposit crypto money for retirement funds in amounts that you will not be upset about. Maybe these crypto money you deposit will cover all your retirement savings in the future. I think risk taking for the pension fund should be avoided.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NeuroticFish",
      "created_time": "December 12, 2022, 06:37:31 PM",
      "body": "Quote from: karabiber on December 12, 2022, 05:25:25 PMWhen you retire the money you have saved for years should make you feel safe. You've worked for years and now it's time to retire to the comfort of your own. Let's face it, risk still exists for cryptocurrencies. For this reason, you may feel like you are alone on a deserted island in the middle of the ocean in a big crypto drop that will occur at retirement time. But even if you lose, you can deposit crypto money for retirement funds in amounts that you will not be upset about. Maybe these crypto money you deposit will cover all your retirement savings in the future. I think risk taking for the pension fund should be avoided.You are only partly right. All investment funds, including pension funds, do invest in a wide range of assets, from the most solid ones (government bonds and so on) to some riskier ones (like stocks).The percent of funds in the various assets depends, in some cases even the user has a choice to make (within a rather small range).This being said, investing some percent of the fund in crypto will not have a dramatic effect, in any direction. Still, if instead of crypto they invest in bitcoin, since those coins will be held for way more than 4 years, they can return nice gains, making the days of the elderly significantly easier/better.So you are right, they should not take big risks. But some rather small percent has the potential to do more good than bad (especially if the investment is in bitcoin, not the historically disappointing \"crypto\").",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}