{
  "id": "topic_5430895",
  "title": "nikiton1994",
  "author": "nikiton1994",
  "created_time": "December 21, 2022, 05:39:16 PMLast edit: December 22, 2022, 10:42:59 AM by nikiton1994",
  "content": "What happened:: The #1 crypto casino in the world blocked access to my account with a balance of approximately $750Scammers Profile Link: https://trustdice.win/Reference Link: my login sitnikov-nikita@mail.ru, nickname nikiton1994Amount Scammed: 750$Payment Method: USDTProof of Payment: https://tronscan.org/#/transaction/46a817b21c8ac737595e501c7dec5c7f2a8b98bda3b0703561de80e977a384b2https://tronscan.org/#/transaction/634be294583d4de7acb8dec45bde589b5b1dd2a13ff7eca056e0cb002e708f57https://tronscan.org/#/transaction/a82568af7c69e4c3ad39e02ddcaa63625dd7628fd7641de2fb58aaa2bf1bd3f2https://tronscan.org/#/transaction/7f4a4f91b2bed91ca1f055a296cf83256d98221488b8a629cb0d159c76fe0ef6https://tronscan.org/#/transaction/9a365146d5595ad714d58e4da39d6085c4943becbaed34ab4711a410f568a260https://tronscan.org/#/transaction/84e39132222a5aec9f19baf12ea2ab82153b405006ca1db3f395abc1ac68348fPM/Chat Logs: https://imgur.com/a/zwzRyhsAdditional Notes: Good evening. About a month ago on the forums I heard about the #1 CryptoCasino in the world - trustdice.win. High rating, good reviews, online chat with live players on the site. Great, signed up, started playing. He made sports bets on football, basketball, hockey. Most of them are top championships, NBA, NHL. Payments came in 15 minutes, in rare cases there were delays from 4 to 12 hours. 2 weeks after the next NBA matches, I put part of the balance on the withdrawal. After 6 hours, I received a win. Then I decided to put another part. A few hours later I couldn't log into my account. \"Your account has been blocked.\" On the account of about $ 750. I received a message in the mail with a link to the paragraph of the rules, which I allegedly violated. For all the time, if you compare how much money I lost and how much I won, I managed to win about $1000. After that CryptoCasino No. 1 in the World decided that these were irreparable losses and silently blocked my account and stole my money. Please help me solve this problem, because the support of this site is ignoring me. Attached all kinds of screenshots and links to transactions. I don't have anything else because I can't log into my account. I don’t know English well enough, so I typed all the text using Google translator. I apologize in advance if there are any mistakes.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5430895",
  "comments": [
    {
      "author": "Laki21000",
      "created_time": "December 21, 2022, 08:06:21 PM",
      "body": "And hello again @coinbox1, OP was blocked for me for the same reason exactly the same as yours, check it out.   https://bitcointalk.org/index.php?topic=5425888.0I'm not surprised at all that you haven't changed your attitude. However, we are waiting for a response from the casino representative, perhaps there will be evidence of blocking.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Poika5",
      "created_time": "December 21, 2022, 10:32:55 PM",
      "body": "December 6th? All 3 of us were banned on the same day. Laki21000, is OP your friend? TRC20 USDT, from the same country, banned on the same day.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yahoo62278",
      "created_time": "December 21, 2022, 11:09:37 PM",
      "body": "This is going to start looking fishy if we start seeing a bunch of newbies pop up with accusations. It's fine if legitimate claims but I'm also noticing the same people coming to defend the new accusation. Let's make sure it's an accurate claim before jumping on trustdice. @Coinbox1 you might look at how many players were banned for the same thing these guys are claiming and look for connections to each account. I'm not saying I don't believe you OP but I think it's best for a site to be safe rather than sorry later.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Laki21000",
      "created_time": "December 21, 2022, 11:45:50 PM",
      "body": "Quote from: Poika5 on December 21, 2022, 10:32:55 PMDecember 6th? All 3 of us were banned on the same day. Laki21000, is OP your friend? TRC20 USDT, from the same country, banned on the same day.You're laughing? I don't know who it is at all. But it looks suspicious.Apparently, he was blocked recently, in any case, I would not advise trustdice to any of my friends, then I will definitely be left without friends QuoteLet's make sure it's an accurate claim before jumping on trustdice. @Coinbox1 you might look at how many players were banned for the same thing these guys are claiming and look for connections to each account.I'm not defending anyone, by any means.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitcoinGirl.Club",
      "created_time": "December 22, 2022, 12:31:51 AM",
      "body": "Quote from: yahoo62278 on December 21, 2022, 11:09:37 PM @Coinbox1 you might look at how many players were banned for the same thing these guys are claiming and look for connections to each account. Who is @coinbox1 and what is his relation to the accusation?It seems Laki21000 and OP has similar case, nothing else to connect yet. Poika5 seems trying to find connection between Laki21000 and OP so clearly he is standing on the other side than them.It will be nice to hear from the Trustdice team. Would be even better if they show some evidences rather than just words when they explain.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nikiton1994",
      "created_time": "December 22, 2022, 07:25:05 AM",
      "body": "Quote from: yahoo62278 on December 21, 2022, 11:09:37 PMThis is going to start looking fishy if we start seeing a bunch of newbies pop up with accusations. It's fine if legitimate claims but I'm also noticing the same people coming to defend the new accusation. Let's make sure it's an accurate claim before jumping on trustdice. @Coinbox1 you might look at how many players were banned for the same thing these guys are claiming and look for connections to each account. I'm not saying I don't believe you OP but I think it's best for a site to be safe rather than sorry later.Greetings! I agree to any checks, KYC, so that they show screenshots of my bets with information about the event, amount and time. Since I can’t log into my account and take screenshots of bets on my own. Let them check IP addresses, transactions. Anything. I am in touch every day.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Plaguedeath",
      "created_time": "December 22, 2022, 08:29:11 AM",
      "body": "Laki21000 is a different person, he just have a similar complaint in his thread Trustdice.win , UPD: TRUSTDICE SCAM, 2138$ USDT confiscated. (SOLVED) but already resolved.However they don't give a good explanation about the accusation, but since they're care with their reputation they're made full payment to Laki21000.So I don't really expect about the clear explanation of the reason why your account got blocked, maybe you will get the payment.Quote from: BitcoinGirl.Club on December 22, 2022, 12:31:51 AMQuote from: yahoo62278 on December 21, 2022, 11:09:37 PM @Coinbox1 you might look at how many players were banned for the same thing these guys are claiming and look for connections to each account. Who is @coinbox1 and what is his relation to the accusation?Coinbox1 is a Trustdice's representative in this forum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nikiton1994",
      "created_time": "December 22, 2022, 10:47:32 AM",
      "body": "Hello everyone. I want to say \"Thank you to all\". The TrustDice team contacted me and asked for a wallet address for a refund. I hope these are isolated cases of their mistakes. My account has not been unblocked, so I would be grateful if someone could recommend a really reliable bookmaker!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "janggernaut",
      "created_time": "December 22, 2022, 12:38:01 PM",
      "body": "Quote from: nikiton1994 on December 22, 2022, 10:47:32 AMso I would be grateful if someone could recommend a really reliable bookmaker!There are lot of trusted bookmaker out there, you can easily find them on gambling section. Maybe stake or you can try to play on Winz.io for other games as well, since we are legit.Its glad you have your funds back, now never return to trustdice and you can lock this thread",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Eternad",
      "created_time": "December 23, 2022, 04:30:54 PM",
      "body": "Quote from: BitcoinGirl.Club on December 22, 2022, 12:31:51 AMQuote from: yahoo62278 on December 21, 2022, 11:09:37 PM @Coinbox1 you might look at how many players were banned for the same thing these guys are claiming and look for connections to each account. Who is @coinbox1 and what is his relation to the accusation?Coinbox1 is the representative account of trustdice here in forum. He is the one dealing all the issue related to Trustdice like this. The issue is already resolved privately so I doubt that he will come here but I hope so to make clarification on what’s going on. They already initiate the refund without unblocking the account which means the issue is based on there personal reasons and not due to the users violation.Quote from: nikiton1994 on December 22, 2022, 10:47:32 AMHello everyone. I want to say \"Thank you to all\". The TrustDice team contacted me and asked for a wallet address for a refund. I hope these are isolated cases of their mistakes. My account has not been unblocked, so I would be grateful if someone could recommend a really reliable bookmaker!Congratulations. Can you share the details on what they said when they refund the account? Does trustdice gives you the reason or they just refund the money?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "8rch7",
      "created_time": "December 23, 2022, 06:27:28 PM",
      "body": "Seems its not the first people complaint about their account was suspend in trustdice.win, this months have two cases with the same gambling casino and how it possibility easy for suspend the user trustdice when trying withdraw. I still remember this topic Trustdice.win , UPD: TRUSTDICE SCAM, 2138$ USDT confiscated. (SOLVED) and happen created on December 05, about twenty days later have another cases with the same casino gambling. Although first cases have been solved, I hope this another cases about Trustdice can refund all without waiting for longer time, OP could sharing with your account progress about refund have sent or still on the way",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "skarais",
      "created_time": "December 23, 2022, 06:38:27 PM",
      "body": "Quote from: 8rch7 on December 23, 2022, 06:27:28 PMAlthough first cases have been solved, I hope this another cases about Trustdice can refund all without waiting for longer time, OP could sharing with your account progress about refund have sent or still on the wayTry scrolling through the 9th post on this thread, the OP's issue has been resolved and he has confirmed getting his refund.The team has resolved the issue, but how it was resolved and what the OP actually violated is of course still unknown. Not much information on that, but the funds have been returned even though the account is still locked.Quote from: nikiton1994 on December 22, 2022, 10:47:32 AMHello everyone. I want to say \"Thank you to all\". The TrustDice team contacted me and asked for a wallet address for a refund. I hope these are isolated cases of their mistakes. My account has not been unblocked, so I would be grateful if someone could recommend a really reliable bookmaker!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nikiton1994",
      "created_time": "December 24, 2022, 04:49:56 PM",
      "body": "Hello everyone!If interested, I am attaching screenshots of letters received from the trustdice team.I have nothing to hide. I didn't break their rules.https://imgur.com/a/1Yc5eGr",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}