{
  "id": "topic_5418700",
  "title": "Courator",
  "author": "Courator",
  "created_time": "October 29, 2022, 03:55:20 AM",
  "content": "If I invest €100 in a cryptocurrency and it has a current value of €0.01 per coin and the next day it has risen to €1.14 per coin, then that is an increase of 114%. Will I then have €11,400 instead of 100€ ?And is it the same if I invest €100 in BTC and it goes from €10,000 per coin to €114,000. It's also 114% and then I have €11,400 instead of €100??both are 114% raise but huge diffenrece in actuall coin value and market capacity. does it matter? or is it only the percentage of raise and fall.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5418700",
  "comments": [
    {
      "author": "Upgrade00",
      "created_time": "October 29, 2022, 04:04:26 AM",
      "body": "Quote from: Courator on October 29, 2022, 03:55:20 AMAnd is it the same if I invest €100 in BTC and it goes from €10,000 per coin to €114,000. It's also 114% and then I have €11,400 instead of €100??You made an error in your calculations, I'll use the BTC assumption to correct it, but it applies both ways;• €10,000 to €114,000 is a growth of €104,000,• This is a percentage increase of 1,040% and not 114%,• This implies that the asset multiplied over 10 times from it's initial price,• With an investment of €100, you would have €1,140 with that percentage growth. I have no idea how you ended up with over €10k.Quote from: Courator on October 29, 2022, 03:55:20 AMboth are 114% raise but huge diffenrece in actuall coin value and market capacity. does it matter? or is it only the percentage of raise and fall.It doesn't matter technically in the hypothetical situation, but in reality the risk of investing in a low value coin exists and you could easily be left of with 0 after a few months or years.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Don Pedro Dinero",
      "created_time": "October 29, 2022, 04:07:48 AM",
      "body": "A bery simple piece of advice: go to maths revision classes. An increase of 114% would have been to have risen to €0.0214 per coin.Not much more to add to what Upgrade00 said. As I just said, brush up on your maths before using strategies.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "October 29, 2022, 06:42:41 AM",
      "body": "Your math errors aside, don't look at unit price when buying crypto or stocks as it's a useless factor knowing that you could (almost) always buy fractions of a coin/token/stock.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Despairo",
      "created_time": "October 29, 2022, 07:17:18 AM",
      "body": "It's better if you this site to calculate the return percentage since you're didn't have a good math [1]You can use crypto portfolio too like Blockfolio, Coinstats etc, it will help you to let you know how much the unrealized profit or loss of each coins you've bought. I think you must learn about the basic thing first before try to invest your money to crypto, my advice is don't invest in shitcoins and only choose Bitcoin.[1] https://bitgiftshop.com/bitcoin-investments-calculator/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "October 29, 2022, 07:48:14 AM",
      "body": "What you are describing here is known as pump and dump which is common in the altcoin market where every day they choose a couple of altcoins to pump. But you have to know that it is not just \"pump\" there is a second step called the \"dump\" that comes right after it. For example if that shitcoin were pumped from 0.01 to 1.00 then it will then be dumped from 1.00 to 0.01 and usually keeps going lower to something like 0.005.That is not true in bitcoin though. If bitcoin goes from $150 to $20000 (that is the previous cycle between 2014 to 2017), even if it gets dumped it will never go back down to $150 or lower than it. Which is why the crash in 2018, even though was huge it only went as low as $3200.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "October 29, 2022, 07:53:57 AM",
      "body": "Let me use bitcoin as an example. You have $1000, you bought bitcoin at $19000 (initial price) and bitcoin presently at $20000 (final price). If you sell bitcoin at $2000.Profit = (final price divided initial price multiply by investment capital) - investment capital           = (20000 ÷ 19000 x 10000) - 10000           = (1052.63) - 1000           = $52.63",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "notocactus",
      "created_time": "October 29, 2022, 08:04:15 AM",
      "body": "Your math is not correct but let's discuss about two investments in Bitcoin and one altcoin with a potential same ROI.Some factors that can impact your investment endingChoose a good coin that won't dead with time. Remember most of altcoins dead after 2 years and it is why we have the saying \"An altcoin is only worth to consider if it survives after one full cycle of the market that is 4 years (with bull and bear phases).Daily trading volume. It is very important because if you invest with big capital (not what you presented in OP), you will need to find a coin that has high trading volume. With high trading volume, you won't make a considerable impact on price when you buying or selling it that can reduce your actual ROI.Lastly, not all coins or tokens with high trading volume are actually good ones.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Chato1977",
      "created_time": "October 29, 2022, 08:39:00 AM",
      "body": "Quote from: Don Pedro Dinero on October 29, 2022, 04:07:48 AMA bery simple piece of advice: go to maths revision classes. An increase of 114% would have been to have risen to €0.0214 per coin.Not much more to add to what Upgrade00 said. As I just said, brush up on your maths before using strategies.That is practical advise , because he is asking about simple Crypto Question but he has no real idea what is the question all about.______________________________________But the Bottom line here is? always Invest in Bitcoin no matter how OP calculated the difference   Altcoin is always next to bitcoin and that is what reality means.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "buwaytress",
      "created_time": "October 29, 2022, 12:59:45 PM",
      "body": "Definitely don't look at unit price as mk4 says. I still find it surprising I've met people who say, \"yeah crypto is interesting but Bitcoin's already XX,XXX, too expensive, shitcoinA is better only less than 1 cent\", or something to that sentiment anyway.Look instead at performance in terms of percentage (so definitely get that side of your maths right first). Even Google price chart can help you there.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "serjent05",
      "created_time": "October 29, 2022, 01:24:27 PM",
      "body": "Quote from: Courator on October 29, 2022, 03:55:20 AMIf I invest €100 in a cryptocurrency and it has a current value of €0.01 per coin and the next day it has risen to €1.14 per coin, then that is an increase of 114%114x (11400%). Will I then have €11,400 instead of 100€ ?And is it the same if I invest €100 in BTC and it goes from €10,000 per coin to €114,000. It's also 114%114x (11400%) and then I have €11,400 instead of €100??There corrected it for you.Quote from: Courator on October 29, 2022, 03:55:20 AMboth are 114x (11400%) raise but huge diffenrece in actuall coin value and market capacity. does it matter? or is it only the percentage of raise and fall.Pricing does not matter what matter is the percentage adjustment of the market.  You will get the same result in the same amount of investment on two markets even with different pricing if the price percent adjustment is the same.  So basically it is the percentage change that matters.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hamza2424",
      "created_time": "October 30, 2022, 07:43:09 PM",
      "body": "Whoops dude first of all your subject or you can say that thread tittle is absolutely wrong. I was not expecting such type of questions here as its related to trading and ALTS as this section of the forum is related to bitcoin only. For the answer of your question math is simple don't get confused as my math is weak still I am sure you can calculate the figures very well if not then dude finance is not your subject and Bitcoin is all about finance.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "The Cryptovator",
      "created_time": "October 30, 2022, 08:34:11 PM",
      "body": "Use a good calculator lol (just kidding). You will see the total current value. If the price goes up 100% it means 2x from what you bought. If the price goes down 100% means it will be half of your bought price. 100% down doesn't mean you lost everything. It's not gambling at all. You should learn maths to be honest. Nothing wrong here.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "_BlackStar",
      "created_time": "October 30, 2022, 08:47:38 PM",
      "body": "Quote from: Courator on October 29, 2022, 03:55:20 AMIf I invest €100 in a cryptocurrency and it has a current value of €0.01 per coin and the next day it has risen to €1.14 per coin, then that is an increase of 114%. Will I then have €11,400 instead of 100€ ?Simply, you will know how much profit you get if you have a portfolio. You can also calculate the ROI you generate from your investment manually by multiplying the number of coins you have vs the current price. Then what makes you confused, is there any doubt about the calculation of your profit in certain service?Quote from: The Cryptovator on October 30, 2022, 08:34:11 PM100% down doesn't mean you lost everything. It's not gambling at all.True, but will be lost if the OP trade future trading. Traders will not lose coins even if the price goes zero. It will stay in the wallet forever [if not moved]",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blockman",
      "created_time": "October 30, 2022, 08:51:50 PM",
      "body": "OP come back and look at the answers provided to you about the calculations. I'll give you the idea, if you invest small and there's a price target that you'll be able to sell and willing to wait, I know that you're calculating it there from now on. As you're new to bitcoin investing, it's better if you just go through the dollar cost averaging strategy(DCA) and you'll get to buy at each time you have set to buy bitcoin. That's way better because you'll be more overwhelmed when the price of btc goes on high again.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "examplens",
      "created_time": "October 31, 2022, 11:55:11 AM",
      "body": "Quote from: Courator on October 29, 2022, 03:55:20 AMboth are 114% raise but huge diffenrece in actuall coin value and market capacity. does it matter? or is it only the percentage of raise and fall.let's ignore your math problem for a moment and try to understand what you wanted to say.bitcoin is one currency but you didn't mention what other currency it could be. if the jump of both currencies is like that, then the value must be the same. if we assume that it is some shit token, its current value must be taken with a grain of salt, and it is equivalent only to the value for which you can sell them right away.For example, some tokens have a $100k daily volume, and it is certain that you cannot sell at such a value on the same day with the given price.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "KaliLinux",
      "created_time": "October 31, 2022, 12:45:32 PM",
      "body": "Quote from: Courator on October 29, 2022, 03:55:20 AMIf I invest €100 in a cryptocurrency and it has a current value of €0.01 per coin and the next day it has risen to €1.14 per coin, then that is an increase of 114%. Will I then have €11,400 instead of 100€ ?And is it the same if I invest €100 in BTC and it goes from €10,000 per coin to €114,000. It's also 114% and then I have €11,400 instead of €100??both are 114% raise but huge diffenrece in actuall coin value and market capacity. does it matter? or is it only the percentage of raise and fall.I believe everyone that has responded here already gave you good advice whether it was based on your maths calculation or otherwise but what I want to point out here is, this seems like the usual Newbie thinking. Rather than focusing on knowing what is important in Bitcoin investment, it is all about the profits you will make from investing what amount that's your first priority even though you are calculating it wrongly. A typical Newbie mentality of thinking this will be their get-rich-quick channel and stop thinking of that king of % rise in a single day.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}