{
  "id": "topic_5461579",
  "title": "komisariatku",
  "author": "komisariatku",
  "created_time": "July 31, 2023, 12:02:17 PM",
  "content": "Salam, Sebelumnya mohon maaf saya buat utas lagi untuk meneruskan diskusi Resiko Kehilangan Key Wallet Bitcoin, Apa solusinya? untuk Refokusing topikDiskusi ini di dedikasikan untuk fokus pada pembahasan:1. Bagaimana cara agar bitcoin bisa menjadi aset keluarga?2. Bagaimana cara mewariskan bitcoin?3. Bagaimana cara anda mensikapi kunci dompet untuk berjaga-jaga ketika kondisi tidak berpihak kepada kita (kematian tiba-tiba), apakah anda memberi tahu seseorang tentang kunci dompet anda?Di utas sebelumnya saya telah menyampaikan sedikit gambaran tentang resiko kehilangan kunci, dan atau karena sebab meninggal dunia. Mungkin saat ini belum menjadi masalah yang serius karena kebanyakan dari kita masih cukup muda untuk berbicara tentang kematian, akan tetapi kematian tidak ada yang tahu kapan hal itu akan terjadi. Sementara jika kunci dompet hanya di miliki oleh kita (pemilik wallet) mungkin itu akan menjadi masalah serius jika tidak ada yang tau salinan kunci dompet dan semua aset akan membeku tanpa bisa di buka kembaliDiskusi ini tidak termasuk dalam asset yang berada di pertukarang (exchange) karena kalau di pertukaran kemungkinan bisa tetap di akses karena mereka terpusat seperti bank konvensional meskipun mungkin prosedurnya cukup rumit.Saya menemukan beberapa artikel yang mengulas masalah warisan bitcoin, seperti:https://www.kompas.id/baca/opini/2021/07/01/cara-mewariskan-aset-kripto-ketika-pemiliknya-meninggal/https://qwords.com/blog/cara-mewariskan-bitcoin/https://pluang.com/id/blog/resource/investasi-bitcoin-wafatTapi rasanya kurang \"greget\" kalau cuma membaca di artikel website, jadi mungkin kita berdiskusi disini",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5461579",
  "comments": [
    {
      "author": "Luzin",
      "created_time": "July 31, 2023, 12:34:36 PM",
      "body": "Quote from: komisariatku on July 31, 2023, 12:02:17 PMDiskusi ini di dedikasikan untuk fokus pada pembahasan:1. Bagaimana cara agar bitcoin bisa menjadi aset keluarga?2. Bagaimana cara mewariskan bitcoin?3. Bagaimana cara anda mensikapi kunci dompet untuk berjaga-jaga ketika kondisi tidak berpihak kepada kita (kematian tiba-tiba), apakah anda memberi tahu seseorang tentang kunci dompet anda?1. Sejauh ini saya tidak banyak bercerita kepada keluarga besar, karena lingkup keluarga disini tidak cukup terdeskripsikan dengan jelas. Istri saya yang pasti tahu bahwa saya memiliki bitcoin. Saya belum berani mengajarkan kepada ayah atau ibu, bahkan kakak dan ponakan saya tidak saya berikan detail. Tapi mereka tahu saya memegang Bitcoin. Sejauh ini keluarga saya masih merasa sulit jika ternyata uang bisa didapat melalui media online, terutama ayah dan ibu. Aset digital saja mungkin mereka hanya sebatas tahu Bitcoin yang saya punyai dan banyak yang lebih ke aset nyata seperti emas, tanah atau properti lain. 2. Sejauh ini saya belum terpikir saya masih ingin terus mencoba memperbanyak jumlah dan hidup sampai melihat anak saya dewasa dan mandiri (semoga diijinkan-Nya) , tapi saya sudah menyimpan PF key saya dan rencana saya akan segera meberitahu istri saya cepat atau lambat.3. Tentu, saya akan memberikan pada istri saya. Meskipun dia harus belajar untuk bisa membuka, karena saat ini dia tidak benar mendalami mengenai crypto.IMO",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mamesso",
      "created_time": "July 31, 2023, 02:33:09 PM",
      "body": "Quote from: komisariatku on July 31, 2023, 12:02:17 PMDiskusi ini di dedikasikan untuk fokus pada pembahasan:1. Bagaimana cara agar bitcoin bisa menjadi aset keluarga?2. Bagaimana cara mewariskan bitcoin?3. Bagaimana cara anda mensikapi kunci dompet untuk berjaga-jaga ketika kondisi tidak berpihak kepada kita (kematian tiba-tiba), apakah anda memberi tahu seseorang tentang kunci dompet anda?1. Perlu pengenalan lebih dekat pada anggota keluarga tentang aset yang anda pegang, saya selalu membuka Wallet Electrum di depan istri kemudian memperlihatkan padanya estimasi jumlah aset dalam bentuk IDR. Dia bertanya bagaimana cara menjadikan Bitcoin ke IDR, perlahan saya coba mengajarinya cara mengirim Bitcoin ke wallet Exchange kemudian menjualnya dan sampai pada tahap akhir cara melakukan penarikan. Pelan-pelan istri saya mulai mengerti cara mendapatkan Bitcoin hingga cara menjual, dia juga sering membaca artikel sejak mengerti cara melakukan transaksi Bitcoin. 2. Dalam mewariskan Bitcoin perlu ada pihak kedua yang mengerti cara melakukan transaksi Bitcoin sampai IDR landing di rekening bank, saya sudah melakukan antisipasi dini dengan mengajarkan istri cara mengakses Bitcoin dari wallet pribadi ke wallet Exchange. 3. Tentu saja perlu memberi tahu pihak kedua yang paling dipercaya untuk mengetahui kunci pribadi, dia akan menjadi pewaris tunggal aset yang tersimpan di Wallet. Ini saya anggap sangat penting, tidak boleh di tunda-tunda karena kita tidak pernah tahu apa yang terjadi besok.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "komisariatku",
      "created_time": "July 31, 2023, 04:20:28 PM",
      "body": "Quote from: Luzin on July 31, 2023, 12:34:36 PM2. Sejauh ini saya belum terpikir saya masih ingin terus mencoba memperbanyak jumlah dan hidup sampai melihat anak saya dewasa dan mandiri (semoga diijinkan-Nya) , tapi saya sudah menyimpan PF key saya dan rencana saya akan segera meberitahu istri saya cepat atau lambat.3. Tentu, saya akan memberikan pada istri saya. Meskipun dia harus belajar untuk bisa membuka, karena saat ini dia tidak benar mendalami mengenai crypto.Ya tentu gan, semoga kita bisa hidup lebih lama dan melihat anak-anak dewasa. Tetapi perlu plan cadangan untuk mengantisipasinya. Kalau saya sendiri sejak thread yg lalu, saya jadi memberikan kunci wallet ke istri tetapi saya tidak menjelaskan bagaimana menggunakannya, cuma memberi tahu kalo ini kunci wallet saya, mbok suatu saat masih ada isinya dan perlu untuk di buka. Saya kok berpikir lebih aman kalo istriku tidak tau cara gunainnya . Kalau misalkan perlu di buka suatu saat nanti saya yakin dia akan belajar sendiri cara mbukannya. Optimis aja si... Quote from: mamesso on July 31, 2023, 02:33:09 PMPelan-pelan istri saya mulai mengerti cara mendapatkan Bitcoin hingga cara menjual, dia juga sering membaca artikel sejak mengerti cara melakukan transaksi Bitcoin. Wah asyik dong bisa di ajak gabung sini dan ikutan mroyek signature.. mayan tuh. Quote from: mamesso on July 31, 2023, 02:33:09 PM3. Tentu saja perlu memberi tahu pihak kedua yang paling dipercaya untuk mengetahui kunci pribadi, dia akan menjadi pewaris tunggal aset yang tersimpan di Wallet. Ini saya anggap sangat penting, tidak boleh di tunda-tunda karena kita tidak pernah tahu apa yang terjadi besok. Iya betul gan, tapi kalo misalkan wallet isinya banyak gimana gan? kira-kira aman ga kalo dikasih tahu ke orang? ya meskipun itu istri kita sendiri tapi kan siapa tau aja diam-diam di ambil sedikit-sedikit. Kalau pakai multisign apakah lebih aman? dan istri dikasih salah satu kunci, anak kita kalo misal sudah dewasa juga dikasih kunci, jadi kalo buka harus bareng-bareng.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MAAManda",
      "created_time": "July 31, 2023, 05:11:47 PM",
      "body": "Pembahasan yang cukup berat untuk di diskusikan, tapi saya mau mengutarakan pendapat saya terkait pada poin-poin fokus bahasan yang sudah om @komisariatku berikan.Quote from: komisariatku on July 31, 2023, 12:02:17 PM1. Bagaimana cara agar bitcoin bisa menjadi aset keluarga?Ok, saya mulai dari aset, jadi pada dasarnya sifat aset itu terbagi menjadi 2, yakni aset fisik seperti surat berharga dan properti sementara yang satu lagi adalah aset non-fisik seperti merek dagang dan hak cipta (paten). Berbicara tentang Bitcoin yang berada di non-custodial wallet berarti kita berbicara tentang gabungan 2 sifat aset diatas.Turunan dari paragraf saya diatas adalah tentang edukasi, untuk membuat Bitcoin om itu menjadi aset keluarga, tentunya diperlukan edukasi terlebih dahulu kepada anggota-anggota keluarga om, setelah semuanya mengerti tentang mekanisme dasar dari cara terima, cara kirim dan cara membuka kunci non-custodial wallet, kita lanjut ke poin nomor 2 .Quote from: komisariatku on July 31, 2023, 12:02:17 PM2. Bagaimana cara mewariskan bitcoin?Saya tidak tahu pasti apakah sepucuk kertas yang kita isi dengan PK atau phrase di dalamnya bisa dikatakan sebagai surat berharga atau tidak, tapi jenis-jenis surat berharga itu bisa di notariskan om , that's it, udah dapat poinnya?Quote from: komisariatku on July 31, 2023, 12:02:17 PM3. Bagaimana cara anda mensikapi kunci dompet untuk berjaga-jaga ketika kondisi tidak berpihak kepada kita (kematian tiba-tiba), apakah anda memberi tahu seseorang tentang kunci dompet anda?Tentunya dong, saya sudah mempersiapkan sepucuk kertas yang berisi phrase wallet saya di TrustWallet dan memberitahu adik-adik saya tentang itu, so far mereka bahkan belum tahu cara menggunakannya, tapi saya memiliki kerabat dekat yang mengerti, dan saya sudah mengatakan kepada adik-adik saya untuk menjumpai beliau itu (kerabat dekat saya) kalau kematian tiba-tiba terjadi kepada saya.Haduhhh..., lama juga saya sudah tidak konsisten buat postingan di SFI ternyata",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BITCOIN4X",
      "created_time": "July 31, 2023, 06:16:09 PM",
      "body": "Quote from: mamesso on July 31, 2023, 02:33:09 PMQuote from: komisariatku on July 31, 2023, 12:02:17 PM~Snip1. Perlu pengenalan lebih dekat pada anggota keluarga tentang aset yang anda pegang, saya selalu membuka Wallet Electrum di depan istri kemudian memperlihatkan padanya estimasi jumlah aset dalam bentuk IDR. Dia bertanya bagaimana cara menjadikan Bitcoin ke IDR, perlahan saya coba mengajarinya cara mengirim Bitcoin ke wallet Exchange kemudian menjualnya dan sampai pada tahap akhir cara melakukan penarikan. Pelan-pelan istri saya mulai mengerti cara mendapatkan Bitcoin hingga cara menjual, dia juga sering membaca artikel sejak mengerti cara melakukan transaksi Bitcoin. 2. Dalam mewariskan Bitcoin perlu ada pihak kedua yang mengerti cara melakukan transaksi Bitcoin sampai IDR landing di rekening bank, saya sudah melakukan antisipasi dini dengan mengajarkan istri cara mengakses Bitcoin dari wallet pribadi ke wallet Exchange.Untuk poin satu dan dua ane pikir intinya adalah edukasi. Dalam hal ini ada beberapa pendekatan yang dapat dilakukan di waktu senggang dengan istri, anak atau mungkin orang lain yang dapat dipercaya. Caranya bisa berbeda antara anda dan yang lainnya, tapi pada intinya mereka harus tahu bagaimana cara mengakses wallet, mengirimkannya ke wallet lain (exchange/ lainnya), mengkonversinya ke IDR hingga melakukan penarikan. Jika semua itu sudah dikuasai, maka ane pikir mereka sudah siap untuk menerima warisan bitcoin anda.Quote from: mamesso on July 31, 2023, 02:33:09 PM3. Tentu saja perlu memberi tahu pihak kedua yang paling dipercaya untuk mengetahui kunci pribadi, dia akan menjadi pewaris tunggal aset yang tersimpan di Wallet. Ini saya anggap sangat penting, tidak boleh di tunda-tunda karena kita tidak pernah tahu apa yang terjadi besok.Tentu saja benar, itu alasannya mengapa seseorang yang memiliki bitcoin di walletnya perlu mempersiapkan warisan kepada mereka yang berhak menerimanya. Tapi jika poin satu dan dua diatas sudah dikuasai, maka ane kira mereka sudah siap untuk menerimanya. Tinggal saja kapan anda akan membagikan seed atau privatekey ke istri atau orang yang anda percayai itu.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Chikito",
      "created_time": "July 31, 2023, 10:25:31 PM",
      "body": "Quote from: komisariatku on July 31, 2023, 12:02:17 PMDiskusi ini di dedikasikan untuk fokus pada pembahasan:1. Bagaimana cara agar bitcoin bisa menjadi aset keluarga?2. Bagaimana cara mewariskan bitcoin?3. Bagaimana cara anda mensikapi kunci dompet untuk berjaga-jaga ketika kondisi tidak berpihak kepada kita (kematian tiba-tiba), apakah anda memberi tahu seseorang tentang kunci dompet anda?Semua jawaban di atas bisa kamu temukan di thread lama pandukelana2712 ini: [DISKUSI]Pengurusan aset kripto jika terjadi musibahBagaimana pun juga, bitcoin itu dibuat untuk lebih personal, tapi bisa juga untuk berkelompok dan keluarga dengan menggunakan multi signature dan split seed yang bisa dibagi-bagi kepada orang kepercayaan sampeyan.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "armanda90",
      "created_time": "August 01, 2023, 01:58:47 AM",
      "body": "Quote from: BITCOIN4X on July 31, 2023, 06:16:09 PMUntuk poin satu dan dua ane pikir intinya adalah edukasi. Dalam hal ini ada beberapa pendekatan yang dapat dilakukan di waktu senggang dengan istri, anak atau mungkin orang lain yang dapat dipercaya. Caranya bisa berbeda antara anda dan yang lainnya, tapi pada intinya mereka harus tahu bagaimana cara mengakses wallet, mengirimkannya ke wallet lain (exchange/ lainnya), mengkonversinya ke IDR hingga melakukan penarikan. Jika semua itu sudah dikuasai, maka ane pikir mereka sudah siap untuk menerima warisan bitcoin anda.Mungkin lebih bagus jika assets baik bitcoin atau altcoin disimpan di akun exchange market langsung terutama akun exchange lokal untuk memudahkan keluarga yang kita warisi mengkoversikan ke IDR. Sedikit sulit jika saldo masih waalet electrum dan kita harus mengedukasikan secara detail mulai dari cara mengakses ke wallet dan mengirim ke exchange yang bisa diwthdraw ke IDR langsung. Sebenarnya jika diberikan pemahaman secara detail, untuk penarikan saldo Bitcoin atau aset altcoin lainnya lebih mudah dipahami jika saldo langsung di wallet exchange market dan kita cukup memberikan detail akun email, password dan juga akun 2FA. Selain harus mengedukasi keluarga kita, tidak salahnya juga mengenalkan mereka ke teman kita yang mengerti tentang krypto, suatu saat nanti keluarga kita bisa menanyakan perihal cara melakukan penarikan asset bitcoin jika mengalami kesulitan untuk melakukan proses penarikan saldo BTC.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joniboini",
      "created_time": "August 01, 2023, 06:00:19 AM",
      "body": "Quote from: armanda90 on August 01, 2023, 01:58:47 AMMungkin lebih bagus jika assets baik bitcoin atau altcoin disimpan di akun exchange market langsung terutama akun exchange lokal untuk memudahkan keluarga yang kita warisi mengkoversikan ke IDR. Ane tidak menyarankan menggantungkan diri agan ke jasa pihak ketiga seperti exchange atau sejenisnya kalau mewariskan kripto adalah tujuan agan. Selain udah banyak bukti yang menunjukkan exchange bisa punah kapan aja (siapa tahu tahun depan exchange itu udah raib, dan agan malah ribet ngurus pemindahan dana), risiko dana agan dipake dibalik layar tanpa sepengetahuan agan juga besar. Beberapa exchange juga menawarkan produk tabungan berbunga yang sangat berisiko, dan bukan tidak mungkin dana agan dipake meski agan tidak daftar ke program tersebut. \"Ribet\"nya melakukan edukasi menurut ane harga yang pantas dibayar kalau agan ingin mewariskan dana dengan aman.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Luzin",
      "created_time": "August 01, 2023, 07:25:38 AM",
      "body": "Quote from: joniboini on August 01, 2023, 06:00:19 AMAne tidak menyarankan menggantungkan diri agan ke jasa pihak ketiga seperti exchange atau sejenisnya kalau mewariskan kripto adalah tujuan agan. Beberapa exchange yang beberapa pernah saya gunakan dan belum yang saat ini sudah tutup.1. Hotbit (pernah)2. Coinexchange (kalau saya tidak salah nama exchange siluman sering pom-pom(pernah))3. MT GOX4. Koinex5. Zebay6. Quadrigacx7. Bitmarket8. Cryptokart9. Coinome10. Coindelta11. Coinnest12. Vebbitcoin13. ThodexSepertinya masih ada banyak yang lain. Seharusnya ini bisa memperkuat untuk tidak banyak banyak menyimpan Asset untuk diwariskan dalamtu pertukaran. Meski sebelum tutup mereka memang biasa melakukan pengumuman dan jangka waktu untuk penarikan Asset.  Mungkin lebih baik pakai Hard Wallet atau mungkin wallet sejenis Electrum.  Dengan catatan tetap berhati hati dari phising. Sumber: https://voi.id/teknologi/235469/daftar-bursa-kripto-yang-tutup-dalam-sejarah-cryptocurrency-ada-yang-bawa-kabur-dana-investor",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yudi09",
      "created_time": "August 01, 2023, 10:45:29 AM",
      "body": "Quote from: komisariatku on July 31, 2023, 12:02:17 PM1. Bagaimana cara agar bitcoin bisa menjadi aset keluarga?Menyimpan atau menahannya dalam dompet hingga waktu tertentu jika tidak ada niat untuk menjual dan memberitahukan kepada istri tentang wallet yang berisi aset Bitcoin bagi yang sudah berkeluarga.Quote from: komisariatku on July 31, 2023, 12:02:17 PM2. Bagaimana cara mewariskan bitcoin?Menyerahkan cadangan seed phrase, private key serta passcode atau kata sandi wallet. Sekaligus menyerahkan email dan sandi exchange yang selama ini kita gunakan sebagai tempat untuk bertransaksi perdagangan.Quote from: komisariatku on July 31, 2023, 12:02:17 PM3. Bagaimana cara anda mensikapi kunci dompet untuk berjaga-jaga ketika kondisi tidak berpihak kepada kita (kematian tiba-tiba), apakah anda memberi tahu seseorang tentang kunci dompet anda?Jawabannya sama seperti pada poin kedua. Menyerahkan semua itu karena kita sudah tahu bahwa kematian tidak pernah kita tahu kapan akan tiba.Menyampaikan kepada istri atau orang yang dipercaya untuk mengakses aset yang ada didalam dompet bagaimana mengamankan cadangan seed phrase dengan baik tanpa terkoneksi dengan internet dan jauh dari jangkauan orang lain.Itu saja jawaban singkat.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MAAManda",
      "created_time": "August 01, 2023, 01:16:15 PM",
      "body": "Quote from: Luzin on August 01, 2023, 07:25:38 AMSepertinya masih ada banyak yang lain. Seharusnya ini bisa memperkuat untuk tidak banyak banyak menyimpan Asset untuk diwariskan dalamtu pertukaran. Meski sebelum tutup mereka memang biasa melakukan pengumuman dan jangka waktu untuk penarikan Asset.  Mungkin lebih baik pakai Hard Wallet atau mungkin wallet sejenis Electrum.  Dengan catatan tetap berhati hati dari phising.Benar, tidak baik memang menyimpan aset kripto di CEX, tapi jika memang itu diperlukan maka tidak ada salahnya om, tidak semua orang akan mudah memahami bagaimana cara kerja dari non-custodial wallet baik di hardware wallet, aplikasi mobile seperti TrustWallet atapun aplikasi PC seperti yang ada pada electrum. Intinya untuk melakukan backup aset itu kondisional, jika memang ada anggota keluarga yang cukup capable di dunia Internet, maka akan lebih baik mengedukasi mereka lewat jalan non-custodial wallet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "komisariatku",
      "created_time": "August 01, 2023, 03:56:20 PM",
      "body": "Quote from: Luzin on August 01, 2023, 07:25:38 AMBeberapa exchange yang beberapa pernah saya gunakan dan belum yang saat ini sudah tutup.Ya, itulah bahayanya kalo menyimpan di pertukaran. Untuk jangka pendek mungkin tidak menjadi masalah, apalagi untuk aktifitas trading. Tetapi untuk jangka panjang, apalagi yang memang berencana hold jangka panjang baik yang membeli banyak secara langsung atau mencicil tiap bulan dan sengaja akan di simpan hingga puluhan tahun maka akan sangat berbahaya. Minimal ya simpan di electrum lah, atau lebih baik hardware wallet.Jujur saya lebih percaya kepada multi sign, mungkin akan lebih aman apalagi jika sudah disiapkan untuk menjadi aset keluarga dan untuk jangka panjang. Jujur kesadaran untuk memberi tahu orang lain baru terfikirkan beberapa bulan yang lalu, dari dulu saya mikirnya bahaya kalo sampe ada yang tahu kunci kita. Tetapi ternyata lebih berbahaya jika memiliki aset tetapi tidak bisa di akses lagi karena yang empunya aset sudah meninggal.Mungkin trik-trik sudah pada punya, tetapi membangun kesadaran untuk memberi tahu orang lain saya pikir penting, terutama yang berada di forum ini. Atau jangan-jangan cuma saya yang baru sadar tentang hal ini?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Godday",
      "created_time": "August 05, 2023, 03:13:58 AM",
      "body": "Quote from: komisariatku on August 01, 2023, 03:56:20 PMMungkin trik-trik sudah pada punya, tetapi membangun kesadaran untuk memberi tahu orang lain saya pikir penting, terutama yang berada di forum ini. Atau jangan-jangan cuma saya yang baru sadar tentang hal ini?  (Alm) Mas Pandu Kelana sudah sadar duluan gan  . Dan ada beberapa member yang sekarang sudah menjadi sepuh di SFI yang berdiskusi di sana. Silahkan agan berkunjung kalau tertarik. Link : https://bitcointalk.org/index.php?topic=5195393.msg52855259#msg52855259But anyway, ana sangat setuju sekali dengan anda tentang membangun kesadaran untuk memberi tahu orang lain terutama ahli waris atau orang terdekat kita. Saran saya, kalau asetnya dirasa banyak, lebih baik konversikan sebagiannya ke rupiah atau bentuk investasi lain yang lebih mudah di akses. Dengan catatan tetap memberitahu kepada keluarga tersayang kita tentang bagaimana cara mengakses wallet kita kalau terjadi kenapa-kenapa.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mamesso",
      "created_time": "August 05, 2023, 04:30:47 AM",
      "body": "Quote from: komisariatku on July 31, 2023, 04:20:28 PMQuote from: mamesso on July 31, 2023, 02:33:09 PMPelan-pelan istri saya mulai mengerti cara mendapatkan Bitcoin hingga cara menjual, dia juga sering membaca artikel sejak mengerti cara melakukan transaksi Bitcoin. Wah asyik dong bisa di ajak gabung sini dan ikutan mroyek signature.. mayan tuh. Rencananya sih gitu, saat ini masih belum tepat diajak bergabung di forum karena dia masih disibukkan mengurus bayi kami meski dia sering bertanya bagaimana bisa saya mendapatkan penghasilan di forum tanpa mengeluarkan modal sedikitpun.Quote from: komisariatku on July 31, 2023, 04:20:28 PMQuote from: mamesso on July 31, 2023, 02:33:09 PM3. Tentu saja perlu memberi tahu pihak kedua yang paling dipercaya untuk mengetahui kunci pribadi, dia akan menjadi pewaris tunggal aset yang tersimpan di Wallet. Ini saya anggap sangat penting, tidak boleh di tunda-tunda karena kita tidak pernah tahu apa yang terjadi besok. Iya betul gan, tapi kalo misalkan wallet isinya banyak gimana gan? kira-kira aman ga kalo dikasih tahu ke orang? ya meskipun itu istri kita sendiri tapi kan siapa tau aja diam-diam di ambil sedikit-sedikit. Kalau pakai multisign apakah lebih aman? dan istri dikasih salah satu kunci, anak kita kalo misal sudah dewasa juga dikasih kunci, jadi kalo buka harus bareng-bareng. Bagi saya pribadi sangat aman gan dan tidak perlu memakai multisign karena saya sangat tahu betul karakter istri saya. Alhamdulillah istri saya lulusan pondok pesantren yang paham betul cara khodam suami, dia selalu meminta persetujuan saya saat ingin membeli sesuatu yang menyangkut dengan kebutuhannya meskipun dia membeli barang tersebut memakai uang jajan bulanan yang saya kasih padanya.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "aylabadia05",
      "created_time": "August 05, 2023, 09:59:33 AM",
      "body": "Quote from: armanda90 on August 01, 2023, 01:58:47 AMMungkin lebih bagus jika assets baik bitcoin atau altcoin disimpan di akun exchange market langsung terutama akun exchange lokal untuk memudahkan keluarga yang kita warisi mengkoversikan ke IDR.Jangan gan. Ini sangat berbahaya jika dilakukan karena tidak ada jaminan aset baik itu Bitcoin dan Altcoin potensial bisa aman didalam akun exchange.Meskipun ribet untuk menjelaskan secara detail kepada keluarga yang terpercaya sebagai ahli waris, yakinlah keluarga yang akan kita jelaskan kelak akan paham. Sama dengan mengajarkan teman cara berforum, meski sulit akhirnya mereka bisa juga.Banyak cara untuk mengamankan aset Bitcoin seperti yang telah disarankan oleh banyak orang disini.Yang mudah memang selalu menarik, tetapi hal yang sulit outputnya akan lebih kuat.Jangan anggap sepele, maksudnya exchange sudah jelas terbukti bukan tempat teraman untuk menyimpan aset.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "topbitcoin",
      "created_time": "August 05, 2023, 12:26:42 PM",
      "body": "Quote from: komisariatku on July 31, 2023, 12:02:17 PMSalam, Sebelumnya mohon maaf saya buat utas lagi untuk meneruskan diskusi Resiko Kehilangan Key Wallet Bitcoin, Apa solusinya? untuk Refokusing topikDiskusi ini di dedikasikan untuk fokus pada pembahasan:1. Bagaimana cara agar bitcoin bisa menjadi aset keluarga?2. Bagaimana cara mewariskan bitcoin?3. Bagaimana cara anda mensikapi kunci dompet untuk berjaga-jaga ketika kondisi tidak berpihak kepada kita (kematian tiba-tiba), apakah anda memberi tahu seseorang tentang kunci dompet anda?Di utas sebelumnya saya telah menyampaikan sedikit gambaran tentang resiko kehilangan kunci, dan atau karena sebab meninggal dunia. Mungkin saat ini belum menjadi masalah yang serius karena kebanyakan dari kita masih cukup muda untuk berbicara tentang kematian, akan tetapi kematian tidak ada yang tahu kapan hal itu akan terjadi. Sementara jika kunci dompet hanya di miliki oleh kita (pemilik wallet) mungkin itu akan menjadi masalah serius jika tidak ada yang tau salinan kunci dompet dan semua aset akan membeku tanpa bisa di buka kembaliDiskusi ini tidak termasuk dalam asset yang berada di pertukarang (exchange) karena kalau di pertukaran kemungkinan bisa tetap di akses karena mereka terpusat seperti bank konvensional meskipun mungkin prosedurnya cukup rumit.Saya menemukan beberapa artikel yang mengulas masalah warisan bitcoin, seperti:https://www.kompas.id/baca/opini/2021/07/01/cara-mewariskan-aset-kripto-ketika-pemiliknya-meninggal/https://qwords.com/blog/cara-mewariskan-bitcoin/https://pluang.com/id/blog/resource/investasi-bitcoin-wafatTapi rasanya kurang \"greget\" kalau cuma membaca di artikel website, jadi mungkin kita berdiskusi disiniTidak ada salahnya jika kita mewariskan kekayaan yang kita miliki dalam bentuk wallet/bitcoin tetapi harus dengan ilmunya.Namun setidaknya kita harus memberikan pemahaman terlebih dahulu kepada keluarga tentang cara wallet /bitcoin bekerja,dan anda juga harus memberikan pendidikan khusus minimal pada salah satu anggota keluarga anda dan saya menganjurkannya kepada anak laki-laki yang anda percaya untuk menguasai tentang wallet/bitcoin, mengapa demikian karena seorang laki-laki mempunyai jiwa kepemimpinan yang baik sehingga mampu membagi warisan yang anda berikan secara adil dan merata.Untuk akun anda sendiri, saya rasa anda harus tetap menjaga kerahasiannya jangan pernah memberitahukannya kepada orang lain untuk menjaga keamanan akun/dompet digital anda. Dan untuk berjaga-jaga dari kematian, anda bisa menuliskan Id dan kunci dompet anda dalam bentuk surat wasiat yang bisa anda buat mulai dari detik ini karena kita tidak pernah tau kapan ajal menjemput. dengan adanya surat wasiat tersebut nantinya dompet anda bisa diakses oleh anggota keluarga yang anda percaya dan yang telah anda berikan pendidikan tentang wallet/bitcoin sebelumnya setelah kematian anda.tetapi saya belum menemukan cara tentang dompet digital yang ketika masuknya harus menggunakan verifikasi wajah, apakah kita harus memindahkan uang didalamnya terlebih dahulu atau menghindari dompet digital tersebut..?karena ditakutkan setelah kematian kita, dompet tersebut tidak dapat diakses.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Juse14",
      "created_time": "August 05, 2023, 02:09:18 PM",
      "body": "Bagi sebagian orang mungkin tidak pernah terpikirkan untuk mewariskan hartanya dalam bentuk wallet/bitcoin. Kebanyakan mereka ketika ingin mewariskan hartanya yaitu dalam bentuk asset property seperti; rumah, perusahaan ataupun segudang tanah yang dalam pembagiannya cukup rumit menurut sayaQuote from: aylabadia05 on August 05, 2023, 09:59:33 AM.Meskipun ribet untuk menjelaskan secara detail kepada keluarga yang terpercaya sebagai ahli waris, yakinlah keluarga yang akan kita jelaskan kelak akan paham. Sama dengan mengajarkan teman cara berforum, meski sulit akhirnya mereka bisa juga.Banyak cara untuk mengamankan aset Bitcoin seperti yang telah disarankan oleh banyak orang disini.Hal ini menjadi PR tersendiri ketika kita ingin mewariskan wallet/bitcoin kepada keluarga kita kelak nanti. Yang dimana kita harus memberikan pemahaman tentang bagaimana bitcoin bekerja dan juga kita harus menurunkan ilmu yang kita punya tentang bitcoin kepada ahli waris minimal kepada salah satu anggota keluarga karena kalau semua anggota akan sulit juga dan membutuhkan waktu yang lama.Jadi panda-pandailah memanfaatkan waktu yang tersisa untuk memulai mengjari mereka tentang bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bangjoe",
      "created_time": "August 05, 2023, 03:05:04 PM",
      "body": "Quote from: Juse14 on August 05, 2023, 02:09:18 PMBagi sebagian orang mungkin tidak pernah terpikirkan untuk mewariskan hartanya dalam bentuk wallet/bitcoin. Kebanyakan mereka ketika ingin mewariskan hartanya yaitu dalam bentuk asset property seperti; rumah, perusahaan ataupun segudang tanah yang dalam pembagiannya cukup rumit menurut sayaItu bagi mereka yang tidak mengenal bitcoin, tetapi orang yang mengenal bitcoin pastinya sedikit banyaknya pastinya terlintas dalam pikiran mereka bahwa mereka ingin mewariskan kekayaan atau aset berbentuk di bitcoin kepada keturunannya, termasuk saya, saya juga memiliki cita-cita itu, walaupun saat ini saya tidak memiliki jumlah yang layak untuk di wariskan.Quote from: Juse14 on August 05, 2023, 02:09:18 PMQuote from: aylabadia05 on August 05, 2023, 09:59:33 AM.Meskipun ribet untuk menjelaskan secara detail kepada keluarga yang terpercaya sebagai ahli waris, yakinlah keluarga yang akan kita jelaskan kelak akan paham. Sama dengan mengajarkan teman cara berforum, meski sulit akhirnya mereka bisa juga.Banyak cara untuk mengamankan aset Bitcoin seperti yang telah disarankan oleh banyak orang disini.Hal ini menjadi PR tersendiri ketika kita ingin mewariskan wallet/bitcoin kepada keluarga kita kelak nanti. Yang dimana kita harus memberikan pemahaman tentang bagaimana bitcoin bekerja dan juga kita harus menurunkan ilmu yang kita punya tentang bitcoin kepada ahli waris minimal kepada salah satu anggota keluarga karena kalau semua anggota akan sulit juga dan membutuhkan waktu yang lama.Jadi panda-pandailah memanfaatkan waktu yang tersisa untuk memulai mengjari mereka tentang bitcoin.Saya pikir jika kita menjelaskan tentang apa itu bitcoin dan bagaimana mekanisme teknologinya pasti akan membutuhkan  banyak waktu, dalam kasus ini hanya perlu menjelaskan hal-hal basic bagaimana caranya mentransfer bitcoin dari wallet ke pertukaran kemudian bisa di rupiahkan dengan tidak melakukan kesalahan, jadi yang perlu anda lakukan hanya menjelaskan caranya melakukan transaksinya, karena bagian ini lah yang lumayan sensitif menurut saya.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "komisariatku",
      "created_time": "August 05, 2023, 04:04:16 PM",
      "body": "Quote from: aylabadia05 on August 05, 2023, 09:59:33 AMJangan gan. Ini sangat berbahaya jika dilakukan karena tidak ada jaminan aset baik itu Bitcoin dan Altcoin potensial bisa aman didalam akun exchange.Meskipun ribet untuk menjelaskan secara detail kepada keluarga yang terpercaya sebagai ahli waris, yakinlah keluarga yang akan kita jelaskan kelak akan paham. Sama dengan mengajarkan teman cara berforum, meski sulit akhirnya mereka bisa juga.Ya betul, menyimpan di exchange sangat berbahaya. Kasus exchange tutup itu bukan hal yang baru dan jika menyimpan aset untuk jangka panjang tentu akan sangat berbahaya, saya punya akun di Idex juga ternyata lama tidak dibuka pas di buka lagi udah ga ada isinya, memang si isinya sisa-sisa trade tapi ternyata hilang. Forkdelta dan etherdelta juga tutup. Jadi sangat berbahya untuk menyimpan aset di exchange, mungkin karena indodax cukup bagus dan tidak pernah ada masalah jadi masih banyak pegiat crypto yang suka menyimpan aset di indodaxQuote from: Juse14 on August 05, 2023, 02:09:18 PMHal ini menjadi PR tersendiri ketika kita ingin mewariskan wallet/bitcoin kepada keluarga kita kelak nanti. Yang dimana kita harus memberikan pemahaman tentang bagaimana bitcoin bekerja dan juga kita harus menurunkan ilmu yang kita punya tentang bitcoin kepada ahli waris minimal kepada salah satu anggota keluarga karena kalau semua anggota akan sulit juga dan membutuhkan waktu yang lama.Jadi panda-pandailah memanfaatkan waktu yang tersisa untuk memulai mengjari mereka tentang bitcoin.Kalau menurut saya si tidak mengajari juga tidak masalah gan, yang penting orang yang kita kasih itu ngerti kalau yang di titipkan adalah kuci bitcoin yang memiliki isi. Saya yakin kalau mereka tau ada isinya pasti akan belajar sendiri untuk bisa mengambilnya, selain itu juga perkembangan teknologi makin masif jadi dimasa depan sepertinya makin banyak orang yang mengenal crypto terutama bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}