{
  "id": "topic_5402377",
  "title": "jtg4521455",
  "author": "jtg4521455",
  "created_time": "June 13, 2022, 08:46:23 AM",
  "content": "what is the reason to btc down more",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5402377",
  "comments": [
    {
      "author": "lobo13hf",
      "created_time": "June 13, 2022, 10:18:11 AM",
      "body": "Quote from: jtg4521455 on June 13, 2022, 08:46:23 AMwhat is the reason to btc down moreGlobal recession, crypto is already on time to be dumped after huge pump that happened since a few years ago. This proves that if the 4 year cycle was real. I know that if you are feeling bad with it and so many newbies may feel so frustate with the market but this is crypto when the market is full with uncertainty. There's no guarantee when the market will be going up again and it seems like all of institutions that already invest in the crypto have been loosing a lot. I do believe this will happening until the end of this year.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tsaroz",
      "created_time": "June 13, 2022, 10:27:56 AM",
      "body": "Quote from: jtg4521455 on June 13, 2022, 08:46:23 AMwhat is the reason to btc down moreIt fell from 19 to 3K during last pump and with the similar estimate, it could fall to as low as 10K from all time high of 64K. With a lot of it being stuck on frozen account, we could expect it to stabilize a bit higher but no one is sure at what level. It was testing 30K resistance for quite a bit and current economical situation has bought it down. There ought to be another psychological barrier at 20K.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Balmain",
      "created_time": "June 13, 2022, 10:33:35 AM",
      "body": "Fed rate policies and thoughts of buying and burning dollars from the market. The great recession in the world and bitcoin's uptrend ended, in fact, we were in a downtrend for a while. I think there may be more declines, this is the natural cycle of bitcoin and altcoin in such situations. The new ones should not panic and forget about their asset",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Endel10",
      "created_time": "June 13, 2022, 10:43:32 AM",
      "body": "Quote from: jtg4521455 on June 13, 2022, 08:46:23 AMwhat is the reason to btc down moreThere may be many reasons for BTC to go down, but what I know is that many people are starting to dive into the crypto world.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Baofeng",
      "created_time": "June 13, 2022, 11:47:04 AM",
      "body": "Its due to this reason,  The Fed will raise rates in the week ahead, but what Chair Powell says may matter most.QuoteThe Federal Reserve’s two-day meeting is the highlight of the week ahead, and the next catalyst for markets will be what clues it gives about future rate hikes.The Fed is widely expected to raise the fed funds rate by a half point Wednesday and again next month, but Friday’s very hot consumer inflation report sparked expectations policymakers could hike faster and higher.Markets are fearful of a recession, so stock investors are watching the bond market, which is sending fresh signals that the economy could be weakening.So there's a lot of uncertainty right now, recession the war in EU, and then the Feds raising the rate. So this is bad news for every financial market not just bitcoin. Although it just magnify today with a huge 13% decreased already. And it's seems scary, but as I have said, we can't do anything to stop at it is inevitable. So just remain calm, we're all in it, and don't sell your cheap bitcoins to the whales.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wilhelm",
      "created_time": "June 13, 2022, 12:18:16 PM",
      "body": "Quote from: jtg4521455 on June 13, 2022, 08:46:23 AMwhat is the reason to btc down moreU NO BUY",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "WalkerIVIV",
      "created_time": "June 13, 2022, 12:48:18 PM",
      "body": "Nothing new if bitcoin was going down so hard. The world was facing huge problem and you can see that how US was facing very huge inflation and this is giving a very big impact to the price of goods and various commodities int he US. This is also affecting another countries as well. people are feeling scared with it and it seems like there will be also another disaster that will come soon and i hope that this hurricane will be gone as soon as possible. This is hurting so many people right now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Tony116",
      "created_time": "June 13, 2022, 02:21:50 PM",
      "body": "Quote from: Baofeng on June 13, 2022, 11:47:04 AM So just remain calm, we're all in it, and don't sell your cheap bitcoins to the whales.As long as we don't sell our bitcoins now, we won't lose anything. Today may seem like a surprise, but bear markets are an integral part of the crypto market. Everyone is inside, you are not alone so don't panic and sell cheap during this period. Bitcoin is a long-term investment and this is only a short-term drop, bitcoin will rise again when the bear cycle is over.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lornadane",
      "created_time": "June 13, 2022, 03:12:35 PM",
      "body": "Quote from: Tony116 on June 13, 2022, 02:21:50 PMQuote from: Baofeng on June 13, 2022, 11:47:04 AM So just remain calm, we're all in it, and don't sell your cheap bitcoins to the whales.As long as we don't sell our bitcoins now, we won't lose anything. Today may seem like a surprise, but bear markets are an integral part of the crypto market. Everyone is inside, you are not alone so don't panic and sell cheap during this period. Bitcoin is a long-term investment and this is only a short-term drop, bitcoin will rise again when the bear cycle is over.Those who panic are only new beginners or new investors who are present in the crypto market so that when the bitcoin price drops drastically like it is now they panic and hesitate.  However it is different for old investors who think that the current price decline is indeed a bear market cycle which sometimes ends quickly or sometimes takes a long time and makes them more patient.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "virasog",
      "created_time": "June 13, 2022, 04:38:03 PM",
      "body": "Quote from: jtg4521455 on June 13, 2022, 08:46:23 AMwhat is the reason to btc down moreEveryone is asking for the reasons as why the bitcoin is down today but no one knows exactly. Also, there is no one bad news that you can say is the major cause of the bitcoin downfall. Bitcoin was not looking good for many weeks and it was supposed to dump sooner or later. I hope, we get to the bottom today and can see an upward momentum from here onwards. I think bitcoin will remain in the accumulation phase for the next few months.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "adaseb",
      "created_time": "June 14, 2022, 04:07:02 AM",
      "body": "The reason why Bitcoin had a horrible week is mostly due to 2 reasons.First one was the horrible CPI numbers. Means there is going to be more aggressive fed rate hikes and it’s bad for stocks and bad for crypto.Second is the insolvency of Celcius. They paused  withdraws and keep adding collateral to prevent them from being liquidated. Right now they liquidation price is like $17K. Most likely the market will try and run those numbers and get a better entry.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BobK71",
      "created_time": "June 14, 2022, 04:40:29 AM",
      "body": "Crypto is a market of uncertainty. When btc went from 64K to 38K, many people thought that it might be the end of the bear market. But when the market goes down further, it is thought that 30K will probably be the lowest price btc. But yesterday we saw 15% dumping, no prediction were correct. Now investors are worried and waiting to see when the market will return to its normal behavior.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "onecall123",
      "created_time": "June 14, 2022, 05:09:04 AM",
      "body": "Why wouldn't it be $22k if everyone wanted it at $70k? Funny how things work out. Keep that in mind. You don't make wealth in bull markets. Wealth is made in bear markets. A buy always follows a sell. Inflation at record levels suggests otherwise. The millennial generation has never experienced high inflation and what happens with assets. The price of cryptocurrency should not fluctuate due to inflation. This is the concept behind it.Inflation has nothing to do with it. As they tighten monetary policy and increase interest rates, the markets become less liquid.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wexnident",
      "created_time": "June 14, 2022, 05:34:40 AM",
      "body": "Cause, well, it went down? If you're asking for specifics well all we can give you would really be nothing specific since there are too many players that influence the market right now. The general trend is simply a bear market if you want a really simple answer, it doesn't matter if your group of friends doesn't want it to be, you're like a drop in a big ocean that affects the market. I guess it went really deep down since after it went past a certain point, people panicked and sold their coins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Don Pedro Dinero",
      "created_time": "June 14, 2022, 05:44:41 AMLast edit: June 14, 2022, 06:02:00 AM by Don Pedro Dinero",
      "body": "Quote from: lobo13hf on June 13, 2022, 10:18:11 AMGlobal recession, crypto is already on time to be dumped after huge pump that happened since a few years ago. This proves that if the 4 year cycle was real. I know that if you are feeling bad with it and so many newbies may feel so frustate with the market but this is crypto when the market is full with uncertainty. There's no guarantee when the market will be going up again and it seems like all of institutions that already invest in the crypto have been loosing a lot. I do believe this will happening until the end of this year. Apart from that, the specific reason yesterday has to do with what in Spanish is called corralito:'Corralito (Spanish pronunciation: [koraˈlito]) was the informal name for the economic measures taken in Argentina at the end of 2001 by Minister of Economy Domingo Cavallo in order to stop a bank run which implicated a limit of cash withdrawals of 250 ARS per week (at that time 1 USD = 1 ARS). Electronic transfers and credit and debit card payments were not disrupted.'https://en.wikipedia.org/wiki/CorralitoCelsius, Binance and Bitfinex paused or suspended withdrawals which triggered panic and led to the thought of a terra luna-like event. When these things happen, short positions get liquidated, and also people get scared and sell out.Now it seems to have stopped a bit as there is a strong resistance around 20,000 USD.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "traderethereum",
      "created_time": "June 14, 2022, 07:25:40 AM",
      "body": "Quote from: jtg4521455 on June 13, 2022, 08:46:23 AMwhat is the reason to btc down moreThere doesn't need to be a reason for bitcoin to crash or freefall as it is today.The question that needs to be asked is, are you ready for what is happening right now and can you overcome the panic you may experience?If yes, you can use it by buying more bitcoins right now and no need to feel anxious, panicked or sad because, after this moment, the bitcoin price will surely get a rally to lift the price again.There may be many reasons that caused the bitcoin price to drop but we don't know what's really going on with the crypto market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nrcewker",
      "created_time": "June 14, 2022, 08:05:51 AM",
      "body": "Quote from: jtg4521455 on June 13, 2022, 08:46:23 AMwhat is the reason to btc down moreThe post’s title is showing your attitude towards the coin.It feels like you don’t have any trust or hope in the coin.I mean cmon it’s just a bearish market.Give some time to the market it will recover soon.But right now if you lose hope and start selling your Bitcoins, then no one can save you from losses.The main reason for the coin’s price is falling is due to people selling their coins in a low price.Just hodl and see profit.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LogitechMouse",
      "created_time": "June 14, 2022, 08:10:24 AM",
      "body": "RecessionInterest rates by Papa Powell Tech Stocks fallingUS Stock market going into a bear market and we know that US Stock market and crypto are somewhat correlatedGlobal InflationRussia-Ukraine WarGive some if there is some events that I missed out aside from those I said above. I think these are the reasons why Bitcoin is going down. Well, let's just don't focus on the reasons but let's focus on the things that we should do in order for us to not panic or not have any losses. Don't panic, be patient and accumulate. These three things will help you survive whatever is happening right now. It is easy to say but TBH, newbie investors are having a hard time doing this for some reasons. Don't worry because overtime, you will learn from experience and you will know what to do if this will happen again in the future (which it will).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}