{
  "id": "topic_5464631",
  "title": "apilpirman17",
  "author": "apilpirman17",
  "created_time": "August 26, 2023, 08:59:11 AM",
  "content": "Jasa pembuatan akun newbrand fresh, bisa custom username. Jika username tak tersedia saya akan memberitahu lagi.Akun dijamin kuat anti banned karena dibuat via RDP, proxy atau VPN premium yang intinya selayaknya akun yang dibuat di eropa langsung. Banned langsung gantiSilahkan jika minat hubungi 085215980157 (WA)*Takut ditipu? Saya ada KTP, dan identitas lainnya kalo perlu.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5464631",
  "comments": [
    {
      "author": "blue Snow",
      "created_time": "August 27, 2023, 02:21:59 AM",
      "body": "Quote from: apilpirman17 on August 26, 2023, 08:59:11 AMAkun dijamin kuat anti banned karena dibuat via RDP, proxy atau VPN premium yang intinya selayaknya akun yang dibuat di eropa langsung. Banned langsung gantiKalau setahu ane jika akun bitcointalkmu di banned, maka jaminan untuk jadi anggota forum ini tidak bisa lagi gan. Itu namanya Ban evasion (baca aturan forum no.25). Jadi ya jangan nekat, ntar percuma sudah ranknya tinggi, eh ketahuan kalau dulunya sudah pernah dibanned karena sapam atau plagiarisme. cmiw.Mending, buat pendatang baru bikin akun sendiri, lebih terjamin, jika kena evil fee, minta beresin ama loyce",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joniboini",
      "created_time": "August 28, 2023, 08:10:44 AM",
      "body": "Quote from: apilpirman17 on August 26, 2023, 08:59:11 AMdibuat via RDP, proxy atau VPN premium yang intinya selayaknya akun yang dibuat di eropa langsung. Banned langsung gantiEvil IP setahu ane ga ada hubungannya dengan lokasi. Kalau agan pake IP Eropa atau VPN yang sebelumnya belum melakukan abuse tapi kemudian banyak abuse, juga bakal kena evil IP. Seperti yang dibilang di atas, jasa seperti ini terlalu berisiko buat newbie ataupun agan sendiri karena rawan kena ban. Mending agan cari jasa lain seperti bikin signature banner kalau ingin lebih banyak order.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}