{
  "id": "topic_5469160",
  "title": "Hatchy",
  "author": "Hatchy",
  "created_time": "October 04, 2023, 10:17:20 AM",
  "content": "(I don't know if meta would be appropriate for this thread any suggestions would be appreciated)I've been pondering an important topic that I believe deserves our thoughtful consideration. ''plagiarism within our community\". it might not be a good one, it's certainly worth discussing.Each day, as we observe the Report plagiarism (copy/paste) here. Mods: please give temp or permban as needed thread by LoyceV, it becomes apparent that many of these plagiarizers often fall into the category of newbies and low-ranked members. These actions, whether intentional or not, seem to be on the rise but thanks to some of our diligent plagiarism busters here on the forum, a lot of them are caught on spot.We know that many of us avidly and constantly read various articles from different sources, accumulating knowledge along the way. When questions arise on the forum related to the information we've gathered, we naturally share our insights. This raises an intriguing question. is it possible to inadvertently or unknowingly plagiarize content? a lot of these offenders in their appeal thread, claims to have been unaware or unintentionally plagarized their contents.Ever since I joined this forum and learned that plagiarism is a strict rule that cannot be broken, I've been exceptionally cautious. When creating threads or replies, I even utilize plagiarism checkers to ensure there are no unintentional similarities with existing content. However, I wonder if other members have considered this aspect as well. Perhaps there might be some instances where we may unknowingly fall into the category of plagiarism victims, which could lead to account bans.I've come across numerous ban appeal threads, but not all of them result in unbanning. So, my question is this, What if some members don't intentionally plagiarize content but still find themselves in that category? Let's approach this discussion with reason and understanding, avoiding negative responses. Your insights and experiences on this matter would be greatly appreciated.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5469160",
  "comments": [
    {
      "author": "tbct_mt2",
      "created_time": "October 04, 2023, 10:24:07 AM",
      "body": "They can plagiarize intentionally or unintentionally but is it a forum responsibility?The forum has a thread Unofficial list of (official) Bitcointalk.org rules, guidelines, FAQ that is pinned too. They don't read rules so it is their responsibility to deal with bans.Quote from: Hatchy on October 04, 2023, 10:17:20 AMEver since I joined this forum and learned that plagiarism is a strict rule that cannot be broken, I've been exceptionally cautious.It is no longer strict and nowadays if a user is banned because of plagiarism, it does not come from a single plagiarized post but many so a permanent ban is well deserved.[TIPS] to avoid plagiarism[GUIDE] Plagiarism and how to avoid it.There are rules, there are guides but they are creatively to invent new ways to plagiarize.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "October 04, 2023, 10:28:03 AM",
      "body": "Quote from: Hatchy on October 04, 2023, 10:17:20 AMI've come across numerous ban appeal threads, but not all of them result in unbanning. So, my question is this, What if some members don't intentionally plagiarize content but still find themselves in that category?Although, ban evasion is not allowed, but we know that most of them will open another account which they will start to use to post after they appeal for the ban but not unbanned. That has thought them a lesson. Plagiarism is not condoned on this forum and ban is the reward.It is worth knowing that it is only few established members with past mistake of plagiarism that appealed that were unbanned. A newbie with no useful post than plagiarized contents will be banned and not unbanned, even if he appealed against the ban or pleading to be unbanned.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nutildah",
      "created_time": "October 04, 2023, 10:54:05 AM",
      "body": "Quote from: Hatchy on October 04, 2023, 10:17:20 AMI've come across numerous ban appeal threads, but not all of them result in unbanning. So, my question is this, What if some members don't intentionally plagiarize content but still find themselves in that category? I would say it depends on the length of text considered to be plagiarism, and the commonality of the text itself... For example, the phrase \"A bird in the hand is worth two in the bush\" has been posted on the forum dozens of times and as we all know its a pretty common expression. In using such expressions, nobody accuses the poster of plagiarism.Plagiarism is more reserved for directly copying the original thought of others.An interesting question that arises from this is \"What is the shortest length of text in a post that has ever resulted in a poster getting banned for plagiarism?\"AFAIK, the length of plagiarized text needs to be at least 2-3 sentences long for the mods to take action. The chance of somebody randomly writing 30 or more words all in the same order as previously written by somebody else is very, very low.For instance, Google returns zero exact matches of four words of your post, \"don't intentionally plagiarize content\". So generating 2 or more sentences in the exact same way that anybody else ever has is extremely unlikely (and of course, it depends on the context, whether they are referencing something common or not).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jokers10",
      "created_time": "October 04, 2023, 11:00:31 AM",
      "body": "Quote from: Hatchy on October 04, 2023, 10:17:20 AMWe know that many of us avidly and constantly read various articles from different sources, accumulating knowledge along the way. When questions arise on the forum related to the information we've gathered, we naturally share our insights. This raises an intriguing question. is it possible to inadvertently or unknowingly plagiarize content? a lot of these offenders in their appeal thread, claims to have been unaware or unintentionally plagarized their contents.When you write something in your words you say the same things you read in some other place in some different words. You remember not the text letter by letter, but main its ideas. And if you try to search the same phrase as you wrote in google you'll hardly find any text written the same way, except if it is too trivial or contains a catchphrase.If it is something trivial you can easily find hundreds of the same constructions in Internet and appeal, but moderators understand that also, so they won't ban when it could be a coincidence.Try to search with search engines, try to detect with plagiarism detectors, and you'll find out that it is very unlikely to make the same text as someone else, if you didn't copy it or if you didn't use AI bot to make a post instead of you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nwada001",
      "created_time": "October 04, 2023, 11:01:05 AM",
      "body": "Quote from: Hatchy on October 04, 2023, 10:17:20 AMEver since I joined this forum and learned that plagiarism is a strict rule that cannot be broken, I've been exceptionally cautious. When creating threads or replies, I even utilize plagiarism checkers to ensure there are no unintentional similarities with existing content. However, I wonder if other members have considered this aspect as well. Perhaps there might be some instances where we may unknowingly fall into the category of plagiarism victims, which could lead to account bans.You don't really need to go through the stress of checking your write-up with a plagiarism checker tool to know if your write-up has any missing content. If I happen to read about something online today, I acquire the knowledge, and I have known that thing very well. If a question or a discussion in relation to that thing happens to come forward, I can say something based on what I understood from it and not based on what I crammed from the previously read work. We talk out of what we understand; we have a very slim possibility of even using the same author's word, so plagiarism in such a case is not possible. When you write something out of your own knowledge, you will know within yourself that it is from you, and without any further tools to verify that it is clean, you should know that yourself. There are cases where I think plagiarism happens unknowingly by some newbies about something, that's when they just read about something and they didn't really understand what they have read but they end up cramming the entire content. but you  happens to come across a topic related to that, base on the time when they read the work and when this topic comes in place or when they decide to create a topic on that particular subject matter, they might end up doing word spinning thinking they are talking from their head but they are entirely using someone else work and just changing a few things, in such case the user is always advice to include source link in other to make sure that others know this are not entirely their own work.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tbct_mt2",
      "created_time": "October 04, 2023, 11:07:38 AM",
      "body": "Quote from: nutildah on October 04, 2023, 10:54:05 AMPlagiarism is more reserved for directly copying the original thought of others.Copying thought of others is allowed only if a source link is used or it is put in a quote block. Without a quote block, a source link, it is plagiarism.The ban is lenient and becomes more lenient last two years and community already question moderators about that. No official answer but in the past, if a plagiarism is made to earn money, to meet campaign post quota, it will cause a permanent ban. It is no longer true last two years and nowadays it seems shit posters are banned by AI-content more than by plagiarsim.Quote from: theymos on November 17, 2018, 06:49:10 PMPlagiarism is what gets people permabanned, not just copying. Plagiarism is copying with the intent of passing the work off as your own. In essentially all cases, plagiarism deserves a permaban because it usually proves definitively that the person is here for the wrong reasons: to fill up space in order to get paid, not to actually discuss or contribute. If someone was able to convince us that they were plagiarizing just to eg. impress people rather than to fill up space, then a lesser ban of a few months might instead be warranted. But this has never happened AFAICR. (Arguments based on plausible deniability aren't going to work; we don't need to prove that you had the motive we see in your actions.)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Twentyonepaylots",
      "created_time": "October 04, 2023, 11:20:18 AM",
      "body": "There is intentional and accidental plagiarism, so one act of plagiarism will fall on either of these. So accidental plagiarism may not mean any harm, or a total accidental to have a same thought with the same flow of sentence so it is going to be subjective for one's thought to judge whether it is accidental or not. However, we can clearly see if its intentional like the construction of sentence, thought, flow of paragraphs, and even the changing of words and arrangement. Well, actually plagiarism lies in the structure and not the thought, but yeah coincidences happen.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Plaguedeath",
      "created_time": "October 04, 2023, 11:42:46 AM",
      "body": "Quote from: Hatchy on October 04, 2023, 10:17:20 AMI even utilize plagiarism checkers to ensure there are no unintentional similarities with existing content.If you write it by yourself, there's no chance you will plagiarized someone else post as long as you're not memorizing every words from the original sources e.g. post, article etc. That's why you must understand about something you've read/learn, you will write with your own way with your mind.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jokers10",
      "created_time": "October 04, 2023, 11:55:54 AM",
      "body": "Quote from: Twentyonepaylots on October 04, 2023, 11:20:18 AMbut yeah coincidences happen.Any examples? We can talk for instance about rhymed poetry: lines should have a specific meter and have some expected structure. So there will be an expected pattern of a text, so it will be more expected to see such coincidences in poetry. But how many poems do you know where even a single line duplicated the line from another poem if it was not made intentionally? Well, if a line is too short... and what about a stanza? Even in a more structured text there are nealy no coincidences. When you are not bounded by a meter and a rhyme it will be much less likely to write something word-in-word as someone else.Theoretically everything can be, but in practice... highly unlikely.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "October 04, 2023, 11:56:20 AM",
      "body": "They’re pretty strict with the consequences but I’m pretty sure they let some pass, when someone uses a very common quote without citing the source.You know, the likes of:- “Only invest what you’re willing to lose.” (overly used to the point that we don’t know who first publicly used this quote.)- “Don’t put all your eggs in one basket.” - Overly quoted as well but is apparently said by Warren Buffett- “Not your keys, not your bitcoin.” - Overly quoted as well, but is apparently said by Andreas AntonopoulosMods and admins at the end of the day are human beings, not robots. I’m pretty sure there will be exceptions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "digaran",
      "created_time": "October 04, 2023, 12:17:28 PM",
      "body": "How can someone unintentionally plagiarize several posts? There are certain rules/guidelines that must be followed when someone wants to interact with the world on the internet, so if I am trying to quote someone but I can't remember their name, I'd for example use \"-\" quote/unquote, that's it nobody can accuse me of anything, but if I keep quoting others without adding anything from my own, that would be plagiarizing.Nowadays they don't have to work hard as before, they just copy paste from AI chat box, as my knowledge cut off ever since chatGPT came along. 🤣 I don't even know how to use that phrase in a sentence.If you check github, there are thousands of applications doing the same thing, but why can't we consider them plagiarized code? Because they add a link to the original author's page while adding something valuable to the mix. Most of the cheaters here don't even try that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "knowngunman",
      "created_time": "October 04, 2023, 12:29:54 PM",
      "body": "This issue is very complicated to some certain extent. It's not possible to write a certain amount of words without having similarities index in the plagiarism checker websites whether you are the real writer or you copy it. Talking about doing it intentionally or unintentionally, I don't think one can plagiarize unintentionally because it is almost impossible to write word by word for two to three lines that will coincide with another person's own without having differences. It's possible that you share the same idea with someone but presenting the idea using same words from the beginning to end is certainly not possible.When you read something else where and you come across something here in the forum that require what you read else where as the solution, you can share the idea and include the link or source as the reference. Some people will try to act smart by changing some words or completely rephrase the whole statement but that doesn't make it your idea. In such case, I will consider it as plagiarism.I don't know what it is hard in giving accord or credit to the rightful owner of whatever piece you cited. If it is all about getting merit, you might still get the merit for sharing the idea and of course for giving the source for full information. Plagiarism is a serious criminal offense that should be discouraged by all means. Any plagiarism case is deliberately, thou, newbies might claim they don't know how severe it is condemn here and would plea to be condoned. Mods are trying for keeping the forum clean and free from plagiarize content.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "royalfestus",
      "created_time": "October 04, 2023, 12:43:04 PM",
      "body": "I believe this discussion thread was initiated in response to the consequences of plagiarism. Regrettably, the legal system has consistently treated both the uninformed and the well-informed alike when it comes to punishment. Nevertheless, I am of the opinion that there should be a warning issued prior to imposing a more severe penalty for a second offense.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zoomic",
      "created_time": "October 04, 2023, 01:10:51 PM",
      "body": "Quote from: Plaguedeath on October 04, 2023, 11:42:46 AMQuote from: Hatchy on October 04, 2023, 10:17:20 AMI even utilize plagiarism checkers to ensure there are no unintentional similarities with existing content.If you write it by yourself, there's no chance you will plagiarized someone else post as long as you're not memorizing every words from the original sources e.g. post, article etc. That's why you must understand about something you've read/learn, you will write with your own way with your mind.If you do not visit the internet often to read about things, you will not be scared of unintentional plagiarism. I do not think it is necessary that you run your own articles with plagiarism check. I have never done this and I do not think that it is necessary.When you read articles in the internet, try to understand what the article is saying and use your own words to convey them. This is better than memorizing their words because there could be some certain mix up and this might lead to plagerism. According to the American standard, if you copy verbatim 5 consecutive words, it is plagerism.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cantsay",
      "created_time": "October 04, 2023, 01:12:02 PM",
      "body": "This is where “understanding” comes into play…  I have also thought about this several times and I realized that almost all the posts that I have reported for plagiarism are just the typical “copy and paste” and the few that turned out to be paraphrased were obvious that they copied form somewhere and used a word spin tool.So for someone who previously read an article about a topic and then comes to the forum after some days a similar discussion was opened, it will be very difficult for the person to just write a reply that will be exactly what they read in the article, what you’re expected to do is to “understand” what you read in that article and from there make your own post.Recently I saw an user provide solution to a question that was asked and when I scanned the post I found some traces of plagiarism but the issue there was that it was about “dates an event took place” so it’s very likely for similar content to be online, in such cases I doubt moderators will ban an account.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lovesmayfamilis",
      "created_time": "October 04, 2023, 02:24:26 PM",
      "body": "When checking texts from AI tools for plagiarism, very often you can find the coincidence of several phrases. Further, when searching for these phrases, the search engine returns completely different sources or does not provide them at all.The same thing can happen to users. There are quite popular phrases about Bitcoin that can be considered plagiarism, but even if such a proposal is complained about, the moderators do not consider it.I think it's very difficult to compose text so that it looks exactly the same as somewhere else. If it is copied without quotation marks, it will always be considered plagiarism.There is a good example of a suspended account that vehemently claimed that what it said was an exact but coincidental coincidence. And you can check the status of this account until today.https://bitcointalk.org/index.php?topic=5464527.msg62745477#msg62745477",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LoyceV",
      "created_time": "October 04, 2023, 03:17:40 PM",
      "body": "Quote from: Hatchy on October 04, 2023, 10:17:20 AMWhen creating threads or replies, I even utilize plagiarism checkers to ensure there are no unintentional similarities with existing content.That makes no sense. If you type it by yourself, it's not plagiarism. Chances are someone wrote \"If you type it by yourself, it's not plagiarism\" before I did, but that doesn't make it plagiarism and there's no point looking for it.The only way to unintentionally commit plagiarism is by accidentally forgetting to add the source when you quote something. That can easily be avoided by starting with \"[ quote]\" even before you paste the data into your post.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nutildah",
      "created_time": "October 04, 2023, 03:24:52 PM",
      "body": "Quote from: LoyceV on October 04, 2023, 03:17:40 PMChances are someone wrote \"If you type it by yourself, it's not plagiarism\" before I didAccording to Google, nobody did  That's how unlikely it is to commit unintentional plagiarism.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LoyceV",
      "created_time": "October 04, 2023, 03:29:04 PM",
      "body": "Quote from: nutildah on October 04, 2023, 03:24:52 PMAccording to Google, nobody did  Google stopped giving reliable results when searching for exact phrases a while ago. I'm pretty sure they've indexed my post in this topic already, but that one doesn't show up either.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}