{
  "id": "topic_5451279",
  "title": "pakhitheboss",
  "author": "pakhitheboss",
  "created_time": "May 05, 2023, 04:33:47 AM",
  "content": "Similar to Bitcoin, Litecoin block halving event takes place every 4 years. 2023 is the year when it will happen again. The current block reward is 12.5 LTC which will be reduced to 6.25 LTC. Initial block halving happened in 2011 and the reward was 50 LTC.  The last halving which happened in 2019 did not have a big impact on the price of Litecoin. Do you think this year's halving will have any impact on the price? If yes, then how much will be the target price?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5451279",
  "comments": [
    {
      "author": "Tytanowy Janusz",
      "created_time": "May 05, 2023, 07:32:16 AM",
      "body": "Just like with BTC, each consecutive halving has lower fundamential impact on price:Quote from: Tytanowy Janusz on October 27, 2022, 08:53:31 AM1st halving was important. It reduced monetary inflation from 25% to 12%. Thats a big deal. Second halving decreased monetary inflation from 9% to 4,5%. Now we are getting closer and closer to the 4th halving that will reduce bitcoin monetary inflation from like 1.5% to 0.7%. Both numbers are negligible compared to 8% official CPI in US, 10% in EU or 80% in countries like Turkey. So my bet is that halvings fundamental impact on bitcoin price is getting lower and lower with every next halving in oppose to macro data, FED decisions, interest rates, recessions etc. Bitcoin will be more like an asset that act sometimes like gold on steroids sometimes like sp500 on steroids rather than it will fallow \"bubble x days before each halving scheme\"I don't expect any effect on the price. Other factors will play a much more important role, such as the environment (f.e. bear/bull market on bitcoin). Especially since the previous halving did not give much, so unlike bitcoin halvings, there is not even a psychological impact on the price here.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "May 05, 2023, 07:56:58 AM",
      "body": "This thread belongs to speculation (altcoins)Quote from: Tytanowy Janusz on May 05, 2023, 07:32:16 AMJust like with BTC, each consecutive halving has lower fundamential impact on price:I see your second post (which I quote) to be different. There is no comparison about bitcoin halving and litecoin halving. Even litecoin and other altcoins are moving in price proportionally with bitcoin price and with bitcoin halving having the effect. Quote from: Tytanowy Janusz on May 05, 2023, 07:32:16 AMI don't expect any effect on the price.Exactly this is what I expect. I either do not expect any significant effect of litecoin halving on litecoin price. The effect litecoin community will be expecting is bitcoin halving, because it will have effect on the price of altcoins, including litecoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nimogsm",
      "created_time": "May 05, 2023, 03:57:36 PM",
      "body": "So far, it is very difficult to say what the price will be, since there is still a lot of time before the halving. Many factors will depend on the future price, such as the state of the market at that time and mention in the media, if old and new investors show interest in this coin, then you can expect a price increase, otherwise not.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ojima-ojo",
      "created_time": "May 05, 2023, 06:49:01 PM",
      "body": "Bitcoin vs Litecoin are no comparison since both have difference in the network blocksize and reward size too and just as you mentioned, Bitcoin has undergone a few halving cycles and after each of those halving cycle, there is always a market rise but same can't be said with litecoin and even though it block seize reduces after every halving, the price never increase in form of a bull market and that is one of the set back with litecoin own halving.But since scarcity equals an increase in value, who knows if Bitcoin will make a good value in price after this halving, it could have been easier for Litecoin to ride on the wave of Bitcoin to achieve a possible bull market alongside with bitcoin, but since Bitcoin halving comes before Bitcoin halving that will be hard for only Litecoin to moon easily after every of it halving cycle when the block sseizesare reduced.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "disconnectme",
      "created_time": "May 05, 2023, 07:16:20 PM",
      "body": "Quote from: pakhitheboss on May 05, 2023, 04:33:47 AMSimilar to Bitcoin, Litecoin block halving event takes place every 4 years. 2023 is the year when it will happen again. The current block reward is 12.5 LTC which will be reduced to 6.25 LTC. Initial block halving happened in 2011 and the reward was 50 LTC.  The last halving which happened in 2019 did not have a big impact on the price of Litecoin. Do you think this year's halving will have any impact on the price? If yes, then how much will be the target price? If you looked at the recent halving events including Bitcoin they have become buy the rumor, sell the news, most people especially whales would have positioned themselves for trade like this and will sell during the main event, since the knowledge is an open secret, people will front run themselves into the trade and when the event occurs there won't be any buyer again, I expect at least 50% profit from now till the time of halving and the price correct again. Another thing is that Litecoin has lost its significant role in the space, OG's are the ones talking about it, not the new set of traders entering the space",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "terciduk123",
      "created_time": "May 05, 2023, 08:11:05 PM",
      "body": "If you look at history, Litecoin halving events don't have much effect on Litecoin prices, such as Litecoin halving events in 2015 and 2019Only Bitcoin halving events are very influential, both for Bitcoin itself and all existing altcoins.*https://www.bitdegree.org/halving/litecoin-halving",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jossiel",
      "created_time": "May 05, 2023, 08:13:52 PM",
      "body": "No doubt that bitcoin's halving is something else and if it's with Litecoin, I don't think that there's much impact. Even with this: Litecoin price poised for 700% gains vs. Bitcoin, says Charlie Lee This is pure PR and speculation but take a look back at the past where the halving of LTC happened, do you see some good impact on it? Because for me, I haven't seen such.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "wheelz1200",
      "created_time": "May 05, 2023, 08:15:50 PM",
      "body": "Quote from: pakhitheboss on May 05, 2023, 04:33:47 AMSimilar to Bitcoin, Litecoin block halving event takes place every 4 years. 2023 is the year when it will happen again. The current block reward is 12.5 LTC which will be reduced to 6.25 LTC. Initial block halving happened in 2011 and the reward was 50 LTC.  The last halving which happened in 2019 did not have a big impact on the price of Litecoin. Do you think this year's halving will have any impact on the price? If yes, then how much will be the target price? There are many blockchains that have a halving event especially those bitcoin copy/paste clones.  No reason for these to pump on theor own because of a halving.  Bitcoin it does because of the amount of coins on the selling block get smaller and usually with static demand will cause an increase in price.  This doesn't happen with other coins because if bitcoin isn't running either does anything else.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "goaldigger",
      "created_time": "May 05, 2023, 09:42:25 PM",
      "body": "There might be no huge impact for the LTC halving but with its current price, I still see a big opportunity to accumulate. There might be a huge chance for the halving along with the bull market, and probably the price of LTC will pump. BTC halving are the most anticipated halving, its hard to compare this to LTC halving. If you see big opportunity with LTC, better to grab it now while its cheap, personally I’m trying to get more LTC now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "WalkerIVIV",
      "created_time": "May 05, 2023, 10:40:01 PM",
      "body": "altcoin halving much more litecoin halving doesn't seem to be relevant, no one really bats an eye towards such event, only bitcoin halving is relevant.this time around i'm sure this litecoin halving will do absolutely nothing to its price let alone influencing overall cryptocurrency market general trends currently.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitkanu",
      "created_time": "May 05, 2023, 11:39:32 PM",
      "body": "agreed with what everyone else has stated, litecoin too much irrelevant to be game changer.but quite good enough for safe investment I guess, but consideing the fact that it has lost its place in the cryptocurrency rank by market capitalization maybe it's not really good of an investment at all.but then again there are many coins released every month out there which are technologically advanced.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Adbitco",
      "created_time": "May 07, 2023, 01:58:16 PM",
      "body": "Quote from: pakhitheboss on May 05, 2023, 04:33:47 AMThe last halving which happened in 2019 did not have a big impact on the price of Litecoin. Do you think this year's halving will have any impact on the price? If yes, then how much will be the target price? When there's a halving people expect price to increase uncontrollably because of its reduction. But for sure there may not be much impact on the price because bitcoin increments surely affects the whole lots of the entire cryptocurrency market, now there are two things possible either after halving there will be increase or decreased but general price increase depends on bitcoint and this will happen after next year.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yohananaomi",
      "created_time": "May 16, 2023, 02:49:05 PM",
      "body": "Quote from: WalkerIVIV on May 05, 2023, 10:40:01 PMaltcoin halving much more litecoin halving doesn't seem to be relevant, no one really bats an eye towards such event, only bitcoin halving is relevant.this time around i'm sure this litecoin halving will do absolutely nothing to its price let alone influencing overall cryptocurrency market general trends currently.it seems that what you say is true and real, it has become a public discussion rather than just focusing on the litecoin halving, because it is not commonly discussed and is indeed irrelevant. Halvings are usually for bitcoin because it's such a trend that broadly affects crypto in general that it deserves to be talked about and the rest is almost unheard of, so you're right in saying that no one is going to pay attention to it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "killerfrost",
      "created_time": "May 16, 2023, 03:22:49 PM",
      "body": "I feel this event will also have little effect on the price of Litecoin, and will mainly depend on the volatility of bitcoin. More realistically I have not seen any significant effect of halvings with LTC, and what people will pay more attention to the BTC halving phase is still a long time away from us. such a hot topic.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "asriloni",
      "created_time": "May 17, 2023, 04:36:47 PM",
      "body": "Quote from: terciduk123 on May 05, 2023, 08:11:05 PMIf you look at history, Litecoin halving events don't have much effect on Litecoin prices, such as Litecoin halving events in 2015 and 2019Only Bitcoin halving events are very influential, both for Bitcoin itself and all existing altcoins.That's the impact from the bitcoin halving. Litecoin halving does nothing that affect its price. Litecoin halving was not special thing for me to be honest. I don't know why people are still seeing it as something relevant that was contributing to the price increase that happened in the market. We are less than a year from the next bitcoin halving. The price of litecoin may surge after bitcoin halving. Litecoin halving will never ever have and impact to the price of litecoin itself. I don't even put target for litecoin but surpassing the old ATH after bitcoin halving may still possible for litecoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yhiaali3",
      "created_time": "May 17, 2023, 08:09:51 PM",
      "body": "Yes, most likely the halving of LTC will have an impact on the price increase.I expect in the near term if LTC closes weekly above $100, its near target will be $130.In the long run, I expect $200. But if there is a big rise, it will not be before the start of the market bull.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o48o",
      "created_time": "May 17, 2023, 11:06:01 PM",
      "body": "So far it hasn't been a good buy signal. If anything i would short litecoin when halving happens. But i might wait couple of months and buy after that if past is repeating in some form. But i think that charts seem even too obvious and if enough people are looking at it like me, price could be priced in and it could behave a little different this time. So much so that i am not shorting after all or touching it. It's pointless old altcoin after all.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GreatArkansas",
      "created_time": "May 18, 2023, 01:44:40 AM",
      "body": "I believe that the effect of the Bitcoin halving event will occur before the event, so for me, since it is less than 100 days, more or less 3 months. I believe it already started. As you can see the price of Litecoin become stable and difficult to see huge dumps even if the market is dumping.But for me, it will not be just like Bitcoin but we should also consider it because most of the time that's what happens on Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husires",
      "created_time": "May 18, 2023, 03:27:22 AM",
      "body": "I began to forget that altcoins work similarly to Bitcoin and that it has a halving. even Bitcoin Halving needed about a year to have a clear effect, and therefore we will not notice a change in the price at the present time.Returning to this chart, it seems that the effect needs more than a year, but it is related to the upward movement of the bitcoin, and the bet is that the halving for one unit is sufficient to cause a change in the price that is not supported by historical evidence.Technical developments will make a bigger difference, as they will increase demand in a short period of time and expedite the effect of the decrease in supply.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}