{
  "id": "topic_5458179",
  "title": "andrew185",
  "author": "andrew185",
  "created_time": "July 01, 2023, 01:36:25 AM",
  "content": "Hi everyone!My name is Andres and I'm a developer. For long time ago I was using Coinpayments or Coinbase Commerce to accept crypto in my projects or sites. Some sites requires KYC and deposits fees starts on 0.5% + withdrawal fees, because coins are not in my own wallet (not your keys, not your coins).So... tired of all of this, I decided to learn more about crypto and I could develop CoinMkr (just launched today), a website where you can create or import your own wallet (your mnemonic words will never be stored).Using this mnemonic words, CoinMkr will generate the extended public keys and with the xpub, CoinMkr will generate the address for deposits. You will be able to receive notifications thanks to our API (webhook subscriptions).In other words, all deposits are transferred directly to your own wallet without a middleman like old process.Our system works with credits, so imagine that you can receive $1,000,000.00 in crypto without % commissions directly to your wallet and you only spend 45 credits equivalent to $0.001 approxCoinMkr has it's own Hosted Checkout where you can integrate it in your website easily (including embedded integration) . Also API documentation for advanced users.Right now CoinMkr supports bitcoin, litecoin, ethereum, doge coin, bnb (bep20), tron and matic. Our next update must be the support of tokens ERC20, TRC20 and Bep20I hope you can check our site and any suggestion or idea is welcome.Thank youWebsite: https://coinmkr.com",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5458179",
  "comments": [
    {
      "author": "seoincorporation",
      "created_time": "July 02, 2023, 12:18:14 AM",
      "body": "This project looks nice, for sure a lot of people need a service like this to see their products and services online. And I want to talk about some points of the project.1.- What's your data source, it looks like you offer the data with your API, but where does your API get things like the cryptos price, or if the transaction is confirmed?2.- Is there any plans to make from this tool a Plugin for Wordpress? Maybe you can get a nice income by selling that plugin in themeforest.3.- It would be nice to have more information about the security, since we have to use our private keys I'm afraid about that data gets stored in the data base.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "andrew185",
      "created_time": "July 02, 2023, 12:45:02 AM",
      "body": "Quote from: seoincorporation on July 02, 2023, 12:18:14 AMThis project looks nice, for sure a lot of people need a service like this to see their products and services online. And I want to talk about some points of the project.1.- What's your data source, it looks like you offer the data with your API, but where does your API get things like the cryptos price, or if the transaction is confirmed?2.- Is there any plans to make from this tool a Plugin for Wordpress? Maybe you can get a nice income by selling that plugin in themeforest.3.- It would be nice to have more information about the security, since we have to use our private keys I'm afraid about that data gets stored in the data base.Hi!Thanks for taking a time answering my post =)I'm happy to answer any question and about your doubts:1. Prices are taken from exchangers and also coinmarketcap and coinpaprika, about transactions, we have our own nodes so we can check the transactions from blockchains supported.2. Sure, we have other project of advertising software and today we finished the integration, so we are going to work in other platform integrations.3. No mnemonic words nor private keys are stored. If user wants to use our Hosted Checkout Service, then it is necessary to setup your wallet with the mnemonic words, but it will be used to generate the Extend Public Keys only, so with these keys, our system can generate the deposit addresses for each blockchain.So in other words, our system will get the extended public keys stored in database and that is not a risk for your wallet.But if user has advanced knowledge and wants to make a unique system without our Hosted Checkout service, then he can use our API and can generate their addresses with the xpub. Also user can create subscriptions to listen deposits from addresses.Let me know if you have any other doubt or question.Regards,Andres",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "andrew185",
      "created_time": "July 13, 2023, 09:36:59 PM",
      "body": "New update is available for API, now users will be able to get a conversion value from crypto to fiat and vice versa and also from fiat to other fiat currency.For more information check our API documentation: https://coinmkr.com/developers/apiOur supported cryptocurrencies: https://coinmkr.com/developers/cryptocurrenciesSupport fiat currencies: https://coinmkr.com/developers/fiat-currencies",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}