{
  "id": "topic_5398717",
  "title": "Gi01",
  "author": "Gi01",
  "created_time": "May 15, 2022, 01:10:34 AM",
  "content": "For some time now, a lot of crypto enthusiasts believe it is the future of proof of stake. What exactly makes Liquid staking the future of proof of stake? What is unique about liquid staking? Is liquid staking solving a flaw seen in proof of stake?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5398717",
  "comments": [
    {
      "author": "Eternad",
      "created_time": "May 15, 2022, 01:18:09 AM",
      "body": "Quote from: Gi01 on May 15, 2022, 01:10:34 AMFor some time now, a lot of crypto enthusiasts believe it is the future of proof of stake. What exactly makes Liquid staking the future of proof of stake? What is unique about liquid staking? Is liquid staking solving a flaw seen in proof of stake?  We can not predict exact if Liquid Staking is the future of PoS or not but it's feature is very compatible with crypto. In Liquid Staking, You can still access your funds since you are not locking them away to your wallet which means it's safe for the investors sake from hacking and heavy market volatility. Of course there will some disadvantage since whale can freely pump and dump the market with there unlocked tokens while getting APY but the point is, user has the freedom to do whatever they want on there funds while in Liquid stake unlike traditional PoS that lock away funds to the wallet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kvipcn",
      "created_time": "May 15, 2022, 01:30:23 AM",
      "body": "Liquid staking is the future of proof of stake considering PoS staking protocol. These are the reasons why it is the future;1. Liquid staking protocol allows the possibility of having access to both staking and DeFi. This allows users to earn double rewards2. The protocol allows users to still have control of their funds even when they are staking them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Tytanowy Janusz",
      "created_time": "May 15, 2022, 07:55:23 AM",
      "body": "Yea but most likely locking coins in POS is made for some reason. Most likely security reason so that one does not hit and run. Deposit, manipulate blockchain and withdraw. So is Liquid staking the future? If I understand all of you correct (regular staking without locking) then no.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}