{
  "id": "topic_5398089",
  "title": "mandown",
  "author": "mandown",
  "created_time": "May 10, 2022, 09:03:23 PM",
  "content": "Göçmenler geldiğinden beridir birçok tuaf video görür olduk kimisinin elinde bıçaklar, silahlar, kılıçlar bir kesimin elinde ise cep telefonu insanlarımızı kayıt altına alıyorlar bugün yarın başınıza bir iş geldiğinde bizi koruyacak adalet sistemi artık çalışmıyor. Başınızda bu göçmenlerle ilgili bir olay geldiğinde kendimizi koruyacak birşeylere ihtiyaç duyduğumuz gün gibi ortadadır. Sizi koruyacak birimler gelene kadar iş işten geçmiş olabilir.Bir karadenizli olarak evimde ruhsatlı av tüfeği var ancak av tüfeğini bir silah olarak görmüyorum.  Her daim yanınızda olamaz.En kötü göz yaşartıcı spreylerden aracınızda, çantanızda bulunması gerekiyor. Bu Göz yaşartıcı spreylerden birkaç tane almak lazımHaksızmıyım?Evet arkdaşlar bireysel silahlanmaya EVET diyorum.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5398089",
  "comments": [
    {
      "author": "meser#",
      "created_time": "May 10, 2022, 09:15:08 PM",
      "body": "Hukumetsel insani ve bireysel silahlanmaya da  hayir diyorum hocam ben. Kamusal olarak bu şekilde kontrolsüz birsekilde mülteci alarak  bir nevi nefer toplanılıyor. Öncelikle buna kesinlikle dur denilmeli. Denildi dedik mi onergeniz boşa düşer. Bunun olmayacağını sizde bende iyi biliyoruz. Bireysel silahlanma hem bu mültecilerin daha rahat silahlanmasinin hem de bizim yobaz insanların silahlanmasjnin önünü açar. Niye böyle dediğimi şu linkteki haberi okursanız hatırlar ve anlarsınızhttps://tr.sputniknews.com/20200509/yazar-sevda-noyan-15-temmuz-kursagimizda-kaldi-istediklerimizi-yapamadik-bos-bulunduk-1042002039.htmlBiber gazi ve elektroşok şeklinde söyleminize kalabilirim.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kriminall",
      "created_time": "May 10, 2022, 10:12:44 PM",
      "body": "Bu olayları normalleştirmemek gerekir, bireysel silahlanan ülkelere bakarsanız fazla sayıda ölüm-öldürme var, Türkiye’de de normal şartlarda ölüm oranları çok yüksekken, bireysel silahlanmaya da evet dersek ülkenin her yeri Teksas’a döner, bu doğru değil, farklı şekilde davranmak gerekir,",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "teramit",
      "created_time": "May 11, 2022, 01:52:00 AM",
      "body": "Elinde silah olan bireye sizi rahatsız etti diye biber gazı sıkarsanız o da sizi vurur silahı bırakın biber gazı bile tehlikeli bu açıdan, silah varsa elinizde adam yine sizi vurabilir ve hatta haklı bile çıkabilir, biber gazı varsa ve vurmuşsa eşitsizlik yüzünden ceza alır yatabilir ama sizde silah varsa bana silah çekti kendimi eşit derecedeki silahla savundum diyebilir ceza yine alır ama az alır. Sonuçta olan size olur, kendinizi korumak istiyorsanız saldırgan olmayan bir yöntem kullanmanız gerekir.sopayla saldıran adama sopayla el ile saldıran adama el ile savunma yapmanız gerekir eşitsizlik olursa siz ceza alabilirsiniz, bıçak çeken adamı vurursanız siz suçlu oluyorsunuz, avukata danışırsanız bunu söyleyecektir.Karşınızda silahlı cahil bir adam varsa ölmek olası ama saldırmazsanız vurulma ihtimaliniz düşer, kanunlar ne yazık ki mağdurları pek korumaz hatta saldırganları gayet koruduğunu görüyoruz, bize düşen korunmak için pasif savunma yapmak , fazla kovboy filmi izleyen arkadaşlar heyecan arayıp hüsrana uğrayabilir.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Retro Harmony",
      "created_time": "May 11, 2022, 04:45:51 AM",
      "body": "Bu bu kadar büyütülecek bir şey değil. Çözüm basit bir kaç sene boyunca oturma izni, çalışma izni olmayan tüm yabancıları sınır dışı edip sınır güvenliğini sağladıktan sonra tekrar yurda sokmazsınız. Bu görüntüler yüzünden bireysel silahlanmaya kadar gidecek şeyler olmaz, olmamalıdır.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hollandalibaykus",
      "created_time": "May 11, 2022, 07:52:24 AM",
      "body": "Göçmenler ülkede ekonomi ile birlikte en büyük sorunu oluşturuyor ve devlet herhangi bir şey yapmamaya devam ediyor her gün kavga her gün taciz her gün sorun üstümüzden beslenen beş kuruş para harcamadan hayatın tadını çıkaran mahluklar sürüsü oldu yaz geldi diye iyice sokaklara çıkmaya başladılar artık ülkenin en güzel yerlerinde leş gibi görüntüler ortaya çıkıyor ama olay bireysel silahlanma olunca emin olamadım bize daha çok zarar verebilir böyle bir şey yapmamız",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mandown",
      "created_time": "May 11, 2022, 08:10:52 AM",
      "body": "Quote from: Retro Harmony on May 11, 2022, 04:45:51 AMBu bu kadar büyütülecek bir şey değil. Çözüm basit bir kaç sene boyunca oturma izni, çalışma izni olmayan tüm yabancıları sınır dışı edip sınır güvenliğini sağladıktan sonra tekrar yurda sokmazsınız. Bu görüntüler yüzünden bireysel silahlanmaya kadar gidecek şeyler olmaz, olmamalıdır. Büyütülecek birşey değilmi? Siz kaç türkün elinde silahla videolar çekip sosyal medyada paylaştığını gördünüz? Bu göçmenlerin bir kısmı resmen toplu tecavüzlerdne keyif alıyor.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pierre 2",
      "created_time": "May 11, 2022, 08:33:36 AM",
      "body": "Ben de bireysel silahlanmadan yanayım. Sebebi ise bireysel silahlanma argümanlarının oldukça mantıklı olmasıdır. Bugün bir vatandaş olarak ben silah bulundurmak için bile bir sürü teste girmeliyim. Ama illegal birisi çantasına atıp geçiyor kimse de nedenini sormuyor. Yasaları çiğneyenler için silah edinmek de taşımak da o kadar kolay ki haksız bir durum mevcut.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Retro Harmony",
      "created_time": "May 11, 2022, 08:52:08 AM",
      "body": "Quote from: mandown on May 11, 2022, 08:10:52 AMQuote from: Retro Harmony on May 11, 2022, 04:45:51 AMBu bu kadar büyütülecek bir şey değil. Çözüm basit bir kaç sene boyunca oturma izni, çalışma izni olmayan tüm yabancıları sınır dışı edip sınır güvenliğini sağladıktan sonra tekrar yurda sokmazsınız. Bu görüntüler yüzünden bireysel silahlanmaya kadar gidecek şeyler olmaz, olmamalıdır. Büyütülecek birşey değilmi? Siz kaç türkün elinde silahla videolar çekip sosyal medyada paylaştığını gördünüz? Bu göçmenlerin bir kısmı resmen toplu tecavüzlerdne keyif alıyor.Hocam bu ülkenin silahlı kuvvetleri var. Askeri var, polisi var, jandarması sahil güvenliği var. Biz bireysel olarak silahlanma yaşarsak sadece bu göçmenlerle kalmaz. Canı sıkılan istediğini vurur. Aslında söylemek istediğim bunların kolayca engellenebileceği.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lachrymose",
      "created_time": "May 11, 2022, 09:33:39 AM",
      "body": "Bireysel silahlanma toplumların sigortasıdır. Suç işleyecek adam her türlü işler; bu toplum düzeni ve eğitimle ilgili bir mesele.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "husdemba",
      "created_time": "May 11, 2022, 10:42:42 AM",
      "body": "Bireysel silahlanma artar ve kanunlar da tam olarak uygulanmazsa bu ülke insanı bunu çok kötüye kullanır. Devlet yığınla asker, polis alıyor bırakın onlar işlerini yapsınlar eğer asayişi bozacak bir durum oluşursa. Göçmenlerle ilgili sizin bahsettiğiniz problemler ise 15-20 yıl sonra başımıza gelecek o zaman dert ederiz",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gencecikmen",
      "created_time": "May 11, 2022, 10:59:16 AM",
      "body": "Bu zamana kadar bireysel silahlanma olan ülkelerin hangisinde doğru düzgün uygulanmış ki bizim ülkemizde bireysel silahlanma adam akıllı bir şekilde uygulansın da sizin cebinizde silah alması sizi suçlu ile eşit duruma getirsin. Eğer buna inanıyorsanız, elimde tam size göre bir köprü var az kullanılmış kelepir. Mülteci sorununu da, suç ile ilgili sorunları da bireysel silahlanma ile çözemezsiniz sadece ortalığı daha fazla karıştırırsınız. Sorunu eğitim, eşit gelir dağılımı, güçlü bir adalet sistemi ile çözebilirsiniz. Suç oranının nispeten çok az olduğu Norveç, Finlandiya gibi kuzey ülkeleri veya Küba sorunu böyle çözmüştür.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LGD2Business",
      "created_time": "May 12, 2022, 01:08:23 AM",
      "body": "Ben bizimki gibi ortadoğu ülkelerinde bireysel silahlanmanın ters tepeceğini ve toplumsal zararının yararından çok daha büyük olacağını düşünüyorum. Siz sıradan bir vatandaş olarak kendinizi güvende hissetmek için silah alırsınız, etrafta gezen psikopatlar sırf zevk için alır. Silah almak zaten kolay bunu daha da kolaylaştırmanın bir anlamı yok. Bu ne ekstra güvenlik getirir ne huzur, aksine kendinizi daha çok risk altında hissedersiniz.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ZekiBeyy",
      "created_time": "May 12, 2022, 05:52:46 AM",
      "body": "Silahlanmanın çözüm olacağını sanmıyorum yaşadığımız şu dönemde bile insanlar eften püften sebeplerle bir birlerini öldürebiliyorlar. Kanunen sert yaptırımları olmalı en ufak bir olumsuz fiil işleyeni sınır dışı edeceksiniz cezalar ağır olmadığı sürece hiç bir şey düzelmez. Kanunen bir yaptırım gelmezse belli başlı guruplar bu olumsuz örnek teşkil edenleri ortadan kaldırır.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "verbakalim",
      "created_time": "May 12, 2022, 05:57:01 AM",
      "body": "Bireysel olarak zaten isteyen silah alabiliyor. Düğünlerde yapılan kontrolsüz silah kullanımları sonucunda oluşan tabloları hep beraber görüyoruz. Silah tehlikedir. Kullanacaksanız elinize alacaksınız. Yoksa karşınızdaki sizin için kesin kullanır.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "YULFC",
      "created_time": "May 12, 2022, 07:23:41 AM",
      "body": "Silaha ve şiddeti sorunların çözümü olarak kullanmaya kesinlikle karşı bir insan olarak malesef ben de evet diyorum. Çünkü karşımızdaki güruh laftan sözden tavırdan anlayacak bir topluluk değil. Başımızdakilerin de kaybettikleri taktirde iç savaşı körükleyip bu mülteci grubunu üstümüze salacağını düşünürsek önlem almak en doğrusu. Kavgaya dahil olmak için değil ama, canını korumak için malesef ihtiyaca dönüştü.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gospodin",
      "created_time": "May 12, 2022, 04:12:25 PM",
      "body": "valla ben seneler öncesinden bu eylemi gerçekleştirmiştim. hatta yetmedi geçtiğimiz aylarda envanterimi biraz daha geliştirdim. tabii ki ruhsat vs olmadığı için yanımda taşımıyorum sadece evde takılıyor it herifler. silahı seviyorum arkadaşım yoksa geri kalan umrumda değil. isveç'te de olsak aynısını yapardım.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DukeNickle",
      "created_time": "May 12, 2022, 05:41:57 PM",
      "body": "Bireysel silahlanma gibi bir şeye ben pek sıcak bakamıyorum hocam valla. Çünkü ülke iyice Texas'tan hallice olacak böyle olursa da. İnsanlar artık sokakta yürümeye daha çok çekinecek yanlış bir anlaşılmadan bile kaza kurşununa gidebilirim diye. Bence bu bir çözüm değil o yüzden. Buradaki tek çözüm yolu var o da belli. Sığınmacıları ülkesine bir şekilde geri yollamak. Bunu yapacak adam belki şu an yoktur ama seçim sonucunda bakacağız artık.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "eightdots",
      "created_time": "May 12, 2022, 06:22:08 PM",
      "body": "Bizim yanlışımız sadece bir olaya odaklanıp hadi şunu serbest yapalım ama sadece o olay için kullanılacağını sanıp bu istekte diretmemiz. Diyelim bu olay yüzünden silahlandık ee nolacak sonra? Biz ne zaman belirli bir hedef için yola çıkıp da sonra sapmadık? Böyle söylemleri tehlikeli buluyorum. Yapılacak olan belli eğer bunlar yapmazsa sonrakiler yapar ama bu listede şu silahlanma son sırada bile yer almamalı. Çünkü amacından sapacağı aşikar.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SUPERSAIAN",
      "created_time": "May 12, 2022, 06:47:13 PM",
      "body": "Bireysel silahlanmaya bende evet demiyorum toplumsal bir felakete yol açabilir. Silah kullanmak başka bir şeye kullanmaya benzemez bu yüzden sadece kolluk kuvvetlerinin kullanması taraftarıyım. Özel durumlarda iş adamlarının, avukatların vesairede ruhsatlı bir şekilde sahip olabilemesinde bir sakınca görmüyorum. Toplumsal olarak bunu yapmak bir çözüm olmaz sadece daha da kaos yaratır.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}