{
  "id": "topic_5414147",
  "title": "NotATether",
  "author": "NotATether",
  "created_time": "September 19, 2022, 05:47:59 PMLast edit: September 24, 2022, 04:19:47 PM by NotATether",
  "content": "UPDATE: The site is live at bitcoincleanup.com. Now go out there and spread the word. We gotta make this thing #1 in Google searches for Bitcoin cleanup.If anyone wants to volunteer to maintain a (free) blog on Github Pages or the like, post here and I will send you a PM.I've already picked out the domain name (not going to reveal it so that nobody snipes it before I buy it), hosting, e-mail - I have the finances to cover the costs (just a few dozen dollars per year) - I'll just use a Carrd.co template to take care of the fact graphics since I'm not a good web designer.My questions to the community are about other matters:1 - Should I start a counter-petition demanding the White House drop its anti-Proof of Work bills?2 - Should I start a mailing list similar to what Greenpeace is doing?3 - Will people link to this site so that it quickly ranks on Google? In other words, will people actually use the site? (I've been in the SEO rat race for almost two years - I can tell you that it's impossible to get pageviews unless there are people actually willing to use the site).The last part is probably the most important because I don't want this to be a solo effort. It's going to fail if I take this on alone. I need the entire community support behind me in these critical times for Bitcoin, which is currently under seize from governments and trolls alike.[Why not just re-use my blog? Well because nobody's going to link to a blog just for this purpose - it requires a dedicated website without my persona attached to it. Also I don't want to deal with the anticipated DDoS attacks on my servers, hence why I'm hosting with a 3rd-party.]This has to extend far beyond Bitcointalk too. If anyone can help me get a featured article about the site to Bitcoin Magazine, I will be very grateful. Even better if we can get other people from off the forum talking about this as wellLet's stand together and defend Bitcoin so that future generations can benefit from it.No spamSpam will be deleted immediately.Edit: This includes posts from people who continuously flood this thread with debunked myths about PoW.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5414147",
  "comments": [
    {
      "author": "348Judah",
      "created_time": "September 19, 2022, 08:29:31 PM",
      "body": "Quote from: NotATether on September 19, 2022, 05:47:59 PM1 - Should I start a counter-petition demanding the White House drop its anti-Proof of Work bills?yes and strongly recommendedQuote from: NotATether on September 19, 2022, 05:47:59 PM2 - Should I start a mailing list similar to what Greenpeace is doing?yes, there's nothing bad in counter campaign against the end doing it wrongQuote from: NotATether on September 19, 2022, 05:47:59 PM3 - Will people link to this site so that it quickly ranks on Google? In other words, will people actually use the site?much likely, i trust the delivery capacity of the forum members here in related affairs, Hodlonaut is an example, it got a number of support from here with threads, bitcoin will definitely overcome just as many could not claim Satoshi and win, PoS will not overcome PoW.We stand strong with Bitcoin",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Slow death",
      "created_time": "September 19, 2022, 09:03:03 PM",
      "body": "fighting against environmentalist is an endless fight that you will exhaust your strength, those guys will never change, they already have crooked thinking. they have a lot of funds and are in a lot of countries, so even if you create this site to fight them i think it will be an endless fight. The best option is to just watch the crazy things they do, because people know how to think for themselves so they won't believe everything they say. this idiotic idea of them wanting to extinguish bitcoin mining and still paying advertising with nonsense like: \"Change the code, not the climate\" this will not go anywhere. they'll just be wasting their time",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coolcoinz",
      "created_time": "September 19, 2022, 10:08:13 PM",
      "body": "It's a good idea, although will fighting them with their own methods just get them the attention they're seeking? Most people with a brain know Greenpeace is like those charities that claim to be gathering money fro children but the people running them report earnings much above the level of average wages. This shows they aren't doing it to help whoever they're raising money for but mainly themselves. BLM is a good example here, antifa is another one and Greenpeace belongs in the same group. Just read about their exploits and how money has a tendency to disappear in their organization. If you get the site running I'll send links to all my friends to check it out and get you some traffic. I don't need other people to tell me what I can or cannot use electricity for. I'm paying for it and if I decide that I want to melt snow in my driveway with it or hang lights on every tree in my garden it's going to happen.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DooMAD",
      "created_time": "September 19, 2022, 10:19:30 PM",
      "body": "Quote from: NotATether on September 19, 2022, 05:47:59 PMMy questions to the community are about other matters:1 - Should I start a counter-petition demanding the White House drop its anti-Proof of Work bills?I'd suggest holding fire on the counter-petition until we know the community is at least somewhat organised and supporting the cause.  It would need to have a significant number of signatures in order to carry any weight.  Ideally more than their petition has.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zlantann",
      "created_time": "September 20, 2022, 02:13:16 AM",
      "body": "Quote from: NotATether on September 19, 2022, 05:47:59 PM1 - Should I start a counter-petition demanding the White House drop its anti-Proof of Work bills?2 - Should I start a mailing list similar to what Greenpeace is doing?3 - Will people link to this site so that it quickly ranks on Google? In other words, will people actually use the site? (I've been in the SEO rat race for almost two years - I can tell you that it's impossible to get pageviews unless there are people actually willing to use the site).The last part is probably the most important because I don't want this to be a solo effort. It's going to fail if I take this on alone. I need the entire community support behind me in these critical times for Bitcoin, which is currently under seize  (siege) from governments and trolls alike. Although One million dollars have been budgeted by Greenpeace for this smear campaign against Bitcoin. And this amount can buy all the publicity and support they need to carry out this task. But Bitcoin needs all the support now, regardless of how small such support might look. Hence this course is worthwhile. Your plans are can make a very big impact only when you have the support of the Bitcoin community. Devising a means of ascertaining the level of their support (maybe using a poll) might be good. Also, I am suggesting that we consciously monitor the channels Greenpeace would be using to execute these smear campaigns and engage in a counter-campaign. I read the article: Bitcoin Being Energy Efficient? and it is glaring that Proof of Work is the best option for Bitcoin, for now, hence it is worth defending. Using every channel at our disposal, we can make a big difference if we come together and support this genuine course.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bittraffic",
      "created_time": "September 20, 2022, 02:25:13 AM",
      "body": "Do it!  I'm sure you know how to make people understand howall these works.Although if the developers will just ignore this Greenpeace POS, it will die down. The question is how far will they go and enforce devs to change the code. They don't understand as Energy is currency. Once POS wins. There will never be a chance for BTC to dominate. It will be like ETH which is now under SEC jurisdiction.A lot of us will likely share that website you make. SEO will be a problem for google may just de index the site but sharing will make it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "aoluain",
      "created_time": "September 20, 2022, 06:28:30 AM",
      "body": "Yes why not.I think it will be a mammoth task and will take time and a lot of effort to get momentum,but that shouldn't be a reason to not do it.Everyone would need to get behind it and contribute in any way to it. I will as a start linkmy own website d3fy.link to it to help with the SEO.The info to counter Greenpeace's campaign but its not centralised in one go to placeand is hard to find hard facts so this initiative will be very beneficial.I say go for it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NeuroticFish",
      "created_time": "September 20, 2022, 08:23:24 AM",
      "body": "Quote from: NotATether on September 19, 2022, 05:47:59 PM1 - Should I start a counter-petition demanding the White House drop its anti-Proof of Work bills?I think that you should do this only as a later step.Quote from: NotATether on September 19, 2022, 05:47:59 PM3 - Will people link to this site so that it quickly ranks on Google? In other words, will people actually use the site? (I've been in the SEO rat race for almost two years - I can tell you that it's impossible to get pageviews unless there are people actually willing to use the site).I have no problem doing a couple of searches for it, visit it now and then, and also post the link a couple of times on Twitter if that helps.Also if you think it helps I can add an URL into my personal test.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "September 20, 2022, 09:19:53 AM",
      "body": "I got the site ready and hosted it on a temporary domain https://cleanup123456789.carrd.co. My domain's records have not fully updated so I can't host it on the main domain yet. Mailing list does not work yet, for that reason. Please leave your thoughts about it below.Specifically, I'm at a loss of what I should fill in the \"Take action\" section.Besides sending tweets and writing letters to governments, what else can we do?Any ideas?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "minairia3",
      "created_time": "September 20, 2022, 10:28:45 AM",
      "body": "I support this idea and gladly share it on my local bitcoin community or social networking sites. I'm not from the US so I want to know, are these petitions signed by supporters (bitcoinners like us) will they really care about it, will they read it? Bitcoin is still seen as a threat to governments and they are looking to squeeze it, or even not want it to grow any further. If there is a chance to destroy bitcoin, I think they will not let it pass. It can be seen that in governments there are still some voters or politicians who support bitcoin, but that number is very few compared to those who are against bitcoin.I think this idea will be great if we can attract the support of big miners or all the mining community in the world, I believe it will have a stronger impact.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "September 20, 2022, 10:33:46 AMLast edit: September 22, 2022, 01:28:43 PM by franky1",
      "body": "aswell as asking this community to rally via this topic and your twitter followers. also build up a list of contacts of:mining pool operators large asic farmsdevsmerchantscelebrities, etc.. that support bitcoin  dont assume the low amount of people that read this topic or your twitter followers will just spam your link to eventually reach the big guys. dont spam them while the page is evolving. most people once they have read it.. they dont go back to a site or if they get spammed the link in a couple months later, they assume its the same as last time and dont return.so first round needs to have an important message and task for them to get involved in rather than a \"coming soon\" or a TBA of a task that you want people to do lateras for a petition, yes that is something onpoint that makes it worthy of getting involved rather than just spreading social drama between people of finger pointing who to get angry at but has no end purposewith a petition dont just say \"ignore bills that hurt bitcoin\" . be precise, informative, matter of fact, actually get to the point.explain how PoW is a proof that hard work is involved and its a security and value feature. that it actually protects the network unlike other networks that can be attacked at no cost.show that unlike gold that literally rips the ground open and destroys forests and green land. bitcoin does not touch land. doesnt devastate nature. add details that miners should be welcomed to renewable regions, not pushed out of the country. the income power plants can get from their excess can further fund more renewable upgradesetc etcwe would rather see states trying to bid for mining to enter the area much like states bidding to get amazon warehouses to set up in their area's..rather than being pushed out of the countryhave template letters so people can copy and paste reasons why their local representative should support bitcoin and the PoW industryEG a page where people can pick their favoured state, and it shows the representatives at county, state  level, of both congress and senate so they can easily email them have atleast 5 template letters to let people have a choice of reason. such as*explaining the security of PoW vs PoS.*the value concept of the hard work giving store of value to bitcoin unlike (zero-bottom) pos currencies that are 99.95% speculative*how PoW funds power plants excess which allows more renewable expansion quicker*how bitcoin creates jobs*inspires businesses and new technologymaybe open a github so people can add website suggestions or edit letters/petition wording into a final draft which you can then grab all the idea's from to insert into your site",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "September 20, 2022, 11:07:07 AM",
      "body": "Quote from: franky1 on September 20, 2022, 10:33:46 AMhave template letters so people can copy and paste reasons why their local representative should support bitcoin and the PoW industryEG a page where people can pick their favoured state, and it shows the representatives at county, state  level, of both congress and senate so they can easily email them have atleast 5 template letters to let people have a choice of reason. such as*explaining the security of PoW vs PoS.*the value concept of the hard work giving store of value to bitcoin unlike (zero-bottom) pos currencies that are 99.95% speculative*how PoW funds power plants excess which allows more renewable expansion quicker*how bitcoin creates jobs*inspires businesses and new technologymaybe open a github so people can add website suggestions or edit letters/petition wording into a final draft which you cnan then grab all the idea's from to insert into your siteThat's actually a really good idea. People are not known for writing their own template letters anyway.I'll save the petition for when the mailing list grows large enough, if it's still needed then.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "September 20, 2022, 12:40:15 PM",
      "body": "Quote from: NotATether on September 20, 2022, 11:07:07 AMQuote from: franky1 on September 20, 2022, 10:33:46 AMhave template letters so people can copy and paste reasons why their local representative should support bitcoin and the PoW industryEG a page where people can pick their favoured state, and it shows the representatives at county, state  level, of both congress and senate so they can easily email them have atleast 5 template letters to let people have a choice of reason. such as*explaining the security of PoW vs PoS.*the value concept of the hard work giving store of value to bitcoin unlike (zero-bottom) pos currencies that are 99.95% speculative*how PoW funds power plants excess which allows more renewable expansion quicker*how bitcoin creates jobs*inspires businesses and new technologymaybe open a github so people can add website suggestions or edit letters/petition wording into a final draft which you cnan then grab all the idea's from to insert into your siteThat's actually a really good idea. People are not known for writing their own template letters anyway.I'll save the petition for when the mailing list grows large enough, if it's still needed then.at the moment the greenpeace stuff is just social distraction..its a finger point exercise to have any gov decision pointing to blame greenpeace as the instigators. but its actually the gov that are going to make changes that can affect thingsthings to look at are the actual gov agencies bills and drafts.everything from the SEC wanting to move crypto regs into the realm of CFTC this month. and how the EPA and the FERC alongside CFTC can then get their fingers into controlling things. CFTC can change what policies exchanges have to follow.. EPA and FERC can affect miners. and combined these can influence another NY agreement of economic nodes and miners to push for a mandated fork which miners/economic nodes then forced to follow, which then users follow..which while under SEC the SEC can only deal with the financial currency side. EG CFTC can and does regulate wheat/beef markets and help with EPA push quota's on farmers to limit food production. and EPA limits what energy, water, fertiliser and waste control farmers have to obide by.. which SEC cant do.so research into the gov movements more than Greenpeace movements. learn the real attackers to then formulate letters that prevent these.. rather than cries about greenpeace.. in short be a few steps ahead to know the consequences of greenpeace to then aim at preventing the consequences before they manifest",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "September 20, 2022, 12:59:56 PM",
      "body": "It is very hard to find honest Twitter personalities in the sea of crap. Yet it is necessary to send people coming to this site, to the correct direction. Because this is an information war we are fighting, and if we don't guide people to other honest personalities, then other people are going to brainwash them to think evil about us.Can someone give me a list of well-known bitcoin twitter accounts that people should follow? This is going to go on the website.E.gMichael SaylorHodlonautAndreas Antonopoulos",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NeuroticFish",
      "created_time": "September 20, 2022, 01:12:40 PM",
      "body": "Some ideas:1. you may want to make this more like a blog than a \"simple\" page, the new articles now and then being something that may help attracting more readers (since, as franky1 said, else people may not reallycome back).2. please - for the final version(s) - check the spelling; one small mistake is at the end: QuoteWrite to your MP, senator, or member of Congress explaining the benefits of Proof of Work mining fr the environment.3. maybe it would help to not \"demonize\" Greenpeace, hence soften the tone against them / say that they were probably misledQuote from: NotATether on September 20, 2022, 12:59:56 PMCan someone give me a list of well-known bitcoin twitter accounts that people should follow? This is going to go on the website.I will add to your list:LoppCZ (but I don't know if he would care)maybe also Nicolas DorierDo newspapers matter?bitcoin magazinebtc times",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "September 20, 2022, 01:21:36 PM",
      "body": "Quote from: NeuroticFish on September 20, 2022, 01:12:40 PMSome ideas:1. you may want to make this more like a blog than a \"simple\" page, the new articles now and then being something that may help attracting more readers (since, as franky1 said, else people may not reallycome back).2. please - for the final version(s) - check the spelling; one small mistake is at the end: QuoteWrite to your MP, senator, or member of Congress explaining the benefits of Proof of Work mining fr the environment.3. maybe it would help to not \"demonize\" Greenpeace, hence soften the tone against them / say that they were probably misledNumber 2 and 3 is a good point. This is why I did not make it live yet I think my autocorrect is malfunctioning - I was using Chrome's built-in one on desktop. Time to pull out Grammarly?Number 1 is something I'm less sure about. As things stand, I am having trouble keeping my own blog up to date, so I'm not sure if this is something I can accomplish along with everything else I'm doing.I want as much stuff to be in autopilot mode as possible, hence why I'm also not doing a weekly newsletter but a \"once in a while\" mailing list posts when I feel in the mood to do that stuff. Besides, Carrd does not support multi-page sites anyway, so if I want to make a blog, I'd have to use Wordpress which is 1) slow loading speed, and 2) makes my server vulnerable to DDoS since I can't justify buying an ephemeral server for this as it could also get DDoS'd.I think my only viable option for multipages would be to host on Github Pages or something of that sort, but somebody will have to volunteer to do that. (The github.io domain can be redirected to a subdomain of mine.)Quote from: NeuroticFish on September 20, 2022, 01:12:40 PMQuote from: NotATether on September 20, 2022, 12:59:56 PMCan someone give me a list of well-known bitcoin twitter accounts that people should follow? This is going to go on the website.I will add to your list:LoppCZ (but I don't know if he would care)maybe also Nicolas DorierDo newspapers matter?bitcoin magazinebtc timesAnything that gives two damns about decentralization matters. So yes.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "September 20, 2022, 01:29:56 PM",
      "body": "I am always in favor of being on the side of the truth, and if that means that we have to dispute everything that the people from Greenpeace will claim in their campaign, then the only question is how to do it in the best possible way. I agree that creating a website is a good start, and that we should use social networks to make as many people as possible aware of the truth when it comes to the completely senseless attack on Bitcoin in the context of environmental protection.I am ready to provide active support for this idea through my Twitter and link on my website, as well as through avatar/personal text when the @hodlonaut case is decided.As for famous Twitter accounts, along with all the others already mentioned, only Tim Draper comes to mind at the moment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "September 20, 2022, 01:59:24 PMLast edit: September 20, 2022, 05:38:53 PM by franky1",
      "body": "Quote from: NotATether on September 20, 2022, 12:59:56 PMCan someone give me a list of well-known bitcoin twitter accounts that people should follow? This is going to go on the website.E.gMichael SaylorHodlonautAndreas Antonopoulos@bitmainofficial@coinbasedont think about social guys also think about the services that support bitcointhe ones really affected by a change/regulatory push(edited to shorten my waffle)its not about publishing twitter names on your website for lemmings to then spam those people.. its for YOU to contact them and get THEM to sign a petition or send a letter to governmentgreen peace is petitioning bitcoin businesses and US gov representatives to push bitcoin to be PoStheir game is not to just point fingers about \"waste statistics\" the fight is not to counter argue with greenpace about their statistics.. its about fighting their push to change bitcoin, we ned to fight off their invitation to change bitcoin via us needing to get businesses and gov representatives to not accept greenpeaces invitation. having it where you have common bitcoiners go to your site just to be told to visit bitcoin celebrities about bitcoin stats..  and follow celebrities and spam celebrities with messages about \"greenpece wrong\".. is just a protest of social drama of an echo chamber of bitcoiners telling bitcoiners why to get angry..in a small endless circle that seems popular and trendy and viral.. but doesnt reach politicians ears/eyeballsit goes no where politicallybut if YOU contact the celebrities (when site is final) where they can easily copy a template letter or organise a lobby group and directions to push a government representative..and then have celebrities themselves post about the action they done..  linking your site for instructions directed at gov repsthen have everyone link your site.. thats more organised than a echo chamber of a link that just sends them back to another bitcoiners twitter account just to follow/spam inside the community..in politics. politicians love the social drama/street protests. because while people are busy in their lil groups shouting at each other that they are angry(street protests).. those people(protesters) are not organising petitions/lobby groups to talk to politicians. so politicians can act ignorant, blank out the noise and just do what they like because they dont receive official petition/demands in their mailboxthe greatest laws didnt change due to protests.. it changes due to petitions and lobby groups",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Leviathan.007",
      "created_time": "September 20, 2022, 04:48:59 PM",
      "body": "I can give some advice regarding the website since you are creating the website and the goal is to get some more attention from people and get more people aware of the website you have, I guess the most important part for you is the SEO part and that's technically not that hard to be done if you know an SEO expert otherwise you won't achieve anything even if the website works perfectly, also you should consider a very solid and user-friendly UI and I recommend using a suitable frontend framework to have more attractive UI design. After these two you can start advertising your website on other platforms and even here on your profile.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}