{
  "id": "topic_5445934",
  "title": "uche6215",
  "author": "uche6215",
  "created_time": "March 22, 2023, 04:26:21 PMLast edit: March 22, 2023, 05:24:05 PM by uche6215",
  "content": "BITCOIN PRICE TODAYGood day house members and chairpeople (moderators) I just feel like telling the house and those who accomplish not know the current price of bitcoin and how much it worth today,  but first I don't know where I should drop the thread and if the thread is not permitted to be here, please someone should help me move it. The price of bitcoin already shown in the picture at the awning and I know at any time it will be higher than it is now or it will be lower than it is, but if the current price of Bitcoin eventually reduces never sell hold until you are satisfied with the price before selling. For, I am thinking of opening a business for my wife with the tangible profits I have made from Bitcoin, I would have dropped a picture of my electrum wallet balance but I will not because I don't think is either advisable to do so.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5445934",
  "comments": [
    {
      "author": "Adbitco",
      "created_time": "March 22, 2023, 11:59:15 PM",
      "body": "Usually this period and this month has shown proven to be bull for bitcoin price, I think most of us here already aware of the sudden increase of bitcoin price. To me I often check coinmarketcap to always be informed of the update, secondly I set my binance account to a notification were I often received updates on a regular basis.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jating",
      "created_time": "March 23, 2023, 12:28:42 AM",
      "body": "Good for you if you have made profits already when the price hits $28k because it seems that we have a correction already. And so it's true, we never know the price movement. We were all hinting that the price might go to $30k for this month as this is our goal.But when the FEDs seems to released their numbers and it's not very positive, the market reacted obviously.However, we are still very good above $27k and I wouldn't be surprised to see the price going back to $28k++ again.Good luck though in your goal to open a business with the profits that you are going to make in this run.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fundamentals Of",
      "created_time": "March 23, 2023, 01:07:27 AM",
      "body": "It is good that you are planning to open a business from your profit, but I don't think this is the best time to take profit. Do what you have to do of course. This is just my opinion. It's just that Bitcoin at the $20,000 level isn't worth selling. It is cheap. For me that's too low a price to let go of my precious satoshis. Bitcoin has been to $69,000. It can go back there for sure. Also, the halving is near. It's just around a year from now. That will bring in more profit.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charmekkd",
      "created_time": "March 23, 2023, 02:31:46 AM",
      "body": "in the near future I checked the market and it turns out that the price of btc has risen to a price of around 28000.and I am very happy because my investment started to generate a lot of profit. but I think that with this price increase it is still not high when compared to the price of bitcoin during the BUL RUN of 2021.but the decision is in the hands of each, if for example we want to sell it,hope your business is successful",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LittleBitFunny",
      "created_time": "March 23, 2023, 02:51:07 AM",
      "body": "Quote from: Jating on March 23, 2023, 12:28:42 AMGood for you if you have made profits already when the price hits $28k because it seems that we have a correction already. And so it's true, we never know the price movement. We were all hinting that the price might go to $30k for this month as this is our goal.But when the FEDs seems to released their numbers and it's not very positive, the market reacted obviously.However, we are still very good above $27k and I wouldn't be surprised to see the price going back to $28k++ again.Good luck though in your goal to open a business with the profits that you are going to make in this run.The Fed's numbers are positive, their tone is no longer so hawkish and they have begun to falter on raising rates, raising rates so quickly has cost them the bankruptcy of banks recently. The 0.25% gain is a good sign for the market, bitcoin was volatile when the news was announced but in the long run, should positively impact the market. With this rate hike, I remain optimistic about bitcoin hitting $30,000 this month as well as it conquering other gains in this rally.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ethereumhunter",
      "created_time": "March 23, 2023, 03:02:00 AM",
      "body": "If you can profit from bitcoin, you can use that profit to open a business for your wife, especially if you sell the bitcoins at the highest price. So from now on, you should be able to collect more bitcoins before the price increases so you are ready if the bull run comes again.We will never know when the highest price will come again so we can only be prepared. And yes, never sell if you are dissatisfied with the current price and it is better to just stick with it until the price can go up again.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hamphser",
      "created_time": "March 23, 2023, 11:36:38 PM",
      "body": "Quote from: ethereumhunter on March 23, 2023, 03:02:00 AMIf you can profit from bitcoin, you can use that profit to open a business for your wife, especially if you sell the bitcoins at the highest price. So from now on, you should be able to collect more bitcoins before the price increases so you are ready if the bull run comes again.We will never know when the highest price will come again so we can only be prepared. And yes, never sell if you are dissatisfied with the current price and it is better to just stick with it until the price can go up again.Building any business or really going for assets which could possibly generate more income is something that we must do because we do know that having multiple source of income is really that much preferable.If you do see that you do need more business then go ahead and if its for your wife then go ahead because the more the better if we do have other income sources.Some people do just simply want to buy somethingon the time that they do make huge money from their crypto investment.Some are like that and some arent and this is why to those who are mindful for their future are the ones who do sustain whenever there are some economic problems.Come to think that not all the time we are on a good situation when it comes to finances which it is really just that right that we should always have back up plans.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GreatArkansas",
      "created_time": "March 24, 2023, 02:22:36 AM",
      "body": "Quote from: uche6215 on March 22, 2023, 04:26:21 PM(....)For, I am thinking of opening a business for my wife with the tangible profits I have made from Bitcoin, I would have dropped a picture of my electrum wallet balance but I will not because I don't think is either advisable to do so. When will you take profits?Always remember that Bitcoin is too volatile, so if you have a plan of taking profits, you must stick with it because no one knows what will happen to Bitcoin price.I commend you OP for being practical in using the profits of Bitcoin for the good side which is starting a business.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gunhell16",
      "created_time": "March 24, 2023, 04:26:25 AM",
      "body": "With the current price of bitcoin in the market, it is clear that we are now in a bullish state, the value remains calm at 28k$ almost, even if its value dumps, I can still say that we are really in a bullish state.So it is still better to postpone the application of DCA for bitcoin because I really see this as an effective way for us to accumulate bitcoin in the future.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ethereumhunter",
      "created_time": "March 24, 2023, 08:17:25 AM",
      "body": "Quote from: Hamphser on March 23, 2023, 11:36:38 PMQuote from: ethereumhunter on March 23, 2023, 03:02:00 AMIf you can profit from bitcoin, you can use that profit to open a business for your wife, especially if you sell the bitcoins at the highest price. So from now on, you should be able to collect more bitcoins before the price increases so you are ready if the bull run comes again.We will never know when the highest price will come again so we can only be prepared. And yes, never sell if you are dissatisfied with the current price and it is better to just stick with it until the price can go up again.Building any business or really going for assets which could possibly generate more income is something that we must do because we do know that having multiple source of income is really that much preferable.If you do see that you do need more business then go ahead and if its for your wife then go ahead because the more the better if we do have other income sources.Some people do just simply want to buy somethingon the time that they do make huge money from their crypto investment.Some are like that and some arent and this is why to those who are mindful for their future are the ones who do sustain whenever there are some economic problems.Come to think that not all the time we are on a good situation when it comes to finances which it is really just that right that we should always have back up plans.I also want to get another big profit from bitcoin because this time, I also want to give the profit I get to my wife so she can start the bakery business she wants. Maybe the initial capital can be very large but I'm sure he can start with a minimum investment first while waiting for market conditions to really reach the peak of its recovery.And when the market can reverse direction and make a lot of coins, bitcoins and altcoins increase, including all my altcoins, that will be a huge advantage for me. This is where we must plan for what we want to do to immediately allocate the funds we have received or prepare the funds to achieve the plans we want.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "retreat",
      "created_time": "March 24, 2023, 09:02:56 AM",
      "body": "Quote from: uche6215 on March 22, 2023, 04:26:21 PMFor, I am thinking of opening a business for my wife with the tangible profits I have made from Bitcoin, I would have dropped a picture of my electrum wallet balance but I will not because I don't think is either advisable to do so. I am very happy with what you have got - you managed to get profit from Bitcoin trading and want to help your wife to open a business which is a very good thing. I hope that the business that you will develop will be successful and also that good things will come to me too.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "March 24, 2023, 09:04:36 AM",
      "body": "Compared to what happened with the year 2018, the current situation is in which the price of bitcoin is above average, as 2021 ATH less than 70K. We are now not far from half of that peak.Perhaps the confusion in the monetary policies is what pushed the price to rise in this way, and therefore we will retest the resistance level at 30K several times before it is broken during the next month and a half, but as I mentioned, the situation is abnormal, which makes all scenarios open.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dave1",
      "created_time": "March 24, 2023, 09:34:03 AM",
      "body": "Quote from: hugeblack on March 24, 2023, 09:04:36 AMCompared to what happened with the year 2018, the current situation is in which the price of bitcoin is above average, as 2021 ATH less than 70K. We are now not far from half of that peak.Perhaps the confusion in the monetary policies is what pushed the price to rise in this way, and therefore we will retest the resistance level at 30K several times before it is broken during the next month and a half, but as I mentioned, the situation is abnormal, which makes all scenarios open.I would have to agree about the abnormalities this year as regards to the monetary policies of the US and that's why we have seen this effect on the market right now. We should be still in the bear market, however, it seems that the bulls are coming back and has total of it right now.And maybe we can go back to the price around 2022 again, or at least when we thought that the bull market is over.$30k will be the next resistance and to some extend I'm thinking that if we can get to $35k-$38k, there could be some correction along the way.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DOH!",
      "created_time": "March 24, 2023, 02:09:16 PM",
      "body": "Quote from: Dave1 on March 24, 2023, 09:34:03 AM$30k will be the next resistance and to some extend I'm thinking that if we can get to $35k-$38k, there could be some correction along the way.Well, technical analysis aside, I also think the 30k range is positive, we have had an upbeat March although the trend is not entirely guaranteed and history is not in favor of bitcoin bulls but it did. The power of bitcoin and what it stands for is generating strong confidence again. 30k is really a big range with a lot of pressure, but I guess bitcoin will break it before the correction happens.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husires",
      "created_time": "March 24, 2023, 02:37:44 PM",
      "body": "Why does China need green energy when it can buy it at a low price from Russia or open trade doors with Middle Eastern countries? In the end, the high prices in Europe and the world and China's access to cheaper resources means that it is difficult to compete with Chinese goods and commodities, and therefore it is the first beneficiary.The Biden administration was pushing in the direction of green energy, but the rise in global prices and the lack of guarantee of demand is what will make these investments shy compared to oil investments.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Razmirraz",
      "created_time": "March 24, 2023, 03:26:36 PM",
      "body": "Your mindset on Bitcoin is very clear, buy low and sell high. You plan to take some of the profits to open a business for your wife, of course that's very good and you really hope that the price of bitcoin can increase as soon as possible. It takes time to realize your plan, Bitcoin will not experience an instant surge in a matter of hours especially with the current market conditions. You have to be patient until the return you want comes, never expect more than what you targeted, unpredictable price movements can make you wait longer.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ajiz138",
      "created_time": "March 24, 2023, 04:07:42 PM",
      "body": "Quote from: uche6215 on March 24, 2023, 04:09:59 AMThe price of Bitcoin is still high but the satoshis are getting low I already sell before the price dropped and I am delighted with my profit because it will go a long way for me and even if I decide to start a project today with the profits I made through bitcoin I will still have little but after my project, I will still buy more coins. How do you mean the price of bitcoin is high while the satoshi is weak? isn't that the same?That is in accordance with the target of your plan to sell bitcoin before the price drops and the profits are used for business. I think your pattern is pretty good where to build two businesses in real projects and one business in bitcoin to continue to start accumulating again.After your wife's business is going well, then at least you won't have any more pressure to sell bitcoin in the near future, in the sense that you have to wait for ATH again, I know that everyone's mindset is different in taking profits, it's better to wait some time for bitcoin to rally again.Just keep the bitcoins you have now and build that portfolio again.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o48o",
      "created_time": "March 24, 2023, 11:53:25 PM",
      "body": "Quote from: uche6215 on March 22, 2023, 04:26:21 PM-cut-For, I am thinking of opening a business for my wife with the tangible profits I have made from Bitcoin, I would have dropped a picture of my electrum wallet balance but I will not because I don't think is either advisable to do so. I am pretty sure you don't regret spending money to your family. Especially when you are giving them a change to open a business. No matter where bitcoin goes from here, if you are in profit and have a change to do that, definitely do so. Just don't sell everything for it.And i can't think any situation it would be wise to share your wallet balance. I know it's tempting espcially when you have reason to brag with it. But just remember that's the only upside if you are doing it and there are ton of downsides if you share it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Odusko",
      "created_time": "March 24, 2023, 11:59:41 PM",
      "body": "Quote from: Adbitco on March 22, 2023, 11:59:15 PMUsually this period and this month has shown proven to be bull for bitcoin price, I think most of us here already aware of the sudden increase of bitcoin price. To me I often check coinmarketcap to always be informed of the update, secondly I set my binance account to a notification were I often received updates on a regular basis.The month of match have been an extremely bullish for bitcoin, after the coin touched its basic low around the first week of the month of mach before it suddenly rebounded back to 22k and thereafter pushed to 28,799/at the moment. Abd if you asked me I will say bitcoin has indeed turned a bullish facelook, even though there is still some resistance at this price, I am sure we will move above this price and let's hope the month of April will be as bullish as this month.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}