{
  "id": "topic_5439553",
  "title": "MinoRaiola",
  "author": "MinoRaiola",
  "created_time": "February 12, 2023, 08:13:36 AM",
  "content": "Die Menschen, die Kryptowährungen besitzen tuen etwas sehr schönes. Erinnert euch an ca. mitte 2022, als in der Türkei Kryptowährungen als Zahlungsmittel verboten werden sollen. Die türkische Zentralbank wurde laut. Jetzt mit diesen Spenden, sollen sie sehen das solche Transaktionen sehr schnell und ohne diplomatischen Hürden ankommen. Und noch wichtiger, das Menschen mit Kryptowährungen sofort helfen können. Vitalik Buterin hat 99 ETH gespendet. Binance, Justin Sun, Bitmex, Huobi usw. spenden auch, in dem letzten Bericht steht es drin.Auch NFT´s werden gespendet.https://etherscan.io/nft/0x495f947276749ce646f68ac8c248420045cb7b5e/98520240249060125460791015737371006653629200236616477692844723782048049790977Wer helfen möchte, hier die Adresse von Ahbap Yardım / Earthquake Supporthttps://etherscan.io/address/0xe1935271D1993434A1a59fE08f24891Dc5F398CdBinance:QuoteTime to take care of our users. 🇹🇷❤️#Binance to Airdrop $100 USD in BNB to Users in Turkey Earthquake Regions. Total roughly $5m USD (94m TRY).https://twitter.com/cz_binance/status/1622967238654320640Krypto-Community sagt Türkei Millionenspenden zuQuoteTron-Gründer Justin Sun sagte Spenden in Höhe von zwei Millionen türkischen Lira (etwa 100.000 US-Dollar) für den Wiederaufbau zu. Die Kryptobörse BitGet will eine Million türkische Lira beisteuern. Binance, Gate.io und Bitfinex sondieren derzeit Möglichkeiten, um Hilfen auf den Weg zu bringen. Ob auch Spenden an das vom Bürgerkrieg geplagte Syrien gehen werden, ist aktuell unklar.https://www.btc-echo.de/news/tuerkei-krypto-community-sagt-hilfe-nach-erdbeben-zu-159065/Krypto-Börsen unterstützen die Türkei nach dem ErdbebenQuoteMehrere Krypto-Börsen haben sich gemeldet, um Hilfspakete anzubieten und zu den Hilfsmaßnahmen beizutragen. Zu diesen Börsen gehören Gate.io, Binance, Bitfinex, Bitget, Bybit, Bitget und BitMEX. https://blockzeit.com/de/krypto-borsen-helfen-turkei/",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5439553",
  "comments": [
    {
      "author": "AHOYBRAUSE",
      "created_time": "February 12, 2023, 07:53:36 PM",
      "body": "Wirklich eine super Sache wie die Community da schnell zusammen kam.Vor einigen Tagen habe ich auch eine kleine Crypto-spende abgeschickt, ich hoffe es wird gut genutzt und nicht das wie es leider manchmal so passiert sich Organisationen davon einen Teil abgreifen. Denke aber in diesem Fall sollte es dann auch passen.Hier gab es ja einen super Thread dazu: https://bitcointalk.org/index.php?topic=5438361.0Sollte meine Super Bowl Wette gewinnen geht noch eine kleine Spende raus auf jeden Fall!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mole0815",
      "created_time": "February 13, 2023, 12:42:40 PM",
      "body": "Gute Sache wie in solchen Zeiten alle Möglichkeiten ausgeschöpft werden.Ein dazu passender Artikel: https://www.coinpro.ch/news/tuerkei-erdbeben-krypto-spenden/QuoteTürkischer Rockstar bekommt offizielle Genehmigung für Krypto-SpendenDem 54-jährigen Türkei-Rockstar ist es hierbei gelungen, mit der staatlichen Finanzaufsichtsbehörde MASAK eine Vereinbarung in Sachen Spenden durch Krypto zu erzielen. In einem Beitrag auf Twitter erklärte er, dass sie ein Treffen mit der MASAK hatten. Hierbei erhielt mit seinem Team die Erlaubnis, eine digitale Geldbörse einzurichten. Somit wird es im Zuge der Such- und Rettungsmassnahmen in der Türkei möglich sein, eine Woche lang Stablecoins zu sammeln.QuoteBereits wenige Stunden nach der Bekanntgabe durch Haluk Levent konnte man in den drei Explorern Bscscan, Etherscan und Snowtrace via Nansen Portfolio, welche öffentlich einsehbar sind, feststellen, dass bereits mehr als zwei Millionen US-Dollar gesammelt wurden. Allein die Avalanche Foundation, die von dem türkisch-amerikanischen Emin Gün Sirer geleitet wird, hat eine Million US-Dollar gespendet. Neben Haluk Levent und Ahbap sammelt auch die lokale Börse Paribu Spenden für zwei gemeinnützige Organisationen, die bei der Katastrophenhilfe aktiv sind.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MinoRaiola",
      "created_time": "February 15, 2023, 07:32:41 AM",
      "body": "Quote from: AHOYBRAUSE on February 12, 2023, 07:53:36 PMWirklich eine super Sache wie die Community da schnell zusammen kam.Dadurch wird bestimmt vielen Menschen geholfen und das in einem Land indem es in den letzten 1-2 Jahren viele Probleme zwecks der hohen Inflation gekommen ist. Die Inflation verlangsamt sich, also irgendwann muss ja auch mal ein Ende sein, obwohl an die Zahlen wahrscheinlich keiner mehr glaubt. Im Januar war Nayib Bukele bei Erdogan und sie haben angeblich über Bitcoin gesprochen. Nach den vielen Hilfen aus der Krypto Community, wird Erdogan bestimmt positiver darüber denken und es nicht verteufeln können. Ob Bitcoin in der Türkei auf dem Vormarsch ist, das sehe ich noch nicht.Quote from: mole0815 on February 13, 2023, 12:42:40 PMEin dazu passender Artikel: https://www.coinpro.ch/news/tuerkei-erdbeben-krypto-spenden/Der Artikel wurde wohl gelöscht?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mole0815",
      "created_time": "February 16, 2023, 03:06:59 PM",
      "body": "Quote from: MinoRaiola on February 15, 2023, 07:32:41 AMQuote from: mole0815 on February 13, 2023, 12:42:40 PMEin dazu passender Artikel: https://www.coinpro.ch/news/tuerkei-erdbeben-krypto-spenden/Der Artikel wurde wohl gelöscht?Nein der sollte noch unverändert zur Verfügung stehen.Also bitte gerne nochmal drauf klicken",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}