{
  "id": "topic_5407218",
  "title": "Question:",
  "author": "inthelongrun",
  "created_time": "July 22, 2022, 06:08:20 AM",
  "content": "So Top Rank's Bob Arum failed to persuade George Kambosos to face another opponent before demanding a rematch with undisputed champion Devin Haney. George Kambosos officially exercised his rematch clause against undisputed champ Devin Haney. The planned date is on October 15 at Rod Laver Arena in Melbourne. It is the same venue as the very popular Australian Open (tennis).I think the first fight was very boring and Haney clearly outscored Kambosos. I think it will happen again. But maybe the difference is that Kambosos will let his hands go right after the opening bell. Despite the boring first fight, we better expect another sold-out crowd as this is once in a lifetime experience in Australia. People will still go for sure. It is probably the PPV buys that will take a hit. Unless they both can promote this fight well. Haney is a boring trash-talker though but a mad Kambosos isn't.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5407218",
  "comments": [
    {
      "author": "Yaunfitda",
      "created_time": "July 22, 2022, 09:10:54 AM",
      "body": "Yes, I do agree that it will be the same reason and probably he will school Kambosos again that's why Haney is willing to fight him in Australia.Of course George might say that he will have the plan and will adjust. But Haney's technical ability will be in full display again and I doubt that Kambosos can offset it with his brawling style.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "btc_angela",
      "created_time": "July 22, 2022, 09:14:20 AM",
      "body": "I voted for  Devin Haney Decision.Kambosos might regret his decision on fighting Haney again in his backyard. Maybe he thinks he learn from his mistakes and that he can't get the opportunity. But as we have speculated in the first fight. Kambosos will execute the rematch clause and this is what he did here. Haney again will be the favorite in this fight by a huge lead just like in the first fight. I'm not that excited though, as this might be the repeat of the first fight and the same result.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "aioc",
      "created_time": "July 22, 2022, 09:32:10 AM",
      "body": "Quote from: Yaunfitda on July 22, 2022, 09:10:54 AMYes, I do agree that it will be the same reason and probably he will school Kambosos again that's why Haney is willing to fight him in Australia.Of course George might say that he will have the plan and will adjust. But Haney's technical ability will be in full display again and I doubt that Kambosos can offset it with his brawling style.They say style makes a fight, this is the kind of fight where Haney will have the advantage, fighting an opponent where he has the height and reaches advantage who loves to attack, all Haney will do is just wait for him and impose his advantage, jab and jab and then counter and its easy money for Haney, I don't know what kind of adjustment Kambosos will do, but you have Haney who can shift and makes an adjustment.Well have the same result or it will be a better result for Haney because he already sized him up.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bisdak40",
      "created_time": "July 22, 2022, 11:21:04 AM",
      "body": "I don't know what Team Kambosos have in mind by IMO the result of this rematch will be the same as the first fight, it will still be a boxing clinic for Daven Haney, no offense to Kambosos fans here but his style is not made for the fighting style of Haney. However, if Kambosos is fitted against a brawler like Lopez or Linares he will look good and his chance of winning is high so i wonder why he did not heed to Top Rank's call to fight another boxer and not this rematch.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptomaniac_xxx",
      "created_time": "July 22, 2022, 12:02:05 PM",
      "body": "Oh so they did activated the rematch clause of the match? very interesting move by Kambosos and his team. We can all speculate as to what are the reasons, but with the way he perform in the first fight, he was truly outclass and the skills of Haney is very different to all the fighters he has face like Lopez. And like what most of you have said, the outcome will be the same, Haney by unanimous division and Kambosos will be another \"one hit wonder\", his best win in his career is against Lopez.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "swogerino",
      "created_time": "July 22, 2022, 12:11:41 PM",
      "body": "I didn't vote for anyone because I don't know how it will go.I know that in every sporting event there is the favorite and the underdog but while this can be true in sports like soccer where they fight eleven vs eleven in boxing or direct fight between two persons I almost never bet because at the night of the match we don't know the real physical form of the athletes,thus making it almost impossible to guess it right.The fact that may have a huge dis-balance on odds between one and the other doesn't say anything to me except the bookies belief,how many times we have seen people in tennis lose when they have an odd of 1.10,it is because of the same reason I said above,we can't know for sure the physical form of the contenders.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jating",
      "created_time": "July 22, 2022, 12:34:39 PM",
      "body": "Quote from: swogerino on July 22, 2022, 12:11:41 PMI didn't vote for anyone because I don't know how it will go.I know that in every sporting event there is the favorite and the underdog but while this can be true in sports like soccer where they fight eleven vs eleven in boxing or direct fight between two persons I almost never bet because at the night of the match we don't know the real physical form of the athletes,thus making it almost impossible to guess it right.The fact that may have a huge dis-balance on odds between one and the other doesn't say anything to me except the bookies belief,how many times we have seen people in tennis lose when they have an odd of 1.10,it is because of the same reason I said above,we can't know for sure the physical form of the contenders.Well it's not the first time that this fighters are going to face each other, so at least if you have seen the first fight, you will have an idea on how this fight might be. But you have a point, maybe Kambosos will adjust and make things correct in this rematch.As far as the odds, crypto bookies got it right on the first time, putting Haney as favorite if I'm not mistaken. Both physical form could be equal, they train very hard, it's a matter of how they are going to executed everything in the ring and who has the IQ to adapt.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Daltonik",
      "created_time": "July 22, 2022, 01:52:04 PM",
      "body": "Yes, it seems that George will have to try very hard in the rematch to win over Haney, but do not forget that he still needs to keep his weight, and this also adds problems for Kambosos, but still I hope that the match will be spectacular.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yamifoud",
      "created_time": "July 22, 2022, 01:55:29 PM",
      "body": "My vote is \"Devin Haney Decision\". I think everyone is voting on that outcome and there's no doubt that would happen. Kambasos has the power, but as long as Haney will not allow getting hit, then most likely the outcome will be the same as the previous match.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Maslate",
      "created_time": "July 22, 2022, 02:04:35 PM",
      "body": "It happen earlier than expected, well, I think this is not fun to watch unless Kambosos has something that will surprise Haney and will upset the champion. The first fight was obviously a one-sided fight, Haney schooled Kambosos and own via unanimous decision, so let's see what would be the outcome of the rematch.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dothebeats",
      "created_time": "July 22, 2022, 02:06:28 PM",
      "body": "I go for a Kambosos decision in here.Perhaps many are acknowledging Devin Haney's style against Kambosos' aggressive behavior on the ring, but pretty sure Kambosos and his team already studied Haney's moves and have prepared well enough for this rematch before calling it final. On the first fight, it clearly shows how clueless Kambosos is on what Haney is trying to do, but if you are a trained professional fighter, you will study those moves which led to your loss and use it against your opponent in your next rematch. I do believe that George can pull of a decision win here, but he needs to make sure that he keeps his eye out on those deadly pokes that Haney lets out every so often.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sanitough",
      "created_time": "July 22, 2022, 02:13:31 PM",
      "body": "Quote from: dothebeats on July 22, 2022, 02:06:28 PM On the first fight, it clearly shows how clueless Kambosos is on what Haney is trying to do,....I think Haney has not changed his style, and I'm pretty sure that the team of Kambosos had already studied the fights of Haney before their big fight and yet they had not still prepared for it. There's a big difference because Haney had the quickness and Kambosos could not match that, if only the first fight was a split decision, then I might believe that Kambosos will bounce back.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Questat",
      "created_time": "July 22, 2022, 02:32:19 PM",
      "body": "I understand that there's a rematch clause, however, I think this fight will only make Kambasos look worst because in the first fight, it was like a walk in the park for Haney. Well, I'm not underestimating Kambasos, but Haney is just too strong and too quick for him. If Kambasos will try to be more aggressive, I think this will happen \"Devin Haney KO/TKO\".",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "YOSHIE",
      "created_time": "July 22, 2022, 02:36:33 PM",
      "body": "I've read about Haney vs George yesterday, there are some points that I can take for the rematch between Haney and Kambosos.This match is still pros and cons between Haney and George.1. Haney, still looking for a big fight, Haney's targets are: Lomachenko, ex-tennis.2. provisional results based on the analysis of boxing journalist Dan Rafael, not related parties.3. Kambosos' willingness to bet with Haney.The bottom line: as said by: Haney below.Quotesaid Haney. “Possibly, possibly not. We just gotta see what makes the most sense for me and my team. October, I will be fighting but we don’t know who yet.”If, this topic for a poll, of course I will vote.QuoteA. Devin Haney Decision.I think this boxing match can continue or can be canceled, depending on the decision of Haney.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coin-investor",
      "created_time": "July 22, 2022, 03:26:50 PM",
      "body": "Quote from: inthelongrun on July 22, 2022, 06:08:20 AMSo Top Rank's Bob Arum failed to persuade George Kambosos to face another opponent before demanding a rematch with undisputed champion Devin Haney. George Kambosos officially exercised his rematch clause against undisputed champ Devin Haney. The planned date is on October 15 at Rod Laver Arena in Melbourne. It is the same venue as the very popular Australian Open (tennis).We cannot blame Kambosos he is a fighter and he was not knocked out in their last fight he believes that he can improve and manage to get a win against Haney in their rematch, if there's a chance to win a title again and make money at the same time, why not make a go for it.QuoteI think the first fight was very boring and Haney clearly outscored Kambosos. I think it will happen again. The boxing community shares the same opinion, Haney is an intelligent boxer once he sizes you up anything you do will backfire to you but we cannot take anything away from Kambosos he is a former champion and there's a rematch clauseQuoteBut maybe the difference is that Kambosos will let his hands go right after the opening bell. Despite the boring first fight, we better expect another sold-out crowd as this is once in a lifetime experience in Australia. People will still go for sure. It is probably the PPV buys that will take a hit. Unless they both can promote this fight well. Haney is a boring trash-talker though but a mad Kambosos isn't.Australia will always support their boxers so it will be sold out but if the fight is going to happen elsewhere I don't think they will have success in selling this fight and gate sales will suffer, it's hard to sell a fight that is dominated by another fighter.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dothebeats",
      "created_time": "July 22, 2022, 03:27:36 PM",
      "body": "Quote from: Sanitough on July 22, 2022, 02:13:31 PMQuote from: dothebeats on July 22, 2022, 02:06:28 PM On the first fight, it clearly shows how clueless Kambosos is on what Haney is trying to do,....I think Haney has not changed his style, and I'm pretty sure that the team of Kambosos had already studied the fights of Haney before their big fight and yet they had not still prepared for it. There's a big difference because Haney had the quickness and Kambosos could not match that, if only the first fight was a split decision, then I might believe that Kambosos will bounce back. Sometimes, slow fighters can overcome quick punchers. It just takes that one opening and you win the fight. I'm still not sure about Kambosos' ability to do just that, but I think he's a very capable fighter that can do these feats as long as he trained for it.Then again, as pointed out by YOSHIE above me, this particular match may not push through depending on Haney's decision. He's up for the big guns, and Kambosos may not fit the description for what Haney has been looking for these past few months.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cling18",
      "created_time": "July 22, 2022, 04:01:19 PM",
      "body": "Quote from: Questat on July 22, 2022, 02:32:19 PMI understand that there's a rematch clause, however, I think this fight will only make Kambasos look worst because in the first fight, it was like a walk in the park for Haney. Well, I'm not underestimating Kambasos, but Haney is just too strong and too quick for him. If Kambasos will try to be more aggressive, I think this will happen \"Devin Haney KO/TKO\".If Kambosos will not prepare well for this match, he could possibly face another defeat. He should learn how to counter Haney's strategy and should be more aggressive this time because, to be honest, Haney could easily get wild in the ring. Kambosos must find ways to know the weaknesses of Haney only if he wants to win this rematch. It will be too challenging for Kambosos to face Haney again.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bisdak40",
      "created_time": "July 22, 2022, 09:29:05 PM",
      "body": "Quote from: dothebeats on July 22, 2022, 03:27:36 PMThen again, as pointed out by YOSHIE above me, this particular match may not push through depending on Haney's decision. He's up for the big guns, and Kambosos may not fit the description for what Haney has been looking for these past few months.I think this fight will push because of the rematch clause, it's not Haney's decision, it is Kambosos decision that triggered this rematch. As per report, there were no negotiations this time around as it is stipulated in the contract of the first fight. The only thing that they have to do right now is to finalize the date and venue of the fight.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Baofeng",
      "created_time": "July 22, 2022, 10:49:18 PM",
      "body": "Quote from: bisdak40 on July 22, 2022, 09:29:05 PMQuote from: dothebeats on July 22, 2022, 03:27:36 PMThen again, as pointed out by YOSHIE above me, this particular match may not push through depending on Haney's decision. He's up for the big guns, and Kambosos may not fit the description for what Haney has been looking for these past few months.I think this fight will push because of the rematch clause, it's not Haney's decision, it is Kambosos decision that triggered this rematch. As per report, there were no negotiations this time around as it is stipulated in the contract of the first fight. The only thing that they have to do right now is to finalize the date and venue of the fight. Yes, they will just have to make an official announcement, but according to reliable sources, most likely the fight will happen in October and the same venue, Kambosos hometown of Australia.So probably 2/3 matches, it will be the same results as what the majority is saying. Haney is too good for Kambosos. Devin might not be as entertaining as Ryan Garcia, but he sure do his job in the ring very effectively.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}