{
  "id": "topic_5448663",
  "title": "Disruptivas",
  "author": "Disruptivas",
  "created_time": "April 13, 2023, 11:15:23 AM",
  "content": "''A #web3 é sobre democratização da posse e compartilhamento da receita com o usuário''É comum ouvirmos isso. Mas na prática, o que isso significa?Um novo report da a16z crypto mostrou de forma categórica como em comparação com a web2, os usuários da web3 têm muito mais poder e ganham a maior parte da receita. Segue comparação das taxas de take (% da receita que os proprietários da rede tiram dos usuários):Web2:Meta: 100%Instagram: 100%Twitter: 100%YouTube: 45%Spotify: 30%App store: 30%Steam: 30%Roblox: 25%Web3:OpenSea: 2,5%Uniswap Labs: 0.30%Ethereum Network: 0,06%Um pouco melhor, né? Pra quem quiser ver o report inteiro: https://a16zcrypto.com/content/article/state-of-crypto-report-2023/",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5448663",
  "comments": [
    {
      "author": "bitmover",
      "created_time": "April 13, 2023, 12:43:23 PM",
      "body": "Quote from: Disruptivas on April 13, 2023, 11:15:23 AM Segue comparação das taxas de take (% da receita que os proprietários da rede tiram dos usuários):Web2:Meta: 100%Instagram: 100%Twitter: 100%YouTube: 45%Spotify: 30%App store: 30%Steam: 30%Roblox: 25%Não acho que esses números façam tanto sentido assim.Muitas pessoas tiram muito dinheiro do Instagram aqui no Brasil. Esses números só não entram nessa conta  é um modelo diferente de negócio. Tanto que o Twitter agora resolveu cobrar pelos perfis verificados,  que antes eram grátis O cara simplesmente tira umas fotos boas, faz uns vídeos, vende uns cursos (ou qq outra  coisa) é usa toda a infraestrutura do Instagram gratuitamente para ganhar dinheiro c isso.As vezes o cara gasta um dinheiro c links patrocinados e tal, mas nada comparado a todo acesso à infraestrutura, aplicativo, marketing e tudo mais q ele tem. Imagina a pessoa ter q fazer um app, um front end bacana  100% online e, rápido etc...Quote''A #web3 é sobre democratização da posse e compartilhamento da receita com o usuário''Eu vejo a web3 menos relacionada a receita e mais relacionada a descentralização do controle da rede e das decisões.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Disruptivas",
      "created_time": "April 14, 2023, 05:12:38 PM",
      "body": "Quote from: bitmover on April 13, 2023, 12:43:23 PMNão acho que esses números façam tanto sentido assim.Muitas pessoas tiram muito dinheiro do Instagram aqui no Brasil. Esses números só não entram nessa conta  é um modelo diferente de negócio. Tanto que o Twitter agora resolveu cobrar pelos perfis verificados,  que antes eram grátis Eu vejo a web3 menos relacionada a receita e mais relacionada a descentralização do controle da rede e das decisões.Acho que existem confusões aqui!Fazer dinheiro com o Instagram é diferente do instagram distribuir sua receita com os usuários! Eu posso ser paga para fazer publi no instagram por alguam empresa, devido meu alcance na rede. Mas o pagamento dessa publi não tem nada a ver com a receita do instagram enquanto plataformam. Por exemplo, recentemente o Elon Musk iniciou o debate sobre pagar os produtores de conteudo da plataforma, distribuindo parte da receita feita com anuncios com os respectivos criadores de conteúdo. Isso é disitribuição de receita com usuário. Agora, se  alguém que super se deatava no twitter consegue patrocinio lá outras coisas, ai é outra história bem diferente. Pelo menos eu vejo assim",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "April 15, 2023, 12:24:09 AM",
      "body": "Concordo Disruptivas.Uma coisa é o dinheiro que eu faço com os meus clientes e patrocinadores, usando a plataforma de terceiros (Instagram; Facebook; YouTube; etc). Outra, são essas plataformas me pagarem por eu as usar.Por exemplo no Brasil, tem muito Youtube famoso que ganha todo o mês um cheque que vem YouTube. Já o Meta paga ZERO a quem usa as suas plataformas, mas deve ter muitos ganhando a custa dos patrocínios.EDIT: Só não concordo com essa ideia de ganhos web2 vs web3. Até porque eu ainda não estou convencido dessa web3.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "April 15, 2023, 01:07:21 AM",
      "body": "Quote from: Disruptivas on April 14, 2023, 05:12:38 PMAcho que existem confusões aqui!Fazer dinheiro com o Instagram é diferente do instagram distribuir sua receita com os usuários! Eu posso ser paga para fazer publi no instagram por alguam empresa, devido meu alcance na rede. Mas o pagamento dessa publi não tem nada a ver com a receita do instagram enquanto plataformam. Por exemplo, recentemente o Elon Musk iniciou o debate sobre pagar os produtores de conteudo da plataforma, distribuindo parte da receita feita com anuncios com os respectivos criadores de conteúdo. Isso é disitribuição de receita com usuário. Agora, se  alguém que super se deatava no twitter consegue patrocinio lá outras coisas, ai é outra história bem diferente. Pelo menos eu vejo assimDepende do seu ponto de vista. Existe um certo compartilhamento de benefícios já na web2.De alguma forma, o administrador do fórum bitcointalk divide as rendas do fórum com a gente,  ao permitir que você poste anúncios na sua assinatura  do fórum. Ele poderia simplesmente botar um anúncio dele no espaço.Quando vc faz uma Live ao vivo no Instagram com 10mil pessoas comentando e curtindo simultaneamente,  de graca,  de certa forma vc está usufruindo gratuitamente (para fins comerciais) de uma infraestrutura cara. O Instagram podia cobrar acima de determinado número de views, ou se o post tem fins lucrativos, etc... mas ele permite gratuitamente pq isso faz parte do modelo de negócio dele. Ele está pagando a infra de um influencer pra ele ganhar grana.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Disruptivas",
      "created_time": "April 15, 2023, 06:31:26 PM",
      "body": "Quote from: joker_josue on April 15, 2023, 12:24:09 AMEDIT: Só não concordo com essa ideia de ganhos web2 vs web3. Até porque eu ainda não estou convencido dessa web3.  Como assim, com o que você nao esta convencido, com a existência da web3 ou com a forma de se pensar a geração e distribuição de riqueza entre as duas ?Quote from: bitmover on April 15, 2023, 01:07:21 AMDepende do seu ponto de vista. Existe um certo compartilhamento de benefícios já na web2.De alguma forma, o administrador do fórum bitcointalk divide as rendas do fórum com a gente,  ao permitir que você poste anúncios na sua assinatura  do fórum. Ele poderia simplesmente botar um anúncio dele no espaço.Quando vc faz uma Live ao vivo no Instagram com 10mil pessoas comentando e curtindo simultaneamente,  de graca,  de certa forma vc está usufruindo gratuitamente (para fins comerciais) de uma infraestrutura cara. O Instagram podia cobrar acima de determinado número de views, ou se o post tem fins lucrativos, etc... mas ele permite gratuitamente pq isso faz parte do modelo de negócio dele. Ele está pagando a infra de um influencer pra ele ganhar grana.Mas acho que o forum e mentalidade dos gerenciadores do forum representa a web3 e nao a web2. Se estivessemos em um forum com a mentalidade e estrutura dos sistemas tradicionais, muito provavelmente o  que teriamos seria esse ''monopolio'' dos anúncios para geração de renda para ''os donos do fórum', esse e exatamente o ponto da diferenca salientada nas comparações.Ai chegamos naquele ponto super comum '' se vocë nao esta pagando, provavelmente voce é o produto''. Nao é de graça, cada usuario da atencao, e produz conteudo de graca o tempo todo pra plataforma e nao recebe nada deles. O que existe ~e a chance de monetizar com outras empresas",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "April 16, 2023, 08:13:13 AM",
      "body": "Quote from: Disruptivas on April 15, 2023, 06:31:26 PMComo assim, com o que você nao esta convencido, com a existência da web3 ou com a forma de se pensar a geração e distribuição de riqueza entre as duas ?Que já estamos na web3. Ainda não senti mudanças generalizadas para já estarmos na web3 ou que essas mudanças de atuação façam parte da futura web3. Nem sei se essa web3 vai realmente ser como é a ideia transmitida.Mas, isto é mais a minha sensibilidade o perspetiva que tenho das coisas.As vezes parece que esse termo é usado apenas por uma questão de marketing, no sentido de querer dizer \"a minha empresa é muito a frente\", mas depois não é assim \"tão a frente\".Enfim, posso estar totalmente errado, mas é o que sinto sobre esse termo. Acho o termo mais conceptual do que factual.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "April 16, 2023, 11:18:26 AM",
      "body": "Quote from: Disruptivas on April 15, 2023, 06:31:26 PMMas acho que o forum e mentalidade dos gerenciadores do forum representa a web3 e nao a web2. Se estivessemos em um forum com a mentalidade e estrutura dos sistemas tradicionais, muito provavelmente o  que teriamos seria esse ''monopolio'' dos anúncios para geração de renda para ''os donos do fórum', esse e exatamente o ponto da diferenca salientada nas comparações.Esse forum é totalmente centralizado, ele nao tem absolutamente nenhuma característica da web3 , etheereum, blockchain , etc na minha opinião.O modelo de negócio é o mesmo do quora por exemplo. Se você postar lá você tb vai ganhar dinheiro. Por mais q o theymos crie algumas regras para dividir alguns poderes(staff, dt por exemplo) ele pode mudar elas a qualquer momento. Ele tem a chave de tudo aqui.Eu diria que aqui é ainda mais centralizado do que os app da Meta, pois não tem nem acionistas nem diretores etc...A única inovação real que temos aqui é o btc, que permeia as discussões e os membros. Afinal  esse que é o produto aqui.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Paredao",
      "created_time": "April 16, 2023, 06:18:54 PM",
      "body": "Quote from: bitmover on April 16, 2023, 11:18:26 AMEsse forum é totalmente centralizado, ele nao tem absolutamente nenhuma característica da web3 , etheereum, blockchain , etc na minha opinião.O modelo de negócio é o mesmo do quora por exemplo. Se você postar lá você tb vai ganhar dinheiro. Por mais q o theymos crie algumas regras para dividir alguns poderes(staff, dt por exemplo) ele pode mudar elas a qualquer momento. Ele tem a chave de tudo aqui.Eu diria que aqui é ainda mais centralizado do que os app da Meta, pois não tem nem acionistas nem diretores etc...A única inovação real que temos aqui é o btc, que permeia as discussões e os membros. Afinal  esse que é o produto aqui.Já percebi isso há muito tempo. Eu não falo nada, pois devemos \"dançar conforme a música\" e darmos por satisfeitos de ainda termos um lugar para expor nossas ideias de alguma forma livre. Nosso Moderador é um cara super legal e não implica com as coisas que postamos.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Disruptivas",
      "created_time": "April 18, 2023, 02:50:18 PM",
      "body": "Talvez a questão aqui seja de nomenclatura. Mas eu considero que o fórum '' é web3''. Para mim, a web3 representa um conjunto amplo de fenômenos tecnológicos e sociais que quebram a barreira entre os ''donos das plataforma'' e os ''usuários/produtores de conteúdo da plataforma''. Aqui no fórum, por exemplo, existem as METAs discussões, onde qualquer usuário poderia submeter novas ideias, e que como citaram, apesar de ter algumas regras, existe uma super liberdade pra que cada aba seja regida de uma forma diferente, todo mundo pode criar novas idieas ou sugerir que outras coisas não ocorram mais. Pra mim isso é web3.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "April 18, 2023, 04:15:59 PM",
      "body": "Quote from: Disruptivas on April 18, 2023, 02:50:18 PMTalvez a questão aqui seja de nomenclatura. Mas eu considero que o fórum '' é web3''. ~~ Pra mim isso é web3.É por causa disso mesmo é que ainda não considero que estamos na web3.Podemos até estar a passar pela fase de transição, mas como ainda não é algo claro e carece muito da interpretação de cada um. E quando assim é, fica difícil (pelo menos para mim) tornar a coisa clara.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Disruptivas",
      "created_time": "April 19, 2023, 12:36:32 PM",
      "body": "Quote from: joker_josue on April 18, 2023, 04:15:59 PMQuote from: Disruptivas on April 18, 2023, 02:50:18 PMTalvez a questão aqui seja de nomenclatura. Mas eu considero que o fórum '' é web3''. ~~ Pra mim isso é web3.É por causa disso mesmo é que ainda não considero que estamos na web3.Podemos até estar a passar pela fase de transição, mas como ainda não é algo claro e carece muito da interpretação de cada um. E quando assim é, fica difícil (pelo menos para mim) tornar a coisa clara.Acho que se você tiver uma visão binária, em que existe apenas '' estamos'' e ''não estamos pois estamos em transição'', talvez nunca estejamos. As coisas só ficam claras quando os eventos já passaram e uma das narrativas se estabelece como verdadeira. Mas quando esse momento chega, acho que quase nem vale a pena falar sobre ela, já foi ''cristalizado'' o evento. É o que eu sinto. Eu não quero dizer que EXATAMOS TODOS 100% NA WEB3 e tudo é descentralizado. Acho que nunca vai ser. Mas acho importante reconhecer os elementos caracteristicos dessa passagem.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "April 19, 2023, 02:26:17 PM",
      "body": "A questão nem se prende tanto ao ser ou não ser. Mas, sim em tudo o que esta envolvido.A sensação que tenho é que é tudo ainda muito conceptual e pouco pratico para o dia a dia. Mas, talvez seja eu que ainda não esteja envolvido nesse tipo de projetos ao ponto de mudar de ideias.PS: Você depois nunca mais disse nada sobre aquela questão do Excel.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "alegotardo",
      "created_time": "April 20, 2023, 03:18:47 AM",
      "body": "Quote from: bitmover on April 16, 2023, 11:18:26 AMPor mais q o theymos crie algumas regras para dividir alguns poderes(staff, dt por exemplo) ele pode mudar elas a qualquer momento. Ele tem a chave de tudo aqui.Nesse sentido, por acaso já houve alguma discussão para mudar isso?Não que eu esteja questionando a administração, mas creio que seja preocupação de toda comunidade sobre a falta de segurança que se tem quando deixamos todo o poder do fórum centralizado.Me digam... oque iria ocorrer caso o Theymos ou outro ADM sumisse ou simplesmente decida fechar o fórum por motivo qualquer?Sei que já existem alternativas e muitas outras surgiriam, mas nada seria igual ao que é o bitcointalk.org",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "April 20, 2023, 06:58:25 AM",
      "body": "Quote from: alegotardo on April 20, 2023, 03:18:47 AMMe digam... oque iria ocorrer caso o Theymos ou outro ADM sumisse ou simplesmente decida fechar o fórum por motivo qualquer?Sei que já existem alternativas e muitas outras surgiriam, mas nada seria igual ao que é o bitcointalk.org Não existe muita coisa que a comunidade possa fazer, o forum esta nas mãos do Theymos e só saem das suas mãos se ele quiser.Eu acho que neste momento, ele já não irá simplesmente fechar, essa fase já passou. O Theymos esta aqui desde o inicio, logo acaba por seguir os valores que levaram a existência do Bitcoin. E com todo o bitcoin que ele já tem, se quisesse fechar e levar o dinheiro doado ao fórum, levava e já o teria feito. E até ao que parece ele já preparou as coisas para o caso de ele falecer o fórum continuar (lembro de ter lido algo a respeito).O facto de ele continuar ativo e ir fazendo alguns ajustes ao forum, provam que ele ainda quer que o forum continue a ser aquilo que sempre foi.As vezes, mesmo que possa ser difícil, temos de acreditar e confiar nas pessoas. Acho que este é um desses casos.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "April 20, 2023, 12:14:46 PM",
      "body": "Quote from: alegotardo on April 20, 2023, 03:18:47 AMQuote from: bitmover on April 16, 2023, 11:18:26 AMPor mais q o theymos crie algumas regras para dividir alguns poderes(staff, dt por exemplo) ele pode mudar elas a qualquer momento. Ele tem a chave de tudo aqui.Nesse sentido, por acaso já houve alguma discussão para mudar isso?Não que eu esteja questionando a administração, mas creio que seja preocupação de toda comunidade sobre a falta de segurança que se tem quando deixamos todo o poder do fórum centralizado.Acho que está havendo uma confusão aqui.Isso aqui é web2Web2 não é uma coisa feia nem antiquada.  Tudo o que fazemos na internet é web2A web3 ainda não existe. Nem sabemos se a terceira versão da web será descentralizada ou se será baseada em AI (outro caminho possível)Esse forum tem um dono, e esse dono é o theymos.Você recebe muito desse fórum, e você não paga nenhuma contaQuanto vc acha que custa de infraestrutura para manter isso online? Esse é um dos sites mais acessados da Internet. O tanto de custo com desenvolvimento e com a administração,  isso também tem custo Você queria receber um boleto em casa todo mês? Pagar pra postar?O theymos passou um risco ao decidir administrar isso. Em algum momento eles botou dinheiro e tempo aqui, ee poderia não ter dado retorno.  Mas deu, e muito. Agora querer dividir os lucros é fácil né.O modelo de negócio desse fórum funciona  O forum é útil e da lucro para o dono dele e para milhares de pessoas que o utilizam.  Isso é bastante já.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}