{
  "id": "topic_5413354",
  "title": "Snowshow",
  "author": "Snowshow",
  "created_time": "September 13, 2022, 04:12:45 AMLast edit: September 15, 2022, 07:30:50 AM by Snowshow",
  "content": "AbstractEconomy is a pretty simple concept - it is a system for producing and exchanging resources. Money is also a simple concept - it is a specific type of resource that has features like durability, portability, divisibility, uniformity, and acceptability. In 2008, a person or group under the identity Satoshi Nakamoto, allegedly invented a payment system that exchanges its own  money in the form of electronic coins, generally known as bitcoins. Here, we will use Nakamoto's own definition of coins in order to demonstrate that they invented no such system. Instead, they invented a payment simulator. In this simulator, cryptographically signed numeric attributions are recorded into a distributed database called \"blockchain\". This mimics the recording of quantity that occurs when resources are produced or exchanged through economic activity. Given that Nakamoto's invention neither produces nor exchanges resources, this makes it a simulator, a Monopoly-style game, and not something that relates to real money or economy.Here you can read the article: https://btcsim.wordpress.com/",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5413354",
  "comments": [
    {
      "author": "davis196",
      "created_time": "September 13, 2022, 05:19:58 AM",
      "body": "Bitcoin mining consumes energy and this energy has value. This value is being transferred into the value of Bitcoin.If the Bitcoin blockchain was a simulator, then what's the point of wasting so much electricity for such simulation?We could simply use the altcoin blockchains, which don't use as much electricity as the BTC blockchain or we could create a transaction simulator, which doesn't consume any electricity at all.This is just another \"Bitcoin isn't backed by anything real, so Bitcoin doesn't have value\" type of FUD articles. Nothing new here.The anti-Bitcoiners must come up with new and interesting concepts and ideas, instead of repeating the same old FUD.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "September 13, 2022, 05:24:41 AM",
      "body": "Quote from: Snowshow on September 13, 2022, 04:12:45 AMHere, we will use the definition of coins given by Nakamoto themselves in order to demonstrate that they invented no such system.You fail to understand that the implementation of Bitcoin is not the same as described in the whitepaper. For example, you say it's not backed by anything. The whitepaper does not mention this, but the coins are backed by a corresponding amount of mining hashpower.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "September 13, 2022, 06:27:03 AM",
      "body": "Quote from: Snowshow on September 13, 2022, 04:12:45 AMMoney is also a simple concept – it is a specific type of resource that has features like durability, portability, divisibility, uniformity, and acceptability.That's the definition of currency not money. The main characteristic of money is having a fixed value which currencies (like fiat) do NOT have.QuoteInstead, they invented an online transaction simulator.There is no simulation in bitcoin. It is real transactions transferring real values between individuals without a third party involved.QuoteIn this simulator, cryptographically signed numeric attributions are recorded into a distributed database called “blockchain”.#technobabbleQuoteHere you can read the article: https...btcsim.wordpress[.]comWhy would anyone want to waste more time on this nonsense?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Snowshow",
      "created_time": "September 13, 2022, 07:04:52 AM",
      "body": "Quote from: davis196 on September 13, 2022, 05:19:58 AMBitcoin mining consumes energy and this energy has value. This value is being transferred into the value of Bitcoin.If the Bitcoin blockchain was a simulator, then what's the point of wasting so much electricity for such simulation?We could simply use the altcoin blockchains, which don't use as much electricity as the BTC blockchain or we could create a transaction simulator, which doesn't consume any electricity at all.This is just another \"Bitcoin isn't backed by anything real, so Bitcoin doesn't have value\" type of FUD articles. Nothing new here.The anti-Bitcoiners must come up with new and interesting concepts and ideas, instead of repeating the same old FUD. There's no Bitcoin mining. There's energy spending for verifying numeric attributions before recording them into the blockchain. Sure, energy has value. But you're not buying energy when joining the Nakamoto simulator. You're just participating in a simulation where the recording of numeric values attributed to your address mimics the recording of real transactions.Quote from: NotATether on September 13, 2022, 05:24:41 AMQuote from: Snowshow on September 13, 2022, 04:12:45 AMHere, we will use the definition of coins given by Nakamoto themselves in order to demonstrate that they invented no such system.You fail to understand that the implementation of Bitcoin is not the same as described in the whitepaper. For example, you say it's not backed by anything. The whitepaper does not mention this, but the coins are backed by a corresponding amount of mining hashpower.I am not disputing the implementation of Nakamoto's simulator. I am just showing why Bitcoin - a chain of digital signatures, is freely available to everyone, and why it is just a component of the simulator.Quote from: pooya87 on September 13, 2022, 06:27:03 AMQuote from: Snowshow on September 13, 2022, 04:12:45 AMMoney is also a simple concept – it is a specific type of resource that has features like durability, portability, divisibility, uniformity, and acceptability.That's the definition of currency not money. The main characteristic of money is having a fixed value which currencies (like fiat) do NOT have.QuoteInstead, they invented an online transaction simulator.There is no simulation in bitcoin. It is real transactions transferring real values between individuals without a third party involved.QuoteIn this simulator, cryptographically signed numeric attributions are recorded into a distributed database called “blockchain”.#technobabbleQuoteHere you can read the article: https...btcsim.wordpress[.]comWhy would anyone want to waste more time on this nonsense?Currency is the record of resource quantity owned by currency holder. Fiat currency is the record of debt quantity. Bitcoin is a chain of numeric attributions -  a component of a simulator that mimics fiat currencies by recording numeric attributions to the blockchain. Hence bitcoin cannot be a currency by definition. It's a component of the Nakamoto simulator.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Emmanuelex",
      "created_time": "September 13, 2022, 07:12:35 AM",
      "body": "Quote from: Snowshow on September 13, 2022, 04:12:45 AMGiven that Nakamoto’s invention has no resources to exchange, this makes it a simulator, a Monopoly-style game, and not something that relates to real money or economy.I’m not really good with economics, maybe someone can help explain to me, but from my own understanding- everything is either backed by debt or belief of the people that such asset has a value right? Even the fiat we are all using today has value because we all believe that it does right? Which is why the government can devalue it at anytime. So why do people have problem with Bitcoin? And moreover it’s not like bitcoin is something that anyone can easily get, only few people can afford what it takes to mine Bitcoin, which is why it is very scarce , so I don’t see anything wrong with the value or price. If it was something that anyone can easily get, then maybe we can talk about it not truly deserving the value that is being tagged on it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "September 13, 2022, 08:06:11 AM",
      "body": "Quote from: Snowshow on September 13, 2022, 07:04:52 AMQuote from: NotATether on September 13, 2022, 05:24:41 AMQuote from: Snowshow on September 13, 2022, 04:12:45 AMHere, we will use the definition of coins given by Nakamoto themselves in order to demonstrate that they invented no such system.You fail to understand that the implementation of Bitcoin is not the same as described in the whitepaper. For example, you say it's not backed by anything. The whitepaper does not mention this, but the coins are backed by a corresponding amount of mining hashpower.I am not disputing the implementation of Nakamoto's simulator. I am just showing why Bitcoin - a chain of digital signatures, is freely available to everyone, and why it is just a component of the simulator.The main issue with that (as many people have pointed out to you in previous threads) is that Bitcoin is not a simulator. Bitcoin doesn't have the required parts that would make it a simulator. For instance - all simulators are deterministic - for a given input, you can get the same result over and over again. This is not true for Bitcoin because the from a probability point of view, the miner that successfully mines a block is picked at random from the set of miners.If it is not deterministic, it cannot be a simulator in the first place (if it was, then it could not be money).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Snowshow",
      "created_time": "September 13, 2022, 11:25:59 AMLast edit: September 13, 2022, 11:45:57 AM by Snowshow",
      "body": "Quote from: Emmanuelex on September 13, 2022, 07:12:35 AMQuote from: Snowshow on September 13, 2022, 04:12:45 AMGiven that Nakamoto’s invention has no resources to exchange, this makes it a simulator, a Monopoly-style game, and not something that relates to real money or economy.I’m not really good with economics, maybe someone can help explain to me, but from my own understanding- everything is either backed by debt or belief of the people that such asset has a value right? Even the fiat we are all using today has value because we all believe that it does right? Which is why the government can devalue it at anytime. So why do people have problem with Bitcoin? And moreover it’s not like bitcoin is something that anyone can easily get, only few people can afford what it takes to mine Bitcoin, which is why it is very scarce , so I don’t see anything wrong with the value or price. If it was something that anyone can easily get, then maybe we can talk about it not truly deserving the value that is being tagged on it.Economy is about producing and exchanging resources. It has absolutely nothing to do with believing. A belief is a state of mind of a person.The banking system produces and exchanges debt - a resource, with quantity of that resource being recorded with deposits and banknotes. You can see in the article more details.The Nakamoto simulator attributes numeric values to the addresses and records them into the blockchain in order to mimic the recording that banks use. In that way an exchange or a transaction is simulated. In other words, nothing was exchanged or transferred, but the record creates the illusion it was. Bitcoin is just a chain of digital signatures recorded on the blockchain. You can get it for free. Together with other blockchain components and open-source software and protocols it constitutes the Nakamoto simulator.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "September 13, 2022, 11:49:57 AM",
      "body": "Quote from: Emmanuelex on September 13, 2022, 07:12:35 AMI’m not really good with economics, maybe someone can help explain to me, but from my own understanding- everything is either backed by debt or belief of the people that such asset has a value right? nogovernment modern fiat is pushed to be that belief because they didnt want government fiat to be backed by a real underyling thing of value. ..imagine a medium of exchange as not just a price.. but a sandwich of different amounts- - - - - - - most willing to pay before disagreement/dis-interest   ..          ....    ..    ..     price (speculative market)         ..- - - - - - -underlying valuethe 'most' and 'underlying' are the support and resistant walls where no one wants to sell below or buy abovethe price is the filling in the middle that changes depending on peoples personal desires/demands/ personal choices and barterwhen the price is low its NEAR VALUE when the price is high its at a premium and over valuedbitcoins are created at a cost(mining) you cant just create bitcoin out of thin air for free. it actually costs electric and time to create bitcoinas coins move between people where someone sells a coin. he sells it and the new buy then has their acquisition cost.. the paradigm of mining cost and acquisition costs push up the underlying value amount progressively.. which then affect the window of the speculative market above thatyes the price within the window is not fixed and is based on different peoples agreement. but that market window of possible prices.. sit WITHIN the window. which has a base underlying of value propping it up where the lowest \"price\" possible is non zero",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Snowshow",
      "created_time": "September 14, 2022, 04:59:27 AMLast edit: September 14, 2022, 07:24:01 AM by Snowshow",
      "body": "Quote from: NotATether on September 13, 2022, 08:06:11 AMQuote from: Snowshow on September 13, 2022, 07:04:52 AMQuote from: NotATether on September 13, 2022, 05:24:41 AMQuote from: Snowshow on September 13, 2022, 04:12:45 AMHere, we will use the definition of coins given by Nakamoto themselves in order to demonstrate that they invented no such system.You fail to understand that the implementation of Bitcoin is not the same as described in the whitepaper. For example, you say it's not backed by anything. The whitepaper does not mention this, but the coins are backed by a corresponding amount of mining hashpower.I am not disputing the implementation of Nakamoto's simulator. I am just showing why Bitcoin - a chain of digital signatures, is freely available to everyone, and why it is just a component of the simulator.The main issue with that (as many people have pointed out to you in previous threads) is that Bitcoin is not a simulator. Bitcoin doesn't have the required parts that would make it a simulator. For instance - all simulators are deterministic - for a given input, you can get the same result over and over again. This is not true for Bitcoin because the from a probability point of view, the miner that successfully mines a block is picked at random from the set of miners.If it is not deterministic, it cannot be a simulator in the first place (if it was, then it could not be money). Hahaha. You have a big imagination. You cannot change reality by playing semantics. It's a simulator in a sense that by mimicking the recording process, it simulates the environment where resources are produced and exchanged. Because in the majority of such exchanges numeric values are used to count the quantity of transferred resource units. Nakamoto's system is not the environment where resources are produced and then exchanged. However, by using and recording numeric values, the illusion of such environment is created.  This makes Nakamoto's invention a simulator. And this has nothing to do with some determinism - whatever you meant by this abstract concept.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "September 14, 2022, 07:23:51 AM",
      "body": "Quote from: Snowshow on September 14, 2022, 04:59:27 AMQuote from: NotATether on September 13, 2022, 08:06:11 AMThe main issue with that (as many people have pointed out to you in previous threads) is that Bitcoin is not a simulator. Bitcoin doesn't have the required parts that would make it a simulator. For instance - all simulators are deterministic - for a given input, you can get the same result over and over again. This is not true for Bitcoin because the from a probability point of view, the miner that successfully mines a block is picked at random from the set of miners.If it is not deterministic, it cannot be a simulator in the first place (if it was, then it could not be money). Hahaha. You have a big imagination. You cannot change reality by playing semantics.It's not imagination. It's reality. It's your choice whether you want to believe it or cry wolf.Quote from: Snowshow on September 14, 2022, 04:59:27 AMIt's a simulator in a sense that by mimicking the recording process, it simulates the environment where resources are produced and exchanged. Because in the majority of such exchanges numeric values are used to count the quantity of transferred resource units. Nakamoto's system is not the environment where resources are produced and then exchanged. However, by using and recording numeric values, the illusion of such environment is created.  That makes Nakamoto's invention a simulator. And this has nothing to do with some determinism - whatever you meant by this abstract concept. Yeah well those \"numeric values\" are backed by mining power.If all miners everywhere stopped mining then the asset backing bitcoin will disappear and the price will sink to zero. But since more miners are joining, the amount of backing asset increases, which supports higher Bitcoin processes. This is not an activity you can just plug into a supercomputer with current time and space capacity and \"simulate\" it, whatever weird meaning you have for that.Right here, you have in the Bitcoin network an \"environment where resources are produced and exchanged\". You can stop spreading disinformation now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Snowshow",
      "created_time": "September 14, 2022, 11:34:09 AM",
      "body": "Quote from: NotATether on September 14, 2022, 07:23:51 AMYeah well those \"numeric values\" are backed by mining power.If all miners everywhere stopped mining then the asset backing bitcoin will disappear and the price will sink to zero. But since more miners are joining, the amount of backing asset increases, which supports higher Bitcoin processes. This is not an activity you can just plug into a supercomputer with current time and space capacity and \"simulate\" it, whatever weird meaning you have for that.Right here, you have in the Bitcoin network an \"environment where resources are produced and exchanged\". You can stop spreading disinformation now.You got it all wrong. Let me help you understand. Power or energy is spent on verifying numeric attributions There's no some energy stored somewhere for bitcoin holders to access and use. All the energy invested by miners is spent for a chain of digitally signed numeric attributions to grow. That chain is a record of simulated transactions with electronic coins. Coins are simulated via numeric attributions. They don't exist in reality Just like the items in the Monopoly game.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "September 14, 2022, 11:59:27 AM",
      "body": "Quote from: Snowshow on September 14, 2022, 11:34:09 AMYou got it all wrong. Let me help you understand. Power or energy is spent on verifying numeric attributions There's no some energy stored somewhere for bitcoin holders to access and use. All the energy invested by miners is spent for a chain of digitally signed numeric attributions to grow. That chain is a record of simulated transactions with electronic coins. Coins are simulated via numeric attributions. They don't exist in reality Just like the items in the Monopoly game.Unfortunately for you, Satoshi did not code Bitcoin as a monopoly game, else it would've had OpenGL as well  Power and energy is not spent on \"verifying numeric attributions\", it is spent finding a solution to a cryptographic challenge to mine a block. This is precisely what Nakamoto was talking about in the whitepaper so I don't see what problem you have about this.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "September 14, 2022, 02:29:46 PMLast edit: September 14, 2022, 02:48:42 PM by franky1",
      "body": "well under snowshows very own definitionssnowshow's messages hold no value and are meaningless because the amount of energy and time he put into creating characters on a page have no meaning or value. (correct snowshow?)his messages stored on this forum are just random characters on a page with no value or meaning.(correct snowshow?)if so, then.. bye snowshow. you are just wasting your time and energy, (by your own admission, right?)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "September 14, 2022, 02:40:32 PM",
      "body": "Quote from: Snowshow on September 14, 2022, 11:34:09 AMYou got it all wrong. Let me help you understand. Power or energy is spent on verifying numeric attributions There's no some energy stored somewhere1. yes energy is \"spent\".. not saved2. bitcoin is not about trading electric batteries with potential energy to power other electricsthe spent energy has a cost. and people trade for what is created(mined coins) when that energy is spent/used.  because they want the convenience to have coins but without the inconvenience of having to mine them. so they buy the coins from people who have coins (whom had costs involved in their acquisition of the coins). ..analogy:when a farmer pays for land and buys cows to graze on it to create milk. ..and then those cows actually do create the milk. that milk is not \"stored land\". .. its milkthat milk has the costs of the land and the cows. people want milk because it has a benefit for them. but those that want milk dont want to become farmers. so they just buy milk at a fair price that should atleast covers the farmers coststhe now milk owner does not now own \"land\" nor want to own land.. he owns milk that milk had a underlying cost in its production.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Snowshow",
      "created_time": "September 14, 2022, 05:26:01 PM",
      "body": "Quote from: NotATether on September 14, 2022, 11:59:27 AMQuote from: Snowshow on September 14, 2022, 11:34:09 AMYou got it all wrong. Let me help you understand. Power or energy is spent on verifying numeric attributions There's no some energy stored somewhere for bitcoin holders to access and use. All the energy invested by miners is spent for a chain of digitally signed numeric attributions to grow. That chain is a record of simulated transactions with electronic coins. Coins are simulated via numeric attributions. They don't exist in reality Just like the items in the Monopoly game.Unfortunately for you, Satoshi did not code Bitcoin as a monopoly game, else it would've had OpenGL as well  Power and energy is not spent on \"verifying numeric attributions\", it is spent finding a solution to a cryptographic challenge to mine a block. This is precisely what Nakamoto was talking about in the whitepaper so I don't see what problem you have about this. Whatever, energy is spent for manipulation with numeric attributions. I have problem about your claim that numeric values are backed by electricity. If numeric values attributed to a person are \"backed up\", than there must be some resource counted with those values in the ownership of that person.Quote from: franky1 on September 14, 2022, 02:29:46 PMwell under snowshows very own definitionssnowshow's messages hold no value and are meaningless because the amount of energy and time he put into creating characters on a page have no meaning or value. (correct snowshow?)his messages stored on this forum are just random characters on a page with no value or meaning.(correct snowshow?)if so, then.. bye snowshow. you are just wasting your time and energy, (by your own admission, right?) Not my definitions. Bitcoin has value, to someone I guess. But bitcoin is freely available to everyone. It's a chain of digital signatures - according to Nakamoto's own definition. You can have the chain by downloading the blockchain. Quote from: franky1 on September 14, 2022, 02:40:32 PMQuote from: Snowshow on September 14, 2022, 11:34:09 AMYou got it all wrong. Let me help you understand. Power or energy is spent on verifying numeric attributions There's no some energy stored somewhere1. yes energy is \"spent\".. not saved2. bitcoin is not about trading electric batteries with potential energy to power other electricsthe spent energy has a cost. and people trade for what is created(mined coins) when that energy is spent/used.  because they want the convenience to have coins but without the inconvenience of having to mine them. so they buy the coins from people who have coins (whom had costs involved in their acquisition of the coins). ..analogy:when a farmer pays for land and buys cows to graze on it to create milk. ..and then those cows actually do create the milk. that milk is not \"stored land\". .. its milkthat milk has the costs of the land and the cows. people want milk because it has a benefit for them. but those that want milk dont want to become farmers. so they just buy milk at a fair price that should atleast covers the farmers coststhe now milk owner does not now own \"land\" nor want to own land.. he owns milk that milk had a underlying cost in its production. Yes, milk is a resource. But what that has to do with the Nakamoto simulator? This creation simulates transfer of resources by mimicking farmers when they record quantities of transferred milk.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "September 14, 2022, 05:49:40 PM",
      "body": "miners have a cost to mine blocks.. but their reward is not the blockchain. they are not trying to sell the blockchaintheir reward is the coin produced within the block they worked onfarmers have a cost to farm cattle pastures.. but their reward is not the cattle pastures. they are not trying to sell the farmlandtheir reward is the milk produced within the farm they worked onpart of mining is collating transactions of proof or transfer of coins from one owner to anotherpart of farming is collating the accounts of milk transports to retailers and customerssomeone buying is not trying to buy the blockchain or the block. they are buying the coinsomeone buying is not trying to buy the land or milk delivery report. they are buying the milkcoin holders do not want to sell their coin at a lossmilk holders do not want to sell their milk at a loss",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Snowshow",
      "created_time": "September 14, 2022, 06:13:50 PM",
      "body": "Quote from: franky1 on September 14, 2022, 05:49:40 PMminers have a cost to mine blocks.. but their reward is not the blockchain. they are not trying to sell the blockchaintheir reward is the coin produced within the block they worked onfarmers have a cost to farm cattle pastures.. but their reward is not the cattle pastures. they are not trying to sell the farmlandtheir reward is the milk produced within the farm they worked onpart of mining is collating transactions of proof or transfer of coins from one owner to anotherpart of farming is collating the accounts of milk transports to retailers and customerssomeone buying is not trying to buy the blockchain or the block. they are buying the coinsomeone buying is not trying to buy the land or milk delivery report. they are buying the milkcoin holders do not want to sell their coin at a lossmilk holders do not want to sell their milk at a loss Nakamoto: \"we define an electronic coin as a chain of digital signatures\". So, the reward to the miners is the chain. I can have the chain for free by downloading the blockchain. There's nothing in the system except the blockchain together with open-source software and protocols. All that is freely available to everyone. Some magical, scarce coins, some digital milk or gold, whatever, with units pagged at 21 million are not real. Their production or exchange is simulated via numeric attributions. Check the article for details. I hope this helps.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "savetheFORUM",
      "created_time": "September 15, 2022, 06:44:03 PM",
      "body": "Quote from: NotATether on September 14, 2022, 07:23:51 AMIf all miners everywhere stopped mining then the asset backing bitcoin will disappear and the price will sink to zero. But since more miners are joining, the amount of backing asset increases, which supports higher Bitcoin processes. This is not an activity you can just plug into a supercomputer with current time and space capacity and \"simulate\" it, whatever weird meaning you have for that.Right here, you have in the Bitcoin network an \"environment where resources are produced and exchanged\". You can stop spreading disinformation now.That's not how it works, if all miners stopped all at once the trust sector of it would stop but then people with computers would start using it again because there is a money to be made to keep it safe. Plus there is no connection between selling and stop mining, which means that just because miners stopped doesn't mean that we are going to end up with people selling.I can take myself for example, I own bitcoins and I have a bit of money and I can guarantee you that if miners stop, I wouldn't be selling and if people start selling then I would start buying as well, many people think the way I do and that means the price could not be zero for sure.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "September 15, 2022, 07:36:32 PM",
      "body": "Quote from: Snowshow on September 14, 2022, 06:13:50 PMNakamoto: \"we define an electronic coin as a chain of digital signatures\". [/b]So, the reward to the miners is the chain. I can have the chain for free by downloading the blockchain. There's nothing in the system except the blockchain together with open-source software and protocols. All that is freely available to everyone. Some magical, scarce coins, some digital milk or gold, whatever, with units pagged at 21 million are not real. Their production or exchange is simulated via numeric attributions. Check the article for details. I hope this helps. yes bitcoin is code. blockchain data and ASIC devices that use electric.. not whitepapersand the good thing about the code is that it is open-source so you can read it. yep.. bitcoin is not paperyou are trying to describe what you see in a \"whitepaper\" dated and released 2008 .. you are not trying to describe the blockchain, its data or the devices it uses or the code that enforces the rules. that only began in january 2009if you cannot tell the difference between the 2 different things. then spend some time to learn the difference between bitcoin \"blockchain together with open-source software and protocols\" vs whitepaper/articlestry to check the code, look at the blockchain data and touch an asic.then you may begin to learn how things actually workfor instance bitcoins mining process uses ASICS not CPU's. ASICS are not mentioned in the white paper.learning about bitcoin by only looking at \"a article\" or \"whitepaper\" as you suggest, shows you are not learning much about bitcoin.especially when you only take snippets of a sentence of a white paper you are not fully understanding. where you have not read the entire context, content",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}