{
  "id": "topic_5469215",
  "title": "sabotag3x",
  "author": "sabotag3x",
  "created_time": "October 04, 2023, 05:12:46 PM",
  "content": "Nessa semana saiu o livro sobre o Sam Bankman-Fried, fundador da FTX.. já está como o mais vendido na seção \"investir\" da Amazon.O nome é Going Infinite: The Rise and Fall of a New Tycoon (Indo ao infinito: a ascensão e queda de um novo magnata, tradução livre) e só está disponível em inglês.Link: https://www.amazon.com/Going-Infinite-Rise-Fall-Tycoon-ebook/dp/B0C5DNW987O livro foi escrito por Michael Lewis, mesmo cara que escreveu Moneyball e The Big Short (os dois viraram filmes de grande sucesso), então há chances da história da FTX virar um filme também.. quem interpretaria o SBF? A nota está meio ruim, 2,9/5.. Lendo as análises, as principais críticas apontam que Lewis virou um 'advogado' de SBF, defendendo-o de seus crimes.QuoteLewis parece mais um advogado de defesa do que alguém interessado em contar uma históriaEstá na lista de leitura de alguém? Penso que todos conhecem a história, mas deve ter alguns detalhes interessantes ali.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5469215",
  "comments": [
    {
      "author": "tg88",
      "created_time": "October 04, 2023, 05:26:10 PM",
      "body": "Eu vi que uma das histórias que constam no livro é a de que o Sam cogitou pagar 5 bilhões de dólares para que Donald Trump não se candidatasse a presidência dos EUA. Ele faria isso pois acreditava que Trump colocava em risco a democracia do país. Não deve ser fácil um dia estar pensando em como \"salvar\" o mundo e no dia seguinte estar atrás das grades por algo que aconteceu na sua própria empresa.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "October 04, 2023, 07:36:25 PM",
      "body": "Mas o livro é sobre o que? Como o SBF arruinou o FTX? Ou como ele sempre foi e será o herói incompreendido?Enfim, mas uma forma de lucrar, com esta historia. Se calhar todos os lesados deviam fazer um livro, sobre a sua historia e como foi perder o dinheiro, e talvez conseguiriam recuperar mais facilmente parte das perdas.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Paredao",
      "created_time": "October 04, 2023, 07:42:25 PM",
      "body": "Quote from: joker_josue on October 04, 2023, 07:36:25 PMMas o livro é sobre o que? Como o SBF arruinou o FTX? Ou como ele sempre foi e será o herói incompreendido?Enfim, mas uma forma de lucrar, com esta historia. Se calhar todos os lesados deviam fazer um livro, sobre a sua historia e como foi perder o dinheiro, e talvez conseguiriam recuperar mais facilmente parte das perdas. Com toda a certeza. Deve ser um livro promovendo o safado e tentando dar um ar de coitado para ele. Vão dizer que é culpa dos reguladores que quiseram pega-lo, fora a \"malvada\" Binance que não saia da cola dele. Nem vou perder tempo em ler esse livro. Agora, vamos ver quanto de pena que ele será condenado. Eu acredito que pegue prisão perpetua, somente para dar exemplo.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sabotag3x",
      "created_time": "October 04, 2023, 08:00:29 PM",
      "body": "Quote from: joker_josue on October 04, 2023, 07:36:25 PMMas o livro é sobre o que? Como o SBF arruinou o FTX? Ou como ele sempre foi e será o herói incompreendido?Ele já estava escrevendo o livro antes da FTX falir (o SBF já era estranho o suficiente para receber um livro).. a falência foi apenas a \"cereja do bolo\", um capítulo inesperado..Estranhei a nota baixa, talvez o SBF pagou o Lewis muito bem e isso acabou afetando seu trabalho.Quote from: Paredao on October 04, 2023, 07:42:25 PMAgora, vamos ver quanto de pena que ele será condenado. Eu acredito que pegue prisão perpetua, somente para dar exemplo.Também estou curioso.. Será que recebe uma pena grande igual Madoff ou uma pequena igual Belfort?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rdluffy",
      "created_time": "October 04, 2023, 11:58:06 PM",
      "body": "Quote from: tg88 on October 04, 2023, 05:26:10 PMEu vi que uma das histórias que constam no livro é a de que o Sam cogitou pagar 5 bilhões de dólares para que Donald Trump não se candidatasse a presidência dos EUA. Ele faria isso pois acreditava que Trump colocava em risco a democracia do país. Não deve ser fácil um dia estar pensando em como \"salvar\" o mundo e no dia seguinte estar atrás das grades por algo que aconteceu na sua própria empresa.O pior de tudo é que na cabeça de um cara igual a ele, deve pensar que estava mesmo agindo certo  Certas coisas não tem explicação, o SBF poderia muito bem estar milionário (talvez não bilionário) se tivesse feito as coisas corretamente, sem todas essas jogadas sujas, mas fez o que fez...Sobre o livro, me interessei, acho que vale a leitura pra conhecer melhor o cara que roubou um bom tanto de dinheiro meu  Só fiquei com o pé atrás se o livro vender ele como uma boa pessoa",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "October 05, 2023, 08:00:42 AM",
      "body": "Quote from: rdluffy on October 04, 2023, 11:58:06 PMSó fiquei com o pé atrás se o livro vender ele como uma boa pessoa Se o livro estiver bem feito, não devia mostrar nem como boa ou má pessoa. Apenas relatar o que aconteceu e todo o que estava envolvido, podendo apresentar isso na perspetiva de vários intervenientes, incluído do SBF.Pelo o que parece, ao ver as criticas, não é isso que acontece. Mas, resta perceber se as criticas foram de pessoas que já leram, ou de pessoas que apenas foram vitimas do FTX.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Paredao",
      "created_time": "October 05, 2023, 08:22:19 PM",
      "body": "Quote from: sabotag3x on October 04, 2023, 08:00:29 PMTambém estou curioso.. Será que recebe uma pena grande igual Madoff ou uma pequena igual Belfort?Eu acredito que ele pegue prisão perpetua em algum presidio federal de segurança média. Tipo aqueles presídios que tem na Flórida para presos que tem dinheiro. A justiça norte-americana muitas das vezes gosta de dar uma pena alta para determinados casos para que sirva como exemplo. Eu acredito que esse seja um caso que isso vai acontecer. Vamos aguardar. Acredito que o Sam vai ter que mudar a dieta alimentar dele por longo tempo.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}