{
  "id": "topic_5476264",
  "title": "Dropfliesup",
  "author": "Dropfliesup",
  "created_time": "December 02, 2023, 02:58:12 AM",
  "content": "Due to Bitrex exchange closure I had to withdraw  my  BTC and by mistake I sent  it to my old Local Bitcoins wallet .  The Local Bitcoin refused to return  my founds stating that they warned not to send any btc and that we they do not do any incoming transactions reinbursments. Also after my further inquiry, Local Bitcoin staff informed me that they do not provide private keys to users since Local Bitcoin is a  web-wallet . It seems that my sincere and honest explanation  that the transfer was done by mistake had no effect on the final Local Bitcoin negative decision. What can be done more in this situation? Can I count on Local Bitcoins reputation ? Anyone can help?https://www.blockchain.com/explorer/addresses/btc/325HM2TfxoxViAmwrZ1tRGotaW3FwDXNTUhttp://",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5476264",
  "comments": [
    {
      "author": "Zaguru12",
      "created_time": "December 02, 2023, 03:50:38 AM",
      "body": "From your explanation it seems local bitcoin have actually confiscated your bitcoin due to some reason, I don’t think you can do anything other than patiently chat up local bitcoin to get your coins. The phrase not your keys not your coins has played its part here, as they hold full custody of the bitcoin now. Just continuously try chatting with them and maybe it could help. Also be-careful of scammers that might be coming to tell you they can help, only local bitcoin can release those coins now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nc50lc",
      "created_time": "December 02, 2023, 03:52:33 AM",
      "body": "Quote from: Dropfliesup on December 02, 2023, 02:58:12 AMAlso after my further inquiry, Local Bitcoin staff informed me that they do not provide private keys to users since Local Bitcoin is a  web-wallet . It seems that my sincere and honest explanation  that the transfer was done by mistake had no effect on the final Local Bitcoin negative decision. What can be done more in this situation? Can I count on Local Bitcoins reputation ? Anyone can help?No one can help you except them since they hold the private keys of their users' addresses.As for their response, it seems like it's aligned with their TOS here: localbitcoins.com/terms_of_serviceBut there's no information about recovery of mistakenly sent funds.The closest policy is about their altcoin recovery rule in \"Acceptable Use Policy\" which states that they aren't entitled to recover the funds: https://localbitcoins.com/acceptable_use_policy",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pmalek",
      "created_time": "December 02, 2023, 08:35:39 AM",
      "body": "I am surprised they are still responding to email inquiries. The site announced its closure at the beginning of 2023.Sadly, no one can help you. Unless you can personally log in to your account and withdraw your coins elsewhere.  They still have a log in button on their website. What happens if you enter your login details, can you get access to your account? Try to reset the password via email if it doesn't work.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dropfliesup",
      "created_time": "December 02, 2023, 04:31:07 PM",
      "body": "I am able to log in . My inquires are open via local Bitcoin support desk  . I am able to see the past address where my btc had been sent and the same address  I could check in blockchain explorer  where I can see my founds stored . I have enough  evidence to prove that these are my btc and I can prove that these were sent by mistake.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pmalek",
      "created_time": "December 02, 2023, 04:43:10 PM",
      "body": "Why does their customer service department still exist and communicates with clients if they are no longer allowing users to empty their accounts? It's no longer possible to register a new account. Weird people.LocalBitcoins is regulated by the Finnish Financial Authorities. Tell the staff nicely again that you made an honest mistake, and if they don't want to help, you'll get the Finnish Financial Authorities involved. They might not care, but at this point, you have nothing to lose.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaveF",
      "created_time": "December 02, 2023, 06:17:12 PM",
      "body": "You can withdraw what was there before the 16-Feb-2023 closing date.Without knowing how their back end worked the support staff that is left might not even have access to the wallets. BUT, you can try to keep after them. The worst they can do is keep saying no. There might be someone left who can get to the BTCIt also does depend on the amount. If you are talking about 1BTC they might be more inclined to do something vs BTC0.0025 -Dave",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sunderland",
      "created_time": "December 02, 2023, 06:30:02 PM",
      "body": "https://localbitcoins.com/terms_of_serviceCode:Incoming transactionsLocalbitcoins does not process any incoming bitcoin transactions anymore. In case bitcoins are sent to an address which has been linked to your account, it will not be credited to your account balance.It will be hard to win the case with a legal way because of this terms.If I may suggest, how about you trying to contacts some of local bitcoins high ranking staff, or even try to contact the founder Jeremias Kangas via his social media.You can find his social media info with google.As Pmalek said above, you have nothing to lose anymore at this point. Quote from: DaveF on December 02, 2023, 06:17:12 PM- snip -It also does depend on the amount. If you are talking about 1BTC they might be more inclined to do something vs BTC0.0025 Its 0.13386546 BTC or 5,198 USD (today price)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "decodx",
      "created_time": "December 02, 2023, 07:46:40 PM",
      "body": "Dropfliesup, I think Sunderland's idea is solid.  That much money is nothing to sneeze at, so putting in some extra effort seems worthwhile.  Lawyers have more know-how with this stuff, so even without an ironclad legal case for getting your money back, having one draft a strongly-worded letter and persistently needle whoever you can over there could pay off and  you gotta be a squeaky wheel to get the grease as they say.  Don't be a jerk about it, but firmly and repeatedly press them to return what ain't theirs. It might pay off in the end!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Myleschetty",
      "created_time": "December 02, 2023, 09:32:17 PM",
      "body": "Sorry about what happened to you especially now that the bull market is coming but the chance of you getting the Bitcoin back is slim unless you report the issue to the authorities. A user once made a report about the exchange scamming him after they declared the shutting down of their service.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pmalek",
      "created_time": "December 03, 2023, 07:24:06 AM",
      "body": "Quote from: Myleschetty on December 02, 2023, 09:32:17 PMA user once made a report about the exchange scamming him after they declared the shutting down of their service. That \"report\" of his makes no sense. He created multiple threads on the matter and I don't know if he presented any proof in any of them. The one you linked to has no proof whatsoever about any wrongdoings. He wants to pay money for information about someone or for their arrest. I guess in his head, the work of the police and justice system depends on how much money you give them, not the evidence you have against them or probable cause.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dropfliesup",
      "created_time": "December 03, 2023, 10:45:56 AM",
      "body": "I would like to thank you all guys for engaging  in this matter .I have found a law firm in London  that specialises  in crypto and I will see what they would  advise.https://www.selachii.com/advice-for-victims-of-bitcoin-fraud.html",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Z-tight",
      "created_time": "December 03, 2023, 11:45:35 AM",
      "body": "Quote from: Dropfliesup on December 03, 2023, 10:45:56 AMI have found a law firm in London  that specialises  in crypto and I will see what they would  advise.https://www.selachii.com/advice-for-victims-of-bitcoin-fraud.htmlGoodluck with that buddy, though i am not too optimistic, but you have nothing to lose, except the cost of consulting this law firm i suppose. LocalBitcoins gave customers a 12 month withdrawal deadline which hasn't elapsed since they discontinued their service on 09/02/2023. But the problem now is, they say they no longer process incoming transactions, i don't know why they don't since they hold the keys to the addresses, they can 'easily' process the tx and make it available for withdrawal in your account since the withdrawal deadline hasn't elapsed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pmalek",
      "created_time": "December 03, 2023, 01:34:37 PM",
      "body": "Quote from: Dropfliesup on December 03, 2023, 10:45:56 AMI have found a law firm in London  that specialises  in crypto and I will see what they would  advise.https://www.selachii.com/advice-for-victims-of-bitcoin-fraud.html It could prove to be expensive and not really worth it if you are going to give most of the money to the law firm to handle your case. I would again advice you to contact the Finish Financial Authority and see what they have to say. It's a serious country and regulator; we aren't talking about Curacao or the Seychelles Islands. Check with them, and you can always go back to discussing the matter with a law firm if they can't do anything.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SquirrelJulietGarden",
      "created_time": "December 03, 2023, 01:54:56 PM",
      "body": "Quote from: Dropfliesup on December 02, 2023, 02:58:12 AMDue to Bitrex exchange closure I had to withdraw  my  BTC and by mistake I sent  it to my old Local Bitcoins wallet . Mistakenly sent, but how?Did you log in your LocalBitcoins account and get that receiving address before sending your bitcoin from Bittrex to that account?I, myself, consider it is a must step to do because it takes me some seconds to log in my account. It is a simple step but important to let me know that the exchange is still lively, and my account still has no issue, or the exchange changed their hot wallets and my old receiving address is no longer usable for deposit.If you do that step, you will not make the mistake.QuoteThe Local Bitcoin refused to return  my founds stating that they warned not to send any btc and that we they do not do any incoming transactions reinbursmentsThey shut down their services months ago and surely have no responsibility to support customers for mistakenly deposit to an address of a dead platform.Localbitcoins closing down in February 2023 and today, nearly the end of 2023, you still don't know about it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaveF",
      "created_time": "December 03, 2023, 01:57:15 PM",
      "body": "Quote from: Pmalek on December 03, 2023, 01:34:37 PMQuote from: Dropfliesup on December 03, 2023, 10:45:56 AMI have found a law firm in London  that specialises  in crypto and I will see what they would  advise.https://www.selachii.com/advice-for-victims-of-bitcoin-fraud.html It could prove to be expensive and not really worth it if you are going to give most of the money to the law firm to handle your case. I would again advice you to contact the Finish Financial Authority and see what they have to say. It's a serious country and regulator; we aren't talking about Curacao or the Seychelles Islands. Check with them, and you can always go back to discussing the matter with a law firm if they can't do anything.If you don't want to contact the Finish Financial Authority as Pmalek suggested, I would use a law firm in Finland where LBC is based. They are going to know that countries laws much better then a foreign firm. Your location may matter a bit too, depending on the relationship your countries financial regulators have with the Finish ones. Your local version of the regulators *may* have a better way of contacting the Finish ones or at least a more direct route.-Dave",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pmalek",
      "created_time": "December 03, 2023, 01:59:26 PM",
      "body": "Quote from: SquirrelJulietGarden on December 03, 2023, 01:54:56 PMMistakenly sent, but how?Did you log in your LocalBitcoins account and get that receiving address before sending your bitcoin from Bittrex to that account? It's possible, but in that case OP would probably have seen the notifications on the official website that the service has been shut down. It's more likely that he saved the LocalBitcoins address somewhere on his computer (email, personal notes) and mistakenly sent the coins to it thinking they were going elsewhere.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SquirrelJulietGarden",
      "created_time": "December 03, 2023, 02:02:43 PM",
      "body": "Quote from: Pmalek on December 03, 2023, 01:59:26 PMQuote from: SquirrelJulietGarden on December 03, 2023, 01:54:56 PMMistakenly sent, but how?Did you log in your LocalBitcoins account and get that receiving address before sending your bitcoin from Bittrex to that account? It's possible, but in that case OP would probably have seen the notifications on the official website that the service has been shut down. It's more likely that he saved the LocalBitcoins address somewhere on his computer (email, personal notes) and mistakenly sent the coins to it thinking they were going elsewhere. Yes, it is what I implied the meaning of the simple step which can give a lot of information, about that service, about the account, about notifications for service closure, address changes and more.I assumed OP saved the address and did not log in his account like you said.Even the platform is still operating, log in step can hep me to know that my account is banned, terminated, suspended and if it happened with my account, deposit into that account will cause a loss.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Findingnemo",
      "created_time": "December 03, 2023, 02:10:03 PM",
      "body": "Quote from: Z-tight on December 03, 2023, 11:45:35 AMQuote from: Dropfliesup on December 03, 2023, 10:45:56 AMI have found a law firm in London  that specialises  in crypto and I will see what they would  advise.https://www.selachii.com/advice-for-victims-of-bitcoin-fraud.htmlGoodluck with that buddy, though i am not too optimistic, but you have nothing to lose, except the cost of consulting this law firm i suppose. LocalBitcoins gave customers a 12 month withdrawal deadline which hasn't elapsed since they discontinued their service on 09/02/2023. But the problem now is, they say they no longer process incoming transactions, i don't know why they don't since they hold the keys to the addresses, they can 'easily' process the tx and make it available for withdrawal in your account since the withdrawal deadline hasn't elapsed.They can but they won't that is the end of the story.Because they mentioned clearly any incoming TX won't be credited to balance so legally they are on the right side.Taking legal fights against them will exceed the actual lost amount so better take it as a lesson learned the hard way will be my advice to OP.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dropfliesup",
      "created_time": "December 03, 2023, 03:41:22 PM",
      "body": "Do they have legal rights to use founds? They said that no more transactions  can be made but they didn't  specify  who is the legal owner of such founds.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}