{
  "id": "topic_5475234",
  "title": "gsus.dev",
  "author": "gsus.dev",
  "created_time": "November 23, 2023, 06:12:18 PMLast edit: November 26, 2023, 03:26:35 PM by hilariousandco",
  "content": "Hello,I have tried to withdraw BTC through the Lightning Network in Binance, but the option is unavailable.I contacted Binance Customer Service and the agent replied I'm not able to withdraw/deposit through LN because I'm an EU citizen.It turns out that the new EU regulations have banned the LN in CEX such as Binance and Coinbase. Also other crypto like XMR and DASH have been banned too.I understood from the Binance Customer Service that EU decided to ban it because the LN transactions cannot be traced.Even if I'm not allowed to withdraw from/deposit to an CEX, I'm now unsure that I can use the LN in EU at all.I'm not able to find any information around the topic anywhere in the Internet.Can I still use the Bitcoin Lightning Network in Europe with wallets supporting it?Can I be prosecuted because of using it at all?There are still other altcoins with low fees, but Bitcoin is the most mature and capitalized crypto in the market; the LN enables Bitcoin to be used in everyday transactions.I can buy a coffee instantly with virtually no fees, and the transaction is confirmed instantaneously.An analogy I've found useful: Bitcoin is your bank equity and statements and Bitcoin Lightning Network coins are analogue to cash, untraceable and anonymous.If Bitcoin Lightning Network is banned - cash should be banned equally - shouldn't it?As far as I know for the time being only financial institutions in EU are prohibited from using XMR, DASH and other privacy coins. Individual users are still allowed to use them as long as they are not transacting with the financial institutions.However EU is trying to phase out cash indeed. The EU governments are gradually lowering the maximum allowed limit of cash transactions. It varies from country to country but in most cases is somewhere in the range from 1,000 EUR to 5,000 EUR. However these limits are constantly being lowered. For example in Greece they will soon limit the max. cash transaction to 500 EUR.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5475234",
  "comments": [
    {
      "author": "LoyceMobile",
      "created_time": "November 23, 2023, 07:14:07 PM",
      "body": "I can buy a beer with LN, so no, it's not banned.Don't trust Binance, they'll try to trick you into accepting their own made up tokens instead of Bitcoin. They have no interest in letting you withdraw real Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gsus.dev",
      "created_time": "November 23, 2023, 07:44:43 PMLast edit: November 26, 2023, 03:26:11 PM by hilariousandco",
      "body": "Thank you for your quick replies. It's clear for me now that I can freely transact through the Bitcoin Lightning Network being an EU citizen.This is unrelated to the question but anyways:Are there any ways I can buy Bitcoin and withdraw it into a LN wallet/address directly?(avoiding the transaction fees two times between CEX -> wallet -> LN and then back to LN -> wallet -> CEX)I have been navigating several DEX but unfortunately I couldn't find any that would transact in the Lightning network.Quote from: btcinfo891 on November 23, 2023, 06:54:44 PMAs far as I know for the time being only financial institutions in EU are prohibited from using XMR, DASH and other privacy coins. Individual users are still allowed to use them as long as they are not transacting with the financial institutions.However EU is trying to phase out cash indeed. The EU governments are gradually lowering the maximum allowed limit of cash transactions. It varies from country to country but in most cases is somewhere in the range from 1,000 EUR to 5,000 EUR. However these limits are constantly being lowered. For example in Greece they will soon limit the max. cash transaction to 500 EUR.If financial institutions, which include CEX, are prohibited from using XMR, DASH or transacting in the LN.How is an individual supposed to access these crypto assets? (open question - I'm not currently looking forward to acquire any of these - curious about the legal aspect)Quote from: LoyceMobile on November 23, 2023, 07:14:07 PMI can buy a beer with LN, so no, it's not banned.Don't trust Binance, they'll try to trick you into accepting their own made up tokens instead of Bitcoin. They have no interest in letting you withdraw real Bitcoin.Thanks for your comment - I'm glad you can buy beer with LN  For now, Binance is my main CEX (in the past I've also used Coinbase) - looking forward to learn more about the alternatives",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LoyceMobile",
      "created_time": "November 23, 2023, 08:00:49 PM",
      "body": "Kraken allows LN withdrawals.Or withdraw a low fee altcoin and go though an instant exchange to get LN.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gsus.dev",
      "created_time": "November 23, 2023, 08:12:40 PM",
      "body": "Quote from: LoyceMobile on November 23, 2023, 08:00:49 PMKraken allows LN withdrawals.You are right, just checked and I'm able to deposit/withdraw LN.Quote from: LoyceMobile on November 23, 2023, 08:00:49 PMOr withdraw a low fee altcoin and go though an instant exchange to get LN.What do you mean by: go through an instant exchange?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gsus.dev",
      "created_time": "November 23, 2023, 08:44:44 PM",
      "body": "Quote from: LoyceMobile on November 23, 2023, 08:00:49 PMKraken allows LN withdrawals.Or withdraw a low fee altcoin and go though an instant exchange to get LN.Adding something else:Why is Kraken allowing LN transactions in Europe if it’s a financial institution?Is it not complying with the latest regulations?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "btcinfo891",
      "created_time": "November 23, 2023, 09:09:29 PM",
      "body": "Quote from: gsus.dev on November 23, 2023, 07:53:12 PMIf financial institutions, which include CEX, are prohibited from using XMR, DASH or transacting in the LN.How is an individual supposed to access these crypto assets? (open question - I'm not currently looking forward to acquire any of these - curious about the legal aspect)You can buy privacy coins (XMR, DASH, etc.) from centralized exchanges that are outside of EU. Some of these exchanges don't even require KYC, so they essentially ignore the EU limitations.Even if the exchange requires KYC but does not have a legal presence in EU, it can ignore the EU limitations.And there are also decentralized exchanges which completely ignore this limitation.Quote from: gsus.dev on November 23, 2023, 08:44:44 PMAdding something else:Why is Kraken allowing LN transactions in Europe if it’s a financial institution?Is it not complying with the latest regulations?EU prohibits financial institutions from working with privacy coins like XMR, but I am not sure if they prohibit the LN transactions. It could be that Binance is overly strict with LN because they are having legal troubles in US and EU and they want to stay on the safe side.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Free Market Capitalist",
      "created_time": "November 24, 2023, 03:38:23 AM",
      "body": "I'm glad because I had seen the title and thought things in terms of LN were going faster than expected. Just in case I have searched and I don't see anything about it so it looks like a one-off problem with Binance, as has been commented. In this article from last year they talk about possible problems but not so much to prohibit as to force KYC transactions.:Bitcoin Lightning Network at regulatory risk after Tornado Cash saga",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zasad@",
      "created_time": "November 24, 2023, 11:07:26 AM",
      "body": "Quote from: gsus.dev on November 23, 2023, 06:12:18 PMHello,I have tried to withdraw BTC through the Lightning Network in Binance, but the option is unavailable.I contacted Binance Customer Service and the agent replied I'm not able to withdraw/deposit through LN because I'm an EU citizen.It turns out that the new EU regulations have banned the LN in CEX such as Binance and Coinbase. Also other crypto like XMR and DASH have been banned too.I understood from the Binance Customer Service that EU decided to ban it because the LN transactions cannot be traced.Even if I'm not allowed to withdraw from/deposit to an CEX, I'm now unsure that I can use the LN in EU at all.I'm not able to find any information around the topic anywhere in the Internet.Can I still use the Bitcoin Lightning Network in Europe with wallets supporting it?Can I be prosecuted because of using it at all?There are still other altcoins with low fees, but Bitcoin is the most mature and capitalized crypto in the market; the LN enables Bitcoin to be used in everyday transactions.I can buy a coffee instantly with virtually no fees, and the transaction is confirmed instantaneously.An analogy I've found useful: Bitcoin is your bank equity and statements and Bitcoin Lightning Network coins are analogue to cash, untraceable and anonymous.If Bitcoin Lightning Network is banned - cash should be banned equally - shouldn't it?Binance is garbage after that, I haven’t used it for several yearshttps://bitcointalk.org/index.php?topic=5439961.msg63202131#msg63202131Save this link and trade freely in Monero, Bitcoin and use LN and do not use centralized dumps that will fulfill all the requirements of your governments.https://archive.ph/CpS0W  And most importantly, talk less about what you do with your friends.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rat03gopoh",
      "created_time": "November 25, 2023, 05:35:12 AM",
      "body": "Quote from: gsus.dev on November 23, 2023, 08:12:40 PMWhat do you mean by: go through an instant exchange?Exchange alt to bitcoin to use with LN across Europe. If you want to withdraw via LN like Binance, find here for DEX, instant btc><alts exchange that supports bitcoin LN. https://cointastical.github.io/Exchanges-With-LN/I don't think European regulations can prevent you from withdrawing Bitcoin LN via DEX.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zasad@",
      "created_time": "November 25, 2023, 12:09:08 PM",
      "body": "Quote from: rat03gopoh on November 25, 2023, 05:35:12 AMQuote from: gsus.dev on November 23, 2023, 08:12:40 PMWhat do you mean by: go through an instant exchange?Exchange alt to bitcoin to use with LN across Europe. If you want to withdraw via LN like Binance, find here for DEX, instant btc><alts exchange that supports bitcoin LN. https://cointastical.github.io/Exchanges-With-LN/I don't think European regulations can prevent you from withdrawing Bitcoin LN via DEX.Not only state laws cannot stop decentralized exchanges, and I cannot judge whether this is prohibited or not. Europe has very strict tax laws, and a problem arises when legalizing cryptocurrencies, because decentralized exchanges do not provide documents on trading. Therefore, for the tax authorities, all cryptocurrency will be considered net profit when calculating fines.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "November 25, 2023, 12:46:16 PM",
      "body": "Quote from: gsus.dev on November 23, 2023, 07:53:12 PMQuote from: btcinfo891 on November 23, 2023, 06:54:44 PMAs far as I know for the time being only financial institutions in EU are prohibited from using XMR, DASH and other privacy coins. Individual users are still allowed to use them as long as they are not transacting with the financial institutions.If financial institutions, which include CEX, are prohibited from using XMR, DASH or transacting in the LN.How is an individual supposed to access these crypto assets? (open question - I'm not currently looking forward to acquire any of these - curious about the legal aspect)First thing, there is no such law, nobody is banning the sale of those coins it just asking the exchange to collect the information about the buyers, which they already do. Anther example of Binance getting it all wrong:https://cointelegraph.com/news/binance-wrong-monero-zcash-privacy-coinsSecond, it would work just as you can get a some Foie-Gras from in Germany, you buy it from some guy France In this case you buy it from somebody else, it's just that if financial institution will eventually not be allowed to sell them to you, there is no proposed ban on private dealing whatsoever, and even that ban on privacy coins is not enforceable yet either.Quote from: btcinfo891 on November 23, 2023, 09:09:29 PMEU prohibits financial institutions from working with privacy coins like XMR,. Can you link to such directive?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zasad@",
      "created_time": "November 26, 2023, 10:31:05 AM",
      "body": "Quote from: stompix on November 25, 2023, 12:46:16 PMCan you link to such directive?These are only amendments to the law and proposalsEBA consults on amendments to the Guidelines on money laundering and terrorist financing risk factors to include crypto-asset service providershttps://www.eba.europa.eu/eba-consults-amendments-guidelines-money-laundering-and-terrorist-financing-risk-factors-includeGovernments believe that confidential coins pose a high risk of being used in criminal activities and other crimes such as terrorist financing.Comments and public hearings are closed. If you are from Europe, please tell us what will happen next with this bill.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "November 26, 2023, 11:47:49 AM",
      "body": "Quote from: zasad@ on November 26, 2023, 10:31:05 AMQuote from: stompix on November 25, 2023, 12:46:16 PMCan you link to such directive?These are only amendments to the law and proposalsCare to link to such amendment?An amendment to a law should be public just as a proposal.Quote from: zasad@ on November 26, 2023, 10:31:05 AMEBA consults on amendments to the Guidelines on money laundering and terrorist financing risk factors to include crypto-asset service providershttps://www.eba.europa.eu/eba-consults-amendments-guidelines-money-laundering-and-terrorist-financing-risk-factors-includeAnd the amendment of banning privacy coins in Europe is....where?Quote from: zasad@ on November 26, 2023, 10:31:05 AMIf you are from Europe, please tell us what will happen next with this bill.There is no such bill, all crypto regulations are part of MICA, and MICA is not addressing personal or non financial business, it's only targeting  crypto-asset service providers. So the whole thing about the EU banning LN is just crazy talk. Restricting CASP from dealing with privacy coins in financial truncations with companies that are either not regulated in the EU or aren't complying with AML/FATF rules that's a different thing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "btcinfo891",
      "created_time": "November 26, 2023, 01:40:13 PM",
      "body": "Quote from: stompix on November 25, 2023, 12:46:16 PMQuote from: btcinfo891 on November 23, 2023, 09:09:29 PMEU prohibits financial institutions from working with privacy coins like XMR,. Can you link to such directive?It is a draft so it is not public yet, but there is leaked informationhttps://www.coindesk.com/policy/2022/11/15/privacy-enhancing-crypto-coins-could-be-banned-under-leaked-eu-plans/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "November 26, 2023, 02:09:09 PM",
      "body": "So we went from:Quote from: btcinfo891 on November 23, 2023, 06:54:44 PMAs far as I know for the time being only financial institutions in EU are prohibited from using XMR, DASH and other privacy coins.toQuote from: btcinfo891 on November 26, 2023, 01:40:13 PMIt is a draft so it is not public yet, but there is leaked informationhttps://www.coindesk.com/policy/2022/11/15/privacy-enhancing-crypto-coins-could-be-banned-under-leaked-eu-plans/a leak of a draft and while they aren't even capable of showing a paragraph from it, the article is full of:\"could ban\", \"would represent\", a mysterious diplomat, \"the diplomat, who spoke on the condition of anonymity\", and so on..How is that possible that only Coindesk is reporting on this and not any other paper?Oh wait, was this because that draft was leaked out a year ago and we still have seen nothing of it, meaning it was another made up story?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zasad@",
      "created_time": "November 27, 2023, 12:26:38 PM",
      "body": "Quote from: stompix on November 26, 2023, 11:47:49 AMThere is no such bill, all crypto regulations are part of MICA, and MICA is not addressing personal or non financial business, it's only targeting  crypto-asset service providers. So the whole thing about the EU banning LN is just crazy talk. Restricting CASP from dealing with privacy coins in financial truncations with companies that are either not regulated in the EU or aren't complying with AML/FATF rules that's a different thing.In my opinion, the MICA law regulates cryptocurrencies very little and it will be supplemented.Major Bitcoin Lightning wallet provider quits US markethttps://www.theblock.co/post/264585/wallet-of-satoshi-bitcoin-lightning\"Wallet of Satoshi has removed itself from the U.S. Apple and Google app stores, confirming it will not serve customers in the country going forward.The popular Bitcoin Lightning app did not specify the reason for the decision but sought to assure existing customers in the U.S. that their funds were safe and available to transfer to another wallet.\"This is bad news, and the company is apparently afraid of regulation in the US.Do you think that Europe will not regulate the Lightning Ecosystem yet?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zasad@",
      "created_time": "November 29, 2023, 03:04:36 PM",
      "body": "Quote from: kill bill1738 on November 28, 2023, 01:35:05 PMThe regulatory landscape for cryptocurrencies and blockchain technologies can vary across European countries. Some countries may have embraced these technologies, while others might have implemented more restrictive measures or are in the process of developing regulations.And also,Regulatory clarity is crucial for the acceptance and adoption of technologies like the Lightning Network. If there is uncertainty or lack of clarity regarding the legal status of such technologies, it can create challenges for businesses and users.https://protos.com/bitcoin-lightning-network-users-could-have-lost-millions-in-jamming-attack/\"In December 2022, Bitcoin’s most popular scaling solution, the Lightning Network, experienced a critical vulnerability error. Had a hacker exploited this error, many users could have lost their bitcoin. For context, there are thousands of users and at least 5,500 bitcoin worth at least $150 million in the Lightning Network.\"___I would first ask other questions about the reliability of this ecosystem and how many bugs are still present there, but undetected. This ecosystem is not popular everywhere and is not yet suitable for the massadoption.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "November 30, 2023, 12:35:12 PM",
      "body": "Quote from: zasad@ on November 27, 2023, 12:26:38 PM\"Wallet of Satoshi has removed itself from the U.S. Apple and Google app stores, confirming it will not serve customers in the country going forward.The popular Bitcoin Lightning app did not specify the reason for the decision but sought to assure existing customers in the U.S. that their funds were safe and available to transfer to another wallet.\"It has nothing to do with LN.The thing everyone fails to mention here is that it wasn't just a lighting wallet, you could also buy coins with cash without kyc directly from the wallet, that was their money maker move, if they wouldn't have had  that they could have just left the wallet alone free in the wild, after all it's just a piece of software, right? But saying that out loud would hurt their image, right?Quote from: zasad@ on November 27, 2023, 12:26:38 PMDo you think that Europe will not regulate the Lightning Ecosystem yet?They don't care about LN and they won't!First any amendments major to MICA would need again all the legal steps and since it's an general financial regulation it would need this time not just an majority in the EU parliament and Council but it will require all those to go through the Commission, and here each country had a veto right. Second, why would they care, the law covers the entry point and the exit point of LN, since no financial institution that deals with fiat can have its business only on LN, it makes little sense to have it targeted once the gateway is regulated.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zasad@",
      "created_time": "December 01, 2023, 02:30:31 PM",
      "body": "Quote from: stompix on November 30, 2023, 12:35:12 PMThey don't care about LN and they won't!First any amendments major to MICA would need again all the legal steps and since it's an general financial regulation it would need this time not just an majority in the EU parliament and Council but it will require all those to go through the Commission, and here each country had a veto right. Second, why would they care, the law covers the entry point and the exit point of LN, since no financial institution that deals with fiat can have its business only on LN, it makes little sense to have it targeted once the gateway is regulated.Thanks for the answer. I did not manage to study the entire MICA law, but I am sure from my own experience that one law is not enough. In my country, questions always arise when using laws, which is why instructions, recommendations, clarifications, methodological instructions, and so on appear. One law becomes the reason for many regulatory documents, and after a couple of years of work, judicial practice is added.So, will all additional documents be done centrally or is the law so ideal that this will not be required? Or will each country have its own views on controversial issues?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}