{
  "id": "topic_5451914",
  "title": "Queentoshi",
  "author": "Queentoshi",
  "created_time": "May 08, 2023, 06:45:37 AM",
  "content": "This season where transaction fees are really high can be a discouragement for people who were already becoming used to making payments in bitcoins at their local stores that accept payments in bitcoins. For people who have businesses that accept payments in bitcoins, how are you coping at this time when transaction fees are really high, and what adjustments have you made to try to see that people do not totally cancel out making payments in bitcoins due to this challenge.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5451914",
  "comments": [
    {
      "author": "paid2",
      "created_time": "May 08, 2023, 06:57:12 AM",
      "body": "Quote from: Queentoshi on May 08, 2023, 06:45:37 AMThis season where transaction fees are really high can be a discouragement for people who were already becoming used to making payments in bitcoins at their local stores that accept payments in bitcoins. For people who have businesses that accept payments in bitcoins, how are you coping at this time when transaction fees are really high, and what adjustments have you made to try to see that people do not totally cancel out making payments in bitcoins due to this challenge. The buyer pays huge fees and could be ok with it: if you buy a car / house in BTC it's ok, it won't be too much of a trauma. If you're buying bread and milk, it's clearly a bit more of a pain in the ass. For these small transactions, people turn (or should turn) to LN. Or basically, the seller just put on-hold BTC as payment method if he doesn't accept payments through Lightning Network.I think that in the long run, given the mess that is the mempool on an increasingly regular basis, Lightning Network is becoming more and more necessary and justified in my opinion.After that, if it's like every time, the 1.5 BTC fee blocks shouldn't be around for too long, hopefully it will drop again soon.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Luzin",
      "created_time": "May 08, 2023, 06:59:09 AM",
      "body": "Local discussion boards are also discussing this. I haven't found the cause of the transaction soaring so great. But if you look closely there are small transactions with the same amount keep repeating. Local discussion boards estimate this is a dusting attack on the bitcoin network. This has happened to the ETH network as well. Actually, I am suspicious. This is indeed intentional. This is to get a larger Transaction Fee also to the Miner. But this is my estimate. I don't really understand much about this issue. But almost two weeks ago I made a transaction and the fee was not what it is today. Or this has something to do with the BRC20 token, a token built on the Bitcoin network.Source: https://news.bitcoin.com/bitcoins-brc20-token-economy-skyrockets-192-to-279-million-in-just-four-days/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zaguru12",
      "created_time": "May 08, 2023, 06:59:40 AM",
      "body": "The transaction fee currently will bring a set back to those making payments in bitcoin. The high transaction fee will discourage the buyer and also the slow confirmation process of payment will affect the seller. The best thing is to avoid or stop making payments with bitcoin if the amount to be payed is not that much. It is not advisable to paying for a $50 worth of product or service and paying a fee close to $20 except maybe it is a cross boarder transactions and bitcoin is the only easiest way to do it. The payment method should be used to pay for large amounts but aside that one should just hold on to bitcoin and pay with fiat. With will be frustrating for the recipient of the funds if the sender has set a very low transaction fee, the transaction could even get dropped if the fee is way too low.Quote from: Luzin on May 08, 2023, 06:59:09 AMBut almost two weeks ago I made a transaction and the fee was not what it is today. Or this has something to do with the BRC20 token, a token built on the Bitcoin network.From all indications it seems both the BRC-20 and the ordinals are responsible for the congestion on the mempool. The market cap of BRC-20 is surging up as people look into it",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EarnOnVictor",
      "created_time": "May 08, 2023, 07:01:55 AMLast edit: October 05, 2023, 07:08:41 AM by EarnOnVictor",
      "body": "This is simply a challenging time for Bitcoin and those businesses that accept it and of course a rainy day for the miners.  It is bad to the extent that people have started showing their anger on the internet and some companies sending internal messages to their customers to use the alternative to avoid issues.Is this a good antecedent? I guess not. I hope that a lasting solution would be preferred to something like this especially as the Bitcoin in circulation and adoption is getting more so that it will not be a discouragement.Will this go so soon? I also guess not, this is because the causes could be due to the creation of BRC-20 on the Bitcoin blockchain and Ordinals issues as I indicated here: (https://bitcointalk.org/index.php?topic=5451799.msg62208042#msg62208042).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "May 08, 2023, 07:22:46 AM",
      "body": "Quote from: EarnOnVictor on May 08, 2023, 07:01:55 AMThis is simply a challenging time for Bitcoin and those businesses that accept it and of course a rainy day for the miners.  Rainy day? If it's raining money that would be more accurate.Miners' income has grown to nearly 33% if we consider the last few hour's averages, and we're finally around 10 cents per th/s after nearly a year of low-profit margin. Look at the bright side, the network is better protected also understand that this is a glimpse into the future when there will be no block reward and miners will have to keep mining only on fees.Quote from: Zaguru12 on May 08, 2023, 06:59:40 AMIt is not advisable to paying for a $50 worth of product or service and paying a fee close to $20 except maybe it is a cross boarder transactions and bitcoin is the only easiest way to do it. Remember that not only do you have to pay 20$ to send $50 in your example, but the one you're sending the $50 will need to spend $20 to use those coins since he has to do a tx also, so you're paying $70 so your relative can use $30.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "John Abraham",
      "created_time": "May 08, 2023, 07:42:11 AM",
      "body": "Quote from: Queentoshi on May 08, 2023, 06:45:37 AMThis season where transaction fees are really high can be a discouragement for people who were already becoming used to making payments in bitcoins at their local stores that accept payments in bitcoins. For people who have businesses that accept payments in bitcoins, how are you coping at this time when transaction fees are really high, and what adjustments have you made to try to see that people do not totally cancel out making payments in bitcoins due to this challenge.  Yeah, It's frustrating for regular Bitcoin users who make payments using Bitcoin. Some of us don't care that much because everyone doesn't use Bitcoin every day. But I don't think it will affect the business that accepts Bitcoin payments. They have nothing to do with the fees. Because whoever chooses to pay using Bitcoin has to pay the fees. Businesses are the receiver end, they don't have to do anything, and they don't have to give them change like fiat money. They have to ensure that their customer paid enough fees and that the transaction is not RBF. It will be a bit expensive for Bitcoin users if they pay a couple of dollars bills and it charges too much fees. But, I think this situation won't last for too long. The Ordinal craze will end at some point, and we should see the death of some shitcoins! I wish we had better solution to fix the current issue. These Ordinal things becoming a head ache.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sokani",
      "created_time": "May 08, 2023, 07:50:27 AMLast edit: May 08, 2023, 08:13:08 AM by sokani",
      "body": "Quote from: Queentoshi on May 08, 2023, 06:45:37 AMThis season where transaction fees are really high can be a discouragement for people who were already becoming used to making payments in bitcoins at their local stores that accept payments in bitcoins. For people who have businesses that accept payments in bitcoins, how are you coping at this time when transaction fees are really high, and what adjustments have you made to try to see that people do not totally cancel out making payments in bitcoins due to this challenge. The high transaction fees could be attributed to the BRC-20 tokens and ordinals which have flooded the Bitcoin network. The hype of BRC-20 tokens is driving a lot people crazy as many persons want to mint or transfer their tokens and this is making the network to be congested. Even binance had to announce temporary suspension of Bitcoin withdrawal due to the congestion of the network. The high transaction fees is really affecting businesses as many persons are beginning to resort to accepting or making payments in stablecoins or other altcoins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jet Cash",
      "created_time": "May 08, 2023, 07:53:48 AM",
      "body": "I'm having to back away from insisting that I'm paid in Bitcoin by my domain name buyers. The high feew, and the bear spikes in the price are discouraging potential buyers. I have also decided that I will need a 2Tb internal drive for the blockchain in my arcival node project. These ordinals are a real nuisance. Would it be possible to change the weigting for such transactions, and maybe charging them a 10x fee for inclusion in a block. Alternatively the redundant supplementary data could be stored in a side chain that only a few nodes maintained.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Luzin",
      "created_time": "May 08, 2023, 08:45:20 AM",
      "body": "Quote from: Zaguru12 on May 08, 2023, 06:59:40 AMFrom all indications it seems both the BRC-20 and the ordinals are responsible for the congestion on the mempool. The market cap of BRC-20 is surging up as people look into itIn the end, should the project on top of the bitcoin network be stopped? There are 13,500 tokens growing on the Bitcoin network. If this continues, I think many people will turn to other networks for transactions. Or will developers enlarge the scalability of the network? But this will add vulnerability to the BTC network. https://news.bitcoin.com/bitcoins-brc20-token-economy-skyrockets-192-to-279-million-in-just-four-days/Quote from: As of Sunday, May 7, 2023, the BRC20 token economy is valued at $279.07 million, with approximately 13,530 tokens in circulation. ordi, pepe, piza, meme, and moon, account for 86.55% of the 279.07 million total.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GeorgeJohn",
      "created_time": "May 08, 2023, 09:03:45 AM",
      "body": "Quote from: Queentoshi on May 08, 2023, 06:45:37 AMThis season where transaction fees are really high can be a discouragement for people who were already becoming used to making payments in bitcoins at their local stores that accept payments in bitcoins. For people who have businesses that accept payments in bitcoins, how are you coping at this time when transaction fees are really high, and what adjustments have you made to try to see that people do not totally cancel out making payments in bitcoins due to this challenge. When you are curious to get something you make everything possible for you to arrive to your target, now that the fees is high a buyer will ensure that it pays higher fees to get what it wants, unless you are not curious to buy or make payment with bitcoin it's the aspect you will find it very difficult to add an additional fees in order to make your transaction to process faster,but having it in mind that you really want to make payment with bitcoin you can't nagged or argument for a peanut charges. If you are emphasising on such way, now I want to use signatures campaign payments as point of illustrations, because the price of Bitcoin is high and fees are high also, I think they pay all the participants working on their behalf, so therefore except you don't want to make payment with bitcoin fees can't deprive you of making payment from my observation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hd49728",
      "created_time": "May 08, 2023, 09:34:21 AM",
      "body": "Quote from: Queentoshi on May 08, 2023, 06:45:37 AMThis season where transaction fees are really high can be a discouragement for people who were already becoming used to making payments in bitcoins at their local stores that accept payments in bitcoins.It is problems for business customers who will send bitcoins to those local store wallets.  The business owners only have issues if they want to consolidate their small inputs which surely they can wait to do that when fee rate is more cheaper.QuoteFor people who have businesses that accept payments in bitcoins, how are you coping at this time when transaction fees are really high, and what adjustments have you made to try to see that people do not totally cancel out making payments in bitcoins due to this challenge. Stop your Bitcoin payment method temporarily or add another method, Lightning Network that will give you cheaper transaction fee with Lightning Network channel.Electrum Lightning Network walkthrough",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hyphen(-)",
      "created_time": "May 08, 2023, 10:01:35 AM",
      "body": "Quote from: Queentoshi on May 08, 2023, 06:45:37 AMThis season where transaction fees are really high can be a discouragement for people who were already becoming used to making payments in bitcoins at their local stores that accept payments in bitcoins. For people who have businesses that accept payments in bitcoins, how are you coping at this time when transaction fees are really high, and what adjustments have you made to try to see that people do not totally cancel out making payments in bitcoins due to this challenge. The best advice right now is to put the Bitcoin payment option on hold due to network congestion, the wasted time before the transaction is confirmed, and the high transaction fee because, initially, it is an alternative mode of payment. When the mempool is free and the transaction fee is less, then the Bitcoin payment method will resume because we know it will not be a permanent thing because I am sure developers and miners will do something about this Ordinals.Quote from: EarnOnVictor on May 08, 2023, 07:01:55 AMWill this go so soon? I guess not, this is because the causes could be due to the creation of BRC-20 on the Bitcoin blockchain and Ordinals issues as I indicated here: (https://bitcointalk.org/index.php?topic=5451799.msg62208042#msg62208042).I believe developers and miners will address the BRC-20 and Ordinals issues soon because transaction congestion and high transaction fees are out of control. Miners will take almost all of the transaction fee as their reward for processing the transaction, and if you choose to set a very small transaction fee, your transaction will take a very long time to process.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "initim",
      "created_time": "May 08, 2023, 10:56:20 AM",
      "body": "The cost will be high for people paying with Bitcoin but if it is not an everyday thing, I think users will cope but if you can avoid paying using Bitcoin to pay for goods and services whenever it's high, I feel it is the best.  With Bitcoin, I want to believe that Demand is more than supply, and when supply is limited, rates will be high. It’s a law of demand and supply.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zanezane",
      "created_time": "May 08, 2023, 12:59:44 PM",
      "body": "Quote from: initim on May 08, 2023, 10:56:20 AMThe cost will be high for people paying with Bitcoin but if it is not an everyday thing, I think users will cope but if you can avoid paying using Bitcoin to pay for goods and services whenever it's high, I feel it is the best.  With Bitcoin, I want to believe that Demand is more than supply, and when supply is limited, rates will be high. It’s a law of demand and supply.I agree with you there initim. high transaction fees can be a challenge for Bitcoin users, particularly for those who frequently use Bitcoin for everyday transaction. However, it's worth noting that transaction fees for Bitcoin are not fixed and can fluctuate based on various factors such as network congestion, the size of the transaction, and the level of competition among users for block space.When transaction fees are high, users may opt to use alternative cryptocurrencies or payment methods to avoid the high fees. also, businesses that accept bitcoin may choose to adjust their prices or implement dynamic pricing strategies to account for fluctuations in transaction fees.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jawhead999",
      "created_time": "May 08, 2023, 01:18:45 PM",
      "body": "If not many people are using Bitcoin, I don't think they will trying to find a way to solve the high transaction fee. This is different with Binance where withdrawal fee is one of their main source, I read if Binance is trying to adopt lightning network, not sure if they already have implemented it or not yet. For online business, people would choose to pay using altcoins because they're more flexible and altcoins fee are cheaper.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "m2017",
      "created_time": "May 08, 2023, 01:30:11 PM",
      "body": "Quote from: iwantmyhomepaidwithbtc2 on May 08, 2023, 06:57:12 AMQuote from: Queentoshi on May 08, 2023, 06:45:37 AMThis season where transaction fees are really high can be a discouragement for people who were already becoming used to making payments in bitcoins at their local stores that accept payments in bitcoins. For people who have businesses that accept payments in bitcoins, how are you coping at this time when transaction fees are really high, and what adjustments have you made to try to see that people do not totally cancel out making payments in bitcoins due to this challenge. The buyer pays huge fees and could be ok with it: if you buy a car / house in BTC it's ok, it won't be too much of a trauma. If you're buying bread and milk, it's clearly a bit more of a pain in the ass. For these small transactions, people turn (or should turn) to LN. Or basically, the seller just put on-hold BTC as payment method if he doesn't accept payments through Lightning Network.I think that in the long run, given the mess that is the mempool on an increasingly regular basis, Lightning Network is becoming more and more necessary and justified in my opinion.After that, if it's like every time, the 1.5 BTC fee blocks shouldn't be around for too long, hopefully it will drop again soon.I can't imagine anyone paying for bread or milk with bitcoin. It's about the same as paying for these essentials with gold bars. I guess BTC is not the right currency to pay for these everyday products.Of course, there are sellers offering their goods for BTC (and these are not houses or cars), which creates an incomprehensible and difficult situation. 14-23$ per transaction is not so much now if the goods are expensive. And if the goods cost 50$, 100$, 200$? In this case, the commission turns out to be huge (especially in % ratio) and few people want to buy with such expenses, because the commission falls on the shoulders wallets of buyers.Having problems is not a bad thing. Looking for a solution, bitcoin-community can create something new that will improve BTC and prevent this unpleasant situation from happening again. And I consider high transaction fees to be just such that it will slow down progress due to the low use of the bitcoin-network by ordinary users.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "karmamiu",
      "created_time": "May 08, 2023, 01:33:16 PM",
      "body": "This has already happened so many times in the past and some merchants who trued accepting bitcion as payment didn't last that long due to the inconsistencies. Although prices can be changed depending on the product, there are still risks where it is possible that the fees could be more expensive than the price of goods. There have been various decisions already if they are going to continue or not specially right now for example where networks could be congested any time of the day and you need to push your transaction by paying more fees. Although it isn't that expensive the delays of the transaction alone can compromise the trade on the merchants.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "imamusma",
      "created_time": "May 08, 2023, 01:36:54 PM",
      "body": "Quote from: Queentoshi on May 08, 2023, 06:45:37 AMThis season where transaction fees are really high can be a discouragement for people who were already becoming used to making payments in bitcoins at their local stores that accept payments in bitcoins. For people who have businesses that accept payments in bitcoins, how are you coping at this time when transaction fees are really high, and what adjustments have you made to try to see that people do not totally cancel out making payments in bitcoins due to this challenge.When you are considering adopting bitcoin as a means of payment then I think you should also consider some altcoins to make it easier for your customers to make transactions when bitcoin transaction fees are very high. Moreover you don't need to remove fiat from payment method from your business, this will definitely help your customers to pay you without any problem.You can temporarily hold bitcoin payments as long as the transaction fees are unreasonable for small payments, but you can have your customers pay in fiat or some altcoin that has low transaction fees. So far it is a solution if you want your business to continue without any problems regarding means of payment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BIT-BENDER",
      "created_time": "May 08, 2023, 01:38:36 PM",
      "body": "Quote from: Jawhead999 on May 08, 2023, 01:18:45 PM For online business, people would choose to pay using altcoins because they're more flexible and altcoins fee are cheaper.First I don’t think neither is it a better option for online business owner to make use of the Altcoin or accept Altcoin as a means of transactions in their business regardless of how flexible it can be.#Value: the most valuable coin in Ethereum and going buy the fact that the source of this conversation was that Bitcoin transactions were high so is Ethereum transactions fee and this has been the case for Ethereum For a very long time.#readiness: there are so many altcoins to choose from and the chances of having an address ready for any Altcoin  May be too low.#stability: nothing is less stable than the price of any Altcoin so you as a business man may be making lose after  a customer must have made payment.Rather than Altcoin I would rather suggest the use of stablecoin for now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}