{
  "id": "topic_5473009",
  "title": "takuma sato",
  "author": "takuma sato",
  "created_time": "November 06, 2023, 04:40:22 AM",
  "content": "Suppose you only use Bitcoin Core on a Linux distro because you don't trust anything else, and you want to meet with someone in person, and don't do the transaction until you meet, to exchange it for cash at the rate of the physical exchange, or for a product or service. The point is, you want to make the transaction there and can't do it from home. You cannot also carry your laptop.Is there any handheld device that would make sense to use to do this transaction that doesn't stand out? Like one of these hardware wallets, that screams \"punch this guy to get free BTC\".Is there any safe device that looks like a phone that runs Linux or something? I just don't know how one would do this, unless you resort to a regular Android phone. In this case, you are already trusting some flawed hardware and software. I don't need to make a big transaction, so I guess that would be ok, however im concerned from a privacy pov. I would mix the coins at home before transacting with the person using the Android wallet. In this case, what would you do? You need to stream the transaction somehow, so you are going to need internet, and let's say there's no public wifi.. so you are going to need a phone nonetheless.Maybe having the phone as a router to connect wireless to this handheld device to make the transaction, and broadcast it through the internet data phone connection.. but how do you do this privately?I don't see how I would do this. I would like how people do this.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5473009",
  "comments": [
    {
      "author": "seek3r",
      "created_time": "November 06, 2023, 06:49:00 AM",
      "body": "Quote from: takuma sato on November 06, 2023, 04:40:22 AMIs there any handheld device that would make sense to use to do this transaction that doesn't stand out? Like one of these hardware wallets, that screams \"punch this guy to get free BTC\".There are a few options for that. An option for example would be the Coldcard Q1 from Coinkite which should be released soon.If you're considering a more phone-like device that runs Linux, there are several Linux-based smartphones that might meet your privacy and security needs while providing a conventional smartphone appearance.The Fairphone comes as a complete degoogled device and runs a Androind system by default. These smartphones are really designed for privacy and the protection of your own data.Certain Linux based OS, such as Ubuntu Touch or PostmarketOS, can be easily flashed onto these devices. There are other OS being advertised but I can't comment on them due to lack of experience.In addition to the Fairphone, there are also other providers: the Liberty Phone which comes from the American manufacturer Purism but costs more than three times as much as the Fairphone.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitMaxz",
      "created_time": "November 06, 2023, 07:04:42 AM",
      "body": "I don't get your point. laptop can be brought anywhere you want so why not bring it and only deal with someone in a safe place like a mall? Or if you don't want to bring your Laptop then the only solution for your problem is to make a signed transaction(offline transaction) first in your house(don't forget to ask him about the price and BTC address)and don't broadcast it yet get the raw/hex code and paste it to your phone or any device that you can bring. Now you can meet someone in person and only broadcast the transaction when you deal successfully with him but if not don't broadcast the transaction.Here's the list of broadcasting sites below.- https://en.bitcoin.it/wiki/Transaction_broadcastingIf you want it private don't forget to mix your coins at home before you make a raw transaction with Bitcoin Core.Alternatively, you can make a portable Raspberry Pi with Linux installed you can bring it anywhere you want.Here's what it looks like https://youtu.be/MorJLzybb3I?si=Nw-1QH7RsqFdVp3y",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o_e_l_e_o",
      "created_time": "November 06, 2023, 08:16:31 AM",
      "body": "Quote from: takuma sato on November 06, 2023, 04:40:22 AMMaybe having the phone as a router to connect wireless to this handheld device to make the transaction, and broadcast it through the internet data phone connection.. but how do you do this privately?You have various options to do this privately.You can run a hot wallet, which is pointed at your node running back home, such as Electrum. Transfer the coins you want to trade from Bitcoin Core to your mobile Electrum wallet before you go, and then make the transaction from Electrum to your trading partner while you are out. Everything goes via your own node.For extra security, you can do the above with a watch only wallet and a separate airgapped wallet. Run a watch only wallet on your phone pointed at your own node running back home. Also take with you either a hardware wallet containing the funds you want to trade, or a second phone in airplane mode with your coins stored on it. You could do this with Electrum on two phones, or with a hardware wallet such as Passport and their accompanying Envoy app.As BitMaxz has said, you can sign the transaction in advance if you know the address and amount, and take the signed transaction with you on your phone. Either broadcast via your own node, or via Tor using mempoolhqx4isw62xs7abwphsq7ldayuidyx2v2oethdhhj6mlo2r6ad.onion",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "apogio",
      "created_time": "November 06, 2023, 08:53:18 AM",
      "body": "Quote from: takuma sato on November 06, 2023, 04:40:22 AMSuppose you only use Bitcoin Core on a Linux distro because you don't trust anything else, and you want to meet with someone in person, and don't do the transaction until you meet, to exchange it for cash at the rate of the physical exchange, or for a product or service. The point is, you want to make the transaction there and can't do it from home. You cannot also carry your laptop.Is there any handheld device that would make sense to use to do this transaction that doesn't stand out? Like one of these hardware wallets, that screams \"punch this guy to get free BTC\".Is there any safe device that looks like a phone that runs Linux or something? I just don't know how one would do this, unless you resort to a regular Android phone. In this case, you are already trusting some flawed hardware and software. I don't need to make a big transaction, so I guess that would be ok, however im concerned from a privacy pov. I would mix the coins at home before transacting with the person using the Android wallet. In this case, what would you do? You need to stream the transaction somehow, so you are going to need internet, and let's say there's no public wifi.. so you are going to need a phone nonetheless.Maybe having the phone as a router to connect wireless to this handheld device to make the transaction, and broadcast it through the internet data phone connection.. but how do you do this privately?I don't see how I would do this. I would like how people do this.According to the red text above, you are reluctant to use an android phone, because of privacy.As oeleo stated above, connecting to your own node will fix this issue.However, the best answer in my opinion is the one by BitMaxz. Sign the tx beforehand from your home. Take the tx id with you in any form you wish (android, paper, usb, sd card). There, you can broadcast the tx, or you can even give it to them to broadcast it. The broadcasting of a signed tx is a feature available in almost every wallet software.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LoyceV",
      "created_time": "November 06, 2023, 10:29:39 AM",
      "body": "Quote from: takuma sato on November 06, 2023, 04:40:22 AMYou cannot also carry your laptop.Why not?QuoteIs there any handheld device that would make sense to use to do this transaction that doesn't stand out?Yes. It's called a laptop Quote from: BitMaxz on November 06, 2023, 07:04:42 AMthe only solution for your problem is to make a signed transaction(offline transaction) first in your house(don't forget to ask him about the price and BTC address)I can think of many potential problems. What if:Transaction fees went up between creating the transaction and meeting in person?You buy something at a shop and their automated payment system won't be able to give you an address and exact amount before making the payment?The seller doesn't want to email you a Bitcoin address for various reasons?@OP: I use different wallets for different purposes. The purpose of mobile wallets is convenience for small amounts. You simply can't have it all with Bitcoin Core.I often bring a laptop, not for making Bitcoin transactions but for other purposes. Nobody bats an eye if you pull out a laptop somewhere. Tether a hotspot on your phone and you have your own internet connection with you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "seek3r",
      "created_time": "November 06, 2023, 10:53:04 AM",
      "body": "Quote from: LoyceV on November 06, 2023, 10:29:39 AMI can think of many potential problems. What if:Sorry to step in but I would like to address your problems:Quote from: LoyceV on November 06, 2023, 10:29:39 AMTransaction fees went up between creating the transaction and meeting in person?This could be fixed by using the RBF-feature(Replace-by-fee) in Bitcoin Core. The requirement for this is that you activate the option when signing the transaction. By default, RBF is not activated. This is no longer possible afterwards!The Full-RBF feature should be implemented by version 24.0Quote from: LoyceV on November 06, 2023, 10:29:39 AMYou buy something at a shop and their automated payment system won't be able to give you an address and exact amount before making the payment?Yeah.. not the best condition to sign the transaction offline. I think in this case you have to use a mobile wallet.Quote from: LoyceV on November 06, 2023, 10:29:39 AMThe seller doesn't want to email you a Bitcoin address for various reasons?In that case, I would still suggest that he perhaps encrypt the emails using PGP so that the seller feels more secure.Another alternative would be other encrypted messengers.Even if that wasn't an option for him, as in question/problem 2, I see no other option than to carry out the transaction face-to-face while using a mobile wallet.However, as a buyer I would be suspicious in that case aswell as PGP encryption has proven itself over the years. So it makes no sense to me to reject the suggestion.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LoyceV",
      "created_time": "November 06, 2023, 11:00:01 AM",
      "body": "Quote from: seek3r on November 06, 2023, 10:53:04 AMQuote from: LoyceV on November 06, 2023, 10:29:39 AMTransaction fees went up between creating the transaction and meeting in person?This could be fixed by using the RBF-feature(Replace-by-fee) in Bitcoin Core.That doesn't help you if you brought a signed transaction to a meeting, and left your Bitcoin Core at home.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hosemary",
      "created_time": "November 06, 2023, 11:09:48 AM",
      "body": "Quote from: seek3r on November 06, 2023, 10:53:04 AMQuote from: LoyceV on November 06, 2023, 10:29:39 AMTransaction fees went up between creating the transaction and meeting in person?This could be fixed by using the RBF-feature(Replace-by-fee) in Bitcoin Core. When you increase the fee, the transaction data changes, the signature becomes invalid and it's like that you are making a new transaction. If OP wants to sign the transaction again, he/she would have to get back home as he wouldn't have access to his/her laptop out of the home.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "seek3r",
      "created_time": "November 06, 2023, 11:15:55 AM",
      "body": "Quote from: LoyceV on November 06, 2023, 11:00:01 AMThat doesn't help you if you brought a signed transaction to a meeting, and left your Bitcoin Core at home.Yes, of course. I know what you're getting at.But the OP will have to use something to be able to transfer his transaction, won't he? Of course there are other wallets that support RBF, but he explicitly said that he only trusts Bitcoin Core on Linux.Quote from: hosseinimr93 on November 06, 2023, 11:09:48 AMWhen you increase the fee, the transaction data changes, the signature becomes invalid and it's like that you are making a new transaction. If OP wants to sign the transaction again, he/she would have to get back home as he wouldn't have access to his/her laptop out of the home. This is correct if you did not allow the RBF feature when signing the transaction. Just as it is set by default.However, if it is activated and the transaction is signed, there is a possibility that the transaction can later be replaced with a newer version with a higher fee.At least that was my understanding, but I haven't had any practical experience with it yet. Please correct me if I misunderstood the feature and how it works irl.EDIT: Ok, I must have had a long brain lag.   Of course you're right @hosseinimr93. Because it acts like a new transaction with a different hash, it must be re-signed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hosemary",
      "created_time": "November 06, 2023, 11:25:43 AM",
      "body": "Quote from: seek3r on November 06, 2023, 11:15:55 AMBut the OP will have to use something to be able to transfer his transaction, won't he? There are many online tools that can be used for that. All you need to do is copy the raw (signed) transaction to your mobile and broadcast it using any of the avaliable tools. In this way, you don't need to have your private keys in your mobile phone and that's what OP is trying to achieve.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LoyceV",
      "created_time": "November 06, 2023, 11:43:55 AM",
      "body": "Quote from: ETFbitcoin on November 06, 2023, 11:40:44 AMLinux Laptop installed with \"hacker UI\" would make it stand out . Although it's trivial problem since you could just not use terminal.Install a privacy filter on your screen. Or does that make you stand out too?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "seek3r",
      "created_time": "November 06, 2023, 11:49:53 AM",
      "body": "Quote from: ETFbitcoin on November 06, 2023, 11:40:44 AMI can't believe it's more expensive than recently released iphone 15 pro max 1tb which has price $1599.Yes, that's really crazy, especially when you look at the specs of the phone.To compare this with the Fairphone 5 just from a memory perspective: The Fairphone has twice as much RAM (8GB vs 4GB) and also twice the memory (256GB vs 128GB).They probably justify the price with their advertising where they proudly claim that a smartphone is \"built outside China\".",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaveF",
      "created_time": "November 06, 2023, 12:31:34 PM",
      "body": "There are a lot of devices like this out there: https://www.amazon.com/Industry-Portable-Computer-Notebook-Graphics/dp/B07QYZHM8FI know running core on that would not work it's just the 1st one I found with a quick search.Small enough to fit in a jacket pocket and you just look like a nerd / geek with an oddball computer.There are a ton of other 'pocket computers' out there. Just how much do you want to spend.If you are worried about your phone now being secure but you only do a couple of $200 transactions a year the payback time is long.If you are doing a couple of $1000 transactions a week it's a different story.-Dave",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LoyceV",
      "created_time": "November 06, 2023, 02:26:05 PM",
      "body": "Quote from: DaveF on November 06, 2023, 12:31:34 PMThere are a lot of devices like this out there: https://www.amazon.com/Industry-Portable-Computer-Notebook-Graphics/dp/B07QYZHM8FIt has a 6\" screen and weighs 1.03 pounds. This is designed for specific industrial applications. For me, 10\" is the minimum to be able to type \"normally\". That brings me into the netbook category, but most of them lack RAM capacity.How about a good old paper wallet? Bitaddress.org is the easiest, but doesn't support Segwit. You can encrypt it with BIP38, and fund it with approximately the amount of Bitcoin you're going to need. When completing the trade, your trade partner can just sweep your private key from his own mobile device.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaveF",
      "created_time": "November 06, 2023, 02:48:05 PM",
      "body": "Quote from: ETFbitcoin on November 06, 2023, 01:50:31 PMQuote from: DaveF on November 06, 2023, 12:31:34 PMThere are a lot of devices like this out there: https://www.amazon.com/Industry-Portable-Computer-Notebook-Graphics/dp/B07QYZHM8F--snip--That's interesting idea. But i worry with small screen and high resolution (since expensive one usually have bigger resolution and better specification), that would make font on Bitcoin Core GUI is barely or even not readable unless your eyes is extremely close to the screen.<cough>CLI</cough>If it's not for regular use for a few minutes of dealing with a very difficult screen setup is probably not the worst.And if you know where you are sending the BTC and the amount you can pre-populate it at home and just hit send once you get a wi-fi signal wherever you are doing the exchange.-Dave",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackHatCoiner",
      "created_time": "November 06, 2023, 07:34:33 PM",
      "body": "Quote from: takuma sato on November 06, 2023, 04:40:22 AMIs there any safe device that looks like a phone that runs Linux or something?Over a dozen billion, called smartphones.  No, seriously. Look. If you sell small amounts of bitcoin, then getting yourself a Pixel with GrapheneOS installed wouldn't be a bad idea. It comes a lot cheaper than Fairphone. The TL;DR of Graphene is that it focuses on security and privacy. That can work, and it doesn't make you look like a socially awkward fella with Arch Linux, having an NSFW anime-girl wallpaper. (No offense to those who do!   )But seriously, why not a laptop? Having an Electrum wallet, running Ubuntu doesn't tell me anything. We are not living in the 00s anymore.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "takuma sato",
      "created_time": "November 07, 2023, 03:12:26 AM",
      "body": "For those that ask why I don't want a laptop, beside it just not being convenient to carry around, I don't want to look like an high level nerd. You see, the problem is, you never know who you are dealing with, a laptop is typically a place you would store more BTC than a mobile device, where one would expect to carry pocket change, so you want to minimize this risk. Let alone those Coldcard type devices. Those make stand out like someone that is invested into this way too much. If you are a regular fella with a fashionable android phone, it's a much better look than showing up with some fancy, strange device that looks like some sort of Bitcoin-only device. Im going to look at the Fairphone thing. Im familiar with Purism, their prices are a scam, they get massive cuts for what it is. Im going to also need to know what OS to install in there. Someone mentioned Graphene but this is only for the Google Pixel for some reason, im not buying a Google phone. I have a dated Samsung Galaxy for a phone, does the trick. I don't even know what Android version this uses. Im not familiar with phones.Btw, what I meant with this thread, wasn't to say, I want to use Bitcoin Core on a phone, I can reasonably compromise, I just want to do it properly. I will mix at home, get the amount to use ready, and put it into mobile Electrum or whatever. Im not going to know the address until I arrive, so I cannot sign it at home. Then I also need to sort out how to transfer this through Tor from the phone. What I don't like is the traces that this would leave in terms of, imagine you lose your phone somewhere or something. Since im not familiar with phones, I don't know what to expect if that happens. Could some experienced phone users comment on this whole process?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "November 07, 2023, 06:53:59 AM",
      "body": "Quote from: BlackHatCoiner on November 06, 2023, 07:34:33 PMBut seriously, why not a laptop? Having an Electrum wallet, running Ubuntu doesn't tell me anything. We are not living in the 00s anymore. It is quite difficult to lug around everywhere (unless it's a macbook air or something else that's light), requires a WiFi access point, is inconvenient for scanning QR codes and is overall quite cumbersome to use for making payments when you're on the street.That's why your other suggestion about getting a GrapheneOS phone is a much better idea.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ABCbits",
      "created_time": "November 07, 2023, 09:16:10 AM",
      "body": "Quote from: DaveF on November 06, 2023, 02:48:05 PMQuote from: ETFbitcoin on November 06, 2023, 01:50:31 PM--snip--That's interesting idea. But i worry with small screen and high resolution (since expensive one usually have bigger resolution and better specification), that would make font on Bitcoin Core GUI is barely or even not readable unless your eyes is extremely close to the screen.<cough>CLI</cough>If it's not for regular use for a few minutes of dealing with a very difficult screen setup is probably not the worst.And if you know where you are sending the BTC and the amount you can pre-populate it at home and just hit send once you get a wi-fi signal wherever you are doing the exchange.-DaveAverage people don't use CLI. And i just remember most OS have option to increase display scaling, which usually problem about small screen with big resolution.Quote from: takuma sato on November 07, 2023, 03:12:26 AMThen I also need to sort out how to transfer this through Tor from the phone.Install Orbot on your Android phone. The default setting use \"full device VPN\" mode which means all application use Tor network.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}