{
  "id": "topic_5453303",
  "title": "Csmiami",
  "author": "Csmiami",
  "created_time": "May 19, 2023, 02:26:15 PM",
  "content": "",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5453303",
  "comments": [
    {
      "author": "Csmiami",
      "created_time": "May 19, 2023, 02:26:30 PM",
      "body": "RESERVADO PARA FUTURAS OCASIONES",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Csmiami",
      "created_time": "May 31, 2023, 02:40:34 PM",
      "body": "Para todo aquel que no lo sepa, con motivo de celebrar nuestro tercer aniversario, hemos organizado una \"competicion\" con 5.000$ en premios junto con WOLF! Dejo detalles aqui mismo: News post: https://www.btcgosu.com/blog/news/announcing-the-btcgosu-3rd-anniversary-giveaway-win-your-share-of-e5000-in-prizes/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Csmiami",
      "created_time": "June 28, 2023, 11:19:03 AM",
      "body": "Bueno, pues para todo aquel que no siga mucho el hilo principal; anunciar que por segundo año consecutivo hemos ganado el título de cripto afiliado del año en los premios de AffPapa!Teniendo en cuenta que tenemos apenas 3 años en funcionamiento, y los premios coinciden con nuestra fundación; hemos hecho un absoluto pleno desde que abrimos las puertas. Obviamente no habria sido posible hacer esto sin vosotros (y la gente del norte, claro). Y para finalizar, pequeño recordatorio de la promoción de aniversario que tenemos ahora en marcha para celebrar nuestro aniversario, para la que solo hay que depositar 50$ en Wolf.bet  para conseguir tickets para un macro sorteo!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Csmiami",
      "created_time": "September 04, 2023, 03:12:59 PM",
      "body": "Bueno, pues parece ser que este verano toca hablar de casinos que se desmoronan.Algunos recordareis hace no tanto lo vivido con betnomi en el mes de julio/agosto; cuando cerraron las puertas y no han dado señales de vida desde entonces:Estafa de salida de Betnomi: Los usuarios se quedan en el limbo por el cierre del operador de criptoapuestasAhora, desde hace un par de dias, el casino chips.gg ha colgado el mismo cartel de mantenimiento; aunque se está viendo que lo que hay detrás son varias disputas internas con manipulaciones de por medio: El casino Chips.gg se sume en el caos: Acusaciones del Cofundador y Mantenimiento InesperadoCoged palomitas, que viene drama de sobra",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "darbitmobilerecovery",
      "created_time": "September 05, 2023, 09:50:51 PM",
      "body": "Quote from: Csmiami on September 04, 2023, 03:12:59 PMBueno, pues parece ser que este verano toca hablar de casinos que se desmoronan.Algunos recordareis hace no tanto lo vivido con betnomi en el mes de julio/agosto; cuando cerraron las puertas y no han dado señales de vida desde entonces:Estafa de salida de Betnomi: Los usuarios se quedan en el limbo por el cierre del operador de criptoapuestasAhora, desde hace un par de dias, el casino chips.gg ha colgado el mismo cartel de mantenimiento; aunque se está viendo que lo que hay detrás son varias disputas internas con manipulaciones de por medio: El casino Chips.gg se sume en el caos: Acusaciones del Cofundador y Mantenimiento InesperadoCoged palomitas, que viene drama de sobraInteresante, estaba al tanto de lo de Betnomi, pero no asi de lo de chipsgg.Respecto a esta cantidad de \"caidas\" tambien creo que muchas empresas del ambiente estan sufriendo lo largo de este bearmarket, tal vez muchas hicieron un calculo a futuro que al final no dio el objetivo planificado. Logicamente me estoy refiriendo a cosas que no funcionaron y no a Scams hechos adrede.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Csmiami",
      "created_time": "September 05, 2023, 10:13:48 PM",
      "body": "Quote from: darbitmobilerecovery on September 05, 2023, 09:50:51 PMInteresante, estaba al tanto de lo de Betnomi, pero no asi de lo de chipsgg.Como dato adicional, el casino ha retomado actividades esta misma tarde, pero no he visto ninguna clase de comunicado explicando lo que ha pasado; que sinceramente, sabiendo como ha ido todo, es un poco lo minimo que se esperaria...Esta mencionado en otro hilo de nuestra IA local, pero aparte de esto ayer Stake sufrio un hackeo, asique fue un dia movidito.No creo tanto que sea problema del bear market, ya que la mayoria de apuestas acaban pasando en divisa fiat, por lo que una apuesta de 0.2$ en btc, van a seguir siendo 0.2$ independientemente del precio.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Don Pedro Dinero",
      "created_time": "September 17, 2023, 01:08:43 PM",
      "body": "Quote from: Csmiami on September 04, 2023, 03:12:59 PMBueno, pues parece ser que este verano toca hablar de casinos que se desmoronan.Algunos recordareis hace no tanto lo vivido con betnomi en el mes de julio/agosto; cuando cerraron las puertas y no han dado señales de vida desde entonces:Estafa de salida de Betnomi: Los usuarios se quedan en el limbo por el cierre del operador de criptoapuestasAhora, desde hace un par de dias, el casino chips.gg ha colgado el mismo cartel de mantenimiento; aunque se está viendo que lo que hay detrás son varias disputas internas con manipulaciones de por medio: El casino Chips.gg se sume en el caos: Acusaciones del Cofundador y Mantenimiento InesperadoCoged palomitas, que viene drama de sobraApunta otro candidato en la lista: richy.casino.Tienen una acusación de estafa y la cuenta que les representaba, justo desde que apareció el hilo en Scam Accusations, no ha vuelto a conectarse al foro. En su hilo oficial hay varios casos de gente quejándose de que no pueden retirar, según el casino por supuestos problemas técnicos. Pero es que hay un montón de cosas que no van, como los códigos de promoción o el soporte, que algunas veces puedes contactar con ellos y otras no.Desde la primera queja el 5 de septiembre no tenemos noticias de nadie que haya podido retirar sus fondos, y ya indagando un poco gracias a stompix vemos que llevan tiempo funcionando fuera del foro con quejas similares y ya lo que se lleva la palma es lo siguiente:Quote from: stompix on September 17, 2023, 10:47:24 AM<...> while diggin' around I've found out there have been a richy fish, a richy fox, a richy leo and a richy farmer casino, all four of them ending in scams.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "famososMuertos",
      "created_time": "September 17, 2023, 06:08:41 PM",
      "body": "Si mal no recuerdo ese casino chips.gg fue el que otorgó un Tesla a un usuario del foro por una de sus promociones iniciales.Es bueno verle online nuevamente. Y betnomi.bet es lo mismo que betnomi.com (?)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Csmiami",
      "created_time": "September 18, 2023, 02:34:19 PM",
      "body": "Quote from: Don Pedro Dinero on September 17, 2023, 01:08:43 PM----Este tema es un poco aveces el de siempre. Hace falta regular este sector, pero la gente tiende a estar en contra aunque con ello se pueda conseguir una mayor \"fiabilidad\" del servicio....Quote from: famososMuertos on September 17, 2023, 06:08:41 PM----Betnomi.bet y .com son la misma pagina. Una se creo para migrar la base de usuarios mientras se trabajaba en la otra, pero me suena que en ese mismo movimiento borraron todos los datos de los afiliados, rompiendo los contratos. Lo de chips y el tesla, no se si fue alguien del foro, pero si que el mayor jugador que se ha descubierto ahora que era uno de los admin habia \"ganado\" uno; por lo que el rizo se riza",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "famososMuertos",
      "created_time": "September 18, 2023, 10:51:40 PM",
      "body": "Quote from: Csmiami on September 18, 2023, 02:34:19 PM----... Lo de chips y el tesla, no se si fue alguien del foro, pero si que el mayor jugador que se ha descubierto ahora que era uno de los admin habia \"ganado\" uno; por lo que el rizo se riza+1Bueno, se ven ganancias no corazones...El \"X\" sigue vivo y no me refiero con el \"X\" la connotación del individuo, que bien puede entenderse en este caso, sino al nuevo nombre de la red social, por lo que \"no borrado\"x\"\" para evitar confusiones:Fuente:https://twitter.com/chipsgg/status/1317142037234266112Ese es el usuario del foro que ganó. Recordé que hice hice un tópico con ese tema, #3, de ahí me permitió conseguir la fuente mostrada.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Csmiami",
      "created_time": "October 25, 2023, 06:16:04 PM",
      "body": "¿Qué ocurre cuando un jugador gana la friolera de 120.000$ (o 3.5BTC para nosotros) y el casino decide que no paga? Pues eso exactamente ha ocurrido esta semana, con la mala suerte del casino de habernos hecho la jugada a los miembros de BTCGOSU!Puedes leer nuestro comunicado \"de prensa\" en el siguiente enlace:https://www.btcgosu.com/es/blog/noticias/practicas-poco-eticas-alerta-casino-leebet-acciones-preocupantes/Y queda maravillado con la victoria en este otro:https://www.btcgosu.com/es/win-images/sweet-bonanza-120000-win-leebet-biggest-gosu-win-ever/Para los interesados en como se desarrolla esto en directo, el hilo a seguir en el foro es el siguiente:https://bitcointalk.org/index.php?topic=5449263.msg63046493#msg63046493",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "darbitmobilerecovery",
      "created_time": "October 25, 2023, 09:47:27 PM",
      "body": "Bueno por un lado felicitaciones por semejante WIN, debe ser increible ganar esa cantidad, seguro saltabas hasta el techo de la emocion.Por el otro una trsiteza inmensa ver que no te lo entrgan, y la verdad habla muy mal del casino, vi el hilo y veo que tienen una clausula realmente nefasta de limite por mes, y como bien explica ahi, debe ser por una cuestión de que estan super cortos de fondos.Espero que se resuelva en su favor y puedan obtener el premio.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DdmrDdmr",
      "created_time": "October 26, 2023, 06:48:01 AM",
      "body": "Quote from: Csmiami on October 25, 2023, 06:16:04 PM<…>No sé cómo acabará la historia, pero en lo relativos a las extraordinarias ganancias de 120K $, ahora desaparecidas en el balance de la cuenta y a la espera de acontecimientos, como sigan aplicando la restricción de 10K $ de retiros por mes, es estar un año entero con el corazón en un puño por saber si se podrá llegar realmente a sacar todo. Eso siendo optimista, y que resuelvan el estado del balance con diligencia, amén de no petárselo todo en apuesta (las restricciones antes salió bien según narra el hilo, pero no creo que sea la norma).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "famososMuertos",
      "created_time": "October 27, 2023, 06:25:05 PM",
      "body": "En BTCGOSU, nos enorgullecemos de ser jugadores primero, y afiliados después.Definitivamente gran golpe, y en ambos sentidos, por la ganancia y luego verse con la noticia de, no todo ahora.QuoteHay Casinos que permiten apuestas en los slots de miles de dólares, $1000, $2000 por giros, pero sin duda comprar los bonus son una buena vía para estar en la \"jugada\" con una inversión o tamaño de apuesta mejor adaptada al bankroll.El multiplicador fue de 1495x pero la ganancia real fue de 15x(14.959, según datos) para ese compra de bono.Le he visto al Gosu mayor mejores multiplicadores pero por debajo de los $10 por giro, sin duda que esta es una gran hit. En todo caso creo que el monto es BTC, y dado las circunstancias actuales no me extrañaría que le paguen antes. Por ahora lo veo en \"dulce o truco\" y le salió Truco.No estamos como para ese tipo de comentarios pero algo que debería ser celebración se ve apañada.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Csmiami",
      "created_time": "October 27, 2023, 07:12:57 PM",
      "body": "Quote from: darbitmobilerecovery on October 25, 2023, 09:47:27 PM----Ojala hubiera sido un hit mio, aunque por fortunar, me intento mantener lo mas alejado posible de apostar; y mucho menos hacer una sola apuesta de 8.000$, que no es poca cantidad....Quote from: DdmrDdmr on October 26, 2023, 06:48:01 AM----Desaparecidas me parece que no han llegado a estar; o por lo menos el balance se ha podido ver en la cuenta en la mayoria de momentos (igual una pequeña caida de server?). El problema principal es la proporcionalidad; dejamos que la gente se funda mas de 5.000€ por tirada, si pierden maravilloso, pero si ganan les restringimos a 10.000, y con suerte, en lo que llamamos \"rage betting\", se terminan de fusilar el resto de la cantidad. Realmente esperar un año entero, con suerte, para recibir el premio en su totalidad es una barbaridad, y lo mas probable es que no acabe llegando todo porque ahora de memoria desconozco si este casino permite establecer periodos de autoexclusion para apostar, de ser asi es mas sencillo y es una especie de salario...dandole vueltas para que suene bonitoQuote from: famososMuertos on October 27, 2023, 06:25:05 PM------Pues si, la verdad que de haber pegado un multi como los que este hombre nos tiene acostumbrados en pragmatic, con un x3.000 o hasta el max win de x5.000... estariamos hablando de practicamente medio millon (entre 240 y 400k).De momento parece que hay un compromiso por parte del casino de pagar mensualmente, pero sigue siendo un año entero en el mejor de los casos, cosa que enfin. Actualizaré próximamente el blog con la resolucion",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DdmrDdmr",
      "created_time": "October 29, 2023, 03:37:27 PM",
      "body": "Pensaba que coexistían ambos problemas: el de las restricciones mensuales en los retiros, y el hecho de que el ganado llegó a ver su cuanta a cero en cierto momento, tal y como indica en la nota de actualización a pie de este post. No tenía claro si este aspecto estaba resuelto (do del balance) al escribir mi post anterior, pero ahora me queda claro que sí.En lo relativo al límite en el retiro mensual que tienen, no he visto archivos de la página de las TOS para poder comprobar el tiempo que tienen el redactado de la cláusula 9.6 tal y como figura. Ellos indican que lleva sí desde hace tiempo, pero no he podido ver desde cuándo exactamente:Quote9.6. In cases when your balance is at least 10 times larger than the total sum of your deposits, you will be limited to € 5,000 (or currency equivalent) for withdrawal per month. In other cases the maximum withdrawal amount per month is € 10,000.Vista la cláusula, uno se pregunta naturalmente si esto es habitual en los casinos, o si bien éste en concreto tiene dicha cláusula restrictiva y los demás no (conozco poco el mundillo de las apuestas). Uno diría que retiros de peso podrían estar más controlados (incluso para evitar desfalcos deshonestos), pero que las comprobaciones podrían ser ágiles. La restricción suena más a querer controlar los daños al casino de los premios grandes que otra cosa, y puede que, por ello, no sea de los casinos con una estructura de negocio tremendamente sobrada.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Don Pedro Dinero",
      "created_time": "November 11, 2023, 02:26:36 PM",
      "body": "Subo el hilo porque hay unas cuantas acusaciones de estafa sin resolver en la sección Scam Acusattions del norte respecto de BC.GAME, que tiene feedback positivo de efialtis por buena colaboración con BTCGOSU. Las acusaciones en algunos casos no se responden, o no lo hacen adecuadamente en dos casos Casino Guru ha fallado a favor de los jugadores. Mejor que lo tengáis el cuenta y sigáis cómo va el tema. Otro usuario y yo estamos pensando en hacer un hilo resumen con las varias acusaciones no resueltas satisfactoriamente que están desperdigadas.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}