{
  "id": "topic_5436542",
  "title": "GldLnRjng",
  "author": "GldLnRjng",
  "created_time": "January 24, 2023, 01:26:50 AM",
  "content": "https://bitcoinbounties.org/This site from coinkite provide an aggregation of the bounties currently opened for the development of the Bitcoin environment.I'm sure a lot of you already knew but maybe others don't.This is a brilliant idea to optimize the efforts carried on by the community.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5436542",
  "comments": [
    {
      "author": "NotATether",
      "created_time": "January 24, 2023, 11:44:40 AM",
      "body": "When I first saw this website I thought you were linking a bounty campaigns portal. So the listing of jobs I saw there comes at a pleasant surprise. There are only a handful of bounties there though. I wonder if there are other (bigger?) sites like this.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "un_rank",
      "created_time": "January 24, 2023, 12:17:42 PM",
      "body": "The website looks clean, and gets extra points cause it is default on darkmode. It is a brilliant idea for crypto users to get rewarded for their skills and efforts. Maybe Project Development board fits this better.Would there be other platforms like this, but for those who are not as skilled in tech? More like for other freelancers like writers, translators etc.- Jay -",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joniboini",
      "created_time": "January 25, 2023, 12:15:30 PM",
      "body": "Quote from: NotATether on January 24, 2023, 11:44:40 AMThere are only a handful of bounties there though. I wonder if there are other (bigger?) sites like this.I know many altcoins sites like this, such as Hackenproof/Gitcoin but most Bitcoin-related bounties seem to be lacking in activity. I find https://nydig.com/bounties by searching on Google. Not sure if you already know about it, it seems to be well-maintained, albeit not bigger than what OP linked above. Quote from: un_rank on January 24, 2023, 12:17:42 PMWould there be other platforms like this, but for those who are not as skilled in tech? More like for other freelancers like writers, translators etc.I think there are dozens of freelancing websites that pay you in crypto such as LaborX. I never try them myself, so I can't comment on their reliability. I'm pretty sure you can find online reviews or compare other websites easily though.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "un_rank",
      "created_time": "January 25, 2023, 12:26:55 PM",
      "body": "Quote from: joniboini on January 25, 2023, 12:15:30 PMI think there are dozens of freelancing websites that pay you in crypto such as LaborX. I never try them myself, so I can't comment on their reliability. I'm pretty sure you can find online reviews or compare other websites easily though.I am not aware of any, so thank you for the recommendation pointer. I just checked out the site and it seems a lot like the regular freelance websites such as fiverr or upwork, but with less activity. Hopefully it turns out to be a bit more privacy inclined than them.Just to check, am I on the right website[1]?Code:[1] https://laborx.com/jobs- Jay -",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "2double0",
      "created_time": "February 02, 2023, 12:07:04 PM",
      "body": "Quote from: un_rank on January 25, 2023, 12:26:55 PMQuote from: joniboini on January 25, 2023, 12:15:30 PMI think there are dozens of freelancing websites that pay you in crypto such as LaborX. I never try them myself, so I can't comment on their reliability. I'm pretty sure you can find online reviews or compare other websites easily though.I am not aware of any, so thank you for the recommendation pointer. I just checked out the site and it seems a lot like the regular freelance websites such as fiverr or upwork, but with less activity. Hopefully it turns out to be a bit more privacy inclined than them.Just to check, am I on the right website[1]?Code:[1] https://laborx.com/jobs- Jay -Upwork works best but you need to be reputed or know how to gamble with your credits so to get landed on a job of your choice. Once you prove your creditworthiness, you won't need much recognition and some employers employ you directly.OP's site is OG and the bounties provided are worth it, I'm amazed to see that a website gives bounties in btc for what the user has asked to be done. I don't know if they use escrow system and block the given btc value from the employer's account till the bounty ends or someone completes the job, can anyone shed some light on this?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "February 02, 2023, 12:20:37 PM",
      "body": "Quote from: 2double0 on February 02, 2023, 12:07:04 PMUpwork works best but you need to be reputed or know how to gamble with your credits so to get landed on a job of your choice. Once you prove your creditworthiness, you won't need much recognition and some employers employ you directly.If I recall correctly, you also need to have a bank account to make withdrawals, right? So it's not very crypto friendly.I was going to ask, do you have any tips on improving your creditworthiness? I don't have an account there, but I have experience with other P2P job offers so I want to hear your experience on this.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pmalek",
      "created_time": "February 02, 2023, 07:35:51 PM",
      "body": "There is very little activity there unfortunately. Two bounties posted in December 2022 and the one before that dates back to February 2022.An interesting site. It would have been even better if there was more variety of the gigs. Marketing, graphic design, translating, content writing...Quote from: NotATether on February 02, 2023, 12:20:37 PMIf I recall correctly, you also need to have a bank account to make withdrawals, right? So it's not very crypto friendly. There is no support for crypto. You can also link your PayPal account. I can't remember if they support Skrill or not, but the payments don't have to go directly to your bank. You should know that you have to purchase credits and pay for a chance to land a job. The site takes a decent chunk our of your profit and so does PayPal later on.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Accardo",
      "created_time": "February 03, 2023, 06:19:54 PM",
      "body": "It's a good initiative for the bitcoin tech and development niche, their rewards are also nice for developers. Though, the site is easy to use, but the number of giggs there are few, we hope the idea booms and more projects starts offering bounties for developers to join. Things that affect such sites is less publicity. If they worked on the site's SEO it'll get to developers and brands that needs the help of developers. But, if the site continues gradually given time depending on the quality it provides would boom. I've not seen this kind of bounty site, but if more niches other than project development like marketing; SEO, social media management etc. It would lead to great publicity since people are mainly focused on that field with larger amount of giggs everyday on top sites like Fiver and topwork.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "2double0",
      "created_time": "February 03, 2023, 06:38:13 PM",
      "body": "Quote from: NotATether on February 02, 2023, 12:20:37 PMQuote from: 2double0 on February 02, 2023, 12:07:04 PMUpwork works best but you need to be reputed or know how to gamble with your credits so to get landed on a job of your choice. Once you prove your creditworthiness, you won't need much recognition and some employers employ you directly.If I recall correctly, you also need to have a bank account to make withdrawals, right? So it's not very crypto friendly.I was going to ask, do you have any tips on improving your creditworthiness? I don't have an account there, but I have experience with other P2P job offers so I want to hear your experience on this.There are several ways to increase your creditworthiness, one of which is by asking your company to give you a job via one of these platforms. That will not only bring you the opportunity to increase your score (as the team will only hire you out of all the bids), but will add up a good number of jobs done by you which will help you get more work in your specific skill. I know that these platforms charge 20-30% from the pay you get, but that's the best way to increase the number of jobs done by you and monetize your work.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SFR10",
      "created_time": "February 08, 2023, 07:50:10 AM",
      "body": "Quote from: 2double0 on February 02, 2023, 12:07:04 PMI don't know if they use escrow system and block the given btc value from the employer's account till the bounty ends or someone completes the job, can anyone shed some light on this?From what I'm seeing on their \"GitHub repository\", it doesn't appear to have any kind of escrow system to temporarily block those rewards:Quote from: https://github.com/coinkite/bitcoinbounties-pubFor completed bounties please change the status to \"claimed\"Quote from: Pmalek on February 02, 2023, 07:35:51 PMThere is very little activity there unfortunately. Two bounties posted in December 2022 and the one before that dates back to February 2022.You're right, but I also noticed Nostr has a dedicated page [it's in the footer area] with a lot of unclaimed bounties from the past month.- I do know it's not the same, but it might be interesting to some users.Quote from: https://bitcoinbounties.org/Check out Nostr bounties on Bountsr.org",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joniboini",
      "created_time": "February 08, 2023, 12:52:04 PM",
      "body": "Quote from: un_rank on January 25, 2023, 12:26:55 PMJust to check, am I on the right website[1]?Code:[1] https://laborx.com/jobsYes, that's what I'm referring to. There are many websites like this, but as I mentioned above I never try so I can't comment further on their reliability. Most of the time the jobs are not limited to crypto development, but you'll have to compete with a lot of users since the barrier to entry is really low. It's similar to bounties on this forum, just on a different platform with more kinds of tasks.Quote from: Accardo on February 03, 2023, 06:19:54 PMThings that affect such sites is less publicity. If they worked on the site's SEO it'll get to developers and brands that needs the help of developers. But, if the site continues gradually given time depending on the quality it provides would boom.I don't know why they don't add other kinds of jobs though, that is probably one of the reasons why it is not popular. SEO might help but if all of the tasks are limited to developing/code, I'm not surprised if it is not that popular. That being said, it is completely fine if a project just wants to list development-related bounties imo.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}