{
  "id": "topic_5413472",
  "title": "Hydrogen",
  "author": "Hydrogen",
  "created_time": "September 13, 2022, 11:59:09 PM",
  "content": "QuoteSept 9 (Reuters) - U.S. household wealth fell by a record $6.1 trillion in the second quarter to its lowest in a year as a bear market in stocks far outweighed further gains in real estate values, a Federal Reserve report showed on Friday.Household net worth tumbled to $143.8 trillion at the end of June from $149.9 trillion at the end of March, its second consecutive quarterly decline, the Fed's quarterly snapshot of the national balance sheet showed. Through June, Americans' collective wealth had fallen by more than $6.2 trillion from a record $150 trillion at the end of 2021.The net drop in wealth in the second quarter was about $30 billion larger than the previous record decline notched two years earlier, as the onset of the COVID-19 pandemic upended financial markets. That decline - in the second quarter of 2020 - still stands as the largest on a percentage basis at 5.2% versus 4.1% in the most recent report.The latest fall was led by a $7.7 trillion decline in stock market values as equities slid into a bear market in the first half of the year on worries about surging inflation and the Fed's aggressive response with interest rate increases. The equity market drop outstripped a $1.4 trillion gain in real estate values.Total nonfinancial debt rose at a 6.5% annualized rate after rising at an 8.3% rate in the first quarter, the Fed data showed. Household debt growth also slowed to a 7.4% annual rate from 8.3% in the first three months of the year, while business, federal, state and local government debt levels all rose.https://www.reuters.com/markets/us/us-household-wealth-falls-again-second-quarter-fed-says-2022-09-09/....How do americans feel being $6.1 trillion dollars poorer? If this negative economic trend continues, america could wake up one day no longer having wealth to throw at NATO or ukraine. I don't want to see that happen. I hope we can get negative market trends stabilized. We need a longshot come from behind victory to balance out negative events in the world.Incidentally, this appears to be the latest in a series of multi trillion dollar lossses of wealth for americans since the 2020 pandemic began.Economic doom and gloom used to be a sensationalist media trend. People warned economic trends were not sustainable and things would be bad for decades on end. Now it appears negative trends we were warned about are beginning to materialize. But all hope is not lost. We can still find alternatives, boost production. Do what is needed to avert a worst case scenario. Crypto can be a big part of humanity's comeback. Its the flexible, rapid development, rapid deployment option the world doesn't know it needs. Perhaps one day the world will wake up and realize it has to much to offer.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5413472",
  "comments": [
    {
      "author": "stompix",
      "created_time": "September 14, 2022, 03:13:10 AM",
      "body": "Quote from: Hydrogen on September 13, 2022, 11:59:09 PMIncidentally, this appears to be the latest in a series of multi trillion dollar lossses of wealth for americans since the 2020 pandemic began.The FED says otherwise:https://www.federalreserve.gov/releases/z1/dataviz/z1/balance_sheet/chart/2022 Q2 144T2020 Q1 110TThe net wealth is still far above 2020.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Don Pedro Dinero",
      "created_time": "September 14, 2022, 03:33:31 AM",
      "body": "Well, in most cases we are talking about losses on paper, unrealised. In some cases they will have been affected in a practical way because many people get into debt and banks take into account the value of assets when granting loans. As these have been reduced, the borrowing capacity is less. Quote from: Hydrogen on September 13, 2022, 11:59:09 PMCrypto can be a big part of humanity's comeback. Its the flexible, rapid development, rapid deployment option the world doesn't know it needs. Perhaps one day the world will wake up and realize it has to much to offer.But I don't quite see what this has to do with it, as households that had part of their net worth in crypto have also suffered losses.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hydrogen",
      "created_time": "September 14, 2022, 03:42:35 AM",
      "body": "Quote from: stompix on September 14, 2022, 03:13:10 AMQuote from: Hydrogen on September 13, 2022, 11:59:09 PMIncidentally, this appears to be the latest in a series of multi trillion dollar lossses of wealth for americans since the 2020 pandemic began.The FED says otherwise:https://www.federalreserve.gov/releases/z1/dataviz/z1/balance_sheet/chart/2022 Q2 144T2020 Q1 110TThe net wealth is still far above 2020.Its the fed's balance sheet. They can create money out of thin air to create an illusion of wealth.  The average consumer lacks this power and has no access to this liquidity.Economic inefficiency introduced by rising fossil fuel costs, supply chain disruptions, higher food prices and inflation. Guarantee household wealth is being destroyed at a high pace. Inflation alone is known to be a big destroyer of wealth. Add all of the other issues, stacked on top of inflation. Circumstances should be clear.Everyone has to feel poorer everytime they put gas in their car or buy food. I don't think there's anyone who feels richer now.Quote from: Don Pedro Dinero on September 14, 2022, 03:33:31 AMBut I don't quite see what this has to do with it, as households that had part of their net worth in crypto have also suffered losses.The world is changing. We need platforms that can quickly change to adapt. Banks and credit card companies are not well suited for this. There huge monolithic organizations that take decades to introduce new features, tools and options.Crypto however can rollout new production units very quickly to better accommodate the needs of consumers and the economy.It is possible that banks will be like dinosaurs who went extinct due to them not being able to adapt to a new world climate. They have their CBDC hope for the future, but it has yet to be revealed. There is a chance it may never materialize. CBDC is a digital currency. Many US states today struggle with rolling blackouts and electricity outages which could become normalized. How would CBDC, a digital currency, function in a state that lacks reliable electricity?Mammals and other creatures which could adapt and change at a faster pace thrived. Crypto could be the mammal of the finance world who will inherit the future.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "so98nn",
      "created_time": "September 14, 2022, 03:52:10 AM",
      "body": "QuoteCrypto can be a big part of humanity's comeback. Its the flexible, rapid development, rapid deployment option the world doesn't know it needs. Perhaps one day the world will wake up and realize it has to much to offer.May be it's not about what kind of asset or currency we are using to trade in the market. It's all about scrambled economy due to pandemic and then after shocks of it. By the time world was recovering from it, two nations broke out the war and america and others got involved into it eventually. The problem started when essential stuff like crude oil stopped exporting out of Russia. Every bit that happened during pandemic and after pandemic is the reason for the worlds condition that we are facing currently. Helping each other is not an option anymore. America was supposed to be helping hand, however eventually it turns out to be opposite to that now. There are on going military operations, government projects, pensions and what not which can not be halted to avoid the catastrophic after effects. They need to revise the way its working right now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "September 14, 2022, 12:50:26 PM",
      "body": "Quote from: Hydrogen on September 13, 2022, 11:59:09 PMHow do americans feel being $6.1 trillion dollars poorer? If this negative economic trend continues, america could wake up one day no longer having wealth to throw at NATO or ukraine.I suppose they should be used to it by now since regular Americans been getting poorer for decades now. Besides, it is not them throwing money at NATO,etc. it is their government that will always keep squeezing them for every last penny they have in the name of taxes. That's is on top of the money they earn because of this war from the garbage their military is selling idiots at prices that are up to 4x higher than pre-war times!QuoteEconomic doom and gloom used to be a sensationalist media trend. People warned economic trends were not sustainable and things would be bad for decades on end. Now it appears negative trends we were warned about are beginning to materialize. But all hope is not lost. We can still find alternatives, boost production. Do what is needed to avert a worst case scenario. It's just a painful transitioning phase that happens every now and then. For example when the US economy fell apart in 2008, over a million jobs were lost and millions of people lost their homes and income. After the transition was completed and some elites got fatter and bitcoin was created, the world went back to normal again.2022 is the same with only one small difference, bitcoin is around and can be bought as the only existing hedge against the ongoing recession.In fact that is why bitcoin price is being heavily manipulated these days preventing it from going back up. Otherwise just imagine what would have happened to US economy and US dollar if bitcoin had been soaring over the past couple of months and was worth something like half a million by now... I'd say half the world would have adopted bitcoin as legal tender and would have had replaced USD already.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gyfts",
      "created_time": "September 14, 2022, 02:22:41 PM",
      "body": "Quote from: Hydrogen on September 14, 2022, 03:42:35 AMIts the fed's balance sheet. They can create money out of thin air to create an illusion of wealth.  The average consumer lacks this power and has no access to this liquidity.Economic inefficiency introduced by rising fossil fuel costs, supply chain disruptions, higher food prices and inflation. Guarantee household wealth is being destroyed at a high pace. Inflation alone is known to be a big destroyer of wealth. Add all of the other issues, stacked on top of inflation. Circumstances should be clear.Everyone has to feel poorer everytime they put gas in their car or buy food. I don't think there's anyone who feels richer now.Correct - the money printing during COVID made people temporarily more wealthier. Most people during 2020 ended with savings that were higher than it was during the pandemic, which is evident of the fact the U.S. government spent too much on social welfare, either through direct unemployment or through stimulus checks. The inflation rate is outpacing wage growth, so the \"wealth creation\" has begun to show its adverse effects. Printing money out of thin air has consequences.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "electronicash",
      "created_time": "September 14, 2022, 02:42:06 PM",
      "body": "Quote from: Gyfts on September 14, 2022, 02:22:41 PMQuote from: Hydrogen on September 14, 2022, 03:42:35 AMIts the fed's balance sheet. They can create money out of thin air to create an illusion of wealth.  The average consumer lacks this power and has no access to this liquidity.Economic inefficiency introduced by rising fossil fuel costs, supply chain disruptions, higher food prices and inflation. Guarantee household wealth is being destroyed at a high pace. Inflation alone is known to be a big destroyer of wealth. Add all of the other issues, stacked on top of inflation. Circumstances should be clear.Everyone has to feel poorer everytime they put gas in their car or buy food. I don't think there's anyone who feels richer now.Correct - the money printing during COVID made people temporarily more wealthier. Most people during 2020 ended with savings that were higher than it was during the pandemic, which is evident of the fact the U.S. government spent too much on social welfare, either through direct unemployment or through stimulus checks. The inflation rate is outpacing wage growth, so the \"wealth creation\" has begun to show its adverse effects. Printing money out of thin air has consequences.printing is the best advantage of US government since USD is the dominant currency. its the prices of commodities that is problematic since printing doesn't solve this issue. because US is not producing something the way China or India does, unemployment is a lot difficult to solve. thus stimulus checks are necessary to help the people but if it continues its not going to be a help anymore. and US also made a lot of enemy in the past which turn out they actually need for gas supply like Iran or Saudi for their allies.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "September 14, 2022, 04:06:37 PM",
      "body": "Quote from: Hydrogen on September 14, 2022, 03:42:35 AMIts the fed's balance sheet. They can create money out of thin air to create an illusion of wealth.  Yeah, when FED shows numbers going down, the apocalypse is happening when numbers go up, it's all fake.If they would be simply printing money to cover this all why didn't they print some more now?Anyhow I was referring to your quote, no Americans have not been losing money since 2020, as the graph clearly shows the wealth increased by 50%, if you choose not to believe, if you want to apply a tinfoil hat on anything it's your choice but based on the numbers from the same source as in your article it has not gone down but up.The closest analogy would be to say bitcoin is a disaster since bitcoiners has been losing money since it went down from 60k but ignoring that it also went there from let's say 3k 5 years ago.Also, this:Distribution of Household Wealth in the U.SQ1 2020 bottom 50% 1.86 TQ2 2021 bottom 50% 3.92 TQuoteEconomic inefficiency introduced by rising fossil fuel costs, supply chain disruptions, higher food prices and inflation. Guarantee household wealth is being destroyed at a high pace.Simple question, if I'm losing money because I'm paying more for a kilo of apples, that extra money evaporates or goes to the extra wealth of the one selling me the apples?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gayong88",
      "created_time": "September 15, 2022, 08:58:22 AM",
      "body": "Quote from: Hydrogen on September 13, 2022, 11:59:09 PMCrypto can be a big part of humanity's comeback. Its the flexible, rapid development, rapid deployment option the world doesn't know it needs. Perhaps one day the world will wake up and realize it has to much to offer.It is clear that cryptocurrencies represent a great opportunity for investors, but there are also some major risks. Speculating on cryptocurrencies is like playing the lottery, with much bigger jackpots, where you can lose a lot of money. Even Bitcoin itself has fallen in price by 70 percent this year. However, I also believe that cryptocurrencies will continue to develop and grow in the years to come, so the changes are relatively small compared to what you could potentially get if you are patient.I think cryptocurrencies are part of the conversation where as more people understand what these digital assets are designed for, there may be room in their lives to use them beyond speculative investing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "2stout",
      "created_time": "September 16, 2022, 05:43:33 AM",
      "body": "It would be nice to see how this 6.1 trillion is broken down.  My guess would be a majority of this loss would be administrative or paper, meaning drop in stock prices are being counted which really doesn't mean much if said stocks are being held and not sold.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Obito",
      "created_time": "September 16, 2022, 09:14:28 AM",
      "body": "Quote from: 2stout on September 16, 2022, 05:43:33 AMIt would be nice to see how this 6.1 trillion is broken down.  My guess would be a majority of this loss would be administrative or paper, meaning drop in stock prices are being counted which really doesn't mean much if said stocks are being held and not sold.Military spending is definitely one of the biggest one there, lobbying and foreign aid probably takes a big part too. Maybe the cash aids during the pandemic could be part of it too. I never thought that the US has that much money in terms of spending, it's just that trillion is like an abyss for me.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Free Market Capitalist",
      "created_time": "September 17, 2022, 03:59:17 AM",
      "body": "Quote from: stompix on September 14, 2022, 04:06:37 PMSimple question, if I'm losing money because I'm paying more for a kilo of apples, that extra money evaporates or goes to the extra wealth of the one selling me the apples? It seems to me that you are implying that the person who sells you the apples gets richer, but in the current situation, the extra money is used by the person who sells you the apples to pay for the increase in the price of electricity and fertilizers. This is a brief summary, because we could consider all the steps in the chain from the farmer who produces the apples until they reach the store that sells them to you.I doubt very much that those who sell apples today are getting richer. But well, back to the main topic, according to the data you posted above, it does not seem that household wealth in the USA has decreased, but on the contrary. I am not surprised by this kind of \"news\", as there is a tendency in the media to make people believe that everything is very bad, that people are poorer than ever, etc. as if a poor person today does not have a much better quality of life than a poor person 100 years ago. In the end, the underlying message that they are trying to make the population believe is that in order to solve these problems, the best thing is a politician redistributing wealth.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "September 20, 2022, 01:58:19 AMLast edit: September 20, 2022, 02:13:09 AM by stompix",
      "body": "Quote from: Poker Player on September 17, 2022, 03:59:17 AMQuote from: stompix on September 14, 2022, 04:06:37 PMSimple question, if I'm losing money because I'm paying more for a kilo of apples, that extra money evaporates or goes to the extra wealth of the one selling me the apples? It seems to me that you are implying that the person who sells you the apples gets richer, but in the current situation, the extra money is used by the person who sells you the apples to pay for the increase in the price of electricity and fertilizers. This is a brief summary, because we could consider all the steps in the chain from the farmer who produces the apples until they reach the store that sells them to you.And at one point down the line somebody makes more profit, right?Cause if somebody charges you extra for the wheat but his costs are covering the differences from last year then the ones that put this cost pressure onto him are the ones changing more, so is it the fertilizer plant, but no, these also have just pushed the cost, is it the energy provider, no they have just pushed the cost from gas, is it gas more expensive, yeah it is, so because...the earth is charging more?  Remember the wood crisis last year? What was then more expensive, of course not the trees themselves demanded more money, oil and gas were at ridiculous levels, so obviously the costs were the same or even lower than last year, so where did the extra money go to? Not in the pocket of the one selling it three times the real price as there was demand but no offer?Quote from: sovie on September 18, 2022, 10:53:19 PMlol - implying that the person who sells you the apple gets richer - LOL You are right - inflation is for every one. For us and for the apple seller and who are selling mangoes or anything. Just explained it above, now your turn to actually make an argument rather than lolling.Btw, do you even have a  clue of the structure price and what the expenses that make the final price for apples are?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "palle11",
      "created_time": "September 25, 2022, 01:08:55 PM",
      "body": "Quote from: virasisog on September 25, 2022, 04:41:15 AMEven small and third world countries are having a hard time dealing with this inflation crisis. America is actually a rich country so if they're badly hit by inflation, it could be the worst experience in poor countries. Everyone is double grinding so they could have enough preparation in case this crisis would get worse in the future. It's definitely hard to deal with and a single job wouldn't be enough to sustain our daily necessities anymore. This is not a joke for third world countries that lack infrastructure, employment, good shelter and food. The most hit in the scheme of effect is the feeding because you can't afford not to eat no matter how economical you are or you try to cut down on expenses. High cost of food stuffs is affecting the poor population of people in third world countries and that causes malnutrition as they don't feed well. The rich in the third world countries are still better of since they still get contracts from government and can afford to pay their bills. The third world countries government unlike the more developed society like US can't organized support to help reduce the effect of inflation on the poor.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AllStarUK",
      "created_time": "September 25, 2022, 01:14:50 PM",
      "body": "The uk isent doing to well either our pound has dropped to record low in 35 years",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "September 26, 2022, 01:52:55 PM",
      "body": "Quote from: sovie on September 25, 2022, 10:41:20 PMQuote from: AllStarUK on September 25, 2022, 01:14:50 PMThe uk isent doing to well either our pound has dropped to record low in 35 years Why is it happening that all the currencies are dropping down?Despite of every effort by the politician - there economy is not in control anyway. And everyone in the world is tired of inflation It is not all currencies and it is not all economies that are suffering. Those countries that were net importers of energy and countries that could be considered US colonies (like Europeans who have no independence) are suffering since US exports its own inflation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "September 29, 2022, 05:41:10 AM",
      "body": "Quote from: sovie on September 26, 2022, 08:27:41 PM~I have read it somewhere that the most in debt country is USA - if they are in debt - who is the lender than i agree with you on the take that US is importing their own inflation - they should remain away from the other problems so that they can focus on their own The debt is about the printed money out of thin air not the money that you borrow from someone. Watch this video and it explains how it works and how they have been scamming everyone better than I can: https://www.youtube.com/watch?v=iFDe5kUUyT0Here is the world's debt clock and how it is increasing rapidly with US having the biggest national debt:https://www.usdebtclock.org/world-debt-clock.html",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}