{
  "id": "topic_5462433",
  "title": "Hamada1983",
  "author": "Hamada1983",
  "created_time": "August 08, 2023, 01:19:36 AMLast edit: September 17, 2023, 04:30:45 PM by Hamada1983",
  "content": "Hello Everyone,I found a website called cryptos-miner.co but I was doing a research on Google to see if it is legit or not but could not find much information but I found a review on Trustpilot and it has 4.9 stars out of 5 and the reviews were verified, does it make it legit? However on scam adviser it gives a low trust score one out of hundred and there are negative reviews where people are complaining they cannot withdraw money and the company asked them to pay more fees to process the withdrawal. Negative reviews might be done by scammers because they claimed they recovered the money through recovery agent.I deposited about $100 USD and the profit appears $4000  after few days, I chatted with support teams and they said it is block mining rewards. I don’t know if it is true or not and they told me in order to process the withdrawal I need to pay $500 dollars and assured that I won’t pay more money. They claimed they generate profit through mining machine and I noticed they have telegram group where investors have successful email withdrawals of thousands of dollars and I don’t know if the screenshot email is real or fake, the email was from admin@cryptos-miner.com. I noticed something suspicious on the site and claimed they started the company in 2018 but according to Whois it was registered on July 2022 and the UK address is fake. They claimed the money is invested in different projects.The company registration was dissolved in July 2022. Any thoughts or opinions?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5462433",
  "comments": [
    {
      "author": "stompix",
      "created_time": "August 08, 2023, 01:52:48 AM",
      "body": "Quote from: Hamada1983 on August 08, 2023, 01:19:36 AMI deposited about $100 USD and the profit appears $4000  after few days, I chatted with support teams and they said it is block mining rewards. I don’t know if it is true or not and they told me in order to process the withdrawal I need to pay $500 dollars and assured that I won’t pay more money. Yup, it's a scam, you lost $100, the $4000 never existed was just a number a script inserted in your dashboard.They could have made it look like $400,000 or 4 quadrillion.50% in 5 days, you really believed this crap?Quote from: Hamada1983 on August 08, 2023, 01:19:36 AM I found a review on Trustpilot and it has 4.9 stars out of 5 and the reviews were verified, does it make it legit?Trustpilot is garbage, it can be manipulated so easily that it works better if you think 5 stars are bad.Quote from: Hamada1983 on August 08, 2023, 01:19:36 AMI noticed they have telegram group where investors have successful email withdrawals of thousands of dollars and I don’t know if the screenshot email is real or fake, the email was from admin@cryptos-miner.com.Of course, fake accounts with fake statements, you need those to make people believe your scam.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hamada1983",
      "created_time": "August 08, 2023, 02:34:07 AM",
      "body": "I thought mining machines generates profit in a short time. By the way I emailed them and I said this is a scam and they replied by saying we are very legit company. It does not make sense.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "August 08, 2023, 02:43:32 AM",
      "body": "Quote from: Hamada1983 on August 08, 2023, 02:34:07 AMI thought mining machines generates profit in a short time. You could have dropped by the mining board and asked that before investing, but it's never too late I guess.The machines that website claim to have would right now at let's say 5 cents per kwh-earn $7.70 a day, burn $3.9 of electricity and cost $2000.So, assuming you bought with your $100 1/20 of a machine you would be earning 20 cents per day so it will take you 20 000 days to earn those $4 000, just 54 years!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hamada1983",
      "created_time": "August 08, 2023, 02:55:11 AM",
      "body": "I don’t know much about bitcoin mining machine.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Latviand",
      "created_time": "August 08, 2023, 05:15:01 AM",
      "body": "Here's some counters to their claims so they look legitimate.If you're determined enough, you can cheat your way to make your Trustpilot profile legitimate, and they got a low score in Scam Adviser which means you're going to have to doubt their credibility then and there because there's mix in opinions regarding their trustworthiness.The fact that they want you to pay some amount just to withdraw your own money is already a sign that it's a scam, no such thing as that can happen unless it's transaction fees and most of the time the tx fees aren't supposed to be high or the site doesn't ask for it themselves.Their explanation of how they make their money is obscure, what mining machines? There should be some techie explanation on how they generate profits from your payments to them.Quote from: Hamada1983 on August 08, 2023, 02:55:11 AMI don’t know much about bitcoin mining machine. It's a broad term, it could mean anything from ASIC miners or your computers, and they use that obscurity so you will think they're legitimate. And you shouldn't have got to it if you have zero knowledge in the first place.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cantsay",
      "created_time": "August 08, 2023, 06:24:30 AM",
      "body": "Quote from: Hamada1983 on August 08, 2023, 01:19:36 AMI found a review on Trustpilot and it has 4.9 stars out of 5 and the reviews were verified, does it make it legit? However on scam adviser it gives a low trust score one out of hundred and there are negative reviews where people are complaining they cannot withdraw money and the company asked them to pay more fees to process the withdrawal. Negative reviews might be done by scammers because they claimed they recovered the money through recovery agent.For a long time I have stopped believing trust pilot rating because if you check you’ll see some reputable companies having low rating while those that are obviously scammers are having high rating, and why’s that? It’s because it’s very easy to pay someone to write a bunch of reviews for you there and get your ratings up so you would have gone for the other review site since they did state that the site has refused to allow users withdraw their funds from it that would have been a red flag. QuoteI deposited about $100 USD and the profit appears $4000  after few days, I chatted with support teams and they said it is block mining rewards. I don’t know if it is true or not and they told me in order to process the withdrawal I need to pay $500 dollars and assured that I won’t pay more money.Classic scammer format, what they are currently trying to do is to milk more money from you. Since they have been successfully able to get $100 from you they want to see if the $4,000 you’re currently seeing in your balance will make you want to pay the additional $500 and as soon as I do that would be the end of the money. QuoteThey claimed they generate profit through mining machine and I noticed they have telegram group where investors have successful email withdrawals of thousands of dollars and I don’t know if the screenshot email is real or fake, the email was from admin@cryptos-miner.com.I can assure you that those screenshots you saw were fake and those accounts you see posting different screenshots as proof of payment are all being controlled by the same person they are just socket-puppet nothing more.QuoteI noticed something suspicious on the site and claimed they started the company in 2018 but according to Whois it was registered on July 2022 and the UK address is fake. They claimed the money is invested in different projects.If you had conducted this research before you invested your money in it, you won’t have lost your money. QuoteAny thoughts or opinions?It’s certain that the site is a scam and you have been scammed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rat03gopoh",
      "created_time": "August 08, 2023, 07:04:52 AM",
      "body": "Quote from: Hamada1983 on August 08, 2023, 01:19:36 AMand they said it is block mining rewards.~~They claimed the money is invested in different projects.This, their statements are clearly inconsistent.Quote from: Hamada1983 on August 08, 2023, 02:55:11 AMI don’t know much about bitcoin mining machine. Your bad, you should know about mining before trusting any offer if it makes sense.Be careful next time. Never be attracted to offers via private messages. \"If it's too good to be true, it must be a scam\".I see from your previous experience that you also fall for another kind of scam.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitMaxz",
      "created_time": "August 08, 2023, 08:30:59 AM",
      "body": "Quote from: Hamada1983 on August 08, 2023, 02:55:11 AMI don’t know much about bitcoin mining machine. Bitcoin mining machine is an ASIC miner(Physical machine) you can buy this on Bitmain or from other ASIC manufacturers and you don't need to worry about how to set up them because it is easy to set up and the guide can be found in their manual.If you want to know more about what is ASIC check this link below- https://en.bitcoin.it/wiki/ASICQuote from: Hamada1983 on August 08, 2023, 02:34:07 AMI thought mining machines generates profit in a short time. By the way I emailed them and I said this is a scam and they replied by saying we are very legit company. It does not make sense.There is no instant profit in mining it all depends on your current electricity rate.And there are no scammers that will tell you they are not legit or they are scammers.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "examplens",
      "created_time": "August 08, 2023, 10:40:42 AM",
      "body": "Quote from: Hamada1983 on August 08, 2023, 02:34:07 AMI thought mining machines generates profit in a short time. By the way I emailed them and I said this is a scam and they replied by saying we are very legit company. It does not make sense.How likely is it that the scammer will respond to your accusations, hey the truth is I'm a scammer, and you'll be out of money if you cooperate with me. Quote from: Hamada1983 on August 08, 2023, 02:55:11 AMI don’t know much about bitcoin mining machine. Considering you don't know much about this, it's a good thing you asked here first. You have received good advice, I hope you will follow it because it will save you money.Here, I will also give you free but valuable advice to first learn something about mining and about bitcoin in general, before any investment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "robelneo",
      "created_time": "August 08, 2023, 11:41:57 AM",
      "body": "Quote from: Hamada1983 on August 08, 2023, 01:19:36 AMI found a website called cryptos-miner.co but I was doing a research on Google to see if it is legit or not but could not find much information but I found a review on Trustpilot and it has 4.9 stars out of 5 and the reviews were verified, does it make it legit?I never trust Trustpilot reviews can be manipulated and there are allegations of corruption and bribing, there are people accepting positive reviews on TrustPilot and Google Services QuoteI deposited about $100 USD and the profit appears $4000  after few days, I chatted with support teams and they said it is block mining rewards. I don’t know if it is true or not and they told me in order to process the withdrawal I need to pay $500 dollars and assured that I won’t pay more money.We've read so many complaints like this here in the scam casinos, on casinos, on exchange, and on trading sites, they give you huge earnings or bonuses and asked you to deposit to verify your address or to process the withdrawals, this is old stuff and have been used so many times, and I guess will be used more because many people are not aware of the scheme.If they asked you to deposit to process your withdrawal they are a confirmed scam we've proven this here os many times You've fallen to a scam site I'm sure about it and they are organized, based on their reviews on review sites, they know where depositors will look to verify their status, and it's unfortunate that these review sites are not being used by scammers to scam people.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ajiz138",
      "created_time": "August 08, 2023, 02:02:08 PM",
      "body": "Quote from: Hamada1983 on August 08, 2023, 02:34:07 AMI thought mining machines generates profit in a short time. You are tempted by the percentages received even though this is clearly a ponzi scheme with the form of bitcoin mining. In crypto there is no quick profit especially in 24 hours it is a scam.Quote from: Hamada1983 on August 08, 2023, 02:34:07 AMBy the way I emailed them and I said this is a scam and they replied by saying we are very legit company. It does not make sense.Yep they will defend themselves by saying it's legitimate, but we must be self-aware that it is clearly a scam.Reviews on Trustpilot can be manipulated as @stompix saidYou have now lost $100, so in the future be careful again in investing don't be tempted by quick profits.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Adbitco",
      "created_time": "August 08, 2023, 02:25:18 PM",
      "body": "But wait mate?How come you invested without you making your findings over here to know if they are real or not?Okay let say you already invested $100 and your profit rose significantly to $4k within some period of time and you think that is a proper investment with just $100?Well you are to be blame any way, because you allowed greed to Will over you after reading their investment plans and most at times this is where those scammers do hold their victims ransome because after making your investment to look so real they would want to mint another money from you in the name of \"paying for one time fee\" after which they will re-strategize again to suck another huge fee from you, after requesting another they will then increase your profits to look very larger again, equivalent to what stompix said and you don't have option than to be paying for you to collect your money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hamada1983",
      "created_time": "August 08, 2023, 03:31:15 PM",
      "body": "Thanks for the feedbacks and that what I want.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "holydarkness",
      "created_time": "August 08, 2023, 03:52:40 PM",
      "body": "Quote from: Hamada1983 on August 08, 2023, 03:31:15 PMThanks for the feedbacks and that what I want.I know I came a bit late [I'm quite occupied with personal matter and my free time at crypto space was previously spent for one case that's rather... moot] but I would like to add some more to this matter,Quote from: Hamada1983 on August 08, 2023, 02:34:07 AMI thought mining machines generates profit in a short time. By the way I emailed them and I said this is a scam and they replied by saying we are very legit company. It does not make sense.the result if you search their so-called \"very legit company\" is:",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitcoin_Arena",
      "created_time": "August 08, 2023, 11:50:15 PM",
      "body": "Quote from: Hamada1983 on August 08, 2023, 02:34:07 AMI thought mining machines generates profit in a short time. By the way I emailed them and I said this is a scam and they replied by saying we are very legit company. It does not make sense.You got scammed, my friend. The kind of site you visited claim to be some cloud mining site but in actual sense they are scammers. They show you that you earned $4,000 in your account, but that just numbers, and they won't let you withdraw anything.I suggest you read more about Bitcoin mining and how it works. There is a lot of information in this forum and other online articles.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hamada1983",
      "created_time": "August 09, 2023, 02:38:47 AM",
      "body": "This is what I found:https://find-and-update.company-information.service.gov.uk/company/13248027",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fiatless",
      "created_time": "August 09, 2023, 03:59:32 AM",
      "body": "Quote from: Hamada1983 on August 08, 2023, 01:19:36 AMHello Everyone,I found a website called cryptos-miner.co but I was doing a research on Google to see if it is legit or not but could not find much information but I found a review on Trustpilot and it has 4.9 stars out of 5 and the reviews were verified, does it make it legit? However on scam adviser it gives a low trust score one out of hundred and there are negative reviews where people are complaining they cannot withdraw money and the company asked them to pay more fees to process the withdrawal. Negative reviews might be done by scammers because they claimed they recovered the money through recovery agent.Don't rely on reviews to check the legitimacy of any investment. Reviews can be selective and intentionally designed to promote any product. Anybody can write reviews and make them look factual. But you were lucky to get valid information from scam adviser and it should have been a warning sign. QuoteAny thoughts or opinions?Don't go back to the website again. It is a pure scam because I don't know any investment that can give that kind of profit in a few days. The strategy is to use $4000 as bait to push you to release the $500. They will keep increasing the fictitious funds and encourage you to bring more to withdraw. They will also be furnishing you with reasons why you couldn't withdraw.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yaunfitda",
      "created_time": "August 09, 2023, 10:16:18 AM",
      "body": "This is a very old trick by the scammers behind this website. And so what others have said, this is a scam and you should stay away from it. And if I'm not mistaken, even in 2017, this is already prevalent and I thought that scammers have evolved already and don't used this modus or style already.But this is 2023 and still they are alive and hopefully no newbies are going to fall for this trick.Just used the old adage, \"if it is too good to be true, then probably is\".",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "holydarkness",
      "created_time": "August 09, 2023, 02:09:09 PM",
      "body": "Quote from: Hamada1983 on August 09, 2023, 02:38:47 AMThis is what I found:https://find-and-update.company-information.service.gov.uk/company/13248027I don't think they're the same company, given the \"official\" registration of their company is \"cryptos-miner.co\" and that one is Crypto Miner. The face of the company according to their site is Scott Greenwood, and the one above is Adrian Poocock. Even if we suppose that company is theirs, it's already dissolved last year.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}