{
  "id": "topic_5461228",
  "title": "Cointxz",
  "author": "Cointxz",
  "created_time": "July 27, 2023, 05:21:17 PM",
  "content": "Big developments sa issue ni SBF FTX pero hindi nakakagulat na makakawala din itong si SBF sa lahat ng charges nya dahil backed by government sya. Ibinasura na ng DoJ ang issue tungkol sa campaign finance funds issue nya sa democratic party last election at hindi na din maghahabol pa ang Bahamas government sa result ng court na ito.Ito na siguro ang biggest robbery escape kung sakali man malulusutan ni SBf ang mga natitirang cases dahil sobrang dami pa nyang crypto holdings galing sa FTX in case magiging malaya na sya.Big sucks news ito sa lahat ng user ng FTX.Source: https://bitcoinist.com/us-authorities-drop-charges-sbf-campaign-finance/",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5461228",
  "comments": [
    {
      "author": "blockman",
      "created_time": "July 28, 2023, 12:51:52 AM",
      "body": "Parang tinrato niyang investment yung mga bigay bigay niya din eh dahil alam niyang dadating itong panahon na ito. Para ngang madali ng makakalimutan itong issue na to' laban sa kanya at yung mga nabiktima nila parang wala na talagang habol sa kanya kahit ano pa man ang maging kalalabasan ng issue na yan. Basta sana ang pinakamahalaga ay mabigyan ng hustiya yung mga biktima nitong mga ito. Kaso parang hopeless na para mairefund yung mga pera ng mga users nila.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kingvirtus09",
      "created_time": "July 28, 2023, 10:16:53 AM",
      "body": "Medyo hindi magandang balita ito para sa mga biktima ni Sbf, wala eh mukhang pinaghandaan talaga ni Sbf yan,nagtanim siya ng tulong sa mga taong alam nyang pwede siyang matulungan sa mga pagkakataon na kagaya nito. kaya ginamit nya din yung perang galing sa mga biniktima nya, so masasabi kung magaling siya. At kapag dumating na sa puntong malaya na ulit siya, malamang gumawa na naman ng kabulustugan yan para makalikom na naman ng pondo mula sa mga taong bibiktimahin na naman nya kagaya ng ginawa nya sa ftx.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cointxz",
      "created_time": "July 28, 2023, 02:40:39 PM",
      "body": "Quote from: blockman on July 28, 2023, 12:51:52 AMParang tinrato niyang investment yung mga bigay bigay niya din eh dahil alam niyang dadating itong panahon na ito. Para ngang madali ng makakalimutan itong issue na to' laban sa kanya at yung mga nabiktima nila parang wala na talagang habol sa kanya kahit ano pa man ang maging kalalabasan ng issue na yan. Basta sana ang pinakamahalaga ay mabigyan ng hustiya yung mga biktima nitong mga ito. Kaso parang hopeless na para mairefund yung mga pera ng mga users nila.Yeah, investment sa exit nya incase mabust yung mga pinaggagawa nyang pagnakawa which is nag payoff naman dahil full support buong politician sa kanya both party. Naglagay sya ng pera both democrats at republican kaya sobrang bagal umusad ng case nya which is not normal dahil sobrang daming affected at dapat ay pinagtutuunan sya ng pansin para makulong but instead sobrang tahimik ng lahat ng mga politiko sa case nya. GGWP talaga kay SBFQuote from: kingvirtus09 on July 28, 2023, 10:16:53 AMMedyo hindi magandang balita ito para sa mga biktima ni Sbf, wala eh mukhang pinaghandaan talaga ni Sbf yan,nagtanim siya ng tulong sa mga taong alam nyang pwede siyang matulungan sa mga pagkakataon na kagaya nito. kaya ginamit nya din yung perang galing sa mga biniktima nya, so masasabi kung magaling siya. At kapag dumating na sa puntong malaya na ulit siya, malamang gumawa na naman ng kabulustugan yan para makalikom na naman ng pondo mula sa mga taong bibiktimahin na naman nya kagaya ng ginawa nya sa ftx.Sobrang talaga nya at planado ang lahat kasama na ang pag exit scam nya. Actually, sobrang ganda sana talaga ng FTX kung hindi lang nya pinasok yung mga shady deals. Sa pagkakaalala ko ay naglabas pa sya ng statement noon na hindi nya kailangan ng pera at idodonate nya yung funds nya na profit from FTX at ibang projects nya yet lumabas din ang tunay nyang kulay.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blockman",
      "created_time": "July 29, 2023, 05:46:16 AM",
      "body": "Quote from: Coin_trader on July 28, 2023, 02:40:39 PMQuote from: blockman on July 28, 2023, 12:51:52 AMParang tinrato niyang investment yung mga bigay bigay niya din eh dahil alam niyang dadating itong panahon na ito. Para ngang madali ng makakalimutan itong issue na to' laban sa kanya at yung mga nabiktima nila parang wala na talagang habol sa kanya kahit ano pa man ang maging kalalabasan ng issue na yan. Basta sana ang pinakamahalaga ay mabigyan ng hustiya yung mga biktima nitong mga ito. Kaso parang hopeless na para mairefund yung mga pera ng mga users nila.Yeah, investment sa exit nya incase mabust yung mga pinaggagawa nyang pagnakawa which is nag payoff naman dahil full support buong politician sa kanya both party. Naglagay sya ng pera both democrats at republican kaya sobrang bagal umusad ng case nya which is not normal dahil sobrang daming affected at dapat ay pinagtutuunan sya ng pansin para makulong but instead sobrang tahimik ng lahat ng mga politiko sa case nya. GGWP talaga kay SBFKaya nga, parang planado lahat ng ginawa ng mokong na yan. Sobrang dali lang ibigay yung mga ganyang halaga dahil hindi naman sa kanya. Partner niya pa dito sa bust na ito yung Caroline na mukhang weirdo din. Hindi sa panlalait sa anyo pero itong mga mukhang inosente na kala mo walang gagawing kalokohan at napuri pa sa publiko, isa isa rin pala sa mga may planong manloko ng malalaking halaga gamit ang isang legit na business. Ewan ko lang ngayon kahit nag change hands na sa operation ang FTX kung meron pa bang magtitiwala sa kanila.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rhomelmabini",
      "created_time": "July 29, 2023, 02:44:47 PM",
      "body": "Quote from: Coin_trader on July 27, 2023, 05:21:17 PMBig developments sa issue ni SBF FTX pero hindi nakakagulat na makakawala din itong si SBF sa lahat ng charges nya dahil backed by government sya. Ibinasura na ng DoJ ang issue tungkol sa campaign finance funds issue nya sa democratic party last election at hindi na din maghahabol pa ang Bahamas government sa result ng court na ito.Ito na siguro ang biggest robbery escape kung sakali man malulusutan ni SBf ang mga natitirang cases dahil sobrang dami pa nyang crypto holdings galing sa FTX in case magiging malaya na sya.Big sucks news ito sa lahat ng user ng FTX.Source: https://bitcoinist.com/us-authorities-drop-charges-sbf-campaign-finance/Mukhang papalarin pa nga ata ang kumag na ito kung saka-sakali kasi dami talagang mga kilalang mga maimpluwensiyang tao si SBF. I think if mag tuloy-tuloy ito hanggang maiba ang mga nasa pwesto I think magkakaroon ito ng kasagutan lalo na if hindi pabor sa kanya yung nasa administrasyon na I think yung nakaupo ngayong mga opisyal talagang pumapabor sa kanya.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bhadz",
      "created_time": "July 29, 2023, 03:14:35 PM",
      "body": "Quote from: rhomelmabini on July 29, 2023, 02:44:47 PMMukhang papalarin pa nga ata ang kumag na ito kung saka-sakali kasi dami talagang mga kilalang mga maimpluwensiyang tao si SBF. Badtrip naman yan. Mukhang ganun nga ang mangyayari sa kanya at makakatakas pa ata dahil nga sa mga pinagdo-donate niyang pera sa parehas na mga partido sa US.Quote from: rhomelmabini on July 29, 2023, 02:44:47 PMI think if mag tuloy-tuloy ito hanggang maiba ang mga nasa pwesto I think magkakaroon ito ng kasagutan lalo na if hindi pabor sa kanya yung nasa administrasyon na I think yung nakaupo ngayong mga opisyal talagang pumapabor sa kanya.Pabor pa rin yan sa kanya dahil parehas naman na political party ang binribe niya. Kaya kahit magkaroon ng palitan sa pwesto, may utang na loob sa kanya yang mga kandidato na manalo.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "abel1337",
      "created_time": "July 29, 2023, 06:47:29 PM",
      "body": "Hindi kaya maging loophole to ng mga potential crypto fraudster at gayahin nila yung ginawa ni SBF para malusutan yung mga kaso nila? Ano kaya mangyayari dun sa funds na hawak pa ni SBF ngayon na supposedly ay dapat sa customers niya? I'm still uncertain kung anong pwedeng mangyari once na fully malampasan ni SBF yung mga law suits niya. Though I don't think na babalik padin yung mga old FTX users sa platform nila even malampasan ni SBF yung kaso niya given na may risk padin na gawin niya ito at surely takot na din yung past victims niya.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Johnyz",
      "created_time": "July 29, 2023, 08:46:36 PM",
      "body": "This is actually a good development so FTX can start distributing the funds that they already recovered. We know naman SBF has the money and being supported by big investors and probably, those who file the charge are nasettle na ito sa kanilang close door trial.Well, let’s see kung ano ang susunod with SBF and FTX, sana naman ay simulan na nilang ibalik ang mga pera na naipit sa kanilang platform kase sobrang laki na ng narecover nila.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "serjent05",
      "created_time": "July 30, 2023, 11:59:07 PM",
      "body": "Di ba iyong campaign finance funds lang naman iyong nadrop, eh marami pa rin itong si SBF na haharaping kaso.  Pero sa tingin ko masamang balita pa rin ito para sa mga taong gustong papanagutin si SBF sa mga kasalanan nya.QuoteBankman-Fried is currently facing multiple charges, including one related to campaign finance contributions, as he prepares for his trial in October.Sana nga lang ay hindi mabasura lahat ng kaso ni SBF, mukhang iyong mga donations nya ang magiging malaking suporta nya para malusutan ang mga kasong ipinataw sa kanya.  Pag ganyan ang nangyari... alam na nating nagamitan ito ng under the table strategy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "malcovi2",
      "created_time": "July 31, 2023, 01:16:07 AM",
      "body": "Quote from: serjent05 on July 30, 2023, 11:59:07 PMDi ba iyong campaign finance funds lang naman iyong nadrop, eh marami pa rin itong si SBF na haharaping kaso.  Pero sa tingin ko masamang balita pa rin ito para sa mga taong gustong papanagutin si SBF sa mga kasalanan nya.QuoteBankman-Fried is currently facing multiple charges, including one related to campaign finance contributions, as he prepares for his trial in October.Sana nga lang ay hindi mabasura lahat ng kaso ni SBF, mukhang iyong mga donations nya ang magiging malaking suporta nya para malusutan ang mga kasong ipinataw sa kanya.  Pag ganyan ang nangyari... alam na nating nagamitan ito ng under the table strategy.sa opinion ko lang dahil siguro binasura na yang campaign funds baka iniiwasan ng mga politicians na madawit ang kanilang mga pangalan sa hearing ni SBF. Gusto nilang hindi ito matuloy para hindi maging public na tumangap sila ng mga bribes or gifts.ang huwag lang maibasura is fraud at money laundering, wala siyang takas sa kaso na ito dahil pati mga co-workers at empleyado niya ay nag testify against sakanya.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "robelneo",
      "created_time": "July 31, 2023, 01:02:10 PM",
      "body": "Quote from: serjent05 on July 30, 2023, 11:59:07 PMDi ba iyong campaign finance funds lang naman iyong nadrop, eh marami pa rin itong si SBF na haharaping kaso.  Pero sa tingin ko masamang balita pa rin ito para sa mga taong gustong papanagutin si SBF sa mga kasalanan nya.QuoteBankman-Fried is currently facing multiple charges, including one related to campaign finance contributions, as he prepares for his trial in October.Sana nga lang ay hindi mabasura lahat ng kaso ni SBF, mukhang iyong mga donations nya ang magiging malaking suporta nya para malusutan ang mga kasong ipinataw sa kanya.  Pag ganyan ang nangyari... alam na nating nagamitan ito ng under the table strategy.Isa lang naman ito marami pa mga mabibigat na kaso na siguradong magdidiin sa kanya at magdadala sa kanya sa bilangguan, nag drop sila ng isang charges dahil sa agreement nila sa gobyerno ng Bahamas QuoteIn keeping with its treaty obligations to The Bahamas, the government does not intend to proceed to trial on the campaign contributions countMaliit na kaso lang naman ito, malamang yung mas malalaki ang pag tututunan ng prosecution ng higit na pansin hind papayag ang buong Cryptocurrency community na walang mangyari sa kasong ito at ito ay isang malaking dagok sa prosecution kasi napakalinaw na may mga paglabag na nangyari, at malaking kahihiyan ito sa US justice department kung hindi nila mabibigyan ng hustisya ang mga investors na napakalaki ang nawala.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "crzy",
      "created_time": "July 31, 2023, 10:43:41 PM",
      "body": "Ibig sabihin ba nito is ready na silang ibalik ang pera na narecover nila?Marami pang case si SBF and sa tingin ko, isa lang isa sa malaking mga kaso na kinakaharap nya so it's not a total win for SBF.San ay maibalik na ang pera, I have small funds with FTX before at kahit gaano man ito kaliit, deserve paren naten na makuha ito ulit.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rhomelmabini",
      "created_time": "August 01, 2023, 09:30:24 PM",
      "body": "Quote from: bhadz on July 29, 2023, 03:14:35 PMQuote from: rhomelmabini on July 29, 2023, 02:44:47 PMMukhang papalarin pa nga ata ang kumag na ito kung saka-sakali kasi dami talagang mga kilalang mga maimpluwensiyang tao si SBF. Badtrip naman yan. Mukhang ganun nga ang mangyayari sa kanya at makakatakas pa ata dahil nga sa mga pinagdo-donate niyang pera sa parehas na mga partido sa US.Quote from: rhomelmabini on July 29, 2023, 02:44:47 PMI think if mag tuloy-tuloy ito hanggang maiba ang mga nasa pwesto I think magkakaroon ito ng kasagutan lalo na if hindi pabor sa kanya yung nasa administrasyon na I think yung nakaupo ngayong mga opisyal talagang pumapabor sa kanya.Pabor pa rin yan sa kanya dahil parehas naman na political party ang binribe niya. Kaya kahit magkaroon ng palitan sa pwesto, may utang na loob sa kanya yang mga kandidato na manalo.I don't think sa utang na loob kasi parang hindi yan present sa American society at all, most likely connections lang ang pinanghahawakan ni SBF o di kaya ang kakayanan nito na paikutin ang mga nasa pwesto. Remember, bigla nalang sumulpot itong si SBF kung saan at likely parang isa lang siyang puppet at meron pang nag mamaniobra sa kanya na malaking tao. Just my conspiracy na parang may katotohanan naman.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cheezcarls",
      "created_time": "August 02, 2023, 07:17:41 AM",
      "body": "Sa pagkaitindi ko one of many pa lang ng mga charges ang na dropped laban sa kanya. Ibig sabihin meron pa ibang charges that he still needs to face for wire fraud, money laundering at iba pa. Buti na lang hindi ako tumalpak dyan sa FTX nor registering an account or trade sa kanilang exchange. I would really doubt na he’ll be cleared of all charges as soon as possible. Marami pa yan so SBF hindi pa siya nangin out of the woods pa.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mr. Magkaisa",
      "created_time": "August 02, 2023, 04:51:53 PM",
      "body": "-    Medyo bad news ito para sa mga dating Ftx users na naging victim ni SBF. yung perang nakulimbat ni Sbfdin nag gagamitin nya para makalusot siya sa mga charges na ipapataw sa kanya. Pero sana naman kahit pano ay mabigyan ng hustisya ang mga umaasa parin kahit pano sa inaasam nilang makuha dito kay Sbf.Kawawa lang talaga yung mga karamihang namuhunan dito sa Ftx sa totoo lang. Ni hindi ko nga nalaman yan nung mga panahon na kaingayan nyan dito sa crypto busines.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "abel1337",
      "created_time": "August 02, 2023, 05:11:14 PM",
      "body": "I heard that FTX will be rebuilt soon ahh at balita ko mag fofocus sila sa mga international clients. I'm pretty sure may involvement si SBF sa desisyon na irebuild ang FTX lalo na at drop na yung charges sakanya though, I doubt padin na mag titiwala sakanya ang masses dahil sa history niya. Ang pangit na ng pangalan ng FTX at pwede mas ok siguro na mag rebrand nalang sila at wag na irebuild yung fallen business nila. Even sumunod sila sa mga regulatory is malaki padin yung chance na hindi sila mag thrive. I'm wondering kung ano ang strategy nila para makapag hikayat ng big investor sakanila if it becomes a reality na irebuilt nga nila yung FTX.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "malcovi2",
      "created_time": "August 03, 2023, 01:42:03 AMLast edit: August 03, 2023, 10:21:02 PM by malcovi2",
      "body": "Quote from: abel1337 on August 02, 2023, 05:11:14 PMI heard that FTX will be rebuilt soon ahh at balita ko mag fofocus sila sa mga international clients. I'm pretty sure may involvement si SBF sa desisyon na irebuild ang FTX lalo na at drop na yung charges sakanya though, I doubt padin na mag titiwala sakanya ang masses dahil sa history niya. Ang pangit na ng pangalan ng FTX at pwede mas ok siguro na mag rebrand nalang sila at wag na irebuild yung fallen business nila. Even sumunod sila sa mga regulatory is malaki padin yung chance na hindi sila mag thrive. I'm wondering kung ano ang strategy nila para makapag hikayat ng big investor sakanila if it becomes a reality na irebuilt nga nila yung FTX.Wala ng kinalaman si SBF sa FTX. Ang na-appoint sa mga bankrupt business ay yung mga experienced people.https://www.coindesk.com/business/2022/11/11/from-enron-to-ftx-wall-street-turnaround-titan-john-jay-ray-iii-takes-reins-from-ftx-ceo-sam-bankman-fried/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bhadz",
      "created_time": "August 03, 2023, 05:05:02 PM",
      "body": "Quote from: rhomelmabini on August 01, 2023, 09:30:24 PMQuote from: bhadz on July 29, 2023, 03:14:35 PMPabor pa rin yan sa kanya dahil parehas naman na political party ang binribe niya. Kaya kahit magkaroon ng palitan sa pwesto, may utang na loob sa kanya yang mga kandidato na manalo.I don't think sa utang na loob kasi parang hindi yan present sa American society at all, most likely connections lang ang pinanghahawakan ni SBF o di kaya ang kakayanan nito na paikutin ang mga nasa pwesto. Remember, bigla nalang sumulpot itong si SBF kung saan at likely parang isa lang siyang puppet at meron pang nag mamaniobra sa kanya na malaking tao. Just my conspiracy na parang may katotohanan naman.Ganun talaga, bigayan yan. Suporta ka at bigyan mo ng pera para sa campaign funds nila at kung manalo sila at nasa pwesto nila, may pabor ka na galing sa kanila. Yun na din yung connections dahil hindi siya magkakaroon ng connections kung walang perang pinaluwal siya sa mga yan.Kung puppet man siya o anoman, ganyan naman ang madalas nating isipin na may mga pera. Puwedeng o pero puwede ding hindi at literal na SBF alone lang.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jeraldskie11",
      "created_time": "August 05, 2023, 10:46:43 PM",
      "body": "Quote from: abel1337 on August 02, 2023, 05:11:14 PMI heard that FTX will be rebuilt soon ahh at balita ko mag fofocus sila sa mga international clients. I'm pretty sure may involvement si SBF sa desisyon na irebuild ang FTX lalo na at drop na yung charges sakanya though, I doubt padin na mag titiwala sakanya ang masses dahil sa history niya. Ang pangit na ng pangalan ng FTX at pwede mas ok siguro na mag rebrand nalang sila at wag na irebuild yung fallen business nila. Even sumunod sila sa mga regulatory is malaki padin yung chance na hindi sila mag thrive. I'm wondering kung ano ang strategy nila para makapag hikayat ng big investor sakanila if it becomes a reality na irebuilt nga nila yung FTX.Totoo yan, hindi talaga maganda na irebuilt ang FTX kasi napakapangit na ng pangalang, marami na ang natakot na baka mascam lang nito. Kung sakaling mag rebrand sila, ay sana huwag ng ipaalam na nagmula ito sa FTX kasi malaki ang probabilidad na hindi ito magiging successful. Madami naman kasing magandang platform na pag-iinvestan kaya bakit pipiliin ng mga investors ang platform na may hindi magandang history. Alam naman natin na patok yung Binance at sya na talaga ang paborito ng mga tao, mas mabuting iconsider ito kung gustong pumatok ang project lalong-lalo na kung exchange site.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}