{
  "id": "topic_5455568",
  "title": "MitNik245",
  "author": "MitNik245",
  "created_time": "June 07, 2023, 06:37:13 AM",
  "content": "Cheers to everyone, I'm having a problem with one of the three hashboards. In the log file how can I identify which hashboard it is so I can replace it? PVT_T0 it shows -40 on four chips.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5455568",
  "comments": [
    {
      "author": "paid2",
      "created_time": "June 07, 2023, 01:27:54 PM",
      "body": "Quote from: MitNik245 on June 07, 2023, 06:37:13 AMCheers to everyone, I'm having a problem with one of the three hashboards. In the log file how can I identify which hashboard it is so I can replace it? PVT_T0 it shows -40 on four chips.Disconnect your hashboards from the control board, and start your ASIC with one board connected at a time.Thus, you'll be able to see which one is giving you troubles.Otherwise, the logs generally indicate which hashboard is affected by the problem, and you can then see on the control board the number associated with the hashboards and thus identify which one is faulty. This applies to Bitmain antminers, but I'm not so sure about Avalon. In any case, isolating the board by plugging in only one at a time should work perfectly.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitMaxz",
      "created_time": "June 07, 2023, 03:57:38 PM",
      "body": "PVT_T0 it is a list of the temperature of 0 hashboard meaning it should be the first hashboard but thats not the only way to identify which hashboard is bad check the HASHS on the logs sample this one HASHS[ 1 0 0 ] if it shows the same as this then the first hashboard is bad.Why not share all of your logs? It doesn't have any API of your miner so it is safe if you share the whole logs instead.Another thing is the troubleshooting is available on Canaan support under this link below and then go to the manual then download the troubleshooting pdf file.- https://www.canaan.io/service/447",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MitNik245",
      "created_time": "June 07, 2023, 04:15:28 PM",
      "body": "Okay thanks, i managed to replace the bad hashboard. Just to know, the first hashboard is the first from the right side as we looking the miner from output fans. In that way it is simple to check quickly which one need replacement. In my case when i opened the miner, one hashboard was much cooler from the other two which means that it was the defective one. Many thanks again.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}