{
  "id": "topic_5474882",
  "title": "God bless u",
  "author": "God bless u",
  "created_time": "November 21, 2023, 10:28:44 AM",
  "content": "World cup 2023 is ended in great style. Australia beat India in their home ground in front of more than 100k fans. Every one enjoyed tournament. WC ends but cricket is non stop and everyday match is live in any side of the world.In this thread we will discuss League and domestic cricket. currently Legends League Cricket 2023 is already started and two matches already finished. You can check the schedule belowhttps://www.espncricinfo.com/series/legends-league-cricket-2023-24-1408606/match-schedule-fixtures-and-results",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5474882",
  "comments": [
    {
      "author": "Compromise me",
      "created_time": "November 21, 2023, 05:44:16 PM",
      "body": "Quote from: God bless u on November 21, 2023, 10:28:44 AMIn this thread we will discuss League and domestic cricket. currently Legends League Cricket 2023 is already started and two matches already finished. The third match has been completed between Urbanrisers Hydrabad and  southern Superstars.Urbanrisers Hydrabad  scored 156 runs in 20 overs and their all team out on 156 runs and they gave a target of 157 runs against Southern Superstars. Martin Guptil played very well and scored 46 runs in just 28 balls and Yogesh Nagar made 40 runs in just 29 balls and he played an excellent inning at the end and he pushed his team score to 156 runs. From Southern Superstars Hamid Hassan performed an excellent bowling and took 4 crucial wickets by giving 30 runs in 4 overs.Abdur Razak took 2 wickets by giving 21 runs in 4 overs.Now, match is becoming very interesting and Southern Superstars need 44 runs in 34 balls with 4 wickets in hand.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nalain420",
      "created_time": "November 21, 2023, 05:49:05 PM",
      "body": "Quote from: Compromise me on November 21, 2023, 05:44:16 PMQuote from: God bless u on November 21, 2023, 10:28:44 AMIn this thread we will discuss League and domestic cricket. currently Legends League Cricket 2023 is already started and two matches already finished. The third match has been completed between Urbanrisers Hydrabad and  southern Superstars.Urbanrisers Hydrabad  scored 156 runs in 20 overs and their all team out on 156 runs and they gave a target of 157 runs against Southern Superstars. Martin Guptil played very well and scored 46 runs in just 28 balls and Yogesh Nagar made 40 runs in just 29 balls and he played an excellent inning at the end and he pushed his team score to 156 runs. From Southern Superstars Hamid Hassan performed an excellent bowling and took 4 crucial wickets by giving 30 runs in 4 overs.Abdur Razak took 2 wickets by giving 21 runs in 4 overs.Now, match is becoming very interesting and Southern Superstars need 44 runs in 34 balls with 4 wickets in hand.Today match is the between southern super star and urbanrisers Hyderabad. Southern superstar won the toss and first decided bowling. Urbanrisers batsman makes 8 run in 1 over and southern superstar no any wicket against urbanrisers. Urbanrisers batsman makes 72 run in 10 over and 3 outs. Urbanrisers batsman could not worked hard. Urbanrisers batsman makes 156 run in 19 over and 10 outs. This is the target for southern superstar. Southern superstar can not complete this target and lose the match.Southern superstar batsman lose the match in 13 runs . Today match won by Urbanrisers Hyderabad.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hafiztalha",
      "created_time": "November 21, 2023, 06:08:19 PM",
      "body": "Quote from: Nalain420 on November 21, 2023, 05:49:05 PMQuote from: Compromise me on November 21, 2023, 05:44:16 PMQuote from: God bless u on November 21, 2023, 10:28:44 AMIn this thread we will discuss League and domestic cricket. currently Legends League Cricket 2023 is already started and two matches already finished. The third match has been completed between Urbanrisers Hydrabad and  southern Superstars.Urbanrisers Hydrabad  scored 156 runs in 20 overs and their all team out on 156 runs and they gave a target of 157 runs against Southern Superstars. Martin Guptil played very well and scored 46 runs in just 28 balls and Yogesh Nagar made 40 runs in just 29 balls and he played an excellent inning at the end and he pushed his team score to 156 runs. From Southern Superstars Hamid Hassan performed an excellent bowling and took 4 crucial wickets by giving 30 runs in 4 overs.Abdur Razak took 2 wickets by giving 21 runs in 4 overs.Now, match is becoming very interesting and Southern Superstars need 44 runs in 34 balls with 4 wickets in hand.Today match is the between southern super star and urbanrisers Hyderabad. Southern superstar won the toss and first decided bowling. Urbanrisers batsman makes 8 run in 1 over and southern superstar no any wicket against urbanrisers. Urbanrisers batsman makes 72 run in 10 over and 3 outs. Urbanrisers batsman could not worked hard. Urbanrisers batsman makes 156 run in 19 over and 10 outs. This is the target for southern superstar. Southern superstar can not complete this target and lose the match.Southern superstar batsman lose the match in 13 runs . Today match won by Urbanrisers Hyderabad.Well, I like this league because there are many old cricket players in this league who have retired. So, third game was finished now and the result is that URH team won this game from SSS team. URH first batting in pitch by lose toss from SSS team and SSS chose to bowl first. URH set a very challenging target of 156 runs and all team dismissed. Mostly batsmans of SSS team dismissed at low runs and they just scored 0, 5, 7 and 11 runs in field. P.Suyal got player of the game award today game of Legends league because he dismissed three wickets of SSS team. M.Guptill batting performance was outstanding, he scored 46 runs in 28 balls and he hitted six 4s and two 6s. Now, next game of this league was played tomorrow between BK and GG teams.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cheema02",
      "created_time": "November 22, 2023, 06:14:54 AM",
      "body": "Quote from: God bless u on November 21, 2023, 10:28:44 AMIn this thread we will discuss League and domestic cricket. currently Legends League Cricket 2023 is already started and two matches already finished. Last night match Urbanrisers won by 13 runs in 3rd match of Legends League Cricket against southern super star. Urbanrisers Hyderabad scored 156 runs  and all out in 19.2 overs. Martin Guptill amazing batting scored 46 runs in 28 balls just miss his half century by 4 runs short. Yogesh Nagar scored 40 runs in 29 balls. southern super star bowling well Hamid Hassan picked 4 wickets by giving 30 runs in 4 overs and Abdur Razzak also picked 2 wickets by giving 21 runs in 4 overs. southern super star scored only 143 runs and all out in 19.2 overs. Dilshan Munaweera scored 34 runs in 27 balls. The player of the match is Pawan Suyal for his outstanding bowling spell picked 3 important wicktes by giving 23 runs only is his bowling spell.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "God bless u",
      "created_time": "November 22, 2023, 09:29:43 AM",
      "body": "Quote from: Cheema02 on November 22, 2023, 06:14:54 AMQuote from: God bless u on November 21, 2023, 10:28:44 AMIn this thread we will discuss League and domestic cricket. currently Legends League Cricket 2023 is already started and two matches already finished. Last night match Urbanrisers won by 13 runs in 3rd match of Legends League Cricket against southern super star. Urbanrisers Hyderabad scored 156 runs  and all out in 19.2 overs. Martin Guptill amazing batting scored 46 runs in 28 balls just miss his half century by 4 runs short. Yogesh Nagar scored 40 runs in 29 balls. southern super star bowling well Hamid Hassan picked 4 wickets by giving 30 runs in 4 overs and Abdur Razzak also picked 2 wickets by giving 21 runs in 4 overs. southern super star scored only 143 runs and all out in 19.2 overs. Dilshan Munaweera scored 34 runs in 27 balls. The player of the match is Pawan Suyal for his outstanding bowling spell picked 3 important wicktes by giving 23 runs only is his bowling spell. The target was not big and chasing team should secure the victory. Dilshan Munaweera played absolutely brilliant but he couldn't finished it for winning. Mpufu double strike of both openers create pressure at the start and later Suyal strike make it easy for own team to win the low score match. In twenty overs match 150 chase is considered normal but due to attacking bowling and early fall of wickets its become hard to chase. Urbanrisers Hyderabad is looking very strong team. Their team include top twenty match players such as Martim Guptil, Suresh Raina and Dwayne Smith which alone one player in the team is enough to score high runs.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "noormcs5",
      "created_time": "November 22, 2023, 11:58:35 AM",
      "body": "Quote from: God bless u on November 22, 2023, 09:29:43 AMQuote from: Cheema02 on November 22, 2023, 06:14:54 AMQuote from: God bless u on November 21, 2023, 10:28:44 AMIn this thread we will discuss League and domestic cricket. currently Legends League Cricket 2023 is already started and two matches already finished. Last night match Urbanrisers won by 13 runs in 3rd match of Legends League Cricket against southern super star. Urbanrisers Hyderabad scored 156 runs  and all out in 19.2 overs. Martin Guptill amazing batting scored 46 runs in 28 balls just miss his half century by 4 runs short. Yogesh Nagar scored 40 runs in 29 balls. southern super star bowling well Hamid Hassan picked 4 wickets by giving 30 runs in 4 overs and Abdur Razzak also picked 2 wickets by giving 21 runs in 4 overs. southern super star scored only 143 runs and all out in 19.2 overs. Dilshan Munaweera scored 34 runs in 27 balls. The player of the match is Pawan Suyal for his outstanding bowling spell picked 3 important wicktes by giving 23 runs only is his bowling spell. The target was not big and chasing team should secure the victory. Dilshan Munaweera played absolutely brilliant but he couldn't finished it for winning. Mpufu double strike of both openers create pressure at the start and later Suyal strike make it easy for own team to win the low score match. In twenty overs match 150 chase is considered normal but due to attacking bowling and early fall of wickets its become hard to chase. Urbanrisers Hyderabad is looking very strong team. Their team include top twenty match players such as Martim Guptil, Suresh Raina and Dwayne Smith which alone one player in the team is enough to score high runs. Bhilwara Kings will take on Gujarat Giants in the match that will start from one hour from now. This will be the fourth match that will be played at  Ranchi for the Legends League Cricket. Keeping in mind that  Bhilwara Kings have won the last match while Gujarat Giants have lost their last match, Bhilwara Kings will have an upper hand in today's match. I still remember the batting of Irfan Pathan, the captain of Bhilwara Kings, who scored 65 runs in only 19 balls. That was the game changer for Bhilwara Kings and I think that Bhilwara Kings won that match against India Capitals due to this wonderful innings.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nalain420",
      "created_time": "November 22, 2023, 04:33:35 PM",
      "body": "Today match is the between bhilwara king and Gujrat giants. Gujrat giants won the toss and first decided bowling. Gujrat giant batsman makes 18 run in 2 over and bhilwara king no any wicket against Gujrat giant. Gujrat giant batsman makes 99 run in 10 over and 3 outs. Gujrat giant batsman makes 172 run in 20 over and 6 outs. This is the target for bhilwara king. This is very hard target for bhilwara king. Now let's see bhilwara king batsman could complete this target.Bhilwara batsmen can achieve this target. If hard work and fast batting.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Compromise me",
      "created_time": "November 22, 2023, 04:37:09 PM",
      "body": "Quote from: Nalain420 on November 22, 2023, 04:33:35 PMToday match is the between bhilwara king and Gujrat giants. Gujrat giants won the toss and first decided bowling. Gujrat giant batsman makes 18 run in 2 over and bhilwara king no any wicket against Gujrat giant. Gujrat giant batsman makes 99 run in 10 over and 3 outs. Gujrat giant batsman makes 172 run in 20 over and 6 outs. This is the target for bhilwara king. This is very hard target for bhilwara king. Now let's see bhilwara king batsman could complete this target.Bhilwara batsmen can achieve this target. If hard work and fast batting.Bhilwara Kings need 147 runs in 96 balls . Gujrat Giants set a score of 172 runs on board with fall of 6 wickets. Chris Gayle performed very well and he made excellent  52 runs in just 27 balls , Richard levi also played well who made 28 runs in 21 balls ,Abhishek made  24 runs in 15 balls and Chirag made 24 runs in just 19 balls and he remained not out at the end of inning . From Bhilwara kings bowling side,Jesal performed very well,he took 2 wickets by giving 16 runs in 4 overs and Rahul Sharma also took 2 wickets by giving 25 runs in 4 overs. Bhilwara Kings score is 37 runs with fall of 2 wickets ,they need partnership.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Unknown Op",
      "created_time": "November 22, 2023, 05:01:13 PM",
      "body": "Quote from: Compromise me on November 22, 2023, 04:37:09 PMQuote from: Nalain420 on November 22, 2023, 04:33:35 PMToday match is the between bhilwara king and Gujrat giants. Gujrat giants won the toss and first decided bowling. Gujrat giant batsman makes 18 run in 2 over and bhilwara king no any wicket against Gujrat giant. Gujrat giant batsman makes 99 run in 10 over and 3 outs. Gujrat giant batsman makes 172 run in 20 over and 6 outs. This is the target for bhilwara king. This is very hard target for bhilwara king. Now let's see bhilwara king batsman could complete this target.Bhilwara batsmen can achieve this target. If hard work and fast batting.Bhilwara Kings need 147 runs in 96 balls . Gujrat Giants set a score of 172 runs on board with fall of 6 wickets. Chris Gayle performed very well and he made excellent  52 runs in just 27 balls , Richard levi also played well who made 28 runs in 21 balls ,Abhishek made  24 runs in 15 balls and Chirag made 24 runs in just 19 balls and he remained not out at the end of inning . From Bhilwara kings bowling side,Jesal performed very well,he took 2 wickets by giving 16 runs in 4 overs and Rahul Sharma also took 2 wickets by giving 25 runs in 4 overs. Bhilwara Kings score is 37 runs with fall of 2 wickets ,they need partnership.Now this fourth match of Legends league has reached its last stage and while match depend on last ball Bhalwar Kings squad will win this match or not. At current time, Bhalwar Kings squad need 5 scores in last ball or last over this match and this scores will be defend only when Lendl Simmons batters hit six on last delivery. The interesting thing is that Lendl Simmons  batters of Bhalwar Kings squad is too close to complete his century and he just only need 3 scores in last delivery of last overs. What do you think guys will Lendl Simmons will abe to complete his full century? and Bhalwar Kings squad will win this match from Giants squad?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "God bless u",
      "created_time": "November 23, 2023, 10:30:02 AM",
      "body": "Quote from: Unknown Op on November 22, 2023, 05:01:13 PMNow this fourth match of Legends league has reached its last stage and while match depend on last ball Bhalwar Kings squad will win this match or not. At current time, Bhalwar Kings squad need 5 scores in last ball or last over this match and this scores will be defend only when Lendl Simmons batters hit six on last delivery. The interesting thing is that Lendl Simmons  batters of Bhalwar Kings squad is too close to complete his century and he just only need 3 scores in last delivery of last overs. What do you think guys will Lendl Simmons will abe to complete his full century? and Bhalwar Kings squad will win this match from Giants squad?After playing a very good inning simmons not able to win match for his team. Im fourth match West Indies batsmen make high score for both sides..Chris gayle score 52 of just 27 ball which is high score from Gujarat Giants side.. on the other side Lendl Simmons played a very good inining and score 99 not out. Match was totally in the hand of Bhilwara Kings. In 12 balls 19 runs was required and set batsmen was on the crease. all credit goes to last two over ballers who bowled brilliantly and win the match for the team. In last over when Jesal Karia hit six it was looking that he will finish in the next two ball but Sreesanth doesn't allow both batsmen to hit any other boundary. This was a first close match in this tournament.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "noormcs5",
      "created_time": "November 23, 2023, 02:01:29 PM",
      "body": "Quote from: God bless u on November 21, 2023, 10:28:44 AMEvery one enjoyed tournament. WC ends but cricket is non stop and everyday match is live in any side of the world.Today is the first match of the India vs Australia series and I am grated sure that India will lose this match, I know if India loses so this will be a very shameful moment for India in their home ground but India will try to win but they can’t win because this time India squad is very poor. Some players are resting and some players are injured and some players took retirement from the Indian team, so that’s why I think India can’t perform in this match, let’s see will the Indian team perform or not in today’s match and in all five matches of this series.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Unknown Op",
      "created_time": "November 23, 2023, 03:49:15 PM",
      "body": "Fourth match of Legends league Cricket competition was finished today. In this match, Urbanrisers Hyderabad squad fight with India Capitals squad. This match was also quite competitive similar to the yesterday tough match Giants squad versus Kings squad. In today match, URH squad came in filed for first this match by batting inning and to set a defending target. In 20 overs, Urbanrisers squad made a very intense defending target and total of 189 scores which was not a small and low target. This is second most high defending target made in this league. Against squad India Capitals was unable to defend this target and lose this today match by only 3 scores. India Capitals squad put in a lot of struggle in today match, but they could not get a victory due to their slightly low performance compared to URh squad.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nalain420",
      "created_time": "November 23, 2023, 05:56:03 PM",
      "body": "Quote from: Unknown Op on November 23, 2023, 03:49:15 PMFourth match of Legends league Cricket competition was finished today. In this match, Urbanrisers Hyderabad squad fight with India Capitals squad. This match was also quite competitive similar to the yesterday tough match Giants squad versus Kings squad. In today match, URH squad came in filed for first this match by batting inning and to set a defending target. In 20 overs, Urbanrisers squad made a very intense defending target and total of 189 scores which was not a small and low target. This is second most high defending target made in this league. Against squad India Capitals was unable to defend this target and lose this today match by only 3 scores. India Capitals squad put in a lot of struggle in today match, but they could not get a victory due to their slightly low performance compared to URh squad.Today match is the very interesting match because is the between urbanrisers Hyderabad team and India capital team.Because urbanrisers batsman tried and worked hard and played with each other. Obviously, this is a tough target and if India Capital's batsmen put in the effort they could have achieved the target.This is very shame lose the 3 run in this match. India capital batsman up pressure than no win the match because India capital batsman lose the 3 run. Today match won by 3 run in urbanrisers Hyderabad.They can aim higher if they want, for that they will have to work harder than today's match and that is possible only with each other.Today match urbanrisers batsman played very well. All the batsmen and bowlers gave their best and won the match.Now let's see if Urbanrisers batsmen and bowlers can perform in the next matches. If the performance is very good in the next matches, they will become a strong team.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "God bless u",
      "created_time": "November 24, 2023, 03:21:04 PM",
      "body": "6th Match Manipal Tiger VS Bilwara KingWhat a knock from MT.. 212 target is strong enough to defend in T20 Match. High runs pressure will make easy for bowlers to defend huge target. Roban Uthapa and Walton gives a very solid start to the team especially Walton inining is best one of this tournament.. Sidebottom  economy rate is best but I don't understand why he has given only three overs. Lindle Simmons couldn't score today and out on duck. now Dilshan have to play responsible batting just like SKY played yesterday. I think Manipal Tigers will win today match with 50 or more runs margin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nalain420",
      "created_time": "November 24, 2023, 05:02:25 PM",
      "body": "Quote from: God bless u on November 24, 2023, 03:21:04 PM6th Match Manipal Tiger VS Bilwara KingWhat a knock from MT.. 212 target is strong enough to defend in T20 Match. High runs pressure will make easy for bowlers to defend huge target. Roban Uthapa and Walton gives a very solid start to the team especially Walton inining is best one of this tournament.. Sidebottom  economy rate is best but I don't understand why he has given only three overs. Lindle Simmons couldn't score today and out on duck. now Dilshan have to play responsible batting just like SKY played yesterday. I think Manipal Tigers will win today match with 50 or more runs margin. Today match is the between bhilwara king and Manipal tiger. Bhilwara king won the toss and first decided bowling. Manipal tiger batsman makes 64 run in 7 over and bhilwara king no any wicket against Manipal tiger. Manipal tiger batsman could  worked hard. This is very good started for Manipal tiger. bhilwara bowler out the Manipal batsman in the fourth ball of the 9 over. This is the first achievement for bhilwara king team. Manipal batsman makes 98 run in 10 over and 1 out. Manipal tiger batsman makes 211 run in 20 over and 3 outs. This is the target for bhilwara king. This is very hard target for bhilwara king. Bhilwara king batsman can not complete this target and lose the match. Bhilwara king could not worked hard and lose the match. Today match Manipal tiger batsman played very well and won the match.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Unknown Op",
      "created_time": "November 24, 2023, 05:36:39 PM",
      "body": "Quote from: Nalain420 on November 24, 2023, 05:02:25 PMQuote from: God bless u on November 24, 2023, 03:21:04 PM6th Match Manipal Tiger VS Bilwara KingWhat a knock from MT.. 212 target is strong enough to defend in T20 Match. High runs pressure will make easy for bowlers to defend huge target. Roban Uthapa and Walton gives a very solid start to the team especially Walton inining is best one of this tournament.. Sidebottom  economy rate is best but I don't understand why he has given only three overs. Lindle Simmons couldn't score today and out on duck. now Dilshan have to play responsible batting just like SKY played yesterday. I think Manipal Tigers will win today match with 50 or more runs margin. Today match is the between bhilwara king and Manipal tiger. Bhilwara king won the toss and first decided bowling. Manipal tiger batsman makes 64 run in 7 over and bhilwara king no any wicket against Manipal tiger. Manipal tiger batsman could  worked hard. This is very good started for Manipal tiger. bhilwara bowler out the Manipal batsman in the fourth ball of the 9 over. This is the first achievement for bhilwara king team. Manipal batsman makes 98 run in 10 over and 1 out. Manipal tiger batsman makes 211 run in 20 over and 3 outs. This is the target for bhilwara king. This is very hard target for bhilwara king. Bhilwara king batsman can not complete this target and lose the match. Bhilwara king could not worked hard and lose the match. Today match Manipal tiger batsman played very well and won the match.Sixth match of Legends League has just finished a short while ago which was Manipal Tiger squad versus Bhilwara kings squad. In today match, wee see that Manipal Tiger squad won this match with great difference of scores. Opponent squad of Manipal Tiger squad could not show great effort in bowling inning as well as in batting inning. First very worst performance in bowling inning because they can not break Manipal squad at small defending scores, 211 scores not a small defending target. Then in batting inning, whole batters of Bhilwara kings squad was wiped out at 122 scores only with eight batters lost. Robin Uthappa batter of Tiger squad achieved mid century  off 29 balls and Chadwick Walton batter completed his full century in 55 balls.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "God bless u",
      "created_time": "November 25, 2023, 10:10:06 AM",
      "body": "Quote from: Unknown Op on November 24, 2023, 05:36:39 PMSixth match of Legends League has just finished a short while ago which was Manipal Tiger squad versus Bhilwara kings squad. In today match, wee see that Manipal Tiger squad won this match with great difference of scores. Opponent squad of Manipal Tiger squad could not show great effort in bowling inning as well as in batting inning. First very worst performance in bowling inning because they can not break Manipal squad at small defending scores, 211 scores not a small defending target. Then in batting inning, whole batters of Bhilwara kings squad was wiped out at 122 scores only with eight batters lost. Robin Uthappa batter of Tiger squad achieved mid century  off 29 balls and Chadwick Walton batter completed his full century in 55 balls.I already told that score board pressure will make easy for Manipal tiger to defend the score. When target is high then chasing is not easy..chasing team have to take risk in every over because run rate is above 10..Any mis ball will increase the run rate and batsmens have to take risk and here they will loss wickets..A same thing happened with Bhilwara Kings and didn't able to make good partnership to make it close to the target..The result was obvious after first inining and Manipal won by very good score.Today is also a very good match. India capital will face Southern star..Gautam ghambir and Ross Taylor are the captains of team and both are experienced players of international cricket..Match will be start 1 utc..I hope it will be good ganme.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nalain420",
      "created_time": "November 25, 2023, 03:34:00 PM",
      "body": "Today match is the between India capital and southern superstar. India capital won the toss and first decided bowling. Southern batsman makes 3 run in 1 over and India capital no any wicket against southern superstar. India capital bowler out the southern superstar batsman in the fiveth ball of the 4 over. This is the first achievement for India capital team. Southern superstar batsman makes 25 run in 4 over and 1 out. Southern superstar batsman could effort and struggle. Southern superstar batsman makes 66 run in 10 over and 3 outs. Southern batsman makes 163 run in 20 over and 6 outs. This is the target for India capital. Now let's see if India Capital will win the match. As far as India Capital seems to lose the match.ImdiaCapital batsmen don't seem to be trying and struggling.If India Capital batsmen can try then match will be won otherwise match will be lost.Quote from: God bless u on November 25, 2023, 10:10:06 AMToday is also a very good match. India capital will face Southern star..Gautam ghambir and Ross Taylor are the captains of team and both are experienced players of international cricket..Match will be start 1 utc..I hope it will be good ganme.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Unknown Op",
      "created_time": "November 25, 2023, 04:47:47 PM",
      "body": "Quote from: Nalain420 on November 25, 2023, 03:34:00 PMToday match is the between India capital and southern superstar. India capital won the toss and first decided bowling. Southern batsman makes 3 run in 1 over and India capital no any wicket against southern superstar. India capital bowler out the southern superstar batsman in the fiveth ball of the 4 over. This is the first achievement for India capital team. Southern superstar batsman makes 25 run in 4 over and 1 out. Southern superstar batsman could effort and struggle. Southern superstar batsman makes 66 run in 10 over and 3 outs. Southern batsman makes 163 run in 20 over and 6 outs. This is the target for India capital. Now let's see if India Capital will win the match. As far as India Capital seems to lose the match.ImdiaCapital batsmen don't seem to be trying and struggling.If India Capital batsmen can try then match will be won otherwise match will be lost.Quote from: God bless u on November 25, 2023, 10:10:06 AMToday is also a very good match. India capital will face Southern star..Gautam ghambir and Ross Taylor are the captains of team and both are experienced players of international cricket..Match will be start 1 utc..I hope it will be good ganme. Today match of Legends league has reached a most suspenseful and thrilling situation and last overs of this match are ongoing on crease. Currently, India capitals squad are batting on the crease and they are defending a very good target who gave by against squad Superstars. At present, India capitals squad need 26 scores in 30 deliveries and batters on the crease are Ricardo Powell and Kirk Edwards. Ricardo Powell batter are close to his incredible century and only 6 scores are remain for century and he scored 94 scores off 54 balls and Kirk Edwards scored 26 scores by playing 29 deliveries still both these batters are not got out. It seems that this match is in the game of Capital squad but anything happen right now. Let's see which squad emerge victory at end.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}