{
  "id": "topic_5407508",
  "title": "Agbe",
  "author": "Agbe",
  "created_time": "July 24, 2022, 11:12:08 PMLast edit: July 25, 2022, 04:02:49 PM by Agbe",
  "content": "Metaphor of Bitcoin: Radio Frequency 93.1 Bitcoin SeminarJuly 23, 2022 Ignorant People are still falling for bitcoin seminars in the rural and some major cities in the world. I was listening to 93.1 Radio Station in my locality. And a programme pop up titled, \"Metaphor of Bitcoin\". Which the presenter and the sponsor of the programme were try to explain the Metaphor of Bitcoin and I was provoked, they provided a phone number for the interested people to send text. What the sponsor said that made me provoked was, he said, Metaphor of Bitcoin is an Investment Platform (wallet) whereby bitcoiners can used to make money. It is a decentralized system in which nobody can control another person coin (s) even the developer of the software. It also uses per to per (p2p) system. And the presenter was asked to explain the p2p system to the listeners and sponsor said, \"it is just like meeting whereby members among themselves give money to the person that is due to collect\". Later he put it in this way. It is a contribution of money among people. Although to some extend he was correct but I called the number  which was provided and explained p2p to them in detail. Quote Peer to peer means, it is the direct exchange of goods and services (asset) among users of digital currencies without the interference of the national authorities.  I recorded part of the programme, I would have uploaded it but this forum doesn't accept audio. So I used another website to upload the audio. See link to the audio http://sndup.net/gchbFinally. Then I thought to myself. The Knowledge getting from Bitcointalk is enough for me. They can't deceived anymore. I have learned and known. See     My First Encounter/Experience With Crypto-Currency (Bitcoin) 2015",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5407508",
  "comments": [
    {
      "author": "Vaskiy",
      "created_time": "July 24, 2022, 11:33:21 PM",
      "body": "That's really nice, that you made a call and gave a clear explanation about P2P. Same as you, many people might be hearing the program and know what he said isn't perfect and they just ignore. You've done a good job correcting the person with the knowledge acquired from Bitcointalk. Everyone wants to do this and such activities will make people learn the truth about the market than the hype.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitMaxz",
      "created_time": "July 24, 2022, 11:50:28 PM",
      "body": "There are few of them here in my area at first they said they would help people to make money fast and invest related to Bitcoin but in the end, after you pay the entrance fee you can now join their seminar and the seminar is almost related to trading and nothing else. It is almost all basic trading and a guide on having a Bitcoin wallet which the guide can easily find on the internet.The only thing that I noticed is that why would they say fast without telling people that trading is risky or Bitcoin is risky?I don't agree with most of what they said about Bitcoin without warning people about the risk. And another thing is there is some seminar that leads you to crypto investment with instant profit which is a scam but still people believe they will make money by investing in such a scheme. Many ignorant people don't know anything about crypto yet and mostly are senior people who end up investing with a big amount and believe they will make a big money instantly.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fundamentals Of",
      "created_time": "July 25, 2022, 01:08:28 AM",
      "body": "I have encountered a number of Bitcoin or crypto-related seminars and talks in the past. I haven't attended even one of them. I always have reservations when it comes to this kind of activities. It is because Bitcoin doesn't have any PR or marketing team. So any team or group of individuals who shells out money to rent a hotel or a function room of a resort or a restaurant to explain Bitcoin must have some ulterior motives. It is either they are soliciting investment or they're promoting an exchange or centralized wallet or even scam. Whatever the products and services are, the primary objective is to make money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zlantann",
      "created_time": "July 25, 2022, 01:28:44 AM",
      "body": "Getting a foundational knowledge of Bitcoin is the most essential step or procedure. People must be able to understand how Bitcoin works and the merit and demerits of using the currency. But in recent times we have seen these so called investors brainwashing people about quick returns from investing in Bitcoin. They showcase Bitcoin as a ponzi scheme or get rich quick investment thereby swindling people of their hard earned money. Our responsibility at all time is to ensure that we reorient and re-inform people and ensure that they get the right information about Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blockman",
      "created_time": "July 25, 2022, 02:06:06 AM",
      "body": "So basically, CMIIW, he's promoting an investment platform? Like this due is promoting some sort of another likely pyramiding scheme. I doubt it that he's said the truth about such platform that he had mentioned. It's actually true that bitcoin is centralized but if it's a platform where someone can invest their bitcoin and let it grow alone, that's a false introduction to the listeners that will certainly mislead a lot of them into thinking that it's easy to earn bitcoin if you already had it and just invest it in some platforms.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "crwth",
      "created_time": "July 25, 2022, 02:22:53 AM",
      "body": "Misinformation among the cryptocurrency communities is evident and will be rampant regarding newbies. There are a lot of people who are becoming a victim because of their lack of knowledge and self-research. Some people are lazy when reading facts and ensuring that they read suitable sources. Like here in the forum. I do hope people would be more interested in the truth and verify that it's true or not. That kind of station should be somewhat penalized or something.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bestcoins1",
      "created_time": "July 25, 2022, 02:42:31 AM",
      "body": "I've also found this kind of thing in the past in the city I live in now where there are some people who make seminars on cryptocurrency in hotels carrying the name Bitcoin, but in the end they tell everyone to put Bitcoin on their platform. Namely MMM Global And another one is a seminar about altcoins such as truecoin which is said to be worth more than Bitcoin so it made me laugh at the time and strangely enough they didn't know about Bitcointalk so I wasn't sure what they were saying.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ahli38",
      "created_time": "July 25, 2022, 04:07:16 AM",
      "body": "Quote from: Zlantann on July 25, 2022, 01:28:44 AMGetting a foundational knowledge of Bitcoin is the most essential step or procedure. People must be able to understand how Bitcoin works and the merit and demerits of using the currency. But in recent times we have seen these so called investors brainwashing people about quick returns from investing in Bitcoin. They showcase Bitcoin as a ponzi scheme or get rich quick investment thereby swindling people of their hard earned money. Our responsibility at all time is to ensure that we reorient and re-inform people and ensure that they get the right information about Bitcoin.  You are right. many fraudsters carry the name bitcoin in an attempt to attract the people they target. be it in a ponzi scheme or in other fraudulent investments. even a few months ago in my country something like that happened that made the name bitcoin a little worse in the eyes of people who were not familiar with technology. So at that time in my area, parents thought that the name bitcoin was a fraudulent investment. they misunderstood because the media is also not good at conveying news so it is prone to misunderstanding for people who are technology blind.even to the point that there are parents who forbid their children to approach things related to bitcoin. I also think that if this misunderstanding is allowed to continue, it will become even more chaotic and will be difficult to rectify when it reaches a severe level.That's where I started to move to explain the real bitcoin to the people around me. With my limited knowledge, it turns out that the people around me are starting to not misunderstand anymore. But it takes extra effort to explain more easily to people who are elderly. but to my friends of the same age it is very easy to explain.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "_BlackStar",
      "created_time": "July 25, 2022, 04:20:37 AM",
      "body": "Quote from: BitMaxz on July 24, 2022, 11:50:28 PMThere are few of them here in my area at first they said they would help people to make money fast and invest related to Bitcoin but in the end, after you pay the entrance fee you can now join their seminar and the seminar is almost related to trading and nothing else. It is almost all basic trading and a guide on having a Bitcoin wallet which the guide can easily find on the internet.Taking advantage of other people's ignorance to get more benefits, those are some things that people out there are starting to trend. They think that nothing is free even just by providing basic information about bitcoin and its uses. Unlike in forum, we always have free classes for correct information about bitcoin even it's technical knowledge.There are indeed positives from spreading a lot of information about bitcoin, but such basic information is freely available on forum and official website. People don't have to pay for it, but they just need to be aware that there is a lot of correct information here or official sites that just require them to read.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Alisha-k",
      "created_time": "July 25, 2022, 04:51:27 AM",
      "body": "Ponzi schemers has been using Bitcoin to and other crypto assets to carry out their fraudulent p2p activities in which after few weeks of commitment and trust from their victims  they just zoom off into thin air. My biggest discomfort with this scheme is how presenters go ahead to air this programs on their channels knowing how dangerous ponzi schemes are to the society. In the days of ignorance mistakes are inevitable i wish another program can be aired on that channel to correct the mistake that the victims of this presentation will bring about",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Don Pedro Dinero",
      "created_time": "July 25, 2022, 04:57:00 AM",
      "body": "In this world you have to be constantly on your guard against being ripped off. Scammers usually sell you their product with nice words, obviously, because they don't want you to be aware that they want to scam you. Even in the case of legal projects that are not technically scams, there is also a lot of marketing that doesn't tell you everything, such as trading courses that minimise the risk of losing money and focus on the fact that you are going to earn a lot of money easily.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "July 25, 2022, 05:21:03 AM",
      "body": "Quote from: blockman on July 25, 2022, 02:06:06 AMIt's actually true that bitcoin is centralized but if it's a platform where someone can invest their bitcoin and let it grow alone, that's a false introduction to the listeners that will certainly mislead a lot of them into thinking that it's easy to earn bitcoin if you already had it and just invest it in some platforms.I correct you: Bitcoin is decentralized, unless you depend on exchanges for off-ramps. Everything else you said is true, but let me make it a bit more clear: Bitcoin is not an investment platform or stock, it is a currency.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "aoluain",
      "created_time": "July 25, 2022, 06:01:17 AM",
      "body": "Indeed, Bitcoin is certainly Decentralised and it is not itself an investment platform althoughwith certain 3rd party platforms a lot of the community treat it as an investment.As per the OP I think the sponsor from the radio programme has just got their facts incorrect and maybe they were voicing their personal opinion. Even on a metaphorical level what they said was not accurate, I mean its very very easy to find out what Bitcoin actually is and there is no need to create a metaphor to explain it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "davis196",
      "created_time": "July 25, 2022, 06:02:44 AM",
      "body": "Having Bitcoin \"experts\" pretending to understand how the blockchain works and trying to explain it to other people by talking complete BS is totally cringe. You did a great job, but at the end of the day, nobody cares that much about what peer-to-peer actually is and how the blockchain works. The only thing that gets people's attention is how to make money out of Bitcoin and what will happen with the Bitcoin price.You could give yourself a medal for being a \"Bitcoin educator\", but 95% of the people will stay completely ignorant about Bitcoin and how it works.  We can't change this. It doesn't matter how desperately we are trying to promote BTC and it's features to other people.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LogitechMouse",
      "created_time": "July 25, 2022, 08:13:34 AM",
      "body": "Misinformation everywhere :facepalm:The worse is that, there are newbies who are falling into it because \"they're newbies\" and they don't know what they are doing and they thought that these seminars are the ones that will provide \"true\" knowledge to them but it's the opposite. I feel bad for these newbies but there's nothing we can do but to just continue to teach and teach.Well, I always believe that newbie investors will not lean if they will not experience the hard way of learning. They will encounter things like this where they will invest into wrong types of investments like this one. It's pretty obvious that they are misleading these newbies. I wish there will be a seminar here in our place regarding Bitcoin where anybody can join and if I find that they are misleading, I will stand up and debunk what the speakers are saying and I will say the truth .",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mr. Magkaisa",
      "created_time": "July 25, 2022, 08:34:57 AM",
      "body": "Quote from: Agbe on July 24, 2022, 11:12:08 PMMetaphor of Bitcoin: Radio Frequency 93.1 Bitcoin SeminarJuly 23, 2022 Ignorant People are still falling for bitcoin seminars in the rural and some major cities in the world. I was listening to 93.1 Radio Station in my locality. And a programme pop up titled, \"Metaphor of Bitcoin\". Which the presenter and the sponsor of the programme were try to explain the Metaphor of Bitcoin and I was provoked, they provided a phone number for the interested people to send text. What the sponsor said that made me provoked was, he said, Metaphor of Bitcoin is an Investment Platform (wallet) whereby bitcoiners can used to make money. It is a decentralized system in which nobody can control another person coin (s) even the developer of the software. It also uses per to per (p2p) system. And the presenter was asked to explain the p2p system to the listeners and sponsor said, \"it is just like meeting whereby members among themselves give money to the person that is due to collect\". Later he put it in this way. It is a contribution of money among people. Although to some extend he was correct but I called the number  which was provided and explained p2p to them in detail. Quote Peer to peer means, it is the direct exchange of goods and services (asset) among users of digital currencies without the interference of the national authorities.  I recorded part of the programme, I would have uploaded it but this forum doesn't accept audio.Finally. Then I thought to myself. The Knowledge getting from Bitcointalk is enough for me. They can't deceived anymore. I have learned and known. See     My First Encounter/Experience With Crypto-Currency (Bitcoin) 2015 First of all, I'm sorry you had a bad experience entering the bitcoin industry. Although this isn't bad actually instead it is good, it just seems that the first ones you run into are deceitful people in this matter. It's not really clear to me if you still got the Bitcoin you entered on that platform. Because at that time in 2015, the value of Bitcoin was still low and now even though its price has fallen, I can still say that there is a big difference between its price then and now. And I also saw that it was good that you made a topic post in this forum so that you can also see the opinion or advice of others that you think will also help you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Strongkored",
      "created_time": "July 25, 2022, 09:04:52 AM",
      "body": "Those who already have enough knowledge about bitcoin and how there are many scams with investing in crypto will no longer be tempted but unfortunately even more who do not know what bitcoin and how scammers try to deceive people, what's more annoying is that it's quite difficult to convince those people that it's a scam.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "July 25, 2022, 09:18:56 AM",
      "body": "Quote from: Agbe on July 24, 2022, 11:12:08 PMFinally. Then I thought to myself. The Knowledge getting from Bitcointalk is enough for me. They can't deceived anymore. I have learned and known.Let me help you to put this more correctly, 'Bitcointalk makes people to be exposed more to let them know how many things in life are not what novices thought they are'. Example are the seminars. What most of them will teach people will be how to trade, but you have known about this already. Also from any seminar, you will see how the organizers are very wrong in many aspects. I have experienced this before too countless number of times. There is nothing better to be on a forum like Bitcointalk, it is never a wrong forum to be to discuss what is related to bitcoin, crypto, economy, life and many other aspects.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Upgrade00",
      "created_time": "July 25, 2022, 09:36:40 AM",
      "body": "Quote from: Strongkored on July 25, 2022, 09:04:52 AM...unfortunately even more who do not know what bitcoin and how scammers try to deceive people, what's more annoying is that it's quite difficult to convince those people that it's a scam.This is the greed factor. • Bitcoin as a get rich quick scheme, where one buys low and sells high a couple months later, driving off in their lambo, is a lot more attractive than, • Bitcoin as a decentralized currency, which is pseudo anonymous, immutable, secure and irreversible, giving their user full control over their finances, without being dependent on a third party.For this reason, people want to believe what scammers say and fall for cheap scams, like send 1 BTC to get 2 back.Quote from: blockman on July 25, 2022, 02:06:06 AMit's actually true that bitcoin is centralized Bitcoin is NOT centralized, has never been.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}