{
  "id": "topic_5437601",
  "title": "tarotfied",
  "author": "tarotfied",
  "created_time": "February 01, 2023, 08:16:10 AMLast edit: February 01, 2023, 08:28:00 AM by tarotfied",
  "content": "I have a BIP38 paper wallet, that when I decrypt using bitaddress (which I used to create the paper wallet), it results in a compressed public key that matches the paper wallet public key, and that key shows a balance on memspace.pool.I've tried sweeping the private key into two wallets (Green and Sparrow), but each time I get an error that the UTXOs contain insufficient funds to spend. How could this be happening? Or am I doing something incorrectly? It's been a couple of years, but I was able to sweep from the same sheet of paper keys into Green in the past.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5437601",
  "comments": [
    {
      "author": "LoyceV",
      "created_time": "February 01, 2023, 08:40:56 AM",
      "body": "Could it be those wallets by default assume the private key belongs to a Segwit address? If that's the case, the wallets give you a different address.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tarotfied",
      "created_time": "February 01, 2023, 09:00:03 AM",
      "body": "Quote from: LoyceV on February 01, 2023, 08:40:56 AMCould it be those wallets by default assume the private key belongs to a Segwit address? If that's the case, the wallets give you a different address.Sparrow displays the (correct, it matches the paper key) compressed public key when I sweep the private key. But it won't allow me to create the transaction.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LoyceV",
      "created_time": "February 01, 2023, 09:04:34 AM",
      "body": "Try Electrum? Make sure to download it from the real site, there are many phishing sites that give you a compromised wallet.If you create a new wallet and import the private key, it should show the transaction history.Quote from: tarotfied on February 01, 2023, 08:16:10 AMmemspace.poolIt's the other way around: https://mempool.space/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OmegaStarScream",
      "created_time": "February 01, 2023, 09:19:57 AM",
      "body": "You can also try to use Exodus wallet. Instead of decrypting the private keys, and then importing them, try to sweep the encrypted ones directly[1].[1] https://www.exodus.com/support/article/87-can-i-import-a-private-key",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tarotfied",
      "created_time": "February 01, 2023, 09:47:54 AM",
      "body": "Quote from: OmegaStarScream on February 01, 2023, 09:19:57 AMYou can also try to use Exodus wallet. Instead of decrypting the private keys, and then importing them, try to sweep the encrypted ones directly.Thanks, I appreciate the response, but would Exodus have to have internet to try this? I don't expect I'll be entering my BIP38 password under that scenario.Quote from: LoyceV on February 01, 2023, 09:04:34 AMTry Electrum? Make sure to download it from the real site, there are many phishing sites that give you a compromised wallet.If you create a new wallet and import the private key, it should show the transaction history.I may try sweeping the WIF into Electrum, but I'd really rather not add another wallet to the mix, unless there's something specific about Electrum that might help resolve this.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OmegaStarScream",
      "created_time": "February 01, 2023, 09:57:39 AM",
      "body": "Quote from: tarotfied on February 01, 2023, 09:47:54 AMThanks, I appreciate the response, but would Exodus have to have internet to try this? I don't expect I'll be entering my BIP38 password under that scenario.Yes, an internet connection is required, because by doing this, you're actually moving the funds from the paper wallet to one of your exodus wallet addresses.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LoyceV",
      "created_time": "February 01, 2023, 10:10:26 AM",
      "body": "Quote from: tarotfied on February 01, 2023, 09:47:54 AMI may try sweeping the WIF into Electrum, but I'd really rather not add another wallet to the mix, unless there's something specific about Electrum that might help resolve this.That's even more reason to (only) use Electrum: it allows you to keep the private key offline:Quote from: LoyceV on February 19, 2021, 05:35:55 PMOnline:Install Electrum on your PC.Import your address to create a watch-only wallet.Preview the transaction, Copy the unsigned transaction. Put it on a USB stick.Offline and running without hard drive storage:Get a Linux LIVE DVD. Use Knoppix or Tails for instance, or any other distribution that comes with Electrum pre-installed.Unplug your internet cable. Close the curtains. Reboot your computer and start up from that DVD. Don't enter any wireless connection password. Keep it offline.Start Electrum. Import your private key.Copy your unsigned transaction from the USB stick, load it into Electrum.CHECK the transaction in Electrum. Check the fees, check the amount, check all destination addresses (character by character).If all is okay, sign the transaction. Copy it back to your USB stick.Turn off the computer. That wipes the Live LINUX from memory and all traces are gone.Online:Use your normal online Electrum to (check again and) broadcast the transaction.Bonus:After moving all your Bitcoin, and once the transaction confirmed, check if you own Forkcoins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tarotfied",
      "created_time": "February 01, 2023, 11:04:35 AM",
      "body": "Quote from: LoyceV on February 01, 2023, 10:10:26 AMThat's even more reason to (only) use Electrum: it allows you to keep the private key offline:Thank you. I imported the priv key into offline electrum without any complaints. Did the PSBT for the full balance online and imported into offline electrum. Signed and saved, with no errors. I'm afraid to broadcast it now, because frankly I'm a little stressed out, I'd rather do it after a good sleep. If it was going to fail it would have been during signing, one would think?Thanks again.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LoyceV",
      "created_time": "February 01, 2023, 11:07:16 AM",
      "body": "Quote from: tarotfied on February 01, 2023, 11:04:35 AMI'm a little stressed out, I'd rather do it after a good sleep. If it was going to fail it would have been during signing, one would think?It can still fail, for instance if you set the fee too low (a signed transaction is slightly larger than an unsigned transaction). As long as you verify the destination address, verify the fee, and make sure any potential change goes to the address you want, you're good to go.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bnbstorm",
      "created_time": "February 01, 2023, 12:48:56 PM",
      "body": "Quote from: tarotfied on February 01, 2023, 08:16:10 AMI have a BIP38 paper wallet, that when I decrypt using bitaddress (which I used to create the paper wallet), it results in a compressed public key that matches the paper wallet public key, and that key shows a balance on memspace.pool.I've tried sweeping the private key into two wallets (Green and Sparrow), but each time I get an error that the UTXOs contain insufficient funds to spend. How could this be happening? Or am I doing something incorrectly? It's been a couple of years, but I was able to sweep from the same sheet of paper keys into Green in the past.I guess you need internet connection to sweep a key. Why don't you try to make a new electrum or exodus account and then sweep key. I may be wrong but according to my knowledge sweep option first get your balance from blockchain then transfer it to provided address minus fee.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tarotfied",
      "created_time": "February 02, 2023, 07:08:36 AM",
      "body": "Quote from: LoyceV on February 01, 2023, 11:07:16 AMyou're good to go.Just wanted to confirm that I was successful with offline Electrum. Would still like to understand why Sparrow and Blockstream Green failed with this key, but in any case the offline Electrum solution is better. Thanks for your advice!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nc50lc",
      "created_time": "February 03, 2023, 05:37:56 AM",
      "body": "Quote from: tarotfied on February 02, 2023, 07:08:36 AM-snip- Would still like to understand why Sparrow and Blockstream Green failed with this key, but in any case the offline Electrum solution is better.Quote from: tarotfied on February 01, 2023, 09:00:03 AMSparrow displays the (correct, it matches the paper key) compressed public key when I sweep the private key. But it won't allow me to create the transaction.In Sparrow, was \"Create Transaction\" unclickable?Because it wont be if there's no loaded wallet or address in \"Sweep to:\" where the bitcoins will be swept.Or was it in the next steps?In Blockstream Green, 'sweep' isn't available.Sweep in Blockstream Green for Android seems to be non functional since I'm getting the same \"No UTXOs found\" message. (may be a bug)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tarotfied",
      "created_time": "February 03, 2023, 11:40:17 AM",
      "body": "Quote from: nc50lc on February 03, 2023, 05:37:56 AMIn Sparrow, was \"Create Transaction\" unclickable?Because it wont be if there's no loaded wallet or address in \"Sweep to:\" where the bitcoins will be swept.Or was it in the next steps?I'm fairly certain I would have been working from an active wallet. Quote from: nc50lc on February 03, 2023, 05:37:56 AMIn Blockstream Green, 'sweep' isn't available.Sweep in Blockstream Green for Android seems to be non functional since I'm getting the same \"No UTXOs found\" message. (may be a bug)Thanks for confirming it wasn't just me. I suspect there's more to it than a bug, given that both wallets had the same problem.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nc50lc",
      "created_time": "February 04, 2023, 04:00:24 AM",
      "body": "Quote from: tarotfied on February 03, 2023, 11:40:17 AMQuote from: nc50lc on February 03, 2023, 05:37:56 AM-snip-I'm fairly certain I would have been working from an active wallet. Was the issue the button being grayed-out or it returned with similar \"no UTXOs\" message as Green?If the former, the recipient address/wallet below may not be auto-filled, selecting an active wallet should do the trick.If the latter, there's only one reason that it didn't found any UTXO: the server that you're connected to may be missing those UTXO.Additionally, you can't be offline at that time because otherwise, \"Sweep Private Key\" wont be clickable to access that window.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tarotfied",
      "created_time": "February 04, 2023, 05:55:51 AM",
      "body": "Quote from: nc50lc on February 04, 2023, 04:00:24 AMWas the issue the button being grayed-out or it returned with similar \"no UTXOs\" message as Green?If the former, the recipient address/wallet below may not be auto-filled, selecting an active wallet should do the trick.If the latter, there's only one reason that it didn't found any UTXO: the server that you're connected to may be missing those UTXO.Additionally, you can't be offline at that time because otherwise, \"Sweep Private Key\" wont be clickable to access that window.Sparrow was online, and gave a similar \"no UTXOs\" error.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}