{
  "id": "topic_5464117",
  "title": "Silence Scream",
  "author": "Silence Scream",
  "created_time": "August 22, 2023, 07:51:48 AM",
  "content": "Arkadaşlar ülkede spor denilince sadece futbol olduğu için pek bu branşlar bahsedilmese de, kadın voleybolda dünyada bir numarayız. Hala bir takım kendini bilmez şarlatanlar sporcularımızla uğraşıp, canlarını sıksalar da, kadına verilen değeri gerçek manada veren ve spora yönlendiren kişiler sayesinde kadınlar voleybolda açık ara dünyanın en iyi takımıyız. Burada dikkat çekmek istediğim şey değeri bilinmeyen kişiler.Neden bir Arda Güler transferi kadar konuşulmuyor bu başarı? Arda’nın transferinden ben de mutluyum ve gururluyum ancak burada Filenin Sultanlarının da hakkını vermek gerek. Veya okçulukta tarih yazan, geçmişinde ok kültürü olmasına rağmen yıllardır bu branşta başarılı bir isim çıkaramadığımız ülkenin gurur Mete Gazoz. Turnuvadan turnuvaya hatırlıyoruz. Genç yaşına rağmen dünya sıralamasında 6’ncı sıraya çıkmış bir milli gururumuz var. Ayrıca olimpiyat şampiyonu kendisi.Hala da çocukları futbola yönlendirmekle uğraşıyoruz. Bizim genlerimizde büyük başarılar var. Kızlarımız veya erkeklerimiz hangi branşta olursa olsun başarılı oluyorlarsa onlarla gururlanmalı ve her yerde dillendirmeliyiz. Gurur duyulacak sporcularımıza yenilerini bizlerin çocuklarımıza vereceği değerler ile eklememiz lazım ve futbolun sadece bir spor dalı olduğunu milletçe idrak etmemiz gerekir. Kaynak : https://en.volleyballworld.com/volleyball/world-ranking/womenKaynak : https://www.worldarchery.sport/rankings/world-ranking?country=All&category=Recurve%20Men",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5464117",
  "comments": [
    {
      "author": "meser#",
      "created_time": "August 22, 2023, 11:46:36 AM",
      "body": "Futbolun ön planda olmasının en büyük sebebini aslında imkanlara bağlıyorum. En azından benim çocukluk zamanımda yaşadığım yer ufak ve imkan bakimindan zayıf olan bir yerdi. Voleybol oynamak için file yoktu. Okulun bahçesinde direkler vardı ama filesi beden eğitimi derslerinde takılırdı. Basketbol için pota vardı ama pota 37 derece sağa yatikti. Ama futbol öyle mi? Kale mi yok çek iki tane taş parçası al sana Kale top mu yok ufak kola şişesini al peşinden kostur. Sokakta balon görünce röveşata atan adamı herkes hatırlar yani o bizim insanımızın içindeki her durumda ve koşulda futbol oynayabilme imkanımız gosteriyor. Bunları futbolu ovmek için demiyorum ama diğerlerine göre daha az handikapi var. Ama diğer branşlar öyle mi? Bakın misal ben masa tenisine karşı aşırı tutkuluydum ama birçok sebepten ötürü önüm kesilmişti. Belki daha iyi şartlarım olsaydı bu branşta bir yerlere gelebilirdim ama olmadı. Futbol dışındaki branşlarda bir yere gelenleri ayrı bir tebrik etmek gerekiyor. Ama tebrik etmek yeterli gelmiyor bu branşlara destek olmanın önünü actirmak gerek. Gür sesle konuşarak yaptırmak gerek ama işte ülkemizdeki bürokrasiyi asamiyoruz",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "W Jr.",
      "created_time": "August 22, 2023, 12:03:24 PM",
      "body": "Meser’e katılıyorum.2 taş koyup kale yapabildiğin, aynı zamanda mahallenin tüm çocuklarının sorunsuz oynayabileceği bir spor dalı var mı?Basketbol bir pota 5 kişi ile oynanıyor.Voleybol için fileler gerekiyor.Futbol için gereken topu çoraplardan bile oluşturabilirsiniz.Hal böyle olunca futbola olan ilgi Brezilya kadar oluyor ülkemizde.Futbola olan ilgi zamanla futbola olan tutkuyu da artırıyor.Elbette Filenin Sultanlarıyla gurur duyulacak durumlar var ancak genel olarak ülkece voleybol takip etmeme sebebimizin ana fikri budur.Bir diğer örnek tenis.Kort olmadığı için Türkiye’de zengin sporu gibi görülür ama Avrupa’da inanılmaz bir takipçi kitlesi var.Coğrafya kaderdir bunun özeti budur.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SUPERSAIAN",
      "created_time": "August 22, 2023, 02:48:25 PM",
      "body": "Gurur duyulacak her zaman birileri oldu sadece medyada gerektiği kadar yer verilmiyor. Kadın milli voleybol takımımız, okçulukta Mete Gazoz kazandıkları başarılar fazlasıyla gurur verici Avrupa ülkelerinde kendi sporcularına o ülkeler çok çok önem veriyorlar bu yüzden olimpiyatlarda, turnuvalarda her daim başarı kazanıyorlar yetiştirme ve destekleme sayesinde. Türkiye'de çok yetenekli sporcularımız var hiç biri hak ettiğini almıyor maddi, manevi olarak daha çok fazla spora küsen hedeflerini sonlandıran sporcu oluyor yeteri kadar destek bulamadıkları zaman sadece azimde yeterli olmuyor bir noktadan sonra.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LGD2Business",
      "created_time": "August 22, 2023, 03:04:19 PM",
      "body": "Ülkede 1 numaralı spor futbol ve neredeyse herkes takip etmese bile bir yerinden aşina sporcular tanınıyor. 2 numaralı spor basketbol ama hem izlenme oranları çok düşük hem de genel halkta çok fazla karşılığı yok. Diğer sporları saymıyorum bile onlara amatör branş gözüyle bakılıyor. Ülkede bu mantalite değişmedikçe fark eden bir şey olmaz isterse bir sporcumuz dünya rekorları kırsın veya bir takımımız kupalara ambargo koysun futbol değilse değeri haberlerde 5 dakikadan öteye geçmiyor.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Captain Corporate",
      "created_time": "August 22, 2023, 08:44:03 PM",
      "body": "Daha öncede bahsetmiştim, izlenme oranlarıyla alakalı bir olay bu, ülkeyle alakalı değil. Yani Amerika mesela 2. sırada, eminim daha önce birinci olduklarıda olmuştur, ama mesela kadınlar dünya kupası gibi erkeklerden çok daha izlenen bir futbol branşında bile başarısız olmaları daha çok konuşuldu, bir NBA bir NFL gibi konuşulmuyor voleybol takımları. Bu italya, sırbistan, brazilya gibi ülkeler içinde geçerli. Futbol dünyanın en çok izlenen sporu, o yüzden o kadar çok para dönüyor, müşterisi daha fazla, isterseniz Voleybolda her sene şampiyon olun, bir futbol kadar ilgi görmez, olay tamemen sporun müşteri kitlesine bağlı, ve Futbol dünyada birinci sırada oldukça, en çok o ilgi görecek.Elbette bu voleybolda ve okçulukta gösterilen başarıyı küçültmez, çok büyük bir iş başarılan, ve gerçekten sabahtan akşama kadar durmaksızın övmek lazım zira bu başarı ile gelecek başarılarıda sağlamak zorundayız, ne kadar çok duyurulur, ne kadar çok haykırılırsa, bir sonra ki jenerasyona o kadar çok yeni yetenek katabiliriz. Fakat neden daha az ilgi gördüğünü tartışmak anlamsız, izleyici sayısının az olduğu bir spor olduğu için sebebi. Halterde, güreşte yıllarca hegemonya olduğumuz dönemde oldu, futbol kadar onlarda konuşulmadı.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dzigie",
      "created_time": "August 22, 2023, 11:32:02 PM",
      "body": "Quote from: LGD2Business on August 22, 2023, 03:04:19 PMÜlkede 1 numaralı spor futbol ve neredeyse herkes takip etmese bile bir yerinden aşina sporcular tanınıyor. 2 numaralı spor basketbol ama hem izlenme oranları çok düşük hem de genel halkta çok fazla karşılığı yok. Diğer sporları saymıyorum bile onlara amatör branş gözüyle bakılıyor. Ülkede bu mantalite değişmedikçe fark eden bir şey olmaz isterse bir sporcumuz dünya rekorları kırsın veya bir takımımız kupalara ambargo koysun futbol değilse değeri haberlerde 5 dakikadan öteye geçmiyor.Ben de aslında buna benzer şeyler düşünüyorum. Ülke olarak yanlış spor organizasyonlarına yoğunlaşıyor olabilir miyiz? Kumsalda top oynayan yetenekli Brezilyalı futbolculara bakınca alt yapılara ne kadar yatırım yaparsak yapalım onları geçemeyeceğimizi düşünüyorum. Futbolda onları geçmek zorunda mıyız? Spor sadece futboldan mı oluşuyor? Kadın voleybol milli takımı başarıdan başarıya koşuyor. Getirdiği başarılar ile kıyaslandığında güreş salonlarının teknolojik açıdan inanılmaz kalite ve standartlara sahip olduğunu düşünen var mı? Neden bu kadar çok futbol diye de sormak istemiyorum. Söz konusu futbol olunca neden bu kadar çok başarıya endeksliyiz? Bazı spor dallarında daha iyiyken bazı spor dallarında başkalarına göre daha kötü olamaz mıyız? Slavların fiziksel özellikleri nedeniyle basketbola yatkınlıklarını veya Brezilyalı sambacıların futbola yatkınlıklarını görmezden mi geliyoruz?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CLS63",
      "created_time": "August 23, 2023, 07:28:26 AM",
      "body": "Kadın voleybol takımımız başarılar kazanmaya devam ettikçe gördüğü ilgi artmaya devam ediyor umarım bu destek ve ilgi artarak devam eder ancak bunu futbol ile mukayese etmeyi doğru bulmuyorum. Arda Güler'e ödenen 30 milyon euro bonservis bedelini benim gibi kadın voleybolunu hobi niyetine arada izleyen birine verseniz bile size kulüpler bazında avrupa'nın en iyi kupasını alacak kadroyu kurabilirim. Futbolda aynı şeyi bırakın 30 milyon ile 300 milyon ile yapamazsınız.Tüm dünya genelinde futbolun popülaritesi her zaman daha fazla olmuştur ve olacaktır. Bu mantıkla yarın öbür gün biri gelse e-spor takımımız şampiyon oldu ama Zehra Güneş'in smacı kadar konuşulmadı derse o da haklı çıkar.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ajanwalker",
      "created_time": "August 23, 2023, 08:21:03 AM",
      "body": "Bizim kızlar voleybolda dünya şampiyonu olmuş ve tarifeli uçakla ülkeye dönmüştü. ( ona da şükür ama) Bence devletin bir sürü özel uçağı var o uçaklardan birisi ile dönmesi lazımdı.Şurası da bir gerçek. Dünya da başarılı olmak istiyorsan devşirme oyuncular da olmalı. Örneğin melisa vargas gibi. Daha önce ilk Mehmet Aurelio ile başlayan bu furya bence devam etmeli. Kimse Türkmü değil mi bakmıyor. Sonuçta Türkiye şampiyon mu şampiyon bitti gitti",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "xzone",
      "created_time": "August 23, 2023, 08:40:17 AM",
      "body": "10 yıldır hatta daha uzun süredir her zaman bizim kızlar şampiyon, her zaman Avrupa ya da dünyada en iyiler ve hatta kulüpler bazında da dünya şampiyonlukları geliyor. Bütün voleybol ekolleri Türkiye milli takımını örnek alıyor, savaşçı, mücadeleci ve yetenekli olarak örnek gösteriyor. Buna rağmen halkın %80’inin dünyadan haberi yok, bu voleybol yıldızları sokağa çıkınca onları tanıyan bile çıkmıyor yeri geliyor.Bazıları instagram sayesinde biraz daha tanınır oldu ama yeterli bir tanınmışlık yok. Bence ilk olarak herkesin evinde voleybol izlenmeye başlanmalı, maçlar normal kanallarda yayınlanmalı. Basketbolun ikinci sırada olmasının en büyük sebeplerinden birisi bu, insanlar çok fazla izledi. Voleybolda ise kendi seyircileri dışında pek fazla izleyen yok, önce bunun değişmesi lazım.Umarım bir gün bu sporcuların değerini anlarız da haklarını verebiliriz. Biz voleybol ülkesiyiz diye reklam yapmakla olmuyor",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Phoenix Anka",
      "created_time": "August 23, 2023, 11:58:51 AM",
      "body": "Quote from: ajanwalker on August 23, 2023, 08:21:03 AMBizim kızlar voleybolda dünya şampiyonu olmuş ve tarifeli uçakla ülkeye dönmüştü. ( ona da şükür ama) Bence devletin bir sürü özel uçağı var o uçaklardan birisi ile dönmesi lazımdı.Şurası da bir gerçek. Dünya da başarılı olmak istiyorsan devşirme oyuncular da olmalı. Örneğin melisa vargas gibi. Daha önce ilk Mehmet Aurelio ile başlayan bu furya bence devam etmeli. Kimse Türkmü değil mi bakmıyor. Sonuçta Türkiye şampiyon mu şampiyon bitti gitti Bence de hocam. Türkiye milli takım forması giyiyorsa ve hak ediyorsa bu oyuncunun devşirilmesi, formayı sahada sırtına geçirilmesi lazım. Geçmişte futbolda Aurelio harika maçlar oynadı milli takım ile. Brezilyalı oyuncular bu anlamda milli takıma devşirilebilir futbolda. Larkin basketbolda takıma katkı sağlıyor, Vargas sayesinde milli takım coştu. Artıları çok.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Black Mbaye",
      "created_time": "August 23, 2023, 02:21:48 PM",
      "body": "Özellikle Mete Gazozla gurur duyuyorum ve her yerde söylüyorum bu çocuğun azmi muhteşem. Her şeyi deneyen Mete, okçulukta kendini bulmuş. Genç yaşında olimpiyat şampiyonu olmuş. Bu bir Türk gencinin muhteşem başarısıdır. Ayrıca boksta Busenazlar var. Onlar da muhteşemler.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gencecikmen",
      "created_time": "August 26, 2023, 03:24:10 PM",
      "body": "Voleybolda kadın Avrupa Şampiyonası maçları devam ediyor. Umarım kadınlarımız Avrupa şampiyonu olacaklar. Dün Sırbistan ile oynadıkları maçta, arada Sırbistan koçu takımına konuşma yaparken göğsüm kabardı. Konuşmasında: \"Şu an dünyanın en iyi takımına karşı oynuyorsunuz, dünyanın en iyi takımına karşı oynamanın verdiği zevki yaşayın anın tadını çıkarın. Her zaman en iyeye karşı oynamazsınız.\" Maçı izleyenlerin dikkatini çekmiştir bu konuşma. Milli takımımız yarın da Belçika ile karşılaşacak.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hvdv",
      "created_time": "August 27, 2023, 02:35:30 AM",
      "body": "Quote from: Gencecikmen on August 26, 2023, 03:24:10 PMVoleybolda kadın Avrupa Şampiyonası maçları devam ediyor. Umarım kadınlarımız Avrupa şampiyonu olacaklar. Dün Sırbistan ile oynadıkları maçta, arada Sırbistan koçu takımına konuşma yaparken göğsüm kabardı. Konuşmasında: \"Şu an dünyanın en iyi takımına karşı oynuyorsunuz, dünyanın en iyi takımına karşı oynamanın verdiği zevki yaşayın anın tadını çıkarın. Her zaman en iyeye karşı oynamazsınız.\" Maçı izleyenlerin dikkatini çekmiştir bu konuşma. Milli takımımız yarın da Belçika ile karşılaşacak. Dünyanın en iyi takımı olmak büyük gurur verici bir şey. Kadın voleybolda dünya lideriyiz, erkek Voleybolda da başarılıyız ancak nedense yeterli ilgi yok. Varsa yoksa futbol konuşuyoruz ki artık Suudi Arabistan’ın verdiği paraları da düşünürsek futbola olan ilgi daha da artacak. Yine de biz onlarla gurur duyuyoruz. İyi ki var kadın voleybol takımımız.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kriminall",
      "created_time": "August 28, 2023, 12:19:38 PM",
      "body": "Kadın Voleybol milli takımı bomba gibi yoluna devam ediyor, dün Belçika’yı 3-1 yenerek turnuvada çeyrek finale yükselmişiz, 6 maçta 6 galibiyet almışız, herhangi bir kaybımız yok ve doğru düzgün set bile vermemişiz rakiplere, bir alanda dünyada en iyisi olmak büyük gurur, seneler önce bu Amerika veya Rusya takımlarıyla liderlik yarışındaydık, artık açık ara en iyi takımız",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "eightdots",
      "created_time": "August 29, 2023, 06:30:51 AM",
      "body": "Quote from: Hvdv on August 27, 2023, 02:35:30 AMQuote from: Gencecikmen on August 26, 2023, 03:24:10 PMVoleybolda kadın Avrupa Şampiyonası maçları devam ediyor. Umarım kadınlarımız Avrupa şampiyonu olacaklar. Dün Sırbistan ile oynadıkları maçta, arada Sırbistan koçu takımına konuşma yaparken göğsüm kabardı. Konuşmasında: \"Şu an dünyanın en iyi takımına karşı oynuyorsunuz, dünyanın en iyi takımına karşı oynamanın verdiği zevki yaşayın anın tadını çıkarın. Her zaman en iyeye karşı oynamazsınız.\" Maçı izleyenlerin dikkatini çekmiştir bu konuşma. Milli takımımız yarın da Belçika ile karşılaşacak. Dünyanın en iyi takımı olmak büyük gurur verici bir şey. Kadın voleybolda dünya lideriyiz, erkek Voleybolda da başarılıyız ancak nedense yeterli ilgi yok. Varsa yoksa futbol konuşuyoruz ki artık Suudi Arabistan’ın verdiği paraları da düşünürsek futbola olan ilgi daha da artacak. Yine de biz onlarla gurur duyuyoruz. İyi ki var kadın voleybol takımımız. Buna benzer bir konuşmayı bizim milli takım zamanında birinciye karşı oynarken de yapılmıştı diye hatırlıyorum. Şimdi o bahsedilen takımın bizim takım olması gurur verici. Bu ilginin futboldan diğer branşlara kayması mümkün değil. Yılların getirdiği bir alışkanlık ve tercih söz konusu. O yüzden elimizden geldiğince bizi en iyi şekilde temsil eden sporcularımızı gururlandırmaya çalışmalıyız. Mesela ülkeye dönüşlerinde yapılan karşılama bile atlanmaması gerekiyor. Ne oynayacağı belirsiz futbolcuları bile kaç tane taraftar karşılıyorken milli başarıya imza atmış sporcularımıza daha hassas davranmalıyız. Voleybol dışında da birçok branşta başarılı olan milli sporcularımızı var. İlgi çok fazla olmasa bile en azından sponsorlar bulunmalı ve spor hayatlarında çok rahat ettirilmeleri gerektiğini düşünüyorum. Sporda sponsor birçok şeyi daha kolay hale getiriyor.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Captain Corporate",
      "created_time": "August 30, 2023, 04:37:32 PM",
      "body": "Yarı final geldi, çok tehlikeli rakip var karşımızda şimdi İtalya ile oynayacağız yarı final maçında. Doğrusunu söylemek gerekirse o bile başlı başına bence büyük bir olay, biz dünyanın en iyi takımıyız ve onlarda sanırım en iyi ikinci şuan, ve yarı finalde karşılaşıyoruz, resmen final gibi bir maç olacak, yürekler takımımızın yanında olacak. Bu şekilde devam ettiği sürece, bunu sürdürülebilir kıldığımız sürece, bence pek bi sıkıntı çıkmaz çünkü oldu ki bu maçta kaybettik, elendik, farketmez, zaten tepedeyiz, nesiller değişse bile tepede kaldığımız sürece başarılar gelmeye devam edecektir, biri olmazsa öbürü olur yine bir kupalar alır geliriz ve bütün ülke beraber kutlarız.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kriminall",
      "created_time": "August 30, 2023, 06:36:30 PM",
      "body": "Quote from: Captain Corporate on August 30, 2023, 04:37:32 PMYarı final geldi, çok tehlikeli rakip var karşımızda şimdi İtalya ile oynayacağız yarı final maçında. Doğrusunu söylemek gerekirse o bile başlı başına bence büyük bir olay, biz dünyanın en iyi takımıyız ve onlarda sanırım en iyi ikinci şuan, ve yarı finalde karşılaşıyoruz, resmen final gibi bir maç olacak, yürekler takımımızın yanında olacak. Bu şekilde devam ettiği sürece, bunu sürdürülebilir kıldığımız sürece, bence pek bi sıkıntı çıkmaz çünkü oldu ki bu maçta kaybettik, elendik, farketmez, zaten tepedeyiz, nesiller değişse bile tepede kaldığımız sürece başarılar gelmeye devam edecektir, biri olmazsa öbürü olur yine bir kupalar alır geliriz ve bütün ülke beraber kutlarız.Bu maç biraz ünvan mücadelesi gibi olacak, İtalya çok güçlü bir takım ve bizi çok zorlayabilir,yine de şu anda tarihin en iyi kadın voleybol milli takımını izliyoruz, art arda 13 maçtır kazanıyoruz ve bunu italyaya karşı da gösterebiliriz, eğer bunu yaparsak muhtemelen finalde Sırbistan ile karşılaşacağız ve ben onları da yeneceğimize inanıyorum,",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cacabey_40",
      "created_time": "September 01, 2023, 06:15:36 PM",
      "body": "Finaldeyiz arkadaşlar. Kızlar harika oynuyor. Gururlanmamak elde değil. Bu kadroyla, bu oyunla finali de alırız diye düşünüyorum. Aynı performansı umarım futbolda da görürüz.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "püsür",
      "created_time": "September 01, 2023, 07:54:44 PM",
      "body": "Maçın hepsini izleyemedim, sadece bir kısmını izleyebildim ama İtalyanlar da oldukça iyiydi. Zaten verdiğimiz setlerde onlar çok öne geçtiler. Bizim Vargas gibi onlarda da çok iyi hücum oyuncuları vardı bir kaç tane. Ama bu maçı kazanmamız süper bir başarı oldu. Kızların okula gitmesi bile günden güne zorlaşırken kadın milli takımının böyle büyük başarılar kazanıp küçük kızlara örnek olması harika bir şey. Trt de yayınlıyor ve destekliyor, hoşuma gitmiyor değil. Ebrar'a saldırılar da azaldı gibi geliyor, umarım gerçekten öyledir. Ülkede tek iyi giden şey kadın voleybol takımımız olabilir. Umarım çok daha büyük başarılar kazanırız ve hatta çok uzun yıllar voleybolda ekol oluruz.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}