{
  "id": "topic_5432211",
  "title": "Gregy Fur",
  "author": "Gregy Fur",
  "created_time": "December 28, 2022, 08:15:59 PM",
  "content": "Amulet ProtokolAmulet Protocol (hereinafter Amulet) is a decentralized insurance protocol created for the Rust-based ecosystem, starting with the Solana blockchain.Amulet has developed an innovative and open insurance model that not only effectively solves the common problems of existing decentralized insurance protocols, but also creates a new paradigm shift for the entire insurance sector.Risk underwriting and insurance claims are at the heart of any insurance business; however, all existing decentralized insurance protocols face the critical problem of resiliency in risk underwriting and insurance claims. Amulet is creating the industry's first Protocol-Controlled Underwriting (PCU) approach, in which Amulet will build its own underwriting capabilities and implement a claims structure that incorporates the unique Yield Backed Claim (YBC) method. This is a significant departure from current insurance models in which underwriting capabilities are leased from capital providers, in favor of a more sustainable protocol-controlled underwriting and claims structure. Amulet's vision is to is to offer simple, reliable insurance for all in Web3. With the addition of Amulet users throughout the Rust-based ecosystem will have access to a new way to hedge various risks through insurance product offerings.Unlike some existing insurance protocols that use a combination of general underwriting pools and individual pools for insurance products, Amulet will use an individual pool for each product, and users can choose one or more pools for underwriting by investing their $aUWT in specific product pools.https://amulet.org",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5432211",
  "comments": [
    {
      "author": "zasad@",
      "created_time": "December 28, 2022, 08:26:25 PM",
      "body": "Solana is having a very hard time right now, many projects are moving to other blockchains.https://defillama.com/chain/SolanaMarinade Finance Dominance -28.60%So far, these are very poor indicators for the ecosystem, so I prefer to look at projects in other ecosystems.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TastyChillySauce00",
      "created_time": "December 30, 2022, 12:56:16 AM",
      "body": "You shall avoid any projects that came to the solana. Solana might be dead too. Amulet protocol was just another garbage project that promoted so many times by shillers here. Insurance protocol was just another BS. If you were smart enough and then you might have thought that if solana was a garbage blockchain that needs to be avoided by since you were coming here with only promoting amulet protocol and i can guess if you were a part of amulet protocol shillers. what you have been writing above was actually BS and that's the way for you promoting your stuped insurance protocol which is not not even fully automated. The claim was actually different with the reality.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dave1",
      "created_time": "December 30, 2022, 09:28:43 AM",
      "body": "They are probably late on using Solana as their based blockchain because it seems that Solana has a lot of projects even rproject to the Alameda issues that drag their names.So as a piece of advise, I wouldn't be feeling comfortable with the Amulet Protokol or whatever they call this project. Might be better to look for other options right now or just wait because it seems that some of projects are dying in this bear market, just saying.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Smack That Ace",
      "created_time": "December 30, 2022, 09:44:08 AM",
      "body": "It would be best to find out first whether Solana can survive this bear season, then think about investing in the projects built on it. Solana is a name that has been mentioned a lot lately, they are a separate project from FTX, but maybe they are too dependent on SBF. Sol's value is falling, and I suspect that if bear season lasts another year, it will also disappear with FTX. We are still in bear season, and bear season may not be over yet, so my advice is not only for the Amulet Protokol project, but you should avoid all new projects at this time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kelvinid",
      "created_time": "December 30, 2022, 02:40:55 PM",
      "body": "I don't have any idea what really this project is for but for me, it is another worthless project trying to capture the interest of the community. Fortunately, it was not like what I see. We somehow know about Solana and the reputation it builds but a lot of questions arise asking about the credibility of the said project as it was connected to Alameda. People are now thinking about the risk of investing in this new project. Likely, it never has the chance to grow but it dumps like other shitcoins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jackl87",
      "created_time": "December 30, 2022, 02:57:06 PM",
      "body": "Quote from: Gregy Fur on December 28, 2022, 08:15:59 PMAmulet ProtokolAmulet Protocol (hereinafter Amulet) is a decentralized insurance protocol created for the Rust-based ecosystem, starting with the Solana blockchain.Amulet has developed an innovative and open insurance model that not only effectively solves the common problems of existing decentralized insurance protocols, but also creates a new paradigm shift for the entire insurance sector.Well i guess that you are part of the team of Amulet protocol and are advertising here for your projects, which is absolutely ok for me by the way because you do it in a non-annoying way. That being said, i think you have a pretty bad timing to launch your project on Solana now. As others in this thread have already mentioned, Solana is having a very rough time at the moment because FTX (and therefore Alameda) went bankrupt a few weeks ago obviously and they were the main investors into Solana. That is why a lot of people lost a lot of confidence into the whole Solana ecosystem. Maybe you could switch to a different network.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}