{
  "id": "topic_5463025",
  "title": "cafter",
  "author": "cafter",
  "created_time": "August 12, 2023, 09:48:49 AM",
  "content": "how many of you are educated less like school or college without degree. and do you make more money than a degree holder in any field?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5463025",
  "comments": [
    {
      "author": "rodskee",
      "created_time": "December 05, 2023, 11:34:54 AM",
      "body": "Quote from: cafter on August 12, 2023, 09:48:49 AMhow many of you are educated less like school or college without degree. and do you make more money than a degree holder in any field? Im a college level but not having my degree  yet I am earning more than my College graduate brother , because first I am crypto investor and yes I have my small businesses that generating Money aside from my actual work.while My brother is a  company Employee but not enough to make more than mine that even sometimes he is the one who is asking loan from me because of short in living .",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "boyptc",
      "created_time": "December 05, 2023, 10:51:00 PM",
      "body": "I am not going to compare myself with anyone as I don't find a good thing to do. But I know people that didn't graduate college but they're doing well in life.I think that's the best thing to see from those people that have been unfortunate not to finish their college studies but to see them do well in life today, is a greater achievement. They don't even need to prove it to anybody.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Natsuu",
      "created_time": "December 07, 2023, 03:55:03 PM",
      "body": "This is the kind of question that i dont want to be referenced with haha that’s why as a college graduate i make sure that i earn enough and that i dont borrow money or have loans. but on how i see it in our country, degree holders are usually exploited especially our educators. Thats why it is not enough to have only one job in our country. Those professionals who are not earning justly are really passionate of their job and they are making more professionals.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "btc78",
      "created_time": "December 07, 2023, 11:11:23 PM",
      "body": "Quote from: Natsuu on December 07, 2023, 03:55:03 PMThis is the kind of question that i dont want to be referenced with haha that’s why as a college graduate i make sure that i earn enough and that i dont borrow money or have loans. but on how i see it in our country, degree holders are usually exploited especially our educators. Thats why it is not enough to have only one job in our country. Those professionals who are not earning justly are really passionate of their job and they are making more professionals. lots of people make it seem that having a degree is useless in today’s world and while i do believe that having a degree should not be the standard of success, it is still wrong to say that we have no use for professionals if no one studies to be a doctor, a lawyer, or an engineer how would our society look like? it is not going to college that is flawed but rather the system that did us no good we must increase salary of those professionals and make education a lot more accessible",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "peter0425",
      "created_time": "December 08, 2023, 02:09:48 AM",
      "body": "What I only knew is that I am earning enough to feed my family and have savings in crypto and some in banks so this is better enough that those educated but still struggling in life.what is my main objective here? that is lets do whatever it takes to reach our goals in life and to make our love one and all the people around us happy and contented by our presence .",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jrrsparkles",
      "created_time": "December 08, 2023, 08:27:18 AM",
      "body": "The dilemma that rich people are school and college dropout is a wrong perception, yes you may see a lot of people who is financially successful even if they don't have a degree but what about the success ratio, it will be 0.1% however if you get a degree you have more chances to compete and better job pay. College degrees are useless but it is mandatory if you want a backup if your idea doesn't work.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cute nmp",
      "created_time": "December 08, 2023, 03:40:16 PM",
      "body": "I don't really think success in life is dependent on ones Education in this Modern world .Can strongly agree with skills and talents cause when one is highly talented and skilled he can easily fit into any sector of the society and make it big ,But without skills and talent i don't think education alone is enough to make one succeed in this life.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kotajikikox",
      "created_time": "December 09, 2023, 04:38:00 AM",
      "body": "Quote from: cute nmp on December 08, 2023, 03:40:16 PMI don't really think success in life is dependent on ones Education in this Modern world .Can strongly agree with skills and talents cause when one is highly talented and skilled he can easily fit into any sector of the society and make it big ,But without skills and talent i don't think education alone is enough to make one succeed in this life. nowadays , college diploma is just a formality because becoming a Millionaire (in our local currency of course) can be done even without proper education  and this is the reality now as we are meeting people here and there that very successful in their businesses but when you asked them? they are not even a college level why? because internet made them rich.so indeed that we only need to have knowledge in business that also available in internet to understand.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}