{
  "id": "topic_5447851",
  "title": "Franklin Black",
  "author": "Franklin Black",
  "created_time": "April 06, 2023, 07:15:54 PM",
  "content": "Hey everyone, Im new member here and decided to make this topic as I didnt find an existing one. And in case this was posted in a wrong forum, please move it to the good place.I am quite new to crypto, and for now Im trying to qualify for the ZkSync Airdrop and for that I am following this guide: https://www.virtualbacon.com/how-to-get-zksync-airdrop/I transfered some eth to the zksync wallet, mint a NFT and made some transactions in the ZigZag. But the next steps I cannot work on: in the portal.zksync.io there is no Faucet option. Its not there anymore or am I doing something wrong?And what is the difference of using ZkSync Lite and ZkSync Era?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5447851",
  "comments": [
    {
      "author": "OmegaStarScream",
      "created_time": "April 06, 2023, 07:37:21 PM",
      "body": "The team behind the project doesn't seem like it has any plans to do an airdrop[1] and from my understanding, the blog article you're reading is supposed to prepare you for a \"potential airdrop\" but that's not going to help either now that the zkSync's mainnet has launched (24th of March).[1] https://www.coindesk.com/tech/2023/03/24/matter-labs-has-no-plans-for-zksync-era-airdrop-but-crypto-twitter-is-speculating/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Franklin Black",
      "created_time": "April 06, 2023, 08:42:42 PM",
      "body": "So as the mainnet is already on, it is \"too late\" for qualifying to the \"possible\" airdrop?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MusaMohamed",
      "created_time": "April 07, 2023, 03:10:11 AM",
      "body": "Quote from: Franklin Black on April 06, 2023, 07:15:54 PMI transfered some eth to the zksync wallet, mint a NFT and made some transactions in the ZigZag. But the next steps I cannot work on: in the portal.zksync.io there is no Faucet option. Its not there anymore or am I doing something wrong?They don't announce any airdrop plan.What you are doing is proactively airdrop on-chain transactions which you believe that will be counted for their airdrop in future when Zksync team make snapshots on the blockchain and finalize list of eligible users for airdrop.Bounty hunters look at great and generous airdrops of Uniswap, Optimism, Arbitrum and huge fund raised by Zksync and believe that Zksync team will do big airdrop for real users too. What you're doing is trying to be real users on their platform and chain.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OmegaStarScream",
      "created_time": "April 07, 2023, 09:04:29 AM",
      "body": "Quote from: Franklin Black on April 06, 2023, 08:42:42 PMSo as the mainnet is already on, it is \"too late\" for qualifying to the \"possible\" airdrop?No, not necessarily. Although it's impossible to know the requirements one has to meet if they ever do an airdrop, the logical thing to do here would be to use the zkSync bridge as well as some other services (I can't tell you which ones since I'm not that familiar with their ecosystem) and also make sure to use your non-custodial wallet for that instead of an exchange's address.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "noorman0",
      "created_time": "April 07, 2023, 01:48:31 PM",
      "body": "Quote from: Franklin Black on April 06, 2023, 07:15:54 PM-snip-And what is the difference of using ZkSync Lite and ZkSync Era?I thought it was just a lite version by trimming some of the submenus to make access more responsive and only focusing on managing the wallet. The \"Era\" page is the full version which contains all ecosystem information like products, documents, etc.Quote from: Franklin Black on April 06, 2023, 08:42:42 PMSo as the mainnet is already on, it is \"too late\" for qualifying to the \"possible\" airdrop?The point of @OSS above is that the tutorial in that article will only work on the zksync 2.0 testnet, while the mainnet 2.0 version has been released. That's why you no longer find the \"faucet\" option.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "alexvause7",
      "created_time": "April 11, 2023, 05:34:55 PM",
      "body": "Quote from: Franklin Black on April 06, 2023, 07:15:54 PMHey everyone, Im new member here and decided to make this topic as I didnt find an existing one. And in case this was posted in a wrong forum, please move it to the good place.I am quite new to crypto, and for now Im trying to qualify for the ZkSync Airdrop and for that I am following this guide: https://www.virtualbacon.com/how-to-get-zksync-airdrop/I transfered some eth to the zksync wallet, mint a NFT and made some transactions in the ZigZag. But the next steps I cannot work on: in the portal.zksync.io there is no Faucet option. Its not there anymore or am I doing something wrong?And what is the difference of using ZkSync Lite and ZkSync Era?They didn't say they will do airdrop but trust me they will.Almost all faucets are dry. Try other ones.Lite is old one. Era is the new one. Make some transactions in both. That will increase your chance to get the airdrop.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "April 13, 2023, 05:15:26 AM",
      "body": "Quote from: OmegaStarScream on April 06, 2023, 07:37:21 PMThe team behind the project doesn't seem like it has any plans to do an airdropThese projects always said that there are no plans of airdrop same like what arbitrum has said before, no plan for airdrop then boom.Quote from: Franklin Black on April 06, 2023, 08:42:42 PMSo as the mainnet is already on, it is \"too late\" for qualifying to the \"possible\" airdrop?Werent sure about this. No one confirm the possible criteria and having mainnet with more ecosystem dapps. I think ita good to have some transaction there or interactions. With the release of arbitrum these people tend to knock out some potential activity though arent sure but its a ballsy move since you need to spend gas fee. Anyway, these are all speculations anyway.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitstar_coin",
      "created_time": "April 21, 2023, 06:58:41 PM",
      "body": "Quote from: Franklin Black on April 06, 2023, 07:15:54 PMHey everyone, Im new member here and decided to make this topic as I didnt find an existing one. And in case this was posted in a wrong forum, please move it to the good place.I am quite new to crypto, and for now Im trying to qualify for the ZkSync Airdrop and for that I am following this guide: https://www.virtualbacon.com/how-to-get-zksync-airdrop/I transfered some eth to the zksync wallet, mint a NFT and made some transactions in the ZigZag. But the next steps I cannot work on: in the portal.zksync.io there is no Faucet option. Its not there anymore or am I doing something wrong?And what is the difference of using ZkSync Lite and ZkSync Era?Why ask about zksync airdrop here in the forum when the right place to ask any question relating to zksync and possible airdrop is in their discord? A newbie doesn't get involved in what they have no idea about. Visit their discord and lay your compaint the admins will attend to you, Bridging from L1 to L2 usually takes sometime, you can find the full information about cross-chain bridge when you join their discord.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "alexvause7",
      "created_time": "April 23, 2023, 12:29:55 PM",
      "body": "Quote from: Bitstar_coin on April 21, 2023, 06:58:41 PMWhy ask about zksync airdrop here in the forum when the right place to ask any question relating to zksync and possible airdrop is in their discord? A newbie doesn't get involved in what they have no idea about. Visit their discord and lay your compaint the admins will attend to you, Bridging from L1 to L2 usually takes sometime, you can find the full information about cross-chain bridge when you join their discord. What's wrong about asking here? This is altcoin discussion place, so what's your problem him asking a question here? Are you afraid of more people will join ZKSync airdrop?Besides that, Discord is never a good place to ask genuine questions and expect answers. Mainly they consist of spam posts and you rarely see a person that answer questions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "libert19",
      "created_time": "April 23, 2023, 12:46:49 PM",
      "body": "Quote from: Franklin Black on April 06, 2023, 08:42:42 PMSo as the mainnet is already on, it is \"too late\" for qualifying to the \"possible\" airdrop?No it's not. I read in their discord a while back that there will be zksync token, if there is going to be token there is is chance for airdrop as well. However, the article you have mentioned, methods included to qualify for airdrop are too saturated that I'm pretty sure zksync team will filter these ones out.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Psynthax",
      "created_time": "April 23, 2023, 11:26:55 PM",
      "body": "Please, this airdrop is still speculation but people are only trying to do various task on the main network. Just focusing yourself to regularly swap and trade in the era main net. I know that the developer has been confirmed it's still a speculation but i see that developer stated if there will be token in the future for zksycn as it's needed to run ZK rollup that needs to be decentralized. Token is the answer for that. Just focusing yourself to interacted with smartcontract in era.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yhiaali3",
      "created_time": "April 30, 2023, 05:37:03 PM",
      "body": "There is zksycn scam token, you can buy it but you can't sell it so you have to be very careful not to lose your money.There is no zksycn airdrop yet, but trolls try to trick victims into spreading ads on social media.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}