{
  "id": "topic_5407162",
  "title": "Gencecikmen",
  "author": "Gencecikmen",
  "created_time": "July 21, 2022, 02:40:46 PM",
  "content": "Rusya-Ukrayna savaşı sonrası yaşanan enflasyon sonucunda Avrupa Merkez Bankası herhangi bir faiz artırımı yapmamış, FED ise kendisinden önce davranarak faiz artırımı yapmış sonrasında ise Dolar/Euro paritesi eşitlenmişti. Avrupa'da büyük tartışmalar olmuştu. Bugünkü toplantı sonucunda Avrupa Merkez Bankası yükselen enflasyonla mücadele etmek için 2011'den bu yana ilk kez faiz artışı kararı aldı. 50 baz puan artırımı yaptı. Ek bilgi: Beklenti 25 baz puan yönündeydi. Beklentinin üstünde yapıldı faiz artırımı.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5407162",
  "comments": [
    {
      "author": "Red Pie",
      "created_time": "July 21, 2022, 03:20:32 PM",
      "body": "Bakalım fedin açıklaması ne olacak hocam. fedden de son faiz arttırımı için beklenti yükseltmesi yönünde. ne kadarlık bir faiz yükseltmesi yapacak asıl merak edilen konu bu. avrupa merkez bankası bile faiz arttırımı yönünde hareket ettiğine göre artık dünya çapında bir faiz artışından rahatça bahsedebiliriz.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "judas",
      "created_time": "July 21, 2022, 08:59:44 PM",
      "body": "Euro / dolar paritesi şu an 1,02lerde geziyor bu arada. Acaba fark yine açılıp 1,10 üzeri değerlere gelir mi bu karardan sonra merak ediyorum. Açıkçası euro ile doların eşitlenmesi bizim açımızdan hiç de olumlu bir gelişme olmadı. Örneğin dolar ile alıp euro ile satılan bir ürünü düşündüğümüzde bu eşitlenme büyük zarara yol açmış oluyor. Şu an faiz artırmayan bir biz kaldık ama bugün yine faiz yüzde 14'te sabit tutuldu. Dolar şu an 17,72'ye kadar çıkmış durumda.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ZekiBeyy",
      "created_time": "July 22, 2022, 09:41:32 AM",
      "body": "Yaşanan ekonomik sıkıntılar neticesinde Avrupa Merkez Bankası bile faiz arttırımına gidiyorken Türkiye Cumhuriyet Merkez bankası 7 aydır faizleri sabit tutma kararı almaya devam ediyor ekonomik istikrarsızlığa sürüklenmeye devam ediyoruz. Dünya ekonomileri faiz artırıyor küresel anlamda ekonomik sıkıntılar yaşanmaya devam edecek gibi duruyor. Korona ve devamında gelişen Rusya Ukrayna savaşı dünya genelinde ekonomileri olumsuz etkilemeye devam ediyor.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "W Jr.",
      "created_time": "July 22, 2022, 01:23:03 PM",
      "body": "Koronavirüsün etkileri ekonomiyi zayıflatırken, daha pandeminin etkilerini atlamayan dünya bir savaş ile çalkalandı.Bu iki ülke de de önemli tarımsal ve akaryakıt üretimleri vardı.Rus petrolü Avrupa’da satışta olan petroldü.Gaz halen Avrupa’ya satılıyor diye biliyorum.Yapılan yaptırımlar yüzünden Rusya ile olan alışveriş durma aşamasına geldi.Alternatifler de pahalı olduğu için Avrupa’da ekonomik yönden zayıflamaya başlamıştı.Bu artış kaçınılmazdı ve oldu.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kriminall",
      "created_time": "July 22, 2022, 01:27:19 PM",
      "body": "Dünyanın her yerinde faizler arttırılırken buna Avrupa’da katılmış demek ki, bugün gördüğüm ise Rus merkez bankasının politika faizini 8’e indirdiği haberi oldu, tüm dünya faiz arttırırken biz sabit tutuyoruz Ruslar düşürüyor, ilginç bir politika izliyoruz, hadi Rusya’da savaş var düşürüyorlar, biz neyimize sabit tutmakta ısrar ediyoruz anlayamadım,",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pierre 2",
      "created_time": "July 22, 2022, 01:47:56 PM",
      "body": "Muhtemelen Amerikan Merkez Bankası da buna cevap niteliğinde faiz arttırımına devam edecek. Ekonomiler açısında görülmüş en kötü yıllardan biri oldu 2022 cidden. 2023 yılı bir an önce gelse de biraz rahatlasak diyorum.Quote from: kriminall on July 22, 2022, 01:27:19 PMDünyanın her yerinde faizler arttırılırken buna Avrupa’da katılmış demek ki, bugün gördüğüm ise Rus merkez bankasının politika faizini 8’e indirdiği haberi oldu, tüm dünya faiz arttırırken biz sabit tutuyoruz Ruslar düşürüyor, ilginç bir politika izliyoruz, hadi Rusya’da savaş var düşürüyorlar, biz neyimize sabit tutmakta ısrar ediyoruz anlayamadım, Rusların faiz indirme lüksü var hocam sermaye kontrolleri yüzünden Ruble aşırı değerlendi o köpüğü alıyorlar desem yeridir. Hoş alınsa ne olacak halkın kolaylıkla Dolar a erişimi var mı sanki? Olduğunu hiç zannetmiyorum. Ruslar daha çok zarar çekerler.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mandown",
      "created_time": "July 22, 2022, 02:39:07 PM",
      "body": "Herkes gider Mersine biz gideriz tersine",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LGD2Business",
      "created_time": "July 22, 2022, 07:13:12 PM",
      "body": "Olması gereken oldu mantıklı olan buydu ABD ve Avrupa faiz artırarak doğru olanı yapıyorlar. Ortada ciddi bir enflasyon var. Tabi onlara göre ciddi bize göre rakamlara bakarsak çerez bunlar. Buna rağmen bizde faizi sabit tutuyorlar artık söyleyecek bir şey yok. Onlarla kendimizi karşılaştırmayı bırakalım.Euro 18'i hızlı geçti Dolar da yeniden 18'e yaklaştı. Bu gidişle kur daha çok yükselir.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DukeNickle",
      "created_time": "July 22, 2022, 10:59:48 PM",
      "body": "Dünyadaki mevcut şartlar dahilinde zaten yapılması gereken şey de bu. FED ne zamandır boşuna faiz artırmadı ve Avrupa Merkez Bankası da sonunda bu kervana katılmış oldu. Bir biz kaldık herhalde inat etme konusunda.    Yani tabi ki şöyle bir şey de var faiz artırımının olumsuz yönleri de illa var ama bizim durumumuzdaki bir ülkede eğer şartlar iyiye değil de tam tersi yönde gidiyorsa başka çare kalmıyor. Bakalım biz ne zaman bu inadı kıracağız.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "eightdots",
      "created_time": "July 23, 2022, 09:39:18 AM",
      "body": "Yapılması gereken şeyi zamanında yapıyorlar ya da çok geç olmadan yapıyorlar. Sistemleri belli. Biz napıyoruz ben onu anlamıyorum. Neyin inadı bu? Tüm dünya bunu görmüşken hala kime inat neye inat gidiyorlar da faizi sabit tutuyorlar. Sorulacak çok soru var da mantıklı yapılan iş yok. Daha çok alır başını gider dolar-euro. Biz de kur korumalıyla halktan alıp para babalarının faizini öderiz.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "karabiber",
      "created_time": "July 24, 2022, 11:04:34 AM",
      "body": "ECB’nin de faiz artırımı ile birlikte tüm dünyada resesyon görülme olasılığı kuvvetlendi. En büyük ihracat pazarımız Avrupa’nın tüketimi kısmak ve enflasyonu düşürmek amacıyla aldığı faiz kararı bizi de etkileyecektir. Dünya’nın tersine bizde faiz sabit bırakılıyor ve bile isteye ülke son sürat uçuruma giden kamyon gibi. Bir an önce Merkez Bankası’nın faiz artırım kararı vermesini bekliyorum ama umutlu değilim. Pandemiden sonra resesyona giren bir Dünya bizi bekliyor.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Phoenix Anka",
      "created_time": "July 24, 2022, 12:00:08 PM",
      "body": "Faiz indirimi veya sabit tutuluşunun bir anlamı olmadığını anlamak için daha neler bekliyoruz ki? Dünyada en ekonomisi güçlü ülkeler, birlikler bile faiz arttırımına giderken bizlerin hala faiz konusunda diretmesini anlayamıyorum. Avrupa merkez bankası bile faiz arttırdığına göre global bir çöküntü sinyalleri var.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MK-74",
      "created_time": "July 25, 2022, 02:47:10 PM",
      "body": "Olması gereken oldu, Euro / Dolar paritesi 1=1 olmuştu neredeyse ve Dolar, Euro karşısında çok güçlenmişti onun önünü biraz kestiler.Uluslararası Ticaret yapanlar içinde sıkıntılı bir durum oluşturmaya başlamıştı.Çalıştığım firmadan örnek vereyim, avrupa ülkelerine euro, diğer ülkelere dolar olarak çalışıyoruz.Hammaddeyi dolar ile aldığımızdan dolayı, Euro fiyatlarını son 1-2 aydır devamlı güncellemek zorunda kaldı pariteden dolayı, bunun önüne geçemediğimizden dolayı da artık avrupa müşterilerimize dolar ile çalışmayı teklif ediyoruz, kabul edenlerle yola devam etmeyenlerle euro üzerinden fiyat güncelleyip devam ediyoruz, geneli kabul ediyor.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gencecikmen",
      "created_time": "July 25, 2022, 08:10:07 PM",
      "body": "Dolar/Euro değerinin ilk önce 1-1 olması ardından Avrupa Merkez Bankasının faiz artırımı ile 1,02 olması sonucu gözler FED'in kararında. FED donrası dolar euroyu geçebileceği konuşuluyor. Avrupa Merkez Bankasının faiz artırımına rağmen Euro dolara göre çok artmadı değeri. Eğer bu Rusya/Ukrayna savaşı devam ederse Euro daha çok zarar görecek gibi.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MK-74",
      "created_time": "July 25, 2022, 09:23:36 PM",
      "body": "Quote from: Gencecikmen on July 25, 2022, 08:10:07 PMDolar/Euro değerinin ilk önce 1-1 olması ardından Avrupa Merkez Bankasının faiz artırımı ile 1,02 olması sonucu gözler FED'in kararında. FED donrası dolar euroyu geçebileceği konuşuluyor. Avrupa Merkez Bankasının faiz artırımına rağmen Euro dolara göre çok artmadı değeri. Eğer bu Rusya/Ukrayna savaşı devam ederse Euro daha çok zarar görecek gibi. Euronun artmamasının sebebi tabiki Rusyaya uyguladığı yaptırımlar ve Rusyanın gaz ile karşılık vererek avrupa bölgesini sıkıntıya sokması, burda Avrupa bölgesi yine güç kaybetti kazanan taraf Amerika oldu.Ekonomik sıkıntıyı ilerleyen zamanlarda avrupa çekecek. Rusya tekrar gaz akışını düşürdü bakım ayağına.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}