{
  "id": "topic_5484316",
  "title": "legiteum",
  "author": "legiteum",
  "created_time": "February 06, 2024, 03:59:40 PM",
  "content": "I think a lot of people misunderstand what \"legal tender\" means.Legal tender means that the government forces everybody to accept Bitcoin whether they want to or not.Typically a country only has one currency like that, which is their sovereign national currency.In other words, when you are asking for legal tender status, you are asking for a free, open and decentralized thing like Bitcoin should become controlled by the government because they force everybody to own it. Not only is this immoral, it will absolutely backfire because anything you force everybody to own will always end up being controlled by the government.Understand that \"legal tender\" does not mean \"legal\". Bitcoin is already perfectly legal in most countries: you can own it and you can trade it if you want to. Even in China, where people consider Bitcoin \"banned\", individuals there can own it and the laws only apply to financial entities there (which are already highly regulated in all kinds of ways and there is probably a long, long list of things they cannot own).So please stop asking for government help in proliferating Bitcoin by forcing people to accept something they don't want to accept.And concede that Bitcoin is already legal for the most part, and governments at this point are not meaningfully \"holding it back\".",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5484316",
  "comments": [
    {
      "author": "SamReomo",
      "created_time": "February 06, 2024, 04:18:24 PM",
      "body": "Quote from: legiteum on February 06, 2024, 03:59:40 PMLegal tender means that the government forces everybody to accept Bitcoin whether they want to or not.Totally wrong, a legal tender is a type of payment that a country considers as legal and its law allow it to be used to settle debts which simply means a type of asset that can be used for financial things. A country never force you to use a legal tender but if you live in a country then you need to use it for trading of goods. Let's say each country's fiat is a legal tender but they won't force you to use it, however if you want to purchase something from a shop or from someone then you will need it for the purpose. If Bitcoin becomes a legal tender then the governments won't force others to accept it but they will allow anyone to trade goods with it without any legal concerns. Ultimately, you'll be allowed to settle debt with either fiat or Bitcoin if a country makes it a legal tender.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Frankolala",
      "created_time": "February 06, 2024, 04:31:50 PM",
      "body": "For any currency to be a legal tender, it means that the government have made it part of the currency of that country by law, that should be accepted for payment of goods and services and also for paying debt. So, any country that makes bitcoin a legal tender does not really mean that the government will force its citizens to use it, but it will be an alternative means of payment to fiat. and it will be accepted by all.Making bitcoin a legal tender by the government of a country does not give the government any power to control bitcoin. Let's take a look at El Salvador, it is not all of them that is using bitcoin, and Bukele didn't force anyone to use bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dr.Bitcoin_Strange",
      "created_time": "February 06, 2024, 04:47:08 PM",
      "body": "Every country has its own native fiat currency, which is legally accepted by every individual, business, organization, and company in that country. The government of every country or your country doesn't force you to use your local currency, but you have to use it because it is what can be accepted in exchange for goods and services in your country. Unless you have someone who agrees to accept payment through other means, then you can pay, and you will not face any penalty as long as the person you are paying agrees to accept your offer. Categorically, what I am saying is that the government will not force you to use a particular currency, but if it is made legal and people accept it, you have no other alternative of payment unless the person you are dealing with agrees to accept a different means of payment from the one that is legal.In my country, Bitcoin is not banned, nor is it a legal tender, but yet some people accept Bitcoin payments, and they don't face any government penalties for not accepting Fiat.This recent time that the rate of inflation has hiked and the value of fiat currencies keeps depreciating, citizens in most countries, which are greatly affected by inflation, are looking for some asset to invest their money in that can appreciate in value and earn them a significant profit. So, it's not everyone who is suggesting that Bitcoin become a legal tender. Anybody can own Bitcoin as long as they understand the workframe of the coin and its technologies. It doesn't need to become legal tender before they can own it. People are looking for a safe heaven asset, an asset that they are sure can add value to their capital, and if everyone realizes that Bitcoin can be a solution for them, they will all be investing in Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "avikz",
      "created_time": "February 06, 2024, 04:50:32 PM",
      "body": "Quote from: legiteum on February 06, 2024, 03:59:40 PMI think a lot of people misunderstand what \"legal tender\" means.Legal tender means that the government forces everybody to accept Bitcoin whether they want to or not.Totally wrong! Legal tender means that government recognises a certain method of payment/currency as legal in their own jurisdiction. A country can have multiple legal tenders which means they can have their own fiat currency active while also recognising Bitcoin as a legal means of payment. There are multiple countries where Bitcoin is not yet a legal tender but there is only a handful of countries where Bitcoin is considered as legal tender. Now a government can choose whether to force a certain method or not.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaNNy001",
      "created_time": "February 06, 2024, 04:56:38 PM",
      "body": "Quote from: Frankolala on February 06, 2024, 04:31:50 PMFor any currency to be a legal tender, it means that the government have made it part of the currency of that country by law, that should be accepted for payment of goods and services and also for paying debt. So, any country that makes bitcoin a legal tender does not really mean that the government will force its citizens to use it, but it will be an alternative means of payment to fiat. and it will be accepted by all.Making bitcoin a legal tender by the government of a country does not give the government any power to control bitcoin. Let's take a look at El Salvador, it is not all of them that is using bitcoin, and Bukele didn't force anyone to use bitcoin.Yeah that's true I think because Bitcoin is a legal tender doesn't mean its forced upon by everyone to use it and I can also relate this with other countries that don't even use Bitcoin, because I am believe that some countries do have two currencies as their legal tender and this means the two currencies are to be accepted for exchange of goods and commodity just as you explain but this doesn't necessarily mean every one is forced to use and doesn't mean that government controls the two currencies used cause I believe one of them might be a different currency maybe like the dollar.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cabron",
      "created_time": "February 06, 2024, 05:13:22 PM",
      "body": "The people in El Salvador still can use USD for their businesses even when BTC is legal tender. It doesn't necessarily be enforced but BTC is an option for the people. I don't think you will be able to make BTC a sole currency in one place, we still need the stablecoin ffor its value to be recognized. I'm not sure if people are asking BTC to be a legal tender. The majority accepts the fact that BTC will have to exist side by side with the government-backed currency, no one can remove those national currencies as they are part of a country's sovereignty.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Su-asa",
      "created_time": "February 06, 2024, 05:13:40 PM",
      "body": "Quote from: legiteum on February 06, 2024, 03:59:40 PMI think a lot of people misunderstand what \"legal tender\" means.Legal tender means that the government forces everybody to accept Bitcoin whether they want to or not.This is very very wrong and I don't think you know what you are saying at all.please you better not forget what's human rights is about because if you forget that, people will have to use you like you are nobody and you will be slave forever.Everybody in their countryside have right to agree and to disagree, but corruption have make many of we to always put eyes in where money is coming and not something that will benefit us and others, don't be surprised to hear why some government don't want to make Bitcoin legal tender on there country.Maybe some have received money from others who have higher authority than them so they have to follow the decision so they will won't lose their job's, if your government legalese Bitcoin and you don't want to accept it, you won't be forced ti accept it because you have right not to accept same the ither way, when your government didnt make Bitcoin legal and you are using it quiet without informing anyone who will be ni harm for you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OgNasty",
      "created_time": "February 06, 2024, 05:25:18 PM",
      "body": "I don’t think any Americans will be forced to accept Bitcoin anytime soon. The Lightning network is unreliable and just plain terrible for use in a large country while the main layer couldn’t dream of supporting so many transactions. I won’t even go into the technical challenges for people who might not know how to use a computer… Legal status isn’t something that needs to worried about right now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "legiteum",
      "created_time": "February 06, 2024, 05:26:40 PM",
      "body": "Quote from: SamReomo on February 06, 2024, 04:18:24 PMQuote from: legiteum on February 06, 2024, 03:59:40 PMLegal tender means that the government forces everybody to accept Bitcoin whether they want to or not.Totally wrong, a legal tender is a type of payment that a country considers as legal and its law allow it to be used to settle debts which simply means a type of asset that can be used for financial things. A country never force you to use a legal tender but if you live in a country then you need to use it for trading of goods. Let's say each country's fiat is a legal tender but they won't force you to use it, however if you want to purchase something from a shop or from someone then you will need it for the purpose. If Bitcoin becomes a legal tender then the governments won't force others to accept it but they will allow anyone to trade goods with it without any legal concerns. Ultimately, you'll be allowed to settle debt with either fiat or Bitcoin if a country makes it a legal tender.By that definition, cigarettes are \"legal tender\" in the United States since you can legally settle a debt using cigarettes. Or gold coins. Or furniture. Or baseball cards. Or whatever the counterparty accepts as payment. So there's great news for you: by your definition, \"Bitcoin is Legal Tender in the United States!\".But that's not the legal definition....",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "legiteum",
      "created_time": "February 06, 2024, 05:32:16 PMLast edit: February 08, 2024, 09:48:41 PM by Mr. Big",
      "body": "Quote from: Su-asa on February 06, 2024, 05:13:40 PMQuote from: legiteum on February 06, 2024, 03:59:40 PMI think a lot of people misunderstand what \"legal tender\" means.Legal tender means that the government forces everybody to accept Bitcoin whether they want to or not.This is very very wrong and I don't think you know what you are saying at all.please you better not forget what's human rights is about because if you forget that, people will have to use you like you are nobody and you will be slave forever.Everybody in their countryside have right to agree and to disagree, but corruption have make many of we to always put eyes in where money is coming and not something that will benefit us and others, don't be surprised to hear why some government don't want to make Bitcoin legal tender on there country.Maybe some have received money from others who have higher authority than them so they have to follow the decision so they will won't lose their job's, if your government legalese Bitcoin and you don't want to accept it, you won't be forced ti accept it because you have right not to accept same the ither way, when your government didnt make Bitcoin legal and you are using it quiet without informing anyone who will be ni harm for you. Bitcoin is legal to hold and trade for individuals (including China) in almost every country in the world except for a tiny few.You are making up a problem here where there isn't one. You don't need to force people to accept Bitcoin. It does not need to be officially anointed as \"legal tender\" in order for it to be legal to trade and hold.Quote from: avikz on February 06, 2024, 04:50:32 PMQuote from: legiteum on February 06, 2024, 03:59:40 PMI think a lot of people misunderstand what \"legal tender\" means.Legal tender means that the government forces everybody to accept Bitcoin whether they want to or not.Totally wrong! Legal tender means that government recognises a certain method of payment/currency as legal in their own jurisdiction. A country can have multiple legal tenders which means they can have their own fiat currency active while also recognising Bitcoin as a legal means of payment. There are multiple countries where Bitcoin is not yet a legal tender but there is only a handful of countries where Bitcoin is considered as legal tender. Now a government can choose whether to force a certain method or not. The definition of legal tender is that \"all debts, public in private\" must be able to be settled with this form of payment.If I arrange, by some sort of trade, to get your car, and I pay you, and you don't give me what I asked for in return, when we go to court, the court can order you either give me the thing I wanted in trade, or the equivalent in US dollars.That's it. That's all \"legal tender\" means. It means that everybody in the country must accept this currency whether they want to or not. It's the government forcing the adoption of a means of trade. The definition people seem to think it means is, \"legal to trade\", but Bitcoin and all cryptos are perfectly legal to trade in almost every country in the world, including the USA.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zaguru12",
      "created_time": "February 06, 2024, 05:44:51 PM",
      "body": "Quote from: legiteum on February 06, 2024, 05:26:40 PMBy that definition, cigarettes are \"legal tender\" in the United States since you can legally settle a debt using cigarettes. Or gold coins. Or furniture. Or baseball cards. Or whatever the counterparty accepts as payment. So there's great news for you: by your definition, \"Bitcoin is Legal Tender in the United States!\".But that's not the legal definition....I think you’re the one actually misunderstanding this whole legal tender of a thing, been legal tender doesn’t mean it is enforced to be accept but rather you do that at your own comfortability. Yes bitcoin isn’t banned in most countries but there are restrictions on the use of it and where there is a restriction then that entity is usually risky to been used publicly because you never might tell maybe it would later get banned. The reason why you see people are clamoring for bitcoin as a legal tender is because once the government accepts as such it means they full support such currency and its citizens need not to be afraid of any policy change in the future. But right now without a proper stand on it and just restrictions you never can tell what they will decree about it in the future and that’s why it’s users can not openly use it even if it is not stopped Please learn to merger all your replies together",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "letteredhub",
      "created_time": "February 06, 2024, 06:27:14 PM",
      "body": "The subject of bitcoin as a legal tender or not is subjective of the nation in question in this discussion, for those people living in El Salvador bitcoin is used as a legal tender in their country as it has the government legal backing for use of buying and selling of product and services. And it's worthy to remind you or anyone that the acceptance of bitcoin in country like El Salvador wasn't a forceful act on the citizens by the government because what I know they still make use of their country's fiat currency for exchange of goods and services. For the fact that the government gives a legal backing to a thing as a legal tender it's appropriate to address it as that in that very country. Whatever thing we call money or give money value today is based on the value we as humans in a particular society consciously attached to it, and by the virtue of that unanimous attachment and acceptance as a government that what automatically makes it a legal tender.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Die_empty",
      "created_time": "February 06, 2024, 06:31:39 PM",
      "body": "Quote from: legiteum on February 06, 2024, 03:59:40 PMI think a lot of people misunderstand what \"legal tender\" means.Legal tender means that the government forces everybody to accept Bitcoin whether they want to or not.Typically a country only has one currency like that, which is their sovereign national currency.In other words, when you are asking for legal tender status, you are asking for a free, open and decentralized thing like Bitcoin should become controlled by the government because they force everybody to own it. Not only is this immoral, it will absolutely backfire because anything you force everybody to own will always end up being controlled by the government.You are right that when Bitcoin becomes a legal tender, everybody is mandated by the law to accept it as a means of payment or settlement of debt. But you are wrong that if Bitcoin becomes a legal tender it is now under the control of the government. People are mandated to accept or use Bitcoin for financial transactions but they are forced to use centralised platforms. Bitcoiners in countries that have legalised Bitcoin are allowed to use any platform they deem fit. They can decide to make payments using decentralised wallets and they will not be sanctioned. Making Bitcoin a legal tender doesn't make the government control Bitcoin except they begin to make policies that are targeted at regulating or controlling the space.      Quote from: Zaguru12 on February 06, 2024, 05:44:51 PMI think you’re the one actually misunderstanding this whole legal tender of a thing, been legal tender doesn’t mean it is enforced to be accept but rather you do that at your own comfortability. Yes bitcoin isn’t banned in most countries but there are restrictions on the use of it and where there is a restriction then that entity is usually risky to been used publicly because you never might tell maybe it would later get banned. Making Bitcoin a legal tender means that it is compulsory that you have to accept it as a means of payment. An example is that if I want to make payment for a house in El Salvador, the owner of the house is mandated by the law to accept either dollars or Bitcoin. If I insist that the currency I own is Bitcoin, the house owner will have no option but to accept Bitcoin because it is a legal tender.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "legiteum",
      "created_time": "February 06, 2024, 06:53:44 PM",
      "body": "Quote from: Zaguru12 on February 06, 2024, 05:44:51 PMQuote from: legiteum on February 06, 2024, 05:26:40 PMBy that definition, cigarettes are \"legal tender\" in the United States since you can legally settle a debt using cigarettes. Or gold coins. Or furniture. Or baseball cards. Or whatever the counterparty accepts as payment. So there's great news for you: by your definition, \"Bitcoin is Legal Tender in the United States!\".But that's not the legal definition....I think you’re the one actually misunderstanding this whole legal tender of a thing, been legal tender doesn’t mean it is enforced to be accept but rather you do that at your own comfortability. Yes bitcoin isn’t banned in most countries but there are restrictions on the use of it and where there is a restriction then that entity is usually risky to been used publicly because you never might tell maybe it would later get banned. The reason why you see people are clamoring for bitcoin as a legal tender is because once the government accepts as such it means they full support such currency and its citizens need not to be afraid of any policy change in the future. But right now without a proper stand on it and just restrictions you never can tell what they will decree about it in the future and that’s why it’s users can not openly use it even if it is not stopped Again, the word \"legal tender\" has a specific meaning derived from the US Constitution.And shares of Apple (AAPL) are not \"legal tender\" and clearly investors are not living in fear that the government might \"someday\" make Apple illegal because investors have bid its worth to trillions of dollars.In my opinion, the reason why people want \"legal tender\" status for Bitcoin is to use the power of the government to make their Bitcoin holdings more valuable. Just like anybody holding AAPL shares would like the US government to say something nice about it and enforce that into law.Quote from: Zaguru12 on February 06, 2024, 05:44:51 PMPlease learn to merger all your replies together Done.  Quote from: Die_empty on February 06, 2024, 06:31:39 PM[...]Making Bitcoin a legal tender doesn't make the government control Bitcoin except they begin to make policies that are targeted at regulating or controlling the space.      This was a point I was making about the \"practicality\" of the situation. Countries that force their citizens to carry health insurance, for instance, necessarily heavily regulate the health insurance business. That would be true of the US government forced everybody to accept Bitcoin as payment: Congress would regulate it much much more. Instead of being \"just another asset people can invest in\", it's now something the government officially supports and voters are not going to accept giving that status away for free.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zaguru12",
      "created_time": "February 06, 2024, 07:23:55 PM",
      "body": "Quote from: legiteum on February 06, 2024, 06:53:44 PMThis was a point I was making about the \"practicality\" of the situation. Countries that force their citizens to carry health insurance, for instance, necessarily heavily regulate the health insurance business. That would be true of the US government forced everybody to accept Bitcoin as payment: Congress would regulate it much much more. Instead of being \"just another asset people can invest in\", it's now something the government officially supports and voters are not going to accept giving that status away for free.Exactly there is no denying the fact that government wouldn’t approve any currency as legal tender as long as they can’t control or regulate it and if you look at the nature of bitcoin it is definitely hard to control or manipulate it like the government will want and that’s why the government is actually trying not to make it a legal tender and instead warn people off it that it is not something they should go into. Looking at this, it tells you that the government is not actually stopping it from been a legal tender just because they don’t want to enforce it on people but because they don’t have control over it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EluguHcman",
      "created_time": "February 06, 2024, 07:45:20 PM",
      "body": "The illegality pronunciation on Bitcoin in some countries are either buttressed that the government ecosystems such as the banks and other government owned financial institutes should desist from any form of the bitcoins transactions which means you can't sell nor buy Bitcoin in any of the affirmed mentioned. While some countries tends to buttress the laws in a general overview that not even an individual is authorized to transact with the Bitcoin which means anyone caught on trading or transacting with the Bitcoin in any form must has violated the laws governing their system and the Bitcoin currency. So anyone that insists on involving with the Bitcoin is at its high risk indulgences.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coolcoinz",
      "created_time": "February 06, 2024, 07:53:29 PM",
      "body": "Quote from: legiteum on February 06, 2024, 03:59:40 PMLegal tender means that the government forces everybody to accept Bitcoin whether they want to or not.If a country makes a currency a legal tender it doesn't mean you're forced to use it. It's like with languages. Some countries have 2 legal languages and this means you can file your papers in one and they have to be legally accepted by public services and such. When 2 different currencies are legal tender, you can pay using one of them, or even both, paying half of the price in one and half in the other.I'd say that becoming a legal tender is great for any currency and this is one of the reasons why Euro is doing so poorly. The EU plan was to make all members accept common currency, but some did not do it years after joining the Union. I can bet you that if bitcoin becomes legal tender in a first world country the price will go crazy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "February 06, 2024, 07:55:36 PM",
      "body": "Quote from: legiteum on February 06, 2024, 03:59:40 PMI think a lot of people misunderstand what \"legal tender\" means.Legal tender means that the government forces everybody to accept Bitcoin whether they want to or not.Typically a country only has one currency like that, which is their sovereign national currency.In other words, when you are asking for legal tender status, you are asking for a free, open and decentralized thing like Bitcoin should become controlled by the government because they force everybody to own it. Not only is this immoral, it will absolutely backfire because anything you force everybody to own will always end up being controlled by the government.Understand that \"legal tender\" does not mean \"legal\". Bitcoin is already perfectly legal in most countries: you can own it and you can trade it if you want to. Even in China, where people consider Bitcoin \"banned\", individuals there can own it and the laws only apply to financial entities there (which are already highly regulated in all kinds of ways and there is probably a long, long list of things they cannot own).So please stop asking for government help in proliferating Bitcoin by forcing people to accept something they don't want to accept.And concede that Bitcoin is already legal for the most part, and governments at this point are not meaningfully \"holding it back\".legal tender is not about replacing countries FAIT. its about allowing businesses to sell goods/services and pay taxes and such in bitcoin..the negative side is as you later say, it then allows those countries governments to apply licencing/permitted use rules on the use of it and start requiring regulations on the services that use it. but legal tender is not about replacing fiatthe way governments achieve \"legal tender\" acceptance is usually a covert or overt ban. either just overnight or longterm. and then a permit/licencing acceptance of use under certain conditions acceptable to government (even the NYbitlicence done a covert ban, with overnight acceptance under conditions for NY citizens and businesses)in short your first three sentences are inaccurate but the rest of post is a correctly a concern we should think about.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cookdata",
      "created_time": "February 06, 2024, 08:09:48 PM",
      "body": "Quote from: legiteum on February 06, 2024, 03:59:40 PMIn other words, when you are asking for legal tender status, you are asking for a free, open and decentralized thing like Bitcoin should become controlled by the government because they force everybody to own it. Not only is this immoral, it will absolutely backfire because anything you force everybody to own will always end up being controlled by the government.Legal status is limited to a specific country and that means bitcoin is recognize as medium of exchange, nobody in that country that can challenge you for using Bitcoin to buy any thing and nobody has the right to reject it either. This is only good for Bitcoin adoption, it has nothing to with with centrality or decentralization of bitcoin. The only place I see it becoming centralized is when people hold it as reserve without been use for the purpose is where I see centralization.QuoteUnderstand that \"legal tender\" does not mean \"legal\". Bitcoin is already perfectly legal in most countries: you can own it and you can trade it if you want to. Even in China, where people consider Bitcoin \"banned\", individuals there can own it and the laws only apply to financial entities there (which are already highly regulated in all kinds of ways and there is probably a long, long list of things they cannot own).Bitcoin is not legal in all countries and just because a country has not said anything regarding it legality makes it legal in any form. They have the right to say it's illegal and they have the right to make it legal which means anybody can own Bitcoin but this doesn't in anyway makes it legal tender. Legal tender means ready to be accepted as a settlement of debt anywhere in the country but the legally recognized is not a legal tender. Countries like China has ban Bitcoin for years now, Bitcoin is legal in US but not a legal tender while in El Salvador Bitcoin is legal and it's also a Legal tender.QuoteSo please stop asking for government help in proliferating Bitcoin by forcing people to accept something they don't want to accept.And concede that Bitcoin is already legal for the most part, and governments at this point are not meaningfully \"holding it back\".There is nothing like forcing people, only you can't hold bitcoin forever do you, you have to make other people come and have a taste of it and because you can't fight the government, you need to be friends with them to get into their pocket and that's where legal way comes in, we need everyone to buy and use Bitcoin atleast to convince them to taste what they have been missing out.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}