{
  "id": "topic_5440590",
  "title": "Michael429803",
  "author": "Michael429803",
  "created_time": "February 20, 2023, 05:06:25 PMLast edit: February 20, 2023, 06:28:46 PM by Michael429803",
  "content": "This is my new account, I've locked the other discussion. I cannot provide solid proof I'm a 16-year-old or that I even own the bitcoin in the first place. I'll repeat what I said in the other discussion. 2/3 of my bitcoin is held in the stockpile.com app and the other third is with my dad. I'll talk to him about moving it all into one wallet but as of right now, it's not in one place. A lot of people are asking for proof and I will not and will never provide proof. The only proof I have is me saying I am 16. I will not provide proof sorry if I am sussy but that's tuff you can go somewhere else if I seem fake",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5440590",
  "comments": [
    {
      "author": "PrivacyG",
      "created_time": "February 20, 2023, 05:10:24 PM",
      "body": "No body cares if you are 16, 8, 20 or 80.  You need to prove us nothing.A video of yourself to prove what exactly?  You are only subjecting yourself to harassment and threats from people who see you as vulnerable.  You are very vulnerable at 16 to a lot of things.  Internet people are not as friendly as they seem.  Please.  Your Privacy is very important and it is not a good idea to post a video showing your face saying 'hey I own some Bitcoin' at all.What if your $450 all of a sudden turn into millions.  People will link your face to a high net worth and may resort to attacks.  So many things can go wrong bud.This forum does not require age verification or any other sort of personal document.  Good for you if you invested $450 in Bitcoin.  But keep sensitive information to yourself, for your own sake.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "February 20, 2023, 05:10:58 PM",
      "body": "Quote from: Michael429803 on February 20, 2023, 05:06:25 PMIs there any safe way to prove that I'm 16?   Why do you really need to prove that you're actually 16? You could be 8 and I wouldn't really care.Quote from: Michael429803 on February 20, 2023, 05:06:25 PMAlso is there a reason why it's not safe to post vids of myself?For privacy reasons. If anything, posting a vid of yourself is arguably worse than using your real name as your username lmao. In the first place you shouldn't have admitted that this is your new account.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "February 20, 2023, 05:19:58 PM",
      "body": "sounds like he is trying to prove himself as a \"poor boy\" to garner donations.there is no reason to need to prove your age or gender or name or location. unless your trying to get funds from someone that doesnt trust who you areand the only reason i can see where age and value needs to be proven is where you are trying to get people to pay you. again age is not important unless your trying to set a narrative where the need of funds relates to age/poverty status",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "examplens",
      "created_time": "February 20, 2023, 05:22:06 PM",
      "body": "Quote from: Michael429803 on February 20, 2023, 05:06:25 PMNot sure how I'll post proof of me being 16 in a safe way since one of the people in the last thread said it's dangerous to post any videos of myself after I posted them (that's why I deleted the video). Is there any safe way to prove that I'm 16?   why would you even prove here how old you are? nobody is asking you to do that, nor is it a requirement to be a member of this forum.one of the basic advantages of bitcoin is anonymity and privacy, it is completely contradictory to reveal your personal information. not only here but anywhere on the internet.Quote from: Michael429803 on February 20, 2023, 05:06:25 PMAlso is there a reason why it's not safe to post vids of myself?someone can abuse such a video and present themselves somewhere pretending to be you. if that someone commits fraud or any illegal activity, and all this is behind your name, it can cause certain problems for you.Quote from: Michael429803 on February 20, 2023, 05:06:25 PMI'll repeat what I said in the other discussion. 2/3 of my bitcoin are held in the stockpile.com app and the other third is with my dad. I'll talk to him about moving it all into one wallet but as of right now, it's not in one place. holding bitcoin on to two different places is not a good decision as a matter of priority. certainly not if one of them is Stockpile. if you check their trust rating on https://www.trustpilot.com/review/stockpile.com you will see that there are many accusations against them. I would never trust people like them with my money.You should learn more about bitcoin and cryptocurrency and how to safe hold it and after that make a decision.Ask what you do not understand.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "livingfree",
      "created_time": "February 20, 2023, 05:47:48 PM",
      "body": "Quote from: Michael429803 on February 20, 2023, 05:06:25 PMThis is my new account, I've locked the other discussion. I cannot provide solid proof I'm a 16-year-old or that I even own the bitcoin in the first place. I'll repeat what I said in the other discussion. 2/3 of my bitcoin are held in the stockpile.com app and the other third is with my dad. I'll talk to him about moving it all into one wallet but as of right now, it's not in one place. Not sure how I'll post proof of me being 16 in a safe way since one of the people in the last thread said it's dangerous to post any videos of myself after I posted them (that's why I deleted the video). Is there any safe way to prove that I'm 16?   Also is there a reason why it's not safe to post vids of myself?As said, you're good Michael. No need to post any video of yours just to prove that you're 16. Who cares with our age in here?We're up for sharing knowledge and not our personal lives but sometimes, there are folks that are wanting to share their personal lives and it's their choice. On your case, it's not that really needed to share it. All the information you've mentioned and given are already enough to start a discussion. One thing that you can apply about privacy is the same as remaining lowkey.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Michael429803",
      "created_time": "February 20, 2023, 05:54:51 PM",
      "body": "Quote from: franky1 on February 20, 2023, 05:19:58 PMsounds like he is trying to prove himself as a \"poor boy\" to garner donations.there is no reason to need to prove your age or gender or name or location. unless your trying to get funds from someone that doesnt trust who you areand the only reason i can see where age and value needs to be proven is where you are trying to get people to pay you. again age is not important unless your trying to set a narrative where the need of funds relates to age/poverty statusI am not poor, also people were telling me that I am fake and I was only doing this for karma or whatever. I know I am quite fortunate and there was a good amount of people telling me off on \"ur just trying to get meriate/karma\" or \"your not 16 your story is fake\" and stuff like that I was just kinda annoyed about that stuff",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AmoreJaz",
      "created_time": "February 20, 2023, 06:02:37 PM",
      "body": "Quote from: Michael429803 on February 20, 2023, 05:54:51 PMQuote from: franky1 on February 20, 2023, 05:19:58 PMsounds like he is trying to prove himself as a \"poor boy\" to garner donations.there is no reason to need to prove your age or gender or name or location. unless your trying to get funds from someone that doesnt trust who you areand the only reason i can see where age and value needs to be proven is where you are trying to get people to pay you. again age is not important unless your trying to set a narrative where the need of funds relates to age/poverty statusI am not poor, also people were telling me that I am fake and I was only doing this for karma or whatever.you don't owe anyone to explain the status of yourself. as others have said, it doesn't matter what age you are in this community. just ignore people who are saying you're fake and other insulting things. there's no reason to stoop down to their level. much better if you are being discreet with your crypto investments as you have no idea what this cyberspace can do to your security. as you are still young, i hope you are not disclosing all your crypto activities via your social media channels. those are the targets of scammers to find their next victim. as they said above, you don't need to explain to anybody about your age and how much you invested into this market. why are you so adamant to prove yourself to others?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitbollo",
      "created_time": "February 20, 2023, 06:21:03 PM",
      "body": "@Michael429803 does stockpile allow you to keep private keys?I suggest you read up on what are the safest methods to keep bitcoins and above all avoid leaving them on third-party apps. (!)Regardless of the age, and the seriousness of the product, not your keys not your coins is a motto ALWAYS VALID!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "The Cryptovator",
      "created_time": "February 20, 2023, 06:28:35 PM",
      "body": "Why do you feel the need to prove that you are 16 years old? Is it really that significant whether you are using decentralized cryptocurrency and the forum at the same time? I don't care how old you are. The point is that you start using Bitcoin and recognize its value. You repeatedly mentioned in your thread how you must provide proof that you are 16 years old. I'll argue there's a secure way to demonstrate it. Just forget the fact that you are 16 years old and that you have nothing to prove. When you want to use something centralized and KYC is required, that would be a problem. Otherwise, nothing is wrong with you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Michael429803",
      "created_time": "February 20, 2023, 06:30:08 PM",
      "body": "Quote from: The Cryptovator on February 20, 2023, 06:28:35 PMWhy do you feel the need to prove that you are 16 years old? Is it really that significant whether you are using decentralized cryptocurrency and the forum at the same time? I don't care how old you are. The point is that you start using Bitcoin and recognize its value. You repeatedly mentioned in your thread how you must provide proof that you are 16 years old. I'll argue there's a secure way to demonstrate it. Just forget the fact that you are 16 years old and that you have nothing to prove. When you want to use something centralized and KYC is required, that would be a problem. Otherwise, nothing is wrong with you.I'm trying to get my other account deleted. Sadly theymos has not been online since yesterday so I can't rip.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fivestar4everMVP",
      "created_time": "February 20, 2023, 06:39:47 PM",
      "body": "PrivacyG said it all, this forum doesn't care what your age is, or what amount of money you invested in bitcoin, Infact, users of this forum are encouraged to protect their privacy, be safe always, when it comes to dealing with online people, you can only trust yourself, you don't know who the other person is or what they are capable of, so keep every vital information about yourself clear from the public, you never can tell who is watching or trailing you.And then again, make sure your bitcoins are stored in a wallet that is completely decentralized, you can make use of wallets like electrum, mycelium etc, this is if you can not afford a hardware wallet.I've never heard about stockpile.com but it does sound like a decentralized wallet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "The Cryptovator",
      "created_time": "February 20, 2023, 06:43:02 PM",
      "body": "Quote from: Michael429803 on February 20, 2023, 06:30:08 PMI'm trying to get my other account deleted. Sadly theymos has not been online since yesterday so I can't rip.How would an account be deleted? No way. Are you certain of that? perhaps having your account locked. If the forum has banned your other account, proceed with caution. If so, you are no longer allowed to access this forum. Because admin banned you, not confined to your account. However, you should make a request for your account in the Meta section. Also, being 16 is not a reason to lock or ban your account.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lionheart78",
      "created_time": "February 20, 2023, 07:07:27 PM",
      "body": "Quote from: Michael429803 on February 20, 2023, 05:54:51 PMQuote from: franky1 on February 20, 2023, 05:19:58 PMsounds like he is trying to prove himself as a \"poor boy\" to garner donations.there is no reason to need to prove your age or gender or name or location. unless your trying to get funds from someone that doesnt trust who you areand the only reason i can see where age and value needs to be proven is where you are trying to get people to pay you. again age is not important unless your trying to set a narrative where the need of funds relates to age/poverty statusI am not poor, also people were telling me that I am fake and I was only doing this for karma or whatever. I know I am quite fortunate and there was a good amount of people telling me off on \"ur just trying to get meriate/karma\" or \"your not 16 your story is fake\" and stuff like that I was just kinda annoyed about that stuffYou cannot remove that suspicion because many members in this forum post the same kind of topic to farm merit.  If you explore the Bitcoin discussion board you can see lots of threads that share about their Bitcoin adoption stuff, and some members look at it in a negative way.I don't mind if you post this to get merit, what matters is that you got the courage to spend your saved money to bitcoin.  You don't have to prove anything here, it is up to you if you lie or not, I will just go along with your story since it doesn't affect me in one way or another. Besides, it would be for your own safety to keep your identity private.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Agbe",
      "created_time": "February 20, 2023, 07:13:14 PM",
      "body": "Quote from: Michael429803 on February 20, 2023, 05:06:25 PMThis is my new account, I've locked the other discussion. I cannot provide solid proof I'm a 16-year-old or that I even own the bitcoin in the first place. I'll repeat what I said in the other discussion. 2/3 of my bitcoin are held in the stockpile.com app and the other third is with my dad. I'll talk to him about moving it all into one wallet but as of right now, it's not in one place. Not sure how I'll post proof of me being 16 in a safe way since one of the people in the last thread said it's dangerous to post any videos of myself after I posted them (that's why I deleted the video). Is there any safe way to prove that I'm 16?   Also is there a reason why it's not safe to post vids of myself?This is your first thread so I don't know what you are saying about locking of other discussion. Is it that, this account is your altaccount? If yes what is the name of the other discussion thread (account). And also nobody is interested in your age. If we know your age what are we going to do with it? Op anyone can own any amount of bitcoin so for as a 16 yrs of age owning a bitcoin has nothing to do with the forum members. I don't know how f any one is interested of that. I will advise you of giving real information instead of beating around the bush.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Michael429803",
      "created_time": "February 20, 2023, 07:28:09 PM",
      "body": "Quote from: Agbe on February 20, 2023, 07:13:14 PMQuote from: Michael429803 on February 20, 2023, 05:06:25 PMThis is my new account, I've locked the other discussion. I cannot provide solid proof I'm a 16-year-old or that I even own the bitcoin in the first place. I'll repeat what I said in the other discussion. 2/3 of my bitcoin are held in the stockpile.com app and the other third is with my dad. I'll talk to him about moving it all into one wallet but as of right now, it's not in one place. Not sure how I'll post proof of me being 16 in a safe way since one of the people in the last thread said it's dangerous to post any videos of myself after I posted them (that's why I deleted the video). Is there any safe way to prove that I'm 16?   Also is there a reason why it's not safe to post vids of myself?This is your first thread so I don't know what you are saying about locking of other discussion. Is it that, this account is your altaccount? If yes what is the name of the other discussion thread (account). And also nobody is interested in your age. If we know your age what are we going to do with it? Op anyone can own any amount of bitcoin so for as a 16 yrs of age owning a bitcoin has nothing to do with the forum members. I don't know how f any one is interested of that. I will advise you of giving real information instead of beating around the bush. Ok, thank you. I was just scared that I was gonna get banned cuz people said I was faking it and stuff",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Crypt0Gore",
      "created_time": "February 20, 2023, 07:42:18 PM",
      "body": "What is the stockpile website all about? I have never heard about this before and when I try to access the website it said I can't, please do not keep your Bitcoin on any website, it's not secured on any, the safest place for your Bitcoin is non custodial wallet like Electrum or Hardware wallet, also, you don't need to prove anything to anyone on this forum, we are not here to share our looks, how much we make or where we live, everything on here about us should stay private.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "freedomgo",
      "created_time": "February 20, 2023, 07:59:19 PM",
      "body": "Quote from: PrivacyG on February 20, 2023, 05:10:24 PMNo body cares if you are 16, 8, 20 or 80.  You need to prove us nothing.A video of yourself to prove what exactly?  You are only subjecting yourself to harassment and threats from people who see you as vulnerable.  You are very vulnerable at 16 to a lot of things.  Internet people are not as friendly as they seem.  Please.  Your Privacy is very important and it is not a good idea to post a video showing your face saying 'hey I own some Bitcoin' at all.What if your $450 all of a sudden turn into millions.  People will link your face to a high net worth and may resort to attacks.  So many things can go wrong bud.This forum does not require age verification or any other sort of personal document.  Good for you if you invested $450 in Bitcoin.  But keep sensitive information to yourself, for your own sake. As long as you know you are legit and are not using fake account, that’s good enough. Nobody cares actually what’s your real identity is. And it’s a good thing to never show some videos of yourself, you are just putting yourself in danger if ever. And always know that this market is surrounded with scammers, as long as you know that your are honest to yourself, then the community here do not need more clarifications just to prove you are legit.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "aoluain",
      "created_time": "February 20, 2023, 08:02:15 PM",
      "body": "Quote from: Michael429803 on February 20, 2023, 07:28:09 PMQuote from: Agbe on February 20, 2023, 07:13:14 PMQuote from: Michael429803 on February 20, 2023, 05:06:25 PMThis is my new account, I've locked the other discussion. I cannot provide solid proof I'm a 16-year-old or that I even own the bitcoin in the first place. I'll repeat what I said in the other discussion. 2/3 of my bitcoin are held in the stockpile.com app and the other third is with my dad. I'll talk to him about moving it all into one wallet but as of right now, it's not in one place. Not sure how I'll post proof of me being 16 in a safe way since one of the people in the last thread said it's dangerous to post any videos of myself after I posted them (that's why I deleted the video). Is there any safe way to prove that I'm 16?   Also is there a reason why it's not safe to post vids of myself?This is your first thread so I don't know what you are saying about locking of other discussion. Is it that, this account is your altaccount? If yes what is the name of the other discussion thread (account). And also nobody is interested in your age. If we know your age what are we going to do with it? Op anyone can own any amount of bitcoin so for as a 16 yrs of age owning a bitcoin has nothing to do with the forum members. I don't know how f any one is interested of that. I will advise you of giving real information instead of beating around the bush. Ok, thank you. I was just scared that I was gonna get banned cuz people said I was faking it and stuffThis forum can be a tough place at times when you are a newbie account, even whenyou are 16 or 60. Too many accounts have turned out to be scammers or only interestedin ranking up.Welcome to the forum, as mentioned by many others, age in not important, neither is location or race, we all most of us have the same thing in common: Bitcoin.Its great that you made the move into Bitcoin, your timing is good.Tips:Take full control of your Bitcoin with your own wallet with your private keys.Dont panic if Bitcoins price suddenly flashes down to $18k because LONG TERMits going in the other direction ↑",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hatshepsut93",
      "created_time": "February 20, 2023, 08:06:11 PM",
      "body": "$450 is a very small investment these days. By some very optimistic scenarios Bitcoin will reach ~$200,000 during the next cycle, so a ~x10 increase from the current price level. Will having $4,500 instead of $450 radically chance your life? Don't think so. If you bought 1 Bitcoin for $450 seven years ago, and held till now, that could have been life-changing. This is not to make you feel any regrets, but to illustrate that the market is no longer as fast growing as it used to be.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}