{
  "id": "topic_5420421",
  "title": "Crypt0Gore",
  "author": "Crypt0Gore",
  "created_time": "November 10, 2022, 05:38:53 PM",
  "content": "Hi BTT famz, is it a good idea to borrow against your crypto assets? Is there anyone practising this right now? What are the risks involved in doing this? Is Defi borrow and lending the best way to go because I know some are centralised.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5420421",
  "comments": [
    {
      "author": "jackg",
      "created_time": "November 10, 2022, 05:57:49 PM",
      "body": "If you've got a good strategy behind it then it's not a bad idea. Flash crashes can cause problems though if you're poorly collateralised but if you understand what you're doing pretty well you can weather it (also being over 40% debt to assets is definitely a bad thing but still bad if you're investing the extra funds elsewhere).The additional problem with doing this is holding the borrowed coins in a way they're protected and can still be used. You're just throwing money away if you don't have instant access to them and a crash occurs.Fully collateralised defi alternatives are a great investment. Defi alternatives that aren't collateralised well are probably worse than exchanges - look at what's happened to Luna.If you've not got a good (and RELIABLE) investment lined up for the money or don't need the cash then it's probably a bad idea.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JeromeTash",
      "created_time": "November 10, 2022, 09:58:52 PM",
      "body": "Quote from: Crypt0Gore on November 10, 2022, 05:38:53 PMHi BTT famz, is it a good idea to borrow against your crypto assets?Question 1;Why would you borrow against your crypto assets?By borrowing against your crypto assets, you are basically handing over your assets to a third-party custodian or a centralized lender as collateral.  You are putting your assets to more danger of getting mismanaged or stolen.Quote from: Crypt0Gore on November 10, 2022, 05:38:53 PMIs there anyone practising this right now? What are the risks involved in doing this? Is Defi borrow and lending the best way to go because I know some are centralised. You wanna know about the dangers?Read more about what happened in the:1. Luna crash saga2. Three Arrows Capital saga3. Celsius network saga4. Voyager Digital saga5. FTX- Alameda Research sagaTo mention but a few, all this happened in 2022,The answer is basically right under your nose.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pixie85",
      "created_time": "November 11, 2022, 12:04:59 AM",
      "body": "The examples of failed companies listed above aren't a proof that lending is impossible or that the business idea is doomed. Those are examples of greedy companies that were playing with the funds they had. They wanted to make more money so they were engaging in risky games of investing with leverage and like SBF did throwing money at every possible investment option. They threw billions at Alameda but how much did Alameda make for them? Not nearly as much. I agree that it's more risky than simply holding volatile cryptocurrencies. You'd have to find a regulated transparent company.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Darker45",
      "created_time": "November 11, 2022, 02:28:13 AM",
      "body": "Personally, I don't think so. I'm generally not a fan of borrowing whether in crypto or outside of it. But I guess it matters why you will borrow. I mean, the reason for borrowing. If you're unbanked or you have a hard time borrowing outside crypto and you badly need to get a loan, then crypto lending platforms are options. But if you're borrowing for the sake of borrowing or for the sake of something else not really urgent, I'd advise you not to do it. You're only courting risk. Instead, value your Bitcoin and keep it where you have your private keys.For one, crypto is volatile. Your collateral could be liquidated while you're asleep. If you're lucky, you only need to add more collateral to be able to avoid liquidation. Secondly, how much of your collateral's value could you borrow? 50%? 60%? Not worth it. Third, take a look at the history of lending platforms; they're falling one by one. They're generally irresponsible. Finally, forget about the word decentralized. 99.99% of them are actually anything but decentralized.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "notocactus",
      "created_time": "November 11, 2022, 03:46:35 AM",
      "body": "Quote from: Crypt0Gore on November 10, 2022, 05:38:53 PMis it a good idea to borrow against your crypto assets? Is there anyone practising this right now?I did not get your question too clearly. What did you imply by \"borrow against your crypto assets?\"Assume what you want to do are as followsUse your Bitcoin as a collateral to make a loan for your margin tradingThen you use what you borrow to short BitcoinWhat do you feel if Bitcoin soars and your Funding account has a good increase in value but your Margin account is in loss (Red) and even faces with forced liquidation because you opened a Short position ?QuoteWhat are the risks involved in doing this? Is Defi borrow and lending the best way to go because I know some are centralised. Lot of risksYou put your initial capital as a collateral on a centralized platformRisk of unable to withdraw your initial capital if the platform goes to bankruptcy.Risk of forced liquidation as explaining above",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Crypt0Gore",
      "created_time": "November 11, 2022, 06:10:03 AM",
      "body": "Quote from: JeromeTash on November 10, 2022, 09:58:52 PMQuote from: Crypt0Gore on November 10, 2022, 05:38:53 PMHi BTT famz, is it a good idea to borrow against your crypto assets?Question 1;Why would you borrow against your crypto assets?By borrowing against your crypto assets, you are basically handing over your assets to a third-party custodian or a centralized lender as collateral.  You are putting your assets to more danger of getting mismanaged or stolen.Quote from: Crypt0Gore on November 10, 2022, 05:38:53 PMIs there anyone practising this right now? What are the risks involved in doing this? Is Defi borrow and lending the best way to go because I know some are centralised. You wanna know about the dangers?Read more about what happened in the:1. Luna crash saga2. Three Arrows Capital saga3. Celsius network saga4. Voyager Digital saga5. FTX- Alameda Research sagaTo mention but a few, all this happened in 2022,The answer is right under your nose.I don't like the idea myself but since few new projects are using this idea as utility then I am guessing that many investors are patronising them, I can across a new project called HIFI Finance on coinmarketcap and I am doubting why such projects keep pumping up after so many damages that they have done to investors..My curiosity was maybe there is more to the whole thing than I knew, this is why I asked this question, I thought 🤔 I was missing out on something, thanks for your reply.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Alisha-k",
      "created_time": "November 11, 2022, 06:32:59 AM",
      "body": "More or less margin loans. It is not a good idea to me because crypto assets are so unpredictable. If it were to be an investment where a higher level of profit can be controlled by the borrower it will be a nice idea but going for a risky asset with loaned funds is a big risk that will reck both the lender and the borrower sake of impatience and volatility.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "slackovic",
      "created_time": "November 11, 2022, 10:21:43 AM",
      "body": "I never borrowed an asset on a crypto lending platform because I'm always afraid that the second I take a loan, the price of a collateral will dump and I'll get liquidated. Personally I never use loan for investments because I only invest money that I can afford to lose. I know it's a cliche but it's a cliche for a reason. If you invest borrowed money and lose it, how will you repay your loan? And if you invest money that you can afford to lose, it won't be that big of a deal. Imagine if you borrowed money and invested into FTT a week ago. How would you repay your loan now when it crashed? And I'm not talking about some low cap shitcoin. FTT was in the Coingecko top 30 projects before the crash.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sunsilk",
      "created_time": "November 11, 2022, 12:04:03 PM",
      "body": "When I'm hearing DeFi and lending/borrowing these days, it's actually worrying me. Because many hacks had happened to these services and they're always on the eyes of those hackers. I've thought of doing this but to find someone I know literally, that will lend me money, I haven't found it and I don't want to entrust my funds to those services because it's really worrisome these days with those crashes, hacks and fiascos that happens.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "traderethereum",
      "created_time": "November 11, 2022, 03:22:44 PM",
      "body": "What is your purpose for borrowing and taking a risk by using your coins as collateral?I don't know how DeFi focuses on borrowing and lending because I'm worried about the risks behind it.I'd rather stick with my current assets and keep trying to develop those assets than borrow and that's what I recommend to you too.Taking out a loan means you have to be prepared to repay the loan and if you can't, you could lose your assets.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JeromeTash",
      "created_time": "November 11, 2022, 08:51:05 PM",
      "body": "Quote from: pixie85 on November 11, 2022, 12:04:59 AMThe examples of failed companies listed above aren't a proof that lending is impossible or that the business idea is doomed. Those are examples of greedy companies that were playing with the funds they had. They wanted to make more money so they were engaging in risky games of investing with leverage and like SBF did throwing money at every possible investment option. They threw billions at Alameda but how much did Alameda make for them? Not nearly as much. I agree that it's more risky than simply holding volatile cryptocurrencies. You'd have to find a regulated transparent company.It's funny that the main reason most of us here believed in Bitcoin and other legit cryptos was because we wanted full control of our funds and also avoid shitty third party institutions like banks that make money out of our money.The same exact thing with the so-called borrowing and lending DeFi projects. Very centralized, very corrupt and full of fund mismanagement. You only see it when it was too late. Two weeks ago, did you have any idea the FTX had all this ugly things it did behind the scenes?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DeathAngel",
      "created_time": "November 11, 2022, 10:54:41 PM",
      "body": "A very bad idea. Are you not aware of what has only just happened in crypto space with FTX? Seriously, not your keys, not your cheese. Do not leave your assets in the control of any 3rd party for even a moderate amount of time. It is not worth the risk, we are in a deep bear market now. Many of these companies are not solvent, do not let them hold your coins.Borrowing against your coins is a terrible idea.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Beparanf",
      "created_time": "November 11, 2022, 10:56:55 PM",
      "body": "Yep, Since you can have higher capital for a higher profit but you should not use the loan money on risky trade  that involves high leverage that will cause you immediate liquidation on a single price swing. Many professional traders is borrowing money so that they can increase there capital with just using there same amount of money as collateral.Simply you are just using the money of none risky trader for your aggresive trader to earn more and you just paid them back when you profit or loss same small amount when your trade didn't turn as you planned but atleast your loss is small but your profitability is high that time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Techkoy407",
      "created_time": "November 12, 2022, 01:27:19 AM",
      "body": "Quote from: Crypt0Gore on November 10, 2022, 05:38:53 PMHi BTT famz, is it a good idea to borrow against your crypto assets? Is there anyone practising this right now? What are the risks involved in doing this? Is Defi borrow and lending the best way to go because I know some are centralised. investing with borrowed money, it's not good and more risky, because no one knows whether your investment is successful or not.because in investing I always stay away from risk as much as possible.and I also just started investing, I invest little by little, but use my own money, not borrowed results, so I'm calmer when the market goes down and more happy when I get profits.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hatshepsut93",
      "created_time": "November 12, 2022, 06:45:21 AM",
      "body": "If you are borrowing Bitcoin against your shitcoin, you are essentially shorting your shitcoin, which is often a good idea. If you're doing the opposite - borrowing an altcoin against Bitcoin, you're going to become bankrupt, because all altcoins are destined to go to zero, and once your altcoin turns red, it won't turn green ever again.I recommend everyone, especially beginners, to not look for shortcuts and trying become rich quick, and simply accumulate Bitcoin for long term. Those who try to become rich quick usually end up becoming poor even quicker.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}