{
  "id": "topic_5446116",
  "title": "Greggry",
  "author": "Greggry",
  "created_time": "March 24, 2023, 04:24:52 AM",
  "content": "Someone contacted me today that she needed bitcoin, I quickly search for bitcoin vendors, God so kind a friend of mine introduced me where I can get it easily. Those vendors have refers benefits, whoever bring client will always get 1% of whatever units of bitcoin the client will purchases.I go extra miles to verify the authenticity of those vendors without telling the woman to avoid trouble or scam threat. But at the end the woman bought 10% of the current price and she later call me that she loves transparent people I should send my account details and she bless me with 50k my local currency plus vendors refers benefits of 10k. Lol, this amount is called small is beautiful.I have a total of $100 and I quickly used it to invest in bitcoin, the money is amicabily disappearing. Lol. Is God not good?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5446116",
  "comments": [
    {
      "author": "Cryptomiles1",
      "created_time": "March 24, 2023, 10:22:58 AMLast edit: March 24, 2023, 12:32:17 PM by Cryptomiles1",
      "body": "I am not doubting you in anyway but this sound like a fiction; how do you think of a woman contacting you without having a business deal before or even being link to someone that already established. You and I knows how it's for you or anyone else here to send you money or bitcoin without an escrow.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "March 24, 2023, 10:25:56 AM",
      "body": "Usually a referral got commissions butbof course they can always have options to buy it on market where they dont need to ask an agent to buy some bitcoin. If you earn easily with that 1% and your buyers are always buy bigger bulk then thats good. But what if your buyer or client only bought $100. Imagine that right? Also was this process is automated or you literally do manual brokerage to the company selling bitcoin?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zanab247",
      "created_time": "March 24, 2023, 10:46:18 AM",
      "body": "Congratulations to you OP, but the price of Bitcoin has increased to $28k which that amount of money you have now will not reach you to buy pretty of BTC unless you wait for the price to decrease back to $17k before you can buy. If you wait for the price to decrease low will help you to use that $100k to achieve huge amount of money in the future because, the price of BTC will surely reach $50,000 before the end of this year 2023. Since the woman gave you this trust, I will advise you not to break the trust because many people are looking for such opportunity in the community but they can't get it easily like the way you got it",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptSafe",
      "created_time": "March 24, 2023, 10:54:59 AM",
      "body": "OP I do not really have clues of your country and to know how valuable that figure is compared to your local currency but anyways, you did well by helping the said lady to do some research on best platform to help her get bitcoin. Atleast that saved her some risk and stress sourcing for it as she is a new bie in the system. All thanks to you for your kindness but you benefited from it in all rounds and I hope you advised her on the \" not your keys, not your coin\" slogan so she would be aware and possibly the safest wallet she could start with as a newbie depending on what she wants to do with it if she's buying holding or not. Lastly, it pays to be good and do good. You got your rewards for that OP. Thumbs up to you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Muba20",
      "created_time": "March 24, 2023, 10:57:29 AM",
      "body": "You are also lucky because you get the referral bonus and invest it back in Bitcoin. Bitcoin is not bad at the current price level. The market may see an uptrend quickly. If Bitcoin is between $27000-$28000 then chances of profit on your investment obviously high. Otherwise you will have to wait for some more time to come back.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nwada001",
      "created_time": "March 24, 2023, 11:09:21 AM",
      "body": "Quote from: Greggry on March 24, 2023, 04:24:52 AMSomeone contacted me today that she needed bitcoin, I quickly search for bitcoin vendors, God so kind a friend of mine introduced me where I can get it easily. Those vendors have refers benefits, whoever bring client will always get 1% of whatever units of bitcoin the client will purchases.For the agent who is paying referee 1% of the total purchase, which means the agent will be charging higher than the current market price for him/her to have such a percentage go out, or probably looking for means to dispense all current holdings on the black market. The percentage reward for referrals is just kind of strange to me, though.Quote from: Cryptomiles1 on March 24, 2023, 10:22:58 AMI am not doubting you in anyway but this sound like a friction; how do you think of a woman contacting you without having a business deal before or even being link to someone that already established. You and I knows how it for you or anyone else to send you money or bitcoin without an escrow.Maybe that's not just the first time he is coming in contact with the woman...  I believe it could be a relative, old friend colleague or any form of relation something if that nature, if not where will the person got his contact to send him a DM in the first place.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "KiaKia",
      "created_time": "March 24, 2023, 11:11:41 AM",
      "body": "If someone contact you that they need Bitcoin, it is smarter to give them your referral link, you must have a crypto exchange you are using, why not help this person to open a binance exchange account using your referral link? You will get better reward than running around because of 1%, that's not worth anything, because if she buy 100$ Bitcoin you only get 1% and if she buy 1000$ Bitcoin you get 10$, referring people to Binance exchange or other top exchange will earn you more rewards. Also it seems this buyer is a newbie, I would have sit her down and teach her how to buy Bitcoin directly using her smartphone.This mean + 1 to the list of people I bring into crypto, it makes no sense getting Bitcoin for her and she remained not knowing how to buy Bitcoin herself, that's bad for Bitcoin adoption.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coinerer",
      "created_time": "March 24, 2023, 11:19:28 AM",
      "body": "Quote from: Cryptomiles1 on March 24, 2023, 10:22:58 AMI am not doubting you in anyway but this sound like a friction; how do you think of a woman contacting you without having a business deal before or even being link to someone that already established. You and I knows how it for you or anyone else to send you money or bitcoin without an escrow.Yes, I think it begs the question of how he got that woman's contract. And how come there is a deal between them where the op didn't mention that the woman was a relative or an office colleague or he knew otherwise. But I appreciate it when someone gets something good out of bitcoin so I appreciate the op's point that he got something good out of bitcoin.  But I'm still not clear on the op's story about his relationship with the woman and how he deal with her",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Adbitco",
      "created_time": "March 24, 2023, 11:19:39 AM",
      "body": "Come to think of it only those who are afraid of involving themselves with kyc that could possibly look for another alternative means of buying bitcoin. Let say your country uses binance then p2p would have been a very swift method of trading over there, because I can see including those commissions would amount of buying bitcoin at a higher price than current price which if it was me I wouldn't mind passing verification to buy directly from Binance p2p or to any other p2p service provider in this forum.However congratulations to your earnings of being smart to ref.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Honnet43",
      "created_time": "March 24, 2023, 11:27:58 AM",
      "body": "Congrats on the successful transaction and the referral bonus! It's always great to find trustworthy vendors and to help others in the process. Just make sure to stay up-to-date on the market and be mindful of any potential risks. Best of luck!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "davis196",
      "created_time": "March 24, 2023, 11:32:26 AM",
      "body": "So basically some stranger (a woman) asked you to find Bitcoin vendors? That sounds weird. No stranger ever asked me to find BTC vendors. How did she contact you? Offline or online?Can't she find Bitcoin vendors herself(assuming that this is an actual woman and not a guy pretending to be a woman)? We live in the age of Google. Can't she do a Google search?How much is 50K in your local currency worth in US dollars?How did you manage to lose 100 USD? Did somebody scam you? Where did you invest those 100USD?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lorence.xD",
      "created_time": "March 24, 2023, 11:42:52 AM",
      "body": "Quote from: Greggry on March 24, 2023, 04:24:52 AMSomeone contacted me today that she needed bitcoin, I quickly search for bitcoin vendors, God so kind a friend of mine introduced me where I can get it easily. Those vendors have refers benefits, whoever bring client will always get 1% of whatever units of bitcoin the client will purchases.I go extra miles to verify the authenticity of those vendors without telling the woman to avoid trouble or scam threat. But at the end the woman bought 10% of the current price and she later call me that she loves transparent people I should send my account details and she bless me with 50k my local currency plus vendors refers benefits of 10k. Lol, this amount is called small is beautiful.I have a total of $100 and I quickly used it to invest in bitcoin, the money is amicabily disappearing. Lol. Is God not good?This just show that in everyway bitcoin could help people to earn and gain profit in various ways. But from the OP post I still think it's dangerous to meet up with a stranger just to verify their legit. It would be better to send first valid identification, of course you can blurred the important details because in my country you could tell they are legit if they send you proofs much better to have a middleman with transaction like this between two people. It could cost you to have a middleman but it will secure your money.That's good OP that you've invested your money to bitcoin but those amount I guess it would be hard for you to invest you'll have to wait for it to dump first or add some extra money since the value of bitcoin pumped these few last months. Good luck for your more successful transactions and congratulations.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cryptomiles1",
      "created_time": "March 24, 2023, 11:48:52 AM",
      "body": "Quote from: Nwada001 on March 24, 2023, 11:09:21 AMQuote from: Cryptomiles1 on March 24, 2023, 10:22:58 AMsnipMaybe that's not just the first time he is coming in contact with the woman...  I believe it could be a relative, old friend colleague or any form of relation something if that nature, if not where will the person got his contact to send him a DM in the first place. Well I have been involved in such business before, if that they have been transacting op would have made it clear here, but I am not in anyway doubting him or trying to make case out of his transaction. This could only confirm true if their country has no exchange to trade and buy bitcoin direct from exchange, I can take some examples from our country even as that we do trade on p2p directly from well known exchange.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Obari",
      "created_time": "March 24, 2023, 12:17:15 PM",
      "body": "Quote from: Cryptomiles1 on March 24, 2023, 10:22:58 AMI am not doubting you in anyway but this sound like a friction; how do you think of a woman contacting you without having a business deal before or even being link to someone that already established. You and I knows how it's for you or anyone else here to send you money or bitcoin without an escrow.Yeah I had to read it twice and it did felt more like a fiction and if I'm not wrong, the 50k should also be in my own local currency, hence you should be from Nigeria but I think OP should also know that things don't work that way and no one just contacts anyone to make purchases online without having any personal connection or links or even referrals from reputable persons.It also seems the buyer has some good knowledge of scam and how it works and there is no way she would want to risk her money just to prove a point without knowing you or having any connections with you.So op you have to be very conscious and very careful of yourself.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wapfika",
      "created_time": "March 24, 2023, 12:26:48 PM",
      "body": "Are you offering this service? How come you are being contacted by a random woman to purchased Bitcoin for her? What is the status of cryptocurrency on your country because finding a local vendor is very hustle compared when you just create an exchange account since most exchange is accessible globally.If this is real, You are blessed to encounter someone that is so lazy to purchased Bitcoin by themselves because it’s very easy to setup an exchange account especially if the person is investing huge sum of money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "notocactus",
      "created_time": "March 24, 2023, 03:08:03 PM",
      "body": "Quote from: Wapfika on March 24, 2023, 12:26:48 PMHow come you are being contacted by a random woman to purchased Bitcoin for her?I always be careful with such sudden offers that look more like scam attacks.Honestly in the past, I received offers (not sure on what channels) like \"I got 2 BTC stucked on exchange A and because of blah blah reasons, I am not able to withdraw it, could you help me please? Solutions to help me can be blah blah blah. Rewards for you will be 20% or 30% of my BTC when withdraw it successfully\"What will you do with such offers? Believe that it's true and go ahead or ignore it after one second?My choice is a second option, I don't want to waste my time with scammers.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Godlovesyou",
      "created_time": "March 24, 2023, 03:27:13 PM",
      "body": "Quote from: Cryptomiles1 on March 24, 2023, 10:22:58 AMI am not doubting you in anyway but this sound like a fiction; how do you think of a woman contacting you without having a business deal before or even being link to someone that already established. You and I knows how it's for you or anyone else here to send you money or bitcoin without an escrow.Is possible someone can refers you without haven meeting before, somebody may have refers him to the woman especially if you're for a particular business line, i don't doubt him on this because I have experience thing before. But most at times people cook up strategies to wipe you of your money, so you have to be very careful too. Nice one but the money may not be enough for bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Aanuoluwatofunmi",
      "created_time": "March 24, 2023, 03:50:59 PM",
      "body": "Quote from: Greggry on March 24, 2023, 04:24:52 AMI go extra miles to verify the authenticity of those vendors without telling the woman to avoid trouble or scam threat. How did the vendor got to incentivice the one percent he gave you if not from extorting from the price he's offering the woman, to me in case of next time why not refer her to a p2p exchange for direct purchase instead of the two of you milking from the rate and quantity she should have bought it from than both of you inflating your own interests, am sure she's new to the system that's why she's making such decision and yet she had not understand the process on how to acquire bitcoin on a p2p platform which is what i believe you could have taught her to be independent, will she also requires your presence if you want to buy next time or when she's ready to sell?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "passwordnow",
      "created_time": "March 24, 2023, 04:03:39 PM",
      "body": "That seems to be quick yet smooth storytelling. Although just like the others that have some questions on their mind, I've got mine as well.Anyway, I'd go with the latter part of what you did with the money and that's where you have invested in bitcoin. Don't be too hasty with the progress of the growth of your $100, you'll barely feel the dumps because if you try to calculate you'll just get a couple of bucks of paper losses if you're too conscious with it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}