{
  "id": "topic_5437168",
  "title": "paid2",
  "author": "paid2",
  "created_time": "January 29, 2023, 01:54:02 AMLast edit: January 30, 2023, 09:32:19 AM by iwantmyhomepaidwithbtc2",
  "content": "Hello,I want to do this topic with the goal to centralize all infos about solo mining findable on Bitcointalk. If you find other topics / pool to add to the list, please add them in comment here 1. Pools Solo CK pool (active)https://solo.ckpool.org/Bitcointalk : https://bitcointalk.org/index.php?topic=5237323.0Wiki : https://en.bitcoin.it/wiki/Solo.ckpoolNo registration required, no payment schemes no pool op walletsFee : 2% Transaction fees goes to the solo minerServers available : USA (Germany ?)Kano pool (active)https://kano.isBitcointalk : https://bitcointalk.org/index.php?topic=789369.0Wiki : https://en.bitcoinwiki.org/wiki/KanoPoolTransaction fees are included in the miner reward. Pool op wallet.Pool fee is 0.5% of the total.Servers available : NewYork, Netherlands, Germany, Japan, Seattle, Los Angeles, Phoenix, Atlantabtc.solomining.io (active)https://btc.solomining.io/No registration required, no payment schemes no pool op walletsPool fee is 1%. Transaction fees goes to the solo minerServers available : Europe / Canada / USA East / USA West / Australia (Sydney) / Singaporeviabtc (active)https://www.viabtc.com/Transaction fees goes to the solo minerPool fee 1%Servers available : Worldwide mining-dutch (active)https://www.mining-dutch.nl/Pool fee 1.5%bsod (offline)https://bsod.pw/Pool fee 1.9%Servers available : Europe, Asia, North Americasoloblocks.io (offline)https://soloblocks.io/Bitcointalk : https://bitcointalk.org/index.php?topic=5397166.msg60503248#msg60503248No registration required, no payment schemes no pool op walletsPool fee is 0.4%Transactions fees goes to the minerServers available : USA East, Asia, EuropeLottononce (offline)http://www.lottononce.com/Pool fee is 1%.No other infos, probably a scam.Solo-bitcoin.com (offline)http://solo-bitcoin.com/Bitcointalk : https://bitcointalk.org/index.php?topic=5402449.0Chip based rewardPool fee 0%Bitsolo (offline)Last block in 2015 (Block 362064)I did not write Shhpool in the list as the payout is divided with the miners, it is not solo.Same logic with Laurentia Pool. These small pools can give a nice opportunity for small miners to earn more than usual if the pool is lucky (double check before pointing any hashrate, Shhpool is still in Work in process and OP stopped his previous solo pool)2. Useful links and tools for solo miners :-Solochance.com : Calculate the chance of hitting a bitcoin block when solo mining. https://solochance.com/#-Solo mining profitability calculator (python) : https://bitcointalk.org/index.php?topic=5437062.0-CKpool stats / Iphone App : https://bitcointalk.org/index.php?topic=1344360.0-Mempool : https://mempool.space/3. Tutorials / Guides :-Basic tips for newbies : https://bitcointalk.org/index.php?topic=2415854.0-Solo Mining general infos : http://www.kano.is/index.php?k=soloinfo -Wiki : Pool vs Solo mining : https://en.bitcoin.it/wiki/Pool_vs._solo_mining-What is Luck ? by Kano : https://kano.is/index.php?k=poisson-Very useful infos about Gekko USB : https://kano.is/gekko.php-Verify the jobs on a solo mining pool : https://bitcointalk.org/index.php?topic=5405106.0-Solo mine testnet bitcoins with cgminer, Bitcoin Core, and a Compac F : https://bitcointalk.org/index.php?topic=5415335-Solo mine testnet bitcoins with bfgminer, Bitcoin Core, and a CPU/GPU : https://bitcointalk.org/index.php?topic=5415861.0-Support / How to install Gekko USB (Newpac / Compac F / R606 / R909 / Apollo) : https://www.bitshopper.de/en/support/-Technical reasons to not solo mine to an exchange address : https://bitcointalk.org/index.php?topic=5400950.0-How to build a script to calculate your solo chances : https://bitcointalk.org/index.php?topic=5394859.msg59914141#msg59914141-How to build a SHA256 Lottery with Gekkos USB miners : https://bitcointalk.org/index.php?topic=5340726.0-Is it possible to solo mine a whole block solely on insane luck? : https://bitcointalk.org/index.php?topic=5342729.0-Solo mining through Bitcoin core : https://bitcointalk.org/index.php?topic=5349749.04. Bitcointalk's solo mining groups :-Willi's Blockparties : https://bitcointalk.org/index.php?topic=5434965.msg61604426#msg61604426  (you can find the English version in the solo.ckpool topic)-Willi's Long time run : https://bitcointalk.org/index.php?topic=5381245.0-citb0in Solo-Mining Group - BLOCK SOLVERS : https://bitcointalk.org/index.php?topic=5419205.0 -Fun runs with Kano pool : https://kano.is/discord.html?k=202301290141325. Ressources :-CKpool code : https://bitbucket.org/ckolivas/ckpool/src/master/-Self-hosted pool, open source : https://github.com/tpruvot/yiimp-P2pool : https://github.com/jtoomim/p2pool-CGminer : https://github.com/kanoi/cgminer (wiki : https://en.bitcoin.it/wiki/CGMiner)-Stratum-ping : https://github.com/2miners/stratum-ping-Antminer Monitor : https://github.com/anselal/antminer-monitor",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5437168",
  "comments": [
    {
      "author": "kano",
      "created_time": "January 29, 2023, 07:03:43 AM",
      "body": "To be blunt, I'm not concerned if you don't include my pool in links above,but including a link to the thread by someone who is lying about my pool coz he doesn't like me,and trying to get hackers to attack all the miners on my pool as collateral damage, seems far from ideal.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "paid2",
      "created_time": "January 29, 2023, 10:08:32 AM",
      "body": "Quote from: kano on January 29, 2023, 07:03:43 AMTo be blunt, I'm not concerned if you don't include my pool in links above,but including a link to the thread by someone who is lying about my pool coz he doesn't like me,and trying to get hackers to attack all the miners on my pool as collateral damage, seems far from ideal.Your pool if of course included in the list, as others webpages from your site, they are valuable for the community, especially for newbies.Excuse me but which topic are you talking about ?I can erase a topic of my list if it causes any trouble to you",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kano",
      "created_time": "January 30, 2023, 08:39:48 AMLast edit: February 02, 2023, 12:53:49 AM by kano",
      "body": "I'm referring to this you linked:https://bitcointalk.org/index.php?topic=5425310.0In the 2nd post about my pool, he posted the full userlist on my pool (only available to members)and wouldn't remove it when I requested (see my request and his ignoring it there also)I ended up having to get a mod to resolve it as you can see the names have been obscured.His comments about my pool and the fun run are false and he makes claims that are bullshit, trying to attack the pool coz he's upset about losing BTC to MRR who ripped him off.--QuoteAlso noticeable is the cooperation with the users \"sidehack\" (=GekkoScience Compac F developer) and \"419mining\" (=distribution of the Compac F), there stinks heavily of surreptitious advertising what you read so.Oddly enough I did the free opensource Gekko driver for sidehack.Seriously, he's attacking sidehack and 419mining also?!?lol - what the fuck is \"stinks heavily of surreptitious advertising\" even supposed to mean?QuoteSomeone had even commented and rumored that Hashrate sent to a pool would be diverted for own purposes, but that would mean a shortcoming for all pools, but I had heard it in connection with this poolFor which he replied it was somewhere on reddit that he couldn't remember i.e. it's bullshitQuotehe is becoming more and more closed-source for himself and doesn't want to disclose anythingWell, the whole Gekko driver is open source ... that I released the end of last year and this yearQuoteI would not like to hit a block and have to watch in the blockchain how the reward for my found block would first be paid to Kano (because his payout address is stored and the reward goes to him first) and if he then e.g. dies in an accident the coins will never find their way to me because they are lying around on his wallet.Yet he himself is running a solo run that does EXACTLY that - rather hypocritical complaint.and ignoring the fact I've paid out more than $100million in BTC ... but no one knows yet what will happen if he ever finds a block ...QuoteStrangely enough, Kano also regularly resets his database (KDB) after a run, which resets certain statistical data on his website, Kano says he does this for some maintenance purpose.I restarted KDB ONLY twice in the whole of 2022(It's obviously mandatory for code updates)The web site clearly explains about the reset of the 'best'and in rare cases 'best ever' but only if it is below a small 1Gand again only twice in 2022QuotePersonally, it seems to me that Kano and wiggie45 work hand-in-hand and some internal deals exist for these solo fun runs.I'm really not sure what internal deals I'm gonna have for a $100 fun run, that I have also stated to all involved I wont allow them to run it larger in the discord channel coz I don't want people betting their livelihood.It's a fun run, like a lottery ticket, that's as far as I'll be involved in gambling.There's plenty more in that post that is full on crap.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "paid2",
      "created_time": "January 30, 2023, 09:40:27 AM",
      "body": "Quote from: kano on January 30, 2023, 08:39:48 AMI'm referring to this you linked:In the 2nd post about my pool, he posted the full userlist on my pool (only available to members)and wouldn't remove it when I requested (see my request and his ignoring it there also)I ended up having to get a mod to resolve it as you can see the names have been obscured.His comments about my pool and the fun run are false and he makes claims that are bullshit, trying to attack the pool coz he's upset about losing BTC to MRR who ripped him off.-- \"Also noticeable is the cooperation with the users \"sidehack\" (=GekkoScience Compac F developer) and \"419mining\" (=distribution of the Compac F), there stinks heavily of surreptitious advertising what you read so.\"Right, I've deleted the topic from my list. Thank you !(yes MRR doesn't look very nice, their prices per Ph/s are crazy high !)I am more than happy that you Kano did all this work on your pool and on Gekkos softwares. I wouldn't broadcast any infos which make you inconfortable or which are just total bullshit.Have a nice day !",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nicehash",
      "created_time": "January 30, 2023, 10:28:30 AM",
      "body": "NiceHash is offering solo mining through buying packages of hashrate. We call it EasyMining since anyone with BTC can buy these packages and have a chance of hitting a full block reward. https://www.nicehash.com/my/easymining/Basically, you can buy a package for $2 to $200 worth of BTC and have a probability of 1:74000 to 1:740 of hitting a block. The reward is paid to your BTC wallet address of your choice (inputed before setting up an order).This also allows NiceHash to pay the miners (sellers of hashrate) more than mining to any other pool. Since the launch of EasyMining. We paid 6% more to the sellers (miners) than mining Bitcoin via pool.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kano",
      "created_time": "January 30, 2023, 10:44:19 AM",
      "body": "Quote from: nicehash on January 30, 2023, 10:28:30 AMNiceHash is offering solo mining ...As I've mentioned before this info seems problematic.1) Cheaper rentalsOR2) Paying miners betterYou can't do both.If you are paying miners 6% more than pools, then buying mining is going to cost a lot.If you also add your fee on top of that again, then it's really expensive to do your solo mining.If on the other hand you are wanting good price rentals for your solo mining, then that 6% + your fee isn't going to do that.You have two sides in your service.People trying to sell their mining for the highest price, and people trying to buy mining for the lowest price.They both clearly conflict with each other.If on the other hand, you removed that clearly dubious statement about 6% more than pools,you could say quite easily that you are cheaper than MRR - coz they seem to charge a LOT more.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}