{
  "id": "topic_5458084",
  "title": "HoferBit",
  "author": "HoferBit",
  "created_time": "June 30, 2023, 04:04:39 AM",
  "content": "文/胡翌霖 2013年4月27日原文链接 https://yilinhut.net/2013/04/27/4801.html之前写了一篇比特币的长文，但仍然没有说清两个最关键的问题：一是网络上人们最爱争吵的问题——比特币究竟是不是一场骗局；二是真正重要的问题：比特币带来的革命究竟是什么。前一篇文章事实上也涉及了这两个问题，但由于篇幅太长，可能被遮盖掉了，我再专门讲一讲。首先谈一谈这个事实上不值一驳的问题：比特币是不是一场骗局。许多人喜欢把比特币与注明的郁金香泡沫相提并论，这当然是无稽之谈。比特币与郁金香有一个根本性的差别，那就是郁金香是有现实的价值的——人们欣赏花卉、互相赠送花卉，因此培育并贩卖花卉，郁金香的价值是实实在在，不容怀疑的。郁金香是现实的，还体现在，它可以被人们精心培育，不断从真实的土壤和肥料中生长出来。相反，比特币是一种无中生有而又归宿于无的东西。就是这一点致命的差别，决定了郁金香的价格不可能无限增值，而比特币却有可能。作为一种现实的商品，郁金香的涨价必然是暂时的，因为市场会对暴涨的价格作出回应，既然郁金香变得那么值钱，那么迟早会有更多的人加入到郁金香种植中来，如果说种植郁金香的成本并不会因为种植者的增多而增高，那么随着郁金香种植的扩张，郁金香的价格早晚都会下跌。事实上欧洲历史上的郁金香泡沫与当时的行会对郁金香交易的垄断有关，但任何霸权都不可能是永续的，垄断迟早会被打破，一旦市场的规律发挥了作用，泡沫就会破灭，现实的商品的价格最终会与其成本和需求相挂钩，而不可能永远“脱离实际”。但比特币从一开始就不是一个“实际”的货物，它的实用性就是它的价格本身，它的价格从一开始就是“脱离实际”的。也就是说，如果说所谓泡沫指的是价格远远高于实际的价值，那么比特币和所有纸币一样，从一开始就是泡沫。如果说庞氏骗局指的是始终由后来者为先行者提供回报，必须依靠不断加入的“更傻的傻子”才能持续运转的经济活动，那么比特币从一开始就是一场“骗局”。问题不在于比特币是泡沫还是骗局，而是在于，这一泡沫或骗局能够维持多久。前文提到的张三的“代鸡券”也是一种泡沫和骗局——一旦成为通行的货币，代鸡券的价值很快会超出一只鸡的价值，这超出的部分不是泡沫又是什么？同时，如果人们跑去张三的养鸡场里参观，发现张三根本不再养鸡了，那么难道不要大呼骗子么？如果李四入手了一张代鸡券，但又找不到另一个傻子再接收它，那么泡沫岂不是破灭了吗？是这样的。所有的货币都是如此，包括黄金在内，你如果入手了货币而再也找不到人可以接手，那么你就是“最后一个傻子”，整个泡沫就破灭了。即便黄金和郁金香一样有一定的实际价值和审美风尚的支持，但这并不保证它不能像郁金香泡沫那样大起大落。货币本身只是一张废纸，它用来写字和擦手都是低效的，一旦这张纸你再也找不到下一个肯要它的“傻子”花出去，那么你为换取这张纸所做的一切都白搭了。那么，你为什么敢于入手这张纸呢？入手之后，你会找到下一个傻子，说服他相信这张既不能画画又不能擦手的无用的纸具有相当的价值，那么这是怎么做到的呢？关键在于，支撑着这一场骗局的，支撑着所有参与者的信心的，究竟是什么。在一些传统的骗局中，人们相信着某件东西的实际价值（比如郁金香），一旦这种对其价值的过高估计最终幻灭了，人们的信心就会崩溃。但这种情况不会发生在现代的货币之上，因为它们本来就没有实际价值也从不要求人们去相信它除了能倒手出去之外还有什么用处。而对于比特币之前的货币来说，政府是信心的保证。但政府保证了什么呢？且不说政府总有可能垮台，即便政府永葆权威，但他顶多只能保证可以不停地印发货币（或者说我们能保证政府总是能有办法让货币贬值），他能够保证10块钱一定能值10块钱，但这10块钱究竟能买到什么，政府并没有保证什么。如果你不仅仅希望10块钱保证值10块钱，还至少希望10块钱保证能买半只鸡，那么你不仅要相信政府，更要相信养鸡户和卖鸡贩们，要相信整个市场的所有参与者保持一定的秩序，而且同时政府不能过多地发行货币。即便如此，你的信心也是极其短暂的——你也许可以相信10块钱在这几个月内能够买到小半只鸡，但再远一点的将来就不可预知了。事实上我们清楚，从8、90年代以来短短二十几年内，我们手中的货币究竟贬值了多少。当然这种贬值是正常的，但问题是，为什么即便如此，即便我们知道货币必定贬值，甚至我们看到了像金圆券或津巴布韦元那样急速贬值以致最终被市场抛弃的案例，我们为什么还愿意收入货币呢？事实上，我们并不是在信任某种超越历史的“本质”的东西，我们信任的就是历史本身，我们相信手中的货币在我们所熟悉的这样一个具体的历史境遇下的现实的价值。黄金和郁金香相比，人民币和金圆券相比，并没有什么“本体论”意义上的界限，区别只是在其不同的历史境遇。如果说我们需要对货币的发行者保持信心，那么这信心也主要是消极意义上的——也就是说相信他不至于乱搞。更关键的信心不是针对发行者，而是针对市场，针对使用者。即便张三不养鸡了，乃至张三死了，如果我相信其他人仍然愿意接受张三的代鸡券，那么我就仍然会收取它。甚至说，张三的退隐如果能够保证代鸡券再无滥发之忧，那么我可能会更加信任代鸡券的价值。简而言之，货币的价值既不是由其内含的某种物质或功能，也不是仅仅由其发行者所决定的，而是由市场的所有参与者决定的（或者说发行者仅仅决定货币是否会。只要总是有人愿意参与，那么这货币就总是有价值。那么比特币就是把货币作为信用凭证的信心依托用最极致的方式实现了出来——既然我们对发行者的滥发不敢放心，那么我们就干脆取消发行者；既然我们对货币的信任基于历史和市场，那么我们就把货币的运转完全交给市场，交给大众。有的时候，我们还担心货币造假，比特币则把防伪的工作交给整个互联网以及数学。把价值交给历史，把真伪交给数学，比特币看起来是一种完美的货币。比特币比郁金香、黄金、纸币等等经济“泡沫”更为优秀的地方在于，它完全摆脱了任何现实中的权力，因此不会因为任何人或机构的垮台而垮台。参与比特币交易的人究竟是不是“傻子”根本无关紧要，关键在于，如果说人类历史中永远都会有那么一部分“傻子”，而如果某种东西能够持久在傻子圈中通行的话，那么这种东西的价值就无可否认。比特币所依靠的权威只有三个：市场、历史和数学。如果有朝一日“市场”不再存在，所有事物都按需分配一步到位，而不需要任何交易了，那么比特币和任何货币都将走到尽头；如果有朝一日人们不再尊重历史和传统，不再有后人继续维护比特币的运转，比特币作为划时代的网络货币这一独一无二的历史地位被人们完全忽略，那个时候比特币也将有被人遗忘的危险——毕竟对失忆的人来说，“信用”的概念也没了着落，作为信用凭证的货币当然也命不久矣了；再或者，如果有朝一日比特币所基于的数学（密码学）法则被破坏了，那么它当然也难以为继了。很显然，这三大权威看起来比任何传统的权力中心都要可靠得多。如此我可以大胆预言：只要这三个支柱不倒，比特币无论再经历多少次泡沫破裂，暴涨暴跌，也都能延续下去。未完待续bitcoin:1411wgvec6AKWa5cp7sYqNdo8bq6T4xpe6?label=yilinhut",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5458084",
  "comments": []
}