{
  "id": "topic_5417956",
  "title": "Alik Bahshi",
  "author": "Alik Bahshi",
  "created_time": "October 22, 2022, 06:14:52 AM",
  "content": "The problem that the world has today because of Russia's war with Ukraine lies also on Obama's conscience.Alik BakhshiObama's inglorious departureIn the conclusion of the article \"America Needs Change\" (1), which I wrote on the eve of the 2008 presidential election and in which I predicted the victory of Barack Obama, were the following words:“The future president of America will traditionally get the problem of the Arab-Israeli conflict, and its solution primarily depends on how ready the new owner of the White House is to fight the Jewish lobby of the American Congress. Of the two candidates, in my opinion, Barack Obama is more suitable for this task, as a young and ambitious politician, less bound by any obligations.On the other hand, John McCain understands better what today's Russia is, whose imperial policy should not close one's eyes and condescendingly treat the curtailment of the institutions of Democracy. However, it should be noted that an experienced Joseph Biden as vice president may well complement the political baggage of a Democratic candidate.”I was not mistaken, the American President really intended to end the Palestinian problem and bring peace to the Jewish and Palestinian peoples. Thus, in his famous Cairo speech, Obama expressed his vision of the political situation in the Middle East, and the first of all American presidents expressed support for the Palestinian people in their desire to achieve freedom, saying: \"The United States will not turn its back on the legitimate aspirations of the Palestinian people to live in dignity in their own state\" .Unfortunately, I must admit that my hopes were not justified, Obama, in his good intentions, suffered a complete fiasco (2), and further on proclaiming the slogan “two states for two peoples”, he did not take any effective steps for all 8 years of his stay in the White House. He did not have the courage to fight the Jewish lobby in Congress (3), and the fact that even before the departure of Barack Obama from the presidency, America abstained, yes, just abstained, in the vote in the Security Council on a resolution condemning the settlement Israeli policy in the occupied territories highlights Obama's cowardice. How can one not recall the words of Yeshua Ha-Nozri:\"cowardice, no doubtone of the worst vices\"M. Bulgakov \"The Master and Margarita\"Clever, but cowardly, and therefore from his mind there was no use. He was given the Nobel only because he outlined the right path, but, alas, he did not make effective efforts to achieve the goal, the words remained words.During the long two terms of his presidency, Barack Obama did not understand what Russia is and who Putin is. He missed every chance to stop the revanchist Putin in his aggressive plans to revive the empire within its former borders. Of course, a dictator, and Putin is undoubtedly one, has an advantage both in the idea of ​​the decisions he makes and in the speed of their execution. However, Obama, instead of actually helping Ukraine with the supply of weapons, limited himself to timid sanctions against Russia. Yes, Barack Obama is far from Ronald Reagan, who stopped Moscow's military expansion. Reagan went beyond words, boldly calling the Soviet Union the Evil Empire, he organized military support, providing weapons to the freedom-loving people of Afghanistan. It was thanks to Reagan that the Evil Empire collapsed, it’s a pity that all subsequent presidents of America, including Barack Obama, misunderstood, here I repeat, what Russia is and who Putin is (4.5) reduced Reagan’s achievements to zero. Outgoing President Barack Obama spoke beautifully and correctly, but ...After all, people are judged by their deeds, not their words. I think Obama will have a serious conversation with his conscience in the future.1. America needs change. http://www.proza.ru/2008/11/03/6212. The fiasco of President Obama.https://alikbahshi.livejournal.com/25423.html  3. Obama, restore America's conscience and save Israel. https://alikbahshi.livejournal.com/7628.html 4. The state-forming people and its Fuhrer, or Ukraine and further down the list. https://alikbahshi.livejournal.com/21749.html5. Great Russian chauvinism and Putin is his Fuhrer. https://alikbahshi.livejournal.com/21133.html 01/19/2017.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5417956",
  "comments": [
    {
      "author": "Gyfts",
      "created_time": "October 22, 2022, 06:38:05 AM",
      "body": "This clip was made pretty famous in retrospect. I remember it being very popular at the time, but it has since gotten more relevant: https://www.youtube.com/watch?v=T1409sXBlegObama's foreign policy was terrible. Mitt Romney's would have been a bit better in hindsight but who actually knows. Russia's power was underestimated, and Obama had the audacity to ridicule Mitt Romney over it.Side note - there wasn't much talk about China being a geopolitical threat either. A lot of people couldn't foresee how fast China's economy would've grown in the past decade, including myself. 2012 foreign policy talk was just the Middle East, and many other things got overlooked, North Korea as well. NK were on the pathway to nuclear weapons at the end of 2016, if they weren't already developed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Alik Bahshi",
      "created_time": "October 22, 2022, 07:01:45 AM",
      "body": "Quote from: Gyfts on October 22, 2022, 06:38:05 AMThis clip was made pretty famous in retrospect. I remember it being very popular at the time, but it has since gotten more relevant: https://www.youtube.com/watch?v=T1409sXBlegObama's foreign policy was terrible. Mitt Romney's would have been a bit better in hindsight but who actually knows. Russia's power was underestimated, and Obama had the audacity to ridicule Mitt Romney over it.Side note - there wasn't much talk about China being a geopolitical threat either. A lot of people couldn't foresee how fast China's economy would've grown in the past decade, including myself. 2012 foreign policy talk was just the Middle East, and many other things got overlooked, North Korea as well. NK were on the pathway to nuclear weapons at the end of 2016, if they weren't already developed.  After Reagan, America had weak presidents, which allowed Russia to become a threat to the world again after the fall of the USSR.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BADecker",
      "created_time": "October 22, 2022, 07:23:16 PM",
      "body": "Obama is Biden's puppet master. Obama never really left government.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Alik Bahshi",
      "created_time": "October 22, 2022, 07:40:08 PM",
      "body": "Today, Biden has to correct the mistakes of previous American presidents.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sovie",
      "created_time": "October 23, 2022, 11:50:21 PMLast edit: October 24, 2022, 03:43:06 AM by sovie",
      "body": "Quote from: Alik Bahshi on October 22, 2022, 07:40:08 PMToday, Biden has to correct the mistakes of previous American presidents.Biden is making some very strong decisions - the strongest of all was exist from Afghanistan this has brought a lot of damage to the subcontinent and the world around.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BADecker",
      "created_time": "October 23, 2022, 11:55:03 PM",
      "body": "Quote from: sovie on October 23, 2022, 11:50:21 PMQuote from: Alik Bahshi on October 22, 2022, 07:40:08 PMToday, Biden has to correct the mistakes of previous American presidents.Biden is making some very strong decisions They are so strong (smelling) that he reeks of rot.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Alik Bahshi",
      "created_time": "October 24, 2022, 03:45:02 AM",
      "body": "Quote from: BADecker on October 23, 2022, 11:55:03 PMQuote from: sovie on October 23, 2022, 11:50:21 PMQuote from: Alik Bahshi on October 22, 2022, 07:40:08 PMToday, Biden has to correct the mistakes of previous American presidents.Biden is making some very strong decisions They are so strong (smelling) that he reeks of rot.     Yes, the aroma of the war with the smell of blood started by Putin is much more pleasant for you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BADecker",
      "created_time": "October 24, 2022, 02:50:03 PM",
      "body": "Quote from: Alik Bahshi on October 24, 2022, 03:45:02 AMQuote from: BADecker on October 23, 2022, 11:55:03 PMThey are so strong (smelling) that he reeks of rot.     Yes, the aroma of the war with the smell of blood started by Putin is much more pleasant for you.I'm not the one bashing Russia or the Ukraine... at least not anything near the way you bash Russia. I'd sooner not be part of the war over there. But you show by the way you constantly talk, that if you had the money and guns, you'd get right in there and fight against Russia, yourself.So we see that you are the one who loves 'the aroma of the war with the smell of blood started by' just about anybody who fights against Russia.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Alik Bahshi",
      "created_time": "October 24, 2022, 04:12:16 PM",
      "body": "Obama might be a good minister, but for a president, he has determination.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}