{
  "id": "topic_5438155",
  "title": "Elderyoung",
  "author": "Elderyoung",
  "created_time": "February 05, 2023, 11:15:19 AM",
  "content": "I'm having trouble logging into my roqqu wallet using the right email address and password.Is anyone else having the same problem?What is the issue, and how should I proceed?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5438155",
  "comments": [
    {
      "author": "NeuroticFish",
      "created_time": "February 05, 2023, 11:24:33 AM",
      "body": "Quote from: Elderyoung on February 05, 2023, 11:15:19 AMI'm having trouble logging into my roqqu wallet using the right email address and password.Is anyone else having the same problem?What is the issue, and how should I proceed?I've never heard of this wallet before, but a google search for is roqqu wallet scam looks ... bad.Also I went to their website and the fact that they show a bitcoin price that's not real... is yet another warning.People here cannot be of much help in logging in to a private business' platform. You can try your luck with the bottom-right support icon.But be very careful and no longer deposit money there, no matter what reasons they may give you. There's a good chance you'll lose them all.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "February 05, 2023, 11:26:18 AM",
      "body": "I do not know if you are a Nigeria as we read that Roqqu has expand it operation beyond Nigeria recently, but according to what Nigerians that have used this exchange before said, they do not recommend it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OmegaStarScream",
      "created_time": "February 05, 2023, 11:30:38 AM",
      "body": "I would've tried to make an account and log in to check if it's just you, but apparently, you need a Nigerian phone number for that.I would first try to do is to:1. Try to log in from the phone app, maybe they're just having a technical problem with the site.2. Reset your password, just to make sure that you're actually using the right credentials.If none of these options work, you should contact support directly. Since it's a custodial wallet/exchange, you can't recover your funds elsewhere.Also, you should probably consider switching[1][2] to another exchange.[1] https://www.trustpilot.com/review/app.roqqu.com[2] https://www.trustpilot.com/review/roqqu.com",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "RickDeckard",
      "created_time": "February 05, 2023, 09:31:17 PM",
      "body": "Quote from: OmegaStarScream on February 05, 2023, 11:30:38 AMI would first try to do is to:1. Try to log in from the phone app, maybe they're just having a technical problem with the site.2. Reset your password, just to make sure that you're actually using the right credentials.As a 3rd option, I'll would also try to reach out to their Twitter page[1] since that they seem to be fairly active over there. Nevertheless, whenever you're able to login I also highly advise you to seek other another exchange (or better yet, export your funds to a cold wallet of yours).[1]https://nitter.net/roqqupay/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitMaxz",
      "created_time": "February 06, 2023, 12:30:05 AM",
      "body": "It seems that they randomly banned users according to their reviews you might be banned or your account is terminated.According to their legal page before they terminate your account you should receive a 2 months notice so try to check your email for account termination you might get the reason why you can't able to log in.You can also try to contact them with their email hello@roqqu.com or their live support that you can find directly on their home page.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "February 08, 2023, 02:22:57 PM",
      "body": "Quote from: Elderyoung on February 05, 2023, 11:15:19 AMI'm having trouble logging into my roqqu wallet using the right email address and password.Is anyone else having the same problem?What is the issue, and how should I proceed?It seems to be a popular service in Nigeria, so asking Nigeria local board will give you more accurate answers ----> https://bitcointalk.org/index.php?board=275.0Anyway, according to them TOS:Quote from: https://roqqu.com/legal#:~:text=Digital%20Currency%20Services%20are%20not,light%20of%20your%20financial%20condition.Digital Currency Services are not currently regulated by the Financial Conduct Authority or any other regulator. Therefore, you need to contact the support team, and once you have access to your coins, I hope that you will withdraw them to a better wallet.Have you tried using a VPN? Or access it from a new IP? this maybe the problem",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lida93",
      "created_time": "February 28, 2023, 07:37:49 AM",
      "body": "I was ones using this app called roqqu then at a certain point I became dissatisfied with their pattern of services and features based on some difficulties I had with the app. I'll advise you try and reach out to their customers support center and lay your complain, they should be in good position to resolving your complaint.Please try not to keep much money in that space it's just a friendly advise anyway!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}