{
  "id": "topic_5470400",
  "title": "mameex",
  "author": "mameex",
  "created_time": "October 15, 2023, 07:53:21 AM",
  "content": "Dear Crypto Enthusiasts,We are thrilled to announce the grand opening of MAMEEX Cryptocurrency exchange, a cutting-edge platform designed to empower individuals and businesses in their journey through the exciting world of cryptocurrencies.======================https://www.mameex.com======================Why MAMEEX?At MAMEEX, we understand the importance of seamless and secure crypto trading. Our platform offers you:- Robust Security: Your safety is our top priority. We employ state-of-the-art security measures to safeguard your assets.- Wide Range of Cryptos: Access a diverse selection of cryptocurrencies, from Bitcoin and Ethereum to emerging altcoins, all under one roof. Decreasing withdrawal fees that we pay using multiple crypto exchanges.-User-Friendly Interface: Whether you're a seasoned trader or new to crypto, our intuitive interface ensures a hassle-free experience.- Lightning-Fast Transactions: Benefit from high-speed trading, ensuring your orders are executed swiftly and efficiently.- Customer Support: Our dedicated support team is available to assist you with any queries or concerns.Join Us for the Grand Opening!We invite you to be a part of our grand opening celebration. As a token of our appreciation, we are offering airdrops of MAMEEX currency to our first users who sign up and start trading with us. More on that later.How to Get Started:- Visit our website at https://www.mameex.com.- Sign up for a free account.- Complete the verification process. Only verified email and 2FA enabled is required. No KYC needed.- Fund your account and start trading.- Stay Connected!- Follow us on social media to stay updated on the latest news, promotions, and educational content related to cryptocurrencies.We are excited to embark on this crypto journey with you and look forward to providing you with a secure, user-friendly, and innovative trading platform. Welcome to the future of finance with MAMEEX!Sincerely,MAMEEX TeamUseful links:Website: https://www.mameex.com/Trading platform: https://www.mameex.com/trading/Fees: https://www.mameex.com/fees.htmlStatus: https://www.mameex.com/status.htmlSupport: https://mameex.ladesk.com/Terms of use: https://www.mameex.com/terms.htmlAPI: https://mameex.gitbook.io/mameex-api/MAMEEX Explorer: https://explorer.mameex.com/",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5470400",
  "comments": [
    {
      "author": "zmago",
      "created_time": "October 15, 2023, 08:33:34 AM",
      "body": "Sounds great, will check it out.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rat03gopoh",
      "created_time": "October 15, 2023, 09:32:38 AM",
      "body": "Quote from: mameex on October 15, 2023, 07:53:21 AMNo KYC needed.To what extent?QuoteFees:Withdrawal fees are quite competitive compared to other major exchanges.Are you based in Hong Kong?In terms of use, you limit users to certain ages and jurisdictions (but I don't see a list of restricted jurisdictions), how do you ensure that users don't violate these terms without asking for KYC?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mameex",
      "created_time": "October 15, 2023, 09:45:50 AM",
      "body": "Quote from: rat03gopoh on October 15, 2023, 09:32:38 AMQuote from: mameex on October 15, 2023, 07:53:21 AMNo KYC needed.To what extent?Verified email + 2FA must be enabled for address generation, trading and withdrawal.QuoteFees: Withdrawal fees are quite competitive compared to other major exchanges.Thanks.QuoteAre you based in Hong Kong?In terms of use, you limit users to certain ages and jurisdictions (but I don't see a list of restricted jurisdictions), how do you ensure that users don't violate these terms without asking for KYC?Cyprus.I can understand your concern. We have implemented few securty features to prevent users from generating fake volume and trades. If there is going to be large number of violations we would be forced to use phone number verification using twillio.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "October 15, 2023, 11:12:39 AM",
      "body": "It is hard to believe that there is a centralized platform with a commercial license in Cyprus that does not require identity verification. You can say that you are allowed to withdraw up to 100 Bitcoins per day without us asking for your data.Why would you ask to verify the account with a phone number? It is easy to obtain hundreds of phone numbers for very small amounts.Do you have reserves or do you work as a front for central platforms like Binance?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mameex",
      "created_time": "October 15, 2023, 11:37:17 AM",
      "body": "Quote from: hugeblack on October 15, 2023, 11:12:39 AMIt is hard to believe that there is a centralized platform with a commercial license in Cyprus that does not require identity verification. You can say that you are allowed to withdraw up to 100 Bitcoins per day without us asking for your data.Why would you ask to verify the account with a phone number? It is easy to obtain hundreds of phone numbers for very small amounts.Do you have reserves or do you work as a front for central platforms like Binance?Yes, you are correct. Our goal is to provide a service primarily for miners and mining pool operators, making it more convenient for them to sell their coins without the hassle of using multiple exchanges and incurring withdrawal fees. We don't anticipate a significant volume of Bitcoin being traded that would necessitate mandatory KYC requirements. - For now. What future holds if anything, we don't know.Quote from: hugeblack on October 15, 2023, 11:12:39 AMIt is easy to obtain hundreds of phone numbers for very small amounts.While the ease of obtaining phone numbers is a potential vulnerability, it's important to emphasize that effective security protocols encompass multiple layers of protection and to prevent it, a comprehensive security strategy involves various undisclosed measures and safeguards.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JeromeTash",
      "created_time": "October 15, 2023, 12:35:02 PM",
      "body": "Reading through your terms of service. I was curious to know what kind of data you collect from your customers and how you handle the data, but then I saw thisQuote4. Privacy PolicyPlease refer to our Privacy Policy for information about how we collect, use and share your information.And then I hit a dead end because I don't see any link to your privacy policy anywhere on your site?Could you please provide us with your privacy policy?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mameex",
      "created_time": "October 15, 2023, 01:55:02 PM",
      "body": "Quote from: JeromeTash on October 15, 2023, 12:35:02 PMReading through your terms of service. I was curious to know what kind of data you collect from your customers and how you handle the data, but then I saw thisQuote4. Privacy PolicyPlease refer to our Privacy Policy for information about how we collect, use and share your information.And then I hit a dead end because I don't see any link to your privacy policy anywhere on your site?Could you please provide us with your privacy policy?Yes, sorry for confusion. https://www.mameex.com/privacy.html or https://www.mameex.com/privacy.pdf.We do not store any data except for email account, password, login ip that only you can see in profile history. All of sensitive data like password and login ip is encrypted using: https://www.vaultproject.io",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "October 15, 2023, 02:29:52 PM",
      "body": "Quote from: mameex on October 15, 2023, 11:37:17 AMYes, you are correct. Our goal is to provide a service primarily for miners and mining pool operators, making it more convenient for them to sell their coins without the hassle of using multiple exchanges and incurring withdrawal fees. We don't anticipate a significant volume of Bitcoin being traded that would necessitate mandatory KYC requirements. - For now. What future holds if anything, we don't know.If I understood you correctly, your service is to provide liquidity to OTCs to sell their Bitcoin holdings. If that is correct, then I think you have understood it wrong. These markets are highly regulated and subject to oversight, so KYC is not a priority.If so, I do not think that a mining pool will sell you an amount of 1 Bitcoin, which represents an amount higher than the money laundering reward limits, which means that you are forced to ask users for their data.Miners and mining pool operators sell for amounts of at least $50,000.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mameex",
      "created_time": "October 15, 2023, 03:57:33 PM",
      "body": "Quote from: hugeblack on October 15, 2023, 02:29:52 PMQuote from: mameex on October 15, 2023, 11:37:17 AMYes, you are correct. Our goal is to provide a service primarily for miners and mining pool operators, making it more convenient for them to sell their coins without the hassle of using multiple exchanges and incurring withdrawal fees. We don't anticipate a significant volume of Bitcoin being traded that would necessitate mandatory KYC requirements. - For now. What future holds if anything, we don't know.If I understood you correctly, your service is to provide liquidity to OTCs to sell their Bitcoin holdings. If that is correct, then I think you have understood it wrong. These markets are highly regulated and subject to oversight, so KYC is not a priority.If so, I do not think that a mining pool will sell you an amount of 1 Bitcoin, which represents an amount higher than the money laundering reward limits, which means that you are forced to ask users for their data.Miners and mining pool operators sell for amounts of at least $50,000.We have our own small-scale mining operation, and over the past two years, we have never sold a combined total of $50,000 worth of any altcoin. When mining pools reach or approach a combined limit of $50,000 in transactions, we will offer guidance and support to assist them. Where the threshold is met, we will require mining pools to complete KYC procedures. Ensuring compliance with KYC regulations is an important step to maintain transparency and security in our operations. From a technical standpoint, we have a solution in place; however, at the moment, the feature is disabled because there has been no one even close to reaching that transaction amount. We are prepared to activate this solution when and if the need arises, ensuring that we can effectively address compliance requirements and maintain the security of our operations.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Darker45",
      "created_time": "October 16, 2023, 02:05:09 AM",
      "body": "I'm curious, since you mentioned that one of your great features is \"Lightning-Fast Transactions,\" do you happen to support transactions on the Lightning network?You've bolded the \"No KYC needed\" part, apparently putting strong emphasis on it, but what does the phrase \"we may process personal information depending on how you interact with us and the Services, the choices you make, and the products and features you use\" in your privacy policy mean?You also indicated that you \"do not process sensitive personal information,\" such as? And since you're compliant with the laws, what happens if you're legally required to collect KYC information and share them to authorities? You'd change policy right away, yes?In the event that an account owner forgets his/her password and lost access to the account, what would the process be in order to recover it? Would it be a simple email providing the lost password? What kind of verification would you perform?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mameex",
      "created_time": "October 16, 2023, 08:39:13 AM",
      "body": "Quote from: Darker45 on October 16, 2023, 02:05:09 AMI'm curious, since you mentioned that one of your great features is \"Lightning-Fast Transactions,\" do you happen to support transactions on the Lightning network?While Lightning-Fast Transactions are indeed one of the exciting features we're working on, it's essential to clarify that our support for transactions on the Lightning network is still in the early development stages. At this point, it's not yet available for public use. It's important to note that internal  transfers between Mameex accounts are instant. We're committed to continuously enhancing our services and expanding our offerings to provide you with a seamless and efficient experience.Quote from: Darker45 on October 16, 2023, 02:05:09 AMYou've bolded the \"No KYC needed\" part, apparently putting strong emphasis on it, but what does the phrase \"we may process personal information depending on how you interact with us and the Services, the choices you make, and the products and features you use\" in your privacy policy mean?We want to emphasize our commitment to providing a no-KYC experience for our users, as we believe in promoting as much anonymity as possible when using cryptocurrency-related services. The clause you've mentioned from our privacy policy is in place to ensure that, in certain circumstances, we reserve the option to process personal information on a case-by-case basis. This would typically occur when we have reason to suspect any misconduct, such as the presence of multiple accounts, potential market manipulation, or other activities that could be detrimental to the platform's integrity. Our goal is to strike a balance between respecting user privacy and maintaining the security and trustworthiness of our services, and this provision allows us to do just that when necessary.Quote from: Darker45 on October 16, 2023, 02:05:09 AMYou also indicated that you \"do not process sensitive personal information,\" such as? And since you're compliant with the laws, what happens if you're legally required to collect KYC information and share them to authorities? You'd change policy right away, yes?We hold a steadfast commitment to safeguarding your privacy and maintaining a minimal data collection approach. When we mention that we \"do not process sensitive personal information,\" it essentially means that we abstain from gathering highly sensitive data, like social security numbers or passport details. The only information we do collect is the essentials required for account registration and security measures, which include your email, password, 2FA, and IP address. Furthermore, we take your data security seriously and utilize encryption via a trusted solution like https://www.vaultproject.io/ to ensure the utmost protection. In the unlikely scenario where legal obligations necessitate the collection of KYC information and its sharing with authorities, rest assured that we would proceed with transparency and responsibility. Any policy adjustments would not be made abruptly. We would provide ample notice to our users, allowing them sufficient time to adapt to the changes. It's important to note that we have developed the technical infrastructure for such situations using https://kycaid.com/, ensuring that we do not store any KYC data directly. Our aim is to keep you well-informed and involved in any policy changes required by legal compliance, all while maintaining our dedication to your data security and privacy.Quote from: Darker45 on October 16, 2023, 02:05:09 AMIn the event that an account owner forgets his/her password and lost access to the account, what would the process be in order to recover it? Would it be a simple email providing the lost password? What kind of verification would you perform?We've designed a user-friendly process to help account owners recover their accounts in the event of a forgotten password or loss of access. To initiate the recovery process, users can simply utilize the password recovery option on our website. Once triggered, an email will be sent containing a one-time token, allowing users to reset their password securely. It's worth noting that if an account is protected with 2FA, users will need to provide the 2FA information when creating their new password. In cases where access to 2FA is lost, such as due to a new phone or a lost device, we have a dedicated support channel to assist. In such instances, you'll be required to provide additional information to verify your identity, ensuring the utmost security and protection of your account.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Darker45",
      "created_time": "October 18, 2023, 01:35:41 AM",
      "body": "Quote from: mameex on October 16, 2023, 08:39:13 AM~snip~Please correct me if I'm wrong. If I may rephrase your answer, you're saying that you are committed to providing a no-KYC experience for your users. However, cases may arise in which you're left with no choice but to collect personal information. That may include names, addresses, phone numbers, IDs, pictures, and the like. It's because users' privacy isn't the only thing that matters; you also need to make sure that security and trustworthiness of your service are protected. There are also \"unlikely scenario where legal obligations necessitate the collection of KYC information and its sharing with authorities.\" But you don't keep these KYC data to yourself because you're using the services of KYCAID.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mameex",
      "created_time": "October 18, 2023, 08:10:34 AM",
      "body": "Quote from: Darker45 on October 18, 2023, 01:35:41 AMQuote from: mameex on October 16, 2023, 08:39:13 AM~snip~Please correct me if I'm wrong. If I may rephrase your answer, you're saying that you are committed to providing a no-KYC experience for your users. However, cases may arise in which you're left with no choice but to collect personal information. That may include names, addresses, phone numbers, IDs, pictures, and the like. It's because users' privacy isn't the only thing that matters; you also need to make sure that security and trustworthiness of your service are protected. There are also \"unlikely scenario where legal obligations necessitate the collection of KYC information and its sharing with authorities.\" But you don't keep these KYC data to yourself because you're using the services of KYCAID.You are correct. It's important to note that this exchange does not offer fiat trading options, meaning you cannot directly trade traditional currencies like US dollars, euros, or other fiat currencies on this platform. Instead, you can typically trade cryptocurrencies against one another or use other cryptocurrencies as a base trading pair.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rat03gopoh",
      "created_time": "October 18, 2023, 09:10:44 AM",
      "body": "Quote from: mameex on October 15, 2023, 09:45:50 AMCyprus.I read that the Hong Kong was mentioned twice, so what does this have to do with your Cyprus license?QuoteYou and MAMEEX agree to arbitrate any dispute arising from these Terms or your use of the Services,except for disputes in which either party seeks equitable and other relief for the alleged unlawful useof copyrights, trademarks, trade names, logos, trade secrets or patents. ARBITRATION PREVENTS YOUFROM SUING IN COURT OR FROM HAVING A JURY TRIAL. You and MAMEEX agree to notify each otherin writing of any dispute within thirty (30) days of when it arises. Notice to MAMEEX shall be sent toinfo@mameex.com. You and MAMEEX further agree: (a) to attempt informal resolution prior to anydemand for arbitration; (b) that arbitration will occur in the Hong Kong Court of InternationalArbitration; (c) that arbitration will be conducted confidentially. Other than class procedures andremedies discussed below, the arbitrator has the authority to grant any remedy that would otherwisebe available in court. Any dispute between the parties will be governed by these Terms and the lawsof Hong Kong, without giving effect to any conflict of laws principles that may provide for theapplication of the law of another jurisdiction. Whether the dispute is heard in arbitration or in court,you and MAMEEX will not commence against the other a class action, class arbitration orrepresentative action or proceeding.QuoteI can understand your concern. We have implemented few securty features to prevent users from generating fake volume and trades. If there is going to be large number of violations we would be forced to use phone number verification using twillio.That doesn't answer my question about restricted age and jurisdiction, I think trading volume isn't the right parameter to determine someone has violated the terms of use. Apart from that, can you just mention the list of jurisdictions?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mameex",
      "created_time": "October 18, 2023, 09:30:59 AM",
      "body": "Quote from: rat03gopoh on October 18, 2023, 09:10:44 AMQuote from: mameex on October 15, 2023, 09:45:50 AMCyprus.I read that the Hong Kong was mentioned twice, so what does this have to do with your Cyprus license?QuoteYou and MAMEEX agree to arbitrate any dispute arising from these Terms or your use of the Services,except for disputes in which either party seeks equitable and other relief for the alleged unlawful useof copyrights, trademarks, trade names, logos, trade secrets or patents. ARBITRATION PREVENTS YOUFROM SUING IN COURT OR FROM HAVING A JURY TRIAL. You and MAMEEX agree to notify each otherin writing of any dispute within thirty (30) days of when it arises. Notice to MAMEEX shall be sent toinfo@mameex.com. You and MAMEEX further agree: (a) to attempt informal resolution prior to anydemand for arbitration; (b) that arbitration will occur in the Hong Kong Court of InternationalArbitration; (c) that arbitration will be conducted confidentially. Other than class procedures andremedies discussed below, the arbitrator has the authority to grant any remedy that would otherwisebe available in court. Any dispute between the parties will be governed by these Terms and the lawsof Hong Kong, without giving effect to any conflict of laws principles that may provide for theapplication of the law of another jurisdiction. Whether the dispute is heard in arbitration or in court,you and MAMEEX will not commence against the other a class action, class arbitration orrepresentative action or proceeding.It appears that an older version of the terms of service was inadvertently released. I appreciate your keen observation and will address this promptly. Thank you for bringing this to my attention.QuoteQuoteI can understand your concern. We have implemented few securty features to prevent users from generating fake volume and trades. If there is going to be large number of violations we would be forced to use phone number verification using twillio.That doesn't answer my question about restricted age and jurisdiction, I think trading volume isn't the right parameter to determine someone has violated the terms of use. Apart from that, can you just mention the list of jurisdictions?18. Cyprus. It is not the traditional volume resulting from one person buying from another. Rather, it's a case of the same individual creating two accounts and engaging in self-trading to generate fake volume, which amounts to market manipulation. Republic of Cyprus - Cyprus is a sovereign nation and does not have \"jurisdictions\" within the country like federal states or provinces. Instead, it is divided into administrative regions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}