{
  "id": "topic_5447975",
  "title": "Ultegra134",
  "author": "Ultegra134",
  "created_time": "April 07, 2023, 08:01:42 PM",
  "content": "I'm away from home and will be for the next few months, and I won't have access to my computer, but I want to continue staking and investing during this period. So far, I've been using Binance savings and staking because their mobile application is convenient, easy, and relatively safe. However, the yield has tremendously decreased while it's centralised, so it would be best to move to a decentralized platform, such as Beefy. I used to use the Metamask extension and had no issues; however, how safe and reliable is it to use through my phone?I tried to see what wallet is compatible with Beefy through my phone, and it only features WalletConnect, Coinbase wallet, and CDC Connect, with none of which I have any experience. I could possibly start staking from my computer now that I'm back home, but leaving coins staked on a decentralized platform without any monitoring isn't the safest option.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5447975",
  "comments": [
    {
      "author": "disconnectme",
      "created_time": "April 07, 2023, 08:10:45 PM",
      "body": "The most important thing is to protect your fund, a bird at hand is better than thousands of birds in the forest. The protection and security level of mobile phones is still weak as compared to the PC. I will advise you to stake on centralized staking service than Decentralised during this period because in a place like Binance you know for sure that your funds are SAFU the way CZ used to put it but on DEX you are on your own. Just weigh the risk and the reward before taking any decision, you can't lose many rewards from 2 weeks' absence from your PC",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "decodx",
      "created_time": "April 07, 2023, 08:59:10 PM",
      "body": "Quote from: Ultegra134 on April 07, 2023, 08:01:42 PM<...>I tried to see what wallet is compatible with Beefy through my phone, and it only features WalletConnect, Coinbase wallet, and CDC Connect, with none of which I have any experience. WalletConnect is not a wallet, but an open source protocol for connecting decentralized applications to mobile wallets with QR code scanning or deep linking. source: https://walletconnect.com/You can find a list of supported wallets here: https://explorer.walletconnect.com/?type=wallet",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ultegra134",
      "created_time": "April 07, 2023, 09:22:31 PM",
      "body": "Quote from: disconnectme on April 07, 2023, 08:10:45 PMThe most important thing is to protect your fund, a bird at hand is better than thousands of birds in the forest. The protection and security level of mobile phones is still weak as compared to the PC. I will advise you to stake on centralized staking service than Decentralised during this period because in a place like Binance you know for sure that your funds are SAFU the way CZ used to put it but on DEX you are on your own. Just weigh the risk and the reward before taking any decision, you can't lose many rewards from 2 weeks' absence from your PCThis is the main reason I'm still using Binance, I probably wouldn't if I had access to a computer, but that's a different story. I won't have access to my computer for more than 4 months, I wouldn't bother if it was for such a short time period, I mentioned for a couple of months in my starting post, I wish it was for just a few weeks.Quote from: decodx on April 07, 2023, 08:59:10 PMQuote from: Ultegra134 on April 07, 2023, 08:01:42 PM<...>I tried to see what wallet is compatible with Beefy through my phone, and it only features WalletConnect, Coinbase wallet, and CDC Connect, with none of which I have any experience. WalletConnect is not a wallet, but an open source protocol for connecting decentralized applications to mobile wallets with QR code scanning or deep linking. source: https://walletconnect.com/You can find a list of supported wallets here: https://explorer.walletconnect.com/?type=walletThanks, I literally have no idea, I've only used the Metamask extension and never bothered with anything else in the past. It's a complete different occasion this time and I'm clueless. Would you advise against staking through an Android phone?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JeromeTash",
      "created_time": "April 07, 2023, 09:58:52 PM",
      "body": "1. Never use a centralized platform to stake your coins. You could wake up tomorrow and Binance is no more. I hope you remember what happened to the different staking platforms such as Block Fi, Celsius, and even FTX2. To some degree, staking on a mobile phone using a decentralized platform is much safer than using a centralized platform, so long as you safely keep for seeds.Wallet connect is actually compatible with so many noncustodial wallets, including trust wallet.If you have a lot of money, buy a hardware wallet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lobo13hf",
      "created_time": "April 07, 2023, 11:52:49 PM",
      "body": "I'd say you should generate an address in which you back up your private key into your computer so that if you accidentally got metamask in your mobile error you can just recover it, after all from my experience using metamask in mobile phone seems really buggy in which I don't recommend but actually many has used metamask in their phone for long and fine with it anyway.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "socks435",
      "created_time": "April 08, 2023, 12:33:13 AM",
      "body": "If your problem is to watch your PC at home while you are away or far from your home you can use chrome remote desktop I already tested this to my mining rigs. The only problem is if my mining rig crash due to overheating even the rig restart and run normally again the chrome remote desktop app cant connect but yours is different you are staking so this thing should work to you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LogitechMouse",
      "created_time": "April 08, 2023, 03:37:28 AM",
      "body": "Quote from: Ultegra134 on April 07, 2023, 08:01:42 PMI'm away from home and will be for the next few months, and I won't have access to my computer, but I want to continue staking and investing during this period. So far, I've been using Binance savings and staking because their mobile application is convenient, easy, and relatively safe. However, the yield has tremendously decreased while it's centralised, so it would be best to move to a decentralized platform, such as Beefy. I used to use the Metamask extension and had no issues; however, how safe and reliable is it to use through my phone?I tried to see what wallet is compatible with Beefy through my phone, and it only features WalletConnect, Coinbase wallet, and CDC Connect, with none of which I have any experience. I could possibly start staking from my computer now that I'm back home, but leaving coins staked on a decentralized platform without any monitoring isn't the safest option.Staking thru your computer is always the safest option.If you can't use your computer because you're away from months, I guess staking thru your phone isn't a good choice.On the other hand, why choosing to stake thru your mobile phone if you can do it in your computer, and even though you will not have an access to your computer, you can just stake your coins into the platform that's supported by that coin, and let it grow. I mean you don't need to see it very often. Just put your coins there, and let it sit. I don't know if I will agree with you in the part where not monitoring isn't the safest option. I'm currently staking ADA coins, and there was a time where I can't visit their decentralized platform where I put my coins for I think 6 months because of lack of space in my computer (Daedalus is eating lots of space in my disk drive), and because of that, I saved some money to upgrade, and bought a SSD with more space. I opened it after 6 months, and nothing changed aside from the fact that I got more ADA now because I staked it there.Not having an access to your computer isn't mean you need to convert, and use your mobile phone and stake. Safety is the primary option still, and you don't need to constantly visit your computer if you are staking. I rarely open my Daedalus software (where I stake my ADA). I think once every 2-3 months just to visit whether my coins are still there, and earning or not anymore.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Apocollapse",
      "created_time": "April 08, 2023, 08:47:23 AM",
      "body": "Quote from: disconnectme on April 07, 2023, 08:10:45 PMI will advise you to stake on centralized staking service than Decentralised during this period because in a place like Binance you know for sure that your funds are SAFU the way CZ used to put it but on DEX you are on your own. Just weigh the risk and the reward before taking any decision, you can't lose many rewards from 2 weeks' absence from your PCSAFU doesn't make your funds completely 100% safe, Binance SAFU has a limit, it's not an unlimited money or they have bigger funds than all money from their customers. If Binance got hacked and the hacker can steal all of the money, CZ can't made a refund since they're in lost. But it doesn't mean decentralized apps is more safer than centralized platform, decentralization in altcoins mostly less decentralized and the security is weak.Quote from: JeromeTash on April 07, 2023, 09:58:52 PMIf you have a lot of money, buy a hardware wallet.Depends on a lot of money you refers, but it's not really need to wait until he have a lot money because reputable hardware wallet only cost around $50-$100.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Similificator",
      "created_time": "April 08, 2023, 10:15:25 AM",
      "body": "First thing I would want to know is if you are in some kind of a rush and have a need to really stake your holdings. If so, then a little risk wouldn't hurt, just never forget to take proper measures to ensure that you are being cautious enough with how you use your phone to stake. Would even be better if you have an extra phone that is mainly used on crypto or crypto wallet related stuff. And about wallets and platforms, read on at least a few of them first to find the ones that would suit your taste or would make you feel the most comfort on using. Now, if it really isn't that urgent, then I suggest you take a time off of your crypto and focus on things other than your holdings. It won't hurt to take breaks if circumstances makes it difficult for you to engage on your cypto related stuff. Plus, you wouldn't have to take unnecessary risks that could endanger your crypto holdings. Well, whichever you decide to do, hope you don't lose anything and gain more instead, good luck.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "swogerino",
      "created_time": "April 08, 2023, 10:24:25 AM",
      "body": "Quote from: Ultegra134 on April 07, 2023, 08:01:42 PMI'm away from home and will be for the next few months, and I won't have access to my computer, but I want to continue staking and investing during this period. So far, I've been using Binance savings and staking because their mobile application is convenient, easy, and relatively safe. However, the yield has tremendously decreased while it's centralised, so it would be best to move to a decentralized platform, such as Beefy. I used to use the Metamask extension and had no issues; however, how safe and reliable is it to use through my phone?I tried to see what wallet is compatible with Beefy through my phone, and it only features WalletConnect, Coinbase wallet, and CDC Connect, with none of which I have any experience. I could possibly start staking from my computer now that I'm back home, but leaving coins staked on a decentralized platform without any monitoring isn't the safest option.Staking from home is the best option.I use a non custodial wallet meaning I have full access in my funds like Atomic wallet is and I use that platform to stake Zilliqas but it supports another 20-30 cryptocurrencies for staking so you can check their website at atomicwallet.io and see for yourself.This way as long as you have the 12 word seeds safely safeguarded somewhere you can safely be away from your computer for months and nothing will happen to your funds.I never agree to keep a lot of funds in a centralized exchange like Binance is no matter how reputable they are as they are still a third party.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MAAManda",
      "created_time": "April 08, 2023, 11:12:51 AM",
      "body": "Quote from: Ultegra134 on April 07, 2023, 08:01:42 PMI tried to see what wallet is compatible with Beefy through my phone, and it only features WalletConnect, Coinbase wallet, and CDC Connect, with none of which I have any experience. I could possibly start staking from my computer now that I'm back home, but leaving coins staked on a decentralized platform without any monitoring isn't the safest option.If you are faced with the choice of having to stake from your phone at Beefy Finance again, you need to first install Trust Wallet, mate. Then for the connect option you can choose WalletConnect. Trust me, it's completely safe (At least until now). But I don't recommend it if the value of the asset you want to stake is a large value. For me, it would be better staking on CEX platform than DEX if the value of the asset I want to stake is large value for me (Although with small interest).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sunsilk",
      "created_time": "April 08, 2023, 11:31:55 AM",
      "body": "How long are you gonna be away from home? I have been hearing a lot with both actually but more with decentralized platforms and I don't want to trust neither of them.Binance staking keeps on decreasing its percentage because of many users that do trust them. However, just as the decentralized platforms , they are not safe too because you do not hold the keys while decentralized platforms they are targets by most hackers.I'll choose to keep it to a wallet first where I have full control if I go somewhere else. I wouldn't even trust my mobile on keeping in either.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "traderethereum",
      "created_time": "April 08, 2023, 01:39:19 PM",
      "body": "If you don't feel safe leaving your coins on any exchange, you should withdraw all your coins to a more secure wallet such as a hardware wallet and leave them at home.And if you also don't feel safe leaving your coins on a decentralized exchange, you should also withdraw all your coins from a decentralized exchange.It will be safer for you that out of the house for a few months than worry about your coins sitting on a centralized and decentralized exchange.But you can also look for wallets that support decentralized exchanges so you can monitor the movement of your coins on the decentralized exchange via your phone while away from home.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "April 08, 2023, 01:51:11 PM",
      "body": "Staking is not mining, but rather the use of a POS protocol or CEXs, in PoS you are using your money to guarantee the network and in CEXs/DEXs your money used for liquidity and you gain a return for that.Therefore, it does not make a difference if you use it on a phone or a computer, although some sites may not look perfect on the phone.The problem does not lie in the device, but in the staking itself. If the currency does not support the Proof of Stake protocol, then it uses a centralized platform in one way or another, even if it claims to be decentralized.The currencies that work on the Proof of Stake protocol are Ethereum, Cardano, and others.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kaseygriffin",
      "created_time": "April 08, 2023, 02:48:34 PM",
      "body": "This is also difficult to assess as the point of view of risks and benefits with which we look at these products may not be the same. I immediately see as my own use, I don't trust some of the top CEXs like binance, okex, houbi,... but as you also know some events have since happened in the market that made many people lose money trusting CEX. And similarly DeFi platforms do not guarantee absolute security, so being flexible in the market through devices that support computers and phones is not a problem that I find difficult to reach. I have a laptop and several mobile devices, so being on the go is always handy when in the market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ultegra134",
      "created_time": "April 08, 2023, 06:04:58 PM",
      "body": "Quote from: LogitechMouse on April 08, 2023, 03:37:28 AMQuote from: Ultegra134 on April 07, 2023, 08:01:42 PMI'm away from home and will be for the next few months, and I won't have access to my computer, but I want to continue staking and investing during this period. So far, I've been using Binance savings and staking because their mobile application is convenient, easy, and relatively safe. However, the yield has tremendously decreased while it's centralised, so it would be best to move to a decentralized platform, such as Beefy. I used to use the Metamask extension and had no issues; however, how safe and reliable is it to use through my phone?I tried to see what wallet is compatible with Beefy through my phone, and it only features WalletConnect, Coinbase wallet, and CDC Connect, with none of which I have any experience. I could possibly start staking from my computer now that I'm back home, but leaving coins staked on a decentralized platform without any monitoring isn't the safest option.Staking thru your computer is always the safest option.If you can't use your computer because you're away from months, I guess staking thru your phone isn't a good choice.On the other hand, why choosing to stake thru your mobile phone if you can do it in your computer, and even though you will not have an access to your computer, you can just stake your coins into the platform that's supported by that coin, and let it grow. I mean you don't need to see it very often. Just put your coins there, and let it sit. I don't know if I will agree with you in the part where not monitoring isn't the safest option. I'm currently staking ADA coins, and there was a time where I can't visit their decentralized platform where I put my coins for I think 6 months because of lack of space in my computer (Daedalus is eating lots of space in my disk drive), and because of that, I saved some money to upgrade, and bought a SSD with more space. I opened it after 6 months, and nothing changed aside from the fact that I got more ADA now because I staked it there.Not having an access to your computer isn't mean you need to convert, and use your mobile phone and stake. Safety is the primary option still, and you don't need to constantly visit your computer if you are staking. I rarely open my Daedalus software (where I stake my ADA). I think once every 2-3 months just to visit whether my coins are still there, and earning or not anymore. It's not necessarily a safety issue, but a combination of several matters that concern me about leaving my coins unmonitored. The first and least important, since safety of funds is always the number one priority, is that the vault I choose may no longer be profitable after a few weeks. Another issue I had faced in the past was that one of the vaults I was using to stake was discontinued, while others had suffered exploits, such as Iron.Finance.Quote from: sunsilk on April 08, 2023, 11:31:55 AMHow long are you gonna be away from home? I have been hearing a lot with both actually but more with decentralized platforms and I don't want to trust neither of them.Binance staking keeps on decreasing its percentage because of many users that do trust them. However, just as the decentralized platforms , they are not safe too because you do not hold the keys while decentralized platforms they are targets by most hackers.I'll choose to keep it to a wallet first where I have full control if I go somewhere else. I wouldn't even trust my mobile on keeping in either.For at least four months. I used to use Binance savings for stablecoins; it started at 10% for up to $2,000, and now it has decreased to 3-4% at best. I don't trust either type of platform; both have their benefits and drawbacks, but Binance is at least quite convenient to use.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sunsilk",
      "created_time": "April 09, 2023, 09:13:11 AM",
      "body": "Quote from: Ultegra134 on April 08, 2023, 06:04:58 PMQuote from: sunsilk on April 08, 2023, 11:31:55 AMHow long are you gonna be away from home? I have been hearing a lot with both actually but more with decentralized platforms and I don't want to trust neither of them.Binance staking keeps on decreasing its percentage because of many users that do trust them. However, just as the decentralized platforms , they are not safe too because you do not hold the keys while decentralized platforms they are targets by most hackers.I'll choose to keep it to a wallet first where I have full control if I go somewhere else. I wouldn't even trust my mobile on keeping in either.For at least four months. I used to use Binance savings for stablecoins; it started at 10% for up to $2,000, and now it has decreased to 3-4% at best. I don't trust either type of platform; both have their benefits and drawbacks, but Binance is at least quite convenient to use.Yeah, I have seen that percentage before because it was considered high and very enticing.I understand why it is being liked by many and even it is a centralized platform and have been decreasing the APY for it on interest accounts like USDT staking because as you have said, it is convenient.Did you checked Abra? That is the another platform where I am interested in putting my USDT because it offers compound interest and 10% for USDT and for other stable coins, 7%.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "April 09, 2023, 03:46:38 PM",
      "body": "They only got 2.37% from the binance saving app. Actually thats a little bit lower no matter what you see it. For sure there are better rates on staking or joining farm on pancakeswap than this. But the only thing you need to worry is the safety of your asset on dex too. Plus the inflation or the impermanent loss youll experience on farming. Im not sure though if there is a single stakingfor bifi but maybe the rate wouldnt be that far from Binance maybe.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ultegra134",
      "created_time": "April 09, 2023, 05:58:03 PM",
      "body": "Quote from: sunsilk on April 09, 2023, 09:13:11 AMQuote from: Ultegra134 on April 08, 2023, 06:04:58 PMQuote from: sunsilk on April 08, 2023, 11:31:55 AMHow long are you gonna be away from home? I have been hearing a lot with both actually but more with decentralized platforms and I don't want to trust neither of them.Binance staking keeps on decreasing its percentage because of many users that do trust them. However, just as the decentralized platforms , they are not safe too because you do not hold the keys while decentralized platforms they are targets by most hackers.I'll choose to keep it to a wallet first where I have full control if I go somewhere else. I wouldn't even trust my mobile on keeping in either.For at least four months. I used to use Binance savings for stablecoins; it started at 10% for up to $2,000, and now it has decreased to 3-4% at best. I don't trust either type of platform; both have their benefits and drawbacks, but Binance is at least quite convenient to use.Yeah, I have seen that percentage before because it was considered high and very enticing.I understand why it is being liked by many and even it is a centralized platform and have been decreasing the APY for it on interest accounts like USDT staking because as you have said, it is convenient.Did you checked Abra? That is the another platform where I am interested in putting my USDT because it offers compound interest and 10% for USDT and for other stable coins, 7%.Yeah, it was great, but it didn't last long; it was short lived. It has constantly been decreasing; even when a new option comes up, the APY crashes in the following days. I added liquidity to USDC/USDT a few days ago, with an APY of 9%; two days later, it's down to 4%. I haven't heard of Abra but will definitely check it out, thanks!Quote from: cryptoaddictchie on April 09, 2023, 03:46:38 PMThey only got 2.37% from the binance saving app. Actually thats a little bit lower no matter what you see it. For sure there are better rates on staking or joining farm on pancakeswap than this. But the only thing you need to worry is the safety of your asset on dex too. Plus the inflation or the impermanent loss youll experience on farming. Im not sure though if there is a single stakingfor bifi but maybe the rate wouldnt be that far from Binance maybe. Binance's options are pretty poor and out of competition if you ask me. DEX offers some pretty decent returns, but I'm worried about the safety of my funds with me being away.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}