{
  "id": "topic_5446511",
  "title": "Laurent-Finance",
  "author": "Laurent-Finance",
  "created_time": "March 27, 2023, 04:36:54 PMLast edit: March 30, 2023, 12:04:38 PM by Laurent-Finance",
  "content": "##################################We are a team of 5 veteran crypto & finance software engineers who have worked for 4000+ collective hours since April 2022on building a new and vastly different large scale crypto exchange from the ground up,with a capacity for millions of concurrent traders and high performance algotrading clients.This is a serious massive no-KYC, 0% trading fee, 0% spread fee, social crypto exchange,with 550+ trading pairs, plus a microsecond-latency engine.Laurent Finance has no trading fees of any kind.It has no hidden fees. This means no spread fees, conversion fees, number rounding fees, etc.,even for 100% free users.Our source of income is paying customers and investors, who pay for features such as HFT access,and unlimited 0% fee withdrawals. This is how a feeless exchange should function financially.https://i.postimg.cc/0j0Kp2F9/ss1.png##################################Some of you are likely thinking that this sounds too good to be true. If you think more about it, it was only a matter of time before people developed this highly demanded kind of exchange. Millions of people want a completely feeless exchange where users are treated with human decency. Since there is a high demand for such a platform, it will be made, even if it takes thousands of hours to put together both financially and technically.We have designed the highest performance HFT capable matching engine architecture for any cryptocurrency exchange in the world, enabling our users to each complete 2,000+ trades/second 24/7, and giving talented people global access to a large variety of financial opportunities every day. Additionally our matching engine, written in 100% C, is more efficient than other crypto exchanges' software, which reduces our server costs tremendously, allowing us to give our customers better deals for the features they want.This is an exchange with social features, meaning we have created a community environment surrounding the exchange, instead of the usual impersonal and isolated feeling people get while they're on an exchange. There is a global live chat for networking with other traders, plus an active subreddit where our team is personally active every day to answer questions and have conversations. Our goal is to become the largest and most useful trading community in the world.We don't offer any kind of staking. Intelligent investing and trading is always superior to centralized staking (\"free money\" / inflation with more steps). This explains why people like Jim Simons are called billionaire traders, not billionaire stakers. We don't offer lending/borrowing, or run fractional reserve banking, and our reserves are public. We can survive bank runs without an issue since all deposits are stored 1:1.Crypto technology has very large untapped potential, but crypto is only as strong as its weakest link, and the weakest link today is the exchange industry. If we want a chance for crypto to grow again like it did in 2021, we need to stop holding it back with complicated and expensive entry applications. When beginners like your uncle sign up on Coinbase, OpenSea, and most other crypto platforms, they swiftly lose several percent of their money in deposit, trading, and withdrawal fees - plus various other fees. To them it feels like they just threw their money into a hostile jungle. So it's no mystery why most people feel pushed away from crypto. If we take a long look at today's state of crypto applications, we see that the valuable high-tech invention called cryptocurrency has been covered in a big pile of trash: Trash meaning unattractive shortsighted applications designed to farm new users until they leave. In conclusion, thanks to today's crypto applications, new non-crypto people can't see the valuable pure technology buried inside the big wall of garbage platforms.On the bright side, crypto is what allows us to create financial platforms that are much better than institution-serving exchanges and trading platforms like Robinhood etc. (Instead of copying them, like we have been doing so far). Before crypto was invented, this was impossible. Competition was not allowed.Our exchange gives people internationally the easiest and fastest possible access to a large number of cryptocurrencies. Users can always withdraw their funds from our dedicated reserves, and talk directly to us and our community at any time with same-day human support. Your account will never get frozen for unclear or mysterious reasons such as sudden \"verification issues\", since we respect the right to refuse KYC. Any person anywhere on Earth can sign up and instantly start performing pure zero fee trading. Regular traders worldwide have gotten farmed by unacceptable fees on institutionally rigged/advantaged exchanges for decades, and now for the first time in history, thanks to a reality of financial independence made possible only by the invention of cryptocurrency technology, we can give regular people the ability to keep the all the money they earn from independent intelligent trading. This is a clear example showing how crypto can benefit individual people, like it was created to.As people who have strongly believed in decentralized crypto technology since 2015, we want to help repair the reputation and popularity of crypto that was set back thanks to the countless business disasters that happened in 2022, most notably the FTX exchange collapse as you know. We can tell you that crypto's reputation and popularity will only come back again when people start actively leaving/punishing all of the common shady and predatory \"services\" that in reality are just copying the old and dreadful financial platforms that crypto was created to improve - and when we start seeing them get replaced by the new generation of clearly user beneficial high quality crypto applications and services. That is the actual potential of crypto, which people haven't even seen yet, and we are working full time every day on building it.We have very high standards for this exchange. We prioritize fast withdrawals 24/7, fast same-day personal human customer support, including for all regular users, and we are personally active in our communities every day. We will regularly add new spot and derivatives pairs, and our goal is to achieve 1000+ trading pairs in 2023.We devote 5-10% of our monthly income to the Laurent Finance Insurance Fund (LFIF). The LFIF wallets comprise LC, BTC, ETH, and USDC. The fund is dedicated to emergencies.About number rounding fees: >99% of people don't know about number rounding fees, but when you trade on an exchange, there is rounding involved when the exchange performs numerical calculations related to your trade. The exchange will also directly round down your profit number values to a certain set of decimals, and round up the decimals of your losses, and then collect the difference into their own balance. These \"small\" hidden fees are enough to visibly degrade the results of your real profits and losses, and they add up over time while getting added on to the non-hidden trading fees you already pay. Our platform's internal financial number values are rounded naturally up/down, with 100 decimal precision, eliminating number rounding fees.##################################This has never been done before. A completely zero fee full-featured open exchange has never existed before in human history. It's overwhelmingly tempting for most people to just enforce lazy trading fees that automatically steal billions of dollars from people, even if it directly results in bigger losses and smaller profits for traders, and thus a broken, compromised exchange in reality. Naturally, institutional customers plus insiders always get private feeless privileges on all the exchanges you use today, which they use to trade against normal people. This is common practice on all exchanges, not a conspiracy theory. We have one goal, which is to create the world's best feeless exchange. That was our one and only goal since day 1: To show people the possibilities of crypto enabled financial freedom. At the end of the day we receive enough money from paying customers, investors, and supporters, so we have established strong incentives to be transparent and cooperative with our customers.This has been an extreme technical challenge, and we have spent a very large amount of our personal money and free time on developing and renting servers for this service, because we know it will benefit the millions of people who are currently forced to pay high fees on untrustworthy platforms that don't value them until they're gone. Other exchanges would have to radically improve in order to compete with us. We will start revealing our future projects in April 2023. Contact us to get involved.Today on March 30 2023 we're launching step by step instead of all at once, to onboard traders and allow the markets to become liquid, before the full featured launch starts on April 6.During bull markets, bear markets, crab markets, recessions, bubbles, 7 days a week, global markets contain a large variety of statistical opportunities to earn money, when you're allowed to create truly feeless long and short positions on many different assets, without trading limits.Our goal is to give talented regular people access to these opportunities.Thank you for reading. This service is a valuable upgrade for millions of people, and a large step forward for the future of crypto services and the standards we demand from them.##################################Laurent Finance,https://laurentfinance.com",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5446511",
  "comments": []
}