{
  "id": "topic_5447541",
  "title": "Buchi-88",
  "author": "Buchi-88",
  "created_time": "April 04, 2023, 11:48:45 AMLast edit: April 18, 2023, 02:24:32 PM by Buchi-88",
  "content": "Das ist eine Übersetzung vom Original Rumänischen Board, zusätzlich hat GazetaBitcoin es noch in Englisch übersetzt. Eventuell hilft es auch hier dem einem oder anderen auch wenn ich einige Aussagen mit DACH Bereich nicht decken, da bei uns sowieso besteuert, zusätzlich ist der Thread schon etwas älter.Autor: GazetaBitcoinOriginal Rumänisch: Guvernul vine! ANAF si DIICOT ii urmaresc pe traderiEnglische Übersetzung:  Governs are coming for traders!Der Thread wurde ursprünglich in der rumänischen Sektion des Forums gestartet, die Informationen sind aber auch in anderen Teilen des Forums relevant und sollte an so viele Menschen wie möglich weitergegeben werden, um Vorladungen durch die Behörden oder andere Strafverfolgungsmechanismen zu vermeiden.Es ist kein Witz.Nach einem Gespräch vor kurzem mit einem befreundeten Anwalt, der die Situation (von Händlern, die von der rumänischen Regierung verfolgt werden) erzählt hat. Genauer gesagt ermitteln die Behörden gegen einige seiner Mandanten, die sich erklären müssen wegen größerer Summen die auf ihr Bankkonto überwiesen wurden.Die Händler wandten sich an den Anwalt, weil sie nicht wussten wie sie ihre Handelseinnahmen rechtfertigen sollten. Der Anwalt hat um Hilfe gebeten, ob ihm GazetaBitcoin irgendwie helfen kann.Die grundsätzlich Situation hat sich in Rumänien verschlechtert, im Jahr 2019 wurde das Gesetzes 30/2910 verabschiedet. In diesem Gesetz geht es um die Besteuerung von Gewinnen, auch von Gewinnen aus Kryptowährungen, aber die Strafverfolgungsbehörden haben es nicht nur auf diejenigen abgesehen die keine Steuern zahlen. Sondern auch auf diejenigen, die große Summen auf ihre Bankkonten überwiesen haben.GazetaBitcoin hat zu seinem befreundeten Anwalt gesagt, dass er seine Kunden bitten könnte, alle möglichen Protokolle (Nachweise) von allen Kryptowährungsbörsen anzufordern um den Kauf- und Verkaufspreis zu belegen (sollte ja kein großes Problem darstellen). Eine andere Idee war, sich direkt an die Börsen zu wenden, die als Unternehmen agieren und denen es gesetzlich erlaubt ist, als Geldabwickler aufzutreten, und sie um Belege für die Transaktionen zu bitten. Da die meisten Börsen mittlerweile KYC und AML verwenden, sollten offizielle Dokumente kein Problem darstellen, wenn dies erforderlich ist.Sein Freund dankte ihm für den Vorschlag und sagte, er werde diese Methoden ausprobieren.TL;DR: Die Behörden kommen! Nehmt euch in Acht!GazetaBitcoin war noch nie ein Fan von zentralisierten Kryptowährungsbörsen, da sie genau das Gegenteil der Ideen hinter Bitcoin verkörpern: Dezentralisierung und Pseudonymität. Und wenn jeder Bitcoin und die anderen Kryptowährungen anstelle von Fiat-Geld verwenden würde (was bedeutet, dass alle “Cryptonians” nur Krypto-zu-Krypto-Transaktionen durchführen würden), gäbe es kein steuerpflichtiges Einkommen. Aber niemand (oder fast niemand) handelt auf diese Weise. Was bleibt, ist, dass zentralisierte Börsen die Idee der vertrauenswürdigen dritten Partei aufrechterhalten, ein Konzept, das Satoshi vollständig ausrotten wollte. Und es gäbe tatsächlich keine vertrauenswürdige dritte Partei mehr, wenn Bitcoin so verwendet würde, wie es beabsichtigt war.Die meisten Nutzer entscheiden sich aus Bequemlichkeit für eine zentralisierte Kryptowährungsbörse, weil sie die Risiken nicht verstehen oder keine Alternativen kennen.1) Bequemlichkeit ist verständlich. Im Grunde hat man sein Geld in einer Wallet (die man nicht wirklich besitzt, da die Börse der eigentliche Eigentümer der Wallet ist) und kann jederzeit darauf zugreifen. Es können jederzeit Transaktionen durchgeführt werden, wann immer man will.2. Die Risiken sind jedoch vielfältig. \"Die\" Wallet gehört nicht dir, sondern der Börse. Warum das so ist? Weil man nicht im Besitz der privaten Schlüssel ist. Man sieht ja was mit, Mt. Gox, Binance (zweimal), Criptsy, Cyptopia, Bitfinex usw. passiert ist. Das Gleiche passiert, wenn der Eigentümer der Börse beschließt, einen \"Exit Scam\" durchzuführen. Ohne die privaten Schlüssel ist man nicht im Besitz der Gelder/Coins/Tokens.“Not your keys, not your crypto”Ein weiteres Risiko besteht darin, dass die zentralen Börsen wie Banken agieren und private Kundendaten sammeln, da sie von den Regierungen zur Einführung von KYC- und AML-Verfahren (Know Your Customer und Anti Money Laundering) gezwungen werden. Und die Regierung ist die Instanz, die am meisten nach persönlichen Daten giert. Die Weitergabe von privaten Daten und die völlige Vernachlässigung der eigenen Privatsphäre/Anonymität wird früher oder später all jenen auf den Kopf fallen. Die diese \"Dienstleistungen\" in Anspruch genommen haben, wie es bei den Kunden von Coinbase der Fall war. Wenn die Nutzer einen Nachweis über alle Transaktionen haben und ihre Steuern bezahlt haben, sollte alles in Ordnung sein. Auch für diejenigen, die zu einem höheren Preis gekauft und zu einem niedrigeren verkauft haben, also keinen Gewinn gemacht haben, sollte alles in Ordnung sein, aber auch die sollten den Behörden diese Nachweise vorlegen. Aber auch die \"gesetzestreuen Bürger\" wollen sicher nicht von den Behörden immer kontrolliert werden.Das Hauptproblem liegt bei denjenigen, die nicht in der Lage sind, solche Nachweise zu erbringen, und nicht bei denjenigen, die ihre Steuern nicht zahlen. Diese werden von den Regierungen als Kriminelle betrachtet. Als Steuerhinterzieher.Die Frage \"Wenn der Staat Kryptowährungen nicht als Geld akzeptiert, warum besteuert er sie dann?\" eine gute Frage ist. Die Antwort lautet: Weil Einnahmen generiert werden. Wenn es so etwas wie einen Handel mit Blätetr gäbe, würde man vielleicht sogar die Gewinne aus dem Verkauf von Blättern besteuern. (Weiß nicht wie es in Rumänien ist, aber in DACH würde das sowieso besteuert sein).Das bringt uns zu der Frage \"Wie schützen wir unsere Privatsphäre?3) Mangelndes Wissen über Alternativen ist einer der Hauptgründe, warum sich Krypto-Neulinge an zentralisierte Börsen wenden. Aber es gibt Alternativen.Eine erste Lösung sind dezentralisierte Peer-to-Peer-Börsen, bei denen die Transaktionen direkt zwischen den Nutzern stattfinden, ziemlich anonym sind und die Rolle der Börse lediglich darin besteht den Nutzern dabei zu helfen, miteinander in Kontakt zu treten, ohne ihr Geld bzw. ihre privaten Schlüssel zu verwahren.Darüber hinaus können Bitcoin-Geldautomaten eine Alternative darstellen, da in diesem Fall keine persönlichen Informationen preisgegeben werden müssen. Diese Terminals haben leider meistens hohe Gebühren oder einen schlechten Wechselkurs für den Kauf/Verkauf von Kryptowährungen. Der Schutz der Privatsphäre hat seinen Preis.Schließlich können auch Peer-to-Peer-Transaktionen mit Personen durchführt werden, denen man vertraut. Aber auch mit Personen, die nicht persönlich bekannt sind, ähnlich wie bei Amazon/Ali Express-Transaktionen.All dies sind Vorschläge für diejenigen, die bereit sind, Krypto statt Fiat-Geld zu verwenden. Nur dann sind Pseudonymität und Exposition möglich (Gläserner Bürger). Solange die Transaktionen jedoch ausschließlich von Kryptowährung zu Kryptowährung erfolgen, kann die Anonymität besser gewahrt werden. Dies übrigens keine Aufforderung zur Steuerhinterziehung, jeder Bürger soll seine Steuern zahlen. Aber zentralisierte Kryptowährungsbörsen setzt die Nutzer nicht nur dem Staat aus, sondern es gefährdet auch sein Geld.Abschließend möchte GazetaBitcoin mit diesem Beitrag der zentralen Kryptobörsen zur Sensibilisierung für Kryptowährungen anerkennen. Ohne sie hätten vielleicht weniger Menschen von Bitcoin und anderen Kryptowährungen gehört. Die Börsen spielten und spielen eine überwältigende Rolle im Ökosystem, dennoch sind sie mit großen Vorurteilen behaftet. Diejenigen, die sich für ihre Nutzung entscheiden, können dies tun, wenn sie ihre Funktionsweise genau verstehen.“Not your keys, not your crypto”Bisherige Übersetzungen:Română: Guvernul vine! ANAF si DIICOT ii urmaresc pe traderi, translation by GazetaBitcoinNigerian: Governs dey come 4 traders!, translation by AgbePolish: Rządy biorą się za handlowców, translation by cygan",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5447541",
  "comments": [
    {
      "author": "Buchi-88",
      "created_time": "April 04, 2023, 11:49:48 AM",
      "body": "ReserviertZur Information, ich habe noch nicht Korrektur gelesen. Kommt Morgen.@cyganWie hast das du bei deiner Übersetzung gelöst, da der Text in der \"Ich\" Form geschrieben war?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cygan",
      "created_time": "April 04, 2023, 01:26:31 PM",
      "body": "Quote from: Buchi-88 on April 04, 2023, 11:49:48 AM✂️Wie hast das du bei deiner Übersetzung gelöst, da der Text in der \"Ich\" Form geschrieben war?ich habe es dann auch in der 'ich' form übersetzt. denn so steht es auch im originalen und GazetaBitcoin erzählt dort von sich aus seine geschichte und wie alles abgelaufen ist.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Danydee72",
      "created_time": "April 05, 2023, 01:31:27 PM",
      "body": "Danke für die Übersetzung. Für mich persönlich gibt es einen weiteren Grund, aktuell -- mit einem tiefen Seufzer zwar, aber doch -- auf einer CEX unterwegs zu sein. Das Handeln an sich bzw. das Handeln über eine API. Für mich ist das der Hauptantrieb, dass ich noch eine CEX benutze und über all ihre Risiken hinwegschaue. Ich frage mich, ob da Tools wie z.B. bitquery gangbare Wege sind. Falls dem so ist, würde mein Beitrag dann doch wieder unter das Kapitel \"Bequemlichkeit\" fallen  Vielleicht gibt es ja Leute hier, die sich damit etwas auskennen? API und DEX - das müsste doch eigentlich machbar sein. Oder?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}