{
  "id": "topic_5483225",
  "title": "notocactus",
  "author": "notocactus",
  "created_time": "January 28, 2024, 12:26:27 PMLast edit: January 28, 2024, 12:36:46 PM by tranthidung",
  "content": "My recommendationsDon't try to find All time high, you can not predict it correctly and you will only know ATH of a cycle after you are already in a bear market.Don't time the market. Let's the market runs and try to exit with market cycle length, that you can base on Bitcoin history.Each cycle is unique and it can be longer or shorter than previous cycles but if you make your strategy on average cycle length, you will not take profit too far from the ATH & more important you will be able to avoid stuck too deep in a bear market.If you don't want to exit the market by taking profit with all bitcoins you have, do DCA for profit taking, withdrawal like this strategy.[ANN] JJG Sustainable Bitcoin Withdrawal Strategyhttps://bitcoindata.science/withdrawal-strategyBiggest common mistake of newbies is trying to find absolute bottom or ATH. Just don't!Now, let's use following flow of thinking and plan from LadyofCrypto1.I will keep her content originally as it is. My own thinking is above.Quote▶️ Some questions & predictionsWhen will Bitcoin break its ATH? November 2024When will the bull run end? September 2025When will most of the new 100x alts be released? Jan-July 2024Why do I think this? I'll show you below 👇▶️ This Time Is NOT DifferentAll I've heard for the past 2 years is \"This time is different\".They said the bear would be longer because of FTX and recession...They said the BTC would break its ATH sooner because of ETFs...Yet, things have been exactly the same 👇▶️ Market TopsIn 2017 the bull market peaked exactly 29 months before the halving. In 2021 it did the exact same thing.Alright, I know, it might just be a coincidence. But what if I told you...▶️ Bear Market LengthBoth the 2018 and 2022 bear markets lasted exactly 12 months. This is crazy when you consider how many people were saying this bear market would be way longer and deeper.But was it deeper?No, it wasn't. In the 2018 market, Bitcoin retraced 84%. In the 2022 one there was only a 77% retrace.So all the drama around the bear market and it ended up being the exact same length as the previous one and percentage-wise... better.▶️ All Time HighIn the last two cycles, Bitcoin broke its all-time high 7 and then 8 months after the halving.The ETF has so far not propelled BTC to 100k overnight as many assumed. I think that like the last two time, it will be 7-8 months, so, November 2024!▶️ Bull RunThe last three bull runs lasted 9, 9 and 11 months respectively. This one could be longer but I think 9-11 months is a good target to keep in mind.I think the next run peaks around September 2025 give or take a month. Let's talk profit-taking.▶️ Taking Profit I'll take partial profit slowly the whole run up. I believe that if you're up big you should 5%-10% out to secure profit.A lot of people say \"Don't sell strength\"... meh. In crypto things can go from strong to dead in hours.I'll take a small amount of profit on alts that pump hard but as we get closer to Sep 2025 I'll ramp up profit taking. This is a loose plan and could change!Some profit will be moved out of crypto and the rest reinvested in new projects with more upside potential 🚀",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5483225",
  "comments": [
    {
      "author": "Ruttoshi",
      "created_time": "January 28, 2024, 03:44:19 PM",
      "body": "I am new in bitcoin and I haven't experienced any bull run after the halving, and this will be the first halving and bull run that I will experience. But from the article that you provided, it shows that bitcoin has repeated history, over and over again, which means that we should expect such price movement during this period to the ATH. It is just that it will not be accurate or exactly like the previous ones, but from past event,it shows that it might be similar, and the odds are high.Due to the fact that I can't really tell when the new ATH will be, I have decided to have a price target that if bitcoin price reaches, I will take profit, and if it doesn't reach such price target, I will just wait and hodli. I plan to sell only 40% of my portfolio, and hodli the rest. I don't play with altcoins because they are like gambling, due the pump and dump nature.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tabas",
      "created_time": "January 28, 2024, 04:46:32 PM",
      "body": "I agree with everything you've said that we will not be able to find out that it is the peak of the bull run. But whenever we do, that's nice and we're able to spot out the top of it because normally, we don't. We can take a guess when we get there but we can't be sure if greed will hit us or not. Quote from: Ruttoshi on January 28, 2024, 03:44:19 PMI am new in bitcoin and I haven't experienced any bull run after the halving, and this will be the first halving and bull run that I will experience. But from the article that you provided, it shows that bitcoin has repeated history, over and over again, which means that we should expect such price movement during this period to the ATH. It is just that it will not be accurate or exactly like the previous ones, but from past event,it shows that it might be similar, and the odds are high.It is a cycle and the patterns that we're seeing might change or could be the same and we're getting close to that.Quote from: Ruttoshi on January 28, 2024, 03:44:19 PMDue to the fact that I can't really tell when the new ATH will be, I have decided to have a price target that if bitcoin price reaches, I will take profit, and if it doesn't reach such price target, I will just wait and hodli. I plan to sell only 40% of my portfolio, and hodli the rest. I don't play with altcoins because they are like gambling, due the pump and dump nature.That's a good strategy, you have to set a price target because as said, you will be having hard time to determine if that's the ATH. The emotions will be high when we keep on seeing the surge and to the point that you may miss the ATH and not be able to sell, we can point that fault to ourselves if we are not able to take profits.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yatsan",
      "created_time": "January 28, 2024, 04:59:47 PM",
      "body": "I was planning to buy a new car but since bullish direction is obvious with market prices of crypto, I decided to postpone my plan and just wanting to put all of it for third quarter of this year where uprise is expected. My plan is to accumulate as much as I can and hold it until the next cycle of Bitcoin.  I know things won't happen in a instant so yes, I still create a margin for my bills and expenses and to avoid the tendency of pulling out my assets and holdings. I know most of us are having or thinking of the same thing and I hope all of us will make big profit by that time this market again break the ceiling. Planning will be always needed to lessen mistakes. Remember that entry point could be crucial so better be conscious of making rush decisions.Based on charts and previous witnessing of bulltrend, things will not be consistent. It is important to know when is the right time to sell or buy again if you are into swing trades. And if you are looking forward with long term holding, be sure to avoid checking smaller time frames or prices from time to time. Know your goal and create your own vision of how you will be making a move this time. Everything is in our hands and that should be an enough reason for us to be careful for the right timing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackHatCoiner",
      "created_time": "January 28, 2024, 05:04:19 PM",
      "body": "Quote from: tranthidung on January 28, 2024, 12:26:27 PMDon't try to find All time high, you can not predict it correctly and you will only know ATH of a cycle after you are already in a bear market.That's a good recommendation in general, not just for newbies. I'd also add: Don't try to find the all time bear run low. As it appears to this date, it was $16k on December 2022, after the FTX news. Not that it matters currently, we're in the middle of a bear and a bull. Quote from: Ruttoshi on January 28, 2024, 03:44:19 PMIt is just that it will not be accurate or exactly like the previous ones, but from past event,it shows that it might be similar, and the odds are high.Yeah, that's pretty much why I don't consider Bitcoin a risky investment if the time span is more than four years. As long as it retains this \"unofficial currency / financial instrument\" title, it follows that pattern. And I know, we shouldn't rely on statistics, and it might break the pattern this time, but the fact that it has repeated for like four times should tell us something.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AbuBhakar",
      "created_time": "January 28, 2024, 05:04:29 PM",
      "body": "My biggest hurdle right now is the courage to enter whenever the price is being nuke while  I can’t buy either when the price is pumping. This is not my problem in the past but given the fact that the hype on ETF is already over makes me overthink that the price will suffer first a long bear market before we experience a massive bullrun just like what we are experiencing in every cycle after the halving. Your chart of bullrun is really helpful to become optimistic on the future. The timing to enter is what making me problem right now. Does anyone here still waiting for that massive correction around 30K or below before the real bullrun or this kind of waiting is already bullshit?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Free Market Capitalist",
      "created_time": "January 28, 2024, 05:13:17 PM",
      "body": "Quote from: BlackHatCoiner on January 28, 2024, 05:04:19 PMQuote from: tranthidung on January 28, 2024, 12:26:27 PMDon't try to find All time high, you can not predict it correctly and you will only know ATH of a cycle after you are already in a bear market.That's a good recommendation in general, not just for newbies. I'd also add: Don't try to find the all time bear run low. As it appears to this date, it was $16k on December 2022, after the FTX news. Not that it matters currently, we're in the middle of a bear and a bull. In general it is good advice, what happens is that if you have experience and knowledge on the subject, in addition to making DCA, you can do DCA partial sales at certain times. For example when the price clearly beats the previous ATH, say when it is at $75K, then when it hits $105K (I foresee huge resistance at $100K) and then put in every $25K after that figure. JJG has fairly detailed posts on this.With knowledge you can do variants of DCA by taking advantage to buy more in bear markets and do partial sells in bull markets.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zaguru12",
      "created_time": "January 28, 2024, 06:52:35 PM",
      "body": "Quote from: AbuBhakar on January 28, 2024, 05:04:29 PMMy biggest hurdle right now is the courage to enter whenever the price is being nuke while  I can’t buy either when the price is pumping. This is not my problem in the past but given the fact that the hype on ETF is already over makes me overthink that the price will suffer first a long bear market before we experience a massive bullrun just like what we are experiencing in every cycle after the halving. This is exactly the kind of phobia that long term holding pattern actually eliminates. The bitcoin price is always unpredictable with or without the ETF hype so if you’re having trouble about whether the price will fall more the bull run will kick starts now, which is not common according to past trends I will tell you to simply go long term and probably calculate the average price of your current holding and then set a price target to take profits, this way you’ll be at peace holding and wouldn’t be scared of this fluctuations. QuoteDoes anyone here still waiting for that massive correction around 30K or below before the real bullrun or this kind of waiting is already bullshit?FUDs are still predicting this although some traders haven’t rule this out but one thing is don’t depend on speculations, take the chance now and invest you can use the DCA method which has been a productive pattern use by many in the past. Waiting for a correction might be a risk too much because there is possibility that it wouldn’t come again.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "January 28, 2024, 07:06:01 PMLast edit: January 29, 2024, 08:10:20 AM by franky1",
      "body": "reviewing the \"lady of crypto1\" charts of 2024-2025.. seems rational assumptionsi came to similar presumptions myself(reaching ~$70k by end of 2024-start of 2025)2025 ATH being (based on todays mining value-premium) of ~$140k maybe $160k market capable window of speculation highall seem rational.. however. the rational assumptions/presumptions based on past performance patterns, usually break when too many people see how rational they are. this is because people then plan on trading to \"beat the pattern\" because the pattern made the most sense. and this planning means people start taking profits before the rational presumptions of peaks. which then work against the presumptions by making the real future peak change due to everyone planning based on the presumptionsas an added presumptive note.. after the 2025ATH, old patterns suggest that the correction after 2025ATH wont drop below the previous cycles 2021ATH but as i said if too many people start taking these presumptions as rational plans. people then counter-plan and cause a change to what could happenfor instance imagine time travel was possible and in a time variant where these rational presumptions were not discussed, we then seen the reality of the market points at different times actually occurring. EGdecember 2024 tipped to $70kaugust 2025 ATH at $200kaugust 2026 corrected to new bottom of $70kand then we came back to the present to say these predictions. and then waited in real time, from present to see where the markets wentthe numbers and points would change based on people counter-planning against the predictions",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "goap",
      "created_time": "January 28, 2024, 07:27:32 PM",
      "body": "Good recommendations, I think it's best to DCA out late 2024 or early 2025 whenever the time may be, and then when the cycle hits a bear I will most definitely be buying back.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "January 28, 2024, 08:02:10 PM",
      "body": "Quote from: tranthidung on January 28, 2024, 12:26:27 PMMy recommendationsDon't try to find All time high, you can not predict it correctly and you will only know ATH of a cycle after you are already in a bear market.Don't time the market. Let's the market runs and try to exit with market cycle length, that you can base on Bitcoin history.Each cycle is unique and it can be longer or shorter than previous cycles but if you make your strategy on average cycle length, you will not take profit too far from the ATH & more important you will be able to avoid stuck too deep in a bear market.If you don't want to exit the market by taking profit with all bitcoins you have, do DCA for profit taking, withdrawal like this strategy.[ANN] JJG Sustainable Bitcoin Withdrawal Strategyhttps://bitcoindata.science/withdrawal-strategyBiggest common mistake of newbies is trying to find absolute bottom or ATH. Just don't!I am happy to see the tool I have created with JayJuanGee (his ideas) are being useful and people are sharing it!This is now my withdrawal strategy as well. I am using it as a guide to how much to withdrawal in bull run cycles.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Odusko",
      "created_time": "January 28, 2024, 08:39:32 PM",
      "body": "Quote from: goap on January 28, 2024, 07:27:32 PMGood recommendations, I think it's best to DCA out late 2024 or early 2025 whenever the time may be, and then when the cycle hits a bear I will most definitely be buying back. I like this approach buyback is one of those things that keep a short-term investor and Bitcoin market speculator in the best position to always be in profits all the time if there is a proper understanding of the market and applying the DCA approach to things.Many times some investors wait for too long before they make a DCA decision and when to either enter the market or exit rhe market,  this have made entire process tiresome for many of us and for that, we need to make a proactive attempt to always give the market the vest short even if the all-time high is not reached but using DCA to either take profits of buy back at a discounted price.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Stalker22",
      "created_time": "January 28, 2024, 09:06:00 PM",
      "body": "I dont have any particular plans or tactics in mind.  Im mostly just trying to get my hands on as much Bitcoin as possible while prices stay low.  Timing the markets perfectly or scoring a quick buck? Not my priority - I know crypto is a long game.  The keys Ive learned are patience and self-control.  So Ill stick to steadily buying and holding for now.  We will see where this takes me!  I figure predictions are mostly guesses anyway and  and this space moves too fast to keep up.  I would rather focus on what I can control.  If I keep investing what I can afford to lose, I think Ill do alright in the end.  Who really knows though?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kuriboh",
      "created_time": "January 29, 2024, 05:30:02 AM",
      "body": "Quote from: tranthidung on January 28, 2024, 12:26:27 PM...Well, How can you make the most of this bull market? Secondly, only positive things can be anticipated if you fix your investment target level in accordance with your plan and have a clear idea. You can't predict it, though, because we need to know what will happen and can only make educated guesses until we have all the information. You are attempting to recount the Bitcoin's history.You'll know how the ATH is done. And the ATH is already over, which makes us think a lot about the ATH. I know about the bear market in ATH, but I feel the massive bull run in ATH since it was the first problem. Insights from your chart help you to be optimistic about the future. Looking at the old data, it is clear that the state after the previous ATH will go down from the state before the next ATH.Usually, there will be a little problem at first, but even if it is a temporary problem, it will not be a problem later. The cryptocurrency market is a lottery. Playing cryptocurrency for a long time would be beneficial. This situation can only be resolved with collapsed structures. You have to take a step back, consider your options, and concentrate on what you believe to be the best.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pinggoki",
      "created_time": "January 29, 2024, 05:54:02 AM",
      "body": "Quote from: goap on January 28, 2024, 07:27:32 PMGood recommendations, I think it's best to DCA out late 2024 or early 2025 whenever the time may be, and then when the cycle hits a bear I will most definitely be buying back. If you wait for the bear season to buy back, wouldn't that be a problem for you because you're missing out on opportunities and at the same time we don't know when it's going to hit the rock bottom for the bear season so it's going to be problematic right? Totally agree on DCA though and if you really decide on the buy back part though, make sure that you're going to buy back big because you don't want to be regretting not buying a lot when it was the supposed lowest price of bitcoin and your only regret is that they didn't pay you more so you can buy more bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "KiaKia",
      "created_time": "January 29, 2024, 06:29:10 AM",
      "body": "Good advice all-round OP, timing the top is near impossible, it's better to take profit when it's good enough, every profit is considered a profit, even if it times two or times four, unrealized profit will turn to losses later, imagine waiting for years to see Bitcoin at a new all time high and you failed to take profit because you believe that it's just getting started? That will be so painful. I can say the same thing with Bear market too, timing the bottom have make many people to miss it already, the feeling of never getting enough is greed, when the FTX saga started I knew it will hit very hard, probably the best buying opportunity, I went all into Bitcoin then and I started saving some USDT again, and when 15k Bitcoin happened I did the same thing. Those who are expecting 10k Bitcoin will never get it again, and they will probably buy back at 30k range if they are lucky, instead of targeting the market price action it's better to use the cycle, Bear market is a buying period and bull market is a selling period, if you don't follow this you will miss out.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sunsilk",
      "created_time": "January 29, 2024, 06:36:29 AM",
      "body": "Quote from: goap on January 28, 2024, 07:27:32 PMGood recommendations, I think it's best to DCA out late 2024 or early 2025 whenever the time may be, Don't wait for the market to get up before you'd DCA. The best time to DCA is today and when you've got money, I think by that time when the halving is done we'll see it quite hard for some price drops. But since we're not yet on the halving, there's still a possibility that we'd see it go down a bit. Maybe going back to $38k and quite lower than that. If you think that it's best for the last 2024 before the actual bull run for which likely on 2nd-3rd quarter of 2025, we will see.Quote from: goap on January 28, 2024, 07:27:32 PMand then when the cycle hits a bear I will most definitely be buying back. Mostly this is the best strategy but we don't know how many will just spend all of the profits for the things they need and won't be buying back.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "notocactus",
      "created_time": "January 29, 2024, 09:59:31 AM",
      "body": "Quote from: kuriboh on January 29, 2024, 05:30:02 AMWell, How can you make the most of this bull market? Secondly, only positive things can be anticipated if you fix your investment target level in accordance with your plan and have a clear idea. You can't predict it, though, because we need to know what will happen and can only make educated guesses until we have all the information. You are attempting to recount the Bitcoin's history.I did not predict anything. Those tweets are not mine and tweets reveal historic rhythm. Believe in history or don't believe in it, it's your freedom and rights. I am not here to convince you to believe in it.For me, I myself believe in history before a cycle we have a new history.Quote from: bitmover on January 28, 2024, 08:02:10 PMI am happy to see the tool I have created with JayJuanGee (his ideas) are being useful and people are sharing it!This is now my withdrawal strategy as well. I am using it as a guide to how much to withdrawal in bull run cycles.It's because the idea is excellent and you built up a great tool for it. It's not perfect but I am not looking for perfection.Quote from: BlackHatCoiner on January 28, 2024, 05:04:19 PMI'd also add: Don't try to find the all time bear run low.Quote from: Poker Player on January 28, 2024, 05:13:17 PMWith knowledge you can do variants of DCA by taking advantage to buy more in bear markets and do partial sells in bull markets. It is true and I did not mention it because this topic is about plan in bull run. So when I was composing this thread, I forgot about bear market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Honyek",
      "created_time": "January 29, 2024, 01:29:14 PM",
      "body": "l planned to invest some of my money in bitcoin and live the investment for a long time. l may or may not wait till the end of the bull run before l sell almost all or all my investment, depending on the outcome of things along the path. My target is to make reasonable and good profit at the end of it all.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "thecodebear",
      "created_time": "January 29, 2024, 03:41:14 PM",
      "body": "OP, good analysis. The bitcoin market cycles have been working like clockwork so while we can't know what the next peak will be, we have a very good idea of roughly when it will be and at least a general range it should be in, and we know how the cycle operates through its four years duration. This makes Bitcoin the easiest investment to make a ton of money on, not only is it one of the best growing assets in the world, but also it is extremely predictable. You analysis points that out for anyone who isn't already very aware of it.Though I did laugh at this: \"The ETF has so far not propelled BTC to 100k overnight as many assumed.\" hahaha I certainly hope no one was naive enough to think that! Though I do remember last year in March or April seeing people on here predict Bitcoin would be hitting $60k by like June of last year, so I guess some people just reallyyyyyyy overestimate how fast Bitcoin grows haha. For anyone who understands the market cycles and Bitcoin's growth, we've known $100k is coming in 2025 and no sooner. And second half of 2025 is the time to start DCA'ing out to take any market cycle gains for those who want to do that. I personally plan to do that with some of my Bitcoin this time around, and buy back a bit on the crash in 2026.Oh also good job pointing out that the last bear market was the least severe yet. While the bear market was going on I saw sooooo many people and even mainstream news sites claiming that the bear market was the worst one in history for Bitcoin, when in fact it was the LEAST severe crash Bitcoin has ever had. I was always so confused why everyone was under the delusion that it was the worst when it was the least worst. Granted it did have a bunch of collapses in the crypto industry, so maybe that is what people were talking about, but the thing is that DESPITE all those collapses of Terra Luna, the whole crypto lending industry, some crypto investment firms, and finally FTX, the bear market was the most shallow one yet! Which really strongly shows that Bitcoin crashes are getting less severe since the industry ecosystem collapses were the worst yes, but even that couldn't stop the bitcoin price crash from being the least severe one in Bitcoin's history. In the next bear market, if the companies in the industry can learn from the mistakes of last time and avoid those sorts of collapses, I wouldn't be surprised to see Bitcoin crash only maybe 55-60%.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}