{
  "id": "topic_5444123",
  "title": "Mr.suevie",
  "author": "Mr.suevie",
  "created_time": "March 09, 2023, 12:51:35 PM",
  "content": "This is rather strange for me or maybe I really don't understand fully well how the systems truely calculated the activity of a user account. I have been here a short while but I have been very curious to seek for answer to anything I don't understand and recently I just noticed that the activity of some  users in the forum don't pop exactly when its suppose to (2 weeks interval). I came to notice on my account and some other user of my same rank with same activities like mine haven't pop up yet as it is suppose to do so yesterday which it normally does or there are reason why it hasn't reflected yet and please I would like to know how this truely works. And please correct me if I have asked wrongly just wanting to know more, my curiosity just keep getting at me.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5444123",
  "comments": [
    {
      "author": "_act_",
      "created_time": "March 09, 2023, 12:54:55 PM",
      "body": "After the first 14 posts when you register an account on this forum, the activity will start counting 14 every 14 days. That is how it is working and I have not seen any difference at all. You can start to monitor some accounts about this to confirm if what you are saying is true or not, I do not see it to be true, activity counts 14 every 2 weeks.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "March 09, 2023, 01:00:11 PM",
      "body": "It is difficult to compare two users, as the 14-day times vary from user to user, depending on when that count began. If I'm not mistaken.In addition, the number of posts that each one makes during these 14 days can be different.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husires",
      "created_time": "March 09, 2023, 01:02:55 PM",
      "body": "Activity is calculated according to this rule and is updated every hour.Quote from: theymos on June 18, 2013, 08:44:42 PMThe activity number is determined in this way:time = number of two-week periods in which you've posted since your registrationactivity = min(time * 14, posts)Once you reach 14 posts and post more, it will be updated once on the Wednesday after you make your first post in the next week.In other words, wait until next Wednesday and you will see that your activity has been updated.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mr.suevie",
      "created_time": "March 09, 2023, 02:03:30 PM",
      "body": "Quote from: Husires on March 09, 2023, 01:02:55 PMActivity is calculated according to this rule and is updated every hour.Quote from: theymos on June 18, 2013, 08:44:42 PMThe activity number is determined in this way:time = number of two-week periods in which you've posted since your registrationactivity = min(time * 14, posts)Once you reach 14 posts and post more, it will be updated once on the Wednesday after you make your first post in the next week.In other words, wait until next Wednesday and you will see that your activity has been updated.Well I just noticed my activity just change now, so I guess its on every Thursday for me, that's two weeks from this Thursday my activity is going to change again. Well I thought before it was general for every user to have their activity change on the Wednesday I usually notice other people activity change. So that's mean the activity change differs for each user just like what joker_josue said, well its noted now I won't feel my activity has been left behind again",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zlantann",
      "created_time": "March 09, 2023, 02:36:20 PM",
      "body": "Quote from: Mr.suevie on March 09, 2023, 02:03:30 PMQuote from: Husires on March 09, 2023, 01:02:55 PMActivity is calculated according to this rule and is updated every hour.Quote from: theymos on June 18, 2013, 08:44:42 PMThe activity number is determined in this way:time = number of two-week periods in which you've posted since your registrationactivity = min(time * 14, posts)Once you reach 14 posts and post more, it will be updated once on the Wednesday after you make your first post in the next week.In other words, wait until next Wednesday and you will see that your activity has been updated.Well I just noticed my activity just change now, so I guess its on every Thursday for me, that's two weeks from this Thursday my activity is going to change again. Well I thought before it was general for every user to have their activity change on the Wednesday I usually notice other people activity change. So that's mean the activity change differs for each user just like what joker_josue said, well it's noted now I won't feel my activity has been left behind again You didn't post anything yesterday, so you were unable to activate your new fourteen days activity. I guess it was immediately after you did a post today that your activity changed. What that means is that you have to post at least once in a new fourteen-activity period for you to get the activity. If you don't post anything within this period you will miss that two weeks activity. The activity change is to a large extent perfect. You can get more information from this thread https://bitcointalk.org/index.php?topic=2766177.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hosemary",
      "created_time": "March 09, 2023, 03:18:10 PMLast edit: March 09, 2023, 03:44:15 PM by hosseinimr93",
      "body": "Quote from: _act_ on March 09, 2023, 12:54:55 PMAfter the first 14 posts when you register an account on this forum, the activity will start counting 14 every 14 days. Not necessarily true.Yesterday was the last day of a two-week activity period. Assume that you made your first post yesterday. If you post 27 posts today, you can have 28 activity while you registered just yesterday. Quote from: Mr.suevie on March 09, 2023, 02:03:30 PMWell I just noticed my activity just change now, so I guess its on every Thursday for me, that's two weeks from this Thursday my activity is going to change again. The same activity periods are used for all users and the current one started yesterday.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dzungmobile",
      "created_time": "March 09, 2023, 03:56:31 PMLast edit: March 09, 2023, 04:08:43 PM by dzungmobile",
      "body": "You must make one post in each 14 to mark that period and gain max activity point later. If you did not post any post, your account will be newbie after 10 years and after 10 years, if you decide to spam 10000 posts in one day, one week, you are still newbie with max activity to 14 for one 14-day period.Spreadsheet to check forum activity update times till 2060.https://docs.google.com/spreadsheets/d/12saLhlUoqIdairxzuSPu6EYGrt7FN2lOstO1yDjCEbASource: https://bitcointalk.org/index.php?topic=582736.0* The sheet likely is little bit inaccurate by using 14 days + 6 minutes for each 14-day period but it is not big issue. Update time is on Wednesday forum time as I remembered and you don't need to know exactly in hour and minute.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Aanuoluwatofunmi",
      "created_time": "March 09, 2023, 03:58:55 PM",
      "body": "The forum works perfectly as it is designed for, if you're not active your activities can't move forward, your activities work with the post made and not your days spent on the forum, also know this that you do not need merit for your activities to count, but you need activities together with merits to rank up, you can learn more about this from the link provided below about activities and merits, all you need to know https://bitcointalk.org/index.php?topic=2766177.0",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Findingnemo",
      "created_time": "March 10, 2023, 01:39:59 PM",
      "body": "Quote from: joker_josue on March 09, 2023, 01:00:11 PMIt is difficult to compare two users, as the 14-day times vary from user to user, depending on when that count began. If I'm not mistaken.In addition, the number of posts that each one makes during these 14 days can be different.14 day time frame is same for every one which is an alternative Tuesday so if someone registered before the next session even before few minutes they can get extra 14 activities if they managed to make 1 successful post and activity. In long run this is completely negligible so users no need to give attention for unnecessary things. In fact I bookmarked the activity session period years ago but can't able to find it in mobile so hopefully one of forum AIs will post it sooner.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dzungmobile",
      "created_time": "March 10, 2023, 04:05:17 PM",
      "body": "Quote from: Findingnemo on March 10, 2023, 01:39:59 PMIn fact I bookmarked the activity session period years ago but can't able to find it in mobile so hopefully one of forum AIs will post it sooner. Here. Scroll up two posts and see a sheet link.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hosemary",
      "created_time": "March 10, 2023, 04:33:50 PM",
      "body": "Quote from: dzungmobile on March 09, 2023, 03:56:31 PM* The sheet likely is little bit inaccurate by using 14 days + 6 minutes for each 14-day period but it is not big issue. That's accurate. According to the old post made by theymos, a new activity period starts when the remainder of division of the UNIX time to 1210000 equals to zero. This means that, each activity period is exactly 1210000 seconds which is 14 days, 6 minutes and 40 seconds.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husires",
      "created_time": "March 10, 2023, 05:11:33 PM",
      "body": "Quote from: hosseinimr93 on March 10, 2023, 04:33:50 PMAccording to the old post made by theymos, a new activity period starts when the remainder of division of the UNIX time to 1210000 equals to zero. This means that, each activity period is exactly 1210000 seconds which is 14 days, 6 minutes and 40 seconds. This does not seem accurate. I have registered since 2018 and I do not remember that activity was updated other than on Wednesday, so adding 6 minutes every two weeks means 3.4 for each year, and since I registered it has been five years, which gives me a result of about one day from 2013.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "KingsDen",
      "created_time": "March 12, 2023, 09:30:30 AM",
      "body": "Quote from: Husires on March 10, 2023, 05:11:33 PMQuote from: hosseinimr93 on March 10, 2023, 04:33:50 PMAccording to the old post made by theymos, a new activity period starts when the remainder of division of the UNIX time to 1210000 equals to zero. This means that, each activity period is exactly 1210000 seconds which is 14 days, 6 minutes and 40 seconds. This does not seem accurate. I have registered since 2018 and I do not remember that activity was updated other than on Wednesday, so adding 6 minutes every two weeks means 3.4 for each year, and since I registered it has been five years, which gives me a result of about one day from 2013.From my experience, activity updates of Wednesdays but it is not automatic. For instance, if my activity was to increase on Wednesday but I didn't appear online on Wednesday and Thursday. On Friday, it will also not increase till I made a post.Op must have discovered that their activity did not increase, but after making a post about it, the activity later added. So, on the day of activity increment, you must be able to perform activity that day for the increment to be effected.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hosemary",
      "created_time": "March 12, 2023, 09:40:16 AM",
      "body": "Quote from: KingsDen on March 12, 2023, 09:30:30 AMFrom my experience, activity updates of Wednesdays but it is not automatic. For instance, if my activity was to increase on Wednesday but I didn't appear online on Wednesday and Thursday. On Friday, it will also not increase till I made a post.Activity is updated every hour, not only on Wednesdays. (Click here to see the post made by theymos.)If you see your activity doesn't change, that doesn't mean it's not updated. If your activity doesn't change, that's because it shouldn't change.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mpamaegbu",
      "created_time": "March 12, 2023, 02:28:02 PM",
      "body": "Quote from: hosseinimr93 on March 12, 2023, 09:40:16 AMActivity is updated every hour, not only on Wednesdays.I don't think that's the case with the every hour thing. Except you meant it as on rotational basis for different members. From my experience when I started, my activity count changed for every single post made until it got to 28 posts and 28 activities and then it stuck there. It remained at 28 until two weeks later to update. It has remained that way till date. My activities don't change until every two weeks. It's usually on a Wednesday. I don't know if it's same for everyone.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hosemary",
      "created_time": "March 12, 2023, 03:15:18 PM",
      "body": "Quote from: Mpamaegbu on March 12, 2023, 02:28:02 PMI don't think that's the case with the every hour thing. Activity is updated every hour for all users.As I said above, if your activity doesn't change despite making post, that doesn't mean your activity isn't updated. Your activity equals minimum (post count, 14*n), in which n is the number of two-week activity periods in which you have made post. As long as 14*n is lower than your post count, your activity equals 14*n and that's why your activity doesn't increase with making a new post. Again, if your activity doesn't change, that's because it shouldn't change. That doesn't mean your activity isn't updated.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "armanda90",
      "created_time": "March 12, 2023, 04:02:17 PM",
      "body": "Based on account potential or not will update as soon possible with activities after post added, but if account not potential needed waiting two weeks later for increasing up to 14 activities added. I don't sure with Bitcointalk forum system not updating about user activities. Better if your account not potential note with your activities amount and checking two weeks later have added 14 activities or still not.I assumed you have forget with how many previous activities with your account, all user here automatically added 14 activities with their account after two weeks later based on how many post have.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BTCGalaxyA12",
      "created_time": "March 12, 2023, 05:27:53 PM",
      "body": "Since the OP has already asked, I no longer need to ask about the number of accounts that I see that do not have the same amount of activity as the number of posts seen in each profile.Quote from: _act_ on March 09, 2023, 12:54:55 PMAfter the first 14 posts when you register an account on this forum, the activity will start counting 14 every 14 days. That is how it is working and I have not seen any difference at all. You can start to monitor some accounts about this to confirm if what you are saying is true or not, I do not see it to be true, activity counts 14 every 2 weeks.After 14 days after we made the post? Is this really the case?Now the number of posts I have made totals 25, not including this post. Usually I don't have to wait long to balance the number of activities with the number of posts.It seems like the forum system is working well regarding updates.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hosemary",
      "created_time": "March 12, 2023, 09:34:57 PM",
      "body": "Quote from: BTCGalaxyA12 on March 12, 2023, 05:27:53 PMNow the number of posts I have made totals 25, not including this post. Usually I don't have to wait long to balance the number of activities with the number of posts.It seems like the forum system is working well regarding updates.If I have correctly, you have been active in 5 two-week activity periods. This means that you can increase your activity up to 70 in the current activity period. For increasing your activity to more than 70, you must have at least 1 post in one of the next actvity periods.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}