{
  "id": "topic_5441086",
  "title": "tg88",
  "author": "tg88",
  "created_time": "February 24, 2023, 11:48:45 AM",
  "content": "O spotify iniciou testes de integração com carteira de criptomoedas e interação com NFT's, ainda não se tem muitas informações sobre quais serão as possibilidades de uso dentro da plataforma, se é venda de nft's por parte dos artistas ou disponibilizar acesso a conteúdos exclusivos. Mas atualmente alguns artistas já estão disponibilizando acesso a coleções de nfts listadas em site de terceiros dentro da plataforma.Recentemente também vi essa notícia de que o LimeWire reabre como mercado de NFTs e traz parceria com Travis Barker, eles estão migrando do compartilhamento de música pirata para um mercado de NFT onde será possível acessar conteúdos exclusivos exclusivos em parceria com os artistas.Parece que o mundo dá música está a cada dia mais ligado a NFT's.Fonte Livecoins: Spotify integra carteiras de criptomoedas e testa a Web3",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5441086",
  "comments": [
    {
      "author": "joker_josue",
      "created_time": "February 24, 2023, 12:00:40 PM",
      "body": "Quote from: tg88 on February 24, 2023, 11:48:45 AMParece que o mundo dá música está a cada dia mais ligado a NFT's.Apos anos de estagnação na industria da musica, nos últimos 10 anos eles tem evoluído bastante. E essa industria já percebeu que não se pode limitar a venda de discos e coisas do género, tem de evoluir para outros patamares.E os NFTs podem ser uma ferramenta muito interessante para essa industria, e acho que eles irão saber aproveitar isso mesmo.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "February 24, 2023, 01:36:01 PM",
      "body": "Quote from: tg88 on February 24, 2023, 11:48:45 AMFonte Livecoins: Spotify integra carteiras de criptomoedas e testa a Web3Sinceramente, esse negocio de NFT eu não vejo grande utilidade. Daqui a pouco vamos ter que pagar para aparecer um NFT do artista em vez da capa do album?  Acho interessante a parte da integração da carteira de criptomoedas. Se eu puder pagar spotify com criptomoedas está otimo.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Disruptivas",
      "created_time": "February 24, 2023, 04:34:07 PM",
      "body": "Acho que tem um ponto interessante em que o uso dos NFTs poderia trazer mais transparência. Esses dias eu estava vendo uma série que nunca ouvi ninguem falar, com atores desconhecidos, mas era uma super produção. E fiquei pensando, COMO É que a mensalidade do Netflix paga essas produções? Hoje vivemos um grande problema com o monopolio da Spotify em termos de produção  de novos conteúdos. Mas caso houvese um NFT de mensalidade, que se fragmentasse de acordo com quanto cada pessoa ve o que, e pudessemosa saber quanto cada produção recebe, por quanto ela custou e etc, seria bem interessante.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TryNinja",
      "created_time": "February 24, 2023, 05:53:47 PM",
      "body": "Quote from: bitmover on February 24, 2023, 01:36:01 PMSinceramente, esse negocio de NFT eu não vejo grande utilidade. Daqui a pouco vamos ter que pagar para aparecer um NFT do artista em vez da capa do album?  Se existe um mercado para colecionaveis digitais, existe um mercado para NFTs desse tipo. Há quem gostaria de comprar uma \"edição limitada\" da musica 100 de um artista que ela goste etc... eu mesmo tenho uns que compraria pelo suporte.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "February 24, 2023, 07:36:56 PM",
      "body": "Quote from: Disruptivas on February 24, 2023, 04:34:07 PME fiquei pensando, COMO É que a mensalidade do Netflix paga essas produções? Não paga! As mensalidades da Netflix, apesar de darem rentabilidade ao empresa, não é a principal fonte de receita para fazer as produções.As produções são feitas com base nos patrocínios e investidores, que acabam por ter retornos com base no numero de visualizações que um filme/serie é visto.Com as mensalidades a Netflix, pode dizer que tem X de espectadores para verem um filme/serie, e desse modo convencer os patrocinadores e investidores a pagarem pelas produções.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rdluffy",
      "created_time": "February 28, 2023, 03:49:23 PM",
      "body": "Vamos ver como vai se comportar, já que a febre dos NFTs já passou, e tem que ser algo bem legal pra reter os usuários e fazer desembolsar uma grana.Acho válido esses testes, pois uma hora conseguem encontrar algo legal, que realmente pode valer a pena.Fazendo um exercício rápido de pensamento, no caso dos artistas, seria legal você ter um NFT exclusivo do seu artista ou banda favorito, mas que fosse dedicado somente pra você, ou alguma característica única.Eu por exemplo, não vou comprar um NFT só porque é uma imagem ou vídeo ou qualquer outra coisa. Mas pensou se você pudesse comprar um NFT e o artista vai lá e grava uma saudação só pra você, com seu nome  Ou portadores de NFTs podem ter algum acesso antecipado a músicas, desconto em shows, etc",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Disruptivas",
      "created_time": "March 01, 2023, 01:53:24 AM",
      "body": "Quote from: joker_josue on February 24, 2023, 07:36:56 PMNão paga! As mensalidades da Netflix, apesar de darem rentabilidade ao empresa, não é a principal fonte de receita para fazer as produções.As produções são feitas com base nos patrocínios e investidores, que acabam por ter retornos com base no numero de visualizações que um filme/serie é visto.Com as mensalidades a Netflix, pode dizer que tem X de espectadores para verem um filme/serie, e desse modo convencer os patrocinadores e investidores a pagarem pelas produções.Mas que patrocinio e investidores uma série do Netlix tem, além dos próprios clientes da Netflix? Quando assistimos uma série do Netflix, não tem propaganda durante o momento que assistimos e no meio das séries também não tem - alá globo adicionando no meio dos enredos das novelas uns patrocinadores de forma muito chata-. E também não sei quem são os investidores dessas séries. Não entendi muito seu comentário. São nesse caso, investidores e patrocinadores do netflix?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TryNinja",
      "created_time": "March 01, 2023, 02:10:59 AM",
      "body": "Quote from: Disruptivas on March 01, 2023, 01:53:24 AMMas que patrocinio e investidores uma série do Netlix tem, além dos próprios clientes da Netflix? Quando assistimos uma série do Netflix, não tem propaganda durante o momento que assistimos e no meio das séries também não temPior que setá começando a ter, viu? rsrsrs.A Netflix já lançou há um tempo o seu plano de assinatura mais barato com incríveis 720p de qualidade máxima e ads por R$ 18,90 mensais. É um absurdo, mas está aí. https://about.netflix.com/pt_br/news/announcing-basic-with-ads-brClaro que muito provavelmente não é isso que vai pagar as suas despesas, mas também não sei de nada sobre o seu modelo de negócio, então não posso opinar sobre o que o joker está falando.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "March 01, 2023, 08:07:17 AM",
      "body": "Quote from: Disruptivas on March 01, 2023, 01:53:24 AMMas que patrocinio e investidores uma série do Netlix tem, além dos próprios clientes da Netflix? Quando assistimos uma série do Netflix, não tem propaganda durante o momento que assistimos e no meio das séries também não tem - alá globo adicionando no meio dos enredos das novelas uns patrocinadores de forma muito chata-. E também não sei quem são os investidores dessas séries. Não entendi muito seu comentário. São nesse caso, investidores e patrocinadores do netflix? Eu não falei em publicidade, isso é outra tipo de fonte de receita.As vezes os patrocínios estão em locais que você não repara, como por exemplo: relógios que os autores usam; objetos em cenas; entre outras coisas semelhantes.Por exemplo, o 007 tem um grande patrocínio da Omega e da Austi Martin.Depois existe o elemento de estatuto, uma marca/pessoa ficar associada a um filme, por poder dizer que ajudou a produzir um determinado filme.E depois a possível partilha da receita que vem do merchandising. Por exemplo, consegues imaginar o dinheiro que a Disney não ganha com os produtos Star Wars? Ou seja, a Disney estará desposta a gastar milhões numa produção Star Wars, porque sabe que terá retorno na venda desses produtos. E por sua vez, investidores irão querer também ter uma percentagem dos direitos desses filmes, para poderem receber esse retorno.O seguinte artigo, pode ajudar a explicar mais: https://filmenomundo.wordpress.com/2014/02/14/financiando-cinema-nos-eua/Consegui ajudar a esclarecer?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TryNinja",
      "created_time": "March 01, 2023, 08:17:16 AM",
      "body": "Quote from: joker_josue on March 01, 2023, 08:07:17 AMEu não falei em publicidade, isso é outra tipo de fonte de receita.As vezes os patrocínios estão em locais que você não repara, como por exemplo: relógios que os autores usam; objetos em cenas; entre outras coisas semelhantes.Por exemplo, o 007 tem um grande patrocínio da Omega e da Austi Martin.Até então não vi nenhuma original da Netflix com um anuncio claro desses. Isso acontece bastante lá na Coreia do Sul, onde o negócio tá tão serio que fica até iconico e tem séries que são feitas EXCLUSIVAMENTE para fazer um merchandising. Um video bem legal e curioso que recomendo: How SUBWAY is Taking Over Korea",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "March 01, 2023, 09:57:49 AM",
      "body": "Quote from: TryNinja on March 01, 2023, 08:17:16 AMAté então não vi nenhuma original da Netflix com um anuncio claro desses. Se tiver bem feito, você não nota.Por exemplo, se você ver um filme/serie onde a marca de um carro é claramente vista, então é muito provável que essa marca tenha pago para aparecer.Agora a Netflix será a que menos apoios recebe nessa área. Será mais através de investidores na empresa, merchandising e lá esta receitas de assinatura.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TryNinja",
      "created_time": "March 01, 2023, 05:08:21 PM",
      "body": "Quote from: joker_josue on March 01, 2023, 09:57:49 AMSe tiver bem feito, você não nota.Por exemplo, se você ver um filme/serie onde a marca de um carro é claramente vista, então é muito provável que essa marca tenha pago para aparecer.Entendo o que você quer dizer, mas ainda não acredito (no caso da Netflix). Eu sou bem perspicaz nessa ideia de propaganda embutida em conteúdo, e acaba virando até que um mini-hobbie tentar descobrir o que está ali de entrometido (). Tenho certeza que já teve uma ou duas ocasiões, mas eu realmente acho que teria percebido esse modelo de negócios se ele acontecesse com mais frequência. Posso estar errado também.Tem algum artigo ou video sobre isso?edit:Achei isso daqui: https://fourweekmba.com/netflix-revenueRealmente fala que o lucro deles vem das assinaturas.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "March 01, 2023, 07:22:59 PM",
      "body": "Quote from: TryNinja on March 01, 2023, 05:08:21 PMTem algum artigo ou video sobre isso?edit:Achei isso daqui: https://fourweekmba.com/netflix-revenueRealmente fala que o lucro deles vem das assinaturas.Sim, eu não digo que o lucro deles não venha das assinaturas. Nisso sem duvida é ai que esta o dinheiro deles.O que eu estava a questionar é se todo esse dinheiro das assinaturas é o utilizado para financiar 100% dos filmes/series. Eu acredito que eles tenha outras fontes de apoio, mas talvez esteja enganado. Já fiz varias pesquisas, mas não encontrei nada em concreto.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "l3pox",
      "created_time": "March 02, 2023, 07:45:43 PM",
      "body": "já estudei um pouco o modelo de negócios da netflix e sim, realmente a maioria massiva vem de assinaturas, e eles tem entradas de merchandising/colocação de produtos tbma base de usuários é muito grandepra quem curte o assunto vale a pena ler o livro \"a regra é não ter regras\" sobre o modelo de negócios deles.tem milhares de aplicações pra NFTs no spotify, desde edições limitadas até participação nos lucros de músicas (mais delicado do ponto de vista regulatório, mas super possível), crowdfunding e colecionáveis, NFTs + obras físicas exclusivas... muita coisa",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "March 02, 2023, 08:44:00 PMLast edit: March 02, 2023, 09:01:06 PM by bitmover",
      "body": "Quote from: TryNinja on March 01, 2023, 08:17:16 AMAté então não vi nenhuma original da Netflix com um anuncio claro desses. Isso acontece bastante lá na Coreia do Sul, onde o negócio tá tão serio que fica até iconico e tem séries que são feitas EXCLUSIVAMENTE para fazer um merchandising. Um video bem legal e curioso que recomendo: How SUBWAY is Taking Over KoreaStrangers things temCertamente a maior parte da receita deles vem de assinaturas. Mas essas propagandas existem em quase todo filme ou série. As vezes até pouco evidente, de forma que não percebemos imediatamente. Minh propaganda favorita, da Netflix billionsCode:1 Million Dollars, Straight in Crypto",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "March 02, 2023, 11:15:40 PM",
      "body": "Quote from: bitmover on March 02, 2023, 08:44:00 PMStrangers things temBem lembrado. Essa serie tem vários elementos, que de certeza são fruto de patrocínios.Por exemplo nessa cena, porque ter uma lata da Coca-Cola e não da Pepsi ou de outra bebida qualquer, até menos conhecida?Logicamente, não foi o dinheiro da Coca-Cola que pagou a produção dessa serie. Mas certamente foi um bom encaixe financeiro.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}