{
  "id": "topic_5401258",
  "title": "Ulven",
  "author": "Ulven",
  "created_time": "June 03, 2022, 04:17:25 PM",
  "content": "في رسالة من التوأمين كاميرون و تايلر رئيسي التنفيذ ل geminiيؤكدان فيها حتى تستمر المنصة في البقاء على قيد الحياة يتوجب عليهم التخلص من الموظفين بنسبة 10% من إجمالي عدد الموظفين البالغ لأكثر من 500 موظف، بداع أن السوق في مرحلة الإنكماش لأسباب كثيرة التي يمر بها العالم في الوقت الحالي.https://www.gemini.com/blog/a-message-from-cameron-and-tylerهذا يدل على أن المستثمرين الكبار كل ما يهمهم هو سوى المصلحة الشخصية فقط و لا يبالون للغير. كيف يعقل أن يتم طرد الموظفين بعد كفاح من العمل طال لسنوات عدة؟ هل تعتقدون أن الأفكار التي تقدم بها هذين التوأمين ستكون لمصلحة نمو سوق التشفير أم العكس؟",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5401258",
  "comments": [
    {
      "author": "OmegaStarScream",
      "created_time": "June 03, 2022, 08:22:11 PM",
      "body": "هذا النوع من القرارات ليس مفاجئا. لأن الشركة  و مهما كان توجهاتها و فلسفتها حول البيتكوين و العملات المشفرة، لا يمكنها ان تكمل في تقديم خدماتها من دون ان تربح. و انا لا أتوقع أن تقوم أي شركة في العالم بالابقاء على بعض الموظفين ان كان هنالك امكانية افلاس الشركة.كوينباز هي الأخرى في حالة حرجة بعد خسارتها لما يقارب 400 مليون دولار و للعديد كن المستخدمين: https://www.google.com/amp/s/abcnews.go.com/amp/Technology/wireStory/coinbase-loses-half-week-crypto-slumps-84656289",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kavelj22",
      "created_time": "June 03, 2022, 08:27:11 PM",
      "body": "Quote from: OmegaStarScream on June 03, 2022, 08:22:11 PMهذا النوع من القرارات ليس مفاجئا. لأن الشركة  و مهما كان توجهاتها و فلسفتها حول البيتكوين و العملات المشفرة، لا يمكنها ان تكمل في تقديم خدماتها من دون ان تربح. و انا لا أتوقع أن تقوم أي شركة في العالم بالابقاء على بعض الموظفين ان كان هنالك امكانية افلاس الشركة.بالضبط يا صديقي.الأمر لا علاقة له بسوق التشفير و لا بمجال معين ايضا. الشركات لا تستطيع مواصلة تقديم خدماتها ان كانت لا تحقق أرباحا كافية و لا تستطيع بنفس المنطق الابقاء على موظفين لا فائدة من وجودهم كما يحصل مع الوظائف الحكومية. خصوصا الشركات العملاقة التي توظف مئات الموظفين.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ulven",
      "created_time": "June 06, 2022, 01:59:28 PM",
      "body": "Quote from: OmegaStarScream on June 03, 2022, 08:22:11 PMهذا النوع من القرارات ليس مفاجئا. لأن الشركة  و مهما كان توجهاتها و فلسفتها حول البيتكوين و العملات المشفرة، لا يمكنها ان تكمل في تقديم خدماتها من دون ان تربح. و انا لا أتوقع أن تقوم أي شركة في العالم بالابقاء على بعض الموظفين ان كان هنالك امكانية افلاس الشركة.كوينباز هي الأخرى في حالة حرجة بعد خسارتها لما يقارب 400 مليون دولار و للعديد كن المستخدمين: https://www.google.com/amp/s/abcnews.go.com/amp/Technology/wireStory/coinbase-loses-half-week-crypto-slumps-84656289أتفق معك في هذا يبدو أكثر منطيقي مهما كانت سمعة المنصة إلا أنها قادرة على تغيير بنود توجهها في أي وقت مضى، أعتقد الإرتداد الذي شهده السوق خلال الأشهر الماضية أثر بشكل كبير على العائدات بالنسبة للمنصات بحيث تعرضت أغلبها إلى خسارة أموال كبيرة و خاصة إنهيار عملة لونا الذي تسبب في خسارة المليارات من الدولارات بالنسبة للمستخدمين و المنصات. و أهمها بينانص و كوان باز.أما بخصوص منصة gemini تم رفع دعوى قضائية ضدها بخصوص التلاعب التي تقوم به و التقارير المظللة التي تقدمها بخصوص التداول بالعقود الأجلة لهذا أعتقد أن المنصة بهذه الخطوة تحاول المرواغة قصد تفادي المحكمة و لا أعتقد أنها ستنجح بذلك.https://cointelegraph.com/news/cftc-sues-gemini-claiming-the-crypto-exchange-lied-in-futures-contract-evaluationQuote from: Kavelj22 on June 03, 2022, 08:27:11 PMQuote from: OmegaStarScream on June 03, 2022, 08:22:11 PMهذا النوع من القرارات ليس مفاجئا. لأن الشركة  و مهما كان توجهاتها و فلسفتها حول البيتكوين و العملات المشفرة، لا يمكنها ان تكمل في تقديم خدماتها من دون ان تربح. و انا لا أتوقع أن تقوم أي شركة في العالم بالابقاء على بعض الموظفين ان كان هنالك امكانية افلاس الشركة.بالضبط يا صديقي.الأمر لا علاقة له بسوق التشفير و لا بمجال معين ايضا. الشركات لا تستطيع مواصلة تقديم خدماتها ان كانت لا تحقق أرباحا كافية و لا تستطيع بنفس المنطق الابقاء على موظفين لا فائدة من وجودهم كما يحصل مع الوظائف الحكومية. خصوصا الشركات العملاقة التي توظف مئات الموظفين.نعم صديقي لا أعتقد أن أغلب المنصات لا تحقق مكاسب مهمة في الغالب المنصات هي الرابحة من عمليات التلاعب التي تقوم بها بدون أن يشعر المستخدم بذلك لذا يجب دائما أثناء الإنضمام إلى المنصات رغم مصداقيتها أن تعمل مع بحكمة لتفادي ما لا يتمناه الجميع",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "khaled0111",
      "created_time": "June 14, 2022, 11:23:40 PM",
      "body": "كل العالم يمر بأزمة اقتصادية حاليا و الأمر لا يقتصر على الشركات الناشطة في مجال العملات الرقمية بل يشمل كل المجالات.كان يمكن أن يكون للخبر وقع اكبر لو كنا نتحدث عن شركة عملاقة تشغل عشرات الالاف من الموظفين لكن هنا نتحدث عن تسريح خمسين موظفا فقط و هو يعتبر عدد صغير، لذلك لا أعتقد أنه سيكون له تأثير كبير و لا أعتقد أنه بمثل هذا القرار سيتم حل المشاكل المالية للمنصة.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OmegaStarScream",
      "created_time": "June 15, 2022, 02:37:13 PM",
      "body": "لقد قامت المنصة اليوم باضافة عمولة عند السحب (بعدما كان السحب مجانيا)[1]كما يبدو أن منصات أخرى مثل كوينباز (طرد 1100 موظف) و كريبتو[2] (260 موظف) قد بدأت بالقيام بنفس الشئ[1] https://pandaily.com/gemini-to-stop-providing-free-crypto-withdrawals/[2] https://www.cnet.com/personal-finance/crypto/coinbase-crypto-com-face-major-layoffs-as-market-tumbles/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husires",
      "created_time": "June 15, 2022, 05:28:05 PM",
      "body": "Quote from: OmegaStarScream on June 15, 2022, 02:37:13 PMكما يبدو أن منصات أخرى مثل كوينباز (طرد 1100 موظف) و كريبتو[2] (260 موظف) قد بدأت بالقيام بنفس الشئكل الخطوات التي تقوم بها المنصات ان كانت محسوبة فهي جيدة لانها ستساعد المنصة علي المدى الطويل بالنجاة ولكن اذا كان الغرض منها زيادة الايردات التي نقصت بشدة او معالجة ازمة ماليه فالعديد من هذه المنصات ستكون عرضة للافلاس.طبعا ونظريا فالمنصات قد تتلاعب باسعار العملات عندما يتم ادراجها وبالتالي تحقق ارباح ولكن جميع طرق الربح الحالية تمت اغلاقها فمثلامع تقلبات السوق اصبح الاستاكنج غير مربح لانه وبدلا من وضع اموالك في عملة تنقص بشكل كبير, والحصول علي عائد بنسبة 10% فمن الافضل لك تحويلها لحسابك البنكي والحصول علي ارباح اعليالرموز المميزة وNFT والتمويل الامركزي وغيرها من الحمى التي كانت تسيطر علي السوق انتهت واصبح فقط المستمرون القدامي والحيتان الذين يشترون, هذه الاشياء ستؤثر سلبا علي حجم المرور للمنصة مما يجبرهم علي تقليص عدد الموظفين نظرا لقله الحاجة للكثير منهم.الركود, حتي المؤسسون وفي فترات الركود فالعديد من الاسهم والعقارات تنخفض قيمتها لذلك سيميلون لتسييل تلك الاموال وتنويع الاستثمارات حيث انه من غير المرجح ان نعود لمستويات 70 الف دولارعلي المدى القصير لذلك تهرب الاستثمارات لاماكن آخري اكثر ربحية.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kavelj22",
      "created_time": "June 15, 2022, 10:58:04 PMLast edit: June 20, 2022, 08:03:34 AM by Kavelj22",
      "body": "Quote from: OmegaStarScream on June 15, 2022, 02:37:13 PMلقد قامت المنصة اليوم باضافة عمولة عند السحب (بعدما كان السحب مجانيا)[1]كما يبدو أن منصات أخرى مثل كوينباز (طرد 1100 موظف) و كريبتو[2] (260 موظف) قد بدأت بالقيام بنفس الشئ[1] https://pandaily.com/gemini-to-stop-providing-free-crypto-withdrawals/[2] https://www.cnet.com/personal-finance/crypto/coinbase-crypto-com-face-major-layoffs-as-market-tumbles/على ما يبدو فان موجة الركود العام بدأت تلقي بضلالها على أقوى اللاعبين في المجال. و الذي يعكس فعلا ان حجم سوق التداول قد تراجع بشكل ملحوظ اذ ان المنصات مفروض ارباحها تتأتى اساسا من الرسوم على عمليات التداول و السحب.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ulven",
      "created_time": "June 16, 2022, 07:43:27 PM",
      "body": "Quote from: Husires on June 15, 2022, 05:28:05 PMQuote from: OmegaStarScream on June 15, 2022, 02:37:13 PMكما يبدو أن منصات أخرى مثل كوينباز (طرد 1100 موظف) و كريبتو[2] (260 موظف) قد بدأت بالقيام بنفس الشئكل الخطوات التي تقوم بها المنصات ان كانت محسوبة فهي جيدة لانها ستساعد المنصة علي المدى الطويل بالنجاة ولكن اذا كان الغرض منها زيادة الايردات التي نقصت بشدة او معالجة ازمة ماليه فالعديد من هذه المنصات ستكون عرضة للافلاس.طبعا ونظريا فالمنصات قد تتلاعب باسعار العملات عندما يتم ادراجها وبالتالي تحقق ارباح ولكن جميع طرق الربح الحالية تمت اغلاقها فمثلامع تقلبات السوق اصبح الاستاكنج غير مربح لانه وبدلا من وضع اموالك في عملة تنقص بشكل كبير, والحصول علي عائد بنسبة 10% فمن الافضل لك تحويلها لحسابك البنكي والحصول علي ارباح اعليالرموز المميزة وNFT والتمويل الامركزي وغيرها من الحمى التي كانت تسيطر علي السوق انتهت واصبح فقط المستمرون القدامي والحيتان الذين يشترون, هذه الاشياء ستؤثر سلبا علي حجم المرور للمنصة مما يجبرهم علي تقليص عدد الموظفين نظرا لقله الحاجة للكثير منهم.الركود, حتي المؤسسون وفي فترات الركود فالعديد من الاسهم والعقارات تنخفض قيمتها لذلك سيميلون لتسييل تلك الاموال وتنويع الاستثمارات حيث انه من غير المرجح ان نعود لمستويات 70 الف دولارعلي المدى القصير لذلك تهرب الاستثمارات لاماكن آخري اكثر ربحية.فعلاً عندما أصبح السوق مشبعاً تسبب في تراجع أغلب العملات و من أهمها عملة البتكوين المحرك الأساسي للسوق، و لكن كان قد حدث هذا في الماضي أيضاً و لكن لم تجرأ أي منصة على التعديل بخصوص خفض عدد الموظفين أو تحديد في رسوم السحب.أعتقد أن السبب الرئيسي هو إنهيار عملة لونا كما شهدنا جميعا فقد تسبب في خسارة أموال التجار و أيضاً المنصات التي بدورها على يبدو تأثرت بهذه الحركة و فقدت الكثير من الأموال لهذا السبب لم تقم أغلب المنصات من تشطيبها.كما أيضاً المستمرين الكبار كما أشارت قاموا بتحويل أموالهم إلى أخرى مربحة كالأسهم و الذهب، و أظن أيضاً في المستقبل القريب ستتعرض المنصات للإفلاس رغم هذه كل هذه التحديثات، لهذا سيكون تخزين الأصول في محافظ الخارجية أفضل بكثير لأن في حالة تعرض هذه المنصات للإفلاس بشكل التهائي سيكون من المستحيل تعويض المتداولين لأنه بمجرد الغرق سيتم تجميد الأصول و مصادرتها من المستخدمين من خلال تغيير القيود و البنود في حالات طارئة.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OmegaStarScream",
      "created_time": "June 17, 2022, 03:17:06 PM",
      "body": "Quote from: Kavelj22 on June 15, 2022, 10:58:04 PMعلى ما يبدو فان موجة الركود العام بدأت تلقي بضلالها على أقوى اللاعبين في المجال. و الذي يعكس فعلا ان حجم سوق التداول قد تراجع بشكل ملحوظ اذ ان المنصات مفروض ارباحها تتأتى اساسا من الرسوم على عمليات التداول و السحب.صراحة، الأمر يبقى غريبا بعض الشئ بالنسبة الى، لسبب واحد::كيف يمكن لهذه المنصات أن تقوم بانفاق ملايين دولار[1] على حملات تسويقية (التي أرى أنها تافهة و لا تساعد بالكثير مقارنة بطرق التسويق الأخرى) عوض تطوير و العمل على تحسين خدماتها، لكي تقوم بالتالي بطرد موظفيها بمجرد انهيار الأسعار؟ أضف الى أن هذه المنصات تعلم طبيعة العملات المشفرة، يعني من غير المنطقي أن نقول أن هذا النوع من التقلبات في الأسعار شئ غير متوقع أو جديد عليها[1] https://www.theblock.co/post/124583/crypto-com-spending-700-million-cash-rename-staples-center-los-angeles",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OmegaStarScream",
      "created_time": "January 13, 2023, 07:58:40 AM",
      "body": "يبدو أن المنصات قد عادت لطرد موظفيها من جديد بسبب حالة السوق، حيث أعلنت منصة كريبتو منذ قليل عن تسريح 20 بالمئة من موظفيها.[1]كما قامت منصة Coinbase باعلان مماثل منذ بضعة أيام، و سوف تقوم بطرد 25 بالمئة من موظفيها (950 موظف)[2][1] https://techcrunch.com/2023/01/12/crypto-com-cuts-20-jobs-amid-unforeseeable-industry-events/[2] https://www.nytimes.com/2023/01/10/business/coinbase-layoffs-crypto.html",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kavelj22",
      "created_time": "January 13, 2023, 05:04:58 PM",
      "body": "Quote from: OmegaStarScream on January 13, 2023, 07:58:40 AMيبدو أن المنصات قد عادت لطرد موظفيها من جديد بسبب حالة السوق، حيث أعلنت منصة كريبتو منذ قليل عن تسريح 20 بالمئة من موظفيها.[1]كما قامت منصة Coinbase باعلان مماثل منذ بضعة أيام، و سوف تقوم بطرد 25 بالمئة من موظفيها (950 موظف)[2][1] https://techcrunch.com/2023/01/12/crypto-com-cuts-20-jobs-amid-unforeseeable-industry-events/[2] https://www.nytimes.com/2023/01/10/business/coinbase-layoffs-crypto.htmlمنصتي crypto.com و coinbase هما من اكبر المنصات في الكريبتو و اظن ان تزامن تسريحهما لهذه النسب المرتفعة من العمالة يعكس تأثرهما بحالة السوق و يؤكد تراجع نسب الاقبال. على حد علمي فان منصة coinbase هي الأكثر استخداما في الولايات المتحدة و منصة crypto.com كانت شرعت في افتتاح فروع لها في اماكن مختلفة حول العالم خصوصا دول في اسيا و افريقيا حيث مفترض ان نسب التبني لاستخدام الكريبتو ترتفع بشكل متزايد مقارنة بدول اخرى.ليس من المنتظر ان يعود السوق الى حالة التعافي سريعا بما ان تراجع نسب الاقبال يؤثر على جميع عناصر السوق بما في ذلك المنصات نفسها التي ثبت بالكاشف انها غير قادرة على تحمل تقلبات كبيرة. في حين انهارت منصات تقدم خدمات عديدة فان البعض صمد و اكتفى بتسريح الموظفين لكن هذا قد يكون اول خطوة لاتخاذ اجراءات اكثر تأثيرا قد تشمل اقفال فروع لها حول العالم.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}