{
  "id": "topic_5436043",
  "title": "Crypto Library",
  "author": "Crypto Library",
  "created_time": "January 19, 2023, 05:31:28 PM",
  "content": "Many times when we upload an image in the forum firstlyIts size looks very large and it's not good its view doesn't looks good, then for a getting perfect view we edit the width and height of the image.I usually use an extension on the computer and it's called LightShot to do this measurement.when I need to resize the image size firstly I view that Image then by pressing CTRL+MOUSE SCROLL BUTTON  zoom out Then when a correct size is chosen I measure it through the lightshot extension like this. 1.2. Using lightshot and selecting area for the measure and the perfect size for view is 511*246.Extention: Lightshot (screenshot tool)⏩ Now I actually want to know if there is any more easier way for getting the perfect image view size? ⏩ And the process I showed is only applicable for computer, many times when I am working on mobile I can't select the right size for Images easily like this. Is there any way for mobile?Thank youヽ(•‿•)ノ",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5436043",
  "comments": [
    {
      "author": "NotATether",
      "created_time": "January 19, 2023, 05:55:41 PM",
      "body": "I just eyeball the size and compare it with the common screen resolutions like 1024x768.It's easier if you work in terms of one dimension. So either the width or the height. Don't try to adjust both of them or you're going to break the aspect ratio. If you need to place multiple images next to each other, just modify the width and leave the height alone.The high screen resolutions of mobiles and some screens are cancelled out by the high DPI settings for some displays. So this doesn't affect your image size so much. You can just assume you're resizing for a normal PC screen.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ultegra134",
      "created_time": "January 19, 2023, 06:06:24 PM",
      "body": "Useful guide, mostly for newbies since I also eyeball the size by making an educated guess based on experience and screen resolution like the previous poster already mentioned. However, I'd like to point out that if you're planning to share confidential information, Lightshot isn't a safe option since their generated URLs can easily be modified and enable you to snoop at others' photos. I know that the OP is providing a guide in order to help users post images on the forum, but it's easy to keep using it for other purposes too if you install it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hosemary",
      "created_time": "January 19, 2023, 07:15:53 PMLast edit: January 19, 2023, 07:34:58 PM by hosseinimr93",
      "body": "You don't have to use a third party for changing the image size.You can simply use the width and height in the bbcode to change the image size. Code:[img height=X]ImageURL[/img][img width=X]ImageURL[/img]Repalce the X with the your desired width or height. With using the above bbcode, the aspect ratio would be mainted. You can also use the following bbcode to spesify both width and height.Code:[img width=X height=Y]ImageURL[/img]Edit:I just noticed you have used the same bbcodes. So, you know how it works. I don't understand why you should use a thrid party as you can change the image size in the forum and with a simple bbcode. Am I missing something here?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Crypto Library",
      "created_time": "January 19, 2023, 07:35:37 PM",
      "body": "Quote from: hosseinimr93 on January 19, 2023, 07:15:53 PMI just noticed you have used the above bbcodes. So, you know how it works. I don't understand why you should use a thrid party as you can change the image size in the forum and with a simple bbcode. Am I missing something here?What I actually mentioned here is how to get the correct size of the image for a decent view on bitcointalk forum And for this, third party tools have to be used to know the size of the image. I know what you have mentioned but using it to know the amount of width and height, just giving the bbcode of width and height will not work.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "January 19, 2023, 10:12:32 PM",
      "body": "Good way but you can modify the image using this codeCode:[img width=48 height=48]http://somesite/image.gif[/img]I personally prefer to use this code with all images of inappropriate sizes.Code:[imgheight=150]IMG.png[/img]The problem remains if you do not want parts of the screenshot, and then the solution that you explain above is enough to solve this problem.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "January 19, 2023, 10:29:58 PM",
      "body": "Quote from: Crypto Library on January 19, 2023, 07:35:37 PMWhat I actually mentioned here is how to get the correct size of the image for a decent view on bitcointalk forum And for this, third party tools have to be used to know the size of the image.Just as NotATether said, you don't need to know the actual image width and height to make it look good when you're adding oneHere is your image with just the width you measured and two random ones: Quote from: Crypto Library on January 19, 2023, 05:31:28 PMDo you see any real difference or any stretching happening or are the two not \"decent\"?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Smartvirus",
      "created_time": "January 19, 2023, 10:45:11 PM",
      "body": "Quote from: hugeblack on January 19, 2023, 10:12:32 PMGood way but you can modify the image using this codeCode:[img width=48 height=48]http://somesite/image.gif[/img]I personally prefer to use this code with all images of inappropriate sizes.Perhaps what's contained in OP is cool but given the fact that, not all users access the forum with there computer devices and at times, one might be indisposed to access a computer system and still want to access the forum with there mobile devices, you might not have that liberty of image size adjustment on a mobile device if what is contained in OP is all you know. That's why, it's important to study the codes that works just fine on the forum. Your not limited by any means once you can wrap your head around it, you replicate it  preview it to see if it fits and continue to make your adjustment until its good enough for you.Hence, the code format as at above is definitely better.You might want to move this thread to beginners and help though. I think it's best suited there.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "decodx",
      "created_time": "January 19, 2023, 11:13:26 PM",
      "body": "Quote from: Crypto Library on January 19, 2023, 07:35:37 PMQuote from: hosseinimr93 on January 19, 2023, 07:15:53 PMI just noticed you have used the above bbcodes. So, you know how it works. I don't understand why you should use a thrid party as you can change the image size in the forum and with a simple bbcode. Am I missing something here?What I actually mentioned here is how to get the correct size of the image for a decent view on bitcointalk forum And for this, third party tools have to be used to know the size of the image. I know what you have mentioned but using it to know the amount of width and height, just giving the bbcode of width and height will not work.There's no need to rely on external tools to find the optimal image size. You can experiment with different image dimensions and use the Preview function to determine the size that produces the desired effect. Once you've found the ideal size, make note of the values for future use.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LTU_btc",
      "created_time": "January 20, 2023, 12:42:30 AM",
      "body": "There is many guides about posting images on Bitcointalk, but this one have very useful lifehack for me. I use Lightshot app for many years, but I never thought that I can use to measure image size and check how well or bad it will look on Bitcointalk. When I post images, I often struggle playing with numbers until I find right of image. It's too big, it's too wide, too narrow and etc. So, this thing will save me some time.Quote from: hosseinimr93 on January 19, 2023, 07:15:53 PMI don't understand why you should use a thrid party as you can change the image size in the forum and with a simple bbcode. Am I missing something here?Offcourse that you can use bbcode and play with numbers manually until your image will look fine. Maybe others don't have such problem, but for me it's not that easy to find right numbers.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "January 20, 2023, 07:08:02 AM",
      "body": "Quote from: LTU_btc on January 20, 2023, 12:42:30 AMOffcourse that you can use bbcode and play with numbers manually until your image will look fine. Maybe others don't have such problem, but for me it's not that easy to find right numbers.You don't need a lot of adjustments if you just set the height to a fixed number, 150 looks perfect for most photos so it's fastest if your photo doesn't need a specific setting.Offtopic:Does anyone know if I will get a notification if someone edits their reply while I writing?I wonder why I repeated @hosseinimr93 code even though I remember that no one wrote it before.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hosemary",
      "created_time": "January 20, 2023, 08:59:51 AM",
      "body": "Quote from: hugeblack on January 20, 2023, 07:08:02 AMDoes anyone know if I will get a notification if someone edits their reply while I writing?No. You don't get notification for that. You get notification only if someone makes a new reply while you are posting. I didn't edit my post when you were posting. If you hover your mouse pointer over my post time, you see that the last edit has been made on 7:34 PM. You made your post around 3 hours later. Quote from: hugeblack on January 20, 2023, 07:08:02 AMI wonder why I repeated @hosseinimr93 code even though I remember that no one wrote it before.  Maybe, you had me on your ignore list.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "leonair",
      "created_time": "January 20, 2023, 09:08:31 AM",
      "body": "Quote from: Crypto Library on January 19, 2023, 05:31:28 PMit is a good tools only for Crop area while taking screenshot but But this is not forum related.  You must use BBcode to customize the size of an image in this forum. Which code @hosseinimr93 already showed once.Code:[img width=511 height=246]CryptoLibrary.png[/img]I don't think it can play any important role in the forum.  But it's helpful for other tasks like quickly selecting only important areas when taking screenshots.Where cropping is not required later.  Thanks for this op",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fretum",
      "created_time": "January 26, 2023, 12:57:58 PM",
      "body": "There are different ways to measure the width and height of an image, depending on the format and the tool you are using.One common way to measure the width and height of an image is by using image editing software, such as Adobe Photoshop or GIMP. These programs allow you to open an image and view its properties, which typically include the width and height in pixels.You can also measure the width and height of an image using the built-in image viewer of your operating system. For example, in Windows, you can right-click on an image file, select \"Properties,\" and then view the \"Details\" tab to see the image's width and height.You can also use programming languages such as Python or JavaScript to measure the width and height of an image. In Python, you can use the library Pillow to open an image file and read its size. In JavaScript, you can use the HTML5 canvas element to draw an image and then read the width and height of the canvas.In addition, you can also use online tools such as \"imagesize.com\" to measure the width and height of an image by simply uploading the image.Keep in mind that the width and height are measured in pixels for digital images, and that resolution and size of the image can be different.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}