{
  "id": "topic_5431555",
  "title": "Riocasino",
  "author": "Riocasino",
  "created_time": "December 26, 2022, 12:58:36 AMLast edit: December 26, 2022, 02:24:20 AM by Riocasino",
  "content": "I am 28 many people start to have kids. But i feel like i dont rdy for this shit. At tve same time i feel like it will be easer to make family now and fine good wife now when im young than in my late 30s.I feel like i dont want kids in commitment and just be free.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5431555",
  "comments": [
    {
      "author": "mich",
      "created_time": "December 28, 2022, 07:17:45 AM",
      "body": "At 28 years old, you still have lots of time to have kids. That saying “You should have kids in your twenties to mid-thirties” does not have to be done. Do not feel like it is the end of the world, and it can only lead to anxiety. Shockingly, life can move forward, and one can choose their career over starting a family. There should not be any unnecessary pressure to start a family. First off, I would have to find a partner, which we all know that there are several stages. Logically, making realistic goals to keep going to accomplish those goals is valuable starting a family.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DeathAngel",
      "created_time": "December 28, 2022, 10:33:48 AM",
      "body": "There are no rules on when you have to settle down & have a family. As a man especially, there is no rush. Your reproductive, biological clock has a lot more mileage available on it than our female counterparts.It’s better to get a settled job & home, become financially stable & then find a wife & think about kids. I understand if you were 40 & beginning to worry but 28 is no age at all. You are in the prime of your life, you can relax & not set deadlines on having a family just yet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Amirhen",
      "created_time": "December 30, 2022, 01:09:53 PM",
      "body": "In fact, finding a good wife is not so easy  In general, children are a big responsibility.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DeathAngel",
      "created_time": "December 30, 2022, 01:36:49 PM",
      "body": "Quote from: Amirhen on December 30, 2022, 01:09:53 PMIn fact, finding a good wife is not so easy  In general, children are a big responsibility.Both points are very true but a good wife & subsequently having children are gifts. There is no rush for the OP, he is a young man. A wife & kids are hard work but we all know about proof of work here as bitcoin lovers Anything good takes hard work, great things in life do not come easily.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fretum",
      "created_time": "December 30, 2022, 02:22:33 PM",
      "body": "I don't believe that you always have to behave the same way at a certain age. There are too many external influences that affect it. My parents had already married at 25 and I had just come into the world. Both of them already had steady jobs and their own apartment.At 25, I had just finished my studies and couldn't even afford my own apartment. How was I supposed to finance the life of my family?I would not look sos ehr on others, as long as you are satisfied yourself, you do not have to follow other people. Who says that their way is good for you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "len01",
      "created_time": "December 30, 2022, 08:09:16 PM",
      "body": "Quote from: Amirhen on December 30, 2022, 01:09:53 PMIn fact, finding a good wife is not so easy  In general, children are a big responsibility.nothing is difficult if you have the courage to move on in your life to marry and start a family.mate is a reflection of yourself. if you have a good personality and don't have bad manners, you will also find a good wife like you. so if you want to find a good wife, change in your life to be a better person before looking for a wife.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Tousenmur",
      "created_time": "December 30, 2022, 09:06:23 PM",
      "body": "I regret that I got married early don't make that mistake)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}