{
  "id": "topic_5413305",
  "title": "SeeBiscuit",
  "author": "SeeBiscuit",
  "created_time": "September 12, 2022, 05:28:23 PMLast edit: May 08, 2024, 04:28:12 AM by SeeBiscuit",
  "content": "",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5413305",
  "comments": [
    {
      "author": "jackg",
      "created_time": "September 12, 2022, 05:56:51 PM",
      "body": "I think git is hard to learn if you don't know programming/working with command lines, but if you do then you'll get a pretty good understanding pretty quickly - it might be unnecessary to learn if you're not going to need it.I found the wikis a good place to learn (bitcoin.it for example) and it's very good to supplement it with forum topics. If you don't know so much you might want to wait a few days and then go through a deep dive of what you've missed in that time to see if anything interesting has come up (especially because you'll get less unanswered questions if topics already have multiple answers).There's a lot of suggestions for airgapping wallets and many tutorials too. You might want to add if there's specific wallets you're interested in. The most beginner friendly is probably Electrum, but you can airgap with most.For fun facts, every now and then some information gets released that's quite interesting. There's always the older topics in a lot of sections that people like to look through (eg the marketplace section from the very early days - you can sort posts via date modified by clicking that button at the top). There's also historic correspondence between devs/satoshi that are findable and released in places too (I think some emails were made public as well).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "September 12, 2022, 06:18:21 PM",
      "body": "All threads in this board are equally newbie-friendly (so as long as you don't beg for merit, troll, spam, plagiarize - the usual culprits).The reality is that your rank does not indicate your technical competence. A lot of Core Devs and researchers here actually have Member and Full Member accounts, only because they hardly use the forum - yet their advice is valued.You can start by asking your questions in any thread you please, there is no minimum intellect required for posting such things - of course don't go around here asking how to get rich quick of course.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "odolvlobo",
      "created_time": "September 12, 2022, 09:08:32 PM",
      "body": "Quote from: SeeBiscuit on September 12, 2022, 05:28:23 PMThings I am interested in learning more about:-Github-bitcoin software-Technical fun facts that most don't know-Step by step guides to air gapping (I personally love laptops and want the main device that I use to hold my coins on to be on an air gapped one.)-How to generate private keys offline and how to \"broadcast a transaction from a different wallet\"  I don't feel that any of those are really relevant to Development & Technical Discussion, and I hope I am not being an asshole for saying that this sub-forum is intentionally not newbie-friendly. Looking at the posts here, you can see that at least basic understandings of software development, cryptography, and the bitcoin protocol are necessary to participate effectively.I think that you will find all the information that you might be looking for (other than info about Github) in the Bitcoin Discussion and Beginners & Help forums. Also, Bitcoin Technical Support might be interesting to you since it gives some insight into the the inner workings.I recommend reading the book Mastering Bitcoin by Andreas Antonopulous. You can buy it in book form here: https://www.amazon.com/Mastering-Bitcoin-Programming-Open-Blockchain/dp/1491954388 or download a PDF here: https://archive.org/download/MasteringBitcoin2nd/Mastering%20Bitcoin%202nd%20.pdfHaving written all that, I still look forward to your participation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "September 13, 2022, 03:28:37 AM",
      "body": "There is a contradiction between being a newbie and having technical discussion. Specifically because most of the questions a newbie would have is already answered and all it takes is a quick search on google.Quote from: SeeBiscuit on September 12, 2022, 05:28:23 PM-bitcoin softwareThat's too broad. You should narrow it down to what software and what about that software.Quote-Technical fun facts that most don't knowThis is interesting, I'd say this would be all the \"special\" cases and sometimes things that are considered non-standard in bitcoin. For example your scriptpub (output script) can be anything even an invalid script of any size like almost 1 MB!Quote-Step by step guides to air gapping (I personally love laptops and want the main device that I use to hold my coins on to be on an air gapped one.)Here is an old topic that should still be valid: https://bitcointalk.org/index.php?topic=853288.0",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zaguru12",
      "created_time": "September 14, 2022, 06:15:33 AM",
      "body": "Quote from: SeeBiscuit on September 12, 2022, 05:28:23 PM I really want to increase my insight into the technical aspect of bitcoin, firstly because I love learning new things, and secondly I want to become one of those people that actually knows what they are talking about, instead of pretending to know. I have little understanding, background, or experience when it comes to Software Development, Computer Science, and the many different coding languages of the internet. You are definitely at the right forum and board. The fascinating thing is you gain technical knowledge without paying a dime(the only ultimate price is obeying the forum rules).Once you get stucked please ask questions, there are experts here who are more than happy to help you out. People like me learn from questions asked here.You can as well go to bitcoin technical support there bunch of knowledge there too to have grasp over",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}