{
  "id": "topic_5447299",
  "title": "asyezuner",
  "author": "asyezuner",
  "created_time": "April 02, 2023, 05:50:59 PM",
  "content": "There are many peoples who getting risk in market bust many peoples are walk away because there is some reasons they not know about potential Most people throw there money because they didn't have and basic skills. If they give some time to learn about that then can be success.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5447299",
  "comments": [
    {
      "author": "Hamza2424",
      "created_time": "April 02, 2023, 11:55:26 PM",
      "body": "This topic is already covered i think, it was crypto vs stocks i am not familiar with the stocks market and i cant give any comments on it. If you want to know anything about crypto market then maybe i can help you somehow. For a simple overview i will recommend to go with crypto because i know to to go with it hahha. As we use to say i can tell you what i know rest is upto you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GreatArkansas",
      "created_time": "April 03, 2023, 02:05:30 AM",
      "body": "Quote from: asyezuner on April 02, 2023, 05:50:59 PMThere are many peoples who getting risk in market bust many peoples are walk away because there is some reasons they not know about potential (...)When it comes to investing, it's important to be careful and think about the long-term. Cryptocurrency or non-cryptocurrency related,this is because the market can go up and down at any time. By staying up-to-date and making wise choices, people can increase their chances of making more money and reaching their financial objectives.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tbct_mt2",
      "created_time": "April 03, 2023, 03:05:47 AM",
      "body": "Quote from: GreatArkansas on April 03, 2023, 02:05:30 AMWhen it comes to investing, it's important to be careful and think about the long-term. Cryptocurrency or non-cryptocurrency related,this is because the market can go up and down at any time. By staying up-to-date and making wise choices, people can increase their chances of making more money and reaching their financial objectives.Investing must be started and maintained with a long term vision and long term plan. You can not invest successfully without strong belief in something you want to invest in, and without long term vision and plan.Trading is different than investing and it relates to shorter time windows. Because you can not control things in life in your nation and over the globe, things in economic, politics, regulatory areas so trading should be with short time window. You must have clear plan that they can exit market immediately when you need to cut loss to protect your capital.However, no one can time the market so trading potentially leads to loss rather than profit.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lorence.xD",
      "created_time": "April 03, 2023, 04:03:36 AM",
      "body": "It's simple from OP stated issue, as newbies just started trading or investing if they don't have the knowledge about how it works even the basic then they probably will loss a lot. It's common sense to not risk your money if you don't have any idea how it works. Investing and trading have difference, it definitely depends what suits for you, if you prefer long term profits then take investment or quick flips to earn money in trading. But that is not just simply \"put your money\" in investment and trade. You can always lose your money due to the volatility of the market. Don't rush yourself to gain profits, take your time to learn and enhance your skills for you to develop yourself.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TheUltraElite",
      "created_time": "April 04, 2023, 10:28:31 AM",
      "body": "Quote from: asyezuner on April 02, 2023, 05:50:59 PMThere are many peoples who getting risk in market bust many peoples are walk away because there is some reasons they not know about potential Most people throw there money because they didn't have and basic skills. If they give some time to learn about that then can be success.  It is about a lot of things not just basic skills but also how you apply them, your previous experience and timing. People lose money due to some common mistakes like not analyzing the price charts and buying at the wrong time on the wrong asset.Dummy trading can teach a lot of skills to those who are new to this. But after a while I have realized that trading is not for everyone - you need to start accepting this. Even long term holding is not for everyone which seems to be the safest type of spot trading. For them even years of experience teaches nothing and they keep making mistakes.For someone who is starting try learning how to trade and do dummy trading on paper.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "palle11",
      "created_time": "April 04, 2023, 10:39:30 AM",
      "body": "Quote from: asyezuner on April 02, 2023, 05:50:59 PMMost people throw there money because they didn't have and basic skills. If they give some time to learn about that then can be success. You need to know that there is a relationship between trading and passion. For someone who doesn't have the passion for trading then they will back out at little trading difficulties when they are not able to make profit. Trading is not for everybody just like other profession won't suite others. For trading, you require a high level of patience before you can get some level of success. So giving some time is about patience and it is not everyone that can stay on the process of learning because most traders won't fast money and trading don't give you that if you have not gone through the ropes.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jossiel",
      "created_time": "April 04, 2023, 10:55:23 AM",
      "body": "And those moments that they're throwing money are part of their plans to learn more from it. Someone who just plainly losing and throws money without getting any value back from it is totally wasting money.There are people that understands that process and they'll learn from doing that. While others are discouraged to keep on getting losses, a few of them are using it as a motivation to become better traders.Nevertheless, we have to remember that majority are losing in trading and those who wins have gone through huge losses as well.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}