{
  "id": "topic_5434956",
  "title": "Greg Tonoski",
  "author": "Greg Tonoski",
  "created_time": "January 16, 2023, 01:35:38 PM",
  "content": "Is it possible to profit from collapses of altcoins? Do you have any ideas how to?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5434956",
  "comments": [
    {
      "author": "kizlod",
      "created_time": "January 16, 2023, 01:42:29 PM",
      "body": "Of course you can, you can short it on exchanges. But, obviously, you have to do that before it collapses. After that, I don't see any way to get profits from it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MArsland",
      "created_time": "January 16, 2023, 01:44:49 PM",
      "body": "Quote from: Greg Tonoski on January 16, 2023, 01:35:38 PMIs it possible to profit from collapses of altcoins? Do you have any ideas how to? Not sure what you want to invest in an altcoin that is obviously collapsing but want to put some money into it. It's the same as you throwing money into the grave of the dead. After all if you want to invest or trade there are plenty of other altcoin options to choose from, instead of dropping money into an altcoin with no clear future why are you still interested?My question is on what basis do you believe in a crypto project that collapsed as if expecting big investors to come and pump it overnight?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tvplus006",
      "created_time": "January 16, 2023, 01:47:36 PM",
      "body": "Quote from: kizlod on January 16, 2023, 01:42:29 PMOf course you can, you can short it on exchanges. But, obviously, you have to do that before it collapses. After that, I don't see any way to get profits from it.Obviously, when the price of the coin reaches the lowest value, you can buy it. This is exactly what investors are doing in a bear market. So if you have the necessary capital, you can form your portfolio for long-term investments and if you have selected good coins for this, they will bring you a decent profit in the future.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dbshck",
      "created_time": "January 16, 2023, 01:49:13 PM",
      "body": "Yes, you can do so by creating a short position. Depending on the market availability of the altcoin, you can create a short position via perpetual contract, futures contract, or selling spot using margin, available in many centralized exchanges and DeFi platforms.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Greg Tonoski",
      "created_time": "January 16, 2023, 01:58:56 PM",
      "body": "Quote from: dbshck on January 16, 2023, 01:49:13 PMYes, you can do so by creating a short position. Depending on the market availability of the altcoin, you can create a short position via perpetual contract, futures contract, or selling spot using margin, available in many centralized exchanges and DeFi platforms.Could you give an example of a way to profit from $BNB collapse (assuming it follows $FTT fate), perhaps?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coinerer",
      "created_time": "January 16, 2023, 02:25:53 PM",
      "body": "Quote from: Greg Tonoski on January 16, 2023, 01:35:38 PMIs it possible to profit from collapses of altcoins? Do you have any ideas how to? It's not guaranteed.  but many alt coins often pumped well even collapses.  So if you understand that and invest in one of the potential altcoins, you will be able to profit from it. When investing you must keep a cool head and do a good analysis before investing in an altcoin.  Then you will be able to profit in any situation of market. But if you don't invest with good understanding and analysis, you will face losses even in good situations.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dbshck",
      "created_time": "January 16, 2023, 02:37:33 PM",
      "body": "Quote from: Greg Tonoski on January 16, 2023, 01:58:56 PMQuote from: dbshck on January 16, 2023, 01:49:13 PMYes, you can do so by creating a short position. Depending on the market availability of the altcoin, you can create a short position via perpetual contract, futures contract, or selling spot using margin, available in many centralized exchanges and DeFi platforms.Could you give an example of a way to profit from $BNB collapse (assuming it follows $FTT fate), perhaps?The easiest way would be to create a short position on BNB/USD perpetual market, which is available in many reputable exchanges like Bybit and OKX (just avoid Binance if you're expecting it to collapse). To get started, create an account on the exchange, complete the KYC, and deposit some collateral, usually in the form of USDC or USDT.Once your account is set up, go to the BNB perps market and start trading. Determine your desired selling price and position size, and then click on the short/sell button. Shorting is essentially borrowing the token, selling it, and later buying it back at a lower price. The profit will come from the difference between the selling and buying price. For example, shorting 1 BNB at $300 and closing it at $290 will give you a $10 profit, minus trading fees.It's worth noting that trading derivative contracts and margins can be complicated, so I would encourage you to familiarize yourself with the concept and risks before jumping in with real money. I think Binance actually has some of the best learning materials for this https://www.binance.com/en/support/faq/a-beginner-s-guide-to-futures-trading-website-360039304272",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yatsan",
      "created_time": "January 16, 2023, 03:24:16 PM",
      "body": "Sell short at Binance or other trading platform which would allow you to do so. Problem would be your 'timing' of when to sell and which coin to sell ofcourse 'coz if it happen that you sell short and the market price suddenly recover, you'd be in loss. The market itself is unpredictable which makes Trading difficult. If you are simply asking for a way to earn profit even if the market is down, easily, then there's no such thing as a shortcut to win. You'll need to have the skills to do so. Much better if you'll just wait for recovery to take place in this industry if you ain't ready to risk that much. That is the only way to survive the bearish market trend.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hamza2424",
      "created_time": "January 16, 2023, 03:45:17 PM",
      "body": "Haha, I am not sure what OP is asking about. As for collapse how do you know that this particular Altcoin is going to collapse? As in LUNA's case nobody was sure until LUNA dumped to the 1$. So dear you can't make a profit as you can't see the future. You can profit in one case if some coin is already dumping and it is available to be tarded in future option.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptoYar",
      "created_time": "January 16, 2023, 04:47:38 PM",
      "body": "Quote from: Greg Tonoski on January 16, 2023, 01:35:38 PMIs it possible to profit from collapses of altcoins? Do you have any ideas how to? No, and yes!If the token is not available in futures trading then you can not make a profit from a token's collapse.If the token has futures trading pairs on any centralized exchange then you can short it and make some profits. On one hand, people lost money in FTT and LUNA, on the other hand, some people made huge profits by shorting so you can do the same if something like this happens in the future.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "HmmMAA",
      "created_time": "January 16, 2023, 09:03:07 PM",
      "body": "Quote from: Greg Tonoski on January 16, 2023, 01:58:56 PMCould you give an example of a way to profit from $BNB collapse (assuming it follows $FTT fate), perhaps?Another way to profit from an altcoin collapse is to buy put options. However, note that the availability of put options for altcoins is currently limited and offered by not many exchanges . As for the BNB that i see you are interested you can buy options from Binance exchange . I'd suggest you to educate first on how options work and then proceed to any trade. Best of luck in what you decide to do .",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rhomelmabini",
      "created_time": "January 16, 2023, 09:23:22 PM",
      "body": "Quote from: Greg Tonoski on January 16, 2023, 01:35:38 PMIs it possible to profit from collapses of altcoins? Do you have any ideas how to? That's the only way you profit if you bought it at low then sold it at high, what's impossible for that? The idea is to have proper risk management on every investment you venture to since you don't know when is the time the coin/token may up or down in price. Risk management should always come at hand first.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kelvinid",
      "created_time": "January 16, 2023, 09:27:15 PM",
      "body": "Quote from: Greg Tonoski on January 16, 2023, 01:35:38 PMIs it possible to profit from collapses of altcoins? Do you have any ideas how to? The dumping market isn't the end of crypto but rather consider this as an opportunity to start. Many people are buying during the bear season because they believe in the market recovery which is actually what they have seen in the past. You can make similar to this if you want to make money from here. Stop thinking that the market will die as it won't for sure. Take a picture of what it happened in the past so you can also have an idea of what you gonna do next. But this only happen when you have the courage and trust in crypto.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "WalkerIVIV",
      "created_time": "January 16, 2023, 11:10:09 PM",
      "body": "if it's spot, you should seek chance of making profit through the small pumps that usually occurs along the way, but of course that way you're also have the risk of catching the knives that is if you try to make entry meanwhile after that the market is still going down you're quite literally losing, I think the realistic choice is simply having short position then that way if market dumps you gonna still make profits that is if you could manage.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "serjent05",
      "created_time": "January 16, 2023, 11:22:08 PM",
      "body": "Quote from: Greg Tonoski on January 16, 2023, 01:35:38 PMIs it possible to profit from collapses of altcoins? Do you have any ideas how to? You can either short-sell the cryptocurrency or if it is available, you can invest in an inverse ETF that increases in value when the underlying asset decrease in value.  Though pls. be reminded that it is a very risky investment so you should be well aware of the potential risk and possible losses if your assumption of an altcoin collapsing did not materialize.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "n0ne",
      "created_time": "January 16, 2023, 11:48:15 PM",
      "body": "Profiting out of altcoins collapse is possible. This needs to be done with the amount that one can afford to loss, because it is something like a gamble and gives assured return when invested on the leading altcoins on the top 100. I have seen more number of altcoins like Mina, Casper which reached the market with big hype reaching its bottom value. Investing on such coins for long term investment might get us good profit. This is just a suggestion, which I experienced based on the difference in price with which it reached the market to the present value.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "uneng",
      "created_time": "January 17, 2023, 12:14:47 AM",
      "body": "Buy the dip and hold until the next bull run. However, make sure you are choosing a legit and solid altcoin, and not dead altcoins which collapsed and have no recovery chances. Do your research, check who are the developers, what the concept of their altcoins is, if there is any important investor or sponsor behind, the practical usefulness of the altcoin. I would start checking what are the best alternatives available from the top 100 cryptocurrencies.On the other hand, if you are still in doubt after doing this and don't know which altcoins to invest, forget about them and go for Bitcoin. That is the safest crypto investment which is less likely to disappoint you on long run.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GreatArkansas",
      "created_time": "January 17, 2023, 12:45:48 AM",
      "body": "Quote from: Greg Tonoski on January 16, 2023, 01:35:38 PMIs it possible to profit from collapses of altcoins? Do you have any ideas how to? Yes, when you are trading, you can earn huge profits and loss huge also because of volatility. This is likely gambling also because I believe behind these pumps and dumps are manipulation from whales or other traders also.For, I will not touch anymore these altcoins, it's not active anymore, and some of the trading volumes could be manipulated.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bittraffic",
      "created_time": "January 17, 2023, 01:16:22 AM",
      "body": "When the price spiked up to 70% in a short period of time like in a week, it's gotta go down sometime either next week or the next which is an opportunity for you to sell now and buy back if you have plans to make money again and again. The idea is to buy low sell high as they always said.Waiting for its fall by the next days is the opportunity. There is the need for waiting time though and this is where people get impatient.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}