{
  "id": "topic_5417928",
  "title": "Dr.Bitcoin_Strange",
  "author": "Dr.Bitcoin_Strange",
  "created_time": "October 21, 2022, 07:30:07 PMLast edit: October 23, 2022, 03:51:17 PM by Dr.Bitcoin_Strange",
  "content": "In my consciousness, Bitcoin will unequivocally get better and better in the near future.        I know most people have had some unpleasant experiences with bank transactions, like that of the kiwi bank double charged customers Quote Hundreds of people were double-charged on Friday after a system failure impacted the connection between Kiwibank and Visa Debit Cards.Between 3.20pm and 3.35pm on Friday, 230 Kiwibank customers were charged twice for their purchases, with a total value of \"less than $10,000\" according to communications manager Kara Tait.  I had similar harsh experience with my bank.                Good day my friends. On the 13th of January 2022, I went to a supermarket and bought goods that were about $130 in my local currency. I paid with my debit card and got debited. On getting home that day, I received another debit of $130 from the same supermarket I had just left. I rushed to the supermarket and complained, but all they could point to was a network glitch, claiming that the problem was not from their end and that I should contact my financial institution.        I went to the bank and filed a complaint. I was told to wait 48 hours and the money would be reversed. I waited, and the money was reversed in 28 hours, less than the proposed hour. I have carried out lots of Bitcoin transactions but have not been double charged like my experience with the bank.        Bitcoin Double-spending: Double-spending is a potential flaw in a digital cash scheme in which the same single digital token can be spent more than once. This is possible because a digital token consists of a digital file that can be duplicated or falsified.Apart from the Double-spending problem of Bitcoin which is not very much difficult because a transaction verification mechanism (Blockchain) has been developed to combat this problem.       Since 2019, when I got into Bitcoin, I have not even read or seen any Bitcoin user complaining of having been double charged after sending Bitcoin to a Bitcoin wallet address. That confirms how Bitcoin transactions can not be compared to transactions that are based on a centralized system. Bitcoin will even grow from better to best in the future.Kind regards, Dr.Bitcoin_Strange 👺",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5417928",
  "comments": [
    {
      "author": "Nwada001",
      "created_time": "October 21, 2022, 07:44:36 PM",
      "body": "I have had a similar experience but the reverse was the case, where I visited a supermarket and apart all my purchase, on getting to my location all my two times payment which was made on the supermarket was reversed to my account which I realized few days after the purchase and I was wondering where the error was coming from. I have never encountered such an issue with any crypto transaction since I was introduced into the crypto community, it's just a high gas fee of eth back then... I have never been overcharged or double-charged before with crypto, and I think it's impossible unless it's something one will authorize by him with a smart contract call. if not it's nearly impossible. Since I have not used any crypto card before I don't know if any users have encountered such using the card.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptoHeadlineNews",
      "created_time": "October 21, 2022, 08:32:31 PM",
      "body": "Quote from: Dr.Bitcoin_Strange on October 21, 2022, 07:30:07 PM       Since 2019, when I got into Bitcoin, I have not even read or seen any Bitcoin user complaining of having been double charged after sending Bitcoin to a Bitcoin wallet address. That confirms how Bitcoin transactions can not be compared to transactions that are based on a centralized system. Bitcoin will even grow from better to best in the future.Yes,  you are totally right, because no digital currency has or can ever offer you the level of financial independency and security Bitcoin does to those who hodl it, and mostly in decentralized wallets where they have sole control over their money unlike banks. Bitcoin transactions can never be double charged, but that doesn't mean it can't be hack or frozen for those who stores it in centralized exchange such as \"Binance\". But however,  it's still far better compared to fiat as it is borderless and has no limit to  which amount one can transfer per day, week or month, just like most banks",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitcoinBarrel",
      "created_time": "October 21, 2022, 08:41:27 PM",
      "body": "Double spending isn't an issue if you wait for at least 1 (preferably 2) confirmations.This was more of a problem when Bitcoin first came out, as a user could send a transaction with one client and load the previous blockchain into another client.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hypnosis00",
      "created_time": "October 21, 2022, 10:28:43 PM",
      "body": "I have no experience like that but there is one reason that it causes double charges and that is when you are increasing your fees to make the highest priority. I made that once or twice, if you will set it to the lowest fee for example $1 and it takes a longer time to wait for the confirmations. But because you want it to arrive instantly, you pay an additional fee of another $1 or $2 in order to speed up the confirmation. Though the scenario is making you pay more than that regular fee, perhaps this is a solution for impatient people, however, I don't see it was a doubled charge but it is because we wanted it to happen.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitMaxz",
      "created_time": "October 21, 2022, 10:46:58 PM",
      "body": "Quote from: BitcoinBarrel on October 21, 2022, 08:41:27 PMDouble spending isn't an issue if you wait for at least 1 (preferably 2) confirmation.This was more of a problem when Bitcoin first came out, as a user could send a transaction with one client and load the previous blockchain into another client. Most exchange uses 3 or above confirmations to make sure no one would double-spend the transaction and even one confirmation will need huge power to reverse or to double-spend the transaction but only transaction with RBF.Before there were some online shops that I heard accepting BTC with 0 Confirmations they were bankrupt due to this issue and they learn that is why they now wait for 3 confirmations to make sure the transaction is irreversible.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Adbitco",
      "created_time": "October 22, 2022, 07:12:58 AM",
      "body": "Double spending is common with local bank instead. I have never done a transaction and got double spend in BTC, even there was a day I tried to make transaction with about 0.009 BTC and that was all I wanted to send at once so I initiated the transaction first with my trustapp but saying pending but I m still having the btc in my wallet was just surprised what was happening. So I tried sending same amount to same wallet they it refuses.Now taking of bank double charged you, to me it has happened almost in every month or so, but with the type of account I m holding I got immediately reversed without waiting for 24hrs or more. My advise to you is to visit your bank withdraw the amount you planned to used for the week and keep save in your house maybe anytime you would want to visit the shopping mall go with the cash otherwise most of shopping center are not considerate you could get disgrace with what would happen to you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jrrsparkles",
      "created_time": "October 22, 2022, 09:31:36 AM",
      "body": "I had lot of experiences with cards and digital pay wallets payments stuck due to the server issues between the payment processor and banks and due to lot of reasons. On few occasions I have to wait for few hours or forced to show my personal debit message to the merchant showing that I paid you and money got debited.With bitcoin the case is different if the transaction achieved one confirmation then that is the end of the story there is no way to reverse it practically.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ABCbits",
      "created_time": "October 22, 2022, 09:38:46 AM",
      "body": "Quote from: BitcoinBarrel on October 21, 2022, 08:41:27 PMDouble spending isn't an issue if you wait for at least 1 (preferably 2) confirmations.This was more of a problem when Bitcoin first came out, as a user could send a transaction with one client and load the previous blockchain into another client. Double charge (charged twice for same transaction) and double spend (using same UTXO/money on two different transaction) is different though. Double charge is essentially impossible on Bitcoin, unless you use buggy wallet which create 2 transaction which have identical receiver/amount (excluding change address).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o_e_l_e_o",
      "created_time": "October 22, 2022, 09:45:17 AM",
      "body": "Quote from: Dr.Bitcoin_Strange on October 21, 2022, 07:30:07 PMSince 2019, when I got into Bitcoin, I have not even read or seen any Bitcoin user complaining of having been double charged after sending Bitcoin to a Bitcoin wallet address.You cannot be \"double charged\" when spending bitcoin, outside of using a malicious wallet as ETFbitcoin has said above.When you send bitcoin from one address to another, the transaction knows which bitcoin to spend not based on the address they are currently present in, but based on the previous transaction which created those bitcoin outputs in the first place. Even if you have 100 BTC on one address and spend 0.01 BTC of those bitcoin, none of the other 99.99 BTC will have the same previous transaction as the 0.01 BTC you spent, meaning the transaction you made spending 0.01 BTC cannot be repeated or used again in order to double charge you.Double charging in fiat is when a malicious or bugged receiver pulls two sets of fiat from the spender. Double spending in bitcoin is when a malicious spender sends the same coin to two places, although obviously it will only ever end up in one of those places.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Darker45",
      "created_time": "October 22, 2022, 10:08:13 AM",
      "body": "Thanks to Satoshi for solving the double-spending puzzle. The big difference, however, is that bank transactions are generally reversible while Bitcoin transactions aren't. You may be wrongly charged twice with a banking system, but you can inform the bank about that and you are most likely reimbursed for it. On the other hand, in the event that somebody wrongly sent Bitcoin twice to somebody else, that can't be reversed anymore. This isn't technically what double-spending in Bitcoin is all about, though.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "8rch7",
      "created_time": "October 22, 2022, 10:22:16 AM",
      "body": "A bitcoin transaction fee is the fee for transferring a certain amount of bitcoin, it is directly proportional to the time it takes to validate and complete a transaction, the average btc transaction fee is steadily decreasing, a robust bitcoin network can process secure bitcoin transactions at lower fees, as long as I do bitcoin transactions I have never been charged double.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dr.Bitcoin_Strange",
      "created_time": "October 22, 2022, 11:01:34 AM",
      "body": "When a malicious  spender  sends the same Bitcoin to two addresses, it will only end up in one of them, according to o_e_l_e_o, but according to EftBitcoin,Double charging is essentially impossible on Bitcoin, unless you use a buggy wallet. Now my question is, does it mean this buggy wallet can cause a transaction to be successfully carried out and approved twice to two different receiver wallets?Quote from: o_e_l_e_o on October 22, 2022, 09:45:17 AMDouble spending in bitcoin is when a malicious spender sends the same coin to two places, although obviously it will only ever end up in one of those places.Quote from: ETFbitcoin on October 22, 2022, 09:38:46 AM Double charge is essentially impossible on Bitcoin, unless you use buggy wallet which create 2 transaction which have identical receiver/amount (excluding change address).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o_e_l_e_o",
      "created_time": "October 22, 2022, 11:09:07 AM",
      "body": "Quote from: Dr.Bitcoin_Strange on October 22, 2022, 11:01:34 AMWhen a malicious  spender  sends the same Bitcoin to two addresses, it will only end up in one of them, according to o_e_l_e_o, but according to EftBitcoin,Double charging is essentially impossible on Bitcoin, unless you use a buggy wallet.Those statements are not contradictory. A double spend is initiated by the person spending the bitcoin, and sends the same output to two different places. A double charge would be a malicious or buggy software sending two different outputs to the same place.Quote from: Dr.Bitcoin_Strange on October 22, 2022, 11:01:34 AMNow my question is, does it mean this buggy wallet can cause a transaction to be successfully carried out and approved twice to two different receiver wallets?While a buggy wallet may indeed attempt to double spend an unconfirmed transaction by mistake and without the user being aware, no transaction can ever be \"approved twice\". When one of the conflicting transactions is confirmed, the other is immediately invalidated.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EarnOnVictor",
      "created_time": "October 23, 2022, 07:19:55 AM",
      "body": "I have registered this as one of the benefits of Bitcoin, it can't double charge you, at least I have never witnessed such or read about it from anyone. Although the charges of Bitcoin transactions are not fixed, they could be high or lower, yet it would charge the person once, and the charges are always ridiculously low compared to fiat. Also, if one knows how to use the mempool very well, very low charges might be allocated always. This is an additional benefit compared to fiat which is fixed and always set by the sole operator (financial institution).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rokok lokal",
      "created_time": "October 23, 2022, 07:48:43 AM",
      "body": "Very interesting, It is very important to be aware of situations where double spending can occur and take precautions against them. But I think in one situation it is mandatory to complain if there is a double spending and the bank is trying to prevent it from happening again for the users (even though it's not their fault)Regarding your assumption that Bitcoin transactions are more accurate in my opinion because people put so much money into investing and it is possible that the address in question becomes valid and the transaction becomes real very high.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GreatArkansas",
      "created_time": "October 23, 2022, 09:32:25 AM",
      "body": "Quote from: Darker45 on October 22, 2022, 10:08:13 AMThanks to Satoshi for solving the double-spending puzzle. The big difference, however, is that bank transactions are generally reversible while Bitcoin transactions aren't. You may be wrongly charged twice with a banking system, but you can inform the bank about that and you are most likely reimbursed for it. On the other hand, in the event that somebody wrongly sent Bitcoin twice to somebody else, that can't be reversed anymore. This isn't technically what double-spending in Bitcoin is all about, though. Agree, this is one of the many differences between how the Bank works versus the Bitcoin works or the Centralized system versus a Decentralized system. When this occurs to these centralized platforms, they can easily revert or redo it.As others said below this is possible for Bitcoin but not on the network itself but the other platforms that use the Bitcoin network like on wallets or exchanges.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oshosondy",
      "created_time": "October 23, 2022, 10:37:39 AM",
      "body": "It is true that bitcoin transactions do not fail like bank transactions or while making use of payment gateway like MasterCard and Visa card. I have faced errors before, many times. There was even one product that I ordered on online mall in my country, the transaction was cancelled and gave me error but the money was deducted from my bank account, it was a very bad experience for me. Bitcoin is better and that is not debatable at all because fiat error transaction makes bitcoin to be superior, but with all these error in fiat, people can not still do without fiat, the government will make sure that their citizens are making use of fiat as a legal tender. If I should rate both fiat and bitcoin transaction, bitcoin is better, I prefer bitcoin 10 minute confirmation than fiat transaction error.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Z-tight",
      "created_time": "October 23, 2022, 11:46:12 AM",
      "body": "Quote from: EarnOnVictor on October 23, 2022, 07:19:55 AMI have registered this as one of the benefits of Bitcoin, it can't double charge you, at least I have never witnessed such or read about it from anyone.If your wallet doesn't have 'errors', a double charge can't happen in the bitcoin network, some member's have already made this point known in this topic, what can happen with BTC transactions is double spending, but it is not difficult to get around it, if you are a merchant that doesn't want to be a victim of race attacks, don't release goods or whatever it is until the transaction has six confirmations, another way double spend can happen is if a malicious miner has over 50% of the network's hashrate, but that is almost impossible to happen.Quote from: EarnOnVictor on October 23, 2022, 07:19:55 AMAlthough the charges of Bitcoin transactions are not fixed, they could be high or lower, yet it would charge the person once, and the charges are always ridiculously low compared to fiat.The OP was not alluding to transaction fees in this topic, but double charge which happens in fiat e-banking were customers can be deducted twice for a single transaction, but it can't happen in BTC, what can is double spend, also knows as race attacks because whichever conflicting transactions is added to the block by a miner first means the second one is disapproved.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "October 23, 2022, 12:26:21 PM",
      "body": "To be honest I've never experienced or heard anybody be double charged when using debit cards here.Quote from: Dr.Bitcoin_Strange on October 21, 2022, 07:30:07 PMThis is possible because a digital token consists of a digital file that can be duplicated or falsified.First of all there is \"file\" involved in any of the cryptocurrencies or tokens. There are only transactions.Secondly you can neither duplicate nor falsify a transaction output (aka coins). It is simply impossible.Double spending is not about duplicating the same transaction, but spending same coins more than once.QuoteApart from the Double-spending problem of Bitcoin which is not very much difficult because a transaction verification mechanism (Blockchain) has been developed to combat this problem.This is the most incomprehensible thing I've read here!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}