{
  "id": "topic_5469715",
  "title": "Maus0728",
  "author": "Maus0728",
  "created_time": "October 09, 2023, 07:26:26 AM",
  "content": "Hi everyone!!Just wanted to ask if there are people here who has an experience in doing p2p exchange in Binance as MERCHANT? Can anyone share their experience? Any tips on how to get started on a safe side? Your inputs are very much appreciated!For context, I am asking kasi gusto ko rin talaga mag establish ng panibagong active income since matagal na rin naman akong gumagamit ng service nila and feeling ko mas okay din kung i-buy and sell ko yung bitcoin stash na mayroon ako sa isang established platform. You know -- side hustle!!Very much appreciated.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5469715",
  "comments": [
    {
      "author": "arwin100",
      "created_time": "October 09, 2023, 07:50:46 AM",
      "body": "Quote from: Maus0728 on October 09, 2023, 07:26:26 AMHi everyone!!Just wanted to ask if there are people here who has an experience in doing p2p exchange in Binance as MERCHANT? Can anyone share their experience? Any tips on how to get started on a safe side? Your inputs are very much appreciated!For context, I am asking kasi gusto ko rin talaga mag establish ng panibagong active income since matagal na rin naman akong gumagamit ng service nila and feeling ko mas okay din kung i-buy and sell ko yung bitcoin stash na mayroon ako sa isang established platform. You know -- side hustle!!Very much appreciated.Wala pa akong nakikita na naka experience na maging merchant dyan sa Binance p2p dito kaya hirap siguro maghanap ng feedback nyan.Experience ko lang dun is magbenta directly sa mga merchants dun at so far smooth naman ang transactions na nagaganap pero take proper precaution parin naman kahit na magandang platform si binance may iilang loko-loko parin ang pumapasok.Kung gusto mo naman mag buy and sell dun siguro kailangan mo lang e establish ang service mo at tsaka reputation para ikaw ang piliin ng mga tao na pagbentahan ng mga balances nila. Maganda din siguro ang kitaan dyan since may mga matatagal ng merchants ang patuloy paring nag bebenta o bumibili. Kung may sapat lang din ako na puhunan gusto ko nga ring e try yan. Kumbaga maging currency exchange pero wala olats pa sa puhunan kaya sell na muna kadalasang ginagawa",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mr. Magkaisa",
      "created_time": "October 09, 2023, 07:54:24 AM",
      "body": "Quote from: Maus0728 on October 09, 2023, 07:26:26 AMHi everyone!!Just wanted to ask if there are people here who has an experience in doing p2p exchange in Binance as MERCHANT? Can anyone share their experience? Any tips on how to get started on a safe side? Your inputs are very much appreciated!For context, I am asking kasi gusto ko rin talaga mag establish ng panibagong active income since matagal na rin naman akong gumagamit ng service nila and feeling ko mas okay din kung i-buy and sell ko yung bitcoin stash na mayroon ako sa isang established platform. You know -- side hustle!!Very much appreciated.     -   Kung tama ang aking pagkakaintindi ay gusto mong maging isa sa mga merchant sa Binance p2p, tama ba?siguro basahin mo nalang itong link na ibibigay ko sayo mate https://c2c.binance.com/en/merchantApplicationMaganda yang iniisip mo isang karagdagang source of income yan, ako parang gusto ko din kaya lang nag-iipon pa ako kasi medyo malakidin ang kailangan nilang amount para maging merchant ka sa p2p sa Binance platform, wala pa ako sa ngayon ng ganung budget, good luck sayo mate. o kaya panuorin mo ito ang guidelines : https://www.youtube.com/watch?v=NZuIN2JEz9k",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bettercrypto",
      "created_time": "October 09, 2023, 08:15:12 AM",
      "body": "Quote from: Maus0728 on October 09, 2023, 07:26:26 AMHi everyone!!Just wanted to ask if there are people here who has an experience in doing p2p exchange in Binance as MERCHANT? Can anyone share their experience? Any tips on how to get started on a safe side? Your inputs are very much appreciated!For context, I am asking kasi gusto ko rin talaga mag establish ng panibagong active income since matagal na rin naman akong gumagamit ng service nila and feeling ko mas okay din kung i-buy and sell ko yung bitcoin stash na mayroon ako sa isang established platform. You know -- side hustle!!Very much appreciated.Maganda yang pinaplano mo na maging isa sa mga merchant sa p2p ng binance, ituloy mo lang tutal naman meron ng nagbigay bagay na dapat mong gawin na isubmit sa binance bilang merchant applicants. Sabihin mo lang name ng merchant mo dun kapag nakumpleto mo na yung requirements na kailangan nila.Para tayong mga kapwa pinoy dito sa forum platform ay magkatulungan sa bagay na yan, tutal naman lahat tayo dito sa lokal ay paniguradong gumagamit ng p2p pagdating ng palipat ng crypto papunta sa pera natin gamit ang Gcash/Maya at mga bank account.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Maus0728",
      "created_time": "October 09, 2023, 08:17:58 AM",
      "body": "Quote from: arwin100 on October 09, 2023, 07:50:46 AMKung may sapat lang din ako na puhunan gusto ko nga ring e try yan.Quote from: Mr. Magkaisa on October 09, 2023, 07:54:24 AMgusto ko din kaya lang nag-iipon pa ako kasi medyo malakidin ang kailangan nilang amount para maging merchant ka sa p2p sa Binance platformMagkano ba minimum na puhunan diyan? Balak ko lang BTC selling eh para sila yung mauunang magbayad tapos ako magrerelease lang.Quote from: Mr. Magkaisa on October 09, 2023, 07:54:24 AMo kaya panuorin mo ito ang guidelines : https://www.youtube.com/watch?v=NZuIN2JEz9kThanks! Nakalimutan ko may mga youtube video pala about dito. Baka may iba ka pang resources diyan like seminar and shits about being merchant.Quote from: bettercrypto on October 09, 2023, 08:15:12 AMPara tayong mga kapwa pinoy dito sa forum platform ay magkatulungan sa bagay na yan, tutal naman lahat tayo dito sa lokal ay paniguradong gumagamit ng p2p pagdating ng palipat ng crypto papunta sa pera natin gamit ang Gcash/Maya at mga bank account. Yep! That's another reason kung bakit gusto ko rin mag establish ng ganitong niche kasi may demand dito sa local in the first place. Would appreciate if may useful resources ka about dito. Please share!!!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "arwin100",
      "created_time": "October 09, 2023, 09:14:10 AM",
      "body": "Quote from: Maus0728 on October 09, 2023, 08:17:58 AMQuote from: arwin100 on October 09, 2023, 07:50:46 AMKung may sapat lang din ako na puhunan gusto ko nga ring e try yan.Quote from: Mr. Magkaisa on October 09, 2023, 07:54:24 AMgusto ko din kaya lang nag-iipon pa ako kasi medyo malakidin ang kailangan nilang amount para maging merchant ka sa p2p sa Binance platformMagkano ba minimum na puhunan diyan? Balak ko lang BTC selling eh para sila yung mauunang magbayad tapos ako magrerelease lang.Walang exact na nabanggit si binance na puhunan pero mas mainam siguro na mas malaki ang ilalatag mo dyan dahil may ibang tao na malakihan ang transaction kaya dapat may pundo ka talaga para ma entertain mo sila.Tsaka mainam na basahin mo tong artikulo ng binance ukol dyan may mga links din dyan na nag explain kung pano ka magsisimula https://www.binance.com/en/blog/p2p/how-do-i-become-a-binance-p2p-merchant-421499824684903764Kaya good luck sa magandang plano dahil for sure if mag succeed ka dyan maraming kababayan natin dito na nakabasa ng thread nato ang susunod since maganda nga naman talaga yang pang extra income",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bhadz",
      "created_time": "October 09, 2023, 09:17:38 AM",
      "body": "Hindi ako kasali sa program na yan kabayan pero ito yung link na nakita ko na may requirements nila at step by step nila.https://www.binance.com/en/support/faq/how-to-become-a-binance-p2p-cash-merchant-f65f4def04f04169aa20de0ddb5c5acfMeron din palang application screening yan na nasa link na yan yung lahat ng info sa pagse-setup mo ng account. Hinahanap ko yung ibang sagot sa tanong mo pero wala akong ibang nakitang specific na sagot kung magkano ang minimum need na btc/cash amount.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "xLays",
      "created_time": "October 09, 2023, 09:36:19 AM",
      "body": "Pilipino ka pala. Been seeing you sa mga contest like Roobet. Anyway, na try ko before mag buy and sell before sa Binance nung last bull run pero like 20,000 php max per transaction lang. Need mo talaga ng oras kahit sabihing nating side hussle lang. Kailangan may specific time ka na nakaalaan like parang office hours kasi hindi mo pwedeng sasabihin mo nakalimutan mo yung order sell or buy mo, nangyari na sakin yan nakalimutan ko mag irerelease pa pala ako, ang lagay na report ako. Tapos nagkaroon ng negative feedback sa account ko. Focus and discipline kailangan. Well kahit saan naman.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "benalexis12",
      "created_time": "October 09, 2023, 10:09:57 AM",
      "body": "Quote from: xLays on October 09, 2023, 09:36:19 AMPilipino ka pala. Been seeing you sa mga contest like Roobet. Anyway, na try ko before mag buy and sell before sa Binance nung last bull run pero like 20,000 php max per transaction lang. Need mo talaga ng oras kahit sabihing nating side hussle lang. Kailangan may specific time ka na nakaalaan like parang office hours kasi hindi mo pwedeng sasabihin mo nakalimutan mo yung order sell or buy mo, nangyari na sakin yan nakalimutan ko mag irerelease pa pala ako, ang lagay na report ako. Tapos nagkaroon ng negative feedback sa account ko. Focus and discipline kailangan. Well kahit saan naman.Edi pano yun hindi kana merchant sa p2p ng Binance? Kasi Ang pagkakaalam ko din yung ibang mga merchant 24 hours sila open, ikaw ba ganun ka rin? or kapag merchant ka pwede rin na ilog out mo yung account mo dun sa p2p platform sa Binance? Para at least ay meron din akong idea kahit papano. saka tinignan ko ngayon ay nasa 1000BUSD ang requirements, hindi ba masyadong hassle yung mga requirements din sa Binance ng p2p nito? Medyo nacurious lang ako pre.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kingvirtus09",
      "created_time": "October 09, 2023, 12:35:53 PM",
      "body": "Quote from: Maus0728 on October 09, 2023, 08:17:58 AMQuote from: arwin100 on October 09, 2023, 07:50:46 AMKung may sapat lang din ako na puhunan gusto ko nga ring e try yan.Quote from: Mr. Magkaisa on October 09, 2023, 07:54:24 AMgusto ko din kaya lang nag-iipon pa ako kasi medyo malakidin ang kailangan nilang amount para maging merchant ka sa p2p sa Binance platformMagkano ba minimum na puhunan diyan? Balak ko lang BTC selling eh para sila yung mauunang magbayad tapos ako magrerelease lang.Quote from: Mr. Magkaisa on October 09, 2023, 07:54:24 AMo kaya panuorin mo ito ang guidelines : https://www.youtube.com/watch?v=NZuIN2JEz9kThanks! Nakalimutan ko may mga youtube video pala about dito. Baka may iba ka pang resources diyan like seminar and shits about being merchant.Quote from: bettercrypto on October 09, 2023, 08:15:12 AMPara tayong mga kapwa pinoy dito sa forum platform ay magkatulungan sa bagay na yan, tutal naman lahat tayo dito sa lokal ay paniguradong gumagamit ng p2p pagdating ng palipat ng crypto papunta sa pera natin gamit ang Gcash/Maya at mga bank account. Yep! That's another reason kung bakit gusto ko rin mag establish ng ganitong niche kasi may demand dito sa local in the first place. Would appreciate if may useful resources ka about dito. Please share!!!Ang aking alam kaibigan, yung kapital na kailangan para makapagsimula ka bilang merchant sa binance ay nasa kulang-kulang 60k narin sa peso natin, isarado na natin na 60k php ang kailangan. Medyo malaki talaga, tapos kung Btc lang yung gagawin mo, wala lang akong idea kung pwede ba yun sa merchant parang pwede naman ata yun sa aking kaalaman lang naman.Saka tama karin na yung bibili ang unang magpapadala ng bibilhin nila sayo, at kapag naconfirm mo na tanggap mo na yung pinadala nung buyer ay dun mo naman irilis to confirm na natanggap mo narin yung pinadala sayo. How to become a merchant on p2p Binance?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Beparanf",
      "created_time": "October 09, 2023, 03:21:02 PM",
      "body": "Quote from: benalexis12 on October 09, 2023, 10:09:57 AMEdi pano yun hindi kana merchant sa p2p ng Binance? Kasi Ang pagkakaalam ko din yung ibang mga merchant 24 hours sila open, ikaw ba ganun ka rin? or kapag merchant ka pwede rin na ilog out mo yung account mo dun sa p2p platform sa Binance? Para at least ay meron din akong idea kahit papano. saka tinignan ko ngayon ay nasa 1000BUSD ang requirements, hindi ba masyadong hassle yung mga requirements din sa Binance ng p2p nito? Medyo nacurious lang ako pre. Kahit sino ay pwedeng magopen ng buy at sell orders sa Binance P2P. Yung merchant ay verified tag na makakaboost sa reputation mo para piliin ka ng mga user ng gusto na safe trade. Yung 1 or 2 negative feedbacks ay hindi mareremove yung ability mo magplace ng order but rather baba ang reputation kaya iiwasan k ng mga potential customers. Reputation ang puhunan ng P2P business kaya tama yung sabi nya dapat ay tutok ka.May sms notification naman ang Binance p2p at pwede ka dn magiwan ng note message sa buyer mo kung sakaling magiging inactive ka for a while.Sa pagkakaalam ko ay need ng merchant ng round 500k and above tapos extra verification such as source of income at other documents bago maapprove.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}