{
  "id": "topic_5473489",
  "title": "Balmain",
  "author": "Balmain",
  "created_time": "November 09, 2023, 12:58:40 PM",
  "content": "QuoteKripto para analiz firması CryptoSlate'in veri analisti James Van Straten yaptığı son araştırmada, \"Uzaktan bakıldığında, ABD'de 2022 başından bu yana Bitcoin'de en fazla yükseliş beklenen dönemin bu dönem olduğu görülüyor” sözlerine yer verdi.Van Straten, ABD'li alıcıların ralliyi sürdürdüğünü gösteren zincir üstü analiz firması Glassnode'un verilerine de atıfta bulundu.Kripto para araştırma firması Reflexivity'nin kurucu ortağı William Clemente ise \"Bu işi Amerikalılar taşıyor\" dedi.9 Kasım tarihinde Bitcoin 37 bin dolara yaklaşmasıyla yatırımcılar olarak şaşkınlığa uğradık, yatırımcıların beklemediği bir zamanlama yükseliş oldu. Bu güçlü alımların sebebi analiz şirketlerine göre Amerika Birleşik Devletlerinde ki halk ve şirketlerden kaynaklı olduğu söylemişler. BlockRock açık olarak Bitcoin ve kripto paralara yatırım yapmaktan çekinmiyor açıkca da yatırım fonlarında görüyoruz. Hali hazırda spot Bitcoin ETF başvuruları da var. Piyasa olan EFT hype'ı var. Başvurulan ETF'lere olumsuz sonuçlar çıkarsa piyasada olan alımlar tam tersine dönebilir buradan sonra bitcoin nereye yönünü çevireceği EFT başvurularına kalmış gibi görünüyor. Bu geçtiğimiz aralıkta fazla risk almadan sıkı takip ederek piyasayı pozisyonlar alınmalı.Quote Bloomberg Intelligence araştırma analisti James Seyffart konuyla ilgili olarak, \"Spot Bitcoin ETF onayları için 10 Ocak tarihine kadar yüzde 90 şansımız olduğuna inanıyoruz\" dedi ve şu şekilde devam etti:Ancak onay daha erken gelirse, mevcut tüm başvuru sahipleri için onay dalgasının geleceği bir zaman aralığına giriyoruz giriyoruz.https://tr.cointelegraph.com/news/bitcoin-etf-excitement-returns-btc-price-37k",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5473489",
  "comments": [
    {
      "author": "halloweenn666",
      "created_time": "November 09, 2023, 02:19:07 PM",
      "body": "Bir kaç aya fiyatın geldiği yeri görünce ABDli alıcıların gerçekte satıcı olduklarını görürüz gibime geliyor",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mustang Shelby",
      "created_time": "November 09, 2023, 05:55:15 PM",
      "body": "Quote from: halloweenn666 on November 09, 2023, 02:19:07 PMBir kaç aya fiyatın geldiği yeri görünce ABDli alıcıların gerçekte satıcı olduklarını görürüz gibime geliyor  Kötümser bir düşünceniz olduğunu düşünüyorum ancak bitcoinde halving bu kadar yakınken fiyatın düşeceğini düşünmüyorum. Bence bir miktar kenara bitcoin atmanızda fayda var. Burayı az çok takip ediyorsunuz ve kripto paralara ilgili olduğunuzu düşünüyorum. Kazançlı çıkma ihtimaliniz yüksek.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tasadar",
      "created_time": "November 09, 2023, 09:10:44 PM",
      "body": "Quote from: Mustang Shelby on November 09, 2023, 05:55:15 PMKötümser bir düşünceniz olduğunu düşünüyorum ancak bitcoinde halving bu kadar yakınken fiyatın düşeceğini düşünmüyorum. Bence bir miktar kenara bitcoin atmanızda fayda var. Burayı az çok takip ediyorsunuz ve kripto paralara ilgili olduğunuzu düşünüyorum. Kazançlı çıkma ihtimaliniz yüksek.o istediği fiyattan toplayamadığı için üzgün, ondan sürekli batcaz diyip duruyor",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Vispilio",
      "created_time": "November 10, 2023, 01:25:03 AM",
      "body": "Amerika birçok açıdan çöküş dönemini yaşıyor, sapkın kültürel propagandalar, artan suç oranları, vergilendirmeye yönelik aşırı kanunlar falan birçok Amerikalı nitelikli profesyonel artık uzaktan çalışıp işlerini daha güzel ülkelerden yürütmeyi seçiyor...Bir zamanların teknoloji merkezi gözde şehirleri San Francisco'da falan evsizler yerlere tuvaletini yapıyor suç oranları tavan yapmış durumda görüntüleri \"apokaliptik\" olarak niteleyenler var, buna rağmen kiralar inanılmaz yüksek vs. yani ABD'li akıllı insanlar böyle saçma yerlerden kaçıyorlar...Taşınırken de en çok başvurdukları yöntem kripto, çünkü diğer türlü \"Büyük Birader\" yakalarında, HR'a bir telefonla, veya arkadaşlarının hatta kendi eşinin ispiyonculuğuyla bile servetini kaybeden bir çok vaka yaşandı, yani Bitcoin'in ABD'li yatırımcılar arasında yükselişi çok doğal bir trend...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "W Jr.",
      "created_time": "November 10, 2023, 04:19:06 AM",
      "body": "Quote from: Vispilio on November 10, 2023, 01:25:03 AMAmerika birçok açıdan çöküş dönemini yaşıyor, sapkın kültürel propagandalar, artan suç oranları, vergilendirmeye yönelik aşırı kanunlar falan birçok Amerikalı nitelikli profesyonel artık uzaktan çalışıp işlerini daha güzel ülkelerden yürütmeyi seçiyor...Bir zamanların teknoloji merkezi gözde şehirleri San Francisco'da falan evsizler yerlere tuvaletini yapıyor suç oranları tavan yapmış durumda görüntüleri \"apokaliptik\" olarak niteleyenler var, buna rağmen kiralar inanılmaz yüksek vs. yani ABD'li akıllı insanlar böyle saçma yerlerden kaçıyorlar...Taşınırken de en çok başvurdukları yöntem kripto, çünkü diğer türlü \"Büyük Birader\" yakalarında, HR'a bir telefonla, veya arkadaşlarının hatta kendi eşinin ispiyonculuğuyla bile servetini kaybeden bir çok vaka yaşandı, yani Bitcoin'in ABD'li yatırımcılar arasında yükselişi çok doğal bir trend...Çok kolay para transferi, üstelik hiç bir şey ile uğraşmasına gerek olmadan.Aslında bitcoin değil, diğer kripto paralarda olan yükselişin ve ilginin sebeplerinden birisi de bu.Gizliliğe önem veren Monero ile rahatlıkla uluslararası ve bir yere iz bırakmadan transfer yapabilmek mümkünken neden insanlar bir sürü formaliteye ihtiyaç duysunlar?Başka bir örnek ise bir mobil cüzdana sahip olup telefonunuzla bir ülkeye gittiğinizde neden bavullar dolusu parayı yanınızda götürmek zorunda olasınız ki?Alışveriş için kriptopara kabul eden herhangi bir ülkede alışveriş rahatlıkla yapabilirsiniz.Türkiyeye tırla kaçak altın ve Euro sokmaya çalışan “gurbetçi” aptallar artık kripto parayı bir şekilde öğrenmeli.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}