{
  "id": "topic_5525852",
  "title": "Osinachinancy",
  "author": "Osinachinancy",
  "created_time": "January 09, 2025, 10:41:46 AM",
  "content": "Everyone’s panicking, but BTC is only down 10%—and they show a zoomed-out chart? Talk about selective vision! It’s like saying, “My diet is fine because I only gained 10% weight this week!” Meanwhile, the real punchline is that altcoins are crumbling while Bitcoin stands firm.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5525852",
  "comments": [
    {
      "author": "Alpha Marine",
      "created_time": "January 09, 2025, 02:23:58 PM",
      "body": "I still have not understood why there is usually an uproar when bitcoin dips. I mean, what did people expect? Will it just keep going up without coming down again? Volatility is a big feature of Bitcoin. On its way to 108k, it didn't just go straight to 108k. There were ups and downs, and there were times when it dipped so badly, so I never get why people still panic whenever Bitcoin has a downward trend on a chart. I haven't seen much panicking on this forum though, it is usually on social media because I know that people who really understand bitcoin will trust it and know that it's normal for its price to go down.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "apogio",
      "created_time": "January 09, 2025, 04:14:58 PM",
      "body": "Quote from: Osinachinancy on January 09, 2025, 10:41:46 AMEveryone’s panicking, but BTC is only down 10%—and they show a zoomed-out chart? Talk about selective vision! It’s like saying, “My diet is fine because I only gained 10% weight this week!” Meanwhile, the real punchline is that altcoins are crumbling while Bitcoin stands firm.The title is kinda misleading. I was expecting to see something about \"ETF flows\".Perhaps you could elaborate, mentioning a thing or two about the ETFs and whether the ETF inflows have cause the current market drop.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mushai",
      "created_time": "January 10, 2025, 08:16:43 AM",
      "body": "$568 million outflow on the 8th Jan.  Even Blackrock sold.Not really a lot when you consider the $36 billion that the ETFs are worth",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DeathAngel",
      "created_time": "January 10, 2025, 09:29:04 AM",
      "body": "We are in a bull market, there are going to be corrections on the way up to the cycle top. We are not there yet but people need to stop panicking all the time. These dips & periods of consolidation are needed for a healthy, sustained bull market. This bull won’t top out until at least another 6 months, relax & wait to take profits.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "betswift",
      "created_time": "January 10, 2025, 09:49:53 AM",
      "body": "Quote from: DeathAngel on January 10, 2025, 09:29:04 AMWe are in a bull market, there are going to be corrections on the way up to the cycle top. We are not there yet but people need to stop panicking all the time. These dips & periods of consolidation are needed for a healthy, sustained bull market. This bull won’t top out until at least another 6 months, relax & wait to take profits. There are people who are the food for the market - those are the weak hands that drop their bags once they see a correction or two.But for those who know and keep it calm - there are boons to be made. Panic is the bane of newbies, that's why everybody should understand how BTC behaves during different cycles to get it right.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sonia_123",
      "created_time": "January 11, 2025, 04:42:32 AM",
      "body": "Bitcoin ETFs Turn 1: Here Are Multiple Milestones Recorded.https://coingape.com/bitcoin-etfs-turn-1-here-are-multiple-milestones-recorded/The Spot Bitcoin ETF products got  approval from US SEC on this very day last year, after waiting for 10 years and had the opportunity to green light to trade ,setting up a new era of institutional adoption of the digital currency.Bitcoin ETFs has gathered collectively over one million BTC units and the AUM record shows it that four spot Bitcoin ETFs are among top 20 ranked in a year, its record gave a surprisingly financial milestone record to the world. Surprisingly, one of its product has been able to secure third place among the best ETF launches ever which is The Fidelity Wise Origin Bitcoin Fund (FBTC) ,after a year of management it's asset grew up to worth $19.681 billion.That is a big congratulations to BITCOIN ETFs and a happy birthday.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackBoss_",
      "created_time": "January 11, 2025, 04:51:46 AM",
      "body": "Quote from: Osinachinancy on January 09, 2025, 10:41:46 AMEveryone’s panicking, but BTC is only down 10%—and they show a zoomed-out chart? Talk about selective vision! It’s like saying, “My diet is fine because I only gained 10% weight this week!” Meanwhile, the real punchline is that altcoins are crumbling while Bitcoin stands firm.People with different approaches and management for their finance and investment, will feel different in a same market.Market is down 10%, it's good opportunity of accumulation for intelligent investors; but at the same time in a same market, there are people who are panic and sell by themselves or are liquidated forcefully by centralized exchanges because they have bad risk and leverage management.Risk and loss of some people are opportunity and profit for others.\"Warren Buffet: Be fearful when others are greedy; be greedy when others are fearful.\"",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackBoss_",
      "created_time": "January 11, 2025, 04:54:06 AM",
      "body": "Quote from: Osinachinancy on January 09, 2025, 10:41:46 AMEveryone’s panicking, but BTC is only down 10%—and they show a zoomed-out chart? Talk about selective vision! It’s like saying, “My diet is fine because I only gained 10% weight this week!” Meanwhile, the real punchline is that altcoins are crumbling while Bitcoin stands firm.People with different approaches and management for their finance and investment, will feel different in a same market.Market is down 10%, it's good opportunity of accumulation for intelligent investors; but at the same time in a same market, there are people who are panic and sell by themselves or are liquidated forcefully by centralized exchanges because they have bad risk and leverage management.Risk and loss of some people are opportunity and profit for others.\"Warren Buffet: Be fearful when others are greedy; be greedy when others are fearful.\"",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zlantann",
      "created_time": "January 11, 2025, 06:12:53 AM",
      "body": "Quote from: Osinachinancy on January 09, 2025, 10:41:46 AMEveryone’s panicking, but BTC is only down 10%—and they show a zoomed-out chart? Talk about selective vision! It’s like saying, “My diet is fine because I only gained 10% weight this week!” Meanwhile, the real punchline is that altcoins are crumbling while Bitcoin stands firm.Not everybody is panicking. The weak hands and the uneducated are the ones that are shaking because of the market. Maybe they want the market to keep growing without corrections but it doesn't work that way. If you have done proper studies about the history of the bull season it it's clear that drops are expected but in the end those who kept hodling will have the last laugh. To be sincere Bitcoin has performed more than expected this period and hopefully it will do more before the end of this bull season.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Reatim",
      "created_time": "January 11, 2025, 07:44:27 AM",
      "body": "Quote from: Alpha Marine on January 09, 2025, 02:23:58 PMI still have not understood why there is usually an uproar when bitcoin dips. I mean, what did people expect? Will it just keep going up without coming down again? it may seem like common sense for you and others but it is not for a lot of people you need to realize that people have invested their money so they want to always feel confident about their decisions and even small dips get them so sensitive and anxious QuoteI haven't seen much panicking on this forum though, it is usually on social media because I know that people who really understand bitcoin will trust it and know that it's normal for its price to go down. this forum is full of experienced members already this is not our first rodeo as they say but for some this is their first time investing in bitcoin and they were probably promised quick and big profits",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AprilioMP",
      "created_time": "January 11, 2025, 08:05:08 AM",
      "body": "Quote from: Osinachinancy on January 09, 2025, 10:41:46 AMEveryone’s panicking, but BTC is only down 10%—and they show a zoomed-out chart? Talk about selective vision! It’s like saying, “My diet is fine because I only gained 10% weight this week!” Meanwhile, the real punchline is that altcoins are crumbling while Bitcoin stands firm.Which is not selective in my opinion in the title and content of the post. ETF links with price declines, the problem is that the market can still be categorized as bullish. The price of Bitcoin is still strong and looks like I still want to survive at a price of $100K.Precisely the developing analysis related to the market is waiting for the altcoin season.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Alpha Marine",
      "created_time": "January 11, 2025, 06:20:42 PM",
      "body": "Quote from: Reatim on January 11, 2025, 07:44:27 AMyou need to realize that people have invested their money so they want to always feel confident about their decisions and even small dips get them so sensitive and anxious It's okay to be anxious, but people who have been in bitcoin for a while should know better. In just a few days, Bitcoin has gone from 97k to 91k and now it's at 94k. That's Bitcoin for you, and this should not be something to anybody investing in Bitcoin. There has been no time when Bitcoin has continuously gone up without going down and the fact that bitcoin is fluctuating doesn't mean it won't achieve another milestone price. This should be normal by now. People should only panic when they see bitcoin going below 80k or 70k because this is a bull season, but a dip that's still within the 90k range shouldn't cause any panic.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kemarit",
      "created_time": "January 12, 2025, 08:19:41 AM",
      "body": "Quote from: apogio on January 09, 2025, 04:14:58 PMQuote from: Osinachinancy on January 09, 2025, 10:41:46 AMEveryone’s panicking, but BTC is only down 10%—and they show a zoomed-out chart? Talk about selective vision! It’s like saying, “My diet is fine because I only gained 10% weight this week!” Meanwhile, the real punchline is that altcoins are crumbling while Bitcoin stands firm.The title is kinda misleading. I was expecting to see something about \"ETF flows\".Perhaps you could elaborate, mentioning a thing or two about the ETFs and whether the ETF inflows have cause the current market drop.As per this tracker: https://blockworks.co/bitcoin-etfThere are still billions of dollars flowing into ETF and so even if we are in a dip, this institutions are taking advantage of it and continue to buy.So I don't think that the market is panicking, yeah, it's big correction if you look at it, from $102,000 down to $92,000. But we have a brief respite and now the price is trading sideways around $95,000.Might be better to see how the market will go, specially after Trump assumed office on the 20th.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DeathAngel",
      "created_time": "January 12, 2025, 10:31:45 AM",
      "body": "Quote from: Osinachinancy on January 09, 2025, 10:41:46 AMEveryone’s panicking, but BTC is only down 10%—and they show a zoomed-out chart? Talk about selective vision! It’s like saying, “My diet is fine because I only gained 10% weight this week!” Meanwhile, the real punchline is that altcoins are crumbling while Bitcoin stands firm.Bitcoin is still a relatively immature asset, it’s still highly volatile (not as much as previously) & has wild price swings regularly. I imagine it will take many years until Bitcoin has low volatility, it will continue for some time yet due to the halvings. It’s deflationary by design so supply reduction increases price. Spot Bitcoin ETFs are the most successful & in demand ETF product in history. We are seeing a period of consolidation now but it’s bull run season baby, expect big price increases & obviously vastly increased ETF buying later in 2025.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rodskee",
      "created_time": "January 12, 2025, 11:31:15 AM",
      "body": "Quote from: DeathAngel on January 12, 2025, 10:31:45 AMBitcoin is still a relatively immature asset, it’s still highly volatile (not as much as previously) & has wild price swings regularly.people seem to forget that bitcoin has only been around for not even a complete two decade my theory is that people feel bad for not believing in bitcoin back then and is now overcompensating yes it is impressive that bitcoin reached $100k when no one believed it back then so people now are expecting unrealistic things from bitcoin then go throw a tantrum when it is not met Quote I imagine it will take many years until Bitcoin has low volatility, it will continue for some time yet due to the halvings. It’s deflationary by design so supply reduction increases price.  it is already a lot less volatile now compared to before and if we compare it to altcoins that can go quickly from 100 to 0 that will not happen with bitcoin but it doesnt mean it will not have price dips and rises every once in a while it is not a reflection of bitcoin in the long term so i would suggest to look at the bigger picture",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}