{
  "id": "topic_5436590",
  "title": "Crypt0Gore",
  "author": "Crypt0Gore",
  "created_time": "January 24, 2023, 11:09:53 AM",
  "content": "I use Bitcoin for my online data subscription, I use Bitcoin for my VPN renewal every 6 months, I use Bitcoin to purchase my PC games and Gift cards on joltfun.com, Kinguin and Bitrefill but I haven't found a website or platform where I can buy items, goods and services with middle man in tact, something similar to aliexpress but accepts Bitcoin as payment, why are we still lacking here? I am most times always indoor and this is how I get my things, shipped and sent to my location. If you know of any reliable service that accepts Bitcoin please do share.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5436590",
  "comments": [
    {
      "author": "OmegaStarScream",
      "created_time": "January 24, 2023, 11:12:11 AM",
      "body": "Where are you located? You can get almost anything you want with Bitrefill. They have Gift cards for both Ebay and Amazon.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tbct_mt2",
      "created_time": "January 24, 2023, 12:16:36 PM",
      "body": "[LIST] Giftcard providersYou can buy giftcards and many items at Paxful with more than 350 payment methods and Coinsbee or CryptwerkCryptwerk - Directory of merchants accepting crypto as payment",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "January 24, 2023, 01:01:39 PM",
      "body": "For electronics you can use Newegg because they also accept Bitcoin, or so I heard. I don't know if they ship outside the US, so maybe check with someone who has used it first.Quote from: OmegaStarScream on January 24, 2023, 11:12:11 AMWhere are you located? You can get almost anything you want with Bitrefill. They have Gift cards for both Ebay and Amazon.You can use Ebay and Amazon (and co.) entirely off of gift cards without having any credit card linked?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OmegaStarScream",
      "created_time": "January 24, 2023, 01:04:12 PM",
      "body": "Quote from: NotATether on January 24, 2023, 01:01:39 PMYou can use Ebay and Amazon (and co.) entirely off of gift cards without having any credit card linked?I'm not sure about eBay but I did that with Amazon U.S a couple of years ago and never had any problems, not sure if their policies changed now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "January 24, 2023, 01:11:02 PM",
      "body": "You're pretty much unlikely to find big stores likes Amazon to implement bitcoin payments simply because there isn't that much demand yet. Because if there was a good amount of demand, they would've implemented bitcoin payments a lot sooner.That, or the fact that it could be a regulatory nightmare, and returns and refunds would probably be more complicated.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "buwaytress",
      "created_time": "January 24, 2023, 01:18:16 PMLast edit: January 24, 2023, 05:26:47 PM by buwaytress",
      "body": "If you're in the EU, you can also deposit Bitcoin to Bitpanda and sell it for euros, and request the withdrawal in Amazon.de vouchers. It's not exactly the same as buying a gift card, but it is a way to feed your Amazon spending habit with crypto =) Also a tad cheaper than bank withdrawal (despite the not-so-good exchange rate).Edit: This is no longer true, thanks pixie85 for the note.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "348Judah",
      "created_time": "January 24, 2023, 01:21:50 PM",
      "body": "Quote from: Crypt0Gore on January 24, 2023, 11:09:53 AMI use Bitcoin for my online data subscription, I use Bitcoin for my VPN renewal every 6 months, I use Bitcoin to purchase my PC games and Gift cards on joltfun.com, Kinguin and Bitrefill but I haven't found a website or platform where I can buy items, goods and services with middle man in tact, something similar to aliexpress but accepts Bitcoin as payment, why are we still lacking here? There's no doubt that some companies were yet to start the acceptance of bitcoin for making payments but still yet we have a large number of others now accepting bitcoin as the adoption progress to more organizations and businesses across the world, many of them were still making a platform that could create an itch free payment system with bitcoin before they will begin the acceptance as for the case of those yet to begin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackHatCoiner",
      "created_time": "January 24, 2023, 01:26:19 PM",
      "body": "Quote from: mk4 on January 24, 2023, 01:11:02 PMBecause if there was a good amount of demand, they would've implemented bitcoin payments a lot sooner.There is a good amount of demand, even for a small fraction of the Amazon userbase. I trade decentrally often, and see multiple offers for Amazon gift cards. People buy stuff from amazon with bitcoin already, but: more expensively. Since Amazon themselves don't accept it, sellers will have to acquire gift cards and sell it with a profit obviously. There's less competition either way, and hence is charged higher than it needs to. The reason isn't little demand. Adding another payment option (which won't be mandatory for every Amazon seller) isn't going to harm their pocket. It's regulatory problems unfortunately...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "January 24, 2023, 01:51:04 PM",
      "body": "Quote from: BlackHatCoiner on January 24, 2023, 01:26:19 PMThere is a good amount of demand, even for a small fraction of the Amazon userbase. I trade decentrally often, and see multiple offers for Amazon gift cards. People buy stuff from amazon with bitcoin already, but: more expensively. Since Amazon themselves don't accept it, sellers will have to acquire gift cards and sell it with a profit obviously. There's less competition either way, and hence is charged higher than it needs to. The reason isn't little demand. Adding another payment option (which won't be mandatory for every Amazon seller) isn't going to harm their pocket. It's regulatory problems unfortunately...I guess a better way to describe it is the fact that even if they don't accept bitcoin, most bitcoiners would use Amazon anyway using typical fiat payment methods because of convenience, and due to necessity.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bettercrypto",
      "created_time": "January 24, 2023, 02:09:12 PM",
      "body": "Quote from: Crypt0Gore on January 24, 2023, 11:09:53 AMI use Bitcoin for my online data subscription, I use Bitcoin for my VPN renewal every 6 months, I use Bitcoin to purchase my PC games and Gift cards on joltfun.com, Kinguin and Bitrefill but I haven't found a website or platform where I can buy items, goods and services with middle man in tact, something similar to aliexpress but accepts Bitcoin as payment, why are we still lacking here? I am most times always indoor and this is how I get my things, shipped and sent to my location. If you know of any reliable service that accepts Bitcoin please do share. There are so many options for you to buy gift cards using bitcoin or cryptocurrency and one of these are:1. Coingate2. Coinsbee3. Bitrefill4. eGifterSource: https://www.makeuseof.com/best-places-buy-gift-cards-with-crypto/But you can also try amazon as well, because as far as I know they also accepting bitcoin as option paymentto their platform.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jackg",
      "created_time": "January 24, 2023, 03:09:25 PM",
      "body": "Quote from: BlackHatCoiner on January 24, 2023, 01:26:19 PMQuote from: mk4 on January 24, 2023, 01:11:02 PMthey would've implemented bitcoin payments a lot sooner.It's regulatory problems unfortunately...Yes it likely is, and also the reason why steam still haven't brought back bitcoin payments 5 years+ after accepting them for a few months iirc.@OP purse seemed pretty good when I used them and generally filled orders pretty quickly (there were certain days of the week where orders fill faster so it's worth leaving something up for a few days) - I don't normally buy next day shipping and a lot of people that fill those orders seem to have it so it seemed to pay to wait 3 days for an order to be filled.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CageMabok",
      "created_time": "January 24, 2023, 03:31:15 PM",
      "body": "Quote from: Crypt0Gore on January 24, 2023, 11:09:53 AMI use Bitcoin for my online data subscription, I use Bitcoin for my VPN renewal every 6 months, I use Bitcoin to purchase my PC games and Gift cards on joltfun.com, Kinguin and Bitrefill but I haven't found a website or platform where I can buy items, goods and services with middle man in tact, something similar to aliexpress but accepts Bitcoin as payment, why are we still lacking here? I am most times always indoor and this is how I get my things, shipped and sent to my location. If you know of any reliable service that accepts Bitcoin please do share. Oh that sounds a bit difficult for me, but so far I only know about seven big companies that already accept Bitcoin for their payment services with different conditions and you can also try it if there are things you want to buy through them. Because they are a company that is well known in this world and also provides goods that are often used by everyone in this world.AmazonPaypalMicrosoftOverstockNamecheapAppleStarbucksSource: investor.id",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "January 24, 2023, 03:39:38 PM",
      "body": "Quote from: Crypt0Gore on January 24, 2023, 11:09:53 AM~snip~I am most times always indoor and this is how I get my things, shipped and sent to my location. If you know of any reliable service that accepts Bitcoin please do share. I would start by looking at some of the sites like Spending-Bitcoin where you have over 1000 links to various shops that accept Bitcoin as a means of payment. Of course, it is up to you to check anyone with whom you will do business, but also where the store is located because of shipping costs and customs that can significantly increase the price of what you are buying.If you want to buy exclusively in your country, then use search engines or ask a question in your local board, because that's the fastest way to get information.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaveF",
      "created_time": "January 24, 2023, 04:55:24 PM",
      "body": "The word is inertia. I remember back in the day when food stores did not take credit cards, just cash and check.I also remember when a lot of businesses did not take CC in general.Over time the number grew and then over a couple of years it snowballed into everyone taking credit cards.But remember, we are talking DECADES of time. At the current time that BTC has been in existence considering the fight banks & governments are putting up against it, I think the acceptance level is fairly good.-Dave",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pixie85",
      "created_time": "January 24, 2023, 05:06:08 PM",
      "body": "Here's one of the lists for you, OP. There's many to choose from if you want direct payments.https://99bitcoins.com/bitcoin/who-accepts/I don't mind buying a gift card though. Quote from: buwaytress on January 24, 2023, 01:18:16 PMIf you're in the EU, you can also deposit Bitcoin to Bitpanda and sell it for euros, and request the withdrawal in Amazon.de vouchers. It's not exactly the same as buying a gift card, but it is a way to feed your Amazon spending habit with crypto =) Also a tad cheaper than bank withdrawal (despite the not-so-good exchange rate).You have outdated information. This option was dropped many months ago. I don't remember exactly but it was somewhere before 2022 for sure. It looks like you haven't been using this exchange for at least a year.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "buwaytress",
      "created_time": "January 24, 2023, 05:26:01 PM",
      "body": "Quote from: pixie85 on January 24, 2023, 05:06:08 PMYou have outdated information. This option was dropped many months ago. I don't remember exactly but it was somewhere before 2022 for sure. It looks like you haven't been using this exchange for at least a year. Damn, has it been that long? Looks like you're right after all, just checked. And edited my post.I also see now they've completely revamped the site and my current (maximum) level of verification has also been brought back to the lowest level.Times are a-changing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cabron",
      "created_time": "January 24, 2023, 05:45:21 PM",
      "body": "I have not seen any middleman services like aliexpress that allow sellers to accept BTC yet. You will understand also they are protecting their sellers from BTC volatility.The popular payment app in every country nowadays somehow can accept fiat currency coming from BTC transactions which you can also use to buy/sell in Aliexpress. Almost like buying gift cards with BTC.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NeuroticFish",
      "created_time": "January 24, 2023, 07:13:08 PM",
      "body": "Quote from: cabron on January 24, 2023, 05:45:21 PMI have not seen any middleman services like aliexpress that allow sellers to accept BTC yet. You will understand also they are protecting their sellers from BTC volatility.This is utter BS. I'm using AliExpress now and then and the currency I'm using with is Euro. Internally, AliExpress is certainly working with something else - I don't know if it's USD or CNY or another - however, when it has happened (not too often, ut still...) that I didn't receive the ordered product and asked for refund, the amount was a bit different (usually a few cents in any direction!!) which is 100% caused by fiat / forex volatility (especially as it takes about 2-3 months from ordering to asking for refund).They can easily do the same with bitcoin too and nobody will complain // people will understand that their base currency is fiat and the amounts of BTC may differ.A better explanation is that AliExpress being a Chinese company... is following China's rules on Bitcoin (ie. ban).Quote from: bettercrypto on January 24, 2023, 02:09:12 PM1. Coingate2. Coinsbee3. Bitrefill4. eGifterSource: https://www.makeuseof.com/best-places-buy-gift-cards-with-crypto/This is pretty much the best list I've got for my country, but for me, only 2 gift cards from there are somewhat useful. Not much.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Edwardard",
      "created_time": "January 25, 2023, 02:21:57 AM",
      "body": "Quote from: mk4 on January 24, 2023, 01:11:02 PMYou're pretty much unlikely to find big stores likes Amazon to implement bitcoin payments simply because there isn't that much demand yet. Because if there was a good amount of demand, they would've implemented bitcoin payments a lot sooner.Bitcoin is among the top 20 largest assets in the world and you are saying there's no demand? Cant agree on that anymore. Most likely they dont accept it as payment due to its volatile nature. Maybe they are just afraid of the dumps and loosing value dramatically once the buyer pays and prices fall instantly, conversion fees, etc. I find no other reason not to accept BTC. But soon when we get close to gold mcap , they will start accepting it, just see how paypal changed their views on btc over time",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}