{
  "id": "topic_5429159",
  "title": "SpandexMan",
  "author": "SpandexMan",
  "created_time": "December 16, 2022, 01:45:51 AM",
  "content": "Hello, I'm new here. I have been in and out of Bitcoin and some altcoins since 2017. I was having coffee with a friend yesterday and we were trying to think about how mainstream adoption could be made easier. Not everyone has access to a smartphone and internet. Recently, I saw a chap post online about bitcoin denominated cards that have the private key embedded in them. (My concern is, how can you know the private key without opening the card, and even then, how can you know someone else does not also have a copy?Could you reveal part of the private key (so that you have some authenticity) then have some kind of gadget that sends a message on chain to keep a record that the card has been opened, or something like that?Is it possible to have bitcoin notes in that case, with the denomination (e.g 50 sats), the private and the public key, printed on the note, and each note have it's own wallet ID?One barrier I can immediately think of, is that there would be nothing to stop 2, or even 100 identical notes with identical private keys floating in circulation, which means we fail the double spend problem. However, is there a way in which we could have bitcoin notes? How could we facilitate the creation of such notes and guard against forgery.The fewer barriers for users, the better.Thoughts?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5429159",
  "comments": [
    {
      "author": "NotATether",
      "created_time": "December 16, 2022, 03:16:41 AM",
      "body": "Following the design of bitcoin collectibles, you can place the private key not behind a holographic material, but electronically inside the card, and setting some (bitcoin) node to be its issuer/manager.You can command the node to flash the balance or private key (or even a link to the Bitcoin Whitepaper) on some LED attached to the card, and maybe even program it to wipe the private key off of the card for truly noncustodial card.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Edwardard",
      "created_time": "December 16, 2022, 05:53:26 AM",
      "body": "Quote from: SpandexMan on December 16, 2022, 01:45:51 AM~we were trying to think about how mainstream adoption could be made easier. Not everyone has access to a smartphone and internet.If someone doesnt understand or know how to use/access a smartphone/internet, he will never understand bitcoin and they dont deserve to be a part of mainstream adoption of bitcoin anyway.Also, I dont think we are in need of bitcoin notes or anything like that?! Complete wastage of resources and environment. I mean even the government is going cashless. Its digital era.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "December 16, 2022, 06:03:25 AM",
      "body": "Quote from: Edwardard on December 16, 2022, 05:53:26 AMAlso, I dont think we are in need of bitcoin notes or anything like that?! Complete wastage of resources and environment. I mean even the government is going cashless. Its digital era.Well, debit cards aren't going away anytime soon. Might as well slap some NFC on that and take advantage of their wide acceptance.Since VISA and MasterCard will only work with companies, some FinTech could allow users to spend dollars/euros etc directly from the card, which is denominated by Bitcoin. Not coins held at a centralized institutions, but coins that you can send from your wallet to your card, which has the private key embedded inside it, perhaps using some open protocol so that any wallet can send it commands such as reveal the private key, erase the key from the card, and so on.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "odolvlobo",
      "created_time": "December 16, 2022, 10:11:56 AM",
      "body": "Quote from: SpandexMan on December 16, 2022, 01:45:51 AMRecently, I saw a chap post online about bitcoin denominated cards that have the private key embedded in them. (My concern is, how can you know the private key without opening the card, and even then, how can you know someone else does not also have a copy?You don't need to know the private key until you want to send the bitcoins. There is no way to know if someone else has a copy of a private key unless they use it or reveal it.Quote from: SpandexMan on December 16, 2022, 01:45:51 AMCould you reveal part of the private key (so that you have some authenticity) then have some kind of gadget that sends a message on chain to keep a record that the card has been opened, or something like that?The card could have a chip that will sign a message to prove that it has the private key. It could also destroy the private key after revealing it to prevent anyone from using the card after the private key has been revealed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NeuroticFish",
      "created_time": "December 16, 2022, 02:00:25 PM",
      "body": "Quote from: SpandexMan on December 16, 2022, 01:45:51 AMCould you reveal part of the private key (so that you have some authenticity) then have some kind of gadget that sends a message on chain to keep a record that the card has been opened, or something like that?The card or coin usually has somewhere visible the address and you can look it up to see whether it was spent. The private key should remain private until the point the coins are redeemed/spent.The only problem is that a skilled used may retrieve the private key and put everything back to look sealed. And at a much later point after selling that collectible/physical coin/card he can spend the coins on it. And you won't know what has happened and who, of the many hands the coin/card changed is the thief.The chances are small, but the risk is there.In the case of these funded physical items you have to trust the issuer and the other people who had their hands on the item. And the point of Bitcoin is to not trust anybody but you and math.And yes, there's the OpenDime, which I agree, it's not too friendly. Still, somewhat better option for the job.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dkbit98",
      "created_time": "December 16, 2022, 06:53:48 PM",
      "body": "Quote from: SpandexMan on December 16, 2022, 01:45:51 AMCould you reveal part of the private key (so that you have some authenticity) then have some kind of gadget that sends a message on chain to keep a record that the card has been opened, or something like that?Partial revealing of private key in public would reduce security and increase chances of someone stealing your coins, so I wouldn't do that.Quote from: SpandexMan on December 16, 2022, 01:45:51 AMIs it possible to have bitcoin notes in that case, with the denomination (e.g 50 sats), the private and the public key, printed on the note, and each note have it's own wallet ID?There are several types of Bitcoin notes already, and I even saw one project is working on DIY BTC notes that people could print in their homes.I don't know if we could add 50 sats that you can't spent for anything today, and it would be very stupid to print something with value of 1 sat being around $0.00016,and 50 sats = 0.00840081.Alternative for Bitcoin notes are cards that can be used like cash are Satodime, Satscard, and maybe few more.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "n0nce",
      "created_time": "December 16, 2022, 09:09:31 PM",
      "body": "Quote from: SpandexMan on December 16, 2022, 01:45:51 AMNot everyone has access to a smartphone and internet. [...]Recently, I saw a chap post online about bitcoin denominated cards that have the private key embedded in them.Let's stop right here. The cards you are talking about, are also referred to as credit-card sized hardware wallets, since the seed is stored on a dedicated hardware device. Cool. Makes a lot of sense and I'm a big fan of hardware wallets myself.But: by themselves, they're useless. They require a device with internet access to create and broadcast transactions. These devices only sign transactions; they're not standalone. And therefore of no use to someone without internet access and an internet-capable device.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Smartvirus",
      "created_time": "December 22, 2022, 10:02:52 PM",
      "body": "Quote from: n0nce on December 16, 2022, 09:09:31 PMQuote from: SpandexMan on December 16, 2022, 01:45:51 AMNot everyone has access to a smartphone and internet. [...]Recently, I saw a chap post online about bitcoin denominated cards that have the private key embedded in them.Let's stop right here. The cards you are talking about, are also referred to as credit-card sized hardware wallets, since the seed is stored on a dedicated hardware device. Cool. Makes a lot of sense and I'm a big fan of hardware wallets myself.But: by themselves, they're useless. They require a device with internet access to create and broadcast transactions. These devices only sign transactions; they're not standalone. And therefore of no use to someone without internet access and an internet-capable device.Can't say am familiar with the cards in reference. I guess its not a thing yet in my part of the world but one thing i know for sure is that, the closest you could go with cryptocurrency without Internet is having a cold wallet for storing your bitcoin. Other than that, it was meant to be a digital currency and so, its expected to function in an electronic media or device. Anything other than that and the whole idea would be shattered.Bitcoin was not to come in notes and shouldn't come in notes. The rest of the world and most of its population is net to be Internet savvy or empowered so, the needs for notes is inevitable and that's why we've got fiats to assist. This is why it's always arguable that, the cryptocurrency innovation isn't one that comes to replace fiat. They are meant to operate separately and efficiently in fitting in certain financial ends of the other.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lida93",
      "created_time": "December 24, 2022, 07:30:54 AMLast edit: December 24, 2022, 07:46:23 AM by Lida93",
      "body": "Quote from: SpandexMan on December 16, 2022, 01:45:51 AMIs it possible to have bitcoin notes in that case, with the denomination (e.g 50 sats), the private and the public key, printed on the note, and each note have it's own wallet ID?One barrier I can immediately think of, is that there would be nothing to stop 2, or even 100 identical notes with identical private keys floating in circulation, which means we fail the double spend problem. However, is there a way in which we could have bitcoin notes? How could we facilitate the creation of such notes and guard against forgery.The fewer barriers for users, the better.Thoughts?I don't think the idea is close to being a feature that can possibly bridge the gap in the barriers faced by cryptocurrency users it rather adds to more processes in queue already, and this am sure wasn't part of the ideas of the founding father of bitcoin either. Creation of bitcoin notes would conspicuously defeat the whole idea of bitcoin being a digital currency and the uniqueness of bitcoin would be an obsolete thing as it would reduce it to par with the conventional fiat currency.  And this could give an edge to the government in their futile strive to regulate the currency as it would be in note.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mendace",
      "created_time": "December 26, 2022, 05:35:29 PM",
      "body": "I think I haven't fully understood what you're trying to say, I know that there are cards that do the function of hardware wallet in a few words but always need an internet connection to check the balance and make transactions. A good alternative could be to use opendime which is a hardware wallet very similar to a usb key of which you do not know the private key until you literally drill the hole, at that point by connecting it to the pc you can read the key with which you can move your funds. See it as a piggy bank where you pick it up until you break it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}