{
  "id": "topic_5524596",
  "title": "Usdcboss",
  "author": "Usdcboss",
  "created_time": "December 29, 2024, 09:53:53 AM",
  "content": "Why still haven't improved? Btc still slow and expensive to send transactions and for sure time like tron has you know that transaction allmost instant wich not the case with btcWhos fixing that and what could be improved ? And when btc to POS so we don't depend of miners i don't think i want to or trust put my hard earned wealth in mercy of miners,well that's just me i like everything to be perfect and secure but ye btc slow still tron is way better",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5524596",
  "comments": [
    {
      "author": "Ambatman",
      "created_time": "December 29, 2024, 10:06:16 AM",
      "body": "Lol funny you jumping from the Pot to the Fire immediately if you picking POS over POW. I don't believe you haven't heard about layer 2 or Segwit, those had been improvement And more are on the wayThough slow improvement, Security isn't been compromised. I hope you can say Tron is way better in the next 10 years (I'm sure you won't). Go and research on the consensus POW and POS and realise why Bitcoin is still POW despite it been relatively slow and energy intensive. Miners you don't trust play a role in security and you believe POS is any better? Nothing is perfect and that's the beauty in Life.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "memehunter",
      "created_time": "December 29, 2024, 10:07:24 AM",
      "body": "Quote from: Usdcboss on December 29, 2024, 09:53:53 AMWhy still haven't improved? Btc still slow and expensive to send transactions and for sure time like tron has you know that transaction allmost instant wich not the case with btcWhos fixing that and what could be improved ? And when btc to POS so we don't depend of miners i don't think i want to or trust put my hard earned wealth in mercy of miners,well that's just me i like everything to be perfect and secure but ye btc slow still tron is way betterBitcoin's blockchain can handle 7-10 transactions per second because of limited block size and block time. We are making progress there is a lightning network that is extremely fast and can handle up to 1 million transactions per second, which is much more than Tron (around 2000 TPS).So it's not that there is no improvement but adoption is the major concern.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ABCbits",
      "created_time": "December 29, 2024, 10:20:26 AM",
      "body": "Quote from: Usdcboss on December 29, 2024, 09:53:53 AMWhy still haven't improved? Btc still slow and expensive to send transactions and for sure time like tron has you know that transaction allmost instant wich not the case with btcTron is faster since it's more centralized.Quote from: Usdcboss on December 29, 2024, 09:53:53 AMWhos fixing that and what could be improved ? And when btc to POS so we don't depend of miners i don't think i want to or trust put my hard earned wealth in mercy of miners,well that's just me i like everything to be perfect and secure but ye btc slow still tron is way better\"when btc to POS\"? I doubt it'll ever happen. Besides, it just means Bitcoiner depends towards big Bitcoin holder. Currently it includes few early adopters, major exchange and various Bitcoin ETF. Since you mention tron earlier, it's worth to mention that some exchange helped tron to perform hostile takeover on Steemit network[1].And what affect TPS isn't PoW or PoS, but rather block size and block time.[1] https://cryptoslate.com/big-exchanges-conduct-a-hostile-takeover-of-steem-blockchain-following-tron-acquisition/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Plaguedeath",
      "created_time": "December 29, 2024, 10:24:23 AM",
      "body": "What? it's actually POS where you need to trust your hard earned money to someone else.In POS, validators that own the biggest amount token will able to control everything, hence it's centralized. if the validator choose to ban the token/address, other validators can't do anything because the highest power is the one who own the biggest amount.In POW, even the biggest pool not want to include your transaction to the block, other pool will do it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Text",
      "created_time": "December 29, 2024, 10:37:47 AM",
      "body": "Sometimes it's really slow because blockchain has limits on how many transactions it can process at once. Think of it like a bridge lane where only a certain number of cars can cross at a time. If many people try to use it, it gets congested leading to slower confirmations.Sometimes it's expensive because miners get to choose which transactions to include in a block. They prioritize those with higher fees. When demand is high, fees go up to incentivize miners to include your transaction.There are improvements like layer-2 solutions which are like side roads that take traffic off the main highway. They offer faster and cheaper transactions while still relying on the main blockchain's security. I’m not sure if you’ve tried the Lightning Network, I have.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "headingnorth",
      "created_time": "December 29, 2024, 10:40:46 AM",
      "body": "Very simple, because bitcoin prioritizes security over speed. That is why bitcoin has never been hacked. You pay more for the miners to secure the network, which to me is more than worth it. As the saying goes, you get what you pay for. Ethereum and the other shitcoins on the other hand, have been hacked countless times losing untold billions of dollars to hackers.If you want cheap and fast, then don't expect a lot of security, and be prepared to lose all your funds.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Luzin",
      "created_time": "December 29, 2024, 11:39:32 AM",
      "body": "Quote from: headingnorth on December 29, 2024, 10:40:46 AMVery simple, because bitcoin prioritizes security over speed. That is why bitcoin has never been hacked. You pay more for the miners to secure the network, which to me is more than worth it. As the saying goes, you get what you pay for. Ethereum and the other shitcoins on the other hand, have been hacked countless times losing untold billions of dollars to hackers.If you want cheap and fast, then don't expect a lot of security, and be prepared to lose all your funds.Bitcoin has undergone several consensus changes, currently the Bitcoin blocksize of 1Mb is nothing more. It makes bitcoin what you say. The greater the scalability, speed, the greater the number of transactions, the more vulnerable it will be to problems. Maybe Coins or other tokens are bigger block size but they are more problematic. Such as increasing resource requirements for network users and longer validation times. I think Bitcoin with block limitations is a good value even though most of it is a weakness. Smaller block sizes can increase decentralization, as they can make it easier for nodes to join the network by reducing the resources needed to participate in the blockchain.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Baofeng",
      "created_time": "December 29, 2024, 12:05:22 PM",
      "body": "Quote from: Usdcboss on December 29, 2024, 09:53:53 AMWhy still haven't improved? Btc still slow and expensive to send transactions and for sure time like tron has you know that transaction allmost instant wich not the case with btcWhos fixing that and what could be improved ? And when btc to POS so we don't depend of miners i don't think i want to or trust put my hard earned wealth in mercy of miners,well that's just me i like everything to be perfect and secure but ye btc slow still tron is way betterNot the first time that we have heard this kind of argument, but still Bitcoin remains the dominant crypto, and looking at the mempool right now, So the fee is very cheap, it might not be instant but it's due to it's decentralization and that is the biggest difference with all altcoins. And there is also Lightning Network, and if you are interested, you can read it here: https://bitcointalk.org/index.php?topic=5345664.0",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ranochigo",
      "created_time": "December 29, 2024, 12:26:24 PM",
      "body": "Quote from: Luzin on December 29, 2024, 11:39:32 AMBitcoin has undergone several consensus changes, currently the Bitcoin blocksize of 1Mb is nothing more. It makes bitcoin what you say. The greater the scalability, speed, the greater the number of transactions, the more vulnerable it will be to problems. Maybe Coins or other tokens are bigger block size but they are more problematic. Such as increasing resource requirements for network users and longer validation times. I think Bitcoin with block limitations is a good value even though most of it is a weakness. Smaller block sizes can increase decentralization, as they can make it easier for nodes to join the network by reducing the resources needed to participate in the blockchain. Bitcoin hasn't gone through consensus changes since we've only gotten soft forks so far. The block size is more than 1MB, or 4vMB but it depends on the kinds of transactions that are in a block. Increasing block size doesn't directly lead to a security penalty, that is a myth that is less and less correct as time goes by. Internet speeds and propagation speeds are fast enough to put those arguments to rest.The issue is more of the fact that it simply doesn't make sense to increase the block size to support an extremely large number of transactions. Smaller block size also doesn't increase decentralization. Normal users are already less inclined to run full nodes as before, regardless of block size increment or not. L2 solutions like lightning is a better solution in this regard.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fuguebtc",
      "created_time": "December 29, 2024, 12:41:37 PMLast edit: December 29, 2024, 01:09:42 PM by fuguebtc",
      "body": "Quote from: Usdcboss on December 29, 2024, 09:53:53 AM And when btc to POS so we don't depend of miners i don't think i want to or trust put my hard earned wealth in mercy of miners,well that's just me i like everything to be perfect and secure but ye btc slow still tron is way betterSimply, if you feel uncomfortable with bitcoin, you feel unsafe investing your assets in bitcoin, you just sell it and move to whatever shitcoin you feel safer with. Bitcoin was created for everyone and most are happy with what it offers, only a few like you complain. That shows the problem is not bitcoin but you, so there is no reason for bitcoin to move to POS or change just because a few people like you are unhappy. If you don't trust Bitcoin, you don't need to trust it and it doesn't need you to trust it. My advice is to sell all your bitcoin and buy Tron, that's it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FatFork",
      "created_time": "December 29, 2024, 02:00:31 PM",
      "body": "There's something nice about having options available.  Some coins use proof-of-work while others utilize proof-of-stake protocols.  Both got their pros and cons.  If fast payments and tiny fees are your top priorities, you got plenty of alts to pick from.  But if you're after a decentralized currency that's secure and censorship-free, then Bitcoin is still the best option.  Now for when Bitcoin might switch over to proof-of-stake - simply put, that ain't happening.  Its whole deal is anchored in proof-of-work mining.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Solosanz",
      "created_time": "December 29, 2024, 02:31:07 PM",
      "body": "It's an argument that Bitcoin high unlikely to win, but I'd choose Bitcoin which is slow and expensive instead of unsafe coins which fast and cheaper. I buy Bitcoin as a store of value, so the disadvantage that Bitcoin have is nothing for me, I don't need to receive the coins ASAP and I don't need to pay fees many times.I think altcoins lovers should be happy, if Bitcoin won everything, altcoins have no chance to be used.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hd49728",
      "created_time": "December 29, 2024, 02:37:45 PM",
      "body": "Quote from: Usdcboss on December 29, 2024, 09:53:53 AMWhy still haven't improved? Btc still slow and expensive to send transactions and for sure time like tron has you know that transaction allmost instant wich not the case with btcIt is not chapeast but not most expensive blockchain for on chan transactions. If you're looking for a most secure blockchain, it is Bitcoin blockchain. You can see this fact therehttps://howmanyconfs.com/QuoteWhos fixing that and what could be improved ? And when btc to POS so we don't depend of miners i don't think i want to or trust put my hard earned wealth in mercy of miners,well that's just me i like everything to be perfect and secure but ye btc slow still tron is way betterProof of Stake is bad because it is centralized in whales. With Bitcoin Proof of Work blockchain, Bitcoin whales can not manipulate the blockchain even they have many bitcoins.Do you like Proof of Work or Proof of Stake after knowing about centralization and manipulation risks?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "December 29, 2024, 02:50:34 PM",
      "body": "Quote from: Usdcboss on December 29, 2024, 09:53:53 AMWhy still haven't improved? Btc still slow and expensive to send transactions and for sure time like tron has you know that transaction allmost instant wich not the case with btcYou are wrong.I just made a very large transaction this morning, and the fee was less than 50 cents.Fees don't have to be fractions of a penny for transactions to be feasible. For most small players, it's fine. And the whales and big movers have the money to cover the fees for their (very large) transactions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "moneystery",
      "created_time": "December 29, 2024, 03:26:08 PM",
      "body": "when you say tron ​​is much better than bitcoin it shows that you are just another person who does not understand what bitcoin is and how it became popular until now. you say that bitcoin is slow and expensive, and in comparison you bring tron ​​is very funny. in every way bitcoin is much better than what tron ​​offers. tron ​​just follows what bitcoin brings, and adds transaction speed, but in terms of credibility and long term, bitcoin is much better than tron. and honestly i am much more confident and trust to put my wealth in the decentralized bitcoin network, compared to some altcoin held by a chinese guy who can be manipulated at any time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackHatCoiner",
      "created_time": "December 29, 2024, 03:35:50 PM",
      "body": "It will always be slower and more expensive if you compare it with shitcoins with worse security and infinite block sizes. If you compare it with other, more serious usage of financial transactions, you will see that it is the cheapest way to have final settlement transaction across countries, and within only 10 minutes.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "$weetne$$",
      "created_time": "December 29, 2024, 03:39:28 PM",
      "body": "Quote from: Usdcboss on December 29, 2024, 09:53:53 AMWhy still haven't improved? Btc still slow and expensive to send transactions and for sure time like tron has you know that transaction allmost instant wich not the case with btcWhos fixing that and what could be improved ? And when btc to POS so we don't depend of miners i don't think i want to or trust put my hard earned wealth in mercy of miners,well that's just me i like everything to be perfect and secure but ye btc slow still tron is way betterPOS is a centralized algorithm that favour people with the highest amount of coins and not what Bitcoin stands for. Moving Bitcoin form POW to POS will be putting the power in a more smaller group and will be worst that what is happening when you say the miners are in control of confirming Bitcoin transaction. Right now after sending some Bitcoin, your transaction can be confirmed by any miner therefore if there are some miners that refused to confirm your transaction, others can do that, making the network very decentralized. Bitcoin is looking expensive to us because we are too interested in converting it into the fiat equivalent when we are supposed to make use of Bitcoin as it is because it is also a currency itself.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Outhue",
      "created_time": "December 29, 2024, 03:47:51 PM",
      "body": "We have different use for Bitcoin it seems, as for me I don't see any thing holding bitcoin back when it comes to using Bitcoin to settle some payments online, the slow part is confusing.I have used Bitcoin too many times already and I know that Bitcoin is fast enough, for payment solutions at least, that is why I believe that lightning fast isn't that greatly needed, if not for some congestion that happens at times but nothing too bad. I kinda think that PoS coins are faster in transaction than PoW coins like Bitcoin but Bitcoin still get the job done.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OcTradism",
      "created_time": "December 29, 2024, 04:07:34 PM",
      "body": "Quote from: BlackHatCoiner on December 29, 2024, 03:35:50 PMIt will always be slower and more expensive if you compare it with shitcoins with worse security and infinite block sizes. If you compare it with other, more serious usage of financial transactions, you will see that it is the cheapest way to have final settlement transaction across countries, and within only 10 minutes. It's about Blockchain Trilemma that has three pillars: security, scalability, and decentralization. With altcoins, you can have big scalablity, but more centralized and less security. With Bitcoin, you have less scalability but best in security and decentralization.Not talk about altcoins, but one of most scam altcoins, Bitcoin Cash, and another is Bitcoin SV. They fail to get users from Bitcoin community because their blockchains are worse than Bitcoin blockchain. Who are Bitcoin users and see importance of blockchain security, will use Bitcoin blockchain even they surely know that they will have to wait for a longer time and possibly spend more $ for transaction fee.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}