{
  "id": "topic_5401282",
  "title": "Dzigie",
  "author": "Dzigie",
  "created_time": "June 03, 2022, 07:17:13 PM",
  "content": "Bir kadıncağız düşünün. Evini sel basmış yardıma muhtaç. Doğal afet mağduru bir kadın. Belediyeden yardım alması gerekiyor. Evini hayatını toparlasın, yeniden ayaklarının üzerinde dursun, hayata tutunsun. İddiasına göre yaşadıklarıysa felaket. Bir kadıncağızın başına gelmesini istemediğimiz türden şeyler.  teras kapalı olduğundan dolayı odama geldi ve bana yardım parasının yarına kadar hesabıma yatacağını söyledi. Yardım için bilgilerimi aldıktan sonra çantasından alkol çıkarttı. Ben de kendisine alkol kullanmadığımı söyledim ama kendisi bana yardımcı olmak için geldiğini ve benimde hoş görmemi söyledi. İlk önce bana sözlü tacizde bulundu. Daha sonra tecavüz olayı gerçekleşti. Resepsiyon görevlisi çığlık sesimi duyunca odama yardımıma gelerek şahsı çıkarmama yardımcı oldu. Sonrasında sabah hemen orayı terk ettim. Evime geldim sonrasında beni aradı yine engelledim” dedi.Kaynak: https://www.msn.com/tr-tr/haber/diger/chpli-edirne-belediyesinde-tecav%C3%BCz-iddias%C4%B1-konuyu-kapat%C4%B1n-biz-cezas%C4%B1n%C4%B1-verece%C4%9Fiz/ar-AAXZKRT Muharrem İnce ne güzel söylemişti. Eskiden haftada bir kez rezillik olurdu. Şimdi haftada iki kez olmaya başladı. Kendine umudun yok. İktidarın alternatifi nasıl olacaksın? Kurtarılmış bölgelerde mutlu mesut yaşıyorsun. Halka nasıl umut olacaksın kırmızı ampül?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5401282",
  "comments": [
    {
      "author": "trendcoin",
      "created_time": "June 04, 2022, 02:03:24 AM",
      "body": "4 odacıklı geniş mideli chdp türölleri 5 kuruşluk mama için bu olayı da güzellemenin derdine düşer, birazdan damlarlar buraya, başka yerlerden konuyla alakasız örnekler vermeye çalışırlar, pisliklerini örtmek ve 5 kuruşluk mamalarını hak etmek için her zaman olduğu gibi basurlarını çatlatıp kanatıncaya kadar yırtınırlar. olan masum vatandaşlarımıza oluyor maalesef, mamacı türöller 5 kuruş için pislik peşinde sabahtan akşama kadar dört nala koşarken vatandaşımız çile ve acı çekiyor.bir değil, on değil, artık sayı yüzlü rakamlara doğru gidiyor, kanmayın şunların vaatlerine, kendinizi başka türlü kurtaramazsınız...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}