{
  "id": "topic_5406511",
  "title": "_BlackStar",
  "author": "_BlackStar",
  "created_time": "July 16, 2022, 11:07:56 AM",
  "content": "From several cases involving user reputation, so far I have only realized that many Indonesian users are involved. They seem like a bunch of people or farmer accounts abusing the campaign, they ignore the rules and it looks like it's been around for a long time.At least, recently I've tag 9 Indonesian users [red - neutral] depending on what case they are involved in. Did this happen by chance or is it really a lot of spammers, cheaters from that country? Do you realize it?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5406511",
  "comments": [
    {
      "author": "Jawhead999",
      "created_time": "July 16, 2022, 11:47:40 AM",
      "body": "Indonesia is one of third world countries where the average income is really small and have many poor people, so it's nothing surprised if there's many cheaters or spammers from that's country. This same applies with the other third world countries e.g. Bangladesh, Pakistan etc. Honestly $50 is already enough to live per week, that's why many people are greedy to get more money. However I wonder why you're give a neutral trust to those 4 users, if you think they're an alts and abusing campaign, they're deserve to get red tagged. If you're only leave neutral tag because of merit abuse, you're correct since it doesn't worth of red tag. AFAIK alt accounts and didn't cheat any campaign are allowed in this forum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pandu Geddon",
      "created_time": "July 16, 2022, 11:55:22 AM",
      "body": "Quote from: _BlackStar on July 16, 2022, 11:07:56 AMDid this happen by chance or is it really a lot of spammers, cheaters from that country? Do you realize it?not only from Indonesia. many scammers and cheaters who come from other countries. I may not see where they are coming from. cheaters will remain cheaters, wherever they come from they will get the punishment.for old accounts that are already on the forum, maybe we can find out where they are from their local board posts. but many new accounts only make posts for bounty reports. we will not be able to detect where they come from.for example, recently I also marked several newbie accounts which I strongly estimate, are also from Indonesia. that's because the same username is related to several popular names there.I would never see such a case from their home country. I understand issues relating to the state can be very sensitive.because I believe, many Indonesian members contribute to this forum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rikafip",
      "created_time": "July 16, 2022, 12:52:37 PM",
      "body": "@_BlackStar I am not sure what's the point of this topic. Is it to paint the whole Indonesian board as bunch of spammers and cheaters so we (or admins?) should do something about it? Fyi, Indonesian local board is one of the most active ones, so no surprise that they have a lot of account farmers and bounty abusers. And as @Jawhead999 pointed out, Indonesia is country with lower life standard meaning people will have more incentive to abuse rules and leech off the forum. It's not a valid excuse of course, but it is what it is. Still, ain't a reason to call out the whole board.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yahoo62278",
      "created_time": "July 16, 2022, 06:55:28 PM",
      "body": "Quote from: Rikafip on July 16, 2022, 12:52:37 PMIt's not a valid excuse of course, but it is what it is. Still, ain't a reason to call out the whole board. Exactly, EVERY culture has cheaters not just 1. Hell, the best sig designers on the forum IMO is Indonesian and he's not scamming anyone. I would lock this topic and just keep tagging cheaters.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "The Cryptovator",
      "created_time": "July 16, 2022, 07:14:10 PM",
      "body": "As long as the feedback you sent neutral is fine. But spam should handle by the forum. It's good you left feedback to warn the user but I won't recommend doing so. For alts, you can leave feedback due to abuse. If not abusing anything should leave feedback. Thousands of spammers around the forum, not possible to leave feedback for them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "logfiles",
      "created_time": "July 16, 2022, 08:56:54 PM",
      "body": "Quote from: _BlackStar on July 16, 2022, 11:07:56 AMAt least, recently I've tag 9 Indonesian users [red - neutral] depending on what case they are involved in. Did this happen by chance or is it really a lot of spammers, cheaters from that country? Do you realize it?I don't think we should make such a conclusion just because a dozen accounts from the same board have been tagged for cheating or spamming. By the way, the facts that you discovered some accounts were connected could mean that I just a couple of cheats, making you think there are over a dozen cheating Indonesians.  I believe there are also very awesome and good posters in the board, so let's not focus on the negative.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Stalker22",
      "created_time": "July 16, 2022, 11:24:07 PM",
      "body": "Indonesia is a large country with a very large population. Given their average income and standard of living, there is little doubt that many  Indonesians consider this forum \"the land of opportunity.\"It is not surprising that some try to cheat the system and climb the ladder of wealth and success by any means possible. However, one should not generalize and make a blanket statement that all Indonesians are the same. In reality, there are many cheaters in every nation on this planet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "_BlackStar",
      "created_time": "July 16, 2022, 11:34:56 PM",
      "body": "Sorry guys, I don't mean to generalize all Indonesian users are bad although in my case most of them made mistakes. I know this is not only happening to Indonesian users, but some third-country low income countries also seem to be the same. I know some of them are good user, they can be trusted and they are quality posters. But it is unfortunate that money has been detrimental to the behavior of some of them so far.Quote from: Jawhead999 on July 16, 2022, 11:47:40 AMHowever I wonder why you're give a neutral trust to those 4 users, if you think they're an alts and abusing campaign, they're deserve to get red tagged.I'm not sure about all of these accounts that deserve a red tag [need better evidence], but I believe they all are alt based on their behavior. Red tag are too risky at the moment, but neutral seems enough to warn anyone.Quote from: Rikafip on July 16, 2022, 12:52:37 PM@_BlackStar I am not sure what's the point of this topic. Is it to paint the whole Indonesian board as bunch of spammers and cheaters so we (or admins?) should do something about it?No, I shouldn't have made you think like that because it's actually about my curiosity. I don't want to encourage people to think that way, so this is just my perspective on some of them breaking the rules to the detriment of their account reputation.Quote from: The Cryptovator on July 16, 2022, 07:14:10 PMAs long as the feedback you sent neutral is fine. But spam should handle by the forum. It's good you left feedback to warn the user but I won't recommend doing so. For alts, you can leave feedback due to abuse. If not abusing anything should leave feedback. Thousands of spammers around the forum, not possible to leave feedback for them.I got a PM from that user and he explained what the problem was. I shouldn't have tag it for no reason, it's not as arbitrary as he mentions. But it doesn't feel right to be too selfish without considering removing that tag from his profile by accident, so I'm deleting it now.Quote from: logfiles on July 16, 2022, 08:56:54 PMI don't think we should make such a conclusion just because a dozen accounts from the same board have been tagged for cheating or spamming. By the way, the facts that you discovered some accounts were connected could mean that I just a couple of cheats, making you think there are over a dozen cheating Indonesians.  I believe there are also very awesome and good posters in the board, so let's not focus on the negative.  I understand, mate. So spam should be handled by forum but we reserve the right to warn those users out of kindness. That will have a huge impact on users, but maybe not all of them. Also I'm not saying all Indonesian users are bad, but that's only part of it. You must understand the meaning.Neutral tags on spammers are removed, but I'll still tag cheater as cheater if proven correct [regardless of where it comes from]. Sorry about the misunderstanding this one, but please don't think I've generalized all Indonesian users are bad. That's not something I meant, but that's only part of it. Thread closed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}