{
  "id": "topic_5434142",
  "title": "kalos15btc1",
  "author": "kalos15btc1",
  "created_time": "January 11, 2023, 12:49:17 PM",
  "content": "Hi gus,anyone can help me finding a tool or py script with smal tuto cuz im a begeinner, i want to scan a private key WIF format exempleL3HeT3RUm42QciZ..........1jRekCLEGZuzsXNmApy8GyvoedJi want to scan for exemple those 10 missing words, from 0 to 9 a to z A to Z , is there anytool for that and when it find the balance it shows me the private key ?i just need only WIF format starting with L  i guess  i have a private key missing 10 letters i want to find that wallet, im using windowsthank you for you help.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5434142",
  "comments": [
    {
      "author": "DaveF",
      "created_time": "January 11, 2023, 12:54:33 PM",
      "body": "Take a look here: https://bitcointalk.org/index.php?topic=5214021.0Keep in mind finding 10 missing characters is going to take just short of forever. Also the tool just finds the missing characters it does not check for balances.Where did you get the key from? Most, probably all, of them out there with missing characters are scams.-Dave",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kalos15btc1",
      "created_time": "January 11, 2023, 01:38:17 PM",
      "body": "thank you., but im using windows ... that cant help me.i didint buy it, i found it, and the adress have a btc balance.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o_e_l_e_o",
      "created_time": "January 11, 2023, 01:43:52 PM",
      "body": "Yeah, either FinderOuter as linked to above or btcrecover. Try both and see which one you get better speeds on given your hardware. And make sure to try btcrecover with GPU acceleration as well, as that can be an order of magnitude faster depending on your hardware.As DaveF rightly says though, 10 missing characters gives you 5810 possibilities, which is in the region of 430 quadrillion. Even if you can get up to 1 billion possibilities a second, that's going to take you over 13 years to exhaust the search space. For reference, a reasonable home computer can probably manage somewhere in the range of 1-5 million possibilities a second. You'll either need some very powerful hardware on an awful lot of time.Quote from: kalos15btc1 on January 11, 2023, 01:38:17 PMthank you., but im using windows ... that cant help me.I've not tried it on Windows, but there are Windows releases on GitHub, so it should work fine - https://github.com/Coding-Enthusiast/FinderOuter/releases/tag/v0.16.0.0Quote from: kalos15btc1 on January 11, 2023, 01:38:17 PMi didint buy it, i found it, and the adress have a btc balance.Then you are wasting your time. If it was possible to break in to, someone would have done it already.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LoyceV",
      "created_time": "January 11, 2023, 01:44:54 PM",
      "body": "Quote from: kalos15btc1 on January 11, 2023, 01:38:17 PMi didint buy it, i found it, and the adress have a btc balance.You found it, as in I found a paper wallet on a beach? You may be wasting your time.How do you even know the private key belongs to the address? With 58^10 possibilities, you're looking at 430 quadrillion possibilities. At 1 billion tries per second, it's still going to take years to find it.Has the address ever been used to send funds? Knowing the public key would make brute-forcing much faster.Quote from: o_e_l_e_o on January 11, 2023, 01:43:52 PMAs DaveF rightly says though, 10 missing characters gives you 5810 possibilities, which is in the region of 430 quadrillion. Even if you can get up to 1 billion possibilities a second, that's going to take you over 13 years to exhaust the search space. You'll either need some very powerful hardware on an awful lot of time.Let's just say GMTA",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NeuroticFish",
      "created_time": "January 11, 2023, 01:45:34 PM",
      "body": "Quote from: kalos15btc1 on January 11, 2023, 01:38:17 PMthank you., but im using windows ... that cant help me.i didint buy it, i found it, and the adress have a btc balance.FinderOuter also works under Windows. You can look up the way it works, I think that this is the relevant part.And you can get it from here, just look for Windows files.As already said, the more import problem for you is to reduce that number of missing characters, 10 is too many.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PawGo",
      "created_time": "January 12, 2023, 05:03:53 PM",
      "body": "Quote from: DaveF on January 11, 2023, 12:54:33 PMTake a look here: https://bitcointalk.org/index.php?topic=5214021.0Keep in mind finding 10 missing characters is going to take just short of forever. Not necessarily.Using my WifSolverCuda, the WIF like in the example could be checked in a reasonable time (it is compressed and we have a middle part missing).https://github.com/PawelGorny/WifSolverCudaAdditionally, if target address is known and public key is known, using Kangaroo makes it (almost) trivial.PS: if you found online/bought that partial key, do not waste your time",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}