{
  "id": "topic_5462154",
  "title": "pawel7777",
  "author": "pawel7777",
  "created_time": "August 05, 2023, 08:50:54 AM",
  "content": "We don't see many mentions of Bitcoin on BBC (which stands for the British Broadcasting Corporation, for the porn-brain-fried Americans) but we finally have this one from yesterday. The part about her posing as \"economist, serial entrepreneur, software investor and rapper\" really made me chuckle.Razzlekhan and husband guilty of $4.5bn Bitcoin launderhttps://www.bbc.co.uk/news/technology-66390639QuoteA husband and wife cyber-crime team have pleaded guilty to trying to launder $4.5bn (£3.5bn) of Bitcoin that he had stolen in a hack in 2016.Heather Morgan and Ilya Lichtenstein were arrested last year in New York after police traced their riches back to the crypto heist.While evading police, Morgan masqueraded as a rapper and tech entrepreneur.As part of a plea deal, Lichtenstein admitted he was behind the hack.The couple both pleaded guilty to money laundering, but Morgan pleaded guilty to an additional count of conspiracy to defraud the United States.In spite of attempting to cover up her crimes, Morgan published dozens of expletive-filled music videos and rap songs filmed in locations around New York, under the name Razzlekhan.In her lyrics she called herself a \"bad-ass money maker\" and \"the crocodile of Wall Street\".",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5462154",
  "comments": [
    {
      "author": "Kakmakr",
      "created_time": "August 15, 2023, 05:54:19 AM",
      "body": "I am not 100% convinced that they did the actual hack on Bitfinex and I support Brett Johnson (white hat cybersecurity expert) on his opinion that they bought stolen information from someone else that did the hack and that they were just trying to launder the money. The money laundering was also very amateurish and sloppy, with Lichtenstein having Coinbase accounts that were directly connected to his real identity.  The plot thickens..... let's see what is going to happen in the future.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}