{
  "id": "topic_5445964",
  "title": "Alpha Marine",
  "author": "Alpha Marine",
  "created_time": "March 22, 2023, 08:02:39 PM",
  "content": "I had this barber friend in a neighboring hood I lived a few years ago who is a very good barber and has his own barbershop. He does home service from time to time too. He’s really good so he has a lot of customers but at the end of the month he always struggles to pay the rent of his shop. I spent most of my free time with him at his shop so I know the number of customers that walk in for a haircut daily and I know what his rates are, so by calculations, he should be making enough money even after rent and other expenses required to run the shop. So one day when he complains about rent I asked him how much he makes in a week and he couldn't tell me an estimated number. Long story short, I educated him on how to keep financial records and record every single penny that comes in and goes out of his business. I also made him understand how this can help him cut losses and make more profit. The point of this whole story is that I have encountered a lot of people who have small businesses and don't even bother about keeping records in their businesses and this single reason could be a hindrance to growing your business. No matter the kind of business you do, you should be able to know if you are making a profit or running at a loss. After analyzing a distant relative business I found out that she was taking money from another business to sustain another business. In the long run, both businesses will go under. Not only does a good financial record help minimize losses but it also helps lessen the burden of your taxes. You don't have to be a big corporation before you keep a record of your daily financial transactions. And no, it doesn't have to be a perfect or standard financial record or statement. It could be done in any way you and the next person will understand. It should just include all the money coming into your business and all the money going out of the business in whatever form. At the end of the day, you should be able to know how much you made in total, how much you have at hand at the moment, how much went to your bank account, how much is in the hands of debtors, how much you owe for bills and to your customers or any other person or entity. An accurate financial record helps you;Know the progress of your business: It's through the financial record that you know if your little business is safe or about to go under. If your business is safe your records will also let you know how safe you are. When your records have enlightened you on the future of your business then you can now make a decision based on what the financial records show. Identify income sources and reduce unnecessary expenses: When you look at your financial records at the end of the month and you see the business not heading in the desired direction, then you do something about it, You can either start cutting down expenses that are not necessary or identify the part of your business that generate the most income and put more focus on it. Allows you to attain complete regulatory compliance: I stated earlier that an accurate financial record helps with your taxes. Of course, you have to pay taxes, but you can't do that accurately if you don't keep an accurate financial record and that might put you and your business in trouble with the regulatory bodies in the future. Not only does our financial record help figure out your taxes but it also supports the items written on your tax returns. There are many more benefits of keeping financial records and I know it's not the most exciting part of your business but it is essential to your business. It doesn't matter how small your business is, be it, laundry, hair salon, boutique, online store, etc, always keep financial records. I have always wanted to organize something like a free seminar and educate the owners of small businesses in my community about this but I'm a very introverted and shy person so I don't know how to go about it, please I will appreciate ideas.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5445964",
  "comments": [
    {
      "author": "Die_empty",
      "created_time": "March 22, 2023, 09:16:22 PM",
      "body": "Let me add that every business that wants to grow or expand must keep comprehensive and accurate records. One of the most important criteria to access loans or credit facilities is your financial or business accounts. So I want to commend you OP for helping your barber friend to start keeping records. You have to know that your plan to organize a seminar on record keeping is to help your community. If you don't assist them many of them will fail in business. Your intention is not to make gain but to help your community so you should be bold to stand before your community members. These are my piece of advice:1. Ensure you do proper planning like the venue and public address systems.2. Prepare your seminar note and ensure you master the lessons. Let your lecture be simple to understand and straight to the point.3. Get an assistant that is an extrovert who will help to cover up for your weakness4. Practice public speaking before the seminar.All the best mate.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "panganib999",
      "created_time": "March 22, 2023, 09:40:02 PM",
      "body": "This is one of the most basic and most fatal mistakes you could commit to your budding business as a learning entrepreneur, not keeping tabs and checks of your financial records. As what OP have said, that's how you know if over time, your business is bleeding money or it's turning a profit, as well as what product/service the problem/blessing is coming from. Not only will a financial record help you keep track of how your business is growing, it also helps you formulate plans that are in line with what you need at the moment, instead of rushing in and changing things from your business blindly and belligerently. You can never go wrong with keeping records of expenses and profits really. That's going to be your best friend if you're an entrepreneur that recently just started, heck even seasoned entrepreneurs know how important this is.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oceat",
      "created_time": "March 22, 2023, 09:41:45 PM",
      "body": "Nice list and advices for the future business owners, this will help them. I've seen a lot of business owners who doesn't keep their financial records as if they are gaining enough profit and use the money for unnecessary things but at the end of the month they're struggling hence, they take a loan to cover up their capital again.Quote from: Die_empty on March 22, 2023, 09:16:22 PM3. Get an assistant that is an extrovert who will help to cover up for your weaknessI like that idea or perhaps if all of OP's people know how to use social media then create a post/thread in a group. It may be difficult to establish a free seminar or meeting since you aren't known to people yet I assumed but if they really know who you are then you can follow what's the above reply suggested.Best of luck, OP",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mahanton",
      "created_time": "March 22, 2023, 09:43:53 PM",
      "body": "Quote from: Alpha Marine on March 22, 2023, 08:02:39 PMI have always wanted to organize something like a free seminar and educate the owners of small businesses in my community about this but I'm a very introverted and shy person so I don't know how to go about it, please I will appreciate ideas.  If you are really that tending to have that free seminar then you could actually launched one but since you do said that you are a shy type then why not going with those owners and making up some meeting 1 by 1??For sure it wont really be that much and also if you do have the time then this wont really be an issue.Its really that something commendable on what you have done on trying out to share on how business should really be handled out and i do really that agree on what you had stated about business plans and handling specially on trying to monitor your expenses which this is the one could really make things mess upmost of the time.If you dont just put up focus on this one then there's no way you could really be able to see some progress.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dr.Bitcoin_Strange",
      "created_time": "March 22, 2023, 10:03:56 PM",
      "body": "Quote from: Alpha Marine on March 22, 2023, 08:02:39 PMLong story short, I educated him on how to keep financial records and record every single penny that comes in and goes out of his business. I also made him understand how this can help him cut losses and make more profit. I have always wanted to organize something like a free seminar and educate the owners of small businesses in my community about this but I'm a very introverted and shy person so I don't know how to go about it, please I will appreciate ideas. Your friend probably doesn't know how to go about keeping records, or just laziness is his issue (it's good you talked to him about it; maybe you have just saved someone's ass). I had a female friend who was doing small-scale business; after she closes out her business, I will always ask her if she is done with her daily market analysis, and her response always is that \"she's so tired and can't do any calculations at the moment\". She was so lazy about it and cared less about it, but one day she came to me so angry, complaining that her capital was not even up to 60% of her initial capital. First, I was angry too because I had to blame her for not listening to my advice in the first place. Most times, some of these business folks may know the right thing to do to keep their business intact, but they just become less concerned because they feel so convinced that nothing is going to go wrong.The main reason for keeping records in business is to know where your losses are coming from. If you don't keep records as a business person, you may incur losses that you can't explain.Since you said you are an introvert, conducting the seminar may be challenging for you, and you will have to spend some cash to get a venue for the seminar. You will also need a projector and a microphone, and you will definitely spend very little or a lot of money to get the seminar done. If it is in my country, to hire a minimum event centre will cost you about $300 to $400, but a projector, microphone, and speakers will be made available.My advice here is that you could just go to a cybercafé and prepare educational material on a paper of about four pages, depending on the level of education you want to pass on to them. Then, you can duplicate it for the number of people you intend to organize the seminar for, and then you can visit them and share the script with them, just telling them it's a guide to keeping good financial records of their business. Just my opinion.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Alpha Marine",
      "created_time": "March 22, 2023, 10:11:09 PM",
      "body": "Quote from: Die_empty on March 22, 2023, 09:16:22 PMLet me add that every business that wants to grow or expand must keep comprehensive and accurate records. One of the most important criteria to access loans or credit facilities is your financial or business accounts. So I want to commend you OP for helping your barber friend to start keeping records. You have to know that your plan to organize a seminar on record keeping is to help your community. If you don't assist them many of them will fail in business. Your intention is not to make gain but to help your community so you should be bold to stand before your community members. These are my piece of advice:1. Ensure you do proper planning like the venue and public address systems.2. Prepare your seminar note and ensure you master the lessons. Let your lecture be simple to understand and straight to the point.3. Get an assistant that is an extrovert who will help to cover up for your weakness4. Practice public speaking before the seminar.All the best mate.Thanks a lot mate.Your 4th point! I have paid for an online course in public speaking but I'm a little too occupied to keep up and to be honest, I'm a little lazy with the course. I'll put in more effort though. Thanks again for your points, i'll use them to get better.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o48o",
      "created_time": "March 22, 2023, 10:35:36 PM",
      "body": "Quote from: Alpha Marine on March 22, 2023, 08:02:39 PM-cut-There are many more benefits of keeping financial records and I know it's not the most exciting part of your business but it is essential to your business. It doesn't matter how small your business is, be it, laundry, hair salon, boutique, online store, etc, always keep financial records. -cut-You are speaking sense, people seem to think it's hard work but with spreadsheets it really isn't. And there are only upsides of keeping records of everything. It keeps your mind clear too as you don't have to think about any of those numbers after you have marked it down. Just remember to organize/label everything so that it's easy to approach afterwards when you have totally forgotten what your markings are. That's why clear notes with every transaction is a good thing. You never know when you need to dig your history up and who reads it.If someone doesn't know how to use spreadsheets efficiently, it's worth learning.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "livingfree",
      "created_time": "March 22, 2023, 10:39:43 PM",
      "body": "I agree about keeping records regardless of how big or small your business is. Let's just look at that perspective that huge corporations have their financial statements being record which includes the accounts payable and receivables and even their debt.As a small business guy, it's important to track and record your expenses and profits for you to determine on how much you should be able to deduct and be after all of it to take your profit.Plus, it's important to have always a back up when you're starting out your business. It could be a fund or another business to support it until you think that it's not longer sustainable even if some support from your other source.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lousie9",
      "created_time": "March 22, 2023, 11:32:51 PM",
      "body": "you have done the right and good thing OP, about to teach him the habit of keeping records of all his business transactions.it's true that not many people are aware that actually having detailed financial records will really help us, whatever our business is regardless of whether we have a small or medium-scale business, of course having financial records will be very useful so that we can evaluate finances and manage income and expenses more wisely for our business.but sometimes some people don't want them to bother to record all transactions in their business in detail even though it includes a small business.Making it a habit to record expenses and income indirectly is one way that we can build a more disciplined lifestyle in my opinion.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tabas",
      "created_time": "March 22, 2023, 11:46:50 PM",
      "body": "Quote from: Alpha Marine on March 22, 2023, 08:02:39 PMAn accurate financial record helps you;One of it, is if your business has some employees maybe one or two and there's some odd records that you're seeing and they're cheating you and your business then you'll be able to figure it out. Quote from: lousie9 on March 22, 2023, 11:32:51 PMMaking it a habit to record expenses and income indirectly is one way that we can build a more disciplined lifestyle in my opinion.Yes, it's a habit that's going to be adopted by you and make use of it as an attitude towards everything where things are accountable and you'll just making sure that everything is black and white and you've got records of it. And that's the literal thing for the words that we here of, for the record.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fuer44",
      "created_time": "March 23, 2023, 02:21:26 AM",
      "body": "For small entrepreneurs, they don't keep financial records because the turnover they get every day is small, or at least they can still calculate it manually. For example vegetable sellers, snacks, roadside barbers, they don't need to do that because they think the turnover they get is still easy to calculate. Regardless of expenses or costs that come out (not for their business purposes) which in the end they are sometimes \"minus\" because they are not thorough.I agree if you want to educate them, but note that the average business actor is 25-30 years old, because if it's above that, they are usually comfortable with the business they are doing in their own way.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hannahB4",
      "created_time": "March 23, 2023, 03:15:10 AM",
      "body": "Keeping a financial record is good because it will help you determine if the business is successful or not. You doing your income and expenditure daily will give you an insight into how the monthly one will look like and also teach you some practical things you need to do. For instance, cutting down your expenses and saving more.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sebas.tian",
      "created_time": "March 23, 2023, 03:40:53 AM",
      "body": "Taking accurate financial records in your business will really help you to do so many things that will help you to improve higher in some financial areas you are not doing well, and to maintain some areas you are doing well financially in that particular business. I believe, there are a lot of things many people need to learn from this topic to be able to improve their businesses which is very important to humanity, so that many things will go smoothly in the financial aspect. I think, the seminar will really help business owners to make some positive changes in their businesses, and they will never forget your impact in their businesses.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Silberman",
      "created_time": "March 23, 2023, 04:42:48 AM",
      "body": "Quote from: panganib999 on March 22, 2023, 09:40:02 PMThis is one of the most basic and most fatal mistakes you could commit to your budding business as a learning entrepreneur, not keeping tabs and checks of your financial records. As what OP have said, that's how you know if over time, your business is bleeding money or it's turning a profit, as well as what product/service the problem/blessing is coming from. Not only will a financial record help you keep track of how your business is growing, it also helps you formulate plans that are in line with what you need at the moment, instead of rushing in and changing things from your business blindly and belligerently. You can never go wrong with keeping records of expenses and profits really. That's going to be your best friend if you're an entrepreneur that recently just started, heck even seasoned entrepreneurs know how important this is. This is true for people too, even if they do not have a business they have an income and expenses as well, and while I suppose most people could tell you how much they earn on a month, for what I can tell those same people cannot tell you how much they spend on a month, so how is it possible for them to reach any kind of goal when it comes to their money when they do not have such basic information? After all without that information there is no way for them to make adjustments to their budget and reduce their expenses if necessary.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "YUriy1991",
      "created_time": "March 23, 2023, 06:44:39 AM",
      "body": "What you mentioned above is suitable and hits. Another important point to consider is separating your personal finances from your business finances. While traveling it may be tempting for someone to use your business account for personal expenses or vice versa, but this will only make it more difficult to keep track of your money and can lead to legal or financial problems later on. Separate bank accounts and credit cards for your personal and business expenses.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Findingnemo",
      "created_time": "March 23, 2023, 07:23:06 AM",
      "body": "This doesn't applies only for business, every individual need to maintain their income and expense record and actually this is the first step we need to follow when we wanted to save money, invest and get better life style than how we used to be now.I personally know many of my friends don't have such habits even though they are making lot of money with decent job still they are living pay check to pay check and need to use the credit cards when the expenses get out of their limits and I know this all happens because they don't really know whether they are spending the hard earned money in the right way or just to show off among others.@OP this is very wide topic, not even an article is enough cause we need to write a book about this to explain more in detail.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fakhrulenclix",
      "created_time": "March 23, 2023, 07:49:21 AM",
      "body": "I think financial records are really needed for entrepreneurs, even non-entrepreneurs are really needed. Because we can easily analyze if there are obstacles or problems in the business world that we live in, so we can easily track down the mistakes we make or control unnecessary expenses.That way we are more efficient in unnecessary expenses in the future.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "March 23, 2023, 07:50:55 AM",
      "body": "i too see this many times in businesses and years ago i helped out (pre bitcoin life)one example was that there was a local \"burger van\" (food truck) which was always busy and popular, never a dull moment. but it always had issues struggling to pay its employees wages.the solution was not direct record keeping*. it was calculating a fair price to charge. it was producing food too cheap that it did not cover costs. thus every customer was getting food for less then the cost to create it. and thats why it got soo popular but that popularity was harming the businessdoing simple things like cost evaluations EG accounting for the cost of supply of goods(frozen) + labour plus energy usage of the cooking methods. and then coming to a fair retail price of the end food product. *this too requires keeping records of stock/labour/ sales to then evaluate the cost:profit ratio..so record keeping is important..as for doing a seminar. which can be a web seminar of a pre-recorded video followed by a Question and Answer section. can be hosted online.so dont worry about being an introvert, you can easily make a video that does not even require showing your face or having to speak loudly live. you can have 90% of the seminar. pre-recorded/edited on your own, where you can use images of businesses and charts and records as the on-screen view instead of your face. and when it comes to the Q&A section that can be in text response or using a text to speech tool to turn your keyboard words into vocal. web seminars can be set up as free to view or using a subscription setup for access. once you gain confidence to be seen and heard. you can choose to then do an in-person conference where you stand on stage with a audience attendingdont worry so much about your confidence. worry about the contents of your webinar, seminar, conferenceattendee's/viewers dont care or demand speakers presence. as long as they get meaningful/helpful content",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Alpha Marine",
      "created_time": "March 23, 2023, 10:26:45 AM",
      "body": "Quote from: Findingnemo on March 23, 2023, 07:23:06 AM@OP this is very wide topic, not even an article is enough cause we need to write a book about this to explain more in detail.I know right? While writing the post I tried my best to make it as short as possible so people won't get tired of reading. There are a lot of things to be said. I even wanted to add an image or two to show people how they could easily record their financial records on a spreadsheet or a notebook. It really is very broad. Quote from: franky1 on March 23, 2023, 07:50:55 AMone example was that there was a local \"burger van\" (food truck) which was always busy and popular, never a dull moment. but it always had issues struggling to pay its employees wages.the solution was not direct record keeping*. it was calculating a fair price to charge. it was producing food too cheap that it did not cover costs. thus every customer was getting food for less then the cost to create it. and thats why it got soo popular but that popularity was harming the businessThis reminds me of when I was managing a bar immediately after college. There was this particular brand of beer that was way more expensive than the rest but my boss sells it at the same price as the other beers. When I looked at the books it turns out we were actually making less than it cost to buy that particular beer. Without proper recording we wouldn't have discovered this. Quote from: franky1 on March 23, 2023, 07:50:55 AMso dont worry about being an introvert, you can easily make a video that does not even require showing your face or having to speak loudly live. you can have 90% of the seminar. pre-recorded/edited on your own, where you can use images of businesses and charts and records as the on-screen view instead of your face. I think this actually a better option to start with. Thanks so much for this.I know that if I keep working on myself i'll be better at public speaking and for now doing what you just suggested is a great way to start.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}