{
  "id": "topic_5471601",
  "title": "LoyceV",
  "author": "LoyceV",
  "created_time": "October 25, 2023, 11:33:39 AMLast edit: October 26, 2023, 08:01:04 AM by LoyceV",
  "content": "Yehey another Ratimov topic!I noticed Ratimov has been deleting content from his own topics, after which he must have reported it and Mods deleted the topics (in that post I linked 58 topics). Speculation is this is to hide traces of his past plagiarism, but I can't know his reasons for sure. The timing is at least peculiar after his DT1-status was questioned again.He now also deleted 6 of my posts from his self-moderated topics, and deleted all other posts from others users too.I find it utterly disrespectful to do this on a forum. It also means I never want to post in any of his self-moderated topics again, so Ratimov is now on my Ignore list.Ratimov - 2 Years on Bitcointalk + Giveaway !!!: 69 posts, 46 Merits earned.6k Merit Club. When is Legendary ?: 74 posts, 12 Merits earned.I was curious how many Merits he earned in the past for the other topics he's now deleting, so I checked: in those 58 topics, he earned 202 Merits. Apparently users valued those posts a lot more than he values them by himself.No spamSelf-moderated against spam. That's how this feature should be used.Discussion is of course welcome.I will delete insults from digaran. Even better, I'll delete all his posts here. He's on my ignore list for a reason.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5471601",
  "comments": [
    {
      "author": "BitcoinGirl.Club",
      "created_time": "October 25, 2023, 12:32:18 PM",
      "body": "Quote from: LoyceV on October 25, 2023, 11:33:39 AMYehey another Ratimov topic!No! No! No! Not again!Now I realize why wasn't I find my posts when I wanted to get some reference of some lame conversation with Ratimov. So basically he moves his topics to archive, deletes his own posts from the topic, then the replies for those posts by others become irrelevant, and finally he reports the entire topic to the moderator to delete the whole topic.By this, he was again making the moderators fool. It's not new from him. The moderators should be ashamed of it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Plaguedeath",
      "created_time": "October 25, 2023, 12:41:27 PM",
      "body": "I wonder why the moderator can agree to delete his threads when they has state they will not clean a report of old posts.QuoteOld post: We generally do not moderate posts this old for on-topicness, substantiveness, multi-posting, and other \"cleanliness\" issues.As for \"hide traces of past plagiarism\", I'm not sure if \"hide\" is correct terms because isn't it fair for people to delete or edit their posts to correct their past mistakes?I think there's nothing wrong to do that, but deleting people posts for a sake of own satisfy is childish.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "examplens",
      "created_time": "October 25, 2023, 01:05:27 PM",
      "body": "There were several criticisms here for the too-frequent opening of new threads to celebrate his achievements on the forum, plus plagiarism charges. He obviously wants to remove all references, at least those under his control.It doesn't bother me personally that he deleted a few of my posts. Still, with everything from GazetaBitcoin's thread a bit disappointing from someone who is really trying to build a reputation here.Quote from: BitcoinGirl.Club on October 25, 2023, 12:32:18 PMSo basically he moves his topics to archive, deletes his own posts from the topic, then the replies for those posts by others become irrelevant, and finally he reports the entire topic to the moderator to delete the whole topic.In doing so, he moved some of them to the Russian local board.   For example https://bitcointalk.org/index.php?topic=5379199",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "October 25, 2023, 01:21:15 PM",
      "body": "I noticed that some of my posts were deleted, but they were in the self-moderated topic, after reviewing Many topics, I do not think that the reason for the deletion was to hide plagiarism or any other activities. He may have been a little disturbed by his previous posts.Frankly, I did not find enough time to read the GazetaBitcoin topic, so my reply is limited to my posts that have been deleted.https://ninjastic.space/post/59625601",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitcoinGirl.Club",
      "created_time": "October 25, 2023, 01:24:00 PM",
      "body": "Quote from: Plaguedeath on October 25, 2023, 12:41:27 PMI think there's nothing wrong to do that, but deleting people posts for a sake of own satisfy is childish.I disagree, not childish but evil.He is deleting conversations where he was accused to be a plagiarist and the conversations where he insulted others badly. He removes it to hide his trace so that it does not effect his DT position, I can not think any other reason for it. Quote from: examplens on October 25, 2023, 01:05:27 PMtrying to build a reputation here.People build their reputation here, gives their time maybe for the love for Bitcoin or maybe to have a business f their own. Everyone works on building their reputation but when someone is obsessed with their reputation and using the hole of the system to achieve it then their motive become questionable. Since they are not honest, trusting them with anything can be risky.Quote from: examplens on October 25, 2023, 01:05:27 PMIn doing so, he moved some of them to the Russian local board.   For example https://bitcointalk.org/index.php?topic=5379199No doubt he study the wholes and use the wholes in his favor to fool moderators, to fools everyone else.Quote from: hugeblack on October 25, 2023, 01:21:15 PM[....] after reviewing Many topics, I do not think that the reason for the deletion was to hide plagiarism or any other activities. He may have been a little disturbed by his previous posts.Frankly, I did not find enough time to read the GazetaBitcoin topic, so my reply is limited to my posts that have been deleted.Well find enough time to read it before giving any statement about the emotional state of Ratimov. Clearly you too were fooled like everyone else.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaveF",
      "created_time": "October 25, 2023, 01:29:26 PM",
      "body": "Looks like he moved some of them too:https://bitcointalk.org/index.php?topic=5379199I had a reply deleted from there, and I know I never posted in the Russian section.Don't know when he moved it, could have been when he removed the posts this AM could have been 18 months ago.Not a big deal since between https://loyce.club and https://ninjastic.space/ there are copies of just about everything.-Dave",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DireWolfM14",
      "created_time": "October 25, 2023, 01:36:38 PM",
      "body": "Honestly, I've gotten really bored with the forum's drama.  It's come down to bickering between overly thin-skinned members who can't refrain from retaliating against each other.I was summoned to the previous thread about Ratimov a couple of times, but I had no interest reading through it, and less in responding.  How I long for the days of Bitcointalk trolls that could handle themselves in a trollfest.  The days of Tecshare, nullius, and cryptohunter seem to be long gone.  Good times, good times.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Don Pedro Dinero",
      "created_time": "October 25, 2023, 01:40:47 PM",
      "body": "I wouldn't want to get too caught up in the drama either, which at first seemed to me to be just another case of one DT and another not liking and red tagging each other. But this behaviour of Ratimov deleting and moving so many threads doesn't look good to me. Is he supposed to come and explain what he has done or what? It is clear that what he has done is suspicious to say the least.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GazetaBitcoin",
      "created_time": "October 25, 2023, 01:42:19 PMLast edit: October 25, 2023, 08:08:43 PM by GazetaBitcoin",
      "body": "Quote from: LoyceV on October 25, 2023, 11:33:39 AMI noticed Ratimov has been deleting content from his own topics, after which he must have reported it and Mods deleted the topics (in that post I linked 58 topics). Speculation is this is to hide traces of his past plagiarism, but I can't know his reasons for sure. The timing is at least peculiar after his DT1-status was questioned again.Great job, LoyceV! Now we're getting somewhere!Perhaps, more and more people will open their eyes now about RATimov's shenanigans. I would have merited your topic but I am out of sMerits. Still, I believe that your topic would deserve at least a 50-merits bomb.For those interested in more shenanigans done by Ratimov, I present you also a list-with-questions-to-which-he'll-never-answer:Quote from: GazetaBitcoin on October 24, 2023, 06:51:20 AM1. Why did he delete all his posts (together with OP's content) from the topic where he was hunting airfinex (after airfinex exposed his plagiarism)? Furthermore, why did he do it only after (1) The Pharmacist threatened him that he will distrust him and others will do the same; (2) DireWolf called him out for his miserable attacks toward anyone daring to state the truth about him; (3) LoyceV dotted the I once again, stating that if someone says a truth about Ratimov, then Ratimov gives him a negative feedback?2. Why did he try to hide this topic in Archival board for years?3. Why, after hiding this thread in Archival board for years, last week he managed to convince a mod to delete he thread? (For those unaware, I created a topic in Archival board containing all Ratimov's insults just after the mess he did inside AOBT thread. The date of that topic was September 28th. Is it only a coincidence the fact that Ratimov managed to have his tracks deleted just after I created that topic in Archival board? Lol! Or did he anticipate that I'll create this topic and I'll be thorough enough to find also all his hidden evidence incriminating him, thus he started begging mods to delete that thread from Archival board?)4. Why do you think that he never justified how, in his opinion, the feedbacks he leaves while he is in rage / dementia state respect the correct use of Trust system? Example of such feedbacks (most are negative - attention! - not neutral and without ref link):QuoteStupid degenerate, liar and shitposter.Quoteannoying cretin who will write all sorts of nonsense [...] absolutely incompetent moron [...]QuoteLiar and provocateur [...] creates conflicts out of nowhere  [...] Shitposter and collector of various rumors [...]^Does the above feedback remind you of TimeLord's feedbacks?Let's go on with the examples:QuoteMy personal dogQuoteUseless dumb hysterical bitchQuoteA fuckhead with a broken head. After being raped by all the WEX employees, taking all his mother's money [...]So yeah, I wonder what is the connection between such feedbacks and financial deals (the purpose of Marketplace Trust system). Don't you? Especially the rape part.5. Why did he delete all those feedbacks and / or replaced them (with some which contain less insults but are still insulting) after DT's eyes were on him?6. Why, based on his \"rational\" mind, was it needed to give me not just 1 negative feedback, but 2 (!!!), just one after the other, plus a neutral one immediately after, all without ref link and all stating words like \"degenerate\", \"cretin\" etc.?7. Why did he delete all his posts from AOBT thread + the ones from this thread (+ probably hundreds of other similar posts) where he insulted all those people? (Could it be only for looking like a hypocrite nice guy, which always talks politely? -- wink wink).8. Why did he stop using his miserable introduction (\"In this article I would like to touch upon such a theme [...]\") after he was exposed for plagiarism? If he was not banned then it meant he did not plagiarize anything, right? So why did he stop using that sentence through which he stole other authors' work and presented it like it was his? Again, wink wink.9. Why does he always accuse someone of same things that are exposed from his miserable character? Example: BitcoinGirl.Club leaves him a feedback reminding of his plagiarism and immediately after Ratimov leaves a retaliatory feedback to BircoinGirl.Club stating that BitcoinGirl.Club is a plagiarist (LOL!) -- again, without presenting any evidence for this claim. Example 2: inside AOBT thread I remind him of his ol' good plagiarism & copy-pasting era, which brought him zillions of merits for stealing someone else's work and then he immediately calls me \"GazetaCopyPasteWhoreBitShitcoin\", accusing me of \"eternal copy-paste of other people's works\". Excepting that such reactions look like the ones of a 3 years old child, the question still stands.Quote from: examplens on October 25, 2023, 01:05:27 PMIn doing so, he moved some of them to the Russian local board.   For example https://bitcointalk.org/index.php?topic=5379199He also emptied then moved to Russian board one of the topics containing his infamous introduction \"In this article I would like to touch upon such a theme [...]\".Quote from: GazetaBitcoin on October 25, 2023, 01:27:22 PMFurther evidence: Ratimov also deleted one of the threads where he used his infamous introduction \"In this article I would like to touch upon such a theme [...]\"The above link is a quote from a post made by nullius, which quoted a post made by Ratimov where he used that expression. Now Ratimov's post is moved to Russian board and the topic is empty: https://bitcointalk.org/index.php?topic=5296174.msg55742220#msg55742220Quote from: Plaguedeath on October 25, 2023, 12:41:27 PMAs for \"hide traces of past plagiarism\", I'm not sure if \"hide\" is correct terms because isn't it fair for people to delete or edit their posts to correct their past mistakes?I think there's nothing wrong to do thatOf course it's correct. All thieves try to hide their traces, right? It would be stupid to steal and to not care about leaving traces leading to you. /sQuote from: hugeblack on October 25, 2023, 01:21:15 PMFrankly, I did not find enough time to read the GazetaBitcoin topic, so my reply is limited to my posts that have been deleted.I strongly recommend you to do it. You'll be surprised (BitcoinGirl.Club can confirm ).Quote from: BitcoinGirl.Club on October 25, 2023, 12:32:18 PMSo basically he moves his topics to archive, deletes his own posts from the topic, then the replies for those posts by others become irrelevant, and finally he reports the entire topic to the moderator to delete the whole topic.Basically yes. After he noticed that I exposed him for doing that he hurried to bury all the remaining evidence thus, in the end, it would show up that he never plagiarized / never abused Trust system / never insulted anybody / never weaponized  the Trust & Merit system.Quote from: BitcoinGirl.Club on October 25, 2023, 12:32:18 PMBy this, he was again making the moderators fool. It's not new from him. The moderators should be ashamed of it.Unless he has a shenanigan going on with the mod which accepted to delete the topics incriminating him.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitcoinGirl.Club",
      "created_time": "October 25, 2023, 01:52:03 PM",
      "body": "Quote from: GazetaBitcoin on October 25, 2023, 01:42:19 PMQuote from: BitcoinGirl.Club on October 25, 2023, 12:32:18 PMBy this, he was again making the moderators fool. It's not new from him. The moderators should be ashamed of it.Unless he has a shenanigan going on with the mod which accepted to delete the topics incriminating him.Local boards are on my ignore list to keep my forum view simple. I had to use another browser to see the mods of Russian board. xandry, Xal0lex, would you confirm how many topics you have deleted or do we have a way to check statistics of which moderator deleted which users topics, posts how many times?This raise concern that why he preferred to move an English topic to a non-English board [his local of-course] and expected it to be deleted or already deleted.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LoyceV",
      "created_time": "October 25, 2023, 02:04:44 PM",
      "body": "Quote from: BitcoinGirl.Club on October 25, 2023, 01:52:03 PMThis raise concern that why he preferred to move an English topic to a non-English board [his local of-course] and expected it to be deleted or already deleted.Maybe this is the reason:Quote from: Xal0lex on August 19, 2023, 09:52:58 AMI personally process reports regardless of the date of the post or topic.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GazetaBitcoin",
      "created_time": "October 25, 2023, 02:22:23 PM",
      "body": "Quote from: BitcoinGirl.Club on October 25, 2023, 01:52:03 PMThis raise concern that why he preferred to move an English topic to a non-English board [his local of-course] and expected it to be deleted or already deleted.Don't forget also the topic he hid for years in Archival board -- the topic where he hunted airfinex after airfinex exposed his plagiarism. After The Pharmacist threatedned him with distrust and after DireWolf also dotted the i a few times, RATimov hid the topic in Archival board and deleted all his posts and the topic content. After he had a feeling that I'll come up with some more evidences against him he also managed to convince a mod to delete that topic from Archival board, for deleting all the remaining evidence. However, I saved some screenshots, thus those not accustomed with ninjastic.space could see the mess he did there too.Quote from: GazetaBitcoin on September 28, 2023, 04:58:28 PMOne of his first such miserable attack was against airfinex, the user which exposed him for plagiarism. On September 8th, 2021, Ratimov created a topic, hunting airfinex and attacking him as being someone's alt or a bounty cheater. DireWolf and The pharmacist were very vocal against him and scared him enough thus he deleted all his posts inside that thread and hid the thread in Archival board, hoping that nobody can see it anymore and people will forget about it. However, everything is still accessible with ninjastic.space.That topic was still accessible until 2-3 weeks ago. I tried to open it now again and it seems it was deleted. Perhaps Ratimov remembered that what was inside that topic was incriminating him and he begged some mod to delete the topic. By pure chance I had the topic opened in a tab so I could make some screenshots. DireWolf's and Pharmacist's posts are most relevant.This is how Ratimov's topic appeared after he deleted his topic text, like a coward (in the image you can see that the topic was in Archival board):Here are the relevant posts I mentioned above:^DireWolf spoke very well here, as indeed, Ratimov when he is unable to state something to defend himsef (I mean something true) he usually attacks the accuser. This will be proven a few more times within this topic and it's a disgusting manner and a futile attempt of trying to get the attention of the public off you and direct it to someone else. Ratimov always does these, as I will show below.^Probably, this statement of The Pharmacist -- a very important member of the forum -- was what determined Ratimov to try to hide his disgusting attacks toward airfinex, attacks which were only meant to distract public's attention from his plagiarism and redirect this attention toward airfinex.^Last 2 images are words of wisdom from LoyceV. First of all he also notices the way Ratimov leaves retaliatory feedbacks. Ratimov wrote on airfinex's Trust page the following: \"Stupid troll &shitposter. An errand dog [...]\".. Again, a feedback consisting in insults, with no reference link.. But after LoyceV's post he deleted it. Why? Because he is also intimidated by a very few users, such as The Pharmacist or LoyceV.Then LoyceV highlights another negative feedback left by Ratimov for revenge, this one being on wool_loow's profile. In fact, he left also a neutral feedback. What happened? Ratimov deleted these feedbacks as well.And now he also managed to get rid of this incriminating topic, which shows his very low character. So after The Pharmacist informed him that he will distrust Ratimov; after DireWolf dotted the I a few times; after LoyceV exposed him for his miserable character of attacking someone who said something about him, after all these he deleted all his posts from the thread and the thread content too and his the topic in Archival board. Surprise: 2-3 weeks later the topic fully vanished!Therefore, unless Xal0lex was his \"pal\" for deleting evidence from Archival board as well, it means that some other mod helped him.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Xal0lex",
      "created_time": "October 25, 2023, 02:22:54 PM",
      "body": "Quote from: BitcoinGirl.Club on October 25, 2023, 12:32:18 PMThe moderators should be ashamed of it.Why should moderators be ashamed of doing their job? What do you think a moderator should do if he sees such garbage topics in the root of the section under his control? https://bitcointalk.org/index.php?topic=5421033.0https://bitcointalk.org/index.php?topic=5391172.0https://bitcointalk.org/index.php?topic=5390565.0https://bitcointalk.org/index.php?topic=5388963.0etc.Do these trash topics have to stay in the section, or what? Go to the root of the Russian section and browse the pages, there are plenty of such topics. So what, let them lie around? What kind of moderator would allow such a mess? So naturally, the moderators delete them.Anticipating a question about the content that was there, so that's not interesting to me. I see what's in those threads now. We don't need such trash topics in the section.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitcoinGirl.Club",
      "created_time": "October 25, 2023, 02:35:29 PM",
      "body": "Quote from: Xal0lex on October 25, 2023, 02:22:54 PMQuote from: BitcoinGirl.Club on October 25, 2023, 12:32:18 PMThe moderators should be ashamed of it.Why should moderators be ashamed of doing their job? What do you think a moderator should do if he sees such garbage topics in the root of the section under his control? https://bitcointalk.org/index.php?topic=5421033.0https://bitcointalk.org/index.php?topic=5391172.0https://bitcointalk.org/index.php?topic=5390565.0https://bitcointalk.org/index.php?topic=5388963.0One topic shows an error to me \"appears to be either missing or off limits to you\". Other three: one with 2 merits, one with 24 merits, anther with 30 merits [I hope my count is correct]. Not saying it should be an obvious indicator but those topics must have good contents hence they were merited. Let's leave it to see it from that aspect.When you were or are removing topics of a user constantly, shouldn't an alarm bell in your head of checking what is going on with this specific user's topic. If it does then I think we expect moderators should do better job but just to remove the topics. Sometimes you need to move out from your comfort zone and act in proper manner, if you fail at-least seek help from others [here from the community] to see if anything unusual is going on. Clearly those topics emptied by Ratimov and popping them to your report board were unusual but you decided just to work like a scripted bot?I would like to think you were fooled on the other hand I don't know if you had any personal reason to favor a local member.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LoyceMobile",
      "created_time": "October 25, 2023, 02:36:26 PM",
      "body": "Quote from: Xal0lex on October 25, 2023, 02:22:54 PMWhat do you think a moderator should do if he sees such garbage topics in the root of the section under his control? Isn't that what bans are for? To stop people from posting garbage?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Xal0lex",
      "created_time": "October 25, 2023, 02:43:03 PM",
      "body": "Quote from: BitcoinGirl.Club on October 25, 2023, 01:52:03 PMxandry, Xal0lex, would you confirm how many topics you have deleted or do we have a way to check statistics of which moderator deleted which users topics, posts how many times?I haven't personally counted how many topics I've deleted. Maybe 10, maybe more. And plus at the moment there are a few more of Ratimov's garbage topics in the section, which will also be deleted in time. You can go to the section yourself and see how many of these topics there are at the moment. You can also go to modlog and do the math yourself.Quote from: LoyceMobile on October 25, 2023, 02:36:26 PMQuote from: Xal0lex on October 25, 2023, 02:22:54 PMWhat do you think a moderator should do if he sees such garbage topics in the root of the section under his control? Isn't that what bans are for? To stop people from posting garbage?I don't have the authority to ban users.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitcoinGirl.Club",
      "created_time": "October 25, 2023, 02:45:58 PM",
      "body": "Quote from: LoyceMobile on October 25, 2023, 02:36:26 PMQuote from: Xal0lex on October 25, 2023, 02:22:54 PMWhat do you think a moderator should do if he sees such garbage topics in the root of the section under his control? Isn't that what bans are for? To stop people from posting garbage?Yes, off-course!Now add this Quote from: Xal0lex on October 25, 2023, 02:22:54 PMSo what, let them lie around? What kind of moderator would allow such a mess? So naturally, the moderators delete them.Anticipating a question about the content that was there, so that's not interesting to me. I see what's in those threads now. We don't need such trash topics in the section.Also add this Quote from: Xal0lex on October 25, 2023, 02:43:03 PMI don't have the authority to ban users.And finally add these two tooQuote from: BitcoinGirl.Club on October 25, 2023, 02:35:29 PMI would like to think you were fooled on the other hand I don't know if you had any personal reason to favor a local member.The official moderation is not working.I wonder if Ratimov was the only one who nailed the pin in their coffin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Xal0lex",
      "created_time": "October 25, 2023, 02:48:38 PM",
      "body": "Quote from: BitcoinGirl.Club on October 25, 2023, 02:35:29 PMQuote from: Xal0lex on October 25, 2023, 02:22:54 PMQuote from: BitcoinGirl.Club on October 25, 2023, 12:32:18 PMThe moderators should be ashamed of it.Why should moderators be ashamed of doing their job? What do you think a moderator should do if he sees such garbage topics in the root of the section under his control? https://bitcointalk.org/index.php?topic=5421033.0https://bitcointalk.org/index.php?topic=5391172.0https://bitcointalk.org/index.php?topic=5390565.0https://bitcointalk.org/index.php?topic=5388963.0One topic shows an error to me \"appears to be either missing or off limits to you\". Other three: one with 2 merits, one with 24 merits, anther with 30 merits [I hope my count is correct]. Not saying it should be an obvious indicator but those topics must have good contents hence they were merited. Let's leave it to see it from that aspect.I haven't done anything with any of the above Ratimov's topics at this point. So another moderator is handling them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitcoinGirl.Club",
      "created_time": "October 25, 2023, 02:51:53 PM",
      "body": "Quote from: Xal0lex on October 25, 2023, 02:48:38 PMI haven't done anything with any of the above Ratimov's topics at this point. So another moderator is handling them.I see three of them are in archival board. Sorry don't get me wrong by thinking I am attacking [personally] you. I am frustrated to see the forum moderation became so poor over the years. If one user was [mis]using you all officials then I have no idea how many others are unnoticed so far.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}