{
  "id": "topic_5445618",
  "title": "bbc.reporter",
  "author": "bbc.reporter",
  "created_time": "March 20, 2023, 01:53:02 AM",
  "content": "This exchange was founded and created by Su Zhu, the owner of 3 Arrows Capital hehehe. The hedgefund that gambled with all their funds on GBTC and took too much leverage using their GBTC as collateral to different lenders.I am not quite certain where the scam here is, however, I speculate that Su Zhu might be looking for exit liquidity for their own claims hehehe.Do you have money stuck on a crypto platform?Immediately unlock the value of your claim by trading it into crypto or using it as collateral on OPNXSource https://opnx.com/",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5445618",
  "comments": [
    {
      "author": "Renampun",
      "created_time": "March 20, 2023, 09:26:41 AM",
      "body": "I'm still curious about the developers of this site, why did they put this non-clickable image LOL. they even provide a waitlist for those who are interested to be the first to access this exchange by requiring them to send an email, this is clearly a scam site.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tabas",
      "created_time": "March 20, 2023, 05:38:08 PM",
      "body": "Quote from: Renampun on March 20, 2023, 09:26:41 AMI'm still curious about the developers of this site, why did they put this non-clickable image LOL. Those were the companies that have issues in the past. And I think their service is about claiming any of the funds remaining there. I'm not sure about that though but I wouldn't call it an exchange if they're offering that type of service. Here are those companies that are on the top of that image and I just stopped there. The Collapse of FTX: What Went Wrong with the Crypto Exchange?TECH:Crypto lender Genesis files for bankruptcy in latest blow to Barry Silbert’s DCG empireCrypto lender Celsius misused customer funds for years, examiner findsCrypto lender BlockFi files for bankruptcy, cites FTX exposureSEC Questions Binance.US’s Deal for Assets of Bankrupt Crypto Lender VoyagerQuote from: https://opnx.com/OPNX solves this by providing a public marketplace for trading claims and crypto. It allows individuals and organizations to easily register their claims, sell them directly into crypto on orderbooks, or use their claim as portfolio margin. This enables claimants to efficiently unlock billions of dollars of trapped capital.I think I've seen a service like this in the US that they help people with their claims but is it really possible to happen with those companies that have already filed for bankruptcy? See, it's not really an exchange service. Therefore, I agree with the title, a comedic service.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitcoin_Arena",
      "created_time": "March 20, 2023, 10:25:14 PM",
      "body": "Quote from: tabas on March 20, 2023, 05:38:08 PMI think I've seen a service like this in the US that they help people with their claims but is it really possible to happen with those companies that have already filed for bankruptcy?You have seen a service like this that allows users to trade their claims?This is a first one for me, and I won't lie to you. I don't trust it any single bit",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bbc.reporter",
      "created_time": "March 21, 2023, 12:27:57 AM",
      "body": "Quote from: Bitcoin_Arena on March 20, 2023, 10:25:14 PMQuote from: tabas on March 20, 2023, 05:38:08 PMI think I've seen a service like this in the US that they help people with their claims but is it really possible to happen with those companies that have already filed for bankruptcy?You have seen a service like this that allows users to trade their claims?This is a first one for me, and I won't lie to you. I don't trust it any single bitWe should not trust it because this service was created and being run by one of the biggest crypto leverage gamblers of the cryptospace. He is also known for using his other crypto hedgefund friends and followers as exit liquidity. He had influence over the Defi trading community before. If he shares something bullish on a coin or token, the price will pump and what he is really doing is dumping on them hehehehe.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tabas",
      "created_time": "March 21, 2023, 11:48:22 PM",
      "body": "Quote from: Bitcoin_Arena on March 20, 2023, 10:25:14 PMQuote from: tabas on March 20, 2023, 05:38:08 PMI think I've seen a service like this in the US that they help people with their claims but is it really possible to happen with those companies that have already filed for bankruptcy?You have seen a service like this that allows users to trade their claims?This is a first one for me, and I won't lie to you. I don't trust it any single bitI think I have but it's not in crypto. I'm not sure if it was the one that mrbeast have advertised and can't remember the whole thing. It's like a service to claims, money and stuff but yeah, this one is shady. Zhu got already crumpled his reputation and anything that's related to him and with such services should be avoided, I'll not trust him either and won't avail any service from him although I don't really need it.Quote from: bbc.reporter on March 21, 2023, 12:27:57 AMWe should not trust it because this service was created and being run by one of the biggest crypto leverage gamblers of the cryptospace. He is also known for using his other crypto hedgefund friends and followers as exit liquidity. He had influence over the Defi trading community before. If he shares something bullish on a coin or token, the price will pump and what he is really doing is dumping on them hehehehe.And even if we try hard to remind everybody not to trust him, he can still manipulate some people into believing him that he's gonna give them the maximum benefit and that's one of the saddest truth on the other communities that he's in.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Darker45",
      "created_time": "March 22, 2023, 02:35:49 AM",
      "body": "Of course, other than clueless victims of bankrupt crypto companies, nobody would trust this platform. First and foremost, this platform is owned by a con man who should be in jail right now. Second, something is too good with the offer, which is a solid red flag. Or they're not transparent with everything, meaning the terms and conditions might have shady clauses. The words used are \"immediately\" and \"the value of your claim\". So I wonder, what if I have a million stuck with Blockfi? Can I trade that same million in OPNX? Or can I borrow close to a million worth of Bitcoin from OPNX?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "The Sceptical Chymist",
      "created_time": "March 22, 2023, 03:11:19 AM",
      "body": "Quote from: Bitcoin_Arena on March 20, 2023, 10:25:14 PMYou have seen a service like this that allows users to trade their claims?This is a first one for me, and I won't lie to you. I don't trust it any single bitI've definitely seen things like this, though not in the crypto industry.  All sorts of debt is, can be, and has been monetized and there's always been a thriving market for it.  I have no idea who'd want to take the risk of being the counterparty side of the trade who winds up with the debt, but there always seems to be such a counterparty.  I suspect this guy really thinks money \"stuck on exchanges\" can be recovered, when most likely nothing is ever going to be.  It's either that or this is just a straight-up scam, but whatever the case might be, I bet you a lot of people who've gotten screwed by various exchanges would be willing to try OPNX.  I probably won't follow its progress, but I do wonder if a thing like this has a chance to succeed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bbc.reporter",
      "created_time": "January 29, 2024, 05:15:38 AM",
      "body": "I need to share this hehehehe. The article certainly made me laugh and shake my head. Su Zhu should advice Do Kwon to be sentenced under the jurisdiction of Singapore to also have an enjoyable experience.Zhu says he slept well in Singapore lock-upSu Zhu, co-founder of collapsed cryptocurrency hedge fund Three Arrows Capital, said that the time he did in a Singapore prison was “enjoyable.”Zhu, who served three months behind bars after failing to cooperate with Singaporean authorities, has begun promoting a new exchange, OPNX, which has an office registered in Hong Kong, the South China Morning Post reported.“Obviously no one wants to go to prison,” Zhu said in a video clip shared widely on X. “But I think that it’s actually a really enjoyable experience overall.” He said the video will be part of a future podcast.Source https://www.dlnews.com/articles/snapshot/three-arrows-capital-cofounder-says-prison-was-enjoyable/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}