{
  "id": "topic_5460433",
  "title": "teoliya33",
  "author": "teoliya33",
  "created_time": "July 20, 2023, 10:47:54 AM",
  "content": "Hi dear communityalright after i post about the USB mining many people advice me to buy ASICWhere are you buying it?is there a tutorial for it?To cover electricity and see some good earnings how many i need as a start?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5460433",
  "comments": [
    {
      "author": "Oshosondy",
      "created_time": "July 20, 2023, 11:22:06 AM",
      "body": "This belongs to mining board, move it to mining board. https://bitcointalk.org/index.php?board=14.0You should be able to buy ASIC machines directly from the company that is manufacturing the  ASIC machines. The best among them that I know is Bitmain Antminer. You can buy Bitmain Antminer directly on their official website: https://www.bitmain.com/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Z390",
      "created_time": "July 20, 2023, 11:40:07 AM",
      "body": "Before I lay my hands on any asic miner I spend time watching YouTube videos for tutorials, I will suggest you do the same because you are also a newbie like I was, it's very complicated to set up an asic miner and start mining. You also need to know how much your electricity costs per month, if it's already high you should stay away from mining and start buying Bitcoin instead. The best place to buy Asic miners is their official platforms like Bitmain https://www.bitmain.com/This is more safer than any other places, like Alibaba and other third-party websites.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "paid2",
      "created_time": "July 22, 2023, 07:43:45 PM",
      "body": "Quote from: teoliya33 on July 20, 2023, 10:47:54 AMalright after i post about the USB mining many people advice me to buy ASICUSB miners like Gekkoscience Newpac or Compac F for example, are ASICs, they have a Bitmain chip.Quote from: teoliya33 on July 20, 2023, 10:47:54 AMWhere are you buying it?It depends on several things. Where are you located? For example, if you're in the USA, you might want to order from an American reseller, to avoid excessive import taxes and shipping costs.Generally speaking, ordering directly from the manufacturer is a good idea, but it doesn't guarantee easy delivery. Bitmain, for example, is notorious for sometimes making its customers wait months before shipping their orders. You can browse the forum, it's full of good addresses and topics on this subject. You can also order ASICs from reputable forum members, mikeywith has a long-standing excellent reputation, for example. Quote from: teoliya33 on July 20, 2023, 10:47:54 AMTo cover electricity and see some good earnings how many i need as a start?It depends on the price of your kw/h. And it also depends on the purchase price of your ASICs. With this data, you can calculate your ROI time and have a more or less accurate forecast (the difficulty changes every two weeks or so, so forecasts are never 100% guaranteed).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dansus021",
      "created_time": "July 25, 2023, 02:01:28 AM",
      "body": "You can actually buy to manufacturer's website like example bitmain Avalon or micro bt but beware you need double check it first before buy there is a bunch of scammers out there and some of it create an identical website and made the domain almost same and they created google ads so can put in top of search engine wait wait dont do double check do triple checkhere the example of the site https://shop.bitmain.com/https://shop.canaan.io/and last thing before buy you need consider about profitability the cost of hardware electricity and etc",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joniboini",
      "created_time": "July 27, 2023, 04:46:54 AM",
      "body": "Quote from: teoliya33 on July 20, 2023, 10:47:54 AMTo cover electricity and see some good earnings how many i need as a start?There are tools to calculate stuff like this such as whattomine, assuming you know how to find out the necessary calculation variables such as hash rate, and so on as mentioned above. Treat it as a prediction since the variables will likely change when you start your mining activity. It is really hard to answer since you don't provide anything concrete to calculate. You'll likely get better suggestions if you can provide more data imo.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FP91G",
      "created_time": "July 28, 2023, 06:48:30 PM",
      "body": "New modern asics are not yet mining at a loss even at 10 cents per kilowatt, but this greatly increases the payback period of asics or makes it impossible without an increase in the price of bitcoin.It is necessary to calculate well how much money you need to pay for electricity if the miner is not going to sell the received bitcoins now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FP91G",
      "created_time": "July 30, 2023, 09:17:26 PM",
      "body": "Quote from: ICYNOTE2023 on July 30, 2023, 11:27:24 AMQuote from: teoliya33 on July 20, 2023, 10:47:54 AMHi dear communityalright after i post about the USB mining many people advice me to buy ASICWhere are you buying it?is there a tutorial for it?To cover electricity and see some good earnings how many i need as a start?Bitcoin mining is highly competitive, and the mining landscape changes rapidly. The profitability of mining can fluctuate significantly based on the factors mentioned above. It's crucial to do thorough research, consider all costs, and understand the risks before investing in mining hardware.To calculate the number of ASIC miners you need, you can use a mining profitability calculator. These calculators take into account the factors mentioned above and provide estimates of potential earnings and return on investment (ROI). Some popular mining profitability calculators include:CryptoCompare Mining Calculator: https://www.cryptocompare.com/mining/calculator/WhatToMine: https://whattomine.com/For mining on ASICs, a beginner will first need to consult a good electrician in order to calculate the free power of electricity for mining and not burn down his house or other premises. Large power consumption already requires different control and knowledge than a few GPU farms on a balcony.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "KiaKia",
      "created_time": "August 22, 2023, 06:28:51 PM",
      "body": "Quote from: teoliya33 on July 20, 2023, 10:47:54 AMHi dear communityalright after i post about the USB mining many people advice me to buy ASICWhere are you buying it?is there a tutorial for it?To cover electricity and see some good earnings how many i need as a start?I will advice you do some research on your electricity first, are you the one paying for electricity in your house? How much are you paying per KW?I think it's better to start with one miner first, you will be able to learn how to configure the miner to a mining pool like Nicehash or others, for a newbie it will first look impossible, I will share you a YouTube video where you can watch and learn, and you can also watch many others on YouTube, just type what type of video you want and you will get tutorial videos.https://youtu.be/RNCXULhef74Since others have tell you about bitmain's official website I think that's the best place to buy your Asic miner, they have a warranty too.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FP91G",
      "created_time": "August 24, 2023, 07:13:44 PM",
      "body": "Quote from: KiaKia on August 22, 2023, 06:28:51 PMQuote from: teoliya33 on July 20, 2023, 10:47:54 AMHi dear communityalright after i post about the USB mining many people advice me to buy ASICWhere are you buying it?is there a tutorial for it?To cover electricity and see some good earnings how many i need as a start?I will advice you do some research on your electricity first, are you the one paying for electricity in your house? How much are you paying per KW?I think it's better to start with one miner first, you will be able to learn how to configure the miner to a mining pool like Nicehash or others, for a newbie it will first look impossible, I will share you a YouTube video where you can watch and learn, and you can also watch many others on YouTube, just type what type of video you want and you will get tutorial videos.https://youtu.be/RNCXULhef74Since others have tell you about bitmain's official website I think that's the best place to buy your Asic miner, they have a warranty too. If he uses a USB miner, he will not notice an increase in electricity costs. With such an ASIC, the probability of catching a block is only possible in theory, but this is a solution for quiet residential mining. And for big chances, you need to watch asics for solo mining.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}