{
  "id": "topic_5418564",
  "title": "Fivestar4everMVP",
  "author": "Fivestar4everMVP",
  "created_time": "October 27, 2022, 10:40:22 PM",
  "content": "Like its normally said in my place that - we use money to look for money - it simply means that it is with money that we get get to make more money. I am just starting out to become serious on gambling, so today, while watching the high rollers section in a casino, and also the all bets section, a thought came into my head, i began to wonder what makes this two different.--one is a high roller, which simply means he bets with a very high amount of money at a go,--the other is a pleb, which means he bets in way smaller amount of money.So i wondered between this two, which of them have a higher chance at winning a significant amount of money ?this thought pushed me to do a small experiment during the day,i deposited $5 on one casino and deposited $100 on another I decided to play dice on both casinos, for the $5, i set my bet amount at $0.5 for each roll, and for the $100, i set bet amount at  $10 for each roll multiplier was set at 2x for both, and win chance on both account was around 50 percent. And i then rolled the dice 10 times on each account respectively...The end result is...--On the account i deposited $5, it went as high as $7.8 but later settled at $0.154 as my current account balance--And on the account i Deposited $100, it went as high as $396.95 but later settled at $194.83 as my current account balanceWhat does this tell you? Does this mean that the higher the amount we wager at a go, the higher the chance of ending up profit at the end of the day?Or do you think it is all based on luck?, that is to say that the account with $5 on it wasnt just lucky today and thereby was unable to make any profit no matter how small?What do you think about this ?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5418564",
  "comments": [
    {
      "author": "n0ne",
      "created_time": "October 27, 2022, 10:52:45 PM",
      "body": "There is no difference between the high roller and the low amount usage on gambling. Particularly with Dice, you'll end up losing or winning based on your luck. It is a game of probability, and the one holding the luck will succeed. At times it looks like the high roller wins, but the very next time you might experience the growth from low amounts. Every bet can be verified, and that is how you can confirm there is nothing as high roller wins and low amounts don't.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yogee",
      "created_time": "October 27, 2022, 10:56:00 PM",
      "body": "I'd say it's just coincidence unless there's a proof that casinos would increase the players' RTP when they bet higher. I don't think that's the case.Why don't you try it a few more times so you can have a better data set? Play with the $100 on $10 bet per roll first then the $5 deposit on $0.5 per roll. Let's see the result.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ralle14",
      "created_time": "October 27, 2022, 10:57:52 PM",
      "body": "That's mainly on luck for sure since the bet amounts are proportionally identical where both accounts can only sustain 10 losses in a row. Eventually, the second account should expect more losses in the next session as that's how it usually goes while the first account might have more wins as a way to even out their record. The casinos would probably lose more if betting higher provides a small edge for gamblers.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ChiBitCTy",
      "created_time": "October 27, 2022, 11:19:08 PM",
      "body": "I think it depends on what you consider a high roller.  There is also a negative to being good (ie winning more), if you're too good, at least here in the United States, casinos will ban you for life from ever returning to play, because you simply are too good at beating the house.  UFC president Dana White is a prime example of this, he's been banned from like 4 Vegas Casino, top notch ones, because he wins too much.  Kinda crazy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "carlfebz2",
      "created_time": "October 27, 2022, 11:24:55 PM",
      "body": "Quote from: Fivestar4everMVP on October 27, 2022, 10:40:22 PMWhat does this tell you? Does this mean that the higher the amount we wager at a go, the higher the chance of ending up profit at the end of the day?Or do you think it is all based on luck?, that is to say that the account with $5 on it wasnt just lucky today and thereby was unable to make any profit no matter how small?What do you think about this ?There's no difference and since we do talk about luck based type of game then we could eventually say that $100 buck capital account is just really that lucky on that time.Overall its not really that precise to say that the bigger capital you do have the higher chance of winning.Its a wrong mindset or belief to put it up into your mind and keep pushing yourself that you would really be needing to have bigger bankroll for you to win.You would really be proving out and realize into yourself thats not how gambling works.Luck would be always the major deciding factor which would always affect out the outcome.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dothebeats",
      "created_time": "October 27, 2022, 11:33:25 PM",
      "body": "It will depend on your betting habits and patterns. No matter how small or big your bankroll is, if you always go on all out, you will always lose your money. But if you play conservatively, you'll see that you'll last longer. If we are talking about the frequency of winning between the two, I'd say both will always have the similar chances if they both have the same betting patterns and proportional bet sizes. But in the amount of winnings, it's obvious that the one with the larger bankroll will always win the most.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "chaser15",
      "created_time": "October 27, 2022, 11:38:45 PM",
      "body": "Quote from: Fivestar4everMVP on October 27, 2022, 10:40:22 PMThe end result is...--On the account i deposited $5, it went as high as $7.8 but later settled at $0.154 as my current account balance--And on the account i Deposited $100, it went as high as $396.95 but later settled at $194.83 as my current account balanceWhat does this tell you? Does this mean that the higher the amount we wager at a go, the higher the chance of ending up profit at the end of the day?Or do you think it is all based on luck?, that is to say that the account with $5 on it wasnt just lucky today and thereby was unable to make any profit no matter how small?What do you think about this ?The winning probability is just the same. It doesn't have to do with your capital. Actually, we don't need to put technical aspects on that observation of yours as obviously, you are playing in a game of chance where every bet/spin depends on a random hash algorithm.Of course, the higher the stake, the higher the possible win. But regardless, you are facing the same RTP or house edge depending on what gambling type you played with.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lanatsa",
      "created_time": "October 27, 2022, 11:53:51 PM",
      "body": "Are these bets start and stopped at the same time?It would be better if this experiment should have done on the same site, im aint saying that odds differ in between sites or platform but it would be that good to look at if they are been executed on the same site(if multiple accounts been allowed).Just like the rest been saying that it doesnt really matter on where you do play which odds or chances of getting bust up and profitability will really be the same but of course if you are that lucky enough.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Baofeng",
      "created_time": "October 27, 2022, 11:59:08 PM",
      "body": "Good experiment, but I will say that the sample data is low to really say that the higher the bet and capital the better your chances of winning in a game like dice because it is base on luck.So with that, I will say both have equal chances to win big or go busted in matter of minutes. And it also depends on how long you are going to play as well. Probably that is why we have the house edge for other games or why there is a maximum bet because anyone who has a big capital can exploit casinos.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wexnident",
      "created_time": "October 28, 2022, 01:09:00 AM",
      "body": "Logically speaking wouldn't they have an equal amount? Pretty sure your case couldn't be considered due to the small sample size you have. I don't even think the amount matters much, they'd generally have the same amount of % profit assuming if they had the same results in say 10 bets or so. Though in the end, high rollers would have better profit if you consider it that way since they started the bet with a higher roll instead of the lower one. It all depends on luck in the end.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "alegotardo",
      "created_time": "October 28, 2022, 01:21:31 AM",
      "body": "Quote from: Fivestar4everMVP on October 27, 2022, 10:40:22 PM~snip~What does this tell you? Does this mean that the higher the amount we wager at a go, the higher the chance of ending up profit at the end of the day?Or do you think it is all based on luck?, that is to say that the account with $5 on it wasnt just lucky today and thereby was unable to make any profit no matter how small?What do you think about this ?I believe that those who have money will always have more chances to make more money. And this rule also applies to games of chance... since the multiplier factor is always the same, your chances of winning more money are higher.To get good results, always bet as high as you can, but never exceed the amount you are willing to lose.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "romero121",
      "created_time": "October 28, 2022, 01:51:15 AM",
      "body": "When we play with low amounts it looks like high roller have got advantage and winning big. When we spend big on every roll, it looks like the low bets have got lucky wins. In one of the thread an user have shared his bet of $200 winning him $9600. This had happened as a result of misplaced bet, but the outcome is his luck. Even if he had placed $2 this could've brought him $96. When it comes to gambling it is always the luck factor unlike the bet value.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dave1",
      "created_time": "October 28, 2022, 01:56:42 AM",
      "body": "Yes, high rollers might end up with good amount of win because of their bankroll. But I have seen people in a physical casino winner big, as huge as those who do max bet on slots with just little money.So in the end, it's based on our luck. Maybe you can extend it if you have a deep bankroll but it's not the most important factor specially playing luck based games like dice or slot machines.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Plaguedeath",
      "created_time": "October 28, 2022, 05:11:36 AM",
      "body": "What you need to know gambling isn't for money, but it's for fun. If you can earn money through gambling, it's just lucky reward for you. House edge either for high rollers and the plebs are same, the different is the promotion and the contest they have. Usually the casino promotion and contest are only for high rollers, even though high rollers has a bad experience, but they can win via promotion and contest to recover their losses.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "swogerino",
      "created_time": "October 28, 2022, 06:05:23 AM",
      "body": "Quote from: Fivestar4everMVP on October 27, 2022, 10:40:22 PMLike its normally said in my place that - we use money to look for money - it simply means that it is with money that we get get to make more money. I am just starting out to become serious on gambling, so today, while watching the high rollers section in a casino, and also the all bets section, a thought came into my head, i began to wonder what makes this two different.--one is a high roller, which simply means he bets with a very high amount of money at a go,--the other is a pleb, which means he bets in way smaller amount of money.So i wondered between this two, which of them have a higher chance at winning a significant amount of money ?this thought pushed me to do a small experiment during the day,i deposited $5 on one casino and deposited $100 on another I decided to play dice on both casinos, for the $5, i set my bet amount at $0.5 for each roll, and for the $100, i set bet amount at  $10 for each roll multiplier was set at 2x for both, and win chance on both account was around 50 percent. And i then rolled the dice 10 times on each account respectively...The end result is...--On the account i deposited $5, it went as high as $7.8 but later settled at $0.154 as my current account balance--And on the account i Deposited $100, it went as high as $396.95 but later settled at $194.83 as my current account balanceWhat does this tell you? Does this mean that the higher the amount we wager at a go, the higher the chance of ending up profit at the end of the day?Or do you think it is all based on luck?, that is to say that the account with $5 on it wasnt just lucky today and thereby was unable to make any profit no matter how small?What do you think about this ?Of course the high roller is advantaged.Just check for example the name of the slot in google followed by the words \"big win\" and you will see that all the big winners are playing with higher bets.The pleb or the small bettor even if he wins he will not go much higher because those are the payouts of the slot machines or other casino games that we play.It is also a double edge sword because the high roller tend to go bust really fast if he is not lucky while the pleb even if he is not lucky he can play much longer thus having better probability to at least minimize the loss.Of course when luck is by your side the high roller is greatly favored compared to the pleb.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Finestream",
      "created_time": "October 28, 2022, 06:16:46 AM",
      "body": "Quote from: n0ne on October 27, 2022, 10:52:45 PMThere is no difference between the high roller and the low amount usage on gambling. Particularly with Dice, you'll end up losing or winning based on your luck. It is a game of probability, and the one holding the luck will succeed. At times it looks like the high roller wins, but the very next time you might experience the growth from low amounts. Every bet can be verified, and that is how you can confirm there is nothing as high roller wins and low amounts don't. In a game where it is based with pure luck and chance, regardless if you are a high roller or a minimum wager, you get to win and lose eventually. Although in some instances, high rollers mostly gain huge amount, but they can also lose huge amount in an instant. Same with small wagers too, they can win small amount for a short period of time, they can also lose them instantly. So I agree on this, high rollers and small wagers have no difference at all.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "danherbias07",
      "created_time": "October 28, 2022, 06:45:26 AM",
      "body": "Quote from: Fivestar4everMVP on October 27, 2022, 10:40:22 PMWhat does this tell you? Does this mean that the higher the amount we wager at a go, the higher the chance of ending up profit at the end of the day?Or do you think it is all based on luck?, that is to say that the account with $5 on it wasnt just lucky today and thereby was unable to make any profit no matter how small?What do you think about this ?I don't believe one casino is making your chances to win higher just because you are betting less. It's just the same because it's the system that will give the numbers out. The same goes for high rollers, it's a provably fair system so I doubt they have a lesser chance to win. They just feel the loss more because they input a higher amount in their bet.When you start gambling on sports it becomes way different because you are also relying on your deep analysis of the game. I think this is why I don't do dice and slots anymore as I don't want a computer deciding my chances.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TheUltraElite",
      "created_time": "October 28, 2022, 07:56:05 AM",
      "body": "The one who wins the most is neither the high roller nor the pleb - it is the casino.It is a EV- game, you cannot win by putting in more money but only if you get that chance or luck which may be temporary and hence cannot be predicted and therefore it is a game of chance. By doing more bets you are only making your money more loss-worthy to the casino.On the other hand if you win a big amount and immediately cash out, technically you have beaten the casino but only if you never ever spend on a casino in future. In most cases this is false because a winning bets fuels in more confidence to bet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yaunfitda",
      "created_time": "October 28, 2022, 08:15:41 AM",
      "body": "Quote from: Fivestar4everMVP on October 27, 2022, 10:40:22 PMWhat does this tell you? Does this mean that the higher the amount we wager at a go, the higher the chance of ending up profit at the end of the day?This could be true, until probability catches up with you. As you can see in your experiment, you did have some good run, but eventually it settles down, like the first one wherein you only have $5 capital.Quote from: Fivestar4everMVP on October 27, 2022, 10:40:22 PMOr do you think it is all based on luck?, that is to say that the account with $5 on it wasnt just lucky today and thereby was unable to make any profit no matter how small?What do you think about this ?Mostly based on luck mate, and that is the most important factor that we can't really control in this kind of experiment. What if in the $5 you will have successive wins, and on the contrary the $100 roll turns out to be series of losses?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}