{
  "id": "topic_5445044",
  "title": "MeCsc",
  "author": "MeCsc",
  "created_time": "March 15, 2023, 05:57:50 PMLast edit: March 15, 2023, 07:30:34 PM by MeCsc",
  "content": "Since joining this forum I have seen reasons why I should cautious about doing Kyc and Centralise Exchanges do ask for it but for a Trader is using Centralized exchanges the best ? If Yes, what is the most secure centralise exchange to use? because I read that aside from a person identity be stolen, they may lost their funds or not been able to access it and this happened to FTX customers",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5445044",
  "comments": [
    {
      "author": "bullrun2024bro",
      "created_time": "March 15, 2023, 06:34:32 PM",
      "body": "Quote from: MeCsc on March 15, 2023, 05:57:50 PM~Is KYC worth the risk? Pretty good question. If you're interested in the topic, check out one of these threads. It has been discussed plenty of times already.1. Why KYC is extremely dangerous – and uselessor here2. Is kyc verification dangerous?In addition to that just use the Bitcointalk forum search function and you will find plenty of other threads that feature KYC and its pros & cons.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "March 15, 2023, 06:37:36 PM",
      "body": "It's going to depend on how badly you need the specific platform. If you absolutely need to — maybe you have literally zero way of buying/selling crypto in your country besides using a KYC exchange, then maybe you might not have a choice.On the other hand — if there are alternatives and you're willing to go through the extra effort(and potentially risk?) of using the alternative platform, then go ahead.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "drwhobox",
      "created_time": "March 15, 2023, 11:24:51 PM",
      "body": "You should read the terms and conditions before signing up on any platform. If you have concern about your privacy you should avoid those who need KYC to use their platform or to cash out your money from them. Though I am now very much into not sharing my details with anyone but I have to use an exchange so I have to get it verified. But other than that I don't use my information anywhere else. So for you it depends on how badly you need to use that service.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitMaxz",
      "created_time": "March 15, 2023, 11:44:53 PM",
      "body": "Right now pretty hard to find exchanges that do not ask for KYC because some exchanges right now that do not have KYC are seized by authorities.So we do not have any other choice but to use the centralized exchange. And I think it's not extremely dangerous to use centralized exchange just make sure that choose an exchange that is trusted and proven that they can protect customer's funds like Binance.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Coyster",
      "created_time": "March 15, 2023, 11:50:34 PM",
      "body": "Quote from: MeCsc on March 15, 2023, 05:57:50 PMIf Yes, what is the most secure centralise exchange to use? because I read that aside from a person identity be stolen, they may lost their funds or not been able to access it and this happened to FTX customers Well, everything you read about centralized exchanges are absolutely correct, your identity can be stolen and your funds seized on any of them, thus there is no need seeking one you think is most secure if that is what you want to escape from, as they are all guilty in that regard. There are decentralized alternatives to them, but if you are a day trader and you feel centralized exchanges are your only option, thus you should DYOR and choose the 'biggest' exchange instead of new ones that would steal any deposit you send to them. But even as a day trader, be cautious of the amount of money you leave in the exchange, move the large sums to your non custodial wallets.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dr.Bitcoin_Strange",
      "created_time": "March 15, 2023, 11:55:41 PM",
      "body": "Quote from: MeCsc on March 15, 2023, 05:57:50 PMIf Yes, what is the most secure centralise exchange to use? because I read that aside from a person identity be stolen, they may lost their funds or not been able to access it and this happened to FTX customers Binance exchange is one of the biggest exchanges that a lot of people interact with, but you really need to pass KYC before withdrawal. If you are looking for an exchange that doesn't require KYC to trade and withdraw, I think MEXC, Coinstore, Probit, and Digifinex exchange are KYC free at a certain withdrawal limit. I have used them before, but the only term is that if you did not pass KYC, you will have a daily withdrawal limit unless you have passed their KYC. Note that it has been a while since I used those exchanges, so kindly check to be sure that their terms have not been updated. So long as you are not keeping your asset on the DEX, you are safe, because your asset on a CEX is not 100% in your control. Not your key, not your token.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Peanutswar",
      "created_time": "March 15, 2023, 11:59:06 PM",
      "body": "It depends if you are a kind of person does not want to make them on the information broadcasted online to prevent leaking of information for the possible risk of an account or other asset. For me KYC verification at least level one is ideal to make a basic recovery of the assets but the use of the picture and ID needed for the possible of identity theft.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rat03gopoh",
      "created_time": "March 16, 2023, 03:26:10 AM",
      "body": "What is your concentration in the crypto space and how is the business scale?If you've always dealt with centralized services I think you'll be familiar with KYC and for some people it's part of the normal administrative process to legal complement and protection. For example, if you're an active trader, centralized lending business, staking, etc. with a value of more than $ 100k in each transaction.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Luffygroove",
      "created_time": "March 16, 2023, 03:39:07 AM",
      "body": "Because of their liquidity, user-friendly interfaces, and ability to offer a diverse selection of trading pairs, centralized exchanges can be beneficial to traders. They do, however, demand customers to go through KYC (know-your-customer) processes, which include providing personal information such as identity papers. The possible hazards connected with centralized exchanges include the likelihood of hacking, security breaches, or the exchange's insolvency, which might result in the loss of cash.IMHO KYC is really critical, I can't just do KYC for any centralized exchanges, that's why I need to be careful in choosing the one that has a strong reputation for security, transparency, and reliability.Since security measures may continually be enhanced or exploited, there is no one \"best secure\" centralized exchange but like I said, some of exchanges, incorporate extensive security measures such as multi-factor authentication, cold storage, and insurance coverage. Examples of reputable centralized exchanges include Binance, Coinbase, and Kraken. So, after choosing meticulously, if something bad happened I won't be too regret.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "I_Anime",
      "created_time": "March 16, 2023, 02:15:43 PM",
      "body": "You can use Bisq exchange, It's a decentralise exchange that allows you trade bitcoin and other cryptocurrency but you can only Trade on your computer and not on your mobile and also you can't place an order, every trade must be done online although it has a mobile app to keep track of the market. Here is some post about guides for using Bisq exchange Guides for using Bisq[GUIDE] How to buy and sell Bitcoin using Bisq [ANN] Bisq - Exchange, Decentralized.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "March 16, 2023, 03:35:22 PM",
      "body": "Quote from: I_Anime on March 16, 2023, 02:15:43 PMYou can use Bisq exchange, It's a decentralise exchange that allows you trade bitcoin and other cryptocurrency...~snip~This is certainly one of the options to avoid verification through personal documents, but you should know that whoever you trade with will still be able to see your information when it comes to the bank account to which you will receive payment when you sell Bitcoin. Of course, it is not nearly as risky as sending personal documents to a CEX, which is always at risk of being hacked, but sometimes not only in the sense that crypto-currencies are stolen, but personal data is also stolen.Those who have become victims of identity theft often go through agony trying to prove that someone stole their data, but I believe that many are not even aware that someone is using their data in an inappropriate way.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kalchef",
      "created_time": "March 16, 2023, 04:03:44 PM",
      "body": "Don't call me a fool but I am wondering what could possibly go wrong after passing a KYC verification on a reliable exchange like Binance, the reason why I have confidence trading Bitcoin on Binance is because of the KYC, once they pair with someone through P2P I know that I can't get scammed because to use Binance exchange P2P you need to pass KYC first.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "armanda90",
      "created_time": "March 16, 2023, 04:10:48 PM",
      "body": "Since active trading in cryptocurrencies I don't remember with how many exchange have been success pass with KYC and several airdrop project submit document ID. I don't worry when looking how compete with exchange market for submitting document ID and ever got scam on one exchange market until right now but not problem with document have been uploaded with exchange closed right now.Required for submitting KYC if want trading and joining several airdrop project, if OP still not agree for submitting and his document ID become public better trade with dapp exchange market and need to pay fees on every transaction between sell or buy. I don't complaint with all exchange active for trading right now required with KYC and have several exchange need to upgrade until post proof document for getting higher amount limit withdrawing in daily day.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Eureka_07",
      "created_time": "March 16, 2023, 04:12:35 PM",
      "body": "Quote from: Kalchef on March 16, 2023, 04:03:44 PM<snip>You gave your information and proof of your identity... If it is mishandled or used to any evil purposes, you might initially get in trouble since they are using your name. Think of it... What if they got hacked? What if they sell your identity to others? Do you still think that you have nothing to worry about? Well sometimes, KYC is necessary. Because of that, do some extended precaution of processing one.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "suzanne5223",
      "created_time": "March 16, 2023, 04:20:34 PM",
      "body": "Quote from: MeCsc on March 15, 2023, 05:57:50 PMSince joining this forum I have seen reasons why I should cautious about doing Kyc and Centralise Exchanges do ask for it but for a Trader is using Centralized exchanges the best ? Centralized exchange is the best for cryptocurrency traders specifically the day trader because they offer a higher level of comfort in trading execution and liquidity but it's never advisable to keep your funds on CEX for the long term.Quote from: MeCsc on March 15, 2023, 05:57:50 PMIf Yes, what is the most secure centralise exchange to use? because I read that aside from a person identity be stolen, they may lost their funds or not been able to access it and this happened to FTX customers You'll have to do your own research about the CEX that will be best for you but over years Binance was able to make a good reputation in the CEX setting by providing SAFU, etc. Meanwhile, they also have their own flaws and seem to be restricted in some geographical areas which is the reason why I advise you to do your own research.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cabron",
      "created_time": "March 16, 2023, 04:37:23 PM",
      "body": "When you are a trader you will need an exchange that has tons of volume which you can't see on DEX. Which is it that you prioritize the most, earning from trading or privacy? Probably a dilemma that a trader has to face unless he is prepared to just do on dex and now cashing out.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Asuspawer09",
      "created_time": "March 16, 2023, 05:10:47 PM",
      "body": "Quote from: MeCsc on March 15, 2023, 05:57:50 PMSince joining this forum I have seen reasons why I should cautious about doing Kyc and Centralise Exchanges do ask for it but for a Trader is using Centralized exchanges the best ? If Yes, what is the most secure centralise exchange to use? because I read that aside from a person identity be stolen, they may lost their funds or not been able to access it and this happened to FTX customers For the most part, it's a very dangerous thing to do, since they could easily do anything to your identity. But I guess it wasn't that bad if you're going to do it on some trusted website I mean I do it most of the part If I really need the platform and when I think it's worth it. But I wouldn't do it if there are red flags and it's obviously a shady website. I mean it is an exchange I would probably just do Binance for KYC and just do everything on it, then just trade on other platforms without doing KYC they didn't really need KYC for the most part I think. Binance was a pretty trusted exchange in my experience. What happened to FTX could easily happen to all the exchanges even to Binance but it was a pretty big legitimate exchange so probably small exchanges will crumble first before Binance.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "un_rank",
      "created_time": "March 16, 2023, 05:20:11 PM",
      "body": "To answer the question, we would need to discuss the potential risks of submitting your KYC to different platforms and the benefits one can gain from doing that.The Risks are quite long and revolves around mismanagement of your identity documents which can be used maliciously against you. There is also the risk of someone else posing as you to commit crimes or the government linking your assets to your personality, whic you might not want if you desire to remain private.The only benefit it gives is access to trade on a centralized exchange.Not worth the risk for me.- Jay -",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Awaklara",
      "created_time": "March 16, 2023, 05:24:43 PM",
      "body": "if you don't like KYC, you can use DEX exchange. that is if you have any concerns regarding KYC with CEX exchanges.no CEX exchange is completely safe for you. if you want to trade, you can try to choose an exchange with a high trading volume. I use Binance.but my advice, after you finish trading, you can withdraw your money to your wallet. never leave your assets on the exchange.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}