{
  "id": "topic_5416546",
  "title": "tabas",
  "author": "tabas",
  "created_time": "October 10, 2022, 12:46:45 AMLast edit: July 04, 2023, 11:24:58 AM by tabas",
  "content": "Youtube channel: https://www.youtube.com/c/alispagnolaThis video was uploaded in early 2021. It was an exciting story and I want to share it here.I was just browsing for some videos and have seen this painter received $50 worth of bitcoin in 2013 (1 bitcoin). This video is all about a painter that has been doing free paintings for her audience. And someone has emailed her to make a bitcoin painting and the requestor has convinced her to receive his donation in the form of bitcoin. While this woman has no idea of what bitcoin is and is convinced, she just held it until last year and since we knew what was up with last year, she has checked that bitcoin wallet of hers which seems on a blockchain.com account. And she was blown at first because that became around $11k in total she stated the video was made 3 months ago so basically that's on October 2020 and uploaded it on $39k ATH on January 2021.And that made her look up to that donator and meet him in person. She's able to contact him through their mutual friend and met him in Vegas. For other details, it's on her YT channel named \"Ali Spagnola\" and the link is on the image/thread.This is just one of the stories of success in relation to bitcoin holding. Like, this woman has no idea of what she's about to receive as a donation. Still, after reading the explanation and being educated just through the email, she's in and held it unintentionally for several years which has blown her during the bull run and it could have gone up to $69k if she has held up to that point and sold. I have no idea what's with that bitcoin she holds now if she still has it through the bear market or sold it on high. Regardless of that, she's still on the win and profit by having that value of $50 years ago and even if we're in a bear market now, it's still worth around $19k-$20k.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5416546",
  "comments": [
    {
      "author": "bittraffic",
      "created_time": "October 10, 2022, 12:54:58 AM",
      "body": "It turned out, it was one the best painting job she did. It's also a good thing she still can access her blockchain.com account. People who didn't mind thier account since the early days forgot about it and recovering is difficult. $50/BTC is the price of BTC in 2013. That's how fast the price had climbed to 2017. Waiting for 2025, she could get more than $60K.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "peter0425",
      "created_time": "October 10, 2022, 01:18:28 AM",
      "body": "Quote from: tabas on October 10, 2022, 12:46:45 AMYoutube channel: https://www.youtube.com/c/alispagnolaThis video was uploaded in early 2021. It was an exciting story and I want to share it here.This is another way of showing how early investors or believers received their part of cake from their investments , though this sounds like not really a trust but an opportunity and experimental? yet that said painter is a double digit richer now .and maybe as she continues to see the future? then keeping the said bitcoin will bring Her more confident as the price will continue to progress if she will look deeper to what is bitcoin all about and how this works for betterment of the system and the market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EdenHazard",
      "created_time": "October 10, 2022, 01:19:20 AM",
      "body": "Quote from: bittraffic on October 10, 2022, 12:54:58 AMIt turned out, it was one the best painting job she did. It's also a good thing she still can access her blockchain.com account. People who didn't mind thier account since the early days forgot about it and recovering is difficult. $50/BTC is the price of BTC in 2013. That's how fast the price had climbed to 2017. Waiting for 2025, she could get more than $60K.We called it the miracle of bitcoin!i have once surprised myself by seeing my bittrex account had a balance worth $1,200 when the price of bitcoin hit the all time high in 2020 at $28,000 per bitcoin , that was a little amount of money back in when i opened the account at bittrex and left some bitcoins there it's just worth around $70 as well , i'm excited as hell to try to remember another wallet i left with some coins back in 2014 lol.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fundamentals Of",
      "created_time": "October 10, 2022, 01:45:52 AM",
      "body": "Lucky for her, she didn't totally forget about it. Bitcoin at $50 for somebody who is clueless about what it is and doesn't know much about wallets, backups, private keys, etc, it might simply be forgotten. It is really good for her that she's still able to access it. She deserves it.Many lost access to their Bitcoin in those early years not just because of low value but also because nobody thought it would rise this high. Many must have easily threw away hard drives containing a few Bitcoin because it was only worth a little.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "October 10, 2022, 02:31:16 AM",
      "body": "For the 1 BTC donation, she had like $67k at one point(price ATH). Noice.The question though is, has she sold already — and if so, at what price?Quote from: Fundamentals Of on October 10, 2022, 01:45:52 AMLucky for her, she didn't totally forget about it. Bitcoin at $50 for somebody who is clueless about what it is and doesn't know much about wallets, backups, private keys, etc, it might simply be forgotten. It is really good for her that she's still able to access it. She deserves it.If I were to guess, she probably just had her blockchain.com account's login credentials saved on her browser lmao.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Reatim",
      "created_time": "October 10, 2022, 02:33:32 AM",
      "body": "Quote from: bittraffic on October 10, 2022, 12:54:58 AMIt turned out, it was one the best painting job she did. It's also a good thing she still can access her blockchain.com account. People who didn't mind thier account since the early days forgot about it and recovering is difficult. Painting that  amounting 20k usd(the price is base for now and not yesterday and tomorrow) so indeed this is one of the expensive painting this painter did( not unless Her paintings now causing too much amount) .Quote$50/BTC is the price of BTC in 2013. That's how fast the price had climbed to 2017. Waiting for 2025, she could get more than $60K.it will extend more if she keeps that funds on hold as already been keeping for almost 10 years now .",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Strongkored",
      "created_time": "October 10, 2022, 02:51:10 AM",
      "body": "She is lucky to still have access to the wallet and her luck is multiplied by accessing the wallet when the BTC price is quite high although not the highest.There are many stories out there of how they became surprised that their crypto asset in BTC, had multiplied in value in USD due to the increase in the price of BTC, sometimes not knowing how valuable btc could make a profit.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Free Market Capitalist",
      "created_time": "October 10, 2022, 03:07:35 AM",
      "body": "The only thing I would do if I were her, and therefore what I would recommend, is not to sell everything. If she's tempted to trade it for fiat, she can sell half a Bitcoin and wait another 10 years. I'm sure it will be worth it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fundamentals Of",
      "created_time": "October 10, 2022, 03:24:25 AM",
      "body": "Quote from: mk4 on October 10, 2022, 02:31:16 AMFor the 1 BTC donation, she had like $67k at one point(price ATH). Noice.The question though is, has she sold already — and if so, at what price?Quote from: Fundamentals Of on October 10, 2022, 01:45:52 AMLucky for her, she didn't totally forget about it. Bitcoin at $50 for somebody who is clueless about what it is and doesn't know much about wallets, backups, private keys, etc, it might simply be forgotten. It is really good for her that she's still able to access it. She deserves it.If I were to guess, she probably just had her blockchain.com account's login credentials saved on her browser lmao.The donation was done way back in 2013, that's like almost 10 years ago. Well, the video was uploaded in 2021 so that's actually 8 years later. But just the same, didn't she change computers or laptops since then? It's amazing that somebody who is not really deep into this Bitcoin thing still has access to her meager 1 BTC after a long time. Even some of those who are deep into Bitcoin in its earliest years lost access to their tens or even hundreds, or perhaps even thousands of Bitcoin. In terms of your question whether she sold or not, either way she had already made a good profit from that tip. Lucky for her that she forgot about it for some time, but not the access.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Flexystar",
      "created_time": "October 10, 2022, 03:44:39 AM",
      "body": "I respect these people who are hodling their bitcoin since 2013. The longest I was able to hodl was 2 and half years that too during the COVID situation and now I keep selling now and then whenever I need my money for my daily usage. Though I have set up ledger now to keep saving some bitcoins. I am also putting sharing of money from the part time job and trying to hodl is as much as I could in the future. These are the stories I need to keep learning and keep myself motivating so that I can hodl longer than usual. Lolz. Good for the painter, afterall her artwork and hard work paid her off!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "October 10, 2022, 03:49:08 AM",
      "body": "Quote from: Fundamentals Of on October 10, 2022, 03:24:25 AMThe donation was done way back in 2013, that's like almost 10 years ago. Well, the video was uploaded in 2021 so that's actually 8 years later. But just the same, didn't she change computers or laptops since then?Assuming that my broad assumption is right — the fact that she might've just saved her Blockchain.com login credentials on her browser, well, Chrome — the most used browser ever, syncs saved login credentials to your Google account by default. Everything should be backed up assuming she's using the same Google account.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "m2017",
      "created_time": "October 10, 2022, 05:16:46 AM",
      "body": "Quote from: Strongkored on October 10, 2022, 02:51:10 AMShe is lucky to still have access to the wallet and her luck is multiplied by accessing the wallet when the BTC price is quite high although not the highest.There are many stories out there of how they became surprised that their crypto asset in BTC, had multiplied in value in USD due to the increase in the price of BTC, sometimes not knowing how valuable btc could make a profit.Her luck lies in the fact that they had no idea what bitcoin was and forgot about it for many years. If this had not happened, then she would have sold her btc long ago for a lower price. The plot in such stories is almost always the same: people forgot about bitcoin, remembered many years later and found an impressive amount in their wallet. This is what allows you to increase savings at btc. From which the conclusion suggests itself that if there is a goal to earn on bitcoin, then you need to buy it and put it off for many years, so as not to succumb to the temptation to sell at a low price. As you can see, even $50 can grow significantly and even now it is not too late to invest such a modest amount for years to come.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tabas",
      "created_time": "October 10, 2022, 08:58:45 AM",
      "body": "Quote from: m2017 on October 10, 2022, 05:16:46 AMAs you can see, even $50 can grow significantly and even now it is not too late to invest such a modest amount for years to come.I agree and that's why people shouldn't underestimate little amounts that they'll use to buy bitcoin at these times. Maybe some the same story will be built upon in the future the same as what this woman has experienced.Quote from: mk4 on October 10, 2022, 03:49:08 AMQuote from: Fundamentals Of on October 10, 2022, 03:24:25 AMThe donation was done way back in 2013, that's like almost 10 years ago. Well, the video was uploaded in 2021 so that's actually 8 years later. But just the same, didn't she change computers or laptops since then?Assuming that my broad assumption is right — the fact that she might've just saved her Blockchain.com login credentials on her browser, well, Chrome — the most used browser ever, syncs saved login credentials to your Google account by default. Everything should be backed up assuming she's using the same Google account.Yeah, if by chance she didn't upgraded the laptop/desktop that she used. It was just saved on the browser together with her gmail accout but that's too long for that usage since she's into art. Well, the most likely is that she probably has just kept the credentials.Quote from: Flexystar on October 10, 2022, 03:44:39 AMI respect these people who are hodling their bitcoin since 2013. The longest I was able to hodl was 2 and half years that too during the COVID situation and now I keep selling now and then whenever I need my money for my daily usage. Though I have set up ledger now to keep saving some bitcoins. I am also putting sharing of money from the part time job and trying to hodl is as much as I could in the future. These are the stories I need to keep learning and keep myself motivating so that I can hodl longer than usual. Lolz. Good for the painter, afterall her artwork and hard work paid her off!There are plenty of motivation that you can look at your own situation. Think of your dreams and what might happen in the future if bitcoin goes on a bull run and price goes up. Just don't stop saving and holding.Quote from: Poker Player on October 10, 2022, 03:07:35 AMThe only thing I would do if I were her, and therefore what I would recommend, is not to sell everything. If she's tempted to trade it for fiat, she can sell half a Bitcoin and wait another 10 years. I'm sure it will be worth it. She's endured a lot of years not remembering that she's holding a bitcoin. But, whether she sells or not, she's in total profit no matter what the price is now but I'd say the same that it's better to hold and it will be more worth it.Quote from: Strongkored on October 10, 2022, 02:51:10 AMShe is lucky to still have access to the wallet and her luck is multiplied by accessing the wallet when the BTC price is quite high although not the highest.There are many stories out there of how they became surprised that their crypto asset in BTC, had multiplied in value in USD due to the increase in the price of BTC, sometimes not knowing how valuable btc could make a profit.This is just one of the many and I'm sure that there are even greater stories out there that they've found massive wealth by just forgetting/holding that they own it years ago up to present.Quote from: peter0425 on October 10, 2022, 01:18:28 AMThis is another way of showing how early investors or believers received their part of cake from their investments , though this sounds like not really a trust but an opportunity and experimental? yet that said painter is a double digit richer now .and maybe as she continues to see the future? then keeping the said bitcoin will bring Her more confident as the price will continue to progress if she will look deeper to what is bitcoin all about and how this works for betterment of the system and the market.What I think with a person like her that don't much worry at all whether the price goes up or down, when they see the price of bitcoin goes down it's likely that she's just going to sell before it goes to zero. Just like the typical mindset of a person that haven't understand bitcoin wholly but I hope she kept it or sold around $40k or higher.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ajiz138",
      "created_time": "October 10, 2022, 09:07:43 AM",
      "body": "Quote from: Poker Player on October 10, 2022, 03:07:35 AMThe only thing I would do if I were her, and therefore what I would recommend, is not to sell everything. If she's tempted to trade it for fiat, she can sell half a Bitcoin and wait another 10 years. I'm sure it will be worth it. He had to forget about Bitcoin again and it would be more valuable than anything if he still held Bitcoin, but indeed when he saw the current high price it was sometimes more tempting to exchange to fiat to donate or use but in fact he had managed to hold Bitcoin from the price of $50 and even higher its value.Maybe it's because he doesn't know anything about Bitcoin so he forgot about it for a long time, even I consider this a sign that Bitcoin holders will be winners in the future for example this person who held and forgot him for years.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rruchi man",
      "created_time": "October 10, 2022, 10:04:16 AM",
      "body": "Good thing it turns out to be a story with a happy ending, I like the fact that even though she had no idea about how important bitcoins will turn out to be, she held on it and kept it safe. IMO, this is just how God and the universe wanted to reward her years of offering free services to people who definitely would have wished her well whether in their hearts or openly with statements like \"GOD BLESS YOU''. I hope she doesn't stop doing good and being a good person.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "October 10, 2022, 10:19:51 AM",
      "body": "What is the lesson of this story? Someone remembered that he received 1 BTC in 2013 and now he has discovered this wealth, so maybe everyone should check if maybe they received a similar donation once upon a time... The bad news is that 9 out of 10 people who find themselves in a similar situation will be completely helpless to make a successful recovery - and this is evidenced by hundreds of stories that I have read on this forum in the past 7-8 years.What I like is that the girl in the video realized that she could use all of this for additional promotion of her YT channel, and that she gave $50 in BTC to ten of her subscribers, hoping that one day they too will turn it into their small fortune.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Coyster",
      "created_time": "October 10, 2022, 10:39:07 AM",
      "body": "For this painter i don't think discovering this Bitcoin she received many years ago is going to be the end of her Bitcoin journey, i rather think things could just be starting with her, maybe it is just the beginning because i think she is going to fully seek for knowledge about Bitcoin, there are things that could happen to us in our lives that makes us want to know more, for her this should be one of such things, if this doesn't propel her to learn every basic thing about Bitcoin, then i don't know what will.Thus i would not even be concerned about if she has sold the huge amount she just discovered she has, but rather how much more she'd be willing to buy going forward, she's definitely a new Bitcoiner in the block, and luckily for her she didn't discover how good the Bitcoin network is in the hard way, because she could have made one silly mistake and all that funds is gone, afterall it was just $50 eh.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "swogerino",
      "created_time": "October 10, 2022, 11:33:10 AM",
      "body": "Quote from: mk4 on October 10, 2022, 02:31:16 AMIf I were to guess, she probably just had her blockchain.com account's login credentials saved on her browser lmao.Well what is to be admired is that some people keep using the same Laptop/Desktop PC or any other device for such long period of time.I cannot understand it as I work as an IT and the max I keep my computer is 2 years before upgrading to a newer one,of course migrating everything.If she has migrated everything from that time until 2021 then from me it is big kudos to her for not losing the credentials of her wallet.Finally it is great to hear a good story about people who had held Bitcoins since early days.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Plaguedeath",
      "created_time": "October 10, 2022, 11:48:59 AM",
      "body": "The painter is really lucky since he can still access her old wallet while most people doesn't, they only lucky to remember if they have Bitcoin when Bitcoin still worth for few dollars.Quote from: mk4 on October 10, 2022, 03:49:08 AMAssuming that my broad assumption is right — the fact that she might've just saved her Blockchain.com login credentials on her browser, well, Chrome — the most used browser ever, syncs saved login credentials to your Google account by default. Everything should be backed up assuming she's using the same Google account.Moral of the stories is leave your coins on exchanges since it's much easier to retrieve your old account, if you leave your coins on hardware wallet and you forget your seeds, it's done /jk.Quote from: Lucius on October 10, 2022, 10:19:51 AMWhat I like is that the girl in the video realized that she could use all of this for additional promotion of her YT channel, and that she gave $50 in BTC to ten of her subscribers, hoping that one day they too will turn it into their small fortune.I think it's completely possible Bitcoin would be worth so much than the current price and that's why we shouldn't stop to accumulating Bitcoin when it's still cheaper.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}