{
  "id": "topic_5462041",
  "title": "ScamViruS",
  "author": "ScamViruS",
  "created_time": "August 04, 2023, 09:19:21 AM",
  "content": "What happened: Chainlink and SEI fake airdrop website.Since Sei was listed in the binance launchpool, scammers using this project name have been trying to scam crypto users. Because this project is currently trending in the crypto market, there will be a lot of interest among crypto users in this project so that scammers will try to take maximum advantage of it. And Chainlink is already popular in the market, and scammers have used chainlink's name many times to create fake airdrop websites. And looking at their activities, it is assumed that they will create more fake airdrop websites using the names of these projects in the coming days. So crypto users should check the project's official social media before joining any airdrop to confirm if the airdrop is genuine or not.Chainlink :Twitter : https://twitter.com/AnthonyRiceNFTWebsite : Code:https://linkclaim.app/Sei :Twitter : https://twitter.com/adamss0xWebsite : Code:https://sei-lor.net/",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5462041",
  "comments": [
    {
      "author": "BD Crypto",
      "created_time": "August 04, 2023, 02:13:08 PM",
      "body": "Quote from: ScamViruS on August 04, 2023, 09:19:21 AMAnd Chainlink is already popular in the market, and scammers have used chainlink's name many times to create fake airdrop websites. And looking at their activities, it is assumed that they will create more fake airdrop websites using the names of these projects in the coming days.Nice Catch OP. Not only Chainlink or SEI they will target every new hype projects to attract beginners and they already succeed many times by spreading these phishing sites. Sometimes they send dms from the community group of a related project to fall them into this trap. So we should be aware much more to prevent them. I don't think scammers will stop their jobs and they will find more realistic way to scam people.Quote from: ScamViruS on August 04, 2023, 09:19:21 AMSo crypto users should check the project's official social media before joining any airdrop to confirm if the airdrop is genuine or not.I am not agee with this line properly as we can see sometimes official social accounts are being hacked or compromised and they post fake announcements. So we have to know what is suspicious and what is legit. We should check several social accounts or sources from official accounts to verify it's legitimacy.You just caught them too earlier as we can see domain is registered 3 days before of Link Phising site. Here are the domain details of them Phising sites: QuoteDomain:linkclaim.appRegistrar:Tucows Domains IncRegistered On:2023-08-01Expires On:2024-08-01Updated On:2023-08-01Status:addPeriodclientTransferProhibitedclientUpdateProhibitedName Servers:de1.lethost.code2.lethost.coAnother one is from SEI phishing which is created today. So It will be helpful to caught them earlier either newbies may fall into them because the lack of awareness.QuoteDomain:sei-lor.netRegistrar:Regional Network Information Center, JSC dba RU-CENTERRegistered On:2023-08-04Expires On:2024-08-03Updated On:2023-08-04Status:clientTransferProhibitedName Servers:kaiser.ns.cloudflare.comsima.ns.cloudflare.com",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ScamViruS",
      "created_time": "August 04, 2023, 06:10:29 PM",
      "body": "Quote from: BD Crypto on August 04, 2023, 02:13:08 PMQuote from: ScamViruS on August 04, 2023, 09:19:21 AMSo crypto users should check the project's official social media before joining any airdrop to confirm if the airdrop is genuine or not.I am not agee with this line properly as we can see sometimes official social accounts are being hacked or compromised and they post fake announcements. So we have to know what is suspicious and what is legit. We should check several social accounts or sources from official accounts to verify it's legitimacy.Yes, the official accounts of various projects get hacked many times, then they use those official accounts to promote fake website links. But not all official channels are hacked at once, a project has many official channels to stay connected with their community. So it has to be confirmed from multiple mediums. Many projects actually host giveaways, so in order to participate in them you have to confirm by any means that it is genuine.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sopiandi",
      "created_time": "August 22, 2023, 05:38:00 AM",
      "body": "SEI no have airdrop. All community just got joke from bad team developer and #SeiScam is true.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nwada001",
      "created_time": "August 22, 2023, 11:14:59 PM",
      "body": "Quote from: sopiandi on August 22, 2023, 05:38:00 AMSEI no have airdrop. All community just got joke from bad team developer and #SeiScam is true.This is not about the real project actually having a real airdrop or not; this is about the project making a name for itself and being popular enough that people know about them. Trending news about a project makes them a target for scammers, as newbies will be expecting the project to do some airdrop in celebration of their success or any milestone that they reach. So the SEI was worth the fake airdrop, as they have already built some sort of name in the crypto space.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}