{
  "id": "topic_5437909",
  "title": "tom1397",
  "author": "tom1397",
  "created_time": "February 03, 2023, 09:56:32 AM",
  "content": "I lost over $200,000 on this site after a chinese woman asked me to register for the site. If you google cur-ves.com you will find nothing. But when this woman gave me the link I was able to register and do options trading with her giving me directions. We had a year long relationship and when I decided to withdraw some of the money they told me I had to pay taxes before anything could be withdrawn. They wouldn't just withhold the amount for taxes, I had to pay them upfront. I refused the account is still there but effectively frozen. Since this site is so secretive I would like to know what experiences others have had with this. The woman said you can get a 8-12% return on your investment. Isn't this suspicious?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5437909",
  "comments": [
    {
      "author": "CoinEraser",
      "created_time": "February 03, 2023, 10:17:42 AM",
      "body": "I've never used this site, but it all sounds like a scam. If the site were legit, they would simply collect the taxes from the account balance. But as soon as you have to pay money for these taxes, it is 99.99% a scam. Similar pages and cases can also be found here in the forum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "trapcoder666",
      "created_time": "February 03, 2023, 10:54:38 AM",
      "body": "Sorry OP , it's a common tactic used by the syndicate. This is called a pig butchering scam. You invested in the syndicates website and there's no way to withdraw it. You can read about it here : https://www.wired.com/story/what-is-pig-butchering-scam/#:~:text=%E2%80%9CIn%20this%20scheme%2C%20fraudsters%2C,said%20in%20an%20October%20alert.Guessing you met \" her \" on Tinder ? A lot of them even have verified profiles nowadays.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Potato Chips",
      "created_time": "February 03, 2023, 04:59:41 PM",
      "body": "Yeah, it's a popular scam. Don't give anymore money and if you supplied any personal documents to them, consider it leaked.This thread has some good advises on what to do next, see: https://www.reddit.com/r/Scams/comments/nz1y8h/what_to_do_when_one_is_in_a_pigbutchering_scam-> a little add on to this: I remember there was a victim who tried to explore if their case was tax deductible to minimize their loss. This guide could be a great start: https://koinly.io/guides/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitcoin_Arena",
      "created_time": "February 03, 2023, 10:44:57 PM",
      "body": "Quote from: tom1397 on February 03, 2023, 09:56:32 AMI lost over $200,000 on this site after a chinese woman asked me to register for the site.  investment. Isn't this suspicious?Couldn't read any further, you just few for a popular scam known as pig-butchering scam  And don't even waste time thinking that you will be able to withdraw the money, it's gone. Next time, stop trusting internet strangers for investment advice, especially nice looking Chinese or Japanese ladies. They just play on your horn.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rat03gopoh",
      "created_time": "February 04, 2023, 09:14:30 AM",
      "body": "Quote from: tom1397 on February 03, 2023, 09:56:32 AMIsn't this suspicious?That's definitely a scam to me, not just suspicious. Badly you're a bit late to realize and have to pay dearly first to gain experience.I don't know what your job is, by knowing that you were cheated by $200k I think you're already well established in knowledge and know more about this kind of scam pattern.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "f5nmr",
      "created_time": "February 18, 2023, 04:49:53 AM",
      "body": "i had about the same experience one year ago with Kexin and would like to share data with you including the fund tracking i did on my side via cayman islands and other exchange places.cur-ves.com has changed to procurve.net",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coin-investor",
      "created_time": "February 18, 2023, 09:23:46 AM",
      "body": "Quote from: tom1397 on February 03, 2023, 09:56:32 AMI lost over $200,000 on this site after a chinese woman asked me to register for the site. If you google cur-ves.com you will find nothing. But when this woman gave me the link I was able to register and do options trading with her giving me directions. We had a year long relationship and when I decided to withdraw some of the money they told me I had to pay taxes before anything could be withdrawn. They wouldn't just withhold the amount for taxes, I had to pay them upfront. I refused the account is still there but effectively frozen. Since this site is so secretive I would like to know what experiences others have had with this. The woman said you can get a 8-12% return on your investment. Isn't this suspicious?Losing $200k is just too much did you not get suspicious that this is an unknown site, or did you not first verify if it's ok to invest or you have been blinded by the Chinese woman with who you got into a relationship.I would have done this because it involves a very huge amount I don't know your business or profession but it seems to invest $200k is ok with you.This is an example of never easily trusting people on the internet that you did not personally meet and checking the background even if the invitee looks like a Miss Universe candidate.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PX-Z",
      "created_time": "February 18, 2023, 09:15:14 PM",
      "body": "So you have been using the site for a year already? Or its just your relationship with the lady? And you didn't get any suspicious when you searched it and even google can't you details about them?. I can't even access the site.. Yeah, this is a common scam. i'll be expecting more from internet users now because of resources they have to get information via the internet but it looks like its the opposite. Anyway, this should serve you a lesson, that always use google to search about a site before doing anything about money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Saisher",
      "created_time": "February 20, 2023, 11:57:26 AM",
      "body": "I've received a similar offer on telegram, telegram is their favorite place to contact their potential victim another one are dating applications, these scammers impersonate people or disguise themselves and look for potential victims based on their profile, so if you're gullible and easily believe what you see online you are a good target by scammers, OP may not be the last one many will still become victims because these scammers are good in communication and they are good in enticing people to invest on scam platforms.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "albon",
      "created_time": "February 20, 2023, 04:33:50 PM",
      "body": "Quote from: tom1397 on February 03, 2023, 09:56:32 AMI lost over $200,000 on this site after a chinese woman asked me to register for the site. If you google cur-ves.com you will find nothing. But when this woman gave me the link I was able to register and do options trading with her giving me directions. We had a year long relationship and when I decided to withdraw some of the money they told me I had to pay taxes before anything could be withdrawn. They wouldn't just withhold the amount for taxes, I had to pay them upfront. I refused the account is still there but effectively frozen. Since this site is so secretive I would like to know what experiences others have had with this. The woman said you can get a 8-12% return on your investment. Isn't this suspicious?How do you trust strangers? There are so many scammers on social media and everywhere around us. The first mistake is that you trusted someone you do not know and believed his false promises about obtaining a high return on investment. The second mistake is that you opened the link and registered an account without doing your own research and seeing reviews about it. The third mistake is that you did not lose a dollar or five, but rather 200 thousand dollars. How did you deposit this? The huge amount, dude, and you lost it? Did they hypnotize you or steal your mind? I am sorry for your loss, but unfortunately, this lesson is very harsh, and now they have closed their scam site and removed any evidence related to them, and perhaps the Chinese woman who spoke to you closed her account and deleted the conversation; there is no evidence to sue them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "decodx",
      "created_time": "February 20, 2023, 05:32:20 PM",
      "body": "Quote from: tom1397 on February 03, 2023, 09:56:32 AMIsn't this suspicious?I'm sorry to hear about your experience. From what you've told us, it seems like you've been scammed. The fact that the website is hard to find on Google and that they asked you to pay taxes upfront before letting you withdraw your funds are both warning signs. It's important to be cautious when it comes to online investment opportunities, especially when dealing with unfamiliar websites and individuals.Can you tell us a little more about how you first became involved with this Chinese woman and the website? Did she reach out to you directly, or did you come across an advertisement or receive a recommendation from someone else that led you to the website?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}