{
  "id": "topic_5405133",
  "title": "Odusko",
  "author": "Odusko",
  "created_time": "July 04, 2022, 01:19:33 PM",
  "content": "For a while, I have been thinking about the world economy, and how the distribution of information and data has been in the last decade where institutions rely on the traditional system. The bank has the power to control the flow of financial information and data, but with Bitcoin and the blockchain, the virtual digital system has changed the way and manner the world financial system operates without injustice to any part of the chain and on a decentralized network. So to this point Bitcoin can be said to be the global digital currency because Bitcoin has no restrictions and is not controlled by anyone.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5405133",
  "comments": [
    {
      "author": "notocactus",
      "created_time": "July 04, 2022, 01:28:50 PM",
      "body": "Quote from: Odusko on July 04, 2022, 01:19:33 PMFor a while, I have been thinking about the world economy, and how the distribution of information and data has been in the last decade where institutions rely on the traditional system. The bank has the power to control the flow of financial information and dataNot your keys, not your coins.Even stable coins can be frozen in your wallet.Quotewith Bitcoin and the blockchain, the virtual digital system has changed the way and manner the world financial system operates without injustice to any part of the chain and on a decentralized network.You should use technical term more carefully. Virtual is a misleading term used by governments or any entity that don't want people get access to Bitcoin and cryptocurrency.So please don't bind 'virtual' with either digital currency or cryptocurrencyQuoteSo to this point Bitcoin can be said to be the global digital currency because Bitcoin has no restrictions and is not controlled by anyone.It is not. I am Bitcoin enthusiast and I know Bitcoin is widely accepted on may platforms, has many use cases but to call it as a global digital currency, it is not. Not yet reach to this phase.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zilon",
      "created_time": "July 04, 2022, 06:10:35 PM",
      "body": "Quote from: Odusko on July 04, 2022, 01:19:33 PMbut with Bitcoin and the blockchain, the virtual digital system has changed the way and manner the world financial system operates without injustice to any part of the chain and on a decentralized network.Nothing has changed about the manner financial system operates what actually changed is your reality to the fact you can be your own bank. Have your funds under your own custody without this financial system interfering. Quote So to this point Bitcoin can be said to be the global digital currency because Bitcoin has no restrictions and is not controlled by anyone.Bitcoin isn't controlled by anyone yes if you have your keys, Bitcoin has no restriction if your government still says so because in places where Bitcoin is banned you can't openly do transactions except on a completely decentralized online store. Lastly Bitcoin is not yet a global currency. It is approaching that stage but for now no.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mpamaegbu",
      "created_time": "July 04, 2022, 06:22:51 PM",
      "body": "Quote from: Odusko on July 04, 2022, 01:19:33 PMSo to this point Bitcoin can be said to be the global digital currency because Bitcoin has no restrictions and is not controlled by anyone.Nah! That's not true. I don't even see it ever happening. My reason for that is because of certain encumbrances of Bitcoin like internet and literacy level. Bitcoin can't be embraced in areas or countries that lack those two major items and there are countries with low level or absent of those two. Again, you've to bear in mind that despite how high a value the British Pounds or Euros are, they still aren't more globally accepted than the US dollar. Quite true that Bitcoin is a phenomenal of the 21st century but it's not a global digital currency.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Doan9269",
      "created_time": "July 04, 2022, 06:30:54 PM",
      "body": "Quote from: Odusko on July 04, 2022, 01:19:33 PMthe virtual digital system has changed the way and manner the world financial system operates without injustice to any part of the chain and on a decentralized network. So to this point Bitcoin can be said to be the global digital currency because Bitcoin has no restrictions and is not controlled by anyoneThings are better far the way now with the new era of digital technology, especially when the cryptocurrency emerges, this changes the way and how fiat currency is been used for the benefits of the people, now everyone want to go with the cryptocurrency digital era for all of their economic activities, all because they finds it a solution to thier long time awaited problems in financial aspect, investment, business transactions, regulations, delay and centralization in fiat currency.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rruchi man",
      "created_time": "July 04, 2022, 06:58:42 PM",
      "body": "For the now, bitcoin is the most innovative technology on the internet i can agree with you, but is it really going to remain so is the question i always ask.  If you currently love bitcoins for the being the most innovative tech on the internet, how about when a new innovation comes that may become more innovative than bitcoins, will you still love bitcoins then? If you love bitcoin, be in love with it because of its benefits, and not just because it is the most innovative technology on the internet currently, that attachment can easily fade.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}