{
  "id": "topic_5416409",
  "title": "HoBzY",
  "author": "HoBzY",
  "created_time": "October 08, 2022, 01:26:27 PMLast edit: December 06, 2022, 05:05:29 PM by HoBzY",
  "content": "Is it possible to somehow send a new block to the btc network without using ports?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5416409",
  "comments": [
    {
      "author": "jackg",
      "created_time": "October 08, 2022, 03:23:32 PM",
      "body": "Do you understand your question or do you mean something else?A port is normally added to the end of an address to identify either who's sending the information or what protocol it relates to (for opening a connection).If you're trying to do something where you generate a block on a network but don't use an asic miner then you could look at mining on testnet (the blocks are easier to find but their rewards don't hold value) or mining a coin that can be mined on a CPU or gpu (it's probably easier to do this in a pool).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackHatCoiner",
      "created_time": "October 08, 2022, 05:17:26 PM",
      "body": "I'm sure that's a XY problem, but no. You can't. To use the TCP/IP, you need to establish connections with ports. For mainnet, it's 8333, for testnet 18333, for http 80 etc. To broadcast a block to the network, you can either run a node, and therefore use port (1)8333, or use port 80 and submit it using a block explorer.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "HoBzY",
      "created_time": "October 08, 2022, 07:11:11 PM",
      "body": "There is no way to open at least 1 port( No access",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "n0nce",
      "created_time": "October 08, 2022, 11:31:50 PM",
      "body": "Quote from: HoBzY on October 08, 2022, 07:11:11 PMThere is no way to open at least 1 port( No accessOhhhh, the XY problem was solved!You want to use a Bitcoin node behind NAT. That absolutely works; you don't need to open ports in your (or your router's) firewall.The Bitcoin node will still form connections, even though they're called 'incoming', they are bidirectional and you will still be able to broadcast blocks, yes.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "seoincorporation",
      "created_time": "October 19, 2022, 10:51:46 PM",
      "body": "Quote from: HoBzY on October 08, 2022, 01:26:27 PMIs it possible to somehow send a new block to the btc network without using ports?One of those questions where the answer is in the question...If you are talking about the bitcoin network you mean there are machines connected on a network, and they need a protocol and a port to create that network.Now, if we think deep in the question, the right answer is: It would be possible if only you are in the network and you mined that block. A good example is the first block ever mined, it was only one computer in the network, think about it",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}