{
  "id": "topic_5465933",
  "title": "@sriyan",
  "author": "@sriyan",
  "created_time": "September 07, 2023, 04:00:56 AMLast edit: September 07, 2023, 04:37:07 AM by @sriyan",
  "content": "These days lot of users farming airdrops using multiple wallets. So the criteria will be difficult for this year. 2020 - Airdrops for all. No criteria2021 - $10K-30K per account. It has some criteria. (Eg: DYDX, Paraswap, Uniswap, 1Inch)2022 - less complicated criteria(Eg: Aptos, Optimism)2023 - some complicated criteria(Eg: Arbitrum). But this is like 2021. (Starknet coming soon)2024 - We will waiting for the very complicated criteria due to a lot of users. Otherwise, the allocation will be small. (Eg: Zksync, Layerzero)",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5465933",
  "comments": [
    {
      "author": "8rch7",
      "created_time": "September 07, 2023, 04:22:34 AM",
      "body": "Seems you still update with current airdrop information, did you participated in Blueshark airdrop have been distribution but depend on your level account or mission completed. Some participants I saw get reward above 1k of SUI coin because they are on the top rank position and the same with your criteria about airdrop not for all user. Right now almost airdrop reward not all participants, they are limiting participant depend with how completed quest and some time an airdrop rule depend with how many referral do you have. I believe in 2024 will get difficult rule for participating in airdrop exactly after many airdrop launching as retro and need spent fees for qualifying as airdrop reward participants.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitterguy28",
      "created_time": "September 07, 2023, 05:57:42 AM",
      "body": "Quote from: @sriyan on September 07, 2023, 04:00:56 AMThese days lot of users farming airdrops using multiple wallets. So the criteria will be difficult for this year. 2020 - Airdrops for all. No criteria2021 - $10K-30K per account. It has some criteria. (Eg: DYDX, Paraswap, Uniswap, 1Inch)2022 - less complicated criteria(Eg: Aptos, Optimism)2023 - some complicated criteria(Eg: Arbitrum). But this is like 2021. (Starknet coming soon)2024 - We will waiting for the very complicated criteria due to a lot of users. Otherwise, the allocation will be small. (Eg: Zksync, Layerzero)Looks like a complete airdropper here ? have full details of your airdropped ? have you earned and joined all of those who mentioned?sorry Am not a Airdrop fan so i am waiting to what will come in in 2024, because also I am not a social media active so i can not perform to what required by the airdrop.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tvplus006",
      "created_time": "September 07, 2023, 05:24:55 PM",
      "body": "Quote from: @sriyan on September 07, 2023, 04:00:56 AM...2024 - We will waiting for the very complicated criteria due to a lot of users. Otherwise, the allocation will be small. (Eg: Zksync, Layerzero)The number of users who expect to receive airdrop from these projects has already reached 4 million and it will be very difficult to distribute coins to everyone, the number of which would be satisfied with the hunters. Accordingly, the selection criteria will be the strictest and those who have completed several transactions certainly will not receive anything.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "goaldigger",
      "created_time": "September 07, 2023, 09:19:22 PM",
      "body": "Airdrop this year are more complicated but still many hunters are doing it since its a free money and they already get used to it. It’s actually good to see that every year there’s a big aidrops that will shock the market and I’m sure next year will be more exciting as many expects bull market next year.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JeffBrad12",
      "created_time": "September 07, 2023, 10:16:18 PM",
      "body": "thats just how it is, the more people are participating into the airdrops, surely the devs trying to filter only few of them so that the rewards remain worthy while also making the participants contributes more through the complicated qualification, moreover the fact that many of these project doesn't even bother to disclose their qualifications beforehand meaning its part of their marketing strategy so that the users that trying to participate into their project will try to finish every task like minting and interacting with smart contract as much as they can since its all still unrevealed criteria so they definitely want to increase their chances.thats what bother me most, moreover if the criteria is so complex yet the reward allocated is so small, its like such a waste of time, that why this kind of strategy of making people left confused by the fact that they intentionally by intentionally not showing it just feels like they are taking advantage of the people.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "asriloni",
      "created_time": "September 08, 2023, 01:27:27 AM",
      "body": "The metrics used by the project developer to determine which users are eligible for the airdrop will always be changed, as they have their own matrics. It's still quite impossible to predict it accurately but the only thing that i know since a long time ago if user who used the platform or blockchain developed by the developers will always be eligible for the airdrop. That is becoming even more complicated caused by there might be a points mechanism to be implemented in the future of airdrop. I saw that some dexes were airdropping its users through use similiar metrics like what arbitrum did but it's still remain unpredictable. Just always actively using the platform and we will always be eligible for the airdrop. The only key to receiving an airdrop from the developers is always actively using their platforms. that's it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GreatArkansas",
      "created_time": "September 08, 2023, 02:11:37 AM",
      "body": "I remember the early days of this airdrop, where you can receive a lot of airdrops it does not matter if it is shitcoin or not because some of them are worthy and can make you quite good money.Over time, airdrop has improved especially these days, where sometimes you can't cheat anymore. They already have strong way to identify if someone is cheating, like this sybil address thing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kotajikikox",
      "created_time": "September 08, 2023, 04:55:17 AM",
      "body": "Quote from: goaldigger on September 07, 2023, 09:19:22 PMAirdrop this year are more complicated but still many hunters are doing it since its a free money and they already get used to it. actually not just this year but since 2020 when airdrop stars to be more complicated and when the team is asking too  much requirements specially in their social media terms.comparing to the years before that when air drop hunters are just doing almost nothing but gaining their shares , and also there are so much cheating happening.QuoteIt’s actually good to see that every year there’s a big aidrops that will shock the market and I’m sure next year will be more exciting as many expects bull market next year. but at least now becoming more realistic and legit not like in the past that most are just easy to join but scamming is what we can get.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "RussianEnglishTranslation",
      "created_time": "September 08, 2023, 12:06:50 PM",
      "body": "Quote from: @sriyan on September 07, 2023, 04:00:56 AMThese days lot of users farming airdrops using multiple wallets. So the criteria will be difficult for this year. 2020 - Airdrops for all. No criteria2021 - $10K-30K per account. It has some criteria. (Eg: DYDX, Paraswap, Uniswap, 1Inch)2022 - less complicated criteria(Eg: Aptos, Optimism)2023 - some complicated criteria(Eg: Arbitrum). But this is like 2021. (Starknet coming soon)2024 - We will waiting for the very complicated criteria due to a lot of users. Otherwise, the allocation will be small. (Eg: Zksync, Layerzero)Q Blockchain has an incentive program launching this month. It's likely to be as profitable as the Uniswap drop. They have a waitlist on their twitter page. I already signed up but it's cool if you don't, more APR for me.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tokeweed",
      "created_time": "September 08, 2023, 12:39:24 PM",
      "body": "Quote from: @sriyan on September 07, 2023, 04:00:56 AM2024 - We will waiting for the very complicated criteria due to a lot of users. Otherwise, the allocation will be small. (Eg: Zksync, Layerzero)Having lots of users is fine.  Bottom line there should be as much users as possible in using and testing these different projects and protocols.  But the problem is there are users who want to cheat the airdrop by making multiple accounts and some even hire the services of click farms to game a lot of volume.  :/  And what dev team wants their network to have a lot cheaters who don't use or won't really care about the project?Anyway, Layer Zero is working with Nomis to filter their network from bots and cheats.You could check your eligibility with Nomis if you're grinding for a Layer Zero airdrop.https://nomis.cc/layerzero",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "poodle63",
      "created_time": "September 10, 2023, 12:23:28 AM",
      "body": "Quote from: GreatArkansas on September 08, 2023, 02:11:37 AMI remember the early days of this airdrop, where you can receive a lot of airdrops it does not matter if it is shitcoin or not because some of them are worthy and can make you quite good money.Over time, airdrop has improved especially these days, where sometimes you can't cheat anymore. They already have strong way to identify if someone is cheating, like this sybil address thing.thats true the sybil method of identifying cheaters are quite great ways to keep the reward allocated for real participants from being sliced away like that.moreover more and more airdrops nowadays are enforcing stricter qualification in which gonna force many of their participants to do all the task available the only thing that they did wrong is that they rarelyreveal the real allocated token for airdrops and early participants that has finished the task, imagine doing all these complicated task for a whole year and get rewarded a dollar.this is why allocated token for airdrop should be revealed early.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "libert19",
      "created_time": "September 10, 2023, 03:52:50 AM",
      "body": "You are missing ICO era 2017-'18 where there were lot of airdrops, literally shitcoins, still they would fetch you few hundred to thousands dollars. Quote from: @sriyan on September 07, 2023, 04:00:56 AM2020 - Airdrops for all. No criteriait was not 'no criteria', it was very simple requirement like even one trade on dex would make you qualify. Uniswap was the one starter of retrospective airdrop trend and you only had to trade/lp there once to be eligible.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jossiel",
      "created_time": "September 10, 2023, 03:51:00 PM",
      "body": "That's a good summarization of the airdrops that has happened for all of these years. Soon, I think that these projects will be wiser around.As you've mentioned about having some balance and criteria, I think that many of them will have that for the next trend so it's not actually a new trend.It will become a repetitive trend wherein only those actual risk takers will be rewarded with the amounts they put on their projects.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "shinratensei_",
      "created_time": "September 10, 2023, 10:22:45 PM",
      "body": "Quote from: libert19 on September 10, 2023, 03:52:50 AMYou are missing ICO era 2017-'18 where there were lot of airdrops, literally shitcoins, still they would fetch you few hundred to thousands dollars. Quote from: @sriyan on September 07, 2023, 04:00:56 AM2020 - Airdrops for all. No criteriait was not 'no criteria', it was very simple requirement like even one trade on dex would make you qualify. Uniswap was the one starter of retrospective airdrop trend and you only had to trade/lp there once to be eligible. thats true i feel like in 2017-2018 its golden era of airdrops, even though year after that there are indeed so many airdrops thats coming from really good project and as a result there are many massive rewards from these project but it cant be denied that in 2017 following airdrop is so dead simple, added with the fact that there are so many forked coins that just giving away their coins making people rich for no reason at all and to be eligible just need to hold some coins and thats it you can get instant thousand of dollars from these forked coins.right now most airdrops are just for the purpose of getting free marketing by the devs even more so the shitcoin devs, they quite literally taking advantage of creating airdrop so that they don't even need to pay for marketing and call it a day.really different compared to back then.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tvplus006",
      "created_time": "September 10, 2023, 11:04:34 PM",
      "body": "Quote from: poodle63 on September 10, 2023, 12:23:28 AM...the only thing that they did wrong is that they rarelyreveal the real allocated token for airdrops and early participants that has finished the task, imagine doing all these complicated task for a whole year and get rewarded a dollar.this is why allocated token for airdrop should be revealed early.Very rarely do we hear statements from the team that the work of early users will be rewarded, and as a rule, only weak projects that have a very small budget do this. As for major projects, here we see that the team denies the upcoming airdrop until the last day. So there is no guarantee that there will be an airdrop, not a sale, in which you will be given the right to buy a certain number of coins, as it was with SUI.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o48o",
      "created_time": "September 17, 2023, 10:06:56 PM",
      "body": "Quote from: @sriyan on September 07, 2023, 04:00:56 AMThese days lot of users farming airdrops using multiple wallets. So the criteria will be difficult for this year. 2020 - Airdrops for all. No criteria-cut-I am not sure what \"No criteria\" airdrops you are referring to, but all the airdrops i've seen had some criteria. At minimum it was wallet activity, where you hold some coins, or used some platform with your wallet. Playing with NFTs payed lot for me in airdrops later on. Especially with platforms that are already having users like eth can be rewarded just by holding some erc20 or er721 tokens by dropping some other tokens to them. But even them you often had to know how to retrieve them, as they wouldn't drop those for doing nothing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bluebit25",
      "created_time": "September 19, 2023, 02:20:48 AM",
      "body": "Quote from: @sriyan on September 07, 2023, 04:00:56 AMThese days lot of users farming airdrops using multiple wallets. So the criteria will be difficult for this year. 2020 - Airdrops for all. No criteria2021 - $10K-30K per account. It has some criteria. (Eg: DYDX, Paraswap, Uniswap, 1Inch)2022 - less complicated criteria(Eg: Aptos, Optimism)2023 - some complicated criteria(Eg: Arbitrum). But this is like 2021. (Starknet coming soon)2024 - We will waiting for the very complicated criteria due to a lot of users. Otherwise, the allocation will be small. (Eg: Zksync, Layerzero)To put it more simply, through airdrops we can see that people's interest in crypto is increasing, and that people know about the opportunities that can bring rewards, causing competition to increase. Overall assessment of previous and future airdrop programs, the amount of money that projects are willing to pay to supporters is really not much different, and it is up to users to avoid and try to perfect themselves. Skills are used to get priority from projects, and the criteria given are just to eliminate unqualified people or sybils.I still have a stance on the airdrop environment, it does more harm than good, and the hype about it causes many people to blindly follow tasks that they think can meet their own criteria project's will.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "wxa7115",
      "created_time": "September 19, 2023, 02:45:52 AM",
      "body": "Quote from: asriloni on September 08, 2023, 01:27:27 AMThe metrics used by the project developer to determine which users are eligible for the airdrop will always be changed, as they have their own matrics. It's still quite impossible to predict it accurately but the only thing that i know since a long time ago if user who used the platform or blockchain developed by the developers will always be eligible for the airdrop. That is becoming even more complicated caused by there might be a points mechanism to be implemented in the future of airdrop. I saw that some dexes were airdropping its users through use similiar metrics like what arbitrum did but it's still remain unpredictable. Just always actively using the platform and we will always be eligible for the airdrop. The only key to receiving an airdrop from the developers is always actively using their platforms. that's it. The requirements to get airdrops will keep changing, and this is because if the requirements stayed the same then cheaters will find a way to simulate those requirements, get a bunch of accounts like it and then get a huge number of coins by doing nothing.So those behind the airdrops have no option but to keep changing the requirements so what is described above does not happen, however this has the massive disadvantage that people do not know at all if their efforts will pay off and they may eventually stop trying to get those airdrops.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "adaseb",
      "created_time": "September 19, 2023, 04:04:02 AM",
      "body": "I think the criteria will be similar to what arb did for its airdrop. Another factor can be they check other chains such as Ethereum if the address has been active or if it’s a new address. So if someone is farming they usually won’t do anything on the Ethereum network. And what happens is they might be disqualified or their score reduced as a result.However many users might not use Ethereum for many reasons. One being it’s expensive to perform transactions on ETH. So they might check other chains like ARB or Poly and check for activity. If there is no activity then there is a high chance it’s a farmer.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}