{
  "id": "topic_5417375",
  "title": "TOXIC-ZY",
  "author": "TOXIC-ZY",
  "created_time": "October 17, 2022, 04:56:04 AM",
  "content": "Lately it seems that Pi network is growing day by day.  Who can touch Bitcoin on the Pi network?  Many say that the Pi Network will overtake Bitcoin.  I had a bit of a laugh when I heard about the Bitcoin leak.  Bitcoin is the number one coin in cryptocurrency.  I don't think comparing any coin to Bitcoin is anything but silly.  But what is your opinion?  If anyone has an idea about pi network, please let me know.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5417375",
  "comments": [
    {
      "author": "buyerfryer",
      "created_time": "October 17, 2022, 06:44:32 AM",
      "body": "Quote from: TOXIC-ZY on October 17, 2022, 04:56:04 AMLately it seems that Pi network is growing day by day.  Who can touch Bitcoin on the Pi network?  Many say that the Pi Network will overtake Bitcoin.  I had a bit of a laugh when I heard about the Bitcoin leak.  Bitcoin is the number one coin in cryptocurrency.  I don't think comparing any coin to Bitcoin is anything but silly.  But what is your opinion?  If anyone has an idea about pi network, please let me know. The whole idea behind pi smells fishy. Looks like a scam and nothing more.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mocacinno",
      "created_time": "October 17, 2022, 06:52:01 AM",
      "body": "Quote from: TOXIC-ZY on October 17, 2022, 04:56:04 AMLately it seems that Pi network is growing day by day.  Who can touch Bitcoin on the Pi network?  Many say that the Pi Network will overtake Bitcoin.  I had a bit of a laugh when I heard about the Bitcoin leak.  Bitcoin is the number one coin in cryptocurrency.  I don't think comparing any coin to Bitcoin is anything but silly.  But what is your opinion?  If anyone has an idea about pi network, please let me know.\"the bitcoin leak\"? I'm on bitcointalk allmost every day... Mostly in the technical subforums, but i have never heared about \"the bitcoin leak\"... Can't find any info using google either. What is \"the bitcoin leak\"?I'm not a big fan of those new altcoins... Especially if they start spreading information that they'll take over the biggest and most trusted coin. Always smells fishy to me aswell.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jaered",
      "created_time": "October 17, 2022, 01:51:01 PM",
      "body": "I just took my sweet precious time and scoured the Internet for 'bitcoin leak' and of course, came up empty. Just another buzz word to throw us off the stink of this Pi Network ish. Yes, it stinks, Pi Network has been around for close to 3 years and nothing comes up of it, apart from the Mainnet launch which hasn't changed much",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "glendall",
      "created_time": "October 17, 2022, 02:29:58 PM",
      "body": "Quote from: TOXIC-ZY on October 17, 2022, 04:56:04 AMLately it seems that Pi network is growing day by day.  Who can touch Bitcoin on the Pi network?  Many say that the Pi Network will overtake Bitcoin.  I had a bit of a laugh when I heard about the Bitcoin leak.  Bitcoin is the number one coin in cryptocurrency.  I don't think comparing any coin to Bitcoin is anything but silly.  But what is your opinion?  If anyone has an idea about pi network, please let me know.is this project still available? The last time I followed was still in the mainet stage, has there been any progress?By the way, you are indirectly comparing bitcoin with the PI you mean,stop dreaming buddy leave, and look for real and proven ones like doge coins maybe or something else",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Maidak",
      "created_time": "October 17, 2022, 02:50:27 PM",
      "body": "Quote from: TOXIC-ZY on October 17, 2022, 04:56:04 AMLately it seems that Pi network is growing day by day.  Who can touch Bitcoin on the Pi network?  Many say that the Pi Network will overtake Bitcoin.  I had a bit of a laugh when I heard about the Bitcoin leak.  Bitcoin is the number one coin in cryptocurrency.  I don't think comparing any coin to Bitcoin is anything but silly.  But what is your opinion?  If anyone has an idea about pi network, please let me know.It's a scam coin, even Pi is worse than a shitcoin in our market. If I remember correctly, Pi has been in development for more than 5 years and until now it has not been traded on any exchange, not even a junk exchange. It's worse than meme coin because meme has trading volume, and for Pi, it's nothing but the illusion of pi fans. It can't even compare to meme, never compare it to bitcoin, there is no such thing as a free lunch, be careful with Pi or you will regret it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TribalBob",
      "created_time": "October 17, 2022, 02:57:01 PM",
      "body": "for the umpteenth time I read a thread like this, and it never stops I will also say the pi network is a scam,can't believe the OP gave an empty opinion about the bitcoin leak, out of nowhere the source did the OP get,logically 3 years running there is no progress, and only ends in mainet  without any clarity",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitkanu",
      "created_time": "October 17, 2022, 03:00:58 PM",
      "body": "Scam tokens with so many dumb supporters that being very delutional to overtake bitcoin. It's better for those people to realize the fact if that's a scam coin and no more. We have been very familiar with your coin. That's a scam coin and it's already proven. It's better if you read this https://bitcointalk.org/index.php?topic=5237735.0 I know that if you are only shilling your scam coin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Apocollapse",
      "created_time": "October 17, 2022, 03:51:58 PM",
      "body": "Pi network is scam since there's no way for legit coins or tokens can be mined via phone, moreover a phone with a low spec CPU can mine Pi network without any problem lol, this is a red flag.From discovered until right now Bitcoin has never been leaked, a centralized sites that has a Bitcoin inside the sites is the one which actually been leaked or hacked. Previously 51% attack is a hot topic in Bitcoin, but it's high unlikely will happen due to difficulty has rise up and another one is quantum computing, but the fact is quantum computing still not able to break Bitcoin security.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "romero121",
      "created_time": "October 17, 2022, 04:26:13 PM",
      "body": "Different tactics have been used to promote a project. It is same as that of the MLM, because more the referral more will be the coin getting mined. As it is free to mine, just through an application it has got 50+ million application downloads. This could've brought good revenue to the developers. Pi network had its roadmap and updates, but there is nothing on the lineup. This makes it a completely a scam.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "d3nz",
      "created_time": "October 17, 2022, 05:22:43 PM",
      "body": "Quote from: TOXIC-ZY on October 17, 2022, 04:56:04 AMLately it seems that Pi network is growing day by day.  Who can touch Bitcoin on the Pi network?  Many say that the Pi Network will overtake Bitcoin.  I had a bit of a laugh when I heard about the Bitcoin leak.  Bitcoin is the number one coin in cryptocurrency.  I don't think comparing any coin to Bitcoin is anything but silly.  But what is your opinion?  If anyone has an idea about pi network, please let me know.This is obviously a scam and tricking people into that they get a huge profit-earning PI on their app. PI mining app has running ads and even if you turn off the ads, it will still run in the background without you knowing. Much better to avoid this kind of tactic since you are just making them rich and mining on the app is not really happening, you are just getting an airdrop.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rhomelmabini",
      "created_time": "October 17, 2022, 05:26:01 PM",
      "body": "Quote from: TOXIC-ZY on October 17, 2022, 04:56:04 AMI don't think comparing any coin to Bitcoin is anything but silly.  But what is your opinion?  If anyone has an idea about pi network, please let me know.Total silliness. My opinion is that Pi Network just wanted to steal your identity given that their system was kinda shady at its best. The idea is that you should stay away with it, it has been said that they'll release mainnet by Dec 2021 and here we are, nothing yet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mpamaegbu",
      "created_time": "October 17, 2022, 05:47:49 PM",
      "body": "Quote from: TOXIC-ZY on October 17, 2022, 04:56:04 AMMany say that the Pi Network will overtake Bitcoin.Funny, indeed. Do you know how many tokens/coins that have been rumoured to overtake Bitcoin? If I get to collect a dollar each time that claim is made, I would've been in substantial wealth by now. Well, for your information Pi is not a reality (that's putting it mildly, anyway) and it's likely it would end that way after stressing people and giving them false hope. There were others like TBC and BTCs which were rumoured to be the next BTC. They disappeared overnight 😆",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dothebeats",
      "created_time": "October 17, 2022, 05:57:45 PM",
      "body": "This scam has been going on for years. People don't really get anything from the pi network. At best, they are giving their personal info for free with hopes of getting some Pi coins and its value shooting up someday (which isn't going to happen anyway). Lots of tokens have been created with absurd takes on how they will topple bitcoin down, but not a single one of them ever did. Some came close (ETH) but still isn't enough to take down bitcoin's dominance.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "avikz",
      "created_time": "October 17, 2022, 06:06:10 PM",
      "body": "Quote from: TOXIC-ZY on October 17, 2022, 04:56:04 AMLately it seems that Pi network is growing day by day.  Who can touch Bitcoin on the Pi network?  Many say that the Pi Network will overtake Bitcoin.  I had a bit of a laugh when I heard about the Bitcoin leak.  Bitcoin is the number one coin in cryptocurrency.  I don't think comparing any coin to Bitcoin is anything but silly.  But what is your opinion?  If anyone has an idea about pi network, please let me know.Pi network is a scam business. Tell me one simple thing, if a coin is available for free using your mobile phone, can you tell me how on earth it would have value? Or how on earth someone will pay for it? If you understand this, you will understand that Pi network will never succeed.If  by any chance Pi network gets listed in exchanges, the owner will simply sell of their holdings at the first go and leave the market. Also why do they need our KYC?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "KingsDen",
      "created_time": "October 17, 2022, 07:03:59 PM",
      "body": "Quote from: Jaered on October 17, 2022, 01:51:01 PMI just took my sweet precious time and scoured the Internet for 'bitcoin leak' and of course, came up empty. Just another buzz word to throw us off the stink of this Pi Network ish. Yes, it stinks, Pi Network has been around for close to 3 years and nothing comes up of it, apart from the Mainnet launch which hasn't changed much I have known about Pi network even before knowing this forum. I was introduced with a referral link to keep mining, that Pi will overtake bitcoin in the future.I minned for a short time because of my ignorance and also because of the saying \"no one knows the pregnancy that carries a King\"But at a certain time, I stopped mining and forgot about the project. I removed everything from my phone, I was like, if this be an opportunity let it slide.Later on I now became aware of this forum, then my eyes opened about fake coins and kyc things. There is no doubt they have a very large community, but the project owners have started using the community for advertisement and other things making money from it.I don't really know when the project will become a reality but I know it will not have an effect to be compared to Eth or Bnb let alone BTC.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hamza2424",
      "created_time": "October 17, 2022, 07:13:59 PM",
      "body": "What... Pi is on BTT what the heck broo. Its really unbelievable I thought the newbies on BTT are far more mature than the whatsapp group posters but you proved me totally wrong dude.Now when i speak or write Pi is scamming my fingers and vocal says ohh noo again. dude Pi is a perfect ponzi scam as you can ee their KYC is unavailable after years of mining and waiting and bro really i won't even be surprised if i see one post that Pi started its trading officially and its getting massive pumps it will be scam for me on that time too as Shib was and its not even close to shib hype..",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TOXIC-ZY",
      "created_time": "October 18, 2022, 09:39:44 PM",
      "body": "Quote from: KingsDen on October 17, 2022, 07:03:59 PMQuote from: Jaered on October 17, 2022, 01:51:01 PMI just took my sweet precious time and scoured the Internet for 'bitcoin leak' and of course, came up empty. Just another buzz word to throw us off the stink of this Pi Network ish. Yes, it stinks, Pi Network has been around for close to 3 years and nothing comes up of it, apart from the Mainnet launch which hasn't changed much I have known about Pi network even before knowing this forum. I was introduced with a referral link to keep mining, that Pi will overtake bitcoin in the future.I minned for a short time because of my ignorance and also because of the saying \"no one knows the pregnancy that carries a King\"But at a certain time, I stopped mining and forgot about the project. I removed everything from my phone, I was like, if this be an opportunity let it slide.Later on I now became aware of this forum, then my eyes opened about fake coins and kyc things. There is no doubt they have a very large community, but the project owners have started using the community for advertisement and other things making money from it.I don't really know when the project will become a reality but I know it will not have an effect to be compared to Eth or Bnb let alone BTC. Even if Bitcoin, Ethereum, BNB are not equivalent to them, the price of each pie is two or five dollars.  But then it will be very good.  And if they do scam then there will be no talk about this coin.  But no matter what, some people still find that Bitcoin will go closer to it.  But they didn't stop dreaming about it.  Let's see how far the network can go in the future.  Or in a few days everything will be gone.  After a few days if it is seen that there is no coin in cryptocurrency called Pi Network.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitbollo",
      "created_time": "October 18, 2022, 09:55:09 PM",
      "body": "PI network is not a crypto coin. is just some random number in a database. literally a non-sense. no exchange, no mining, no transfers.... nothing....it's also a big risk providing data to them, there is an entire discussion/topic created by Leviathan.007 that summarize all threats behind this project https://bitcointalk.org/index.php?topic=5237735.0I will not trust something like this, and of course these \"numbers\" will never make you earn any real amount of money. It's a while we are talking about them and it's still the same \"non-sense\" without any development or any real-use case.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitcoin_Arena",
      "created_time": "October 18, 2022, 10:03:13 PM",
      "body": "Quote from: TOXIC-ZY on October 17, 2022, 04:56:04 AMLately it seems that Pi network is growing day by day.  Who can touch Bitcoin on the Pi network? Pi Network?You mean the scam coin that you can \"mine\" on your phone that isn't even designed to mine anything? Growing in what terms?Quote from: TOXIC-ZY on October 17, 2022, 04:56:04 AMMany say that the Pi Network will overtake Bitcoin.Many lied to you that the Pi Network will overtake Bitcoin",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}