{
  "id": "topic_5468326",
  "title": "DdmrDdmr",
  "author": "DdmrDdmr",
  "created_time": "September 27, 2023, 04:26:45 PM",
  "content": "Quizás sea a anecdótico, quizás una muestra de la realidad, quizás algo más, pero es curioso como esta semana me ha sucedido lo mismo en hilos distintos en Meta: respondí con base a un sendos scripts de usuario ya existentes que me sonaban, busqué los casos, y lo refleje en un sus respectivos posts. Me ha sucedido hoy con este post y hace un par de días con este otro post.En ambos casos, otros partícipes apuntan nuevamente a la misma solución sin percatarse de que ya estaba respondido en los mismos términos más arriba.Supongo que nos puede pasar a todos (casi seguro que a mí me ha sucedido, aunque suelo intentar ver el flujo del hilo primero) …",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5468326",
  "comments": [
    {
      "author": "Don Pedro Dinero",
      "created_time": "September 28, 2023, 02:42:10 AM",
      "body": "Yo entiendo que me habrá pasado también alguna vez, por eso procuro responder en hilos cortos, en las primeras páginas. Entonces sí que leo las respuestas. Me encanta sobre todo responder en hilos que no tienen más de una página en ese momento, además porque puedes responder más rápido. Hay otras veces que veo un hilo que me parece interesante y tiene pongamos 7 páginas ya, y lo que hago es leer la primera y la última.Lo primero que viene a la mente es que esto pasa en este foro porque aquí se cobra por escribir, y bla, bla, bla, pero si miras otros foro también pasa, a no ser que seas el creador o alguien muy implicado en la discusión, que la sigue página a página. Si cogemos uno de los hilos 'serios' de forocoches por ejemplo:¿Es el Xiaomi 13T + tablet Pad 6 por 659 euros un CHOLLAZO?A no ser que seas un freaky de los móviles o el OP lo normal es mirar la primera página y si tienes algo que decir ir a la última.Aunque los casos que comentas son de hilos cortos y de una sección seria como Meta, donde los que comentan se supone que son foreros de calidad. Me imagino que el incentivo por hacer X posts semanales también influye. Si vamos a hilos de muchas páginas de Bitcoin Discussion y Gambling ahí mucha gente que comenta en hilos de muchas páginas no lee a penas nada del hilo.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Porfirii",
      "created_time": "September 28, 2023, 04:49:33 AM",
      "body": "Lo mismo: intento participar en hilos de reciente creación siempre que es posible, en los que hay \"algo que decir\". En los más largos, si participo, intento dar alguna respuesta original, creativa, out of the box, con el riesgo de repetirme, pues el tiempo es escaso y no me leo, digamos, 20 páginas de un tema en profundidad, sino el hilo en diagonal (hago lo mismo con muchos textos precisamente por eso, economía, aún a riesgo de pasar por alto algo importante).Supongo que generalmente, no obstante, mis respuestas son en su mayoría pertinentes, pero es práctica generalizada, por generar actividad en una cuenta o cumplir con algún cupo, escribir por escribir.Me ha pasado muy recientemente en un hilo sobre posibilidad versus probabilidad, en el que tuve que contestar a un miembro (y no me gusta llamar la atención) que su comentario era totalmente contrario al sentido del hilo y de la discusión hasta el momento. Supongo que es mejor eso a que el foro se muera, pero queda muy desvirtuado.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DdmrDdmr",
      "created_time": "September 28, 2023, 07:11:33 AM",
      "body": "Quote from: Don Pedro Dinero on September 28, 2023, 02:42:10 AM<…> Si vamos a hilos de muchas páginas de Bitcoin Discussion y Gambling ahí mucha gente que comenta en hilos de muchas páginas no lee a penas nada del hilo.Sí, lo mismo que reflejaba en el OP me ha sucedido en unas cuantas ocasiones en Bitcoin Discussion, y que tenga fresco en la mente, el macro hilo sobre El Salvador. Allí, al ser un hilo de actualidad evolutiva, lo lógico es leerse los posts precedentes para continuar con la deriva del hilo (partiendo de la base que se tiene cierto contexto general). Aun así, recuerdo haber visto algo similar a lo que posteaba siendo replicado un par de posts más abajo en varias ocasiones. \"Is what there is\".Traía el caso de Meta en el OP, al ser una sección donde hay gente con un perfil más senior, y donde se suele ser más conocedor del savoir faire implícito del foro.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "famososMuertos",
      "created_time": "September 28, 2023, 05:20:22 PM",
      "body": "Quote from: DdmrDdmr on September 28, 2023, 07:11:33 AM..//..::,,Sí, lo mismo que reflejaba en el OP me ha sucedido en unas cuantas ocasiones en Bitcoin Discussion, y que tenga fresco en la mente, el macro hilo sobre El Salvador. Allí, al ser un hilo de actualidad evolutiva, lo lógico es leerse los posts precedentes para continuar con la deriva del hilo (partiendo de la base que se tiene cierto contexto general). Aun así, recuerdo haber visto algo similar a lo que posteaba siendo replicado un par de posts más abajo en varias ocasiones. \"Is what there is\".Traía el caso de Meta en el OP, al ser una sección donde hay gente con un perfil más senior, y donde se suele ser más conocedor del savoir faire implícito del foro.Precisamente en ese hilo, El Salvador, norte, le llevaba el \"hilo\" (bis) pero lo \"abandone\" en su seguimiento, porque se ha perdido esa continuidad narrativa necesaria que podrías encontrar en ese tipo de hilo en particular en los últimos post, para seguir en la conversa del día a día que muy bien puede tener ese hilo, pero no es así, se va de atrás para delante (o viceversa) y cada quien participa en lo que bien le cae decir, como por ejemplo; \"bien por El Salvador que adopto bitcoin\", en su ùltima 300 página,  Pero en definitiva, como mencionas en el otro post, seguramente todos pasamos por ahí.Por eso creo que el uso de citar es tan recurrente en algunos usuarios, saben que tiene 200 post en un determinado hilo, y quieren salvar el 201 haciendo una cita o la cita 58 dentro de ese mismo hilo.Edit:Luego de haber hecho clic en \"save\" y leer de nuevo el post, siento que estoy haciendo algo que también sucede, creo que en mis palabras he dicho lo que en concreto ya dijo Ddmr...sorry,",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}