{
  "id": "topic_5416294",
  "title": "NotATether",
  "author": "NotATether",
  "created_time": "October 07, 2022, 10:08:14 AM",
  "content": "I have Bisq running on my system now, but the interface is slightly intimidating so I haven't done much besides making a wallet backup and setting a password (and of course I will write down the seed phrase as well).I was wondering if there are any tutorials out there for operating Bisq like you would operate an crypto exchange account. Assuming you only want to trade BTC for other stuff. And how to cash out to banks via P2P trades. And also perhaps best practices for advertising your trades, so that the trade reaches as many potential Bisq traders as possible.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5416294",
  "comments": [
    {
      "author": "dkbit98",
      "created_time": "October 07, 2022, 02:06:38 PM",
      "body": "Quote from: NotATether on October 07, 2022, 10:08:14 AMI was wondering if there are any tutorials out there for operating Bisq like you would operate an crypto exchange account. Assuming you only want to trade BTC for other stuff. And how to cash out to banks via P2P trades. And also perhaps best practices for advertising your trades, so that the trade reaches as many potential Bisq traders as possible.You can find almost anything you need related with Bisq exchange on their Wiki page, and they released additional videos on their official Bisq youtube channel.Starting with new version 2.0 Bisq is going to make major redesign, so we can expect to see major changes in guides and tutorial.This changes suppose to make navigation and everything in Bisq much easier for newbies, and I already posted some early screenshots before.If you don't find answers on wiki, you can try asking them on Bisq community channels, official forum, reddit or matricx:https://bisq.wiki/Main_Pagehttps://www.youtube.com/channel/UCDrHtlIlYfdRx4Gr-MV8NrA",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "n0nce",
      "created_time": "October 07, 2022, 04:48:01 PM",
      "body": "It's actually relatively simple.[1] Start it up; it connects to the Bisq network (P2P through Tor) and the Bitcoin network.[2] Set up a fiat payment method under Accounts. This is kept solely on your own machine and this account 'ages' over time to get higher trade limits.[3] Go to the Buy or Sell tab, depending on whatever you want to do. (buy or sell BTC, that is)[4] Take an offer that you like and follow the steps.Basically, whenever someone takes an offer, a multisig transaction is created between buyer and seller with the security deposits and trade amount (so the trade amount is 'locked in') and then the buyer is instructed to pay with fiat.When they've done it, they signal it to the seller who shall check if they got the payment. If it got through, they must confirm, which broadcasts a spending transaction that sends back the security deposits and gives the buyer the trade amount.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Agbe",
      "created_time": "October 13, 2022, 07:25:19 PM",
      "body": "Quote from: NotATether on October 07, 2022, 10:08:14 AMI have Bisq running on my system now, but the interface is slightly intimidating so I haven't done much besides making a wallet backup and setting a password (and of course I will write down the seed phrase as well).I have been seen Bisq in the forum for sometime but was not having the mindset to go through it but today I decided to glance through \"what is Bisq all about before thinking of using it. And when I read Bisq, it is nice to try. But before I start to try or using it, I will like to know some vital things about the software. 1. is the installation and the registration in the software require internet or it can be run and register on offline?2. does Bisq software accept other currencies apart from USD? Because from my research I saw only usd with btc exchange3. will I buy the software key before the registration? and finally3. can you please provide the link to download the software because  I don't want to download the fake one and be scammed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DireWolfM14",
      "created_time": "October 13, 2022, 09:09:04 PM",
      "body": "Quote from: Agbe on October 13, 2022, 07:25:19 PMI have been seen Bisq in the forum for sometime but was not having the mindset to go through it but today I decided to glance through \"what is Bisq all about before thinking of using it. And when I read Bisq, it is nice to try. But before I start to try or using it, I will like to know some vital things about the software. 1. is the installation and the registration in the software require internet or it can be run and register on offline?2. does Bisq software accept other currencies apart from USD? Because from my research I saw only usd with btc exchange3. will I buy the software key before the registration? and finally3. can you please provide the link to download the software because  I don't want to download the fake one and be scammed.1. The software can be installed offline (after downloading) but it needs to be connected to the internet to see offers or have your offers visible to others.  It's worth noting that the software connects to peers over Tor network.2. You can trade almost any Fiat currency for BTC, not just USD.  There are plenty of digital payment methods that work well with Euros.  One in particular, Revolut can be used to convert many Fiat currencies to Euro, which may give you more flexibility if your national currency only has a few offers.3. The software is free to download and install.  Fees are charged when you take an offer or create an offer.4. Below I've listed a couple of links, one to the projects official site, their github page, and the ann thread here on the forum:https://bisq.network/https://github.com/bisq-network/bisqhttps://bitcointalk.org/index.php?topic=5230289.0",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "n0nce",
      "created_time": "October 13, 2022, 10:01:39 PM",
      "body": "Quote from: Agbe on October 13, 2022, 07:25:19 PM1. is the installation and the registration [emphasis mine] in the software require internet or it can be run and register on offline?Do note that there is no registration. There are no accounts, no KYC, no servers. It's just a program running on your (and other people's) computers. If I place a Bitcoin buy offer on my PC, your software will pick it up after a while and display it to you. Then you can decide to take that offer and we do this trade person-to-person / peer-to-peer.Quote from: DireWolfM14 on October 13, 2022, 09:09:04 PMQuote from: Agbe on October 13, 2022, 07:25:19 PM2. does Bisq software accept other currencies apart from USD? Because from my research I saw only usd with btc exchange2. You can trade almost any Fiat currency for BTC, not just USD.  There are plenty of digital payment methods that work well with Euros.  One in particular, Revolut can be used to convert many Fiat currencies to Euro, which may give you more flexibility if your national currency only has a few offers.Do keep in mind that Revolut was recently hacked and massive amounts of customer data was leaked. If you can use a different payment method, I'd recommend that.The current markets can be viewed on this webpage (and in the application):https://bisq.markets/marketsIt includes lots of currencies like Japanese Yen, New Zealand Dollars, Hong Kong Dollars, Indian Rupees, or South African Rand.Quote from: Agbe on October 13, 2022, 07:25:19 PM3. will I buy the software key before the registration? and finally3. can you please provide the link to download the software because  I don't want to download the fake one and be scammed.The software is free! Official URL is always https://bisq.network/ and the downloads can be found either on https://bisq.network/downloads/ or on their GitHub page where the full open-source code is released, as well: https://github.com/bisq-network/bisq/releases/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DireWolfM14",
      "created_time": "October 14, 2022, 12:07:23 AM",
      "body": "Quote from: n0nce on October 13, 2022, 10:01:39 PMDo keep in mind that Revolut was recently hacked and massive amounts of customer data was leaked. If you can use a different payment method, I'd recommend that.Wow, that is a troubling development.  Luckily I have plenty of offers in my national currency through other payment methods, but I do have a mostly dormant Revolut account.  Unfortunately this kind of thing is getting so common, even big banks have had leaks, Wells Fargo has had three in the last 5 years alone.  Obviously it's possible to do all one's transactions without a bank account, but being able to pay my mortgage with bitcoin sure would be nice.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "n0nce",
      "created_time": "October 14, 2022, 12:12:42 AM",
      "body": "Quote from: DireWolfM14 on October 14, 2022, 12:07:23 AMQuote from: n0nce on October 13, 2022, 10:01:39 PMDo keep in mind that Revolut was recently hacked and massive amounts of customer data was leaked. If you can use a different payment method, I'd recommend that.Wow, that is troubling development.  Luckily I have plenty of offers in my national currency through other payment methods, but I do have mostly dormant Revolut account.  Unfortunately this kind of thing is getting so common, even big banks have had leaks, Wells Fargo has had three in the last 5 years alone.  Obviously it's possible to do all one's transactions without a bank account, but being able to pay my mortgage with bitcoin sure would be nice.Sometimes there's sadly no way around using a bank, but if possible, I try to avoid exchanging for fiat altogether. For instance, if I can order something on Amazon or another website that has gift cards on https://www.bitrefill.com/, I use that. If there's a shop accepting BTC directly (even if the price may be slightly higher), I order there.With regards to choosing a bank that won't be hacked, I can't give any advice, but I suspect that there are large differences in security budget allocation, jurisdictions (whether it's punished to get customer data leaked), credibility and such. It's possible that a European bank has much tighter guidelines in terms of privacy due to GDPR, but I'm not sure about that.Funny side fact: Revolut was founded in the UK in 2015, when they were still in the EU. Now they're obviously not anymore, so GDPR doesn't apply to them anymore, either.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DireWolfM14",
      "created_time": "October 14, 2022, 12:55:11 AM",
      "body": "Quote from: n0nce on October 14, 2022, 12:12:42 AMSometimes there's sadly no way around using a bank, but if possible, I try to avoid exchanging for fiat altogether. For instance, if I can order something on Amazon or another website that has gift cards on https://www.bitrefill.com/, I use that. If there's a shop accepting BTC directly (even if the price may be slightly higher), I order there.Even bitrefill collects personal data, as described in their privacy policy.  I haven't used them, nor do I have an account, but I suspect the data they require depends largely on the services you request.  I don't suspect they need much to for purchasing giftcards, but I imagine they would need your real name and address to pay bills, not to mention your account number for the service provider the payment is be made.The ideal scenario would be for most service providers and retailers to start accepting bitcoin directly.Quote from: n0nce on October 14, 2022, 12:12:42 AMWith regards to choosing a bank that won't be hacked, I can't give any advice, but I suspect that there are large differences in security budget allocation, jurisdictions (whether it's punished to get customer data leaked), credibility and such. It's possible that a European bank has much tighter guidelines in terms of privacy due to GDPR, but I'm not sure about that.But what does that really provide if a breach has already happened?  I understand that banks are more likely to spend more on network security due to certain regulations, but that only goes so far.  Leaks can happen in so many different ways, getting hacked is only one of them.  I suspect like most laws and regulations, these are largely intended to punish those who are found violating them, but can't really do much to prevent breaches.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "n0nce",
      "created_time": "October 14, 2022, 01:05:02 AM",
      "body": "Quote from: DireWolfM14 on October 14, 2022, 12:55:11 AMQuote from: n0nce on October 14, 2022, 12:12:42 AMSometimes there's sadly no way around using a bank, but if possible, I try to avoid exchanging for fiat altogether. For instance, if I can order something on Amazon or another website that has gift cards on https://www.bitrefill.com/, I use that. If there's a shop accepting BTC directly (even if the price may be slightly higher), I order there.Even bitrefill collects personal data, as described in their privacy policy.  I haven't used them, nor do I have an account, but I suspect the data they require depends largely on the services you request.  I don't suspect they need much to for purchasing giftcards, but I imagine they would need your real name and address to pay bills, not to mention your account number for the service provider the payment is be made.They can pay your bills? I didn't know about that; only using gift cards without any account.Quote from: DireWolfM14 on October 14, 2022, 12:55:11 AMThe ideal scenario would be for most service providers and retailers to start accepting bitcoin directly.That's absolutely true!Quote from: DireWolfM14 on October 14, 2022, 12:55:11 AMQuote from: n0nce on October 14, 2022, 12:12:42 AMWith regards to choosing a bank that won't be hacked, I can't give any advice, but I suspect that there are large differences in security budget allocation, jurisdictions (whether it's punished to get customer data leaked), credibility and such. It's possible that a European bank has much tighter guidelines in terms of privacy due to GDPR, but I'm not sure about that.But what does that really provide if a breach has already happened?  I understand that banks are more likely to spend more on network security due to certain regulations, but that only goes so far.  Leaks can happen in so many different ways, getting hacked is only one of them.  I suspect like most laws and regulations, these are largely intended to punish those who are found violating them, but can't really do much to prevent breaches.After the fact, well if they get hacked once, probably will get hacked again, no?  And as a general step of precaution / information to anyone reading and thinking about opening another bank account. Always think twice about this kind of stuff.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DireWolfM14",
      "created_time": "October 14, 2022, 01:16:50 AM",
      "body": "Quote from: n0nce on October 14, 2022, 01:05:02 AMAfter the fact, well if they get hacked once, probably will get hacked again, no?  And as a general step of precaution / information to anyone reading and thinking about opening another bank account. Always think twice about this kind of stuff.Yeah, it's not like a lightning strike, lol.  I agree that thinking twice about \"accounts\" in general...  I think the best way to operate is to keep a minimal footprint.  The fewer organizations that have your personal data stored on their servers the more secure that data is likely to be.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Agbe",
      "created_time": "October 15, 2022, 11:16:20 PM",
      "body": "Quote from: n0nce on October 13, 2022, 10:01:39 PMThe current markets can be viewed on this webpage (and in the application):https://bisq.markets/marketsIt includes lots of currencies like Japanese Yen, New Zealand Dollars, Hong Kong Dollars, Indian Rupees, or South African Rand.But Nigerian Currency (Naira) was not found in the list, so how am I sure that I can see the Nigerian Currency in the main software? And why Nigerian Currency is not among the listed ones? Because of this omission  in most of the sites and softwares I asked the question that if other currencies are also found in the software and now I did not see the currency I belong to. so what should I do now? And also the software is not downloading in my PC, it is written \"Failed-Needs authorization\". What should I do again? or is it that source you provided for me to download is not supported by my system?When I clicked on the notification. This is what I got.Quote“Needs authorization”This error means you don't have permission to download the file.To fix the error, contact the website or server owner, or try to find the file on a different site.Does that mean I do not have the permission to download the software? or my country is not allowed?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "n0nce",
      "created_time": "October 15, 2022, 11:33:08 PM",
      "body": "Quote from: Agbe on October 15, 2022, 11:16:20 PMQuote from: n0nce on October 13, 2022, 10:01:39 PMThe current markets can be viewed on this webpage (and in the application):https://bisq.markets/marketsIt includes lots of currencies like Japanese Yen, New Zealand Dollars, Hong Kong Dollars, Indian Rupees, or South African Rand.But Nigerian Currency (Naira) was not found in the list, so how am I sure that I can see the Nigerian Currency in the main software? And why Nigerian Currency is not among the listed ones? Because of this omission  in most of the sites and softwares I asked the question that if other currencies are also found in the software and now I did not see the currency I belong to.Oh, that's a pity. Then I'm pretty sure it's not currently supported. You could try hopping into https://bisq.chat/ and ask them if it's planned and if so, when it will be added.You could also try opening a thread about it on https://bisq.community/.A quick search over there revealed the following, though:Quote from: https://bisq.community/t/bisq-v1-5-4-released/10183Remove NGN (Nigerian Naira) as their central bank blocked TransferwiseApparently, NGN was implemented, but after a change by your central bank, people couldn't send or receive money from abroad anymore, so it was pointless to keep the trade pair in the app. But as a local, you surely know more about this and may be able to get it listed again. It would be great if you could figure out whether those payments are working again and explain more details to the Bisq team.Quote from: https://github.com/bisq-network/bisq/pull/4976#issue-771463613I tested it with setting that currency, doing offers and trades,then remove it and continue the trades.Offers with NGN cannot be taken anymore.For now, it seems to me that (as DireWolfM14 explained) you may be able to bypass that by exchanging NGN for another fiat currency (for example through Revolut) and then buying Bitcoin with that.Quote from: Agbe on October 15, 2022, 11:16:20 PMso what should I do now? And also the software is not downloading in my PC, it is written \"Failed-Needs authorization\". What should I do again? or is it that source you provided for me to download is not supported by my system?When I clicked on the notification. This is what I got.Quote“Needs authorization”This error means you don't have permission to download the file.To fix the error, contact the website or server owner, or try to find the file on a different site.Does that mean I do not have the permission to download the software? or my country is not allowed?No, this seems like a local issue of your PC or browser. I don't recognize the error message, but maybe try downloading from GitHub instead:https://github.com/bisq-network/bisq/releases/tag/v1.9.5Here you have all the steps for getting started: https://bisq.network/getting-started/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DireWolfM14",
      "created_time": "October 16, 2022, 12:43:34 AM",
      "body": "Quote from: Agbe on October 15, 2022, 11:16:20 PMAnd also the software is not downloading in my PC, it is written \"Failed-Needs authorization\". What should I do again? or is it that source you provided for me to download is not supported by my system?When I clicked on the notification. This is what I got.Quote“Needs authorization”This error means you don't have permission to download the file.To fix the error, contact the website or server owner, or try to find the file on a different site.Does that mean I do not have the permission to download the software? or my country is not allowed?I agree with n0nce, this sounds like an issue with local privileges of one form or another.  It could be you may not be logged into an account that has local admin privileges.  There may also be restrictions from the local network; for example, some public wifis will restrict downloads of files over a certain size.  I don't know what OS you use, but the .deb file is over 210 megabytes, which isn't huge but it's worth considering.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pmalek",
      "created_time": "October 16, 2022, 06:48:40 AM",
      "body": "Quote from: Agbe on October 15, 2022, 11:16:20 PMBut Nigerian Currency (Naira) was not found in the list, so how am I sure that I can see the Nigerian Currency in the main software? I am not familiar with how it works in Nigeria and what restrictions you guys have over there, but can you accept foreign currencies and open a US dollar account for example? After you get the USD, convert it to Naira with your bank or an exchange office. Unrelated to Bisq but in situations where my local fiat currency is not supported by a site or service provider, I can always take EUR or USD. Having a stash of USD proved quite useful in recent times as the EUR lost a decent amount of value against the USD and I took advantage of a favorable exchange rate.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Agbe",
      "created_time": "October 16, 2022, 09:09:25 AM",
      "body": "Quote from: DireWolfM14 on October 13, 2022, 09:09:04 PMhttps://bisq.network/Quote from: n0nce on October 15, 2022, 11:33:08 PMNo, this seems like a local issue of your PC or browser. I don't recognize the error message, but maybe try downloading from GitHub instead:https://github.com/bisq-network/bisq/releases/tag/v1.9.5Here you have all the steps for getting started: https://bisq.network/getting-started/I finally downloaded it from the link DireWolfM14 provide but I am still have some issues to open the software in my PC. Quote from: Pmalek on October 16, 2022, 06:48:40 AMQuote from: Agbe on October 15, 2022, 11:16:20 PMBut Nigerian Currency (Naira) was not found in the list, so how am I sure that I can see the Nigerian Currency in the main software? I am not familiar with how it works in Nigeria and what restrictions you guys have over there, but can you accept foreign currencies and open a US dollar account for example? After you get the USD, convert it to Naira with your bank or an exchange office. Unrelated to Bisq but in situations where my local fiat currency is not supported by a site or service provider, I can always take EUR or USD. Having a stash of USD proved quite useful in recent times as the EUR lost a decent amount of value against the USD and I took advantage of a favorable exchange rate.    I don't know how to open dollar account or EUR account but if you can tell me the steps I will be very happy. Thanks",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o_e_l_e_o",
      "created_time": "October 16, 2022, 09:44:30 AM",
      "body": "What version of Windows are you using, and is it up to date? A quick web search suggests this .dll is part of the Microsoft Visual Studio (Visual C++) package. Make sure this is installed and up to date. I don't use Windows, but I assume this can be done through some sort of package manager or update manager? If not, you can grab it from here apparently: https://www.microsoft.com/en-us/download/details.aspx?id=52685In terms of NGN, there is an open issue to support Paga, which you might be familiar with: https://github.com/bisq-network/growth/issues/268",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Agbe",
      "created_time": "October 16, 2022, 11:25:31 AM",
      "body": "Quote from: o_e_l_e_o on October 16, 2022, 09:44:30 AMWhat version of Windows are you using, and is it up to date? A quick web search suggests this .dll is part of the Microsoft Visual Studio (Visual C++) package. Make sure this is installed and up to date. I don't use Windows, but I assume this can be done through some sort of package manager or update manager? If not, you can grab it from here apparently: https://www.microsoft.com/en-us/download/details.aspx?id=52685In terms of NGN, there is an open issue to support Paga, which you might be familiar with: https://github.com/bisq-network/growth/issues/268I am using Windows 7 version. Though I just formatted the windows last month but I have installed all softwares, apps that are needed to operate in the system and also I have run drivers pack in the system both online and offline. I will try the Microsoft link you have provided to see if it can work. If there is any other way to fixed this errors for me to install the software please help me out. I really want to install the software. n0nce please can you send me the link to download wasabi?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o_e_l_e_o",
      "created_time": "October 16, 2022, 11:34:26 AM",
      "body": "Quote from: Agbe on October 16, 2022, 11:25:31 AMI am using Windows 7 version.That's probably your issue then. Mainstream support for Windows 7 ended 7 years ago. It is an outdated and insecure OS. You should strongly considering upgrading at least to Windows 10, although obviously Linux would be a better choice all round for both security and privacy.Quote from: Agbe on October 16, 2022, 11:25:31 AMn0nce please can you send me the link to download wasabi?Why do you want to use Wasabi? In case you are unaware, they are pro-surveillance and pro-censorship and cooperate with blockchain analysis. I would steer well clear of their software.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pmalek",
      "created_time": "October 16, 2022, 11:37:37 AM",
      "body": "Quote from: Agbe on October 16, 2022, 09:09:25 AMI don't know how to open dollar account or EUR account but if you can tell me the steps I will be very happy. Thanks I think you misunderstood me. I wasn't talking about opening EUR/USD accounts in Bisq, I meant open a foreign currency account in your local bank where you can accept foreign currencies to it instead of the local Nigerian fiat. After that, you can trade BTC for USD since Naira isn't supported. Quote from: Agbe on October 16, 2022, 11:25:31 AMn0nce please can you send me the link to download wasabi? I don't see the connection between Bisq and Wasabi, but nevertheless, you can get it from https://wasabiwallet.io/. The downloads page can be accessed from the button at the top right. I hope you have a 64-bit processor. I think that's a requirement for Wasabi, but I am not entirely sure. I would advice you to upgrade your OS to at least Windows 10. Win 7 is abandoned and doesn't receive security updates anymore.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}