{
  "id": "topic_5417448",
  "title": "DdmrDdmr",
  "author": "DdmrDdmr",
  "created_time": "October 17, 2022, 06:00:30 PM",
  "content": "Sin más preámbulo, la previsión:QuoteBitcoin took 6 months to get 1000 users; 5 years to find 1 million users. Today, 13.8 years from inception, it has 300m+ users, 4% of the world. At current growth rates, 1 billion users will be hit in the next 3 years. That's 12% of the world.Ver: https://twitter.com/woonomic/status/1580258488684400640Lo primero que uno se pregunta es de dónde saca los datos. Mirando en su Twitter, el indica que los obtiene del informe siguiente (3rd Global Cryptoasset Benchmarking Study – Cambridge Centre for Altenative Finance): https://enterprise.press/wp-content/uploads/2022/02/Cambridge-crypto-2021-study.pdfVer: https://twitter.com/woonomic/status/1580268155988897792El informe es de septiembre 2020, por lo que ya tiene más de dos años de antigüedad. En la sección 4 de la página 44, habla sobre el número de usuarios. Las notas a pie de página hablan de la metodología (notas 51 y 52). En dichas notas indica que no se incluyen datos sobre las wallets autocustodiadas, lo cual es una gran omisión numérica. No es mi intención entrar a fondo en la metodología ahora mismo (creo que ya lo hice hace tiempo, pero no lo localizo), pero aun dando por buenas las cifras (que no las doy), el informe habla de tenedores de activos cripto, y no sólo de bitcoin. Mira que lo pone claro …Luego entiendo que ha hecho una regla de tres, cogiendo las cifras de la gráfica de la página 44, donde el número de usuarios se multiplica por tres entre el 2018 y 2020. Si lo hacemos, para el 2022 saldrían 291M de usuarios y para el 2025 más de 1.000 millones. Algo así es como debe haber derivado las que cita en su Tweet.En estadística, si tienes datos con error, al encadenar procesos basados en estos datos, como la extrapolación lineal que ha hecho, lo que haces es amplificar el error. Aquí, reitero que sin entrar (aún) en la metodología de Cambridge, la de Woo peca de tomar el todo (criptoactivos) por la parte (bitcoin). Eso como arranque …",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5417448",
  "comments": [
    {
      "author": "Hispo",
      "created_time": "October 17, 2022, 07:05:47 PM",
      "body": "Quote from: DdmrDdmr on October 17, 2022, 06:00:30 PM...Luego entiendo que ha hecho una regla de tres, cogiendo las cifras de la gráfica de la página 44, donde el número de usuarios se multiplica por tres entre el 2018 y 2020. Si lo hacemos, para el 2022 saldrían 291M de usuarios y para el 2025 más de 1.000 millones. Algo así es como debe haber derivado las que cita en su Tweet.En estadística, si tienes datos con error, al encadenar procesos basados en estos datos, como la extrapolación lineal que ha hecho, lo que haces es amplificar el error. Aquí, reitero que sin entrar (aún) en la metodología de Cambridge, la de Woo peca de tomar el todo (criptoactivos) por la parte (bitcoin). Eso como arranque …Siempre se tienen más opciones para la predicción del comportamiento de una función a futuro. Se pueden utiliza los datos para construir la curva Gaussiana de la función y hacer una desviación desde la mediana un número de unidades estándar para aumentar la fiabilidad de la predicción, convirtiendo la función en algo más conservadora.Algo más difícil y fastidioso es irse con una función a trozos o quizá asumir otro modelo que no sea lineal, pero creo que con el primer ajuste debería ser suficiente para hacerse una idea en el mediano plazo.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "seoincorporation",
      "created_time": "October 18, 2022, 02:07:08 AM",
      "body": "Es de esas ocasiones en en las que el autor interpreta los datos a placer y los manipula a su favor, pero como bien dices, arrastrar un error solo desemboca a que este crezca. Y mientras leía tu artículo recordé esa publicación sobre el % de mujeres que usan bitcoin. Si aun lo recuerdan el universo de mujeres era demasiado pequeño como para sacar un promedio en un país.Muy interesante el artículo colega, seguiré investigando mas por mi lado.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "d5000",
      "created_time": "October 18, 2022, 05:12:25 PMLast edit: December 23, 2022, 10:39:58 PM by d5000",
      "body": "He ojeado un poco el estudio de Cambridge, es en general muy interesante ... ya tocaría una actualización para 2022, ¿no? (si es de septiembre de 2020 y el estudio anterior se hizo en 2018, se podría deducir que pronto veremos una nueva edición y podremos corroborar los números estimados).Lo que me llamó la atención es que el número que estima Woo para la actualidad (300 millones de usuarios ... hay que corregirlo: de criptoactivos, no de Bitcoin) es bastante cercano a la estimación del estudio de crypto.com para comienzos de 2022 (295 millones). Por ende, con todo los derivados, tokens y NFTs incluidos me puedo imaginar que el número no debería estar tan lejos de la realidad. Para Bitcoin exclusivamente, crypto.com estima 170 millones.Igual para estimar el número futuro se deben tener en cuenta los ciclos de Bitcoin. Del período observado entre el segundo y el tercer estudio (2018-20) los dos últimos años ya eran parte de un ciclo alcista. Es decir, basado en los tiempos de los ciclos de precios, extrapolar el crecimiento hasta principios/mediados de 2022 sería válido.Para 2022, sin embargo, personalmente estimo un crecimiento algo menor, por la situación inédita de los mercados luego del brote inflacionario mundial debido a la guerra de Ucrania. Puede ser que este año hasta veamos un estancamiento en el número de usuarios crypto, con la excepción del mundo de los NFT que vive actualmente un auge en el mundo del deporte y se verá beneficiado por el Mundial de fútbol en noviembre. Y como no sabemos como se comportarán los mercados en 2023, no sabemos aún si este año se retomará el crecimiento explosivo al que estamos acostumbrados en el mundo cripto, o si se prolonga la fase bajista/de estancamiento con bajo crecimiento en usuarios.Por tal razón me parece prematura la estimación de Woo, pero no imposible de alcanzar (si se retoma la senda alcista a más tardar en 2023). Pero sería el número de usuarios de todos los criptoactivos, y Bitcoin probablemente en este momento tendrá entre 500 y 700 millones.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DdmrDdmr",
      "created_time": "October 18, 2022, 05:48:57 PM",
      "body": "El cuarto informe también pensaba que estaría al caer, viendo las fechas de los últimos dos informes. No obstante, el primer informe parece ser de (abril ?) 2017, por lo que nos rompe el patrón de extrapolación de la fecha estimada … Leyendo un tanto los comentarios al respecto en el Twitter de Woo, que cuando hay polémica son siempre interesantes, hay uno que me ha hecho gracia por su simpleza visual:Ver: https://twitter.com/DiligentNinja7/status/1580269407515086848(Léase en clave de la extrapolación de los datos realizada por Woo sobre la adoptación de bitcoin del Tweet reflejado en el OP)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}