{
  "id": "topic_5420986",
  "title": "DdmrDdmr",
  "author": "DdmrDdmr",
  "created_time": "November 14, 2022, 06:29:07 PM",
  "content": "Es de aquellas noticias que apetece leer por cuanto supone poner coto a una banda de estafadores con criptomonedas. Por otro lado, uno se da cuenta de cuántos estafadores hay por estos mundos, y de lo míseros que son, amén de la ingenuidad de muchas personas en este terreno, credenciales suficientes para ser carne de cañón como víctimas.El artículo abajo referenciado narra un caso donde contactaron con la víctima por Whatsapp, y la estuvieron explotando a base de supuestas inversiones por un periodo de cuatro años, obteniendo a la postre 500K€ de la víctima. No me cuadran los números del todo del caso de esta señora, pero para más inri, le pidieron 100K€ para recuperar los 400K€ invertidos, en concepto de impuestos. Para colmo, los mismos timadores la contactaron pretendiendo ser abogados que lucharían para que recuperase su dinero, solicitándole 300K€ para ello (esta es la parte que no me cuadra). Total, todo un despropósito.El caso anterior es sólo uno de los múltiples casos llevados a cabo desde las redes sociales y supuestas plataformas de inversión. La organización contaba con decenas de call centers en paises del este, trabajando en uno de ellos 800 personas (¡wtf!). Sólo en España se estiman 17K estafados por esta banda.Como anécdota, la organización llegó a llevar el patrocinio de una de las marcas de los estafadores en el pantalón del Sevilla FC ...Ver: https://www.lavanguardia.com/vida/20221114/8606408/desmantelada-red-criminal-criptomonedas-17-000-victimas-espana.html",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5420986",
  "comments": [
    {
      "author": "Hispo",
      "created_time": "November 14, 2022, 08:18:06 PM",
      "body": "Lo primero que se me viene a la cabeza al leer sobre una red de este tamaño es que es casi imposible que estas puedan llegar a tener estas magnitudes sin apoyo o complicidad de personas en posiciones de poder económico o político. El hecho de que estuviesen las bases de operaciones en el este de Europa me cuadra, históricamente Rusia ha sido muy complaciente con grupos de hackers y scammers, muchos de ellos que se prolongan por años, como fue este caso.Lo peor de todo es que se aprovechan de personas que no tienen idea de como se mueven las cosas en el mundo de las inversiones o los assets digitales como Bitcoin. Tan fácil es para nosotros ignorar y bloquear cualquier \"propuesta de negocio\" en Telegram, pero estas víctimas no se les pasa por la cabeza que hay toda una industria underground dedicada a sacarles el dinero a ellos. Muy lamentable, la verdad, al final solo añade a la estigmatización de Bitcoin. Si ese es el número en España no me quiero ni imaginar como son las cosas aquí en América Latina, en donde a veces la desesperación económica nos lleva a creer en \"milagros\"...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DdmrDdmr",
      "created_time": "November 15, 2022, 08:51:07 AM",
      "body": "En este artículo se cifra la estafa de las criptomonedas de este grupo entorno a los 2400 M de euros, con centenares de miles de afectados a nivel mundial.Se cita algún dato más, como que los estafadores lograban que las víctimas se instalasen software para poder controlar sus ordenadores y cuentas bancarias. También que tenían centenares de páginas web donde te invitaban a invertir desde 250 $/€ en criptomonedas, como puntal de entrada para luego desplumarte. Todo son cosas que ya hemos visto en multitud de ocasiones, pero que en esta ocasión, han logrado dar con los chorizos detrás de las estafas.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Porfirii",
      "created_time": "November 15, 2022, 11:56:51 AM",
      "body": "Gran resumen DdmrDdmr, prácticamente no hacía falta leer el artículo después de leer el post.Lo del Sevilla ya es de traca, pero los 500K estafados a una barcelonesa casi nonagenaria entre otros miles de afectados en el mundo es de esas cosas que si no las veo no las creo. Pero bueno, visto en bitcointalk, hay que creerlo (debería existir un sello de calidad, \"BTCTalk approved\").Hemos relatado aquí unas cuántas veces cómo hemos intentado explicar a nuestros allegados cómo funciona esto del Bitcoin, sin mucho éxito, para que de buenas a primeras vengan estos estafadores y consigan que les confíen todos sus ahorros, sin conocerlos de nada, por whatsapp, cediendo el control de sus ordenadores... es que me resulta tan kafkiano todo...Esto me lleva a la conclusión de que si la ingeniería social funciona tan bien es por algún tipo de sentimiento de autodestrucción/pulsión de muerte inconfesable en la psicología humana. Un buen melón para abrir, aunque se sale un poco del topic crypto específico.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "famososMuertos",
      "created_time": "November 15, 2022, 03:34:46 PM",
      "body": "Solo cuando eres estafado entiendes que era cuestión de tiempo, el timo esta ahí siempre, y el mejor es el que no conocemos hasta que nos pasa, el mejor remedio para el experto o (los que nos creemos) que nunca nos pasara algo así es este tipo de historias.Creo que es solo la equivalencia de las \"vivezas\" existentes en el mundo offline, llevadas al online.Por aquí de donde soy ya hace tiempo esto, hubo una estafa-carne, si puede dar risa, pero tal cual, era una carnicería muy \"Elegante\" de esas que te dan café \"Gratis\" y te sientas en cómodas sillas a esperar, cosas que existen en los super, hiper o mercados hoy en día, pero aquellas carnicería era de solo carnes, elaboraban pedidos especiales, pinchos, brochetas, especiales de parrillas, etc.Un cliente muy asiduo al negocio, afortunadamente, noto lo siguiente; los tipos siempre te pesaban largo, es decir, si pedias un kilogramo te metían un 1.250 kg(por ejemplo, podía ser menos) y la clásica pregunta(ellos, los carniceros), le sirven 250 gramos más, si o no?.Si, no pasaba nada, pero al ser la respuesta, no! ahí estaba la \"jugada\", pues pesaban y sacaban el ticket electrónico que colocaban en un lateral, ya que luego llevan el pedido para envolverle con el plástico y la bandeja (food wrap), en ese proceso era la pregunta, y entonces (al ser no) ahí sacaban el filete de carne, que luego después pesaban nuevamente y colocaban el ticket con el precio de los 1.250 kgs, es decir, asumiendo que su pedido ya cumplía los requerimientos, regresaban con la pregunta \"algo más\"...Este era un sitio frecuentado por gente de clase media alta y que no compra un kilogramo de una sola cosa, aunado a la atención y la \"confianza\" los clientes no revisaban, de hecho los precios de por si ya eran algo de usura, pero un puesto de estacionamiento bajo techo, con un tipo que te dice su carro esta bien cuidado, bienvenido, luego aire acondicionado, café, servicio al cliente, Delivery, etc. es, OK!El tipo logro meter la desconfianza a posterior, tenia contactos y al mismo estilo de como se arma la captura de aquellos que reciben \"sobornos\" o intentan \"extorsión\" por que si, armo un caso con fiscal y todo, la cosa llego a la prensa regional de la época, se corrió la voz y no hay peor cosa en una carnicería que la reputación de la carne que vende, pero tener el \"balanzas malas\" es imperdonable.Y es un clásico, pues hoy en día con las balanzas electrónicos y que generan el ticket de pago, uno podría pensar que el clásico \"robo\" por el pesaje de lo que compras no ocurre, de hecho estas balanzas electrónicas se pueden manipular ellas deberían tener un Sticker certificado por las normas de medición que certifiquen que estas balanzas funcionen correctamente.En los grandes mercados o hiper-mercados esto por lo general están supervisados, pero ve a tu a decirle al carnicero de tu barrio \"esta revisado, normalizado tu balanza?\" nunca más te vende la carne o seguramente te dirá \"next\". Y no deberíamos tener pena, pero la tenemos, nos da vergüenza preguntar y en algunos casos exigir información.Es el caso aquí, que es el punto al que quiero llegar, pues aceptamos que todo esta bien siempre, nos da vergüenza preguntar o hacer las preguntas correctas y si las hacemos nos quedamos con el sticker que seguramente esta vencido, pero solo muestra \"revisado\" no indagamos más y si al caso vamos que importa es carne y es el carnicero de mi barrio, mi zona, si otros compran, todo esta bien.Antes:Hoy:Diferentes tecnologías, mismo objetivo, estafar.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "seoincorporation",
      "created_time": "November 15, 2022, 03:38:45 PM",
      "body": "Personalmente me molesta leer de este tipo de estafas ya que solo manchan el nombre de bitcoin y de las criptomonedas. Muchos creen que es una forma fácil de multiplicar el dinero y la verdad es que puede llegar a serlo, pero aquí el problema es la ignorancia de la gente, en ves de investigar como comprar bitcoin y guardarlo de forma segura se dejan vender la idea de una moneda que será 'El nuevo bitcoin'.Hace 1 año se acercó a mi una amiga platicando me que estaba a punto de invertir en One Coin, y pensaba invertir una cantidad significativa. Y me dio mucha alegría que se acercara a mi ya que pudimos evitar que perdiera sus ahorros invirtiendo en esa estafa.Moraleja, la ignorancia te puede llevar a perderlo todo.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hispo",
      "created_time": "November 15, 2022, 07:35:35 PM",
      "body": "Quote from: DdmrDdmr on November 15, 2022, 08:51:07 AM-snip-Quote from: Porfirii on November 15, 2022, 11:56:51 AM-snip-¿soy el único que pierde algo de fe en la humanidad cuando me entero de que existen personas, muchas personas que les parece perfectamente razonable el dar acceso de esta forma a software malintencionado a sus Pcs y de confiar esta cantidad de dinero a personas completamente desconocidas?Creo que esta clase de situaciones suenan tan surrealistas porque desde nuestro punto de vista la estafa es completamente obvia, pero para estas personas no y estas víctimas pueden ser perfectamente doctores, ingenieros, maestros, no son personas ignorantes en general. Pero vaya que la ignorancia sobre el mundo del internet o como se mueven las cosas en el mundo digital puede ser fatal para la billetera de cualquiera.  Mi recomendación para cualquier persona que no está enterada de como funciona Bitcoin sería que si no está dispuesta a aprender pero igual quiere invertir, se que una a un fondo de inversión de renombre de su país, mejor que estar perdiendo esta cantidad insana de dinero.Quote from: seoincorporation on November 15, 2022, 03:38:45 PM-snip-Bien por ti, espero que mínimo te invitase a una tarta o unos litros de helado luego de verse las noticias de la caída de ese vergonzoso \"proyecto\".",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DdmrDdmr",
      "created_time": "November 16, 2022, 08:48:51 AM",
      "body": "Supongo que, en todo esto, por parte de las víctimas de este tipo de estafas, hay una mezcla de mística de las criptomonedas, cantos de sirena, creencia de que uno se puede forrar rápidamente, ingenuidad, exceso de confianza en terceros, desconocimiento financiero, y probablemente desconocimiento técnico.Si a esto le añadimos que, por ejemplo en España, los tipos de interés para depósitos bancarios están poco por encima del 0%, el cóctel de factores entreabre la puerta a los desconocido con la fe de que las criptomonedas puedan darle unos réditos por encima de cualquier otro producto.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Porfirii",
      "created_time": "November 16, 2022, 01:17:33 PM",
      "body": "Quote from: famososMuertos on November 15, 2022, 03:34:46 PMEs el caso aquí, que es el punto al que quiero llegar, pues aceptamos que todo esta bien siempre, nos da vergüenza preguntar o hacer las preguntas correctas y si las hacemos nos quedamos con el sticker que seguramente esta vencido, pero solo muestra \"revisado\" no indagamos más y si al caso vamos que importa es carne y es el carnicero de mi barrio, mi zona, si otros compran, todo esta bien.De acuerdo con esto, y mala solución tiene. Muchas veces, aunque se tenga la sospecha de que puede haber gato encerrado, tampoco hay manera fácil de \"pillar\" al tendero, que tendrá una o varias respuestas preparadas de antemano. Por otro lado, tampoco creo que una tienda pequeña de barrio, estafando unos céntimos por cliente, llegue a hacer un gran daño. Y, como dices, las grandes cadenas están más vigiladas.Aunque incluso en las tiendas pequeñas sabemos que está mal, allá la conciencia del tendero con sus prácticas. Pero de lo que hablamos en estos posts (que, por desgracia, son frecuentes) es que la tecnología permite estafar grandes volúmenes y a gran escala (no céntimos a unos pocos clientes). De todos modos, la analogía de la báscula está bien traída, al fin y al cabo es tecnología al servicio de la falta de escrúpulos.Quote from: seoincorporation on November 15, 2022, 03:38:45 PMPersonalmente me molesta leer de este tipo de estafas ya que solo manchan el nombre de bitcoin y de las criptomonedas. Muchos creen que es una forma fácil de multiplicar el dinero y la verdad es que puede llegar a serlo, pero aquí el problema es la ignorancia de la gente, en ves de investigar como comprar bitcoin y guardarlo de forma segura se dejan vender la idea de una moneda que será 'El nuevo bitcoin'.Hace 1 año se acercó a mi una amiga platicando me que estaba a punto de invertir en One Coin, y pensaba invertir una cantidad significativa. Y me dio mucha alegría que se acercara a mi ya que pudimos evitar que perdiera sus ahorros invirtiendo en esa estafa.Moraleja, la ignorancia te puede llevar a perderlo todo.  Me suena el caso de One Coin aunque no estoy muy puesto (llevo bastante desinteresado en las alts los últimos años). Sin embargo, y aunque no sea el caso, pues por lo que comentáis acabaron siendo unos estafadores, suele haber un periodo de tiempo en el que los nuevos proyectos crypto empiezan a gestarse, en el que la ventana de oportunidad puede ser enorme. No juzgaría a nadie por querer entrar en el próximo gran proyecto cuando aún está barato, personalmente me hubiera gustado entrar en Ethereum cuando costaba unos céntimos. Pero volvemos a lo mismo, hay que tener en cuenta que no es oro todo lo que reluce, y que en caso de querer arriesgar, es un error como tu amiga hacerlo con una cantidad significativa. Al fin y al cabo, si va a ser el próximo gran proyecto, con un poco se puede ganar mucho. Pero nos puede la avaricia.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "famososMuertos",
      "created_time": "November 16, 2022, 06:29:14 PM",
      "body": "Quote from: Porfirii on November 16, 2022, 01:17:33 PMQuote from: famososMuertos on November 15, 2022, 03:34:46 PMEs el caso aquí, que es el punto al que quiero llegar, pues aceptamos que todo esta bien siempre, nos da vergüenza preguntar o hacer las preguntas correctas y si las hacemos nos quedamos con el sticker que seguramente esta vencido, pero solo muestra \"revisado\" no indagamos más y si al caso vamos que importa es carne y es el carnicero de mi barrio, mi zona, si otros compran, todo esta bien.De acuerdo con esto, y mala solución tiene. Muchas veces, aunque se tenga la sospecha de que puede haber gato encerrado, tampoco hay manera fácil de \"pillar\" al tendero, que tendrá una o varias respuestas preparadas de antemano. Por otro lado, tampoco creo que una tienda pequeña de barrio, estafando unos céntimos por cliente, llegue a hacer un gran daño. Y, como dices, las grandes cadenas están más vigiladas.Aunque incluso en las tiendas pequeñas sabemos que está mal, allá la conciencia del tendero con sus prácticas. Pero de lo que hablamos en estos posts (que, por desgracia, son frecuentes) es que la tecnología permite estafar grandes volúmenes y a gran escala (no céntimos a unos pocos clientes). De todos modos, la analogía de la báscula está bien traída, al fin y al cabo es tecnología al servicio de la falta de escrúpulos...//::.Es que además del asunto tecnológico no se trata del cuánto ($) no es el asunto aquí ni lo que trato de enfocar es un asunto de continuidad, de seguir en el mismo plano, el no exigir, saca la idea del cuánto ($) una estafa es una estafa el punto es que ese mismo pensamiento se extiende en el tiempo, somos una generación abatida por constantes innovaciones y la formas de estafa no han evolucionado en su simple aplicación que es obtener una ventaja que no conocés, hasta que la entiendes.La gente no asume la aptitud con bitcoin por eso mismo que mencionas, nah son unos centavos...me calo los bancos.Etc.No importa el ejemplo mostrado, o la experiencia contada es la actitud como colectivo, el derecho colectivo crece por las visiones individuales.Hay estafas en proceso o progreso, Uber por ejemplo, es la mejor forma de materializar lo que es un modelo negocio que está estafando sus inversores y a sus conductores, con un modelo de negocio que solo enriquece al dueño.Una simple aplicación está queriendo controlar el transporte público y no reparte sus ingresos ( que no tienen por cierto) entre quiénes ponen su vehículos en uso y son el verdadero \"motor\" de este negocio.Pero que hizo \"organizó\" a todos en torno a una simple idea...pero no la hizo justa. Está es una estafa en desarrollo, ve a trabajar con tu vehículo en Uber...Seguramente muchos dirán, no es mi trabajo principal, y entonces ahí aparecen los centavos que nombras en tu post, o la sensación de que no es una estafa, yo no deterioro mi vehículo ( otra vez los centavos).Espero darme a entender, es una situación que solo se supera como colectivo, exigiendo pero si en el plano individual no estamos atentos, alertas, y en esa misma línea de actitud debemos estar aprendiendo, informándonos.Lo dije al inicio de mi post anterior, ...este tipo de historias  (OP) ayudan incluso al más experto o ese que creé que nunca lo han (van) estafar.Afortunadamente la ignorancia nunca es ¡total! es solo puntual y solo basta un aviso como el título de este post, para empezar a protegerse. Repito nunca se está libre de una potencial estafa, siempre están ahí y si bien es cierto uno puede dejarse estafar caramelos, el asunto es saberlo, es el entrenamiento, si no como empiezas a cuidar los Miles.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hispo",
      "created_time": "November 17, 2022, 03:52:39 AM",
      "body": "Bueno, parece que Noviembre no es para nada el mes de la suerte de mi familia. Luego de un pendrive encriptado con ransomware, ahora resulta que mi uno de mis padres ha perdido dinero debido a un esquema de personificación. Les diré más o menos como funciona, para que estén atentos y les digan a sus familiares, presiento que este método se volverá común (si es que ya no lo es).Básicamente, un amigo de confianza de mi madre sufrió un SimSwap, usaron el número para hacerse con acceso a su Whatsapp y publicar en los estados que estaba vendiendo dólares en efectivo, por un método de pago alterno a transferencia bancaria regular (con nombre y apellido). Whatsapp ya permite utilizarse en varios dispositivos a la vez, lo cual no dio pronta alarma a dueño legítimo del número. Whatsapp también tiene un esquema de 2FA, pidiendo clave cada vez que se registra en un nuevo dispositivo con un número asociado a una cuenta, pero poco los usan, como fue en este caso.Si usan WS les recomiendo activar esa opción y si cierran un intercambio con un conocido en uno de estos servicios de chat, mínimo pidan mensaje de voz y no transferir a cuentas no registradas anteriormente en su lista de banco. Es una clara evolución de la estafa de \"Hola, soy María\". Yo por lo pronto, veré como hacer control de daños a un tercero. Si saben a que me refiero.Saludos.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Silberman",
      "created_time": "November 17, 2022, 11:26:57 PMLast edit: November 20, 2022, 07:42:50 PM by Silberman",
      "body": "Quote from: Porfirii on November 15, 2022, 11:56:51 AMHemos relatado aquí unas cuántas veces cómo hemos intentado explicar a nuestros allegados cómo funciona esto del Bitcoin, sin mucho éxito, para que de buenas a primeras vengan estos estafadores y consigan que les confíen todos sus ahorros, sin conocerlos de nada, por whatsapp, cediendo el control de sus ordenadores... es que me resulta tan kafkiano todo...Esto me lleva a la conclusión de que si la ingeniería social funciona tan bien es por algún tipo de sentimiento de autodestrucción/pulsión de muerte inconfesable en la psicología humana. Un buen melón para abrir, aunque se sale un poco del topic crypto específico.Aunque la escala de la estafa es sorprendente, debo admitir que la facilidad con que las personas acceden a algo como esto es lo que mas me llama la atención, dado que mi carisma y mis habilidades de convencimiento son prácticamente de cero, así que cuando veo a estafadores que pueden lograr algo como esto no deja de impresionarme.Después de todo con ese talento fácilmente podrían ser vendedores o alguna otra ocupación legitima que no requiriese tomar ventaja de la gente, y aun así se decantan por una opción en que le arruinan la vida a las personas.Quote from: Hispo on November 17, 2022, 03:52:39 AM...Pues que malas noticias, las estafas están a la orden del día, yo ni siquiera sabía que WhatsApp permitía esa opción así que pronto activaré la 2FA en mi cuenta.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DdmrDdmr",
      "created_time": "November 18, 2022, 09:24:15 PM",
      "body": "Con un poco de suerte, a estos otros a ver si los pillan y retiran su timo del mercado. Manda webs la porquería que, en ocasiones, retorna Google al buscar noticias del ámbito de las criptomonedas: ni más ni menos que Elon Musk Quantum AI. Nada como mezclar todo lo que suene a moda, empaquetarlo en un nombre, y ponerse las botas a base de timar a la gente.Nota: merece la pena leerse la falsa revisión crítica de la plataforma, para echarse unas risas ...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DdmrDdmr",
      "created_time": "November 24, 2022, 06:50:39 PM",
      "body": "En relación al caso descrito en el OP (caso Forex), la policía catalana (Els Mossos), quien inició la investigación a raíz de las denuncias recibidas, ha abierto una página web para que la gente pueda consultar si una página determinada con la cual puede haber interactuado o invertido, es de las denunciadas en las BDs de la policía, dentro del marco de esta operación.En la citada web constan ni más ni menos que 476 webs fraudulentas ligadas a esta operación, dentro del marco de las estafas a través de supuestas inversiones en criptomonedas. La web no da el listado completo, sino que se ha de introducir la URL y ver si ésta consta o no entre el citado listado.Ver: https://www.lavanguardia.com/local/barcelona/20221124/8619883/catalunya-mossos-crean-buscador-webs-fraudulentas-identificadas-operacion-albania.html",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}