{
  "id": "topic_5402871",
  "title": "david678345",
  "author": "david678345",
  "created_time": "June 16, 2022, 05:29:15 PM",
  "content": "Hi do you have any suggestions on how to get more free crypto with the Coinbase Learn And Earn...I guess the program has an algorithm where you would get more free crypto if you hold or you do staking etc...its just a guess I have..Also can you do trading with the free cyrpto you earn with the coinbase learn and earn program? I got a message that says: you will receive WAMPL only for use in connection with the token function and not for any other investment purpose. I got some free WAMPL and I did set up a stop loss so that WAMPL is now USDT..so not sure if that was allowed?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5402871",
  "comments": [
    {
      "author": "jackg",
      "created_time": "June 16, 2022, 05:47:12 PM",
      "body": "I think it changes based on the coins coinbase wants to market so you don't have to do anything to get more, just click on them when they're available.The tokens you get are yours so yes you can trade with them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OgNasty",
      "created_time": "June 16, 2022, 06:08:28 PM",
      "body": "My take on the Coinbase Learn and Earn is that it is a total scam...  They pay the \"earn\" part out as taxable income last I checked, and they give you $3 in a (usually worthless) currency.  So right off the bat you're on the hook for nearly $1 in taxes.  Then, they charge you something like $2 in fees if you want to sell it.  So even if you're lucky enough to sell immediately before the value crashes, chances are that you won't make anything after taxes and fees.  Their hope is that they stick you with this useless currency, you see the value drop to where fees make it so you can't even sell, then you pony up your own real money to buy more thinking it'll bounce and you can sell.  Then just like that, you're a shitcoiner who is losing money because you got sucked into a trap.TL;DRIt's a trap.  Don't waste your time with that garbage.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jackg",
      "created_time": "June 16, 2022, 06:35:28 PM",
      "body": "Quote from: OgNasty on June 16, 2022, 06:08:28 PMMy take on the Coinbase Learn and Earn is that it is a total scam...  They pay the \"earn\" part out as taxable income last I checked, and they give you $3 in a (usually worthless) currency.  So right off the bat you're on the hook for nearly $1 in taxes.  Then, they charge you something like $2 in fees if you want to sell it.  Ohhhhh I just checked it again and you're right. When I did my first few it paid ~$8, now it looks like it pays anywhere from $1-3 for each coin and they're going to be expensive to sell on normal coinbase (and probably don't all have support on Pro) - as on you'll probably pay half in fees and the spread.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "darkangel11",
      "created_time": "June 16, 2022, 07:04:06 PM",
      "body": "I think I actually got a few USD out of it a year ago but maybe I got lucky with it because everything was pumping. I also \"cheated\" because there are youtube videos of people answering questions so I chose the same answers without paying attention to the videos. It's possible to answer it all in just 1 minute if you do that. Depending on the country that you live in, getting $5 in a few minutes can be worth the trouble. There are still many countries where you earn $1 or less for an hour of work.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husires",
      "created_time": "June 16, 2022, 08:26:10 PM",
      "body": "Coinbase learn & earn is their way to get free advertising as some of newbies are looking for faucets and other free ways to get money so they will use the Coins platform for that.Nobody is going to pay you money to learn so the money they pay you is to distribute worthless tokens and try to pump their price by making you buy more of them.Dont expect any amount more than  40$-60$.Learn the basics of trading, buy some bitcoins, build your trading plan and you will achieve much more with free profit apps.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitMaxz",
      "created_time": "June 16, 2022, 11:45:31 PM",
      "body": "Unlike before they do free satoshis from doing some tasks like verifying email or submitting tasks and got rewarded of around $10 or more. But right now learn and earn is a waste of time I have the graph token until now it is stuck and can't able to trade or exchange for fiat or USDT. If your purpose is to learn to trade you don't need to look for rewards you can learn to trade on other platforms without spending check this link \"Awesome Crypto Trading\" then use the trading simulator included on that link and then test what you learn from that link.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Potato Chips",
      "created_time": "June 17, 2022, 02:09:50 AM",
      "body": "Quote from: david678345 on June 16, 2022, 05:29:15 PMHi do you have any suggestions on how to get more free crypto with the Coinbase Learn And Earn...I guess the program has an algorithm where you would get more free crypto if you hold or you do staking etc...its just a guess I have..I don't think so. From what I understand, it is based on the available supply, set maximum amount per course and the current price of your chosen coin.Quote from: david678345 on June 16, 2022, 05:29:15 PMAlso can you do trading with the free cyrpto you earn with the coinbase learn and earn program? I got a message that says: you will receive WAMPL only for use in connection with the token function and not for any other investment purpose. I got some free WAMPL and I did set up a stop loss so that WAMPL is now USDT..so not sure if that was allowed?If it wasn't allowed, it makes sense for the trade to not push thru... If you're really worried, you may try to contact their support.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Despairo",
      "created_time": "June 17, 2022, 04:05:38 AM",
      "body": "There's no sites will always give you free money by completing simple tasks, most of them only pay on the first launch only and then they will start decrease the prize, the worst is pay with shitcoins who doesn't have any value. This is kind of a bounty, airdrop, faucet etc where they're claiming to give you free money, but it's not worth it for long term or as a job. My suggestion is stay away from that's all and you might be better to earn more money by looking for real job like working on McDonald.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "June 17, 2022, 05:04:39 PM",
      "body": "I do not think that with the current  economic situation Coinbase has a surplus of cash/coins which they may spend generously for clients in the form of gifts or even pay you money for learning, do not forget that all these free things are tools for collecting data from clients and will be shared with third parties So be careful when you deal with one of the free and fast profit methods.I'm not saying that you can't make a profit with Coinbase learn but it won't be very rewarding (that's a nice name to wasting time)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jackg",
      "created_time": "June 17, 2022, 07:50:47 PM",
      "body": "Quote from: hugeblack on June 17, 2022, 05:04:39 PMI do not think that with the current  economic situation Coinbase has a surplus of cash/coins which they may spend generously for clients in the form of gifts or even pay you money for learning, do not forget that all these free things are tools for collecting data from clients and will be shared with third parties So be careful when you deal with one of the free and fast profit methods.I'm suprised they've kept it going for this long and haven't yet started paying less in rewards to people. I'm not sure if they're in some sort of deal with the developers they advertise to give them funds but I'd think that's likely since they're probably not boosting their own reserves anymore (altcoins have crashed quite hard in comparison to both fiat and bitcoin afaik - it's not much of an investment in their portfolio for the future if that coin no longer exists or has no volume in a few years). Quote from: BitMaxz on June 16, 2022, 11:45:31 PMUnlike before they do free satoshis from doing some tasks like verifying email or submitting tasks and got rewarded of around $10 or more. But right now learn and earn is a waste of time I have the graph token until now it is stuck and can't able to trade or exchange for fiat or USDT. I think they still do their money back on your first purchase too which is probably under half the amount you can probably get from learn to earn (if that's still a thing) - but it's a much simpler task.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Potato Chips",
      "created_time": "June 17, 2022, 09:24:46 PM",
      "body": "Quote from: jackg on June 17, 2022, 07:50:47 PMI'm not sure if they're in some sort of deal with the developers they advertise to give them funds but I'd think that's likely since they're probably not boosting their own reserves anymoreCoinbase mentioned they are receiving fees for this so it's highly likely that they are receiving funds for the rewards as well making this one of their source of income that could also bring users to their exchange. I wouldn't be surprised if this promo will last for a long time or stay for good.Quote from: https://www.coinbase.com/earnCoinbase receives fees from asset issuers in connection with creating and distributing asset and/or protocol specific Earn content.Essentially, coinbase users are just viewing ads.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaveF",
      "created_time": "June 18, 2022, 06:35:22 PM",
      "body": "Quote from: Potato Chips on June 17, 2022, 09:24:46 PMEssentially, coinbase users are just viewing ads.Very targeted ads with all the kyc information behind them.Makes you wonder if the more you view the more learn and earn things are shown to you.I watched a couple while waiting for a deposit to confirm and never looked again. Would be interesting to see if people who watched and got their free coins and then bought more coins get more of these ads then people like me who watched them, got some coins and never went back.-Dave",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o_e_l_e_o",
      "created_time": "June 19, 2022, 08:24:20 AM",
      "body": "Quote from: DaveF on June 18, 2022, 06:35:22 PMVery targeted ads with all the kyc information behind them.And this \"Learn and Earn\" nonsense provides them with even more data, as I pointed out to OP previously: https://bitcointalk.org/index.php?topic=5400526.msg60247776#msg60247776. You start withdrawing these \"free\" coins and now you are linking more and more of your addresses and wallets to all the KYC data Coinbase holds about you, which will be monetized, sold, and shared endlessly with dozens of third parties. Quote from: DaveF on June 18, 2022, 06:35:22 PMMakes you wonder if the more you view the more learn and earn things are shown to you.Almost certainly; that's just good business sense. If someone is mindlessly lapping up some stupid trash you are showing them and making you a profit by doing so, then of course you will show them more of said stupid trash.It's really a win-win-win for Coinbase. Shitcoin creators pay them to show these ads, users then pay them trading and withdrawal fees to access these shitcoins, and in the process they collect ever more of your data to sell to third parties.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tabas",
      "created_time": "June 19, 2022, 11:49:41 PM",
      "body": "A summary of all of those explanations, are you willing to sell your data to them just for the sake of that $3-$5 of those tokens? I don't think that you'll like it. Aside from that, it's availability is depending on the location of the user and there are others that don't really have an access on it. And whether you like it or not, you're subject to kyc.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "datguy",
      "created_time": "July 14, 2022, 11:45:39 AM",
      "body": "I don't know guys, I think you are very strict on this topic. Yes, you will not earn much money there, yes, you may expose your addresses and KYC. But let's not forget that this is still made for beginners and those for whom even $20-30 is important. Study coins like GRT a bit, provide graph quiz answers, and get a couple of bucks, for someone looks good. We are talking about cryptocurrency as a world currency, and in many regions of our planet (unfortunately) even $20 is good money. And almost everyone can do it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Strongkored",
      "created_time": "July 15, 2022, 05:37:28 AM",
      "body": "Quote from: datguy on July 14, 2022, 11:45:39 AMI don't know guys, I think you are very strict on this topic. Yes, you will not earn much money there, yes, you may expose your addresses and KYC. But let's not forget that this is still made for beginners and those for whom even $20-30 is important. Study coins like GRT a bit, provide graph quiz answers, and get a couple of bucks, for someone looks good. We are talking about cryptocurrency as a world currency, and in many regions of our planet (unfortunately) even $20 is good money. And almost everyone can do it.I don't think it's too strict, but because everyone has different concerns from you, if you think making money even in small amounts is more important than personal data, then go ahead but if someone thinks otherwise then you can't complain about it, maybe you think revelead personal data is not a problem because you have not faced difficult things because of that then you are wrong because when your personal data is exposed on the internet then it can be used by other people for bad things that can harm you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tabas",
      "created_time": "July 15, 2022, 05:16:09 PM",
      "body": "Quote from: datguy on July 14, 2022, 11:45:39 AMI don't know guys, I think you are very strict on this topic. Yes, you will not earn much money there, yes, you may expose your addresses and KYC. But let's not forget that this is still made for beginners and those for whom even $20-30 is important. Study coins like GRT a bit, provide graph quiz answers, and get a couple of bucks, for someone looks good. We are talking about cryptocurrency as a world currency, and in many regions of our planet (unfortunately) even $20 is good money. And almost everyone can do it.Yes, that's good money but in the modern world today, the KYC that you'll pass to them is that you'll never know if it will also be passed on to other companies that will market. If you haven't noticed it yet, just you sign up to a website and then eventually, you'll receive various marketing spams that you have never reached out to them or even signed up for. Also, those identity that are passed onto them, they could be stolen and be on sale in the dark market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "datguy",
      "created_time": "July 19, 2022, 11:22:37 AMLast edit: July 21, 2022, 12:30:04 PM by datguy",
      "body": "Quote from: tabas on July 15, 2022, 05:16:09 PMQuote from: datguy on July 14, 2022, 11:45:39 AMI don't know guys, I think you are very strict on this topic. Yes, you will not earn much money there, yes, you may expose your addresses and KYC. But let's not forget that this is still made for beginners and those for whom even $20-30 is important. Study coins like GRT a bit, provide graph quiz answers, and get a couple of bucks, for someone looks good. We are talking about cryptocurrency as a world currency, and in many regions of our planet (unfortunately) even $20 is good money. And almost everyone can do it.Yes, that's good money but in the modern world today, the KYC that you'll pass to them is that you'll never know if it will also be passed on to other companies that will market. If you haven't noticed it yet, just you sign up to a website and then eventually, you'll receive various marketing spams that you have never reached out to them or even signed up for. Also, those identity that are passed onto them, they could be stolen and be on sale in the dark market.Of course I understand that. But don't you pass KYC in order to trade on Coinbase or Binance? It's the same thing, after all. Today, these are the two largest exchanges with huge liquidity, DEX will not replace them, which means you will pass KYC anyway.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o_e_l_e_o",
      "created_time": "July 19, 2022, 02:28:25 PM",
      "body": "Quote from: datguy on July 19, 2022, 11:22:37 AMToday, these are the two largest exchanges with huge liquidity, DEX will not replace them, which means you will pass KYC anyway.A DEX will replace them for you if you want it to. I've never so much as registered on any centralized exchange and I've certainly never completed KYC at one, yet I would bet that I buy, sell, trade, and spend bitcoin more than ~99% of the user on this forum. I certainly wouldn't be giving up all privacy for the sake of $20 worth of some shitcoins (never mind the fees I would pay to the centralized exchange just to be allowed to swap that shitcoin in to bitcoin and withdraw the bitcoin), and I'm certainly not letting Coinbase sell my data to a data broker and risk identity theft for $20 of some shitcoins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}