{
  "id": "topic_5501794",
  "title": "tread93",
  "author": "tread93",
  "created_time": "July 02, 2024, 07:09:44 PM",
  "content": "How do you plan to introduce your children to Bitcoin? More importantly what is your long term plan for passing down the wealth to the next gen? Do you plan to make them their own cold storage wallets and start depositing coins onto this instead of say finding a college savings account etc? Or have a diverse mix in many of these baskets? I keep thinking about setting them up for success but I am much too early right now my kids are very young and they wouldn’t begin to even understand Bitcoin for quite a while. But I am curious because I know I should be doing so much more to prepare them for what is to come, hopefully a very well positioned future and inheritance that I can give them. Sometimes I feel that I am doing them a disservice by contributing to a 529 savings plan as opposed to their own Bitcoin storage accounts. Perhaps I should open their own Roth IRA accounts and just contribute to that account and direct the funding to a Bitcoin ETF so I can ensure that they will have had early exposure to Bitcoin and ensure that they all have their own accounts. Sure it’s not the same as pure Bitcoin it’s paper Bitcoin but at least the exposure is there. I still think that passing down the wealth for your heirs with crypto will prove to be very problematic. It’s surely something that could be unevenly distributed & deviated from the wishes of the will since there are no real safeguards in place to ensure each child / beneficiary gets what has been set aside for them, right? I think this will be more of a long term solution that will come down the line, the real issue here is that having such safeguards in place could very well compromise the intent of Bitcoin in the first place. These answers I believe would be achieved through custodial methods, or how else could one achieve this goal??",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5501794",
  "comments": [
    {
      "author": "coolcoinz",
      "created_time": "July 02, 2024, 07:20:35 PMLast edit: July 02, 2024, 07:39:56 PM by coolcoinz",
      "body": "Quote from: tread93 on July 02, 2024, 07:09:44 PMHow do you plan to introduce your children to Bitcoin? More importantly what is your long term plan for passing down the wealth to the next gen? My daughter is still very young, so we have time, at least I hope we do. If I had to come with a plan right this moment I'd probably try to explain to her how bitcoin works and how to safely spend my coins in case I die all of a sudden. It's a rare thing to happen and we usually don't think about such possibility, but I know someone who lost both parents in a car accident. They were coming back from a party in a cab and they both and the driver were killed, so these things do happen. QuoteDo you plan to make them their own cold storage wallets and start depositing coins onto this instead of say finding a college savings account etc? Or have a diverse mix in many of these baskets? I'd do that just to see if she can keep it safe and manage her money, but I'd rather hold on to anything big like as I have years of experience in this. I don't have any other savings apart from bitcoin. All I have is invested in real estate and cars, so if my kids ever need cash they'll have to sell properties or bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Davidvictorson",
      "created_time": "July 02, 2024, 08:21:27 PM",
      "body": "Anytime that this conversation comes up , I will.always say, let kids be kids. We should think that they would miss anything by not learning about Bitcoin at a young age. There is more to their life and development than Bitcoin. Therefore I would not agree to anyone forcing Bitcoin knowledge upon them when they should be taking, music lessons, dance classes, football classes. The only Exception is if the kid show repeated interest in knowing about Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Upgrade00",
      "created_time": "July 02, 2024, 08:55:41 PM",
      "body": "Quote from: tread93 on July 02, 2024, 07:09:44 PMSometimes I feel that I am doing them a disservice by contributing to a 529 savings plan as opposed to their own Bitcoin storage accounts. Why not do both? We don't have the 529 savings plan for education but if it's possible to choose which exact plan to opt for you can change to a more price friendly one and have a personal college saving in Bitcoin. If the kids won't be needing it for another 8+ years, even a small amount of Bitcoin is enough to go a very long wayQuote from: tread93 on July 02, 2024, 07:09:44 PMThese answers I believe would be achieved through custodial methods, or how else could one achieve this goal?? There are many topics where this has been discussed, I can't find them now, but if you search you will get some good ones. There has been a number of custodial services as well as non custodial wallet tools you can use to store Bitcoin for the future generation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lanatsa",
      "created_time": "July 02, 2024, 08:57:05 PM",
      "body": "Im not really that minding much as of now about speaking to them or mentioning about what crypto is since they are still young and it cant be possible that they would really be able to comprehend but on the moment that they would really be reaching out such age or time then pretty sure that everything would really be explained to them accordingly. I wont really be making up that kind of enforcing that they should be looking into crypto when it comes to their savings or whatsoever. All i do want is to share up that awareness on whats its benefits or utility or simply the opportunitythat it could give on some aspect, but of course you shouldnt really be forgetting about the risks involved about it because it wont really be that good if you do miss this one.Theres the perfect time for everything and its something that you would really be needing up to do such thing when that thing arrives. We do have our own approach and plans in life in regarding on sharing up the information about crypto specially into our kids.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ruttoshi",
      "created_time": "July 02, 2024, 09:50:01 PM",
      "body": "I also have this same plans for my kids to pass on my bitcoin to them but what I intend doing is when they are above 12 years, I will start introducing them to bitcoin gradually but only the basic knowledge of bitcoin and as time passes on, they will be interested and learn about it themselves because by then, bitcoin news will be everywhere as digital gold.To pass my bitcoin to my heirs, I will use timelock on their bitcoin so that it is when that time reaches that they can access their bitcoin investment. I think it is safe that way because it is only them that will know this.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "crwth",
      "created_time": "July 02, 2024, 09:54:51 PM",
      "body": "There are a lot of approach that you can do when it comes to your children with Learning about bitcoin But as much as it is important to have financial future and sharing your wealth, it is best to focus on their growth and development with their character.Creating their own wallet and then depositing their continuity would be the ideal way to have your children be involved Bitcoin and somehow Continuously average, the entries that you have. Possibly in the future, it would be profitable.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ojima-ojo",
      "created_time": "July 02, 2024, 11:20:04 PM",
      "body": "If choosing bitcoin as next of kin benefits becomes the case then I will say you be ready to take custody of the child benefit for a long time at least you have to hold the money in bitcoin for the child until he, she is old enough to be thought about bitcoin at least to the extent of how to protect their bitcoin and also be financially discipline.If the above principle have been achieved, then you can pass the bitcoin custody to you next of kin to have total control over the funds, but just as you said this format seems to be risky.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackBoss_",
      "created_time": "July 03, 2024, 02:11:56 AM",
      "body": "Quote from: tread93 on July 02, 2024, 07:09:44 PMHow do you plan to introduce your children to Bitcoin? More importantly what is your long term plan for passing down the wealth to the next gen? The best you can do for your children is nurturing them and educating them. The first task is easy than the second task, but education is key for your children future, not food or how much money you leave to your children as inheritance.If they are educated well, they will have good major and occupation for their future then they can work and get money by themselves. Rich can be achieve by themselves too if they are knowledgeable through education. There are other soft skills but education is a key in all the complex process.Wealth distribution in society will be done naturally, from generation to generation, you don't have to worry about that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Darker45",
      "created_time": "July 03, 2024, 03:49:38 AM",
      "body": "I think the future generation would know Bitcoin as they know of money. There might not even be a need to teach them because they will learn it anyway. You cannot not learn it. Decades from now, Bitcoin is probably a very popular and widely accepted alternative currency.Anyway, I guess it's enough for me to prepare a bright future for my children. Whether I'm preparing Bitcoin for them or real estate assets or a business or stocks doesn't matter much. What matters more than anything else is that I'm doing my part to the best of my abilities to make sure they have a good life.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AprilioMP",
      "created_time": "July 03, 2024, 07:40:25 AM",
      "body": "Quote from: tread93 on July 02, 2024, 07:09:44 PMHow do you plan to introduce your children to Bitcoin? More importantly what is your long term plan for passing down the wealth to the next gen? Do you plan to make them their own cold storage wallets and start depositing coins onto this instead of say finding a college savings account etc? Or have a diverse mix in many of these baskets? Cold wallets are the best place for me and other people who plan long term for education costs and health costs for those who don't have children and wives and for those who already have children and wives.Bitcoin is a legacy that is worth preserving and continuing because Bitcoin is a very valuable asset that can be used by anyone because its value is not the same as fiat currency.I have planned some of the amount of Bitcoin I have for educational purposes, even during this time I have also planned bigger things with Bitcoin for the future.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LogitechMouse",
      "created_time": "July 03, 2024, 08:00:40 AM",
      "body": "Quote from: tread93 on July 02, 2024, 07:09:44 PMHow do you plan to introduce your children to Bitcoin? More importantly what is your long term plan for passing down the wealth to the next gen? Do you plan to make them their own cold storage wallets and start depositing coins onto this instead of say finding a college savings account etc? Or have a diverse mix in many of these baskets? Videos online, and other stuff.I can't say an exact way because I believe that in the future, we might see different and more efficient ways of teaching our kids something and that includes cryptocurrency. Now we are seeing AI being developed at a rapid pace. I mean with the help of AI, we might see another way to introduce Bitcoin to our children. My long-term plan? Just secure my seed phrase, and I've already gave a copy of all of my seed phrases to the one that I trusted the most so that if the worst thing happens to me, at least there's somebody that can teach or at least tell my children that I'm storing some Bitcoins and other assets. Quote from: tread93 on July 02, 2024, 07:09:44 PMI still think that passing down the wealth for your heirs with crypto will prove to be very problematic. It’s surely something that could be unevenly distributed & deviated from the wishes of the will since there are no real safeguards in place to ensure each child / beneficiary gets what has been set aside for them, right? I think this will be more of a long term solution that will come down the line, the real issue here is that having such safeguards in place could very well compromise the intent of Bitcoin in the first place. These answers I believe would be achieved through custodial methods, or how else could one achieve this goal?? If there's somebody around you that's knowledgeable about crypto, passing it will not be that hard because for sure, he/she knows what to do based on what you said as the owner of those assets. Well, there might be instances where some of the heirs will prefer just cash instead of crypto and if that's the case then they just need to convert it. It doesn't need to be passed down as crypto if the heirs don't want it at first place. I don't see passing down problematic. If they want crypto, and they're knowledgeable about it, give it as crypto. If they don't want, give it as hard cash. As for storing, hard wallet is the best so far, but maybe, just maybe we might see a better one in the future.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Apocollapse",
      "created_time": "July 03, 2024, 08:04:03 AM",
      "body": "I will never talk about my wealth to my kids and I don't want them to expose my wealth to them.I will act like a broke person and being very stingy when they ask for money, the most important thing I will teach them is work hard and support what they interested/like to do, if they don't interested with Bitcoin, I will not explain it.It's better for them to build their own wealth rather than knowing if they have money which they can spend it to anything they like.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Catenaccio",
      "created_time": "July 03, 2024, 08:25:56 AM",
      "body": "Quote from: Apocollapse on July 03, 2024, 08:04:03 AMI will never talk about my wealth to my kids and I don't want them to expose my wealth to them.I agree with this educational style and Warren Buffet did not let his children knew about his super wealth..QuoteI will act like a broke person and being very stingy when they ask for money, the most important thing I will teach them is work hard and support what they interested/like to do, if they don't interested with Bitcoin, I will not explain it.It's better for them to build their own wealth rather than knowing if they have money which they can spend it to anything they like.If we give them great fortune, and let them know about this inheritance when they are very young, they will lack of motivation to learn, get an occupation, find job and work as a normal citizen in society.Educate them, keep our wealth in secret and don't tell them about any level of inheritance in time they only need to focus on learning, shaping their own brain, knowledge and characteristic, discipline. When they are educative, matured enough, we are older enough, we can proceed things about inheritance.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tech30338",
      "created_time": "July 03, 2024, 08:45:15 AM",
      "body": "Quote from: tread93 on July 02, 2024, 07:09:44 PMHow do you plan to introduce your children to Bitcoin? More importantly what is your long term plan for passing down the wealth to the next gen? Do you plan to make them their own cold storage wallets and start depositing coins onto this instead of say finding a college savings account etc? Or have a diverse mix in many of these baskets? I keep thinking about setting them up for success but I am much too early right now my kids are very young and they wouldn’t begin to even understand Bitcoin for quite a while. But I am curious because I know I should be doing so much more to prepare them for what is to come, hopefully a very well positioned future and inheritance that I can give them. Sometimes I feel that I am doing them a disservice by contributing to a 529 savings plan as opposed to their own Bitcoin storage accounts. Perhaps I should open their own Roth IRA accounts and just contribute to that account and direct the funding to a Bitcoin ETF so I can ensure that they will have had early exposure to Bitcoin and ensure that they all have their own accounts. Sure it’s not the same as pure Bitcoin it’s paper Bitcoin but at least the exposure is there. I still think that passing down the wealth for your heirs with crypto will prove to be very problematic. It’s surely something that could be unevenly distributed & deviated from the wishes of the will since there are no real safeguards in place to ensure each child / beneficiary gets what has been set aside for them, right? I think this will be more of a long term solution that will come down the line, the real issue here is that having such safeguards in place could very well compromise the intent of Bitcoin in the first place. These answers I believe would be achieved through custodial methods, or how else could one achieve this goal?? I would say don't give much bitcoins for them, let them be and watch them grow, just guide them that's what is important eventually they will figure thing out, kids this days are so intelligent, remember a kid making millions on a shark NFT's, best thing you can share them is you're experience and knowledge about bitcoin, bitcoin will here to stay, eventually if they like crypto like you, they will continue the path you have taken.why i'm emotional when it comes to children, I just want them to live and do what they really love.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DeathAngel",
      "created_time": "July 03, 2024, 09:15:49 AM",
      "body": "It’s a good idea to explain Bitcoin to your kids but maybe you can wait until they are 10 or something, if your personal situation allows it. Set up a test wallet & let them play with sats, they need to know how to send & receive transactions safely. The most important thing is security so you’re going to have to spend a lot of time explaining public & private keys, cold storage, seeds & how important security is. If you plan to leave a lot of money in Bitcoin for their inheritance you’re going to need to really make sure you educate them on Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zanab247",
      "created_time": "July 03, 2024, 10:05:06 AM",
      "body": "Quote from: tread93How do you plan to introduce your children to Bitcoin? More importantly what is your long term plan for passing down the wealth to the next gen?It has been in my mind to teach my unborn children BTC and crypto, so that when they grow up in the society, they will not be struggle to grow financially because there are opportunity in BTC and crypto to grow up financially and materially in the industry.QuoteDo you plan to make them their own cold storage wallets and start depositing coins onto this instead of say finding a college savings account etc? Or have a diverse mix in many of these baskets? No, that is not in my plan to store BTC and crypto in the cold storage wallet for my unborn children, because anything can happen to the market that will make the coins to disappear from the market for other new coins to start spreading to take BTC position and other cryptocurrencies. I'm using BTC investment to generate incomes that will make my unborn children wealthy, financially and materially in the society, which is the reason, I used to take every opportunity in the market to purchase some BTC to add to my portfolio, and wait for 10 or 12 years before I can release them for sale to make millions of dollars that will increase my wealth for my unborn children to live to enjoy for life time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "riantolie",
      "created_time": "July 03, 2024, 10:45:05 AM",
      "body": "That's an interesting topic. I'm not planning to have kids, so at some point, I'll spend all my Bitcoin, but it still was interesting to read the thoughts of other people.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zlantann",
      "created_time": "July 03, 2024, 10:49:29 AM",
      "body": "Quote from: Darker45 on July 03, 2024, 03:49:38 AMI think the future generation would know Bitcoin as they know of money. There might not even be a need to teach them because they will learn it anyway. You cannot not learn it. Decades from now, Bitcoin is probably a very popular and widely accepted alternative currency.I was going through the textbook of my son, and I saw that they had been taught about crypto currency as a type of money. They even discussed the origin of cryptocurrency and explained Bitcoin to a large extent. My son usually hear me talk about Bitcoin with my wife, so he understands that it is money but I intend to explain to him about the investment part of it when he gets to a certain age. My only challenge is the security part of it. He might go and tell his friends that his father has Bitcoin, and we don't know who the relatives of these friends are. QuoteAnyway, I guess it's enough for me to prepare a bright future for my children. Whether I'm preparing Bitcoin for them or real estate assets or a business or stocks doesn't matter much. What matters more than anything else is that I'm doing my part to the best of my abilities to make sure they have a good life.My plans is to set up a wallet for each of my children. Using DCA, I will keep buying and hodling the coin. This will serve as my backup fund to take care of their education when they go to college. But in case of an emergency, when they are at least 18 years old, I will inform them of these wallets and tell them how to access them if I am not around to help them pay their bills.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ronsbit",
      "created_time": "July 03, 2024, 10:55:39 AM",
      "body": "I have had this thought for some time and I decided to do a little accumulation and savings bit by bit as I can invest within my capacity. Although I am yet to marry but I have plans for my kids in the future. I started with just one account with the minimum of $10 worth of bitcoin on a weekly basis.  This is just the first step I decided to take till i get married and start having kids. I will also devote my time to teach them about bitcoin from their tender age so that before they could grow to maturity, they already have idea and knowledge about bitcoin even if they do not show interest, at least let them have the knowledge about bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}