{
  "id": "topic_5465726",
  "title": "Altcoiner007",
  "author": "Altcoiner007",
  "created_time": "September 05, 2023, 10:51:54 AM",
  "content": "Privacy is important when it comes to Cryptocurrency, so why do exchanges like Bitget require KYC (Know Your Customer) for all users, even those who only want to get airdrops? I thought KYC should be for those transacting many Bitcoins, Is it really necessary for everyone?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5465726",
  "comments": [
    {
      "author": "BlackBoss_",
      "created_time": "September 05, 2023, 10:59:45 AM",
      "body": "KYC is not mandatory in all centralized exchanges.No-KYC Exchange Encyclopediakycnot.meMain reason why centralized exchanges apply mandatory KYC, it's by their national regulation and government requires exchanges in that nation to apply mandatory KYC on customers.Another reason is not from governments, regulations but from scam attempt. Scammers will pull their mandatory KYC cards to scam their customers, steal customer fund and run.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaveF",
      "created_time": "September 05, 2023, 11:03:37 AM",
      "body": "Because, for larger exchanges it's also easier.Everyone gets KYC so they don't have to worry about regulators / governments coming back later and forcing them to. It's already done. It also keeps them to a certain extant from dealing with people they should not be. Yes, someone could connect through a VPN and use fake ID, but the CEX can still go back to whatever government agency was asking them about that user with some info and show they at least tried to keep things legit.-Dave",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "September 05, 2023, 11:05:24 AM",
      "body": "Exchanges require KYC in order to stop fraud like stealing other people's bitcoins and cashing them out, money laundering, scams, hacks, and so on. Most countries require an exchange to have specific KYC measures because they are legally allowed to operate there.Although I will say that requiring KYC for very small transactions is a bit of a stretch, as it's not really possible to do much with it in the first place.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hopenotlate",
      "created_time": "September 05, 2023, 11:12:16 AM",
      "body": "Every day more and more countries are implementing regulations related to cryptocurrency exchanges they need to adapt to these regulations and comply with anti-money laundering and counter-terrorism financing  laws, which require the verification their users' identity, not to mention KYC procedures also prevent ecxhanges from being used for illegal activities such as frauds and scams.Also implementing hard KYC requirements makes exchanges gain trust to the eyes of regulators and authorities.Lastly regarding the airdrops purposes : implementing KYC prevents airdrop abusers who creates multiple accounts to get a bigger share of the drop.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Adbitco",
      "created_time": "September 05, 2023, 11:13:25 AM",
      "body": "As the name implies \"centralized exchange\" meaning your details aren't hidden and they could asked for your personal verification passport or whatever that proves you a legal citizen of your country. This is being implemented for transparency and to avoid money laundering by unscrupulous user who may tends to use the exchange for mischief and fraudulent activity. I think with kyc exchanges could or will be able to know their customers if there are financial bad records. However, if you don't like revealing your details then I will urge you to start making use of Decentralized exchange (Swap) if your coin and tokens are being listed over there, this helps in hiding your identity and you remain anonymous.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "September 05, 2023, 11:15:07 AM",
      "body": "Quote from: BlackBoss_ on September 05, 2023, 10:59:45 AMKYC is not mandatory in all centralized exchangesBut it is worth knowing that they can force customers to verify their account at any time. There is nothing better than decentralized exchanges in this regard.Quote from: BlackBoss_ on September 05, 2023, 10:59:45 AMkycnot.meI can see Bisq as the first, that is excellent because it is a decentralized exchange. But I am wondering why Kucoin is still among the list of no KYC exchanges when it is now mandating KYC.Quote from: NotATether on September 05, 2023, 11:05:24 AMExchanges require KYC in order to stop fraud like stealing other people's bitcoins and cashing them out, money laundering, scams, hacks, and so on. Most countries require an exchange to have specific KYC measures because they are legally allowed to operate there.Coins stolen and sent to an exchange and seized does not require KYC, it only require blockchain analyses. Some people are now not hacking people's bank directly, they first use fake KYC and use the money to buy coins on the centralized exchanges. Some people trade conveniently on the centralized exchanges with other people's KYC. Money are laundered in legit businesses and most of the money are in banks.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mia Chloe",
      "created_time": "September 05, 2023, 11:21:11 AM",
      "body": "Many centralized cryptocurrency exchanges require users to complete KYC (Know Your Customer) verification. This is mainly because they must follow government rules to operate legally and to prevent scams and fraudulent activities. These rules are in place to make sure everything is transparent, accountable, and secure in the world of cryptocurrencies. While some exchanges have looser KYC rules, the well-known and trustworthy ones prioritize strict compliance to keep users and regulators happy. On the other hand, decentralized exchanges (DEXs) don't  have KYC requirements because they work differently. So, if you want more privacy and control, you might consider using a DEX as an alternative.You might want to check this thread to see some other non kyc exchanges you can tryCurrent list of exchanges without KYC",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "paid2",
      "created_time": "September 05, 2023, 11:23:30 AM",
      "body": "Quote from: Altcoiner007 on September 05, 2023, 10:51:54 AM Privacy is important when it comes to Cryptocurrency, so why do exchanges like Bitget require KYC (Know Your Customer) for all users, even those who only want to get airdrops? I thought KYC should be for those transacting many Bitcoins, Is it really necessary for everyone?It depends on the market (regulated or not) and on the country. In all cases, CEXs that impose KYC do so to comply with local regulations and thus protect themselves and their legal right to operate in the sector in question.  If not, there are other reasons imaginable: private data is worth money, and CEXs are there purely to make money. For example, Coinbase has been condemned in the past for participating in the resale of their customers' data.If we follow your question to its logical conclusion, it would be better to ask why governments and regulators are so keen on KYC, than to ask why some CEXs apply laws and regulations.I recommend you to read GazetaBitcoin's excellent article, which is very instructive : 12 years later and people still don't know to use Bitcoin nor what it's good for",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bureau",
      "created_time": "September 05, 2023, 11:26:50 AM",
      "body": "Bitget has been doing such policy changes for sometime now. A few months back, for upto 50k, KYC was not mandatory. Then a few days back they again changed their policy and made KYC mandatory for every user. I feel they are using KYC as an instrument to get new users. Earlier they had a signature campaign in the forum when they relaxed the KYC norm. I guess as soon as they hit a target of a certain number of users they abruptly closed the campaign and again made KYC mandatory. CEX as they are centralized are know to use such kind of marketing tricks to gain new users. I remember Bitget relaxed KYC as soon as Kucoin implemented mandatory KYC. It is how churning of users are done by CEX like Bitget. It is better to use a DEX if you are someone who doesn't like going through KYC and please stay away from airdrops. They are a big waste of time after 2019.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "livingfree",
      "created_time": "September 05, 2023, 11:38:54 AM",
      "body": "Quote from: Altcoiner007 on September 05, 2023, 10:51:54 AM Privacy is important when it comes to Cryptocurrency, In every move that we make online, not just in cryptos.Quote from: Altcoiner007 on September 05, 2023, 10:51:54 AMso why do exchanges like Bitget require KYC (Know Your Customer) for all users, even those who only want to get airdrops? I thought KYC should be for those transacting many Bitcoins, Is it really necessary for everyone?They're complying to what's imposed by their government and that's not new these days because almost every exchange is asking about it. Anyway, I think that you're with bitget and despite with this discussion, you're getting the exposure that you're trying to get due to the fact that you've started a discussion where many are interested to be part of.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zaguru12",
      "created_time": "September 05, 2023, 11:39:02 AM",
      "body": "Quote from: Charles-Tim on September 05, 2023, 11:15:07 AMQuote from: BlackBoss_ on September 05, 2023, 10:59:45 AMkycnot.meI can see Bisq as the first, that is excellent because it is a decentralized exchange. But I am wondering why Kucoin is still among the list of no KYC exchanges when it is now mandating KYC.The site/app is currently been rewritten and only few maintenance will done and the new version is where all changes will take effect on. If you have suggestions you can actually send it out to Pluja the confirmed admin of the kycnot.me here on the forum. He had requested that suggestions on listing, delisting and also update should be sent here  https://gitlab.com/kycnot/services/-/issuesThe site/App also has its ANN thread already on the forum and I think by the time the new version comes out we will see the likes of KuCoin been removed there",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Joseph-P",
      "created_time": "September 05, 2023, 11:45:44 AM",
      "body": "Quote from: Altcoiner007 on September 05, 2023, 10:51:54 AM Privacy is important when it comes to Cryptocurrency, so why do exchanges like Bitget require KYC (Know Your Customer) for all users, even those who only want to get airdrops? I thought KYC should be for those transacting many Bitcoins, Is it really necessary for everyone?KYC helps prevent money laundering and illegal activities on CEXs like Bitget. It's a regulatory requirement in many countries to ensure compliance.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "September 05, 2023, 11:52:47 AM",
      "body": "Quote from: Mia Chloe on September 05, 2023, 11:21:11 AMYou might want to check this thread to see some other non kyc exchanges you can tryCurrent list of exchanges without KYCMaybe it can be useful, but Ratimov new thread about centralized no KYC exchanges has been pointed to by BlackBoss_ which contains more exchanges including the one on the old thread which is now locked. It is also worth knowing that they are not just no KYC exchanges, they are centralized no KYC exchanges. Which means the exchanges do not require KYC, but they can force any of their customers to get verified at anytime which can be after the user's coin has been seized.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ultrloa",
      "created_time": "September 05, 2023, 11:54:11 AM",
      "body": "Quote from: Altcoiner007 on September 05, 2023, 10:51:54 AM Privacy is important when it comes to Cryptocurrency, so why do exchanges like Bitget require KYC (Know Your Customer) for all users, even those who only want to get airdrops? I thought KYC should be for those transacting many Bitcoins, Is it really necessary for everyone?Because of regulation.If they want to target global crowd especially on US or strict countries they need to pass some requirements that can make their business legitimate and it includes KYC to their costumers.But if the CEX doesn't care much about global markets and target only certain areas where law is not much strict as first world countries have then some of them doesn't require KYC. Although its good not to submit KYC but you also need to know or consider the risk since its more risky if there's no government regulate those exchange.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PaulPeterPedro",
      "created_time": "September 05, 2023, 11:55:59 AM",
      "body": "Quote from: Altcoiner007 on September 05, 2023, 10:51:54 AM Privacy is important when it comes to Cryptocurrency, so why do exchanges like Bitget require KYC (Know Your Customer) for all users, even those who only want to get airdrops? I thought KYC should be for those transacting many Bitcoins, Is it really necessary for everyone?KYC can be used to recover lost or forgotten passwords on platforms like Bitget. This is because the information collected during KYC can be used to verify the user's identity and confirm that they are the account's rightful owner.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "September 05, 2023, 12:03:53 PM",
      "body": "Quote from: PaulPeterPedro on September 05, 2023, 11:55:59 AMKYC can be used to recover lost or forgotten passwords on platforms like Bitget. This is because the information collected during KYC can be used to verify the user's identity and confirm that they are the account's rightful owner.On the centralized exchanges that I have recovered lost or forgotten password, only your username and email are enough for the recovery. But it can nit help you if you enable 2FA.For 2FAYou will only believe in what they exchanges offer you. On this forum, did you know that you can stake your bitcoin address which can be used to recover you Bitcointalk account if it is hacked. Exchanges can go for something like that, mandating their users to stake a bitcoin address which may not be a funded address, but having access to the private key so that is if 2FA secret code is lost, the person can recover his account back by signing a message with his bitcoin address staked on the exchange. But centralization did not make it work this way.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sokani",
      "created_time": "September 05, 2023, 12:17:26 PM",
      "body": "Quote from: Altcoiner007 on September 05, 2023, 10:51:54 AM Privacy is important when it comes to Cryptocurrency, so why do exchanges like Bitget require KYC (Know Your Customer) for all users, even those who only want to get airdrops? I thought KYC should be for those transacting many Bitcoins, Is it really necessary for everyone?KYC is not compulsory in all centralized exchanges. MEXC, CoinEx and Bybit still operate as a non KYC exchanges but they have a withdrawal limit. Some of these CEXs operate in a country that has lax crypto laws.In most cases before centralized exchanges are given permission to operate in a particular territory, they are required by the government to have a well structured KYC procedure that all customers must undergo. The KYC is a regulatory compliant measure that most centralized exchanges setup to monitor, track and report any suspected activity to the authorities like scam and money laundering.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dragonvslinux",
      "created_time": "September 05, 2023, 12:33:56 PM",
      "body": "It's just to do with fiat currencies that require permission from governments in order to be transacted by a business, in nearly all cases this is with KYC. There are still plenty of crypto to crypto exchanges that don't require any KYC however. This is why many people prefer to use these exchanges, or P2P services, rather than larger exchanges that deal with dollars, pounds, euros, etc.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "September 05, 2023, 12:38:17 PM",
      "body": "To summarize it: most countries' governments require these financial services platforms(exchanges in this case) to demand for AML/KYC — supposedly to have a record of the users to have a trace if ever a scammer/hacker deposits funds to the platform; and if these platforms don't comply, the government shuts them down.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}