{
  "id": "topic_5446117",
  "title": "crypticj",
  "author": "crypticj",
  "created_time": "March 24, 2023, 04:36:42 AM",
  "content": "Hello everyone!Recently I was thinking about BTC payments and I believe that the system is moving towards bitcoin adoption and paying with bitcoin. And it's great! But the problem for me is that anytime I think about paying with BTC I feel somehow uncomfortable. I always remember the guy who spent 30+ bitcoins on pizza and now these bitcoins are worth a fortune. Like I don't want to be this guy and pay with an asset that WILL go up in price. It feels like you paying more for the product from a future perspective. What are your thoughts about this? Personally, I usually try to buy with stablecoins if I have some, it just feels more natural for me. I don't want to touch my BTC while the market is still bad.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5446117",
  "comments": [
    {
      "author": "Solosanz",
      "created_time": "March 24, 2023, 06:02:08 AM",
      "body": "30+ Bitcoins? who's him? I think you're refer to Laszlo Hanyecz where he spend 10,000 Bitcoins for 2 pizza and he was not disappointed for doing it, so why you should care with it?It's your choice if you want to pay with BTC or not, but I believe there's a time where you will convert your Bitcoin to cash because you will need that money in the future, you can't just hold it and not enjoy what you've accumulated so long.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bussybuddy",
      "created_time": "March 24, 2023, 06:21:19 AM",
      "body": "Quote from: crypticj on March 24, 2023, 04:36:42 AMHello everyone!Recently I was thinking about BTC payments and I believe that the system is moving towards bitcoin adoption and paying with bitcoin. And it's great! But the problem for me is that anytime I think about paying with BTC I feel somehow uncomfortable. I always remember the guy who spent 30+ bitcoins on pizza and now these bitcoins are worth a fortune. Like I don't want to be this guy and pay with an asset that WILL go up in price. It feels like you paying more for the product from a future perspective. What are your thoughts about this? Personally, I usually try to buy with stablecoins if I have some, it just feels more natural for me. I don't want to touch my BTC while the market is still bad. You feel uncomfortable right?I also look back at the context of the story you mentioned and we can't make a fair comparison here at the moment. Convenience in use takes precedence, we can hear btc is accepted for payment for some business, and that's great for the practical demonstration of how convenient BTC is. But as more and more people see it as a big asset, it's really inconvenient to trade small and up. So there is no need to force yourself into those frameworks, just do whatever we think there is no barrier here, and for me instead of paying btc directly, replacing it with other crypto also helps push into BTC development.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gallar",
      "created_time": "March 24, 2023, 06:44:37 AM",
      "body": "image source : istockphoto.comif you think like that, then when do you have profit from the bitcoin? when do you use the bitcoin?your thinking is correct, it's possible that in the future bitcoin can exceed price expectations which are more than now, but you have to remember that is a positive prejudice, what if bitcoin in the future goes down more than the current price, what if bitcoin in the future falls down, we don't know what will happen to bitcoin in the future.two possibilities that might happen to bitcoin.bitcoin will continue to grow rapidly with prices that continue to increase, or bitcoin which has decreased for some reason.sometimes we have to dare to make decisions, the most important thing is from our own heart not coercion from others.I hope you are wise in using the bitcoin you have.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MAAManda",
      "created_time": "March 24, 2023, 06:44:44 AM",
      "body": "Quote from: crypticj on March 24, 2023, 04:36:42 AMBut the problem for me is that anytime I think about paying with BTC I feel somehow uncomfortable. I always remember the guy who spent 30+ bitcoins on pizza and now these bitcoins are worth a fortune. Like I don't want to be this guy and pay with an asset that WILL go up in price. It feels like you paying more for the product from a future perspective. What are your thoughts about this? Personally, I usually try to buy with stablecoins if I have some, it just feels more natural for me. I don't want to touch my BTC while the market is still bad. First of all, the person you mentioned is Laszlo, he didn't spend 30+ for a pizza, but 10,000 for 2 pizzas. And the second is, you create a topic, you ask and you've answered it in the same place. If you don't want to pay for something with Bitcoin (BTC) because you don't want to be unlucky like Laszlo who doesn't realize the real value of Bitcoin, well, like you said, use stablecoins. So why else ask about it?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "m2017",
      "created_time": "March 24, 2023, 06:48:28 AM",
      "body": "Well, yes. There is a feeling that by paying with bitcoin now, you are depriving yourself of future profit. Bitcoin has moved away from its original concept of Internet money and has become an investment vehicle. It is wiser to spend cash or stablecoins (than btc), which are not profitable to store due to their depreciation.You are talking about your case, but there are people who store bitcoin for a long time and they have already received their profit, which means they are already winning, and why shouldn't they pay for purchases using btc? Don't wait for them to infinity rise in price of this asset. I believe that there may be enough such people and they can afford to pay bitcoin without worrying about future price increases.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EarnOnVictor",
      "created_time": "March 24, 2023, 06:56:56 AM",
      "body": "I understand your feeling and it's good since you might be careful, sensitive and know the value of Bitcoin as an asset. Well, this shouldn't still stop you from spending your coin as it's not only about investment. Just be sure that you have a sizable amount still left in your wallet for the investment, you should not deprive yourself of good things in life because of it.That said, you need to be patient and speculative, this is by knowing when Bitcoin is on the beraish trend. Spending it at that time will never be an issue, you can as well replenish back your coin when it's becoming bullish again.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rikafip",
      "created_time": "March 24, 2023, 06:59:23 AM",
      "body": "Quote from: crypticj on March 24, 2023, 04:36:42 AMI always remember the guy who spent 30+ bitcoins on pizza and now these bitcoins are worth a fortune. Like I don't want to be this guy and pay with an asset that WILL go up in price. It feels like you paying more for the product from a future perspective. Are you referring to Laszlo Hanyecz who spent 10k bitcoin on two pizzas and you remembered the amount wrong,  or you are talking about some other case?Quote from: crypticj on March 24, 2023, 04:36:42 AMWhat are your thoughts about this? Personally, I usually try to buy with stablecoins if I have some, it just feels more natural for me. I don't want to touch my BTC while the market is still bad. Why not just use fiat instead if you prefer stablecoins for payment?Regarding your question, I felt like you at the beginning when I just started paying stuff with bitcoin as I always had it in back of my head that I might overpay something when bitcoin goes up but after some time I simply start thinking it that way and spending bitcoin when I need to. I will try to avoid big purchases though when bitcoin is down a lot (for example few months ago when it was ~16k) and will use bitcoin for cheaper stuff like VPN or IPTV monthly sub and wait for better times (like now) to start spending.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tbct_mt2",
      "created_time": "March 24, 2023, 07:06:56 AM",
      "body": "Quote from: crypticj on March 24, 2023, 04:36:42 AMWhat are your thoughts about this? Personally, I usually try to buy with stablecoins if I have some, it just feels more natural for me. I don't want to touch my BTC while the market is still bad. To be able to pay something, you must not use all money to invest in Bitcoin or cryptocurrency.I know you can love Bitcoin or cryptocurrency but you must have good management for your finance. If you don't have any stable coin or fiat currency, but all of your fund is in Bitcoin, cryptocurrency you will have to sell them when you need money for payment. You can sell them to stable coin or fiat currency and because you don't have any choice, you might have to sell at lost price.With all de-pegs, bank runs, bankruptcy related to some stable coins, it is safer to store part of your fund in fiat currency, not in stable coin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Questat",
      "created_time": "March 24, 2023, 07:36:16 AM",
      "body": "What makes you uncomfortable and bothered you too much because you are not willing to pay in BTC but rather think about paying it with fiat? Why you should think about the past? It never happens to you actually...If you are not really ready to use BTC as a payment option, then don't go against your will. I feel that you are thinking about what if the price of BTC will grow and you already have used them. In case, make yourself easy, then make a choice to use fiat and keep your BTC for investment purposes only, nothing else.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Outhue",
      "created_time": "March 24, 2023, 07:43:27 AM",
      "body": "I don't feel bad selling my Bitcoin or paying with Bitcoin, if you are a business owner who accepts Bitcoin as a payment solution you will understand, I buy goods with Fiat and sell them to my customers and few of my customers pay me in Bitcoin, whenever I receive Bitcoin I have to sell back to Fiat using the exact initial amount I used to purchase the goods, so that I can return them back to store for sell, I always keep my profits in Bitcoin and this has helped me get my hands of a handful of Bitcoin, if you are feeling bad spending your Bitcoin, you need to find a way to earn more Bitcoin, find a business where you can start accepting Bitcoin, even if you spend Bitcoin you won't be running out of Bitcoin because you are also accepting Bitcoin as payment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Spaceman1000$",
      "created_time": "March 24, 2023, 07:58:08 AM",
      "body": "Paying with Bitcoin is something I will ever be grateful for, it's something of nobility for shops and restaurants to accept bitcoin payment and at such, I don't think doing that should generate a bad feeling.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FatFork",
      "created_time": "March 24, 2023, 08:40:57 AM",
      "body": "I can definitely relate to that feeling. It can be tough to part with an asset like Bitcoin, especially when you believe that its value is likely to increase in the future. But at the same time, I think it's important to remember that Bitcoin was designed to be a currency, and we should be using it as such if we want to see wider adoption. As more and more merchants begin to accept Bitcoin, it will become more commonplace to pay with it, and people will feel more comfortable doing so.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CoinEraser",
      "created_time": "March 24, 2023, 08:47:43 AM",
      "body": "Quote from: crypticj on March 24, 2023, 04:36:42 AMIt feels like you paying more for the product from a future perspective. Yes, I can understand your feelings. But actually that's wrong. If nobody used bitcoin, he wouldn't have this price either. Only because he was used has led to the success of bitcoin. If nobody used bitcoin, he would fall into insignificance. Therefore, you should not regret it if you use it to pay. Sure, you have a better feeling when you pay something and the price goes down instead of going up, because you could buy something \"cheap\", but we shouldn't have such thoughts. One should use bitcoin and not regret it. But as already written, I can understand you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hZti",
      "created_time": "March 24, 2023, 08:59:23 AM",
      "body": "Quote from: crypticj on March 24, 2023, 04:36:42 AMBut the problem for me is that anytime I think about paying with BTC I feel somehow uncomfortable. I always remember the guy who spent 30+ bitcoins on pizza and now these bitcoins are worth a fortune. Like I don't want to be this guy and pay with an asset that WILL go up in price. It feels like you paying more for the product from a future perspective. I can only say:Please pay with Bitcoin!Bitcoin is a currency, and if it is not used it will die. Easy as that.If you buy a pizza with Bitcoin and are afraid that you will regret it, the buy the equal amount of BTC again after you spend BTC for the pizza. This will involve a small fee but it will help Bitcoin a lot.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dr.Osh",
      "created_time": "March 24, 2023, 09:00:35 AM",
      "body": "if you are not comfortable spending the bitcoins you have, then feel free to use stable coins or even Fiat. however, you must have the principle that bitcoin is an investment that you keep. So, you don't have to use it, and keep adding to it if you have extra cash. The simple thing is if you are not comfortable, then use an alternative that you are comfortable using.Anyway, I just heard a story about a guy who exchanged the 30+ bitcoins he had for a pizza, or do you mean Laszlo Hanyecz spent 10k bitcoins for 2 pizzas.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "wxa7115",
      "created_time": "March 24, 2023, 09:01:38 AM",
      "body": "Quote from: crypticj on March 24, 2023, 04:36:42 AMHello everyone!Recently I was thinking about BTC payments and I believe that the system is moving towards bitcoin adoption and paying with bitcoin. And it's great! But the problem for me is that anytime I think about paying with BTC I feel somehow uncomfortable. I always remember the guy who spent 30+ bitcoins on pizza and now these bitcoins are worth a fortune. Like I don't want to be this guy and pay with an asset that WILL go up in price. It feels like you paying more for the product from a future perspective. What are your thoughts about this? Personally, I usually try to buy with stablecoins if I have some, it just feels more natural for me. I don't want to touch my BTC while the market is still bad. If everyone thought like you then bitcoin would have never become popular at all, but that is OK as everyone has their own way of thinking about things.However if you want to not feel bad about spending your bitcoin then what if the next time that you have to pay with bitcoin you do so, but that same day or the day after you buy again that same amount of bitcoin with fiat? This way you will use bitcoin for its intended purpose while at the same time you will not miss the upcoming upward movement while you have less bitcoin than when you made that purchase.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yudi09",
      "created_time": "March 24, 2023, 09:03:11 AM",
      "body": "Quote from: crypticj on March 24, 2023, 04:36:42 AMWhat are your thoughts about this? Personally, I usually try to buy with stablecoins if I have some, it just feels more natural for me. I don't want to touch my BTC while the market is still bad. That feeling will be born if you spend something with Bitcoin considering how someone is trying to get Bitcoin and I feel it.But lucky for people who live in areas that still prioritize fiat in every transaction activity so that Bitcoin can be stored.On the other hand, transactions in shopping by paying Bitcoin can be one way for us to see the wide spread of Bitcoin as a currency.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zlantann",
      "created_time": "March 24, 2023, 09:09:47 AM",
      "body": "Quote from: crypticj on March 24, 2023, 04:36:42 AMHello everyone!Recently I was thinking about BTC payments and I believe that the system is moving towards bitcoin adoption and paying with bitcoin. And it's great! But the problem for me is that anytime I think about paying with BTC I feel somehow uncomfortable. I always remember the guy who spent 30+ bitcoins on pizza and now these bitcoins are worth a fortune. Like I don't want to be this guy and pay with an asset that WILL go up in price. It feels like you paying more for the product from a future perspective. What are your thoughts about this? Personally, I usually try to buy with stablecoins if I have some, it just feels more natural for me. I don't want to touch my BTC while the market is still bad. You feel as if you are wasting something you would have invested. That's the feeling of a true investor mate. If you have other means of paying for your goods, why paying with Bitcoin?  The best decision is to have two wallets. One should be used for hodling your coins while you can use the other for paying for your purchases. But sometimes there is this sense of pride when you pay with bitcoin, the feeling of freedom and independence from bank and government controls. They market is not bad for people that bought when the price was at its lowest last year.Quote from: yudi09 on March 24, 2023, 09:03:11 AMThat feeling will be born if you spend something with Bitcoin considering how someone is trying to get Bitcoin and I feel it.But lucky for people who live in areas that still prioritize fiat in every transaction activity so that Bitcoin can be stored.On the other hand, transactions in shopping by paying Bitcoin can be one way for us to see the wide spread of Bitcoin as a currency.Yeah, I don't like using exchanges, hence I am forced to keep my coins and look for other means to make payments since Bitcoin payment is not very popular in my country. Like you said it is the use of Bitcoin as a legal tender that will promote the currency thereby leading to widespread adoption.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "March 24, 2023, 09:12:06 AM",
      "body": "Quote from: crypticj on March 24, 2023, 04:36:42 AM Like I don't want to be this guy and pay with an asset that WILL go up in price. It feels like you paying more for the product from a future perspective. yeah, why spend $1 worth of BTC now when it \"could\" be worth $10 tomorrow, the perfect example of the mindset that shows us all those statistics about usage are overly exaggerated. Let's all stop using bitcoin as we don't want to be that guy and hope some magical fairy will increase 10x times the price of an asset with no usage.QuoteI usually try to buy with stablecoins if I have some, it just feels more natural for me.And what stops you from buying each month a few bitcoins each just as you buy stable coins and use that to pay for goods? You will spend that anyhow since you need food or do you regret every day you have to spend money on food, clothes, and health instead of investing? You're on a slippery slope there!It's really pretty simple, either way, you have to spend $x of value at the end of the day, why does it matter if it was in fiat stable coins or bitcoins?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}