{
  "id": "topic_5521684",
  "title": "Dr.Bitcoin_Strange",
  "author": "Dr.Bitcoin_Strange",
  "created_time": "December 05, 2024, 08:06:10 AM",
  "content": "At what value of price gap will you conclude that it was a price manipulatolion for bitcoin? For example, assuming that Bitcoin was trading at $93k and suddenly with two or three bullish candle, price jumps to $100k+, would you classify it as a price manipulation? Often times some people say in their comments that \"whales or big banks like JP Morgan can't manipulate the market\". And their activities doesn't cause any significant changes or effect on price manipulation for Bitcoin. Now my question is, how do you expect price to perform before you call it a significant price manipulation? To reframe the question, which value do you expect price of Bitcoin to surge to or dump to before you say it's a significant price manipulation? .",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5521684",
  "comments": [
    {
      "author": "Btcdeybodi",
      "created_time": "December 05, 2024, 08:37:04 AM",
      "body": "From the content of your post; you should have just been direct in your topic by asking why the price of bitcoin is less Manipulative instead of including and comparing with altcoins. What you should know is that bitcoin has a lot of big players (whales), so you don't expect the activity of one big investor to have so much impact in the price performance. When we say that the price of bitcoin is sometimes manipulated by big investors, it means it is a concerted efforts by many big investors and not just a single entity. The price of bitcoin is too high for a single big investor to manipulate.Quote from: Dr.Bitcoin_Strange on December 05, 2024, 08:06:10 AMNow my question is, how do you expect price to perform before you call it a significant price manipulation? To reframe the question, which value do you expect price of Bitcoin to surge to or dump to before you say it's a significant price manipulation? . No body can tell about the level of surge or DIP that can be considered as price manipulation but for me i feel that price manipulation occurs when the market suddenly experience a pump and thereafter a dump, after the price must have achieve a certain milestone that investors had so much anticipation to reach.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "December 05, 2024, 08:49:35 AMLast edit: December 05, 2024, 09:27:45 AM by franky1",
      "body": "the markets always have some manipulationyou just have to look at the whale wallsas said just yesterday about the \"whale WALLS\"Quote from: franky1 on December 04, 2024, 10:49:33 PMas soon as this psychological wall cancels(its never intended to be hit/filled/eaten) then you will see the natural flow of buyers more open to buy but its due to this psychological whale wall that the price is held below $100kas you can see it only takes 200btc for the price to go from ~$99k down to $96k .. and only 200btc to get upto to $99,499k but then requires  100btc to get to $99.5k.. and then not much 300btc to get to $99,999 but then 500btc to get to $100,001as soon as the 500btc wall at the $100k cancels is psychological presence.. then the natural demand can buy above $100kas for how much \"surge\" (pump) needs to occur... actually a price increase is not a manipulationin basic economics the mining costs of bitcoin start efficiently at value of ~$60k/btc right now and in the most expensive mining costs on the planet can be $330kthis means due to wide ranging mining cost variance around the world there is a natural price speculation between $60k bottom and $330k top, where the price can naturally be volatile and variable(however from my view(no promises) if the price surged to say $500k this month (out of bounds) then that could consider that a manipulation)this means that for instance on the pacific islands where costs are high(>$300k), they are happy to buy at any price below their mining costs because buying from the market is a discount compared to mining it. and so they would be the willing and natural buyers all the way up.. so if there was no restrictive wall holding the price down they would be the real natural buyers helping the price naturally rise upto the $300k rangewhere in my view $300k is normal healthy natural pricing within the speculation window.....there are other altcoins that dont have the mining/minting economics of cost which means they are completely speculative 95% and so their prices can be pushed high for no realistic reason. take ethereum for instance, it is being held up at a premium due to the arbitrage opportunities people use from the bitcoin market. without bitcoiners arbitraging the market pairs to get back to bitcoin, ethereums price would have corrected by 95% down to it PoS low cost of staking/minting",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pakhitheboss",
      "created_time": "December 05, 2024, 09:21:46 AM",
      "body": "Quote from: Dr.Bitcoin_Strange on December 05, 2024, 08:06:10 AMAt what value of price gap will you conclude that it was a price manipulatolion for bitcoin? Price manipulation happened in the past as of now the price is being controlled by ETFs and Whales.Quote from: Dr.Bitcoin_Strange on December 05, 2024, 08:06:10 AMFor example, assuming that Bitcoin was trading at $93k and suddenly with two or three bullish candle, price jumps to $100k+, would you classify it as a price manipulation? No, I won't consider it as a price manipulation as the price was supposed to go beyond $100K. Quote from: Dr.Bitcoin_Strange on December 05, 2024, 08:06:10 AMOften times some people say in their comments that \"whales or big banks like JP Morgan can't manipulate the market\". And their activities doesn't cause any significant changes or effect on price manipulation for Bitcoin. The important part is that manipulating the price of Bitcoin now is not possible as a lot of USD will be needed. Bitcoin market cap is beyond the reach of a single entity now it will take entities to shake the price. Banks/financial institutions are looking to make profits and they want the price to go up before they book profits for their clients. If there is a big crash immediately after a pump then it is evident that the Bitcoin price is getting manipulated whereas now it is not happening.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "December 05, 2024, 09:41:31 AM",
      "body": "Bitcoin is more resistant to manipulation than other coins, but it's not completely unmanipulable. People with hundreds of thousands of BTC can still crash the market if they work together with some OTC broker that has enough reserves at hand to buy all those coins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BIT-BENDER",
      "created_time": "December 05, 2024, 09:47:44 AM",
      "body": "Well in my opinion Bitcoin has gone too far to be easily manipulated, this is my honest opinion. Bitcoin has gotten wild adoption and even countries are interested in Bitcoin. We saw the case of Germany when they sold their Bitcoin holding. The fact that a top country like Germany is selling off their Bitcoin holding regardless of the price should cause panic sell and affect the market negatively but moving forward look at where we are right now.To be brief Bitcoin is not easily manipulated by anyone, you can feel the effects of manipulation on alts coins especially the low cap altcoins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AVE5",
      "created_time": "December 05, 2024, 09:51:59 AM",
      "body": "Quote from: Dr.Bitcoin_Strange on December 05, 2024, 08:06:10 AMAt what value of price gap will you conclude that it was a price manipulatolion for bitcoin? For example, assuming that Bitcoin was trading at $93k and suddenly with two or three bullish candle, price jumps to $100k+, would you classify it as a price manipulation? Often times some people say in their comments that \"whales or big banks like JP Morgan can't manipulate the market\". And their activities doesn't cause any significant changes or effect on price manipulation for Bitcoin.Just ignore people who talks without facts of otherwise reasonings. Every experienced bitcoin user knows that the price of bitcoin is based on total values being invested and hold in the bitcoin blockchain which it price volume can be shaped and reshaped by the influence of whale accumulators either at their selling of buying or bitcoins in their prospective huge amounts.It literally doesn't mean that the value of bitcoin is tied on Whale accumulators only but as much as speculations and as well the integral of the ETF which attracts more of investors onboard to bitcoin market.Hope we're aware that for the Whale to invest a huge amount of USD on bitcoin can as much attract more investor which all together are potential influence to manipulate the market and when the whales pulls out of the market, other investors would also follow because they believe the whales have a more insight on the industry than them the plebes or some co whalers too.Let no one underestimate the influence of the whales Quote from: Dr.Bitcoin_Strange on December 05, 2024, 08:06:10 AMNow my question is, how do you expect price to perform before you call it a significant price manipulation? To reframe the question, which value do you expect price of Bitcoin to surge to or dump to before you say it's a significant price manipulation? . I'm not going to be specific here but let me remind all those skeptical people saying the whale accumulators doesn't have influence on bitcoin price to recall how bitcoin began to gain valuabilities is as a course of huge amount of funds being invest on the blockchain relatively to broader adoptions.So likely, there's season for the Dip, Bear and the Bullish which is usually caused by the amount of funds being pushed-in and pushed-out by investors.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Peanutswar",
      "created_time": "December 05, 2024, 10:00:28 AM",
      "body": "With the large instituations and of course depends on the demand of the market, we know large businesses that have stored their bitcoin and support the bitcoin really have a lot of contribution because they bought tons of it as their reserves and for the traders who make the market more volatile, there's a tag of war between the buyer and seller and of course if the number of traders decides one with their plan possible there's a push and pull in the market. As of now we are with the 100k price of the bitcoin and of course buyers grabs the opportunity while people keep waiting at the bottom so buy traders wins this time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "icalical",
      "created_time": "December 05, 2024, 10:21:20 AM",
      "body": "It's not easy to decide that Bitcoin price movement may caused by manipulation especially with the level of volatility on Bitcoin. In this November to December alone Bitcoin reach 100k, after almost a full year of just going sideway, and I believe the recent bull run is not manipulation instead it was  driven by multiple factor like the post halving and the increase of interest in Bitcoin ETF.However, the concerns about manipulation are not baseless. I mean we all agree that \"whales,\" can easily manipulate prices by placing high buy or sell orders at the right moments. Some patterns, like price floors forming during chaotic market, definitelyy raised suspicion. All that being said, defining a specific price gap as manipulation is subjective, and sudden jumps are part of the market dynamic due to the volatility. As far as I understand, instead of price levels, a deeper look into trading volumes and order books could offer better clues.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mahanton",
      "created_time": "December 05, 2024, 01:22:11 PM",
      "body": "Quote from: Dr.Bitcoin_Strange on December 05, 2024, 08:06:10 AMAt what value of price gap will you conclude that it was a price manipulatolion for bitcoin? For example, assuming that Bitcoin was trading at $93k and suddenly with two or three bullish candle, price jumps to $100k+, would you classify it as a price manipulation? Often times some people say in their comments that \"whales or big banks like JP Morgan can't manipulate the market\". And their activities doesn't cause any significant changes or effect on price manipulation for Bitcoin. Now my question is, how do you expect price to perform before you call it a significant price manipulation? To reframe the question, which value do you expect price of Bitcoin to surge to or dump to before you say it's a significant price manipulation? . Manipulation isnt something that you can be able to remove on any market which includes crypto. Come to think that there would really be always those whales, sharks on where we do all know that could easily buy huge chunks of coins on which it will really be able to have that significant effect in price in % gains. Just like on some example above with those huge sell walls on which it could be something that will be used to make it look that there's some upcoming sell but they will really be just that simply cancel it out and will really be able to break some resistances at the same time it will really be able to liquidate those who do made out some short positions. Going back in the past on which the price could drop down -10% on an ordinary day and even with that 20% on which this is really indeed pretty normal. There's no way that we cant be able to avoid these things as there would really be those big players who are above us and us small fishes then the best thing to do is to go with the flow and grab out some opportunity to buyback on the time or moment that things do happen. People will really be that too emotional on times like this that instead on taking up some buys they do rather sell out their positions or simply panic sold, and it will really be resulting into those regrets on the moment or time that the market do make out some recovery.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fivestar4everMVP",
      "created_time": "December 05, 2024, 01:45:08 PM",
      "body": "Quote from: Dr.Bitcoin_Strange on December 05, 2024, 08:06:10 AMAt what value of price gap will you conclude that it was a price manipulatolion for bitcoin? For example, assuming that Bitcoin was trading at $93k and suddenly with two or three bullish candle, price jumps to $100k+, would you classify it as a price manipulation? Often times some people say in their comments that \"whales or big banks like JP Morgan can't manipulate the market\". And their activities doesn't cause any significant changes or effect on price manipulation for Bitcoin. Now my question is, how do you expect price to perform before you call it a significant price manipulation? To reframe the question, which value do you expect price of Bitcoin to surge to or dump to before you say it's a significant price manipulation? . Well, sorry bud, but I can't seem to get the scoop of what you are driving at, are you insinuating or trying to say that the current price of bitcoin is manipulated?Sorry if I am misunderstanding you, but I seriously want to clearly understand what the motive or drive behind this thread is.First and personally, bitcoin is not immune to price manipulation and that's a fact, likewise the issue of price manipulation is not also something that is peculiar to bitcoin, or the cryptocurrency market alone, every financial instrument, assets, market face some form and level of manipulation from time to time including the forex and precious metal market..If at all that at any point, price of bitcoin is being manipulated, it's not something to be surprised or feel disappointed about, it's normal.And as for me, I don't have a particular price which bitcoin will get to to believe it's facing manipulation, if at all bitcoin is to be manipulated, it can happen at any price, there is no specific price set at which a price of any asset faces manipulation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "shield132",
      "created_time": "December 05, 2024, 02:09:32 PM",
      "body": "Quote from: Dr.Bitcoin_Strange on December 05, 2024, 08:06:10 AMAt what value of price gap will you conclude that it was a price manipulatolion for bitcoin? For example, assuming that Bitcoin was trading at $93k and suddenly with two or three bullish candle, price jumps to $100k+, would you classify it as a price manipulation? Often times some people say in their comments that \"whales or big banks like JP Morgan can't manipulate the market\". And their activities doesn't cause any significant changes or effect on price manipulation for Bitcoin. Now my question is, how do you expect price to perform before you call it a significant price manipulation? To reframe the question, which value do you expect price of Bitcoin to surge to or dump to before you say it's a significant price manipulation? . The title is different from the subject you talk in this thread. To answer your title question, bitcoin's price is less manipulative compared to other altcoins because Bitcoin is the oldest and most decentralized cryptocurrency with the largest market cap. You need more resources to manipulate Bitcoin than any altcoin, so it's hard to manipulate Bitcoin's price if we compare it to currencies like Ethereum, Ripple, Litecoin and others but this doesn't mean that Bitcoin isn't manipulated. Elon Musk easily manipulated the price of this coin in 2020 the way he wanted by making some tweets. Negative and positive rumours also significantly affect Bitcoin's price, there are numerous examples of that, one of the most famous is how the news from China affected it when they banned Bitcoin mining.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Marvell1",
      "created_time": "December 05, 2024, 02:21:20 PM",
      "body": "Quote from: BIT-BENDER on December 05, 2024, 09:47:44 AMWell in my opinion Bitcoin has gone too far to be easily manipulated, this is my honest opinion. Bitcoin has gotten wild adoption and even countries are interested in Bitcoin. We saw the case of Germany when they sold their Bitcoin holding. The fact that a top country like Germany is selling off their Bitcoin holding regardless of the price should cause panic sell and affect the market negatively but moving forward look at where we are right now.To be brief Bitcoin is not easily manipulated by anyone, you can feel the effects of manipulation on alts coins especially the low cap altcoins.Bitcoin market cap is over $2 trillion and that is a huge number to manipulate but if you check the daily bitcoin trading volume it is only around $130 billion and can even drop to $30-40 billion in a bear market. So manipulation is inevitable and it will be easier than you think. To me, manipulation is part of the financial markets, 50 trillion or 100 trillion markets like stocks can still be manipulated, let alone small markets like bitcoin. Additionally, the stock market is less susceptible to manipulation because of the SEC and other law enforcement agencies overseeing it with hundreds of regulations. Meanwhile, cryptocurrencies do not have too many specific regulations or management, so manipulation is easier and happens with greater intensity.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "December 05, 2024, 02:25:13 PM",
      "body": "Quote from: Marvell1 on December 05, 2024, 02:21:20 PMBitcoin market cap is over $2 trillion and that is a huge number to manipulatethe market cap is a meaningless number. there is no $2trillion stored somewhere that a manipulator has to compete againstim not sure why anyone cares about market cap when it has no significance to anythingif you look at the actual exchanges, the amount of coins at play near the spread of active market orders is a small fraction of coinsmanipulations can occurbut in most cases its using WALLS to try to not cause the price to swing widely, this is due to the fact that whales do futures contracts which means prices need to hit prices within a certain range for futures contracts to win. so they dont want the open market prices to go widely in the opposite direction as it costs them alot if that happens",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Japinat",
      "created_time": "December 05, 2024, 03:18:08 PM",
      "body": "Quote from: NotATether on December 05, 2024, 09:41:31 AMBitcoin is more resistant to manipulation than other coins, but it's not completely unmanipulable. People with hundreds of thousands of BTC can still crash the market if they work together with some OTC broker that has enough reserves at hand to buy all those coins.Yes, bitcoin can still be manipulated but it is less manipulative compared to altcoins since bitcoin has the largest market cap so it’s less susceptible to whatever factors that could influence the market. Unlike altcoins that have only lesser market cap so they are more prone to market manipulation. And since bitcoin is decentralized meaning it’s less affected with those varying parties that affect the market, while most altcoins are centralized so they are more vulnerable to whatever manipulation that the market brings.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MusaMohamed",
      "created_time": "December 05, 2024, 03:28:22 PM",
      "body": "Quote from: franky1 on December 05, 2024, 08:49:35 AMthe markets always have some manipulationyou just have to look at the whale wallsas said just yesterday about the \"whale WALLS\"Whale walls can be set up as barriers or can be removed, reset to lift the previous barriers to a new one with higher price. Or that barriers will be forcefullly broken out by market forced liquidations.Whale walls can be psychology resistance or support but these walls can be reset to be lower or higher. Whales know that they can set up walls on both sides, low and high to create a price range in their controls. When they see that it's time to move up, they will lift up their walls.Bitcoin market cap and trading volume are smaller than traditional markets so it's easier to manipulate Bitcoin market than other traditional markets. It's harder than altcoins because Bitcoin has bigger market cap than altcoins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jawhead999",
      "created_time": "December 05, 2024, 03:54:57 PM",
      "body": "If Bitcoin price suddenly down or rise without any news it means there's a whales behind that, if there's a news, it mostly come from popular people or institutions.If Bitcoin price tend to stable in down or rise, not sudden big red or green candle, it's a normal volatility.Bitcoin is just less manipulated than other coins, remember that there are many people buy or invest Bitcoin by relying on someone else, not really because of their belief.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dr.Bitcoin_Strange",
      "created_time": "December 05, 2024, 05:03:03 PM",
      "body": "I will not give a list but I am very must satisfy with the replies I got from four members on this thread. My question was clearly answer and I have learned what I wanted to. Thank you guys, any one that has more facts to add can drop their comments as I will always come back to this thread to read through.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kryptqnick",
      "created_time": "December 05, 2024, 06:26:39 PM",
      "body": "To me, a price manipulation is not merely about reaching a certain price. A particularly high price can be reached without manipulations if some exciting news come through and FOMO moves the market. A sudden crash is also possible without manipulations if there's particularly bad news and people start panic selling. To prove that there is a price manipulation, there should be a sudden and significant price change, paired with facts of major purchases or sales of BTC by a specific actor, and that it was done at least without a clear non-manipulative intent (for example, when authorities of some country sell a lot of seized BTC, I don't consider it a price manipulation even if it affects the price).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hamza2424",
      "created_time": "December 05, 2024, 07:40:52 PM",
      "body": "Quote from: pakhitheboss on December 05, 2024, 09:21:46 AMQuote from: Dr.Bitcoin_Strange on December 05, 2024, 08:06:10 AMAt what value of price gap will you conclude that it was a price manipulatolion for bitcoin? Price manipulation happened in the past as of now the price is being controlled by ETFs and Whales.That control is what we call manipulation whether it's positive or negative. honestly, in this distributed supply price control is not as easy as it was in the old days do you remember the LUNA crash now things are a little bit more complicated, and the market won't crash that rapidly because now there are quick buyers who acknowledge the worth of Bitcoin as now emotion of fear is getting eradicated.For the price gap DR.Bitcoin I cant get what are you trying to say are you referring to a drop level or pump level?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}