{
  "id": "topic_5432942",
  "title": "NotATether",
  "author": "NotATether",
  "created_time": "January 04, 2023, 04:53:36 AM",
  "content": "I am wondering if there are any hotkeys which I can control Sparrow wallet server (the terminal, NOT the GUI) with, so I don't have to be stuck with Tab and Shift-Tab.I am suspecting those red characters in each button are the hotkeys, but I could not figure out how to trigger the buttons.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5432942",
  "comments": [
    {
      "author": "BitcoinGirl.Club",
      "created_time": "January 04, 2023, 05:42:12 AM",
      "body": "Quote from: NotATether on January 04, 2023, 04:53:36 AMI am wondering if there are any hotkeys which I can control Sparrow wallet server (the terminal, NOT the GUI) with, so I don't have to be stuck with Tab and Shift-Tab.I am suspecting those red characters in each button are the hotkeys, but I could not figure out how to trigger the buttons.I never used it but can you check following instructions and let me know if that works?Quote1. Press the \"Alt\" key on your keyboard and then press the hotkey for the button you want to trigger. For example, if the hotkey for a button is \"A,\" you would press \"Alt+A\" to trigger that button.2. Press the \"Ctrl\" key on your keyboard and then press the hotkey for the button you want to trigger. For example, if the hotkey for a button is \"A,\" you would press \"Ctrl+A\" to trigger that button.You may also be able to use the \"Shift\" key in combination with the hotkey to trigger a button, depending on the specific hotkey and button.Keep in mind that the hotkeys for each button may vary, so you may need to refer to the documentation for the Sparrow Wallet or try different combinations of keys to find the correct hotkey for a particular button.I will be puzzled if it works.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "January 04, 2023, 06:21:51 AM",
      "body": "Quote from: BitcoinGirl.Club on January 04, 2023, 05:42:12 AMI never used it but can you check following instructions and let me know if that works?Quote1. Press the \"Alt\" key on your keyboard and then press the hotkey for the button you want to trigger. For example, if the hotkey for a button is \"A,\" you would press \"Alt+A\" to trigger that button.2. Press the \"Ctrl\" key on your keyboard and then press the hotkey for the button you want to trigger. For example, if the hotkey for a button is \"A,\" you would press \"Ctrl+A\" to trigger that button.You may also be able to use the \"Shift\" key in combination with the hotkey to trigger a button, depending on the specific hotkey and button.Keep in mind that the hotkeys for each button may vary, so you may need to refer to the documentation for the Sparrow Wallet or try different combinations of keys to find the correct hotkey for a particular button.I will be puzzled if it works. ChatGPT instructions, aren't they?  Actually, I already tried those combos in my terminal but they did not do anything. I haven't checked the source code yet, so I hope that has some clues.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitcoinGirl.Club",
      "created_time": "January 04, 2023, 06:27:50 AM",
      "body": "Quote from: NotATether on January 04, 2023, 06:21:51 AMChatGPT instructions, aren't they?  Actually, I already tried those combos in my terminal but they did not do anything. I haven't checked the source code yet, so I hope that has some clues.Yes, exactly. Thank God it was not correct or I would have a heart attack. But the level of guess this things are making, it's not far for me to have the actual heart attack in very near future. Someday this fuck will figure out who I am in the real life. None of us seems to be safe unless we all move to completely anonymous like using TOR in everything including email service etc. Problem with TOR and this kind of service are all those information seekers block features or make it harder to access their sites. You are forced to use your original IP.It's off topic anyway.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "January 04, 2023, 09:42:57 AM",
      "body": "Update: I reached out to Craig Raw on the Sparrow Wallet telegram channel, and he said the colored letters don't do anything. So it looks like my suspicions were right; they are just for decoration (inserted by a 3rd party UI library, in fact).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitcoinGirl.Club",
      "created_time": "January 05, 2023, 08:22:14 AM",
      "body": "Quote from: NotATether on January 04, 2023, 09:42:57 AMUpdate: I reached out to Craig Raw on the Sparrow Wallet telegram channel, and he said the colored letters don't do anything. So it looks like my suspicions were right; they are just for decoration (inserted by a 3rd party UI library, in fact).A good way to mislead the users LOL",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}