{
  "id": "topic_5449234",
  "title": "Get-Paid.com",
  "author": "Get-Paid.com",
  "created_time": "April 18, 2023, 03:46:41 AM",
  "content": "This company operates since 2013, seems to be solid, allowing users to buy/sell crypto and more.They run a crowdfunding project and so far 92% was achieved:https://www.seedrs.com/londonlinkWould you participate in this crowd funding in order to perhaps 2X, 5X or even 20X your investment, or would you stay away?What do you think?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5449234",
  "comments": [
    {
      "author": "Oshosondy",
      "created_time": "April 18, 2023, 05:57:12 AM",
      "body": "The site looks legit and I like the warning in their registration page:QuoteDon’t invest unless you’re prepared to lose all the money you invest. This is a high risk investment and you are unlikely to be protected if something goes wrong. Take 2 mins to learn more.Quote from: Get-Paid.com on April 18, 2023, 03:46:41 AMWould you participate in this crowd funding in order to perhaps 2X, 5X or even 20X your investment, or would you stay away?I did not see anything like crowd funding while I visited the site, only what I read is about trading and investment. Or you think that if people use the broker to trade, they are using it to raise money? As for me, this is not my area, I will still stay with exchanges like Binance, OKX, Kucoin, Huobi global and others that I am still using that I considered good to excellent while not leaving any fund I am not using to trade on the exchanges.But if I guess, as it is a broker, people do not have to deposit cryptocurrencies, they only need to deposit fiat, but able to open a contract position in crypto price just like what is offered by some brokers in forex trading?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "slaman29",
      "created_time": "April 18, 2023, 09:16:48 AM",
      "body": "Since 2013.Company incorporation 2018, London. Nature of services does not match brokerage.Office, Gibraltar, Incorporation 2019. Address does not even have Po box, so maybe no office even.So for at least 5 years they were not even a company despite claiming thousands of customers?And license of Gibraltar is means nothing, if you have not license in United Kingdom.I would not invest.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joniboini",
      "created_time": "April 18, 2023, 12:29:01 PM",
      "body": "Quote from: Oshosondy on April 18, 2023, 05:57:12 AMI did not see anything like crowd funding while I visited the site, only what I read is about trading and investment. Or you think that if people use the broker to trade, they are using it to raise money? I believe OP is referring to Seedrs funding/investment for LondonLink, not LondonLink itself. I believe they are just an investment platform for crypto start-ups to get more funding if they want to. Just like Kickstarter or something similar, but specifically for crypto start-ups. CMIIW.Quote from: slaman29 on April 18, 2023, 09:16:48 AMOffice, Gibraltar, Incorporation 2019. Address does not even have Po box, so maybe no office even.The address looks like a shared office space address. Other business lists the same address such as this one[1]. At the very least the building does exist, but it is unknown whether they really operate from there or not. Not to mention there is very little information available for users who don't want to register on Seedrs, even the official website has little to no information. Not really a good idea to pitch your business imo.[1] https://www.gibraltarlaw.com",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "buwaytress",
      "created_time": "April 18, 2023, 03:32:39 PM",
      "body": "Hey fellas, don't normally come in and comment but after seeing some people say it actually looks legit, I feel like I have to say something (and okay, I was sort of led her seeing posts of fellow livecasino guys haha).a. A legitimate company registration or incorporation doesn't necessarily mean a legitimate or even legally-operated business. You can incorporate in London or Gibraltar pretty easily.b. A broker of 10 years would have had a broker's licence for the same period of years, or at least revealed the parent licence. c. Look up the current CEO (as per LinkedIn). Director of 5 companies. Curiously, \"LondonLink Partners\" was one of 3 dissolved. Resigned as director from LondonLink OTC in 2019 but reappointed not long after.All these details are easily Googled, or linked from Seedr.Never really understood companies who are soliciting funds but not willing to provide proof of actual business, nor provide a budget for what they're raising (okay, maybe more info available to registered users but I'd be putting my prospectus out anyway). Now I'm not saying they're outright scams, probably legitimate to some point, but definitely not to the numbers they're claiming, not to the years they're claiming.Quote from: joniboini on April 18, 2023, 12:29:01 PMThe address looks like a shared office space address. Other business lists the same address such as this one[1]. At the very least the building does exist, but it is unknown whether they really operate from there or not. Not to mention there is very little information available for users who don't want to register on Seedrs, even the official website has little to no information. Not really a good idea to pitch your business imo.They're called mailbox/letterbox companies =) It is almost for certain that they don't operate from there nor maintain any meaningful connection to the incorporated company, sharing the address with hundreds if not thousands of shell corporations or SPVs, little companies made for specific, usually tax purposes. The address registered at London is used by at least 500+ companies on public information. The same at Gibraltar, the same building hosts post office boxes for many companies.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Get-Paid.com",
      "created_time": "April 19, 2023, 01:06:03 AM",
      "body": "@buwaytress - thanks for sharing this input.Yes, the CEO is the one listed in linkedin, you can speak to him directly about the investment (invites sent to anyone who used them previously for trades), IMHO addresses today don't really matter as everything is done online, but you're certainly right, how can you make people trust you one way or another?This shows in Seedrs £300,000 was invested anonymously, but from our experience they do trade Bitcoin genuinely, i.e. they don't scam their customers.Still, lots of question marks raised here, you all have lots of fair points raised here.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "April 19, 2023, 02:19:43 AM",
      "body": "Londonlink — I'm not from Europe, but I've never heard of this exchange/platform.But yea, I personally wouldn't participate, taking note that in most cases, having public crowdfunding like this is mostly not a good sign for the company's health. If the platform was good, chances are, venture capitalists would be swarming over it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SamReomo",
      "created_time": "April 19, 2023, 02:31:43 AM",
      "body": "Quote from: Get-Paid.com on April 18, 2023, 03:46:41 AMThis company operates since 2013, seems to be solid, allowing users to buy/sell crypto and more.They run a crowdfunding project and so far 92% was achieved:https://www.seedrs.com/londonlinkWould you participate in this crowd funding in order to perhaps 2X, 5X or even 20X your investment, or would you stay away?What do you think?  I don't think that I'll ever invest in this company or its crowdfunding campaign. The company might be operating since 2013, but it lacks proper details and that makes it somewhat fishy to me. By the way, those crowdfunding campaigns doesn't show the legitimacy of a company.Participating in their crowd funding campaign is risky and no body with proper mindset would invest in such companies. I know that initial investors might have the chance to earn 1.5x or more but it's still not a good decision to take the risks involved in such companies.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "palle11",
      "created_time": "April 19, 2023, 12:33:32 PM",
      "body": "I'm not a fan of crowdfunding after the scam associated with icos back in 2017. Icos used that to defraud people off their money and since then I have not seen it as a good source of investment. Moreover, this company as claimed to be around since 2013 should have covered many grounds but it seem not to have done that and not popular as many other brokerages and exchange. Binance is still new but have done alot as an example.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joniboini",
      "created_time": "April 19, 2023, 03:04:01 PM",
      "body": "Quote from: buwaytress on April 18, 2023, 03:32:39 PMThey're called mailbox/letterbox companies =) It is almost for certain that they don't operate from there nor maintain any meaningful connection to the incorporated company, sharing the address with hundreds if not thousands of shell corporations or SPVs, little companies made for specific, usually tax purposes. The address registered at London is used by at least 500+ companies on public information. The same at Gibraltar, the same building hosts post office boxes for many companies.Thanks for the info. I've seen many companies like this but never knew what their types are. Makes me wonder where the real business lies, or if they are really operating as a business or just a single person delegating work to freelancers and so on.Quote from: Get-Paid.com on April 19, 2023, 01:06:03 AMIMHO addresses today don't really matter as everything is done online, but you're certainly right, how can you make people trust you one way or another?Personally, I'd never trust any company that shares an address with dozens of companies, including the scam ones. At the very least, I should be able to visit them so that if everything went south, I can at least physically confront them. If their address is not clear, I'd probably waste a lot of time trying to look for them just in case they scammed me.Quote from: Get-Paid.com on April 19, 2023, 01:06:03 AMThis shows in Seedrs £300,000 was invested anonymously, but from our experience they do trade Bitcoin genuinely, i.e. they don't scam their customers.So you have experience with them? How do they do the transaction? Do they use multi-sig, and what contacts are they using to connect their customers? Their website offers little information, I'm not very keen on registering on a new website just to see how their OTC trades work.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dansus021",
      "created_time": "April 19, 2023, 03:10:00 PM",
      "body": "Their investor is anonymous by seeing your screenshot and it could be ome of their team. And to be honest i never hears their company before if they operate so long ago there is must be popular by now right???",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joniboini",
      "created_time": "April 21, 2023, 10:44:44 AM",
      "body": "Quote from: dansus021 on April 19, 2023, 03:10:00 PMTheir investor is anonymous by seeing your screenshot and it could be ome of their team. Does Seedrs even allow that to happen? Kinda counterproductive if they decide to invest in their own projects with such a large amount if they just want to scam people though. While it is not impossible, I'd rather believe they are not that stupid just to seek a hundred euros for extra funding. Quote from: dansus021 on April 19, 2023, 03:10:00 PMAnd to be honest i never hears their company before if they operate so long ago there is must be popular by now right??? To be fair it is not impossible if you're not their target audience, especially if their operation is limited to one or two regions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}