{
  "id": "topic_5416569",
  "title": "bonfire66",
  "author": "bonfire66",
  "created_time": "October 10, 2022, 06:51:12 AM",
  "content": "Вот есть у меня одна теория. Чисто моя, нигде в инете я ее не встречал. Хотя ктонить может быть и встречал. Не знаю.        Так вот, весь прикол в Америке. Она в данный момент ведет какую-то свою игру. Именно в данный момент, а не вообще в последние десятилетия. Ибо Америка, если посмотреть столетнюю историю, много раз выручала и спасала Россию и СССР в разных плохих ситуациях. На эту тему есть ролики на ютюбе – гуглите.    А сейчас Америка ведет себя странно. Я почти уверен в том, что именно она явилась триггером этой т.н. СВО. Потому что, в самом начале этого 2022 года в американской печати появилось куча статей на тему,  что если типа Россия нападет на Украину, то она возьмет Киев за 3 дня. И Путин такой думает...  \"да, я понимаю, мои генералы – они лизоблюды. Но вот если уж американцы об этом пишут в своей свободной прессе, то, похоже, точно возьму за 3 дня\". И напал. Это была спецоперация ЦРУ, как мне кажется. Ввести в заблуждение Путина. Зачем это было сделано? Ну… рискну предположить, что Путин американцам тоже уже надоел и они хотят побыстрее вскрыть нарыв. Дабы сменилась власть в России. Но… но тогда мне непонятна их текущая позиция. Они могут помочь ускорить завершение всего этого кошмара. Просто предоставив Украине достаточно большое количество вооружений. Но они этого не делают. Поставляют, но очень мало, явно недостаточно? Почему? Возможно, хотят чтобы в России сдохло как можно большее количество ватников и произошло бы генетическое очищение социума? Но ведь это произойдет за счет гибели украинцев, в том числе мирных жителей и детей? Это справедливо? Хотя, возможно, американский суперкомпьютер уже все посчитал и выдал все необходимые расчеты. Сколько еще месяцев должно пройти, какой график поставки вооружения и что делать дальше. Нам, простым людям, этого не понять. Мне лишь понятно СОВЕРШЕННО ЧЕТКО одно: что если американцы что-то там говорят, то это совершенно не обязательно является правдой типа \"все так и есть\". А может быть так оно и есть. А может быть это вбросы с целью направить мировое (или Российское) общественное мнение по определенному  руслу. Остается только запасаться попкорном и ждать…",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5416569",
  "comments": [
    {
      "author": "The0ldl_lser",
      "created_time": "October 10, 2022, 05:53:51 PM",
      "body": "Пиндосы тоже сами себе на уме. Вот казалось бы сейчас у Украины руки развязаны, и просится \"симметричный ответ\" - въебать по компактным местам проживания едросов. Быстро пресечь этот террор. Они понимают только с позиции силы. Посеять смуту среди самих обитателей Кремля. Но нет, дальнобойного оружия не дадим. Во-первых зачем свою жопу подставлять, а вдруг и правда посейдоном смоет Вашингтон. Во-вторых, типа нахуя, мы просто объявим русских изгоями и будем потом вечно за бесценок качать с них нефть, газ, алмазы, золото и т.д. В-третьих, а что такое сейчас  НАТО без Украины? Соплежуи типа ООН. Давно выродившаяся организация, которую расформировать пора. Какую \"защиту\" они предлагают европейским членам? У них что, есть опыт войны с Россией? Это они должны просить у Украины вступить в НАТО, чтобы спасти \"лицо\" этой немощной бесполезной структуры, а не наоборот. И кажется Байден это понимает, он только выиграет от ослабления этого становящегося бессмысленным альянса, ибо увеличивается доля влияния СШАИ второе. Посмотрите как сыпется на глазах вечная мантра кремлевских пропагандонов - о том что США всегда стоит за \"цветными революциями\". Типа так они (NATO) расширяются на восток. Вот он, казалось бы час пробил. Самое время. Масса россиян негодует, мобилизацию осуждают внутри страны. И где Америка? Со своей цветной революцией? Язык в жопу засунула и сидит тихо. Так что пиздешь все это, что и требовалось доказать. Или... их хитровыебанный план качать с России нефть, золото, алмазы и т.д. Вот и думайте.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Polkeins",
      "created_time": "October 11, 2022, 06:00:08 AM",
      "body": "Quote from: The0ldl_lser on October 10, 2022, 05:53:51 PMПиндосы тоже сами себе на уме. Вот казалось бы сейчас у Украины руки развязаны, и просится \"симметричный ответ\" - въебать по компактным местам проживания едросов. Быстро пресечь этот террор. Они понимают только с позиции силы. Посеять смуту среди самих обитателей Кремля. Но нет, дальнобойного оружия не дадим. Во-первых зачем свою жопу подставлять, а вдруг и правда посейдоном смоет Вашингтон. Во-вторых, типа нахуя, мы просто объявим русских изгоями и будем потом вечно за бесценок качать с них нефть, газ, алмазы, золото и т.д. В-третьих, а что такое сейчас  НАТО без Украины? Соплежуи типа ООН. Давно выродившаяся организация, которую расформировать пора. Какую \"защиту\" они предлагают европейским членам? У них что, есть опыт войны с Россией? Это они должны просить у Украины вступить в НАТО, чтобы спасти \"лицо\" этой немощной бесполезной структуры, а не наоборот. И кажется Байден это понимает, он только выиграет от ослабления этого становящегося бессмысленным альянса, ибо увеличивается доля влияния СШАИ второе. Посмотрите как сыпется на глазах вечная мантра кремлевских пропагандонов - о том что США всегда стоит за \"цветными революциями\". Типа так они (NATO) расширяются на восток. Вот он, казалось бы час пробил. Самое время. Масса россиян негодует, мобилизацию осуждают внутри страны. И где Америка? Со своей цветной революцией? Язык в жопу засунула и сидит тихо. Так что пиздешь все это, что и требовалось доказать. Или... их хитровыебанный план качать с России нефть, золото, алмазы и т.д. Вот и думайте.Толково и весьма глубоко. Только надо добавить что америка и так и сяк выиграла и дальше выиграет еще больше, от ослабления европы. Минус конкурент. Останется только китай наверное и все. Хотя они еще более вялые чем европа. И вообще если бы сша хотели, то еще в 92-96 разробили бы Россию на куски поменьше, но почему то не захотели. Возможно потому, что все-таки качать нефть, газ, добывать золото и алмазы так было бы сложнее. Так что и тут весьма прагматичный интерес. А вообще сша парни деловые и как говорил Киссинджер \"У Америки нет постоянных друзей или врагов, есть только интересы.\"",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "awiator",
      "created_time": "October 11, 2022, 07:24:01 AM",
      "body": "Quote from: The0ldl_lser on October 10, 2022, 05:53:51 PM И где Америка? Со своей цветной революцией? Язык в жопу засунула и сидит тихо. Так что пиздешь все это, что и требовалось доказать. Или... их хитровыебанный план качать с России нефть, золото, алмазы и т.д. Вот и думайте.Так тебе и думать нечем дебилу.Россия не какая там украина или грузия, у народа менталитет другой. Выперли нахрен из страны всех инагентов, нко, соросят ебаных. Вот и сидит америка с засунутым в жопу языком и ты себе его туда же засунь.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bonfire66",
      "created_time": "October 12, 2022, 08:01:39 AM",
      "body": "Вот тут хотелось бы увидеть бы документально подтвержденные обоснования ваших слов. Особенно интересно бы увидеть видеоподтверждения с языками в жопе. Заранее спасибо за понимание.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}