{
  "id": "topic_5429405",
  "title": "Fullbear2222",
  "author": "Fullbear2222",
  "created_time": "December 16, 2022, 01:53:32 PM",
  "content": "No better business soon then bodyguards and security.AS we Also see that a lot scams happening for example FTX and now it look like binance is next.But not just crypto other instutions scam people Also all of this creating more violance in the world and stress.People who feel unjustice Will be unpredictble.You better start IPO and ICO crypto start up companies with security and bodyguards service related.Security will be only booming business for sure.And off course the funeral service Will be booming Even more becouse many people Will take their Life by their own becouse many people Lost and lose money in crypto now and no more christmas for them. The rich people the top elite right now scam everybody else in the world that's the process what's going on now and many people lose all the money Crypto exchanger ceo-s need most of those services lol 😃Off course If they go to jail it's safer there but not together with general population lol 😁",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5429405",
  "comments": [
    {
      "author": "Zlantann",
      "created_time": "December 16, 2022, 05:09:18 PM",
      "body": "Quote from: Fullbear2222 on December 16, 2022, 01:53:32 PMNo better business soon then bodyguards and security.AS we Also see that a lot scams happening for example FTX and now it look like binance is next.But not just crypto other instutions scam people Also all of this creating more violance in the world and stress.People who feel unjustice Will be unpredictble.You better start IPO and ICO crypto start up companies with security and bodyguards service related.Security will be only booming business for sure.And off course the funeral service Will be booming Even more becouse many people Will take their Life by their own becouse many people Lost and lose money in crypto now and no more christmas for them. The rich people the top elite right now scam everybody else in the world that's the process what's going on now and many people lose all the money Crypto exchanger ceo-s need most of those services lol 😃Off course If they go to jail it's safer there but not together with general population lol 😁It is true that majority of people that opreates in the crytocurency market use centralized exchanges but i dont think the fall of FTX or Binance would have a lasting negative effect on Bitcoin. These falls would lead to more awareness of the need to keep your coins in a safe decentralized wallet. This would make Bitcoin stronger and shield it from the negative influencea of these centralized platforms.The security sector have always been a lucrative one, especially in areas that are experiencing insecurity. Your advice to consider investing in the security or funeral sector is not for me. I am wondering how you got the statistics that the problems of FTX or others would lead to a high rate of insecurity and deaths because in my country I am not sure up to 1% of the population engage in cryptocurrencies, thus I am wondering how it would make the security or funeral sector lucrative.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tjtonmoy",
      "created_time": "December 16, 2022, 06:14:41 PM",
      "body": "I am not quite sure what OP is trying to say here. Crypto is decentralized and this gives the users freedom. And if you keep your privacy safe and protected without giving out much footprint, then you don't need security. I am still trying to figure out if this is a serious post or to make fun. They are suffering for what they did to the people, and trying to get free from that with bodyguard and security won't do too much. This is the reason there are laws in every country.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hispo",
      "created_time": "December 16, 2022, 06:38:54 PMLast edit: December 16, 2022, 06:53:07 PM by Hispo",
      "body": "Quote from: tjtonmoy on December 16, 2022, 06:14:41 PMI am not quite sure what OP is trying to say here. Crypto is decentralized and this gives the users freedom. And if you keep your privacy safe and protected without giving out much footprint, then you don't need security. I am still trying to figure out if this is a serious post or to make fun. They are suffering for what they did to the people, and trying to get free from that with bodyguard and security won't do too much. This is the reason there are laws in every country. Assuming OP is talking seriously, I  believe he is pointing out the fact world is becoming more of a dangerous and violent place as years pass and the whole mention of the crypto-scams could be just an example of things which make life miserable for millions of investors.I personally have mixed opinions on security and corporation army businesses. It is supposed to be the job of the state to guarantee the security and safety of their population to a minimum level, which would be enough to live a normal life.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gozie51",
      "created_time": "December 16, 2022, 07:02:51 PM",
      "body": "Don't think of ICO in collaboration to whatever service because it failed and no more trust in it. People won't buy into it, nobody like to be fulled twice or many times. I also see that insecurity is becoming a big problem to the world and communities trying to secure themselves as government keep failing to maintain the primary aim of government, the security of life and property. Therefore, the demand for security guards and other aspects of security is in high demand like dogs. We have more increase in the rate that young men are going into the field of security guards and agents to recruit security personnel and export them to needed countries.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitstar_coin",
      "created_time": "December 16, 2022, 07:14:11 PM",
      "body": "Cyber security will probably be in a lot of demand in the future, as it is, the world is growing in technology and the need for security to combat cyber crimes keeps increasing. So I do agree that security will is a top priority now and in years to come and in the case of bodyguards, I don't think it is in such high demand as security does.Bodyguard services are mostly required by certain people and they number is not as high as the number of people who require security.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gyfts",
      "created_time": "December 16, 2022, 07:44:35 PM",
      "body": "What is someone going to do? They get ripped by FTX and they live across the world, so they're going to take up arms somehow and retaliate against FTX HQ? Doubtful.These companies are getting away with user funds because they know for certain that the government will either let them do it, or that they know the consumers have no recourse. It's not as if a company operating in the Bahamas is ever going to fear what their users are going to do when they live literally all over the world after  they steal the money and take a plane ride to a non-extradition safe haven.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coolcoinz",
      "created_time": "December 16, 2022, 08:07:23 PM",
      "body": "OP is full of shit again making bold statements with nothing to back them. Why would binance be a scam? Binance was big before FTX and helped to finance FTX which happened to be a mistake, but Sam fooled more people than CZ. FTX was a scam but Binance is still here and so are other exchanges like Coinbase, Bitstamp and others. What are you trying to say OP? That all exchanges are scams? If it is so, why do many of them operate for more than 5 years without the need for fractional reserve banking?Exchanges and businesses that go fractional are sooner or later going to make a mistake and die because unlike in traditional banking nobody is going to come and bail them out. If CZ is being honest and Binance isn't going this way, it won't collapse. It's really easy to run an exchange and there's only 3 things that I can think of that can lead to a collapse.1. Hack (Mt.Gox)2. Fractional reserve (FTX)3. Scam (Btc-e)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Marcellin9",
      "created_time": "December 17, 2022, 08:52:54 AM",
      "body": "Quote from: Gyfts on December 16, 2022, 07:44:35 PMWhat is someone going to do? They get ripped by FTX and they live across the world, so they're going to take up arms somehow and retaliate against FTX HQ? Doubtful.These companies are getting away with user funds because they know for certain that the government will either let them do it, or that they know the consumers have no recourse. It's not as if a company operating in the Bahamas is ever going to fear what their users are going to do when they live literally all over the world after  they steal the money and take a plane ride to a non-extradition safe haven.Share your views here. It just costs too much for individuals to take actions against crypto companies that are scammers. The lucrative business exists for reasons with government's involvement or tolerance. I am not defending any of them, just trying to tell the truth. Bodyguards and security services might be in great demand to protect all the money those guys ripped off.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Tony116",
      "created_time": "December 17, 2022, 09:18:38 AM",
      "body": "Quote from: coolcoinz on December 16, 2022, 08:07:23 PMOP is full of shit again making bold statements with nothing to back them. Why would binance be a scam? Binance was big before FTX and helped to finance FTX which happened to be a mistake, but Sam fooled more people than CZ. FTX was a scam but Binance is still here and so are other exchanges like Coinbase, Bitstamp and others. What are you trying to say OP? That all exchanges are scams? If it is so, why do many of them operate for more than 5 years without the need for fractional reserve banking?Exchanges and businesses that go fractional are sooner or later going to make a mistake and die because unlike in traditional banking nobody is going to come and bail them out. If CZ is being honest and Binance isn't going this way, it won't collapse. It's really easy to run an exchange and there's only 3 things that I can think of that can lead to a collapse.1. Hack (Mt.Gox)2. Fractional reserve (FTX)3. Scam (Btc-e)I agree with you, I don't understand why so many people look at the death of FTX, and they can confidently say that Binance will also die under FTX. I am not saying that Binance will never die but what they are doing shows us that they will still be with us and will become even stronger after the death of FTX. If they want to stay in business, they need more credibility, and they are doing it. We should support them rather than vilify them.An exchange crash is not good for the market, so I hope people stop those negative thoughts and build a healthy market together.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "macson",
      "created_time": "December 17, 2022, 10:19:39 AM",
      "body": "The CEO of FTX stole people's money, and even though he was surrounded by many bodyguards, it couldn't hold back the anger of people who lost their money, so i think the bodyguard business will not boom and it will run as usual.  reputation is a vital thing in the internet world, those who have damaged their reputation, will not be able to fix it at any time, people who are angry will not be afraid of bodyguards, even chances are that the bodyguard will run away when they are terrorized and attacked by many people lol.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bananington",
      "created_time": "December 17, 2022, 10:32:25 AM",
      "body": "Quote from: Fullbear2222 on December 16, 2022, 01:53:32 PMSecurity will be only booming business for sure.Speaking more about security and the safety of your cryptocurrency, Newbies should also be careful about people who will offer their services to help or provide assistance to them in securing their cryptocurrency. You shouldn't trust anyone offering services to teach you about how to secure your coins and asking for access to your noncustodial wallet. Your security should be your responsibility first.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Majestic-milf",
      "created_time": "December 17, 2022, 11:09:48 AM",
      "body": "The issue of security is something that should not be taken lightly. Quite true that the collapse of FTX has caused some individuals to be wary of CEXs but I doubt that those who were affected by it would be free of such dubious acts in the future if they don't take necessary steps to avoid a repeat by being cautious and not always letting greed get the better of them. I don't think there'd be a need for a funeral service if investors can be able to spot all these red flags and ward against them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dothebeats",
      "created_time": "December 17, 2022, 11:37:29 AM",
      "body": "Isn't that something that's already booming anyways? Security service and bodyguards are more prominent in this era. Even relatively unknown 'celebrities' and influencers are getting their fair share of bodyguard/security service. Some of them are genuinely concerned on their security, while a huge number are just concerned on how to look good in public and how it portrays importance on their image. I'm genuinely interested on the rise of funeral service. It's something I haven't heard of yet",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Moneyprism",
      "created_time": "December 17, 2022, 11:49:50 AM",
      "body": "i'm trying to catch what the OP said and I can say that the OP's point here is that the world is getting crazier and in the future there will be more people who need security and this will be a potential business in the future, so we should be able to take this opportunity( ?)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fortify",
      "created_time": "December 17, 2022, 11:58:33 AM",
      "body": "Quote from: Fullbear2222 on December 16, 2022, 01:53:32 PMNo better business soon then bodyguards and security.AS we Also see that a lot scams happening for example FTX and now it look like binance is next.But not just crypto other instutions scam people Also all of this creating more violance in the world and stress.People who feel unjustice Will be unpredictble.You better start IPO and ICO crypto start up companies with security and bodyguards service related.Security will be only booming business for sure.And off course the funeral service Will be booming Even more becouse many people Will take their Life by their own becouse many people Lost and lose money in crypto now and no more christmas for them. The rich people the top elite right now scam everybody else in the world that's the process what's going on now and many people lose all the money Crypto exchanger ceo-s need most of those services lol 😃Off course If they go to jail it's safer there but not together with general population lol 😁Nothing much has changed, crime will tend to tick up a bit in recessions, however the richest are likely to keep their teams the same size if they have them in place already. The only thing that might nudge them to increase the size is if their wealth goes up or if they have received particular threats or think they are in danger for some other reason. What a depressing though about funeral services, but I guess nothing changes there either, in bad economic times when people feel a lot more desperate or don't have enough money to survive then tragedy is more likely to strike in different forms. The fact that food and energy costs are high could cause a lot of misery.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "December 17, 2022, 12:18:37 PM",
      "body": "we are in 2022where exchanges are not hosted in some office somewhere. they operate in amazon AWS services(cloud). and have exchange employees doing 'remote working' practices(work from home)businesses that have valuables and VIP's sat in office buildings is a dying business model you wont find bitcoin sat in a office desk if you raided a skyscraper. all you will find is a virtual office (rent by the day) used mainly for mail re-directs and the occassional business board meeting once a year",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bittraffic",
      "created_time": "December 17, 2022, 12:49:14 PM",
      "body": "It's a scare-sayer from a prepper who sees the world will be dominated by criminals trying to loot from everyone they see on the streets. I have watched several of these people who are preparing for what they thought will come when everyone is hungry because of the economy that Jerome Pal is doing. To me, before people will start robbing their neighbors in the middle of the night, they will first try to make more protests against the government.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dimonstration",
      "created_time": "December 17, 2022, 12:58:59 PM",
      "body": "We are in a dangerous world but in a digital area, many now are not into cash or investing in tangible investments like golds or having cash at home. Many invest now thru online or keep their money in bank. It is unnecessary to have bodyguards if we let ourselves lowkey and don’t show how rich we are. Unlike before that rich people keep money and investment in their safe at home, some now keep it online or through trezors were it is hard to find. What we need to avoid is to be attacked in our online transactions, so keep our keys safe and double check always our sites and transactions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coupable",
      "created_time": "December 17, 2022, 01:37:37 PM",
      "body": "For general clarification, the provision of special protection of any kind or under the supervision of any apparatus does not prevent the start-ups from being prosecuted or getting rid of legal accountability in the event of a breach or if the security need arises.  On the other hand, there is an increase in the demand for protection products and services of all kinds, including surveillance cameras, guard dogs, alarm devices, as well as bodyguards, whose services costs rise according to the personality requesting protection.  Not only business owners request a private guard, but also public figures and influential figures.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}