{
  "id": "topic_5406642",
  "title": "shasan",
  "author": "shasan",
  "created_time": "July 17, 2022, 05:24:18 PMLast edit: July 18, 2022, 04:41:17 AM by shasan",
  "content": "What happened:: BitcoinBalance is trying to sell bitcointalk forum account of various rank including clean as well as negatively trusted account which may increase spam as well as scam.Scammers Profile Link: https://bitcointalk.org/index.php?action=profile;u=1112471Reference Link: https://bitcointalk.org/index.php?topic=5406641Additional Notes: Quote from: BitcoinBalance on July 17, 2022, 05:19:26 PMCleanSenior: $300 BTC Full: $150 BTC NegHero: $150 BTC Senior: $100 BTCFull: $50 BTC___________________NO NEGOTIATION___________________Accounts are real. Can't show ids for obvious reasons. You will get pass. You can change it immediately. I'm not interested in scams. Posted here 2017-2019.Flag: Quote from: logfiles on July 17, 2022, 08:38:30 PMhttps://bitcointalk.org/index.php?action=trust;flag=3008",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5406642",
  "comments": [
    {
      "author": "shasan",
      "created_time": "July 17, 2022, 05:24:56 PM",
      "body": "Reserve",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "logfiles",
      "created_time": "July 17, 2022, 08:38:30 PM",
      "body": "He obviously locked the thread to avoid getting bombarded by members. He may try to successfully sell the account, but sooner or later, it will get noticed by members here.In a meantime, I also flagged the account.https://bitcointalk.org/index.php?action=trust;flag=3008",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "shasan",
      "created_time": "July 18, 2022, 04:38:00 AM",
      "body": "Quote from: logfiles on July 17, 2022, 08:38:30 PMHe obviously locked the thread to avoid getting bombarded by members. He may try to successfully sell the account, but sooner or later, it will get noticed by members here.In a meantime, I also flagged the account.https://bitcointalk.org/index.php?action=trust;flag=3008S/he is a proper scammer and s/he must have the account to sell or will try to scam. But s/he is obviously a old member of this forum and trying to scam/sell account from a newbie account to avoid scam. You have mentioned that s/he has locked the topic but after your post s/he has again unlocked the topic and created a bump post then again locked the topic.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NeuroticFish",
      "created_time": "July 18, 2022, 04:56:05 AM",
      "body": "Do people still buy clean accounts nowadays?! They have a big chance to get tagged sooner or later and will be useless on long term (well, except that scammers' signature campaign).I don't think that the newbie cares whether the account is tagged or flagged, nor the potential buyers.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "shasan",
      "created_time": "July 18, 2022, 05:02:43 AM",
      "body": "Quote from: NeuroticFish on July 18, 2022, 04:56:05 AMDo people still buy clean accounts nowadays?! They have a big chance to get tagged sooner or later and will be useless on long term (well, except that scammers' signature campaign).I don't think that the newbie cares whether the account is tagged or flagged, nor the potential buyers.I think you are right that they don't care about tag or flagged. But those who are potential buyer might be left their interest from buying them. Cause if the buyer buy the account then password will be changed and we will be able to know the owner of the account has been changed. So we will tag that that's why buyer will stay away.I am not sure about buy/sell but  few people may take chance if they can make profit before being tagged.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "logfiles",
      "created_time": "July 18, 2022, 08:43:56 PMLast edit: July 19, 2023, 08:29:57 PM by logfiles",
      "body": "Quote from: NeuroticFish on July 18, 2022, 04:56:05 AMI don't think that the newbie cares whether the account is tagged or flagged, nor the potential buyers.Definitely the newbie won't care, but the main aim is to make sure the warnings are visible to some guest users or newbies who may not be aware that buying accounts here isn't something cool",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "KingsDen",
      "created_time": "July 25, 2022, 08:29:29 PM",
      "body": "Quote from: shasan on July 18, 2022, 05:02:43 AMQuote from: NeuroticFish on July 18, 2022, 04:56:05 AMDo people still buy clean accounts nowadays?! They have a big chance to get tagged sooner or later and will be useless on long term (well, except that scammers' signature campaign).I don't think that the newbie cares whether the account is tagged or flagged, nor the potential buyers.I think you are right that they don't care about tag or flagged. But those who are potential buyer might be left their interest from buying them. Cause if the buyer buy the account then password will be changed and we will be able to know the owner of the account has been changed. So we will tag that that's why buyer will stay away.I don't clearly understand you here. The statements that I underlined, I do not understand it. Do you mean that once you see any account change password you will tag it? Who recommended this rule. I remember there was when I changed my password twice within a week due to some reasons, will you go ahead to tag me?Very soon I will change my email because I used my official email to sign up, which I want to discontinue. So, if my account shows that email is changed you will tag me?Password and email change are good signs of accounts that changed hands but it's not enough reason to tag the account. Personally I feel that account should be tagged if it's reported with evidence selling accounts or a said account has been offered someone for buy and the person reports it with evidence.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "The Sceptical Chymist",
      "created_time": "July 25, 2022, 08:42:14 PM",
      "body": "Quote from: shasan on July 18, 2022, 05:02:43 AMI am not sure about buy/sell but  few people may take chance if they can make profit before being tagged.I never really had a good sense of what the account market was like in terms of prices for the various ranks (and including green trust, number of merits, etc.), but I would imagine that a Hero or Legendary account would sell for at least a few hundred dollars if it wasn't red-trusted.  If that were true, I doubt many people would take a chance if there was even the slightest possibility of it getting tagged in the future.On the other hand, I'm not so sure about bounty hunters.  Lately I've gotten the impression that bounty managers don't really care if their participants have red trust or not--not surprising, given that a lot of the projects being advertised are either crap designed to make the devs quick money or flat-out scams.  So I'd imagine there are probably some people who'd take a chance that their bought account is going to get tagged.  They'd also be the ones who'd buy an account that's already been tagged.Regardless, account sales are still bad no matter how you slice it.  I'm betting most of them happen away from the forum, too.Quote from: logfiles on July 18, 2022, 08:43:56 PMthe main aim is to make sure the warnings are visible to some guest users or newbies who may not be aware that buying accounts here isn't something coolSpot-on.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}