{
  "id": "topic_5437785",
  "title": "Hydrogen",
  "author": "Hydrogen",
  "created_time": "February 02, 2023, 02:33:31 PM",
  "content": "Peter Zeihan - I Am Afraid Things Are Getting Much Uglier In Russiahttps://www.youtube.com/watch?v=Ao8MGjFk20QThe best \"russia is on the brink of collapse\" content I have seen thus far.Where has Peter Zeihan been for the past 2 years?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5437785",
  "comments": [
    {
      "author": "BADecker",
      "created_time": "February 02, 2023, 05:17:07 PMLast edit: February 02, 2023, 05:49:08 PM by BADecker",
      "body": "Russia is a large enough country that they can be a country to themselves if necessary.Everything in the video revolves around one major point. This point is what happens if the whole financial structure remains as it is today. But what if the whole structure of financial operations starts to change?Contrary to that point are things like BRICS, the Russia/China pipelines, loads of black-market operations, other enemies of the US coming onboard with Russia, and essentially the people getting fed up with the sanctions and forcing their leaders to get rid of them.Right now, Russia and China are developing a form of SWIFT to operate between these two countries - https://www.russia-briefing.com/news/russia-and-china-to-develop-swift-avoiding-international-financial-systems.html/. And there are others. Turns out that the US is shutting down its own worldwide financial operations by trying to maintain is control.None of this will unfold in a fast fashion for the US and Nato countries. But it will unfold fast for Russia and other major countries (countries who realize that they are being cut off from Russian benefits by the sanctions). Just as water flows the easiest way that it can, even so finances flow the easiest ways that they can. US domination of the world financially always was held in place because it made sense. Sanctions take away what once made sense.See https://twitter.com/jimmy_dore/status/1620681497362726914?utm_source=substack&utm_medium=email.EDIT: Also, watch:https://www.youtube.com/watch?v=qxN7Vr5aeU0https://www.youtube.com/watch?v=R2zQg8iYLbEhttps://www.youtube.com/watch?v=cyZoUfNsUl8",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coolcoinz",
      "created_time": "February 02, 2023, 08:25:51 PM",
      "body": "I feel like Zeihan is just an attention whore. Suddenly he's a guest at all those Internet podcasts, people are quoting him everywhere. I try to ignore the guy mostly because of the things he said about bitcoin. If this dude is willing to share opinions on things he has no understanding of, think about how much he's going to bend the reality in fields where he actually has some knowledge. I know nothing about ships and sailing so I don't go around talking about it. If someone were to ask me about it I wouldn't try to make up something. Zeihan is willing to give opinions when he's got 0 knowledge and experience and that makes him a bullshitter.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o48o",
      "created_time": "February 02, 2023, 09:28:08 PM",
      "body": "Quote from: coolcoinz on February 02, 2023, 08:25:51 PM-cut-I try to ignore the guy mostly because of the things he said about bitcoin. If this dude is willing to share opinions on things he has no understanding of, think about how much he's going to bend the reality in fields where he actually has some knowledge. -cut-We all have subjects we don't know anything about, and when you are in business of being popular in the internet, people tend to except that you have a strong opinion about everything. I find that culture weird. It's like they are being seen as weak if they need more data to form an opinion. Him saying that bitcoin is a pyramid scam is more or less popular view that people were saying about altcoins while back and about NFTs right now. So i am guessing he hasn't really looked into it, or got that opinion from his friend who also has strong opinions. But i totally understand that opinion, it's the easiest one to have.That being said, What he says in the video is pretty much spot on and it's really nothing new as it's public info anyone who has been paying attention knows already. But there's one more thing he clearly haven't mastered and that's editing audio. That was pain to listen with headphones. I am not sure, maybe the guy has a hearing loss or something but there was this humming sound blurring the voice. He should hire an audio guy to oversee the recording and mastering.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BADecker",
      "created_time": "February 02, 2023, 10:36:32 PM",
      "body": "^^^ Right! We all make the mistake of talking without really knowing what we are talking about, some of the time. But what's important to the people like Zeihan is that we hear it. Why? Because they know that most of us will simply believe, without doing our do-diligence. This means that the more they talk, the more they can twist people into believing anything, true or not..",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hydrogen",
      "created_time": "February 03, 2023, 02:10:29 AM",
      "body": "Quote from: BADecker on February 02, 2023, 05:17:07 PMwhat if the whole structure of financial operations starts to change?Contrary to that point are things like BRICS, the Russia/China pipelines, loads of black-market operations, other enemies of the US coming onboard with Russia, and essentially the people getting fed up with the sanctions and forcing their leaders to get rid of them.Right now, Russia and China are developing a form of SWIFT to operate between these two countries - https://www.russia-briefing.com/news/russia-and-china-to-develop-swift-avoiding-international-financial-systems.html/. And there are others. Turns out that the US is shutting down its own worldwide financial operations by trying to maintain is control.None of this will unfold in a fast fashion for the US and Nato countries. But it will unfold fast for Russia and other major countries (countries who realize that they are being cut off from Russian benefits by the sanctions). I have heard about russia developing alternatives to the SWIFT banking network since around 2012.Russia searching for SWIFT alternatives has to be near to a 10 year old Putin quest. Let me see if I can find references for it. Here:QuoteSPFSSPFS (Russian: Cиcтeмa пepeдaчи финaнcoвыx cooбщeний (CПФC), romanized: Sistema peredachi finansovykh soobscheniy, lit. 'System for Transfer of Financial Messages') is a Russian equivalent of the SWIFT financial transfer system, developed by the Central Bank of Russia.[1] The system has been in development since 2014, when the United States government threatened to disconnect Russia from the SWIFT system.[2]https://en.wikipedia.org/wiki/SPFSThe SWIFT alternative is developed and operated by russia's central bank since 2014 ^. Peter Zeihan claims russia's central bank has been blocked internationally. Which has the potential to disconnect the SWIFT alternative they operate and manage.Maybe russia can find workarounds and fixes for attempts to destabilize their alt network. Maybe they cannot. One thing I like about Zeihan's commentary is he provides hard analysis for his claims, such as russian bonds potentially defaulting in april of 2023.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BADecker",
      "created_time": "February 03, 2023, 12:32:50 PM",
      "body": "Quote from: Hydrogen on February 03, 2023, 02:10:29 AMQuote from: BADecker on February 02, 2023, 05:17:07 PMwhat if the whole structure of financial operations starts to change?Contrary to that point are things like BRICS, the Russia/China pipelines, loads of black-market operations, other enemies of the US coming onboard with Russia, and essentially the people getting fed up with the sanctions and forcing their leaders to get rid of them.Right now, Russia and China are developing a form of SWIFT to operate between these two countries - https://www.russia-briefing.com/news/russia-and-china-to-develop-swift-avoiding-international-financial-systems.html/. And there are others. Turns out that the US is shutting down its own worldwide financial operations by trying to maintain is control.None of this will unfold in a fast fashion for the US and Nato countries. But it will unfold fast for Russia and other major countries (countries who realize that they are being cut off from Russian benefits by the sanctions). I have heard about russia developing alternatives to the SWIFT banking network since around 2012.Russia searching for SWIFT alternatives has to be near to a 10 year old Putin quest. Let me see if I can find references for it. Here:QuoteSPFSSPFS (Russian: Cиcтeмa пepeдaчи финaнcoвыx cooбщeний (CПФC), romanized: Sistema peredachi finansovykh soobscheniy, lit. 'System for Transfer of Financial Messages') is a Russian equivalent of the SWIFT financial transfer system, developed by the Central Bank of Russia.[1] The system has been in development since 2014, when the United States government threatened to disconnect Russia from the SWIFT system.[2]https://en.wikipedia.org/wiki/SPFSThe SWIFT alternative is developed and operated by russia's central bank since 2014 ^. Peter Zeihan claims russia's central bank has been blocked internationally. Which has the potential to disconnect the SWIFT alternative they operate and manage.Maybe russia can find workarounds and fixes for attempts to destabilize their alt network. Maybe they cannot. One thing I like about Zeihan's commentary is he provides hard analysis for his claims, such as russian bonds potentially defaulting in april of 2023.The whole thing depends on communications. The infrastructure is there for all countries to communicate over the Internet, if the leaders don't pull the plug on each other. And Russian and Chinese programmers, for example, are very capable. And when you consider things like IPFS, the info can't be taken off the Internet without taking the whole Internet down.As for Zeihan's commentaries, he is talking from the standpoint of the already-built, standard system that we are familiar with. For example. In America we have a system of farms that sell product to middlemen who get that product through a trucking system, and then refine it for use in stores. But more and more there are what we call preppers, who are not depending on the American agricultural system except in small ways... and some of them not at all.Zeihan might say that these preppers are dying or failing, simply because they are outside the standard system. But it turns out that they aren't dying at all. In fact, most of them are far healthier than average customers of the system. If Zeihan wants to play within the system, this doesn't mean that those outside the system don't have a system of their own, even though it isn't popular in the media.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coolcoinz",
      "created_time": "February 03, 2023, 01:26:01 PM",
      "body": "Quote from: o48o on February 02, 2023, 09:28:08 PMWe all have subjects we don't know anything about, and when you are in business of being popular in the internet, people tend to except that you have a strong opinion about everything. I find that culture weird. It's like they are being seen as weak if they need more data to form an opinion. Him saying that bitcoin is a pyramid scam is more or less popular view that people were saying about altcoins while back and about NFTs right now. So i am guessing he hasn't really looked into it, or got that opinion from his friend who also has strong opinions. But i totally understand that opinion, it's the easiest one to have.That being said, What he says in the video is pretty much spot on and it's really nothing new as it's public info anyone who has been paying attention knows already. But there's one more thing he clearly haven't mastered and that's editing audio. That was pain to listen with headphones. I am not sure, maybe the guy has a hearing loss or something but there was this humming sound blurring the voice. He should hire an audio guy to oversee the recording and mastering. I agree this is probably not his view but something he grew into after watching enough of mainstream media channels. You can hear a lot of these people on TV. A good example is that actor from Gotham who testified in the FTX case, even though he's not an expert and shows that he has a very basic understanding of the thing. I heard that and there's a very faint sound of tune in the background. I think someone added the humming and the melody behind it on purpose to create a feeling of tension among listeners but failed. The sound is just annoying, it doesn't add anything to the video.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}