{
  "id": "topic_5416674",
  "title": "Accardo",
  "author": "Accardo",
  "created_time": "October 11, 2022, 01:10:20 AM",
  "content": "A cryptographer named Michael Clear declined the wonderful offer, after he was said to be Satoshi. Accepting the false claim would have made him famous till date but he made the right choice. Hence, someone is in court paying lots of money to lawyers claiming to be Satoshi, what an Irony. I think the people decides who is Satoshi then its left for the person to accept or decline like Michael Clear a good man - a bad fellow would have used the opportunity to execute illicit operation on bitcoin and extorting funds from those that sent him mails. His online activities proofs he is not Satoshi indeed!Photo Credit; @RizoWOULD YOU DECLINE SUCH AN ACCUSATION?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5416674",
  "comments": [
    {
      "author": "bittraffic",
      "created_time": "October 11, 2022, 01:29:09 AM",
      "body": "Never really saw a thread about him being Satoshi despite me being in crypto for more than 5 years.He doesn't look like a tech guy who can code but a member of a rock band. But he advocates privacy of course he will decline just as the real Satoshi would. There is nothing worth keeping for someone who has everything but privacy. You wouldn't want to live like the actors and actresses who keep hiding from the public and can't even go to a park to walk their dogs.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GreatArkansas",
      "created_time": "October 11, 2022, 01:33:55 AM",
      "body": "Yeah, first time to heard and see this guy. The only normal citizen that I know that was suspected to be Satoshi (founder of Bitcoin) is Dorian Nakamoto, which came from the country of Japan.I am not sure for this guy (Michael Clear) why telling them that it's Satoshi, maybe of his job, as a cryptographer.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "October 11, 2022, 02:21:09 AM",
      "body": "Interestingly enough, of all the rumoured Satoshis, this is the guy I literally haven't heard about once.Quote from: Accardo on October 11, 2022, 01:10:20 AMWOULD YOU DECLINE SUCH AN ACCUSATION? An easy yes. God knows what the authorities would do to a person that actually invented Bitcoin; not-so-nice things, safe to assume.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fundamentals Of",
      "created_time": "October 11, 2022, 02:43:58 AM",
      "body": "Only a weird man would be happy accused or alleged to be Satoshi Nakamoto. What would I gain if others think that I'm Satoshi Nakamoto? I would be kinda popular but what will I gain out of that popularity? Death threats? Actual attempts even? Or even deriding remarks, mockery, criticisms, etc? Would I even earn from that popularity? At the end of the day, the truth will come out that I'm not Satoshi, that I don't even know much of what Satoshi have gone through, can't sign a message from those old addresses, can't move those old Bitcoin, etc. I'd rather just be true to myself and save myself from all the shit that comes along with it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Franctoshi",
      "created_time": "October 11, 2022, 02:47:02 AM",
      "body": "I don't think that a normal/reasonable human being would even try to claim ownership of another person's achievement , let alone as a cryptographer he is, he already knew the implications involved if he had done that, Because for you to claim to be Satoshi there are proofs you need provide to be believed, Therefore this so called Faketoshi, I don't see him as normal human being, looks like someone that has ulterior motive against Bitcoin or maybe he's looking for cheap popularity.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "autumnleaf",
      "created_time": "October 11, 2022, 03:27:40 AM",
      "body": "Quote from: bittraffic on October 11, 2022, 01:29:09 AMNever really saw a thread about him being Satoshi despite me being in crypto for more than 5 years.He doesn't look like a tech guy who can code but a member of a rock band. But he advocates privacy of course he will decline just as the real Satoshi would. There is nothing worth keeping for someone who has everything but privacy. You wouldn't want to live like the actors and actresses who keep hiding from the public and can't even go to a park to walk their dogs.That's what I thought when I saw his face, too, lol!Anyhow, a lot of random guys have already claimed that he is Satoshi, but nobody has been able to show proof of this as of yet. I believe we should keep Satoshi's identity a secret since he did an excellent job of creating Bitcoin, and I'm sure he is happy, from wherever he is, that Bitcoin has come a long way to achieve its current status.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OgNasty",
      "created_time": "October 11, 2022, 04:50:03 AM",
      "body": "Quote from: Accardo on October 11, 2022, 01:10:20 AMWOULD YOU DECLINE SUCH AN ACCUSATION? I think any sane person would.  The amount of harassment that you and your family would have to deal with as internet sleuths and reporters all dig to try and find clickbait would be enough to drive anyone crazy.  Look at others who have been accused of being satoshi...  It is never a welcomed thing that they enjoy.  Not to mention the security issues of people knowing you have billions of dollars.  It might be funny to be accused if it was obvious you weren't, but if there were any real interest being it, it would be a nightmare.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SquirrelJulietGarden",
      "created_time": "October 11, 2022, 05:52:13 AM",
      "body": "Simply thinking about it like thisAssume you are real Satoshi Nakamoto, are you ready to disclose yourself? I believe you won't because you know that your life will be under risk and serious observation from governments as well as Bitcoin community. If you are smart enough to create Bitcoin, you would be wise enough to have in-depth thinking about such risks. You also are fully aware that if you disclose your identity, you lose it forever.Again another topic about Satoshi.The List Satoshi Nakamoto ThreadI gathered every Satoshi Nakamoto thread.I don't have interests to read all those topics but if you want, I think you can find something to support your topic.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kakmakr",
      "created_time": "October 11, 2022, 06:04:43 AM",
      "body": "You have to be a special kind of narcissist to claim that you are Satoshi Nakamoto, if you are not him/her or them.    Only a ego maniac like CW will attempt to claim that title and I hope it backfire on him.  I hope IF he succeeds... that the authorities will go down on him like a pack of wolves and that they will show him what the governments will do to people, when they challenge their authority/monopoly. (They are waiting for a centralized figure head to recieve that title, because they can only start with their revenge...when it is official)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yazher",
      "created_time": "October 11, 2022, 08:42:37 AM",
      "body": "Quote from: Accardo on October 11, 2022, 01:10:20 AMWOULD YOU DECLINE SUCH AN ACCUSATION? Well! you can't be far from getting arrested once the truth will come out and that's the worst-case scenario after getting some praise from the people which will gonna turn into humiliation once they know you are a crook. Also, the money that you will get from those people will be the same money you will be paying for the fines and that would not be enough and you will end up taking some loans just to pay the damages of what you have done to yourself claiming to be a person you never been was.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NeuroticFish",
      "created_time": "October 11, 2022, 08:49:01 AM",
      "body": "Quote from: Accardo on October 11, 2022, 01:10:20 AMWOULD YOU DECLINE SUCH AN ACCUSATION? I don't know who is this guy, like many others I've never heard of him.But yes, I would decline such accusation. And the reasons are many:1. Since I know I cannot prove it cryptographically that I am Satoshi, I would be just another Faketoshi.2. I guess that many reporter and madman would be looking me up, disturbing me and my family with good and bad, including hate.3. If I would become somewhat convincing that I could be Satoshi, some may want me dead or come for my alleged money.4. A convincing enough Satoshi could do very bad to Bitcoin (as price and also as community and development).So why bother? It cannot do anything good neither to me, nor to Bitcoin itself.PS. If Satoshi is alive and well, I am sure he thinks the same (of course, excepting point 1), no matter how much noise some try to do in order to make him step forward.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "casinotester0001",
      "created_time": "October 11, 2022, 09:42:43 AM",
      "body": "The New Yorker’s author Joshua Davis then asked Clear again whether he was Satoshi Nakamoto. “I’m not Satoshi,” Clear responded. “But even if I was I wouldn’t tell you.”source:https://news.bitcoin.com/pinning-the-tail-on-satoshi-nakamoto-how-journalists-erroneously-used-circumstantial-evidence-over-the-years-to-identify-bitcoins-creator/When you want to understand this thread, I recommend you to read that article  https://www.newyorker.com/magazine/2011/10/10/the-crypto-currency10/Oct/2011",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "348Judah",
      "created_time": "October 11, 2022, 11:26:10 AM",
      "body": "Quote from: Accardo on October 11, 2022, 01:10:20 AMA cryptographer named Michael Clear declined the wonderful offer, after he was said to be Satoshi. Accepting the false claim would have made him famous till date but he made the right choiceIt couldn't because we know the exact and prompt means to identify the real Satoshi, if he could sign a message or not is one of the best m ways and moreso, why should he accepts or claim what he's not, that should be impersonating enough and a thing of big shame on his reputation provided that he's reasonable enough to realise the fact, Craig among many others were also struggling on this self proclamation to be Satoshi.Quote from: Accardo on October 11, 2022, 01:10:20 AMHence, someone is in court paying lots of money to lawyers claiming to be Satoshi, what an Irony. I think the people decides who is Satoshi then its left for the person to accept or decline like Michael Clear a good man - a bad fellow would have used the opportunity to execute illicit operation on bitcoin and extorting funds from those that sent him mails.This is what their type want, money, recognition and power, they are the types that like to claim on other's people efforts and works as theirs, everything they know how to do is plagiarism and still yet they don't want to aggree to the fact that what they are doing is wrong.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "livingfree",
      "created_time": "October 11, 2022, 11:30:14 AM",
      "body": "Never heard of this guy but I've seen some other names that have been accused for being satoshi and has some good proof of connection why they're accused as satoshi himself.Well, as this guy has declined of the accusation, he should actually decline it and there's no strong evidence that can prove that it's him. While some other guy we knew that's trying to prove himself and claiming that he's satoshi, only him calls and admits that he is. I'm sure that all of you guys are aware of this guy and spending a lot of money in court for this claim.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Obito",
      "created_time": "October 11, 2022, 11:36:05 AM",
      "body": "Quote from: Accardo on October 11, 2022, 01:10:20 AMWOULD YOU DECLINE SUCH AN ACCUSATION? I would decline because there's no point in pretending, they will eventually catch your lies and you don't really want to be in that situation because your life will turn upside down as fast as you've made it when you didn't decline the accusation. Imagine this, would you be annoyed when people talk to you about the stuff that someone did? If yes then you would get why it's best if you decline the accusation outright.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TribalBob",
      "created_time": "October 11, 2022, 01:21:12 PM",
      "body": "Quote from: autumnleaf on October 11, 2022, 03:27:40 AMQuote from: bittraffic on October 11, 2022, 01:29:09 AMNever really saw a thread about him being Satoshi despite me being in crypto for more than 5 years.He doesn't look like a tech guy who can code but a member of a rock band. But he advocates privacy of course he will decline just as the real Satoshi would. There is nothing worth keeping for someone who has everything but privacy. You wouldn't want to live like the actors and actresses who keep hiding from the public and can't even go to a park to walk their dogs.That's what I thought when I saw his face, too, lol!Anyhow, a lot of random guys have already claimed that he is Satoshi, but nobody has been able to show proof of this as of yet. I believe we should keep Satoshi's identity a secret since he did an excellent job of creating Bitcoin, and I'm sure he is happy, from wherever he is, that Bitcoin has come a long way to achieve its current status.haha me too, when i first saw the photo i thought instead he was just a rock singer who finished a gig, far for Satoshi to say,and in my mind a Satoshi is a person who comes from Japan with a cute face,",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "taufik123",
      "created_time": "October 11, 2022, 03:06:09 PM",
      "body": "I even just heard the name Michael Clear which was previously only filled by the name Craig Wright as a person who claims to be the creator of Bitcoin Satoshi Nakamoto, even proclaims himself and opposes anyone who doubts him. But unlike Michael Clear, he is a real man who doesn't want to confess despite being called a satoshi and that is the right and wise choice.For the latest news, Craig Wright, according to several sources, his life has become more difficult because he has proclaimed himself the creator of bitcoin and a number of technology giant companies have made several lawsuits against him.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tjtonmoy",
      "created_time": "October 11, 2022, 03:42:01 PM",
      "body": "Quote from: Accardo on October 11, 2022, 01:10:20 AMWOULD YOU DECLINE SUCH AN ACCUSATION? Of course, i will decline. I am not qualified to be at that spot to be called Satoshi or a lair to introduce myself as someone i am not. I prefer myself to be an introvert. So my room is my world. I don't want to go out or earn public fame to ruin my world. I am happy as who i am right now. By the way, Maybe Satoshi himself is reading this. Then here's what i have to say to him - You have paved the path, and we will walk on that to make your dream come true. We support you through every ups and downs. You are a legend, man.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Davidvictorson",
      "created_time": "October 11, 2022, 04:08:59 PM",
      "body": "Yea, I remember the stress Dorian Nakamoto had to go through almost 8 years ago trying to let the public know that he is not Satoshi. But the question that begs for an answer is what is the probability that the real Nakamoto Satoshi would gladly accept that he is the founder of BTC if ever there was a claim? The real Nakamoto Satoshi  just doesn't want publicity and wants to live a normal life. Imagine the publicity and disruption to his life if he revealed his identity. Imagine him getting interviewed all the time being asked about the price, being at risk of being robbed, and might even be sued for some dumb reasons.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}