{
  "id": "topic_5448879",
  "title": "bitcoin_pirate",
  "author": "bitcoin_pirate",
  "created_time": "April 14, 2023, 08:08:20 PMLast edit: April 14, 2023, 08:20:49 PM by bitcoin_pirate",
  "content": "Hello, I’m looking to run a node on one of the following:HP ProDesk 400 G3 CPU i5-6500T (2.50GHz) 1 x 16gb DDR4 ram OrHP EliteDesk 800 G3 CPU i7-6700 (3.40GHz)1 x 16gb DDR4 ramIs the i7 worth the extra $?Also when it comes to the storage I don’t know if I should go for M2 NVMe SSD or SATA-3 (6Gb/s) SSD? Was thinking 1TB would be enough as I have NAS for personal storage and this will be purely for Bitcoin.Thanks for you help in advance!",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5448879",
  "comments": [
    {
      "author": "HeRetiK",
      "created_time": "April 14, 2023, 09:13:42 PM",
      "body": "What's your use case? Do you just want to run a node to help the network and maybe have a full node to experiment on, do you want to run a server for commercial purposes, do you want to run a LN routing node?For running a simple Bitcoin node generally speaking either should be fine as, as you'll probably only feel a real difference by how long it will take for your node to do the initial sync. Depending on what else you are planning to do with your PC I personally would prefer the i7 over the i5, though that really comes down to budget and how much the price difference is. If it's really just a plain old Bitcoin node with no other use cases, an i5 should imho be enough. If you plan on building a LN routing node with a considerable amount of channels, the i7 might be indeed more attractive. Keep in mind that Bitcoin nodes can run on hardware as simple as RaspberryPi 4 or lower, at least ignoring running a LN node on top.Same for storage. Generally speaking for running a node either should be fine, so in my opinion it again really depends on what else you plan on doing with your PC, budget and price difference. Though the last time I checked I believe M2 NVMe SSDs were actually even cheaper or about as expensive as a SATA-3 SSD despite considerably better performance.1 TB should be enough, though I would keep an eye on SSD health. If you accidentally buy a model with a bad track record or unlucky firmware [1] its lifespan could be considerably shorter than expected.[1] https://www.tomshardware.com/news/samsung-980-pro-ssd-failures-firmware-update",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitcoin_pirate",
      "created_time": "April 14, 2023, 09:56:38 PM",
      "body": "My initial use case is for increased privacy, better coin management and do “my bit” for the network.Still learning about LN nodes, no intention for routing, just exploring LN for personal use. Read a lot about people mismanaging their channels so to start with just easing into it.Yeah I know a node can be run on a RPi as many many people do and enjoy it. However cost wise for me there’s not a lot in it, so for the smoother and faster performance, spending a little bit more is worth it, I will avoid buyer’s remorse   Yes I have noticed the prices for M2 NVMe SSDs to be cheaper!   This is what threw me as I was under the impression the performance is better and I see a lot of people using SATA 3s. I’ll be sure to check the health.Thanks for your advice!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nc50lc",
      "created_time": "April 15, 2023, 03:35:21 AM",
      "body": "Quote from: bitcoin_pirate on April 14, 2023, 08:08:20 PMIs the i7 worth the extra $?Quote from: bitcoin_pirate on April 14, 2023, 09:56:38 PMHowever cost wise for me there’s not a lot in it, so for the smoother and faster performance, spending a little bit more is worth it, I will avoid buyer’s remorse  Bitcoin Core may not use the extra logical cores advantage of i7, but if you can afford it, why not.It can provide you a lot of room for other Bitcoin-related software like a public Electrum server in your machine.Just make sure to tell Bitcoin Core to use you RAM by setting a higher dbcache setting.Quote from: bitcoin_pirate on April 14, 2023, 09:56:38 PMYes I have noticed the prices for M2 NVMe SSDs to be cheaper!   This is what threw me as I was under the impression the performance is better and I see a lot of people using SATA 3s. I've been using a \"Western Digital Sata3 SSD Green\" for more than 2 years now and its health is still at 83%.I can't make a comparison with M2 NVMe SSD though.Performance-wise, it's only heavily used during IBD.After that, it's 90% of the time at low usage.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LoyceV",
      "created_time": "April 15, 2023, 09:42:56 AM",
      "body": "Quote from: bitcoin_pirate on April 14, 2023, 08:08:20 PMIs the i7 worth the extra $?If you're only running a node: no. Keep in mind the i7 consumes up to 30W more. In general, I prefer less heat coming out of my computer.Quote from: bitcoin_pirate on April 14, 2023, 09:56:38 PMMy initial use case is for increased privacy, better coin management and do “my bit” for the network.Running your node through Tor gives the best privacy, but that also means the Tor network speed will probably be the bottleneck. And in that case faster hardware doesn't matter anymore.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "odolvlobo",
      "created_time": "April 15, 2023, 11:34:22 AM",
      "body": "Quote from: bitcoin_pirate on April 14, 2023, 08:08:20 PMI’m looking to run a node on one of the following: ...I am running a Bitcoin/Lightning/Electrs node on a Raspberry Pi Model 4 with 8 GB RAM and an external SSD. You don't need anything more than that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ABCbits",
      "created_time": "April 15, 2023, 11:50:43 AM",
      "body": "Quote from: bitcoin_pirate on April 14, 2023, 08:08:20 PMHP ProDesk 400 G3 CPU i5-6500T (2.50GHz) 1 x 16gb DDR4 ram OrHP EliteDesk 800 G3 CPU i7-6700 (3.40GHz)1 x 16gb DDR4 ramIs the i7 worth the extra $?It heavily depends on how much additional money you're going to pay. In addition, you need to consider these,1. Both PC use Intel CPU which released on 2015.2. Extra 30W might be worth for extra 4 thread and 36% faster base speed (2.5 GHz vs 3.4 GHz).Quote from: bitcoin_pirate on April 14, 2023, 08:08:20 PMAlso when it comes to the storage I don’t know if I should go for M2 NVMe SSD or SATA-3 (6Gb/s) SSD? Both are sufficient to run Bitcoin full node. NVMe SSD generally is better choice while only a bit more expensive, but you need to make sure your PC has slot for NVMe SSD.Quote from: LoyceV on April 15, 2023, 09:42:56 AMQuote from: bitcoin_pirate on April 14, 2023, 09:56:38 PMMy initial use case is for increased privacy, better coin management and do “my bit” for the network.Running your node through Tor gives the best privacy, but that also means the Tor network speed will probably be the bottleneck. And in that case faster hardware doesn't matter anymore.But unless you use Tor for IBD, the bottleneck won't be that noticeable.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "arabspaceship123",
      "created_time": "April 19, 2023, 12:43:37 AM",
      "body": "You can run a node with no trouble on a 4gb RAM Raspberry Pi 4 using 1tb SATA3 so compare with Prodesk 400 G3 & Elitedesk 400 G3 they'll make insubstantial progress compiling over RPi4.If you haven't procured the HP you'd be better trying a Pi  Quote from: bitcoin_pirate on April 14, 2023, 08:08:20 PMHello, I’m looking to run a node on one of the following:HP ProDesk 400 G3 CPU i5-6500T (2.50GHz) 1 x 16gb DDR4 ram OrHP EliteDesk 800 G3 CPU i7-6700 (3.40GHz)1 x 16gb DDR4 ramIs the i7 worth the extra $?Also when it comes to the storage I don’t know if I should go for M2 NVMe SSD or SATA-3 (6Gb/s) SSD? Was thinking 1TB would be enough as I have NAS for personal storage and this will be purely for Bitcoin.Thanks for you help in advance!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PawGo",
      "created_time": "April 19, 2023, 07:06:43 AM",
      "body": "There is also a question if you want to use any other services, like Electrum server or RPC browser. Anyway, I have a strong feeling that even if better CPU may give some gains, you would observe them only in the initial phase (blockchain downloading and parsing, electrum database  building etc), not during normal usage. And remember to adapt bitcoin node memory settings, I think you may assign more memory to that process for faster processing. Answering the question from the subject - does not really matter in my opinion. In fact, you may even use hybrid mode, where you store raw blockchain files on slow disk and only indexes etc. on fast ssd.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "arabspaceship123",
      "created_time": "April 19, 2023, 10:15:14 AM",
      "body": "Indexing speeds shouldn't matter between CPU i5-6500T (2.50GHz) or CPU i7-6700 (3.40GHz) if all he's trying to come by is a node. Mynodebtc delivers the node he's looking for coupled with Electrum, lightening, mempool, explorer & extras.  RPi4 can handle it accompanying nominal electricity expenses. Quote from: PawGo on April 19, 2023, 07:06:43 AMThere is also a question if you want to use any other services, like Electrum server or RPC browser. Anyway, I have a strong feeling that even if better CPU may give some gains, you would observe them only in the initial phase (blockchain downloading and parsing, electrum database  building etc), not during normal usage. And remember to adapt bitcoin node memory settings, I think you may assign more memory to that process for faster processing. Answering the question from the subject - does not really matter in my opinion. In fact, you may even use hybrid mode, where you store raw blockchain files on slow disk and only indexes etc. on fast ssd.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "serveria.com",
      "created_time": "April 23, 2023, 10:56:04 AM",
      "body": "Quote from: bitcoin_pirate on April 14, 2023, 09:56:38 PMMy initial use case is for increased privacy, better coin management and do “my bit” for the network.Still learning about LN nodes, no intention for routing, just exploring LN for personal use. Read a lot about people mismanaging their channels so to start with just easing into it.Yeah I know a node can be run on a RPi as many many people do and enjoy it. However cost wise for me there’s not a lot in it, so for the smoother and faster performance, spending a little bit more is worth it, I will avoid buyer’s remorse   Yes I have noticed the prices for M2 NVMe SSDs to be cheaper!   This is what threw me as I was under the impression the performance is better and I see a lot of people using SATA 3s. I’ll be sure to check the health.Thanks for your advice!NVMe should be a lot faster than SATA. More people are using SATA because it's compatible with lots of older hardware. For NVMe you need a mobo which supports it. So, even if NVMe drives might cost less, full setup with NVMe support can be more costly than one with SATA3.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "alecfisker",
      "created_time": "April 27, 2023, 07:59:39 AM",
      "body": "will work on both, although newer components became much more power efficient, in long term will pay for itself",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "darkv0rt3x",
      "created_time": "April 27, 2023, 10:26:08 PM",
      "body": "Don't forget also to check if the best component you choose, won't make other components to bottleneck your system.What I mean is that it's worthless if you buy a low rate cpu and then you choose to buy an NVMe drive. Your cpu will bottleneck the system and you won't be able to see any big advantage over any other system. The opposite is the same. Don't choose the best cpu in the market and then buy an USB3 SDD rive or something like that because in that case, the HDD will bottleneck the system!I did this last mistake. I bought an NVMe drive but I am using it with a RockPro64 board. The cpu in this board is good but not good enough to handle the speed of the drive when I did the IDB. It still took me a few days to complete the IDB when I thought I could do it under a day, from what I was used to see on the internet!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}