{
  "id": "topic_5414202",
  "title": "Question:",
  "author": "Becassine",
  "created_time": "September 20, 2022, 06:43:49 AM",
  "content": "Bonjour,Il me semble que ce serait intéressant de faire un comparatif des coldwallets. Il me semble que Ledger n'est pas très bon en SAV et, bien que ce soit français, semble ne pas trop s'intéresser aux clients français qui ne maîtrisent pas la langue de Shakespeare. Vos avis ?Bonne journée à tous et encore merci à ceux qui répondent. Je vous ai envoyé le peu de smerits que j'avais. (On ne sait jamais, j'en aurais peut-être d'autres)",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5414202",
  "comments": [
    {
      "author": "elma",
      "created_time": "September 20, 2022, 03:33:34 PM",
      "body": "Pinaise, t'as dégoté une liste très longue de wallets...je savais même pas que certains existaient !Il manque quand même le Lattice1 de Gridplus (  Groswesh) même s'il est sold-out, même si je ne l'ai pas essayé.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GrosWesh",
      "created_time": "September 20, 2022, 04:32:35 PM",
      "body": "Quote from: elma on September 20, 2022, 03:33:34 PMPinaise, t'as dégoté une liste très longue de wallets...je savais même pas que certains existaient !Il manque quand même le Lattice1 de Gridplus (  Groswesh) même s'il est sold-out, même si je ne l'ai pas essayé.Exact   ! Probablement la rolls des hardware wallets : https://gridplus.io/products/grid-lattice1Apparemment bientôt de nouveau disponible d'ailleurs (fin septembre, début octobre).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Melja",
      "created_time": "September 20, 2022, 05:19:09 PM",
      "body": "Quote from: GrosWesh on September 20, 2022, 04:32:35 PMQuote from: elma on September 20, 2022, 03:33:34 PMPinaise, t'as dégoté une liste très longue de wallets...je savais même pas que certains existaient !Il manque quand même le Lattice1 de Gridplus (  Groswesh) même s'il est sold-out, même si je ne l'ai pas essayé.Exact   ! Probablement la rolls des hardware wallets : https://gridplus.io/products/grid-lattice1Apparemment bientôt de nouveau disponible d'ailleurs (fin septembre, début octobre).Effectivement,et il est gros comme une rolls. C'est quasi la taille d'un minitel,hyper pratique quand tu voyages.Pour moi,tout ce qui ne rentre pas dans une poche c'est exit",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "elma",
      "created_time": "September 20, 2022, 06:28:45 PM",
      "body": "Quote from: Melja on September 20, 2022, 05:19:09 PMEffectivement,et il est gros comme une rolls. C'est quasi la taille d'un minitel,hyper pratique quand tu voyages.Pour moi,tout ce qui ne rentre pas dans une poche c'est exit  pffff....c'est pour ceux qui voyagent en jet et qui ont des porteurs de valises, manant.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LeGaulois",
      "created_time": "September 20, 2022, 08:25:28 PM",
      "body": "J'ai voté Ledger. BBR oblige  Par contre, c'est un peu vite les juger pour leur SAV. Dans la plupart des cas, les gens les contactent pour des faux problèmes, car quand tu regardes de plus près, en fait les gens ne savent pas utiliser la crypto. Tu as ceux qui ronchonnent parce qu'ils ont envoyer des cryptos sur leur wallet et c'est toujours pas \"crédité\", mais non pas compris les frais. Tu as ceux qui pensent que leur ledger live a été piraté, alors que ce n'est techniquement pas possible. Et tu as ceux qui les contactent alors que tout est expliqué sur leur site.Tout ca ensemble, ca consomme beaucoup de ressources inutiles pour eux et c'est la majorité des cas.C'est un peu comme les pompiers avec les gens qui appellent pour demander l'heure, ou la vieille dame qui veut que les pompiers se déplacent pour porter les courses du salon à la cuisine parce qu'elle est fatiguée (véridique).Bon après, il y a toujours quelque chose à améliorer (comme partout), je pense que certains préfèrent mettre l'accent sur le SAV, alors que d'autres préfèrent mettre des ressources sur la sécurité des produits.Perso, je préfère la sécurité, le SAV tu en as rarement besoin et même si tu rencontres une difficulté, il y a tout ce qu'il faut sur le web",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "F2b",
      "created_time": "September 22, 2022, 07:45:46 AMLast edit: September 22, 2022, 08:53:58 PM by F2b",
      "body": "Quote from: elma on September 20, 2022, 06:28:45 PMQuote from: Melja on September 20, 2022, 05:19:09 PMEffectivement,et il est gros comme une rolls. C'est quasi la taille d'un minitel,hyper pratique quand tu voyages.Pour moi,tout ce qui ne rentre pas dans une poche c'est exit  pffff....c'est pour ceux qui voyagent en jet et qui ont des porteurs de valises, manant.  Sur une note un peu plus sérieuse, ça peut être utile d'avoir un wallet que tu peux planquer ou transporter facilement. (Ah, et vu que je suis radin : cher comme une Rolls, aussi. Même si vu le bousin ça doit être justifié.)Bon perso je n'utilise pas de HW wallet (pas encore, j'suis pas assez riche ).Quote from: Becassine on September 20, 2022, 06:43:49 AMBitBoxDu coup je connais pas en particulier, mais c'est le wallet qu'a choisi Bitcoin Lyon, donc j'imagine que ça doit pas être de la merde.Quote from: Becassine on September 20, 2022, 06:43:49 AMColdkeyC'est pas le truc de yogg ça ? Attention c'est pas un HW wallet comme tu l'entends. De ce que j'ai compris ça se rapproche plus d'un bitcoin physique (tu peux envoyer des fonds dessus, mais pour dépenser il faut retirer une sorte de pellicule pour dévoiler la clé privée).Edit :Quote from: Becassine on September 20, 2022, 06:43:49 AMJe vous ai envoyé le peu de smerits que j'avais. (On ne sait jamais, j'en aurais peut-être d'autres)N'hésite pas à dire, j'en ai en rab'Edit: related topic: https://bitcointalk.org/index.php?topic=5288971.0",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GrosWesh",
      "created_time": "September 22, 2022, 04:24:28 PM",
      "body": "Quote from: F2b on September 22, 2022, 07:45:46 AMQuote from: elma on September 20, 2022, 06:28:45 PMQuote from: Melja on September 20, 2022, 05:19:09 PMEffectivement,et il est gros comme une rolls. C'est quasi la taille d'un minitel,hyper pratique quand tu voyages.Pour moi,tout ce qui ne rentre pas dans une poche c'est exit  pffff....c'est pour ceux qui voyagent en jet et qui ont des porteurs de valises, manant.  Sur une note un peu plus sérieuse, ça peut être utile d'avoir un wallet que tu peux planquer ou transporter facilement. (Ah, et vu que je suis radin : cher comme une Rolls, aussi. Même si vu le bousin ça doit être justifié.)Hello F2b   Je ne possède pas personnellement ce wallet (lattice1) mais je le connais car je suit le projet (et ai investi dedans) que ses créateurs mènent (il s'agit de 'Phonon', qui propose le transfert de tous types d'actifs numériques offchain - Projet actuellement encore en phase de test).Concernant le lattice1, la taille de son écran permet simplement de visualiser pour ceux qui le souhaitent de nombreuses informations avant la validation d'une transaction. Là où un wallet de taille réduite se contente d'offrir un résumé plus succinct. Peu utile pour la plupart d'entre nous il faut le reconnaitre. Il faut déja savoir bien décrypter les tx et cela doit éventuellement être utile à des gens impliqués dans des protocoles defi, par exemple.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yogg",
      "created_time": "September 22, 2022, 07:40:04 PM",
      "body": "Quote from: F2b on September 22, 2022, 07:45:46 AMQuote from: Becassine on September 20, 2022, 06:43:49 AMColdkeyC'est pas le truc de yogg ça ? Attention c'est pas un HW wallet comme tu l'entends. De ce que j'ai compris ça se rapproche plus d'un bitcoin physique (tu peux envoyer des fonds dessus, mais pour dépenser il faut retirer une sorte de pellicule pour dévoiler la clé privée).Tout à fait.C'est pas un hardware wallet dans le sens où il n'y a pas d’électronique dedans.C'est plutôt un cold storage wallet, et c'est le même principe que les bitcoins physiques.  Et pour dépenser, il faut abîmer la carte de manière irreversible et très très visible.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GrosWesh",
      "created_time": "November 01, 2022, 07:39:40 PM",
      "body": "J'ai pensé à ce thread on découvrant aujourd'hui l'application 'Airgap'. https://airgap.it/Je ne l'ai pas personnellement testée mais sur le papier ça semble intéressant. Elle permet de transformer un téléphone dont on ne se sert plus en hardware wallet ('the vault') hors ligne et signer les tx avec votre smartphone de tous les jours.\"vous pouvez signer des transactions complètement hors ligne sur un appareil sans aucune connectivité réseau avec l'application AirGap Vault et les diffuser avec votre smartphone de tous les jours avec l'application AirGap Wallet.\"A tester éventuellement, bien que je suis sur que certains ici ont déja recours à ce genre de chose avec BTC d'eux mêmes sans appli. L'intêret de cette dernière étant la prise en charge d'un grand nombre d'assets differents (dont tous ceux non pris en charge par ledger etc...).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "F2b",
      "created_time": "November 01, 2022, 11:09:56 PM",
      "body": "Quote from: GrosWesh on November 01, 2022, 07:39:40 PMJ'ai pensé à ce thread on découvrant aujourd'hui l'application 'Airgap'. https://airgap.it/Je ne l'ai pas personnellement testée mais sur le papier ça semble intéressant. Elle permet de transformer un téléphone dont on ne se sert plus en hardware wallet ('the vault') hors ligne et signer les tx avec votre smartphone de tous les jours.Tien ça a l'air intéressant ça.Après si on veut pinailler, on n'est pas au niveau d'un vrai HW wallet car même si ton Android te dit que le Wifi est désactivé, en général c'est difficile à vérifier (/ déconnecter physiquement), alors que dans un vrai HW wallet le hardware est également conçu avec la sécurité en tête. Mais bon, c'est du détail, ça reste intéressant par rapport à un portefeuille chaud.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GrosWesh",
      "created_time": "November 02, 2022, 06:18:01 PM",
      "body": "Quote from: F2b on November 01, 2022, 11:09:56 PMTien ça a l'air intéressant ça.Après si on veut pinailler, on n'est pas au niveau d'un vrai HW wallet car même si ton Android te dit que le Wifi est désactivé, en général c'est difficile à vérifier (/ déconnecter physiquement), alors que dans un vrai HW wallet le hardware est également conçu avec la sécurité en tête. Mais bon, c'est du détail, ça reste intéressant par rapport à un portefeuille chaud.Oui mais si tu utilises un smarphone sans carte sim et non connecté au wifi ça doit être bon, non ? Je me plante peut être mais je pense qu'il suffit d'installer l'appli via le wifi, en effet, puis de supprimer les identifiants de connection ensuite ? Bon je pinaille moi aussi",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "F2b",
      "created_time": "November 03, 2022, 06:10:13 AMLast edit: November 04, 2022, 10:56:30 AM by F2b",
      "body": "Quote from: GrosWesh on November 02, 2022, 06:18:01 PMOui mais si tu utilises un smarphone sans carte sim et non connecté au wifi ça doit être bon, non ? Je me plante peut être mais je pense qu'il suffit d'installer l'appli via le wifi, en effet, puis de supprimer les identifiants de connection ensuite ? Bon je pinaille moi aussi  Ben ça dépend de ta définition de \"ça doit être bon\". En soi, oui, pour la majorité des gens c'est bon, car c'est largement mieux que n'importe quel portefeuille chaud a priori.Maintenant, les gens dont c'est le job de concevoir des HW wallets (donc, par définition, des grands paranos) vont te dire que le fait que le Wifi soit désactivé ne garantit pas que la puce wifi le soit aussi, pareil pour les autres technologies. À partir de là, même si en théorie ça ne pose pas de problème, on ne sait jamais, ça élargit la surface d'attaque. Après je n'y connais pas grand chose. (Edit: d'autant plus que contrairement au software d'un HW wallet, ton Android n'a pas été conçu pour être complètement hermétique au monde extérieur.)Ça me fait penser, y avait une marque (dont j'ai complètement oublié le nom) qui avait fait il y a quelques temps un smartphone où le wifi, la caméra, etc, étaient physiquement déconnectables. Bon c'est un peu off-topic mais pour le coup ce serait intéressant x)PS. désolé si le post est un peu confus, je suis pas encore bien réveillé",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Saint-loup",
      "created_time": "November 03, 2022, 04:57:37 PMLast edit: November 03, 2022, 05:36:26 PM by Saint-loup",
      "body": "Quote from: GrosWesh on November 02, 2022, 06:18:01 PMQuote from: F2b on November 01, 2022, 11:09:56 PMTien ça a l'air intéressant ça.Après si on veut pinailler, on n'est pas au niveau d'un vrai HW wallet car même si ton Android te dit que le Wifi est désactivé, en général c'est difficile à vérifier (/ déconnecter physiquement), alors que dans un vrai HW wallet le hardware est également conçu avec la sécurité en tête. Mais bon, c'est du détail, ça reste intéressant par rapport à un portefeuille chaud.Oui mais si tu utilises un smarphone sans carte sim et non connecté au wifi ça doit être bon, non ? Je me plante peut être mais je pense qu'il suffit d'installer l'appli via le wifi, en effet, puis de supprimer les identifiants de connection ensuite ? Bon je pinaille moi aussi  Si le smartphone est infecté et surtout rooté, on pourrait imaginer qu'il puisse réenclencher le wifi silencieusement par intermittence jusqu'à trouver un jour un réseau ouvert ou dont il connait les identifiants. Par ailleurs même sans carte sim le téléphone continue d'échanger des informations avec les antennes relais, on peut d'ailleurs continuer d'appeler le 112, et les flics peuvent continuer à tracer votre téléphone. Une fuite de donnée n'est donc pas impossible en théorie (en utilisant un IMSI-catcher à proximité par exemple). Il ne faut donc pas oublier de mettre son téléphone en mode avion, mais certains téléphones ne se mettent pas tout de suite en mode avion au démarrage ou l'enlèvent carrément si le téléphone a été éteint.Mais ce qui est le plus dérangeant avec les téléphones ce sont les mises à jour des applis, il y a fort à parier qu'on doive faire des mises à jour de temps à autre ce qui à chaque fois obligera à déplacer les fonds vers un nouveau wallet.https://www.bfmtv.com/police-justice/comment-le-bornage-telephonique-est-devenu-un-outil-incontournable-des-enquetes_AN-201909120079.html",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "superresistant",
      "created_time": "November 18, 2022, 06:19:02 PM",
      "body": "Une question à se demander est quelle est le prix raisonnable d'un portefeuille pour un montant X ?Est-ce qu'il faut conseiller à un débutant de payer 150 eur pour stocker 1000 eur ? 10k eur ?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GrosWesh",
      "created_time": "November 18, 2022, 07:42:53 PM",
      "body": "Quote from: superresistant on November 18, 2022, 06:19:02 PM Une question à se demander est quelle est le prix raisonnable d'un portefeuille pour un montant X ?Est-ce qu'il faut conseiller à un débutant de payer 150 eur pour stocker 1000 eur ? 10k eur ?Bonne question mais tu places la fourchette de prix un peu trop haut imo (ledger s = 80euros, souvent de grosses promos dessus permettant de l'avoir à 50e ou encore safepal à 49euros etc).Je dirais que 50/70e pour stocker 500 ou 1000 euros de cryptos ça commence à valoir le coup. En plus du point de vue de la 'curiosité intellectuelle' et de l'attrait pour la tech c'est satisfaisant, non ?D'ailleurs depuis la chute de ftx, Ledger et ses concurrents doivent se faire de couilles en or massif !! Je n'ai jamais vu autant de discussion à ce sujet un peu partout (beaucoup de gens semblent jusqu'ici ne s'être jamais penché la dessus, et là ils ont 'peur' puisque le message est relayé partout, même sur ce forum, de retirer ses assets des cex).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "F2b",
      "created_time": "November 19, 2022, 01:31:08 PM",
      "body": "Quote from: GrosWesh on November 18, 2022, 07:42:53 PMQuote from: superresistant on November 18, 2022, 06:19:02 PMUne question à se demander est quelle est le prix raisonnable d'un portefeuille pour un montant X ?tu places la fourchette de prix un peu trop haut imo (ledger s = 80euros, souvent de grosses promos dessus permettant de l'avoir à 50e ou encore safepal à 49euros etc).Je dirais que 50/70e pour stocker 500 ou 1000 euros de cryptos ça commence à valoir le coup. [...]C'est vrai que c'est une question intéressante. Et effectivement ces derniers temps on en entend beauuuucoup parler.Même si je ne suis pas tout à fait en désaccord, j'ai été assez surpris de lire que \"pour stocker 500 ou 1000 euros de cryptos ça commence à valoir le coup\". Pourtant je pense que beaucoup de gens auraient donné un montant similaire.Perso en dessous de 1000€ ça me semble peu pour justifier l'investissement dans un HW wallet. Si on considère que les prix sont généralement entre 50€ et 150€, j'aurais plutôt dit entre 1k€ et 5k€... mais c'est purement subjectif (et je suis radin, aussi).Après ça dépend aussi l'utilisation que vous en avez. Typiquement, si vous faites des transactions régulièrement, l'achat d'un portefeuille physique se justifie assez vite (parce qu'on n'a pas envie d'importer ses clés privées sur n'importe quoi). Dans mon cas, c'est plus un portefeuille hodl, donc si je n'ai pas de HW wallet le principal vecteur d'attaque c'est le PC sur lequel je génère les clés. Ensuite tant que je ne dépense pas, HW wallet ou pas, ça ne change rien (en tout cas je pense pas ; pour recevoir il suffit d'importer la xpub). Sachant que bien sûr, puisque c'est une opération qu'on ne fait que rarement, on peut se permettre de prendre certaines précautions (vérification de l'ISO du livesystem utilisé, disque et carte wifi débranchés...).Rappelons par ailleurs (vous le savez déjà, mais on sait jamais, pour d'éventuels nouveaux) que le fait d'avoir un hardware wallet ne dispense pas de noter sa seed sur papier / métal et de la sécuriser (donc backups, passphrase stockée séparément...).Tout cela étant dit, je suis d'accord que ça fait un p'tit gadget en plus, et rien ça, ça donne envie d'en acheter un (en plus Noël approche). Du coup avec toutes ces discussions j'aurais presque envie d'en acheter un, même si j'ai pas grand chose à mettre dessus...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LeGaulois",
      "created_time": "November 19, 2022, 02:44:52 PM",
      "body": "Dépenser 100€ pour y stocker l'équivalent de 1 000€, ca représente quand même 10%. Est ce que ca vaut le coup? Je dirais que tout dépend de ce que représente une telle somme. La personne qui possède un patrimoine de 400 000€ et qui travaille pour 6 000€ par mois net, elle aura plutôt tendance à te répondre \"j'ai autre chose à foutre\". La personne avec 50€ sur un livret A et qui travaille pour 1 200€ par mois, elle aurait tendance à plus sécuriser ses fonds (sur un Ledger par ex) et même vérifier toutes les semaines si ils sont encore là.D'accord sur le fait que cela dépend de l'utilisation que l'on a, entre un pur hodler et un utilisateur régulier. Pour une personne qui fait des transactions régulièrement, je trouve ca ennuyant de devoir sortir son hardware à chaque fois. C'est plus pratique de stocker sur un logiciel, CEX ou un wallet en ligne.Pour ce qui concerne le marché des hardwares, je sais que chez Ledger, ils sont trèèès occupés en ce moment. De là à ce faire des \"couilles en or\", je sais pas trop avec ce que se prennent dans la gueule les entreprises françaises en ce moment.Par contre ca me fait sourire cette vague de quitter les CEX pour migrer vers des cold storage, sachant que ca fait des années que c'est dit et re-dit. On dirait qu'ils découvrent l'existence de l'eau chaude au robinet",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GrosWesh",
      "created_time": "November 19, 2022, 03:50:15 PM",
      "body": "Quote from: LeGaulois on November 19, 2022, 02:44:52 PMPour ce qui concerne le marché des hardwares, je sais que chez Ledger, ils sont trèèès occupés en ce moment. De là à ce faire des \"couilles en or\", je sais pas trop avec ce que se prennent dans la gueule les entreprises françaises en ce moment.Je ne sais pas ce que tu entends par 'ce que se prennent dans la gueule les entreprises françaises en ce moment'. Pour ma part j'avoue avoir un peu extrapolé en pensant qu'ils se blindent en se moment. Je me plante peut être, et j'avais aussi en tête un passage de la récente émission 'Grand Angle Crypto' dont l'invité était Eric Larchevêque (https://youtu.be/t2rmAjer3AA?t=1444)Quote from: LeGaulois on November 19, 2022, 02:44:52 PMPar contre ca me fait sourire cette vague de quitter les CEX pour migrer vers des cold storage, sachant que ca fait des années que c'est dit et re-dit. On dirait qu'ils découvrent l'existence de l'eau chaude au robinetEvidemment mais tu te rends bien compte qu'entre des gens comme nous qui vivons et respirons 'crypto' et des gens qui prennent ça beaucoup plus à la légère (pas un jugement de valeur, chacun fais ce qu'il veut) alors les reflexes et bonnes habitudes prennent parfois plus de temps à être acquis.De toute manière le fait est que les discussions concernant les hardware wallets pullulent en ce moment sur les groupes discord et telegram. Pour rester optimistes, on pourrait se dire que c'est une forme d'adoption (un peu forcée du coup )",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "F2b",
      "created_time": "November 19, 2022, 03:57:28 PMLast edit: November 29, 2022, 01:42:01 AM by F2b",
      "body": "@LeGaulois c'est intéressant, je ne voyais pas du tout les choses comme ça (un peu le contraire en fait).Quote from: GrosWesh on November 19, 2022, 03:50:15 PMEvidemment mais tu te rends bien compte qu'entre des gens comme nous qui vivons et respirons 'crypto' et des gens qui prennent ça beaucoup plus à la légère (pas un jugement de valeur, chacun fais ce qu'il veut) alors les reflexes et bonnes habitudes prennent parfois plus de temps à être acquis.Puis tu as les gens qui sont là juste pour le profit. Donc full CEX. Mais oui il y a aussi des gens qui ont juste plus de mal et qui préfèrent déléguer la sécurité de leur fonds, ça peut se comprendre (après tout, c'est pour ça que les banques existent).(espace réservé pour plus tard)Note for myself:https://en.bitcoin.it/wiki/Hardware_wallethttps://en.bitcoin.it/wiki/Storing_bitcoinshttps://bitcointalk.org/index.php?topic=5256467.0;all",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}