{
  "id": "topic_5403668",
  "title": "Synchronice",
  "author": "Synchronice",
  "created_time": "June 22, 2022, 06:29:35 PM",
  "content": "You may hate me for this speech but to my mind, patriotism is bluff! I live in Germany and Ukrainian \"refugees\" who came here, those who are rich and wealthy, party all the time, you can't even notice here that there is a war between Russia and Ukraine.So, I was thinking about the soldiers and men who stayed in Ukraine and are fighting against the Russians. For what? Ukraine is one of the most corrupted country. Rich and wealthy people, business owners and corruptionists and their children and family members will not war, they will get a business class ticket and leave the country with their wealth, they'll continue their comfortable life and they won't feel the negative effect of war, they won't die in this war.After a little time, this war will end and you know what? You will be dead, people in the government will negotiate with a happy smile on their face, shake their hands and continue good life. When you are in war, you are protecting business owners, criminals, people in governments, rich, wealthy people while you are poor and dying for nothing. At the end of the day, if you survive, you'll lose a leg or hand but get medal that has no meaning if you have to continue your life in pain with physical disabilities.My point is that you should only fight and protect your family members and close friends, not others. It's really pitiful when I see some part of Ukrainians are fighting for these wealthy morons who got shelter here and in some other countries and go to the beach, don't miss a parties while their brothers are fighting.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5403668",
  "comments": [
    {
      "author": "VKcams.com",
      "created_time": "June 23, 2022, 03:12:28 PM",
      "body": "Quote from: Synchronice on June 22, 2022, 06:29:35 PM I live in Germany and Ukrainian \"refugees\" who came here, those who are rich and wealthy, party all the time, you can't even notice here that there is a war between Russia and Ukraine.They love to glorify Ukraine with the shit in Hotels.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "johhnyUA",
      "created_time": "June 23, 2022, 07:17:52 PM",
      "body": "Quote from: Synchronice on June 22, 2022, 06:29:35 PMI live in Germany and Ukrainian \"refugees\" who came here, those who are rich and wealthy, party all the time, you can't even notice here that there is a war between Russia and Ukraine.Are you sure that they only \"party all the time\"? People can't spend all days in sad mood. You're helping through donates and maybe volunteer work, then you go to chill a little. This is how it's going. But anyway, there really a lot of people who used this terrible war to emigrate to the EU.Quote from: Synchronice on June 22, 2022, 06:29:35 PMFor what? Ukraine is one of the most corrupted country. Rich and wealthy people, business owners and corruptionists and their children and family members will not war, they will get a business class ticket and leave the country with their wealth, they'll continue their comfortable life and they won't feel the negative effect of war, they won't die in this war.Wrong. I know a lot of businessmans who are at war now (not oligarphs, but owners of small and medium business). And a lot of wealthy people staying here. Some of them with their families. Quote from: Synchronice on June 22, 2022, 06:29:35 PMAfter a little time, this war will end and you know what? You will be dead, people in the government will negotiate with a happy smile on their face, shake their hands and continue good life. When you are in war, you are protecting business owners, criminals, people in governments, rich, wealthy people while you are poor and dying for nothing.Man, tell me for honest: You are using your grandfathers propaganda letters?  Quote from: Synchronice on June 22, 2022, 06:29:35 PMMy point is that you should only fight and protect your family members and close friends, not others.Yep. Most of ukrainians fighting for their families, or for the reasons that russian soldiers couldn't come to their homes. Again, because they're not rich to flee if it will be needed. Fight or die. Quote from: Synchronice on June 22, 2022, 06:29:35 PM It's really pitiful when I see some part of Ukrainians are fighting for these wealthy morons who got shelter here and in some other countries and go to the beach, don't miss a parties while their brothers are fighting.You can punch such people in the face in your Germany.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "suchmoon",
      "created_time": "June 23, 2022, 08:23:05 PM",
      "body": "Quote from: Synchronice on June 22, 2022, 06:29:35 PMMy point is that you should only fight and protect your family members and close friends, not others. It's really pitiful when I see some part of Ukrainians are fighting for these wealthy morons who got shelter here and in some other countries and go to the beach, don't miss a parties while their brothers are fighting.Ukrainians are fighting for their country, which happens to have all sorts of people, welcome to the real world.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "paxmao",
      "created_time": "June 23, 2022, 10:28:14 PM",
      "body": "Quote from: Synchronice on June 22, 2022, 06:29:35 PM... end of the day, if you survive, you'll lose a leg or hand but get medal that has no meaning if you have to continue your life in pain with physical disabilities.My point is that you should only fight and protect your family members and close friends, not others. It's really pitiful when I see some part of Ukrainians are fighting for these wealthy morons who got shelter here and in some other countries and go to the beach, don't miss a parties while their brothers are fighting.People are fighting for their country and their future freedom because they do not wish to be ruled from Moscow by a despotic psychopath. It does not get any clearer than this. It is actually the RF young people who are trying to avoid the draft because they, logically, do not trust Putin's intentions and they know may end in the front fighting in a war they do not believe in on behalf of the kleptocrats of Moscow so that they can buy a bigger yatch while he awaits in the trenches hoping that the next shell does not have his name written on it.You present an image of Ukraine that is completely biased, not to mention that corruption, kleptocracy, prevarication, xenophobia and gay-phobia are the trademarks of Aldolf Putin's government and the system of the RF. You should ask yourself why should anyone allow Moscow to decide their fate and their lives. At least if you have independence you have a chance to change things. Falling under Putin's thumb kills any chance of economic development and political growth.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "VKcams.com",
      "created_time": "June 23, 2022, 10:31:38 PM",
      "body": "Quote from: paxmao on June 23, 2022, 10:28:14 PM because they do not wish to be ruled from Moscow by a despotic psychopathHow do you explain the 5-hour lines to get Russian citizenship in the \"occupied territories\"?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "suchmoon",
      "created_time": "June 23, 2022, 10:38:23 PM",
      "body": "Quote from: VKcams.com on June 23, 2022, 10:31:38 PMHow do you explain the 5-hour lines to get Russian citizenship in the \"occupied territories\"?Knowing the cynicism of Russian \"authorities\", they probably tied the citizenship to something essential, like getting pension payments or humanitarian assistance.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "paxmao",
      "created_time": "June 23, 2022, 10:39:21 PM",
      "body": "Quote from: VKcams.com on June 23, 2022, 10:31:38 PMQuote from: paxmao on June 23, 2022, 10:28:14 PM because they do not wish to be ruled from Moscow by a despotic psychopathHow do you explain the 5-hour lines to get Russian citizenship in the \"occupied territories\"?Have you been watching again the official media and TV comfort juice?Propaganda? Poor ability to deliver public services from Adolf Putin's government? A promise not being deported if they ask for it?But the real answer is in your own question - Occupied Territories (without any quotes). Occupied means that people in there may be forced to do things they may not want to do (e.g. getting a passport to travel or else forced to remain in a war zone).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "VKcams.com",
      "created_time": "June 23, 2022, 11:04:28 PM",
      "body": "Quote from: paxmao on June 23, 2022, 10:39:21 PMHave you been watching again the official media and TV comfort juice?Even DW reported that.https://www.dw.com/ru/v-hersone-i-zaporozhe-nachali-vydavat-rossijskie-pasporta/a-61982997and the shit page publishedhttps://www.svoboda.org/a/putin-uprostil-poluchenie-grazhdanstva-rf-dlya-zhiteley-dvuh-oblastey-ukrainy/31867129.html",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "suchmoon",
      "created_time": "June 23, 2022, 11:23:10 PM",
      "body": "Quote from: VKcams.com on June 23, 2022, 11:04:28 PMQuote from: paxmao on June 23, 2022, 10:39:21 PMHave you been watching again the official media and TV comfort juice?Even DW reported that.https://www.dw.com/ru/v-hersone-i-zaporozhe-nachali-vydavat-rossijskie-pasporta/a-61982997and the shit page publishedhttps://www.svoboda.org/a/putin-uprostil-poluchenie-grazhdanstva-rf-dlya-zhiteley-dvuh-oblastey-ukrainy/31867129.htmlExcept it doesn't say anything about \"5-hour lines\".",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "VKcams.com",
      "created_time": "June 23, 2022, 11:30:38 PMLast edit: June 23, 2022, 11:50:34 PM by VKcams.com",
      "body": "Quote from: suchmoon on June 23, 2022, 11:23:10 PMExcept it doesn't say anything about \"5-hour lines\".70000 peoples have applied to RF citizenship.https://www.vedomosti.ru/politics/news/2022/06/11/926179-rossiiskie-pasportaKERSON, June 21. /TASS/. The queue for Russian citizenship in Kherson, where the region's first office for receiving documents operates, is about 9,000 people, the head of the region's military-civil administration, Vladimir Saldo, told reporters on Tuesday.\"In Kherson in the first office the depth of the queue is already under 9 thousand people. The process is going very well. People are doing it with joy and inspiration,\" Saldo said.On Tuesday in the Kherson region a second office for the receipt of documents for Russian citizenship was opened - in Novaya Kakhovka. Saldo specified that authorities of the region intend to open 10 more points of reception of documents - in particular, in Skadovsk, Genichensk, Gola Prista. To do this, they have already begun to train future employees from among the local residents.https://tass.ru/mezhdunarodnaya-panorama/14985199?utm_source=google.com&utm_medium=organic&utm_campaign=google.com&utm_referrer=google.comMelitopol, Line for the RF citizenship, video on the pagehttps://iz.ru/1343128/2022-06-01/v-zaporozhe-pokazali-ocheredi-na-podachu-dokumentov-na-rossiiskoe-grazhdanstvoCheck the video on the page, lines for the Russian Sim cards.https://crimea-news.com/society/2022/05/31/928875.html",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "suchmoon",
      "created_time": "June 24, 2022, 01:08:32 AM",
      "body": "Quote from: VKcams.com on June 23, 2022, 11:30:38 PM~There you go, bona fide copypasta from Kremlin propaganda sites. I knew you could do it, comrade.Quote from: VKcams.com on June 23, 2022, 11:30:38 PMCheck the video on the page, lines for the Russian Sim cards.https://crimea-news.com/society/2022/05/31/928875.htmlNot quite the same as passports but don't let minor details like that stop you from lying to us.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "johhnyUA",
      "created_time": "June 24, 2022, 06:48:22 AM",
      "body": "Quote from: suchmoon on June 23, 2022, 10:38:23 PMQuote from: VKcams.com on June 23, 2022, 10:31:38 PMHow do you explain the 5-hour lines to get Russian citizenship in the \"occupied territories\"?Knowing the cynicism of Russian \"authorities\", they probably tied the citizenship to something essential, like getting pension payments or humanitarian assistance.Even worse: As we know, they giving food for it. Most of people in this \"5-hour lines\" as we can see from russia tv are old 50+ people. Some of them of course pro-russian (the older you are, the more ressentiment for russia you have) but there even more old people who just want to not starve. I have few contacts in occupied Melitipol. They tells that if you want to do something good for people (buy them food or meds) you need to cooperate with russian occupation administration. Without it they'll not allow to do any of this kind of stuff. Russians tries to cover as much ordinary people as they can. Or you re looking at starving oldies, or you helping them, but from now you tied with russian occupation forces.This is typical \"gang/mafia\" behavior: They'll not allow you to get out if something bad will happen",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "be.open",
      "created_time": "June 24, 2022, 07:15:02 AM",
      "body": "Quote from: suchmoon on June 24, 2022, 01:08:32 AMQuote from: VKcams.com on June 23, 2022, 11:30:38 PMCheck the video on the page, lines for the Russian Sim cards.https://crimea-news.com/society/2022/05/31/928875.htmlNot quite the same as passports but don't let minor details like that stop you from lying to us.You cannot get a SIM card without a Russian passport, so these processes are closely interrelated.There is another nice bonus from obtaining Russian citizenship - zeroing out debts on all loans. For many Ukrainians, this turns out to be a good incentive to change citizenship.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "VKcams.com",
      "created_time": "June 24, 2022, 07:33:02 AMLast edit: June 24, 2022, 10:51:46 PM by Mr. Big",
      "body": "Quote from: be.open on June 24, 2022, 07:15:02 AMYou cannot get a SIM card without a Russian passport, so these processes are closely interrelated.Where did you get such accurate information?Did you make it up and pass it off as truth?Quote from: suchmoon on June 24, 2022, 01:08:32 AMThere you go, bona fide copypasta from Kremlin propaganda sites. Such a free to share information site as YouTube has banned all news channels from Russia, so there are videos about citizenship not about all cities.As I pointed out on DW and Freedom report on the process.So I do not understand, if such a queue for the Russian SIM cards, and they all already have Russian citizenship, how many people have asked him, do you think?Foreigners wrote that only 50 wanted citizenship. And our Ukrainian writer reports that without citizenship they don't give food.So they've all been dying there without food for like two months?Quote from: johhnyUA on June 24, 2022, 06:48:22 AMMost of people in this \"5-hour lines\" as we can see from russia tv are old 50+ people. Write directly for our foreign friends how many wanted citizenship - 70 thousand, as shown on Russian TV, or only 50 people, as DW wrote about it.And who is keeping the audience for fools.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "be.open",
      "created_time": "June 24, 2022, 08:19:34 AM",
      "body": "Quote from: VKcams.com on June 24, 2022, 07:33:02 AMQuote from: be.open on June 24, 2022, 07:15:02 AMYou cannot get a SIM card without a Russian passport, so these processes are closely interrelated.Where did you get such accurate information?Did you make it up and pass it off as truth?I saw posts about this on the net, but now I double-checked and it seems that this is not true. Apparently, you can buy a SIM card with a Russian number +7 (of an unknown operator, it looks like a Crimean T-mobile) and with a Ukrainian passport.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "paxmao",
      "created_time": "June 24, 2022, 08:20:23 AM",
      "body": "Quote from: VKcams.com on June 23, 2022, 11:30:38 PMQuote from: suchmoon on June 23, 2022, 11:23:10 PMExcept it doesn't say anything about \"5-hour lines\".70000 peoples have applied to RF citizenship.https://www.vedomosti.ru/politics/news/2022/06/11/926179-rossiiskie-pasportaKERSON, June 21. /TASS/. The queue for Russian citizenship in Kherson, where the region's first office for receiving documents operates, is about 9,000 people, the head of the region's military-civil administration, Vladimir Saldo, told reporters on Tuesday.\"In Kherson in the first office the depth of the queue is already under 9 thousand people. The process is going very well. People are doing it with joy and inspiration,\" Saldo said.On Tuesday in the Kherson region a second office for the receipt of documents for Russian citizenship was opened - in Novaya Kakhovka. Saldo specified that authorities of the region intend to open 10 more points of reception of documents - in particular, in Skadovsk, Genichensk, Gola Prista. To do this, they have already begun to train future employees from among the local residents.https://tass.ru/mezhdunarodnaya-panorama/14985199?utm_source=google.com&utm_medium=organic&utm_campaign=google.com&utm_referrer=google.comMelitopol, Line for the RF citizenship, video on the pagehttps://iz.ru/1343128/2022-06-01/v-zaporozhe-pokazali-ocheredi-na-podachu-dokumentov-na-rossiiskoe-grazhdanstvoCheck the video on the page, lines for the Russian Sim cards.https://crimea-news.com/society/2022/05/31/928875.htmlThe news for me is only 50.000 (if that is true) of all the nearly 300.000 people in the city alone, without counting all the occupied areas have requested it.Again, you are trying to prove that people in Kherson support the invasion and are happy to be annexed, but again, the territory is under military occupation. People can be easily forced to use Rouble, require passports and probably dancing naked with the RF flag if they have a gun pointing to their heads or if they are denied medical, administrative or other civil services if they do not have an RF issued \"passport\".As for the RF SIM cards, same case, if you cut-off the Ukrainian connexion, people are forced into RF SIMs.This is an attempt at cultural assimilation and even worse, trying to make it look as genuine support to justify the war of aggression. Anyone minimally critical cannot buy this shit, leave it for the official media.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "VKcams.com",
      "created_time": "June 24, 2022, 08:31:03 AMLast edit: June 24, 2022, 10:52:15 PM by Mr. Big",
      "body": "Quote from: paxmao on June 24, 2022, 08:20:23 AM probably dancing naked with the RF flag if they have a gun pointing to their heads or if they are denied medical, administrative or other civil services if they do not have an RF issued \"passport\".As far as I know, the Ukrainian bombing of Donetsk has not made the Russians there dance with Ukrainian flags since 2014.Quote from: suchmoon on June 24, 2022, 01:08:32 AMstop you from lying to us.There was a Ukrainian writer who said something about citizenship.Ask him if 70,000 is true or not.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "johhnyUA",
      "created_time": "June 24, 2022, 01:24:40 PM",
      "body": "Quote from: VKcams.com on June 24, 2022, 08:40:49 AMThere was a Ukrainian writer who said something about citizenship.Ask him if 70,000 is true or not.I'm not propagandist, i cannot say this is true or not. Despite the fact that I'm highly doubt that even if this is true (this is ultra small prob, if we consider that russian always overestimated such numbers in their favour), all this 70k of people want this passport because of their own will.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Moneyprism",
      "created_time": "June 24, 2022, 01:34:44 PM",
      "body": "i think that people like this exist in every country, not only in ukraine.. but when talking about ukraine people in majority, most of them are very nationalist and willing to fight against their country and they are real ukrainians",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}