{
  "id": "topic_5471250",
  "title": "DVlog",
  "author": "DVlog",
  "created_time": "October 22, 2023, 06:15:01 PM",
  "content": "A lot of our community members work as community moderators and copywriters on various crypto projects. I am working on a few projects as well and i have faced a new kind of technique recently used by scammers and hackers that i think needs to be shared with our community members who work in similar professions.Recently one of my project where I am working as a community moderator a guy dropped a message in my inbox asking for permission to write an article about the project and they wouldn't charge anything for it. It is a free community so anyone can write anything about any project so I told him to work on it we don't have any problems. So he asked me a few questions about the project and i gave him the answer. At the end he told me that he wanted me to sign a contract so that there wouldn't be any copyright issues. This sudden change of tone makes me more skeptical, and i tried to look at the link he wanted me to click and found that it had a javascript written on it. I don't want to share the link here as it has phishing elements on it. I had a similar incident before which i shared in the forum, so my mind told me not to click that link.This happened a few weeks ago but today i got a similar offer and the only difference is that this new guy wants to take an interview with me. I don't know why he needs to take my interview to write an article about a project that has its whitepaper and blog site that contain all the relevant project information. I am sharing this event with the forum to spread awareness among the newbies. Maybe some of you have already faced similar issues.This is another incident that happened to me that i have shared on another topic.[Scammers are getting innovative.] You can read that as well and many of you might wonder why i am facing all this every time. I think it's because of my profession as a community moderator. A community moderator has most of the administrative access in the community server or channel, so he is the primary target of a hacker. Gaining access to a moderator account can give him control over the server which he can use to post phishing links. Similar incidents have happened with many projects recently. So guys beware of this as you can lose your job and your community altogether.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5471250",
  "comments": [
    {
      "author": "irfan_pak10",
      "created_time": "October 22, 2023, 06:59:00 PM",
      "body": "Never occurred to me before, But thanks for the heads-up. Indeed, scammers are evolving their ways to scam. We have seen our fair share of ways in our lives, but each time we find something new has emerged.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Upgrade00",
      "created_time": "October 22, 2023, 07:51:51 PM",
      "body": "Managing a community on telegram or discord attracts lots of spammers and scammers. I mostly ignore personal messages after reading the first message and find it to be the same generic stuffs. The scammers probably pick up on these and get creative with their approach to get attention. Some ask questions about investing a significant amount and some try out what you experienced.If you keep a cool had you'll notice all the tricks they try to pull.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Coyster",
      "created_time": "October 22, 2023, 08:14:11 PM",
      "body": "A scammer can try any sort of social engineering to make you click on their phishing link, so don't click on random links as we always say and once a stranger you're chatting with starts acting suspicious or in a way that feels too good to be true, it is better to discontinue the conversation and avoid chatting with such a person again.You say you work as a community moderator for different projects, i hope you don't keep your assets on the same device you use for all these online stuffs, if you do; then move the majority of your funds offline, that is the first and most important step in protecting your funds from scammers.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "adultcrypto",
      "created_time": "October 22, 2023, 08:23:03 PM",
      "body": "I observed a growing trend whereby the administration and  moderators of various groups are the target of scammers. From WhatsApp to discord and even Telegram, the mods are always the primary target of scamners. Thanks for sharing this important information here as I know a lot of people have learnt part of how to protect themselves from scammers. Personally, I rarely click on any link that seems suspicious.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "boyptc",
      "created_time": "October 22, 2023, 08:59:15 PM",
      "body": "They are upgrading and trying to reason out as much as they can so that their links will be clicked by whoever they are targeting which is on your case, the writers and community moderators.I may not be into this niche like you guys do but this is helpful for those that are doing the same thing as yours and for that, I thank you for sharing this new scam method they do.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hamza2424",
      "created_time": "October 22, 2023, 09:10:19 PM",
      "body": "It sounds like phishers are getting innovative with time, I haven't encountered any such incidents yet but JS (may or may not contain any phishing elements), to be sure while using new services like mixers, DEX and any other Dapps be careful and prefer to use their NO JS version, which is not usual still most of the service providers on their time of marketing and execution prefer this user demands.Hmm, I had seen some newbies posting the paid links to be used in the personal text. You. You better be careful while dealing with them, they are more likely skeptical as well, I had heard of such members from community members reaching them with such offers.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Woodie",
      "created_time": "October 22, 2023, 09:27:05 PM",
      "body": "I wonder if hackers are getting more creative or  we the users are getting more alert and informed on all these kind of data breaching methods these guys are using..and good to know you didn't fall for this attempt which would have been more damaging to your community.Quote from: adultcrypto on October 22, 2023, 08:23:03 PMI observed a growing trend whereby the administration and  moderators of various groups are the target of scammers. Obviously trying to hijack their accounts so that they can spread their malware using an administrator/mod account  without the telegram bots flagging or deleting any malicious content sent from these accounts...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptomaniac_xxx",
      "created_time": "October 22, 2023, 09:28:56 PM",
      "body": "Yes, this is very similar to Fake Corsair job offers on LinkedIn push DarkGate malware. Wherein they will lure their victims on the guise that they will have a interview, and so they will have the supposedly victim to download something to fill some information. So once you download it, in just a matter of seconds, your hardware are already compromise and you won't do it.But thanks anyway for this warning to the community. I guess we shouldn't really trust anyone, even if someone that we know, give us a link, we should think many times before clicking it. Very dangerous path that we are right now, as there a lot of cyber criminals targeting crypto enthusiast.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Issa56",
      "created_time": "October 23, 2023, 12:04:35 AM",
      "body": "Quote from: DVlog on October 22, 2023, 06:15:01 PMThis happened a few weeks ago but today i got a similar offer and the only difference is that this new guy wants to take an interview with me. I don't know why he needs to take my interview to write an article about a project that has its whitepaper and blog site that contain all the relevant project information. I am sharing this event with the forum to spread awareness among the newbies. Maybe some of you have already faced similar issues.Scammers are improving their strategy on a daily basis. That is why we also have to be careful and smart. Before any action should be taken, you have to be extra careful, and make sure you don't fall victim at the end. Whenever I receive a random message, I always have it in mind that the person is trying to scam me. Even if the person is trying to assist me, I still see the person as a scammer because scammers are always acting nice just to get your attention. They will always want you to trust them so that they will be able to penetrate into you. From your post, the scammer contacted you and wanted to assist you in writing an article for your project for free. The scammer was acting like he wanted to help the project, but he had a different motive, if you weren't smart, he would have made use of the opportunity.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hd49728",
      "created_time": "October 23, 2023, 12:44:48 AM",
      "body": "Quote from: DVlog on October 22, 2023, 06:15:01 PMRecently one of my project where I am working as a community moderator a guy dropped a message in my inbox asking for permission to write an article about the project and they wouldn't charge anything for it.You received a PM from a stranger when you are a community moderator. The offer is too good to be true, free. Any good website with good traffic will do it without fee?If that platform is Telegram, you can remember that user and watch it out for a while. After a few weeks or months, that account will be either a Deleted account or will be labeled as Scammer by Telegram.What is Scam label on Telegram?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cheezcarls",
      "created_time": "October 23, 2023, 02:19:02 AM",
      "body": "Scammers are very innovative and won't stop until they get past through our own \"force fields\". They're trying to be one step ahead no matter how elite the security level of a specific platform is. They even create state of the art malware that bypasses antivirus detection. As scammers and hackers are getting smarter, we should always find ways to do our due diligence and use common sense in order not to be victimized by them.I am not exempted of that as I was too a victim of a similar type of scam. A year ago, a scammer pretending to be a CEO of a project (in which I have failed to triple check the Telegram handle) successfully penetrated my mind believing that he wants to collab with me and asked me to download the ZIP file and click the \"NDA\" which in fact is a fake PDF leading to my assets getting drained. Be careful out there and stay SAFU as much as possible.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Outhue",
      "created_time": "October 23, 2023, 06:01:50 AM",
      "body": "It's possible that this will never happen to me because I am not into the same profession as you, I could but I am not just the right person for such, I am not always good with stranger and I am always on my guild at a hundred percent when dealing with strangers, I have gotten several PM from standard asking me for normal things but the way I reply they knew instantly that they won't get anywhere talking to me.I don't care what your relation might be with your profession, everyone online are there for a purpose and most times they are looking for people to prey on, if you fall for them it's on you, I always frown on strangers as no single one ever have a good mind towards me in the past, they always come to take advantage of me. Thanks for sharing your experience in your field of profession, if anyone is doing the same thing as you they might have seen such or learn from this, I don't trust anybody and I will never lower my guide against any stranger, stay safe out there.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "HajiBagi",
      "created_time": "October 23, 2023, 06:14:26 AM",
      "body": "Quote from: Upgrade00 on October 22, 2023, 07:51:51 PMManaging a community on telegram or discord attracts lots of spammers and scammers. I mostly ignore personal messages after reading the first message and find it to be the same generic stuffs. The scammers probably pick up on these and get creative with their approach to get attention. Some ask questions about investing a significant amount and some try out what you experienced.If you keep a cool had you'll notice all the tricks they try to pull.Scammers today don't worry about themselves like they did in the past; instead, they will consider how to catch your attention and persuade you to follow them. Some links are very dangerous because clicking on them will give the scammers a lot of information about your systems, your personal information, and everything to which you have access. I'm not sure about other people, but even if it were a joke, if someone told me to click on a link, I would ignore them because it is better to be afraid than to accept a risk you can't handle.You know how some newbie are when it comes to making money online quickly, they always think that is the way they will make it and fall into the scammers' traps? Well, this scammers always come to mostly newbie because they know that the newbie in the forum will never know much about them, and they message them about investing and earn a lot of money that will make them feel greedy that they will not even think about it twice.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ojima-ojo",
      "created_time": "October 23, 2023, 06:56:24 AM",
      "body": "I have not experienced such a scam attempt before unless for the one when a dumped guy tried to cajole me into using a phishing link to sign into my account so that he could steal my log in information and on opening the link I discovered that he was making attempt to hack my account and I immediately reported him, I think the guy is ban now.You have to be careful and that is the more reason that most project moderators don't allow for PM offers and as long as it belongs to the same community whatever needs to be discussed can also be discussed in the group without taking it to DM, and try as much as possible to avoid such contact",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "michellee",
      "created_time": "October 23, 2023, 06:58:41 AM",
      "body": "It seems that the next target of the scammers is the community leader of a group where he controls the group. And that's why scammers try to approach the community leaders and offer their cooperation. And it's true. This is a new scamming model that many people, especially community leaders, may not know about and thank you for sharing it here.This needs to concern community leaders because they might use other methods. We know that they will use all means to get what they want. And it seems that they use deception in addition to using different methods.I've never encountered a case like yours, but I came across some offers on Telegram, and I just ignored them all. I don't trust the offers on Telegram because I have experienced bad things. But there may already be some communities that have experienced this.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DVlog",
      "created_time": "October 23, 2023, 10:00:18 AM",
      "body": "Quote from: Ojima-ojo on October 23, 2023, 06:56:24 AMI have not experienced such a scam attempt before unless for the one when a dumped guy tried to cajole me into using a phishing link to sign into my account so that he could steal my log in information and on opening the link I discovered that he was making attempt to hack my account and I immediately reported him, I think the guy is ban now.You have to be careful and that is the more reason that most project moderators don't allow for PM offers and as long as it belongs to the same community whatever needs to be discussed can also be discussed in the group without taking it to DM, and try as much as possible to avoid such contact What you are saying is safe and logical to do but you can not always ignore your private message as there are investors and people who need support for the project. So I need to check all the PMs I got and scan all of them to get rid of scammers and legit users. Most of the time it is the community members who need help but getting messages from scammers is becoming more frequent than before. So I think those who are working in this field should be more careful than before.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gladitorcomeback",
      "created_time": "October 23, 2023, 10:23:11 AM",
      "body": "Good work OP, I have also worked for many projects as a community moderator but didn't faced this kind of scam attempt yet. I daily receive personal message from unknown users(mostly girls) who wanted to gives idea of trading platform which I never Heard a name before this. first they start communication that he just want a friendship and then send a business proposal. I am 100% sure that this is also a scam attempt. telegram is prominent platform for scammer to engage fraudulent activities. They have different method to entice newbie to fall in scam and it is necessary that we should have a knowledge of it. I am also looking to make a thread where i will include all their methods they attempted so far to deceive me but not successful yet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "robelneo",
      "created_time": "October 23, 2023, 10:57:05 AM",
      "body": "Quote from: DVlog on October 22, 2023, 06:15:01 PMSo he asked me a few questions about the project and i gave him the answer. At the end he told me that he wanted me to sign a contract so that there wouldn't be any copyright issues. This sudden change of tone makes me more skeptical, and i tried to look at the link he wanted me to click and found that it had a javascript written on it. I don't want to share the link here as it has phishing elements on it. I had a similar incident before which i shared in the forum, so my mind told me not to click that link.This is something new I never read something like this, a screenshot of the conversation is just enough proof, we here in the community only ask for screenshots of the conversation or anything that can prove that an agreement has been reached but never a contract, and its a simple article writing and no money was involved I will be suspicious if I am asked to download something to sign a contract.Only reputable companies like banks and insurance ask for a signed contract but never an individual, its good that you posted it here for awareness.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ImThour",
      "created_time": "October 23, 2023, 11:02:32 AM",
      "body": "So it's just a phishing attack with a new story and concept. Phishing attacks are the most common ones and that's why I prefer users to keep their funds secured with a Hardware wallet and also use a more secure Operating System than Windows. JavaScript is required on every website nowadays and you never know which one is going to inject bad stuff in your PC's browser and can collect all of your keystrokes, with a key-logger which is way more harmful.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}