{
  "id": "topic_5433167",
  "title": "holydarkness",
  "author": "holydarkness",
  "created_time": "January 05, 2023, 04:53:22 PMLast edit: January 11, 2023, 07:12:10 PM by holydarkness",
  "content": "What happened:Possible scam projectSuspect's Profile Link: https://bitcointalk.org/index.php?action=profile;u=3511054Suspect's Website: https://www.theadvantageblockchain.com/ | archivedSuspect's ANN thread: https://bitcointalk.org/index.php?topic=5417350.0 | archivedSuspect's documents: whitepaper | PowerPoint | RoadmapAdditional Notes:I can't be sure if they're a scam project or not due to the lack of concrete evidences, hence I am open for anyone tried to help with this matter, but so far, several things are pointing toward that directions, as such:1. No team detailsInitially, I asked for team details, I think it is quite reasonable that a project that runs on remittance would have the people behind the team be known to anyone investing on the project or remitting their money through the platform, but they asked me to go through discord to \"meet some members\" which --as I've shown and told them on the original thread-- is not exactly convincing and their final answer for this matter before I pursued other matter [point 3] that's more interesting was, the snipped quote came from the same post for this quoted post below and snipped quote on point 3Quote from: AdvantageBlockchain on January 02, 2023, 04:12:37 PMHi holydarkness,[...]you can ask the administrator in the Discord about my reliability with investor communication and updates.All real investors get my personal contact information and a KYD before.Discord now has 47 Members!2. Discord membersNow, this is fantastic. They've been around since 17 October 2022, on 2 January 2023, they managed to get 47 members, then 300+, then 500+ in two days. As I am pretty much sure discord \"followers\" can be bought just like telegram, I peeked into this extremely drastic increases and found a glimpse which I believe is not too far away from my suspicion --that those members are inorganic-- 3. Going IPOThey claimed that their investor will have portion of the company in Canada, as in IPO in real life,Quote from: AdvantageBlockchain on January 02, 2023, 04:12:37 PMHi holydarkness,Yes, owning the parent corporation of Advantage. This is like no other token/coin. The wallet will soon be complete and we will then look for the next round of investors.There are only a few spots available [...]Which raised my eyebrows. I'll openly admit that I am not well versed on IPO procedure in Canada --anyone from Canada and familiar with this issue, a contribution and insight will be much appreciated-- but I am quite versed on the stock and bond in my own country and I know that the buyer would have an account in brokerage or bank account, basically a third and appointed party that intermediates the company and the buyer. We can't just go to a company, arranged a meeting with their staff, be it higher or lower seats, and buy the shares ourselves. Likewise, a company can't just decide to go public one day and sell their shares freely to anyone. They have to get through thorough process like registering their company for public offering, waiting for some grace period, being audited, doxxed, amongst other things. A quick searches told me that Canada basically applied the same rule, which they initially deflect by saying,Quote from: AdvantageBlockchain on January 03, 2023, 06:48:44 PMHi holydarkness,You make a lot of assumptions. Already some % of the corporation has been sold and the legal papers reviewed and signed by real lawyers on the investor's end and our end.And it isn't clear where you are getting a lot of your information from. You absolutely do not need to be a part of a brokerage to invest in a corporation in Canada.and after I pointed out the sources on this post, their statement changed intoQuote from: AdvantageBlockchain on January 03, 2023, 08:02:53 PMHi holydarkness,Yes that is quite incorrect, but allow the truth to come out.Canada has absolutely no restrictions to buy stocks but you need a bank to buy them and if its already listed you can buy yourself using a simple brokerage account which takes 2 minutes to set up.Short story: You can easily invest in Corporations and buy stocks in Canada without restriction.If you want to be a part of Advantage by investing we would love to have you.300+ Discord Members.Upon pushed further about the matter, how exactly would they suggest investors to buy the ownership and do they have all the required documents for going public, they went into the defensive-offensive mode of \"you're rude, we don't want to answer your question anymore\", much like the telltale of scam projects we have in the past. Well, I am \"snide\", but that's simply because they kept circling around the question that's very easy to answer if they're truly legit.Quote from: AdvantageBlockchain on January 04, 2023, 06:49:34 PMHi holydarkness,Clearly there is no point talking to you further. You've gone from rude and ignorant to downright snide. Please excuse yourself from Advantage.As stated on the earlier part of this post, I am not sure if this is a clear case of scam, the three points I raised above might means nothing and I am simply too paranoid, but as my... eccentricity had provoked them enough and made them refused to talk further to me, and I can't clarify the whole IPO permit and team details and other aspects for legit project, I hope this thread can provide a better outcome as well as inviting other pairs of eyes and insights.The suspect has been notified Edit 1: as per 11 January 2023, Advantage Blockchain's website, crucial posts on their ann thread, and their website ceased to exist. While the nature of their investors --angel investors-- finally explained in clear after a quite a misunderstanding --I'll own part of the blame, but it also happens because they never answered questions directly and always leaning toward ambiguous answers-- they still refused to reveal the team behind this huge global remittance project.By those evidences found so far, I am leaving a negative tag towards them. Quote from: AdvantageBlockchain on October 17, 2022, 12:00:00 AM/closed @govconcerns.comhttps://archive.ph/xhezd",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5433167",
  "comments": [
    {
      "author": "AdvantageBlockchain",
      "created_time": "January 06, 2023, 05:03:21 AMLast edit: January 06, 2023, 06:23:39 AM by AdvantageBlockchain",
      "body": "Hi Friend Allow the Advantage Founder to clear some things up on this awesome project and clear misinterpretations on your part.1. The screenshot of our 'Dev' team happens to be just regular Discord Members looking for work, not working on Advantage, which they were helped to look on various sites which may aid them. The Team is compiled of contract employees, which I do not believe represent Advantage, as they are not full time employees so they are not public for their safety.2. Discord was raided by 'shillers' looking for Work. As stated before the goal is to help so many stuck around as I replied to most of them with helpful suggestions or paid them for various services to help.3. Nobody mentioned IPO. Advantage is a product of a registered legal corporation in Canada. This has already been partially sold and legal documents looked over by both parties with lawyers involved. Cigars also sent🥳.Extra: Please be weary of holydarkness and read his comments on the original page. Also stop posting random screenshots of Discord Members saying they work for us because they are not our Devs. Thanks.Clearly you have some skill to set this beautiful thread up, why not come work for us and see what we can do for you.As for everyone else reading this, let it be clear, Advantage is here to stay.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "holydarkness",
      "created_time": "January 06, 2023, 09:04:53 AM",
      "body": "Quote from: AdvantageBlockchain on January 06, 2023, 05:03:21 AMHi Friend Allow the Advantage Founder to clear some things up on this awesome project and clear misinterpretations on your part.1. The screenshot of our 'Dev' team happens to be just regular Discord Members looking for work, not working on Advantage, which they were helped to look on various sites which may aid them. The Team is compiled of contract employees, which I do not believe represent Advantage, as they are not full time employees so they are not public for their safety.2. Discord was raided by 'shillers' looking for Work. As stated before the goal is to help so many stuck around as I replied to most of them with helpful suggestions or paid them for various services to help.3. Nobody mentioned IPO. Advantage is a product of a registered legal corporation in Canada. This has already been partially sold and legal documents looked over by both parties with lawyers involved. Cigars also sent🥳.Extra: Please be weary of holydarkness and read his comments on the original page. Also stop posting random screenshots of Discord Members saying they work for us because they are not our Devs. Thanks.Clearly you have some skill to set this beautiful thread up, why not come work for us and see what we can do for you.As for everyone else reading this, let it be clear, Advantage is here to stay.Hmm... ok, thanks for coming here, first of all.For point number 1, I'd like to find more about these servers, but when i looked back into my discord, I see that the channel is no longer on my list and when I tried to rejoin through invitation link on your website, it saidCan you perhaps help with this issue? Certainly it's just a small glitch?For point number 2, I think I'll refrain from commenting on this matter and let the community decide themselves about the sudden spike of members... i mean shillers. And moving to point 3, especially the extra note, yes sure, I'd like everybody to read our entire discussion on the thread, it's just two page, and well documented on the archive section of this thread. Or better yet, allow me to give a screenshots of the section about IPOWhile for \"posting random screenshots of Discord Members saying they work for us\", would you be a lamb and point me out to my post where I specifically said this?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rikafip",
      "created_time": "January 06, 2023, 09:34:58 AMLast edit: January 06, 2023, 01:23:17 PM by Rikafip",
      "body": "Quote from: AdvantageBlockchain on January 06, 2023, 05:03:21 AMThe Team is compiled of contract employees, which I do not believe represent Advantage, as they are not full time employees so they are not public for their safety.Who then exactly represents Advantage? Since you claim to be a registered company in Canada, why not revealing who exactly is behind your company, your previous experience and competence? And please don't use \"satoshi was also anonymous\" argument since he didn't ask anyone to invest anything, unlike many similar business that ask people to invest money while wanting to stay anon and then use that ridiculous excuse. Quote from: AdvantageBlockchain on January 06, 2023, 05:03:21 AM2. Discord was raided by 'shillers' looking for Work. As stated before the goal is to help so many stuck around as I replied to most of them with helpful suggestions or paid them for various services to help.This would make sense if you got few dozens new users, but getting 400 members in a few days looking for work is far fetched.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AdvantageBlockchain",
      "created_time": "January 06, 2023, 10:29:05 AMLast edit: January 06, 2023, 11:01:57 AM by AdvantageBlockchain",
      "body": "Hi,You were kicked from the channel since we really are sincere about having loving Members and not snide. If you have something positive to bring we will reinvite you.As for the Discord Members, many are shillers that got interested.Yes, selling equity in an existing business in Canada. Advantage will be under that umbrella.As for the whole identity thing, if you're an investor you know how real I am. Announcement will be made regarding team publicly near launch. Thanks,Spencer.Quote from: Rikafip on January 06, 2023, 09:34:58 AMQuote from: AdvantageBlockchain on January 06, 2023, 05:03:21 AMThe Team is compiled of contract employees, which I do not believe represent Advantage, as they are not full time employees so they are not public for their safety.Who then exactly represents Advantage? Since you claim to be a registered company in Canada, why not revealing who exactly is behind your company, your previous experience and competence? And please don't use \"satoshi was also anonymous\" argument since he didn't ask anyone to invest anything, unlike many similar business that ask people to invest money while wanting to stay anon and then use that ridiculous excuse. Quote from: AdvantageBlockchain on January 06, 2023, 05:03:21 AM2. Discord was raided by 'shillers' looking for Work. As stated before the goal is to help so many stuck around as I replied to most of them with helpful suggestions or paid them for various services to help.This would make sense if you got few dozens new users, but getting 400 members in a few days looking for work is far fetched.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "holydarkness",
      "created_time": "January 06, 2023, 05:48:11 PM",
      "body": "Quote from: AdvantageBlockchain on January 06, 2023, 10:29:05 AMHi,You were kicked from the channel since we really are sincere about having loving Members and not snide. If you have something positive to bring we will reinvite you.As for the Discord Members, many are shillers that got interested.Yes, selling equity in an existing business in Canada. Advantage will be under that umbrella.As for the whole identity thing, if you're an investor you know how real I am. Announcement will be made regarding team publicly near launch. Thanks,Spencer.Well ironically and sadly, I didn't do anything on your discord, how am I simply being there, a silent observer, without any comment ot even a word, considered... unloving (?). I visited it once to check that \"meet some members\" you suggested, and later, yesterday, as I got curious on your member's growth. I even recalled one of your team --or was that you?-- greeted meWhat's interesting, though, is that I joined the second time after your whole \"you are rude, we won't talk with you anymore\" kinda post. Don't you agree that, if your true intention was to keep this particulary annoying member from corrupting your channel, it'll be more logical if you kicked me there right at that moment, right before or after the greets? The interesting part is the slight hint that the kicking happened only after this thread was raised with proof of abnormal spikes in members, which lead to a plausible question if the real reason is not to prevent this sarcastic human from polluting your channel, but rather to limit me from finding any other abnormalities in your super growing channel.As for the whole buying parts of the company, I spare some of my time today to look around Canada. Given you signed all your post --and PM to me-- with \"Spencer\", I believe this is your company? QuoteCorporation Number1403964-5Business Number (BN)726665706RC0001Corporate NameAdvantage Blockchain CorporationStatusActiveGoverning LegislationCanada Business Corporations Act - 2022-05-13Incorporated on 13 May 2022? Your personal LinkedIn told us that you've been self employeed on the company since 2018, and your only employment history right after graduating from school, though. In the greatest attempt to not being a snide and not to assume, I'll just ask your opinion about this findings. Continue on to the IPO-equity-partial-ownership or whatever name you preferred them to be, with the complete company name in hand, I consulted to a pair of Canadian stock and securities listing platform, I can't find your name on it, not even on their specific list for blockchain companies Now, of course I noticed a part of your post earlier today --but not earlier than my digging activity, which was around my morning coffee-- which quoted in full above, and will specifically re-quoted below:Quote from: AdvantageBlockchain on January 06, 2023, 10:29:05 AM[...]Yes, selling equity in an existing business in Canada. Advantage will be under that umbrella.[...]It came in harmony with how you keep avoiding my question about your documents for going public, and the findings that your company is not listed on the stock market: you're not available for public yet. So enter this previous statement from your ann thread:Quote from: AdvantageBlockchain on January 03, 2023, 06:48:44 PMHi holydarkness,You make a lot of assumptions. Already some % of the corporation has been sold and the legal papers reviewed and signed by real lawyers on the investor's end and our end.And it isn't clear where you are getting a lot of your information from. You absolutely do not need to be a part of a brokerage to invest in a corporation in Canada.And that offers of some spot available for the partial ownership and documents being reviewed by real lawyers. Best benefits of doubt I can give up to this point is that you're currently in the process of having your IPO permit. But, if that's the case, how exactly do you have already signed portion of your company to investors and offered some that's left to others? All while you're yet to be audited and deemed healthy for selling your equity? Isn't that... against the law?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AdvantageBlockchain",
      "created_time": "January 06, 2023, 11:32:25 PM",
      "body": "Hi holydarkness,I think making up things and lying or maybe just vastly misinterpreting what I'm saying on accident is enough to not want you in the community.Yes, I had a sole-prop. registered 2018. Closed and upgraded to Corporation in 2022.Also, you're looking at the TSX. Nobody ever mentioned we were trading on the TSX with our token yet. Yes our paid Discord staff probably did greet you as they have been combed through for the best and nicest Members.Anything else?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jharris9931",
      "created_time": "January 07, 2023, 01:40:15 AM",
      "body": "This is getting super interesting.Looks like AdvantageBlockchain got busted out but not willing to admit it. Continues to deny deny deny.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AdvantageBlockchain",
      "created_time": "January 07, 2023, 02:50:55 AM",
      "body": "Anyone who has invested knows atleast 16 hours a day are put in to the project with results. To the point they want to buy even more stake. Thanks.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "holydarkness",
      "created_time": "January 07, 2023, 08:54:50 AM",
      "body": "Quote from: AdvantageBlockchain on January 06, 2023, 11:32:25 PM[...]Anything else?Anything else? Yes. You've been avoiding the simple question that's already been asked several times and one of the main concern that brought us into this situation and make people have to guess. If there was an elephant in the room, it is now a T-Rex.Do your company have the documents and other legal requirements to offer this partial ownership of the company?This was never directly answered. You only said some percentage of the company had been sold to investors with the document looked by lawyers. It is open to a lot of possibilities. Maybe the investors didn't know they fell into an unauthorized deal, maybe the deal itself never actually happened --for all we know, it's just your words without proof.So, do you have the permit to legally conduct an offering to the partial ownership of your company?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AdvantageBlockchain",
      "created_time": "January 07, 2023, 03:46:57 PM",
      "body": "Hi,Investors ALREADY have signed the purchase agreements for partial ownership and had their personal lawyers review the paperwork, as stated already. They are now Owners. Thanks.Also I won't let you slander the Advantage project and the staff who are paid and work overtime sometimes, 16 hours of their own free will.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "holydarkness",
      "created_time": "January 07, 2023, 04:04:13 PM",
      "body": "Quote from: AdvantageBlockchain on January 07, 2023, 03:46:57 PMHi,Investors ALREADY have signed the purchase agreements for partial ownership and had their personal lawyers review the paperwork, as stated already. They are now Owners. Thanks.Also I won't let you slander the Advantage project and the staff who are paid and work overtime sometimes, 16 hours of their own free will.At this point, I am not sure you're really don't know what I actually asked or you give your best to be ignorant. Allow me to repeat, kindly answer the following question with a simple yes or no: do you have all the requirements needed by Canadian authority to conduct a company public selling?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AdvantageBlockchain",
      "created_time": "January 08, 2023, 03:16:28 AM",
      "body": "Yes.Investors get added to the Shareholder registry. Which is a private document that contains all the official shareholders of the corporation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "holydarkness",
      "created_time": "January 08, 2023, 10:35:07 AM",
      "body": "Quote from: AdvantageBlockchain on January 08, 2023, 03:16:28 AMYes.Investors get added to the Shareholder registry. Which is a private document that contains all the official shareholders of the corporation.Oh, come on, up to this point, you've successfully convince me that you actually didn't have the permit, you keep deflecting the question, answering even the simplest one with something else. I'll go down and matching your words of choice: do your company registered in Canadian equity regulator?But based on your statement above, I doubt it is, as you seems to be the one didn't know how a public offering and shareholding works. Shareholder registry is not meant to be private, it should be open for public; at least that's how it works in my country, as well as bases on these articles:Quote from: https://corporatefinanceinstitute.com/resources/equities/shareholder-register/A third-party registry service provider is tasked with maintaining and updating the register at an agreed fee. Since the shareholder register is a public document, third parties and other interested parties can access an updated list of a company’s shareholders at any time.Quote from: https://seedlegals.com/resources/what-is-a-shareholder-register/According to the Companies Act 2006, anyone can ask to look at – and request a copy of – a company’s shareholder register.It’s not just the company’s shareholders who have a right to inspect the register, members of the public can request to see it too.But, of course, just like before, I might be wrong, Canada might have a different set of rules. So why don't you quote us the rule that state otherwise?These questions are simple, your contract lawyer can help you answer them in seconds, so please make sure you have a direct answer for both questions on your next reply, or I'll be convinced that you're suspicious enough that I'd have to raise a flag to warn people. Especially as your \"new whitepaper launch\" did not exactly shed a new and important information compared to the previous one.Quote from: AdvantageBlockchain on January 05, 2023, 04:30:48 PMDiscord server now 99% set.Ranks added to Server.800-900 Members.Active chat.New Whitepaper Ann: Jan 7 2023New whitepaper archived",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AdvantageBlockchain",
      "created_time": "January 08, 2023, 11:56:20 AMLast edit: January 08, 2023, 03:02:42 PM by AdvantageBlockchain",
      "body": "HiActually the only compliance not at the moment registered is the FCAA documents we are raising funds for now. Not required until release or Canada gives lee-way post release as long as the paperwork is in progress.Advantage still prays for you.Thanks,Spencer",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "holydarkness",
      "created_time": "January 08, 2023, 04:36:02 PM",
      "body": "Quote from: AdvantageBlockchain on January 08, 2023, 11:56:20 AMHiActually the only compliance not at the moment registered is the FCAA documents we are raising funds for now. Not required until release or Canada gives lee-way post release as long as the paperwork is in progress.Advantage still prays for you.Thanks,SpencerI have to say that you just made my day, in a positive tone and not even a hint of sarcasm, I spent at least three hours reading articles upon articles about crowdfunding in Canada that might help with any other cases in the future, and I always love to learn new things. If only we met in other circumstances...Now, back to our topic, diving through FCAA, I found that Canada allows certain leeway on their public offering procedure, where a small business entities are allowed to crowdfund certain amount to handle their legal documentation. This is a very interesting news and --for the first time-- at least we're almost on the same page and same understanding of the current situation. But...Tell me, am I interpreting this section correctly? That the crowdfund exemption for prospectus should be done through a third party, a crowdfunding platform, whom obligated to share the details of the exempted company requesting crowdfund through their platform?I didn't find this platform mentioned anywhere, even when I asked you which method do you suggest the buyer to invest on you... well, of course, it could be a simple case of oversight, not a big problem. So what is the crownfund platform you use, again?Another thing that I'm honestly confused and hopefully you can explain better. On the rules issued by FCAA, it is stated as below,The first part I marked in blue box strengthen the understanding that in order to be allowed for crowdfund with an exemption, you had to go through a third party, a funding portal, but point 5.(1).(d). is rather... complicating things, isn't it? As what you tried to raise is included on the category of investment fundQuote from: https://en.wikipedia.org/wiki/Investment_fundTerminology varies with country but investment funds are often referred to as investment pools, collective investment vehicles, collective investment schemes, managed funds, or simply funds.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AdvantageBlockchain",
      "created_time": "January 08, 2023, 07:12:18 PM",
      "body": "Hi holydarkness,It seems you're stuck on the securities registration, we are NOT offering securities for investment deals, but rather equity to private Angels.ThanksSpencer",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "holydarkness",
      "created_time": "January 08, 2023, 09:01:52 PM",
      "body": "Quote from: AdvantageBlockchain on January 08, 2023, 07:12:18 PMHi holydarkness,It seems you're stuck on the securities registration, we are NOT offering securities for investment deals, but rather equity to private Angels.ThanksSpencerOh? Why don't you said so from the earliest part of our discussion? It'll help us saving a lot of time... wait... maybe that's because you had to improvise and blurt it out just now.I've been deliberately mentioned IPO several times in our earlier discussion for you to deny them, like here or here, as well as mentioning public offering, partial ownership, etc., i've even brought the screenshot of registered company for public offering --which, honest to god, also placed to give you a chance to inform us that we're on a different page and you've never talking about security offering. You have plenty of time to deny and straighten by saying \"no, not a security offering, I am talking about an angel investor.\" Which you never did, until all of your means of excuse seemingly exhausted.But let's assume you did tried to say angel investors and all this time you just, uhh... not, uhh... --I don't kow a nicer way to spell it, so forgive in advance-- not smart enough to realize everybody understood you wrongly, that you're talking about angel investor and we are all thinking about something entirety different but you can't see it so you can't clarify it before this point.In crypto, angel investors are those who usually offered to seed, and invested, on a private round. But as you've been publicly opening yourself for seeding, I don't think it's meant to be for private round, nor did you actually referring to angel investor all this time.Then, let's assume you're trying to say angel investor in traditional terms, the good old school business philantropic partner. As you stated here that the deal was signed by lawyer,Quote from: AdvantageBlockchain on January 03, 2023, 06:48:44 PMHi holydarkness,You make a lot of assumptions. Already some % of the corporation has been sold and the legal papers reviewed and signed by real lawyers on the investor's end and our end.And it isn't clear where you are getting a lot of your information from. You absolutely do not need to be a part of a brokerage to invest in a corporation in Canada.Which I strongly believe you're trying to say notary, basically a lawyer who oversee a deal and became a legal witness of the said deal being signed. The keyword here is \"legal witness\" as they're required to be present on the same room as the other parties and see the ink being drawn. By this basis, I'll boldly assume the \"angel investor\" here is also a Canadian, because I can't fathom how an overseas angel investor would fly in with their notary --or you fly with your notary-- to legalize the deal.Quote from: https://ca.indeed.com/career-advice/career-development/what-is-angel-investorsProvincial securities commissions regulate who can make angel investments. If you don't have a personal relationship with the company or its owners, you may become an accredited investor. In finance, an accredited investor is an individual with a high net worth, which qualifies them to invest in hedge funds and venture capital or make angel investments. To meet the requirement for accredited investors, you typically require a net asset value of more than $5 million and a gross income of $200,000 for at least two years.You're saying that all this time, since you created your ann up to this point, you tried to propose either your family or someone random in this forum who happen to be a high profile someone with $5M net worth?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AdvantageBlockchain",
      "created_time": "January 08, 2023, 09:27:49 PM",
      "body": "Hi,Perhaps rereading more carefully would assist.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "holydarkness",
      "created_time": "January 08, 2023, 10:31:35 PM",
      "body": "Quote from: AdvantageBlockchain on January 08, 2023, 09:27:49 PMHi,Perhaps rereading more carefully would assist. Ahh... Yes, I stand corrected, in the tangled mess of your constant indirect answer, it seems I overlooked this one statement and used the term IPO, partial company ownership, and corporation sale too loosely and interchangably. After all, you kinda did offered the partial ownership to public, LOL.Allow me to retract that part about IPO, to be more fitting to your term,Quote from: holydarkness on January 08, 2023, 09:01:52 PM[Ooops...] as well as mentioning public offering, partial ownership, etc., i've even brought the screenshot of registered company for public offering --which, honest to god, also placed to give you a chance to inform us that we're on a different page and you've never talking about security offering. You have plenty of time to deny and straighten by saying \"no, not a security offering, I am talking about an angel investor.\" Which you never did, until all of your means of excuse seemingly exhausted.But let's assume you did tried to say angel investors and all this time you just, uhh... not, uhh... --I don't kow a nicer way to spell it, so forgive in advance-- not smart enough to realize everybody understood you wrongly, that you're talking about angel investor and we are all thinking about something entirety different but you can't see it so you can't clarify it before this point.In crypto, angel investors are those who usually offered to seed, and invested, on a private round. But as you've been publicly opening yourself for seeding, I don't think it's meant to be for private round, nor did you actually referring to angel investor all this time.Then, let's assume you're trying to say angel investor in traditional terms, the good old school business philantropic partner. As you stated here that the deal was signed by lawyer,Quote from: AdvantageBlockchain on January 03, 2023, 06:48:44 PMHi holydarkness,You make a lot of assumptions. Already some % of the corporation has been sold and the legal papers reviewed and signed by real lawyers on the investor's end and our end.And it isn't clear where you are getting a lot of your information from. You absolutely do not need to be a part of a brokerage to invest in a corporation in Canada.Which I strongly believe you're trying to say notary, basically a lawyer who oversee a deal and became a legal witness of the said deal being signed. The keyword here is \"legal witness\" as they're required to be present on the same room as the other parties and see the ink being drawn. By this basis, I'll boldly assume the \"angel investor\" here is also a Canadian, because I can't fathom how an overseas angel investor would fly in with their notary --or you fly with your notary-- to legalize the deal.Quote from: https://ca.indeed.com/career-advice/career-development/what-is-angel-investorsProvincial securities commissions regulate who can make angel investments. If you don't have a personal relationship with the company or its owners, you may become an accredited investor. In finance, an accredited investor is an individual with a high net worth, which qualifies them to invest in hedge funds and venture capital or make angel investments. To meet the requirement for accredited investors, you typically require a net asset value of more than $5 million and a gross income of $200,000 for at least two years.You're saying that all this time, since you created your ann up to this point, you tried to propose either your family or someone random in this forum who happen to be a high profile someone with $5M net worth?And then allow me to recall some of your statements hinting toward public offering --or partial ownerhisp, or whatever terms you see fits-- instead of angel investors,Quote from: AdvantageBlockchain on January 02, 2023, 04:12:37 PMHi holydarkness,Yes, owning the parent corporation of Advantage. This is like no other token/coin. The wallet will soon be complete and we will then look for the next round of investors.There are only a few spots available, you can ask the administrator in the Discord about my reliability with investor communication and updates.All real investors get my personal contact information and a KYD before.Discord now has 47 Members!Quote from: AdvantageBlockchain on December 16, 2022, 05:54:19 PMInvestment received.!Still 27.00% of the registered Canadian corporation is for sale. See more https://www.theadvantageblockchain.com/ and join the Discord.Quote from: AdvantageBlockchain on January 06, 2023, 03:54:03 AM[...]Yes everyone, Advantage is a legally registered corporation in Canada that has already sold portions of it and sent paperwork to real lawyers to look over with 100% approval rating so far.[...]But maybe, this is all indeed a huge ball of misunderstanding, poor word of choices, and a habit of indirect answer. So why don't we settle to prove your seriousness and legitimacy by something easier like what Rikafip suggested and I've asked on your ann thread? The team.I think if your team has been spending 16 hours a day to work everything out, they won't mind one minute or two just to have a group photo? Or better yet, as you've updated your WP three times, why not tasking someone with a very easy job of adding a page or two on the fourth revision, containing the team details. It would greatly helps casting out the cloud of suspicion towards your project.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}