{
  "id": "topic_5437788",
  "title": "BenCodie",
  "author": "BenCodie",
  "created_time": "February 02, 2023, 02:55:22 PM",
  "content": "I find this to be a curious topic, after reading someone else's posts where they described gambling as if it were their permanent lifestyle/purpose/function.If there were a \"gameplay\" timer where the total amount of time you've spent gambling (whether it be online or in person), what do you think the amount would be?Or if you have lost too many hours to count, how much time do you think the clock would be if it started at the beginning of 2023?...and do you regret either of those numbers?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5437788",
  "comments": [
    {
      "author": "Cryptomiles1",
      "created_time": "February 02, 2023, 03:00:50 PM",
      "body": "This is hard to guess but I believe I have spent heavily on gambling more especially on pool which focuses on draws game or either by correct scores. As a matter of fact, my summaries and statically calculated the expenses it would amount to something very significantly huge. But still, I never quits gambling because I believe some days I would definitely get my eyes rolling for a big win.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "swogerino",
      "created_time": "February 02, 2023, 03:05:09 PM",
      "body": "Quote from: BenCodie on February 02, 2023, 02:55:22 PMI find this to be a curious topic, after reading someone else's posts where they described gambling as if it were their permanent lifestyle/purpose/function.If there were a \"gameplay\" timer where the total amount of time you've spent gambling (whether it be online or in person), what do you think the amount would be?Or if you have lost too many hours to count, how much time do you think the clock would be if it started at the beginning of 2023?...and do you regret either of those numbers?Luckily for 2022 I think I can give you an exact measurement,it was not more than 4 hours every week as a maximum while a minimum of 1 hour every week.I am an ex addicted gambler and giving these numbers here makes me feel proud of myself so far at least as in gambling you never know what will happen.The reason I got here is that I preset a bankroll of no more than 100 dollars weekly and usually this amount has kept me as a healthy gambler throughout all of 2022.If I were to measure myself in wagered amount without taking in consideration the many times I have withdrawn my small winnings is about 8500 dollars as that is my 85% of VIP requirements at Stake where I play and to become VIP you need 100% or 10.000 dollars as first level.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "danherbias07",
      "created_time": "February 02, 2023, 03:09:06 PM",
      "body": "I can't say it's a heavy number. Honestly, I don't even close the browser anymore unless I go to sleep and shut down my computer. But upon waking up and being in front of my computer, Stake.com will be open until I decided to sleep again. Although I don't really do heavy playing on casino games anymore, it's mostly in sports betting and living in the chat box waiting for a good pick from members who are sharing them. Checking odds during live games to take advantage of the sudden swing.So this depends, I may have my gambling site open but I don't really play 24/7, unlike others who are doing it to reach a wagering amount required for a certain bonus. It's mandatory for them as one day being out might cost their rank to go down. I've been there but I don't like the stressful amount of time spent doing the same over and over.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yogee",
      "created_time": "February 02, 2023, 03:09:16 PM",
      "body": "I avoid playing casino games such as dice or even slots as much as possible and focus mainly on sportsbetting so I would say not much time is wasted on gambling. There are still many sports and leagues to bet on but I only choose around 5 events or less in a week. Doing that strategy doesn't require many hours on team research or updates.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Slow death",
      "created_time": "February 02, 2023, 03:22:37 PM",
      "body": "as I only place sports bets and a week at least I place more than 10 bets and each game sometimes takes more than 20 minutes to analyze so I would say that each week maybe I spend 4 hours to analyze the games, but that does not mean that I spend 4 hours in the casino, so for people who make sports bets like me, I don't spend a lot of time in the casino so I am satisfied that it is like that, I understand well about the risks of spending a lot of time in the casinoI don't regret these numbers, because staying a long time in the casino can contribute to the person entering the world of addiction, that's why casino games like slot machines that make people have to spend hours in casinos are the ones games that make people addicted easily",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "348Judah",
      "created_time": "February 02, 2023, 03:35:23 PM",
      "body": "Quote from: BenCodie on February 02, 2023, 02:55:22 PMIf there were a \"gameplay\" timer where the total amount of time you've spent gambling (whether it be online or in person), what do you think the amount would be?Counting the amount of money spent on gambling be be a strenuous tadk to do and using a gameplay timer to see and track down records could as well be a demoralizing task to some, because if we really are to considers those amounts, we may loose hope or give up to gambling.Quote from: BenCodie on February 02, 2023, 02:55:22 PMOr if you have lost too many hours to count, how much time do you think the clock would be if it started at the beginning of 2023?Many gamblers will not want to consider this as well because they gamble because of the passion they have for it and not because of the money or time involved, everyone that has tasted gambling before must have spent time doing so.Quote from: BenCodie on February 02, 2023, 02:55:22 PMand do you regret either of those numbers?No since gambling is not by force, it a choice and a decision.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "robelneo",
      "created_time": "February 02, 2023, 03:41:00 PM",
      "body": "Quote from: BenCodie on February 02, 2023, 02:55:22 PMI find this to be a curious topic, after reading someone else's posts where they described gambling as if it were their permanent lifestyle/purpose/function.If there were a \"gameplay\" timer where the total amount of time you've spent gambling (whether it be online or in person), what do you think the amount would be?Or if you have lost too many hours to count, how much time do you think the clock would be if it started at the beginning of 2023?...and do you regret either of those numbers?I will lose track of those times because we forgot the hours when we are having time but I can do an estimation its 10 hours online and offline every week, ad I don't regret those numbers and numbers that I will accumulate as long as I'm enjoying those hours, some of these hours are spent with my friends playing cards every weekend, it's our way to spend time together.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pierre 2",
      "created_time": "February 02, 2023, 03:47:07 PM",
      "body": "I tend to not spend a lot of time on card games on gambling websites. But I play a lot on sports betting. Well if it counts as gambling to keep following matches, players etc and other things I was spending a lot of time on it. Sports betting itself doesn't take huge time. You just look for proper odds to guess a result or goal number or other things. But it takes too much effort to actually find matches and teams to play for or play against.I like football (soccer) so I don't mind time I am spending on it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BenCodie",
      "created_time": "February 02, 2023, 04:03:51 PM",
      "body": "Quote from: 348Judah on February 02, 2023, 03:35:23 PMQuote from: BenCodie on February 02, 2023, 02:55:22 PMIf there were a \"gameplay\" timer where the total amount of time you've spent gambling (whether it be online or in person), what do you think the amount would be?Counting the amount of money spent on gambling be be a strenuous tadk to do and using a gameplay timer to see and track down records could as well be a demoralizing task to some, because if we really are to considers those amounts, we may loose hope or give up to gambling.That's the point. The strenuous tasks you've described is called accounting and the second one is called responsibility. If either of these would discourage you from gambling if you were to do them, then maybe you are gambling too much.Quote from: 348Judah on February 02, 2023, 03:35:23 PMQuote from: BenCodie on February 02, 2023, 02:55:22 PMOr if you have lost too many hours to count, how much time do you think the clock would be if it started at the beginning of 2023?Many gamblers will not want to consider this as well because they gamble because of the passion they have for it and not because of the money or time involved, everyone that has tasted gambling before must have spent time doing so.I doubt that people more people are gambling because it is their passion over addiction. I'd even say that you are describing a very small percentage of people.Quote from: 348Judah on February 02, 2023, 03:35:23 PMQuote from: BenCodie on February 02, 2023, 02:55:22 PMand do you regret either of those numbers?No since gambling is not by force, it a choice and a decision. I disagree entirely. The concept of gambling, the way it is advertised/promoted/endorsed/etc and the way that gamblers are attracted to it the result of it being alluring. Gambling addiction is also a problem around the globe. If it was 100% a choice/decision then it would not be illegal in some countries and there would not be hundreds of responsible gambling campaigns where it is allowed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Majestic-milf",
      "created_time": "February 02, 2023, 04:14:15 PM",
      "body": "I won't say I'm a chronic gambler but last year saw me spending most of my free time betting; tryna get some extra cash. Its quite funny sometimes when I think about it because if I had converted that time into doing something more productive, probably I'd have built me a device that could detect when a score would be correct 😏😏.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EarnOnVictor",
      "created_time": "February 02, 2023, 04:57:46 PM",
      "body": "The timing of gambling is in two categories. There are some that must be done before their scheduled time is expired, and there are some that could be done at any time. For the former, I make sure I bet before the time grace elapses, while for the latter, I only spare 2 hours daily for it. But this does not include the time that I am bored and do not have serious things to do. In such cases, I might gamble and game for hours, but I strictly maintain little money for the acts.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mvdheuvel1983",
      "created_time": "February 02, 2023, 05:00:29 PM",
      "body": "I have never really considered the timer thing though. I recon it will be very difficult to use a timer especially when you at an online casino. You something lose track of time.What I do is that, the amount of money I use to fund my account is what determines how much time I spend gambling. The maximum time I have spent is 2.5 to 3 hours. This is because the amount I spend is budgeted and it doesn't go past 2hrs. But if a timer works for you them by all means, go for it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nakamura12",
      "created_time": "February 02, 2023, 05:04:24 PM",
      "body": "I can't say how long I have spent my time in gambling but I can say that I didn't spend much time on gamble as I don't gamble for too long. Some people may say that I am a gambler and they know that I am a gambler for example almost two years or a year but the truth is that during that timeframe is that I didn't gamble most of the time more like 4-8 times a year and during those times I gamble is that it won't even reach $10 even using my country's fiat currency. I only gamble to have fun and leisure time for myself. I would say that I didn't spend much time and cannot give specific timeframe on how long.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "uneng",
      "created_time": "February 02, 2023, 05:08:33 PM",
      "body": "Not a long time. When I gamble I try to place fewest bets as possible and quit right after, so I don't hit the feared long term where gamblers lose their money. It ends that I lost money anyway after a while, so there is nothing else to do besides staying away from gambling for a while, until I can recover losses, therefore I spend less time gambling yet on the total calculation of hours played.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dothebeats",
      "created_time": "February 02, 2023, 05:12:45 PM",
      "body": "I think I just gambled consistently in the past 3 or 4 years. It wasn't the main highlight of my life but it sure does help in speeding it up a bit especially during the weekends. I wasn't the heavy gambler type of person that a lot here might fit right into, but I sure do spend a considerable time in it. 1-2 hours every week for almost 4 years is a lot, and that time (and money) I have spent could have been put into learning a new skill or getting into another hobby that has a guaranteed return to me.Do I regret it? Not really, but looking back it kinda irks me that I spent that much time gambling rather than doing some other stuff. I enjoyed while it lasted anyway, and I haven't broke the bank in gambling consistently so no worries at all.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wexnident",
      "created_time": "February 02, 2023, 05:30:16 PM",
      "body": "If it's time then probably a few thousand hours (But less than 5k I think). That's just on casinos though, sports betting idrk, never really knew when I actually started tbf. I just moved to it after I slowly got bored of casino games (though I still do play them every now and then). If it was like a general time then probably 4-5 years? That's just the general, probably played a few hours each session and every few days each week. I compared it to how I usually play my steam games every now and then (which is what I do with gambling essentially), so I'm pretty familiar with how my games were scheduled. If it was the amount though I'd probably never answer/think about it, been gambling for quite a lot after all.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitzizzix",
      "created_time": "February 02, 2023, 05:37:12 PM",
      "body": "When it comes to capital spent, maybe I don't spend much capital on gambling. Because I don't have much time to gamble because I'm busy working and prioritize getting enough rest after work.and I mostly bet on weekends when I have two workdays and even then bet on sports that I think are worth betting on, and my betting activity changes drastically when I have a real job and only bet on weekends only. And I still bet on sports because I love sports especially football, apart from betting for fun I can also enjoy watching their games.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Casdinyard",
      "created_time": "February 02, 2023, 05:45:22 PM",
      "body": "Over my entire gambling journey? I can safely assume I may have spent more than a week's worth of time playing. I don't play religilously and only when I really feel like it. But whenevee I play I find myself pulling all nighters sometimes especially for games that require strategic thinking. I spend that extra time thinking of techniques and tactics that could best land me a win on the next run. As per capital, I think I just spent as much as you guys have over a peeiod of let's say, 3 or 4 years? I haven't really looked too much into it because I'd be giving myself unnecessary guilt if ever lmao.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rigon",
      "created_time": "February 02, 2023, 06:09:46 PM",
      "body": "Quote from: BenCodie on February 02, 2023, 02:55:22 PMI find this to be a curious topic, after reading someone else's posts where they described gambling as if it were their permanent lifestyle/purpose/function.If there were a \"gameplay\" timer where the total amount of time you've spent gambling (whether it be online or in person), what do you think the amount would be?Or if you have lost too many hours to count, how much time do you think the clock would be if it started at the beginning of 2023?...and do you regret either of those numbers?I actually didn't indulge myself in that kind of gambling. Most of the time I have been busy with other work. I spent a lot of time on trading platforms in particular. I am still spending time with the trading platform. Although I don't spend time in online casinos and offline casinos, I personally enjoy playing Ludo on mobile with family sometimes. Although I did not spend much time there, I spent some happy moments with them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}