{
  "id": "topic_5461225",
  "title": "aesthete2022",
  "author": "aesthete2022",
  "created_time": "July 27, 2023, 04:54:51 PM",
  "content": "I am wondering what the best practice is for storing output descriptors. Currently I have them offline on USB drives. However, there is an obvious risk of physical/environmental degradation over time. My instinct is that it would be foolish to save them on a cloud. I guess the tradeoff is physical degradation vs. being hacked. I'm guessing the latter is probably more likely.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5461225",
  "comments": [
    {
      "author": "BitMaxz",
      "created_time": "July 27, 2023, 05:09:05 PM",
      "body": "Storing it offline is the best practice you should not connect to any device which is infected and connected online.  USB flash drives only have 10 years lifespan so holding backups on the USB flash drive is not for more than 10 years.If you are looking for an alternative to store your backup for more than 10 years I think you can make a copy on DVD+RW according to Google it has a lifespan of more than 20-50 years and read-only CDs can live long more than 50 years. However, it still depends on how you take care of them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LoyceV",
      "created_time": "July 27, 2023, 05:51:04 PM",
      "body": "If you doubt your storage media, just create a new backup once in a while. Even $10 per year is enough to add a different brand stick to your collection annually.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "aesthete2022",
      "created_time": "July 27, 2023, 10:59:37 PM",
      "body": "Great ideas both of you, thanks!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nc50lc",
      "created_time": "July 28, 2023, 09:52:22 AM",
      "body": "Quote from: aesthete2022 on July 27, 2023, 04:54:51 PMI am wondering what the best practice is for storing output descriptors.Those are quite long but you can write those on paper which you can store in a vault or something.Just make sure to backup all descriptors for both internal and external chain, that makes 8 parent descriptors to backup (by default).You can test if your backup can restore the correct keys by creating a blank wallet, import them all (importdescriptors)and use the command: getaddressinfo \"address\" to see if it's \"ismine\" and \"solvable\" 'true'.Use that command on your addresses of different script type, including the change.Or you can also rely on the checksum which should be able to detect typos with relatively high reliability.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DifDrama",
      "created_time": "July 28, 2023, 09:57:10 AM",
      "body": "Quote from: ETFbitcoin on July 28, 2023, 09:41:26 AMAnd you also can consider having multiple backup on different medium.right, and also regularly update the backups to include any changes or new addresses generated by the wallet.  This ensures that your backup remains up-to-date.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LoyceV",
      "created_time": "July 28, 2023, 12:38:37 PM",
      "body": "Quote from: DifDrama on July 28, 2023, 09:57:10 AMalso regularly update the backups to include any changes or new addresses generated by the wallet.That's not needed for HD-wallets. But you may want to backup your address labels once in a while.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SeriouslyGiveaway",
      "created_time": "July 30, 2023, 08:49:38 AM",
      "body": "Quote from: aesthete2022 on July 27, 2023, 04:54:51 PMI am wondering what the best practice is for storing output descriptors. Currently I have them offline on USB drives. However, there is an obvious risk of physical/environmental degradation over time. My instinct is that it would be foolish to save them on a cloud. I guess the tradeoff is physical degradation vs. being hacked. I'm guessing the latter is probably more likely.USB drives are not the best because your USB drives more easily to have technical problems than with HDDs. Any drives can have technical problems and if you can not retrieve data in drives, you lose your backups.Backup-wise practice will be making your backup in different drives, different formats like drives, paper, steel sheets. If one is damaged, you will have others to use and recover your wallet.Security checklistSecuring your walletsBitcoin security and resources5 common ways on how people lose their coinsSecuring Your Seed Phrase with Washers fillippone.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}