{
  "id": "topic_5466501",
  "title": "DdmrDdmr",
  "author": "DdmrDdmr",
  "created_time": "September 12, 2023, 09:09:06 AM",
  "content": "Es de las noticias que vemos de vez en cuando, y que resultan dolorosas de procesar. La noticia la he visto en un hilo del norte, donde se referencia una TX de hace menos de dos día en la cual se enviaron 0,0740544 BTC (1.916,53 $) con un fee de 19,82108632 BTCs (512.969,72 $) …Las especulación al respecto parece tomar la idea de que la TX podría ser debida a un fallo en algún software de un Exchange o Servicio, dado que la dirección implicada ya tenía más de 60K TX de entrada y de salida. Por lo menos esa es la opinión de una de la voces conocidas del sector, Jameson Lopp. El pool de minería detrás de la confirmación de la TX en cuestión, F2Pool, ha dado tres días de plazo para que el errante pudiese reclamar los fees (se desconocen los detalles del montante que se devolvería). Veremos cuándo llegamos a conocer los siguientes episodios de este caso.El caso si da que pensar en estos casos de error en los fees en su generalidad. El caso el flagrante, y requiere que el generador de la TX los reclame. El problema podría venir si esto sucede con algún particular (sipo OG) que no quisiese desvelar mucha información en el proceso de reclamo. Supongo que con poder firmar un mensaje desde la dirección y usar un correo electrónico con (supuesta) provacidad elevada debería bastar, pero, según la jurisdicción del minero, puede que se requiriese identificarse de manera plena …Ver:https://blockchair.com/bitcoin/transaction/d5392d474b4c436e1c9d1f4ff4be5f5f9bb0eb2e26b61d2781751474b7e870fdhttps://mempool.space/es/block/00000000000000000003c71f775c304277b2afce5c70c557f24d5333d524a35e",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5466501",
  "comments": [
    {
      "author": "darbitmobilerecovery",
      "created_time": "September 12, 2023, 06:30:01 PM",
      "body": "Pavadita de fee.....Hay una cosa que no termino de entender, porque le dan solo 3 dias para reclamar? Si digamos que ya quedo grabado para siempre y es trazable justamente de quien seria.Igual claramente es de alguien que tiene una fortuna, o de un exchange o algo por el estilo como dice la nota. Lo que no termino de entender es porque sucede esto del todo.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Porfirii",
      "created_time": "September 13, 2023, 05:04:22 AM",
      "body": "Casi medio millón de euros, menuda barbaridad Parece un gesto de buena fe por parte del pool el dar el plazo para reclamar que comentáis. No parece que tuvieran ninguna obligación de tomar la iniciativa. Pero en cuanto a de quién serían los Bitcoin si la transaccióm fue confirmada y quedó grabada para siempre, yo sí tengo mis dudas.Es vox populi en nuestro nicho que quien tiene las claves es el propietario legítimo de las monedas, pero el Derecho, por lo menos el continental, no sigue ese principio. Pienso, por ejemplo, en la finca a la que caen frutos de la finca de al lado, porque dichos frutos no pasarían automáticamente a ser propiedad del vecino. O la transacción, sin ir más lejos, hecha por error o sin causa, cantidad que solo acabaría siendo del nuevo propietario tras larguísimo plazo sin que se haya reclamado su devolución (prescripción adquisitiva).Así, volviendo al caso, me surgen más dudas sobre los motivos de darse tanta prisa. Quizá el pool, sabedor de que en cualquier momento les pueden reclamar dichas fees, quiere acortar a tres días el plazo para hacerlo? es lo que pasa con la intención, que es difícil de probar.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DdmrDdmr",
      "created_time": "September 13, 2023, 06:24:28 AM",
      "body": "Quote from: darbitmobilerecovery on September 12, 2023, 06:30:01 PM<…> Hay una cosa que no termino de entender, porque le dan solo 3 dias para reclamar? Si digamos que ya quedo grabado para siempre y es trazable justamente de quien seria. <…> Entiendo que es una suerte de deferencia dado el fee sobrepagado en este caso, posiblemente también con cierto aroma de dejar un margen de reclamación por si hubiese alguna denuncia legal derivada, junto con un afán de cerrar el tema pronto y no dejarlo coleando sine die. Tampoco es que existe un \"consenso BPIP\" para que los mineros estén abiertos a contemplar reclamaciones de fees durante cierto tiempo dentro de su estructura descentralizada. Sería interesante ver qué sucedería legalmente si alguien pusiese una reclamación por los fees (ya no digo por el importe de la TX en otros hipotéticos). Aunque dependerá mucho de los abogados, jueces y jurisdicciones, yo creo que habría cancha para sentar precedentes.He visto algún caso que otro donde en circunstancias similares, el plazo fue mayor.Edit: Veo que voy en la misma linea argumental que Porfirii.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "famososMuertos",
      "created_time": "September 13, 2023, 02:25:31 PM",
      "body": "A mi el sistema de fee pongo \"2sat/B\"/  ya me alerta y funciona para un par de dólares... que puede leerse en broma pero al menos es así, lo indica con un mensaje de \"advertencia: bla, bla\" y suele suceder incluso con algunos exchange centralizados, de hecho funciona igual para cuando el fee es muy bajo, entonces algo así, no es un error, es una rareza o intencional, como el que no se los quiere \"robar\" pero te \"jode\" de alguna manera.En serio, estas cosas no deberían suceder, dónelas a caridad y no se equivoque con el señor fee. Gracias al Sr. de la Alianza por su siempre gestión jurídica, pero por sobre todo mantener la lectura fácil sin tecnicismo jurídicos que se que los tiene.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "seoincorporation",
      "created_time": "September 13, 2023, 03:53:22 PM",
      "body": "Quote from: darbitmobilerecovery on September 12, 2023, 06:30:01 PMHay una cosa que no termino de entender, porque le dan solo 3 dias para reclamar? Si digamos que ya quedo grabado para siempre y es trazable justamente de quien seria.Aunque fue un error humano definitivamente esos fees les corresponden al Pool de Minería ya que los impuestos de transacción son una de las formas de ingresos de los mineros. Incluso se me hace raro que le den oportunidad de reclamarlos, creo que es algo muy decente por parte de F2Pool el ofrecer devolver el dinero, ya que si este bloque hubiera sido minado por algún \"solo miner\" entonces la opción de reembolso hubiera sido nula.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "albert0bsd",
      "created_time": "September 13, 2023, 04:11:25 PM",
      "body": "Si F2pool realmente quisiera devolver el fee que se mando por error mis preguntas son.Por que no simplemente se lo devuelve a la direccion que cometio el error?Existe alguna posibilidad de que se trate de una forma de realizar un Mix/Lavado del Uxto que se envio como fee, (Yo ya descarte esto ya que la transaccion fue publica y no una transaccion privada que solo tuviera F2pool, lo cual cual quiere decir que cualquier lo pudo minar por que estuvoal menos 7 minutos en el mempool)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DdmrDdmr",
      "created_time": "September 14, 2023, 06:56:21 AM",
      "body": "Técnicamente, el post de @Chun con la oferta de reembolso de los fees  ha vencido esta madrugada (post de 3:17 a. m. · 11 sept. 2023), y al ir a revisar si habían novedades al respecto veo que ha publicado lo siguiente:QuoteI was annoyed and regretted agreeing to refund that 20 BTC. Especially when I saw the person claiming it kept saying EST instead of EDT/UTC. Last time a Zcash guy did that, I blocked his entire company. Ref: http://x.com/satofishi/status/1394868945711079426      http://x.com/satofishi/status/1394865223169822724 So what should I do?-Refund Paxos as is-Distribute it to miners-Go fifty-fifty-Just freeze itDe lo anterior, parece que es Paxos (*) quien realizó la TX con los fees idos de madre. Ahora bien, No he visto en sus posts que indique que sea Paxos fuera de la encuesta anterior, por lo que asumo que es donde lo declara.Luego el rollo sobre EST y EDT parece del todo irrelevante: si lo está reclamando en el plazo fijado, no hay más de qué hablar. Ha de respetar el acuerdo. La chorrada que dice (que lo es a todas luces, dado que no es una discusión sobre si la petición entró o no en plazo) es un pretexto de malcriado, con ganas de no devolver los fondos por completo, y montar el circo en el proceso al estilo Musk.(*) Bueno, o Paxos realizando operaciones para Paypal:ver: https://bitcoinmagazine.com/markets/paypal-reportedly-overpaid-510750-in-the-largest-usd-bitcoin-transaction-fee-ever-Nota:QuoteEST and EDT: The Main DifferenceSome people get confused between Eastern Standard Time and Eastern Daylight Time. To remember it correctly, EST is when North Americans live with it during fall and winter. Meanwhile, EDT happens during spring and summer. Just remember the world daylight to connote spring and summer because there are additional daylight hours used during this period.Ver: https://www.worldtimeserver.com/learn/et-est-edt-when-do-you-use-these-terms/Quote from: albert0bsd on September 13, 2023, 04:11:25 PM<...>Diría que realizó la oferta (no reglada) al ver el revuelo mediático, y luego se arrepintió. Si hubiese hecho la devolución automática, no tendría manera de procrastinar con la decisión.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Artemis3",
      "created_time": "September 15, 2023, 07:10:22 AM",
      "body": "En Bitcoin las transacciones son finales. Paxos tuvo suerte que lo encontró f2pool pero y si lo consigue un anónimo haciendo solo mining? Yo no lo devuelvo, bien brutos los de Paxos cometer semejante error es como hacerse robar o mas bien negligencia al hacer mal uso de fondos.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hispo",
      "created_time": "September 15, 2023, 10:08:21 AM",
      "body": "Vi la noticia y lo primero que se me vino a la mente fue que se trató de un error de alguna persona u organización de manejo que fondos, la cual confundió los campos de entrada para si transacción, mezclado entre si el campo de fee y el de la cantidad a ser enviada hacia la otra billetera.Muy raro que Paxos cometa un error como este,.siendo que una de las piedras angulares de su organización es el supuesto profesionalismo y arbitraje sobre el respaldo de sus activos. También es relativamente sorpresivo que el pool ofreciese devolver los fondos, un minero anónimo no hubiese hecho los mismo o hubiese Sido más difícil que así fuese el caso, de todos modos.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "albert0bsd",
      "created_time": "September 15, 2023, 02:02:44 PM",
      "body": "Los fondos ya fueron devueltos.https://mempool.space/tx/1b9adb2878fce5cd1b6a11a011e3965f904829228d57cf90ca6731cd501890c6Y la transaccion fue hecha con 0 Fees. asi de \"Mira y aprende Paxos\"  Personalmente me hubiese gustado ver que le demorarán un poco más el retorno del balance. Ya que al estar relacionado con Paypal se debería de haber aprovechado la oportunidad para que probaran un poco de la misma calidad del servicio que ellos ofrecen, se que para estas empresas Medio millón no es nada para estas empresas, pero por ejemplo para pequeñas empresas puede representar un problema que un gestor de pagos como paypal te retenga arbitrariamente esa cantidad, ejemplo el caso de Flipper Zero contra paypal, solo por poner un ejemplo.https://twitter.com/flipper_zero/status/1567194641610465281Saludos!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DdmrDdmr",
      "created_time": "September 15, 2023, 03:02:50 PM",
      "body": "Como curiosidad, la encuesta que planteó Chun en relación a qué hacer con los fondos obtuvo 4.811 votos, acorde a la siguiente distribución:-Refund Paxos as is (28,9%)-Distribute it to miners (35,9%)-Go fifty-fifty (15,9%)-Just freeze it (19,2%)No sé si es por concepto, o por cierto sesgo en los followers de la cuenta de twitter (por ejemplo, del propio pool de minería), pero ganó la opción de distribuirlo entre los mineros.Como los contendientes son de peso específico, y hubo además una oferta para devolver los fees, no creo que el pool tuvisese ganas de posibles litigios, por mucho que estén en las Islas Caimán. Ver: https://twitter.com/satofishi/status/1702095123981738437",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "albert0bsd",
      "created_time": "September 15, 2023, 06:00:00 PM",
      "body": "Quote from: DdmrDdmr on September 15, 2023, 03:02:50 PM... no creo que el pool tuvisese ganas de posibles litigiosHablando del tema me preocupa que esto pueda sentar una especie de precedente. Si bien es cierto que no es la primera vez que se lleva a cabo una devolución de este tipo, lo que realmente inquieta es el alcance mediático que ha tenido este caso en particular.Es un acontecimiento que ha capturado la atención de la comunidad financiera, tecnológica y en general de la comunidad de bitcoinLa preocupación radica en que podría abrir la puerta a futuras situaciones problemáticas. Imagina un escenario en el que surja alguien con argumentos similares a los de Craig Wright, alegando que los mineros tienen una especie de responsabilidad fiduciaria o, incluso peor, argumentando alguna idea descabellada sobre la enmienda de errores y pérdidas de usuarios que han perdido el acceso a sus monedas y/o carteras.Mi recomendacion para los mineros seria no devolver nada y que las personas/corporaciones aprendan de sus errores.Saludos",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DdmrDdmr",
      "created_time": "September 16, 2023, 07:59:48 AM",
      "body": "Quote from: albert0bsd on September 15, 2023, 06:00:00 PM<…>Yo diría que el precedente que realmente contará es el que tenga alguna resolución por la vía judicial, siendo consciente a la vez que el ámbito jurídico/geográfico no será de aplicación global. Conforme pase el tiempo, y si bitcoin llega a tener mayor asimilación en los estamentos institucionales que manejen mayores fondos, creo que veremos reclamaciones de un tipo u otro bien por TXs erróneamente realizadas, bien por fees idos de madre. Luego, en su caso, los resultados de los juicios dirán...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hispo",
      "created_time": "September 16, 2023, 11:11:21 PM",
      "body": "Quote from: DdmrDdmr on September 16, 2023, 07:59:48 AMQuote from: albert0bsd on September 15, 2023, 06:00:00 PM<…>Yo diría que el precedente que realmente contará es el que tenga alguna resolución por la vía judicial, siendo consciente a la vez que el ámbito jurídico/geográfico no será de aplicación global. Conforme pase el tiempo, y si bitcoin llega a tener mayor asimilación en los estamentos institucionales que manejen mayores fondos, creo que veremos reclamaciones de un tipo u otro bien por TXs erróneamente realizadas, bien por fees idos de madre. Luego, en su caso, los resultados de los juicios dirán...Un maximalista de Bitcoin podría argumentar que dentro de este ecosistema no son necesarios los jueces, porque en ellos se representa una de las figuras por defecto de lo que es un \"trusted third party\", en la realidad sabemos que siendo esta cadena de bloques un ente que solo obedece firmas criptográficas, es facil construir un argumento sobre la poca necesidad de jueces en un sistema que nacio para funcionar sin ellos.Ahora bien, si extrapolamos al futuro y con las técnicas supuestamente sofisticadas de analisis de la blockchain, podrían empezar a darse casos como este, en el que un bien conocido minero o pool de minería sería el protagonista de una cuestión moral y quizá la siguiente ocasión un juez tendría que dictar una orden (mas que todo simbólica, pues es muy poco probable que ambos el descuidado que envio la transaccion y el minero se encuentren en una misma jurisdiccion).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Artemis3",
      "created_time": "September 17, 2023, 07:22:19 PM",
      "body": "Nada mas los pool pueden mandar transacciones a 0 fees (cuando consiguen un bloque), por eso es que nos inundaron de spam la blockchain con monos y otras bobadas, porque hay un pool involucrado...Hispo la culpa la tiene el que lo hace, no el que lo recibe. Las transacciones en Bitcoin son finales, tu no usas Bitcoin si no sabes esto y por eso se te dice que verifiques tres veces antes de enviar nada.Lo que dices es externo a Bitcoin. A Bitcoin no le importa el mundo humano, errores al enviar, precio de mercado, nada de eso está en el código es ajeno por completo. Intentar manipular es caerse a mentiras, no existirá una organización mundial buscando de ejercer acciones judiciales dentro de Bitcoin, si lo hacen que lo hagan afuera (a los humanos).Esto no fue un robo. Hay gente que ha quemado dinero enviando por ejemplo a una altcoin derivada de Bitcoin; no hay vuelta atrás. Esto no es Ethereum donde las transacciones no se respetan a perpetuidad y en cualquier momento lo puedes perder todo porque tres gatos lo deciden.Tu no puedes establecer esto porque creas un mal precedente, la gente va querer depender de una acción externa que no es aplicable. Lo que quieres es tener un sistema de revertir transacciones como te acostumbró el banco o las tarjetas, esto es un gigantesco NO porque se presta a la manipulación humana arbitraria, es re-introducir el mal del dinero fiat, donde humanos deciden quien puede y quien no puede.Por eso es que NO. Bitcoin vale porque no se puede hacer eso, si tu lo vez como \"defecto\" e introduces una altcoin que si lo hace, verás que nunca crece porque no entendiste lo que le dio valor real a Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hispo",
      "created_time": "September 19, 2023, 12:14:51 AM",
      "body": "Quote from: Artemis3 on September 17, 2023, 07:22:19 PMNada mas los pool pueden mandar transacciones a 0 fees (cuando consiguen un bloque), por eso es que nos inundaron de spam la blockchain con monos y otras bobadas, porque hay un pool involucrado...Hispo la culpa la tiene el que lo hace, no el que lo recibe. Las transacciones en Bitcoin son finales, tu no usas Bitcoin si no sabes esto y por eso se te dice que verifiques tres veces antes de enviar nada.Lo que dices es externo a Bitcoin. A Bitcoin no le importa el mundo humano, errores al enviar, precio de mercado, nada de eso está en el código es ajeno por completo. Intentar manipular es caerse a mentiras, no existirá una organización mundial buscando de ejercer acciones judiciales dentro de Bitcoin, si lo hacen que lo hagan afuera (a los humanos).Esto no fue un robo. Hay gente que ha quemado dinero enviando por ejemplo a una altcoin derivada de Bitcoin; no hay vuelta atrás. Esto no es Ethereum donde las transacciones no se respetan a perpetuidad y en cualquier momento lo puedes perder todo porque tres gatos lo deciden.Tu no puedes establecer esto porque creas un mal precedente, la gente va querer depender de una acción externa que no es aplicable. Lo que quieres es tener un sistema de revertir transacciones como te acostumbró el banco o las tarjetas, esto es un gigantesco NO porque se presta a la manipulación humana arbitraria, es re-introducir el mal del dinero fiat, donde humanos deciden quien puede y quien no puede.Por eso es que NO. Bitcoin vale porque no se puede hacer eso, si tu lo vez como \"defecto\" e introduces una altcoin que si lo hace, verás que nunca crece porque no entendiste lo que le dio valor real a Bitcoin.No me malinterpretes. Estoy consciente de que el valor de Bitcoin radica de su número limitado y del hecho de que no existe un tercero entre las partes. Y como estoy consciente de que las transaciones son finales, reviso como tres o cuatro veces antes de firmar una transacción.Solo quisé señalar que esto es un precedente que en general, no se vería, no me hubiese imaginado y de las posibles implicaciones legales si los mineros y la persona que envia la transación comparten jurisdicción.No fué un robo, y creo que si el bloque lo hubiese encontrado un minero anónimo, no estariamos viendo un retorno de los fondos.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "seoincorporation",
      "created_time": "September 20, 2023, 12:11:01 AM",
      "body": "No había visto la transacción hasta ahora.https://mempool.space/tx/1b9adb2878fce5cd1b6a11a011e3965f904829228d57cf90ca6731cd501890c6Creo que hay dos factores muy interesantes en ella, como ya mencionaron el echo de que se gastaran cero fees en la transacción y en segundo el cambio de 750 btc. Fue como un toma tus bitcoins, a nosotros nos sobran, y a la vez dejar claro el poder de inyectar sus transacciones en los bloques. Fue una buena historia con final feliz y una interesante lección.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DdmrDdmr",
      "created_time": "November 23, 2023, 11:53:57 AM",
      "body": "Hoy se ha producido un nuevo caso de una TX con una cantidad de fee pagado ido de madre, que supera el caso del OP en valor absoluto:https://mempool.space/es/tx/b5a2af5845a8d3796308ff9840e567b14cf6bb158ff26c999e6f9a1f5448f9aaLa TX, que es reemplazo de otra precedente, ha pagado ni más ni menos que 83,65 BTCs en fees, a razón de 76,397,238 sat/vB, para traspasar 55,77 BTCs. Menos mal que usó Segwit …Una brutalidad de error que en ocasiones ha logrado negociarse para resarcir en gran medida el exceso pagado, pero que ahora veremos la fuerza de la persona que cometió el error ante AntPool.Nota, el RBF ya venía de un pago de fees ido a razón de 65,086,251 sat/vByte, y se efectuó en un plazo de 31 segundos, lo cual me hace que sea aún más sorprendente el caso. De hecho, el envío inicial fue de 68,32 BTCs, pero el RBF redujo la base del envío a los 55,77 BTCs de la TX confirmada.ver: https://mempool.space/es/tx/0c35f3c8a0c38f45629940ee9ab2b1c93d408be113845a735043261ad20f3351",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "albert0bsd",
      "created_time": "November 23, 2023, 03:48:27 PM",
      "body": "Es sorprendete ver este tipo de casos. Sinceramente espero que esta vez no les devulvan nada...Revisando el audit del block se verifica que hace Match con el block esperado lo cual como ya comentaste con el RBF, la transaccion fue realizada publicamente.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}