{
  "id": "topic_5423826",
  "title": "creep_o",
  "author": "creep_o",
  "created_time": "November 27, 2022, 05:31:20 PM",
  "content": "Eccolo qua, il posticino dove sentirsi liberi di postare qualsiasi tipo di musica, di qualsiasi età e motivazione.Musica impegnata o dissoluta… a tema bitcoin e non… secondo l’ispirazione del momento.E dato il tema del thread, inizio con questo classico (1976): John Miles con appunto la sua Music.https://youtu.be/lAsvjVx-Mg4",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5423826",
  "comments": [
    {
      "author": "mendace",
      "created_time": "November 27, 2022, 08:25:15 PMLast edit: November 28, 2022, 12:39:17 AM by mendace",
      "body": "Io vado su un evergreen che personalmente non guasta mai. https://youtu.be/mPbclTnMLlc",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "creep_o",
      "created_time": "November 27, 2022, 10:46:18 PM",
      "body": "Quote from: mendace on November 27, 2022, 08:25:15 PMIo vado su un evergreen che personalmente non guasta mai. https://youtu.be/mPbclTnMLlcApperó i Queen. Il mio gruppo preferito di tutti i tempi! La voce di Freddie Mercury poi semplicemente inarrivabile.Chiuderó un occhio sul fatto che hai messo la foto di Rami Malek lì sopra, invece di Freddie (che tra l’altro se n’è andato proprio in questi giorni di 31 anni fa, il 24 Novembre).E ora avanti col prossimo pezzo 👍🏻 Vediamo i gusti anche degli altri",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fillippone",
      "created_time": "November 28, 2022, 12:30:17 AMLast edit: May 15, 2023, 11:03:20 AM by fillippone",
      "body": "Quote from: mendace on November 27, 2022, 08:25:15 PMIo vado su un evergreen che personalmente non guasta mai. https://youtu.be/mPbclTnMLlcMiglior canzone della storia. Ma ti prego cambia la locandina. Dopo i Bohemian Rhapsody e quasi tutta la discografia dei Queen vengono altri Gruppi. Questo, del quale vi propongo una versione Remix, perchè l'originale la conosciamo tutti e Mike Shinoda non è davvero male:In terza posizione sua Glamità Brian Molko: Avrete capito che mi piacciono i gruppi che danno spettacolo dal vivo...Poi spazio davvero ad estremi opposti Busta Rhymes e Orjan Nielsen ve li risparmio.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "creep_o",
      "created_time": "November 28, 2022, 10:58:36 PM",
      "body": "Ok fillippone, anche la versione di Shinoda di enjoy the silence non è male, e la conoscevo già.Orjan Nielsen invece mai sentito… l’ho cercato adesso e ascoltato x pochissimo (mancanza di tempo) ma tornerò sicuramente a cercarlo x ascoltarlo con più attenzione.Rimando quindi con Craig Armstrong (chissà non ti piaccia vista la tua ultima proposta su Meta).Prima un suo classico: Ballhttps://youtu.be/cPin0iR6BKME poi una sua chicca (imo): un remix di un pezzo dei Madredeus: Anseiohttps://youtu.be/agzwHWHck6k",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lillominato89",
      "created_time": "December 04, 2022, 08:17:18 AM",
      "body": "Vi posto una chicca, in realtà non l'ascoltavo dai tempi del liceo, e ritrovarmela davanti gli occhi girando su YouTube è stata davvero piacevole! Quindi la voglio condividere con voi! La conoscete sicurohttps://youtu.be/St6jyEFe5WM",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "creep_o",
      "created_time": "December 08, 2022, 09:44:26 PM",
      "body": "Quote from: Lillominato89 on December 04, 2022, 08:17:18 AMVi posto una chicca, in realtà non l'ascoltavo dai tempi del liceo, e ritrovarmela davanti gli occhi girando su YouTube è stata davvero piacevole! Quindi la voglio condividere con voi! La conoscete sicurohttps://youtu.be/St6jyEFe5WMBella!!! Anch’io stasera ho fatto un tuffo nel passato quando alla radio hanno passato inaspettamente Your Love di Frankie Knuckles https://youtu.be/LOLE1YE_oFQ",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lillominato89",
      "created_time": "December 08, 2022, 09:58:03 PM",
      "body": "Quote from: creep_o on December 08, 2022, 09:44:26 PMQuote from: Lillominato89 on December 04, 2022, 08:17:18 AMVi posto una chicca, in realtà non l'ascoltavo dai tempi del liceo, e ritrovarmela davanti gli occhi girando su YouTube è stata davvero piacevole! Quindi la voglio condividere con voi! La conoscete sicurohttps://youtu.be/St6jyEFe5WMBella!!! Anch’io stasera ho fatto un tuffo nel passato quando alla radio hanno passato inaspettamente Your Love di Frankie Knuckles https://youtu.be/LOLE1YE_oFQWee qui andiamo proprio sul retrò! Non ero neanche nato quando è stata registrata 🤣Ovviamente anche quella che ho postata io è ancora più vecchia ma è sempre in onda sulle radioEditPer retrò intendo il tipo di musica dance/tecno degli anni 80, stiamo parlando comunque di una canzone di almeno 35 anni fa",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "duesoldi",
      "created_time": "December 09, 2022, 03:52:33 PM",
      "body": "Va beh visto che mi provocate....  allora io metto questa:https://www.youtube.com/watch?v=_hLSAXwCCFYmi piaceva in modo particolare anche perché per alcuni anni la mettevano come prima canzone al termine dei concerti di Vasco. Quando sentivi questa (dopo Albachiara) voleva dire che non c'erano più bis.E' passato qualche annetto..... metà anni 80:  all'epoca mi sa che c'eravamo solo io e @fillippone :  lui cuccava, io ascoltavo musica",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mendace",
      "created_time": "December 09, 2022, 05:44:40 PM",
      "body": "Raga per me restano una delle poche band che riesco ad ascoltare con leggerezza, non me ne vogliate. https://www.youtube.com/watch?v=kXYiU_JCYtU",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "creep_o",
      "created_time": "January 03, 2023, 01:02:05 PM",
      "body": "Parlando delle whales di bitcoin, mi son tornati in mente gli italianissimi Amycanbe, con la loro Everywhere, un pezzo rock alternativo di qualche anno fa. Brano in cui hanno campionato i suoni emessi proprio dalle balene.Vi piace?https://m.youtube.com/watch?v=KhitVPJCvMU",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lillominato89",
      "created_time": "January 11, 2023, 09:57:23 PM",
      "body": "Quote from: creep_o on January 03, 2023, 01:02:05 PMParlando delle whales di bitcoin, mi son tornati in mente gli italianissimi Amycanbe, con la loro Everywhere, un pezzo rock alternativo di qualche anno fa. Brano in cui hanno campionato i suoni emessi proprio dalle balene.Vi piace?https://m.youtube.com/watch?v=KhitVPJCvMUMai sentita sinceramente, ma io non faccio testo! Sono un rockettaro per lo più... Anzi vi giro una chicca che difficilmente non conoscete 😁stiamo parlando di Piaro Palù 🤣https://youtu.be/Uz_ATwymyis",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "creep_o",
      "created_time": "January 11, 2023, 10:43:58 PM",
      "body": "Quote from: Lillominato89 on January 11, 2023, 09:57:23 PMAnzi vi giro una chicca che difficilmente non conoscete 😁stiamo parlando di Piaro Palù 🤣https://youtu.be/Uz_ATwymyisGrandi Litfiba di Via de’ Bardi! Almeno versione prima maniera x quanto mi riguarda, quindi al massimo fino al 1990 della tua El Diablo… ma quei pochi album che salvo li ho adorati e fatti girare 1000 volte in macchina con gli amici.Cavolo quanti anni, anzi decenni 🙂 erano che non li avevo più ri-ascoltati… mi hai fatto fare un bel tuffo indietro con bei ricordi Lillo 😎",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "creep_o",
      "created_time": "March 22, 2023, 08:57:46 PM",
      "body": "Brano molto breve ma intenso, che comunque riesce a rivelare tutte le (poche  ) doti canore del VC Tim Draper, con il suo personalissimo pezzo dedicato al nostro amico arancione.Esibizione live in questi ultimi paio di giorni alla París Blockchain Week 2023.https://twitter.com/realdanielnita/status/1638484098757844993?s=20Puro pathos 🥹 😀",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "creep_o",
      "created_time": "October 14, 2023, 01:24:08 PM",
      "body": "Riuppo a grande richiesta il thread - sono stato letteralmente subissato di messaggi pregandomi di riprendere con la rassegna musicale…Beh insomma ovviamente sto scherzando 😀😀😀Comunque sia, ritorno a postare qualcosa:Indila - Dernière Danse (Scott Rill Remix)https://m.youtube.com/watch?v=6BZBPnG-5ooDj Belite x 2Pac - All Eyez on Mehttps://m.youtube.com/watch?v=1Bor5HtxnMQ&pp=ygUYYWxsIGV5ZXogb24gbWUgZGogYmVsaXRl",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "alexrossi",
      "created_time": "October 15, 2023, 07:05:41 AM",
      "body": "Baby Jane di sir rod Stewart a capodanno di Rio nel 1994, show più grande del mondo https://www.youtube.com/watch?v=JkcfvcJiwsU",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}