{
  "id": "topic_5460115",
  "title": "Makus",
  "author": "Makus",
  "created_time": "July 17, 2023, 04:56:06 PMLast edit: July 17, 2023, 08:27:07 PM by Makus",
  "content": "Data analysis by kaiko shows that  the XRP token currently have a higher trade volume in comparison with Bitcoin the data shows that XRP leads with 21% and Bitcoin 20%, the catalyst behind it's growth since last week was caused by the legal battle won by Ripple against the US SEC Despite XRP taking the lead on trade volume, Bitcoin is still the the greatest coin with its current price over $30k and Ripple $0.73, by comparison the price of Bitcoin is way  too vast for dethronementI still believe Bitcoin is the best coin ever and will continue to soar higher till there is nothing to dethrone or compare",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5460115",
  "comments": [
    {
      "author": "_act_",
      "created_time": "July 17, 2023, 05:00:13 PM",
      "body": "Bitcoin marketcap is approximately $585 billion. https://www.coingecko.com/en/coins/bitcoinRipple marketcap is approximately $39 billion. https://www.coingecko.com/en/coins/ethereumIs that comparable? Bitcoin is even 15 times more.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pawel7777",
      "created_time": "July 17, 2023, 05:02:27 PM",
      "body": "This is nothing new, plenty of times we have seen trading volumes of altcoins being higher than Bitcoin's (that's not to mention USDT, which constantly has its volume around twice as high as Bitcoin's).As you said yourself, this is obviously driven by the recent news, and things are already returning to normal. Looking at the CMC right now, BTC's volume is over x3 times higher than XRP's. So the \"dethronement\" was very short-lived.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Majestic-milf",
      "created_time": "July 17, 2023, 05:16:55 PM",
      "body": "Quote from: pawel7777 on July 17, 2023, 05:02:27 PM. So the \"dethronement\" was very short-lived. I'm my opinion, there's no need to use the word \"dethrone \". Because an Altcoin like XRP managed to lead by 21% doesn't mean anything. According to what you said, if there was no legal battle, I don't think you'd be coming here to make this thread. It's very impossible for XRP to dethrone Bitcoin because it would have to increase like 50,000 times for such to happen. The more XRP coins available, the lower the value, so it's out of the question if BTC can be dethroned by it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "komisariatku",
      "created_time": "July 17, 2023, 05:45:27 PM",
      "body": "I think you underestimate bitcoin too much. Bitcoin has a market capitalization of up to 15x the XRP token. The only token that comes close to bitcoin is ethereum, but I believe that in the next 5 years, ethereum will not be able to beat bitcoin market cap either. XRP has high transactions due to the good news that the case with the SEC was won by XRP, but there is a possibility that the SEC will appealMaybe XRP is well priced now, but it's too early to judge XRP. The case battle between Ripple and the SEC is likely to continue. If the SEC doesn't appeal, or loses the appeal hearing, chances are XRP's price will be very good. This is a good time to speculate about XRP. But I'm not recommending anything else, the decision is yours",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Aanuoluwatofunmi",
      "created_time": "July 17, 2023, 06:08:39 PM",
      "body": "Quote from: Makus on July 17, 2023, 04:56:06 PMData analysis by kaiko shows that  the XRP token currently have a higher trade volume in comparison with Bitcoin the data shows that XRP leads with 21% and Bitcoin 20%, the catalyst behind it's growth since last week was caused by the legal battle won by Ripple against the US SECWhere is the data that you're claiming that shows that when you're unable to provide a link to such, must you believe everything you read about on the internet to be true, i don't even expect you to say that of XRP compared to bitcoin when there are other cryptocurrencies far better in market cap than XRP, but yet they still follows behind bitcoin which is the leading cryptocurrency ever.Quote from: Makus on July 17, 2023, 04:56:06 PMI still believe Bitcoin is the best coin ever and will continue to soar higher till there is nothing to dethrone or compareBut you've just counter this from what you first posted from the first few lines of your content, maybe you should go through them again and see what you've said initially, even on altcoins discussion board this isn't discussed that they are far better or preferred to bitcoin, you can always make your own research too as well, everyone knows that bitcoin is the king of cryptocurrency",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Silberman",
      "created_time": "July 17, 2023, 06:36:10 PM",
      "body": "Quote from: Makus on July 17, 2023, 04:56:06 PMData analysis by kaiko shows that  the XRP token currently have a higher trade volume in comparison with Bitcoin the data shows that XRP leads with 21% and Bitcoin 20%, the catalyst behind it's growth since last week was caused by the legal battle won by Ripple against the US SEC Despite XRP taking the lead on trade volume, Bitcoin is still the the greatest coin with its current price over $30k and Ripple $0.73, by comparison the price of Bitcoin is way  too vast for dethronementI still believe Bitcoin is the best coin ever and will continue to soar higher till there is nothing to dethrone or compareThere are many people that wish to see bitcoin to be out of the leading position of this market, but as long as altcoins are created based on its technology then there is now way those coins are ever going to surpass bitcoin, if an altcoin want to surpass bitcoin then the developers behind it will need to create a lot of innovations and still make their project open source, as even if their coin was superior but their coin was privately owned then it will still be unable to surpass bitcoin, as the community will not leave bitcoin behind just to become part of a centralized project.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cheezcarls",
      "created_time": "July 17, 2023, 06:40:00 PM",
      "body": "Quote from: Makus on July 17, 2023, 04:56:06 PMData analysis by kaiko shows that  the XRP token currently have a higher trade volume in comparison with Bitcoin the data shows that XRP leads with 21% and Bitcoin 20%, the catalyst behind it's growth since last week was caused by the legal battle won by Ripple against the US SEC Despite XRP taking the lead on trade volume, Bitcoin is still the the greatest coin with its current price over $30k and Ripple $0.73, by comparison the price of Bitcoin is way  too vast for dethronementI still believe Bitcoin is the best coin ever and will continue to soar higher till there is nothing to dethrone or compareBecause of XRP's short term trend means that BTC is dethroned just like that? Nah Nah!!No one can dethrone Bitcoin and XRP will never be the one as the market capitalization gap is way far from each other. Bitcoin is the OG of all cryptocurrencies.Without Bitcoin, XRP and other altcoins would have never existed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitcoinPanther",
      "created_time": "July 17, 2023, 07:13:10 PM",
      "body": "@OP you could have verify the data first if the statistics is true. Besides you should give a link to the said statistics to support the claim.  As of the reply I checked the trading volume of Bitcoin and XRP and XRP is no way near the volume of Bitcoin in the market.  You can check the data from Coingecko or coinmarketcap to see for yourself how the claim is somehow not true.As I looked for the article I found that some sites had released the same statement but I believe @OP's post is somehow late for this for the event happens earlier though I am still in doubt of the credibility of the news since looking at coingecko and coimarketcap the statistics does not coincide with the claim of Kaiko.Article stating XRP surpassing BTC trading volume:https://cryptopotato.com/xrp-surpasses-bitcoin-in-terms-of-trading-volume-following-ripple-v-sec-win/https://beincrypto.com/xrp-trading-volume-overtakes-bitcoin/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Adbitco",
      "created_time": "July 17, 2023, 07:17:53 PM",
      "body": "Op I think you should change your title as I believe replies are based on what your title is saying. There is no way to say an altcoin to dethroned bitcoin by how??Despite the XRP winning a legal case with the SEC and the price increased by either 21% doesn't really show full expression to say that bitcoin has been dethroned. Btw bitcoin is what sustaining other altcoins by giving power to have a stable price balance, it bitcoin goes down all altcoin instantaneously dip down as well. So lets be careful with we say concerning bitcoin of altcoin to dethroned bitcoin which is something that may seems impossible to be achieved.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Casdinyard",
      "created_time": "July 17, 2023, 07:54:39 PM",
      "body": "Quote from: Makus on July 17, 2023, 04:56:06 PMData analysis by kaiko shows that  the XRP token currently have a higher trade volume in comparison with Bitcoin the data shows that XRP leads with 21% and Bitcoin 20%, the catalyst behind it's growth since last week was caused by the legal battle won by Ripple against the US SEC Despite XRP taking the lead on trade volume, Bitcoin is still the the greatest coin with its current price over $30k and Ripple $0.73, by comparison the price of Bitcoin is way  too vast for dethronementI still believe Bitcoin is the best coin ever and will continue to soar higher till there is nothing to dethrone or compare Trade volume for Bitcoin is a little low, but market cap will say whether the coin is leading or not. As for bitcoin with its less than 600 billion dollar market cap, carrying the whole industry with it by the way by constituting approximately 60% of the whole crypto industry's market cap, it will remain king for a while. Also need to consider the fact that a good reason why people aren't trading bitcoin anymore is because they saw fit to instead save and hold it! Which in most cases is more profitable than exchanging it for an altcoin with a lower market cap! So when you say bitcoin is going to be dethroned in trading volume people wouldn't be surprised, it's how they intended it to be anyway. With market cap however, that is going to be a rather different and improbably story.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Frankolala",
      "created_time": "July 17, 2023, 07:56:37 PM",
      "body": "I don't use percentage increase to count on the value of a coin. It is normal that altcoins will have higher percentage than bit coin but for how long will it last. Just for a few days,bitcoin has a high market cap and is more valuable than this altcoins that the price can be manipulated.The potential of bitcoin has made it a store of value but I don't think that XRP can be used for so many purpose like bitcoin. The price must have been manipulated by the owner or dev to make investors think that it is a good investment and people will fall for it by investing on XPR,it is only a hype. Bitcoin can never be dethroned because the price of other altcoins depend on bitcoin price movement.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "July 17, 2023, 08:03:22 PM",
      "body": "Quote from: Adbitco on July 17, 2023, 07:17:53 PMDespite the XRP winning a legal case with the SEC and the price increased by either 21% doesn't really show full expression to say that bitcoin has been dethroned. It's not about the price it's about the trade volume!That aside, I don't know where that data really comes from, coin gecko shows a spike but still now enoughXRP Quote2023-07-15   $37,918,177,999   $5,758,002,015   $0.719679   $0.7132562023-07-14   $42,784,396,921   $11,251,096,256   $0.812509   $0.7196792023-07-13   $24,756,292,151   $613,551,700   $0.471376   $0.812509vs BTC:Quote2023-07-15   $588,107,447,250   $21,977,151,421   $30,312   $30,2982023-07-14   $610,725,509,599   $21,254,274,346   $31,446   $30,3122023-07-13   $590,629,381,261   $13,072,555,444   $30,407   $31,446Also, quite funny, if we speak trade volume alone, tether has been constantly surpassing bitcoin but yet nobody speaks about \"dethronement\", Ethereum has surpassed BTC quite a few times in trade volume over the years and we're still here with the same number 1.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "20kevin20",
      "created_time": "July 17, 2023, 08:17:36 PM",
      "body": "Trading volume. Trading volume! That doesn’t show how much the coin is used, it shows just how much money’s moved through exchanges.How does Bitcoin’s usage compare to XRP’s? Is XRP increasingly being used more than BTC? Is there any sign of dominance? Trading volume is literally worthless especially when XRP just had very recently FOMO news. You see shitcoins having sometimes billions in volume, but then they just fall out and die. Does it show they’re dominating other coins? It doesn’t…",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tjtonmoy",
      "created_time": "July 17, 2023, 08:24:08 PM",
      "body": "This is nothing and you can not compare anything here. Just because XRP won the fight against SEC does not make it better than Bitcoin. You can not dethrone something which has this much acceptance and this huge user base. SEC has told themselves, Bitcoin was never a security issue. So there was no fight between Bitcoin and the SEC, to begin with. And what is this Bitcoin dethronement you are talking about? Look at the leaderboard. You will get a clear preview of which one is leading the market. Just having more trading volume won't make it better. Could be those who sold after hearing about the security issue is buying again. Who knows? Or people moving from those alts that are security towards XRP. That's all. This will make no difference.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hannahB4",
      "created_time": "July 17, 2023, 08:29:00 PM",
      "body": "The Ripples network has come a long way to experience that lead but you won't compare it with Bitcoin despite leading it by one percentage they are not in the class at all and therefore cannot dream of dethroning Bitcoin in every possible way and angle you want to look at it from.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Upgrade00",
      "created_time": "July 17, 2023, 08:33:37 PM",
      "body": "Market cap and trading volume is not what makes Bitcoin the top cryptocurrency, a coin can inflate its marketcap and also trading volume but that is not a reflection that it is a good investment option.I own Bitcoin cause it's the most secure and decentralized cryptocurrency. If it was not the first crypto to be established and Bitcoin came later and is much lower on the market cap ranking, I will still opt for it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nelson4lov",
      "created_time": "July 17, 2023, 08:48:54 PM",
      "body": "Quote from: Makus on July 17, 2023, 04:56:06 PMData analysis by kaiko shows that  the XRP token currently have a higher trade volume in comparison with Bitcoin the data shows that XRP leads with 21% and Bitcoin 20%, the catalyst behind it's growth since last week was caused by the legal battle won by Ripple against the US SEC ~Snipped The recent XRP rally was simply fueled by that news. XRP has been low on  the radar since the 2017 bull run. That's the only time XRP came close. At that time there was a popular slogan for an event termed the \"flippening\". Where either ETH or XRP were posed to flip bitcoin from the #1 spot. That's the one singular time that a lot of people actually believed the flippening movement and it didn't work. Xrp went into a spiral movement down and since hasn't been able to reach such heights. The effect from the hearing won't last for a very lomg time and certainly isn't enough to get it to the spot spot.XRP is still very much centralized and has to be if it wants to continue servicing enterprise customers in it's use base.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cryptomultiplier",
      "created_time": "July 17, 2023, 09:04:15 PM",
      "body": "Quote from: Upgrade00 on July 17, 2023, 08:33:37 PMI own Bitcoin cause it's the most secure and decentralized cryptocurrency. If it was not the first crypto to be established and Bitcoin came later and is much lower on the market cap ranking, I will still opt for it.This is just clearly defined, and it represents many views. Despite the high profit rate of other coins besides BTC, investors with large capital would rather rest at ease knowing they have BTC and would only swap their BTC to the altcoins they want to trade or transact with. That is for those who have the knowledge of trading. Whereas, those who intend to HODL long-term or intend to DCA and don't want to be bothered about the market crashing and funds getting lost, use BTC more for its credibility. BTC is also one of the first and biggest decentralized innovation for sometime now. It has led to opportunities opening up in areas of wealth creation, in that even countries has had to rely on its technology for economic sustainance, like El Salvador. BTC has also been at the fore front of the crypto crusade and its number one campaigner.BTC doesn't look like a coin getting dethroned anytime soon.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "digaran",
      "created_time": "July 17, 2023, 09:11:43 PM",
      "body": "Can we even mine this centralized shitcoin called ripple? I really don't get it, why would people pay for something which they can't even mine? And some people are comparing head with toe, lol.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}