{
  "id": "topic_5466488",
  "title": "halobearer",
  "author": "halobearer",
  "created_time": "September 12, 2023, 06:37:07 AM",
  "content": "I need a suggestion where I can get a USDT or BTC loan where I can use a physical collateral such as a vehicle or a gadget. Can you suggest where I can do this?With minimal fee or interest if possible. Prolly along term loan.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5466488",
  "comments": [
    {
      "author": "LoyceMobile",
      "created_time": "September 12, 2023, 06:42:20 AM",
      "body": "See if your local pawn shop offers Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "_act_",
      "created_time": "September 12, 2023, 06:43:42 AM",
      "body": "If you want to get a loan with physical properties, the best place to get the loan are banks. But the profit that you will pay will be high. You already know that if you failed to pay the loan, your property will be sold by the bank that you borrowed the loan. If you think that you can borrow that kind of loan on this forum, I do not think that would be possible. Just go to bank to borrow the loan.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "robelneo",
      "created_time": "September 12, 2023, 09:09:22 AM",
      "body": "Quote from: halobearer on September 12, 2023, 06:37:07 AMI need a suggestion where I can get a USDT or BTC loan where I can use a physical collateral such as a vehicle or a gadget. Can you suggest where I can do this?With minimal fee or interest if possible. Prolly along term loan.It's not possible here, The only collateral lenders are asking for are altcoins and collectibles something that can be transferred through blockchain or files since your collateral is a vehicle, pawnshop or a post in social media groups that are based in your location is your best option.Why not check your friends or relatives first and ask if they can loan you USDT or Bitcoin and your vehicle or gadget as collateral you can also accept cash and just buy USDT and Bitcoin after the deal.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitMaxz",
      "created_time": "September 12, 2023, 11:31:34 AM",
      "body": "I suggest if you are looking for someone who can give you a loan try to make a thread in your local section because not all people here live in the same country. You can get more chances in the local section and maybe someone near you can meet up and give you a USDT/BTC loan.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yamane_Keto",
      "created_time": "September 12, 2023, 12:49:33 PM",
      "body": "Quote from: halobearer on September 12, 2023, 06:37:07 AMI need a suggestion where I can get a USDT or BTC loan where I can use a physical collateral such as a vehicle or a gadget. Can you suggest where I can do this?With minimal fee or interest if possible. Prolly along term loan.It is a risk to request a bitcoin loan at these times, the price of bitcoin is likely to rise and you may end up paying more money in paying this loan, and a USDT loan cannot be obtained for physical things because it requires more guarantees you can only sell or mortgage physical things That you have, convert it into encrypted currencies and search for a loan using these encrypted currencies, but I advise you to buy bitcoin at the end of the year and wait for 6 months, the price may be doubled easily.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Taskford",
      "created_time": "September 12, 2023, 02:12:38 PM",
      "body": "Quote from: halobearer on September 12, 2023, 06:37:07 AMI need a suggestion where I can get a USDT or BTC loan where I can use a physical collateral such as a vehicle or a gadget. Can you suggest where I can do this?With minimal fee or interest if possible. Prolly along term loan.Only those people near you can actually lend you since your collateral is hard to acquired by people who's not there physically and I doubt you can get a loan by just presenting that. Maybe try to follow what a user suggest since if you have that physical assets then provably you can use that on banks to lend you the amount you needed. But if you try here because you think this is the only option you have. Then provably your wish to get that will not be granted by any lender here.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "YOSHIE",
      "created_time": "September 12, 2023, 02:27:58 PM",
      "body": "Quote from: halobearer on September 12, 2023, 06:37:07 AMI need a suggestion where I can get a USDT or BTC loan where I can use a physical collateral such as a vehicle or a gadget. Can you suggest where I can do this?With minimal fee or interest if possible. Prolly along term loan.You are in the crypto world, the collateral you need is also in the form of crypto, it depends on what type of crypto you have, the point is that the value of the collateral is more than your loan, so everything will be fine for you on the loan side, here what applies is crypto loans and collateral also crypto, physical does not apply here.The vehicle or electronic equipment you own could be collateral for a loan, this applies to pawnshops or listings in the area where you live, maybe they will require a low interest rate for your application, maybe you can try it there.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "salad daging",
      "created_time": "September 12, 2023, 03:10:42 PM",
      "body": "I don't think there is any physical collateral (vehicles and gadgets) to use as collateral for loans in the crypto world, that can be done in your area but you will get fiat.But there is no other way so just do that then after getting fiat you can buy USDT or BTC on the platform you use like some other exchanges.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tabas",
      "created_time": "September 12, 2023, 11:14:32 PM",
      "body": "It is unlikely that you'll see a loaning service in your area to grant you with that type of loan for your collateral. I think what you can do is to have those things pawned and use the money and convert it to the crypto that you desire. Unlike someone from the lending section is nearby you and you're able to seal the deal but that's unlikely. So, maybe in the bank for your car and pawnshops for your gadgets and from there, you decide on how to use the money for buying bitcoin or usdt. But this seems to be just like as taking a loan for buying bitcoin but, in your case is that you're offering a collateral.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "examplens",
      "created_time": "September 12, 2023, 11:22:32 PM",
      "body": "It is interesting how people come to the Bitcointalk forum to ask for a loan or, in this case, advice on how to get a loan. Forum about Bitcoin and cryptocurrencies, I don't understand, where did they get the information that we are engaged in lending money here. I even saw users who were active for more than a year without writing a single post outside of the lending topic.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "crwth",
      "created_time": "September 12, 2023, 11:23:44 PM",
      "body": "Those things that you want probably are better off with a bank because the amount that you can loan in a bank typically could reach gadget and if you have a good standing, a vehicle. It's not that easy to have that type of record in which you are given a chance to loan for such a big amount. Mostly you would get it if you have the following.Good credit standingPays bills on timeGreat relationship with the bankMostly that could be done if you are able to do it for a long time and speak with the manager if they accept the collateral that you have. That would increase your chances.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Darker45",
      "created_time": "September 13, 2023, 12:54:15 AM",
      "body": "I don't know of any platform that offers this. Moreover, I don't know where you're from, but it's certainly hard to find a bank, a pawnshop, a lending company, or any financing business anywhere in the world that provides USDT or BTC for a vehicle or a gadget. There might be, but I haven't heard of any so far.If you really prefer USDT or BTC, why don't you just pawn them in your fiat currency and use the money to purchase USDT or BTC? I guess that's the easiest way to do it. You could even make a good profit out of it considering that the price of Bitcoin right now is low.Or if you have a circle of crypto friends, somebody might be interested. You might want to make such offer to them. In this forum, I'm afraid you will have to have some other coins to offer as collateral.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joniboini",
      "created_time": "September 13, 2023, 02:10:12 AM",
      "body": "What is the purpose of this loan? If you want to get BTC and then sell it later to gain profit, might as well sell your gadget and buy crypto directly. You can then use that crypto to get a loan on this forum. With some management, you should be able to do that with acceptable risk. That being said, getting a loan with the goal of making a profitable trade is usually not recommended. If that is not your purpose then I second the suggestion to just get a fiat loan since you're fine with USDT in the first place. Less hassle and probably lowers scam risk depending on where you live. CMIIW.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rat03gopoh",
      "created_time": "September 13, 2023, 07:01:38 AM",
      "body": "The easiest way, look for physical borrowers around you. I think fiat loans aren't really a problem either. It can be exchanged for BTC on CEX or P2Pmarket after you get a loan. And assure them that you will be able to pay them back.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coin-investor",
      "created_time": "September 13, 2023, 02:32:35 PM",
      "body": "Quote from: halobearer on September 12, 2023, 06:37:07 AMI need a suggestion where I can get a USDT or BTC loan where I can use a physical collateral such as a vehicle or a gadget. Can you suggest where I can do this?With minimal fee or interest if possible. Prolly along term loan.OP only has this post here in Bitcointalk I wonder where he got the idea to post something like this here, he should have the answer since his collateral is a gadget or his vehicle.You cannot post it online you did not even mention you're location, Do you not have friends or relatives from whom you can request a loan since you already have a collateralWhen it comes to physical collateral your lender should be in a location that is nearest you so that you can make a deal, It's hard to deal with a car online even if someone here is interested, I don't even recommend posting this on social media, there are a lot of scammers in social media.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dunamisx",
      "created_time": "September 15, 2023, 01:08:51 PM",
      "body": "Quote from: halobearer on September 12, 2023, 06:37:07 AMI need a suggestion where I can get a USDT or BTC loan where I can use a physical collateral such as a vehicle or a gadget. Can you suggest where I can do this?Can i give you a recommendation from my end, it's nothing but a suggestion which is what i would also prefer to take than looking for where to use a physical asset to take loan on bitcoin, the idea is just for you to go and learn to earn bitcoin if you're interested in having any than taking a loan, there are jobs and services you could render to earn bitcoin, or at least you exchange your fiat with bitcoin.Quote from: halobearer on September 12, 2023, 06:37:07 AMWith minimal fee or interest if possible. Prolly along term loan.There's no offer you could get a d the rate they will be demanding won't be beyond what you could manage to bear, those that do such also make interest from it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}