{
  "id": "topic_5412104",
  "title": "hoinaru42",
  "author": "hoinaru42",
  "created_time": "September 02, 2022, 08:57:45 AM",
  "content": "Asta noapte mi-a fost furat creditul din contul freebitcoin, de un administrator freebitcoin. 칉nc캒 este 칥n a탳teptare transferul. Se poate opri? Orice transfer din contul meu 칥mi cerea acceptul pe adresa de e-mail. De data aceasta este cineva din interorior. Cui pot sa ma adresez sa 칥mi recupereze creditul. In adresa de paypal nu a umblat nimeni, blockchain, sau alte conturi. Dac캒 nu este nimeni de la freebitcoin sa rezolve, ma voi adresa fbi combaterea criminalitatii cibernetice 탳i nu ma voi las캒 pana c칙nd cel vinovat nu va pl캒ti. Contul meu freebitcoin hoinaru42@yahoo.com. nu este prima data c칙nd se 칥nt칙mpl캒 asa ceva. Am tableta, telefonul, laptopul securizate.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5412104",
  "comments": [
    {
      "author": "GazetaBitcoin",
      "created_time": "September 02, 2022, 04:03:28 PM",
      "body": "Imi pare rau pentru pierderea ta, insa nu te adresezi unde trebuie... Slabe sperante sa vada cineva de la FreeBitco.in ce scrii tu aici. Cred ca ai sanse mai bune de a se ocupa cineva de problema ta daca adresezi intrebarea in topic-ul lor de pe forum: FreeBitco.in-$200 FreeBTC游끭Win Lambo游댠0.2BTC DailyJackpot游끥$32,500 Wager Contest. TheQuin este cel care s-ar putea sa iti dea o mana de ajutor.Mai departe, ce spui tu acolo de reclamatii la FBI -- astea sunt pure fabulatii. Sunt ferm convins ca nici macar nu stii sa faci o plangere la FBI. Daramite sa o si ia aia in considerare Ma rog, una peste alta, incearca mai intai sa vorbesti cu TheQuin si vezi ce rezolvi. Daca nu iese nimic, mergi la FBI, CIA, NSA, poate -- de ce nu? -- DOD.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NeuroticFish",
      "created_time": "September 07, 2022, 10:39:32 AM",
      "body": "Quote from: hoinaru42 on September 02, 2022, 08:57:45 AMCui pot sa ma adresez sa 칥mi recupereze creditul.Probabil e tardiv raspunsul meu, dar deja ti s-a spus numele persoanei: TheQuin 맏ttps://bitcointalk.org/index.php?action=profile;user=TheQuinDar nu cred ca va face nimic, vezi ce scriu mai departe.Quote from: hoinaru42 on September 02, 2022, 08:57:45 AMAsta noapte mi-a fost furat creditul din contul freebitcoin, de un administrator freebitcoin. 칉nc캒 este 칥n a탳teptare transferul.Eu as vota mai degraba pe cineva care, prin phishing, a facut rost de informatii (user, parola) - fie legate de contul tau freebitco.in, fie legate de contul tau de e-mail.As mai vota si ca prima intrebare (daca discuti cu TheQuin) va fi daca ai 2FA activat.Quote from: hoinaru42 on September 02, 2022, 08:57:45 AMDac캒 nu este nimeni de la freebitcoin sa rezolve, ma voi adresa fbi combaterea criminalitatii cibernetice 탳i nu ma voi las캒 pana c칙nd cel vinovat nu va pl캒ti.Multa bafta (cu tot sarcasmul de rigoare).Quote from: hoinaru42 on September 02, 2022, 08:57:45 AMContul meu freebitcoin hoinaru42@yahoo.com.Vai, dar noi nu suntem suport la acel website, deci adresa ta de mail este complet irelevanta. Sa inteleg ca pe urmele noastre doreai sa arunci toate efectivele federale ale statelor unite?Quote from: hoinaru42 on September 02, 2022, 08:57:45 AMnu este prima data c칙nd se 칥nt칙mpl캒 asa ceva. Am tableta, telefonul, laptopul securizate.Asta ma face sa cred ca de fapt nu ai nimic securizat ca lumea. Mai ales ca de obicei cea mai mare problema de securitate se afla intre tastatura si .. scaun.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}