{
  "id": "topic_5430708",
  "title": "aptospad",
  "author": "aptospad",
  "created_time": "December 21, 2022, 05:42:16 AM",
  "content": "Welcome to AptosPadAptosPad is the launchpad platform on Aptos blockchain that accelerates the future ideals by connecting the community, investors and builders. It is the first launchpad on Aptos that proposes and applies the SharePad mechanism. This mechanism allows projects to sell tokens not only on AptosPad but also on the whole sharing pool of AptosPad’s partners.AptosPad will be the DAO and community-driven platform so that It creates the fair opportunity for any users to access the project’s token sale from the early stage.The AptosPad’s key featuresThe fair-launch platform for everyone with the ticket and whitelist mechanism. Everyone has the same opportunity to access the token sale as long as they commit to contribute for the projects in long-term visionThe SharePad mechanism: AptosPad is the first launchpad to propose the SharePad mechanism. It helps the project to access more potential investors from other launchpad partnersThe overbuy and refund mechanism: It helps the project to raise more funds from investors and also protects the system and with the refund process.On-chain referential mechanism: Users can earn more token or whitelist slots by referring their friendsCommunity government & Voting: Community can create a proposal and ask others to approve it by voting mechanism. If it is approved, the proposal may be executed. That’s what We call the AptosPad, the DAO and community-driven.Defi functions: Stake & Swap tokenIf the above words do not clearly explain the AptosPad advantage functions, Please go to our document https://github.com/aptospad-app to read the details.AptosPad is still in active development, please give us your thoughts on what feature you want it to be implemented on our app and help us spread to the Aptos community too.Official Link:Website: https://aptospad.appGithub: https://github.com/aptospad-appTwitter: https://twitter.com/Aptospad_DAODiscord: https://discord.com/invite/aptospad",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5430708",
  "comments": [
    {
      "author": "aptospad",
      "created_time": "December 21, 2022, 05:50:48 AM",
      "body": "Hello everyone, Please support AptosPad project.Thanks",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "aptospad",
      "created_time": "December 21, 2022, 06:26:23 AM",
      "body": "Please follow us on Twitter, Discord to get the WL and OG roles.Thanks",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}