{
  "id": "topic_5399795",
  "title": "qzl9899",
  "author": "qzl9899",
  "created_time": "May 23, 2022, 09:11:26 AM",
  "content": "words written in frontI've been trying to get funding from others on this forum because I'm poor. But no one ever promised to fund me. During this time, I was very depressed. Until just now, I saw a post that said: \"Poor people should use their knowledge and labor to acquire their first assets, rather than trying to get rich overnight.\"It suddenly dawned on me that this sentence was a revelation from God to me.So I thought, why can't I be rewarded by sharing the knowledge I have with everyone? I have to give before I should be rewarded, not the other way around.So, from now on, I will teach in this thread the oldest Chinese culture, including the Book of Changes, The Analects of Confucius, Mozi, The Book of Four Talents, etc.If you guys think this is great after watching it and are willing to give me a reward, please transfer the money to the following address：ETH:0x1427a080006127b7B5205a08D6DA084FD4632a22BSC：0x1427a080006127b7B5205a08D6DA084FD4632a22If you think it's great, but don't want to pay, that's fine, just help me spread the word.If you feel bad, or have mistakes, you are willing to discuss with me, I am also very happy.Well, let's get started!Chapter 1 \"Book of Changes\"Book of Changes，It is one of the oldest books in China. It was written around 1000 BC。According to rumors, its author was written by King Wen of Zhou, the pioneer of the Zhou Dynasty, the third dynasty in China.But according to research, there are at least three authors of the book, including King Wen of Zhou, his child Duke Zhou, and a certain official in the Zhou Dynasty who was in charge of managing the book.Their continuous additions made the Book of Changes a complete book of divination.In fact, according to rumors, there are three divination books that are the oldest, and the Book of Changes is only one of them. However, the other two \"Lianshan\" and \"Gui Zang\" have been lost. We can only see the Book of Changes at the moment.However, mere divination books cannot be the source of ancient Chinese culture. Now, allow me to change the “Books of Changes” and call it the \"I CHING\"。Why? This is because Confucius, the greatest thinker in China, took his students 500 years after the emergence of the Book of Changes, and jointly annotated the Book of Changes. Since then, it has become a sacred book, like the Old Testament chapters of the Bible.These annotations and the original I Ching together form a whole, changing the use of the I Ching as a divination, allowing people to understand and learn it from multiple perspectives.The basic elements of the Book of Changes are based on the competition and coexistence of \"Yin\" and \"Yang\".\"Yin\" and \"Yang\" initially changed in three positions, resulting in the original eight forms：QIAN（☰）、KAN（☵）、GEN（☶）、ZHEN（☳）、XUN（☴）、LI（☲）、KUN（☷）、DUI（☱）。These eight forms are combined with each other in pairs, resulting in sixty-four different forms。These sixty-four forms represent all things between heaven and earth. It is believed that from these sixty-four different transitions, the future direction can be accurately predicted.However, Confucius and his students believed that the sixty-four forms described the truth of the universe, the development of human beings, and the order of society. So, for them, this is not a book of divination, it is a book of philosophy, a book of truth.Next, I will tell you the specific meaning of these sixty-four forms, please look forward to it!To be continued…………",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5399795",
  "comments": [
    {
      "author": "qzl9899",
      "created_time": "May 23, 2022, 12:01:27 PM",
      "body": "Chapter 1 Section 1 乾（pronounce：qian）乾 is the first of the sixty-four hexagrams, it is the beginning of everything, the beginning of everything, just like the alpha of the Bible.It represents the sky, the most majestic and powerful aura. It is male, the sun, the monarch, and the fierce horse. It represents the northwest.Next, we elaborate on its hexagram.乾，元，亨，利，贞——translate——乾，Initially, unobstructed, favorable, correct.These are the four virtues of dryness. Remember these four virtues, they will be the four best and most perfect virtues in the whole book. It is rare to have four virtues at the same time, and it also shows the greatness of 乾.初九：潜龙勿用——translate——first YANG，The dragon lurks underground and does nothing.The 乾 is composed of six YANGS. In the 乾, these YANGS are vividly compared to dragons.And YANG, who is in the first position, is considered to be a dragon lurking in the ground, accumulating power and waiting for an opportunity.From a divination point of view, it means that things will not change for the time being in the future, so you'd better try not to take extraneous external actions that interfere with the development of things. You should actively prepare, not act.九二：见龙在田，利见大人。——translate——second YANG，dragon came to the field and met a great man.Here, things start to change. The dragon has come out of the ground, but it has not yet reached the sky. On the ground, it met a great man, and a great man could help it.From a divination point of view, this means that in the future you will meet a person or thing that will be very helpful to you, making you embark on the road to success. Therefore, you need to start taking action, which can only be met in change.九三：君子终日乾乾，夕惕若厉，无咎。——translate——third YANG，A gentleman works very hard every day, and at night he has to seriously reflect on it. Only in this way will he not encounter disasters.Here, no dragon appears, but a description of a gentleman appears. In fact, in the entire scriptures, the two most common types of people are \"gentlemen\" and \"villains\". The gentleman is good, the villain is evil. Only the gentleman can achieve success, the villain is doomed to fail.From a divination point of view, when you get here, you will start a big move. But big operations have to be well-prepared, and like fighting a war, you need to think about troops and logistics, and whether people are willing to support you. If you're in a hurry, you're doomed to fail - remember Putin?九四：或跃在渊，无咎。——translate——fourth YANG，The dragon flew into the valley without harm.The dragon is in action! But instead of flying straight into the sky, it flew into the valley. Here, it is making final preparations, and the valley can hide its whereabouts, which is the perfect lurking before the fatal blow.From the perspective of divination, at the current time node, you have come to the door of success, but the higher you stand, the worse you fall. You must always be vigilant, and would rather be lurking than show off your upcoming victory , to avoid falling before picking the fruit of victory. Like Julius Caesar, he did not anticipate the senate's betrayal.九五：飞龙在天，利见大人。——translate——fifth YANG，The dragon was flying high in the sky, and it greeted each other with God.The dragon finally flew to the highest sky! God has bestowed upon it the glory, and like a crowned king, it receives the adoration of all on earth.From a divination point of view, here you will be sure of success! What you look forward to is bound to happen, what you do, everything goes well!上九：亢龙有悔。——translate——sixth YANG，The tallest dragon regretted it.Why does the highest flying dragon regret it?Because it has no way forward, all the way it has gone. All the glory, it's been earned. Next, only aging and death await it.From a divination point of view, this means that the development of things will irreversibly turn to decay, and you must get out as soon as possible.用九：见群龙无首，吉。——translate——last YANG，Dragons without a leader，auspicious。Of the sixty-four symbols, only 乾 and 坤 appear as \"last\". It represents an extreme transformation, the violent upheaval of things.From the perspective of divination, things will usher in earth-shaking changes at this time, and you who are in it will be lucky.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BADecker",
      "created_time": "May 28, 2022, 10:28:39 PM",
      "body": "You are missing the best and oldest part. Genesis of the Bible is embedded in the Chinese oldest language form... \"Genesis in Chinese Pictographs.\"Quote from: https://www.icr.org/article/genesis-chinese-pictographs/ Ancient Chinese pictographs are silent witnesses, like fingerprints, of historical events reported in Genesis. In particular, the details of these word-symbols are clues that point to how the earliest Chinese must have known basic facts of Genesis 1–11 at the very time their pictographs were invented.Chinese is not an alphabet-based language—its word characters are both abbreviations of and combinations of picture symbols.1 The simplest symbols are combined to construct composite symbols that denote compound words.1,2 However, the actual pictures that were chosen, and especially their associated meanings, are what give us an amazing insight into Chinese history. The pictographic clues to that mysterious past have remained hidden in plain view for thousands of years.Whereas most written languages construct words from the letters of an alphabet, the Chinese language uses radicals [i.e., root meaning-symbols], also called keys, roots or primitives, as the basic units and building blocks for the word characters. Each character contains one or more root symbols.3The creative selection process that invented ancient Chinese characters produced the earliest form of Chinese pictographs, sometimes called ideograms or oracle bone pictographs because the texts were often carved onto bones or tortoise shell plastrons.1,2But linguistic changes have occurred over the centuries, so pictographic analysis requires a forensic perspective, because the present is not the key to China’s linguistic past. The basic written vocabulary of the Chinese language is not being invented today, so the origin of their pictographs cannot be observed by empirical science methods.4 Rather, an investigative study of how the earliest Chinese historically selected relevant symbols to denote word meanings, during the invention of their written language, requires historical cause-and-effect analysis—what forensic scientists call “cause and origin” analysis.5 In this investigation, the forensic cause-and-origin question is: Where did the Chinese picture concepts come from—concepts that are memorialized in ancient Chinese pictographs? And a corollary question is: Why do these figures match Genesis history?...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "qzl9899",
      "created_time": "May 30, 2022, 03:36:48 AM",
      "body": "Hieroglyphics - oracle bone inscriptions - were not everything in ancient China, lol. Have you heard of tadpole text?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BADecker",
      "created_time": "May 30, 2022, 01:47:19 PM",
      "body": "Quote from: qzl9899 on May 30, 2022, 03:36:48 AMHieroglyphics - oracle bone inscriptions - were not everything in ancient China, lol. Have you heard of tadpole text?Early Chinese Pictographs, that denote the formation of their language, are the most important part. Why? Because they show where the Chinese people split off from the rest of the world... the time of the fall of the Tower of Babel, when God split up the languages of the various families, so that they couldn't understand each other any longer.This Chinese testament to one of the major mysteries in the Bible is probably most important in determining where Chinese come from. Obviously there are loads of other things that have influenced China over the last few thousand years. But none are greater than the foundations of their language, and their thinking that developed these foundations.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}