{
  "id": "topic_5428335",
  "title": "joker_josue",
  "author": "joker_josue",
  "created_time": "December 13, 2022, 10:18:49 PMLast edit: December 14, 2022, 09:23:51 PM by joker_josue",
  "content": "Hello everybody,A few weeks ago I noticed that I had received a neutral tag, which I found strange at first, because I hadn't done anything about it.When I went to check, I was somewhat perplexed, not realizing why:When I read it, I thought about questioning it, but then I thought I'd better ignore it.But, meanwhile, I was informed that the information contained in that tag may be limiting some bonuses in campaigns. Also the managers of SINBAD (my current campaign) are questioning the quality of my posts, because of this tag.The reason for this tag, I still couldn't figure it out until today. Although the post that prompted this tag was deleted from the tag author's self-moderated thread, the post was commented on by other users and generated conversations appropriate to the topic of the thread.In this sense, he decided to contact JollyGood via MP, requesting that he review the situation and the possibility of revising this tag. But only the answer, although polite, limited itself to saying that it would only review the situation in 8-12 months, and that this would not have an impact on the campaigns in which it participates (something that it is creating).I always try to collaborate in the best possible way with the whole community and maintain a good relationship with everyone. And I never needed to make low quality posts to meet campaign objectives, making more than enough posts for the minimum requirements of the campaigns. So I feel a little wronged by this situation.I would like to know if, among all the campaign managers I worked with and the rest of the community, if they think that my participations are of low value to justify such a tag?Campaign managers I've worked with (I think that includes everyone...): icopress / Hhampuz / CryptopreneurBrainboss / Royse777 / JoeriiThank you for your attention and I appreciate any help you can provide on this topic.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5428335",
  "comments": [
    {
      "author": "examplens",
      "created_time": "December 13, 2022, 10:50:40 PM",
      "body": "Neutral feedback is fine. based on what was written, it seems that you were writing in a self-moderated gambling thread started by JollyGood. He must have deleted some of your posts. somehow I'm not very surprised, because it happened by Jolly, but to be honest all mega threads in gambling discussions are mostly spam and signature quota fulfilment.I don't think it will affect your participation in the campaigns, at least not in those managed by experienced managers (you mentioned some of them). they will always first trust their judgment by looking at your post history, and only after that, they rely on the assessment of the importance of feedback on your trust page.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AB de Royse777",
      "created_time": "December 13, 2022, 10:57:23 PM",
      "body": "Quote from: joker_josue on December 13, 2022, 10:18:49 PMI would like to know if, among all the campaign managers I worked with and the rest of the community, if they think that my participations are of low value to justify such a tag?I am more than happy to have you in the campaign as I told you in the Telegram conversation. There are no complaint about your posts habit and post quality.  In fact, I consider you as the show stopper for the campaign you are now.But this neutral tag with questioning your post quality is not something I would like to consider in the campaign participants feedback page. It's not a negative tag but it's directly questioning your post quality. The product of a signature campaigner is the posts they make and if the product itself is in question then it does not look nice especially when it's given by a DT status user and showing on trusted feedback section.Quote from: examplens on December 13, 2022, 10:50:40 PMNeutral feedback is fine.In this case it's not fine for the campaign. There is another user in the same campaign who has same type of feedback. I am sure he is working on it too.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitcoin_Arena",
      "created_time": "December 13, 2022, 11:05:23 PM",
      "body": "The neutral tag maybe very annoying, but at the same time it's usually hard for the person in question to reverse his decisions based on the very many past threads about his tags in this board, so I guess you will have to live with that until he decides to change his mind.I don't know much about your posting quality but if it was just one post then, I think just deleting the post with no tag should have been ok since it's a self-moderated thread. The tag would only make sense if you made many more low quality posts in the same thread after several warnings or deletions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "examplens",
      "created_time": "December 13, 2022, 11:20:28 PM",
      "body": "Quote from: Royse777 on December 13, 2022, 10:57:23 PMIn this case it's not fine for the campaign. There is another user in the same campaign who has same type of feedback. I am sure he is working on it too.so you're just proving that this neutral feedback doesn't mean anything, because it's still firmly in your campaign. I guess the reason is not just because it is from JG, knowing your previous history of conflict.  As a manager, don't you check the post history, or rather accept members based on the trust rating on their profile?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PX-Z",
      "created_time": "December 13, 2022, 11:36:10 PM",
      "body": "Quote from: examplens on December 13, 2022, 11:20:28 PMAs a manager, don't you check the post history, or rather accept members based on the trust rating on their profile?Whatta kind question to a manager for an obvious answer. This is obviously written on every rules of every campaigns he manage or any campaign manager out there.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ludmilla_rose1995",
      "created_time": "December 13, 2022, 11:58:29 PM",
      "body": "looked at your post history and I think your post is pretty good,, I think all you have to do is have a good talk with Jollygood because he labeled you with that neutral tag. good luck",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "decodx",
      "created_time": "December 14, 2022, 12:31:15 AM",
      "body": "Quote from: Royse777 on December 13, 2022, 10:57:23 PMBut this neutral tag with questioning your post quality is not something I would like to consider in the campaign participants feedback page. It's not a negative tag but it's directly questioning your post quality. The product of a signature campaigner is the posts they make and if the product itself is in question then it does not look nice especially when it's given by a DT status user and showing on trusted feedback section.It makes no sense. As a campaign manager, you decide who to accept in the campaign and who not. Both joker_josue and NdaMk had a neutral tag on their profiles before signing up for your campaign. If you doubt the quality of their \"product\", then why did you accept them in the campaign in the first place?Quote from: Royse777 on December 13, 2022, 10:57:23 PMQuote from: examplens on December 13, 2022, 10:50:40 PMNeutral feedback is fine.In this case it's not fine for the campaign. There is another user in the same campaign who has same type of feedback. I am sure he is working on it too.Are you sure this isn't just another drama involving you and JG? You don't seem to mind the neutral tags (with a negative connotation) from DireWolfM14, for example.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "December 14, 2022, 12:53:32 AM",
      "body": "Quote from: examplens on December 13, 2022, 10:50:40 PMNeutral feedback is fine. based on what was written, it seems that you were writing in a self-moderated gambling thread started by JollyGood. He must have deleted some of your posts. somehow I'm not very surprised, because it happened by Jolly, but to be honest all mega threads in gambling discussions are mostly spam and signature quota fulfilment.In that order of ideas, this type of observation makes less sense. Or else everyone should be evaluated in the same way.For example, in the specific case, I made an opinion observation and questioned the opinion of other users. That they responded cordially, and that their response posts remained in the thread. That is, the subject raised cannot have been so low quality (based on the type of topic) to receive this type of evaluation, since there was a healthy interaction with other users.For me it's much more out of topic, while the competitions are on pause, because of the World Cup, these topics are worth World Cup matters.Either way, I think this type of observation, when unrealistic, can cause misconceptions about a person. And having to keep that tag, even if neutral, for 1 year, for no apparent reason.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "suchmoon",
      "created_time": "December 14, 2022, 01:04:05 AM",
      "body": "I know JG has been criticized for frivolous trust ratings, and deservedly so in some cases, but this ain't it. It's a neutral. Anybody can post a neutral for any reason, and using neutrals to comment on post quality is fine IMO.Having said that, a sig campaign manager can interpret neutrals (or negatives/positives as well) any way they see fit, and a user can choose to join or not to join a sig campaign if they like/dislike that, so it's a non-issue either way. But it would be better to have such rules (e.g. \"no neutral ratings from DT members\") posted publicly instead of being applied ad hoc. Informed decisions FTW.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Awaklara",
      "created_time": "December 14, 2022, 02:07:10 AM",
      "body": "even though the neutral tag in your account is not a barrier for you to register for a signature campaign. but indeed a neutral or negative tag owned by an account could be a consideration for the campaign manager to accept or reject participants.at least the campaign manager can check the applicant's post history, even though it has a neutral tag, but if you look at the post history it already has an increase. I guess neutral tags won't mean anything.Likewise with the tagger, can't it be removed when the person who gets the tag changes their habits and also improves the quality of the post? although I'm sure it will also take some time to review.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Panglima Perang",
      "created_time": "December 14, 2022, 03:30:33 AM",
      "body": "Quote from: Awaklara on December 14, 2022, 02:07:10 AMLikewise with the tagger, can't it be removed when the person who gets the tag changes their habits and also improves the quality of the post? although I'm sure it will also take some time to review.Open your eyes and check again with post quality from @joker_josue, did you see there he has low quality post? I don't know why many people still stand with @JollyGood and always defend him when makin mistake by neutral tag without looking post history. For every one have gambling habit post ignore with @JollyGood and not try to post in his topic at  ⚽ English Premier League Season: 2022/2023. However best quality post you wrote he always try to make it low quality post, I checked exactly his post more terrible with low quality and don't use mirror check his fuc*** faceNeed you attention check how bad quality post from @JollyGoodhttps://i.imgur.com/wQiVjki.png",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lovesmayfamilis",
      "created_time": "December 14, 2022, 06:32:00 AM",
      "body": "I'm surprised you got this kind of feedback. I would say that you are very far from those who create low-quality posts. But JollyGood, as always, has its logic, and publication in its topics suggests some incidents. I don't know what he wants to see as quality answers, but I would just skip JollyGood's self-moderated threads.And as for managers, I think that to evaluate a user by the quality of his posts, it is enough to set aside some time to read his posts and form your own opinion on whether to accept the user into your company or not.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Solosanz",
      "created_time": "December 14, 2022, 07:06:06 AM",
      "body": "So here's the post where JollyGood think it's a low quality post.Quotehttps://loyce.club/archive/posts/6115/61154334.htmlIt really can seem strange to see a team that recently won the Premier League, like Leicester, being in this situation.But we have to be realistic, Leicester have never been a team at all in the table. It was always a team of ups and downs of devision.To be honest JollyGood is right to say your post has a bad quality, your post doesn't contain any points. It's not surprising anymore a bad team can beat a good team especially on football. But if I look the other of your posts, I can say you're not a shitposter, actually you have a good quality post in general.I wonder does the neutral tag is really need at all? it's just one post from joker_josue but getting such feedback just like saying all of his post has bad quality.Since it's a self moderated thread, I think it's right for JollyGood to delete the low quality post, not leave the neutral feedback. You could leave neutral feedback but when the user is keep repeating the same mistake.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "December 14, 2022, 08:07:32 AM",
      "body": "Quote from: Solosanz on December 14, 2022, 07:06:06 AMSo here's the post where JollyGood think it's a low quality post.Quotehttps://loyce.club/archive/posts/6115/61154334.htmlIt really can seem strange to see a team that recently won the Premier League, like Leicester, being in this situation.But we have to be realistic, Leicester have never been a team at all in the table. It was always a team of ups and downs of devision.To be honest JollyGood is right to say your post has a bad quality, your post doesn't contain any points. It's not surprising anymore a bad team can beat a good team especially on football. But if I look the other of your posts, I can say you're not a shitposter, actually you have a good quality post in general.I wonder does the neutral tag is really need at all? it's just one post from joker_josue but getting such feedback just like saying all of his post has bad quality.Since it's a self moderated thread, I think it's right for JollyGood to delete the low quality post, not leave the neutral feedback. You could leave neutral feedback but when the user is keep repeating the same mistake.Thanks for highlighting the specific post in question.But you don't mention that my words were the reply to another user and the continuation of the conversation, here it is:Quote from: execijutiere on October 20, 2022, 06:22:51 PMQuote from: joker_josue on October 20, 2022, 03:55:05 PMQuote from: execijutiere on October 20, 2022, 01:30:03 PMLeicester city host leeds united today. Leicester have started the season very badly. They are one of the teams at the top of the relegation zone. It will be bad for them if they don't start to turn it around. Today's match may be a turning point for them. I think it's a match they absolutely have to win. If they win, they will start to recover slowly.It really can seem strange to see a team that recently won the Premier League, like Leicester, being in this situation.But we have to be realistic, Leicester have never been a team at all in the table. It was always a team of ups and downs of devision.Yes, I agree, but I think it's unacceptable to win the premier league and have such a low form. Still, this team should have been close or in the race. Obviously, after a few players left the team, the team became unbalanced and the result has come to this. Vardy can't play like he used to because he is getting old. Actually there are good players but they can't make a difference. I don't understand why Çağlar söyüncü is not playing.It may not be anything extremely elaborate, but to say that it has no point is a bit of an exaggeration. Would you like me to tell the history of the club? I think not. But that's ok, it's criteria and I accept it. But it doesn't make sense to say that because of that I'm bad at writing posts, or to let that idea go.Maybe I missed opportunities because of that, being myself that I appreciated it before.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitcoinGirl.Club",
      "created_time": "December 14, 2022, 08:42:54 AM",
      "body": "How this clown is still in Default trust? I am tried of him and there are nothing left to add about it, just let me quote that had in mind not even a month ago.Quote from: BitcoinGirl.Club on October 30, 2022, 11:12:39 AMHis attitude is, he always wants to devalue others either it's with a negative feedback or neutral feedback (seems a new strategy for him because others are started to talk against the negatives recently*) or even in a dead conversation.*https://bitcointalk.org/index.php?topic=5418565.0https://bitcointalk.org/index.php?topic=5417940.0Quote from: BitcoinGirl.Club on November 21, 2022, 04:04:33 PMAntiHero: JollyGood. A sadist, cashing out from 1xbit, giving feedback (both negative and neutral) for others like a candy man and trolling others who do not support his flawed argumentsQuote from: BitcoinGirl.Club on November 08, 2022, 01:49:12 PMJollyGood is just a wanna be reputable forum member who in my opinion is a sadist. He feels good when he insults others. He takes it a pleasure in seeing others are suffering.Yet I wounder why a lot of member still have him in their trust list? Why would you trust a controversial user who have no interest in bitcoin development and ecosystem but have only interest of constantly insulting forum members left and right, up and down. Obviously you all enjoy looking others are harassed by a clown, don't you?Quote1. Vod (Trust: +26 / =2 / -1) (1934 Merit earned) (Trust list) (BPIP)2. DiamondCardz (Trust: +7 / =0 / -0) (98 Merit earned) (Trust list) (BPIP)3. peloso (Trust: +1 / =3 / -5) (186 Merit earned) (Trust list) (BPIP)4. Coinfan (Trust: +1 / =0 / -0) (117 Merit earned) (Trust list) (BPIP)5. Lauda (Trust: +34 / =17 / -5) (1937 Merit earned) (Trust list) (BPIP)6. digit (Trust: neutral) (10 Merit earned) (Trust list) (BPIP)7. Timelord2067 (Trust: +16 / =10 / -1) (DT1 (-8) 968 Merit earned) (Trust list) (BPIP)8. jeremypwr (Trust: +22 / =2 / -0) (DT1! (10) 2463 Merit earned) (Trust list) (BPIP)9. allyouracid (Trust: neutral) (271 Merit earned) (Trust list) (BPIP)10. stompix (Trust: +1 / =0 / -0) (DT1! (5) 4029 Merit earned) (Trust list) (BPIP)11. Avirunes (Trust: +12 / =0 / -0) (DT1! (9) 420 Merit earned) (Trust list) (BPIP)12. dopey (Trust: +1 / =0 / -0) (14 Merit earned) (Trust list) (BPIP)13. Gianluca95 (Trust: +5 / =1 / -0) (183 Merit earned) (Trust list) (BPIP)14. SiNeReiNZzz (Trust: +4 / =2 / -1) (792 Merit earned) (Trust list) (BPIP)15. DaveF (Trust: +27 / =1 / -0) (DT1! (9) 4025 Merit earned) (Trust list) (BPIP)16. NEW examplens (Trust: +4 / =4 / -0) (DT1! (11) 1096 Merit earned) (Trust list) (BPIP)17. nutildah (Trust: +15 / =0 / -0) (DT1! (17) 4677 Merit earned) (Trust list) (BPIP)18. thandie (Trust: neutral) (360 Merit earned) (Trust list) (BPIP)19. LFC_Bitcoin (Trust: +18 / =0 / -0) (6559 Merit earned) (Trust list) (BPIP)20. s0nix (Trust: neutral) (11 Merit earned) (Trust list) (BPIP)21. TwitchySeal (Trust: +6 / =1 / -0) (1298 Merit earned) (Trust list) (BPIP)22. vlom (Trust: +1 / =0 / -0) (113 Merit earned) (Trust list) (BPIP)23. JaredKaragen (Trust: neutral) (165 Merit earned) (Trust list) (BPIP)24. Jemzx00 (Trust: +1 / =2 / -0) (42 Merit earned) (Trust list) (BPIP)25. Slow death (Trust: +3 / =2 / -0) (550 Merit earned) (Trust list) (BPIP)26. IconFirm (Trust: +1 / =0 / -1) (74 Merit earned) (Trust list) (BPIP)27. johnsmithx (Trust: +0 / =2 / -1) (7 Merit earned) (Trust list) (BPIP)28. blurryeyed (Trust: +1 / =5 / -2) (20 Merit earned) (Trust list) (BPIP)29. kurian (Trust: neutral) (2 Merit earned) (Trust list) (BPIP)30. igehhh (Trust: +4 / =1 / -0) (1080 Merit earned) (Trust list) (BPIP)31. mosprognoz (Trust: +4 / =1 / -1) (177 Merit earned) (Trust list) (BPIP)32. KTChampions (Trust: +7 / =0 / -0) (DT1! (7) 1421 Merit earned) (Trust list) (BPIP)33. icopress (Trust: +20 / =0 / -0) (DT1! (7) 3829 Merit earned) (Trust list) (BPIP)34. invincible49 (Trust: +1 / =0 / -0) (243 Merit earned) (Trust list) (BPIP)35. logfiles (Trust: +5 / =0 / -0) (1251 Merit earned) (Trust list) (BPIP)36. tvplus006 (Trust: +15 / =0 / -0) (DT1! (14) 1549 Merit earned) (Trust list) (BPIP)37. witcher_sense (Trust: +15 / =0 / -0) (DT1! (14) 3393 Merit earned) (Trust list) (BPIP)38. darcon_pr (Trust: neutral) (0 Merit earned) (Trust list) (BPIP)39. The Cryptovator (Trust: +20 / =1 / -0) (DT1! (20) 2035 Merit earned) (Trust list) (BPIP)40. lovesmayfamilis (Trust: +27 / =0 / -0) (DT1! (13) 3324 Merit earned) (Trust list) (BPIP)41. cryptobenn (Trust: +0 / =0 / -1) (1 Merit earned) (Trust list) (BPIP)42. TalkStar (Trust: +11 / =0 / -0) (734 Merit earned) (Trust list) (BPIP)43. Trade Runner (Trust: +0 / =1 / -1) (66 Merit earned) (Trust list) (BPIP)44. bitbottrader (Trust: neutral) (8 Merit earned) (Trust list) (BPIP)45. zasad@ (Trust: +3 / =2 / -0) (DT1! (6) 3462 Merit earned) (Trust list) (BPIP)46. protrader786 (Trust: +0 / =0 / -1) (61 Merit earned) (Trust list) (BPIP)47. FatFork (Trust: +6 / =0 / -0) (DT1! (5) 1610 Merit earned) (Trust list) (BPIP)48. decodx (Trust: +1 / =0 / -0) (565 Merit earned) (Trust list) (BPIP)49. CryptoYar (Trust: neutral) (620 Merit earned) (Trust list) (BPIP)50. villain_Mr.Burns (Trust: +0 / =2 / -3) (25 Merit earned) (Trust list) (BPIP)51. PaperWallet (Trust: +0 / =1 / -2) (21 Merit earned) (Trust list) (BPIP)52. wagmi (Trust: neutral) (75 Merit earned) (Trust list) (BPIP)Can someone answer why the feature report to moderator is in place?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "allyouracid",
      "created_time": "December 14, 2022, 09:35:56 AM",
      "body": "@BitcoinGirl.Club: got the notification, even lots of them, recently. I am going to review, but I'm busy af, right now. If there is valid reason to make changes to my list, i will do it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rikafip",
      "created_time": "December 14, 2022, 10:07:04 AMLast edit: December 14, 2022, 05:02:14 PM by Rikafip",
      "body": "@joker_josue is the post that Solosanz shared the only one deleted by JollyGood, or there were more and after that he decided to leave you a neutral?Btw, if your post is characterized by JollyGood as a low quality and deleted, what to say about this one, to which your post was reply to? I don't see any quality in this one, yet its still there. Quote from: execijutiere on October 20, 2022, 01:30:03 PMLeicester city host leeds united today. Leicester have started the season very badly. They are one of the teams at the top of the relegation zone. It will be bad for them if they don't start to turn it around. Today's match may be a turning point for them. I think it's a match they absolutely have to win. If they win, they will start to recover slowly.I know that you are upset, but since its just a neutral (even though with negative connotations), I wouldn't stress too much about it since member who left it is known for such things, and with each dubious feedbacks he leaves, he just devalues all the good that he did in the past.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "knowngunman",
      "created_time": "December 14, 2022, 10:22:44 AM",
      "body": "I'm still new to this forum and I don't think my idea would count here, regardless I will say what I have observed so far in this forum. Does it mean that there are set of people who are above the forum and superior; and on the other hand there are set of people who have no say than to submit to whatever treatment given to them and are inferior? I have came across several threads about this tagger and sincerely speaking, the comments under such threads including this one proof to me that the person is above the forum and no one can control him or her. Some of you saying neutral trust is fine, lol it's fine but it is questioning your reputation in case you don't know. In fact some neutral tag is more or equal to negative tag. IMO I will suggest the tagger to be always available to justify and clarify as to why such tag is given. Keeping mum over this type of issues is detrimental to transparent and reputation of the entire forum. I have never seen him/her commenting on threads where his/her respond is mostly needed. We can do better please.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "December 14, 2022, 12:42:09 PM",
      "body": "Quote from: Rikafip on December 14, 2022, 10:07:04 AM@joker_josue is the post that Solosanz shared the only one deleted by JollyGood, or there were more and after that he decided to leave you a neutral?Btw, if your post is characterized by JollyGood as a low quality and deleted, what to say about this one, to which your post was reply to? I don't see any quality in this one, yet its still there. Then. But as I mentioned, I only noticed this tag a little while ago, so I don't even remember if it used this in other cases or not.But taking this one, which does not present any information out of the ordinary and in harmony with the subject matter, I wonder where this really is of low quality to the point of suffering this type of comment.Quote from: Rikafip on December 14, 2022, 10:07:04 AMI know that you are upset, but since its just a neutral (even though with negative connotations), I wouldn't stress too much about it since member who left it is known for such things, and with each dubious feedbacks he leaves, he just devalues all the good that he did in the past.I am a person who likes to be on good terms with everyone and I don't give importance to this type of interpretation - to each his own. But just as I respect everyone and try to avoid the work of others, I look for the same thing from other people towards me.This type of tag, despite being neutral, jeopardizes the quality of my posts, which can make people who don't know me at all question my work.And I think that yes, it's annoying, a person being limited in the opportunities they can enjoy because of someone else's misinterpretation or opinion.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}