{
  "id": "topic_5457509",
  "title": "mendace",
  "author": "mendace",
  "created_time": "June 25, 2023, 08:49:19 AM",
  "content": "PREMESSAHo cercato un thread dove si raccogliessero i libri che trattano Bitcoin ma non ho trovato niente dunque ho deciso di aprirlo sperando di fare cosa gradita.In questa sezione pubblicherò tutti i libri in mio possesso adesso e gli eventuali che acquisterò o riceverò e vi invito a fare lo stesso anche a voi qualora ne aveste uno non presente in lista.Per inserire un libro seguite questi parametri:Code:Titolo:Autore:Contenuto:Prezzo:Link:Buona lettura!!!",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5457509",
  "comments": [
    {
      "author": "mendace",
      "created_time": "June 25, 2023, 09:04:09 AM",
      "body": "Il Bitcoin StandardTitolo: Il Bitcoin StandardAutore: Saifedean AmmousContenuto: Il Bitcoin Standard analizza il contesto storico della crescita di Bitcoin e le proprietà economiche che gli hanno permesso di crescere così rapidamente oltre alle possibili implicazioni economiche, politiche e sociali.Ammous accompagna il lettore in un avvincente viaggio attraverso la storia delle tecnologie che hanno rivestito funzioni monetarie: dai sistemi primitivi costituiti da pietre e conchiglie, alle monete di metallo e il gold standard internazionale, per arrivare alle moderne valute debito di emissione statale.Il libro spiega in maniera intuitiva e pratica: Bitcoin è un software che, in maniera decentralizzata e distribuita, converte elettricità e potenza di calcolo in un registro verificato, accurato e immutabile...Prezzo: € 27,00 iva inclusa Link: https://shop.usemlab.com/home/85-the-bitcoin-standard-edizione-italiana.html",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mendace",
      "created_time": "June 25, 2023, 09:08:01 AM",
      "body": "Il Fiat StandardTitolo: Il Fiat StandardAutore: Saifedean AmmousContenuto: Questo meraviglioso libro, che andrebbe letto e riletto più volte,completa ciò che Il Bitcoin Standard aveva iniziato: guida il lettorealla consapevolezza dell’importanza del denaro sano e onestoper far ripartire il processo di civilizzazione oramai in fase diregresso. Soprattutto, permette di capire perché tale opzionesia già disponibile per essere implementata volontariamente ein maniera pacifica, condannando all’irrilevanza i poteri che permillenni hanno incatenato e reso schiava l’umanità.Prezzo: € 28,00 iva inclusa Link: https://shop.usemlab.com/home/158-il-fiat-standard.html",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mendace",
      "created_time": "June 25, 2023, 09:18:44 AM",
      "body": "The Mastering Lightning NetworkTitolo: The Mastering Lightning NetworkAutore: Andreas M. Antonopoulos             Olaoluwa Osuntokun            Rene PickhardtTraduzione italiana a cura di Riccardo MasuttiContenuto: Lightning Network (LN) è un protocollo di pagamento di secondo livello di Bitcoin in rapida crescita che permette di effettuare transazioni istantanee tra più parti. Con questa guida pratica, gli autori Andreas M. Antonopoulos, Olaoluwa Osuntokun e Rene Pickhardt, in collaborazione alla traduzione e pubblicazione di Riccardo Masutti, spiegano come questo avanzamento consentirà il livello successivo di scalabilità per Bitcoin, aumentandone la velocità e la privacy, e riducendone contemporaneamente le commissioni.Ideale per sviluppatori, architetti di sistemi, investitori, imprenditori e, in generale, per chi desidera acquisire una migliore comprensione di Bitcoin e Lightning Network, questo libro dimostra perché LN è una soluzione fondamentale al problema della scalabilità di Bitcoin. Imparerai come LN ha il potenziale di supportare molte più transazioni rispetto alle reti finanziarie odierne come SEPA, Swift, Visa e Mastercard.Prezzo: € 49 versione flessibile             € 99 versione rigidaLink: Amazon",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mendace",
      "created_time": "June 25, 2023, 09:26:02 AM",
      "body": "Villaggio BitcoinTitolo: Villaggio BitcoinAutore: Valerio Dalla CostaContenuto: Bitcoin è un nuovo paradigma. Un fenomeno in grado di scompigliare le carte in tavola, di rimettere in discussione le nostre certezze e di far tremare la terra alle fondamenta della finanza, della politica e della filosofia. Si tratta di un sistema decentralizzato, neutro, non controllato da nessuno in particolare, incorruttibile, immodificabile, incensurabile, la cui sicurezza si basa su matematica e crittografia. Bitcoin implementa una moneta sana e onesta, in grado di tutelare la privacy e la libertà delle persone. Ma si tratta, al tempo stesso, di un fenomeno estremamente misterioso e complesso da inquadrare e da comprendere.Con Villaggio Bitcoin l’autore ci conduce in una panoramica divulgativa su questa tecnologia, partendo dalle origini della moneta, passando per il cuore del protocollo informatico fino a riflessioni sugli impatti sociali e politici, tracciando le basi che Bitcoin sta gettando per prefigurare una società più giusta e consapevole.Prezzo: € 25,00 Flessibile € 35,50 Rigida Link: Amazon",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mendace",
      "created_time": "June 25, 2023, 09:30:14 AM",
      "body": "Mamma ho comprato BitcoinTitolo: Mamma ho comprato BitcoinAutore: Lorenzo Primiterra Contenuto: Una guida a Bitcoin e alle criptovalute per quelle generazioni che non sono nate con un computer o con un cellulare in mano.Un manuale nato per spiegare un argomento complesso con parole semplici, parole di uso comune, che chiunque può capire.Lasciati guidare attraverso la storia dell’economia: dal baratto fino a Bitcoin analizzeremo ogni passaggio, ogni cambiamento che ha rivoluzionato il concetto di “valuta”. Dalle monete d’argento dell’Impero Romano alle banconote in Cina, passando per lo scetticismo delle popolazioni che ci hanno messo secoli ad adattarsi.Fino ad arrivare alle valute digitali, al loro valore e alle ragioni che le stanno portando a compiere una vera e propria rivoluzione.Perché la storia di Bitcoin è giovane, ma l’impatto è stato impressionante. A livello economico e societario. Tutti ne parlano, e tutti con argomentazioni diverse: governi, banche, aziende, criminali, truffatori.Se vuoi capire di più su Bitcoin, su come funziona e sul perché è diventato un argomento così discusso, questo è il libro giusto per te.Prezzo: € 9.99Link: Amazon",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mendace",
      "created_time": "June 25, 2023, 09:36:32 AM",
      "body": "Il denaroTitolo: Il DenaroAutore: Riccardo Siotto (Yes8)Contenuto:  Già dai 5 anni i bambini cominciano a interagire con il denaro e i suoi utilizzi. Difficilmente però gli viene spiegato:    Cosa è il denaro?    Come è nato?    Come è cambiato fino a oggi?    Come viene creato e da chi?    Cosa dà valore al denaro?    Esiste qualcosa di più prezioso?Il presente Libro Illustrato affronta tutte queste domande per raccontare anche ai più piccoli, in appena 5 minuti di lettura e in maniera divertente, la Storia del Denaro dalle sue origini sino ai nostri giorni. Prezzo: € 6.99Link: Amazon",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitbollo",
      "created_time": "June 25, 2023, 04:36:48 PM",
      "body": "Titolo: Mastering Bitcoin [Traduzione italiana della guida completa al mondo di bitcoin e della blockchain]Autore: Andreas M. Antonopoulos / trad. Riccardo MasuttiContenuto: Credo che sia il libro \"base\" per capire (e poter capire) più o meno tutti gli aspetti cruciali introdotti da bitcoin/blockchain. Anni fa era una delle poche risorse disponibili in italiano ed in generale una delle poche risorse con spiegazioni chiare/semplici sull'argomento.E' disponibile gratis sul sito dell'autore (tradotto in Italiano) https://aantonop.com/books/mastering-bitcoin/ Prezzo: 31,19Link: Amazon",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "HedgeFx",
      "created_time": "June 26, 2023, 11:51:17 AM",
      "body": "Ragazzi, non è proprio attinente al bitcoin, ma è un libro scritto bene sui meccanismi dell'economia. E l'autore è 100% approvedNon fatevi ingannare del fatto che sia datato, è e resta un must per chi vuole comprendere il perchè di alcuni meccanismi. Link: Amazon",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}