{
  "id": "topic_5407932",
  "title": "importedsteak",
  "author": "importedsteak",
  "created_time": "July 28, 2022, 02:13:12 PM",
  "content": "Website: https://www.moonlight.xyz/Twitter: https://twitter.com/moonlightmetaWhitepaper: https://moonlightxyz.notion.site/Moonlight-V1-Crowdfunding-Collective-NFT-Ownership-facce76272ea4a6fb6a1409d76b81017IntroductionI'd like to announce Moonlight, a fractional NFT and crowdfunding platform using the Ethereum blockchain, whereby users can ultimately buy and sell pieces of their favorite NFT projects. This tool will benefit prospective users searching for an affordable or risk-averse entry into 'blue-chip' ecosystems.Why Build This?The NFT market is heavily defined by its lack of liquidity. That illiquid nature is more or less part of the game that many of us have learned to accept, but in reality, it's a massive tree trunk dropped along the path towards mass user adoption. It creates the associated risk of volatile floor prices which is simply too much for many to bear. Potential investors of high-profile digital assets - such as Bored Apes, CryptoPunks, or Fidenzas - want liquidity. They need products to manage risk in order to feel comfortable becoming a player in the NFT space.In addition to illiquidity, the NFT markets also constitutes of a certain degree of asymmetric opportunity. The members of blue-chip communities gain access to the most profitable mints and collection opportunities via allowlists and large networks. On the other hand, small capital players are set in a less opportune position. Yes, you could 'flip your way to the top', but most NFT users are not great traders nor aspire to be. Many simply want to collect their favorite 1/1 art pieces or PFP projects to display in their wallets and capture their upside over time.We built Moonlight as a nod to the web3/decentralized values of community and inclusivity. We believe that every crypto user (wealthy or not) deserves flexibility in their investing and collecting styles. In other words, the ability to democratize NFT ownership by buying and selling fractions.How Does It Work?Through community decisions, Moonlight will select an NFT to crowdfund from an Opensea listing. Once it is selected, users can begin contributing their ETH to a pool of funds. And when the pool gets large enough, the NFT is purchased, fractionalized, and officially listed on Moonlight. Any user who contributed to the successful crowdfund receives ERC20 tokens representing their pro-rata share of the NFT. Those tokens can be bought and sold on Moonlight's trading page, where the only other listings will be past crowdfunds.With this model, Moonlight avoids the clutter of low-quality listings and ensures that the only NFTs offered on the platform are in-demand by the community. Holders of fractional tokens will also be able to 'lock' their holdings to win trading rewards by providing liquidity. This combined with AMMs will ensure a low-slippage and smooth transactional environment, where users can buy and sell pieces of their favorite projects easily.It is the decentralization of NFTs, with the idea that \"art is for everyone\".State of DevelopmentWe are currently building towards our beta launch expected in mid to late September, where we will be rewarding our early community. Presently, we are in the thick of building this out and ensuring that we bring the best possible product to market. Our team has a strong network of advisors and expertise that will ensure Moonlight is grown correctly leading up to beta launch.Call to ActionIf you really like the idea behind Moonlight and wish to be part of the journey, I really do suggest following our Twitter and signing up for early access on our website. We will most definitely be rewarding our early userbase",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5407932",
  "comments": []
}