{
  "id": "topic_5466919",
  "title": "Daniel91",
  "author": "Daniel91",
  "created_time": "September 15, 2023, 04:54:48 PM",
  "content": "Quote from: slackovic on September 14, 2023, 10:50:30 AMQuote from: Trofo on September 14, 2023, 07:55:18 AMLijepo je sve to ali dole te otmu za 5 dolara. Šta misliš šta bi napravili bogatašu koji mjesečno može odvojiti 30 za nekoga koga ni ne pozna?Nemojte me krivo shvatiti, mislim da je to šta Daniel radi super ali ja sam uvijek skeptičan i sumnjam na prevaru. Obično sve te priče završavaju na način da netko mazne veliku većinu love i do osobe kojoj treba pomoć ne dođe ništa ili dođe jako malo. Uh, jesmo malo odmaknuli od signature kampanja  Ali neka... Nije to ništa čudno za našu sekciju Ja sam isto uvijek jako skeptičan oko bilo kakvih novčanih donacija. Ne znam kakvo je pravo stanje stvari, ali kod nas se često po medijima može pročitati kako je netko ukrao novac koji je bio namijenjen u humanitarne svrhe. A s druge strane kad pogledaš da je nekome dovoljno 30 dolara mjesečno za školovanje, a mi ovdje tjedno zaradimo na kampanjama više nego dvostruko od tog iznosa onda mi stvarno bude krivo što nisam uključen u takvo nešto. Evo Daniel91 ako čitaš ovo volio bi da malo objasniš zašto si se odlučio na nešto takvo. Ne zato da kritiziramo nego zato što bi se možda još netko uključio. Ja sigurno bi kad bi bio siguran da novac stvarno dolazi tamo gdje je namijenjen.Zadnjih nekoliko dana me uhvatila štucavica, kao da me puno ljudi spominje u zadnje vrijeme  Nema me par tjedana i odmah krenu priče da li dobro, da li je živ, zdrav, jesu li ga oteli u Africi za 5 dolara....?  Dakle, stvarno, ekipa....Da odmah odagnam sve špekulacije, dobro sam, nisam u Africi i nitko me nije oteo, usput 5 dolara je baš uvreda, očekivao bi da netko puno više traži za mene, valjda vrijedim puno više od toga  Ukratko, uz redovne obveze na poslu i obitelj, prije 2 mjeseci sam preuzeo vođenje jednog jako velikog međunarodnog projekta kao evropski koordinator, vodim više nacionalnih timova i zaista imam previše posla svaki dan oko toga. Osim toga, uskoro se pripremam za odlazak u Ameriku na poslovno- privatni put od više tjedana.Jednostavno, puno previše toga i shvatio sam da moram smanjiti nešto u svom svakodnevnom rasporedu aktivnosti jer ću inače puknuti.Izbor je, na vašu žalost, pao na moje aktivnosti na ovom forumu, jer mi je to ipak oduzimalo previše vremena, kojeg više jednostavno nemam na raspolaganju.Mislio sam se kratko javiti u svezi toga ali onda jedna obveza, pa sastanak, pa druga... i jednostavno sam zaboravio.Slučajno sam danas bacio pogled na ovaj forum i čitam i ne vjerujem što se sve piše o meni, i kako je cijela priča na kraju skrenula na Ugandu i na moje pomaganje jednoj djevojčici, koja je zapravo ovih 5-6 godina dosta narasla i već je odrasla cura, koja zna što hoće i želi u životu  Čujte, dovoljno me poznajete da znate da ne padam na jeftine štosove i da ne dajem svoju teško zarađenu lovu tek tako nekome na temelju lijepih riječi i obećanja.O toj udruzi koja pomaže djeci u Ugandi prvo sam zapravo čuo na televiziji, bila je neka emisija o njima.Jako mi se svidjelo što sam čuo ali sam, baš kao i vi, i dalje bio skeptičan. Da li je sve stvarno tako kako se govori ili je to samo priča za javnost a na kraju vodstvo udruge sebi uzima većinu love a jadna dječica dobiju mrvice od donacija ljudi.Prvo sam tražio na Internetu da li ima bilo što negativno o njima ali nisam ništa našao.Na njihovoj webstranici ima jako puno materijala, članaka iz novina, i videa i fotografija iz Ugande gdje se zaista može vidjeti sve što rade i da zaista pomažu toj djeci, ali ne samo kroz školarinu, već i grade školu za djecu, dječja igrališta, školsku kuhinju, imaju projekt čiste vode...Međutim, i dalje sam želio provjeriti da li je sve zaista tako i slučajno sam se u to vrijeme preko Interneta upoznao sa jednim dečkom iz Ugande.Ukratko, poslao sam mu nešto bitcoina da pokrijem njegove troškove goriva i zamolio da se sa svojim autom odveze do moje curice koju pomažem, da razgovara sa njom i njezinom obitelji i da provjeri još jednom cijelu priču, da li moji novci i pomoć zaista odlaze njoj i njezinoj obitelji ili ne.Ukratko, cijela priča je potvrđena.Udruga u Hrvatskoj surađuje sa jednom udrugom u Ugandi.Naše donacije sjedaju na bankovni račun udruge u RH i šalju se na bankovni račun te udruge u Ugandi.Njihov lokalni kordinator tada plaća lokalnoj školi za sponzoriranu djecu, za njihovo školovanje i obrok u školi.On ju je osobno sreo, razgovarao s njom i njezinim ujakom. Sve je provjereno i dokazano, cijela priča je istinita. Nakon toga, i nakon osobnog susreta sa predsjednicom udruge Dragicom, na jednoj tribini, gdje je govorila o tome kako je došla na ideju da pomaže djeci u Africi, odlučio sam postati sponzor jednog djeteta u Africi.Želio sam djevojčicu jer je njima u afričkoj kulturi puno teže nego dječacima.Ako obitelj, što je čest slučaj, nema novaca za školovanje sve djece, prednost ima uvijek najstarije dijete i dječak u obitelji.Djevojčice bez obrazovanja nemaju puno izbora.Roditelji ih žele što prije udati da se riješe jednih gladnih usta u obitelji.Obično uđu u brak sa 13 ili 14 godina a sa 15 su obično već majke, bez nade i budućnosti.Ta djeca tamo zaista žive jako teško, u kućicama od blata i slame, nemaju krevete već spavaju na podu, nema ni vode ni struje, ni kanalizacije.O TV, telefonu ili Internetu da i ne govorim.Toga ima samo u glavnom gradu.Ja sam svojoj curici poslao i dodatni novac za madrac, da više ne mora spavati na podu, i još novac za haljinicu i školsku torbu.Sad se sigurno pitate a kako uopće komuniciramo ako ona nema Interneta ili telefona?Kako znam da li je i što dobila i kako živi?Nekoliko puta godišnje joj šaljem pisma, tako da ih napišem u wordu, pošaljem Dragici na email, ona to proslijedi kordinatoru u Ugandu, on to pismo isprinta, sjedne u svoj auto i vozi se 7-8 sati do tog sela, da joj pismo, pričeka da ga pročita i da napiše odgovor, fotografira ju sa mojim pismom, vrati se nazad u svoj ured, skenira njezino pismo, doda fotografiju i sve emailom pošalje Dragici a ona proslijedi meni.Također, nakon svakog polugodišta dobijem kopiju njezine školske svjedodžbe i mogu pratiti kako napreduje u školi i koje su joj ocjene. Tako vam funkcioniraju stvari danas, u 21. stoljeću, u zabačenim dijelovima Afrike.Nevjerojatno ali istinito.Starijoj djeci sponzori mogu financirati kupovanje mobitela sa Internetom i znam da nekoliko sponzora već direktno može komunicirati sa svojom sponzoriranom djecom.Moja cura bi iduće godine trebala završiti srednju školu i tada ću poslati novac da joj se kupi mobitel sa Internetom a kordinator u Ugandi će je naučiti kako se uopće koristi mobitel i Internet.Ona mi je u svakom pismu jako zahvalna i kaže da bi davno odustala od škole da nije mene i moje supruge i podrške koju joj dajemo, ne samo novčanu već i emocionalnu, kroz pisma.Lijepo je kada svako svoje pismo nama završi sa ... vaša kćerka...Njezina je želja da postane njegovateljica ili medicinska sestra, ali za to u Ugandi mora završiti poseban dvogodišnji Institut ili 2 godine fakulteta a školarina će tada biti puno viša, oko 60 $ ali nije mi to puno i pomoći ću joj da ispuni svoje želje i da uspije u životu.Za sada još ne planiram otići u Ugandu, čekam da prvo završi školu i postane samostalnija i zrelija, a tada ću je posjetiti, kada bude bila na prekretnici u svom životu i obaviti ozbiljan razgovor sa njom.Trebati će donijeti najvažniju odluku u njezinom životu, da li će ostati živjeti u Ugandi, i tamo naći posao i ili će doći u Hrvatsku, naučiti jezik, prevesti diplome i naći posao tu, te tu živjeti i jednog dana zasnovati obitelj.Vidjet ćemo.Što god moja cura odluči, imati će moju punu podršku.Nevjerojatno je gledati kako sa gotovo simboličnim iznosom novca, od 30 dolara mjesečno, što ovdje nije dovoljni ni za jedan odlazak u trgovinu, možete konkretno promijeniti život jednog djeteta u Africi i dati mu nadu i budućnost.Da nije bilo moje pomoći, ona ne bi išla u školu jer je rano ostala bez roditelja i ikakve podrške u životu.Udala bi se sa 13,14 godina i do sada bi već imala 2-3 djece i teško radila na polju.Kako kaže jedna kineska poslovica, ako si spasio život jednog čovjeka, spasio si čitav svijet.Ako želite pomoći nekom djetetu u Africi, onda vam zaista predlažem da kontaktirate gospođu Dragicu u udruzi Plavi Anđeo.Ne znam da li smijem ostavljati linkove pa neću ali lako tu udrugu nađete na Googlu.Znam da su svi volonteri u udruzi, i da se svi projekti, poput gradnje škole i drugi projekti, financiraju isključivo iz donacija.Djeca zaista postoje, i zaista im se pomaže da se školuju.Tko god im želi pomoći, dobrodošao je.Ne morate sponzorirati neko dijete, možete dati i neku simboličnu donaciju za izgradnju škole u Ugandi.Na kraju, tko me želi kontaktirati u svezi ovoga ili bilo čega drugog, s obzirom da ću vrlo rijetko gledati ovaj forum, zbog brojnih obveza, može me kontaktirati preko Telegrama.Ako se sjećate Slackovic, Trofo, Cryptofrka, kada smo se prije nekoliko godina borili za povratak Regulusa na forum, nakon nepravednog permabana, formirali smo telegram grupu ''PodrskaRegulusu'', za kordinaciju našeg rada za pomoć REgulusu. Još uvijek sam u toj grupi a vidim da ste i vi pa tamo možemo dalje komunicirati, a mogu se priključiti i drugi ako žele.Toliko od mene za sada.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5466919",
  "comments": [
    {
      "author": "Pmalek",
      "created_time": "September 15, 2023, 07:05:10 PM",
      "body": "A ja baš prije par minuta pišem šta je sa Danielom i gdje je se izgubio čovjek . Rikafip je kriv jer mi je bot od njega poslao notifikaciju i direktno sam otišao na post o statistici lokalnog foruma bez da pogledam druge teme i postove u lokalu.Ovo što si napisao je jedan od najboljih postova koje sam ikad pročitao na forumu a da se ne tiču direktno bitcoina. Vrlo je pohvalno to što radiš za tu djevojku iz Ugande. Pošto završava srednju školu, neću da je zovem curicom. Stranicu udruge nije uopšte teško naći i prvi je rezultat u Google pretraživaču.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "examplens",
      "created_time": "September 15, 2023, 08:51:28 PM",
      "body": "Quote from: Daniel91 on September 15, 2023, 04:54:48 PMDa odmah odagnam sve špekulacije, dobro sam, nisam u Africi i nitko me nije oteo, usput 5 dolara je baš uvreda, očekivao bi da netko puno više traži za mene, valjda vrijedim puno više od toga  Ja sam vec hteo da predlozim ovde koliko nas ima, pa koliko ko moze da odvoji, da pokusamo skupiti tih 5 dolara. Zasluzio si bar toliko  Drago mi je da si dobrim razlogom odsutan sa foruma, a svakak cast za sve to sto radis sa tim detetom/devojkom, zasluzuje najveci moguci respekt.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptofrka",
      "created_time": "September 15, 2023, 09:06:21 PM",
      "body": "Super, svaka čast. Drago mi je da si to detaljno istražio i da zaista pomažu kako spada.Iako naravno da znam da takve stvari postoje (život bez nekog normalnog puta ili izlaza), isto malo otvori oči kad se ovako detaljno pročita nečije real-life iskustvo. Umjesto da pljujem i serem po svemu što ne valja, dati ću si u zadatak istražiti na koji način pomoći. Stvarno je glupo ne napraviti to ako nekome možeš promijeniti život bez da to i osjetiš.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "slackovic",
      "created_time": "September 16, 2023, 06:59:47 AM",
      "body": "Quote from: cryptofrka on September 15, 2023, 09:06:21 PMSuper, svaka čast. Drago mi je da si to detaljno istražio i da zaista pomažu kako spada.Iako naravno da znam da takve stvari postoje (život bez nekog normalnog puta ili izlaza), isto malo otvori oči kad se ovako detaljno pročita nečije real-life iskustvo. Umjesto da pljujem i serem po svemu što ne valja, dati ću si u zadatak istražiti na koji način pomoći. Stvarno je glupo ne napraviti to ako nekome možeš promijeniti život bez da to i osjetiš.Upravo tako! Mene je zapravo šokirala ova rečenica:Quote from: Daniel91 on September 15, 2023, 04:54:48 PM... u Ugandi mora završiti poseban dvogodišnji Institut ili 2 godine fakulteta a školarina će tada biti puno viša, oko 60 $ ...Pretpostavljam da se radi o $60 mjesečno ali to ispadne $720 godišnje. Možda izgleda puno ali kad se pogledaju školarine kod nas, stvarno nije puno. Kad pogledam da se u kriptu \"igramo\" ulaganja s par stotina dolara, a to nekome može doslovno promijeniti život... Kako ne bi pomogao? Osim toga, opet ponavljam da mi ovdje zaradimo taj mjesečni iznos za tjedan dana kampanje tako da ću se svakako potruditi i malo istražiti udrugu te načine kako pomoći direktno djetetu. Znam da i takve udruge trebaju neku vrstu financiranja da bi mogle raditi, ali mislim da bi radije direktno nekom djetetu promijenio život na taj način nego da doniram udruzi.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rikafip",
      "created_time": "September 16, 2023, 08:25:40 AM",
      "body": "Quote from: Daniel91 on September 15, 2023, 04:54:48 PMZadnjih nekoliko dana me uhvatila štucavica, kao da me puno ljudi spominje u zadnje vrijeme  Nema me par tjedana i odmah krenu priče da li dobro, da li je živ, zdrav, jesu li ga oteli u Africi za 5 dolara....?  Dakle, stvarno, ekipa....Dobro da si se pojavio jer ko zna kakve sve glasine bi se rasirile da si se javio tipa pola godine kasnije.  U svakom slucaju, drago mi je da si nestao sa forumu zbog posla a ne zbog nekakvih problema te se nadam da ces se vratiti kad se jednom sve poslozi i smiri. Malo nas je te se svaki odlazak itekako osjeti, pogotov nekoga kao tebe koji je bio najstariji i dalje aktivni clan.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Trofo",
      "created_time": "September 16, 2023, 09:11:45 AM",
      "body": "Quote from: Daniel91 on September 15, 2023, 04:54:48 PMZadnjih nekoliko dana me uhvatila štucavica, kao da me puno ljudi spominje u zadnje vrijeme  Nema me par tjedana i odmah krenu priče da li dobro, da li je živ, zdrav, jesu li ga oteli u Africi za 5 dolara....?  Dakle, stvarno, ekipa....5$ ima porijeklo u \"možda stvarnoj priči\". Možda je preuveličana ili nešto jer mi je došla od lika kojeg sam uvijek smatrao lovcem ali kolega mu stvarno ima gadan ožiljak na listu pa ono. Lik s ožiljkom je rekao samo posljedice rada u Africi i otišao ća a ovaj drugi je tokom večeri ispričao priču. Uglavnom bili su na nekoj platformi uz obalu Afrike i nisu smjeli van pod nadzorom vojske, naravno budale su išle van i jednog dana su ih napali i oteli jednoga. Uglavnom ljudi su tražili 50 dolara da ga vrate ali nisu baš znali engleski, ovi koji su ostali su mislili da traže 50k dolara te su krenuli pregovori, uglavnom uspjeli su skupiti 20k dolara i izpregovarali puštanje. To je trajalo 2 tjedna i ovaj oteti je pokušao pobjeći u međuvremenu kada su ga propucali kroz nogu. Kada su trebali pokupiti lovu i kada su vidjeli koliko su ovi donjeli su se usrali i pobjegli glavom bez obzira.Za smijanje da nije moglo završiti puno tragičnije. I dobar pokazatelj koliko nama sitna lova znači u nekim dijelovima svijeta. Da su ih pitali i 100$ umjesto napali vjerotno bi ih dobili bez ikakvih problema.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dkbit98",
      "created_time": "September 18, 2023, 07:49:49 PM",
      "body": "Quote from: Daniel91 on September 15, 2023, 04:54:48 PM...Odmori se dobro od foruma, i nadam se da se uskoro opet vidimo kad se vratiš iz Amerike i kad se stvari stabiliziraju na poslu.Malo su svi promašili kontinent sa svojim nagađanjima, ali ipak putuješ izvan Europe PSPazi se i u Americi ima ''otmica''",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SirJohnVonSlotty",
      "created_time": "September 25, 2023, 05:41:20 AM",
      "body": "Quote from: Daniel91 on September 15, 2023, 04:54:48 PMDa odmah odagnam sve špekulacije, dobro sam, nisam u Africi i nitko me nije oteoA ne znam ti Daniel... ovo je upravo nešto što bi ja rekao ekipi da me se otme za 5 EUR. Kao, više bi me bila sramota priznat iznos, radije bi prodao neku foru ala \"ma yok stari nije tako sve je kul evo Kigongo, Balondemu i ja điramo po Ugandi, idemo taman klat neku kozu pa ćmo vidjet što dalje\"  Ko kad bi ti žena uletila u sobu tokom crypto crasha, pa bi nabrzaka s Binancea prešaltao na Pornhub, lakše pojasnit",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}