{
  "id": "topic_5413661",
  "title": "Getschilm",
  "author": "Getschilm",
  "created_time": "September 15, 2022, 10:40:17 AM",
  "content": "Hello,I was looking for a dice gambling bot and found one. Its called ncttechnology. But arent sure if I can trust this. Found nothing about it on google.Does anyone of you know this script/bot. Is it real or scam?Greetings, Getschilm",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5413661",
  "comments": [
    {
      "author": "aioc",
      "created_time": "September 15, 2022, 11:03:26 AM",
      "body": "Domain information about ncttechnology.net, QuoteDomain:ncttechnology.netRegistrar:Hostinger, UABRegistered On:2020-03-24Expires On:2025-03-24Updated On:2022-02-23the bot is already two years old but can't find one legit review but since they offer $5 for 5 days why not give it a try since you are looking for a gambling bot  and post your experience and reviews to help the community, but this is not a guaranteed to make money on gambling as the site says in their FAQQuoteWith gambling nothing is absolute. Gambling always has risk and luck. Have winning and have losing. NCT Cryptobot is just a software that automates betting strategies without having to place bets manually. But if you follow all our instructions exactly you will be profitable and minimize the risk of loss. After you have purchased NCT Cryptobot,",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jackg",
      "created_time": "September 15, 2022, 11:10:09 AM",
      "body": "You could try running it in a VM (virtual machine) it it's a desktop application to not have to worry as much if it's a virus (this might not be completely safe though still).I think you'll be able to check it by uploading it to sites like virustotal or you could see what happens when you run it 8f you have a strong antivirus installed (they've started selectively blacklisting certain operations rather than stopping apps from functioning altogether in my experience if they don't look like they're much of a risk).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Saisher",
      "created_time": "September 15, 2022, 11:21:47 AM",
      "body": "Quote from: Getschilm on September 15, 2022, 11:05:15 AMI already bought it haha. But afraid its a virus. How i can check this out?I think they are safe after two years there are no reports about the site using a virus or malwarehttps://www.virustotal.com/gui/url/54a4cd91424499a55d3a1e782ba96caf0a9e03375d7e91d50c5cd4c8fa1328bfYou can also use Virustotal to check the software before running it they seem to be serious on their bot as their domain will expire in 2025 and there's no scam report either, but of course, this is gambling no tools or software can guaranty a win, you have to work on your own luck.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FatFork",
      "created_time": "September 15, 2022, 11:46:05 AM",
      "body": "OP, you can also check out Seuntjie' DiceBot. It is free and open source, and has been around since 2013, if I'm not mistaken. It works with most dice gambling websites.Official thread: https://bitcointalk.org/index.php?topic=307425.0Website: https://bot.seuntjie.com/ (Always be sure to download software from an official website and check the MD5 checksum.)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AnotherAlt",
      "created_time": "September 15, 2022, 12:39:44 PM",
      "body": "Quote from: FatFork on September 15, 2022, 11:46:05 AMOP, you can also check out Seuntjie' DiceBot. It is free and open source, and has been around since 2013, if I'm not mistaken. It works with most dice gambling websites.I was going to suggest him this one. But, Since you already suggested. I would say I agree with you. I don't see any reason to buy the Premium dice bot or whatever script people selling out there. In long run, House always wins. Making money with whatever bot is not guaranteed. So, better try Seuntjie's DiceBot for free. You can log in using API. Most of the popular dice sites are already listed on their software.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rhomelmabini",
      "created_time": "September 15, 2022, 01:04:20 PM",
      "body": "I often wonder if this is just a lousy form of advertisment since when I hit the word \"dice gambling bot, ncttechnology isn't on the top bot that are recommended for gambling. The OP was new too and I can't be more skeptical on it. Sorry for being skeptical but it's just for awareness to the community and just because it's safe on virustotal doesn't mean it's really too safe.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "robelneo",
      "created_time": "September 15, 2022, 01:22:59 PM",
      "body": "Quote from: rhomelmabini on September 15, 2022, 01:04:20 PMI often wonder if this is just a lousy form of advertisment since when I hit the word \"dice gambling bot, ncttechnology isn't on the top bot that are recommended for gambling. The OP was new too and I can't be more skeptical on it. Sorry for being skeptical but it's just for awareness to the community and just because it's safe on virustotal doesn't mean it's really too safe.Let's give him a benefit of a doubt, this is something new and worth a discussion its something worth exploring for those who are fond of using bots on gambling, so far OP accepted all the recommendations lets' see how his experience with using this bot since he bought it already, but to take out all our doubts it's better for OP to post the transaction that he really bought it just cover vital information, and try it and see how it goes by sharing his reviews.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mahdirakib",
      "created_time": "September 15, 2022, 02:01:40 PM",
      "body": "Quote from: Getschilm on September 15, 2022, 10:40:17 AMI was looking for a dice gambling bot and found one. Its called ncttechnology. But arent sure if I can trust this. Found nothing about it on google.NctTechnology means NCT Cryptobot, which is known as NCT Dicebot. You will find some details about them on Google if you search with \"NCT Dicebot\". There are also some videos on YouTube of this bot. Just search with the \"NCT Dicebot\" keyword. You had the option to use Seuntjies DiceBot, which is free for all. I'm wondering why you have paid for an unpopular dicebot while there are more popular dicebot is available for free. A paid dicebot can't help you to stay in profit always.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pandu Geddon",
      "created_time": "September 15, 2022, 02:04:43 PM",
      "body": "Quote from: FatFork on September 15, 2022, 11:46:05 AMOP, you can also check out Seuntjie' DiceBot. It is free and open source, and has been around since 2013, if I'm not mistaken. It works with most dice gambling websites.Official thread: https://bitcointalk.org/index.php?topic=307425.0Website: https://bot.seuntjie.com/ (Always be sure to download software from an official website and check the MD5 checksum.)I think this one is quite interesting. I love sports books and dice games. your suggestion looks like I'll give it a try. let alone look at the list of casinos, I also have an account supported by Bots.I consciously understand the risks. even using Bots will not guarantee victory. First of all, I will read all about Bots.thank you FatFork",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "goldkingcoiner",
      "created_time": "September 15, 2022, 02:21:01 PM",
      "body": "Quote from: Getschilm on September 15, 2022, 10:40:17 AMHello,I was looking for a dice gambling bot and found one. Its called ncttechnology. But arent sure if I can trust this. Found nothing about it on google.Does anyone of you know this script/bot. Is it real or scam?Greetings, GetschilmI do not understand why you would want to leave your funds to be gambled away by a \"betting bot\". Is the purpose of gambling not to do it yourself? Thats the whole point, have fun and maybe win money! At least, that is what the concept of gambling is to me, in my own subjective view of gambling.And anyway, gambling is luck-based. So how would any kind of algorithmic script/code make any kind of sense? Are you hoping the bot will be able to find some kind of way to exploit bets to win you profit? If so, then that sounds like a red flag and scam to me. I would never pay even 1 cent for any gambling bots.So basically, gambling bots are 100% fake. Don't waste your money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pawanjain",
      "created_time": "September 15, 2022, 02:21:42 PM",
      "body": "Quote from: Getschilm on September 15, 2022, 10:40:17 AMHello,I was looking for a dice gambling bot and found one. Its called ncttechnology. But arent sure if I can trust this. Found nothing about it on google.Does anyone of you know this script/bot. Is it real or scam?Greetings, GetschilmWhat kind of gambling bot are you looking for ? If you want may be I can create one for you as per your needs.Or else you can try other open source bots as others have previously mentioned and you can customize it as per your needs.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jemzx00",
      "created_time": "September 15, 2022, 02:23:53 PM",
      "body": "Quote from: Mahdirakib on September 15, 2022, 02:01:40 PMNctTechnology means NCT Cryptobot, which is known as NCT Dicebot. You will find some details about them on Google if you search with \"NCT Dicebot\". There are also some videos on YouTube of this bot. Just search with the \"NCT Dicebot\" keyword. You had the option to use Seuntjies DiceBot, which is free for all. I'm wondering why you have paid for an unpopular dicebot while there are more popular dicebot is available for free. A paid dicebot can't help you to stay in profit always.Nice catch, I was trying to check for reviews for \"ncttechnology\", however I did not find anything about it. NCT Cryptobot or Dicebot though has some reviews and videos about it that mention the NCTTechnology website. It looks like the bot is legit and does what it's advertised based from the reviews.Anyways, I guess the OP wanted to use this kind of service mainly for the convenience that it offers where you can access various gambling platforms on the bot itself. Also, maybe because NCT Cryptobot is \"The Most Advanced Crypto Bot\".",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Eureka_07",
      "created_time": "September 15, 2022, 02:30:08 PM",
      "body": "Quote from: Getschilm on September 15, 2022, 10:40:17 AMHello,I was looking for a dice gambling bot and found one. Its called ncttechnology. But arent sure if I can trust this. Found nothing about it on google.Does anyone of you know this script/bot. Is it real or scam?Greetings, GetschilmNever heard of that particular bot. However based from what I knew all along, gambling bots, including these Dice bots, will not work as what you want in the long run. And how come can some bot be able the higher possibilities which range of numbers/particular number will be the output of the next round(s). This is just an opinion, but I don't think bots are worthy to buy. It's gambling after all, and it's dice, house always wins, unless you're too lucky.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yaunfitda",
      "created_time": "September 15, 2022, 02:46:33 PM",
      "body": "Quote from: Eureka_07 on September 15, 2022, 02:30:08 PMQuote from: Getschilm on September 15, 2022, 10:40:17 AMHello,I was looking for a dice gambling bot and found one. Its called ncttechnology. But arent sure if I can trust this. Found nothing about it on google.Does anyone of you know this script/bot. Is it real or scam?Greetings, GetschilmNever heard of that particular bot. However based from what I knew all along, gambling bots, including these Dice bots, will not work as what you want in the long run. And how come can some bot be able the higher possibilities which range of numbers/particular number will be the output of the next round(s). This is just an opinion, but I don't think bots are worthy to buy. It's gambling after all, and it's dice, house always wins, unless you're too lucky.Yes, same here, I haven't heard of it before. I think bots are good though, not saying that it won't work, but the tweaks might give you profits but it's not 100% foul proof. Dice is still base on luck, so if you are very unlucky that day, regardless of bot or not, you are not going to win.So going back to the topic, If I'm the OP, I will stir away from this bot. No reviews, so it's better to be safe that sorry, just saying.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fortunecrypto",
      "created_time": "September 15, 2022, 03:17:46 PM",
      "body": "The bot is very suspicious how can something that is already two years in existence but does not have reviews coming from their clients if they do have clients, there are many gamblers who like to use bots like you but they are unfamiliar with the gambling community, the owner of that bot should ask testimonials from their users, it's better for OP to use a virtual machine if you want your machine to be safe since you already purchase a subscription, but like all the others here I doubt if this can help you win in dice, and using bot take away the excitement of playing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Shamm",
      "created_time": "September 15, 2022, 03:34:29 PM",
      "body": "Quote from: virasisog on September 15, 2022, 03:13:20 PMQuote from: Eureka_07 on September 15, 2022, 02:30:08 PMQuote from: Getschilm on September 15, 2022, 10:40:17 AMHello,I was looking for a dice gambling bot and found one. Its called ncttechnology. But arent sure if I can trust this. Found nothing about it on google.Does anyone of you know this script/bot. Is it real or scam?Greetings, GetschilmNever heard of that particular bot. However, based on what I knew all along, gambling bots, including these Dice bots, will not work as what you want in the long run. And how come can some bot be able the higher possibilities which range of numbers/particular number will be the output of the next round(s). This is just an opinion, but I don't think bots are worthy to buy. It's gambling after all, and it's dice, the house always wins, unless you're too lucky.The said bot is suspicious so if you have doubts better look for a legit gambling bot but if I were you, I would focus more on doing betting manually. It's hard to rely everything on gambling bots because as for me, they are riskier than doing it manually unless you don't have much time to focus on the gameplay. I've tried relying on gambling bots before and had more losses compared to the manual result.  yes agree with this it's better to find some legit gambling not to prevent any loss you can do some research to secure a good clue of which is legit or not. And also comparing manual betting and gambling not the all I can say is like what you said because it's more riskier if we try gambling bot than manual betting also in manual betting all we need is our luck and a hood timing to gain a profit or wining money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "iv4n",
      "created_time": "September 15, 2022, 03:41:27 PM",
      "body": "Quote from: fortunecrypto on September 15, 2022, 03:17:46 PMThe bot is very suspicious how can something that is already two years in existence but does not have reviews coming from their clients if they do have clients, there are many gamblers who like to use bots like you but they are unfamiliar with the gambling community, the owner of that bot should ask testimonials from their users, it's better for OP to use a virtual machine if you want your machine to be safe since you already purchase a subscription, but like all the others here I doubt if this can help you win in dice, and using bot take away the excitement of playing.Using a bot gives you different excitement, there's something interesting in creating different strategies and trying them... not some simple dice bot, I am talking about Wolf expert settings, for example, it's crazy how many options their bot has! So it's strange why some people decide to take that huge risk with an unknown dice bot that needs to be downloaded and installed on a computer when there are some online casinos that offer the same bot settings. And all that without any risk for your computer and everything you hold on it, the only risk comes from losing coins if you make a mistake with setting up that bot!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ethereumhunter",
      "created_time": "September 15, 2022, 04:45:54 PM",
      "body": "With the results you get from virustotal in the form of Undetected, it is enough to give suspicion if the bot is safe or not. If you decide to keep trying the bot, you can try it on another computer or VM so it won't interfere with the computer you frequently use if, for example, the bot has a virus, trojan, or other. I agree with the suggestions given by some members to try Seuntjies DiceBot because, at least, if you have a problem, you can ask here or directly to the developer. But it's all up to you to decide so be careful.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nakamura12",
      "created_time": "September 15, 2022, 04:55:00 PM",
      "body": "Quote from: aioc on September 15, 2022, 11:03:26 AMthe bot is already two years old but can't find one legit review but since they offer $5 for 5 days why not give it a try since you are looking for a gambling bot  and post your experience and reviews to help the community, but this is not a guaranteed to make money on gambling as the site says in their FAQ That would be a great help for other gamblers once op give a review about that bot in this forum if op doesn't want to create a review site just for sharing the bot's review once op use the bot since when a gambler search for a review about this bot then this will be shown in the search result if I am not wrong. I think it's better for op to use a legit bot rather than this one which op is not sure if this is legit or not even though the bot is already 2 years old which is created on march 2020.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}