{
  "id": "topic_5448306",
  "title": "Bthd",
  "author": "Bthd",
  "created_time": "April 10, 2023, 08:51:49 PM",
  "content": "Dün ortaya çıkan mahkeme evraklarında FTX borsasının kullanıcılara ait yatırımların bulunduğu cüzdanlara ait keyleri nasıl sakladığı gözler önüne serildi. Kriptoya yeni başlayan acemilerin bile daha özenle saklama yapacağına emin olabilirsiniz.Seed ve private key'ler basit dökümanlarda şifrelenmeden amazon'un bulut ortamında saklanmış. QuoteThe FTX Group stored the private keys to its crypto assets in its cloud computing environment, which included over one thousand servers and related system architecture, services, and databases that it leased from Amazon Web Services (the “AWS account”).Bitfinex'ten çalınan bitcoinlerin ele geçirilmesi olayında key'leri bulut ortamına saklamalarına çoğumuz inanamamış dalga geçmiştik. Bir kaç sene öncesinin en büyük borsalarından birisinin kullanıcı yatırımlarını bu şekilde saklamış olması büyük hayal kırıklığı. Dahası da var. Cüzdanlar için yapılan sınıflandırma komik ötesi. Key'lerin yanına buna dokunma şeklinde not bırakılmış sadece. Şu forumdaki herhangi birisine varlıkları emanet etselerdi muhtemelen çok daha sıkı bir şekilde korunuyor olurlardı.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5448306",
  "comments": [
    {
      "author": "gospodin",
      "created_time": "April 12, 2023, 05:29:10 PM",
      "body": "geçtiğimiz yıllarda facebook da aynı şekilde insanların mail adresi ve parolalarını bulut üzerinde şifrelemeden tutmuşlardı. onların sıçması ftx gibi değil de hacklenme sonucu anlaşılmıştır. işin aslı sürekli olarak böyle sıkıntıların yaşanmasına rağmen sözde sorumluluk sahibi olması gereken firmaların hiçbir işini doğru yapmaması hiç de şaşırtıcı değil. bu olaylardan sonra zaten ftx'in borsadan ziyade tam anlamıyla bir sirk olduğu daha iyi anlaşıldı.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bthd",
      "created_time": "April 12, 2023, 10:07:09 PM",
      "body": "Quote from: gospodin on April 12, 2023, 05:29:10 PMgeçtiğimiz yıllarda facebook da aynı şekilde insanların mail adresi ve parolalarını bulut üzerinde şifrelemeden tutmuşlardı. onların sıçması ftx gibi değil de hacklenme sonucu anlaşılmıştır. işin aslı sürekli olarak böyle sıkıntıların yaşanmasına rağmen sözde sorumluluk sahibi olması gereken firmaların hiçbir işini doğru yapmaması hiç de şaşırtıcı değil. bu olaylardan sonra zaten ftx'in borsadan ziyade tam anlamıyla bir sirk olduğu daha iyi anlaşıldı. Siber güvenlik hakkında eğitime sahip olmayan insanlar bile çoğu zaman güvenip bulut ortamında sıradan şifrelerini tutmazken milyarlarca dolar değerindeki seed key'leri bulut ortamında depolamak akıl alır gibi değil. Belki de en başından beri Sam'in planı daha farklıydı. Yaşanan çöküş ve yakalanma olayı olmasaydı kendisi cüzdanları boşaltarak hack iddiası ile çıkış planını yapıyordu.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pierre 2",
      "created_time": "April 13, 2023, 05:31:38 AM",
      "body": "Milyarlarca dolarlar ile oynayan bir firma bunu nasıl göze alır aklım feleğim şaştı. FTX in batmasına hiç şaşırmamak gerek. Ulan ben bir birey olarak bile 100 doların üzerinde param bulunan cüzdanın key ini online ortamda tutmuyorum çok daha farklı şekillerde şifreliyorum. Yani bu adamlar bu key leri çaldırsa casual bir şekilde çıkıp öhöm biz bulutta tuttuk güvenliydi de bir şekilde girmişler özür dileriz mi diyeceklerdi. Abi bir de en büyük 2. borsa falandı bu. Nasıl amatörlük anlamıyorum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mandown",
      "created_time": "April 13, 2023, 10:43:22 AM",
      "body": "Quote from: Pierre 2 on April 13, 2023, 05:31:38 AMMilyarlarca dolarlar ile oynayan bir firma bunu nasıl göze alır aklım feleğim şaştı. FTX in batmasına hiç şaşırmamak gerek. Ulan ben bir birey olarak bile 100 doların üzerinde param bulunan cüzdanın key ini online ortamda tutmuyorum çok daha farklı şekillerde şifreliyorum. Yani bu adamlar bu key leri çaldırsa casual bir şekilde çıkıp öhöm biz bulutta tuttuk güvenliydi de bir şekilde girmişler özür dileriz mi diyeceklerdi. Abi bir de en büyük 2. borsa falandı bu. Nasıl amatörlük anlamıyorum.Adamların nasıl olsa çeşmesi akıyor umurlarında değildi ftx geri gelsin bak yeminle 2 tane 50xlik launchpad yapsın millet kapısında sıra olur dün ftx'in tokenı %100 arttı.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gospodin",
      "created_time": "April 13, 2023, 04:02:33 PM",
      "body": "Quote from: Bthd on April 12, 2023, 10:07:09 PMQuote from: gospodin on April 12, 2023, 05:29:10 PMgeçtiğimiz yıllarda facebook da aynı şekilde insanların mail adresi ve parolalarını bulut üzerinde şifrelemeden tutmuşlardı. onların sıçması ftx gibi değil de hacklenme sonucu anlaşılmıştır. işin aslı sürekli olarak böyle sıkıntıların yaşanmasına rağmen sözde sorumluluk sahibi olması gereken firmaların hiçbir işini doğru yapmaması hiç de şaşırtıcı değil. bu olaylardan sonra zaten ftx'in borsadan ziyade tam anlamıyla bir sirk olduğu daha iyi anlaşıldı. Siber güvenlik hakkında eğitime sahip olmayan insanlar bile çoğu zaman güvenip bulut ortamında sıradan şifrelerini tutmazken milyarlarca dolar değerindeki seed key'leri bulut ortamında depolamak akıl alır gibi değil. Belki de en başından beri Sam'in planı daha farklıydı. Yaşanan çöküş ve yakalanma olayı olmasaydı kendisi cüzdanları boşaltarak hack iddiası ile çıkış planını yapıyordu. abi bence bu hıyarlar ftx'in ve alameda'nın patlayacağını çok iyi biliyorlardı. basına sızan rapor ve cz'nin fişeklemesi sayesinde süreç biraz erken oldu. yoksa bu beyinsizler iş bilmez birer ororspu çocuğu olduğu için keyleri bu şekilde tutuyordur. gözlüklü salak kızın konuşmasını hatırlarsan ne demek istediğimi hatırlarsın. stop koyma konusunda mı ne saçmalıyordu ya hani:)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mustang Shelby",
      "created_time": "April 24, 2023, 10:51:31 AM",
      "body": "Çok enteresan gerçekten. Böyle bir güvenlik tedbirine giden bir borsa nasıl olur da dünyanın en iyilerinden birisi olabilir aklım almıyor. Gerçek güvenlik uzmanlarıyla çalışmamışlar anladım da, bulut uygulamasına böyle koymaları da akılla açıklanabilir bir hareket değil. Dediğin gibi hocam forumdan birisine verilseydi daha güvenli saklardı. Bu forumu küçük görüyor ya bazıları hayret ediyorum forumda muhteşem insanlar var. Bu FTX’lerden daha başarılı saklama yapabileceklerine eminim. Neyse bazen yalan gelecek kadar saçma şeylerin bile gerçek olduğuna şahit olunca insanın tüm hevesi kaçıyor ve daha temkinli olmak istiyor. Dijital dolar diyoruz, güvenemiyoruz. Borsalar diyoruz aha ortada saklama şekilleri. Yarın donanım cüzdanlarda bir şey çıkmaz inşallah. Bir orası kaldı tutunacağımız dal olarak.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bthd",
      "created_time": "April 24, 2023, 03:44:00 PM",
      "body": "Quote from: Mustang Shelby on April 24, 2023, 10:51:31 AMÇok enteresan gerçekten. Böyle bir güvenlik tedbirine giden bir borsa nasıl olur da dünyanın en iyilerinden birisi olabilir aklım almıyor. Gerçek güvenlik uzmanlarıyla çalışmamışlar anladım da, bulut uygulamasına böyle koymaları da akılla açıklanabilir bir hareket değil. Dediğin gibi hocam forumdan birisine verilseydi daha güvenli saklardı. Bu forumu küçük görüyor ya bazıları hayret ediyorum forumda muhteşem insanlar var. Bu FTX’lerden daha başarılı saklama yapabileceklerine eminim. Neyse bazen yalan gelecek kadar saçma şeylerin bile gerçek olduğuna şahit olunca insanın tüm hevesi kaçıyor ve daha temkinli olmak istiyor. Dijital dolar diyoruz, güvenemiyoruz. Borsalar diyoruz aha ortada saklama şekilleri. Yarın donanım cüzdanlarda bir şey çıkmaz inşallah. Bir orası kaldı tutunacağımız dal olarak. Private Key'lerin bulut ortamında saklanmaması gerektiğini bilmek için güvenlik uzmanına bile gerek yok aslında. Sırf böyle şeyler yüzünden borsada param olduğunda rahat uyuyamıyorum. Donanım cüzdanların da geçmişte çeşitli açıkları vardı. Trezor'u fiziksel olarak ele geçiren kişinin şifre korumasını atlatmayı başardığını gösteren bir video paylaşmıştım.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "flipme",
      "created_time": "April 29, 2023, 10:57:51 AM",
      "body": "Kullanıcılarının şifrelerini bulutta saklayarak kullanıcılarına ne kadar önem verdiklerini göstermişler. Bu zafiyeti önceden görmek onlara karşı güveni önemli ölçüde azaltabilirdi. Keşke Sam paraları kendi hesabına geçirmeden önce bunu öğrenebilmiş olsaydık. Aslında, Amazon'un hizmetinin belirli bir standarda ve kaliteye sahip olduğunu tahmin etmek de zor değil ama binlerce kişinin maddi varlığını bünyesinde tutan bir kripto para sitesi kendi profesyonel çözümünü üretmeliydi ve kullanıcılarını daha iyi bir şekilde korumalıydı. FTX diğer konularda olduğu gibi bu konuda da sınıfta kalmış.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bthd",
      "created_time": "May 06, 2023, 10:22:03 PM",
      "body": "Olaya Sam ve FTX penceresinden baktığımızda aslında sakladıkları kullanıcı varlıkları değil kendi varlıkları zira hiç bir zaman kullanıcılara aitmiş gibi davranmamışlar paraya. Belki de bulut ortamında saklamasının sebebi yaptıkları ortaya çıktığında dilediği herhangi bir yerden ulaşabilmekti. Onlarca farklı cüzdana ait seed'leri fiziksel bir cihaza ihtiyaç duymadan saklamak için çok fazla seçenekleri yok.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kriminall",
      "created_time": "May 08, 2023, 08:24:45 PM",
      "body": "Quote from: Bthd on May 06, 2023, 10:22:03 PMOlaya Sam ve FTX penceresinden baktığımızda aslında sakladıkları kullanıcı varlıkları değil kendi varlıkları zira hiç bir zaman kullanıcılara aitmiş gibi davranmamışlar paraya. Belki de bulut ortamında saklamasının sebebi yaptıkları ortaya çıktığında dilediği herhangi bir yerden ulaşabilmekti. Onlarca farklı cüzdana ait seed'leri fiziksel bir cihaza ihtiyaç duymadan saklamak için çok fazla seçenekleri yok. Şu adamlar nasıl bu kadar çok para ile işlem yapabildiler, nasıl bu zeka ile böyle bir seviyede borsa yapabildiler anlayamadım bir türlü hocam ya, bulut sisteminde anahtarları tutan adamdan büyük bir borsa sahibi olur mu? Adam güvenliğin g’sinden haberi olmadan iş yapmış resmen, dolandırıcı dediğin zeki olur bu adamda bu kadar amatör zihniyet nasıl olmuş ki",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}