{
  "id": "topic_5474322",
  "title": "ASCDO21",
  "author": "ASCDO21",
  "created_time": "November 16, 2023, 02:57:34 PM",
  "content": "Hi all. I want your expert opinion on exiting the market. I have set output goals for coins, please tell me if it is realistic to achieve them in a potential next cycle?BTC1 exit point - 74 456,00$2 exit point - 120 000,00$XRP1 exit point - 3$2 exit point - 5,95$3 exit point - 9,8$DOT1 exit point - 13$2 exit point - 26$3 exit point - 45$ADA1 exit point - 0,92$2 exit point - 1,8 $3 exit point - 3,94$MATIC1 exit point - 1,80$2 exit point - 3,55$3 exit point - 7,00$XLM1 exit point - 0,3$2 exit point - 0,6$3 exit point - 1,2$BNB1 exit point - 680$2 exit point - 1000$3 exit point - 1400$ATOM1 exit point - 21$2 exit point - 40$3 exit point - 80$",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5474322",
  "comments": [
    {
      "author": "MAAManda",
      "created_time": "November 16, 2023, 03:51:24 PM",
      "body": "I don't mean to be skeptical about the set of outputs you have created, but I'm not sure that those targets will be achieved in the next cycle. The market is about sustainability, it will not be easy to get x2 or x3, especially as the assets you mentioned have high rankings in terms of market capitalization.From the list you provided, there are only 2 that I think can reasonably get 1 exit point. They're Polygon (MATIC) and Stellar (XLM), it's quite possible because they don't have a market capitalization that tends to be lower than the others.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wiwo",
      "created_time": "November 16, 2023, 04:33:49 PM",
      "body": "For Bitcoin sure you can ride with that exit point of 1040,000 exit point in the next cycle of the bull run,  but then when specific that will happen is still unclear to many of us but sure that price is very realistic since it is close to the previous all-time high and bitcoin having the capital to reach that price in the next round of market run-up,  but as for the rest of the other coins mentioned, and if you want to invest in them you should also still make further research to get the necessary information that make up your decisions on those coin. Or better still,  you just gamble with them,  since even with data,  and good speculations altcoins are still not reliable and predictable so just pick and gamble with the one you think your luck may shine most.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coin-investor",
      "created_time": "November 16, 2023, 04:37:18 PM",
      "body": "You need a lot of will and patience to achieve that goal honestly the second exit point will take 5 to 7 years and all the others much longer provided that the landscape is still the same on those coins you've mentioned here, but besides the exit point you also should have an alternative exit point like when one of the coins in your portfolio suddenly lose its value and crashing if you just dedicated to HODL these coins you will find yourself losing your investment.You have to follow the development of each coin and take quick action depending on market conditions.QuoteBTC1 exit point - 74 456,00$2 exit point - 120 000,00$",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sophokles",
      "created_time": "November 16, 2023, 04:54:40 PM",
      "body": "From your price prediction i have to say you have no idea about the crypto market. It is up to you about the price you want to exit from your trade but when you are announcing it publicly, you have to do it based on facts and arguments. Othewise your prediction will be spam content nothing more. Most of your price predictions are unrealistic and most of them never hit your first exit point if i understand the market correctly until now. But this is the crypto market and if Shiba Inu and PEPE can do wonders, these projects can too so i just want to say don't lose hope anything can happen in here though i don't expect these predictions to come true.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "super bako",
      "created_time": "November 16, 2023, 05:06:55 PM",
      "body": "what is impossible in the crypto world, always makes people wonder with significant increases of 10x 20x but not many coins are born with significant conditions, maybe the bull season trend will help the rise of old or new altcoins can be a treasure what you hope for 2024 could end up being a good year for investors",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mame89",
      "created_time": "November 16, 2023, 05:39:02 PM",
      "body": "Quote from: ASCDO21 on November 16, 2023, 02:57:34 PMHi all. I want your expert opinion on exiting the market. I have set output goals for coins, please tell me if it is realistic to achieve them in a potential next cycle?BTC1 exit point - 74 456,00$2 exit point - 120 000,00$XRP1 exit point - 3$2 exit point - 5,95$3 exit point - 9,8$In the crypto world, anything can happen, even all the predictions you describe can happen. However, you just need patience because achieving something like that seems to take a long time.But among the coins you described, the most likely ones that can come close to your predictions are probably Btc and XRP because XRP and Bitcoin have use cases that have room in the future, and XRP adoption is growing very quickly even with lawsuits. There is no need to doubt Bitcoin, we just need to wait for time and all our dreams will be achieved.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitstar_coin",
      "created_time": "November 16, 2023, 06:04:21 PM",
      "body": "Well, why not, the projects in the list are all great projects with certain potentials depending on how the team utilizes them. In a long-term period, this is very achievable because more people will probably be interested. Crypto is a space full of surprises, the crypto ecosystem keeps evolving daily and new partnerships and utility is being formed for most of the projects which will probably result in a price increase. Besides, the bull period is fast approaching and the expectations are quite high.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nelson4lov",
      "created_time": "November 16, 2023, 07:22:08 PM",
      "body": "OP, it's good that you already have a plan lined up because Abraham Lincoln implied that whoever plans and put in the work, the opportunity will come. You've a nice list but I'd suggest keeping your exit prices at more realistic levels so you can get out while you still can.Quote from: MAAManda on November 16, 2023, 03:51:24 PMFrom the list you provided, there are only 2 that I think can reasonably get 1 exit point. They're Polygon (MATIC) and Stellar (XLM), it's quite possible because they don't have a market capitalization that tends to be lower than the others.$MATIC's all time high is around $2+ if I remember correctly and it can be very much achievable in the next bull run  considering the fact that they recently did a major upgrade to their network. Interesting times ahead.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DeathAngel",
      "created_time": "November 16, 2023, 07:28:50 PM",
      "body": "Your exit point 1 on bitcoin is quite low considering it isn’t that much higher than the previous ATH in 2021. If we do hit a new ATH then chances are it will go much higher. I would bump up all exit points by 10% at least. I believe this cycle is going to be explosive.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ryzaadit",
      "created_time": "November 16, 2023, 07:48:14 PM",
      "body": "Even if you ask for some advice in the internet.It's still just a prediction, you stick with your plan as long with try to be realistic for the prediction. Some of people have a tough based 4 years-cycle, counted from all-time low on last cycle (the target is around | Last all time low x 15-20).What you did, still normal from my perspective. I hope, you are stick with your plan/prediction some people just keep holding once they reached their number and the price is going down but they still hold.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "The Cryptovator",
      "created_time": "November 16, 2023, 08:02:32 PM",
      "body": "Everyone's exit points won't be the same; otherwise, the market will collapse. A few will exit; on the other hand, a few will enter. That's how Mallet actually works. Since it's a crypto market with high volatility, anything could happen at any time. But don't overexpect from the crypto. The exit points were made by you, and you set the price based on experience. But we don't know if the price will hit at this point or even reach that point. So it's hard to predict the market and forecast the price. We should make real-time decisions based on the circumstances. Not just fix an exit point and wait.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TimeTeller",
      "created_time": "November 16, 2023, 08:09:17 PM",
      "body": "Quote from: Sophokles on November 16, 2023, 04:54:40 PMFrom your price prediction i have to say you have no idea about the crypto market. It is up to you about the price you want to exit from your trade but when you are announcing it publicly, you have to do it based on facts and arguments. Othewise your prediction will be spam content nothing more. Most of your price predictions are unrealistic and most of them never hit your first exit point if i understand the market correctly until now. But this is the crypto market and if Shiba Inu and PEPE can do wonders, these projects can too so i just want to say don't lose hope anything can happen in here though i don't expect these predictions to come true.Those exit points will be meaningless if there are no reasoning behind such values.But it is on him how he will handle his portfolio, so such numbers won't matter to the community. Those are his numbers, and as said, everyone has their numbers as well and you will act according to what you think is right for your portfolio.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "btc78",
      "created_time": "November 16, 2023, 08:10:46 PM",
      "body": "it’s good that you have a plan albeit some of these are probably not as realistic as the top onesstill, it’s recommendable that you have enough knowledge about the market  and have an idea when could your next exit be don’t get emotional and try to stick with what you have planned",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kentrolla",
      "created_time": "November 16, 2023, 08:11:35 PM",
      "body": "I personally feels that three coins will achieve its exit point atleast the first exit target and they ar Bitcoin, XRP and BNB and I have valid reasons to suggest that. As we have seen Bitcoin ATH is is just $5k lesser than your first exit target there are chances it can be achieved like how Bitcoin was struggling at $15k or under $20k now it has increased by over 100% and the same principle applies to Bitcoin as well from current price. XRP has already crossed $3 so further positive news in SEC case will boost it's value and BNB will surely achieve Target as long as Binance is up and running.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "goaldigger",
      "created_time": "November 16, 2023, 08:53:56 PM",
      "body": "Stick to that plan and make sure that you have a good entry point and think long term.This is a more bullish target and I can say that it’s really possible, you just have to choose the best and be more patient. The market is growing anyway, though you can still adjust it and make it more realistic but if you are talking about investing in the next 5 years, then that target price is possible.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Silberman",
      "created_time": "November 16, 2023, 09:46:44 PM",
      "body": "Quote from: ASCDO21 on November 16, 2023, 02:57:34 PMHi all. I want your expert opinion on exiting the market. I have set output goals for coins, please tell me if it is realistic to achieve them in a potential next cycle?...Everyone has their own opinions about your predictions, I think some of your exit points could be too low while others may seem to be too high, however at the end what matters is that you keep track of the markets, especially during the bull run as every single day can be incredibly eventful and you do not want to miss a single one of the movements that could happen at the time, and even more importantly you do not want to miss the moment the trend changes and the bear market begins as that is the perfect moment to sell.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yamifoud",
      "created_time": "November 16, 2023, 09:48:58 PM",
      "body": "Well, I respect your plan as it is your personal market view but I could say that some of them are somewhat impossible like in Bitcoin where your target is $120,000 and honestly, that seems too high. Maybe you are too bullish on your dream and plan, and the only thing that I could say is to never assume that it all will come to reality as I was sure that it won't. We can't still predict the market direction in the coming days but of course, we can remain optimistic.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "wheelz1200",
      "created_time": "November 16, 2023, 09:53:55 PM",
      "body": "Honestly these are decent exit points.  Nothing too insanely crazy on here.  A lot of times people expect things to automatically go up 100x or 1000x which is insane.  The good thing here is that you have a plan.  Stick to it and don't look back if these prices are ever hit.  Good luck.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "livingfree",
      "created_time": "November 16, 2023, 09:59:25 PM",
      "body": "Those are good prices and numbers but high. So that means that you need more waiting for the majority of it and I can't say a lot from your own perspective on when you're going to get out of this market and at what price you think they're decent.Saying all of those seems a good plan but you need to be patient and wait for more. I think that the first exit you'll have is with BNB as the price of it didn't moved a lot this time.But with its ATH in the past, the #1 exit will be met definitely and then the next ones as well if you ever hold more of it when the bull run is in.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}