{
  "id": "topic_5434404",
  "title": "Question:",
  "author": "BenCodie",
  "created_time": "January 12, 2023, 04:15:51 AMLast edit: August 31, 2023, 09:33:04 AM by BenCodie",
  "content": "Latest call to actionCall to action for attention to this request, posted on August 31, 2023Quote from: BenCodie on August 31, 2023, 09:32:01 AMCall to actionHave you casted a vote in the unofficial community vote for a cybersecurity and privacy board?If you haven't, it is now very easy to cast a vote. All you need to do is state your position on the topic, and either quote a member who you agree with for your reasoning, or share your opinion!Cast your vote hereAll calls to action (4) Request informationLast edit: February 15, 2023, 05:29:33 PMAnother (less detailed) request can be found here however I wish to update this thread constantly with more precedent and reasoning over time, as I believe very strongly that this board will be of great use to this forum, its users and users of Bitcoin. Credits for first posting the idea goes to takuma sato for creating the first request for this new board which was bought to my attention after posting this thread.Name: Cybersecurity and PrivacyCategory: OtherDescription: Discussion about cybersecurity and online privacy and its improvement to minimize the risk of data breaches, hacks, tracking or system compromise which may result in exploitation or loss of funds.Reasons:- Discussion that will help to prevent personal system compromise which can result in the loss of Bitcoins- Improving online privacy and protection from data collection & user tracking, which is in line with a core value of Bitcoin, privacy.- Informing users on the downfalls of existing popular systems and exploring/informing about stronger alternatives- Preventing malicious activity by growing informative and other resources that can improve personal security and online privacy.- Keep record of events that are a result of poor cybersecurity and privacy to raise the awareness of its importance.& much more.More info:In this day and age, cybersecurity is a very, very important aspect of digital life than many people are completely ignorant to until it is too late.I think where funds are involved, security should be too. Which leads to the request for a dedicated cybersecurity board, which will feature discussion of cybersecurity from a personal to an enterprise level, which ultimately will prevent people from having their coins unwillingly sent from their wallets, and therefor is definitely relevant to Bitcoin. I will update this thread with a lot of precedent when I am online next. Here are two very recent cases, one right here in bitcointalk:Bitcoin Developer @lukedashjr's wallet was hackedI've been hacked (Electrum 4.3.2)I'd like to note that a lot of the time (maybe even more of the time), hacks are due to the user and their lacking of security knowledge/implementations. This discussion point seems to be very scattered and therefor becomes a solo journey for most. It would be very good for BitcoinTalk to become a place where people can not only discuss and learn Bitcoin & blockchain, but also how to protect their Bitcoins as well as increase their security from the infinite threats online today.Board placement suggestionOther > Cybersecurity & Privacy- Between Beginners & Help and Off-Topic- Above or below Politics & Society Board structure suggestion[Main Board] Cybersecurity & Privacy: Discussions and questions about cybersecurity and privacy[Child board] Education: Tutorials, guides and informative topics that help teach improving cybersecurity and/or privacy- Suggested pin topic: Topic [tagging] etiquette to distinguish tips, tutorials, information, etc. For example [Tutorial] for a detailed how-to, [Tip] for a tip/hint, [Information] for increasing knowledge. [Child board] News: A board structure like the Bitcoin Discussion > Press section that contains dated threads about news/press relating to cybersecurity/privacy- Suggested pin topic: Enforced [date tagging] etiquette to create a date/timestamped board structure, like the Bitcoin press section.Compilation of threads that could be moved to the board or one of its suggested sub-boardsQuote from: BenCodie on February 06, 2023, 10:57:46 AMMy contributions, varying in press, general discussion and informative:[CyberSecurity] Have you ever been pwned? Protect yourself from cyberattacks. [2017-10-28] Law Firms Are Opening Bitcoin Wallets to Prepare for Data BreachesHow to protect yourself from crytoshuffle TrojanKUCOIN HackedSecurity and Privacy Topics on Guides and Protection.[INFO] Website Security ProtocolsWords of adviceWarning: About Apple Mac Hack[2019-04-27]Dangerous Malware Threatening Italians, Blockchain Could Protect VicUS Govt shares tips on defending against cyberattacks via Tor{WARNING} Cybersecurity vulnerabilities/flaws: Ledger exploit (10.08.20). US government imposing fines for those companies paying ransomwareCyber attack could be very dangerouAre you afraid of hackers?[2018-01-31] Japan’s Finance Minister Tells Crypto Exchanges to Toughen Up[2016-09-16] calvinayre.com] NEW YORK PROPOSES LANDMARK CYBERSECURITY REGULATIONKeyless encryption and passwordless authenticationWhat you should know about HackersAll of the below were compiled from Security and Privacy Topics on Guides and Protection. by Rich222:Guide and advice for new Users before you Download anything from the Forum | by LafuCrypto Security - Additional Protection For Your Seed/Private Keys | by LuciusBitcoin’s Public-Key Security Level | by nulliusBitcoin Privacy - How easy it is for someone to find all your wallets addresses | by bitmover[Guide] Protect your Crypto: Security tips for your home computer & network | by aundroid[url=https://bitcointalk.org/index.php?topic=5221497.0]Why KYC is extremely dangerous – and useless | By 1miauAuthentication: Types, Risks/ Attacks, Advice | By OcTradismHope people that give out personal address safe? Ledger wallet users' attacks | By Charles-TimProtecting Your Account | By LFC_Bitcoin[Guide] How to know if your email address was part of any data breach | By nelson4lovBasic security guide (firewall, backups, antivirus..) | By testbugPrivacy at risk using mobile phones. Not only Bitcoin-related | By fillippone{Warning}: Many 2FA hardware are vulnerable to attacks | By BaofengAegis Authenticator, a decent alternative to Google Authenticator and Authy | By mk4Brave browser hijacking links and affiliate codes! | By notblox1Hacker blackmailing me and ask for money. Did you also get this email? | By sujonali1819 Crypto security: Passwords and Authentication (Livestream -aantonop) | By Andreas Antonopoulos[GUIDE] Disposable Email Address for anonymity | By Jawhead999How to lose your Bitcoins with CTRL-C CTRL-V | By LoyceVCyber actors are now targeting Tor exit nodes to perform SSL stripping | By cryptomaniac_xxxLet's talk about Privacy | By bitmover{WARNING} Cybersecurity vulnerabilities/flaws: Linux and Mac users (04.02.20) | By TheBeardedBaby#DeGoogle - Take back control of your privacy | By xxjumperxx[Howto] Use Ledger Nano as Security Key | By aundroidDiscord Deskt. client can steal your Password,Cryptocurrencies via PM Link! | By LafuOverview on browsers. Which one should we use? Support free web while browsing | By bitmover[Eng: Tutorial] PGP Signature - Encrypt/Decrypt message - Fingerprint | By mdayonliner[LEARN] Phishing Quizzes - Beginners & Experts | By dkbit98[Tips and Information] Privacy and How to Stay Anonymous Online | By KrislawHow to Install Tails OS on USB flash drive for Wallet Purpose | By DroomieChikito[url=https://bitcointalk.org/index.php?topic=5146701.0][BEWARE] Sim Port Attack | By GreatArkansas[url=https://bitcointalk.org/index.php?topic=5132378.0][GUIDE] How to Create a Strong/Secure Password | By GreatArkansasAll of the below were compiled from Good topics on security and privacy by OcTradism:Aegis Authenticator, a decent alternative to Google Authenticator and Authy | By mk4Crypto Security - Additional Protection For Your Seed/Private Keys. | By Lucius[BEWARE] Sim Port Attack | By GreatArkansas[GUIDE] How to Create a Strong/Secure Password | By GreatArkansasWindows 7 stopped product supports. Please upgrade your Windows and wallets ASAP | By tranthidungHow to Install Tails OS on USB flash drive for Wallet Purpose | By DroomieChikitoUsing mobile phone as a full mobile wallet | By nc50lc[Guide] Secure air-gapped crypto wallet storage method | By SowikBitcoin’s Public-Key Security Level | By nulliusCoinJoin: Bitcoin privacy for the real world | By gmaxwellBasic security guide (firewall, backups, antivirus..) | By testbugLet's talk about Privacy | By bitmover#DeGoogle - Take back control of your privacy | By xxjumperxxTraditional Authentication, 2FA and 2SV | By LuzinOverview on browsers. Which one should we use? Support free web while browsing | By bitmoverHow to stay private when using Android (protonmail blog) | By bitmoverBitcoin Privacy - How easy it is for someone to find all your wallets addresses | By bitmover2FA HW security keys, Yubikey and such | By Captain-CryptoryDiscord Deskt. client can steal your Password,Cryptocurrencies via PM Link! | By LafuBrave browser hijacking links and affiliate codes! | By notblox1[TUTORIAL] Generate 2FA with Keepass (instead of Authenticator App) | By bct_ail[INFORMATION] The Cipher, it's meaning, types and connection in cryptography | By Nellayar[Education] Bitcoin Privacy and Anonymity | By Husna QA[Tips and Information] Privacy and How to Stay Anonymous Online | By Krislaw[Howto] Use Ledger Nano as Security Key | By aundroid[Guide] Protect your Crypto: Security tips for your home computer & network | By aundroid{WARNING} Cybersecurity vulnerabilities/flaws: Linux and Mac users (04.02.20).  | By TheBeardedBaby[Guide] How to know if your email address was part of any data breach | By nelson4lovWhat to do to avoid phishing sites | By hd49728Host-file to deal with phishing sites | By hd49728[LEARN] Phishing Quizzes - Beginners & Experts | By dkbit98UPDATED!!! Punycode and how to protect yourself from Homograph Phishing attacks? | By wwzsockiAuthentication: Types, Risks/ Attacks, Advice | By OcTradismVisiting official websites and download official apps, not fake ones. | By OcTradismWATCH OUT - TikTok app is a SPYWARE!!! | By wwzsockiPrivacy-o-meter, a free tool to assess the privacy level of your BTC transaction | By BlockchairExplorerForum account: security, privacy, and recovery | By OcTradismA treatise on privacy | By fillipponeWhy KYC is extremely dangerous – and useless | By 1miauCritical Electrum vulnerability | By theymosHow Scammer tried to Hack my Bitcointalk and how to Protect yourself? | By dkbit98Protecting Your Account | By LFC_BitcoinPrivacy at risk using mobile phones. Not only Bitcoin-related.  | By fillipponeWhy it’s important to avoid telling everyone about your crypto holdings | By 1miauCyber actors are now targeting Tor exit nodes to perform SSL stripping | By cryptomaniac_xxxArchive.is has stopped supporting Brave Browser | By witcher_senseHacked and Changed Email addresses Account using Yopmail accounts | By SwennaUsing Disposable Email Address to Prevent Spam | By ImThour2FA-Recovering your KYC Google Auth Keys. | By condoras[SECURITY | GUIDE] How to protect your wallets and private keys | By NestadePassword Spray Attack vs Brute Force Attack | By JatingClipboard Hijacker Malware Monitors 2.3 Million Bitcoin Addresses | By LafuHow to lose your Bitcoins with CTRL-C CTRL-V | By LoyceVHacker blackmailing me and ask for money. Did you also get this email? | By sujonali1819Privacy, ways to protection | By Charles-TimGuide and advice for new Users before you Download anything from the Forum | By LafuReport Malware and Suspicious Links here so Mods can take Action ! | By LafuA hands-on lesson on why you should check PGP fingerprints! | By nullius[Eng: Tutorial] PGP Signature - Encrypt/Decrypt message - Fingerprint | By mdayonliner[GUIDE] Disposable Email Address for anonymity | By Jawhead999Crypto security: Passwords and Authentication (Livestream -aantonop) | By Andreas AntonopoulosHope people that give out personal address safe? Ledger wallet users' attacks | By Charles-TimBitcoin security and privacy | By Charles-Tim{Warning}: Many 2FA hardware are vulnerable to attacks | By BaofengAll of the below were compiled from the Security section of Beginners & Help Encyclopedia by Ratimov:multi-chain blockchain ecosystem is risky (by _act_)Why it’s important to avoid telling everyone about your crypto holdings by 1miauSo how safe is Tails when using my hardware wallet or online accounts by 20kevin20My network is not your network, crosscheck before sending funds! by AccardoBe careful of INFLUENCER REVIEWS by adekogbeWondering why account are hack or stolen? HTTP VS HTTPS by akirasendo17[Wiki] An Informal Introduction to Plausible Deniability by AlcoHoDLCrypto criminal activities. by Alucard1Ways to prevent Cryptojacking ,hacking etc. by Asuspawer09Newbies beware of influencers -they might not know it all/it's can go wrong- by BIT-BENDERDangers and Risks for Beginners by Bitcoin_bullishThere is more that meet the eye by BravehashSome potholes to avoid in every website (by Cookdata)Your stupidity is opportunity for scammers! by COOLCRYPTOVATORNetwork security for beginners by cryptolord2077Why looking for a crack software version is dangerous, specially for crypto user by cryptomaniac_xxxFor Crypto Users: Reasons why we should not download pirated softwares by cryptomaniac_xxxDo not use any note taking apps for recording your crypto keys and password by cryptomaniac_xxx[GUIDE] Keeping your crypto secure: DOs and DON'Ts by cryptosec.infoDon't auto Save your login details by CryptoYarTor browser Bitcointalk members read this by dkbit98Beginners Guide to Security and Privacy by encryptedmind26Dust Attack, what it is, why it is dangerous and how to prevent falling to it by fillipponeSecurity tips for beginners by gron88-05Greediness could make you prone to these Hacks or Phishing attacks. by HarkoredeJust because It’s on GitHub. It doesn’t mean it’s safe> by hugeblackA case against using Avast by jseversonIdentity Security: A Newbies' Priority (by KingsDen)Mapping the crypto fraud landscape by koshjGuide and advice for new Users before you Download anything from the Forum ! by LafuDouble Check Bitcointalk Username Before Download or Invest to Avoid Virus/Scam by masulum[Guide] How To Stay Safe From Scam Advertising When Use Search Engine by masulum[Security Awareness] Online payment transactions. by maxreishSave your crypto, Disable WPS! by mikeywithAre you using a Public DNS server? your coins are at risk ! by mikeywithOfficially visit websites & download apps, not fake ones. by OcTradismSecurity for Beginners by opg777Be careful of shitcoins by OshosondyDon't buy steemit accounts from others, buy it officially and legally by r1s2g3Don't send your personal data to anyone in PM by RatimovCertificate of Incorporation- what it is and why it shouldn't be trusted! by RikafipHow to protect yourself from fake giveaways. by ScamViruSCryptocurrency Attacks To Be Aware In 2021 by ShammNewbies Avoid complacency adhere to guides lines by Sharon121212Be careful of BTT account impersonation On and off the forum by Sharon121212As the price rises so should our sense of security rise by Sharon121212Important, Beginners should know !!! by skaraisNewbies attention. Don't get trap yourself with greed. by sujonali1819Newbie Tips - How to check SHORTLINK safely ? by terizlaBasic security guide (firewall, backups, antivirus..) - not only for beginners by testbugGuide on avoid red tags by supporting already known scam projects by tranthidungFundraising threads on behalf of COVID-19. Don't trust, verify. by tranthidung(Beware) on Fake Screenshot Details by yazherCredential Stuffing Attack by Yogee[PSA] DOUBLE-SPENDING SCAM - WHY CONFIRMATIONS ARE IMPORTANT by YourNekoNewbies, don't be naive by RatimovMeet bots asking you for otp by libert19All of the below were compiled from the Privacy section of Beginners & Help Encyclopedia by Ratimov:How to stay private when using Android (protonmail blog by bitmoverLet's talk about Privacy by bitmoverBitcoin Privacy - How easy it is for someone to find all your wallets addresses by bitmoverDifferences between anonymity & privacy by BlackHatCoinerPrivacy, ways to protection by Charles-TimPrivacy enhancing strategy on centralized exchanges possible? by Charles-TimPrivacy is not a crime, learn to do it yourself (DIY) by CookdataA Treatise on Bitcoin and Privacy by fillippone[Education] Bitcoin Privacy and Anonymity by Husna QA[Tips and Information] Privacy and How to Stay Anonymous Online by KrislawPrivacy while making use of Bitcoin by NathrixxxWhile using bitcoin there should be privacy by OshosondyA few thoughts on privacy by zasad@New addition to list above on February 15: [Tips] Ways to Protect Recovery Phrase - Mnemonic  by joker_josueUsers who have expressed support for this idea, their ranks, and their merit countMembers who possibly support the proposal (OP/multiple post +Merit though no post of support)LoyceV - Legendary (Merit: 13245)Quote from: LoyceV on February 13, 2023, 06:47:03 PMFor the record: the fact that I Merited a post doesn't (necessarily) mean I agree or support the post. It means I think the post is worth reading.In this case: I wouldn't be against a privacy board, and considering how many topics you've listed, I'd probably spend some time reading there.JayJuanGee - Legendary (Merit: 7833)Link to feedbackMembers who expressed via posting support directly and/or by contributing to the proposal (with quotes)Welsh - [Staff] Legendary (Merit: 3895)Quote from: Welsh on January 13, 2023, 09:20:20 PMQuote from: BlackHatCoiner on January 13, 2023, 09:13:01 PMI don't like it. Lots of sub-boards can bring worry. If you want to talk about something specific for a Bitcoin wallet, use a Wallet software sub-board. If you want to ask questions related to wallet software, use that board. If you're interested in improving your competence around security, you should visit the proposed board.We should also have a separate privacy-related sub-board, in my opinion, but that's off-topic. Potentially having a privacy section that's a child of security as they're somewhat related or simply a dedicated Security & Privacy section. Probably one of the few times I'd like to see something implemented not based on demand, but because I think it's somewhat important to understand. Plus, I could probably talk security a lot, and would have some threads in mind to contribute to the section which don't really fit anywhere worthwhile currently. Off topic or very loosely Beginners & Help maybe. I'd probably contribute some specific Qubes features which could be beneficial for Bitcoin users in securing their assets as well as some unrelated security benefits. ETFBitcoin - Legendary (Merit: 5798)Quote from: ETFbitcoin on February 14, 2023, 10:20:21 AMI hereby announce that i support creation of \"Cybersecurity and Privacy\" board on bitcointalk.org.BlackHatCoiner - Legendary (Merit: 5283)Quote from: BlackHatCoiner on January 13, 2023, 09:13:01 PMQuote from: Oshosondy on January 12, 2023, 06:22:05 AMIf someone's exchange is hacked, that can go to exchange board.The point of such board isn't to address your issue (only). It is to educate yourself about security, with guides, lists, stories etc. And I'm in favor of such board.DaveF - Legendary (Merit: 4998) Quote from: DaveF on January 18, 2023, 08:55:09 PMWould be good if it was setup like the Bitcoin Discussion > Press section.This way it could be looked at quickly so people could see if things are going to matter to them.[2023-01-12] Cisco Warns of Critical Vulnerability in EoL Small Business Routers [2023-01-11] Dell PowerEdge Server Security Update for AMD Server Vulnerabilities  And the 1st few lines should have a brief description and links to the appropriate information. This MIGHT get people to at least scan it to see if there is something about a product that they use. Otherwise it really does stand a good chance of getting buried on page 7 never to be seen.-DaveNot A Tether - Legendary (Merit: 4858)Quote from: NotATether on January 20, 2023, 07:37:56 AMSend a PM to theymos with a link to this thread, so that he can create it sooner.n0nce - Hero Member (Merit: 4826)Quote from: n0nce on January 16, 2023, 05:58:49 PMQuote from: mk4 on January 12, 2023, 04:35:01 AMNot sure if one is necessary, as they can pretty much fall under the Wallet software section. https://bitcointalk.org/index.php?board=37.0On the other hand, such a section would probably be good for things like the LastPass breach, etc which aren't necessarily bitcoin/crypto-related.We could also talk about cybersec topics outside of only wallets, though. For instance, in the hardware wallet section we sometimes stumble about general (even though maybe related) questions like: 'how (in)secure is NFC' and such, but creating a topic like that just doesn't fit in the wallet section.We could then also quote and link between topics e.g. if someone asks about the threats of using a wired USB connection with their hardware wallet, link to a cybersecurity board topic talking about USB exploits.Quote from: Welsh on January 13, 2023, 09:20:20 PMPotentially having a privacy section that's a child of security as they're somewhat related or simply a dedicated Security & Privacy section.I like this idea! Privacy board going under the Cybersecurity board, wherever that may be placed.lovesmayfamilis - Legendary (Merit: 3480)Quote from: lovesmayfamilis on January 18, 2023, 07:16:06 PMInterestingly, if you skim through the hacker forums, there are always sections on cybersecurity and privacy. It turns out that this is useful for hackers; they have entire sections on how to protect themselves, and a forum that assumes knowledge of how to store your important data so that nothing is stolen from you is not interested in this.I support your initiative, OP. You have almost begun to cover some useful aspects. It would be helpful to have proper guides from knowledgeable people who can help in a timely manner, rather than scouring the internet and trusting those who might be amateurs in the field of online security.mk4 - Legendary (Merit: 3461)Quote from: mk4 on January 12, 2023, 07:15:01 AMYea a reconstruction of the Wallet section is great as well!Instead of Bitcoin > Wallet softwarea better construction would probably be:Security > Wallet software > Bitcoin walletsSo we can have other things like Security > Internet security general, etcvapourminer - Legendary (Merit: 2714)Quote from: vapourminer on February 13, 2023, 08:04:01 PMi do support a security board though and would spend time there. but my support means nothing lolUpgrade00 - Legendary (Merit: 1942)Quote from: Upgrade00 on January 13, 2023, 09:26:54 PMWith the recent cases of hack and loss of bitcoins even affecting more experienced users and devs, it is imperative to have a dedicated board or child board which discusses the possibilities of a breach and how one can protect themselves. It could also help with some of the complacency some users feel when they've held bitcoins for a while.joker_josue - Legendary (Merit: 1830)Quote from: joker_josue on January 24, 2023, 12:15:24 AMI find the idea of a section dedicated to this topic interesting.Although we all have different concepts of security and privacy, and use different methods to apply them, it would be good to analyze different perspectives, so that as a whole we can all improve our security and privacy.FatFork - Legendary (Merit: 1741)Quote from: FatFork on January 14, 2023, 09:58:30 AMGiven that the cryptocurrency ecosystem is constantly evolving, new threats and vulnerabilities are frequently discovered. A dedicated board would be a great way for the community to stay informed about the latest developments and threats in the field, and would provide focused discussions and resources on topics such as preventing hacking and fraud, safely storing assets, and could lead to better security practices overall. I fully support this idea.PowerGlove - Senior Member (Merit: 1585)Quote from: PowerGlove on January 20, 2023, 12:45:34 AMIt's a yes from me. It would be nice to have a place to post about security/privacy topics (e.g. Tor, Tails, Qubes, Whonix, etc.) and help other members to improve their opsec and keep their BTC safe.Right between B&H and Off-topic seems like a good spot:Stalker22 - Legendary (Merit: 1056)Quote from: Stalker22 on January 13, 2023, 07:54:58 PMI like the idea. A dedicated board for discussing the latest threats, sharing tips and resources, and asking questions related to cybersecurity would be a valuable addition to the community. I do not see any negative side to this proposal.julerz12 - Hero Member (Merit: 784)Quote from: julerz12 on January 15, 2023, 06:01:55 PMVoted Yes, not only because I'm one of those idiots who got hacked, but also because it is beneficial to see all security and privacy-related threads put in one place, into one board, rather than scattered all over the forum. Easier for everyone to gather information. I also like the idea of placing it on Other. That way, it's much easier to notice than placing it as a sub-board of Wallet software. Other is like the middle-ground between Bitcoin-related topics and Altcoin-related topics. Users will be able to discuss security and privacy-related topics for both Bitcoin and the rest of all the Altcoins on it; placing it there just makes sense.ScamViruS - Hero Member (Merit: 655)Quote from: ScamViruS on February 06, 2023, 07:07:05 PMQuote from: BenCodie on February 06, 2023, 10:57:46 AMI started compiling a list until I stumbled across compilations and decided to bulk them all into one post. With all of these, a solid board of resources could be created. This does not include the ample amount of new information that could be created by topic creators if this board were to become a reality.You've done a great job bringing these important threads together. For a new forum user this list can be a great way to learn how to stay safe in the crypto market. And to stay safe in the crypto world, a crypto user must need to know about Cybersecurity. So I think it is important to add Cybersecurity and Privacy board, to educate crypto users more about Cybersecurity and privacy.digaran - Hero Member (Merit: 646)Quote from: digaran on January 24, 2023, 01:58:50 AMIf they could add a child board \"Education\" where people could demonstrate how to run commands/build open source applications themselves, the things they should avoid doing when dealing with certain softwares etc, then  I'd vote yes, asking administration to consider please.Bigpiggy01 - Hero Member (Merit: 507)Quote from: Bigpiggy01 on February 15, 2023, 05:02:43 PMI haven't been overly active on here outside my main project thread in a while but this is an initiative I am happy to support. I've been in education for ages and would be happy to help condense some of the threads on best practices and attack vectors, particularly on anything that applies more or less across btccodebase altcoins as well into doodle vids or other simplified media should this get approved.This is also something that would add immense value to a lot of speculative mining communities as they are frequently the low hanging fruit to get targeted.FlexyStar - Full Member (Merit: 175)Quote from: Flexystar on January 17, 2023, 04:39:42 PMQuote from: BlackHatCoiner on January 13, 2023, 09:25:15 PMQuote from: Welsh on January 13, 2023, 09:20:20 PMSecurity & Privacy section.That's actually a neat idea. Both freedoms from risk in one board. Quote from: Welsh on January 13, 2023, 09:20:20 PMProbably one of the few times I'd like to see something implemented not based on demand, but because I think it's somewhat important to understand.If it doesn't get recognition, I'm not of the opinion that we should impose it (I mean, how could ever do it anyway, this forum isn't run by regular users), but it wouldn't be bad to try it out, and see how it goes. Also far better considering it does not focus on just special security topics such as Cybersecurity! With the increased involvement of high level coding such as chat gpt, AI is taking over swiftly. It has started now with one goal of making the world far more easier and reliable on AI. However, it will start imposing the security threats sooner than we think.Security concerns such as this will start flourishing in no time. Its better we have such subforum where pre-discussions, alerts about AI hacks, preventive measures can be discussed prominently. This is must have subforum. Saisher - Full Member (Merit: 158)Quote from: Saisher on January 23, 2023, 11:23:10 PMSo far the result :\"Cybersecurity and Privacy\" board in \"Other\" cattegoryYes   - 24 (96%)No   - 1 (4%)Total Voters: 25I'm sure if many people will stumble or lead to this thread they will vote yes to have that category, we need this category with so much hacking and so many breaches going on, there are many articles and videos about Cybersecurity and Privacy but we want an in-depth discussion to get the best possible solution and results, I don't want only one guy teaching about security without being questioned on what he is discussing.geeyow - Newbie (Merit: 6) Quote from: geeyow on January 14, 2023, 03:13:28 AMThe only logical place to put it is within OtherOther -> Cybersecurity & Privacybest to put it besides Beginner & Help.Topics like:Hacking incidents or tutorials on how to prevent themNews about potential wallet exploits and bugs (BTC or Altcoin)Tutorials about anonymityyusrime - Newbie (Merit: 0)Quote from: yusrime on January 18, 2023, 08:36:47 PMQuote from: geeyow on January 14, 2023, 03:13:28 AMThe only logical place to put it is within OtherOther -> Cybersecurity & Privacybest to put it besides Beginner & Help.Topics like:Hacking incidents or tutorials on how to prevent themNews about potential wallet exploits and bugs (BTC or Altcoin)Tutorials about anonymityI am a newbie but I vote YES with this suggestion.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5434404",
  "comments": [
    {
      "author": "Solosanz",
      "created_time": "January 12, 2023, 04:17:10 AM",
      "body": "This has been requested before Cybersecurity subforum, lock your topic and continue in this thread.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BenCodie",
      "created_time": "January 12, 2023, 04:23:08 AMLast edit: August 31, 2023, 09:34:28 AM by BenCodie",
      "body": "Quote from: Solosanz on January 12, 2023, 04:17:10 AMThis has been requested before Cybersecurity subforum, lock your topic and continue in this thread.Thank you! Locked & updated OP.Edit - I am leaving this thread open as I wish to update the precedent and elaborate on the details of the OP much further than the other post. I am also going to request the OP of the other thread to lock his topic so that new discussion can occur here about it.Edit 2 - I have requested the OP of the original thread to lock their thread and move to this one with good reason, if they are open to doing it:Quote from: BenCodie on January 12, 2023, 04:32:37 AMHi takuma sato. I think you are 100% on the money with this suggestion and I am passionate about supporting it. I made a thread here with another request. I would love to constantly maintain and update that topic with more resources, I believe that more than one topic per request mightn't be good practice or something as someone told me to lock my thread for making an additional request. Would you be open to locking this thread so we can continue the discussion there? I have given you credit in my OP and also some merit for being the person who came up with the idea first. The reason for the request is so that I can maintain and build on the original post.Thanks!Edit May 01 2023 - Adding past call to actions into this postCall to action for attention to the community vote, posted on August 31, 2023Quote from: BenCodie on August 31, 2023, 09:32:01 AMCall to actionHave you casted a vote in the unofficial community vote for a cybersecurity and privacy board?If you haven't, it is now very easy to cast a vote. All you need to do is state your position on the topic, and either quote a member who you agree with for your reasoning, or share your opinion!Cast your vote hereCall to action for attention to this request, posted on May 1, 2023Quote from: BenCodie on May 01, 2023, 12:40:10 AMOn April 30 2023, Avirunes received a loan from shasan and was reportedly hacked of the whole amount lent (0.015 BTC, approx $450 USD market value). The hack shows a lot of similarities to the situation that occurred with julerz12, Avirunes was likely to have been infected with malware that was able to either grab the secret/seed phrase of the Electrum wallet, or sweep/send from the electrum wallet to the hackers address. If the Cybersecurity and Privacy board was added any time in the last 3 months after the situation with julerz12, maybe a post there (such as one explaining and emphasizing that all users should be using Linux over Windows) may have prevented the OP from being hacked. The Cybersecurity and Privacy board is becoming imperative for the safety of BitcoinTalk users as two incidents have now effected and caused damage to the BitcoinTalk economy. Call to action for attention to this request, posted on April 23, 2023Quote from: BenCodie on April 23, 2023, 01:22:03 AMTheymos, enable us to increase our online armor and to help do the same for individuals who are otherwise vulnerable by adding the Cybersecurity & Privacy board! This is a rather older article that I stumbled across recently however I believe that it highlights the shift from being a victim of deception (controllable by common sense, experience, reduced naivety, skepticism and/or wisdom) to being a victim of hacks - which is controllable only with exposure to knowledge. The majority of people don't have access to accurate information without looking for it, which is what I hope the Cybersecurity & Privacy board here on BitcoinTalk would achieve!Source: https://edition.cnn.com/2022/08/16/tech/crypto-hack-rise-2022/index.htmlThe good news: Significantly less people are falling for ponzi schemes similar to BitConnect than in 2017:Quote from: cnnBut there may be at least one silver lining in the report: The amount of money lost in cryptocurrency scams, such as the $2 billion dollar Ponzi scheme carried out by BitConnect founder Satish Kumbhani, was 65% less than the year prior as the falling value of crypto made it a less enticing investment opportunity for potential victims. The bad news: Over $1.9 billion has been hacked or stolen from protocols and users during the first 7 months of 2022Some more validation of the need for the Cybersecurity & Privacy board below.As of March 2023, ransomware attacks are increasingSource: https://www.ghacks.net/2023/04/22/ransomware-attacks-record-march/Basic cybersecurity measures can very easily prevent the threat of non-targeted ransomware.GDAC hot wallet hacked for $13 millionList of some recent exchange hacks: https://www.hedgewithcrypto.com/cryptocurrency-exchange-hacks/The end-user could have easily prevented their exposure to centralized exchange hacks by not using them altogether or keeping their coins off-exchange unless they need to use the exchange (last resort, many alternatives out there nowadays).   Some other non-crypto hacks in 2023 where the end-user may have been able to reduce their exposure if they were taking intermediate to advanced privacy measures:QuoteApril 10Pizza Hut/KFC Data Breach: Yum! Brands, which owns fast food chains Pizza Hut, KFC, and Taco Bell, has informed a number of individuals that their personal data was exposed during a ransomware attack that took place in January of this year. The hospitality giant confirmed that names, driver's license, and ID card info was stolen. An investigation into whether the information has been used to commit fraud already is currently underway.How risk for the end user could have been mitigated:- Don't upload personal/sensitive information where you don't need to (why on earth would you upload a drivers license/ID card to these companies anyway?)- Use non-identifiable information and a pre-paid debit card to make purchases, if possible. - Don't trade your identity/privacy/payment information for convenience. QuoteMarch 24ChatGPT Data Leak: A bug found in ChatGPT's open-source library caused the chatbot to leak the personal data of customers, which included some credit card information and the titles of some chats they initiated.  “In the hours before we took ChatGPT offline,” OpenAI said after the incident, “it was possible for some users to see another active user’s first and last name, email address, payment address, the last four digits (only) of a credit card number, and credit card expiration date. Full credit card numbers were not exposed at any time.”How risk for the end user could have been mitigated:- Using PVA's to create a ChatGPT account in conjunction with a VPN/Proxy to make the data less/non-identifiable to the chatGPT user.QuoteChick-fil-A Data Breach: fast food chain Chick-fil-A is investigating “suspicious activity” linked to a select number of customer accounts. The company has published information on what customers should do if they notice suspicious activity on their accounts, and advised such customers to remove any stored payment methods on the account.How risk could have been mitigated by the end user:- Using a pre-paid debit card solution separate from the main bank account would allow the user to easily disable access to funds without effecting day to day life.QuoteFebruary 21Activision Data Breach: Call of Duty makers Activision has suffered a data breach, with sensitive employee data and content schedules exfiltrated from the company's computer systems. Although the breach occurred in early December 2022, the company has only recently revealed this to the public. According to reports, an employee's credentials were obtained in a phishing attack and subsequently used to infiltrate the system.QuoteTwitter Data Breach: Twitter users' data was continuously bought and sold on the dark web during 2022, and it seems 2023 is going to be no different. According to recent reports, a bank of email addresses belonging to around 200 million Twitter users is being sold on the dark web right now for as little as $2. Even though the flaw that led to this leak was fixed in January 2022, the data is still being leaked by various threat actors.How risk for the end user could have been mitigated:- Using a privacy-friendly, disposable email with non-identifiable information for the activision account to make the mistake of the employee of no concern for the end-user.QuotePayPal Data Breach: A letter sent to PayPal customers on January 18, 2023, says that on December 20, 2022, “unauthorized parties” were able to access PayPal customer accounts using stolen login credentials.PayPal goes on to say that the company has “no information” regarding the misuse of this personal information or “any unauthorized transactions” on customer accounts and that there isn't any evidence that the customer credentials were stolen from PayPal's systems.How risk could have been mitigated by the end user:- Don't use paypal (there are many alternatives that serve the same purpose out there)QuoteDecember 1LastPass Data Breach: Password manager LastPass has told some customers that their information was accessed during a recent security breach. According to LastPass, however, no passwords were accessed by the intruder. This is not the first time LastPass has fallen victim to a breach of their systems this year – someone broke into their development environment in August, but again, no passwords were accessed.How risk could have been mitigated by the end user:- Using offline encryption methods on external storage to protect passwords instead of using supposedly \"encrypted\" and \"secure\" cloud storage servicesSource: https://tech.co/news/data-breaches-updated-listCall to action for attention to this request, posted on March 30, 2023Quote from: BenCodie on March 30, 2023, 09:50:30 AMSince the demise of ChipMixer, users have begun to question lately about whether or not it is a wise move to participate in mixing signature campaigns, and if there are any risk to users who are being paid to have these services in their signatures around the forum, such as in this thread:Participating in Mixer SignaturesBitcoinTalk staff were allegedly asked not to promote these services, raising more cause for concern: staff were asked to stop advertising mixing servicesAdditionally, recent news has exposed that an unknown person or group (dubbed \"LinkingLion\") may be collecting IP addresses from Bitcoin nodes/users.If the Cybersecurity & Privacy board were added, I would be almost certain that there would be a bountiful amount of knowledge and resources that would allow people to reduce their fears and take comfort in the measures that they are taking to keep their privacy from being compromised. The reasons for adding this board are only increasing by the day and I could bet that it would soon become a necessity if we want to help to assist the (unfortunately) wider, currently unaware/uninformed portion of the community in upholding their anonymity and privacy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "January 12, 2023, 04:35:01 AM",
      "body": "Not sure if one is necessary, as they can pretty much fall under the Wallet software section. https://bitcointalk.org/index.php?board=37.0On the other hand, such a section would probably be good for things like the LastPass breach, etc which aren't necessarily bitcoin/crypto-related.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BenCodie",
      "created_time": "January 12, 2023, 04:42:12 AM",
      "body": "Quote from: mk4 on January 12, 2023, 04:35:01 AMNot sure if one is necessary, as they can pretty much fall under the Wallet software section. https://bitcointalk.org/index.php?board=37.0On the other hand, such a section would probably be good for things like the LastPass breach, etc which aren't necessarily bitcoin/crypto-related.We are permanently in a state of digital warfare, where people are targeted even without prompting. I think it probably was not necessary when Bitcoin started, or even 2-3 years ago it could have been called \"somewhat necessary\"...but now, I think it is definitely necessary. I have done a lot of research and reading to support this view, trust me!Under the wallets section would be most viable to relating it to Bitcoin (as cybersecurity in terms of Bitcoin is to protect your wallet and funds). Though (and I know aesthetics is not a primary focus for anyone) I think it aesthetically won't fit well there considering all of the other boards are for specific wallet software rather than subject/topic categories. I do think it deserves to be at most a sub-board, rather than a sub-board of a sub-board. Where it fits is challenging.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oshosondy",
      "created_time": "January 12, 2023, 06:22:05 AM",
      "body": "If someone's exchange is hacked, that can go to exchange board. If someone's wallet is hacked, that can go to software wallet board. If it is a web wallet that is hacked, it can go to web wallet board.Quote from: Solosanz on January 12, 2023, 04:17:10 AMThis has been requested before Cybersecurity subforum, lock your topic and continue in this thread.He has a new idea to be updating the OP with cyber security threads which can be a reason why this thread is different from the old one, but no good reason we should have a cyber security board.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "January 12, 2023, 07:15:01 AM",
      "body": "Quote from: BenCodie on January 12, 2023, 04:42:12 AMWe are permanently in a state of digital warfare, where people are targeted even without prompting. I think it probably was not necessary when Bitcoin started, or even 2-3 years ago it could have been called \"somewhat necessary\"...but now, I think it is definitely necessary. I have done a lot of research and reading to support this view, trust me!Under the wallets section would be most viable to relating it to Bitcoin (as cybersecurity in terms of Bitcoin is to protect your wallet and funds). Though (and I know aesthetics is not a primary focus for anyone) I think it aesthetically won't fit well there considering all of the other boards are for specific wallet software rather than subject/topic categories. I do think it deserves to be at most a sub-board, rather than a sub-board of a sub-board. Where it fits is challenging. Yea a reconstruction of the Wallet section is great as well!Instead of Bitcoin > Wallet softwarea better construction would probably be:Security > Wallet software > Bitcoin walletsSo we can have other things like Security > Internet security general, etc",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BenCodie",
      "created_time": "January 12, 2023, 08:46:16 AM",
      "body": "Quote from: Oshosondy on January 12, 2023, 06:22:05 AMIf someone's exchange is hacked, that can go to exchange board. If someone's wallet is hacked, that can go to software wallet board. If it is a web wallet that is hacked, it can go to web wallet board.I think you've missed the entire premise/purpose of the board request. It is definitely not primarily to post about being hacked. It is meant to discuss everything surrounding cybersecurity such as ways to defend yourself online or improve overall system security in order to prevent being hacked in the first place. Quote from: Oshosondy on January 12, 2023, 06:22:05 AMQuote from: Solosanz on January 12, 2023, 04:17:10 AMThis has been requested before Cybersecurity subforum, lock your topic and continue in this thread.He has a new idea to be updating the OP with cyber security threads which can be a reason why this thread is different from the old one, but no good reason we should have a cyber security board.Do you know what the word \"precedent\" is, or means? Every single thread that is and will be linked are proof that people need to know how to improve their cybersecurity and serves as an individual reason as to why a board that includes information to prevent the same thing from happening again is needed.I'm not going to lie to you, I'm pretty astounded with your post. If I could negative merit it, I would.Quote from: mk4 on January 12, 2023, 07:15:01 AMQuote from: BenCodie on January 12, 2023, 04:42:12 AMWe are permanently in a state of digital warfare, where people are targeted even without prompting. I think it probably was not necessary when Bitcoin started, or even 2-3 years ago it could have been called \"somewhat necessary\"...but now, I think it is definitely necessary. I have done a lot of research and reading to support this view, trust me!Under the wallets section would be most viable to relating it to Bitcoin (as cybersecurity in terms of Bitcoin is to protect your wallet and funds). Though (and I know aesthetics is not a primary focus for anyone) I think it aesthetically won't fit well there considering all of the other boards are for specific wallet software rather than subject/topic categories. I do think it deserves to be at most a sub-board, rather than a sub-board of a sub-board. Where it fits is challenging. Yea a reconstruction of the Wallet section is great as well!Instead of Bitcoin > Wallet softwarea better construction would probably be:Security > Wallet software > Bitcoin walletsSo we can have other things like Security > Internet security general, etcThe solutions in the wallet section are kind of outdated, some definitely don't need their own board. I think that the wallet section is another can of worms though.I think a Cybersecurity section is as important as Politics and Society, and it would even deserve a place in the \"Other\" category. Better yet, since privacy (in a way) goes hand in hand with security, or at least the content of both topics could exist within the same board, naming the board \"Privacy and Security\" or \"Cybersecurity and Privacy\" would allow it to fit well above or below \"Politics and Society\".",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "January 13, 2023, 11:31:09 AM",
      "body": "Quote from: mk4 on January 12, 2023, 07:15:01 AMQuote from: BenCodie on January 12, 2023, 04:42:12 AMWe are permanently in a state of digital warfare, where people are targeted even without prompting. I think it probably was not necessary when Bitcoin started, or even 2-3 years ago it could have been called \"somewhat necessary\"...but now, I think it is definitely necessary. I have done a lot of research and reading to support this view, trust me!Under the wallets section would be most viable to relating it to Bitcoin (as cybersecurity in terms of Bitcoin is to protect your wallet and funds). Though (and I know aesthetics is not a primary focus for anyone) I think it aesthetically won't fit well there considering all of the other boards are for specific wallet software rather than subject/topic categories. I do think it deserves to be at most a sub-board, rather than a sub-board of a sub-board. Where it fits is challenging. Yea a reconstruction of the Wallet section is great as well!Instead of Bitcoin > Wallet softwarea better construction would probably be:Security > Wallet software > Bitcoin walletsSo we can have other things like Security > Internet security general, etcI don't like the idea of putting it under the wallets subboard. You can try perhaps under the Development and Technical discussion board, but even there, I do not think that it is a suitable location either. Another place could be somewhere under the Economy board: Economy > Cybersecurity.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BenCodie",
      "created_time": "January 13, 2023, 11:45:36 AM",
      "body": "Quote from: NotATether on January 13, 2023, 11:31:09 AMQuote from: mk4 on January 12, 2023, 07:15:01 AMQuote from: BenCodie on January 12, 2023, 04:42:12 AMWe are permanently in a state of digital warfare, where people are targeted even without prompting. I think it probably was not necessary when Bitcoin started, or even 2-3 years ago it could have been called \"somewhat necessary\"...but now, I think it is definitely necessary. I have done a lot of research and reading to support this view, trust me!Under the wallets section would be most viable to relating it to Bitcoin (as cybersecurity in terms of Bitcoin is to protect your wallet and funds). Though (and I know aesthetics is not a primary focus for anyone) I think it aesthetically won't fit well there considering all of the other boards are for specific wallet software rather than subject/topic categories. I do think it deserves to be at most a sub-board, rather than a sub-board of a sub-board. Where it fits is challenging. Yea a reconstruction of the Wallet section is great as well!Instead of Bitcoin > Wallet softwarea better construction would probably be:Security > Wallet software > Bitcoin walletsSo we can have other things like Security > Internet security general, etcI don't like the idea of putting it under the wallets subboard. You can try perhaps under the Development and Technical discussion board, but even there, I do not think that it is a suitable location either. Another place could be somewhere under the Economy board: Economy > Cybersecurity.Economy is good. I suggested under \"Other\" with the additional label of privacy to go along with it. \"Cybersecurity and Privacy\". I will do some more thinking and elaborate on the OP at some stage when I have some free time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Stalker22",
      "created_time": "January 13, 2023, 07:54:58 PM",
      "body": "I like the idea. A dedicated board for discussing the latest threats, sharing tips and resources, and asking questions related to cybersecurity would be a valuable addition to the community. I do not see any negative side to this proposal.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackHatCoiner",
      "created_time": "January 13, 2023, 09:13:01 PM",
      "body": "Quote from: Oshosondy on January 12, 2023, 06:22:05 AMIf someone's exchange is hacked, that can go to exchange board.The point of such board isn't to address your issue (only). It is to educate yourself about security, with guides, lists, stories etc. And I'm in favor of such board.Quote from: mk4 on January 12, 2023, 07:15:01 AMa better construction would probably be:Security > Wallet software > Bitcoin walletsI don't like it. Lots of sub-boards can bring worry. If you want to talk about something specific for a Bitcoin wallet, use a Wallet software sub-board. If you want to ask questions related to wallet software, use that board. If you're interested in improving your competence around security, you should visit the proposed board.We should also have a separate privacy-related sub-board, in my opinion, but that's off-topic.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Welsh",
      "created_time": "January 13, 2023, 09:20:20 PM",
      "body": "Quote from: BlackHatCoiner on January 13, 2023, 09:13:01 PMI don't like it. Lots of sub-boards can bring worry. If you want to talk about something specific for a Bitcoin wallet, use a Wallet software sub-board. If you want to ask questions related to wallet software, use that board. If you're interested in improving your competence around security, you should visit the proposed board.We should also have a separate privacy-related sub-board, in my opinion, but that's off-topic. Potentially having a privacy section that's a child of security as they're somewhat related or simply a dedicated Security & Privacy section. Probably one of the few times I'd like to see something implemented not based on demand, but because I think it's somewhat important to understand. Plus, I could probably talk security a lot, and would have some threads in mind to contribute to the section which don't really fit anywhere worthwhile currently. Off topic or very loosely Beginners & Help maybe. I'd probably contribute some specific Qubes features which could be beneficial for Bitcoin users in securing their assets as well as some unrelated security benefits.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackHatCoiner",
      "created_time": "January 13, 2023, 09:25:15 PM",
      "body": "Quote from: Welsh on January 13, 2023, 09:20:20 PMSecurity & Privacy section.That's actually a neat idea. Both freedoms from risk in one board. Quote from: Welsh on January 13, 2023, 09:20:20 PMProbably one of the few times I'd like to see something implemented not based on demand, but because I think it's somewhat important to understand.If it doesn't get recognition, I'm not of the opinion that we should impose it (I mean, how could ever do it anyway, this forum isn't run by regular users), but it wouldn't be bad to try it out, and see how it goes.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Upgrade00",
      "created_time": "January 13, 2023, 09:26:54 PM",
      "body": "With the recent cases of hack and loss of bitcoins even affecting more experienced users and devs, it is imperative to have a dedicated board or child board which discusses the possibilities of a breach and how one can protect themselves. It could also help with some of the complacency some users feel when they've held bitcoins for a while.Quote from: Welsh on January 13, 2023, 09:20:20 PMPotentially having a privacy section that's a child of security as they're somewhat related or simply a dedicated Security & Privacy section. This could work and serve as an umbrella board for all posts related to security and privacy. Many of such posts will fit loosely in either the Bitcoin, altcoin or economy boards, or any of the wallet child boards. But having a dedicated section where one can find all posts in one place, or at least all related to Bitcoin would be helpful.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Welsh",
      "created_time": "January 13, 2023, 09:34:00 PM",
      "body": "While, I haven't given it a massive amount of though, that's probably the biggest complexity if we were to add it. Where exactly would be fit it in, and what would be allowed, and not allowed in the section. I'd like to see it implemented into the main Bitcoin sections, but then that would mean we'd likely have to limit to Bitcoin related content regarding security rather than general cybersecurity principles. Which, personally I'm okay with. Off topic can house generic cybersecurity concerns. That section needs a few quality discussions going on or potentially serious discussion, but that limits the audience that can participate.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "geeyow",
      "created_time": "January 14, 2023, 03:13:28 AM",
      "body": "The only logical place to put it is within OtherOther -> Cybersecurity & Privacybest to put it besides Beginner & Help.Topics like:Hacking incidents or tutorials on how to prevent themNews about potential wallet exploits and bugs (BTC or Altcoin)Tutorials about anonymity",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FatFork",
      "created_time": "January 14, 2023, 09:58:30 AM",
      "body": "It appears that some members, even those who seem to be experienced in this field, are not fully aware of or do not fully understand the significance of securing their cryptocurrency assets, and may not be utilizing all the tools at their disposal. So, in my view, having a dedicated Cybersecurity & Privacy board within a forum discussing Bitcoin and cryptocurrencies would be extremely beneficial. This board could provide a centralized place for members to discuss, share knowledge, and learn about the security and privacy of their assets and transactions, which are crucial in this ecosystem. As cryptocurrencies involve sensitive financial data and transactions, so I think it's important to ensure the safety and privacy of users.Given that the cryptocurrency ecosystem is constantly evolving, new threats and vulnerabilities are frequently discovered. A dedicated board would be a great way for the community to stay informed about the latest developments and threats in the field, and would provide focused discussions and resources on topics such as preventing hacking and fraud, safely storing assets, and could lead to better security practices overall. I fully support this idea.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BenCodie",
      "created_time": "January 15, 2023, 05:57:26 AMLast edit: January 15, 2023, 06:19:01 AM by BenCodie",
      "body": "Quote from: geeyow on January 14, 2023, 03:13:28 AMThe only logical place to put it is within OtherOther -> Cybersecurity & Privacybest to put it besides Beginner & Help.Topics like:Hacking incidents or tutorials on how to prevent themNews about potential wallet exploits and bugs (BTC or Altcoin)Tutorials about anonymityYes. I agree: Quote from: BenCodie on January 13, 2023, 11:45:36 AMEconomy is good. I suggested under \"Other\" with the additional label of privacy to go along with it. \"Cybersecurity and Privacy\". I think that this is definitely the best fit.Meanwhile, I am compiling more internal and external precedent, and seeking to expand on another users' post which includes existing threads that would fit into the forum. For now, I've updated the OP with our progress. I think that Cybersecurity and Privacy under the Other board is the winner for the board's location.Details added:QuoteName: Cybersecurity and PrivacyCategory: OtherDescription: Discussion about cybersecurity and online privacy and its improvement to minimize the risk of data breaches, hacks, tracking or system compromise which may result in exploitation or loss of funds.Reasons:- Discussion that will help to prevent personal system compromise which can result in the loss of Bitcoins- Improving online privacy and tracking, which is in line with a core value of Bitcoin, privacy.- Informing users on the downfalls of existing popular systems and exploring/informing about stronger alternatives- Preventing malicious activity by growing informative and other resources that can improve personal security and online privacy.- Keep record of events that are a result of poor cybersecurity and privacy to raise the awareness of its importance.& much more.I also just added a poll to the thread, since we have ironed out some more details.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "julerz12",
      "created_time": "January 15, 2023, 06:01:55 PM",
      "body": "Voted Yes, not only because I'm one of those idiots who got hacked, but also because it is beneficial to see all security and privacy-related threads put in one place, into one board, rather than scattered all over the forum. Easier for everyone to gather information. I also like the idea of placing it on Other. That way, it's much easier to notice than placing it as a sub-board of Wallet software. Other is like the middle-ground between Bitcoin-related topics and Altcoin-related topics. Users will be able to discuss security and privacy-related topics for both Bitcoin and the rest of all the Altcoins on it; placing it there just makes sense.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}