{
  "id": "topic_5420592",
  "title": "Sarah Azhari",
  "author": "Sarah Azhari",
  "created_time": "November 12, 2022, 12:02:56 AMLast edit: November 12, 2022, 03:17:28 AM by Sarah Azhari",
  "content": "That quote \"Not your key not your coins\" I just know work from today when looking how difficult to withdraw our money if we don't have the private key and seed. As I know, this is not the first time the exchange or other platform hold customer money in their pocket. it's obvious de facto, it's our money but they can't give to us. So my friend or the community, for this incident I hope you don't keep your money on exchange again, trust me!. this thing keeps repeating many time, we have to worry if happen in small exchange, but this very big exchange. So, are you sure in the next not happen in Binance, kraken, crypto.com, coinbase, and etc.?, I don't believe is not happen again on big exchange, because this already happened, believe me the big waves will come be much biggerI am very grateful to save my small money to wallet where I have the key. I don't worry, I sleep well and have sweet dreams.There are already wallets where you can keep the private key with free and open source, I don't know why they don't think that. I don't know why they believe the exchange than himself?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5420592",
  "comments": [
    {
      "author": "Charles-Tim",
      "created_time": "November 12, 2022, 12:08:53 AM",
      "body": "Quote from: Sarah Azhari on November 12, 2022, 12:02:56 AMThere are already wallets where you can keep the private key with free and open source, I don't know why they don't think that. I don't know why they believe the exchange than himself?The reason some people leave their coins on exchanges is because they are ignorant. Some people do not know the differences, all they know is that they want to buy and hold some bitcoin or any other crypto. Some people will even tell you that Binance is a wallet.My advice is that if the amount to hold is large, cold storage is better (because it is secure and safer) than hot wallet that can be hacked. If cold storage wallet can not be created by newbies, they can get a hardware wallet that is open source.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GreatArkansas",
      "created_time": "November 12, 2022, 12:15:41 AM",
      "body": "Quote from: Sarah Azhari on November 12, 2022, 12:02:56 AM(.....)There are already wallets where you can keep the private key with free and open source, I don't know why they don't think that. I don't know why they believe the exchange than himself?Because some people, don't really know why having a non-custodial wallet is very important. Having your Bitcoins in a wallet to which you got only access is lifechanging and it will help you to be safe with all these issues right now especially centralized exchanges. Some also, want easy access to their funds because we all know exchange only got email addresses and passwords.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Solosanz",
      "created_time": "November 12, 2022, 12:24:22 AM",
      "body": "Who on earth would leave their coins inside the exchange? it must be a dumb people since they're very careless and doesn't want to understand to secure their coins. When I was still new about Bitcoin and I read someone post about Mt.Gox hacked, I never believe anymore with centralized exchange.Quote from: Sarah Azhari on November 12, 2022, 12:02:56 AMThere are already wallets where you can keep the private key with free and open source, I don't know why they don't think that.It's still not enough because if your phone are connected with internet and there's a malware inside your device, your wallet could be compromised. The best is just bought a open source hardware wallet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitcoinBarrel",
      "created_time": "November 12, 2022, 12:29:24 AM",
      "body": "After Mt Gox you'd think people would learn. I have a friend that has all his crypto on an exchange wallet. I have been telling him for over a year to take them off. I even offered to help him free of charge. He just doesn't care or think that anything bad could happen. This same person I told to sell at the top $60k and he was hypnotized by YouTube pump and dumpers that Bitcoin was going to hit $100k+ by the end of 2021.Thank God he listened to me about XRP. He was ALL In on XRP, and finally came to and exchanged for BTC. He's still down 90%+ net worth but newbs will be newbs.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OgNasty",
      "created_time": "November 12, 2022, 12:32:37 AM",
      "body": "Quote from: Sarah Azhari on November 12, 2022, 12:02:56 AMThat quote \"Not your key not your coins\" I just know work from today when looking how difficult to withdraw our money if we don't have the private key and seed. As I know, this is not the first time the exchange or other platform hold customer money in their pocket. it's obvious de facto, it's our money but they can't give to us. So my friend or the community, for this incident I hope you don't keep your money on exchange again, trust me!. this thing keeps repeating many time, we have to worry if happen in small exchange, but this very big exchange. So, are you sure in the next not happen in Binance, kraken, crypto.com, coinbase, and etc.?, I don't believe is not happen again on big exchange, because this already happened, believe me the big waves will come be much biggerI am very grateful to save my small money to wallet where I have the key. I don't worry, I sleep well and have sweet dreams.There are already wallets where you can keep the private key with free and open source, I don't know why they don't think that. I don't know why they believe the exchange than himself?It is definitely said for a reason and not just to be cute.  Plenty of services have gone down over the years costing their users everything.  Especially in times like now, it's extremely important to take custody of your coins and keep them in cold storage where they will not be at risk.  Everyone should be taking this opportunity to do a 'bank run' on these exchanges and make them prove their reserves.  Don't be the guy who is lazy and helps contribute to them being able to continue running rampant with our funds.  Withdraw everything.  Wait a month, then put it back if you feel you must.  It is extremely important that you do not do nothing and then complain later if you are never able to see your funds again.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "1miau",
      "created_time": "November 12, 2022, 12:52:07 AM",
      "body": "Quote from: Charles-Tim on November 12, 2022, 12:08:53 AMQuote from: Sarah Azhari on November 12, 2022, 12:02:56 AMThere are already wallets where you can keep the private key with free and open source, I don't know why they don't think that. I don't know why they believe the exchange than himself?The reason some people leave their coins on exchanges is because they are ignorant. I would also blame laziness. In my opinion, quite a lot of people have somewhen heard about hacks / fails of centralized exchanges and are well aware that such issues are possible in general. But when it comes to moving these coins out of the exchange, some people are just lazy and keep their coins stored on the exchange, for whatever questionable reason such like keeping them there for a possible trade (not recommended) or whatever reason. Most often it's just laziness. When recommending to transfer all coins to cold storage, such people might say \"It won't happen to me\", \"It's a big exchange\", \"Exchanges have become safer now\" etc.Sure, until it happens...And when it happens such people are being butthurt...  But you are right of course, quite a lot of them are also extremely uneducated, like referring to Blockchain.com as Bitcoin operator (explaining that Bitcoin would be stored in the Blockchain(.com).  )",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DapanasFruit",
      "created_time": "November 12, 2022, 01:27:55 AM",
      "body": "This big lesson resonates well right now with the collapse of FTX where we are seeing how SBF and his gang mismanaged the assets entrusted to him from unsuspecting and trusting customers, investors and token holders. However, one big reason why many people still are holding their digital assets in centralized exchanges is that of convenience as there is no need to transfer the assert into another platform just in case one will decide to let go of them. This is quite true with me but assets I left in exchanges are not that enormous though I will still cry in case I can lost them. And people are still giving their confidence to big names in the industry notably Binance, Kucoin, Coinbase and some other players.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "livingfree",
      "created_time": "November 12, 2022, 02:30:56 AM",
      "body": "Quote from: Sarah Azhari on November 12, 2022, 12:02:56 AMI don't know why they believe the exchange than himself?It's because of the number of users that they have. That's already enough to them as a standard to trust them with their funds, it's sad to see that those that don't have in depth knowledge about keys and wallets are not keen in learning more about it.They're just letting the exchange do the thing that they must do and that's to keep their money. It's not going to hurt them a lot of time to learn how to keep it to themselves and learn the basics of keeping the private keys on their own.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "vv181",
      "created_time": "November 12, 2022, 02:32:51 AM",
      "body": "Quote from: Sarah Azhari on November 12, 2022, 12:02:56 AMThere are already wallets where you can keep the private key with free and open source, I don't know why they don't think that. I don't know why they believe the exchange than himself?There is various reason why people would do so, apart from laziness and ignorance as above already mentioned. Mainstream's motivation into cryptocurrencies mainly resonated from its investment opportunity. A varies backgrounds of people, and we did not know their own digital literacy. We can agree that keeping a fund on an exchange is way more convenient rather than comprehending and implementing how to securely store a coin in a wallet. With that in mind, people should be directed into comprehending the essence of self-custody, if people get the reasoning behind it, they should have would take a deeper look to learning how to manage their own cryptocurrencies.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Iranus",
      "created_time": "November 12, 2022, 03:21:57 AM",
      "body": "Quote from: Charles-Tim on November 12, 2022, 12:08:53 AMQuote from: Sarah Azhari on November 12, 2022, 12:02:56 AMThere are already wallets where you can keep the private key with free and open source, I don't know why they don't think that. I don't know why they believe the exchange than himself?The reason some people leave their coins on exchanges is because they are ignorant. Some people do not know the differences, all they know is that they want to buy and hold some bitcoin or any other crypto. Some people will even tell you that Binance is a wallet.That's not the reason, there are different reasons, my friends also lost a lot of money from the FTX crash, they are merchants, buying and selling, exchanging P2P on FTX. All are aware that leaving money on FTX or binance is like depositing money in a bank, risk is always lurking, but their job, their profit is from there, so they have to accept the risk and continue to work. Many accounts hold millions of dollars and they have been around long enough in the market and are well aware that storing assets on exchanges is different from storing on cold wallets.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kemarit",
      "created_time": "November 12, 2022, 04:28:37 AM",
      "body": "Quote from: Iranus on November 12, 2022, 03:21:57 AMQuote from: Charles-Tim on November 12, 2022, 12:08:53 AMQuote from: Sarah Azhari on November 12, 2022, 12:02:56 AMThere are already wallets where you can keep the private key with free and open source, I don't know why they don't think that. I don't know why they believe the exchange than himself?The reason some people leave their coins on exchanges is because they are ignorant. Some people do not know the differences, all they know is that they want to buy and hold some bitcoin or any other crypto. Some people will even tell you that Binance is a wallet.That's not the reason, there are different reasons, my friends also lost a lot of money from the FTX crash, they are merchants, buying and selling, exchanging P2P on FTX. All are aware that leaving money on FTX or binance is like depositing money in a bank, risk is always lurking, but their job, their profit is from there, so they have to accept the risk and continue to work. I would agree on the P2P exchange scenario, if I'm not mistaken, they have to like put $1000 as collateral when they do P2P trading. And so with the collapse, their capital + their collateral is gone. And so that is the risk that businesses has to take.It's really unexpected though, no one really knows that this will happen and I will say majority has been caught off guard resulting to them not withdrawing their money on that exchange on time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DevilSlayer",
      "created_time": "November 12, 2022, 04:38:14 AM",
      "body": "Quote from: Charles-Tim on November 12, 2022, 12:08:53 AMQuote from: Sarah Azhari on November 12, 2022, 12:02:56 AMThere are already wallets where you can keep the private key with free and open source, I don't know why they don't think that. I don't know why they believe the exchange than himself?The reason some people leave their coins on exchanges is because they are ignorant. Some people do not know the differences, all they know is that they want to buy and hold some bitcoin or any other crypto. Some people will even tell you that Binance is a wallet.My advice is that if the amount to hold is large, cold storage is better (because it is secure and safer) than hot wallet that can be hacked. If cold storage wallet can not be created by newbies, they can get a hardware wallet that is open source.Cold storage is not just \"better\" it is the best when it comes to safety and security. I also notice a lot of people feeling secured whenever they hold large amount of money in a crypto exchange without knowing that it is still vulnerable into some advanced hackers. If we want to control the risk where we can be secured and have feeling of safety in our funds, ten the best way is to buy cold storage. We should learn from what's happening today and from the past for us to have a bettter future.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "notocactus",
      "created_time": "November 12, 2022, 04:59:35 AM",
      "body": "Quote from: Sarah Azhari on November 12, 2022, 12:02:56 AMThat quote \"Not your key not your coins\" I just know work from today when looking how difficult to withdraw our money if we don't have the private key and seed. It is very important and even vital. The Security Checklist can help newbies with more advice.In addition, to choose wallets, let's choose non-custodial ones and better if it is open source.Recommended walletsQuoteWallet Basics:Do not use wallets that don't give you recovery data; these wallets are likely controlling your keys.Do not use paper wallets unless you're an advanced user who understands all the risks.Do not store large amounts of value in single signature wallets.Make sure your heirs know how to recover your wallets without you!QuoteAs I know, this is not the first time the exchange or other platform hold customer money in their pocket. it's obvious de facto, it's our money but they can't give to us.Exchanges can have some endingsHacks and unable to compensate usersBad management to over-degen risk taking (like FTX)BankruptedScam exitStill operating but reject to approve your withdrawal, reject your KYC etc.Exchange graveyard",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "worle1bm",
      "created_time": "November 12, 2022, 05:54:58 AM",
      "body": "It's the harsh truth which people need to realise that if someone else is in possession of your funds the possibility of you losing your funds is very high and this happened with FTX this time another one of those exchanges.People were unable to withdraw funds and now even if they will be able to get it would be penny of what they were holding few days back.So this is one more example of why we should avoid having funds over these exchanges that can put you so much down within days.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EarnOnVictor",
      "created_time": "November 12, 2022, 06:32:08 AM",
      "body": "No one should be surprised about the inability of exchanges to give withdrawals at lousy times, it's pure business and a measure they must put in place to avoid panic withdrawals. And yes, our money might not be our own when it is with exchanges, they want to be like banks and financial institutions, but they are too small for that. It is our money that sustains them.Panic withdrawal could cause any exchange to go bankrupt easily, and perhaps if they have allowed all withdrawals at this moment, there might not be exchanges anymore. This is because they don't have sufficient liquidity to back things up, so what do you expect? I can assure you that FTX would be long gone by now if they did not apply this measure in recent times.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lovesmayfamilis",
      "created_time": "November 12, 2022, 06:50:03 AM",
      "body": "How many people draw the right conclusions after we sometimes hear about bankruptcy or revocation of licenses from some banks? What do they do next? They go to other banks. I think the same will happen after the FTX bankruptcy. I don't understand why there is so much trust in centralization when the idea of bitcoin is completely different. People are lazy and greedy, and for some reason, many people have a strong belief that all bad stories will never touch them. The impression that some people live in parallel worlds and do not see obvious things. People need experience to sober up.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Doan9269",
      "created_time": "November 12, 2022, 07:35:46 AM",
      "body": "I just pity those already stucked in the current hack on FTX because it is too late already to make any decisions now and many have been warned already on several occasions to stay off centralized exchanges but due to indecision they remains there forgetting the risk it may place on them at any time, only the newbies that were not aware of the risk or earlier informed were those i consider to fall a victim because they just don't know, but it keep bothering me seing that bitcoin is meant for decentralized network but many don't know how to avoid being centralized with bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "notocactus",
      "created_time": "November 12, 2022, 09:22:38 AM",
      "body": "Quote from: EarnOnVictor on November 12, 2022, 06:32:08 AMNo one should be surprised about the inability of exchanges to give withdrawals at lousy timesThe case of FTX exchange recent days is a good example for bankrun in cryptocurrency market past few years.QuoteA bank run occurs when large groups of depositors withdraw their money from banks simultaneously based on fears that the institution will become insolvent.With more people withdrawing money, banks will use up their cash reserves and ultimately end up defaulting.In other words, it is a run to exit a bank when there is only one exit gate but there are too many people which overwhelm ability of that bank to proceed withdrawal request.Quoteit's pure business and a measure they must put in place to avoid panic withdrawals. And yes, our money might not be our own when it is with exchanges, they want to be like banks and financial institutions, but they are too small for that. It is our money that sustains them.Panic withdrawal could cause any exchange to go bankrupt easily, and perhaps if they have allowed all withdrawals at this moment, there might not be exchanges anymore. This is because they don't have sufficient liquidity to back things up, so what do you expect? When a bankrun happens, it is too late to stop that or to reverse the panic trend. After a death spiral starts, it is impossible to stop it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zilon",
      "created_time": "November 12, 2022, 09:55:42 AM",
      "body": "No exchange is above bankruptcy but CEXs cannot be avoided completely. Not everyone who got affected by FTX collapse are holders some might have moved their coin there for a possible swap and others for quick sell to fiat but ran out of luck. If they was a way to sell direct to cash in DEXs i think CEXs manipulations would have been a long forgotten story. Avoiding this exchanges would have been much more easier if there were better options because not everyone is conversant with Bitcoin has legal tender so many still see it as an asset because of its volatility and how about the aged in underdeveloped countries who sell in local markets how do they get paid in BTC so one will always have to swap to fiat to fit into the society the belong.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}