{
  "id": "topic_5440692",
  "title": "Blisszi",
  "author": "Blisszi",
  "created_time": "February 21, 2023, 01:38:53 PM",
  "content": "The recent earthquakes in Turkey was pathetic and sorrowful, many loss their lives. The government of the country visited many victims area with the President; Tayyip Erdogan and others visitors who came to witness the tragedies and destruction of the earth properties. Life circumstances has no calendars, it happens everywhere and is really tempted sometimes to question the nature. Why is things the way they are? Why do people who are good to us perished like grasses? What's the hope not die young?But is understandable nature can not gives us answers, I sincerely sympathies with the country's losses.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5440692",
  "comments": [
    {
      "author": "348Judah",
      "created_time": "February 21, 2023, 02:57:05 PM",
      "body": "Earthquake is a natural disaster we are left with no option than to face it consequences whenever it occurs, those affected never expected it coming, though it has been experienced on several occasions in the same region and people were still found living within this locations as well, it is unpredictable and people cannot overreacted to this because it's natural phenomenal, we all need to join others in praying for the affected families and quick restoration to all the victims all over the country.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BADecker",
      "created_time": "February 21, 2023, 04:37:42 PM",
      "body": "I'm curious. Since the damage was as widespread as it was, are the authorities having any problem stopping thieves who are stealing goods out of the rubble? Or are the authorities, themselves, moving in organized fashion to do the stealing?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "decodx",
      "created_time": "February 21, 2023, 04:59:42 PM",
      "body": "I think that the figure you provided was based on outdated information, and as a result, it greatly underestimated the true scale of the situation, unfortunately. Based on the latest sources from the Turkish disaster management agency, it is reported that the official death toll in Turkey has exceeded 42,000. This is a tragic and concerning situation, and I hope that the necessary aid and support can be provided to those affected by the recent disasters.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yhiaali3",
      "created_time": "February 21, 2023, 08:11:38 PM",
      "body": "Yes, it is not possible to face the wrath of nature. These are matters beyond the power of man, in the hands of God alone.The problem is that the aftershocks have not ended yet. We live near Turkey, we feel the big tremors, and we flee outside the homes. But in the earthquake centers, many disasters occurred and many homes were destroyed. There are thousands of victims and missing persons, and the rubble is still being removed until now.The humanitarian situation is already difficult and the governments of the world are providing humanitarian aid, but not all of it reaches the affected people in a timely manner.Worst of all, there are scientists who predict the occurrence of earthquakes with great destructive power during the coming period. This causes terror among people until now, and they flee from their homes when they feel the slightest tremor.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EFS",
      "created_time": "February 22, 2023, 02:08:14 AM",
      "body": "There were a lot of threads about this earthquake already.According to official figures, the death toll is currently 42310. However the actual number is unfortunately much higher. Those who haven't yet been recovered from the rubble, those who cannot be identified and the disappearances etc. reasons this figure doesn't reflect reality. I wish there were fewer deaths, but this number increased due to improper construction, insufficient control mechanisms, contractors stealing materials, ineffective post-disaster organization and bad weather conditions etc. There was a great earthquake 24 years ago too, unfortunately we saw that lessons still weren't learned from mistakes after all these years.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kro55",
      "created_time": "February 22, 2023, 05:59:57 AM",
      "body": "Quote from: EFS on February 22, 2023, 02:08:14 AMThere were a lot of threads about this earthquake already.According to official figures, the death toll is currently 42310. However the actual number is unfortunately much higher. Those who haven't yet been recovered from the rubble, those who cannot be identified and the disappearances etc. reasons this figure doesn't reflect reality. I wish there were fewer deaths, but this number increased due to improper construction, insufficient control mechanisms, contractors stealing materials, ineffective post-disaster organization and bad weather conditions etc. There was a great earthquake 24 years ago too, unfortunately we saw that lessons still weren't learned from mistakes after all these years.Don't try to blame the contractor or the organization after the disaster. Earthquakes and floods are the wrath of mother nature that is caused by none other than us humans. We destroy, exploit mineral resources indiscriminately, destroy the atmosphere ... all just to serve the needs of people, including you and me. We should all have some responsibility for that, not just blame others. I believe these things will happen more and more because with the current rate of destruction of nature, it is inevitable.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Car22",
      "created_time": "February 22, 2023, 06:08:09 AM",
      "body": "Twenty five of thousands of people have been killed and scores more injured by a huge earthquake which struck south-eastern Turkey, near the Syrian border in the early hours of Monday morning. The earthquake which hit near the town of Gaziantep.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EFS",
      "created_time": "February 22, 2023, 02:53:18 PM",
      "body": "Quote from: kro55 on February 22, 2023, 05:59:57 AMDon't try to blame the contractor or the organization after the disaster. Earthquakes and floods are the wrath of mother nature that is caused by none other than us humans. We destroy, exploit mineral resources indiscriminately, destroy the atmosphere ... all just to serve the needs of people, including you and me. We should all have some responsibility for that, not just blame others. I believe these things will happen more and more because with the current rate of destruction of nature, it is inevitable.Nah, I don't buy that we all have responsible for the disaster bs. I believe in science and scientists. Those in authority didn't listen to them for all these years.I didn't build the building on unsuitable land. I didn't build a city on the fault line. I didn't allow high-rise buildings. I didn't inspect the buildings. I didn't vote for those who should have done these things but didn't. I don't have any responsibility. It's not right to put the blame on nature. I'm not the one who doesn't let the military help after the disaster in first two days. It's not me who can't coordinate search and rescue work properly. I'm not the one who didn't plan the earthquake assembly areas correctly. I'm not the one who can't organize the distribution of aid and tent. None of those responsible for them resigned and that's the worst part.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kavelj22",
      "created_time": "February 22, 2023, 06:57:43 PM",
      "body": "Quote from: Blisszi on February 21, 2023, 01:38:53 PMLife circumstances has no calendars, it happens everywhere and is really tempted sometimes to question the nature. Why is things the way they are? Why do people who are good to us perished like grasses? What's the hope not die young?But is understandable nature can not gives us answers, I sincerely sympathies with the country's losses.The problem with the Turkish-Syrian example is the nature of the environmental disaster itself. Unfortunately, the scientific community and the entire history of science cannot deal with earthquakes as required. All seismic stations cannot detect an earthquake (no matter how strong) until a very short time before it occurs, which does not allow adequate precautions to be taken in terms of warning and evacuation operations. In addition, it is almost impossible to monitor aftershocks, their location and degree of strength. Almost science can deal with various natural disasters except earthquakes, including volcanoes and hurricanes.In addition to all this, there is a more dangerous element, which is that construction and building operations are not subject to standards commensurate with the geographical nature of the region. Today, we can construct earthquake-resistant buildings, but it does not seem that this was happening in both Turkey and Syria, although all research indicates that they are an active earthquake zone.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DeathAngel",
      "created_time": "February 22, 2023, 09:30:13 PM",
      "body": "All we can do is pray for those who are injured or have lost people thar they love. It’s such a tragic event with so many lives lost, young & old. Nature doesn’t discriminate, natural disasters mostly can not be avoided, there is nothing that can be done to stop such devastating forces.I just hope the people who have had their homes & lives destroyed get all the food, water, shelter & support that they need.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EFS",
      "created_time": "February 22, 2023, 10:18:07 PM",
      "body": "Quote from: DeathAngel on February 22, 2023, 09:30:13 PMNature doesn’t discriminate, natural disasters mostly can not be avoided, there is nothing that can be done to stop such devastating forces.I disagree with that. First of all, you need to take your precautions. It's a known fact that Türkiye is an earthquake zone. When establishing cities it's necessary to plan according to that. Zoning permits shouldn't be given to agricultural lands and soft soils. Not everyone can be a contractor, they must have various certifications. The building inspection needs to be done properly. Central and local government units should make the necessary inspections, not just on paper, they really have to check buildings.There is so much to do. If there are deaths after doing these, no one will say anything about it. But it wouldn't be right to call it just a \"natural disaster\" without taking necessary precautions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Coin63$",
      "created_time": "February 24, 2023, 08:21:06 AM",
      "body": "Earthquake is a natural disaster. Natural disasters are God-given and there is nothing anyone can do about it. The sudden release of the energy stored in the ground to crush the rocks causes the earth's surface to shake for a moment and some parts of the earth's crust to move. is created, it is manifested through earthquakes. Earthquakes usually last from a few seconds to a few minutes. The earthquake that occurred in Turkey was a 7.8 magnitude earthquake which was very strong. Many people have already died due to this earthquake and even the country has suffered a lot of damage. In order to help the people of that country, relief organizations from different countries of the world have moved to that country with reliefs.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Maestro75",
      "created_time": "February 24, 2023, 08:58:42 AM",
      "body": "Quote from: Blisszi on February 21, 2023, 01:38:53 PMLife circumstances has no calendars, it happens everywhere and is really tempted sometimes to question the nature. Why is things the way they are? Why do people who are good to us perished like grasses? What's the hope not die young?But is understandable nature can not gives us answers, I sincerely sympathies with the country's losses.My sympathy is to the people of Turkey. The number of deaths recorded in that disaster is terrible for something those people did not bargain or brought upon themselves. Countries that do not experience earthquakes do not know what it means to have them. You go to sleep with fear and not knowing what day the building you are staying in will sink. It is a terrible way to die, suffering under severe pain with blocks and irons pressing one to death. We in Africa do not have such natural disaster apart from flooding which is most times man made disaster because of environmental negligence and pollution. Earthquake is a terrible thing to witness.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rockson1",
      "created_time": "February 24, 2023, 10:19:48 AM",
      "body": "A devastating earthquake is a natural disasters where many people lost there life and render people homeless because it has no signe or signal information technology about earthquake disaster it comes with so many devastating situation such as lack of water,lack of food, lack of health care,people fine it difficult to survive this situation in many nations, fire out brake, collapse building, etc  the situation of natural disaster is very hard to deal with in the society an the global world I believe WHO will come to this affected country aid and render them help.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BADecker",
      "created_time": "February 24, 2023, 05:19:42 PM",
      "body": "Quote from: Rockson1 on February 24, 2023, 10:19:48 AMA devastating earthquake is a natural disasters where many people lost there life and render people homeless because it has no signe or signal information technology about earthquake disaster it comes with so many devastating situation such as lack of water,lack of food, lack of health care,people fine it difficult to survive this situation in many nations, fire out brake, collapse building, etc  the situation of natural disaster is very hard to deal with in the society an the global world I believe WHO will come to this affected country aid and render them help.Remember, the WHO promoted and still promotes using the mRNA vaccine for covid. This vaccine is killing more people than covid could ever think of doing. I don't know that I would want the WHO in my life for anything. They might wind up being worse than the earthquake.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fiatless",
      "created_time": "February 25, 2023, 05:44:55 AM",
      "body": "Quote from: Blisszi on February 21, 2023, 01:38:53 PMThe recent earthquakes in Turkey was pathetic and sorrowful, many loss their lives. The government of the country visited many victims area with the President; Tayyip Erdogan and others visitors who came to witness the tragedies and destruction of the earth properties. Life circumstances has no calendars, it happens everywhere and is really tempted sometimes to question the nature. Why is things the way they are? Why do people who are good to us perished like grasses? What's the hope not die young?But is understandable nature can not gives us answers, I sincerely sympathies with the country's losses.Watching this sorrowful event is very pathetic. Turkey and Syria would not be able to recover from this natural disaster. Many families have been thrown into mourning and life will never remain the same. Many children have become orphans while some are now childless, widows, and widowers. Natural disasters are unpredictable but we must ensure that certain preventive measure is put in place. Everyone knows that some parts of Turkey are prone to earthquakes but I read that most building developwrs failed to erect standard buildings based on required standards. They are mostly driven by profit and careless about the safety of the people. The lands in these disaster-prone areas are cheap, so they quickly buy these lands and erect high rising building In a place that needs low and strong building.Most people died because of poor responses from the disaster management agencies of Turkey. They don't have the right modern equipment to carry out such rescue missions. This led to the use of crude implements that are less effective. The town planning is also faulty. Considering the disaster-prone nature of the area, there should have been proper planning for these uncertainties.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "montaga",
      "created_time": "February 25, 2023, 06:20:29 AM",
      "body": "Would you stand here?https://twitter.com/i/status/1629269951860162561When a section breaks away and you have to deal with natural law.https://www.youtube.com/watch?v=lwDyrespV7s",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Swordsoffreedom",
      "created_time": "February 25, 2023, 08:47:14 AM",
      "body": "Quote from: BADecker on February 24, 2023, 05:19:42 PMQuote from: Rockson1 on February 24, 2023, 10:19:48 AMA devastating earthquake is a natural disasters where many people lost there life and render people homeless because it has no signe or signal information technology about earthquake disaster it comes with so many devastating situation such as lack of water,lack of food, lack of health care,people fine it difficult to survive this situation in many nations, fire out brake, collapse building, etc  the situation of natural disaster is very hard to deal with in the society an the global world I believe WHO will come to this affected country aid and render them help.Remember, the WHO promoted and still promotes using the mRNA vaccine for covid. This vaccine is killing more people than covid could ever think of doing. I don't know that I would want the WHO in my life for anything. They might wind up being worse than the earthquake.I can agree with this, vaccines cause more serious diseases than the covid virus. My wife had 3 shots during covid, and she is now pregnant with my 2nd child. Unfortunately, my child was born with a congenital heart defect, at first I thought it was because I was unlucky. But then many similar cases happened to other couples, even worse than us. It's all because of the vaccine that causes this. Don't expect any help from those stupid organizations.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JamesBorn",
      "created_time": "February 25, 2023, 01:22:10 PM",
      "body": "Quote from: Blisszi on February 21, 2023, 01:38:53 PMThe recent earthquakes in Turkey was pathetic and sorrowful, many loss their lives. The government of the country visited many victims area with the President; Tayyip Erdogan and others visitors who came to witness the tragedies and destruction of the earth properties. Life circumstances has no calendars, it happens everywhere and is really tempted sometimes to question the nature. Why is things the way they are? Why do people who are good to us perished like grasses? What's the hope not die young?But is understandable nature can not gives us answers, I sincerely sympathies with the country's losses.This things are natural disasters which could sometimes happen as a result of excess human labour. Earth has occur in different regions, China, Mediterranean Guinea, Morocco, Indonesia and many more, it occurs time to time but is not really good omen to hear such stories of damage lives and properties. Is a sad one for Turkey",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}