{
  "id": "topic_5432095",
  "title": "Jason Brendon",
  "author": "Jason Brendon",
  "created_time": "December 28, 2022, 03:21:29 AM",
  "content": "We don't know everything, right? There is always something, knowledge, or hacks in life that you don't know about.Let's say you wake up in the morning only to find out your wallet has been emptied. Your savings are all gone. But you were following all the security practices you can possibly can, like generate everything offline, good entropy, not using brain wallet and so on and so forth. But your funds are gone.What will you do with it?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5432095",
  "comments": [
    {
      "author": "jackg",
      "created_time": "December 28, 2022, 03:50:58 AM",
      "body": "A lot of attackers/hackers, especially notorious ones, seem to be found at some point so that might be one way you could go about recovering your funds - by waiting. I think the obvious start would be to search up your wallet to see if the same thing has happend to other users, potentially report it to the police/online to flag the issue and see if there's anyone that can work out why that happened (and take advice from that). I think a lot of people, me included, would just move on from something like that and start to rebuild again (buy stocks instead to be safer or store your funds in multiple locations or with a multisig).I think the answer changes a lot based on how the funds were taken though too if that got discovered.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "December 28, 2022, 05:47:49 AM",
      "body": "I'm so careful with my opsec that I really doubt I could even get hacked without doing something immensely stupid/careless. The only culprit that I could think of is if someone went to my secret storage place and actually found my seed backup.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Upgrade00",
      "created_time": "December 28, 2022, 05:59:20 AM",
      "body": "Quote from: Jason Brendon on December 28, 2022, 03:21:29 AMBut you were following all the security practices you can possibly can, like generate everything offline, good entropy, not using brain wallet and so on and so forth. If you follow all security practices when using Bitcoin, which are a lot, the possibility of getting hacked is almost non existence.If you're holding a centralized asset on a centralized wallet or exchange, then you can be hacks without you having to do anything.But on a decentralized protocol like Bitcoin, stored on a non custodian wallet softwarr or hardware and backs up securely, you can sleep easy knowing your funds are safe.Quote from: Jason Brendon on December 28, 2022, 03:21:29 AMWe don't know everything, right?That's why we're constantly trying to learn.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "witcher_sense",
      "created_time": "December 28, 2022, 06:24:03 AM",
      "body": "Quote from: Jason Brendon on December 28, 2022, 03:21:29 AMWe don't know everything, right? There is always something, knowledge, or hacks in life that you don't know about.Let's say you wake up in the morning only to find out your wallet has been emptied. Your savings are all gone. But you were following all the security practices you can possibly can, like generate everything offline, good entropy, not using brain wallet and so on and so forth. But your funds are gone.What will you do with it?I have no idea what would I do if a situation similar to what you described happened to me, but I think that my first reaction would be tearing my hair out and running from corner to corner like a crazy person. But a situation like that may happen to everyone, even with those who practice good opsec because one day a critical vulnerability may be found that will allow hackers to empty all wallets, including ones created on an air-gapped computer with good random number generators. Hopefully, the open-source and decentralized nature of bitcoin development will enable developers, contributors, and reviewers to catch such bugs very early and take all necessary steps to minimize the harm.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "December 28, 2022, 09:11:19 AM",
      "body": "Quote from: Jason Brendon on December 28, 2022, 03:21:29 AMWhat will you do with it?Same thing that if I woke up some day and saw in the news that there is an incoming meteor on the trajectory to earth to cause an extinction level event. I'd get on with my life",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Solosanz",
      "created_time": "December 28, 2022, 09:26:02 AM",
      "body": "Because reality isn't always same with our expectation.You can't prevent anything happen in this world even though you've follow all of the prevention steps, there's always a risk even it's 0.000001%. Although there's still a chance, but it doesn't mean you need to be stupid like invest in newly created project and leave your coins on centralized exchange, you just increase the chance of losing money to above 50%!.It's similar like people who think they didn't need to school to become a smart person since Albert Einstein get kicked out from school.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "December 28, 2022, 11:05:02 AM",
      "body": "Quote from: Jason Brendon on December 28, 2022, 03:21:29 AMLet's say you wake up in the morning only to find out your wallet has been emptied. Your savings are all gone. This is something that can always happen and anyone who has any idea how Bitcoin works knows that you can never be 100% safe. Therefore, if we accept that something like that can happen, we will be able to cope more easily if it actually happens.We all start from the assumption that we have taken all possible measures to protect ourselves at the given moment, as well as that there will be no unforeseen attack on Bitcoin that no one could have predicted. Bitcoin comes with the risk of everyone being their own bank, and it's a safe bet that not all people are ready for that.There is something more valuable than money, so you should not consider such situations as the end of the world.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dave1",
      "created_time": "December 28, 2022, 11:27:57 AM",
      "body": "Quote from: Jason Brendon on December 28, 2022, 03:21:29 AMWe don't know everything, right? There is always something, knowledge, or hacks in life that you don't know about.Let's say you wake up in the morning only to find out your wallet has been emptied. Your savings are all gone. But you were following all the security practices you can possibly can, like generate everything offline, good entropy, not using brain wallet and so on and so forth. But your funds are gone.What will you do with it?I guess if that is the case then you can't do anything as we all know that once your crypto is gone, it's very hard to get it back because that's how it is design in the first place. You can call it wrong, but you have to accept that fact.And so if you really have huge amount of bitcoin, maybe a hardware wallet or a airgap pc as your safe place to store it.And if you are following all the security practices, then the only thing I can think of is that it could be a inside job, someone close to you might have gotten it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bittraffic",
      "created_time": "December 28, 2022, 12:30:29 PM",
      "body": "That's why we need to be very careful with our seed because even if we discover who the hacker is, there is less chance of getting it back. Exchanges got hacked never got the coins back. It's really going to be a hard start all over again for someone who lost his rainy-day stash which is a reason for separating some coins in other wallets and hiding them in another place.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitbollo",
      "created_time": "December 28, 2022, 12:39:59 PM",
      "body": "Quote from: Jason Brendon on December 28, 2022, 03:21:29 AM...What will you do with it?Nothing. I would not do nothing since it will be irrilevant. Maybe try to understand why this happens and if there is any chance to recover / understand the issue. Of course this is a scenario really hard to be seen (probably impossible) since it's easier have a good security for cold storage just following some hints from security protocols like glacierprotocol.org",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nrcewker",
      "created_time": "December 28, 2022, 12:44:35 PM",
      "body": "Quote from: Jason Brendon on December 28, 2022, 03:21:29 AMWe don't know everything, right? There is always something, knowledge, or hacks in life that you don't know about.Let's say you wake up in the morning only to find out your wallet has been emptied. Your savings are all gone. But you were following all the security practices you can possibly can, like generate everything offline, good entropy, not using brain wallet and so on and so forth. But your funds are gone.What will you do with it?There are very less chances that something like this might happen. I mean if you are following all the security practices, then no one can steal your Bitcoins. If something happens to me, then at first I will check if I have sent it to someone by mistake or not. Moreover I would at first doubt my family members if they have by chance taken the coins for various reasons. If nothing works, then it will be a lesson for me, and I will instantly dig up why this happened and how to avoid being bankrupt like this in the future.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "December 28, 2022, 12:55:47 PM",
      "body": "Quote from: Jason Brendon on December 28, 2022, 03:21:29 AMBut your funds are gone.What will you do with it?What all people are going to do when they are in that situation in real life and not when they are reading a scenario on a forum?Panic, curse, panic, curse, retry all the wallets 100 times in the hope I have loaded the wrong one, check the balances 1000 times on block explorers, curse again, take antihypertensive medication, start inquiring all family members, panic more, and then accept it and slowly starting to admit what happened, and return to the normal life, probably easier than others since I don't drink and don't smoke so I can't find \"refuge\" in those or other \"alternatives\".That's one reason I don't hold all my life savings in one place, that's why I will never be full BTC no other saving in either deposits or treasury bonds or whatever, and why I don't plan on doing it and nobody should do either.Oh, and everyone saying they will be calm and analyzing this and blabla, common people, be real, you won't stay calm if all your money would be gone. Nobody would! Drop the poker face!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "notocactus",
      "created_time": "December 28, 2022, 01:17:04 PM",
      "body": "Three important rules of diversificationDon't store all your bitcoins in one walletDon't store all your bitcoins in one wallet from one wallet softwareDon't store all your wallet backups (of different wallets) at a single locationBlack swan events can occur any time but if you do good practice (security, privacy) and diversification (of choosing wallet softwares, storing bitcoins in different wallets and storing backups at different locations), you will have higher odds to be fine.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pandu Geddon",
      "created_time": "December 28, 2022, 01:27:15 PM",
      "body": "if we have done all the security, including storing assets in a wallet that is not connected to any online device. the first thing to do is interrogate your closest person. it could be our naughty wife or daughter, where are the chances that they know you keep all data backup from your wallet?when we have taken good care of our wallets. even though there is a small chance that mistakes will occur, all of course come because of our negligence.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kamvreto",
      "created_time": "December 28, 2022, 01:39:12 PM",
      "body": "Quote from: Pandu Geddon on December 28, 2022, 01:27:15 PMif we have done all the security, including storing assets in a wallet that is not connected to any online device. the first thing to do is interrogate your closest person. it could be our naughty wife or daughter, where are the chances that they know you keep all data backup from your wallet?when we have taken good care of our wallets. even though there is a small chance that mistakes will occur, all of course come because of our negligence.Negligence is a factor that can happen when we have implemented all security. Sometimes some of the negligence that we do not realize it.Save the seeds in the best place and offline and only your family knows, of course there will be no hacks unless a stranger knows where the storage is.The security protocol that has been applied to the bitcoin wallet used has of course been carried out as much as possible.Lost or lost funds must have a cause and effect, it is impossible if they just disappear.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "m2017",
      "created_time": "December 28, 2022, 01:52:17 PM",
      "body": "Quote from: Jason Brendon on December 28, 2022, 03:21:29 AMWe don't know everything, right? There is always something, knowledge, or hacks in life that you don't know about.Let's say you wake up in the morning only to find out your wallet has been emptied. Your savings are all gone. But you were following all the security practices you can possibly can, like generate everything offline, good entropy, not using brain wallet and so on and so forth. But your funds are gone.What will you do with it?You have probably just described the worst morning any user of this forum can have. No one expects this, but everyone can be exposed to it if they make a mistake.What to do with it? Nothing. If the wallet is empty, then there is nothing to fix. You will need to figure out exactly where you went wrong and find your mistakes in order to avoid a repetition of this.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NeuroticFish",
      "created_time": "December 28, 2022, 01:58:30 PM",
      "body": "Quote from: m2017 on December 28, 2022, 01:52:17 PMQuote from: Jason Brendon on December 28, 2022, 03:21:29 AMLet's say you wake up in the morning only to find out your wallet has been emptied. Your savings are all gone. But you were following all the security practices you can possibly can, like generate everything offline, good entropy, not using brain wallet and so on and so forth. But your funds are gone.What will you do with it?You have probably just described the worst morning any user of this forum can have. No one expects this, but everyone can be exposed to it if they make a mistake.What to do with it? Nothing. If the wallet is empty, then there is nothing to fix. You will need to figure out exactly where you went wrong and find your mistakes in order to avoid a repetition of this.Sometimes it's not easy to figure out what you've done wrong. But you have to try and, even more important, make sure you do best next time.And that's a lot more than nothing. That usually means hardware wallet if you didn't have, that usually means much safer ways to handle/store the backup seed, this kind of small things that matter.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "buwaytress",
      "created_time": "December 28, 2022, 02:09:36 PM",
      "body": "My first big incident was in the mid 2000s. The service I held funds on was seized. It was my first time dealing with that kind of incident, months and even years of anguish followed as it wasn't just funds I had, but borrowed capital. It's been over 15 years of waiting, if I ever get it back, it's a nice bonus but I've written it off and paid off my debts since.Fast forward to Bitcoin, I have had similar incidents (all with online accounts using whatever services).Like jackg above, I quickly move on. Sure, I reached out to support, tried to recover, but I accept that I have all kinds of risks with whatever service I leave funds on and try not to do so unnecessarily.Even if my savings do end up being lost, I'd move on quickly. No point in hoping.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "wiss19",
      "created_time": "December 28, 2022, 08:40:28 PM",
      "body": "It won't be gone just like that for no reason but if all of the good practice is done and then the bad ones are avoided then I suspect our partner or family member is the one that is responsible for this. Maybe we shared our login codes with them before because we trusted them.It is needed though because if there are bad things happened to us then we are sure that our wallets can still be opened by someone that we trust and then use those coins for good. I will then confront them if what is the problem on why they sweep my wallet to early. Hopefully they can return some of my coins even if not the actual amount. I can still forgive them because they are not a different person.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}