{
  "id": "topic_5448900",
  "title": "NomadTheSavior",
  "author": "NomadTheSavior",
  "created_time": "April 14, 2023, 11:47:37 PM",
  "content": "Originally I was trying to find out what font was used in the solo \"B\" Bitcoin symbol/logo. Not the bitcoin logo with the word bitcoin spelled out just the logo/sign with the individual B. And not with the vertical lines through it I was just trying to figure out what font the basic letter B was in.So anyway I kept searching and then I came across some articles that said this guy called Phil Wilson aka \"Scronty\" was the creator of every bitcoin logo and it led me down a rabbit hole. It is commonly believed that Satoshi created the first 2 logos and then someone called Bitboy came in and created the last orange Bitcoin logo that we use today. But Phil Wilson claims he was involved in the creation of the first 2 logos and then gave Bitboy the instructions and aided him in creating the orange Bitcoin logo we use today.Bitcoin Magazine even states Phil Wilsons story as fact https://bitcoinmagazine.com/culture/the-history-and-symbolism-behind-bitcoins-logo and many other news sites do as well. (For those wondering it says the font of the Bitcoin \"B\" is Trebuchet font, that font looks like a match but if possible I'd like someone to make sure?) Phil Lawson also has a medium article here where he claims to be involved in the creation of the Bitcoin logo https://medium.com/@_Phil_Wilson_/bitcoin-symbol-and-logo-origins-5d428d40380 and he has a site where he claims the same http://vu.hn/bitcoin-symbol-and-logo-origin.html#the-symbol-workspace-with-images. The thing is on his website he claims to be Satoshi or more specifically part of a group that's called Satoshi. I don't believe he's Satoshi but is there any actual evidence that he was involved in the creation of the Bitcoin Logo? If anyone knows if there's any evidence backing up his logo claims please let me know because this is being stated in supposedly reputable news sites and I want to know if he actually had a part in making the Bitcoin logo.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5448900",
  "comments": [
    {
      "author": "franky1",
      "created_time": "April 15, 2023, 03:39:29 PMLast edit: April 15, 2023, 03:51:25 PM by franky1",
      "body": "it was first made by someone using a font and circle and edited in photoshop to add the vertical strikes for first design of the orange circle bitcoin (JPG/PNG)and no trebuchet doesnt look like the bitcoin Bafter that someone else then done it in another program to illustrate how to create it in SVG format to replicate it. where by SVG can be used for large scale images (billboards/posters) without losing quality which jpg/png fails in when enlargedan no he isnt satoshi but tried to become relevant by assuming involvement in the olden days by replicating the designthere are many mistakes in the \"bitcoin magazine\" article about many other things. EG saying \"bitcoin core first featured\"core did not even come about until 2014+, yet the logo existed YEARS before core",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "darkangel11",
      "created_time": "April 15, 2023, 04:18:23 PM",
      "body": "Quote from: franky1 on April 15, 2023, 03:39:29 PMthere are many mistakes in the \"bitcoin magazine\" article about many other things. EG saying \"bitcoin core first featured\"core did not even come about until 2014+, yet the logo existed YEARS before coreThey meant bitcoin-qt. It was renamed into core in 2014 but it's the same original wallet. The wallet used the logo under its first name (qt).It's not a huge mistake. What is important in that statement is the logo used to be implemented into the first wallet. I don't know when it happened because I haven't heard of bitcoin before 2013, but the first wallet that I had already featured the logo, which was all over the Internet in 2013.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SamReomo",
      "created_time": "April 15, 2023, 10:19:15 PM",
      "body": "That Phil Wilsons has made up that story only to get attention of Bitcoin fans, and that's trap to get more orders from other crypto currency projects. The secret behind logo of Bitcoin is also not publicly revealed by Satoshi, and his claiming of being part of Satoshi Nakamoto group member is just another conspiracy made by him and people like him, I would call them attention seekers.The Bitcoin its logo and anything related to it's creators has never been announced publicly, and those who are claiming themselves as Satoshi Nakamoto or refer them as a group of members who worked on Bitcoin project are just attention seekers. Even if original Satoshi Nakamoto claims himself as creator of Bitcoin, still no body will trust that claim, and that's not going to happen my friend. As of current date and time no body knows that who was Satoshi, and why he disappeared after creating Bitcoin?If we look at the first logo of Bitcoin we can probably say that it was created by Satoshi himself. The first logo of Bitcoin was very simplistic and anyone with a designing application and some designing skills could make such a logo easily. The second logo of Bitcoin was somewhat complicated, but that doesn't mean that someone else made it other than Satoshi. The current logo of Bitcoin made in 2011 is also not very complicated and anyone can make such a logo with simple designing skills.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kamoheapohea",
      "created_time": "April 16, 2023, 02:11:21 AM",
      "body": "Phil Wilson confuses me. He is either totally mentally disordered or there is some truth to his story.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "April 16, 2023, 05:19:01 AM",
      "body": "point being the BTC font with the vertical stripes originated using a font like clarendon UWB and then added the verticals in something basic like MSpaint or photoshop and saved as jpeg/png. it was not some vector based creation saved as SVGthe BTC form (v middle v)came before the orange logo(v right v) .. not at same timethe guy that made the orange logo done it in vectors as an update to the logo, simple so others can use it at scale big enough for billboards and large posters because the original logo's were only a small amount of pixels to be used as software iconsthe orange vector created logo was not the invention of the BTC",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hZti",
      "created_time": "April 16, 2023, 08:11:35 AM",
      "body": "I’m the early days of bitcoin stuff like this was not publicly discussed, since Bitcoin was not known a lot and nobody could predict the future. I’m shure somebody simply made the design because he had some free time and send an email or pm to satoshi. This person could probably still show that message, but why should he. This person is probably very rich by now and does not need the attention that others need.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "April 16, 2023, 08:29:43 AM",
      "body": "Quote from: hZti on April 16, 2023, 08:11:35 AMI’m the early days of bitcoin stuff like this was not publicly discussed, since Bitcoin was not known a lot and nobody could predict the future. I’m shure somebody simply made the design because he had some free time and send an email or pm to satoshi. This person could probably still show that message, but why should he. This person is probably very rich by now and does not need the attention that others need.wrong. the logo history is known. it happened on this forum.. the stuff stated in blogs and social media just a couple years ago is not well researched and is just done to promote a guy that wanted some recognitionit is funny how real information is so easily found should people wish to search but instead they want to be told the story now from people that didnt put the extra effort in doing the research",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hZti",
      "created_time": "April 16, 2023, 09:02:06 AM",
      "body": "Quote from: franky1 on April 16, 2023, 08:29:43 AMQuote from: hZti on April 16, 2023, 08:11:35 AMI’m the early days of bitcoin stuff like this was not publicly discussed, since Bitcoin was not known a lot and nobody could predict the future. I’m shure somebody simply made the design because he had some free time and send an email or pm to satoshi. This person could probably still show that message, but why should he. This person is probably very rich by now and does not need the attention that others need.wrong. the logo history is known. it happened on this forum.. the stuff stated in blogs and social media just a couple years ago is not well researched and is just done to promote a guy that wanted some recognitionWell then enlighten me, ti my knowledge there is no public discussion about the “BC” logo and also not the B logo with the stripes. The only one that I know of is the more modern orange logo that is nothing new at all.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "April 16, 2023, 04:28:12 PMLast edit: April 16, 2023, 04:57:50 PM by franky1",
      "body": "Quote from: hZti on April 16, 2023, 09:02:06 AMQuote from: franky1 on April 16, 2023, 08:29:43 AMQuote from: hZti on April 16, 2023, 08:11:35 AMI’m the early days of bitcoin stuff like this was not publicly discussed, since Bitcoin was not known a lot and nobody could predict the future. I’m shure somebody simply made the design because he had some free time and send an email or pm to satoshi. This person could probably still show that message, but why should he. This person is probably very rich by now and does not need the attention that others need.wrong. the logo history is known. it happened on this forum.. the stuff stated in blogs and social media just a couple years ago is not well researched and is just done to promote a guy that wanted some recognitionWell then enlighten me, ti my knowledge there is no public discussion about the “BC” logo and also not the B logo with the stripes. The only one that I know of is the more modern orange logo that is nothing new at all. the gold coin BC no stripes, is what satoshi made before releasing bitcoin code(2008)the gold coin BTC satoshi made in feb 2010 https://bitcointalk.org/index.php?topic=64.0the orange plate upgrade happened in november 2010 https://bitcointalk.org/index.php?topic=1631.0but here is the thing, even up until ~2014 people thought bitcoin was open and unrestricted and so there was no official BTC logo and people had the freedom to use any logo they liked.. some wanted to use the thai baht symbol. some wanted to use a different symbolthere was blockchain.info that went with and other services went with other symbology and other logos.it wasnt until around 2014 that many started centralising branding under one ideaand only in hindsight years later, does it look like people dropped the satoshi gold coin BTC and where infact it was due to core inception and their enjoyment of the orange plate BTC.. and so due to core centralising the brand. everyone followed suiteyep core did not even become a brand until 2014",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}