{
  "id": "topic_5468266",
  "title": "heartbit.offical",
  "author": "heartbit.offical",
  "created_time": "September 27, 2023, 07:41:19 AM",
  "content": "Everyone knows that we can learn from the past to correct mistakes. As a result, many economists attempt to predict the future through history.We also have a known fact from the past. The \"Bitcoin halving\" is correlated with price increases.I'd like to pose a new question here. What are your thoughts on using past charts(candlesticks) that similar current ongoing charts(candlesticks) to make price predictions?When asked this question to many professors and investors, a common response is, \"Candlesticks reflect the psychology of investors.\"What are your thoughts on this matter?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5468266",
  "comments": [
    {
      "author": "noorman0",
      "created_time": "September 27, 2023, 08:58:30 AM",
      "body": "Quote from: heartbit.offical on September 27, 2023, 07:41:19 AM-snip-What are your thoughts on using past charts(candlesticks) that similar current ongoing charts(candlesticks) to make price predictions?There is no prediction that is 100% accurate, so the results of technical analysis will be subjective depending on how traders interpret price history which they then process into an entry signal. Actually, it is not a matter of trust but of possibility, in fact traders are very flexible to change the type of analysis used if it is not profitable enough.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jeraldskie11",
      "created_time": "September 27, 2023, 03:37:25 PM",
      "body": "Quote from: heartbit.offical on September 27, 2023, 07:41:19 AMI'd like to pose a new question here. What are your thoughts on using past charts(candlesticks) that similar current ongoing charts(candlesticks) to make price predictions?It is what we called fractal. But I didn't rely on that when I trade because investors are not the same person as before that cause that price pattern.But there are some point in the chart that we can trust that the price will go in that way after a specific event such as Bitcoin halving. When the Bitcoin halving occur the price of Bitcoin will gradually increases afterwards and then explode.I don't really know the exact reason behind that but maybe there are lot of investors who waited for that which can cause the price to increase so high.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DVlog",
      "created_time": "September 27, 2023, 04:36:35 PM",
      "body": "Quote from: noorman0 on September 27, 2023, 08:58:30 AMQuote from: heartbit.offical on September 27, 2023, 07:41:19 AM-snip-What are your thoughts on using past charts(candlesticks) that similar current ongoing charts(candlesticks) to make price predictions?There is no prediction that is 100% accurate, so the results of technical analysis will be subjective depending on how traders interpret price history which they then process into an entry signal. Actually, it is not a matter of trust but of possibility, in fact traders are very flexible to change the type of analysis used if it is not profitable enough.I have been in trading for a long time and traded in forex, option, stock and crypto market. From my experience i can say that technical analysis will work in crypto as long as there isn't any new events in action. Any negative or positive news about the market can prove a TA totally wrong. This is the reason i try not to trade when there is any upcoming news events or the market is volatile due to any ongoing news events.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "September 27, 2023, 04:47:46 PM",
      "body": "I do believe that there are some technical indicators that can make you think \"huh, people are extra bullish/bearish on this certain cryptocurrency/asset\". But there's no single TA that would make you think \"huh, this will 100% for sure go up/down\".TA should only be used to skew odds by a few percentage points. Not something that would make something guaranteed to move a certain way.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "September 27, 2023, 05:00:51 PM",
      "body": "Id say I believe it as a guide or an acess of potential market overflow but it is not an accurate method to accomplish guaranteed risk free trading cause even though weve seen indicators we often see some output on the otherside of the technical charts. I am more on bullish on news or general output of the community. The chart plot can lie to us in every bit we dont see it working. Does any trader with perfect knowledge on trading escape a loss? I doubt there are rare or maybe close to none.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Woodie",
      "created_time": "September 27, 2023, 05:29:04 PM",
      "body": "Quote from: heartbit.offical on September 27, 2023, 07:41:19 AMEveryone knows that we can learn from the past to correct mistakes. As a result, many economists attempt to predict the future through historyWe also have a known fact from the past. The \"Bitcoin halving\" is correlated with price increases.As much as we want to draw this connection to price increases, unfortunately numbers say price only responds a year later or something which means the correlation lacks concrete evidence. I understand that the Bitcoin halving isn't like dropping a rock in the water and seeing the ripple effect immediately..it does take time..For detailed analysis see this thread https://bitcointalk.org/index.php?topic=5375808.0Quote from: heartbit.offical on September 27, 2023, 07:41:19 AMI'd like to pose a new question here. What are your thoughts on using past charts(candlesticks) that similar current ongoing charts(candlesticks) to make price predictions?Technical analysis does make use of past data, which makes is a reliable tool to predict the direction price will be taking... especially that momentum/volume is out there for everyone to see.Besides candles on a chart tell a story of what's happening in the markets before we even connect the dots, anybody dumping, or buying big can't hide this from our chart's as all orders show up on the charts the second a buy or sell is triggered.Quote from: heartbit.offical on September 27, 2023, 07:41:19 AMWhen asked this question to many professors and investors, a common response is, \"Candlesticks reflect the psychology of investors.\"What are your thoughts on this matter?That's a new one for me... especially that psychology was used to describe the candles,it's definitely a professors definition but thinking about it, it does make sense as candlesticks do give out their bias(overall direction)..",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "puloweh555",
      "created_time": "September 27, 2023, 06:26:00 PM",
      "body": "Quote from: heartbit.offical on September 27, 2023, 07:41:19 AMWhat are your thoughts on this matter?I believe it, because it is one of my references for making decisions. In essence, the answer depends on how long you want to invest. Whether for long term or short term. If you want to swing trade, you definitely need to use technical analysis with a daily/weekly time range.However, if you want long-term investment, definitely use fundamental analysis. Looking at the history of Bitcoin halvings is important. How do prices move each year? In conclusion, there is no correct and most appropriate analysis, both fundamental and technical. My suggestion is to use both. If you look at the candles that have formed + the indicators are easy to read, to see the future is still dark, you need strong news to monitor the rise/fall in prices.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Asiska02",
      "created_time": "September 27, 2023, 07:44:11 PM",
      "body": "Quote from: heartbit.offical on September 27, 2023, 07:41:19 AMWhen asked this question to many professors and investors, a common response is, \"Candlesticks reflect the psychology of investors.\"What are your thoughts on this matter?Their predictions might be right but the fact that the market is generally unpredictable makes it a reason to have some doubts in such predictions. This has to do with psychology of how you view the market and believe it’ll turn out to be if it goes in some certain directions as related to what has happened in the past history. I have no much objections to those professors or investors because most often a replicant of the past always occur as in the case of halving that is also coming up. Halving results to price increase and this has been tested and proved in 3 different halvings, this time around every bitcoin enthusiast believes it won’t be an exception either. Base on statistical analysis of past halvings is what makes it easy for people to predict the next all-time high of bitcoin after halving.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "shivansps",
      "created_time": "September 27, 2023, 07:47:05 PM",
      "body": "Yes, I believe technical analysis as a good guessing tool, but not as an accurate and true opinion. This is the beauty of trading, if you could calculate something exactly, everyone would be millionaires, but this is not possible, so perhaps it is worth studying technical analysis but not relying on it as truth. This is not mathematics or physics, this is not an exact science",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stomachgrowls",
      "created_time": "September 27, 2023, 08:38:01 PM",
      "body": "Quote from: heartbit.offical on September 27, 2023, 07:41:19 AMEveryone knows that we can learn from the past to correct mistakes. As a result, many economists attempt to predict the future through history.We also have a known fact from the past. The \"Bitcoin halving\" is correlated with price increases.I'd like to pose a new question here. What are your thoughts on using past charts(candlesticks) that similar current ongoing charts(candlesticks) to make price predictions?When asked this question to many professors and investors, a common response is, \"Candlesticks reflect the psychology of investors.\"What are your thoughts on this matter?- Past charts are really that a worth thing to be checked on on which it would really be giving out that kind of idea on how it did behave in the past. Patterns could be formed but doesnt meanthat it would be a solid thing that it could happen in the future but making it as a reference then it wont really be that a bad idea.-Psychology or not, it doesnt matter but the main thing that should be having in mind is that using up these technicals are really that relevant or something that significantspecially if you are dealing on a market on which it is really just that too unpredictable and random.We cant really be just having always that news and sentiments around which we could really be able to make use and this is why we do heavilyrely with these indicators on which been mainly used on the time we do engage within this market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "goldkingcoiner",
      "created_time": "September 27, 2023, 09:11:39 PM",
      "body": "Quote from: heartbit.offical on September 27, 2023, 07:41:19 AMEveryone knows that we can learn from the past to correct mistakes. As a result, many economists attempt to predict the future through history.We also have a known fact from the past. The \"Bitcoin halving\" is correlated with price increases.I'd like to pose a new question here. What are your thoughts on using past charts(candlesticks) that similar current ongoing charts(candlesticks) to make price predictions?When asked this question to many professors and investors, a common response is, \"Candlesticks reflect the psychology of investors.\"What are your thoughts on this matter?What is there to believe? Its all based off of mathematical calculations of prior historical experiences. All it does is narrow down the possibility of \"this or that\". The probability of it going the other way always remains, no matter how small it becomes. So a 100% accurate prediction is nonsense. However there are people who can predict it very nearly almost accurately. And sometimes that very nearly prediction is what wins you the profit in the end. But that kind of analysis takes years to master and nobody who is considered an expert will demand money for courses or signals.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "goaldigger",
      "created_time": "September 27, 2023, 09:29:38 PM",
      "body": "Quote from: shivansps on September 27, 2023, 07:47:05 PMYes, I believe technical analysis as a good guessing tool, but not as an accurate and true opinion. This is the beauty of trading, if you could calculate something exactly, everyone would be millionaires, but this is not possible, so perhaps it is worth studying technical analysis but not relying on it as truth. This is not mathematics or physics, this is not an exact scienceWe’re doing our best to at least get the possible price trend and yes TA works but its not perfect as expected by many, you should still adjust your analysis according to the market trend as a whole. TA is advisable for every trader, you should not guess your position to increase your chance of making a profit, the market is very volatile and its too risky, with TA it can give you at least a higher chance of making a good profit.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitDane",
      "created_time": "September 27, 2023, 09:46:45 PM",
      "body": "Quote from: DVlog on September 27, 2023, 04:36:35 PMQuote from: noorman0 on September 27, 2023, 08:58:30 AMQuote from: heartbit.offical on September 27, 2023, 07:41:19 AM-snip-What are your thoughts on using past charts(candlesticks) that similar current ongoing charts(candlesticks) to make price predictions?There is no prediction that is 100% accurate, so the results of technical analysis will be subjective depending on how traders interpret price history which they then process into an entry signal. Actually, it is not a matter of trust but of possibility, in fact traders are very flexible to change the type of analysis used if it is not profitable enough.I have been in trading for a long time and traded in forex, option, stock and crypto market. From my experience i can say that technical analysis will work in crypto as long as there isn't any new events in action. Any negative or positive news about the market can prove a TA totally wrong. This is the reason i try not to trade when there is any upcoming news events or the market is volatile due to any ongoing news events.Since most bot is following some technical analysis method, it ought to work because the majority of trader especially those who are using bot follows this method.  I agree with one of the earlier replies that there is no 100% accurate in terms of trading since there is always a variable that make changes in the market unpredictable.  One of which is stated in the quoted reply that when a good news is suddenly released and affect the sentiment of the majority of the trader, the TA will fail since it is based on the past history of the trade.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dimitri94",
      "created_time": "September 27, 2023, 10:40:01 PM",
      "body": "Quote from: shivansps on September 27, 2023, 07:47:05 PMYes, I believe technical analysis as a good guessing tool, but not as an accurate and true opinion. This is the beauty of trading, if you could calculate something exactly, everyone would be millionaires, but this is not possible, so perhaps it is worth studying technical analysis but not relying on it as truth. This is not mathematics or physics, this is not an exact scienceTechnical analysis gives a good idea of the market relationship depending on which we can make a good investment. It plays an important role in building confidence in pre-investment decisions. Although it does not give any specific indication. However, if you can invest with an idea on it, the amount of investment risk can be reduced to some extent. Moreover, following the trading church in the trading business should be done even though it is not mandatory for every trader. Since there is no guarantee in which direction the market will move.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "taufik123",
      "created_time": "September 27, 2023, 10:51:52 PM",
      "body": "Predictions are just that, predictions, I make them according to the data at hand and this also refers to the many indicators used and involves the use of charts, historical prices, patterns, technical indicators, and trading volume to identify trends, support, and resistance levels. Technical analysis is not perfect, it has limitations because the price of Bitcoin is also determined by Fundamentals. Therefore, Fundamental analysis can also be combined with technical analysis so that it will provide predictions that may be close, but still will not be 100% accurate. The chart patterns or predictions of each tarder will also be different, because they have their own techniques and different points of view.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "macson",
      "created_time": "September 27, 2023, 11:00:13 PM",
      "body": "Quote from: heartbit.offical on September 27, 2023, 07:41:19 AMEveryone knows that we can learn from the past to correct mistakes. As a result, many economists attempt to predict the future through history.We also have a known fact from the past. The \"Bitcoin halving\" is correlated with price increases.I'd like to pose a new question here. What are your thoughts on using past charts(candlesticks) that similar current ongoing charts(candlesticks) to make price predictions?When asked this question to many professors and investors, a common response is, \"Candlesticks reflect the psychology of investors.\"What are your thoughts on this matter?A good trader doesn't just use technical analysis as a benchmark in making decisions, they also use fundamental analysis to make decisions because news on market sentiment and politics also have an important role in market changes, for example when you see a doji appearing then there must be one> the sense of uncertainty faced by investors is something like this that you can take into consideration.For a more complete reading, you should go to the article i provided below, it explains well how candlesticks are.QuoteCandlestick DefinitionCandlestick is a visual tool that depicts fluctuations in an asset’s past and current prices. The candle has three parts: the upper shadow, the real body, and the lower shadow. Stock market analysts and traders use this tool to anticipate future movement in an asset’s price.[1] https://www.wallstreetmojo.com/candlestick/QuoteWhat Is a Doji?A doji (dōji) is a name for a trading session in which a security has open and close levels that are virtually equal, as represented by a candle shape on a chart. Based on this shape, technical analysts attempt to make assumptions about price behavior. Doji candlesticks can look like a cross, inverted cross, or plus sign.[1] https://www.investopedia.com/terms/d/doji.asp",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitcoinTurk",
      "created_time": "September 28, 2023, 12:51:30 AM",
      "body": "Technical analysis is an important analysis method used to predict future price movements based on past price movements. It is of great importance especially in general to determine at what levels prices are breaking upwards or downwards or at what points the buyer-seller balance is disrupted. Of course, technical analysis alone is not enough in some cases to make a profit because the direction of the market and price changes also occur with a possible news flow. For this reason, technical analysis should always be used to support ideas and analyze future price movements.To explain my personal opinion, I'm someone who believes that technical analysis is successful because past price movements and support-resistance levels are always of great importance in determining future price analysis. Especially when making long-term price analyses in addition to technical analysis it will be very useful to follow the news in the market and determine buying and selling points with the data obtained as a result of the analysis. Also, for short-term buy-sell I usually rely on technical analysis and just check out possible breaking news and which direction the market might move. In other words, regardless of the process technical analysis definitely helps to determine price predictions more easily and minimize possible losses while maximizing possible gains.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "wxa7115",
      "created_time": "September 28, 2023, 03:37:45 AM",
      "body": "Quote from: heartbit.offical on September 27, 2023, 07:41:19 AMEveryone knows that we can learn from the past to correct mistakes. As a result, many economists attempt to predict the future through history.We also have a known fact from the past. The \"Bitcoin halving\" is correlated with price increases.I'd like to pose a new question here. What are your thoughts on using past charts(candlesticks) that similar current ongoing charts(candlesticks) to make price predictions?When asked this question to many professors and investors, a common response is, \"Candlesticks reflect the psychology of investors.\"What are your thoughts on this matter?Due to the title of the thread I thought the discussion was going to be more general, but this is specific about candlestick patterns.Look, I have looked into those patterns in the past and at least to me they are too subjective to be of any use, there are too many different candles and when combined with other candles their meaning can change and in fact be completely reversed, and when something is so subjective I simply do not trust it, as other traders can always point out that you read the candlesticks wrong and claim you could have made money if you did things right, and by the way I also feel that way about Elliott Waves.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "michellee",
      "created_time": "September 28, 2023, 04:45:08 AM",
      "body": "Using past graphs similar to current graphs can give us an idea of the situation that may or could occur in the near or medium future. But if it is a prediction, we don't necessarily have to believe it because it is just a prediction that has not happened, especially if the prediction is from someone else.Charts for investors and traders have different purposes because their goals are different. For traders, charts and technical and fundamental analysis are useful in determining entry and exit from the market. Meanwhile, charts for investors are useful for seeing the course of trends over time so that investors will know what to do.I believe in technical analysis but it must be combined with technical fundamentals to look at information from other sources. And we also need to look at the indicators in the market to get information about where the market will move.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}