{
  "id": "topic_5476323",
  "title": "jerry0",
  "author": "jerry0",
  "created_time": "December 02, 2023, 06:46:47 PM",
  "content": "So I never traded before and considering to do it now.  I know you can trade btc, eth and the main big coins.  There are also ton of altcoins out there like solana which is considered a big altcoin, and altcoins like stellar lumens which is a popular altcoin.  Then you have memecoins like dogecoin and many others that are on uniswap and pancakeswap.  I never used uniswao pr pancakeswap.Now if you want to do short term trading such as buy these altcoins and meme coins and sell them... let say it could be as short as few hours to the most as in a month or so.  But let say you want to be trading daily and thus probably don't want to hold a coin more than a week or so and just want to lock in profits if they have a target price for each altcoin or memecoin you buy.  Do lot of people do this?  Now obviously if you want to make money short term, this wouldn't be possible if the crypto market is going down right?  Thus if btc is going down a lot, pretty much all altcoins follow right?  Very few altcoins go up when bitcoin goes down.  However, I recall many of these memecoins don't exactly follow bitcoin''s price going up or down right?  I'm talking about those memecoins that show up and then probably are gone within few weeks.  Now these memecoins are all frauds right?  I forgot the exact term that is used for these but it's when creator of a coin puts it and then people buy and then the price drops... what's the term for this?  But even if you buy those coins and then sell when you make a profit, it's fine right as long as you don't hold these coins at the end when price falls?If you are planning to trade and make short term trades... do you suggest normal altcoins?  By normal altcoins I mean any altcoin in the top 100.  But probably it should be the top 50 or so.  What about memecoins?  Seems with memecoins you can make a lot more in what you put in right but the risk is higher?  However if you put say $1000 in a memecoin. It can 10x.  You can't really do that with any real altcoin in the top 100 that isn't a memecoin right?  Now if the memecoin goes to almost 0... well you only lose $1000.  But you can 5x or 10x your memecoin right?  So as of now and recently, are there altcoins or memecoins like that?  Such that you buy it and hold on to it for few days or week or weeks and then as long as you sell it before the price plummets you profit?The other question is if you plan to do this type of trading, what exchanges do you have to use?  I only have access to coinbase and gemini so I can only trade in real altcoins so to speak.  Sure you can invest in dogecoin which is a memecoin but it's a top altcoin in a real exchange lilke coinbase and gemini.  But when you talk about those memecoins... what exchange will you have to use?  Is it only uniswap and pancakeswap?  With them, you need to have ETH right?  Thus you send ETH to it and then buy those memecoins?  However, I heard in those exchanges, you have to use wbtc or something like that?  How does that work?  But in the end when you cash out if you can, you would be withdrawing ETH back right from uniswap or pancakeswap?  Or can you withdraw say usdt or usdc or btc back to your wallet? Anyone here who trade altcoins and especially memecoins and give insight on this?  Also it's hard to 5x even with altcoins now right?  But memecoins it isn't?  Just the risk is much higher?  Now if you could buy 5 memecoins and one of them 10x and the other ones go to zero... then you profit right?  Also do all memecoins and altcoins go to 0?  Or it's always like $0.01 or $0.0000001?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5476323",
  "comments": [
    {
      "author": "velhoti",
      "created_time": "December 02, 2023, 07:04:58 PM",
      "body": "Just a few observations: Top 100 market cap probably won't do 10X in hours, the 100th have roughly half billion of capitalization, if you multiply by 10 it become 60th, not feasible. To reach 10X, or even 100X it is necessary get top 1000 market cap. Those low cap coins can only be traded in DEX, get used to Uniswap and related and prepare for a lot of rug pulls. Personally i do not believe it is possible to gain in short term trading, the market is roughly random, and of course, few one do it,  but for each one that make money a lot tried and lost, It's a lottery, do not recommend.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Obim34",
      "created_time": "December 02, 2023, 08:05:17 PM",
      "body": "Like you made mention of those popular Altcoins, of a truth they are very much difficult to give you 10x of your investment. Investing in this shit coins is the only considerate option where else the risk involved is 80% than the chance of you making profit.Meme coins can be a better option for such investment as they are there for just a quick rich scheme and later on disappear from the market leaving no trace.There are many exchange that you can use to do this kind of trading, since those shit coin are not capable of listing in  bibance they go for something else. Exchanges like Mexc, Lbank, Bitget and many more.When venturing into this kind of trading extra care needs to be under taken as to avoid careless loss of funds as most person always regret after making mistakes, try watching the market and make careful analysis",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "electronicash",
      "created_time": "December 02, 2023, 08:08:11 PM",
      "body": "if you want to trade with USD instead i think Robinhood offers SHIB/USD pair. you won't have to use that wBTC or wETH. looking for other memecoins besides SHIB and Doge sounds riskier. you're doubling down the risk of betting on new memecoins.Quote from: velhoti on December 02, 2023, 07:04:58 PMJust a few observations: Top 100 market cap probably won't do 10X in hours, the 100th have roughly half billion of capitalization, if you multiply by 10 it become 60th, not feasible. To reach 10X, or even 100X it is necessary get top 1000 market cap. Those low cap coins can only be traded in DEX, get used to Uniswap and related and prepare for a lot of rug pulls. Personally i do not believe it is possible to gain in short term trading, the market is roughly random, and of course, few one do it,  but for each one that make money a lot tried and lost, It's a lottery, do not recommend.he is looking for the new for it's the only market that can make him win big in the short term. Sometimes they were just pumped which if he is at the right time, he can profit. the problem with this is that there is no chart to look at.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "velhoti",
      "created_time": "December 02, 2023, 08:22:22 PM",
      "body": "Quote from: electronicash on December 02, 2023, 08:08:11 PMhe is looking for the new for it's the only market that can make him win big in the short term. Sometimes they were just pumped which if he is at the right time, he can profit. the problem with this is that there is no chart to look at.Then good luck to him, i still  believe it is very risky. I believe dextools and dexscreener are excellent sites to track and see the price of very low cap coins, including scam ones.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jerry0",
      "created_time": "December 18, 2023, 11:38:05 PM",
      "body": "So there are these memecoins like bonk and other coins that seem to be in these exchanges I never heard of.  These seem to be raydium and orca and they seem to have huge volume?  These seem to be related to solana.I thought if you wanted to trade those strange memecoins, you needed accounts on uniswap and sushiswap.  But those are for memecoins that are traded in ETH?  So many meme coins are traded with solana now?So what are the exchanges you need accounts now if you want to trade memecoins?Uniswap, sushiswap and those I mentioned?  What else?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jerry0",
      "created_time": "December 23, 2023, 06:33:34 AM",
      "body": "What exchanges would you need accounts at if you want to trade memecoins?Also, pancakeswap would be another one?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kentrolla",
      "created_time": "December 23, 2023, 09:02:27 AM",
      "body": "I would suggest you to drop the idea of trading the shit coins or meme coins which has potential of giving you 10x or 100x in short period f time because you will eventually end up losing it as it's a gamble and that's the reason you will not find such coins on top exchanges like Binance or Huobi or Kucoin but in low level exchanges which doesn't have much liquidity like Mexc, Bitmart, LAToken, etc. It's logically difficult to achieve the kind of profit you have mentioned as it would require effort an patience but investing in meme or shit coin is definitely not an option.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "malcovi2",
      "created_time": "December 23, 2023, 09:56:44 AM",
      "body": "Quote from: jerry0 on December 23, 2023, 06:33:34 AMWhat exchanges would you need accounts at if you want to trade memecoins?Also, pancakeswap would be another one?pancakeswap, sushiswap, uniswap, and traderjoe. Those are the exchangers that I have been usingQuote from: kentrolla on December 23, 2023, 09:02:27 AMI would suggest you to drop the idea of trading the shit coins or meme coins which has potential of giving you 10x or 100x in short period f time because you will eventually end up losing it as it's a gamble and that's the reason you will not find such coins on top exchanges like Binance or Huobi or Kucoin but in low level exchanges which doesn't have much liquidity like Mexc, Bitmart, LAToken, etc. It's logically difficult to achieve the kind of profit you have mentioned as it would require effort an patience but investing in meme or shit coin is definitely not an option. where do you think Shibainu, pepecoin, floki started?They started from dex and eventually got listed on big exchangers",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bureau",
      "created_time": "December 23, 2023, 10:01:15 AM",
      "body": "Quote from: malcovi2 on December 23, 2023, 09:56:44 AMQuote from: jerry0 on December 23, 2023, 06:33:34 AMWhat exchanges would you need accounts at if you want to trade memecoins?Also, pancakeswap would be another one?pancakeswap, sushiswap, uniswap, and traderjoe. Those are the exchangers that I have been usingBinance has listed a few memecoins lately. It is a CEX which means KYC is mandatory, if you want volume then Binance is a better option than named DEX. Another way to find exchanges where meme coins are listed is to vist CMC and check markets. You can also check top 10 memecoins according to marketcap by visiting the following link https://coinmarketcap.com/view/memes/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Makus",
      "created_time": "December 23, 2023, 10:44:21 AM",
      "body": "Quote from: jerry0 on December 02, 2023, 06:46:47 PM let say it could be as short as few hours to the most as in a month or so.  But let say you want to be trading daily and thus probably don't want to hold a coin more than a week or so and just want to lock in profits if they have a target price for each altcoin or memecoin you buy.  Do lot of people do this?  Now obviously if you want to make money short term, this wouldn't be possible if the crypto market is going down right?  Thus if btc is going down a lot, pretty much all altcoins follow right?  Very few altcoins go up when bitcoin goes down.  However, I recall many of these memecoins don't exactly follow bitcoin''s price going up or down right?  I'm talking about those memecoins that show up and then probably are gone within few weeks.  Now these memecoins are all frauds right?  I forgot the exact term that is used for these but it's when creator of a coin puts it and then people buy and then the price drops... what's the term for this?  But even if you buy those coins and then sell when you make a profit, it's fine right as long as you don't hold these coins at the end when price falls?Op the market doesn't work that way, investment in crypto is something that we cannot tell for sure where the price is going and so, no one can make a complete 100% prediction all the time. However investment in just an hour would not give you any weighty profit, even investment for a week is under probability as some times, the price of a coin just move in a side ways trend, leaving you with no or very little profits or loss. I appreciate you know about how memecoins can be funny some times, they're very risky to invest in and they require some skill for trading. Meaning, those investing in such coins watch the market more often than those into Bitcoin or some good crypto. Op if you are thinking of going into altcoin investment I'll advise that you should be careful not to put in too much for investment, except you decide to hold top coin like Bitcoin then you can put in some good amount using DCA.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rampagoe004",
      "created_time": "December 23, 2023, 11:12:57 AM",
      "body": "I just discussed in another thread that what makes people interested in buying altcoins or memecoins is because they can offer profits of up to 10 times. But if you are talking about top 100 coins then I think it will be impossible to get 10x returns in a few months. The coin is currently ranked 101st, Axelar has a market cap of $585 million dollars so if you are talking about a 10x increase then that means around $5.8 billion dollars which means Axelar will rise to around 20th place according to market capitalization. This is something impossible. If you want then you can look for coins in the top 1000 or try investing in presales.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Belarge",
      "created_time": "December 24, 2023, 10:26:43 PM",
      "body": "Quote from: jerry0 on December 23, 2023, 06:33:34 AMWhat exchanges would you need accounts at if you want to trade memecoins?Also, pancakeswap would be another one?Anything concerning exchanges, a trader can use any exchange to buy and hold memecoins as far as the coin have been enlisted by the crypto exchange, because not all memcoins are found on this exchange. Exchanges doesn't matter when it involves memecoins, remember these memecoins are supposed to be the latest trends because it's their season to make bullish moves and the holders and scalpers can stand in positions to make gigantic profits and they're able to maintain liquidity. Memecoins are tradable only when it's their season to form bullish candles and skyrockets to the moon.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "batang_bitcoin",
      "created_time": "December 25, 2023, 01:01:47 AM",
      "body": "Yes, a lot of traders does that. They don't stick to those coins that they buy and sets timeframe for them to hold it like a few weeks or even a month. As long as they're not yet on profit with it, they won't sell. But if they lose their patience, they're selling it at a loss and that's what we call cutting of losses. I think it is better for you to stop the arguments without application but then apply and do the trades and then asks things when you encounter something or you actually do it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Publictalk792",
      "created_time": "December 25, 2023, 06:03:31 AM",
      "body": "There are many shitcoins which have performed well and gain 100x significantly. Like we have and example of Shiba Inu. But this is really hard to find these kind of coins. So we should be careful while investing. If you want to make profit so I will recommend to diversify your investment in many coins. And if you find a memecoin which you think that it can perform well in future so you should invest that money which will you lose so this will not affect to your personal life. So always do a good research and then invest in any coin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hitsnorth",
      "created_time": "December 25, 2023, 09:20:44 AM",
      "body": "Quote from: Publictalk792 on December 25, 2023, 06:03:31 AMThere are many shitcoins which have performed well and gain 100x significantly. Like we have and example of Shiba Inu. But this is really hard to find these kind of coins. So we should be careful while investing. If you want to make profit so I will recommend to diversify your investment in many coins. And if you find a memecoin which you think that it can perform well in future so you should invest that money which will you lose so this will not affect to your personal life. So always do a good research and then invest in any coin.Research doesn't always help with memecoins. Most of them are just pumping because of good promotion or random luck and hype.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lixer",
      "created_time": "December 25, 2023, 07:29:22 PM",
      "body": "Quote from: hitsnorth on December 25, 2023, 09:20:44 AMQuote from: Publictalk792 on December 25, 2023, 06:03:31 AMThere are many shitcoins which have performed well and gain 100x significantly. Like we have and example of Shiba Inu. But this is really hard to find these kind of coins. So we should be careful while investing. If you want to make profit so I will recommend to diversify your investment in many coins. And if you find a memecoin which you think that it can perform well in future so you should invest that money which will you lose so this will not affect to your personal life. So always do a good research and then invest in any coin.Research doesn't always help with memecoins. Most of them are just pumping because of good promotion or random luck and hype.That's true. Investments in meme coins aren't less than gambling because you know that you are buying a coin that isn't backed by a proper project, it doesn't have much to offer to the community because it doesn't serve any purpose, and the only way you can get some profit if the coin manages to get enough attention and hype within the market and in case that doesn't happen, the few million coins that you've bought will just sit idle in your portfolio.So, those who invest in meme coins already know the risk, and if some don't know, the research can only educate them about the risks involved with the investment and then if they are okay with it, they will go for it or simply change their decision and invest the money in another altcoin instead.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "December 25, 2023, 09:18:54 PM",
      "body": "Quote from: jerry0 on December 02, 2023, 06:46:47 PMAnyone here who trade altcoins and especially memecoins and give insight on this?  Also it's hard to 5x even with altcoins now right?  But memecoins it isn't?  Just the risk is much higher?  Now if you could buy 5 memecoins and one of them 10x and the other ones go to zero... then you profit right?  Also do all memecoins and altcoins go to 0?  Or it's always like $0.01 or $0.0000001?Well getting a 5x is not hard if you knew where to invest or put that money into. Altcoins are now pumping but not all of it. Some are making good prices and thats where you need to act and find one. Memecoin is hot right now, and can do even more 5x but also associated risk which can also lose your fund. Not all memecoins are gainable and can give you profit some even doing some rug and scams so be careful. The prices are depend on the launch its not like always what you had mentioned.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mate2237",
      "created_time": "December 25, 2023, 09:57:31 PM",
      "body": "In cryptocurrency that method of trading will be hard. Trading is not an investment so when your are trading you have to remove the funds from the account whenever the amount is big so that that addiction of trading will not consume all. And trading in altcoins it memecoins. All the two are good but I will prefer to use altcoins than memecoins. And it only in altcoins that you can have the said 5X in trading but if it is in Memecoins I am not sure and also when you're trading make sure you keep it in short term and not in long term but if it is investment the long term is the best.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ben Barubal",
      "created_time": "December 26, 2023, 01:49:34 AM",
      "body": "Well, honestly, meme coins are okay to do trading activity to get profit in this industry. If you understand the movement in the crypto space, there is no problem, as long as you know and understand the ins and outs of the crypto space.  As long as you know the risk you are entering here, just remember to always do your own research. The only choice you should always make is the top meme coins on coinmarketcap and Coingecko. This way, the risk is also somehow reduced.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}