{
  "id": "topic_5401116",
  "title": "Davidvictorson",
  "author": "Davidvictorson",
  "created_time": "June 02, 2022, 02:38:13 PM",
  "content": "What is an unpopular opinion you hold about bitcoin and cryptocurrency that you will love to share with newbies?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5401116",
  "comments": [
    {
      "author": "mk4",
      "created_time": "June 02, 2022, 02:41:25 PM",
      "body": "Bitcoin isn't guaranteed to follow the 4-year cycle thingy, and that at some point it will take longer (probably more than 2x longer than usual) for bitcoin to reach new all-time highs.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Despairo",
      "created_time": "June 02, 2022, 03:02:09 PM",
      "body": "1. Don't invest in Bitcoin if you didn't know anything about it.2. There's no guarantee if Bitcoin price always increase like the previous history and reaching new ATH.3. Don't teach anyone about Bitcoin except your close family, in case you didn't sold all your Bitcoin to fiat and want to let your child to continue your Bitcoin journey.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NeuroticFish",
      "created_time": "June 02, 2022, 03:14:15 PM",
      "body": "Quote from: Davidvictorson on June 02, 2022, 02:38:13 PMWhat is an unpopular opinion you hold about bitcoin and cryptocurrency that you will love to share with newbies?In the same way Bitcoin can eventually reach $1M, it can also eventually fall to 0.No matter how much we trust bitcoin, on this world, the only certain thing is that everything (including this world) will eventually turn into nothingness.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FatFork",
      "created_time": "June 02, 2022, 03:47:50 PM",
      "body": "Quote from: Davidvictorson on June 02, 2022, 02:38:13 PMWhat is an unpopular opinion you hold about bitcoin and cryptocurrency that you will love to share with newbies?It's important to remember that if you lose your Bitcoin private keys or seed phrase, you'll also lose all the bitcoins you have in your wallet. This is often the biggest threat to your coins, because in case you lose access to your wallet, there is no way to recover them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oluwa-btc",
      "created_time": "June 02, 2022, 04:22:41 PM",
      "body": "Ain't no wise decision to force folk's too invest in Bitcoin.Everything good will come to an end one day, but before that comes, enjoy the benefits/ liberty Bitcoin gives you.Thanks",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Doan9269",
      "created_time": "June 02, 2022, 04:41:21 PM",
      "body": "we should not be over anxious about our investments in bitcoin or cryptocurrency because what will be will definitely be, then why the panic for nothing but only cause a rise in bp, we are expected to be patient for the time of maturation to come upon our investment, you plant today on the field and go home to rest and wait for growth to occur and lastly, we should always learn to do crypto all by ourselves.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "June 02, 2022, 05:30:33 PM",
      "body": "Quote from: Doan9269 on June 02, 2022, 04:41:21 PMwe should not be over anxious about our investments in bitcoin or cryptocurrency because what will be will definitely be, then why the panic for nothing but only cause a rise in bp, we are expected to be patient for the time of maturation to come upon our investment, you plant today on the field and go home to rest and wait for growth to occur and lastly, we should always learn to do crypto all by ourselves. Funnily enough, that's actually a popular opinion. Bitcoin and most especially other cryptocurrencies aren't guaranteed to increase and can easily go the other way; like what NeuroticFish said.Also, it seems like people are misunderstanding the topic lol. Look up the meaning of \"unpopular\", folks.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BIT-BENDER",
      "created_time": "June 02, 2022, 07:25:05 PM",
      "body": "I don’t know if this is already said but don’t make your move on bitcoin or Bitcoin moves based off News, speculation, hype or what even emanates from social media, many have learnt this the hard way, you should always buy every details under the microscope and check them very well, you solely bare the outcome of your decision here, take it that every news you hear has a disclaimer from the peddler.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JeromeTash",
      "created_time": "June 02, 2022, 09:07:00 PM",
      "body": "What goes up must come down at some point. So even when investing in bitcoin, It's a risky venture just like any other. One must not put all their eggs in one basket.One thing I always tell people who ask me about buying Bitcoin is that they should also think about a scenario where when they buy Bitcoin, it drops in value. They should be mentally ready for the downtrend, too.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hatshepsut93",
      "created_time": "June 02, 2022, 09:24:54 PM",
      "body": "Bitcoin community is an echo chamber that largely repeats only the positive view of Bitcoin. If you spend all your time in Bitcoin community, you may start feeling that lots of people in the world use Bitcoin, that anything that happens in the world will make Bitcoin grow in its price, that it can only go up, that fiat money is on the verge of collapse and so on. But if you visit the outside world, you'll see that people don't know about Bitcoin, don't care about it or even hate it. That's it's nearly impossible to use it as a currency, because no one accepts it. That people don't want to risk holding a volatile currency or store of value, even if there's a good chance they will make a profit. That people don't want financial sovereignty, privacy, zero inflation if it means facing the downsides of Bitcoin - they'd rather stick to the banks.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cookdata",
      "created_time": "June 03, 2022, 12:01:19 AM",
      "body": "If you know you can't hold bitcoin for long term, please never start it, you may regret your action by buying high and selling low, that's the worst thing anyone can do. Bitcoin holding is very rewarding for long term, sometimes short term also may count but I prefer the first.If you can't make security one of your priorities, there is no point in buying bitcoin, holding it and later give out freely to scammers because of carelessness, your security should be your top priority, don't lose guard else you may becomes victim of Bitcoin loss.Lastly, let your investments remain private, there's no points in trying to prove that you hold bitcoin or crypto, you are putting your life at stake, the world is wicked, nobody to be trusted these days.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "June 03, 2022, 05:48:44 AM",
      "body": "Quote from: Davidvictorson on June 02, 2022, 02:38:13 PMWhat is an unpopular opinion you hold about bitcoin and cryptocurrency that you will love to share with newbies?They said there is no such thing as forever. But as I knew bitcoin, I think there is an exemption on that phrase now. Bitcoin will forver exist even 100years from now. As Satoshi makes it a decentralized system wherein no one can even interfere. Regardless its current value no one would ever take away your bitcoin holdings as long as you ar enot getting hype.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FatFork",
      "created_time": "June 03, 2022, 06:28:34 AM",
      "body": "Quote from: JeromeTash on June 02, 2022, 09:07:00 PMWhat goes up must come down at some point.<cut>Does the other way around also apply?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "KingsDen",
      "created_time": "June 03, 2022, 07:44:50 AM",
      "body": "Quote from: Davidvictorson on June 02, 2022, 02:38:13 PMWhat is an unpopular opinion you hold about bitcoin and cryptocurrency that you will love to share with newbies?Incase bitcoin investment fails you or disappoints you by going dip against your portfolio, remember bitcoin is first a currency before it's an investment assetHey newbie! We are late to the game, don't expect that bitcoin will make you reach tomorrow. Wait for years and you will enjoyIf you are a bitcoin hodler, an investment in other coins is not diversification",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "June 03, 2022, 01:20:14 PM",
      "body": "Quote from: KingsDen on June 03, 2022, 07:44:50 AMIncase bitcoin investment fails you or disappoints you by going dip against your portfolio, remember bitcoin is first a currency before it's an investment assetI'd actually say that it's the reverse.  For bitcoin to be a better and more viable currency, it needs to go through a long painful speculative/investment phase first. And when we're at the point of bitcoin having a good amount of liquidity to the point that it's going to be pretty difficult to pump/crash the price, then it will be a far better and more viable currency.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "qwk",
      "created_time": "June 03, 2022, 01:35:02 PM",
      "body": "Not so much \"unpopular opinions\" but rather inconvenient truths:- as a monetary system, Bitcoin is not limited to 21 Million (the network itself is)- the fact that satoshi, an unknown, possibly hostile entity, holds a sizable share of coins, is a ticking time bomb- 51% attacks as a means of \"regulation\" could become a common reality in the future, if government interference leads to control over a majority of miners",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PrivacyG",
      "created_time": "June 03, 2022, 01:42:24 PM",
      "body": "Governments are still not happy about Bitcoin but rather pretend they appreciate and support its existence.  I personally say it is a little bit foolish to believe Bitcoin is truly entering a phase of general acceptance.  They rather did their homework for the past decade and now try their hardest to find alternative ways to destroy Bitcoin's core principles.The 'decentralized' part of how Bitcoin works is going to become somewhat illegal in a matter of years.  You can still use Bitcoin peer to peer but you can also clearly see a shrinkage of the right of using it this way without getting the 'Suspect' label on your forehead and it is getting increasingly harder to avoid third parties and intrusive procedures of identification.-Regards,PrivacyG",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Welsh",
      "created_time": "June 03, 2022, 01:54:45 PM",
      "body": "I have a few: - Bitcoin is too difficult for mass adoption, whether that's as a mainstream currency or a reserve fund type currency. - While having the freedom to be your own bank, it doesn't suit everyone, and could present problems if mass adoption ever did occur. Quote from: qwk on June 03, 2022, 01:35:02 PM- the fact that satoshi, an unknown, possibly hostile entity, holds a sizable share of coins, is a ticking time bomb That's based on speculation which has yet to be proven. You might be right, but I don't think we can label this a truth until it's in fact a truth. Quote from: qwk on June 03, 2022, 01:35:02 PM- 51% attacks as a means of \"regulation\" could become a common reality in the future, if government interference leads to control over a majority of minersPotentially, although the cost justification would be huge. I guess as less miners are mining in the future, due to no more block rewards, then it's probably more of a possibility. However, that's so far away, I'm not going to be around to see it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "June 03, 2022, 02:21:58 PM",
      "body": "Quote from: qwk on June 03, 2022, 01:35:02 PM- the fact that satoshi, an unknown, possibly hostile entity, holds a sizable share of coins, is a ticking time bombDepends what you specifically mean by \"ticking time bomb\", but if it's the case that Satoshi dumped the coins in one go(which isn't smart to start with) — sure the price will crash undoubtedly, but it's also undoubtedly going to be a temporary event. If anything, I'd be drooling to buy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}