{
  "id": "topic_5458266",
  "title": "S3cco",
  "author": "S3cco",
  "created_time": "July 01, 2023, 09:33:34 PM",
  "content": "Wiki Finance Expo Sidney 2023 | November 16, 2023 | Sidney, AustraliaEvent Website: https://www.wikiexpo.com/Australia/2023_EN/auexpo.htmlWikiExpo is the world's leading financial exhibition and fintech conference brand, holding large summits annually in Singapore, Sydney, Dubai, Hong Kong, and Bangkok to gather and connect global high-quality resources for exhibitors and participants, which include enterprises, start-ups, project owners, investors and practitioners in the fields of blockchain, fintech and forex. In addition, we create thousands of cooperation opportunities for the industry every year.50+ Speakers / 100+ Exhibitors / 10,000+ Attendee",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5458266",
  "comments": [
    {
      "author": "wallet4bitcoin",
      "created_time": "October 05, 2023, 06:46:41 AM",
      "body": "It's great to see that loads of global adoption strategies are being taken into consideration by various projects, brands and in some cases individuals. We are in dire need of onboarding loads of people to know about the space and through these kind of conferences and meetings, we create a direct engagement that better sensitizes these prospects on what the technology is all about and why people need not run away from it, rather, explore it to their advantage.   A big Kudos to Wiki Finance.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "S3cco",
      "created_time": "October 30, 2023, 12:32:18 PM",
      "body": "Wiki Finance Expo Sydney 2023 Is Coming Soon https://bitcoingarden.org/wiki-finance-expo-sydney-2023-is-coming-soon/ Taking place on November 16th, Wiki Finance Expo, Sydney 2023 is Aussie largest and most anticipated fintech event of the year. An excellent opportunity to meet with 3000+ industry representatives, project owners, VCs, developers, cryptocurrency and forex traders, fintech-providers and gamers under one roof. Thousands of collaboration opportunities will be generated in a single day, because nearly everyone in the industry and all great projects will be there.As a leading global platform for financial exhibitions and FinTech conferences, Wiki Finance Expo hosts large-scale summits annually in Singapore, Sydney, Dubai, Hong Kong, Malaysia and Bangkok. Every event attracts the attention and expectations of the industry. It is not the first time that Wiki Finance Expo has taken place in Australia, and it is grander than ever. As one of the most magnificent expos in the industry, WikiEXPO has always regarded Australia as “the land of opportunity” for the development of forex and blockchain industry in the world....",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}