{
  "id": "topic_5460023",
  "title": "Mate2237",
  "author": "Mate2237",
  "created_time": "July 16, 2023, 05:34:48 PM",
  "content": "Dis questions been dey my mind since but I don't know how I wan place am for people to understand but today I say let me ask am make others tell us weti dem go do wen di time reach. Now di question be sae, we are all waiting for di \"All Time High\" of Bitcoin, now when di time come, you go \"sell all your bitcoin or u go kep some\"? Because of the ATH people dey buy dey kep while some dey save from their campaign pay so all di ones you dey save go end for the ATH? Then after that time, when the bear come again you go start afresh again? Or how u take plan the journey. As for me, I go sell 99% of my investment and hodle 1% to enter the bear market again and continue the investment from there again, I will not empty the bitcoin wallet Bank. How you see am?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5460023",
  "comments": [
    {
      "author": "SmartGold01",
      "created_time": "July 16, 2023, 05:55:48 PM",
      "body": "This thing you talk now self na serious thin wey be say we don dey wait for to come but, as everi body dey panic about bullrun e go end after in run reach ATH because the majority of pipo wey dey here need money and them dey wait make the thin increase as e supposed be so that them fit make their gain and cash out hugely.On a normal stances we know say majority of people wey dey ginger for market to increase no get any other plans than just cash out when e enter better price then take small break watch the market again before them buy at very low price. Somebody like me never save from my current campaign but e get the one wey I used my money buy keep to waiting make the market show me love before I go push am out. So like this I dey wait make the market give us potential Green so that we go happy join.But anyhow everything dey your hands because you fit decides to sell when the time reach or keep am after the bull run but one thing I sense be say if you no sell the market go still drop and you go still regret why you no sell.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hyphen(-)",
      "created_time": "July 16, 2023, 06:27:39 PM",
      "body": "Quote from: Mate2237 on July 16, 2023, 05:34:48 PMDis questions been dey my mind since but I don't know how I wan place am for people to understand but today I say let me ask am make others tell us weti dem go do wen di time reach. Now di question be sae, we are all waiting for di \"All Time High\" of Bitcoin, now when di time come, you go \"sell all your bitcoin or u go kep some\"? Because of the ATH people dey buy dey kep while some dey save from their campaign pay so all di ones you dey save go end for the ATH? Then after that time, when the bear come again you go start afresh again? Or how u take plan the journey. Almost everyone that invested in Bitcoin is not just waiting for its all time high, but also waiting for Bitcoin price to exceed the previous all time high so that the we will be satisfied future we are predicting in Bitcoin, with our predictions that Bitcoin price will go above its all time high during halving.QuoteAs for me, I go sell 99% of my investment and hodle 1% to enter the bear market again and continue the investment from there again, I will not empty the bitcoin wallet Bank. How you see am? There is no point of keep holding your Bitcoin if you really wants to take your profits during halving, although I will also sell mine but I will wait if the price go above its all time high, then wait for another opportunity to buy when the market go down again.I will also hold some Bitcoin for future purposes because no one can tell how it is going to be after then, who know maybe the price will just keep moving without going down again",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BIT-BENDER",
      "created_time": "July 16, 2023, 06:46:50 PM",
      "body": "Well I think the vision for Bitcoin now is to pass the all time high and I think Bitcoin can actually do it, selling of at the current all time high fit be a mistakes as the Bitcoin halving na next year although this is not to say that it's a guarantee upward movement for Bitcoin but I am very optimistic. I believe that bitcoin can reach the all time high and surpass the current all time high by a good margin so it's important to understand the abilities of Bitcoin and try to work your plans for Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zanab247",
      "created_time": "July 16, 2023, 06:47:56 PM",
      "body": "Quote from: Mate2237As for me, I go sell 99% of my investment and hodle 1% to enter the bear market again and continue the investment from there again, I will not empty the bitcoin wallet Bank. How you see am? That was my plan before, but since dis new government came with so much hardship, I have changed my mind to empty my BTC wallet once d price reach #40,000,000 so that I can sell to make a good money that can help me to withstand dis strong inflation that is pushing someone here and there. To me, leaving d 1% of BTC in your wallet will not bring any profits to you until you start buying again to add to d 1% that remain, I don't think I will try such strategy in dis season.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Smartvirus",
      "created_time": "July 16, 2023, 07:17:11 PM",
      "body": "Quote from: BIT-BENDER on July 16, 2023, 06:46:50 PMWell I think the vision for Bitcoin now is to pass the all time high and I think Bitcoin can actually do it, selling of at the current all time high fit be a mistakes as the Bitcoin halving na next year although this is not to say that it's a guarantee upward movement for Bitcoin but I am very optimistic. Na true you talk. No be to wait make this ATH come but, na day when e come, make e go create another one. Still on still, if you sell for either of them, you hate understand say, you dey lose even. That na because, the ATH way the next bull market fit set, e still no be the last ATH for bitcoin. Bitcoin still get plenty waka for en leg until majority of our world don dey hooked up on the network and as e be so with all these prices way dey make our belle sweet, e no fit go round.Better still, even as you dey try hodl or invest more money into the system, that no stop you to enjoy am small, use am as currency way e be but, use your head dey run am and no forget say, as you dey sell, you dey lose as well.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptopreneurBrainboss",
      "created_time": "July 16, 2023, 11:20:00 PM",
      "body": "Quote from: Mate2237 on July 16, 2023, 05:34:48 PMDis questions been dey my mind since but I don't know how I wan place am for people to understand but today I say let me ask am make others tell us weti dem go do wen di time reach. Now di question be sae, we are all waiting for di \"All Time High\" of Bitcoin, now when di time come, you go \"sell all your bitcoin or u go kep some\"? Because of the ATH people dey buy dey kep while some dey save from their campaign pay so all di ones you dey save go end for the ATH? Then after that time, when the bear come again you go start afresh again? Or how u take plan the journey. The thing be say you get other investment wey you wan cashout from your Bitcoin bag take put for that business? If you no get and na Bitcoin be your investments there's no need selling as you fit sell at the wrong time. Or possibly no enter back the market at the right time. To eliminate all this stress to dey observe the market, you fit just sell wetin you go use hold body throughout the whole bear market and keep the rest for your wallet. You go just commot mind say you get Bitcoin until the next halving and bull run come. To sell all in hopes of buying them at cheaper price dey alright but you go fit follow through the idea and you no go chicken out because of fear say market fit fall again.Me I never sall Bitcoin say market dey go down, as I get am na so I get and anytime wey I need small change to use hold body, I go just rush go sell small use chop. I dun try this selling everything and waiting for the bear to come before I start the journey all over and e no favor me. As the money enta Naira na so I rush go use am buy something wey I dey regret somehow to this day. The investment no bad but it was at the wrong time because of to say I just leave all the money for Bitcoin, I for dun get better retuns pass the investing wey I do. If you know say you no go need cash urgently and the small small money wey you dey get here and there go dey enough for you, just forget am and lock up.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Davidvictorson",
      "created_time": "July 17, 2023, 05:18:33 AM",
      "body": "Quote from: Mate2237 on July 16, 2023, 05:34:48 PMDis questions been dey my mind since but I don't know how I wan place am for people to understand but today I say let me ask am make others tell us weti dem go do wen di time reach. Now di question be sae, we are all waiting for di \"All Time High\" of Bitcoin, now when di time come, you go \"sell all your bitcoin or u go kep some\"? Because of the ATH people dey buy dey kep while some dey save from their campaign pay so all di ones you dey save go end for the ATH? Then after that time, when the bear come again you go start afresh again? Or how u take plan the journey. If I tell you say I Sabi wetin I go wen Bitcoin reach e ATM eh na lie. I fit get idea but as our people dey tok, man proposes God disposes. Make the time come first because na wetin all of us they wait for. The idea wey I get wey deyy mind say I go do when e reach ATM na say I go remove the profit from the initial money wey I put there then allow am to multiply again until e reach another all time high. Well, that day dey come and we all go experience am.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kelward",
      "created_time": "July 17, 2023, 09:40:29 AM",
      "body": "Personally I de like to chop remain, because evendo nobody fit to predict tomorrow, e must surely come. So for dis matter of bitcoin ATH, even if I de anticipate say di price go high well well and I go make huge profit, if I sell, that one no go make me to cashout my investment. Sofa bitcoin na investment wey I believe in, when di market reach all time high, I go decide the percentage wey I go sell, based on how I take need money at di time, but no matter how I need di money reach, I must remain something quite substantial for my going concern. Like for economics, bitcoin de oscillating, when market de favourable many people go de buy, but when di market begin to de experience loss, many people go de exit, at a time only di people wey withstand di loss go remain, eventually demand go de high again and dem go begin to gain more.Like di topic wey I start for bitcoin discuss board, e prove sa bitcoin no be gamble, https://bitcointalk.org/index.php?topic=5459424.msg62534957#msg62534957  . So far say you understand di volatility of bitcoin and you fit to understand di chart, no need to cashout, even if if you see plenty profit. Because after bear run, bull go follow. Na my opinion.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Marykeller",
      "created_time": "July 17, 2023, 02:55:53 PM",
      "body": "Em don tey my mind the ring for the ATH of bitcoin to happen. Since em go be my first halving/bull run wey I go witness and d fully prepared of. I no fit ascertain how em go be sha but looking at my bitcoin and altcoin holding d give me joy cos I no sae wetin d ahead during the bull run by next year give rise to a new ATH of bitcoin wey go surpass the previous one wey happen. When bitcoin give a new ATH of bitcoin, I no d sure sae I go keep small. I go sell 100% of my bitcoin and altcoin holding asap. Sae na because every 4years wey be bitcoin halving d happen and after that, the bitcoin price go skyrocket wey go give bitcoin ATH. The moment wey Bitcoin don reach em ATH for 2025 probably, what follows next go be bearish market. The crypto market is expected to turn red, making the price of bitcoin to fall drastically. My strategy go na be to enter the crypto market in the  bearish market to start to the accumulate bitcoin at low price, hodl am till another halving season wey give birth to another ATH of bitcoin wey you go na sell off. Em go be like a continuous process",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Stable090",
      "created_time": "July 17, 2023, 10:28:26 PM",
      "body": "Quote from: Mate2237 on July 16, 2023, 05:34:48 PMDis questions been dey my mind since but I don't know how I wan place am for people to understand but today I say let me ask am make others tell us weti dem go do wen di time reach. Now di question be sae, we are all waiting for di \"All Time High\" of Bitcoin, now when di time come, you go \"sell all your bitcoin or u go kep some\"? I don dey wait make bitcoin hit all time him, anytime wey bitcoin hit am I no go sell all na just like 80% of my bitcoin na him I go sell, then d remaining 20% go still remain inside I go dey look am for wallet keep, but I go sell 80% use money do necessary things wey I go wan do by that time and I go don reserve money wey I go use buy bitcoin back if bear market enter again because after bull run, make we dey expect bear market again. Quote from: Mate2237 on July 16, 2023, 05:34:48 PMBecause of the ATH people dey buy dey kep while some dey save from their campaign pay so all di ones you dey save go end for the ATH? Then after that time, when the bear come again you go start afresh again? Or how u take plan the journey. I dey save small amount weekly from my signature money and I still dey buy more maybe I do work and I get money wey I know say I no go use for now, I go just use am buy am leave am for wallet, but if bull run start, awi sell most of it, keep small money to buy back and I go still continue to dey save from my signature money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gozie51",
      "created_time": "July 18, 2023, 08:32:04 AM",
      "body": "Quote from: Mate2237 on July 16, 2023, 05:34:48 PMAs for me, I go sell 99% of my investment and hodle 1% to enter the bear market again and continue the investment from there again, I will not empty the bitcoin wallet Bank. How you see am? My brother I no go blame you if you say you go dump everything remain just 1% because if btc bear season do you something, you go sabi something. As the bull dey sweet na so d bear dey pain, oh.... This just remind Timaya song, as e dey pain Dem, e dey sweet us; where wike dey now self? abi him don get wetin him dey find for aso rock  Anyway, one thing with crypto be say you no fit no the ATH until price no reach there again for that halving season. Just like e happen for $64k mark, people still go dey expect say e go fly enter $100k. For 2017 too, the same thing happen around the December when the price begin come down after e reach 20k, people still dey buy Dem only know say na bull trap wey dem buy when price drop to $3,500. So e good say make we salivate say we go chop money from the btc wey we dey reserve for the bull next year but make we still try no leave our coins when we suppose dump. I know say many of us dey expect to get something from bull and me too go dump at the price wey I dey okay. At least 1 or 2 percentage be wetin I fit leave because bear season no bi person friend.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lida93",
      "created_time": "July 18, 2023, 02:10:45 PM",
      "body": "Omoor I no lie oh, if the ATH eventually take place nah me go hapi pass, in fact I go feel like Declan Rice.  as God may have it I don already put my plans in place, nah to withdraw keep small amount to use follow up for the next ATH throughout the bear period again. It good make person first the withdraw the one wey don mature use am do something meaningful for life wey eyes go dey see say nah wetin I achieve from BTT and BTC just in case the unexpected happen for the future of the coin. How u see am nah?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptoHeadlineNews",
      "created_time": "July 18, 2023, 03:05:21 PM",
      "body": "Quote from: Mate2237 on July 16, 2023, 05:34:48 PMAs for me, I go sell 99% of my investment and hodle 1% to enter the bear market again and continue the investment from there again, I will not empty the bitcoin wallet Bank. How you see am? We all know say the current all time high of Bitcoin nah $68,789.63 at the moment and anything above that price figure will be considered as new all time high of Bitcoin, so at O.P, are you trying to say that if Bitcoin now happens to reach let's say $68,790.00 (i.e an addition of $1) say you go rush go say 99% of your current investment? Is that what you mean? Because by virtue of that term \"All Time High\", any dollar above the previous is automatically the new all time high.So what have you to say about this @ O.P, as $68,790.00 is times two plus of it's current price.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Merit.s",
      "created_time": "July 18, 2023, 03:31:04 PM",
      "body": "Quote from: CryptopreneurBrainboss on July 16, 2023, 11:20:00 PMMe I never sall Bitcoin say market dey go down, as I get am na so I get and anytime wey I need small change to use hold body, I go just rush go sell small use chop. I dun try this selling everything and waiting for the bear to come before I start the journey all over and e no favor me. As the money enta Naira na so I rush go use am buy something wey I dey regret somehow to this day. The investment no bad but it was at the wrong time because of to say I just leave all the money for Bitcoin, I for dun get better retuns pass the investing wey I do. If you know say you no go need cash urgently and the small small money wey you dey get here and there go dey enough for you, just forget am and lock up. Boss,I don dey use style reason this your talk o. Make e no be say person sell all and later come dey regret because you no go fit get that amount of bitcoin again,even if you buy during the bear. I guess say I go follow this your advice since you don tey for this game. But the truth be say me I need money and I don put say na this next bull run, I sell my coins use package my life but as you don talk from your own experience, I go just sell 50% of my investment only. Selling all for make sense but nobody knows tomorrow,e sharp.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mate2237",
      "created_time": "July 20, 2023, 04:04:56 PM",
      "body": "Quote from: CryptopreneurBrainboss on July 16, 2023, 11:20:00 PMThe thing be say you get other investment wey you wan cashout from your Bitcoin bag take put for that business? If you no get and na Bitcoin be your investments there's no need selling as you fit sell at the wrong time. Or possibly no enter back the market at the right time. To eliminate all this stress to dey observe the market, you fit just sell wetin you go use hold body throughout the whole bear market and keep the rest for your wallet. You go just commot mind say you get Bitcoin until the next halving and bull run come. To sell all in hopes of buying them at cheaper price dey alright but you go fit follow through the idea and you no go chicken out because of fear say market fit fall again.Na di time wey bitcoin go go up well well nai I dey tok so wen day time come, many of us go sell weti we don invest and nai make I said me I go sell 99% nd come keep di remaining 1% for di next bear to come so I can add up with di wons o go invest again. Because really it will not bi nice to sell all di coins and stay for coinless and u come dey wait till di market go go down again before you go come get coins again through buying on p2p. For now I dey sell from my trading profit dey hold body and soul. And I know sae many of us dey wait nfoe the ATH to disburse our coins to do some major projects in our areas. God go bless us and Him no go same us.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaNNy001",
      "created_time": "July 20, 2023, 04:46:07 PM",
      "body": "Quote from: Mate2237 on July 20, 2023, 04:04:56 PMQuote from: CryptopreneurBrainboss on July 16, 2023, 11:20:00 PMThe thing be say you get other investment wey you wan cashout from your Bitcoin bag take put for that business? If you no get and na Bitcoin be your investments there's no need selling as you fit sell at the wrong time. Or possibly no enter back the market at the right time. To eliminate all this stress to dey observe the market, you fit just sell wetin you go use hold body throughout the whole bear market and keep the rest for your wallet. You go just commot mind say you get Bitcoin until the next halving and bull run come. To sell all in hopes of buying them at cheaper price dey alright but you go fit follow through the idea and you no go chicken out because of fear say market fit fall again.Na di time wey bitcoin go go up well well nai I dey tok so wen day time come, many of us go sell weti we don invest and nai make I said me I go sell 99% nd come keep di remaining 1% for di next bear to come so I can add up with di wons o go invest again. Because really it will not bi nice to sell all di coins and stay for coinless and u come dey wait till di market go go down again before you go come get coins again through buying on p2p. For now I dey sell from my trading profit dey hold body and soul. And I know sae many of us dey wait nfoe the ATH to disburse our coins to do some major projects in our areas. God go bless us and Him no go same us.Bro if you go sell when BTC don reach new ATH  watin come be the difference of selling all and selling 99% and leaving 1% because me I no come understand you oo that 1% of your coins wey u wan leave me feel na just waste of time because when BTC go high well well the value sef go much and me I no say I go happily sell all because  I know say the bear go come again then I go start accumulation from that time again.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}