{
  "id": "topic_5430183",
  "title": "MarkusH",
  "author": "MarkusH",
  "created_time": "December 19, 2022, 03:40:12 PM",
  "content": "Hey guys!First of all, thanks for pushing the crypto adoption and for helping me in different situations!I wanted to share with you my experience with Nebeus and their money accounts, which essentially are bank accounts with IBAN and Sort Codes for crypto hodlers.Well, I discovered their money accounts a while ago on the recommendation of a friend of mine. I have had problems transferring money from my bank to various exchanges. My bank would block my credit card for buying crypto. However, since I discover them, I use their money accounts as my primary bank account. Thanks to this feature, my IBAN is connected to my personal crypto account in the same app and I instantly transfer money from one account to the other. I personally receive my salary there and buy crypto right away.Here you have a small explanation that I have taken from their newsletter for better understanding:“Money Accounts are now live on Nebeus!This new upgrade will allow you to get your personal European IBAN & UK Sort Code accounts. With them, you will be able to receive crypto from any exchange or wallet (such as Binance, Metamask, Ledger, etc.), exchange it into fiat, and send it instantly to your money account. In this way, you will have an immediate connection between your crypto and money account.Also, many other possibilities have just been activated! With money accounts now Nebeus can be your main fiat account allowing you to receive funds from third parties (such as your salary), pay your bills, and of course, instantly send your funds to your Nebeus crypto account and take advantage of our complete ecosystem of crypto services.”If someone manages to open the fiat account please write it here. I have made small transactions and everything runs perfectly. I thought it was worth sharing as I found this product super convenient!",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5430183",
  "comments": [
    {
      "author": "MoonCornelia",
      "created_time": "January 17, 2023, 01:40:31 PM",
      "body": "Hey! I have a Nebeus Money Account too!I have been there too! My bank has blocked my credit cards several times when buying crypto for no reason too!Thanks to them, now I can convert my crypto into cash (and vice versa) and transfer it to my Nebeus IBAN easily. No blocking, no time-consuming steps! Easy.I have a Whale account (I think that they offer 3 account types with different limits).For those wondering about the limits of this account, I can transfer up to 750,000 EUR per day.Let's hope that they will list more coins soon, though! That will be game changer!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}