{
  "id": "topic_5404736",
  "title": "Robert518",
  "author": "Robert518",
  "created_time": "July 01, 2022, 08:18:24 AM",
  "content": "Now that Michael Saylor and El Salvador have purchased BTC at $19,000, we can be certain that the bottom is nowhere near",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5404736",
  "comments": [
    {
      "author": "mk4",
      "created_time": "July 01, 2022, 08:25:39 AM",
      "body": "How is literally anyone buying bitcoin be a sign of a near-bottom? Not to mention that this isn't even the first time Saylor or Bukele bought bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Apocollapse",
      "created_time": "July 01, 2022, 08:25:58 AM",
      "body": "So if a popular person, company or country bought Bitcoin in certain price, they always bought at the bottom? lol, this is really a bad assumption.Actually they're bought every dip, before $19K they ever bought at higher price and this doesn't mean they're lose hope in Bitcoin. They're telling people to trust Bitcoin by buy every dip, not sold your coins because of panic.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ImThour",
      "created_time": "July 01, 2022, 08:28:17 AM",
      "body": "I bought 0.1 BTC today and let's call it bottom. That's too stupid of you to assume that someone's buying may call it a bottom.That's not how it works buddy. There is liquidation, volume, supply, demand, institutions, and retailers working all together to bring prices up and down.Also, Saylor's buying is a sort of short indicator and prices do drop from the price of his buying which happened yesterday. Went from $20k to $18.5k.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "July 01, 2022, 08:29:01 AMLast edit: July 01, 2022, 10:07:41 AM by Charles-Tim",
      "body": "El Salvador bought bitcoin when bitcoin dropped to $30000, recently, like few days ago, Microstrategy bought more bitcoin, and El Salvador bought bitcoin again today at $19000. Do you mean because Microstrategy and El Salvador purchased bitcoin, the price will not go down further or that the price may still go down further? Just know that this time is a bear season, it can last for a whole year, even a slight bull market can deceive. But bitcoin does not depend on anyone, just buy and hold for now and leave it for like 2 years, the bear market will be over and a strong bull run will follow, but this can be after next bitcoin halving.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NeuroticFish",
      "created_time": "July 01, 2022, 08:29:25 AM",
      "body": "Quote from: Robert518 on July 01, 2022, 08:18:24 AMNow that Michael Saylor and El Salvador have purchased BTC at $19,000, we can be certain that the bottom is nowhere nearYou should do a quick search and see what DCA means. Because what Michael Saylor does is DCA. He buys whenever he has money for that, no matter the price. He has done that in bull market, he does that in bear market.And since he's at a potential loss now (the USD value of what he's bought is smaller than the price he has paid), also means that there's absolutely no correlation between bottom and Michael Saylor's buys.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "crwth",
      "created_time": "July 01, 2022, 08:39:08 AM",
      "body": "How the heck would you know that it's the bottom? I know they are significant players in the cryptocurrency scene, and they have a lot of BTC in their belt; it just doesn't make sense that it's nowhere going to be near the bottom or something.Your topic doesn't have any complete sense. It's nowhere near the bottom, so are you saying that those who bought at $19000 are the indicators?Or you are saying that since people are still buying at $19000, there is still a chance people are still selling at that price, right?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mindrust",
      "created_time": "July 01, 2022, 08:53:24 AM",
      "body": "Quote from: Robert518 on July 01, 2022, 08:18:24 AMNow that Michael Saylor and El Salvador have purchased BTC at $19,000, we can be certain that the bottom is nowhere nearPossibly. The FED will keep increasing them rates till the end of the year. (so they say) So we can expect more pain till January. BTC is trying to defend $19k bravely but sadly there are more paper hands and diamond hands. In the end there will be a price floor for btc. We just don't know if it is at $19k or $10k or lower. But when it stabilizes there, the next upwards movement will be pretty wild. Probably $100k or more.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "xSkylarx",
      "created_time": "July 01, 2022, 09:33:53 AM",
      "body": "Quote from: Robert518 on July 01, 2022, 08:18:24 AMNow that Michael Saylor and El Salvador have purchased BTC at $19,000, we can be certain that the bottom is nowhere nearThey've been buying since bitcoin dumped from $50k and we still keep falling after that so how can you say we are near the bottom of this dump? Don't treat them as the signal of reversal. Bitcoin can still dump given the current global market situation. They are just DCA-ing like what others are currently doing because no one knows how low this correction can go. Some people says that it would hit $13k making 85% correction from its ATH based from its historical correction when it reached its ATH way back 2017.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "palle11",
      "created_time": "July 01, 2022, 10:21:18 AM",
      "body": "Your assumption may not be right. In fact they might be part of those that are not sure of the next price movement and they decide to go in now. So even that more hands like you and others jump in with them to push price up, the price will still drop if the bear circle has not complete.FOMO is not only happening to small hodlers or micro individuals. They might be experiencing that likewise and couldn't wait to regret more. I don't really see your assumption as tangible. Also remember that the month ended still on bear so there is possibility that it can drag price down further.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TheUltraElite",
      "created_time": "July 01, 2022, 10:47:14 AM",
      "body": "Quote from: Robert518 on July 01, 2022, 08:18:24 AMNow that Michael Saylor and El Salvador have purchased BTC at $19,000, we can be certain that the bottom is nowhere near Dont depend on what celebs are doing to decide you buys or sells. Bitcoin might take time to recover so you have to keep both sides ready. Bottom or Peak, it does not really matter, just treat them as numbers and compare with old charts how bitcoin recovered from every so called \"bottom\". Also do not assume any price to be a bottom, a downtrend once again is possible but there will be recovery, just that traders need to stop thinking that this might be the end of the bull/bear.There is money to be made at every level, just that you have to be cunning enough to wait and buy-sell at the proper time. You may miss out on some, it does not matter, but try to make the most of the bear run.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "July 01, 2022, 10:55:49 AM",
      "body": "Quote from: mk4 on July 01, 2022, 08:25:39 AMHow is literally anyone buying bitcoin be a sign of a near-bottom? Well, every time Bukele buys the dip we go further down the slope.The only thing that might point to this being actually the dip is that this buy of 80BTC seems to be the smallest to date, so for a trader doing everything wrong to date this might have been the time to go all in. Unfortunately, I wonder how much money Salvador can afford to \"invest\".Quote from: NeuroticFish on July 01, 2022, 08:29:25 AMYou should do a quick search and see what DCA means. Because what Michael Saylor does is DCA. He buys whenever he has money for that, no matter the price. I don't see how what he does can be called DCA, if you stick to DCA you have to stick to a schedule and of equal amounts, buying when you have money is nowhere close to it, is just gambling. One of their buys was equal to 1/3 of their total, no average to be seen here..LE:I know the chart is incomplete but every single one that was showing 2022 was just ugly as hell.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NeuroticFish",
      "created_time": "July 01, 2022, 11:16:18 AM",
      "body": "Quote from: stompix on July 01, 2022, 10:55:49 AMI don't see how what he does can be called DCA, if you stick to DCA you have to stick to a schedule and of equal amounts, buying when you have money is nowhere close to it, is just gambling. One of their buys was equal to 1/3 of their total, no average to be seen here..You do have a point indeed. I'd say that he does the DCA in the same way I do it: buy (periodically) whenever you have some liquidity available.The thing is that he doesn't always have at hand as much fiat as he'd like. At least that's how I see it.But you're right. It's not exactly by the book.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fivestar4everMVP",
      "created_time": "July 01, 2022, 12:48:20 PM",
      "body": "Quote from: Robert518 on July 01, 2022, 08:18:24 AMNow that Michael Saylor and El Salvador have purchased BTC at $19,000, we can be certain that the bottom is nowhere nearCrypto currency prices are 99.99 percent unpredictable, it is almost impossible to to tell when the deep is, we cant tell if the market will reverse and start going up or continue to dump.That some entities or individuals bought Bitcoin is not something to depend on a means of ascertaining whether the bottom is near or not, Celebrities bought just the same way me and you have been buying ever since the drop in price began, If the price of Bitcoin turns around now and start going up , the fact celebrities bought it have little to nothing to do with that in my personal view.When more persons are buying Bitcoin, price will rise, but when more persons are selling, price will drop, it doesn't matter whether a celebrity bought it or not.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "notocactus",
      "created_time": "July 01, 2022, 03:03:24 PM",
      "body": "Quote from: Robert518 on July 01, 2022, 08:18:24 AMNow that Michael Saylor and El Salvador have purchased BTC at $19,000, we can be certain that the bottom is nowhere nearDon't try to find a bottom. When you have believe in Bitcoin and see a price falls 70% or 80% from its latest all time high, you can consider to accumulate it.The market now is like the one in 2018. You don't know how long will the bear market last and you can not know where is a final bottom. When a new bull run starts and tops up like reaching to $60,000 in 2021 then it does not matter you buy Bitcoin at $6,000 or $9,000 or $13,000 months or years ago.Now, it is the same situation, bottom can be $17,600 or $12,000 or $10,000 but is it matter if a new all time high in 2024 or 2025 will be $100,000 or $150,000 for one Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dart18",
      "created_time": "July 01, 2022, 03:26:54 PM",
      "body": "Don't take it seriously. Many investors will think this is the bottom and that's a good thing for all the holders but that doesn't mean this is also a sign for a bull to happen again. That's just two, let's wait for even small investors to get back to track as the economy is nowhere normal yet. Who would buy at this crisis? We cannot expect the rich to do it as they are also pessimistic about any investment now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bittraffic",
      "created_time": "July 01, 2022, 03:40:27 PM",
      "body": "Pres. Bukele afaik also bought at $50k and didn't sold when the price went ATH.  For traders I think it would be stupid for not selling but both of them Saylor and Bukele are in BTC a long term. It wouldn't matter to them if its bottom or not.But perhaps this time they care to listen to when the right time to buy because after all the indicators are saying bottomed.  I bought a little bit of BTC too hoping this is really bottom.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tvplus006",
      "created_time": "July 01, 2022, 03:41:32 PM",
      "body": "Quote from: Robert518 on July 01, 2022, 08:18:24 AMNow that Michael Saylor and El Salvador have purchased BTC at $19,000, we can be certain that the bottom is nowhere nearThese purchases may have an impact on small traders, but they cannot affect the market in any way. And the purchase of MicroStrategy 480 BTC, can not change the average cost of the position, which is now a little more than 30 thousand dollars. These purchases indicate that Michael Saylor is optimistic about the current bear market and believes that the value of bitcoin has reached the bottom, at which the investor needs to make purchases.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ptk1",
      "created_time": "July 01, 2022, 05:37:21 PM",
      "body": "I think for that it will creat small impact. But for big impact need big news. Like Ukraine, Russia war related good news. I also think $15.5k is bottom level of Bitcoin. We are still in bear market. So predict the bottom price of bitcoin is really tuff. For up train market we have to wait. And also have to wait for understand exact bottom level of bitcoin and total currency.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "July 01, 2022, 05:38:43 PM",
      "body": "Quote from: tvplus006 on July 01, 2022, 03:41:32 PMThese purchases may have an impact on small traders, but they cannot affect the market in any way. And the purchase of MicroStrategy 480 BTC, can not change the average cost of the position, which is now a little more than 30 thousand dollars.They literally affect the markets though. Both entities literally made buy orders, affecting the orderbooks in a positive way; and both entities have been showing long-term bullishness despite the price drawdown. The only question is, will their influence have a significant and noticeable effect on the markets? Most probably not, but they technically do have a positive effect.Quote from: tvplus006 on July 01, 2022, 03:41:32 PMThese purchases indicate that Michael Saylor is optimistic about the current bear market and believes that the value of bitcoin has reached the bottom, at which the investor needs to make purchases.Or maybe they're just being smart by not trying to fish for bottoms, and instead are just buying slowly.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}