{
  "id": "topic_5402195",
  "title": "Gozie51",
  "author": "Gozie51",
  "created_time": "June 11, 2022, 01:48:43 PM",
  "content": "For a long time, I understand and can explain politics by a simple definition as a means of sharing scarce resources and I think this explanation in humility and honesty is not far from what politics is. At every point, you need some constituent that either elect or receive something for a larger or smaller group, this is the light of means of sharing scarce resources amidst dialogue, compromise (including bribery), lobby and other terms to arrive at the point to share, represent or and receive. In other words, some people called politicians (That is the actors of politics) have not done any other tangible or known jobs that is not \"politicking\". To those actors politics is seen as investment that they do and they stake out money like gambling or trading with the hope to get more in return and they would do anything to ensure that money staked , \"invested\" does not go without a return. Typical idea of investment. I don't know if in other countinent of the world whether the above view of politics is same there but this is typical of modern day African politics with Nigeria as an example. The Nigerian political system is saturated with deep pockets politics and money bags parading in corridor of power. This is the reason that a ruling political party president form for indication of interest to run as candidate of the party is sold for #100,000,000, equivalent of $167,000. The form was bought by 23 candidates. I guess you can do the mathematical calculation to know how much that accrues to. Further to it, out of the 23 that bought the form , 10 were screened out of the contest (of course the money is non refundable).Consequently, 13 candidates were approved for the contest but at the eve of the primaries, the need to step down interest to run arose and there began the intrigues of politics, the bribes, the lobby and promises and cajoling to outsmart some with money in return for form bought and appointments in future. This is the situation of Nigerian politics and the just concluded party primaries heading for the election in 2023.The question is with these kind of situation of deep pocket politics where people see it as investment to indicate interest in purchase of forms and later stepping down to get an additional benefit like an investment, what do you think ?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5402195",
  "comments": [
    {
      "author": "Newlifebtc",
      "created_time": "June 11, 2022, 07:01:44 PM",
      "body": "Politics is a real investment if some of us don't know this time people who is politicians spend all their life money in order to get the political position so from that process I put them down like somebody who is using money to look for position and that was teir kind of investment. And nobody question them for the illegal thing's they do with money. And when they assumed power embezzlement start and became clearer to their citizens",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "minime0105",
      "created_time": "June 12, 2022, 06:16:12 PM",
      "body": "Quote from: Newlifebtc on June 11, 2022, 07:01:44 PMPolitics is a real investment if some of us don't know this time people who is politicians spend all their life money in order to get the political position so from that process I put them down like somebody who is using money to look for position and that was teir kind of investment. And nobody question them for the illegal thing's they do with money. And when they assumed power embezzlement start and became clearer to their citizensI agree with you on this, politics is a big investment and the politicians are real investors. Judging from what we see in the world today you will see someone who's aspiring to be in a particular position go about hosting people, buying things to empower them just to be elected and when they get into power they move funds that ought to be used for some development to their own selfish gains, every politician is an investor and the money they spend before assuming power is their investment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptocurencyKing",
      "created_time": "June 12, 2022, 10:15:01 PM",
      "body": "Going through school, studying in the universities becomes an investment for your future. So also do politicians think, especially in our own side of the world. Almost 90% of the individuals involved in politics have dreams of ruling one day and so, they dance to the tunes of godfathers to be favoured in the end.While in office, it seems to them that there loyalty and years of toiling has paid off and so, its time to reap with no real intention of making any positive change to the community which your expected to serve. Some how, they've been able to craft the rule of law int there hands and play around it without being scared. It's sad but, thts the reality we face in out part of the world.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "348Judah",
      "created_time": "June 13, 2022, 12:02:38 AM",
      "body": "Quote from: Gozie51 on June 11, 2022, 01:48:43 PMFor a long time, I understand and can explain politics by a simple definition as a means of sharing scarce resources and I think this explanation in humility and honesty is not far from what politics is.the two words humility and honesty is worth questionable on our politicians in this political era, can they really give a yes as an answer to these that they are truly accountable on them, are they the ones serving the people or the people serving them otherwise, its high time we begin to leave by what we say and not just to entice the people with unrealistic pronunciations, your definition of politics as sharing of scarce resources i don't get the main idea hear to what you mean.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Prosperiousproduct",
      "created_time": "June 16, 2022, 09:20:12 PM",
      "body": "Politics is no longer politics. We are just been controlled and pushed to any direction of their choice without a say. Political considerations get in the way. When elections loom, policymakers choose to provide immediate benefits to the electorate through lower taxes or increased income transfer at the expense of public investment, which takes time to come to confuse Other factors. There are other factors that can also play a role in discouraging needed investment. For example, the political orientation of parties that form a government may favor a lower level of public investment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Findingnemo",
      "created_time": "June 16, 2022, 10:49:29 PM",
      "body": "You know something the successful political leaders ( financially ) knows how to invest either its on a person who has the influence or their own advertisement in any form with the tax money so yes its great point. In some countries people have the freedom but in Africa the leaders keep the people busy with the problems so they don't have time to think about picking the right candidate to represent them and fight for the people, politics is getting more dirty so people who is having good heart are actually staying away from it or forced by those corrupted politicians everywhere.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dataispower",
      "created_time": "June 17, 2022, 05:29:20 AM",
      "body": "Quote from: Findingnemo on June 16, 2022, 10:49:29 PMYou know something the successful political leaders ( financially ) knows how to invest either its on a person who has the influence or their own advertisement in any form with the tax money so yes its great point. In some countries people have the freedom but in Africa the leaders keep the people busy with the problems so they don't have time to think about picking the right candidate to represent them and fight for the people, politics is getting more dirty so people who is having good heart are actually staying away from it or forced by those corrupted politicians everywhere. politics who extort money and embezzle funds does not likely invest because they know that with the large and largest investment they have government or incumbent government leaders can petition them in court and take all their belongings for government functions and usage. I believe that no government personality that like to invest physically or property investment due to security purposes. But their money can go to bitcoin directly without hesitation and no body can trace them",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Maestro75",
      "created_time": "June 17, 2022, 07:44:38 AM",
      "body": "The situation you described is a typical Nigeria politics which is deep in corruption. Just look at the money wasted in buying nomination forms and you ask yourself what kind of businesses those who paid that huge amount of money own and run apart from stealing from the citizens in the name of politics. In Europe or America nobody will attempt such shady deal because they know they will be investigated. In Nigeria there is no independent institution to transparently investigate anyone.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Findingnemo",
      "created_time": "June 18, 2022, 05:42:48 AM",
      "body": "Quote from: dataispower on June 17, 2022, 05:29:20 AMQuote from: Findingnemo on June 16, 2022, 10:49:29 PMYou know something the successful political leaders ( financially ) knows how to invest either its on a person who has the influence or their own advertisement in any form with the tax money so yes its great point. In some countries people have the freedom but in Africa the leaders keep the people busy with the problems so they don't have time to think about picking the right candidate to represent them and fight for the people, politics is getting more dirty so people who is having good heart are actually staying away from it or forced by those corrupted politicians everywhere. politics who extort money and embezzle funds does not likely invest because they know that with the large and largest investment they have government or incumbent government leaders can petition them in court and take all their belongings for government functions and usage. I believe that no government personality that like to invest physically or property investment due to security purposes. But their money can go to bitcoin directly without hesitation and no body can trace themDo you think every black money is going to Bitcoin? Then why Switzerland bank is so popular for all those rich people and considered as one of the best place to hide their money which they earned?Leaders don't really keep their money in their own, they have lot of people to invest on the behalf of them so they don't really have any trace and even if they get caught they will have no money on their own but they hold everything in their offshore accounts.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zlantann",
      "created_time": "June 18, 2022, 07:44:24 AM",
      "body": "Its a big shame that politics in Africa is now a money making venture. Almost all politicians are into politics not to serve the people but to enrich themselves, families and cronies. The high cost of engaging in politics have given birth to godfatherism. Those that don't have the funds to sponsor their political career result to aligning to a rich and greedy godfather that gives them terms and condition for their support. These godfathers exploit the state because they need to get back their fund and make good profit. Instead of serving the people the people become slaves to the godfather and godson. The high cost of candidate forms is a calculated political strategy by the political class to exclude the common man from exercising his right to be voted for. But it would not last for ever because you cannot deceive, exploit and oppress the people for life. One day the people out of frustration and hunger would revolt.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yawa2020",
      "created_time": "June 27, 2022, 09:13:09 PM",
      "body": "Politics everywhere in the world has become a business venture but coming down to Nigeria here, it becomes absolute business and investment 😂 its in our DNA, we abuse anything that comes our way including power. The truth is that, the benefits attached to political offices are too juicy that every individual will fight so hard in order to obtain such office. No any sane and well-meaning person will step down for another because of future appointments or whatsoever he or she is promised but contrary is the case here. On this ground, I commend GYB for refusing to step down even after series of consultation and pleas despite the fact that he will not make a better a president.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dataispower",
      "created_time": "June 29, 2022, 10:53:33 PM",
      "body": "Quote from: Findingnemo on June 18, 2022, 05:42:48 AMQuote from: dataispower on June 17, 2022, 05:29:20 AMQuote from: Findingnemo on June 16, 2022, 10:49:29 PMYou know something the successful political leaders ( financially ) knows how to invest either its on a person who has the influence or their own advertisement in any form with the tax money so yes its great point. In some countries people have the freedom but in Africa the leaders keep the people busy with the problems so they don't have time to think about picking the right candidate to represent them and fight for the people, politics is getting more dirty so people who is having good heart are actually staying away from it or forced by those corrupted politicians everywhere. politics who extort money and embezzle funds does not likely invest because they know that with the large and largest investment they have government or incumbent government leaders can petition them in court and take all their belongings for government functions and usage. I believe that no government personality that like to invest physically or property investment due to security purposes. But their money can go to bitcoin directly without hesitation and no body can trace themDo you think every black money is going to Bitcoin? Then why Switzerland bank is so popular for all those rich people and considered as one of the best place to hide their money which they earned?Leaders don't really keep their money in their own, they have lot of people to invest on the behalf of them so they don't really have any trace and even if they get caught they will have no money on their own but they hold everything in their offshore accounts. I did not really understand the explanation fully not I know why do I oh very well not the majority of which people today or people that is in public organisation all public government sector who embezzled funds like to encroach their money to avoid easy dictation because I believe that the major reason why government does not want the growth of cryptocurrency it is because of embezzlement of funds without being noticeable in their fiat currency account. Today I can say majority of rich people do investment or put in their money into cryptocurrency.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Findingnemo",
      "created_time": "June 30, 2022, 05:51:05 PM",
      "body": "Quote from: dataispower on June 29, 2022, 10:53:33 PMsnip~ I did not really understand the explanation fully not I know why do I oh very well not the majority of which people today or people that is in public organisation all public government sector who embezzled funds like to encroach their money to avoid easy dictation because I believe that the major reason why government does not want the growth of cryptocurrency it is because of embezzlement of funds without being noticeable in their fiat currency account. Today I can say majority of rich people do investment or put in their money into cryptocurrency.Is there any evidence to prove your statement which is bolded for you?If I am not wrong not even 10% of the billionaires are against the crypto currency concept and the government why doesn't want the cryptocurrency monetary system is the decentralization not any other thing because if people adopts to the decentralized money system they lose most of their powers which no government really wants to happen.And for the first statement you said the people who wants to hide their actual value from the government to evade taxes is keeping the assets into someone's name but they don't hold any control of it apart from getting paid which is most common in all over the world.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Moneyprism",
      "created_time": "July 01, 2022, 01:48:37 PM",
      "body": "Quote from: Yawa2020 on June 27, 2022, 09:13:09 PMPolitics everywhere in the world has become a business venture but coming down to Nigeria here, it becomes absolute business and investment 😂 its in our DNA, we abuse anything that comes our way including power. The truth is that, the benefits attached to political offices are too juicy that every individual will fight so hard in order to obtain such office. No any sane and well-meaning person will step down for another because of future appointments or whatsoever he or she is promised but contrary is the case here. On this ground, I commend GYB for refusing to step down even after series of consultation and pleas despite the fact that he will not make a better a president. just like here,, people get into politics sometimes as their long term investment to be able to maintain or expand their business nationally or internationally .. therefore it is very difficult to distinguish people who are really honest to politics or not",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}