{
  "id": "topic_5438073",
  "title": "xr1V3rx",
  "author": "xr1V3rx",
  "created_time": "February 04, 2023, 06:03:13 PM",
  "content": "Go over a Steemit post, important! US Government, law enforcement working with courts for USArmy, genocide and WEF to destroy the economy by USD dump, happening now! Read and Thank you Severe economic crisis. https://steemit.com/r1v3r/@r1v3r/unlawful-arrest-court-works-with-law-enforcement-for-us-militaryhttps://twitter.com/xr1v3r/status/1621927974361505800?s=46&t=RqytwJqzL6vgdwG5EWQCkw",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5438073",
  "comments": [
    {
      "author": "Vishnu.Reang",
      "created_time": "May 04, 2023, 01:39:57 PM",
      "body": "The financial system has been artificially has been pumped for over a decade to ensure big pockets were lined and now those same hands will make a fortune in the largest transfer of wealth in human history by shorting it on the way down. Inflation does have a roll, but that's to keep everyone panicked, and focused on their bills and expenses, rather then focus on the capital crimes of politicians and corporations.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "el kaka22",
      "created_time": "May 04, 2023, 02:44:50 PM",
      "body": "This feels more like AI generated than anything else. But to give it a shot I would have to say that this is a tinfoil hat talk and nothing more. Obviously we are all aware that USA is doing terrible stuff, nobody denies that, but Ukraine war?That has nothing to do with this, they can keep spending money on that because they are not sending that money to defend Ukraine, they are sending it to make Russia weaker, in the world energy resources race, if Russia spends their income on this war, and gets poorer, then USA can get back on it's feet whereas Russia will be fighting against sanctions and not be able to recover. That is how this works, spend money on Ukraine, and be richer than Russia, that is their aim currently and it has worked well so far.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}