{
  "id": "topic_5474512",
  "title": "libert19",
  "author": "libert19",
  "created_time": "November 18, 2023, 03:41:54 AM",
  "content": "Do you ever feel like that being after saving or investing for future you forget to live in the present? You don't buy the things you want to or don't go after experiences you want because you'd rather save/invest for future instead.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5474512",
  "comments": [
    {
      "author": "Churchillvv",
      "created_time": "November 18, 2023, 04:33:53 AM",
      "body": "Quote from: libert19 on November 18, 2023, 03:41:54 AMDo you ever feel like that being after saving or investing for future you forget to live in the present? You don't buy the things you want to or don't go after experiences you want because you'd rather save/invest for future instead.  In as much as saving is good it doesn't warrant you not having/living a good live. I mean you have to live for the present before the future if you're not alive today how can you then live in the future your investing/or saving for, one can not always invest in every circumstances or event you have to always get the essential needs. That you have to spend on yourself or take care of yourself does not mean spending unnecessarily or living a luxurious/or extravagant life. Additionally, what is the future? Your future is your next minute not even exactly what we in our subjective reality see it to be, every minute of our live that we do not know or can not predict is a future because years or months before today you called today a future so live your live now because you don't know tomorrow. This is a popular saying that \"Nobody knows tomorrow\" so why suffer so much when you have it already just for the fact that you wanna save for a  future! Nah!. Invest but don't die while investing. In my country there is what is popularly known as \"next of kin\" this does not just mean the normal next of kin but there is an extraordinary meaning attached to it, if you don't spend or take of yourself today (present life) one next of kin who do not know how you suffered to make this money or investments will spend it all when you're no more. So be wise and not be over conscious of the future.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "November 18, 2023, 04:40:16 AM",
      "body": "over a decade ago. (pre bitcoin) i was frugal but my mindset was that my \"wants\" were NEEDS. like i needed certain entertainment TV packages for movies and tv series. i needed to enjoy fast food as its more convenient then self cooking, i needed to go to the gym, sports clubs and night time activities, i needed X time off for vacations.. nothing was a want, everything felt as a needthen i got into bitcoin, and decade later im set, retired early and have no money worriesthat said, im still frugal. where i dont see \"needs\" i just see wants. and now i question those wants and realise i dont need. it can feel good to walk into a restaurant and know you can afford anything on the menu but buy the basic meal.. it can feel good to walk into thrift/charity store knowing you could afford the whole stores produce at their original unused retail rate, but you are buying the same thing second hand (i also do new retail price.. but i do enjoy frugalness too)it can feel good to walk into a car dealership knowing you can buy their newest model full price, but then asking about their ex-display/ex-owned/trade-insjust knowing i can doesnt mean i shouldi still travel and enjoy experiences but i just dont have the \"need\" weight on my shoulder. and i realise how wasteful my \"wants\" weresome times the knowing i can but not needing too is a positive experience more so then going ahead and buying the luxury to fill a emotional hole some people havei still spend, dont get me wrong. but my habits remain frugal and i still invest, and i do question my purchases even if i dont have tobest advice is. look for things in life that make you happy. then do them. knowing your investments are also happening side by side so you get to look after yourself now and in the futurethere is nothing wrong with being frugal about wasteful spending,, if you then spend on the things you really enjoy too",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "wxa7115",
      "created_time": "November 18, 2023, 04:54:15 AM",
      "body": "Quote from: libert19 on November 18, 2023, 03:41:54 AMDo you ever feel like that being after saving or investing for future you forget to live in the present? You don't buy the things you want to or don't go after experiences you want because you'd rather save/invest for future instead. I suppose that sometimes I feel that way, however when looking at the things I wanted to buy at the time I get to see that my decision to not buy those products was in fact the right decision most of the time.Every single day we are bombarded with ads trying to make us spend more money than what we can afford, and while it is necessary to spend some money now in order to fulfill our needs and wants, being able to think about the future and suppress those feelings has helped me tremendously, as when I compare myself with my friends and other people my age I am in a great position, and this will only improve even more once the price of bitcoin goes up even further.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Vishnu.Reang",
      "created_time": "November 18, 2023, 04:57:50 AM",
      "body": "Doing everything in limit is worth it if you cross the limit then it will not give you much benefit in anything, same way if you are only saving after sacrificing so many things from your life just like you are not having fun, not fulfilling your small wish which brings you joy and happiness. Never forget your presence to make your future because when you are healthy and wealthy physically and mentally then only your future will become brighter with your hardwork and present savings. Yes, saving habits gives you a better life. You can buy a house, accumulate funds for your retirement, or you can run your family in better condition etc but never forget your present.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "November 18, 2023, 05:23:42 AM",
      "body": "Quote from: libert19 on November 18, 2023, 03:41:54 AMDo you ever feel like that being after saving or investing for future you forget to live in the present?Yeah, it is very easy to get caught in a routine and forget to live a little. The worst thing that sometimes happen to people is when they \"live to make money instead of making money to live\".Quote from: libert19 on November 18, 2023, 03:41:54 AMYou don't buy the things you want to or don't go after experiences you want because you'd rather save/invest for future instead. It is not a bad thing to want to save or invest your money for the future as long as you have a clear plan not just saving money forever. For example you could be planning on working hard and saving money for 5 years to reach your big goals then from that point you loosen up and start spending more. But if you save money for 5 years then continue not spending anything and invest more and save more, you'd be wasting your life.Besides, Franky had some good points on this. In a lot of cases people are too lost in consumerism that they think they need something but they really don't.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joniboini",
      "created_time": "November 18, 2023, 05:37:38 AM",
      "body": "I have the opposite problem. It is not as drastic as others but sometimes I have a habit of buying things that do make me happy for a while and then regret it sooner or later. Especially things related to online entertainment such as games or subscriptions. I tend to get bored quite easily so it is hard to get the best bang for my buck. Fortunately, I do save quite a bit, and I never went as far as liquidating my savings just for that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Helena Yu",
      "created_time": "November 18, 2023, 06:11:19 AM",
      "body": "Include me to be one of them, but I'm not someone who always save every penny I earn.Mostly I cook by myself because it's cheaper, than buy a cooked food. But I'm feel bored if I always eat my home cooked food as I already know the taste, so whenever I want to experience a new food, I will buy it.I mostly in home to save money than going outside, but since build or maintain relationship with other people need to going out, I don't mind to spend money for that because it's an investment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitLeap",
      "created_time": "November 18, 2023, 06:26:32 AM",
      "body": "Quote from: libert19 on November 18, 2023, 03:41:54 AMDo you ever feel like that being after saving or investing for future you forget to live in the present? You don't buy the things you want to or don't go after experiences you want because you'd rather save/invest for future instead. Stability is needed so that we don't get too carried away by future ambitions, forgetting that the days passed must also be taken into account properly. Meeting all your needs from time to time is not easy. People who are successful in saving and enjoying the sweetness of investment can always limit which ones need to be prioritized and which ones can be paused for long-term savings. I myself still feel that this method is very difficult to face all possibilities when I don't have anything and am looking at savings. It comes to the point where bitter decisions have to be taken and the dreams of future investment are erased.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "michellee",
      "created_time": "November 18, 2023, 06:37:13 AM",
      "body": "Honestly, I've felt it. I want to save or invest without thinking about what I have to prepare for my daily life. And it still happens to me now because I don't buy the things I want. I left it on my purchase order list without knowing when I wanted to buy it.I am still busy preparing for the future by saving and investing. But I still try to meet my daily needs because I have to survive. I'm trying to make money, dividing it between saving and investing and expenses. I didn't even look at the list of things people were looking for. It's not a very important item for me because I still have other replacement items that can help me.But if I want to buy the goods, I can go directly to the shop, choose the goods I want and pay for them. I didn't feel it was necessary so I just left it on the purchase order list. What I have to think about is how I can survive in difficult times.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "knowngunman",
      "created_time": "November 18, 2023, 06:44:18 AM",
      "body": "Quote from: libert19 on November 18, 2023, 03:41:54 AMDo you ever feel like that being after saving or investing for future you forget to live in the present? You don't buy the things you want to or don't go after experiences you want because you'd rather save/invest for future instead. The future is now and you can only think of future when you survive the present. The future belongs to those who survive the present by taking good care of their parents and make themselves happy with things they want. At young age, we say that we are saving for the future, at our youth age, we still save for future and even in our old age, we are still saving for the future. Can we now see that the future is not ending and the reality is that we are saving for next generation or next of kin. I believe in saving of course but the truth is, there is no any future better than now and you should enjoy it to the fullest.Quote from: Helena Yu on November 18, 2023, 06:11:19 AMInclude me to be one of them, but I'm not someone who always save every penny I earn.Mostly I cook by myself because it's cheaper, than buy a cooked food. But I'm feel bored if I always eat my home cooked food as I already know the taste, so whenever I want to experience a new food, I will buy it.I mostly in home to save money than going outside, but since build or maintain relationship with other people need to going out, I don't mind to spend money for that because it's an investment.This is not about food and if I may ask, how much more do you save by cooking by yourself? There's no much difference if you should consider the time and effort you applied in the kitchen. I do also cook by myself and not because I want to save but because I want to have a test I prefer. I can not suffer myself with stress and low life style just because I want to save for unending future. I will enjoy every bit of the moment while I also save the savable and life goes on.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bluebit25",
      "created_time": "November 18, 2023, 06:56:02 AM",
      "body": "Quote from: libert19 on November 18, 2023, 03:41:54 AMDo you ever feel like that being after saving or investing for future you forget to live in the present? You don't buy the things you want to or don't go after experiences you want because you'd rather save/invest for future instead. Yep, this is an obvious truth. If not separated, I believe there will be a distinction between timelines, but it has clearly been programmed since we were born. But the preparation that we envision for a future scenario and maybe a more economical spending plan has been discussed, and we have accepted it to achieve the goal of the plan. But imo, most of us are confused about the present and then confused about future life, so there are many things that are not started or missed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jrrsparkles",
      "created_time": "November 18, 2023, 06:56:31 AM",
      "body": "Quote from: libert19 on November 18, 2023, 03:41:54 AMYou don't buy the things you want to or don't go after experiences you want because you'd rather save/invest for future instead. Actually, I do buy the things I need but I don't buy things I want that is the difference.I wouldn't say it is an imaginary future, am just taking the most conservative path possible to survive in the uncertain/unpredictable future. Everyone has their different opinions but I always look at the future rather than just living in the present alone.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DabsPoorVersion",
      "created_time": "November 18, 2023, 07:13:54 AM",
      "body": "Quote from: libert19 on November 18, 2023, 03:41:54 AMDo you ever feel like that being after saving or investing for future you forget to live in the present? You don't buy the things you want to or don't go after experiences you want because you'd rather save/invest for future instead. Yes, investing is important as it can be the best way to secure each individual's well-being and can make your life up for long-term stability. Disregarding the things you want to buy for a few years long focusing on investing is just a small sacrifice to achieve this goal. A kind of life without thinking of where you can get the money for your expenses, be financially secure, and enjoy a life that's free of debt. I guess, that's what everyone wants to happen.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DanWalker",
      "created_time": "November 18, 2023, 07:23:24 AM",
      "body": "Quote from: libert19 on November 18, 2023, 03:41:54 AMDo you ever feel like that being after saving or investing for future you forget to live in the present? You don't buy the things you want to or don't go after experiences you want because you'd rather save/invest for future instead. I see a lot of people falling into this situation, especially bitcoin investors. They even cut back on daily spending, torturing themselves just to have more money to accumulate more bitcoins. For me, I don't like that plan or that lifestyle, I prefer to balance my life rather than focusing too much on the future and forgetting the present. Because the present is also the future of the past, and if we keep thinking about the future and ignore the present, we will live frugally until we die without enjoying any of the results we have created.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Text",
      "created_time": "November 18, 2023, 07:32:31 AM",
      "body": "I’ve often found myself caught in the balancing act between planning for the future and living in the present.  The fear of not having enough saved for the future can sometimes overshadow the joy of enjoying the present. Life’s about creating a balance that feels right for you. I know there are always ways to allocate a portion of my resources for both present pleasures and future security. Do you believe that experiences and memories are just as valuable as financial stability? If you enjoy your life now to the fullest then your life is a journey, and if you focus more on your future then your life will be a destination.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Adbitco",
      "created_time": "November 18, 2023, 08:02:11 AM",
      "body": "What i do have in mind most times is that whatever life I live at the present is always the best life for me because you and I can never tell what the next clock would be so, so while thinking of investment or depriving myself the necessaries I do create out time to do things I love live a good life but not an extravagant life were it would have to affect my involvement in my investment. I make sure to have any necessary equipment or sets that would keep me more lively and ease my stress and thinking despite ones involvement in any plans or future savings we need to value every single moments of our lives so what I does is to balance to both side not slack on any side. I don't think much of investment or thinking much of luxury rather I do balance the both to have a better life and experience.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "btc78",
      "created_time": "November 18, 2023, 08:28:49 AM",
      "body": "No i don’t think this waythere are plenty of ways to have fun without the involvement of money i feel much secure and safer knowing that i have money invested for my future that way i don’t spend my days rotting in bed worrying about what could happen in the future  learn how to find the balance between taking care of yourself and depriving yourself of things you don’t need",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zlantann",
      "created_time": "November 18, 2023, 08:40:09 AM",
      "body": "Quote from: libert19 on November 18, 2023, 03:41:54 AMDo you ever feel like that being after saving or investing for future you forget to live in the present? You don't buy the things you want to or don't go after experiences you want because you'd rather save/invest for future instead. Sometimes when you look at your dependents, especially the children you feel like keeping all you have ever earned for the future. In some cases, you deprive yourself of some important needs just to ensure that the children have a financially secure future. Yes, sometimes I feel that I need to spend on myself and forget about the children occasionally. But I have also realized that as much as I have all I need to survive, that's okay for now. The most important thing for me now is my health that's why I can do everything possible to remain healthy.  I also ensure that I live in a comfortable house, eat healthy food, drive good cars, and wear comfortable clothes. But when it comes to secondary needs like designer clothes, expensive gadgets, vacations, etc, I prefer to to keep saving for the future rather than spending on them. I also assume that my perception might be that I am not earning enough to spend on pleasure.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Plaguedeath",
      "created_time": "November 18, 2023, 08:47:27 AM",
      "body": "I believe such people life isn't balance because they're always try to make sure they're not in lose.If you're a Christian, you need to pay tithe aka one-tenth of your money on your local church. If you have more money there's nothing wrong to treat your friend once a month or having fun like gambling or buy expensive stuff.Of course life is a choice, but don't forget when you're not care with anyone, don't expect they will care about you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}