{
  "id": "topic_5448981",
  "title": "uchegod-21",
  "author": "uchegod-21",
  "created_time": "April 15, 2023, 11:53:45 PM",
  "content": "I am aware that DCA is better in a coin you know will last somehow long depending on how long you have to DCA.DCA is the only means that is easy for me to buy coins. Which altcoin can you recommend for me to start DCAing till  halving when the bull run is expected. I am afraid , that before bull run such coin might have problems. I don't want coins above $100, so that it will be possible to run on good profits if the investment works.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5448981",
  "comments": [
    {
      "author": "Tytanowy Janusz",
      "created_time": "April 16, 2023, 06:39:49 AM",
      "body": "Quote from: uchegod-21 on April 15, 2023, 11:53:45 PMI don't want coins above $100, so that it will be possible to run on good profits if the investment works.My topic from 2018 - https://bitcointalk.org/index.php?topic=3987913.msg37787537#msg37787537. A lot has changed in those 5 years. The world looks completely different now but one thing seems constant ... people still make the same mistake when assessing the growth potential of altcoins.The price doesn't matter. Capitalization matters. Low capitalization projects have the potential for growth, not tokens with low price. But again, low capitalization projects usually do not have a finished product, they do not have a user base, they often have only an outline of the business, and this makes them unsuitable for DCA, because the value is inestimable, at any time the competition can provide a better product, or the same product but faster making your investment worthless. DCA bitcoin, gold, good stocks. Not low cap altcoins. if I didn't convince you and you still want to do DCA on tokens below $100 ... DCA satoshis. 1 sat = 0.0003 $",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hd49728",
      "created_time": "April 16, 2023, 08:06:18 AM",
      "body": "Quote from: uchegod-21 on April 15, 2023, 11:53:45 PMWhich altcoin can you recommend for me to start DCAing till  halving when the bull run is expected. I am afraid , that before bull run such coin might have problems.Buying altcoins in a bear market is bad. DCA altcoins within a bear market is bad too.QuoteI don't want coins above $100, so that it will be possible to run on good profits if the investment works.Don't buy any coin because it has cheap price or cheaper than $100. You can buy 0.003 BTC and hold it to get profit in 2024 or 0.047 ETH and hold it to get profit in 2024 altcoin season.However, if you buy shit coins, you will not get profit and if they die in coming months, you will end with $0 as those coins or tokens will become zero in value.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kingvirtus09",
      "created_time": "April 16, 2023, 09:57:17 AM",
      "body": "Quote from: uchegod-21 on April 15, 2023, 11:53:45 PMI am aware that DCA is better in a coin you know will last somehow long depending on how long you have to DCA.DCA is the only means that is easy for me to buy coins. Which altcoin can you recommend for me to start DCAing till  halving when the bull run is expected. I am afraid , that before bull run such coin might have problems. I don't want coins above $100, so that it will be possible to run on good profits if the investment works.When it comes to DCA, everyone here knows that it is a good tool to use in Bitcoin until the bull run comes. And we also have what we believe are other altcoins that we also see potential in the future. For example, one of the things I do with DCA besides bitcoin is the Matic, Shiba Inu, bonk, bone, and other meme coins although I know there is a risk but it's fine with me and I'm ready to lose or lose because the I wonder what if the price kicks in when the bull run comes? But these coins that I mentioned are the budget that I really set aside for them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "April 16, 2023, 10:18:59 AM",
      "body": "Quote from: uchegod-21 on April 15, 2023, 11:53:45 PMI don't want coins above $100, so that it will be possible to run on good profits if the investment works.First tryout some altcoins that are useful for you. In that sense you knocked out some that might interest you when bull run arrived. If you are a risky guy then go for low cap altcoins that are indeed have potential based on your research or experience. If you are aiming for multiplier than check the low cap mid altcoins. No risk no gain. But if you want a safe one then go for doing bitcoin or eth dca. These two are the safest and might have unfold secure earnings but not same with a risky altcoins that could give you 100x to 500x.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "April 16, 2023, 11:21:41 AM",
      "body": "Quote from: uchegod-21 on April 15, 2023, 11:53:45 PMWhich altcoin can you recommend for me to start DCAing till  halving when the bull run is expected. I am afraid , that before bull run such coin might have problems. I don't want coins above $100, so that it will be possible to run on good profits if the investment works.Halving is an event associated with Bitcoin, and therefore if you want to invest in altcoins, linking it to an event related to Bitcoin is wrong, if it is, then invest in Bitcoin.If you really want to invest in altcoins, focus on technical development, do developers work periodically to update the currency, does the currency benefit outside the platforms, what are the features in that currency and are not found in any other currencies.Don't focus on market capacity, crazy increases, projects that make a lot of promises, it's an excellent way to lose your money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o48o",
      "created_time": "April 16, 2023, 11:55:18 AM",
      "body": "Quote from: uchegod-21 on April 15, 2023, 11:53:45 PMI am aware that DCA is better in a coin you know will last somehow long depending on how long you have to DCA.DCA is the only means that is easy for me to buy coins. Which altcoin can you recommend for me to start DCAing till  halving when the bull run is expected. I am afraid , that before bull run such coin might have problems. I don't want coins above $100, so that it will be possible to run on good profits if the investment works.Quote from: Tytanowy Janusz on April 16, 2023, 06:39:49 AM-cut-The price doesn't matter. Capitalization matters. Low capitalization projects have the potential for growth, not tokens with low price. But again, low capitalization projects usually do not have a finished product, they do not have a user base, they often have only an outline of the business, and this makes them unsuitable for DCA, because the value is inestimable, at any time the competition can provide a better product, or the same product but faster making your investment worthless. DCA bitcoin, gold, good stocks. Not low cap altcoins. -cut-Like ytanowy Janusz said, price of a one full coin doesn't matter, but i don't agree his claims about locaps not having finished products. Most of the altcoins haven't started with a finished product and most of them are not even \"finished\" as they keep developing. And then there have been overvalued icos that start from insane valuation and have only room to drop in price. I would say that investing to lowcaps is ok, but only if they have something unique to offer and means to deliver it later. And by unique i also mean that the project is useful but unique approach to a problem that actually exist and isn't better to fix with a normal database. Many altcoins offer decentralized solutions to a problems that don't need decentralized solution. Those might have a finished product but they will die as no one wants to use them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Xal0lex",
      "created_time": "April 16, 2023, 02:42:05 PM",
      "body": "DCA in altcoins? It's not investing, it's gambling, especially if we're talking about relatively young assets. My opinion is that DCA in cryptocurrencies can only be safely applied to bitcoin. Altcoins have no bottom, so all these attempts to average your positions can only worsen your position. Given the fleeting life of altcoin trends, you can forever be left with candy wrappers instead of money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "uchegod-21",
      "created_time": "April 16, 2023, 02:50:56 PM",
      "body": "Quote from: hugeblack on April 16, 2023, 11:21:41 AMQuote from: uchegod-21 on April 15, 2023, 11:53:45 PMWhich altcoin can you recommend for me to start DCAing till  halving when the bull run is expected. I am afraid , that before bull run such coin might have problems. I don't want coins above $100, so that it will be possible to run on good profits if the investment works.Halving is an event associated with Bitcoin, and therefore if you want to invest in altcoins, linking it to an event related to Bitcoin is wrong, if it is, then invest in Bitcoin.It is because bitcoin is the market mover and whatever things that happens to bitcoin affects altcoins. If bitcoin halving will truly lead to bull run, altcoins won't be exempted in the market growth.If I want to day trade in altcoins what I use to study the marker is bitcoin chart and it works for me.Quote from: Xal0lex on April 16, 2023, 02:42:05 PMDCA in altcoins? It's not investing, it's gambling, especially if we're talking about relatively young assets. My opinion is that DCA in cryptocurrencies can only be safely applied to bitcoin. Altcoins have no bottom, so all these attempts to average your positions can only worsen your position. Given the fleeting life of altcoin trends, you can forever be left with candy wrappers instead of money.I know that DCA is for bitcoin but I want to try the gambling but it seems that everyone is not in support of the move.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Why you bully me",
      "created_time": "April 16, 2023, 03:05:24 PM",
      "body": "Quote from: uchegod-21 on April 15, 2023, 11:53:45 PMI am aware that DCA is better in a coin you know will last somehow long depending on how long you have to DCA.DCA is the only means that is easy for me to buy coins. Which altcoin can you recommend for me to start DCAing till  halving when the bull run is expected. I am afraid , that before bull run such coin might have problems. I don't want coins above $100, so that it will be possible to run on good profits if the investment works.I would say Cardano, Render token.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mr. Magkaisa",
      "created_time": "April 16, 2023, 03:16:26 PM",
      "body": "Quote from: uchegod-21 on April 16, 2023, 02:50:56 PMQuote from: hugeblack on April 16, 2023, 11:21:41 AMQuote from: uchegod-21 on April 15, 2023, 11:53:45 PMWhich altcoin can you recommend for me to start DCAing till  halving when the bull run is expected. I am afraid , that before bull run such coin might have problems. I don't want coins above $100, so that it will be possible to run on good profits if the investment works.Halving is an event associated with Bitcoin, and therefore if you want to invest in altcoins, linking it to an event related to Bitcoin is wrong, if it is, then invest in Bitcoin.It is because bitcoin is the market mover and whatever things that happens to bitcoin affects altcoins. If bitcoin halving will truly lead to bull run, altcoins won't be exempted in the market growth.If I want to day trade in altcoins what I use to study the marker is bitcoin chart and it works for me.Quote from: Xal0lex on April 16, 2023, 02:42:05 PMDCA in altcoins? It's not investing, it's gambling, especially if we're talking about relatively young assets. My opinion is that DCA in cryptocurrencies can only be safely applied to bitcoin. Altcoins have no bottom, so all these attempts to average your positions can only worsen your position. Given the fleeting life of altcoin trends, you can forever be left with candy wrappers instead of money.I know that DCA is for bitcoin but I want to try the gambling but it seems that everyone is not in support of the move.   -    I think dca can probably be implied in altcoins that you know are top listed in the market. Because once the value of bitcoin starts to increase, other cryptocurrencies are also possible to follow the rise of bitcoin's value.Some of the examples are that if the value of ETH increases, all the coins under it can also increase, the same goes for MATIC, if its value increases, all the coins under the polygon will also increase somehow.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yatsan",
      "created_time": "April 16, 2023, 03:32:53 PM",
      "body": "Hot ones are XRP and DOGE. XRP is quite noisy recently because on the emphasis on its issue against the SEC, if it happen to win the case then we could expect a huge leap on its market value but if not ofcourse the other way around will occur, problem is not knowing when will the issue be finished. DOGE on the other hand is also becoming noisy because of its increase on the past few days which made the idealization on its value again, alive. Now is believed to be the start of Altcoin season and  popular ones in this market could lead the uptrend for alts, more than the low cap ones. Just be sure to not enter too early and wait for accurate neckline of the charts. If it is DCA, I'd still not suggest futures trading but dpot trading would be better especially if you are into long holding period.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blockman",
      "created_time": "April 16, 2023, 07:30:51 PM",
      "body": "Quote from: uchegod-21 on April 16, 2023, 02:50:56 PMI know that DCA is for bitcoin but I want to try the gambling but it seems that everyone is not in support of the move.Then I think that you're willing to go with those altcoins that have billions of supplies because they're less than the price of $100 and you'll get to have them more. As you've mentioned like you're gambling with that money that's the first thing that I've thought of. But there are other coins like Matic, ada, and dot that are in the range of what you're saying for their price. It may be a tough decision for you to make if that's the plan you have in your mind. But since it's your money and you know the risk and that there's a certain plan that you want to do, I just wish you all the best and hope that you may find that altcoin of your choice.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hispo",
      "created_time": "April 16, 2023, 07:40:23 PM",
      "body": "This is not financial advice. I would not recommend to DCA any altcoins, I would personally not do so but if you still want to, be sure that is an altcoin which is likely not to dump to very low levels this year and has a very long history in the market. There are alts which I would like to DCA, like Monero but the fact it does not have a capped supply turns me down.Buying very small coins instead Bitcoin, specially having expectation on the next bull run can be very risky, why not just to stick to Bitcoin and Ether?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "wheelz1200",
      "created_time": "April 16, 2023, 08:00:30 PM",
      "body": "Quote from: uchegod-21 on April 15, 2023, 11:53:45 PMI am aware that DCA is better in a coin you know will last somehow long depending on how long you have to DCA.DCA is the only means that is easy for me to buy coins. Which altcoin can you recommend for me to start DCAing till  halving when the bull run is expected. I am afraid , that before bull run such coin might have problems. I don't want coins above $100, so that it will be possible to run on good profits if the investment works.First off coin price is not relevent probably more so the market cap of a coin.  But either way if you are looking for a good project that should have a good run up through halving would be MATIC/POLYGON. Project has been progressing nicely and is hovering in a good price range at around $1.15.  Either way DCA isn't a bad strategy through the halving.  Good luck to you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "electronicash",
      "created_time": "April 16, 2023, 08:12:43 PM",
      "body": "dogecoin and LTC are my first choice to hold when it comes to altcoins because i also use them to play in casinos. doge is my priority as its fast and it's constantly increased in value since the time it dip to $0.07. it's lighter to worry about while holding doge because i know it became the most popular altcoin due to Twitter. the cheaper it is, the better for an investor to buy doge while BTC halving has yet not happened.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bananington",
      "created_time": "April 16, 2023, 08:50:29 PM",
      "body": "Quote from: electronicash on April 16, 2023, 08:12:43 PM it's lighter to worry about while holding doge because i know it became the most popular altcoin due to Twitter. the cheaper it is, the better for an investor to buy doge while BTC halving has yet not happened.Doge can be a good option because it is always somehow in the trend thanks to Elon Musk and other activity that has kept it relevant over the years.OP for any altcoin or altcoins you choose to DCA, ensure that Ethereum is a part of them, because it will first show the effect of the halving as the most reliable altcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "palle11",
      "created_time": "April 16, 2023, 09:12:14 PM",
      "body": "First I will advise not to focus on price while investing in cryptocurrency. Another advise is to always consider bitcoin and Ethereum while investing and the reason is bitcoin is very important in the life of cryptocurrency and Ethereum is very important in the life of altcoins. You can invest whatever amount you want in Satoshi for bitcoin and units of Ethereum. And another advise is if you want to invest in altcoins, dogecoin and Litecoin looks good, they are both used in gambling casinos which means they will be relevant for a long time unlike other altcoins that have not been recognized in crypto investment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LogitechMouse",
      "created_time": "April 16, 2023, 09:21:33 PM",
      "body": "Quote from: uchegod-21 on April 15, 2023, 11:53:45 PMDCA is the only means that is easy for me to buy coins. Which altcoin can you recommend for me to start DCAing till  halving when the bull run is expected. I am afraid , that before bull run such coin might have problems. I don't want coins above $100, so that it will be possible to run on good profits if the investment works.First, why you wanted to buy coins below $100? I mean what's the difference if you bought a coin below a hundred dollars, and a coin that's above a hundred dollars? I can't see the reason behind it because you can still buy Bitcoin even if you don't have $100, and you can also buy Ethereum even if you don't have $100. Well, DCA on altcoins in a bear market isn't a bad thing like what other are saying here. I mean if you go buy Ethereum monthly, you sure will get profit over time. Now to answer your question, I guess just go pick those top coins out there who's below $100. LINK, ADA, DOT, SOL. If you wanted to go DCA into altcoins, I'd suggest go buy Ethereum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bittraffic",
      "created_time": "April 16, 2023, 09:26:17 PM",
      "body": "DCA seems to be used in BTC only. If you want to invest in altcoin just buy in bulk with your allocated amount for it like $500-1000 for every altcoin you see potential. But just buy the altcoin with a price that is below $1. It would be too much to invest a lot in tokens with a price of more than $100 already when you could have a massive profit from altcoin that is worth $0.10.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}