{
  "id": "topic_5448579",
  "title": "cryptocoinsinfo",
  "author": "cryptocoinsinfo",
  "created_time": "April 12, 2023, 06:37:10 PM",
  "content": "Limbo & Dice SimulatorIt's just a small simulator, but a good tool for simulating Limbo or Dice lose/win streaks. Give it a try: https://www.cryptogrinder.io/limbo-simulator/An advanced version with inc/dec on win/lose and stop on win/lose is comming soon. Btw: It's a real eye opener for people who like to wager at 1.01x.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5448579",
  "comments": [
    {
      "author": "entebah",
      "created_time": "April 12, 2023, 06:47:46 PM",
      "body": "i just try it but it seems the simulation is not real because every time i start the simulation it just gives the same resultsi thought every simulation will be given different results",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "iv4n",
      "created_time": "April 12, 2023, 07:04:55 PM",
      "body": "Quote from: cryptocoinsinfo on April 12, 2023, 06:37:10 PM...It's just a small simulator, but a good tool for simulating Limbo or Dice lose/win streaks. ...An advanced version with inc/dec on win/lose and stop on win/lose is comming soon. Btw: It's a real eye opener for people who like to wager at 1.01x.I like simulators, and I tried different ones. It's for people who like auto-betting in general, especially for people like me who gamble with different coins... Well, this basic simulation is really basic, not bad... 39 loss streak at x3.5 is more than possible in million bets, it can be even higher. But I like when the simulator has other options, I guess we will see those options in advanced mode, which is coming. Looking forward to that.By the way, every time we try the simulator we will be redirected to some casino. I don't mind, but some people don't like those things. Good luck! I hope you will finish advanced mode.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ryzaadit",
      "created_time": "April 12, 2023, 08:38:24 PM",
      "body": "I don't know if people are still gonna use the simulator.So, far I know right now \"CASINO\" supported any kind of bet with 0$ bets. That's mean, we can tested any kind of game from the casino without any single money the the hash and every game is actually live result from casino.Due the tested it's not from test game but from the live version game installed on the casino. One of example casino who supported a bet with 0$ bet are \"STAKE\".",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "entebah",
      "created_time": "April 12, 2023, 08:57:29 PM",
      "body": "Quote from: ryzaadit on April 12, 2023, 08:38:24 PMI don't know if people are still gonna use the simulator.So, far I know right now \"CASINO\" supported any kind of bet with 0$ bets. That's mean, we can tested any kind of game from the casino without any single money the the hash and every game is actually live result from casino.Due the tested it's not from test game but from the live version game installed on the casino. One of example casino who supported a bet with 0$ bet are \"STAKE\".although stake supports a 0$ bet, we don't know how many winning/losing streaks we have during the test, and you will be bored to see the auto roll if you want to try 50k~100k betsonly if we use a bot and we will know about that stats",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hispo",
      "created_time": "April 12, 2023, 09:00:29 PM",
      "body": "Quote from: ryzaadit on April 12, 2023, 08:38:24 PMI don't know if people are still gonna use the simulator.So, far I know right now \"CASINO\" supported any kind of bet with 0$ bets. That's mean, we can tested any kind of game from the casino without any single money the the hash and every game is actually live result from casino.Due the tested it's not from test game but from the live version game installed on the casino. One of example casino who supported a bet with 0$ bet are \"STAKE\".Correct, I have personally wager 0$ on Stake's Plinko before for testing purposes. I think the purpose of simulators is having more specialized statistics/graphs and data which some casino may not readily provide (beyond the numbers of wins and losses), also the use of \"testing money\" to track one's \"profit\".And to be honest with you if I was running a testing session on an actual casino and for pure chance I happened to hit a jackpot while wagering 0$, it would ruin my week.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ryzaadit",
      "created_time": "April 12, 2023, 09:42:18 PM",
      "body": "Quote from: entebah on April 12, 2023, 08:57:29 PM-snip-Hey.You can use \"Seuntjies DiceBot\": https://bot.seuntjie.com/ feel free to check on there. They have a few feature things like lose streak, and other think you can see from the bot. You just need API from the casino it self.Even Forum Admin Stake: https://stakecommunity.com/topic/2545-dice-bot-in-stake/?do=findComment&comment=35934 suggested the bot. I don't think using a simulation are not good, but right now since the casino support 0$ bet. I's better to test on real-live betting with 0$, to get a live-date from a real gambling from the casino.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "piebeyb",
      "created_time": "April 12, 2023, 10:19:42 PM",
      "body": "I'm just testing the simulator, you happen to be happy with the Limbo game, I try to start with the amount of the bet for the payout / target x1.10, the fewer consecutive losses, but if I increase the bet for the x10 or x5 target, it actually gets more consecutive losses, even though this is only a simulator, but sometimes it's like what I experienced when playing. I will try this simulator later while testing the game directly too, who knows I might find a new strategy to play even though I know it's hard to beat the dealer. lolBtw , please update anything to continue your version of the simulator it might look helpful to anyone wanting to test it , to be honest it was useful to me because I happen to like Limbo games too , I would love to keep track of this thread to see your simulator progress and see peoples experiences too other discussions from the forum community here.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tusandii",
      "created_time": "April 13, 2023, 07:53:01 AM",
      "body": "Quote from: entebah on April 12, 2023, 06:47:46 PMi just try it but it seems the simulation is not real because every time i start the simulation it just gives the same resultsi thought every simulation will be given different resultsI actually never tried it at all because I know that using such a simulation will not give good results and indeed I don't believe that the simulation can run as we want.Besides, I also don't really like or play dice and limbo too often.There may be some gamblers who would use this simulation for a game of dice and limbo but I'm sure they will not benefit from playing using a simulation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coin.princess",
      "created_time": "April 13, 2023, 10:34:52 AM",
      "body": "I think if you could add something like the auto bet where it would simulate some of the players strategy it would be more effective, I hope that was what on the advance mode. I think this is useful to see your odds on winning and losing after those number of bets. I tried $2 and my target at 1000x surprisingly here's the result:Bankroll at start1,000.00000000Final Bankroll-2,000.00000000Max. Bankroll1,912.00000000Min. Bankroll-3,132.00000000It's not really a good idea to do this kind of strategy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "entebah",
      "created_time": "April 13, 2023, 05:27:55 PM",
      "body": "Quote from: ryzaadit on April 12, 2023, 09:42:18 PMQuote from: entebah on April 12, 2023, 08:57:29 PM-snip-Hey.You can use \"Seuntjies DiceBot\": https://bot.seuntjie.com/ feel free to check on there. They have a few feature things like lose streak, and other think you can see from the bot. You just need API from the casino it self.Even Forum Admin Stake: https://stakecommunity.com/topic/2545-dice-bot-in-stake/?do=findComment&comment=35934 suggested the bot. I don't think using a simulation are not good, but right now since the casino support 0$ bet. I's better to test on real-live betting with 0$, to get a live-date from a real gambling from the casino.i know that bot too, right now I'm using another bot that has simulation balance too.i can create a script from that simulation balance and try it on a real balance when the script is working",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jostorres",
      "created_time": "April 13, 2023, 06:31:33 PM",
      "body": "Quote from: cryptocoinsinfo on April 12, 2023, 06:37:10 PMIt's just a small simulator, but a good tool for simulating Limbo or Dice lose/win streaks. Give it a try: https://www.cryptogrinder.io/limbo-simulator/An advanced version with inc/dec on win/lose and stop on win/lose is comming soon. Btw: It's a real eye opener for people who like to wager at 1.01x.It isn't bad but can be better with more features and options, and your post says that it's a simulator for both Limbo and Dice but when I checked on the website, there is no option to select Dice, the dropdown from the left side of the website only shows Limbo. Is that an issue or Dice hasn't been added yet and you will add it later?I never play Limbo but I like playing Dice at times, and it would be nice to have a simulator for that, especially if it has the feature to select strategies too like Martingale where the bet is doubled after every loss. That will be fun to play around with.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FatFork",
      "created_time": "April 14, 2023, 08:40:54 AM",
      "body": "Great to see some fellow simulator fans here!  I've also tried out a bunch of different simulators, and I totally agree that this one isn't bad but can be better with more features and options. Personally, I'm not a fan of being redirected to a casino every time I try the simulator. It can be annoying, so I had to block the site from opening new tabs.  I think it would be better if you use banners to promote your referral links and leave the option to the users whether they want to click on them or not. It's okay to have some promotions, but not at the expense of the user experience.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coin.princess",
      "created_time": "April 14, 2023, 08:50:08 AM",
      "body": "Quote from: FatFork on April 14, 2023, 08:40:54 AMPersonally, I'm not a fan of being redirected to a casino every time I try the simulator.I think that's the way he can get profit for using his website but I agree with you as that could be a little annoying but still tolerable, adding more features is also a good way to improve your simulator.I agree with FatFork instead of popup link or redirect link, I think it is much better if you will put banners in your site the advantage of that is you can have multiple banners meaning multiple people that would advertise to your website but the only disadvantage I see about that is it would look like a graffiti wall and of course some of it will have animations which could be annoying too.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pawanjain",
      "created_time": "April 14, 2023, 04:24:35 PM",
      "body": "Quote from: entebah on April 12, 2023, 06:47:46 PMi just try it but it seems the simulation is not real because every time i start the simulation it just gives the same resultsi thought every simulation will be given different resultsYou are actually right. Even I thought it would generate different outcomes very time based on the provable fair algorithm.At first I tried the simulator with different number of bets but after reading your post I used the same number of bets again and the result was same.It's not really useful has it's just a dummy simulator I would say. It should have incorporated provably fair algorithm and generated different outcomes based on that.Then it would have been useful and would bring value to the table.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AbuBhakar",
      "created_time": "April 14, 2023, 04:29:38 PM",
      "body": "Quote from: cryptocoinsinfo on April 12, 2023, 06:37:10 PMLimbo & Dice SimulatorIt's just a small simulator, but a good tool for simulating Limbo or Dice lose/win streaks. Give it a try: https://www.cryptogrinder.io/limbo-simulator/An advanced version with inc/dec on win/lose and stop on win/lose is comming soon. Btw: It's a real eye opener for people who like to wager at 1.01x.What is the essence of doing simulation on limbo if the game is pure random without any winning percentage available to do some calculation for the probability of winning. Casino offers a demo mode on Limbo games which equivalent to the simulation you are offering. I see no point on simulating this game because practice won’t change the outcome of your future games since there is no data being analyze here but just pure instinct on when to cashout.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nakamura12",
      "created_time": "April 14, 2023, 04:41:45 PM",
      "body": "I don't know if people wants to use simulator but after testing the site in mobile phones, there's a problem with it like the overlapping numbers of the bankroll and it would be nice when you start the simulator then it will show the results because every time you start it will always redirect you to the casinos where you can play the game. It seems I am not the only one who doesn't like being redirected to a casino every time trying the simulator.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitbollo",
      "created_time": "April 14, 2023, 06:15:57 PM",
      "body": "a tool like this, has a clear educational and statistical purpose because it helps to visualize in a practical way \"what to expect from a long series of plays\". (due RTP more you play ...more you lose  )  I'm curious to know... in this type of tool, how is \"randomness\" generated in this type of calculation?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "entebah",
      "created_time": "April 14, 2023, 06:36:19 PM",
      "body": "Quote from: AbuBhakar on April 14, 2023, 04:29:38 PMI see no point on simulating this game because practice won’t change the outcome of your future games since there is no data being analyze here but just pure instinct on when to cashout.for me, simulation has a few good things as long the simulation is not like the website this site offers. simulation game for me is just a way to make a good script because in simulation I can make a script and see if the script is good or bad.if the script I make Is good then i can try it using my balance.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jostorres",
      "created_time": "April 14, 2023, 07:00:30 PM",
      "body": "Quote from: coin.princess on April 13, 2023, 10:34:52 AMI think if you could add something like the auto bet where it would simulate some of the players strategy it would be more effective, I hope that was what on the advance mode. I think this is useful to see your odds on winning and losing after those number of bets. I tried $2 and my target at 1000x surprisingly here's the result:Bankroll at start1,000.00000000Final Bankroll-2,000.00000000Max. Bankroll1,912.00000000Min. Bankroll-3,132.00000000It's not really a good idea to do this kind of strategy.There is an upcoming advance feature. If the one that you suggest is not included there, maybe it will still be added on the next update as I think suggestions are welcome here. By using this tool, I think it only gives a close overview but it may not be accurate or the values that we can see can change depending on the flow of our luck so we must not take it seriously.We must not be discourage and we must not be too excited. Just gamble with the intention of having fun only and then by using the amount that you can afford to lose and we will be just fine. I already done your strat before but using a dollar only. I can sometimes hit 1k.xx multis but only on rare occasions due to limited bankroll. I only do 15 to 20 bets.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}