{
  "id": "topic_5466017",
  "title": "Question:",
  "author": "stompix",
  "created_time": "September 07, 2023, 04:29:33 PM",
  "content": "As many of you are aware, the mempool is full and overflowing and has been like that for a long, long period, when it comes to Bitcoin time. The last time it went near zero was back in April, and from then we haven't seen any sign of it finally going back to  \"normal\" times of cheap tx and gaps in which you can consolidate your dust.Now betting on more acceptance, another bull run, are we going to see an empty mempool again or is this a thing of the past?I would love to see your opinions but also, more importantly, your reasoning for this!With enough tx for 3 days worth in the mempool, with hashrate going down because of decreasing revenue so fewer blocks each period which add to this, and not even a tiny sign of ordinal fomo dying down, my bet is on the next year or the holiday season at the end of the year.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5466017",
  "comments": [
    {
      "author": "spectre71",
      "created_time": "September 07, 2023, 04:35:43 PM",
      "body": "This way outside my wheelhouse but it's something I am starting to look into and learn more about. As I expand my horizons this is starting to become a concern, transactional time and cost.If the difficulty was reduced would that help?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "September 07, 2023, 05:02:22 PM",
      "body": "Quote from: spectre71 on September 07, 2023, 04:35:43 PMIf the difficulty was reduced would that help?No, the difficulty has little to do with the capacity of the blockchain except for small variations, during the adjustment periods.And actually it's the opposite, difficulty going down because miners are turning off their gears leads to fewer blocks in the 14 day interval so lower capacity: https://newhedge.io/terminal/bitcoin/difficulty-estimatorRight now this is how it looks:QuoteLatest Block:   806622  (a few seconds ago)Current Pace:   96.3419%  (223 / 231.47 expected, 8.47 behind)Next Difficulty Change:   between -3.5372% and -0.7605%Previous Retarget:   Yesterday at 5:24 AM  (-2.6452%)Just one day into this period we're down ~3.5%, meaning 8 blocks behind the target so around 20,000 fewer confirmed transactions than it should have been normally.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "September 07, 2023, 05:17:16 PM",
      "body": "That would be when what is causing the mempool congestion is no more causing it. But, I doubt that, because people are going for Ordinals which surprisingly I have not known much about it, but it is what that is causing the congestion. We do not know if there would be another invention that will lead to more use of the bitcoin blockchain, but this is very possible and their may be more congestion.Halving is getting closer day by day. If more people will buy bitcoin at some point after halving which will result to a significant bull run period, I do not know how the mempool will be so much congested at that time. It will be much more congested.But with the look of things, I do not think that mempool can be so less congested to the extent it will reach 1 sat/vbyte of high fee priority again.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "avikz",
      "created_time": "September 07, 2023, 05:57:48 PM",
      "body": "We need to get our acts together guys. In one side we celebrate New adoptions and on the other hand we complain about network congestion. Network congestion will not go down, rather it will keep on increasing. We may see some periods are less busier than usual but that's not going to stay for long. With adoption and new users, transaction volume increases. Then there's a madness called Ordinals which is becoming a real pain. Controlling Ordinals will bring temporary result but we need to think about a long term solution. Bitcoin network is  just not capable of handling sudden spike in volume.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Upgrade00",
      "created_time": "September 07, 2023, 06:10:17 PM",
      "body": "I really do hope we get a less congested mempool soon but I am not optimistic of the whole transactions being cleared up anytime soon with the current situation of things and future expectations.For the network to have less transaction hold up we need either far higher hashrates it significantly less new transactions being made (particular ordinals) and I do not see either of this situation happening.The next couple of months before the halving will be busy for the network and so will the months after it. Anyone looking to consolidate their small transactions should consider doing it now with the cheapest sat/vbyte they can find.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "September 07, 2023, 06:16:32 PM",
      "body": "For us to see those low levels of fees, we're going to need a combination of a deeper deeper more-depressing slow bear market, and a death of Bitcoin ordinals. I think it's a bit unlikely for us to reach that levels of market-\"deadness\", but it's definitely not outside the realm of possibility. What we only need is a longer 2020 version of market sentiment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "September 07, 2023, 06:21:56 PM",
      "body": "it is already possible for people to gauge fees in kb/sat meaning starting fees can begin under 1sat/byte. meaning priority competition can start levels below sat/byte meaning if cheap/lowest was 4 sat per kb then a 250byte tx would cost 1sat total rather than 250sat for 250byte at a 1sat/byte rate minimummeaning a 250x less starting point for costs.. thus competition can begin at 4sat/kb and go up by 24x to 96sat/kb* meaning a 250byte tx would be 24sat total for tx at the kb rate premium instead of 4250sat at the byte rate premiumthe problem is.. not one wants to start measuring transactions below 1sat/byte, even if code makes it possible*(24x) much like the priority upto 24sat/byte difference to the lowest 1sat/byte using stompixs fee estimate premium",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hispo",
      "created_time": "September 07, 2023, 06:26:20 PM",
      "body": "I have been also waiting for those transactions to go down as well. I used to pass transactions at night, but it is not worth it anymore as used to be.To be honest, it would take for people to move off Bitcoin ordinals for things going back to normal and being able to send Bitcoin at 1 sat/byte on weekends.I thought since the price of Pepe went downhill, people would move from ordinals, as investors did with Non fungible tokens, but Bitcoin is such a popular network and with such a volume that it is unlikely people will completely forget about ordinals and the main network will continue to be used to try to scam people with useless tokens.Even though things look grim and those living in developing countries (like me) certainly miss the low fees rates, it is not impossible for us to see them again.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fivestar4everMVP",
      "created_time": "September 07, 2023, 07:19:20 PM",
      "body": "Well, I voted that never again are we going to see an empty mempool and neither are we ever going to see that 1sat/byte transaction confirmation fees anymore again, and I choose this because, bitcoins growing, both in popularity and usage, so it is expected that transaction will continue to grow.Put in consideration the developments coming up like all the Bitcoin ETFs and so on, all this things are promoting Bitcoin to a wider range of people, and it should be expected that if SEC signs those ETFs, alot of people that have previously doubted the legitimacy of Bitcoin will come to believe in Bitcoin, and possibly want to invest in it, and when this begins to happen, I means more people using Bitcoin, more people buying and selling Bitcoin, popularity grows, adoption grows and so will sat/byte also grow due high traffic in the Bitcoin network ..This is what I think concerning this matter, I hope to be corrected just incase there be some misconceptions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cricktor",
      "created_time": "September 07, 2023, 07:59:16 PM",
      "body": "As long as Ordinals and other related shit abuse isn't somehow technically fenced out, I doubt this will happen, I have little faith that we will see \"normal\" mempool times again. I'm sure miners are happy with the congestion of the past months, though. Blockchain spammers are likely proud of themselves. For the latter all I have is: fuck you!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oshosondy",
      "created_time": "September 08, 2023, 06:41:52 AM",
      "body": "Quote from: Cricktor on September 07, 2023, 07:59:16 PMAs long as Ordinals and other related shit abuse isn't somehow technically fenced out, I doubt this will happen, I have little faith that we will see \"normal\" mempool times again. I'm sure miners are happy with the congestion of the past months, though. Blockchain spammers are likely proud of themselves. For the latter all I have is: fuck you!If BRC20 did not cause any congestion, you people will not talk bad about it this way, but because it is not helping but making you to pay high fee make you to frown at it. That is bitcoin, you can also see that the lightning payment can be used for other things and has been linked to how fiat payment can be made in cross border payment with lower fees if compared with fiat payment. The bitcoin blockchain become more useful and miners are gsinning more money from that while people that have no option than to pay higher fee do not like it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dunamisx",
      "created_time": "September 08, 2023, 10:46:03 AM",
      "body": "Quote from: stompix on September 07, 2023, 04:29:33 PMAs many of you are aware, the mempool is full and overflowing and has been like that for a long, long period, when it comes to Bitcoin time. The last time it went near zero was back in April, and from then we haven't seen any sign of it finally going back to  \"normal\" times of cheap That's true because i still don't understand the mathematics that has been behind the mempool not going back to the usual 1sat/vbyte again, if it has ever been high then this should have been a thing of the past, by now we are not expected to still keep battling with that, thou i can see that from previous weeks, the fee rate has come down as low as 4sat/vbyte, but in few days back now, i can see a little small increase to about 10 to 16sats/vbyte, nevertheless all the fee rates are not what is beyond affordability since it's lesser than one dollar unlike when it uses more than 10 dollars fee rate when the mempool was very congested, i still insist in that we can still go back to where we are coming from with 1sat/vbyte.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dzungmobile",
      "created_time": "September 08, 2023, 11:35:29 AM",
      "body": "It will come back but I don't know when. Usually in bear market, we will have more chances to see low fee rate like 1 or 2 sat/byte.Weeks ago, before latest attacks from BRC-20 tokens, mempools dropped to about 5 or 6 sat/byte that gives hope for cheaper fee rates. Historically Bitcoin does not perform well in September and late months of year so without intentional attacks from BRC20 usages, I believe we will see cheaper fee rates.Next year will be hot so I don't expect 1-2 sat/byte fee rate in most of next year.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "buwaytress",
      "created_time": "September 08, 2023, 11:45:44 AM",
      "body": "1 sat after the bull run, so that's 2025  I don't have much reasoning to contribute to this. Other than the memory of 2017/18 and how crazy things were for the longest time.Ordinals is dying... if volume and market cap suggest otherwise, it's only because of the sheer number of new entrants, propping up marketcap with hyped interest. The original tokens have never recaptured their May highs so it's just a wave that needs riding out. If BAYC took 2+ years to finally deflate, then that's 18 more months for ordinals to see out their death knell.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "September 08, 2023, 01:24:45 PM",
      "body": "I stick to that old saying \"never say never\" so I won't even choose that option, and I also don't see how mempool would be cleaned of all those transactions in the next 3 months because there is no indication that the ordinal team will give up what they are doing. So I am left with the option that something positive will happen next year in this regard, although it does not quite fit in with the post effects of the halving and the possible approval of the spot BTC ETF in the US.When we look at the situation realistically, it is easy to conclude that miners have nothing against everything because they earn more from fees, and as far as I understand, although it is technically possible to remove ordinals from the BTC blockchain, there is no reaction even from the BTC developers.If I were to refer to the other topic, then I can agree that we have to slowly start getting used to the fees, which will be higher than before - but if we look at the value in fiat, the current $0.5 or $1, which the fees currently amount to, have less purchasing power than 3-4 years ago, considering inflation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Don Pedro Dinero",
      "created_time": "September 08, 2023, 01:54:27 PM",
      "body": "Well, I would have voted for a couple of years o so but I don't see the option, I would have to choose between 1 year and never again. The issue of ordinals will take time to disappear from the mempool, and a new trend of this kind could appear that fills it with spam and pushes up the fees. Also, the next bull market is not going to help low fees either, but I wouldn't mind if the price goes up a lot and these fees are maintained or even increased.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Stepstowealth",
      "created_time": "September 08, 2023, 02:33:00 PM",
      "body": "Quote from: stompix on September 07, 2023, 04:29:33 PMNow betting on more acceptance, another bull run, are we going to see an empty mempool again or is this a thing of the past?It may never happen or repeat itself, that is making transactions with fees as low as 1sat/b. That time seems past to me as it is normal that fees and the cost of things even in life always tend to increase with time. And if you consider how more people are becoming interested in bitcoins and using it not just for investment but for transactions, you will agree that there will always be traffic and sometimes congestion on the network. If you wait for night to make transactions, your night is also someones day, so if you usually experience low fees at night where you are, know that it is just only a matter of time because as the number of users of the network increase at the other side where they are in the day, the fees for transactions will increase as well.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DooMAD",
      "created_time": "September 08, 2023, 03:36:52 PM",
      "body": "Quote from: avikz on September 07, 2023, 05:57:48 PMControllingIf we could lean more towards incentivisation and away from any notions of \"control\", that would be more constructive.  This is all about permissionless freedom, after all.  Once we start trying to tell people what they can or can't do with their funds, we're no better than the traditional banking system.Granted, people generally find the ordinals stuff annoying, but it's not our place to try to restrict or prevent it.  By all means look for ways to make it more efficient, but once one group starts looking for ways to stop another group from transacting, that's a damn slippery slope.  I'm sure you would be speaking in very different terms if someone was trying to prevent you from transacting the way you wanted to, for example.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Renampun",
      "created_time": "September 08, 2023, 04:11:54 PM",
      "body": "Quote from: Cricktor on September 07, 2023, 07:59:16 PMAs long as Ordinals and other related shit abuse isn't somehow technically fenced out, I doubt this will happen, I have little faith that we will see \"normal\" mempool times again. I'm sure miners are happy with the congestion of the past months, though. Blockchain spammers are likely proud of themselves. For the latter all I have is: fuck you!On Twitter there are many NFT shill accounts that claim they are making big profits from NFTs based on ordinal protocols, one of which is onchainmonkey. since the ordinal protocol appeared, nothing good has happened to Bitcoin, instead The Bitcoin network has gotten heavier and there have even been a lot of congested transactions that have occurred due to heavy network loads.ordinal protocol developers only care about profit from the shit NFT they sell. liberate the bitcoin network from the ordinals protocol, That's what we should be campaigning for, right?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}