{
  "id": "topic_5433469",
  "title": "Onyeeze",
  "author": "Onyeeze",
  "created_time": "January 08, 2023, 12:02:40 PM",
  "content": "Make i first thank una wey dey here before me and introduce myself as onyeeze, i come here come see say na my country na e dey here and i start dey read wetin una dey write and wetin una dey talk here and e make sense well well and na wetin make me i say make i follow una  put mouth here, i bi new person here and na yesterday wey i come here say make i follow una small, if una go fit direct me make una direct me. I will be ready to learn morewetin i wan talk na matter of  politics of Nigerian, how una dey see this election wey come, the government of Nigerian dem dey into trouble now, wey bi say the cabal no get any decisions to tell Nigerians the person wey go become our oga presido now, wetin i see bi say zG5 Governor's don spoil cabal decision and any person wey G5 governor's support na them go win election, wetin bi your own talk for aspirates baba Tinubu if G5 governor's support him, and wetin bi your own opinion if G5 governor's support Atiku or Peter obi, who you think go win if the G5 governor's support and it will win election easily.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5433469",
  "comments": [
    {
      "author": "Sexylizzy2813",
      "created_time": "January 09, 2023, 10:18:41 AM",
      "body": "How we see am nah big question but me I dy reason wetin wan happen on that period wey dy always happen. I dy fear for the lives wey go enter the other side again because I no see this year own election as a healthy one oh.Some piple just get evil plans in store to carry out on that day, my own be say any body wey wan win make e be person wey go move this contri comot from this error wey dy now. And again OP this matter nah hot cake and you see road to bring am up, thank you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Itzjimmyvic01",
      "created_time": "January 09, 2023, 03:19:45 PM",
      "body": "I no think say only G5 alone go fit stand decide who go be the next presido....e nice day this pepper wey Buhari don use our eye see, reach everybody side. Now na make we get sense, use our PVC put better person wey we know say e go carry us commot from the mess....I dey Obidient fa",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "KupaCrypto",
      "created_time": "January 09, 2023, 04:13:20 PM",
      "body": "Quote from: Itzjimmyvic01 on January 09, 2023, 03:19:45 PMI no think say only G5 alone go fit stand decide who go be the next presido....e nice day this pepper wey Buhari don use our eye see, reach everybody side. Now na make we get sense, use our PVC put better person wey we know say e go carry us commot from the mess....I dey Obidient fa😂😂 G-5 governors have no power to decide the next president of Nigeria, but them get small power to influence the election results for there States,. Becos them all be sitting governors.Nyesome wike of Rivers state wey they lead the G-5 governors get plenty influence for em state and even beyond em state as far as PDP they concerned. And if the G-5 governors support your presidential bid then just get for mind say you done win some percentage of the southern votes add to the one wey u already been get.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cryptomiles1",
      "created_time": "January 09, 2023, 07:12:25 PM",
      "body": "Omo see wetin i know be say 5-G gangs or governors no get any say over everything because no be them go tell the youth wetin dem go do, why because everybody get their PVC and have the right to vote whomever they have decided to vote for.We don suffer well well so no body go come tell us wetin to do and wetin not to do, 5Gs are only working for their political interest to secure their earnings as usually.Vote wisely!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "KupaCrypto",
      "created_time": "January 10, 2023, 12:38:07 PM",
      "body": "Quote from: Cryptomiles1 on January 09, 2023, 07:12:25 PMOmo see wetin i know be say 5-G gangs or governors no get any say over everything because no be them go tell the youth wetin dem go do, why because everybody get their PVC and have the right to vote whomever they have decided to vote for.We don suffer well well so no body go come tell us wetin to do and wetin not to do, 5Gs are only working for their political interest to secure their earnings as usually.Vote wisely!Na true sha, but no be all youths go come out come vote, some youth hasn't collected there voters card and INEC done put January 22 as the deadline for collection of permanent voters card. Many youths never collect am, so if the youth really get say this election na with their permanent voters card and the government knowing fully well waiting the youths want go try disenfranchise them just to manipulate the election. So like this G-5 governors still get small power because after we vote finish remember no be the youths go count the vote and no be the youths to announce the result. The state collation centres for each state dey under the sitting governors",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "HajiBagi",
      "created_time": "January 10, 2023, 08:28:57 PM",
      "body": "Waiting I fit talk for here no go fit make sense but I wan just talk waiting dey my mind as person wey dey here with una as friend, this coming election no be waiting we go reason say na money oo because the election go bad and as youth wey we be na we get everything to do with our hands, make we try get pvc make we show them say na we power they our if not as we they plan to change them they don already plan how they go take change our brain take money control us, so my brother make we try approach our people make them clear their eyes.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mate2237",
      "created_time": "January 10, 2023, 11:17:44 PM",
      "body": "Dis Election wey dey come 2 di kwantri go shock plenty pple. Di drama APC and PDP dey play for we kwantri, Peter Obi from LP just dey look. Peter Obi gonfit win dis election because nai bi di highest qualify candidate for the presidential position in di country. Tinubu is already in APC and he could not do anything but to deceive the pple in the campaign trains this year Nigerians are getting wisher",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sexylizzy2813",
      "created_time": "January 11, 2023, 10:19:49 AM",
      "body": "Quote from: Mate2237 on January 10, 2023, 11:17:44 PMDis Election wey dey come 2 di kwantri go shock plenty pple. Di drama APC and PDP dey play for we kwantri, Peter Obi from LP just dey look. Peter Obi gonfit win dis election because nai bi di highest qualify candidate for the presidential position in di country. Tinubu is already in APC and he could not do anything but to deceive the pple in the campaign trains this year Nigerians are getting wisherMy senior comrade no body qualify for this presidency something until the them meet up to the contri expectations oh. Nah so we go dy hype them now till them enter office go fall out hands like plantain wey no get life, only me I no go talk or too give this men them hope because all of Dem nah the same. My prayer nah make better person enter do better thing wey go help this contri.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nezerlan",
      "created_time": "January 11, 2023, 10:53:52 AM",
      "body": "Peter Obi will win it",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sexylizzy2813",
      "created_time": "January 11, 2023, 11:42:39 AM",
      "body": "Quote from: Nezerlan on January 11, 2023, 10:53:52 AMPeter Obi will win it  My broda nah here you cast your vote? No be to just use mouth talk am oh, carry your PVC take go the main polling unit go arrange yourself for who you go vote for oh, becos if nah here you wan do your vote e no go count oh. 🤣🤣🤣🤣",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "KupaCrypto",
      "created_time": "January 12, 2023, 12:56:02 PM",
      "body": "Quote from: Sexylizzy2813 on January 11, 2023, 11:42:39 AMQuote from: Nezerlan on January 11, 2023, 10:53:52 AMPeter Obi will win it  My broda nah here you cast your vote? No be to just use mouth talk am oh, carry your PVC take go the main polling unit go arrange yourself for who you go vote for oh, becos if nah here you wan do your vote e no go count oh. 🤣🤣🤣🤣Na people like am go make Peter obi fail o, them no dey use mouth win election, na with pcv hope say as him the support Peter obi so em get em PVC, because na the only way em fit use make Peter obi win or any candidate,  go collect pvc the deadline na January 22 ,make we make our votes count, becos we done too suffer for this country o, we no gats continue like this, them no dey win election on social media or bitcoin talk, them they win am for polling unit, so make we try make Nigeria better together.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sexylizzy2813",
      "created_time": "January 13, 2023, 05:23:10 AM",
      "body": "Quote from: KupaCrypto on January 12, 2023, 12:56:02 PMQuote from: Sexylizzy2813 on January 11, 2023, 11:42:39 AMQuote from: Nezerlan on January 11, 2023, 10:53:52 AMPeter Obi will win it  My broda nah here you cast your vote? No be to just use mouth talk am oh, carry your PVC take go the main polling unit go arrange yourself for who you go vote for oh, becos if nah here you wan do your vote e no go count oh. 🤣🤣🤣🤣Na people like am go make Peter obi fail o, them no dey use mouth win election, na with pcv hope say as him the support Peter obi so em get em PVC, because na the only way em fit use make Peter obi win or any candidate,  go collect pvc the deadline na January 22 ,make we make our votes count, becos we done too suffer for this country o, we no gats continue like this, them no dey win election on social media or bitcoin talk, them they win am for polling unit, so make we try make Nigeria better together.Na true talk you yan like dis oh becos many of us like to talk for back but when time reach nah for house wey we go dy watch tv dy cheer person wey we want make em win. Election no be wetin we go just stand for road or any place say \"I want this person to win\" but when e matter well well our PVC nah to exchange am with ordinary #500 to vote the wrong person abi nah candidate them dy call am, ehen. The time nah now to choose the right person to carry us comot from this life style wey be like gutter put for better place make we smile for naija again.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Davidvictorson",
      "created_time": "January 13, 2023, 02:43:31 PM",
      "body": "The forth coming Nigeria elections particularly the presidential elections no go be business as usual. The way I see am be say, some people sabi who go bring change and development to the country but because say their dem know that their belle go block, dem wan vote for the person wey go bankroll them at the expense of the progress of the nation. Dem talk say election nor be do or die affair but you see this election ba, some persons don ready to risk it all so that our future generations go enjoy. If we miss am now, na shege banza we go see with our eyes.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dzwaafu11",
      "created_time": "January 13, 2023, 03:45:11 PM",
      "body": "As I dey see the election e no go too they had like that because almost the naija youth have notice that these 2022 wey pass men face alot... So that thing go make people reason am say no be money these time around na better wey go do better things for us because if na money they give maybe before you even live we're they give the money fit fall for there...Buh if we try vote better person if he win him go do wetin go make us enjoy for the rest our lives and e go better if we do that..",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Belarge",
      "created_time": "February 05, 2023, 05:33:01 PM",
      "body": "Hmm this election matter no be small matter oo, this election go dey very strong and bloody but I dey pray say make God come help us oo, normally me sef I no trust any of this Politicians oo, I just get this believe say all this Politicians dey thesame, The presidential election among tinubu, Atiku and Peter obi, normally I for like make Peter obi be president oo, atleast him dey young and vibrant but Nigeria election too dey get rigging inside, this old men no go gree, tinubu dey talk say na him turn to be president and en ready to do anything so en go be president.Naija we Don to suffer oo, mostly the youths, so I go like urge all the youths to get their PVC ready and make we vote our preferred candidate, because if we no get am right this time, we go suffer well well before we go get am again oo, make we shun godfatherism and do what is right.As for those G5 Governors, I no even know wetin I go talk about them, but I dey sure say e get wetin those governors Dem need from federal, as e no enter their hand nai make Dem dey try fight back, abeg me I no trust dem and I dey  plead with the youths not to support Dem abeg.Another thing be say I really wish say INEC fit provide a way wey be say we fit vote online oo, maybe with card reader because normally we know say naija election no deh dey peaceful, we dey fear because nobody want die, but if there's any way we fit vote online sincerely I for like am well well, e go really help save lives and properties...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lida93",
      "created_time": "February 06, 2023, 01:10:58 PM",
      "body": "G5 governor's or whatever them call themselves no get any impact or influence on the choice of Nigerians on who go win election as presido for we country inside this 2023 election based in say those G5 governors na part of the corruption saga wey we dey suffer for we country, Dem wan com today now com act like deputy jesûs becos their personal interest wasn't well represented.Omoor make we no allow any body deceive us cosnif this suffer we dey suffer for fuel mata, new note mata, insecurities mata, price of commodities mata and plenti others, if all dis suffering never open our eyes to vote wisely for beta leaders then mk we just ready for more suffering in promax!Like one of my professor tell me, him say dis the outcome of this election go mean one of two tins for Naija people, either, the beginin of hope or d end of hope.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "martyns",
      "created_time": "February 08, 2023, 11:55:14 PM",
      "body": "Quote from: Itzjimmyvic01 on January 09, 2023, 03:19:45 PMI no think say only G5 alone go fit stand decide who go be the next presido....e nice day this pepper wey Buhari don use our eye see, reach everybody side. Now na make we get sense, use our PVC put better person wey we know say e go carry us commot from the mess....I dey Obidient faOmoh,this kind election,only PVC self no go fit do anything.we go just follow dem talk too,but me I know say dem go playam give who ever them like.Buhari nai dey on power,majority of the things wey him go do,and the person of him choice wey him gat to put into power,and the election go dey the way him want.Everybody get where dey want go,and who dem wan make him pass,All i know be say,that day of election,I go travel go see my place.But anyhow e be,I believe say God no go make bad leadership retain him power.We just dey on God for the country .",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}