{
  "id": "topic_5471026",
  "title": "OGsmall",
  "author": "OGsmall",
  "created_time": "October 20, 2023, 11:10:36 AM",
  "content": "Yes some how I agree with them because a lot is going wrong in the country This is Nigeria were you see animals eat money, Nigeria is a place people do a lot of things bad roads and corruption has taking all over, but still on still as the matter be we all still dey believe on change of the country, come wetin u think?? u don ever think am",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5471026",
  "comments": [
    {
      "author": "Charles-Tim",
      "created_time": "October 20, 2023, 11:32:03 AM",
      "body": "Many people will complain about Nigeria because we are in the era that people prefer to depend on government than themselves. They want the government to do everything for them. To provide to good job, and if possible, to subsidize some products and services.In Nigeria, you will see people from poor background that become rich and become well known in his town. If that is still possible, it means many people will complain, but some people will still live a good life. As some people are complaining, in the same Nigeria some people are earning on foreign currencies like United States dollar and some people are still living comfortably.Some people will not just get it but be complaining and explaining how a situation is. Yes, I agree to the fact that Nigeria economy and standard of living is poor.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Richbased",
      "created_time": "October 20, 2023, 11:39:43 AM",
      "body": "People have absolutely lost hope in our government due to devastating news people hear everyday from insecurity cases to economic stagnation and things had keep on being difficult for the common person why the rich gets richer the common man is struggling to survive.It is very sad that our government has neglected the voice of the masses they no longer put the interest of the masses in consideration, they take decisions without knowing the effects on her citizen.Just take a look at our electoral system, Even when the masses turn up in mass to elect their leaders, they will overturn everything to their favor without even thinking of the repercussion of their decisions. Imagine a country where a presidential aspirant will tell the country that it is his turn to rule. So Nigeria has now become a family inheritance whereby people now think that there are certain groups of person that should be rotating the leadership of the country.Imagine some government officials now take leadership as a permanent contract that they will remain in office for a very long time without allowing others to participate in leadership. Now what is the fate of the younger generation like is it when they will get old that they will take part in the leadership of the country? Things keeps getting worst everyday from one sad news to the other no one will be happy in such situation.Inasmuch as people are also making efforts to make things work in this country, our government should also put her citizen in consideration when taking decisions that will affect her citizens. Everyone hopes to live a good life and a good environment so a situation where a citizen feels that their country isn't conducive for them again they will literally begin to lament about their country.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hatchy",
      "created_time": "October 20, 2023, 11:47:40 AM",
      "body": "Quote from: OGsmall on October 20, 2023, 11:10:36 AMThis is Nigeria were you see animals eat money,  Lol the great serpent . Well with the whole issues happening in the country, it's enough for someone to regret being born a Nigeria. The economic doesn't look promising, neither is the country. Alot of people daily begging on the streets, no food, no shelter but still the governments aren't working any thing about it. The solution, is very simple. We don't have to hope on the government for anything. We have a lot of skills one can learn to help them survive in this demishing economy",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Y3shot",
      "created_time": "October 20, 2023, 12:13:05 PM",
      "body": "Quote from: OGsmall on October 20, 2023, 11:10:36 AMYes some how I agree with them because a lot is going wrong in the country This is Nigeria were you see animals eat money, Nigeria is a place people do a lot of things bad roads and corruption has taking all over, but still on still as the matter be we all still dey believe on change of the country, come wetin u think?? u don ever think am The thing is that all the these things that are happening in our country didn't start today but longtime ago that the government then the border to pit a stop to this corrupt practices which today it has become something so big that it is so difficult for the country to be in a good shape. The problem naija is having is that it is not just only the politicians are the problem of the country but the judiciary are also corrupt too, when the judiciary don't know the right thing to do that means it is impossible for politicians to do right thing. The firm of corruption is getting worse day by day. It will only take the grace of God for the country to change for good because the corrupt lifestyle of the politicians is really affecting the common citizens in the country.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Obim34",
      "created_time": "October 20, 2023, 01:45:10 PM",
      "body": "Omor... Is like na only me no see am like this oh, I be proudly Nigerian no matter what dey do.One attribute of Human is the ability to adapt to even unfavorable conditions, even at such level of corruption in this country there is always a time for change most countries doing well today are older than Nigeria and they all went through this process of corruption, I call this the process of change. Go and check the history of other countries we think are better than Nigeria, check there history and tell if they haven't witness much corruption than Nigeria.We should be grateful enough for being Nigerians, as you not there yet you won't understand what they are passing through most times they would love to become Nigerians",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Out of mind",
      "created_time": "October 20, 2023, 03:07:17 PM",
      "body": "It's regrettable for anyone too be born in Nigeria today, because most of the problems in the country are related. Economically not promising and most of the people are suffering here causing the most problems in the country. Also, if you look at different parts of my country, people are not getting food, clothing, shelter. Every day a large number of people beg on the streets just to provide themselves with food, but here it is seen that the government does not take any action towards it. People don't have shelter All in all the poor people of our country are facing most of the problems, and they are suffering a lot due too lack of food, still the government is not doing anything about it. That is why we should inform the government about these issues and the leaders who are in the area must take good steps for these poor people. If the government takes all these steps and resolves everything, then surely Nigeria can be a well-developed country and move ahead economically in the future.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Miles2006",
      "created_time": "October 20, 2023, 08:34:44 PM",
      "body": "Abi you no dey see how the country dey. Nobody go tell me say this inflation and the current situation wey naija dey no dey affect am, proud Nigerian or not, dependent or independent, business man or salary earner, naija current situation dey affect everybody, naija just dey fucked up for now and I no dey blame anybody wey dey talk bad about Nigeria. But observe people wey dey complain naija dey in many faces. the jobless ones wey no wan make effort to do anything, them think say everything na government go provide na why sometimes wey flood come them go blame government lol, government don suffer. business men: even this naija current situation dey affect business men too. For example the price of fuel, some business dey wey involve light, and them go need to buy fuel daily because the electricity system for naija na another problem. And business men dey short for money due to the price of fuel currently. salary earner/civil servants: due to the inflation in naija, price of things don increase and no upgradment of civil servants pay, but things dey expensive, sometimes month never end money don finish.Even me wey dey talk the country tire me because I go buy something today for market the next week price don increase, and the thing dey amaze me sometimes I go dey wonder. But we still dey manage for the country.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Spaceman1000$",
      "created_time": "October 20, 2023, 11:01:01 PM",
      "body": "Quote from: OGsmall on October 20, 2023, 11:10:36 AMYes some how I agree with them because a lot is going wrong in the country This is Nigeria were you see animals eat money, Nigeria is a place people do a lot of things bad roads and corruption has taking all over, but still on still as the matter be we all still dey believe on change of the country, come wetin u think?? u don ever think am Baba the country don really frustrate people life. Omo people just dey suffer unnecessarily for something way no be their fault.  We really need to put hand change things for this country oh, if not our children go jam worse situations than these, we need to put Hands together to  correct some of the anomalies way we dey face currently, to make way for the future generations, so that dem no go come dey ask this question way OP dey ask now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Roseline492",
      "created_time": "October 20, 2023, 11:31:56 PM",
      "body": "I wouldn't blame anybody that feels Nigeria is not good for them because truly our system has failed us woefully and because of that, people has already lost hope on them. How can a country that's blessed as Nigeria cannot empower there youth or create an avenue were people could showcased there skills and things they have read I'm the school. Every sector in our government is corrupt, and cost of living is getting higher by the day, imagine small things we normally buy for 500 naira is now more than 2k and so many persons even finds it difficult to have a square meal a day due to hardship and even the price of commodities the federal government are supposed to work on by introducing price control policy so that things will be a bit easy but they're not doing anything about it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Forever101",
      "created_time": "October 21, 2023, 12:02:55 PM",
      "body": "If anyone thinks Nigeria is hard, I think the person is yet to appreciate the goodness of God to be a Nigerian. To be sincere with ourselves, Nigeria is hard now but there  is no point regretting being a Nigerian,  there are countries that are more difficult than Nigeria but there media keep saying good about them. We have seen people who travelled out who later testify that Nigeria is better than other places. I have some person who just returned from Ghana and when I ask them about the situation there, they confess that Nigeria is 100% better. The difference between us and other countries are the media. As for us we take everything out to world why for others they covered their story.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AGogi2003",
      "created_time": "October 21, 2023, 10:36:09 PM",
      "body": "Quote from: Forever101 on October 21, 2023, 12:02:55 PMIf anyone thinks Nigeria is hard, I think the person is yet to appreciate the goodness of God to be a Nigerian. To be sincere with ourselves, Nigeria is hard now but there  is no point regretting being a Nigerian,  there are countries that are more difficult than Nigeria but there media keep saying good about them. We have seen people who travelled out who later testify that Nigeria is better than other places. I have some person who just returned from Ghana and when I ask them about the situation there, they confess that Nigeria is 100% better. The difference between us and other countries are the media. As for us we take everything out to world why for others they covered their story.My brother things dey hard for the country na him make people dey complain no be say dey no like the country, you no see how everything add price for market some people dey find waiting dey go eat with family dey no get, no job opportunity corruption everywhere fuel dey increase price and food stuff dey add price too look how dollars dey increase and our naira no get value too and you said make people no cry if no be only God dey self us for this country he for no better for us, all our leaders where go make the country better na them dey kill am again how you con dey reason am, you no go dey use another country problem with your country every country get them on issue, now you are talking about Ghana if you check am I don't think there issue is related with our naija on, how things dey add price and insecurity for our country he no go be there issue he can be something else, and if economy no dey stable for country definitely you will no that the country have serious issue to resolved.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jegileman",
      "created_time": "October 21, 2023, 11:29:19 PM",
      "body": "Quote from: OGsmall on October 20, 2023, 11:10:36 AMYes some how I agree with them because a lot is going wrong in the country This is Nigeria were you see animals eat money, Nigeria is a place people do a lot of things bad roads and corruption has taking all over, but still on still as the matter be we all still dey believe on change of the country, come wetin u think?? u don ever think am Yes, me na believer and I no go fit eva lose hope say my fatherland no go eva better as oda countries dey better. For every hardship, reward dey always dey follow am, even if no be now, make d next generation to come, our children dem, make dem enjoy the fruit of our labour now, seriously I no mind at all. If we keep blaming d country and ourselves, tings no go better. Everybody wan dey claim wiseness, d same position wey you dey complain say leaders no do well, dem give you a position and first tin wey come your mind na to steal money, which way na, how e wan take better na. Dis one na just one part of the disease wey Nigerians get, dey have the mindset say na national cake and make dem cut their own share to, and d repercussions na the next generations e go affect. As Naija be now, you no need to dey wait for government to succeed or find way chop. Naija na one of the best place to run business smoothly without been affected by many things to slow your business down. I know say disadvantages dey but na d positive part you go look into more for you to succeed here. Look for business dat will for you and sell it out. Naija na stil better place wey I no go ever leave say I no go come back again. No matter how your house be, you go still manage sleep inside, na so our Naija be and I know say one day e go better for us all. But before e happen, make we ourselves start d change wey we want for d country. It begins with you and I.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cyber_warrior",
      "created_time": "October 23, 2023, 12:55:00 PM",
      "body": "Quote from: OGsmall on October 20, 2023, 11:10:36 AMYes some how I agree with them because a lot is going wrong in the country This is Nigeria were you see animals eat money, Nigeria is a place people do a lot of things bad roads and corruption has taking all over, but still on still as the matter be we all still dey believe on change of the country, come wetin u think?? u don ever think am People done too suffer, this matter they vex oh because the level of poverty they increase every day and the challenges of people they increase and what annoys me the most na the fact say people they endure am and have refused to talk to me if this things continues like this they will end up shutting the country down, make we clear our self because this exploitation is becoming to much from does big belle people.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Franctoshi",
      "created_time": "October 23, 2023, 01:41:09 PM",
      "body": "There is no better country than your country, but because the Citizens are not being carried along by the government, it now seems like being a Citizen of Nigeria is a thing of regret, our politicians have turned Nigeria into a government only for the Rich people, and the poor masses are being neglected and not taken care of, and now their target is the middle class, with the current hike in fuel price would push a lot of middle class into poverty line so that they will have opportunity to do whatever they want without anybody questioning them.However, despite all their efforts in trying to do this, they have even made a lot of people become self-dependent without having to rely on our government for survival.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Versatile_choice",
      "created_time": "October 23, 2023, 04:30:47 PM",
      "body": "Considering all the things that has been happening in this country nobody will be happy, we no that no country is perfect but at least the well being of there citizens should be there major priority but in the case of Nigerian government noting like that when we have all the resources that can take care of everyone but instead all they care for is only there pockets. If you check very well you will see that millions of people are graduating from school every year and no employment nothing to empower the youth, when the reason for going to school is to become a successful man in the future and spending years in school you come back home to start from square one, who will not be angry at the government, we have not even talk about the high cost of living in the country were the average man find it difficult to have a two square meal a day.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptoHeadlineNews",
      "created_time": "October 23, 2023, 05:40:26 PM",
      "body": "Quote from: OGsmall on October 20, 2023, 11:10:36 AMYes some how I agree with them because a lot is going wrong in the country This is Nigeria were you see animals eat money, Nigeria is a place people do a lot of things bad roads and corruption has taking all over, but still on still as the matter be we all still dey believe on change of the country, come wetin u think?? u don ever think am Though Naija may be said to be corrupt, but it's still far better than others.  Though our Naija may be said to have bad government who do not care about the welfare of it's citizens, but yet we still have people hustling to survive despite all odds.So whatever people may be passing through in this country Naija, I don't think that's enough reason for people to say it is a mistake to be citizen of our dear nation, because nobody chose to be born in this nation, and as such, it is our sole responsibility to make things right where people are getting it wrong, instead of condemning or complaining, because I believe that with a collective effort, we can make this nation great again. So hence, it's never a mistake to be born in our dear nation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Benedictare",
      "created_time": "October 25, 2023, 04:09:40 PM",
      "body": "The reason wey make people think say na mistake be say na d way d people wey dey power dey handle Mata.Nigeria government no dey like support beta beta ideas of the youths like innovations creativity, technology e.t.c dem no even get plans for the future leaders or even motivate people,wen some of dem politicians wan try dem go com dey do continent things like tribalism, religious differences ,dem no dey reason anybody,but  thank God say u dey alive ,God wey create u put for Nigeria no do mistake ,so think how u go help urself and others around u grow .As u dey help urself na him make dey Bitcoin  now u no weti for government",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Asiska02",
      "created_time": "October 26, 2023, 07:40:27 AM",
      "body": "Quote from: OGsmall on October 20, 2023, 11:10:36 AMYes some how I agree with them because a lot is going wrong in the country This is Nigeria were you see animals eat money, Nigeria is a place people do a lot of things bad roads and corruption has taking all over, but still on still as the matter be we all still dey believe on change of the country, come wetin u think?? u don ever think am Dis matter get as e be and e dey painful to live in a country like dis and continue to see life as a hell where be say for other places dem don better and get good source of livelihood. But as a Nigeria person, we no suppose lose hope for our country because na we go still feel d impact of the economic pandemic wey we dey face. I still dey believe say Naija go change, I no know when or how e go take happen but I know say with time e go better. Even dis hardship wey we don face so far is enough to be hopeful of a change soon.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Chilwell",
      "created_time": "October 26, 2023, 08:21:35 AM",
      "body": "Quote from: Spaceman1000$ on October 20, 2023, 11:01:01 PMQuote from: OGsmall on October 20, 2023, 11:10:36 AMYes some how I agree with them because a lot is going wrong in the country This is Nigeria were you see animals eat money, Nigeria is a place people do a lot of things bad roads and corruption has taking all over, but still on still as the matter be we all still dey believe on change of the country, come wetin u think?? u don ever think am Baba the country don really frustrate people life. Omo people just dey suffer unnecessarily for something way no be their fault.  We really need to put hand change things for this country oh, if not our children go jam worse situations than these, we need to put Hands together to  correct some of the anomalies way we dey face currently, to make way for the future generations, so that dem no go come dey ask this question way OP dey ask now.Even though we don agree say we go put hand together where the power wey we wan use dey? How we go take join hands together? If dey ask me this question base on this matter I go say make we no fold hand dey wait for government say na him alone go do everything, if we wan make we avoid the OP question from our children na to stand up they hustle for that tomorrow, make we find something doing and to they pray to God to help us achieve our dream. Make we dey even thank say naija wey we dey na blessings ooo because na the one wey we don experience we fit talk about, make we no dey compere naija with any country because even them get wetin dey bit them, if anyone no fit survive for Naija even though the born the person in dubai you no go still survive, to survive for this world na by hard work and pray no matter where you were born you will survive.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}