{
  "id": "topic_5428926",
  "title": "Nwada001",
  "author": "Nwada001",
  "created_time": "December 15, 2022, 01:22:17 PMLast edit: January 29, 2023, 03:10:41 PM by Nwada001",
  "content": "Was having a walk around Port Harcourt Yesterday if I can see something I can get for myself as a birthday present when I came across a Bitcoin shop by the roadside, out of curiosity I walked inside the shop, and ask if they sell  and buy Bitcoin which they said yes.. I ask for rate and they said #712 per 1$ which is lower than what I usually buy online, I said okay I want to buy 1000$ which they calculated it to be a total of 720,000.000 in my local currency. An account was given to me which was a personal accounts, I then asked why the account don't have the business name, they said it was because of the regulation in the country to avoid story that touches. And I paid the balance with my other account. Once the payment was confirmed they asked for my deposit address which I gave them my Binance BTC deposit address and btc worth 1000$ was sent to my wallet immediately which is currently worth 1006$ as of the time of this post now. After I confirmed the transaction that was when I left the shop and consider that purchase as my birthday present. Am planning on holding for long till my next year birthday which is 15th December 2023. Don't know if moving the BTC to my trust wallet or looking for a hardware wallet which one will be better off for such small amount which I planned to hold for a long period. Happy birthday to my self.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5428926",
  "comments": [
    {
      "author": "Findingnemo",
      "created_time": "December 15, 2022, 01:33:30 PM",
      "body": "Happy Birthday!Well, it's an p2p outlet nothing else and if there is regulation issues with the government and Bank then how they can open such outlet in a public place.For storing 1000 dollars worth of BTC I think Electrum will be better choice than a hardware wallet and holding for one year may not be a long term investment, I consider its a long term only if you manage to hold it for a cycle which is pretty close to 4 years.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NeuroticFish",
      "created_time": "December 15, 2022, 01:34:47 PM",
      "body": "Happy Birthday!I've seen a flaw in what you've done and I'd like to point it out here: you've put your bitcoins to storage into somebody else's wallet. Yes, that somebody else is Binance in your case.You've missed all the \"not your keys, not your coins\" messages on this forum??Yes, if nothing bad happens, Binance will keep granting you access to your money. And if something bad happens... bad luck.I advise you learn how to keep your coins safe in your own custody (generate a wallet or seed safely offline, or buy a hardware wallet, for example). It not be easy (or it can mean another investment), but if you master that, your money will be indeed yours, not like now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Doan9269",
      "created_time": "December 15, 2022, 01:36:13 PM",
      "body": "This is interesting to see that you engage an exchange service within your locality been a Nigerian, but you still need to be careful because i heard of the similar events the EFCC and other governments security agencies do track down those who are into crypto despite the government come out plain that it's legal to use and transact with, but if you're found by it security agencies seems to be unlawful but you just need to engage more research concerning this, so you don't land yourself into trouble for physical identification, you could also reason along with how they try to regulate every form of cryptocurrency in place, bitcoin is meant to be anonymously engage with it's p2p in other to byepass offences and regulations, but you've got a good start to encourage you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Obari",
      "created_time": "December 15, 2022, 01:48:05 PM",
      "body": "That amount of a thousand dollar isn't little mate and I hope you already had all the necessary knowledge you need for holding. Bitcoin is a very volatile and lucrative digital asset and hence one must have to be prepared both physically and mentally and also emotionally to face this crypto journey.With that been said, I think not everyone knows where port Harcourt is, soni will suggest you also state the country  so people will be able to locate this shop if they're within the locality.I guess the 712 was their buying rate and 720 the selling rate if I'm not wrong.Happy birthday mate And I hope  you have a great day and always remember to check your portfolio.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cantsay",
      "created_time": "December 15, 2022, 02:02:00 PM",
      "body": "Happy birthday to you.If you truly want to avoid story that touches them you should probably considered moving that coin from Binance to your wallet. Remember \"NOT YOUR KEY NOT YOU COIN\" QuoteDon't know if moving the BTC to my trust wallet or looking for a hardware wallet which one will be better off for such small amount which I planned to hold for a long period.Since you plan on hodling for a long time then you should consider getting yourself a hard wallet just so as to improve the security of your coin. I must admit $1000 is quite a lot to leave in a centralized exchange. You can check out this thread for list of hard wallets https://bitcointalk.org/index.php?topic=5282364.msg55389639#msg55389639 the thread was created 2020 and last edited February 2021 so the prices you see there are not up to date but at least it could give you idea of which them to go for.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pokapoka124",
      "created_time": "December 15, 2022, 02:47:28 PM",
      "body": "Happy birthday to you. Bitcoin is a nice birthday gift to give oneself… since you already had a account on Binance you could have easily used their p2p service to buy bitcoins from the comfort of your home. I guess your curiosity got the better of you. Although you say it’s cheaper, the disadvantage going to buy bitcoins at a shop in person is very risky. You could be mugged on your way out you never know. Also it’s equally risky to hodl your bitcoins in centralized exchanges, Binance may be under investigation soon. Once this starts, there will be a FUD and massive withdrawals, you don’t want your coins there if that eventually happens.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Minecache",
      "created_time": "December 15, 2022, 02:49:35 PM",
      "body": "Happy birthday, mate.If you are going to hold it for a long time, then I suggest you buy yourself a hardware wallet. Your bitcoins are currently worth $1k, but if you hold until the bull season when bitcoins hit $100k or $200k, those bitcoins are no longer worth $1k but have gone up to 10k$ or more. So it's not a small amount, you should cherish it from now on. Trust wallet is a non-custodial wallet, closed source, only suitable for holding shitcoins, it is not suitable for holding bitcoins long term. If you can't buy a hardware wallet now, you can use Electrum instead of Trust wallet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "so98nn",
      "created_time": "December 15, 2022, 03:12:14 PM",
      "body": "Looks good. I am wondering how they are operating even if the regulation does not allow them to trade like that? And what public place are you mentioning here? Like isn’t this office is widely open for public on the roadside ? Isn’t that is enough as public place to trade!Secondly, we need crypto p2p but we need it free from all the documentation and stuff. Like in this case they did ask for your personal account info!Also, can I ask you what was it like inside the crypto bank? Does not look very safe place to store the bitcoins looking at the structure of bank. Just asking out of curiosity. & Happy birthday.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "December 15, 2022, 03:18:13 PM",
      "body": "@Nwada001, please post images in a suitable size using the following code -> adjust site by changing number.Code:[img width=200]LINK HERE[/img]In any case, the gift you gave yourself, even if it is not something tangible, can prove to be a valuable investment for the future. What may not be completely logical is that you already have a date by which you plan to hold, and you cannot know what will happen in 1 year - the price may be similar to today, lower or only slightly higher. A much better option if you don't need that money is to extend that period to at least 2 years.For the sake of privacy, you may have hidden your face, but you have revealed your location and exact date of birth, which is not very smart considering that you are investing in Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GiftedMAN",
      "created_time": "December 15, 2022, 03:28:36 PM",
      "body": "Happy birthday mate and good one you did by getting something spectacular for yourself to spice up your new age celebration with your Bitcoin purchase in the city of Port Harcourt Nigeria. A very good contribution I advise you to adhere to is the advice given to you by @NeuriticFish, in order to avoid bad omens that may lead to lost of funds you need to be in control of your funds. I will equally want to know about the shop in Port Harcourt since is closer to my area so that I can do transactions with them if they have a way of doing transactions without having issues with the government since Cryptocurrency is not yet legalized in Nigeria.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gallar",
      "created_time": "December 15, 2022, 03:32:41 PM",
      "body": "it's very lucky where you have a shop like that, it's very rare to have a shop like that. but does the government allow it, because in my country bitcoin is not openly legal, some even prohibit it.and my advice is to save your bitcoins until the next halving, or the four-year bitcoin cycle, so that the results you get are maximized.because if you sell bitcoin next year, the chances are that bitcoin will not go up too much.and happy birthday to you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kryptqnick",
      "created_time": "December 15, 2022, 03:41:45 PM",
      "body": "It's a lovely story, happy birthday! I'm happy you've found a place and got some BTC. I agree with Findingnemo that Electrum wallet sounds like a good choice for storing the funds. So far, they are on a crypto exchange, right? While Binance is highly reputable, no exchange is invincible: they can still go bankrupt at some point, get hacked, suffer from a big inside job leak, require even more identification documents, etc. So, withdrawing from an exchange and moving the funds to a non-custodial wallet is desirable.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Die_empty",
      "created_time": "December 15, 2022, 03:42:04 PM",
      "body": "The joy of buying a thing of value made you to start this thread. Therefore, I want to say a big congratulation and happy birthday to you brother. I am thrilled to see that even with the restrictions placed on banks from engaging in bitcoin transactions, many individuals and organizations are coming in to fill the gap. These organizations are even spending money on advertisement and publicity which has led to increase in bitcoin awareness. The main issues in most areas is that there are no decentralized platforms were P2P trading can be done without third parties. Also the bitcoin community in most areas are not well coordinated or organized so that P2P transactions can be encouraged and promoted. Almost all bitcoin transactions in places like Nigeria is done through exchanges which is not really a good development.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cookdata",
      "created_time": "December 15, 2022, 03:52:56 PM",
      "body": "Quote from: Nwada001 on December 15, 2022, 01:22:17 PMWas having a walk around Port Harcourt Yesterday if I can see something I can get for myself as a birthday present when I came across a Bitcoin shop by the roadside, out of curiosity I walked inside the shop, and ask if they sell  and buy Bitcoin which they said yes.. I ask for rate and they said #712 per 1$ which is lower than what I usually buy online, I said okay I want to buy 1000$ which they calculated it to be a total of 720,000.000 in my local currency. An account was given to me which was a personal accounts, I then asked why the account don't have the business name, they said it was because of the regulation in the country to avoid story that touches. It's great to see another physical merchant around PH, I believe this will save many people who dislike selling bitcoin online, as well as people who come across WhatsApp vendors who turn out to be scammers. I hope merchants take precautions as well, because while holding and conducting bitcoin business in public may draw a lot of attention, it may also draw the attention of armed robbers or thieves in the neighborhood especially if they don't have security personnel.What I don't understand is the rate they sold bitcoin for you, most of the physical vendors would sell at high prices considering the risk they are taking and buy at lower prices, currently dollar to Naira is traded around #750/$ but you were able to buy at a cheap rate or are they doing some kind of discount sales especially now that we have December at the corner.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nwada001",
      "created_time": "December 19, 2022, 07:58:49 AM",
      "body": "Quote from: Lucius on December 15, 2022, 03:18:13 PM@Nwada001, please post images in a suitable size using the following code -> adjust site by changing number.Size Edited, New thing learnt. About my privacy its something i should have considered, never the less my age and location without my real name and face its some how nearly impossible to identify me.Quote from: so98nn on December 15, 2022, 03:12:14 PMSecondly, we need crypto p2p but we need it free from all the documentation and stuff. Like in this case they did ask for your personal account info!Also, can I ask you what was it like inside the crypto bank? Does not look very safe place to store the bitcoins looking at the structure of bank. Just asking out of curiosity. The place is beautify and they have external security, for the safe of storing and keeping bitcoin in that shop, i think its not that safe, what i notice was that they make use of a hardware wallet which they brought out from a safe inside which I really don't know how it looks like. They never ask for any form of document or means of identification everything apart from the transfer i did for them to their account was decentralized, they asked for cash which i laughed and ask how can i carry that huge amount and be working around. Quote from: Cantsay on December 15, 2022, 02:02:00 PMIf you truly want to avoid story that touches them you should probably considered moving that coin from Binance to your wallet. Remember \"NOT YOUR KEY NOT YOU COIN\" I know the saying not your key, not your coin, which was why I was asking for the perfect wallet to move the funds to. I have successfully moved the bitcoin to my private wallet which is safe and sound for me. Its kind of hard replying and quoting all questions here, still learning the system bit by bit. In General i have moved my coin to a private wallet, and its safer for me over their, i have also decided to extend my holding duration to 4years since I don't have anything mapped out for that fund yet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yazher",
      "created_time": "December 19, 2022, 08:06:20 AM",
      "body": "I'm more interested in the outcome of your investment and since you gonna hold it until next year then, hoping you have a wonderful year of your life please keep firm and be patient about the crypto market situation these upcoming months since it's not yet the Halving season, I'm sure there are lots of ups and downs. Be sure to have perseverance and courage to keep your bitcoins till next year or till after the bitcoin halving for there will be great positive news after that because it might be another bull run and another ATH as well.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NdaMk",
      "created_time": "December 19, 2022, 08:41:18 AM",
      "body": "Quote from: Cookdata on December 15, 2022, 03:52:56 PMWhat I don't understand is the rate they sold bitcoin for you, most of the physical vendors would sell at high prices considering the risk they are taking and buy at lower prices, currently dollar to Naira is traded around #750/$ but you were able to buy at a cheap rate or are they doing some kind of discount sales especially now that we have December at the corner.My biggest surprise too, maybe they are actually doing it to lure in more customers just because its a new business. At this rate it will attract many bitcoiners. But why worry is how they tend to gain at that rate, do they have a way they get there own bitcoin bought at bank rate (1$=₦450).Concerning robbery or other theft issues I think they could do with a security force around if it's a romote. Since the government is relaxing it's strict rules against crypto currency I see them not encountering difficulties in the business, hopefully the next government doesn't go back to banning it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mohammadn72",
      "created_time": "December 19, 2022, 08:52:19 AM",
      "body": "thank you bro!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "December 19, 2022, 11:14:37 AM",
      "body": "Quote from: Nwada001 on December 19, 2022, 07:58:49 AMSize Edited, New thing learnt. About my privacy its something i should have considered, never the less my age and location without my real name and face its some how nearly impossible to identify me.It's nice to see someone taking well-intentioned advice and wanting to learn new things. I hope you are right about privacy, although you will learn over time that some things should remain private, no matter how harmless they seem to you.Quote from: Nwada001 on December 19, 2022, 07:58:49 AM In General i have moved my coin to a private wallet, and its safer for me over their, i have also decided to extend my holding duration to 4years since I don't have anything mapped out for that fund yet. In any case, it is a good decision, especially considering everything that has happened in recent months - having Bitcoin anywhere \"online\" is practically the same as not having it. As for the time you plan to keep your BTC, I don't think you should strictly limit yourself to a certain number of years, because in 4 years you could find yourself in the middle of a bear market again.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}