{
  "id": "topic_5398993",
  "title": "AEX2013",
  "author": "AEX2013",
  "created_time": "May 17, 2022, 09:09:58 AM",
  "content": "Read the entire transcript of the TomoChain AMA on April 21, 2022 from 9AM to 10AM UTCFew days ago, April 21th from 9AM to 10AM UTC, the TomoChain team hosted an AMA with Justin Yan, the Marketing Manager of TomoChain, and ASYA, AEX PR Manager  to answer the community’s questions and talk about the AEX. In case you missed the live AMA or wish to review the entire set of questions, below is a full recap of the discussion. Thanks again to everyone who participated in the AMA. We’ll keep everyone posted when we’re set for the next oneQ: I'm today's host, your old friend Justin. welcome to the AMA and we have a special guest today that's Asya from the AEX exchange. Welcome Asya A: Hello everyone, it's nice to be invited to the Tomochain community. I would like to thank all the participants for their participation in today's AMA.Q: Thanks for joining us today. and just letting everyone know that I just muted the public chat to ensure an uninterrupted conversation. and in today's AMA, Asya will share some interesting trading options and promo campaigns that they have for TOMO First of all, could you give us a brief overview of the AEX exchange?A: Of course, I'd love to!AEX crypto exchange was established in 2013. It provides world leading management services for crypto assets. The scale of crypto assets stored on it is at the forefront of global exchanges. AEX has eight major international headquarters in the United States, Japan, Hong Kong, the United Kingdom, Singapore, Vietnam, France and the United Arab Emirates. AEX is committed to secure investment and steady appreciation, and provides protection for users' assets through regulated encrypto licenses, fiat currency docking, etc.After 9 years, AEX has reached millions of registered users covering more than 200 countries and regions around the world. AEX is the only exchange that combines the flow of industry information and crypto assets. It has the global BitTalk community and has created an encrypted space that transcends the boundaries of nationality, region, culture, and economics to introduce truly inclusive finance with distributed user participation.AEX's current business modules are quite extensive, including: Fiat Exchange, Spot Trading, Aswap, Defi-Pool, Staking, Fixed Savings, Flexible Savings, Term Loan, Demand Loan, C2C Loan, etc. No matter if you are a newbie or advanced, everyone will find their preferred scenario.In the trading module, AEX opens three trading sequences of USDT, USDC and BTC, with over 300 currencies listed in total. AEX has also classified and identified crypto-labels based on cryptocurrency liquidity, price stability, and predictive research, helping users achieve \"safe investment and steady appreciation.\"AEX's financial management services are popular among users. The volume of crypto assets stored is at the top of exchanges worldwide. Since the launch of AEX financial products, the exchange has operated safely for over 1100 days. The cumulative investment amount of users has exceeded $70 billion and generated a total income of $188 million, benefiting more than 13700 investors.Q:: What are your strengths and competitiveness compared to other exchanges?A: It is a good question.Compared with other exchanges, our advantages are mainly in these four aspects.1.9-year old brand exchangeFounded in 2013, AEX is one of the world’s leading digital asset management platforms, dedicated to providing millions of users with digital asset management services. 2.Keen market insightWith a keen eye for any market developments, the AEX team can move quickly to serve market demands by launching mainstream investment currencies and derivative services, which include the DeFi sector, NFT sector, DOT ecosystem, DAO, DeFi smart mining, and ETH pool mining. Therefore, it excels in predicting where future hotspots may occur, thus providing users with the chance to benefit as early risers.3.Transparent operationAEX always stays neutral and commits no evil. It publicizes the flow of funds on the platform.A trusted query system is in place, and cool wallet addresses will be made known to the public step by step. Now five currency types have their proof of reserve available online. They are ATOM, DASH, VSYS, XTZ, and XZC.All business lines achieve data transparency. Some examples of them include spot trading, OTC trading, Saving, and Staking.Dedicated asset management posts are set up to fulfill duties of transparency.4.SecuritySince its establishment in 2013, AEX has never triggered any severe system security incident. Thanks to the technological maturity that AEX has gained in the last nine years, users' assets can be protected around the clock.Q: We noticed that the rewards for today’s AMA will be paid out in $GAT token, which is your platform token. Could you tell us about the use cases of the $GAT token? A: GAT is a globalized universal credits launched by AEX. The full name is GlobalAEXToken. The original total amount of blockchain assets issued on the Bitshares BTS (Bitshares) chain was 100 billion, and 77 billion has been destroyed. The current total is 23 billion. 2 billion will be issued on the ERC20 chain and will never be issued. It can be circulated globally. There will be multiple trading platforms and BTS internal disks to support transactions.As I just said,The AEX platform token is GAT, which can be circulated in multiple business modules of AEX. Holding GAT provides convenience for obtaining airdrops for various activities of AEX, and it is also one of the main tokens for the linkage between the project, AEX and users.Q:  Our community is super curious about the promo campaigns that you are throwing out for TOMO. Could you walk us through in detail and how our community members can take part in these campaigns?A: AEX listed TOMO (TomoChain), and opened the TOMO/USDT spot trading pair at 9:00 a.m. Yep, that is the time we started the AMA.  1500% + Genesis APR & $30,000 Giveaway !Promo 1. Deposit  TOMO to share $800 equivalent of TOMODuring the event, users can make a net deposit of any amount of TOMO on AEX, and the rewards will be distributed according to the proportion of the net deposit. The total reward pool is $800 equivalent TOMO. Rewards will be collected on a first-come, first-served basis, while stocks last.*Net deposit amount = deposit amount – withdrawal amount – sell amountPromo 2. Earn $TOMO | Grab 1500% + Genesis APR!Users can participate in the TOMO-USDT pool  of ASwap and grab the first mine with a 1500% + Genesis APR. It will start on April 22, 2022 9:00 a.m. (UTC). TOMO will be earned in this pool. https://www.aex.com/page/amm_swap.html#/poolList?type=2 Here is the link to the ASwap pool, but it doesn’t open now.  You can also participate in our stablecoin pool in advance to experience. Our stablecoin pool APR is also as high as 16.9%.Advantages of ASwap I listed here:*9 years of encrypted trading platform, TVL scale exceeds $200 Million income！*Enjoy anytime deposit and withdrawal, NO GAS fee，*Earn coins flexibly, and the income will arrive in seconds*Grab the ultra-high genesis APRPromo 3. TOMO Trading Contest, Win $23,200 Equivalent GATEvent Time: April 22, 2022 9:00 a.m. – April 27, 2022 9:00 a.m. (UTC)As long as users have trade in the TOMO/USDT spot trading pair, they can obtain the qualification to share. The first place will receive GAT equivalent to $3,200; 2-5 winners will share GAT equivalent of $3,000; 6-50 winners will share GAT equivalent of $7,000; The rest will be shared by other TOMO traders.Promo 4.Participate in TOMO community activities and win another $500 TOMO rewardUsers who join the AEX official English telegram group and participate in the AMA Q&A interaction will have the opportunity to share $500 TOMO!Promo 5. Participate in the TOMO Twitter campaign and receive a $500 TOMO airdropEvent time: April 19, 2022 6:30 a.m. – April 21, 6:30 a.m. (UTC)Click here to join: https://twitter.com/Aexglobal/status/1516297740380442626There is no threshold for everyone to participate. If you have any questions , please feel free to ask them later. If you want to have a deeper understanding of AEX Global, you are also welcome:Telegram group: https://t.me/AEX2013Vietnam or  https://t.me/AEX2013ENTwitter: https://twitter.com/AexglobalMedium:  https://aexplus.medium.com/Promo 6. Listing Desk: TomoChain(TOMO), Share 82,200 TOMO For FreeNormal users who participate in AEX Listing Desk can get token airdrop rewards.Duration: 20/4/2022 07:00 – 21/4/2022 07:00 (UTC)Benefits of Listing Desk:- No KYC required- Free to receive TOMO- No need to lock tokenListing Desk Link: https://www.aex.com/page/listing_desk.html#/Q: We’re all very excited for the $TOMO listing on AEX. Could you let us know what trading and investment options you have at AEX, especially for TOMO?A: As I said just now,  everyone can deposit, trade, and provide liquidity to earn TOMO on ASwap. Additionally, users who participate in AEX Listing Desk can get token airdrop rewards.Requirements for Listing Desk participants:– The participant should register on AEX and Log in; (If you do not have an AEX account yet, register here: https://www.aex.com/page/h5/m_regist.html#/newByInvite?from=qacaa3：– Deposit a certain amount of cryptocurrencies in your AEX account;– Sign the Service Agreement on AEX before placing orders.Participating in the above activities will have corresponding rewards waiting for everyone to get.Q: I just heard you mention that listing desk is a novel word. Can you introduce it to us in detail?A: The launch of Listing Desk is a very important product in the process of national strategy. The core function is: AEX cooperation project provides token airdrop to users.Listing Desk is relatively similar to a traditional IEO project. IEO means that the projects issue tokens through the exchange and the user participates in the subscription with the token of the exchange or certain crypto assets. In other words, users' crypto assets allow them to exchange them for the new tokens issued by the projects.Listing Desk is an innovative subscription model for crypto assets developed by AEX that supports the issuance (sale) or airdrop of tokens. Unlike IEO with the character of sale, AEX users receive free tokens in most cases with Listing Desk. If users own USDT, they can claim the tokens without locking them or consuming crypto assets, which is safer and more convenient. Important note: Listing Desk is a form of airdrop. When signing up, the account must have certain assets (e.g. usdt), but after signing up, the user's original USDT still belongs to him, but an additional crypto asset is added to the account.The design principle of Listing Desk is to be of use to multiple crypto participants. The project can reach more than 100 communities through AEX; users can receive airdrop; the AEX exchange plays the role of a bridge between potential projects and users. This allows AEX users to participate in new investment opportunities at zero cost.Q: In that case, security is the most important for us users. Can AEX provide access for assets conveniently in our country? And is it safe?A: As I mentioned earlier, AEX has proven itself in 9 years of practice in terms of technical security and caution in the selection of cryptos.AEX has been providing crypto services to various market segments in a compliant manner since mid-2021. AEX has licences in Canada, the United States, Singapore, and the United Kingdom, among others, which allow us to conduct foreign exchange transactions, principal payments, crypto trading, and other operations in many regions of the world.The AEX platform has supported more than 22 fiat currencies. Users in Europe, Asia, North America, and Oceania can safely and easily exchange fiat currencies in AEX. With VND, you can buy BTC, ETH, LTC, usdt, bus, usdc and other crypto assets directly from AEX to participate in a broader field of cryptocurrencies, such as crypto trading, financial management, defi-mining, etc.Considering that users come from different countries and are used to different ways of payment, AEX also provides various payment methods, such as visa, MasterCard, Apple pay, Google pay, bank transfer, etc. In the future, AEX will more actively provide compliant financial services for crypto assets and protection for our users worldwide.Q: Our team is really glad that you found us and reached out to us for the listing. But how did you find TOMO in the first place? And what are your criteria for listing a token?A: AEX has been concentrated on TomoChain, so we know that TomoChain has been running stably for a long time and keeps innovating.On the one hand,  AEX has committed $100 million to help build the ecosystem in the Vietnamese market.On the other hand, TomoChain is also very familiar with the Vietnamese market. Therefore, we hope that we can reach a long-term cooperative relationship with you.About listing criteria, various aspects will be examined, for example,  innovation, stablablity, future development planning. TomoChain meets About  TomoChainTomoChain is a scalable blockchain powered by proof-of-stake and used commercially by companies worldwide. TomoChain's mission is to accelerate the onboarding of millions of users by powering today's applications using technology that masks blockchain friction, while retaining its potential benefits. Website| Whitepapers | Telegram | Twitter | Facebook |About AEXFounded in 2013, AEX operated by Bit World Investments Limited has become one of the earliest digital asset exchanges. As an important link to blockchain, AEX has always played an indispensably important role in token circulation and trading. With the market growing in size and various cryptocurrency derivatives springing up in recent years, AEX has gradually evolved its positioning from the original transaction matchmaker towards a global digital asset management service provider that advocates safe investment and stable asset appreciation.Website| Medium| CMC| Twitter| YouTube| Coingecko| Facebook| Reddit| If you have any token listing issues or business cooperation, please email: Business@ogmail.aex.com",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5398993",
  "comments": [
    {
      "author": "RussianEnglishTranslation",
      "created_time": "May 17, 2022, 12:28:53 PM",
      "body": "Tomochain lost market share after they announced an ERC20 token bridge but then only bridged a handful of tokens. You can't do that and expect to be competitive against other open sidechains like gnosis, polygon, and fantom.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "RussianEnglishTranslation",
      "created_time": "May 17, 2022, 12:30:54 PM",
      "body": "Quote from: RussianEnglishTranslation on May 17, 2022, 12:28:53 PMTomochain lost market share after they announced an ERC20 token bridge but then only bridged a handful of tokens. You can't do that and expect to be competitive against other open sidechains like gnosis, polygon, and fantom.ICP is preparing to integrate Ethereum and other chains fully, so in that case, there shouldn't be any gatekeeping. This is a lesson that all other blockchains should learn from. Tomochain isn't the only chain that failed due to this fact, secret and tron did the same thing as tomochain and we hardly hear about them anymore because of it. Poor management and greed can ruin a good project fast.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}