{
  "id": "topic_5458628",
  "title": "FantasticPangolin705",
  "author": "FantasticPangolin705",
  "created_time": "July 04, 2023, 09:35:31 PM",
  "content": "Heja.Jestem nowy w świecie bitcoina i stąd mam kilka kwestii do rozważenia.Chciałbym się nauczyć tradingu, ale zrobić to b. małymi kroczkami. Chodzi o naukę, poczucie całego flow i sprawdzenie jak to działa.Jeżeli 1 USD to w tym momencie 0.00003247, to moje proste pytanie - czy jest możliwy taki micro trading za taką kwotę na którymś z portali?myślę o sytuacji w której nie ryzykuję całego portfela (czyli wszystkie 3247 satoshi), ale np. zaczynam wprowadzać podstawy zarządzania kapitałem. Czyli np. gram za 5% portfela.Głównie mi chodzi o prowizje. Znacie jakiś portal czy to jest możliwe?Oczywiście chodzi mi o trading krypto walutami.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5458628",
  "comments": [
    {
      "author": "Tytanowy Janusz",
      "created_time": "July 05, 2023, 06:44:44 AM",
      "body": "Bardzo dobre podejście. Statystyki są nieubłagane. Na początku 90% traci, więc nowy powinien się skupić na tym, aby stracić jak najmniej (najniższe koszty nauki), a mikrostawki na pewno w tym pomogą. Uważaj tylko, bo możesz handlować przez rok, zrobić piękne zyski z tego dolara, włączy ci się efekt boga, wpakujesz grubą kasę i wszystko stracisz, bo okaże się, że handlowałeś na lokalnej hossie, rynek się odwrócił, a twoje strategie przestały działać. Lub emocje związane z większym kapitałem zaburzą twoją ocenę sytuacji.Jeśli chodzi o giełdy, które akceptują takie mikrostawki i które mogę polecić, bo są sprawdzone w boju, posiadają nie najgorszą płynność i reputację, to jest Kucoin.https://www.kucoin.com/news/en-adjustment-of-minimum-spot-and-margin-trading-amountsMinimalna transakcja wynosi 0.1 USDT lub 0.000001 BTC. Tylko pytanie, czy później będziesz mógł wypłacić tego dolara, ponieważ w przypadku bitcoina \"Minimum Withdrawal 0.0005 BTC\" (15$), a tethera \"Minimum Withdrawal 1.00 USDT\".",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FantasticPangolin705",
      "created_time": "July 06, 2023, 08:35:49 PM",
      "body": "Dziękuję bardzo za odpowiedź. Szukałem dokładnie czegoś takiego. Stronę na pewno sprawdzę, ale najpierw chcę uzbierać kapitał żeby sign up bonus ewentualnie wypełnić.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "wwzsocki",
      "created_time": "July 07, 2023, 06:14:06 AM",
      "body": "Quote from: FantasticPangolin705 on July 06, 2023, 08:35:49 PM...najpierw chcę uzbierać kapitał żeby sign up bonus ewentualnie wypełnić.radze się pospieszyć jak chcesz korzystac bez KYCQuoteStarting from July 15, 2023 (UTC), newly registered users must complete their KYC in order to use KuCoin's products and services.For users who registered before July 15, 2023 (UTC), if their KYC is not completed, they will only be able to use services such as Spot trading sell orders, Futures trading deleveraging, Margin trading deleveraging, KuCoin Earn redemption, ETF redemption, and will not be able to use the deposit service (withdrawals are not impacted).https://www.kucoin.com/announcement/enhancement-of-kucoin-customer-identification-and-verification-programjuz niedługo nie bedzie mozliwosci handlu nawet samym krypto na giełdach bez KYCpozostaja portfele takie jak Trust czy Metamask, ale opłaty są w nich zabójcze, jedynie kupując/sprzedając większe ilości, może się to jakoś kalkulować",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Tytanowy Janusz",
      "created_time": "July 07, 2023, 07:14:18 AM",
      "body": "Quote from: wwzsocki on July 07, 2023, 06:14:06 AMradze się pospieszyć jak chcesz korzystac bez KYCQuoteStarting from July 15, 2023 (UTC), newly registered users must complete their KYC in order to use KuCoin's products and services.For users who registered before July 15, 2023 (UTC), if their KYC is not completed, they will only be able to use services such as Spot trading sell orders, Futures trading deleveraging, Margin trading deleveraging, KuCoin Earn redemption, ETF redemption, and will not be able to use the deposit service (withdrawals are not impacted).O kurcze. Czyli kucoin też przepada. W takim razie bez KYC, z w miare dobrą płynnością, zostaje huobi, ale tam minimalna stawka to 5$. @OP Może lepiej zwiększyć kapitał do 50-100$ albo skorzystać z jakiś kont demo. Jak nie masz takiego kapitału to zawsze można dorobić. Rynek krypto jest pełen pracy, od tłumaczy, poprzez moderatorów do programistów (a widziałem, że masz doświadczenie z pythonem).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FantasticPangolin705",
      "created_time": "July 07, 2023, 12:55:16 PMLast edit: July 07, 2023, 08:03:36 PM by FantasticPangolin705",
      "body": "Quote from: wwzsocki on July 07, 2023, 06:14:06 AMQuote from: FantasticPangolin705 on July 06, 2023, 08:35:49 PM...najpierw chcę uzbierać kapitał żeby sign up bonus ewentualnie wypełnić.radze się pospieszyć jak chcesz korzystac bez KYCQuoteStarting from July 15, 2023 (UTC), newly registered users must complete their KYC in order to use KuCoin's products and services.For users who registered before July 15, 2023 (UTC), if their KYC is not completed, they will only be able to use services such as Spot trading sell orders, Futures trading deleveraging, Margin trading deleveraging, KuCoin Earn redemption, ETF redemption, and will not be able to use the deposit service (withdrawals are not impacted).https://www.kucoin.com/announcement/enhancement-of-kucoin-customer-identification-and-verification-programjuz niedługo nie bedzie mozliwosci handlu nawet samym krypto na giełdach bez KYCpozostaja portfele takie jak Trust czy Metamask, ale opłaty są w nich zabójcze, jedynie kupując/sprzedając większe ilości, może się to jakoś kalkulować  Dziękuję za tego newsa. W takim wypadku - kojarzycie czy na KuCoin jest jakiś signup bonus? Mam takie założenie, że jak zakładam konto na jakimś nowym portalu, to chcę wypełnić signup - tak żeby dostać premię i kumulować kapitał.W tym momencie znalazłem coś takiego: https://www.kucoin.com/land/KuRewards - ale zastanawiam się czy nie ma czegoś lepszego?Rzeczywiście będę \"uderzał\" w KuCoin przed KYC, ale tak z głową, żeby te signupy zebrać.Mało czasu zostało. Trzeba działać.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "wwzsocki",
      "created_time": "July 08, 2023, 07:33:38 PMLast edit: July 09, 2023, 06:11:18 PM by wwzsocki",
      "body": "Quote from: Tytanowy Janusz on July 07, 2023, 07:14:18 AM...bez KYC, z w miare dobrą płynnością, zostaje huobi, ale tam minimalna stawka to 5$...Jest jeszcze Poloniex z takich bardziej znanych do których mozna miec jakies marginalne zaufanieale tak jak piszesz z płynnoscia kiepsko na mniej znanych kryptowalutachQuote from: FantasticPangolin705 on July 07, 2023, 12:55:16 PM...Mało czasu zostało. Trzeba działać. zaczynasz przygodę z krypto dość późno, ale lepiej późno niż wcale mam nadzieję, że znajdziesz jeszcze coś dla siebieEDITdostałem maila od Bittrex:\"Bittrex Global... We’re excited to announce that, as of 1 July, we are offering zero-fee trading on 5 key markets. That’s right. Zero. You can now trade BTC, ETH, DOGE, ADA and XRP with USDT and pay zero in fees.\"moze bedzie to dla Ciebie intersujące, zero fee na tych parach...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FantasticPangolin705",
      "created_time": "July 09, 2023, 08:02:44 PM",
      "body": "Ok, dzięki za wskazówkę dotyczącą Bittrex. Będę to miał na uwadze, ale tu też jest KYC.Więc kwestia taka, że na dzień dzisiejszy z Kucoin nie da się realnie skorzystać bez KYC (wpłata/wypłata FIAT). Tak was tylko informuję co odkryłem.Z moich pierwszych analiz wynika, że wszędzie gdzie pojawia sią realna waluta (FIAT) tam KYC jest wymagane. A jak jest już handel na bazie >samego crypto< to KYC nie ma prawie nigdy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "wwzsocki",
      "created_time": "July 09, 2023, 08:46:46 PM",
      "body": "Quote from: FantasticPangolin705 on July 09, 2023, 08:02:44 PMOk, dzięki za wskazówkę dotyczącą Bittrex. Będę to miał na uwadze, ale tu też jest KYC...moze być nie korzystałem z Bittrex od dawnapo zalogowaniu przed chwilką, okazało sie, ze muszę przejść KYCzakładałem konto wieki temu, miałem nadzieję, że nadal można handlować samym krypto bez weryfikacjiQuote from: FantasticPangolin705 on July 09, 2023, 08:02:44 PM...Z moich pierwszych analiz wynika, że wszędzie gdzie pojawia sią realna waluta (FIAT) tam KYC jest wymagane. A jak jest już handel na bazie >samego crypto< to KYC nie ma prawie nigdy.zgadza sie, dla tego myslałem ze na Bitrex tez bedzie moznaniestety wszystkie większe giełdy (CEX) powoli wymagaja KYC, nawet jeżeli handlujesz samym parami krypto, nie dotykasz FIATszkoda z dnia na dzień jest coraz mniej miejsc, na szczęście są DEXy, zawsze to jakaś alternatywa (bardzo wysokie opłaty)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Tytanowy Janusz",
      "created_time": "July 10, 2023, 06:20:25 AM",
      "body": "Quote from: FantasticPangolin705 on July 09, 2023, 08:02:44 PMZ moich pierwszych analiz wynika, że wszędzie gdzie pojawia sią realna waluta (FIAT) tam KYC jest wymagane. A jak jest już handel na bazie >samego crypto< to KYC nie ma prawie nigdy.Dlatego kupujesz pierwsze krypto P2P (dogadując się z kimś, kto już ma i chce sprzedać), albo przy pomocy bitomatów/kantorów. W Polsce w bitomatach jest limit 1000 euro na transakcję poniżej którego można obejść się bez KYC. Czyli możesz stać pod bitomatem i za godzinkę mieć zainwestowane 15 000 euro (limit dzienny). Jak to za mało, to jutro powtarzasz akcję. Jak masz już krypto to przelewasz na CEX bez KYC, bo nie ruszasz fiatów i możesz handlować na parach krypto/stablecoiny - stablecoiny to kryptowaluty, których cena jest sztywno przywiązana do czegoś. Np. do dolara (USDT, TUSD, BUSD itp), złota (PAXG, XAUT), bitcoina(BTCB, WBTC). Wszystkie one twierdzą, że są zabezpieczone 1:1 aktywem natywnym (rezerwowym) przez co idealnie trzymają cenę przez lata umożliwiając handel bez KYC i bez zdarzenia podatkowego (zgodnie z polskimi przepisami zdarzenie podatkowe występuje przy wymianie krypto na fiaty lub krypto na dobro/usługę a nie przy wymianie krypto na krypto)Bittrex może i ma zero fee, ale trzeba też pamiętać o płynności. Moim zdaniem lepiej zapłacić na binance 0.07% fee i 0.1% slippage niż 0% fee i 1% slippage na bittrex",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "wwzsocki",
      "created_time": "July 12, 2023, 11:48:59 AM",
      "body": "Quote from: Tytanowy Janusz on July 10, 2023, 06:20:25 AMDlatego kupujesz pierwsze krypto P2P (dogadując się z kimś, kto już ma i chce sprzedać)...Daj znac @FantasticPangolin705 jeżeli potrzebujesz kupić P2P, chętnie pomogę (BTC, TRX, ETH, USDT, BUSD)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}