{
  "id": "topic_5448772",
  "title": "Godlovesyou",
  "author": "Godlovesyou",
  "created_time": "April 14, 2023, 05:03:31 AM",
  "content": "Many altcoins are dumping ground, after the project is launched people invest massively on it, they will carry out a burn and the burn will have no meaningful bulls and then àfter a while the project became dormant like one and only Africa project called \"wakanda\" I guess many are victims and aware of this falsehood and fake project.Please which altcoin is currently the hotcake with bright future ahead?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5448772",
  "comments": [
    {
      "author": "Mistah",
      "created_time": "April 14, 2023, 09:31:51 AM",
      "body": "For me its currently 3DPass",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "avikz",
      "created_time": "April 14, 2023, 12:33:30 PM",
      "body": "Quote from: Godlovesyou on April 14, 2023, 05:03:31 AMMany altcoins are dumping ground, after the project is launched people invest massively on it, they will carry out a burn and the burn will have no meaningful bulls and then àfter a while the project became dormant like one and only Africa project called \"wakanda\" I guess many are victims and aware of this falsehood and fake project.Please which altcoin is currently the hotcake with bright future ahead?I would say none! Don't try to find gold from muddy water. Nowadays even Chatgpt can create an altcoin for you and provide you with detailed guidance on how to launch that. Do you think they are worthwhile? In altcoin market, the creator of the altcoins are the benefited ones. Rest all loose money while waiting for a better future price. Let's not get into that path. Invest in Bitcoin and ETH, if you are really serious about your money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "goaldigger",
      "created_time": "April 14, 2023, 12:52:29 PM",
      "body": "Quote from: Godlovesyou on April 14, 2023, 05:03:31 AMMany altcoins are dumping ground, after the project is launched people invest massively on it, they will carry out a burn and the burn will have no meaningful bulls and then àfter a while the project became dormant like one and only Africa project called \"wakanda\" I guess many are victims and aware of this falsehood and fake project.Please which altcoin is currently the hotcake with bright future ahead?This is normal, especially those projects who rely too much with the hype and yet their project itself is not that good.If you are going to invest on a new project, make sure that you are ready for the risk and you know when to take profit because not all new projects are worth to buy. You can consider buying top altcoins instead especially now that there's a good pump for the altcoins market though be cautious as corrections are still possible to happen.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JayTrain",
      "created_time": "April 14, 2023, 08:02:03 PM",
      "body": "Certainly, when investing in altcoins, it's important to do your own research and due diligence to mitigate risks. It's also important to have a clear investment strategy and not invest more than you can afford to lose. As for which altcoin has a bright future, it's difficult to say for sure as the market is constantly changing and can be unpredictable. It's important to stay up to date on the latest news and developments in the industry and to make informed investment decisions based on your own research and risk tolerance.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yhiaali3",
      "created_time": "April 14, 2023, 08:11:56 PM",
      "body": "Stay away from altcoins, especially those with famous brands or games, as they will likely be spam.\"Wakanda\" reminds me of the name of the movie of the same name that became somewhat popular so I think scammers always try to exploit famous names.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "uneng",
      "created_time": "April 14, 2023, 08:19:34 PM",
      "body": "The hotcake has been always Bitcoin. Since you are complaining about being a victim of altcoins' scams and falling for false promises, I believe you should go through a safer route with your investments in cryptocurrency, and the safest route is Bitcoin, without any doubts.Otherwise, if you continue playing around with altcoins, in an attempt to be lucky guy to pick the right one that will boost your earnings in x100, x1000 overnight, it's certain you are going to continue falling for such scams over and over again!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptomaniac_xxx",
      "created_time": "April 14, 2023, 08:28:15 PM",
      "body": "Quote from: Godlovesyou on April 14, 2023, 05:03:31 AMMany altcoins are dumping ground, after the project is launched people invest massively on it, they will carry out a burn and the burn will have no meaningful bulls and then àfter a while the project became dormant like one and only Africa project called \"wakanda\" I guess many are victims and aware of this falsehood and fake project.Please which altcoin is currently the hotcake with bright future ahead?I think that is the cycle in Altcoin market, if you can go back to the ICO days, yeah that is the pattern, it then it replace with IEO/IDO and then the next hype like P2E, the whole staking game etc. And once the project has been launched and investors putting their money and majority of them profited big then they left and look for the next project to pump. As for the devs, some of them abandoned it completely without anything to offer after that initial hype. As for the next hotcake, it's hard to see, I think it will still be P2E and anything about gamers + blockchain technology.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jating",
      "created_time": "April 14, 2023, 08:32:06 PM",
      "body": "Quote from: uneng on April 14, 2023, 08:19:34 PMThe hotcake has been always Bitcoin. Since you are complaining about being a victim of altcoins' scams and falling for false promises, I believe you should go through a safer route with your investments in cryptocurrency, and the safest route is Bitcoin, without any doubts.Obviously it is the only one, as it is the prime mover in cryptocurrency and no one can dislodge it from the top. But assuming that we are in this board, the OP is looking for altcoin. Maybe he knows that risk as he put it, \"dumping ground\".Quote from: uneng on April 14, 2023, 08:19:34 PMOtherwise, if you continue playing around with altcoins, in an attempt to be lucky guy to pick the right one that will boost your earnings in x100, x1000 overnight, it's certain you are going to continue falling for such scams over and over again!Not saying that you are wrong, but I guess in altcoin market, you also need extreme luck to find that needle in the haystack. And some could have find that gem during the last bull run. Or has taken that risk, invest early on lets say Axie before it exploded and make huge gains, rinse and repeat. Now it's time for us to look for that kind of project that will give us that x100 or higher returns.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jackl87",
      "created_time": "April 14, 2023, 08:36:53 PM",
      "body": "Quote from: Godlovesyou on April 14, 2023, 05:03:31 AMMany altcoins are dumping ground, after the project is launched people invest massively on it, they will carry out a burn and the burn will have no meaningful bulls and then àfter a while the project became dormant like one and only Africa project called \"wakanda\" I guess many are victims and aware of this falsehood and fake project.Please which altcoin is currently the hotcake with bright future ahead?I also noticed recently that there were a lot of projects launching in the last few weeks and months that had quite a lot of hype and also a pretty big and successful seed and private sale but once they were launched the price and also the whole mood within the project went down slowly but surely. I don't really know why this happens that often because none of those projects that i observed that slowly died were useless meme-coins some of them were even pretty good in my opinion.I think that a big part of the problem is the mentality of the investors. It is all about a quick pump and dump for most people. If a project does not do a x2 or more right after listing then it is already a fail in the eyes of a lot of people, because they don't have patience anymore.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MAAManda",
      "created_time": "April 14, 2023, 08:42:48 PM",
      "body": "Quote from: Godlovesyou on April 14, 2023, 05:03:31 AMMany altcoins are dumping ground, after the project is launched people invest massively on it, they will carry out a burn and the burn will have no meaningful bulls and then àfter a while the project became dormant like one and only Africa project called \"wakanda\" I guess many are victims and aware of this falsehood and fake project.Not only \"Wakanda\", there are lots of altcoins that just rely on the hype out there that keeps being born every day. Instead of thinking of it as an investment, I prefer to call it a gamble, because usually the strength of degen tokens is just the hype, there are no other strengths other than that. My advice, you better look for trustworthy altcoins for at least they have real proven advantages, like L1 projects (Aptos, SUI and Oasis Network).Quote from: Godlovesyou on April 14, 2023, 05:03:31 AMPlease which altcoin is currently the hotcake with bright future ahead?I don't know which altcoins are hotcake right now, but, hey? did you forget that we will have a halving next year? isn't it better to invest and accumulate Bitcoin now?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PrivacyG",
      "created_time": "April 14, 2023, 09:34:12 PM",
      "body": "Ask that question and you know you are not ready to choose an investment yet.  Take your time to learn, do not put money in things you do not understand.Finding an Altcoin that is worth the investment is a VERY, VERY difficult and EXTREMELY risky job.  Even the best still fail to properly choose where to place their money and at this point?  It is more a bet than an investment !Most coins go away because no body is interested to invest in them and most of them are useful and failures.  Look at it like all those businesses that open up every day.  How many of them fail?  A lot!  How many of them get to billions of Market Cap and to levels like Amazon?  Very few!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TimeTeller",
      "created_time": "April 14, 2023, 09:38:09 PM",
      "body": "Quote from: PrivacyG on April 14, 2023, 09:34:12 PMAsk that question and you know you are not ready to choose an investment yet.  Take your time to learn, do not put money in things you do not understand.Finding an Altcoin that is worth the investment is a VERY, VERY difficult and EXTREMELY risky job.  Even the best still fail to properly choose where to place their money and at this point?  It is more a bet than an investment !Most coins go away because no body is interested to invest in them and most of them are useful and failures.  Look at it like all those businesses that open up every day.  How many of them fail?  A lot!  How many of them get to billions of Market Cap and to levels like Amazon?  Very few!In my opinion, it is not advisable to hear from the suggestions as you don't know their motives.Also, it is quite difficult to follow someone else's advise if you are not doing your own homework with respect to the project.It is always best to do your own digging so you will understand better its market potential. That's a lot of work but it may save your hard-earned money from crappy projects. Most alts, particularly new ones are only created for the devs' pockets, so make sure to do your own assessments.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blockman",
      "created_time": "April 14, 2023, 10:10:28 PM",
      "body": "Quote from: Godlovesyou on April 14, 2023, 05:03:31 AMMany altcoins are dumping ground, after the project is launched people invest massively on it, they will carry out a burn and the burn will have no meaningful bulls and then àfter a while the project became dormant like one and only Africa project called \"wakanda\" I guess many are victims and aware of this falsehood and fake project.That's normally happening and that's why investors should be wise in terms of going with projects that are newly launched. You'll never know the life span of these newly made projects.Quote from: Godlovesyou on April 14, 2023, 05:03:31 AMPlease which altcoin is currently the hotcake with bright future ahead?ETHBNBThese are the two that I can suggest for now but it all sums up on your opinion because there are too many of them in the market that you shall know about them if they're worth it or not.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "maydna",
      "created_time": "April 14, 2023, 10:34:18 PM",
      "body": "I do not dare to advise which coin will become popular among the many coins because it does not guarantee you will be profitable. I advise you to look for it yourself because it will depend on the results of each of our analysis.Perhaps, some people will say to buy new coins that are still cheap but that doesn't guarantee the coins can increase. Meanwhile, many of us suggest only investing in bitcoin because of the possibility of getting a large return. So you better do your own research to get the coins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coin-investor",
      "created_time": "April 14, 2023, 10:47:12 PM",
      "body": "Quote from: Godlovesyou on April 14, 2023, 05:03:31 AMMany altcoins are dumping ground, after the project is launched people invest massively on it, they will carry out a burn and the burn will have no meaningful bulls and then àfter a while the project became dormant like one and only Africa project called \"wakanda\" I guess many are victims and aware of this falsehood and fake project.I never heard of the project \"Wakanda\" but I assume it's inspired by the movie Black Panther, those who invest in this project are not aware of the Squid Game project inspired by the movie Squid Game. Projects that are based on movie hype are bound to fail, but still, many investors fail to realize this, there is one coin on the top that's inspired by movies or celebrities that are still around.Those who failed to learn from history are bound to repeat it, there are still a lot of people who failed to research which is why we still have these altcoins that thrive on hype and false marketing.I expect more coins to be a dump before the bull run.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sokani",
      "created_time": "April 14, 2023, 11:29:53 PM",
      "body": "Most of these tokens lack use-cases and they are created by project owners to enrich themselves and call channels. They will create a token and reach out to callers promote the token in their channels, the moment the token pumps to a particular price they will dumb it and go over to the next project. My advice is to stay away from pump and dump projects and always do due diligence before you invest your funds in any project.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Luffygroove",
      "created_time": "April 15, 2023, 03:22:13 AM",
      "body": "Okay, since you asked about the new altcoin project that probably has a bright future, I would say Biokript. Biokript is the first syariah-compliant hybrid exchange that combines the advantages of CEX and DEX and eliminates the inefficiencies of both exchanges. Shariah-compliant means they don't have trading features like futures trading or staking that actually violate Islamic finance practises. On the other hand, they execute 50/50 profit sharing for their investors and token holders, called the Mudarabah principle. It hasn't been launched because they have a commitment to actually release the product first (which is the exchange) before doing some fund-raising. They planned to do a presale and, right after that, a public listing on Uniswap and Pancakeswap (and, of course, on their own exchange). They just announced a partnership with another project called Melega Swap. I think Biokript is one of the rare new projects out there that decides to make their concept a real product first instead of just selling their concept alone. For me, it shows good intention, a pure heart, and seriousness, which is why I'm looking forward to the presale.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SquallLeonhart",
      "created_time": "April 16, 2023, 06:09:21 PM",
      "body": "Quote from: MAAManda on April 14, 2023, 08:42:48 PMQuote from: Godlovesyou on April 14, 2023, 05:03:31 AMMany altcoins are dumping ground, after the project is launched people invest massively on it, they will carry out a burn and the burn will have no meaningful bulls and then àfter a while the project became dormant like one and only Africa project called \"wakanda\" I guess many are victims and aware of this falsehood and fake project.Not only \"Wakanda\", there are lots of altcoins that just rely on the hype out there that keeps being born every day. Instead of thinking of it as an investment, I prefer to call it a gamble, because usually the strength of degen tokens is just the hype, there are no other strengths other than that. My advice, you better look for trustworthy altcoins for at least they have real proven advantages, like L1 projects (Aptos, SUI and Oasis Network).I mean shiba is literally that, it was created because the \"doge\" in the doge coin is a shiba if you look at what type of doge it is, it's a shiba dog and that is why it was created. There was hype around doge, so shiba creators said why not make one with the actual name instead of the fake name.In fact, it goes even one further away from that as well, there is one called \"floki\", which is the doge that Elon Musk owns which is a shiba dog, and named him floki after the vikings tv show character. Even that got in to top 200 for a while don't know if it is still there. Long story short there are a lot of people who do a lot of stuff and I am guessing that it should not really be interesting to see at the current moment. I hope it won't be anything like that anymore.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "adaseb",
      "created_time": "April 17, 2023, 03:52:45 AM",
      "body": "There are hundreds of not thousands of these dead projects. Basically as soon as there are no bids at 1 sat for the token or it’s delisted from every exchange you can say it’s good as dead.Not all dead projects were scams but they just weren’t marketed correctly. These days it’s all about the amount of money you put towards marketing your tokens to determine how it will perform in the future. Many projects just couldn’t afford the proper ads and just died off.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}