{
  "id": "topic_5397944",
  "title": "Li Zhou",
  "author": "Li Zhou",
  "created_time": "May 09, 2022, 08:40:37 PM",
  "content": "Come to Earn While Having Fun in PUGG Metaverse With Its Free-to-play and Easy-to-earn Mode! (Part 1)Throughout the history of blockchain, we can find some clear stages.In the beginning it was the stage of the Token, which is an asset without physical objects and essentially just a piece of code starting with 0x, so it is difficult for most people to truly believe that it is competent to be a kind of currency or asset.Next came the NFT, Non-fungible Token, which is an asset with a corresponding form in reality, and because it has a real form and is unique, non-tampering and inseparable as the blockchain, it is often minted as an art collection.The third one was the Game. After the combination of artworks and digital assets, only still JPEG images (such as BAYC, Bored Ape Yacht Club) could no longer make people satisfied with the development of applications and the expansion of industry groups. At this time, the Game was the only competent platform as it can carry a large number of GIFs and scenes providing more interactions. Then GameFi came into being after the integration and interpretation of the various elements and the underlying Finance in the game.Then the last one is Social. All games naturally include socializing, and any platform with high user stickiness must also have a very large proportion of its features related to socializing. Thus the development of blockchain no long focuses on the asset certificates and interaction function that a small number of people are interested in but has now turned to building a SocialFi platform based on \"humans\" ourselves with functions of an integration of DeFi, NFT and GameFi.Such a platform, furnished with richer open source creative content, is undoubtedly the ideal prototype of the metaverse ecosystem we can imagine. And this prototype is the PUGG that is about to be built successfully.Let’s talk about its DeFi and NFT functions first.One of the original intentions of PUGG in its GameFi design is to utilize proper financial mechanisms and game systems to empower players much more than traditional games and creates a truly unique and lasting ecosystem with free-to-play and easy-to-earn games.How to achieve that? The answer is through simple and efficient activity mining.The action that users obtain the corresponding CALIT token rewards in PUGG by means of illiquid mining (including but not limited to POW, POS) is called activity mining.In PUGG game, many cycles for mining are set in the working area. Players can generate electricity for the entire planet by riding cycles and get rich CALIT rewards.At the same time, tasks will be set up in different game parts. After completing these tasks, players can also get CALIT rewards according to their behaviour in tasks. CALIT, the platform token, is not only the basis for players to perform content production and DAO governance in the PUGG ecosystem, but also a real wealth itself. CALIT has been launched on the decentralized exchange “PancakeSwap”, and players can directly sell it there to get considerable profits.This is PUGG's way of earning while having fun -- earning while enjoying the 3D immersive metaverse game, which presumably neither traditional players nor DeFi players will refuse.In addition to cycling activity mining and doing tasks to get rewards, there are more ways to earn CALIT easily. For example, the invitation reward rule in PUGG: When you, as a player, invite a friend to join PUGG, he or she is your direct invitee. After this invitee invites another one of his or her friends to join, you will also have one indirect invitee. Then you can get additional rewards according to the staking mining output of both your direct and indirect invitees.These additional rewards will be delivered to your PUGG wallet account once your invitees produce through the activity mining.Therefore, if you don't have much time to play games, you can also get passive mining income according to the output of your invitees which are just like your employees mining for you. You can rest your hands and see the mining rewards, which will become a long-term and stable income, come to you like automatically. The more direct and indirect invitees you have, the more rewards you will get. More importantly, the amount of the rewards does not have an upper limit. Relying on the rich and attractive ecosystem of PUGG, coupled with your own good appeal, the rewards you can get would be beyond your imagination!In terms of NFT, you can learn more from our previous article “PUGG, a Metaverse Entry Platform Applying NFT Ingeniously”.In a word, PUGG skillfully applies NFT visualization and one-click on-chain transactions in the social bar scene so that players can get maximized economic benefits while having much unexpected fun in the NFT-related social activities and transactions such as wearing NFT on their game characters, visiting the NFT market on the chain with the like-minded friends they met in the bar and furnishing their home in the game with their favorite NFTs.To summarize, PUGG's DeFi and NFT ecosystem are working with the idea of “earning while having fun”. For both of their users, the earlier they enter PUGG, the sooner they can get considerable rewards -- DeFi players can enjoy the profits from the first mining while NFT enthusiasts can earlier own PUGG-related NFTs (whose price in the early stage are generally the floor price). As the entire PUGG ecosystem gradually get mature and complete, what the users own now, whether the CALIT or PUGG-related NFTs, will undoubtedly get much more valuable in the near future.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5397944",
  "comments": []
}