{
  "id": "topic_5461341",
  "title": "Grimmjar",
  "author": "Grimmjar",
  "created_time": "July 28, 2023, 06:06:59 PM",
  "content": "Hello everyoneI noticed the relativ low price for S19 hydro (non pro, XP).I realy like the possibility of \"remote colling\".One S19 would replace my 3 very old miners and double the hashrate.But how reliable are those units?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5461341",
  "comments": [
    {
      "author": "AconeAsic",
      "created_time": "September 13, 2023, 02:45:41 AMLast edit: January 07, 2025, 11:15:51 AM by AconeAsic",
      "body": "https://minerasic.com/products/antminer-s19-pro-hydro-191-th-s",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ZeusBtc.com",
      "created_time": "September 13, 2023, 08:00:33 AM",
      "body": "The S19 Hydro is more efficient than the air-cooled miner and has higher power consumption. The Hydro system must regularly monitor the cooling tanks and look for any leaks or leaks to prevent any potential technical failures. Additionally, it is crucial to place mining hardware near appropriate water sources and in well-ventilated areas. This will ensure optimal heat dissipation, efficient cooling, and a positive mining experience.ZEUS MINING is selling this miner.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "philipma1957",
      "created_time": "September 13, 2023, 07:11:08 PMLast edit: September 13, 2023, 07:21:18 PM by philipma1957",
      "body": "I found a single cooler on aliexpress which would be able to cool a single hydro miner.https://www.aliexpress.us/item/3256805477384177.html?it costs 550.00https://www.aliexpress.us/item/3256805789948986.html?here is a hydro unit this is the 184th model it is 2268 it burns 5428 wattshttps://www.zeusbtc.com/Asic-Miner/Asic-Miner-Details.asp?ID=3114zeus has The Antminer S19 XP Hyd 257TH. do not know the price.But it looks like the 257th zeus has would work with that cooler.you may need a higher voltage like 240volts not 208volts if you are using a 30 amp circuit.but that would be feasible to run in a garage and not too loud.Please note I am not endorsing anyone above do your own research.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mikeywith",
      "created_time": "September 14, 2023, 01:42:07 AM",
      "body": "Quote from: philipma1957 on September 13, 2023, 07:11:08 PMzeus has The Antminer S19 XP Hyd 257TH. do not know the price.I think OP is talking about the non-XP hydro 130-150th range, and he is correct, they are pretty cheap, I have them for 8.5$/th, roughly 0.3$ cheaper than the regular air-cooled S19, and 5$ cheaper than the pro, hydro cooling is not as simple as running air-cooler miner, the cooling efficiency is a lot better but it comes at an expensive cost to set up the right infrastructure, it seems like people are more interested in getting air-cooled miner and submerge them in liquid cooling or, stick to what they already know (air cooling).I think hydro cooling is better suited for larger operations where you have one huge setup that connects a dozen of them, and it becomes worth it, for smaller operations, I am not sure if it's worth it, to this point, I have not sold any hydro units.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "philipma1957",
      "created_time": "September 14, 2023, 01:48:31 AM",
      "body": "well i got burned by octominer with my order for a liquid cooler .I do not particularly feel like getting a cooler from aliexpress, but a 5500 watt 257th liquid cooled setup would be a good sell for my partners solar business.We may look into making a setup with one for a demo.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}