{
  "id": "topic_5445460",
  "title": "Alik Bahshi",
  "author": "Alik Bahshi",
  "created_time": "March 19, 2023, 05:33:54 AMLast edit: March 20, 2023, 08:17:38 AM by Alik Bahshi",
  "content": "Алик Бахши Россия вернулась к эпохе военного коммунизма       Русский фюрер в который раз нарушил Конституцию, объявив, что российские бизнесмены «добровольно» обязаны часть доходов отдать государству. Надо думать этот, можно сказать царский указ, найдёт единодушную поддержку народа, ибо соответствует его менталитету. Холопам противно благополучие соседа, у них нет желания достичь его, у них одно желание - разрушить это благополучие. В очередь суки, в очередь! Короче, в Россию вернулась эпоха военного коммунизма.   19.03.2023",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5445460",
  "comments": [
    {
      "author": "bonfire66",
      "created_time": "March 19, 2023, 11:22:35 AM",
      "body": "Не следует выдавать желаемое за действительное. ВЫ же не представитель крупного бизнеса. И не знаете, и не можете знать, как там все происходит на самом деле. И никто из посетителей данного раздела форума не может об этом точно наверняка знать. Ибо Ротенберги и Дерипаски тут не тусуются. Поэтому следует разделять ФАКТЫ и МНЕНИЯ о фактах, что не одно и то же. И еще важный момент: если СМИ говорят о какой-то ситуации, будь то \"доброваольная сдача доходов\" или \"взятие Киева за три дня\" - то это, на самом деле - НИЧЕГО не означает. Это может быть 100% вброс. А может быть 100% правда. Поэтому делать выводы на основе вбросов - это дурной тон,  не следует так поступать, коллега!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Alik Bahshi",
      "created_time": "March 19, 2023, 08:07:12 PMLast edit: March 20, 2023, 05:05:48 PM by Alik Bahshi",
      "body": "Quote from: bonfire66 on March 19, 2023, 11:22:35 AMНе следует выдавать желаемое за действительное. ВЫ же не представитель крупного бизнеса. И не знаете, и не можете знать, как там все происходит на самом деле. И никто из посетителей данного раздела форума не может об этом точно наверняка знать. Ибо Ротенберги и Дерипаски тут не тусуются. Поэтому следует разделять ФАКТЫ и МНЕНИЯ о фактах, что не одно и то же. И еще важный момент: если СМИ говорят о какой-то ситуации, будь то \"доброваольная сдача доходов\" или \"взятие Киева за три дня\" - то это, на самом деле - НИЧЕГО не означает. Это может быть 100% вброс. А может быть 100% правда. Поэтому делать выводы на основе вбросов - это дурной тон,  не следует так поступать, коллега! Как стоит мне поступать, решаю я!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cyop",
      "created_time": "March 20, 2023, 12:36:27 PM",
      "body": "Как-то странно что слова \"хуйло\" и \"коммунизм\" находятся в одном предложении. Питерская гопота, даже если ей вставить дополнительные каблуки в ботинки от этого не станет Лениным. Максимум на что способна бункерная моль это аквадискотека, это апогей её эволюции. Ленин хотя бы создал землю крестьянам и сказал Ленин это хорошо, на следующий день Ленин создал фабрики рабочим и сказал это хорошо, на третий день Ленин создал Украину и сказал это хорошо, за три дня Ленин насоздавал кучу ништяков, а путлер даже Киев за три дня взять не смог.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Alik Bahshi",
      "created_time": "March 24, 2023, 05:00:10 AM",
      "body": "Quote from: cyop on March 20, 2023, 12:36:27 PMКак-то странно что слова \"хуйло\" и \"коммунизм\" находятся в одном предложении. Питерская гопота, даже если ей вставить дополнительные каблуки в ботинки от этого не станет Лениным. Максимум на что способна бункерная моль это аквадискотека, это апогей её эволюции. Ленин хотя бы создал землю крестьянам и сказал Ленин это хорошо, на следующий день Ленин создал фабрики рабочим и сказал это хорошо, на третий день Ленин создал Украину и сказал это хорошо, за три дня Ленин насоздавал кучу ништяков, а путлер даже Киев за три дня взять не смог. Взять и создать - разные вещи.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}