{
  "id": "topic_5462501",
  "title": "EMCD",
  "author": "EMCD",
  "created_time": "August 08, 2023, 10:46:34 AM",
  "content": "",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5462501",
  "comments": [
    {
      "author": "balso",
      "created_time": "August 15, 2023, 05:04:34 PM",
      "body": "Do you trade USD$?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SmartGold01",
      "created_time": "August 17, 2023, 09:51:42 AM",
      "body": "No kyc nowadays are the easiest strategies to hold and attracts people's attention towards their platform since most users always curious about their identity (anonymity) and they always believed such trading platform are the most reliable since they are following they sequence of bitcoin decentralization so they wouldn't mind the kind of exchange or p2p system it should be but eagerly to trade and remains anonymous since their kyc details aren't revealed at the backend.However, do you planned to extend your service across other african countries that could fully support p2p and direct to bank transfer?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "August 17, 2023, 01:18:02 PM",
      "body": "According to what is mentioned here there is NO KYC, it is not for everyone and at all times, but rather during beat testing.I do not like to classify currencies as clean and dirty, but mining pools sell their currencies in the OTC market in large quantities and at prices different from the market price, will u provide the same price rate as OTC market or must it be at the same average price of Bitcoin?I could not follow the rest of the details because the site asked me to log in, but is this a cloud mining service?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EMCD",
      "created_time": "August 17, 2023, 01:31:20 PM",
      "body": "Quote from: hugeblack on August 17, 2023, 01:18:02 PMAccording to what is mentioned here there is NO KYC, it is not for everyone and at all times, but rather during beat testing.I do not like to classify currencies as clean and dirty, but mining pools sell their currencies in the OTC market in large quantities and at prices different from the market price, will u provide the same price rate as OTC market or must it be at the same average price of Bitcoin?I could not follow the rest of the details because the site asked me to log in, but is this a cloud mining service?Hello! There is no KYC during beta testing. The merchants make the prices, so you should expect a slighltly better rate than average price of BTC. No, we are not a cloud mining service. You should try our P2P platform, we have an ongoing Bug Bounty and a raffle with prizes in USDT.Thanks a lot for your questions!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EMCD",
      "created_time": "August 18, 2023, 12:25:19 PM",
      "body": "Hello! Today we present you with a great opportunity to help us improve our product and make some money in process! emcd. P2P BugBounty is in full swing. If you want to take part you can ask questions here or in our ENG chat https://t.me/emcdpool_engThank you!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "August 18, 2023, 12:51:25 PM",
      "body": "Quote from: EMCD on August 17, 2023, 01:31:20 PMThere is no KYC during beta testing. What do you mean by no KYC during beta testing, this does not seem accurate as identity verification restrictions are imposed according to the amount of funds withdrawn: - 0-2k: Your name, address, date of birth. - 2k - 10k: attach a copy of the passport with a selfie. - 10k-100k: Proof of residence address and source of income. - +100k: any additional data.Therefore, saying that you will not require verification of identity during a certain period may lead you to legal problems, is your company registered? Where and what is the registration number?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dkbit98",
      "created_time": "August 18, 2023, 03:31:39 PM",
      "body": "Quote from: EMCD on August 17, 2023, 01:31:20 PMThere is no KYC during beta testing. The merchants make the prices, so you should expect a slighltly better rate than average price of BTC. All-in-one platform and mixing everything together doesn't sound like a good idea to me.I guess there are no many offers for trading right now, so temporary no-kyc during beta test period doesn't mean much either.btw you should add link for google play store in first post, bith links are redirecting only to apple store.Quote from: EMCD on August 17, 2023, 01:31:20 PMNo, we are not a cloud mining service. You should try our P2P platform, we have an ongoing Bug Bounty and a raffle with prizes in USDT.I am sure you don't have real mining farms and ASIC devices, so can you name the mining pool you are affiliated with?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EMCD",
      "created_time": "August 18, 2023, 04:06:49 PMLast edit: August 21, 2023, 12:36:30 PM by EMCD",
      "body": "Quote from: dkbit98 on August 18, 2023, 03:31:39 PMQuote from: EMCD on August 17, 2023, 01:31:20 PMThere is no KYC during beta testing. The merchants make the prices, so you should expect a slighltly better rate than average price of BTC. All-in-one platform and mixing everything together doesn't sound like a good idea to me.I guess there are no many offers for trading right now, so temporary no-kyc during beta test period doesn't mean much either.btw you should add link for google play store in first post, bith links are redirecting only to apple store.Quote from: EMCD on August 17, 2023, 01:31:20 PMNo, we are not a cloud mining service. You should try our P2P platform, we have an ongoing Bug Bounty and a raffle with prizes in USDT.I am sure you don't have real mining farms and ASIC devices, so can you name the mining pool you are affiliated with?Hello! We have real mining farms and ASIC devices. We are affiliated with ourselves . emcd. is a mining pool first of all. We are in the top 10 of world mining pools, I hope that says something. We will update the post and add a link to Google Play. Thank you!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dkbit98",
      "created_time": "August 19, 2023, 09:27:12 PM",
      "body": "Quote from: EMCD on August 18, 2023, 04:06:49 PMWe have real mining farms and ASIC devices. We are affiliated with ourselves . Emcd. is a mining pool first of all. We are in the top 10 of world mining pools, I hope that says something. Yeah I see now you currently have around 2% of bitcoin hashrate, that gives it a bit more credibility so I decided to test your app.What I found is that you and your pool are probably based in Russia because all offers I can see in P2P tab are in RUB currency and only Russian banks are available in payment methods.This can be problematic for users in rest of the world... I also didn't see any option to trade with with cash (maybe I missed it).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EMCD",
      "created_time": "August 21, 2023, 02:21:42 PM",
      "body": "Quote from: dkbit98 on August 19, 2023, 09:27:12 PMQuote from: EMCD on August 18, 2023, 04:06:49 PMWe have real mining farms and ASIC devices. We are affiliated with ourselves . Emcd. is a mining pool first of all. We are in the top 10 of world mining pools, I hope that says something. Yeah I see now you currently have around 2% of bitcoin hashrate, that gives it a bit more credibility so I decided to test your app.What I found is that you and your pool are probably based in Russia because all offers I can see in P2P tab are in RUB currency and only Russian banks are available in payment methods.This can be problematic for users in rest of the world... I also didn't see any option to trade with with cash (maybe I missed it).A significant portion of our mining pool users are based in Russia. However, our user base also spans across 120 other countries.We've established our own P2P platform to provide our users with a more convenient way to cash out their mined assets. That's why the initial offers on our P2P platform are for exchanging into rubles.Nevertheless, we already offer 16 local currencies for trading, allowing users from different countries to list their offers on our platform.By the way, if you have suggestions for expanding trading in your region, we can connect you with our manager to discuss the details. We provide attractive conditions for our merchants, such as discounts on fees up to 90%, free currency conversion, and other beneficial offers. Let us know if you're interested in discussing collaboration details.Thank you very much for your interest in our project. We're excited to continue the dialogue with you. If you have any questions, please feel free to ask them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EMCD",
      "created_time": "August 22, 2023, 02:35:08 PM",
      "body": "Quote from: SmartGold01 on August 17, 2023, 09:51:42 AMNo kyc nowadays are the easiest strategies to hold and attracts people's attention towards their platform since most users always curious about their identity (anonymity) and they always believed such trading platform are the most reliable since they are following they sequence of bitcoin decentralization so they wouldn't mind the kind of exchange or p2p system it should be but eagerly to trade and remains anonymous since their kyc details aren't revealed at the backend.However, do you planned to extend your service across other african countries that could fully support p2p and direct to bank transfer?Hello! Yes, we definitely plan to expand our services. Our users are located in 120 countries around the world, and our goal is to establish operations wherever possible. In the near future, we will be extending our presence in global markets. If you have ideas or proposals for collaboration, or if you are interested in becoming a merchant in your region and working with local currency, please let us know. Our manager will get in touch with you for a more detailed discussion of potential collaboration.Thank you for your questions! We are always happy to answer them",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dkbit98",
      "created_time": "August 22, 2023, 07:35:25 PM",
      "body": "Quote from: EMCD on August 21, 2023, 02:21:42 PMBy the way, if you have suggestions for expanding trading in your region, we can connect you with our manager to discuss the details. We provide attractive conditions for our merchants, such as discounts on fees up to 90%, free currency conversion, and other beneficial offers. Let us know if you're interested in discussing collaboration details.Maybe if your P2P trading service was permanently without KYC verification, but this is not the case, since you have this option only during beta testing phase.I also don't know what happens in case of some dispute between participants and how this issues can be resolved.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EMCD",
      "created_time": "August 23, 2023, 03:52:27 PM",
      "body": "Quote from: dkbit98 on August 22, 2023, 07:35:25 PMQuote from: EMCD on August 21, 2023, 02:21:42 PMBy the way, if you have suggestions for expanding trading in your region, we can connect you with our manager to discuss the details. We provide attractive conditions for our merchants, such as discounts on fees up to 90%, free currency conversion, and other beneficial offers. Let us know if you're interested in discussing collaboration details.Maybe if your P2P trading service was permanently without KYC verification, but this is not the case, since you have this option only during beta testing phase.I also don't know what happens in case of some dispute between participants and how this issues can be resolved.Hello! Funds are frozen within the system until the transaction is fully completed. If you encounter issues with the received amount, you can always open a dispute, and our support team (works 24/7) will resolve it in minimal time. So - no worries.We will see whether or not KYC will be introduced after the Beta testing. Thank you for the interest in our product!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EMCD",
      "created_time": "September 05, 2023, 12:30:00 PM",
      "body": "Good day to you! We thank you bracing with us! The results of emcd. P2P Airdrop will be availible tommorow. Thank you for you attention.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EMCD",
      "created_time": "September 07, 2023, 03:49:53 PM",
      "body": "Hello!We congratulate the lucky winners of P2P AirDrop!More info can be found in our telegram-channel.Thank you for participating.Yours, emcd.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "goroggt123",
      "created_time": "September 09, 2023, 02:54:23 PM",
      "body": "Quote from: EMCD on August 08, 2023, 10:46:34 AMhttps://i.postimg.cc/cLQtRcD0/1.pnghttp://dl3.joxi.net/drive/2023/08/06/0026/2792/1759976/76/ab9fdd7480.jpghttps://i.postimg.cc/BnW1PzBm/3.pnghttps://i.postimg.cc/hj4mP71g/4.pnghttps://i.postimg.cc/qqS6LDVM/5.pnghttps://i.postimg.cc/YqTQf0Mf/6.pnghttps://i.postimg.cc/VL0C6wnS/7.pnghttp://dl3.joxi.net/drive/2023/08/06/0026/2792/1759976/76/ab9fdd7480.jpghttps://i.postimg.cc/T24bf1LM/9.pnghttps://i.postimg.cc/vms9kK14/10.pnghttps://i.postimg.cc/76B2CYKz/11.pnghttps://i.postimg.cc/pXmDFzbL/12.pnghttps://i.postimg.cc/ryn1sgHH/13.pngCan I order a trade consultation from you?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EMCD",
      "created_time": "September 11, 2023, 11:18:26 AM",
      "body": "Hello and good week to you!Of course, you can. In our telegram chat, for example. I want to let you know that the results of our Bug Bounty will be availible this Wednesday.If you participated - please make sure to visit our telegram channel.Thank you for your attention.Quote from: goroggt123 link=topic=5462501.msg62819711#msg62819711 date=169427126Can I order a trade consultation from you?[/quote",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EMCD",
      "created_time": "September 17, 2023, 11:05:22 PM",
      "body": "Hello friends! Happy beginning of the week to you! How are you doing today? There are some interesting news on our channel! Come, take a look and leave a reaction. We want to hear your feedback! Yours, emcd.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}