{
  "id": "topic_5474100",
  "title": "tech30338",
  "author": "tech30338",
  "created_time": "November 15, 2023, 12:45:57 AM",
  "content": "Pamilyar ba kayo sa exchange na poloniex? Bago ako magstart ng crypto coinsph una kong nagamit , in then nakilala ko ang poloniex dahil pinatignan sa akin ng kaibigan ko, wayback 2016 pa kung hindi ako ngkakamali sa date.At nitong lang nakaraan araw nabalita nga na nahack ang poloniex mahigit nga na 100M$ ang nawala sa kanila, kung hindi siguro nila ito naagapan maaring nalimas lahat ang laman ng exchange na ito.For years first time ko na nadinig na nahack ang poloniex ibig sabihin lang talaga evolving at mas lalo lumalakas ang hacking, kaya wala na halos safe, for this years nakita natin ang mga breach from government ,private at ang companies like itong boeing na kung saan system data naman ang nakuha,Nagannounce naman ang management na nafroze na ang funds at naibalik nadin ang service nila at maayos, si justin naman ay nagsabi na marereinburse ang mga nawala, meron pako ditong coins pero maliit naman ang value pero sayang din if mawawalaMas lalong tumitindi ang hacking lalo na tumataas ang presyo mas lalo silang nagging aggresive.anung masasabi ninyo sa sunod sunod na hacking na ito, at may natala naba na hacking dati sa poloniex? ang mga sumusunod ay article tungkol sa nangyare at aksiyon ng exchange:https://support.poloniex.com/hc/en-us/articles/18976674677911-Announcement-on-Poloniex-Hack-Incidenthttps://www.scmagazine.com/brief/poloniex-loses-over-100m-in-crypto-heisthttps://www.fxstreet.com/cryptocurrencies/news/crypto-exchange-poloniex-hack-leads-to-60-million-in-assets-stolen-peckshield-says-202311101206",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5474100",
  "comments": [
    {
      "author": "kingvirtus09",
      "created_time": "November 15, 2023, 01:45:52 AM",
      "body": "Quote from: tech30338 on November 15, 2023, 12:45:57 AMPamilyar ba kayo sa exchange na poloniex? Bago ako magstart ng crypto coinsph una kong nagamit , in then nakilala ko ang poloniex dahil pinatignan sa akin ng kaibigan ko, wayback 2016 pa kung hindi ako ngkakamali sa date.At nitong lang nakaraan araw nabalita nga na nahack ang poloniex mahigit nga na 100M$ ang nawala sa kanila, kung hindi siguro nila ito naagapan maaring nalimas lahat ang laman ng exchange na ito.For years first time ko na nadinig na nahack ang poloniex ibig sabihin lang talaga evolving at mas lalo lumalakas ang hacking, kaya wala na halos safe, for this years nakita natin ang mga breach from government ,private at ang companies like itong boeing na kung saan system data naman ang nakuha,Nagannounce naman ang management na nafroze na ang funds at naibalik nadin ang service nila at maayos, si justin naman ay nagsabi na marereinburse ang mga nawala, meron pako ditong coins pero maliit naman ang value pero sayang din if mawawalaMas lalong tumitindi ang hacking lalo na tumataas ang presyo mas lalo silang nagging aggresive.anung masasabi ninyo sa sunod sunod na hacking na ito, at may natala naba na hacking dati sa poloniex? ang mga sumusunod ay article tungkol sa nangyare at aksiyon ng exchange:https://support.poloniex.com/hc/en-us/articles/18976674677911-Announcement-on-Poloniex-Hack-Incidenthttps://www.scmagazine.com/brief/poloniex-loses-over-100m-in-crypto-heisthttps://www.fxstreet.com/cryptocurrencies/news/crypto-exchange-poloniex-hack-leads-to-60-million-in-assets-stolen-peckshield-says-202311101206Oo, pamilyar ako dyan at ginamit ko rin yan before way back 2017, kaya nagkaroon ito ng problema before. Tapos kamakailan lang nung mabalitaan ko na existing parin siya. Ngayon, ko lang din naman nalaman eto na naman at merong isyung kinakaharap ang poloniex. Ito talaga ang mahirap kapag centralized exchage ang gamit, walang kalaban-laban ang mga users na mailabas ang kanilang sariling  funds sa platform, kagaya nyan nafroze hindi natin alam kung mababawi paba ng users ang kanilang pondo, matagal na yang Poloniex pero hanggang ngayon parang hindi parin nila inaayos ng husto ang security ng ng kanilang platform.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DabsPoorVersion",
      "created_time": "November 15, 2023, 03:22:07 AM",
      "body": "Quote from: tech30338 on November 15, 2023, 12:45:57 AMPamilyar ba kayo sa exchange na poloniex? Yes, isa din to sa mga nagamit ko noon. Sobrang tagal na nitong exchange na to. May mga gumagamit pa din naman nito pero karamihan talaga ay nagsi-lipatan na sa mas bago at mas malalaking exchange. Maganda din tong exchange na to noon, may mga issue lang talaga na di maiiwasan gaya nitong hacking.Nabasa ko pala ito sa link, Malaking loss ito para sa kanila, lalo na ang laking pera ng nawala. Pero mabuti nalang at ibabalik nila ang mga nawalang pera at hindi tatakbuhan ang mga users. Quote Regarding the Poloniex hack incident, we hereby promise to each Poloniex user that Poloniex maintains a healthy financial position and will fully reimburse the affected funds.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitterguy28",
      "created_time": "November 15, 2023, 08:19:57 AM",
      "body": "Quote from: DabsPoorVersion on November 15, 2023, 03:22:07 AMQuote from: tech30338 on November 15, 2023, 12:45:57 AMPamilyar ba kayo sa exchange na poloniex? Yes, isa din to sa mga nagamit ko noon. Sobrang tagal na nitong exchange na to. May mga gumagamit pa din naman nito pero karamihan talaga ay nagsi-lipatan na sa mas bago at mas malalaking exchange. Maganda din tong exchange na to noon, may mga issue lang talaga na di maiiwasan gaya nitong hacking.Nabasa ko pala ito sa link, Malaking loss ito para sa kanila, lalo na ang laking pera ng nawala. Pero mabuti nalang at ibabalik nila ang mga nawalang pera at hindi tatakbuhan ang mga users. Quote Regarding the Poloniex hack incident, we hereby promise to each Poloniex user that Poloniex maintains a healthy financial position and will fully reimburse the affected funds. halos lahat naman yata tayong mga pinoy dumaan sa poloniex dahil aside from Coins.ph eh ito ang isa sa pinaka sikat noong mga panahon na yon , tulad ko na ginamit din to kaso sa taas ng Fee nito sa at laki ng minimum withdrawals eh naghanap ako ng iba pang exchange.now meron nnman pala silang pinagdaanan ehtingin ko wala naman na yata sa ating mga apektado nito kasi parang bihira nalang sa atin ang gumagamit pa din nito till now.but its good to hear that they promise to bring back all affected users money and if they do eh mapapatunayang totoo sila at dapat pa ding pagkatiwalaan.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "xLays",
      "created_time": "November 15, 2023, 11:49:18 AM",
      "body": "Oo 2018 yan ang ginagamit ko napakadaling gamitin yang exchange na yan katulad din ng iba nung lumabas na Binance nag switch na rin ako. Meron pa Bittrex, C-Cex at cryptopia lahat ng mga yan nagamit ko gawa ng dyan lang nalilist yung mga coins na sinalihan ko sa bounty. Ito lang ata ang hindi pa nahahack na exchange ngayon lang nahack never ko nabalitaan na nack tong poliniex. Hindi talaga advisable na maghold ng coins mo sa exchange katulad nyan hold yung withdrawal. Lalagay mo nalang talaga kapag bibili or ibebenta kana.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SFR10",
      "created_time": "November 15, 2023, 12:59:23 PM",
      "body": "Quote from: tech30338 on November 15, 2023, 12:45:57 AManung masasabi ninyo sa sunod sunod na hacking na ito, at may natala naba na hacking dati sa poloniex? Tulad ng sinabi ko dati, they're bound to happen at some point in the future [unfortunately]... Noong bago palang sila, nahack din sila [nawala ang 12.3% ng total Bitcoin supply nila].- Kung tama ang pagkakaalala ko, nagkaroon din ng data leak dati sa Poloniex.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "robelneo",
      "created_time": "November 15, 2023, 01:36:29 PM",
      "body": "Dalawang bese pa lang ako ng trade sa exchange na ito dahil sa altcoin nakuha ko dati sa bounty matagal na mejo may kataasan ang fee nila kaya iniwan ko at nag concentrate ako sa Binance at sa mga local exchanges.kumpara sa ibang exchanges sobrang baba ng Trustscore ngayun ng Poloniex kahit sabihin na under ito ni Justin Sun, hindi nakaya ng charisma ni Justin Sun na pataasin ang grade nila sa market.Mabuti na lang at nag guarantee si Justin para ma secure ang funds ng mga member nila, minsan hindi natin maiwasan na mag iwan ng funds sa Exchange pero kung mag iiwan tayo hindi dapat masyadong malaki at hindi dapat sa isang exchange na hindi mag guurantee kung sakali ma hack ang.Sa latest na news ay nag offer si Justin ng 5% bounty pero malabo ito dahil may balita na ang notorious na Lazarus Group from North Korea.QuoteAfter suspicious outflows of $114 million, cryptocurrency exchange Poloniex has confirmed that it has been hacked. Poloniex investor Justin Sun offered a 5% white hacker bounty. However, the adversary seems to be the notorious Lazarus Group from North Korea.https://cybernews.com/crypto/crypto-exchange-poloniex-hacked-offers-bounty/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Peanutswar",
      "created_time": "November 15, 2023, 02:13:42 PM",
      "body": "Actually, hindi ko sila naabutan or even nagamit pero currently parang nag rise nga ang era ng maraming concern regarding sa hacking or attacks into different crypto related projects even nga sa government ung nangyari sa atin nag leak ang data, siguro dapat nga talaga magkaroon ng seminar inside sa kanila regarding dito sa mga possible attacks ng mga ito, additional na din dito is yung pag kakaroon ng investment regarding sa security ng funds plus security access ng bawat isang related sa humahawak dito para na din maiwasan ang possible issues might rise like this again.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jeraldskie11",
      "created_time": "November 15, 2023, 02:21:20 PM",
      "body": "Quote from: bitterguy28 on November 15, 2023, 08:19:57 AM<snip>Isa din ako sa gumagamit ng Poloniex dahil sa napakagandang features nito, napakasmooth ng kanilang website at hindi masakit sa mata ang combination ng kulay ng kanilang exchange. Subalit di nagtagal maraming cases ng mga funds na hindi maiwithdraw o hindi makumpleto yung withdrawal at isa ako dun. Kaya simula noon hindi na ako gumamit ng kanilang exchange. Hindi rin ako nagulat sa balitang ito kasi possible talaga na may butas ang security ng kanilang exchange. Sana maibalik na sa lalong madaling panahon ang mga funds ng mga nahack.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LesterD",
      "created_time": "November 15, 2023, 02:34:48 PM",
      "body": "Hindi ko na ito naabutan, pero nababasa ko ito noon sa usapan ng mga kasama ko pati na din sa group na nasalihan ko sa fb. Hindi lang ito yung unang beses na nangyari yan. Ayaw din nila dahil sa mahal ang fee kaya mas pinipili nila na ibang page nalang ang gamitin. Dapat magupgrade sila ng security dahil hindi lang unang beses nangyari ito, baka masundan pa yan ulit makalipas ang ilang taon kung hindi nila gagawan ng aksyon.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Asuspawer09",
      "created_time": "November 15, 2023, 03:49:17 PM",
      "body": "Sobrang ganda ng poloniex dati naaalala ko din dati ito ang gamit ko talaga mainly noong nagstart pa lang ako sa trading, kaya medjo malaki ang nainvest ko sa account ko dito pero noong nahinto ako nakakaines talaga dahil hindi ko na narecover ang account ko dito kasama na yung investment ko dati i think nakapaglabas naman ako ng malaking percentage pero sa naaalala ko malaki pa ang naiwan ko sa account ko, pero i think nagkaroon sila ng email something about doon pero hindi ako active sa trading that time kaya hindi ko napansin ang mga terms kaya siguro nawala ang account ko. Nakakatakot na rin pumasok sa exchange na ito lalo na naglalabasan na ang mga ganitong cases ng hack hindi na ako magugulat kung bigla na lang mahack ang buong website nila tulad ng FTX, which is probably ay gawa gawa lang para madeclare nila na bankrupt ang kanilang website at malabas ang mga pera ng mga investors. Personally Binance na lang talaga ang ginagamit ko, pagdating sa mga centralized exchange, depende nalang siguro kung may service ako na kailangan sa ibang mga centralized platform kung saan kailangan ko padaanin ang transaction.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Johnyz",
      "created_time": "November 15, 2023, 09:26:38 PM",
      "body": "This is actually my main exchange before, pero simula nung nabago yung system nila at maagang nagimplement ay umalis na ako at buti nalang kase na hacked den sila before at ito naulit na ulit. Mukhang hinde safe ang kanilang exchange or may inside job talaga na nangyare dito, isa ito sa mga dahilan kaya bakit hinde maganda maghold ng kahit anong crypto sa mga exchanges kase kahit anong oras pwede ito mangyare sa kanila.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kotajikikox",
      "created_time": "November 16, 2023, 06:07:23 AM",
      "body": "Quote from: SFR10 on November 15, 2023, 12:59:23 PMQuote from: tech30338 on November 15, 2023, 12:45:57 AManung masasabi ninyo sa sunod sunod na hacking na ito, at may natala naba na hacking dati sa poloniex? Tulad ng sinabi ko dati, they're bound to happen at some point in the future [unfortunately]... Noong bago palang sila, nahack din sila [nawala ang 12.3% ng total Bitcoin supply nila].- Kung tama ang pagkakaalala ko, nagkaroon din ng data leak dati sa Poloniex.Kung tama ang pagkaka alala ko ay ito ang reason bakit ako tumigil gamitin ang poloniex dahil naging issue to noon at andaming natakot.at dahil sa mga ganitong pangyayari eh malamang talagang maubos na tuluyan ang mga users nila, kasi kung lageng ma compromized ang exchange eh ganon din ang mga gumagamit na hindi talaga safe .Quote from: Johnyz on November 15, 2023, 09:26:38 PMThis is actually my main exchange before, pero simula nung nabago yung system nila at maagang nagimplement ay umalis na ako at buti nalang kase na hacked den sila before at ito naulit na ulit. Mukhang hinde safe ang kanilang exchange or may inside job talaga na nangyare dito, isa ito sa mga dahilan kaya bakit hinde maganda maghold ng kahit anong crypto sa mga exchanges kase kahit anong oras pwede ito mangyare sa kanila.tama mabuting nagsipag alisan na tayo sa Poloniex lalo na now andami ng exchange na pwede gamitin at karamihan sa atin ay naka offline wallets na din kaya wala ng nag iimbak sa exchange ng pera not like before.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bhadz",
      "created_time": "November 16, 2023, 06:16:49 AM",
      "body": "Isa yan sa mga naunang exchanges na alam ko pero hindi ako naging user niyan, kung nag register man ako diyan, di rin ako nagtagal na ginamit yan kasi di ko na masyadong matandaan pero alam ko na isa yan sa mga og exchanges na naging sikat din dati.Quote from: Johnyz on November 15, 2023, 09:26:38 PMThis is actually my main exchange before, pero simula nung nabago yung system nila at maagang nagimplement ay umalis na ako at buti nalang kase na hacked den sila before at ito naulit na ulit. Mukhang hinde safe ang kanilang exchange or may inside job talaga na nangyare dito, isa ito sa mga dahilan kaya bakit hinde maganda maghold ng kahit anong crypto sa mga exchanges kase kahit anong oras pwede ito mangyare sa kanila.Mabuti nalang at umalis ka noong nagbago. Parang kasabayan din ito ng bittrex, shapeshift di ba? Tapos lahat sila nagkaroon ng changes parang halos sabay sabay kaya bumaba na din volume sa mga exchanges na yan. Tapos ngayong naacquire ito in Justin, parang wala pa rin namang pinagbago. Mayaman lang siya masyado kaya nabili niya ito.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Text",
      "created_time": "November 16, 2023, 10:01:36 AM",
      "body": "Narinig ko na rin yang Poloniex dati nung bago palang ako sa crypto, parehong taon tayo nagsimula rito OP. Pero hindi ko siya nasubukang gamitin dahil Coins.ph lang gamit ko noon at wala pa ako alam sa mga exchanges at trading, mag ipon lang ng satoshis at convert sa fiat gawain ko noon. Nung nag bounty naman ako, ibang exchanges naman nagamit ko tulad ng Bittrex at iba pa.Sunod-sunod na naman ang mga hacking news sa mga exchanges ah, naaakit na naman ang mga hackers at naaagaw ang atensiyon nila dahil sa bullish trend ng market nitong mga nakaraang araw.Malaking paalala ito paulit ulit na wag gawing wallet o imbakan ang mga exchanges ng mga crypto assets. Bago o matagal na, malaki o maliit ay wala ng pinalalamapas ang mga hackers, nagiging sophisticated na ang mga paraan nila habang tumatagal.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "angrybirdy",
      "created_time": "November 19, 2023, 11:21:23 AM",
      "body": "Narinig ko narin ang tungkol sa poloniex before pero hindi ko ito naabuta, mostly mga nauna sa crypto ay ito ang main exchange nila pero balita ko hindi lang ito ang unang beses na nagkaroon ng hacking incident sa kanila. Ang pagkaka alam ko may mga iilan padin ang nag stay at gumagamit nito pero masyado mataas ang transaction fee kaya ang iba ay lumipat nadin sa iba. Kung nagkaroon nanaman ulit ng hacking issue, I think mas mabuting maimbestigahan ito ng maigi and eye opener na din ito sa kanila para mas pagtuunan ng pansin ang security nila para hindi na maulit ang ganitong incident.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "goinmerry",
      "created_time": "November 19, 2023, 10:42:38 PM",
      "body": "Isa ito sa mga famous crypto exchanges nung nag start ako sa crypto kasabayan ng mauugong na exchanges noon like Bitfinex, Bitstamp, Coinbase (wallet pa lang nito that time at wala pang market trading), at iba pa. Naalala ko, nasangkot na rin ang exchange na yan sa hacking incident nung panahon ng kasikatan niya kaya mula noon di ko na ginamit ang exchange na yan dahil na rin naglipana na ang mas bagong exchange na umariba sa marketing.I think we can't blame the exchange itself sa nangyaring hack. It's just that while technology pagdating sa security is nag-iimprove, enhanced din ang methods ng mga hackers. Pero can't think of a way how these hackers can even breach the system without \"kapit sa loob\"? Anyway speculation ko lang naman.Pero dahil centralized exchange ang Poloniex, insured naman ang loss funds dito di ba? Sana makatulong iyong offer nilang bounty sa makakatrack ng hacker.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Reatim",
      "created_time": "November 21, 2023, 03:49:24 AM",
      "body": "Quote from: Johnyz on November 15, 2023, 09:26:38 PMThis is actually my main exchange before, pero simula nung nabago yung system nila at maagang nagimplement ay umalis na ako at buti nalang kase na hacked den sila before at ito naulit na ulit. Mukhang hinde safe ang kanilang exchange or may inside job talaga na nangyare dito, isa ito sa mga dahilan kaya bakit hinde maganda maghold ng kahit anong crypto sa mga exchanges kase kahit anong oras pwede ito mangyare sa kanila.Ilang beses na sila na hacked tingin ko nasira na ng tuluyan ang kanilang reputasyon , yong ma hack ka ng isang beses eh OK lang eh pero yong naulit pa? considering na isa sila sa pinaka matagal na Exchange sa crypto world?this proves only one thing na hindi nila ganon pinapahalagahan ang kanilang security at ang kanilang mga users.Isang beses lang ako sumubok gumamit ng Poloniex pero nadala agad ako sa sobrang taas ng Minimum withdrawal at ganon na din ang fee, from there never kona sila ginamit at denelete kona ang Apps nila sa Mobile ko.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}