{
  "id": "topic_5399629",
  "title": "cryptoaddictchie",
  "author": "cryptoaddictchie",
  "created_time": "May 21, 2022, 04:23:25 PMLast edit: May 22, 2022, 03:03:35 AM by cryptoaddictchie",
  "content": "Anyone wants some lovely pizza today? Happy bitcoin Pizza day guys. If Im not mistaken todays marked the day where one of the greatest transaction in history of bitcoin recorded.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5399629",
  "comments": [
    {
      "author": "SatoPrincess",
      "created_time": "May 21, 2022, 05:06:29 PM",
      "body": "Quote from: cryptoaddictchie on May 21, 2022, 04:23:25 PMAnyone wants some lovely pizza today? Happy bitcoin Pizza day guys. If Im not mistaken todays marked the day where one of the greatest transaction in history.You are a day too early, I believe bitcoin pizza day is tomorrow May 22. It’s nice to see this historic transaction has become a traditional event for those in the crypto space. I wonder if people around the world celebrating actually buy pizza with bitcoins that day. For me, the best to celebrate bitcoin pizza day is buying something physical with bitcoins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nakamura12",
      "created_time": "May 21, 2022, 05:28:23 PM",
      "body": "Quote from: SatoPrincess on May 21, 2022, 05:06:29 PMYou are a day too early, I believe bitcoin pizza day is tomorrow May 22. It’s nice to see this historic transaction has become a traditional event for those in the crypto space. I wonder if people around the world celebrating actually buy pizza with bitcoins that day. For me, the best to celebrate bitcoin pizza day is buying something physical with bitcoins. Maybe op's time is different and didn't use the Bitcointalk forum's time zone. In my country, it's already May 22 at dawn so I would also say that it is pizza day. It's been so long since I had eaten a pizza and I would like to eat one now . I wonder if there's a shop in my country where I can buy pizza with Bitcoin even though it's not the same as the OG. As if you are the one who bought pizza with that kind of amount of Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SatoPrincess",
      "created_time": "May 21, 2022, 07:37:06 PM",
      "body": "Quote from: nakamura12 on May 21, 2022, 05:28:23 PMQuote from: SatoPrincess on May 21, 2022, 05:06:29 PMYou are a day too early, I believe bitcoin pizza day is tomorrow May 22. It’s nice to see this historic transaction has become a traditional event for those in the crypto space. I wonder if people around the world celebrating actually buy pizza with bitcoins that day. For me, the best to celebrate bitcoin pizza day is buying something physical with bitcoins. Maybe op's time is different and didn't use the Bitcointalk forum's time zone. In my country, it's already May 22 at dawn so I would also say that it is pizza day. It's been so long since I had eaten a pizza and I would like to eat one now . I wonder if there's a shop in my country where I can buy pizza with Bitcoin even though it's not the same as the OG. As if you are the one who bought pizza with that kind of amount of Bitcoin.You’re right. It could be a result of difference in time zone, it’s morning somewhere in the world. It would be a delight to see local businesses accept bitcoin as payment. The volatile nature of bitcoin will always be the barrier when it comes to payment adoption by small business owners. They may not have enough money in reserve to back up should bitcoin price falls.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "May 21, 2022, 07:48:40 PM",
      "body": "What is now known in the world originates on this forum in communication, this makes this forum to truly be the bitcoin forum.Quote from: cryptoaddictchie on May 21, 2022, 04:23:25 PMHappy bitcoin Pizza day guys. If Im not mistaken todays marked the day where one of the greatest transaction in history.It would have been lovely if you quote these:https://bitcointalk.org/index.php?topic=137.msg1195#msg1195QuoteI just want to report that I successfully traded 10,000 bitcoins for pizza.Pictures: http://heliacal.net/~solar/bitcoin/pizza/Thanks jercos!Quote from: nakamura12 on May 21, 2022, 05:28:23 PMMaybe op's time is different and didn't use the Bitcointalk forum's time zone. I think so too, but it is better to let us use this forum time zone for what is related to this forum, I mean posting about it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nakamura12",
      "created_time": "May 21, 2022, 08:28:35 PM",
      "body": "Quote from: Charles-Tim on May 21, 2022, 07:48:40 PMI think so too, but it is better to let us use this forum time zone for what is related to this forum, I mean posting about it.Well not that it's wrong to post about it in advance but it's only a day in advance not that matters to me anyway as long as we celebrate the pizza day in here. I would also post about it and include the date when it happen as to notify anyone who doesn't have the same time zone as the poster just like this one. When I saw this thread, all I think is the event that takes place at that time and that's all it matters.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "n0nce",
      "created_time": "May 21, 2022, 10:25:32 PM",
      "body": "Are you guys buying pizzas for the tradition or rather hoard those sats?Laszlo apparently doesn't regret having spent 10,000 BTC for two pizzas. [1]I reckon there are food ordering platforms that take Bitcoin payments and organize payment of the restaurants and deliveries.Grubhub seems to have something up for Bitcoin Pizza Day [2] (not sure what it entails) and in some countries, Just Eat Takeaway brands offer Bitcoin payments directly [3].The most convenient will probably be just using LNPizza [4], but I'd be interested how other folks around here get their Bitcoin pizzas.. [1] https://www.coindesk.com/markets/2020/05/22/10-years-after-laszlo-hanyecz-bought-pizza-with-10k-bitcoin-he-has-no-regrets/[2] https://www.grubhub.com/food/bitcoin_pizza[3] https://www.lieferando.de/en/customerservice/article/what-payment-methods-can-i-use-de[4] https://ln.pizza/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ZeeeN",
      "created_time": "May 21, 2022, 10:39:24 PM",
      "body": "sadly in my country not have any pizza campaign for pizza day.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "n0nce",
      "created_time": "May 21, 2022, 11:24:56 PM",
      "body": "Quote from: ZeeeN on May 21, 2022, 10:39:24 PMsadly in my country not have any pizza campaign for pizza day.You could still do what Laszlo did, 12 years (and 4 days) ago today, when he asked someone to basically just buy (or make) 2 pizzas for him and sell them to him for Bitcoin. You could ask in your local community if someone is willing to simply make or buy you pizzas and be paid by you in BTC.Quote from: laszlo on May 18, 2010, 12:35:20 AMI'll pay 10,000 bitcoins for a couple of pizzas.. like maybe 2 large ones so I have some left over for the next day.  I like having left over pizza to nibble on later.  You can make the pizza yourself and bring it to my house or order it for me from a delivery place, but what I'm aiming for is getting food delivered in exchange for bitcoins where I don't have to order or prepare it myself, kind of like ordering a 'breakfast platter' at a hotel or something, they just bring you something to eat and you're happy!~ snip ~",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "May 22, 2022, 04:46:48 AM",
      "body": "Quote from: SatoPrincess on May 21, 2022, 05:06:29 PMYou are a day too early, I believe bitcoin pizza day is tomorrow May 22. It’s nice to see this historic transaction has become a traditional event for those in the crypto space.I think thats not an issue I saw a lot of greetings already on Twitter when I posted it and anyway its the thought that counts actually.Quote from: ZeeeN on May 21, 2022, 10:39:24 PMsadly in my country not have any pizza campaign for pizza day.Oh its fine you could just simply order pizza and celebrate it yourself. Theres always a way to campaign for that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "UmerIdrees",
      "created_time": "May 22, 2022, 05:34:58 AM",
      "body": "Quote from: cryptoaddictchie on May 21, 2022, 04:23:25 PMAnyone wants some lovely pizza today? Happy bitcoin Pizza day guys. If Im not mistaken todays marked the day where one of the greatest transaction in history of bitcoin recorded. Nice to see you celebrating the bitcoin pizza day. By the way, did you buy this pizza with bitcoins  I wonder if this bitcoin pizza day topic has to do anything with the Meta section. Wouldn't it will be better to move it to bitcoin discussion section   By the way, we already have Bitcoin Pizza Day 2022 thread there.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GeorgeJohn",
      "created_time": "May 22, 2022, 09:53:24 AM",
      "body": "Quote from: ZeeeN on May 21, 2022, 10:39:24 PMsadly in my country not have any pizza campaign for pizza day.This is the memory of pizza celebration of bitcoin. And it's not everyone who celebrate that. From my understanding majority countries doesn't accept bitcoin for exchange of what your want or need. So exchanging you Bitcoin to fiat to get your own pizza is also part of the celebration, because many people who is celebrating it did not exchange bitcoin with pizza. So the remembrance of it, is a continuous scenario and process and it will remain till disappearance of bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Raflesia",
      "created_time": "May 22, 2022, 01:19:41 PM",
      "body": "Quote from: UmerIdrees on May 22, 2022, 05:34:58 AMQuote from: cryptoaddictchie on May 21, 2022, 04:23:25 PMAnyone wants some lovely pizza today? Happy bitcoin Pizza day guys. If Im not mistaken todays marked the day where one of the greatest transaction in history of bitcoin recorded. Nice to see you celebrating the bitcoin pizza day. By the way, did you buy this pizza with bitcoins  This is an unforgettable history, but I bought Pizza without Bitcoin, my area is still not available so that fiat money can be used.Although buying it is not with bitcoin but I think this is a unique celebration for all crypto community to do.  Quotehttps://twitter.com/binance/status/1528299750524698624/photo/3CZ does it, always smiling...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Xal0lex",
      "created_time": "May 22, 2022, 05:04:27 PM",
      "body": "",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "n0nce",
      "created_time": "May 22, 2022, 10:12:34 PM",
      "body": "Quote from: Xal0lex on May 22, 2022, 05:04:27 PM~ snip ~It's a cute picture, but you really should add sources when publishing work that is not yours.Source to this picture:https://twitter.com/LinaSeiche/status/1528398845503324175This is the talented person behind these great drawings:https://twitter.com/LinaSeicheAnd her website:https://thelittlehodler.com/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Xal0lex",
      "created_time": "May 22, 2022, 10:15:40 PM",
      "body": "Quote from: n0nce on May 22, 2022, 10:12:34 PMQuote from: Xal0lex on May 22, 2022, 05:04:27 PM~ snip ~It's a cute picture, but you really should add sources when publishing work that is not yours.Look carefully at the bottom right corner of the picture.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "May 23, 2022, 05:09:04 AM",
      "body": "Quote from: Xal0lex on May 22, 2022, 05:04:27 PM~snippedDamn this is so funny dude. This make me laugh and thanks for this cool picture. Bitcoin Pizza day really will not be forgotten, yesterday Ive sa a lot of my twitter friends bought pizza as their dinner and posting as part of the historical event on bitcoin.Oh btw just noticed your position. Didnt knew that your a staff here on forum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptocurencyKing",
      "created_time": "May 23, 2022, 10:32:50 AM",
      "body": "A sumptuous meal and a life of regretThe bitcoin pizza day is one that comes with such a huge lesson.This tells you how a little bit of fun and testing an upcoming investment or field before it's fully materialised can be a worst mistake.it satisfied an immediate want to fill their belly for a time and then left them regretting for the rest of there lives (that depends on if the individualis still alive and involved in cryptocurrencies up to date). This is a lesson that says, you should always be vengeful of an upcoming investment or field and know that the best of it is always in 10-20years and even more, not to jump over doing away with anything at its grass root. It could be a huge mistake.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TheBeardedBaby",
      "created_time": "May 23, 2022, 01:06:53 PM",
      "body": "There was some nice entries on the Discord server. Again, this year I could not participate, and we bought all the products to make it. One of the kids got the chickenpox (i guess the other one is a ticking bomb too) with the perfect timing.. \"Thank you\" Murphy for your perfectly working laws every single time. Back on topic, that's one of the most delicious and creative competitions in the bitcoin universe  Thank you, laszlo!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sheenshane",
      "created_time": "May 23, 2022, 03:17:05 PM",
      "body": "It might not late to greet everyone a Happy Bitcoin Pizza Day.Thinking about the huge amount that Jerco's received from Laszlo on that day in exchange for two Pizza, but unfortunately, Jeco's didn't hoard that Bitcoin he spend that Bitcoin as he said. Laszlo is a true legend that proves Bitcoin's first transaction made, we should thank him and also Jeremy Sturdivant aka “Jercos”.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}