{
  "id": "topic_5466936",
  "title": "Adigvcdh",
  "author": "Adigvcdh",
  "created_time": "September 15, 2023, 08:20:23 PM",
  "content": "Hello everyone , what sites are there, such as pinksale and cointool, where you can also do airdrop only cheaper?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5466936",
  "comments": [
    {
      "author": "Johnyz",
      "created_time": "September 15, 2023, 08:29:20 PM",
      "body": "Are you talking about your own project? Then you can actually do it on your own site.Airdrop is something that you’ll reward to the hunters to the early investors, its better to use your own platform with this. Anyway, what’s project is this? Better to have a good marketing team to handle this one.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptomaniac_xxx",
      "created_time": "September 15, 2023, 09:26:08 PM",
      "body": "Quote from: Adigvcdh on September 15, 2023, 08:20:23 PMHello everyone , what sites are there, such as pinksale and cointool, where you can also do airdrop only cheaper?I'm not really sure though about this tool, yeah it makes creating a token very easy without any hard work, I mean you don't know to code if you used this protocol right? (at least that's how I understand it).In any case though, you might not have total control as if something breaks, it's hard to go back and try to find where it is, just saying.So it's better to do the traditional way of coding and then include your airdrop.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JeffBrad12",
      "created_time": "September 15, 2023, 09:45:48 PM",
      "body": "you can make some contract that could do airdrops, of course it will require knowledge in regards of coding but it will be worth it.moreover you can also use multisend feature, which of course gonna demand some fee from your airdrop but its the same tool as those mentioned quite honestly.after all. the essence of airdropping is just multiple sending to many addresses all at once in which there are many platforms out there that does exactly that.but most airdrop i've seen so far always deploy their own contract for their airdrops.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Adbitco",
      "created_time": "September 15, 2023, 10:13:00 PM",
      "body": "Airdrop can be launched using your project official Twitter page people can participate by doing some tasks and they can post their address on the comments section you can copy all those address and send them their airdrop rewards.Those site you mentioned is where to launched your token sale and again if your tokens aren't yet created you can choose a preferred network to build it on before launching airdrops.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "livingfree",
      "created_time": "September 15, 2023, 10:18:08 PM",
      "body": "Aside from social media platforms, many airdrops are being done in the forum so that's an easy and cheaper way of releasing your airdrops and it's even for free.Go to the Bounties (Altcoins) and you'll see bunch of projects that are doing their own airdrops together with their bounties too. It's not just bounties that you can do there but also airdrops.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "serjent05",
      "created_time": "September 15, 2023, 11:28:36 PM",
      "body": "You can also ask exchanges to airdrop your token, I do not know if they will require a fee or accept some percentage of your coins as payment for such an airdrop.  You can also create a faucet for your coins as a way of airdropping them to the faucet claimant.  Anyway, I think airdrop can only saturate your market in its early stage.  It may lead to popularity yes, but most of these airdrops are proven to be devastating to the coin or token economy.  So better think of the percentage that will not affect your early token trades.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "woez",
      "created_time": "September 16, 2023, 03:29:35 AM",
      "body": "Quote from: Adigvcdh on September 15, 2023, 08:20:23 PMHello everyone , what sites are there, such as pinksale and cointool, where you can also do airdrop only cheaper?Why do you like airdrops, for me it's just a waste of time and gas and the associated risks, especially since the origins are unclear. Friends, there are many better ones on this forum, you can look for them on several bulletin boards either regarding the launch of new campaigns or something else. Like @livingfree that's one place. if you want.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "September 16, 2023, 03:50:16 AM",
      "body": "Quote from: Adigvcdh on September 15, 2023, 08:20:23 PMHello everyone , what sites are there, such as pinksale and cointool, where you can also do airdrop only cheaper?Its up to you mate. As long as you capable to using smart contract and setting up airdrop to users. Its not like other people will do it for you, yes it can be but there are probably service fee. There are platforms that distribute airdrops if you want to use their service and algo but you can set up the task or activity for that airdrop and juat give them the tokens alloted for that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}