{
  "id": "topic_5475688",
  "title": "criptoevangelista",
  "author": "criptoevangelista",
  "created_time": "November 27, 2023, 03:45:30 PM",
  "content": "Dinheiro sumiu, conta negativou: Usuários relatam problemas em contas do BradescoGerente fala em 'erro sistemático'; perfil oficial do banco diz que o caso será solucionado 'em breve'Clientes do banco Bradesco relataram, na manhã desta segunda-feira, que tiveram problemas com suas contas digitais. Alguns deles destacaram que todo o dinheiro sumiu das contas, e outros citaram que o saldo amanheceu negativado.\"E do nada Bradesco sumiu com meu dinheiro\", escreveu um dos internautas na plataforma X (antigo Twitter). \"Ô Bradesco, cadê o dinheirinho que estava na minha poupança e não está mais? É pouco, mas é meu. Quero de volta\", cobrou outro usuário.Um cliente identificado apenas como Andrews publicou uma imagem do seu extrato zerado no app do banco. \"Que absurdo do Bradesco! Minha conta estava zerada ontem e amanheceu ainda zerada! Bradesco, faça algo imediatamente!\", cobrou ele.Gabriel Mencarelli, por sua vez, mostrou aos seguidores que acordou com o saldo negativado.O internauta Fernando Pedro contou no X que sua conta também foi afetada, e ele não consegue entrar em contato com o banco para saber o que houve.\"Você não consegue falar com ninguém. O atendimento telefônico é inexistente\", reclamou. Uma usuária chamada Fernanda afirma que o Serviço de Atendimento ao Cidadão (SAC) do banco lhe informou que o problema se refere a uma \"instabilidade de sistema\".O GLOBO aguarda manifestação da assessoria de imprensa do Bradesco. Uma gerente do banco confirmou o problema, que seria parte de um \"erro sistemático\". Segundo ela, as equipes responsáveis já buscam uma solução para o caso.Em resposta a internautas, o perfil oficial do banco diz que o problema será solucionado \"em breve\".fonte: https://oglobo.globo.com/economia/noticia/2023/11/27/usuarios-relatam-que-dinheiro-sumiu-em-contas-do-bradesco.ghtml_______________________________________________________Que transtorno isso heim... obvio que irão arrumar, mas e quem precisa usar o dinheiro naquele exato momento? como faz?Agora o Bitcoin desde que foi criado ele parou de funcionar pouquissimas vezes e bem pontuais...  Vai da máxima de nunca deixar os ovos todos no mesmo cesto, isso vale pra tudo, até para contas bancárias.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5475688",
  "comments": [
    {
      "author": "Paredao",
      "created_time": "November 27, 2023, 07:58:14 PM",
      "body": "Bradescão sendo Bradescão. Já tive um problema parecido no passado com esse banco. Meu dinheiro também tinha sumido e depois reapareceu em outra conta. É que como minha agência tinha sido fechada, eles transferiram o dinheiro para uma nova agência e nova conta e não me avisaram. Imagina o desespero que deu até descobrir essa sacanagem.   O Banco do Brasil também faz a mesma coisa. Fecha a Agência, transfere a conta e só depois avisa o cliente. Eu tinha uma conta no BB do lado da minha casa. Fecharam a agência e mandaram a conta para uma agência a 5 KM de distância. Pura sacanagem.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "thiagothx1370",
      "created_time": "November 27, 2023, 08:08:55 PM",
      "body": "Quote from: criptoevangelista on November 27, 2023, 03:45:30 PMDinheiro sumiu, conta negativou: Usuários relatam problemas em contas do BradescoGerente fala em 'erro sistemático'; perfil oficial do banco diz que o caso será solucionado 'em breve'Clientes do banco Bradesco relataram, na manhã desta segunda-feira, que tiveram problemas com suas contas digitais. Alguns deles destacaram que todo o dinheiro sumiu das contas, e outros citaram que o saldo amanheceu negativado.\"E do nada Bradesco sumiu com meu dinheiro\", escreveu um dos internautas na plataforma X (antigo Twitter). \"Ô Bradesco, cadê o dinheirinho que estava na minha poupança e não está mais? É pouco, mas é meu. Quero de volta\", cobrou outro usuário.Um cliente identificado apenas como Andrews publicou uma imagem do seu extrato zerado no app do banco. \"Que absurdo do Bradesco! Minha conta estava zerada ontem e amanheceu ainda zerada! Bradesco, faça algo imediatamente!\", cobrou ele.Gabriel Mencarelli, por sua vez, mostrou aos seguidores que acordou com o saldo negativado.O internauta Fernando Pedro contou no X que sua conta também foi afetada, e ele não consegue entrar em contato com o banco para saber o que houve.\"Você não consegue falar com ninguém. O atendimento telefônico é inexistente\", reclamou. Uma usuária chamada Fernanda afirma que o Serviço de Atendimento ao Cidadão (SAC) do banco lhe informou que o problema se refere a uma \"instabilidade de sistema\".O GLOBO aguarda manifestação da assessoria de imprensa do Bradesco. Uma gerente do banco confirmou o problema, que seria parte de um \"erro sistemático\". Segundo ela, as equipes responsáveis já buscam uma solução para o caso.Em resposta a internautas, o perfil oficial do banco diz que o problema será solucionado \"em breve\".fonte: https://oglobo.globo.com/economia/noticia/2023/11/27/usuarios-relatam-que-dinheiro-sumiu-em-contas-do-bradesco.ghtml_______________________________________________________Que transtorno isso heim... obvio que irão arrumar, mas e quem precisa usar o dinheiro naquele exato momento? como faz?Agora o Bitcoin desde que foi criado ele parou de funcionar pouquissimas vezes e bem pontuais...  Vai da máxima de nunca deixar os ovos todos no mesmo cesto, isso vale pra tudo, até para contas bancárias. Nunca vi a rede Bitcoin parar de funcionar. O que eu sei foi um bug lá nos primordios da rede que o próprio satoshi resolveu! Isso ai da rede parar de funcionar é completamente errado! Esse lance do bradesco só comprova que o dinheiro que esta em posse do banco é do banco, e que o sistema bancário fiduciário é na verdade uma latrina cheio de bosta dentro.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tg88",
      "created_time": "November 27, 2023, 10:13:16 PM",
      "body": "Situação do Bradesco não anda boa, quem acompanha de perto os relatórios trimestrais dos bancos brasileiros sabe que ele está com números bem ruins quando comparado com seus principais concorrentes. Um dos problemas é que ele era um dos principais credores das Americanas mas isso isoladamente não justifica pois outros grandes credores vem apresentando ótimos resultados enquanto Bradesco vem piorando e sem muita perspectiva de melhora.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "darkv0rt3x",
      "created_time": "November 28, 2023, 12:00:51 AM",
      "body": "Acontecer uma vez é mau. Acontecer mais que uma vez é imperdoável. Como é que as pessoas continuam a confiar num banco onde o dinheiro aparece (às vezes) com a mesma facilidade com que desaparece? Se isso acontecesse no meu banco, só acontecia uma vez. Sim, teria que continuar a usar bancos, mas jamais continuaria a usar o mesmo! E o banco vai ter alguma repercussão judicial? Os utilzadores vão recuperar o dinheiro? E se não recuperarem?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "November 28, 2023, 07:57:16 PM",
      "body": "Quote from: criptoevangelista on November 27, 2023, 03:45:30 PMAgora o Bitcoin desde que foi criado ele parou de funcionar pouquissimas vezes e bem pontuais...  Quando é que isso aconteceu?  O Bitcoin desde que arrancou nunca parou, e para isso acontecer era preciso todos os mineradores desligarem as maquinas, e mesmo assim a probabilidade de alguém colocar um CPU/GPU a minerar era bem alta.Mesmo o tal bug que o @thiagothx1370 fala, não fez parar a rede, apenas fez uma correção no core para evitar problemas futuros. Pensando bem, em quase 15 anos de existência, só foi encontrado um bug menor, é realmente um código incrível o do Bitcoin. E não é por falta de pessoas a analisa-lo ao pormenor. Em relação ao problema, mostra claramente que o dinheiro hoje é mais virtual do que físico, e isso leva a que basta erros informáticos para tudo ficar descontrolado.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TryNinja",
      "created_time": "November 28, 2023, 09:38:30 PM",
      "body": "Quote from: joker_josue on November 28, 2023, 07:57:16 PMQuando é que isso aconteceu?  O Bitcoin desde que arrancou nunca parou, e para isso acontecer era preciso todos os mineradores desligarem as maquinas, e mesmo assim a probabilidade de alguém colocar um CPU/GPU a minerar era bem alta.Mesmo o tal bug que o @thiagothx1370 fala, não fez parar a rede, apenas fez uma correção no core para evitar problemas futuros. Pensando bem, em quase 15 anos de existência, só foi encontrado um bug menor, é realmente um código incrível o do Bitcoin. E não é por falta de pessoas a analisa-lo ao pormenor. Em relação ao problema, mostra claramente que o dinheiro hoje é mais virtual do que físico, e isso leva a que basta erros informáticos para tudo ficar descontrolado.O Bitcoin só teve dois casos de bugs graves, tendo um uptime geral de 99.988%.Um deles em 2010 quando rolou o bug de overflow.Outro em 2013 quando rolou um fork não intencional causado por um update (0.7 -> 0..https://buybitcoinworldwide.com/bitcoin-downtime/Em minha opinião o período do overflow mencionado pelo @thiagothx1370 pode ser sim considerado offline, pois uma boa parte da rede esteve em uma chain maligna ante correção.https://bitcointalk.org/index.php?topic=823.msg9841#msg9841",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "November 29, 2023, 01:20:24 AM",
      "body": "Quote from: TryNinja on November 28, 2023, 09:38:30 PMO Bitcoin só teve dois casos de bugs graves, tendo um uptime geral de 99.988%.Um deles em 2010 quando rolou o bug de overflow.Outro em 2013 quando rolou um fork não intencional causado por um update (0.7 -> 0.8 ).Obrigado pela explicação.Isso quase nem se pode dizer que a rede parou, foram minutos que esteve em baixo para reorganizar toda a rede.Nem os maiores sites do mundo, conseguem ter esse nível de uptime.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}