{
  "id": "topic_5453271",
  "title": "JamesDaniel90",
  "author": "JamesDaniel90",
  "created_time": "May 19, 2023, 09:49:25 AM",
  "content": "I have recently come across Casper after looking at XRP and HBAR and wonder if this is a popular investment amongst us on this forum?Have been researching and many say Casper could reach $1 next bull run which would give us a 21x from current price of $0.047.A $1 price would give Casper a $11b market cap which isn't that much compared to how high others will go next bull run.Any thoughts?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5453271",
  "comments": [
    {
      "author": "bozkytoken",
      "created_time": "May 19, 2023, 10:06:02 AM",
      "body": "How much are you willing to invest in?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JamesDaniel90",
      "created_time": "May 19, 2023, 10:13:23 AM",
      "body": "Quote from: bozkytoken on May 19, 2023, 10:06:02 AMHow much are you willing to invest in?Well 10,000 CSPR would be a good bag and that would currently cost $470.So no more than $500 should get me 10,000 and I would look at reaching that amount through DCA not a one off investment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ryzaadit",
      "created_time": "May 19, 2023, 10:25:25 AM",
      "body": "Did you have some tought ?Or you just using other people research, I mean you are investing you should taken from the perspective of your self. Each individual have a different research term and some people will say yes some people will say no.So, it's depends on the conclusion of your research. If you think is good because a few reason you are find from the project, then invest (If no, then don't). If you don't know anything, don't invest.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "May 19, 2023, 10:38:24 AM",
      "body": "Quote from: JamesDaniel90 on May 19, 2023, 10:13:23 AMWell 10,000 CSPR would be a good bag and that would currently cost $470.So no more than $500 should get me 10,000 and I would look at reaching that amount through DCA not a one off investment. Casper is a coinlist project and one of the heavily invested last bull run but since its down by a lot. I think doing dca with that ia also cool. But In terms of developement I think they are quiet among it on social media. More hypes are garnering on memecoins and new L2 like arbitrum, optimistic, zksync and other resurface projects. Mostly other chains are being neglected due to memecoin hype and more people are swarming in than investing on a good one like L1 or casper itself.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Tytanowy Janusz",
      "created_time": "May 19, 2023, 01:37:05 PM",
      "body": "Quote from: JamesDaniel90 on May 19, 2023, 09:49:25 AMI have recently come across Casper after looking at XRP and HBAR and wonder if this is a popular investment amongst us on this forum?Have been researching and many say Casper could reach $1 next bull run which would give us a 21x from current price of $0.047.A $1 price would give Casper a $11b market cap which isn't that much compared to how high others will go next bull run.Any thoughts? Whats their userbase? Whats their use case? Are they unique and inimitable? what market share do they have (I'm talking about real utilities and traffic, not capitalization)? Because I personally have been in crypto every day for 6 years, I use many services, cex, dex and I have not heard about it. So I give this project a fair valuation of 1-10 mln $ at best. Which means -98%/-99,8% from current price. Not $11B. you even know how much money it is? You really think that startup without real usecase is worth that much? Startup in the world where there are 25 000 alternatives? (that much is listed on CMC, another 200 000 is not)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o48o",
      "created_time": "May 19, 2023, 06:15:13 PM",
      "body": "Quote from: JamesDaniel90 on May 19, 2023, 09:49:25 AMI have recently come across Casper after looking at XRP and HBAR and wonder if this is a popular investment amongst us on this forum?Have been researching and many say Casper could reach $1 next bull run which would give us a 21x from current price of $0.047.A $1 price would give Casper a $11b market cap which isn't that much compared to how high others will go next bull run.Any thoughts? What does casper have in their roadmap to justify such a growth? Also are you considering listening casper bag holders as research? I mean you didn't explain the research part, only that random people said that it can do 21x. I can say that eth will do 10000x from here but reading that isn't research or would make it true.XRP and HBAR has their own fans in here too but i am not part of them. And i wouldn't call them any more popular then their marketcap tells us.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kavelj22",
      "created_time": "May 19, 2023, 07:33:53 PMLast edit: May 21, 2023, 07:40:26 PM by Kavelj22",
      "body": "That someone told you that this currency will reach a certain price limit, is not evidence that this will actually happen and that it can be relied upon in investment schemes.  The currency is new and unknown, and any decision will be relative and nothing is certain. On the other hand, if you are sure of the integrity of the project that produces the token, I cannot advise you not to make the investment, but remember that there is always an existing risk ratio.From a personal point of view that does not oblige anyone else, I can say that I completely lack confidence in most of the currencies of new projects, with the exception of a very few that are still finding their way.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Velemir Sava",
      "created_time": "May 20, 2023, 05:42:07 AM",
      "body": "If you are sure and have tried it, just move on. I myself, if I enter, look for something that is easy for me to understand and understand and don't dare to go too far, even though the opportunity is great, as you said, giving us 21x the current price of $ 0.047.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "southerngentuk",
      "created_time": "May 20, 2023, 08:33:10 AM",
      "body": "What would you like me to think about and discuss about an investment with Casper?I am aware of this project, but there is not too much information that I am interested in, some people have told me it is interested but really for me the catalog for Casper is not available because I have Research other coins.However, to be honest, this is a good project in this market, they are capable, have development potential, have a large investment fund,... so the expectation for the next cycle also depends. on whether you really believe in what they've been doing. I don't have much to say about its price or capitalization, but I think it will stay in the top100 or better positions in the future.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rhomelmabini",
      "created_time": "May 20, 2023, 09:04:44 AM",
      "body": "I am expecting some deep thoughts in here or some little research but sadly it hasn't. Well, I look a little on the project and they are still around especially the founder and the devs, they are making updates, still engaged on the community, has progress regarding one project being built on their network and a lot more. It's easy to say it decrease engagement but that's understandable for a lot of projects at the moment since we aare still on a bear market. Memecoins, roll-up tokens, tokens that are having airdrops are just the noisy one these days. I think Casper can still get back up and this isn't a financial advice but rather my own opinion regarding them. To OP just take responsibility on your investment and if I were you, just dog more onto what you think is a great investment rather than investing on it blindly.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kevinzxz",
      "created_time": "May 20, 2023, 08:31:16 PM",
      "body": "Quote from: JamesDaniel90 on May 19, 2023, 09:49:25 AMI have recently come across Casper after looking at XRP and HBAR and wonder if this is a popular investment amongst us on this forum?Have been researching and many say Casper could reach $1 next bull run which would give us a 21x from current price of $0.047.A $1 price would give Casper a $11b market cap which isn't that much compared to how high others will go next bull run.Any thoughts? $1 is an easy price for CASPER to reach, because the ATH price is $1.363, so if the next bullrun does occur at the end of this year or in 2024 when Bitcoin halving, then the price of CASPER can definitely return to ATH price and even create a new ATH price, because CASPER is one of the best and most popular projects in cryptocurrency at this time, so many investors invest in CASPER for the long term, therefore you don't need to worry if you invest in CASPER and hold it until the price becomes $1, because I believe that can be achieved by CASPER easily.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "poodle63",
      "created_time": "May 21, 2023, 03:04:57 AM",
      "body": "I have around 50k casper from participating in the coinlist sale a few years ago. The price is still under price right now. The good thing if casper is still actively developing its project. It's not yet added into the major exchange site like binance and coinbase. The chance for casper to go to the moon is still there. I hope that my to wait my casper will be paid off in the future. It will be so bad if the price will never surpass 10 cents.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JamesDaniel90",
      "created_time": "May 21, 2023, 08:02:52 AM",
      "body": "Quote from: kevinzxz on May 20, 2023, 08:31:16 PMQuote from: JamesDaniel90 on May 19, 2023, 09:49:25 AMI have recently come across Casper after looking at XRP and HBAR and wonder if this is a popular investment amongst us on this forum?Have been researching and many say Casper could reach $1 next bull run which would give us a 21x from current price of $0.047.A $1 price would give Casper a $11b market cap which isn't that much compared to how high others will go next bull run.Any thoughts? $1 is an easy price for CASPER to reach, because the ATH price is $1.363, so if the next bullrun does occur at the end of this year or in 2024 when Bitcoin halving, then the price of CASPER can definitely return to ATH price and even create a new ATH price, because CASPER is one of the best and most popular projects in cryptocurrency at this time, so many investors invest in CASPER for the long term, therefore you don't need to worry if you invest in CASPER and hold it until the price becomes $1, because I believe that can be achieved by CASPER easily.Hope so! I started to DCA Casper the other day and hoping it stays this cheap or lower for at least a few more months so I can get a good amount at low prices",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}