{
  "id": "topic_5447034",
  "title": "cafter",
  "author": "cafter",
  "created_time": "March 31, 2023, 03:35:40 PMLast edit: March 31, 2023, 04:12:51 PM by cafter",
  "content": "what would happen to the value and adoption of Bitcoin if a major flaw in its protocol was discovered and exploited, leading to the loss of a significant portion of the coins in circulation,and a loss of trust in the technology?i don't have very technical knowledge about how secure it is .",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5447034",
  "comments": [
    {
      "author": "bitmover",
      "created_time": "March 31, 2023, 04:39:15 PM",
      "body": "Quote from: cafter on March 31, 2023, 03:35:40 PMwhat would happen to the value and adoption of Bitcoin if a major flaw in its protocol was discovered and exploited, leading to the loss of a significant portion of the coins in circulation,and a loss of trust in the technology?i don't have very technical knowledge about how secure it is .Bitcoin blockchain is running for already 14 years,  the changes of a major flaw like that appear is nearly zero. Don't worry about it.The protocol is highly tested already. The  blockchain echnology is trusted by millions of people and it is already being used in many different systems.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AbuBhakar",
      "created_time": "March 31, 2023, 04:43:06 PM",
      "body": "Quote from: cafter on March 31, 2023, 03:35:40 PMwhat would happen to the value and adoption of Bitcoin if a major flaw in its protocol was discovered and exploited, leading to the loss of a significant portion of the coins in circulation,and a loss of trust in the technology?i don't have very technical knowledge about how secure it is .No one knows the exact value but surely the price will collapse if this major flaw didn’t solved immediately. Trust and confidence are the 2 main factor that built the price of Bitcoin to this level. Removing this will make Bitcoin a normal shitcoin that can be exploited by hacker or the team itself.Luckily Bitcoin survived for more than a decade without facing this major flaw unlike other coin like Ethereum that result to massive loss during the DAO incident.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tromp",
      "created_time": "March 31, 2023, 04:51:13 PM",
      "body": "Quote from: cafter on March 31, 2023, 03:35:40 PMwhat would happen to the value and adoption of Bitcoin if a major flaw in its protocol was discovered and exploited, leading to the loss of a significant portion of the coins in circulation,and a loss of trust in the technology?i don't have very technical knowledge about how secure it is .If ECDLP, the elliptic curve discrete log problem, turns out not to be as computationally hard as we think,and someone happens to stumble on an algorithm to crack it, then they could steal from practically all cryptocurrencies.First they'd steal from ones where inflation remains undetected, by opening Pedersen commitments in arbitrary ways. Next they could try their luck on Bitcoin, taking balances with reused keys. It would probably take a while beforepublic evidence builds. People would first blame victims on poor security practices and such. But if the thief is greedy and keeps at it, people would eventually realize that ECDLP has likely been cracked. Then the value of Bitcoin and all other crypto currencies would quickly plummet.If the thief is not too greedy then the public at large may never suspect though.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FatFork",
      "created_time": "March 31, 2023, 08:51:45 PM",
      "body": "I think it really depends on how severe the flaw is and how quickly it is addressed. If it's a small issue that can be fixed easily, it might not have a huge impact. But if it's a major flaw that can't be fixed easily, it could be a disaster. But, the chances of that happening are pretty slim. The fact that the blockchain technology is trusted by millions of people and is already being used in many different systems is a testament to its security. And, the good thing about Bitcoin is that we have a community of developers who are constantly working to improve the technology and address any potential issues.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "digaran",
      "created_time": "April 01, 2023, 12:01:50 AM",
      "body": "On chain problems are easy to solve as there are thousands of blockchain backups (full nodes) to restore the state of the chain after any damage caused by the exploit. On the security of your private key, it is mathematically difficult to find them, so it's better if you distribute your coins across many addresses because 1000 bitcoins in one address is worth going after, but nobody would go after 1 bitcoin in one address.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "taufik123",
      "created_time": "April 01, 2023, 01:04:19 AM",
      "body": "Quote from: FatFork on March 31, 2023, 08:51:45 PM-snip-The fact that the blockchain technology is trusted by millions of people and is already being used in many different systems is a testament to its security. And, the good thing about Bitcoin is that we have a community of developers who are constantly working to improve the technology and address any potential issues.There is no doubt about the safety of blockchain technology, because millions of people have used it and are involved in many transactions. Because the blockchain system is decentralized and has a transparent nature, blockchain allows its users to set their own data security and can view any transaction easily without hiding anything.But not all blockchains rely on the security of their own technology. Security must also be supported from the point of view of its users. Users must think about their privacy and manage their security. Never be careless with the assets you have, the main security is in the users themselves.Quote from: digaran on April 01, 2023, 12:01:50 AMOn chain problems are easy to solve as there are thousands of blockchain backups (full nodes) to restore the state of the chain after any damage caused by the exploit. On the security of your private key, it is mathematically difficult to find them, so it's better if you distribute your coins across many addresses because 1000 bitcoins in one address is worth going after, but nobody would go after 1 bitcoin in one address.A good suggestion is if a user is doing distributions to multiple addresses so the coins don't pile up together and become a target for hackers. But that's quite optional, there are still many ways you can do to secure your personal wallet with a large number of bitcoins in one wallet. example 2000 or more in one wallet. If distributing to the 2000 wallets that are made it will take quite a long time and you also have to be very careful, if the wrong address is entered it will be a fatal error.Enough with 1 wallet but supported by multiple security such as using the Multi-Sig method, 2FA, transaction verification and using a hardware wallet. It is safe enough, and never reveal your address to the public or social media because it will be dangerous and it is a more direct threat to users, such as crimes that often occur in large numbers of Bitcoin wallet users.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o_e_l_e_o",
      "created_time": "April 01, 2023, 06:52:38 AM",
      "body": "Quote from: bitmover on March 31, 2023, 04:39:15 PMBitcoin blockchain is running for already 14 years,  the changes of a major flaw like that appear is nearly zero. Don't worry about it.Quote from: taufik123 on April 01, 2023, 01:04:19 AMThere is no doubt about the safety of blockchain technology, because millions of people have used it and are involved in many transactions.These are insufficient answers.No software in existence is immune to bugs. Windows has existed for almost 40 years and is run by billions more people than Bitcoin Core is, and yet still has regular bugs and vulnerabilities discovered. Burying your head in the sand and saying \"Don't worry about bugs\" is a recipe for disaster. Bugs need to be continually found and resolved, and failure to do so will absolutely lead to an event where bitcoin collapses.There have been a number of critical bugs discovered in the past. In some cases, they were discovered and fixed prior to being exploited, such as this one: https://bitcoincore.org/en/2018/09/20/notice/In other cases, they were only discovered after being exploited, such as this one: https://en.bitcoin.it/wiki/Value_overflow_incident. In this case, a fork occurred in order to reverse the damage done.Should another major vulnerability be exploited which would result in the complete collapse of bitcoin, then I would fully expect a fork to occur which would reverse the damage of said vulnerability and allow bitcoin to continue unaffected. It will be trivial to get the majority of the network to accept such a fork - when faced with accepting the fork or having all the bitcoin they own be worth zero, then almost all nodes and miners will accept the fork without a second thought.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cafter",
      "created_time": "April 01, 2023, 07:20:07 AM",
      "body": "Quote from: o_e_l_e_o on April 01, 2023, 06:52:38 AMShould another major vulnerability be exploited which would result in the complete collapse of bitcoin, then I would fully expect a fork to occur which would reverse the damage of said vulnerability and allow bitcoin to continue unaffected. It will be trivial to get the majority of the network to accept such a fork - when faced with accepting the fork or having all the bitcoin they own be worth zero, then almost all nodes and miners will accept the fork without a second thought.is it worry for now ? some people who invested their most of the part in bitcoin will not be able to sleep at night. and if that happens and all bitcoin goes to zero why would anyone trust other crypto that also will have bugs and vulnerabilities in future, when they may already losed money in king like bitcoin, it will become very difficult to trust other crypto no?most of the times is gone in solving captcha.      and edit also count as one more coin to collect in captcha, number of times we click post= coins to collect to solve captchai am really really getting very angry solving that captcha, 3 times collected 8 coins of 10coins fu*kfinally after 100000 hours   i got that life saving saving words \"CAPTCHA SOLVED\"",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o_e_l_e_o",
      "created_time": "April 01, 2023, 07:45:04 AM",
      "body": "Quote from: cafter on April 01, 2023, 07:20:07 AMis it worry for now ? some people who invested their most of the part in bitcoin will not be able to sleep at night.I am not worried about such major flaws like this.As I said above, if such a critical vulnerability is found and patched before it is resolved, then nothing happens.If such a critical vulnerability is found and exploited, then the entire community has the option to either have all their bitcoin fall to zero, or to run the new patched software which will rapidly be released and continue on as if nothing had happened, as happened during the value overflow bug.The bigger concern is not critical vulnerabilities which suddenly print 92 billion bitcoin out of thin air - these are easy to detect and easy to reverse. The bigger concern is a less obvious vulnerability which allows someone to slowly start stealing coins or minting new ones undetected for a lengthy period of time. Once it is detected then perhaps many of these bugged coins are already spent, in the hands of innocent third parties, combined with legitimate coins, and so on. Trying to unwind that damage becomes much harder, if not impossible. Such a bug is maybe not critical enough to make bitcoin fall to zero, but it would certainly be enough to shake out a lot of weak hands and cause the price to fall in the short to medium term.Quote from: cafter on April 01, 2023, 07:20:07 AMwhen they may already losed money in king like bitcoin, it will become very difficult to trust other crypto no?There are (maybe) 2 altcoins that I would trust already, so this isn't really a concern of mine. 99.9% of altcoins are money grabs, scams, centralized, or so poorly put together that no one should even consider buying them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackHatCoiner",
      "created_time": "April 01, 2023, 08:19:15 AM",
      "body": "This thread is a duplicate of \"What would happen?\", whose OP also shares the same concern as you. As I've said there, and as o_e_l_e_o has outlined, there have been more significant vulnerabilities exploited in the past decade, like OpenSSL bug exploit, Eternal Blue and Windows being buggy since 1995. And the simple answer appears to be: the developers will take over.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "April 01, 2023, 12:22:28 PM",
      "body": "Almost this was one of the biggest vulnerabilities[1] that were discovered that caused a hard fork. Fortunately, the network was only down for 6 hours in the worst case, and this was more than 10 years ago when Bitcoin was in its early days.Therefore, with all the developers and investment funds, the possibility of a major vulnerability is small, or it will be resolved quickly, remember Bitcoin 100% Uptime more than 9 years ago.For more read -----> https://bitcoinbriefly.com/hacking-bitcoin-history-of-bitcoin-hacks/Quote from: o_e_l_e_o on April 01, 2023, 07:45:04 AMThere are (maybe) 2 altcoins that I would trust already, so this isn't really a concern of mine. 99.9% of altcoins are money grabs, scams, centralized, or so poorly put together that no one should even consider buying them.Monero (XMR) and what?[1] Strange block 74638",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sha420hashcollision",
      "created_time": "April 01, 2023, 02:34:33 PM",
      "body": "Quote from: cafter on March 31, 2023, 03:35:40 PMwhat would happen to the value and adoption of Bitcoin if a major flaw in its protocol was discovered and exploited, leading to the loss of a significant portion of the coins in circulation,and a loss of trust in the technology?i don't have very technical knowledge about how secure it is .I promise you, the more you research about the state-of-the-art Bitcoin core development the more you will realize how secure the network is. The misconception is that not everything on Bitcoin works in a hand-holding way. In fact very few things away from the core client and popular wallets do. It is highly possible to make huge mistakes using Bitcoin, you cannot just do any crazy script hack and expect it to work. With good research though you can utilize highly secure cryptographic assumptions that have been established by the core development community.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cafter",
      "created_time": "April 02, 2023, 02:37:52 PM",
      "body": "Quote from: hugeblack on April 01, 2023, 12:22:28 PMMonero (XMR) and what?Zcash or Dash ?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o_e_l_e_o",
      "created_time": "April 02, 2023, 07:22:43 PM",
      "body": "Quote from: hugeblack on April 01, 2023, 12:22:28 PMMonero (XMR) and what?Good question.  I assume there is at least one altcoin other than Monero out there somewhere I would consider owning, but I haven't found it yet.Quote from: cafter on April 02, 2023, 02:37:52 PMZcash or Dash ?Lol. Absolutely not.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cafter",
      "created_time": "April 02, 2023, 07:33:24 PM",
      "body": "Quote from: o_e_l_e_o on April 02, 2023, 07:22:43 PMZcash or Dash ?Lol. Absolutely not.i said those coz they are similar to monero see: https://craft.co/monero/competitors",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o_e_l_e_o",
      "created_time": "April 02, 2023, 07:50:42 PM",
      "body": "Neither are actually private.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sha420hashcollision",
      "created_time": "April 02, 2023, 09:15:33 PM",
      "body": "Quote from: o_e_l_e_o on April 02, 2023, 07:22:43 PMQuote from: hugeblack on April 01, 2023, 12:22:28 PMMonero (XMR) and what?Good question.  I assume there is at least one altcoin other than Monero out there somewhere I would consider owning, but I haven't found it yet.Quote from: cafter on April 02, 2023, 02:37:52 PMZcash or Dash ?Lol. Absolutely not.What's your thoughts on Grin?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sha420hashcollision",
      "created_time": "April 02, 2023, 09:17:13 PM",
      "body": "Quote from: tromp on March 31, 2023, 04:51:13 PMQuote from: cafter on March 31, 2023, 03:35:40 PMwhat would happen to the value and adoption of Bitcoin if a major flaw in its protocol was discovered and exploited, leading to the loss of a significant portion of the coins in circulation,and a loss of trust in the technology?i don't have very technical knowledge about how secure it is .If ECDLP, the elliptic curve discrete log problem, turns out not to be as computationally hard as we think,and someone happens to stumble on an algorithm to crack it, then they could steal from practically all cryptocurrencies.First they'd steal from ones where inflation remains undetected, by opening Pedersen commitments in arbitrary ways. Next they could try their luck on Bitcoin, taking balances with reused keys. It would probably take a while beforepublic evidence builds. People would first blame victims on poor security practices and such. But if the thief is greedy and keeps at it, people would eventually realize that ECDLP has likely been cracked. Then the value of Bitcoin and all other crypto currencies would quickly plummet.If the thief is not too greedy then the public at large may never suspect though.According to Shor leading quantum computers cannot even solve low bit RSA:  https://youtu.be/d_5u2qdKoUU?t=3708",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o_e_l_e_o",
      "created_time": "April 03, 2023, 08:20:32 AM",
      "body": "Quote from: sha420hashcollision on April 02, 2023, 09:15:33 PMWhat's your thoughts on Grin?I don't own any, but if I was forced at gunpoint to buy a coin other than Bitcoin or Monero it would probably be Grin. Mimblewimble in general is very interesting and hopefully will play a bigger role in the future.Quote from: sha420hashcollision on April 02, 2023, 09:17:13 PMAccording to Shor leading quantum computers cannot even solve low bit RSA:  https://youtu.be/d_5u2qdKoUU?t=3708Absolutely. I pointed this out in another thread a few months ago after some clickbait saying that RSA had been broken by quantum computers, which it obviously hasn't: https://bitcointalk.org/index.php?topic=5433605.msg61567738#msg61567738But this is unlikely to be true forever. Shor's algorithm can break RSA and ECC if we get sufficiently powerful quantum computers.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}