{
  "id": "topic_5426610",
  "title": "planingkoala",
  "author": "planingkoala",
  "created_time": "December 07, 2022, 09:13:08 PM",
  "content": "Ich arbeite seit dem Vorjahr für ein Unternehmen in der Packmittelbranche und mein Arbeitgeber spielt mit dem Gedanken, auf der Interpack in Düsseldorf Präsenz zu zeigen. Hierbei ist er unschlüssig, ob er bereits im kommenden Mai daran teilnehmen möchte oder ob wir es zunächst mit anderen einschlägigen Messen und erst dann mit der Interpack angehen sollten. Die zweitgenannte Vorgehensweise hätte folgerichtig den Vorteil, dass wir uns zuerst ein Bild hiervon machen könnten. Jedoch müssten wir dann höchstwahrscheinlich drei Jahren warten. Hat jemand in der Runde als Teilnehmer oder als Besucher Erfahrungen mit dieser Messe oder mit ähnlich bekannten Messen? Falls Ersteres zutreffen sollte… Wie viel Zeit sollten wir für die Vorbereitungen einplanen und wie kann man als Messeneuling das Bestmögliche herausholen? Vielen Dank vorab für Eure Rückmeldungen!",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5426610",
  "comments": [
    {
      "author": "mole0815",
      "created_time": "December 09, 2022, 10:49:24 AM",
      "body": "Ich selbst habe damit keine Erfahrungen planingkoala.Aber optimal wird es vermutlich sein direkt bei den Profis mit Erfahrung in diesem Bereich vorstellig zu werden https://www.interpack.de/de/Ausstellen/StandbauAuf der Seite gibt es sogar einen Standkonfigurator https://configurator.messe-duesseldorf.de/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fretum",
      "created_time": "December 09, 2022, 10:57:11 AM",
      "body": "Also wenn ihr im Mai auf einer Messe vertreten sein wollt, solltet ihr jetzt schon anfangen einen Messestand zu planen und ihn bauen zu lassen. Ich nehme jetzt mal nicht an, ihr habt euren Messestand schon im Keller stehen:)Sicherlich bekommt ein Messebauer einen Stand schnell gebaut aber es braucht ja auch ein gutes Design, der Stand muss an die Größe des Platzes auf der jeweiligen messe angepasst werden, eure Wünsche müssen umgesetzt werden,... Was auch sehr wichtig ist, ihr werdet im Frühling nicht die einzigen Sein, die einen Messestand haben wollen. Das ist quasi die Hauptsaison für Messen.Ich würde mal schnell Kontakt aufnehmen mit dem ein oder anderen Messebauer. Dann wisst ihr ob da noch Kapazitäten frei sind bzw. wie lange es ungefähr dauert. Aber wie gesagt, würde mir da nicht allzu lange Zeit lassen.Ich finde man muss sich als Firma einem Plan ausdenken. Einfach mal so auf einer Messe auftauchen bringt nur bedingt etwas. man muss sich überlegen was die Ziele sind, wie man die erreicht, wen man ansprechen möchte und wie man das schafft,.... Das muss man intern machen, die Arbeit nimmt einem niemand ab.Ich war schon bei einigen messen, meist als Kunde aber auch zweimal als \"Aussteller\". Also zumindest bei der Planung/Umsetzung habe ich mitgeholfen. Direkt auf der Messe habe ich dann nicht die Menschen beraten.Bei der ersten Firma lief alles super ab, bei einem späteren Arbeitgeber war es eine Katastrophe:)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "planingkoala",
      "created_time": "December 13, 2022, 04:44:43 PM",
      "body": "Vielen Dank für Eure Rückmeldungen! Ja, den Konfigurator haben wir sogar gesehen bzw. wir behalten das Option im Hinterkopf. Aber bei uns ist / wäre das eine längere Anreise nach Düsseldorf und ich nehme einmal an, dass es geschickter ist, wenn man das Ganze doch besser im Blickwinkel hat. Folgerichtig haben wir nicht bereits einen fertigen Messestand im Keller.  Wie funktioniert das üblicherweise bei Ständen mit einem besseren Design… Muss man sich zunächst an einen Designer / Architekten wenden? Die Tatsache, dass wir auch abgesehen davon einen klaren Plan haben müssen, ist uns bewusst. Daran feilen wir bereits, aber ein Teil bringt wenig, wenn der andere nicht passt und umgekehrt…",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mole0815",
      "created_time": "December 14, 2022, 05:08:41 PM",
      "body": "Quote from: planingkoala on December 13, 2022, 04:44:43 PMWie funktioniert das üblicherweise bei Ständen mit einem besseren Design… Muss man sich zunächst an einen Designer / Architekten wenden? Die Tatsache, dass wir auch abgesehen davon einen klaren Plan haben müssen, ist uns bewusst. Daran feilen wir bereits, aber ein Teil bringt wenig, wenn der andere nicht passt und umgekehrt… An dieser Stelle würde ich gerne nochmal auf https://www.interpack.de/de/Ausstellen/Standbau verweisen.Diese Anlaufstelle sollte auf jeden Fall helfen können QuoteKreieren Sie Ihr individuelles Rundum-sorglos-Paket und wählen dabei aus flexibel kombinierbaren Servicebausteinen – vom Standbau über Werbeleistungen bis hin zum Catering. Mit gebündeltem Know-How unterstützen wir Sie bei der Gestaltung und der Umsetzung eines herausragenden Messeauftritts - und das mit nur einem Ansprechpartner. Quote+49 211 4560-600 oder per E-Mail ServiceAlliance@messe-duesseldorf.deToitoitoi",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fretum",
      "created_time": "December 21, 2022, 10:32:06 AM",
      "body": "Quote from: planingkoala on December 13, 2022, 04:44:43 PMWie funktioniert das üblicherweise bei Ständen mit einem besseren Design… Muss man sich zunächst an einen Designer / Architekten wenden? Du nimmst mit einem Messebauer Kontakt auf und erzählst ihm mal von deinem Vorhaben. Für den ersten Kontakt ist mal wichtig wann die Messe ist und was ihr euch ungefähr vorstellt (Größe, Ausstattung,...) Wenn du 50m² haben willst, ist das leichter zu machen als wenn du einen zweistöckigen Messestand haben möchtest und du dazu eine Feuershow haben möchtest.Such dir gleich Messebauer, die auch eine eigene Designabteilung haben. Bei Syma weiß ich, dass die sich auch gleich um das Design kümmern. Wird auch Anbieter geben, die dir nur das bauen, was du ihnen vorgibst.Bleiben wir jetzt bei dem Beispiel mit interner Designabteilung - Da werden dir dann Skizzen gezeichnet, wie das dann aussehen soll. Dann entscheidet man sich für ein Design und dann kann der Messestand gebaut werden.Wenn der Messestand dann fertig ist, bringt normalerweise der Messebauer den Stand auf die Messe und baut den Stand auf und auch wieder ab nach der Messe.Dann muss man sich anschauen ob man den Stand selbst einlagert oder beim Messebauer bleiben kann. Das müsste man halt alles vorher abklären. Wie gesagt, da gibt es Unterschiede zwischen den verschiedenen Messebauern.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "planingkoala",
      "created_time": "January 03, 2023, 06:15:30 PM",
      "body": "Vielen Dank für die weiteren Antworten und ich wünsche an dieser Stelle alles Gute für das neue Jahr! Möge es eindeutig besser als das vergangene werden… @mole0815: ich werde mir das jetzt notieren und morgen mitbringen. Ich kann mir aber schon eine Frage, die mit ziemlicher Sicherheit auftauchen wird, vorstellen… Und zwar, könnte man den Stand im Nachhinein auch für Messeveranstaltungen auf anderen Standorten verwenden und würde er uns ausschließlich in Düsseldorf weiterhelfen? @Fretum: So vom Gefühl denke ich ebenfalls, dass abseits der zusätzlich hier genannten Option mit einer internen Designabteilung für uns geschickter wäre. Wie meinst Du, dass sie bauen, was man ihnen vorgibt? Müssten wir bereits mit zig Details herantanzen?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fretum",
      "created_time": "January 10, 2023, 10:04:55 AM",
      "body": "Quote from: planingkoala on January 03, 2023, 06:15:30 PM@Fretum: So vom Gefühl denke ich ebenfalls, dass abseits der zusätzlich hier genannten Option mit einer internen Designabteilung für uns geschickter wäre. Wie meinst Du, dass sie bauen, was man ihnen vorgibt? Müssten wir bereits mit zig Details herantanzen?Nein ich meine eure Vorstellungen. Wenn du jetzt sagst, ich möchte bei der nächsten Ausstellung des Kleintierzuchtverbandes Hintertupfing mit einem zweistöckigen Messestand auftauchen, dann werden die dir das bauen. Ob das bei der Messe nötig ist, musst du entscheiden:)Hättest du mehr Zeit, könnte man natürlich auch ein externes Designbüro beauftragen und dann den Messestand genau nach diesen Plänen bauen lassen. Aber bis Mai ist ja nicht mehr allzu lange Zeit.Ist denn da schon irgendwas auf Schiene oder sind das immer noch lose Vorstellungen?Langsam sollte man auf die Tube drücken:)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "planingkoala",
      "created_time": "January 13, 2023, 06:23:45 PM",
      "body": "OK, da sind wir, glaube ich, aneinander vorbeigerannt. Wobei ich mich vermutlich missverständlich ausgedrückt habe. Ich meinte es so, ob man mit konkreten Vorstellungen herantanzen muss oder ob Eckdaten ausreichen. Allerdings gibt es mittlerweile ein Update dazu… Mein direkter Vorgesetzter hat in der Vorwoche mittels Formular Kontakt aufgenommen und der Messebauer konnte einen Termin einschieben. Es sieht so aus, als ob sich das ausgehen sollte. Andernfalls könnten wir immer noch zuerst an anderen Messen teilnehmen. Das Anpassen sollte, wenn ich das richtig verstanden habe, zügig laufen, oder?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hackelchen",
      "created_time": "January 13, 2023, 10:44:27 PM",
      "body": "Hallo,Ich durfte in meiner beruflichen Laufbahn schon etliche Messestände begleiten und mit Veranstaltungstechnik ausstatten.Das was Ihr auf der Website der Messe bekommt ist Ware von der „Stange“Wenn Ihr was individuelles wollt, müsst Ihr einen unabhängigen Messebauer ansprechen.Lüco Messebau aus Hilden, Mebau, Blömers, Display Messebau aus Essen wären lokale Empfehlungen meinerseits.Aber ohne entsprechendes Konzept hinter dem Auftritt und geeigneten Personen die gezielt Leads vor Ort sammeln, denen man im Nachgang natürlich nachfassen muss, ist es reines Geld verbrennen…",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fretum",
      "created_time": "January 17, 2023, 09:55:32 AM",
      "body": "Quote from: planingkoala on January 13, 2023, 06:23:45 PM Ich meinte es so, ob man mit konkreten Vorstellungen herantanzen muss oder ob Eckdaten ausreichen. Da reichen mal ein paar Vorstellungen. Genaue Daten vom Messeplatz wirst du ja auch noch nicht haben oder?Am Anfang bespricht man aus was für einer Branche man kommt, auf welchen Messen mal sein möchte, was man sich vorstellt, was der Messestand zu bieten haben soll,...Das sollte mal ausreichen. Vielleicht noch ein paar Logos eurer Firma mitnehmen/schicken. Dann kann man das Design daran anpassen. Da sollte es ja einen gewissen Wiedererkennungswert geben.Quote from: Hackelchen on January 13, 2023, 10:44:27 PMAber ohne entsprechendes Konzept hinter dem Auftritt und geeigneten Personen die gezielt Leads vor Ort sammeln, denen man im Nachgang natürlich nachfassen muss, ist es reines Geld verbrennen…Denke auch, das ist sehr wichtig. Sich mal eben auf eine Messe stellen ist etwas wenig. Man sollte da schon grobe Vorstellungen haben was man dort macht, was man vermitteln möchte und welche Personen das auch rüberbringen können. Da wird es auch einen Plan brauchen, eventuell Schulungen oder zumindest Vorbereitungen.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "planingkoala",
      "created_time": "January 17, 2023, 06:06:39 PM",
      "body": "@Hackelchen: Vielen Dank für Deine Rückmeldung und für die Erklärungen! Dann hatte ich richtig vermutet, dass dieser Konfigurator für uns keine passende Option ist. Essen ist bedauerlicherweise für uns weit entfernt oder würdest Du sagen, dass die Nähe zum Veranstaltungsort der ersten Messe wichtiger ist? Und ja, wir betreiben bereits Brainstorming zum Konzept und den anderen Punkten, die diesbezüglich zu erledigen sind. @Fretum nein, wir haben noch genauen Daten. Auf jeden Fall bin ich überrascht und erleichtert, dass diese Infos ausreichen. Kann man sich aber auch im Nachhinein gesehen für die zusätzlichen Messen entscheiden?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fretum",
      "created_time": "January 30, 2023, 10:44:08 AM",
      "body": "Quote from: planingkoala on January 17, 2023, 06:06:39 PM@Fretum nein, wir haben noch genauen Daten. Auf jeden Fall bin ich überrascht und erleichtert, dass diese Infos ausreichen. Kann man sich aber auch im Nachhinein gesehen für die zusätzlichen Messen entscheiden?Ja sicher, da musst du jetzt nicht sofort alles angeben. Aber wieder wäre es wohl sehr angebracht nicht erst eine Woche vorher sich für eine Messe zu entscheiden. Die werden das dann ja auch hin transportieren müssen und werden auf- und abbauen müssen. Der Messebauer muss das ja auch planen. Also ein wenig sollte man da schon einen Plan haben. Wie man das macht, würde ich auch mit dem Messebauer absprechen. Je nachdem wie flexibel die sind.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "planingkoala",
      "created_time": "February 04, 2023, 08:38:46 PM",
      "body": "Vielen Dank für die weitere Rückmeldung! Ich befürchte, dass diesbezüglich nicht jeder so wie wir tickt, aber mir ist natürlich bewusst, dass man diesbezüglich nicht kurze Zeit vorher Bescheid geben darf. Außerdem weiß man doch üblicherweise mindestens einige Monate vorab, ob man an einer Messe teilnimmt oder nicht. Zudem ist mir schon klar, dass die Modalitäten vom Messebauer abhängen, aber wie steht es um etwaige Anpassungen?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fretum",
      "created_time": "February 06, 2023, 10:04:19 AM",
      "body": "Im Normalfall schon - du braucht ja auch einen Stellplatz auf der Messe, der wird einem schon einige Zeit vorher zugewiesen. Da erhält man dann auch die genauen Quadratmeter und die Abmessungen. Das braucht dann der Messebauer um den Stand anzupassen. Also schon alleine daher muss der Messebauer Bescheid wissen. Ist wohl ziemlich selten, dass man immer dieselbe Standgröße erhält. Das muss dann der Messebauer auch anpassen.Wenn man da jetzt nicht sagt, ich möchte nur einen Stand gebaut haben und den Rest mache ich - dann übernimmt im Grunde alles der Messebauer. Da muss man sich anschauen was alles enthalten ist. Vielleicht macht es einen Unterschied ob man den Stand nur kauft oder dann beim Messebauer alle Services in Anspruch nimmt (Transport, Anpassungen, Auf- und Abbau,....)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "planingkoala",
      "created_time": "February 08, 2023, 04:53:38 PM",
      "body": "Ja, wir uns war bereits bewusst, dass es ziemlich selten vorkommt, dass die Messeteilnehmer immer dieselbe Standgröße erhalten. Deswegen meinte ich eigentlich, inwiefern etwaige Anpassungen möglich sind. Und ich entschuldige mich für die Tatsache, dass ich mich offensichtlich missverständlich ausgedrückt habe. Ich habe nämlich die Tage gelesen, dass ein Schreiner einem Kunden einige Stände pro Jahr baut. Das wäre doch etwas zu kostspielig. Oder kommt so etwas seltener vor?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fretum",
      "created_time": "February 14, 2023, 10:56:30 AM",
      "body": "Selbst wenn die Größe gleich ist, die Anschlüsse sind nicht immer am selben Punkt oder man stellt neue Produkte vor etc. Da wird man kaum ohne Anpassungen durchkommen. Das ist wohl eher die Regel.Das ist wohl auch allen bewusst und deshalb macht man es gleich so, dass man da ohne große Probleme alles anpassen kann und es nicht viel Zeit benötigt.Würde schon sagen, es ist auch aus Kostengründen einfacher einen Messestand immer wieder zu verwenden. Außerdem ist es viel nachhaltiger und ressourcenschonender. Kann mir nicht vorstellen, dass es da Angebote gibt, die für jede Messe einen ganz neuen Stand bauen. Das kann sich ja schon alleine von der Zeit nicht ausgehen. Denke nicht, dass es das oft gibt. Bezweifle auch, dass es das überhaupt gibt. Es wird sicherlich Unterschiede zwischen den Messebauern und deren Angebot geben (welches System verwendet wird, on man auch das Design übernimmt, ob man den Messestand einlagern kann,...) aber ich kann mir nicht vorstellen, dass man da für einen Kunden immer neue Messestände baut. Sehe da keine Vorteile und es ist einfach nicht sinnvoll.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptocorn0101",
      "created_time": "February 18, 2023, 09:52:20 PM",
      "body": "Hey, ich bin gerade beim Stöbern im Forum zufällig auf diesen Thread gestoßen. Ich habe zwar keine Erfahrungen als Aussteller, aber ich habe schon etliche Messen besucht – privat und auch beruflich. In erster Linie sollte natürlich das Produkt das präsentiert wird zählen, aber wenn das rundherum, also der Messestand schon von weitem Langweilig aussieht, weil er nur ein 0815 Design hat, kommt man als Besucher oft nicht einmal in die Nähe des Produkts. Ich habe meistens einige Stände konkret angesteuert, von denen ich vorher schon wusste, dass ich sie besuchen will, aber am Weg zu diesen bin ich immer bei noch einigen stehen geblieben, die mir besonders aufgefallen sind. Und das sind im Normalfall die Stände, die etwas Besonderes ausstrahlen und individuell daherkommen. Also bei mir als Messebesucher hat ein gutes Design des Messestands bisher immer gewirkt und mich angezogen^^",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "planingkoala",
      "created_time": "February 20, 2023, 08:59:53 PM",
      "body": "@Fretum: OK, wenn der Hauptunterschied in den Anschlüssen liegen sollte, will ich doch davon ausgehen, dass sich der damit verbundene Aufwand doch sehr in Grenzen hält. Trotzdem werden wir darauf, dass wir den Syma Mitarbeitern immer rechtzeitig Bescheid geben, achten. Schließlich ist es doch auch in unserem Interesse, denn so können wir das Ganze entspannter angehen. Ich konnte mir ebenfalls nicht vorstellen, dass jemand für mehr oder weniger jede Messe einen Stand bauen lässt. Das gibt es wirklich, weil es sich um einen Erfahrungsbericht gehandelt hat, aber ich kann ich vorstellen, dass das Einzelfälle sind. @cryptocorn0101: Meines Erachtens funktioniert das gewissermaßen wie bei Geschäften… Bei einem 0815 Aussehen, geht man nur dann, wenn man gezielt hingegangen ist oder Produkte in der Auslage aufgefallen sind rein. Jene mit einem besonderen Ladenschild stechen wiederum mehr ins Auge. Außerdem ist das auf Messen noch wichtiger, weil es uns zusätzlich um B2B Kontakte geht.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fretum",
      "created_time": "February 23, 2023, 10:57:41 AM",
      "body": "Quote from: cryptocorn0101 on February 18, 2023, 09:52:20 PMHey, ich bin gerade beim Stöbern im Forum zufällig auf diesen Thread gestoßen. Ich habe zwar keine Erfahrungen als Aussteller, aber ich habe schon etliche Messen besucht – privat und auch beruflich. In erster Linie sollte natürlich das Produkt das präsentiert wird zählen, aber wenn das rundherum, also der Messestand schon von weitem Langweilig aussieht, weil er nur ein 0815 Design hat, kommt man als Besucher oft nicht einmal in die Nähe des Produkts. Ich habe meistens einige Stände konkret angesteuert, von denen ich vorher schon wusste, dass ich sie besuchen will, aber am Weg zu diesen bin ich immer bei noch einigen stehen geblieben, die mir besonders aufgefallen sind. Und das sind im Normalfall die Stände, die etwas Besonderes ausstrahlen und individuell daherkommen. Also bei mir als Messebesucher hat ein gutes Design des Messestands bisher immer gewirkt und mich angezogen^^Da hast du schon recht und ich würde da natürlich auch drauf schauen. Finde aber da gibt es einen Unterschied welche Messe es ist, um welche Branche es ist handelt und ob die Messe auf B2B oder B2C ausgelegt ist. Wenn das jetzt beispielsweise eine Fachmesse für die Industrie ist, dann geht dort eh keiner hin und lasst sich von irgendwelchen Werbefoldern beeindrucken. Da weiß man dann ganz genau was man haben will, wer das anbietet und dann geht es vor Ort eher nur um das Verhandeln.Aber generell gebe ich dir natürlich recht. Die Außendarstellung ist sehr wichtig um Leute anzusprechen.Quote from: planingkoala on February 20, 2023, 08:59:53 PM@Fretum: OK, wenn der Hauptunterschied in den Anschlüssen liegen sollte, will ich doch davon ausgehen, dass sich der damit verbundene Aufwand doch sehr in Grenzen hält. Trotzdem werden wir darauf, dass wir den Syma Mitarbeitern immer rechtzeitig Bescheid geben, achten.  Nicht nur die Anschlüsse sind anders. Die Größe der Standfläche wird variieren - man bekommt nicht auf jeder Messe immer dieselbe Größe gestellt. Wenn man in verschiedenen Ländern ausstellen sollte, gibt es dort bestimmt auch unterschiedliche Regelungen (Brandschutz,...). Das muss dann auch beachtet werden.Das klingt leicht, man darf aber nicht vergessen, in der Regel ist man ja auf mehreren messen vertreten. Wenn da gerade Saison ist für das Messethema dann ist man auch jede zweite Woche woanders. heißt für den Messebauer: Abbauen auf der einen messe, Transport zum Unternehmen, dort umbauen, Transport zur nächsten messe und wieder aufbauen. Und man kann wohl davon ausgehen, dass der jeweilige Messebauer nicht nur einen Kunden hat:) Also dann ist es wohl nicht mehr so einfach und der Aufwand ist doch entsprechend hoch.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}