{
  "id": "topic_5458451",
  "title": "Beparanf",
  "author": "Beparanf",
  "created_time": "July 03, 2023, 04:24:29 PM",
  "content": "I have this kind of gambling scenario that I’m always experiencing when I’m gambling. Whenever I use bankroll that is close to 00 like 80, 180, 290, 360 and so on always result to a lose in the end. It’s very hard for me to surpass the nearest 00’ milestone no matter how hard I try on betting slow or quick. I knew the problem is I’m rushing to achieve that goal to have a closure that makes me struggle on the game instead of focusing on being happy to play the game.FYI, I’m always winning easily above 00 target that I’m struggling to get from the above scenario when I start my bankroll far lower from 00 balance like 30, 40,130, 330 and so on. I hope that you get I mean on my balance description.Do you have this kind of same scenario that puts you on an infinite loop when you are gambling as in you don’t move forward at all?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5458451",
  "comments": [
    {
      "author": "ralle14",
      "created_time": "July 04, 2023, 01:15:41 AM",
      "body": "I was so confused about the scenario you've explained, but after reading it multiple times, I realized it's about rounding up the numbers or similar to it. My cursed scenarios recently are the free bets and stablecoins if i'm going to use stablecoins to gamble, I already know that i'm not going to make any withdrawals soon because i've never won big enough while i've had no problem winning when i'm using other coins. And with free bets, i've wasted them so many times because I keep making parlays that are always one match away from winning.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kakmakr",
      "created_time": "July 04, 2023, 05:58:49 AM",
      "body": "Well, we all know the saying that says ==> \"The house always wins\" ... and that is true for any bet size or balance that you are using to gamble. I have tried betting small amounts and building it with every Jackpot that I hit and I have tried betting high amounts and gradually reducing the bet size, but no matter what strategy I use... my balance eventually turn to zero.  You might have perceived that a higher betting balance gives you better results, but I think it just extends the inevitable outcome... which is a zero balance.  (A higher bet size just takes longer)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "piebeyb",
      "created_time": "July 04, 2023, 06:36:06 AM",
      "body": "Maybe many of us use scenarios and strategies to beat the casino, but keep in mind that we will not be able to win against the house forever, just watch, you may even be lucky for a few moments but you will lose in a row when you have an unlucky time, we all know that every scenario and any strategy the dealer will know how we play.In the end, we all agree that the house will always win and the dealer will take your money. After all, whatever scenario we use depends on how much capital we have, regardless of what scenario and strategy we use, it is difficult to win against the house and the dealer. i have tried any scenario even any strategy but i realized that to win against the casino is we have to know how we can control ourselves. stop when we win.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pakhitheboss",
      "created_time": "July 04, 2023, 06:51:20 AM",
      "body": "I can relate to what you are saying; none of the strategies or scenarios work out in the end. The house is always smarter than you can imagine. On various occasions, I have tried multiple strategies, like taking a half-minute break after every minute. Initially, it seemed profitable, but after some time, I started losing my profits and ended up with nothing.Some days may be profitable, but most days you ultimately end up with nothing. No matter what strategy you employ to defeat it, the house always wins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tusandii",
      "created_time": "July 04, 2023, 06:55:51 AM",
      "body": "Quote from: Beparanf on July 03, 2023, 04:24:29 PM-snip-Do you have this kind of same scenario that puts you on an infinite loop when you are gambling as in you don’t move forward at all?I don't really understand your betting scenario, but if you keep putting yourself in unlimited rounds, we can lose all the balance stored in the bankroll due to repeated losses.I myself can say that I gambling is quite active, but I always weigh every bet with the balance I have in order to avoid constant losses.Gambling is just a place to entertain ourselves, so we really have to be able to minimize losses, not think about how to win again.Try changing your gambling scenario a little so that you can produce wins with smaller losses.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "swogerino",
      "created_time": "July 04, 2023, 07:15:50 AM",
      "body": "Quote from: Beparanf on July 03, 2023, 04:24:29 PMI have this kind of gambling scenario that I’m always experiencing when I’m gambling. Whenever I use bankroll that is close to 00 like 80, 180, 290, 360 and so on always result to a lose in the end. It’s very hard for me to surpass the nearest 00’ milestone no matter how hard I try on betting slow or quick. I knew the problem is I’m rushing to achieve that goal to have a closure that makes me struggle on the game instead of focusing on being happy to play the game.FYI, I’m always winning easily above 00 target that I’m struggling to get from the above scenario when I start my bankroll far lower from 00 balance like 30, 40,130, 330 and so on. I hope that you get I mean on my balance description.Do you have this kind of same scenario that puts you on an infinite loop when you are gambling as in you don’t move forward at all?That is not a scenario,more is a belief of you,the sessions are completely independent of each other and the slot machines have a huge variance and extreme volatility in most cases that is why you can pass one 0 or two 00 but then you are stuck as you can't keep winning in the long run,so this scenario if you continue to chase winning past many zeros you will never get there as slots are programmed to take away your money in a slow way otherwise if they took it instantly you would quit immediately.This scenario is common to all of us who play slots so you are not the only one.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "danherbias07",
      "created_time": "July 04, 2023, 07:19:12 AM",
      "body": "I feel you, bro. It happened to me every week because I only do it weekly. Here is my case, I got like $30 for example, and try as much as I can to just increase my wager amount to get a VIP rank but there will always be a time when you feel so down once the money goes below $5-10. I have the feeling that I won't be going back to my first balance anymore or if I did, it will take me days to achieve it. Honestly, that is what always happens. Whenever I am low on my wallet I am sure I just have minutes left to play because I have never seen myself in a position where I get back x10 to x20 of my balance. Never happened. My max last week was x4 my balance but it was taken quickly as I also increased the betting amount after I saw how much money I had. Greed.I think there must be a stop once we make profits even if it's just a low amount. Take a rest too, just like when we are losing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Blitzboy",
      "created_time": "July 04, 2023, 11:24:24 AM",
      "body": "Possible psychological phenomena explaining your experience. The brain is wired to look for patterns even if they don't exist. Because your mind associates losing with balances reaching multiples of 100, it's possible that this fear is impacting your performance.One useful piece of advice is to stop worrying about specific numbers and instead concentrate on developing sound betting habits and managing your money. Keep in mind that the results of one roll should have no bearing on the results of another, as dice are statistically independent.I cant claim I've been in the same situation as you when gaming, but I can say that I've been trapped in cycles before. The trick is to not allow these assumptions govern how we play. Maintaining a level head is crucial, rather than losing sight of the big picture in favor of arbitrary numerical goals.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kelvinid",
      "created_time": "July 04, 2023, 11:27:39 AM",
      "body": "What I understand from your statement is that you have more losing experiences when your bankroll is close to zero. Well, my friend, you are not alone in this. It could simply be a psychological breakdown because we tend to become emotional when we see that we are losing money. As a result, sometimes we tend to neglect proper bankroll management as we want to get back our losses fast.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hyudien",
      "created_time": "July 04, 2023, 12:42:00 PM",
      "body": "Quote from: Kakmakr on July 04, 2023, 05:58:49 AMWell, we all know the saying that says ==> \"The house always wins\" ... and that is true for any bet size or balance that you are using to gamble. I have tried betting small amounts and building it with every Jackpot that I hit and I have tried betting high amounts and gradually reducing the bet size, but no matter what strategy I use... my balance eventually turn to zero.  Agree, when the casino provides an opening for our bets and manages to make a profit, in the end the gambler's job is to get out of the casino and withdraw the winnings. Increasing the bet is quite tempting, but after achieving a 100% win, there is no solution other than cash out. Usually the gamblers that the OP described above are still having a hard time controlling their mentality, well, I mean mentally, when faced with an apparently bigger profit, in reality the balance will end at zero.What we need to emphasize is knowing how to stop after a win and enjoy that win outside the casino.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sim_card",
      "created_time": "July 04, 2023, 01:09:25 PM",
      "body": "Quote from: Beparanf on July 03, 2023, 04:24:29 PMDo you have this kind of same scenario that puts you on an infinite loop when you are gambling as in you don’t move forward at all?Mine is on sportbet in football. I am fine when I bet on few games,I make profits but very little. Instead of me to continue with the short slips for steady profit,I will go bet on long slip games that most times I always loss in it and I will be worried. Sometimes it is the last game that does cut my slip and there will be an option to cash out but my greed wouldn't allow me cash out because I will feel that my strategy is working. We shouldn't allow our emotions to control us when gambling and we should gamble at ease.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Plaguedeath",
      "created_time": "July 04, 2023, 01:27:29 PM",
      "body": "That's really normal, the longer you bet, the longer you will lose your money. This is because every luck based games always have house edge, so you will lose in the long run. You shouldn't think you will quit after you rounded your bankroll, just quit after you think you've gamble too long or too much. You, as a gambler need to have a good self control, don't let the casino control you, but you must control the casino.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "davis196",
      "created_time": "July 04, 2023, 01:35:12 PM",
      "body": "Quote from: Beparanf on July 03, 2023, 04:24:29 PMI have this kind of gambling scenario that I’m always experiencing when I’m gambling. Whenever I use bankroll that is close to 00 like 80, 180, 290, 360 and so on always result to a lose in the end. It’s very hard for me to surpass the nearest 00’ milestone no matter how hard I try on betting slow or quick. I knew the problem is I’m rushing to achieve that goal to have a closure that makes me struggle on the game instead of focusing on being happy to play the game.FYI, I’m always winning easily above 00 target that I’m struggling to get from the above scenario when I start my bankroll far lower from 00 balance like 30, 40,130, 330 and so on. I hope that you get I mean on my balance description.Do you have this kind of same scenario that puts you on an infinite loop when you are gambling as in you don’t move forward at all?Gambling becomes a pain in the ass, when you set specific goals to win X amount of money or to achieve an X,XXX amount of bankroll.Setting such goals makes everything more difficult, because you are losing your patience and sometimes you increase the risk in order to reach that goal. This is a bad move, most of the time. I would never try to reach a specific bankroll. I just gamble when I want to have some fun in my spare time. By the way, the casino you are using might have some rigged games. If this pattern(losing, when your bankroll is close to 00) repeats multiple times, this becomes a little bit suspicious. Why not try another casino and see if this pattern repeats there?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mauser",
      "created_time": "July 04, 2023, 02:22:03 PM",
      "body": "Quote from: Beparanf on July 03, 2023, 04:24:29 PMDo you have this kind of same scenario that puts you on an infinite loop when you are gambling as in you don’t move forward at all?That sounds a bit superstitious that there are hard caps at which you lose more. It's not like the casino knows your goals and wants to trick you in to spending more money to reach that goal. Like you analyzed yourself it's probably coming from your own mind that becomes more reckless in trying to achieve your goals. I had similar experiences in the past where I tried to reach certain profit goals, only to end up losing more money than I hoped for. My mistake was to set unrealistic goals for myself that took too much risk to achieve. In the end I changed my approach to gambling, instead of having fixed profit goals I now have fixed weekly budgets to gamble with. This makes it easier for me to control my maximum losses and whenever I make a big profit I take it out to stick to my fixed budget. Focusing on the risk instead of the profits is the exact opposite from your approach and helped me a lot to control my bankroll.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cryptomultiplier",
      "created_time": "July 04, 2023, 02:30:36 PM",
      "body": "I have never had to experience such infinite loop in gambling because I would rather bet on matches or live games than use the method such as the one you use when gambling with casinos. I do understand the frustrating moment this can cause and can only say that's how it feels until you just learn to play or gamble more for the fun with restricted tries, than trying to force the winning number to show up. Be patient, be watchful mostly about how much you are spending, and also it would be better to keep your expectations a bit lower, inorder to avoid evoking emotions of disappointment and failure.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Slow death",
      "created_time": "July 04, 2023, 02:49:03 PM",
      "body": "in my particular case in these times when all major leagues are stopped I have been trying to place bets in leagues where I don't know their players, but I confess that I am facing a very difficult scenario, for example when I put 10$ in my bank and start to playing, I keep winning 2x my bankroll and I keep playing, what I see next is that my bankroll starts to drop a lot to the point of reaching zero, the teams on which I place bets start by winning the game, the 70 minutes of the game while they scored 2 goals and when they reach the 88th minute of the game I start to celebrate, when I go out for a bit and returnI see something unbelievable, the team I bet on suffers 2 goals and the game is tied and I lose a bet, man I keep thinking: what the fuck just happened? and that the difference between the two teams is very big and even so when I see the final result of the game I am shocked, and with that begins a losing streak and I lose all my bankroll, sometimes it even makes me laugh because even the my monthly bonus all of it I lose betting on these strange leaguesThe time has come for me to say to myself that the money I deposit and bet on these strange leagues is already lost money and I don't expect more profits, even when I manage to get 2x my bankroll I don't celebrate because I soon know that I will lose everything. I realized that it is very difficult or mission impossible to bet on leagues I don't know and expect some profit. so by that I mean that when you lose a lot of bankroll then you need to stop thinking about why this is happening, in my case as I said before, it's something that I know the reason for, but you need to know the reason for changing your game or strategy",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "KTChampions",
      "created_time": "July 04, 2023, 03:09:16 PM",
      "body": "Quote from: Beparanf on July 03, 2023, 04:24:29 PMI have this kind of gambling scenario that I’m always experiencing when I’m gambling. Whenever I use bankroll that is close to 00 like 80, 180, 290, 360 and so on always result to a lose in the end. It’s very hard for me to surpass the nearest 00’ milestone no matter how hard I try on betting slow or quick. I knew the problem is I’m rushing to achieve that goal to have a closure that makes me struggle on the game instead of focusing on being happy to play the game.FYI, I’m always winning easily above 00 target that I’m struggling to get from the above scenario when I start my bankroll far lower from 00 balance like 30, 40,130, 330 and so on. I hope that you get I mean on my balance description.Do you have this kind of same scenario that puts you on an infinite loop when you are gambling as in you don’t move forward at all?Sometimes I notice these \"patterns\" when I place bets, but I am aware that this is a cognitive distortion. Our brain looks for patterns where they don't even exist. And in the piggy bank of the \"existence\" of the pattern, we put all the convenient facts, and we do not notice the facts that contradict the \"pattern\" that we discovered. I think if you objectively calculate all the results, then the ups/downs of your bankroll will be about the same no matter what numbers you start with.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yatsan",
      "created_time": "July 04, 2023, 03:20:05 PM",
      "body": "Not on the bet I guess but just frequent coincidence  it just so happened that you are noticing it but there's really no such pattern. You might just be having a bad day or week or even month, and it is a normal thing especially if you are a daily gambler. There'll be no consistency for sure; try to do that for a week or month and for sure things would change. 'coz if it won't then there's somthing wrong with the platform you are playing at. If it is a pure luck based game you are playing, you'd see some of pattern like things but as the name suggests, it is just one's fate which is on the line. Just a tip is to avoid betting with frustration just because you lose often. Much better to atleast take a pause if it is not your day.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o48o",
      "created_time": "July 04, 2023, 03:59:47 PM",
      "body": "Quote from: Blitzboy on July 04, 2023, 11:24:24 AMPossible psychological phenomena explaining your experience. The brain is wired to look for patterns even if they don't exist. Because your mind associates losing with balances reaching multiples of 100, it's possible that this fear is impacting your performance.One useful piece of advice is to stop worrying about specific numbers and instead concentrate on developing sound betting habits and managing your money. Keep in mind that the results of one roll should have no bearing on the results of another, as dice are statistically independent.I cant claim I've been in the same situation as you when gaming, but I can say that I've been trapped in cycles before. The trick is to not allow these assumptions govern how we play. Maintaining a level head is crucial, rather than losing sight of the big picture in favor of arbitrary numerical goals.Correct answer, but it's easier said than done. People seen patterns because they are wired to do that. Trying to intellectualize your process from sometimes unconscious patterns is challenging, especially when you don't understand why are you seeing patterns that aren't there in the first place.Also it seeing those patterns fills the need of control, which you often don't have for outcome.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}