{
  "id": "topic_5458472",
  "title": "ps34",
  "author": "ps34",
  "created_time": "July 03, 2023, 07:55:26 PM",
  "content": "Hello can someone contact me by pm  with good merit on his account ? proposal and you can get something out of this (money)   contact me !",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5458472",
  "comments": [
    {
      "author": "Timelord2o67",
      "created_time": "July 03, 2023, 09:30:17 PM",
      "body": "Quote from: ps34 on July 03, 2023, 07:55:26 PMHello can someone contact me by pm  with good merit on his account ? proposal and you can get something out of this (money)   contact me ! Please, keep talking...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitcoin_Arena",
      "created_time": "July 03, 2023, 09:58:11 PM",
      "body": "Wanna buy some merits, farm accounts or something like that so that you can continue trying to make scam loan requests or maybe trolling?  ps34 you are really something. I don't know how old you are, but I think I can guess.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Freedom4All",
      "created_time": "July 03, 2023, 10:00:12 PM",
      "body": "No idea what´s going on here but I have merit I see",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ps34",
      "created_time": "July 03, 2023, 10:04:05 PM",
      "body": "haha freedom thanks    but i would believe 2 is not the correct number i'm afraid still thanks for letting me knowi'm also  38 years old thanks for your intrest  bitcoin_Arenaalso is it possible to buy merit here on forum? :|",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LTU_btc",
      "created_time": "July 03, 2023, 10:07:30 PM",
      "body": "I'm wondering how seriously you're asking and how you imagine everything would look. After you made this public request, someone sending merits to you must be simply stupid. But well, after looking at your trust feedbacks, it looks that you have nothing to lose.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "STT",
      "created_time": "July 03, 2023, 10:11:33 PM",
      "body": "You can gain merit by writing a post worth reading, something that contributes.  Thats the idea behind that system, if you just wave money in the air its probably going to upset some people.  They want a newbie to join and be part of the forum, also read the rules to answer your own questions.When I first joined we could only post in the beginners section, think that was the rule.   There is somebody asking the same question as you there, 1st page: https://bitcointalk.org/index.php?board=39.0",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Eh Moo Nah",
      "created_time": "July 03, 2023, 10:59:41 PM",
      "body": "Quote from: ps34 on July 03, 2023, 10:04:05 PMalso is it possible to buy merit here on forum? :|   Yes it is Possible and that's gonna be 1 bitcoin for 1 merit  lol. not banned, suspended or Restricted? you are the Luckiest Person here I guess,",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "noorman0",
      "created_time": "July 03, 2023, 11:01:04 PM",
      "body": "Quote from: ps34 on July 03, 2023, 10:04:05 PMalso is it possible to buy merit here on forum? :|   Your money may not be accepted for spending in other countries.With the failed loan application attempts, I doubt even you have the money. Anyone who wants to break forum norms to engage in merit trading, be careful with this guy's offer.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "robelneo",
      "created_time": "July 04, 2023, 02:48:20 AM",
      "body": "Quote from: ps34 on July 03, 2023, 10:04:05 PMhaha freedom thanks    but i would believe 2 is not the correct number i'm afraid still thanks for letting me knowi'm also  38 years old thanks for your intrest  bitcoin_Arenaalso is it possible to buy merit here on forum? :|   For an account with a well-supported flag and negative feedback and ignorant of the rules of this forum, you should stop posting and giving offers here, no one here will take you seriously and you don't need merits to change how people view or perceive your account, you're just wasting your money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptoHeadlineNews",
      "created_time": "July 04, 2023, 07:16:52 AM",
      "body": "Quote from: ps34 on July 03, 2023, 07:55:26 PMHello can someone contact me by pm  with good merit on his account ? proposal and you can get something out of this (money)   contact me ! You just can't be serious with this very statement you just made above, because how sure are you that after buying these merits, which I guess you plan of doing you won't violate one of the forum rules (i.e plagiarism or use of A.I) and then still have your account banned? Because as a concerned forum member, I will advise you to go and study how this forum works and stop looking for shortcuts, because only if had you utilize your 3yrs spent on this forum well, by now you should have been a Legendary, Hero or at least a Senior forum member by now. Moreover, It's never too late.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "examplens",
      "created_time": "July 04, 2023, 08:45:36 AM",
      "body": "Quote from: ps34 on July 03, 2023, 10:04:05 PMi'm also  38 years old thanks for your intrest  bitcoin_ArenaI would never say that you are that old, you act like you are 14 years old.Quote from: ps34 on July 03, 2023, 10:04:05 PMalso is it possible to buy merit here on forum? :|   So in that case, you need a loan to buy merit, in order to be eligible to get a loan.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ps34",
      "created_time": "July 04, 2023, 09:37:30 AM",
      "body": "thanks for all the help well i also know that with the merit i'm not going to get the loan  as i have negative trust still  so that would mean i would never get any loan  even if i tried contributing with the forum  and getting good merit so why bother right ?   shame really because all the negative trust is not backed up with proof  it's all because i contacted people or they told me i was a scammer (with no proof) i agree that contacting people was my mistake however i shouldn't be punished for that   in not getting any loan when i would contributed to the forum i'm a genuine person and if you really would like to help me   call me  on discord so we can talk there for anyone intrested",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "aioc",
      "created_time": "July 04, 2023, 10:35:10 AM",
      "body": "Quote from: ps34 on July 04, 2023, 09:37:30 AMi agree that contacting people was my mistake however i shouldn't be punished for that   in not getting any loan when i would contributed to the forum i'm a genuine person and if you really would like to help me   call me  on discord so we can talk there for anyone intrested You started on the wrong foot in this forum, you came here with the intention of getting a loan and treat us stupidly thinking that you can easily get a loan, I don't care if you're a genuine person you are getting this treatment because you never respect the rules of this forum, then you try to correct it by buying merits which a big violation, go away learn to respect, just go back when you know what respect means.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ps34",
      "created_time": "July 04, 2023, 10:40:08 AM",
      "body": "it was certainly not my intention to disrespect the forum or the rulesif that was the case i apologize for that if anyone wants to talk with me and is intrested in what i have to say  you can always contact me here on forum by pm  and i will give you contact details to reach me",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Timelord2o67",
      "created_time": "July 04, 2023, 10:58:30 AM",
      "body": "Run along kid.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "July 04, 2023, 12:32:53 PM",
      "body": "Quote from: ps34 on July 03, 2023, 10:04:05 PM~snip~also is it possible to buy merit here on forum? :|   You've been a member of the forum since the beginning of 2020 and haven't read the rules yet? If you did, then you'd know that just asking a question like this probably entails the possibility of someone leaving you negative feedback - unless you think it's normal to buy something that is not legally sold?Imagine if you used to get up in school in the middle of class and ask your teacher if you could buy a higher grade - how would it end?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gladitorcomeback",
      "created_time": "July 04, 2023, 12:51:15 PM",
      "body": "OP is asking for loan of 500€   and he is offering kyc documents. I have created thread in scam accusation and whole discussion we made in telegram. This user should be banned for posting https://bitcointalk.org/index.php?topic=5458566.new#new",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FatFork",
      "created_time": "July 04, 2023, 01:03:17 PM",
      "body": "Quote from: ps34 on July 03, 2023, 10:04:05 PMalso is it possible to buy merit here on forum? :|   For what purpose? On this forum, merit is all about putting in the effort and making meaningful contributions. You're talking about trying to fake your abilities or status, which could potentially mislead other members of the community. Mind if I ask why you're interested in doing that?Quote from: ps34 on July 03, 2023, 10:04:05 PMi'm also  38 years old thanks for your intrest  bitcoin_ArenaYou don't sound like a 38-year-old. When do you plan to grow up and start earning an honest living?Quote from: examplens on July 04, 2023, 08:45:36 AMSo in that case, you need a loan to buy merit, in order to be eligible to get a loan. Error 404: That statement doesn't compute in my data banks!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zanab247",
      "created_time": "July 04, 2023, 01:28:56 PM",
      "body": "Do you know you can get this merits you are trying to use money to get illegally with a week or month, if you can create or dedicate your time by reading some cryptocurrency books and improve in quality Post, i bet you, you will get more than 100 merits within a month. And you can use that money to invest in BTC to become a better person tomorrow.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}