{
  "id": "topic_5399135",
  "title": "Israelgogo",
  "author": "Israelgogo",
  "created_time": "May 18, 2022, 06:56:20 AM",
  "content": "Getting up and seeing a new day is a thing of joy ,it gives you hope to do more and be good at it ,it would have been worst yet it only getting better with new day as an opportunity to do better, We tend to complain alot for what we havent acheived yet we fail to realise or recognise how we have passed the stage we were ,our acheivement, our health, many are in the hospital bed ,many are less privilege, many are homeless,many cant feed ,yet we do not experience such and we are complaining.Tho the human mindset want more no matter how much more you have attained ,your hunger for success becomes high ,the more you earn the more problems you faced with.The dead only wish he was alive even as a poor more wuth more opportunities, yet it the end for him,The living wish to end his life forgetting that there is something called change and tranformation, it can visit at any time and it comes alot pf goodies,it just one deal that will rewrite the story.Many of this great men world richest once passed through one or hard times ,if they had giving up or ended it they wont have become what they are today.Think of greatness and be positive always ,keep trying onr day the story will change.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5399135",
  "comments": [
    {
      "author": "Sacrod",
      "created_time": "May 18, 2022, 11:10:24 AM",
      "body": "Sitting down complaining about things will make no difference until you come to the realization of the fact that you really need to do something. Opportunities do not always come to you, sometimes you have to go for it, chase your dreams and try something different or do things others have ventured to differently. You are the only one that can best encourage yourself, others can only try, you need personal motivation and keep going, all these struggles are part of your success story.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Valetudos",
      "created_time": "May 18, 2022, 08:54:22 PM",
      "body": "You can not think like that, you need action, go to your dreams and believe that everything will work out",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DeathAngel",
      "created_time": "May 19, 2022, 04:46:54 PM",
      "body": "We’re all entitled to have a bad day or two, feel sad etc. Trying to be positive mentally can really help though, there is always a positive to take from most bad situations. Starting your day well with a good breakfast & cup of coffee can go a long way. Be nice to others & treat them how you like to be treated yourself.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "RockBell",
      "created_time": "May 19, 2022, 07:28:35 PM",
      "body": "Waking up every day. Gives me the zeal to do more everyday that is hope.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sayakaaja",
      "created_time": "November 19, 2022, 02:29:55 PM",
      "body": "positive thoughts change everything. if we think too much we will never progress. out of fear that our shadows and negative thoughts will occur. This life must be filled with positivity and motivation in order to be able to fight, keep moving forward, and not give up easily.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Splashboard",
      "created_time": "November 21, 2022, 09:00:16 AM",
      "body": "Recent turn of events has pushed me out of my comfort zone. I realized how long I've been stuck in a rut--not growing, never changing. It does me no good if I keep regretting my actions in the past. The only thing one can ever really do is to keep moving forward.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Tallupooh",
      "created_time": "November 24, 2022, 01:49:30 PM",
      "body": "develop positive things and good wishes in your mind, it will make your heart calm. besides positive thinking, also accompanied by prayer and hard work. then, don't care too much about human judgement.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DeathAngel",
      "created_time": "November 25, 2022, 11:42:38 AM",
      "body": "Trying to be positive & stay upbeat is always going to give you the chance of living a happier & more successful life. Try & read the book by Rhonda Byrne, The Secret https://en.m.wikipedia.org/wiki/The_Secret_(Byrne_book)It suggests that good things come to you if you constantly stay positive. Some of it is a bit weird but I agree with the sentiment. Being miserable & negative will never do you any good.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitcoinBarrel",
      "created_time": "November 25, 2022, 01:23:53 PM",
      "body": "It's really easy to wake up excited for the day if you have something to look forward to. It doesn't matter if it's a hobby, project you're doing or a line or work that brings satisfaction. Sometimes it's hard to sleep when I'm working on something new that I enjoy, because I can't wait to get right back after it.The key is having goals and purpose. Working towards those goals everyday will build your excitement for life.Good luck!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mich",
      "created_time": "November 30, 2022, 06:42:26 AM",
      "body": "It is important to value the days we have alive. How life itself has brought us to the present moment. There should be no regrets or worry about how tomorrow will be.  It can take a single horrible moment to happen and the ability to enjoy life to the fullest will be suddenly taken away from us. I have an elder friend that had a bad relationship with her brother. In between the selfishness and hardheaded ways, they both have. She told me, that fifteen years went by without them speaking. One day, at the end of her brother’s life she finally realized that it was something so petty. Her brother was diagnosed with brain cancer. Her brother had instructed his immediate family to keep her away as much as possible. She only attends the funeral and to this day she is still mourning the death of her brother. She took for granted understanding that the passage of her life involves family first and communication is the key, which she continues today to still hold a grudge towards her brother’s wife and children. She refuses to talk to them or even acknowledge who they are.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Resident coin",
      "created_time": "December 14, 2022, 02:59:09 PM",
      "body": "Everyone needs to rise, no mater the situation because sitting down  one place doesn't help at allGet up ,share your problems with others,they say a problem shared is half solved, share ur problem and fine a solution",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}