{
  "id": "topic_5411056",
  "title": "manyice",
  "author": "manyice",
  "created_time": "August 24, 2022, 01:46:05 PM",
  "content": "Hey there! I'm looking for the crypto-related (defi, nft, metaverse, etc.) websites mass listing service. Main goal is to make 20-100 posts on most relevant websites/trackers. Listing fee would be paid by the project. If you can provide such service - dm me in Telegram @avt_contact, to discuss listing",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5411056",
  "comments": [
    {
      "author": "The Cryptovator",
      "created_time": "August 24, 2022, 07:06:39 PM",
      "body": "I don't think you need to take service for that. It's pretty simple to list sites on crypto-oriented sites. And it should manage by the team themselves as well. You will get a lot of such site lists from Google. Here is the list of a couple of popular crypto listing sites, QuoteCoinSniper WatcherGuruCNTokenBlockfolio ZapperDelta Zerion GemFinder CoinHunt CoinMooner CoinHunters CoinVote CoinScope CoinDiscovery FreshCoins RugFreeCoinsCoinsBet CoinAlpha CoinsGods GemHuntersCoinTopList 100xCoinHuntDEFIYieldNextCoinCoinFind CoinFairCoinListing PolyHunter TokenGems RivalFinance MemeCoins",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "manyice",
      "created_time": "August 25, 2022, 07:22:48 AM",
      "body": "Quote from: The Cryptovator on August 24, 2022, 07:06:39 PMI don't think you need to take service for that. It's pretty simple to list sites on crypto-oriented sites. And it should manage by the team themselves as well. You will get a lot of such site lists from Google. Here is the list of a couple of popular crypto listing sites, QuoteCoinSniper WatcherGuruCNTokenBlockfolio ZapperDelta Zerion GemFinder CoinHunt CoinMooner CoinHunters CoinVote CoinScope CoinDiscovery FreshCoins RugFreeCoinsCoinsBet CoinAlpha CoinsGods GemHuntersCoinTopList 100xCoinHuntDEFIYieldNextCoinCoinFind CoinFairCoinListing PolyHunter TokenGems RivalFinance MemeCoinsThank You sooooooo much for this info! We'll definitely check this sites, thanks!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}