{
  "id": "topic_5423192",
  "title": "borovichok",
  "author": "borovichok",
  "created_time": "November 26, 2022, 12:34:04 AMLast edit: November 30, 2022, 04:25:25 PM by borovichok",
  "content": "For those of you using your bitcoin in a dishonest way, receiving coins from scammers, buying stolen funds, participating in illegal p2p or illegal business its just a matter of time, your safety depends on your customers safety If one of your customers gets caught, the authorities may be able to use your identity and the ownership history of all your coins to identify you. Your anonymity depends on the person you sell your goods to, as well as who you buy from you too. To be anonymous, you must never have links between your Bitcoin addresses, and anything associated with your real-life identity (name, address, and picture) (KYC) but how many of you can say you haven't done KYC at some point. your anonymity depends on who you buy from or sell your coin to, know who you buy from and who you sell to. bitcoin is a micropayment it wasn't created to make you rich its only gives you freedom to be responsible to your transactions.When you spend/send coins, they usually go to someone you know or someone that knows you more. Each interaction with the blockchain network can reveal information about you, so be mindful of how you trade your coins. all our transactions are open to the public",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5423192",
  "comments": [
    {
      "author": "Darker45",
      "created_time": "November 26, 2022, 01:46:11 AM",
      "body": "It's for certain that most users do not really ensure that they are 100% private and their transactions untraceable. For one, many of us have actually undergone KYC at one point. We also reuse addresses, even post them publicly, linking them with accounts in social media, forums, emails, and so on. Also, how many of us are actually making sure our computer's IP address is hidden? How many of us are actually using different wallets for different transactions and delete them right after? How many of us are actually running our own nodes to improve our privacy? How many of us are mixing our Bitcoin before we send them to somebody else?I'm sure only very few.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Despairo",
      "created_time": "November 26, 2022, 02:55:02 AM",
      "body": "Don't worry about it, that's why Bitcoin mixer exist and anyone can use it to protect their privacy. You can't know the background of the buyer or seller, there's no way to verify it except you're a police that can track his criminal record. It doesn't make sense for us to know who's the person that we send our coins or bought it, no one will reveal his identity and it will make harder to sell our coins if we must know the person.Just use decentralized exchange e.g. Bisq to skip that and use reputable mixer e.g. Chipmixer.Quote from: RapTarX on February 06, 2019, 02:22:09 PM",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "borovichok",
      "created_time": "November 26, 2022, 09:04:29 AM",
      "body": "Quote from: Darker45 on November 26, 2022, 01:46:11 AM How many of us are mixing our Bitcoin before we send them to somebody else?I'm sure only very few. Quote from: Despairo on November 26, 2022, 02:55:02 AMDon't worry about it, that's why Bitcoin mixer exist and anyone can use it to protect their privacy. You can't know the background of the buyer or seller, there's no way to verify it except you're a police that can track his criminal record.You always need to make sure the mixer is trusted to not get you screwed, and you need many people mixing to make the system efficient, mixing is expensive, honesty is priceless. just use your coin in an honest way.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Despairo",
      "created_time": "November 27, 2022, 02:34:19 AM",
      "body": "Quote from: borovichok on November 26, 2022, 09:04:29 AMQuote from: Despairo on November 26, 2022, 02:55:02 AMDon't worry about it, that's why Bitcoin mixer exist and anyone can use it to protect their privacy. You can't know the background of the buyer or seller, there's no way to verify it except you're a police that can track his criminal record.You always need to make sure the mixer is trusted to not get you screwed, and you need many people mixing to make the system efficient, mixing is expensive, honesty is priceless. just use your coin in an honest way.I already mention it above! it's funny how you didn't read my full post and only quote few part of my post.Quote from: Despairo on November 26, 2022, 02:55:02 AMJust use decentralized exchange e.g. Bisq to skip that and use reputable mixer e.g. Chipmixer.Other mixers usually charge few % of fees and some of them ask for high minimum amount to mix the coin, but Chipmixer only ask you minimum of 0.001 BTC or $17 right now, it's really cheap.QuoteMinimum amount is 0.001 BTC with 0.001 BTC increments.Also Chipmixer doesn't ask you fees if you want to mix your coins, so there's no such \"mixing is expensive\" in Chipmixer [Tutorial] How To Mix bitcoin free . Chipmixer's volume is high, so you wouldn't need to worry about it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "khaled0111",
      "created_time": "November 27, 2022, 06:37:58 PM",
      "body": "I am not gonna lecture others on how or where to spend their coins but everyone must know that bitcoin is pseudonymous and all transactions are stored on the blockchain (public ledger). So, if you are not careful enough, any transaction you make can be linked to your real identity.For better anonymity, you should use mixers and/or private coins such as monero. It's really hard to reaching complete anonymity.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Accardo",
      "created_time": "November 27, 2022, 10:14:12 PM",
      "body": "Every cryptocurrency user should be a researcher, funny how a lot of people think that cryptocurrency is anonymous and untraceable, and comfortably use it for illicit business or scam actions. Without reading about cryptocurrency who will teach them the right method to remain anonymous. Hence, also, I've been pondering what happens to the millions of Kyc documents if an exchange gets hacked for instance the FTX hackers, did they get away with people's crucial document?Moreover, the mixer, even, FBI have got tools to trace mixed cryptocurrency. The right thing to say is, that crypto market have lots of careless investors both the retail investors too.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "witcher_sense",
      "created_time": "November 28, 2022, 03:27:33 AM",
      "body": "Quote from: borovichok on November 26, 2022, 12:34:04 AMFor those of you using your coin in a dishonest way, receiving coins from scammers, buying stolen funds, participating in illegal p2p or illegal business its just a matter of time, your safety depends on your customers safety If one of your customers gets caught, the authorities may be able to use your identity and the ownership history of all your coins to identify you. So, in your opinion, privacy and anonymity are only important for those making \"dishonest\" transactions, whereas other \"honest\" people don't need all that? I don't know, maybe you are living in an ideal world where honest people aren't getting chased by despotic authority just because they don't like what honest people say, what skin color they have or what religion they preach. You don't need to commit crimes to become a criminal in the eyes of the government. It is sometimes enough to merely exist. Privacy is an essential human right that needs to be actively protected and fought for. It is important for everyone, both criminal (you remember, wrong skin color) and non-criminal people, to practice good coin control in which KYCed and non-KYCed coins are kept and spent separately to avoid unnecessary identity leaks. Employing different privacy-enhancing tools and techniques may also help to prevent getting surveilled by undesirable entities, but you always need to remember that privacy is equally important for all people regardless of their level of honesty.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "noorman0",
      "created_time": "November 28, 2022, 04:53:05 AM",
      "body": "Quote from: borovichok on November 26, 2022, 09:04:29 AM-snip-honesty is priceless. just use your coin in an honest way.Good advice, but I don't know who this advice is intended for, the sender or the recipient? It doesn't eliminate the possibility that you are entangled. Evil cannot be eradicated in this world, even if you start with yourself.Everyone should be doing their best to stay out of illicit transactions as best they can, the fact is Blockchain can't distinguish tainted coins and you can't block such payments.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "_act_",
      "created_time": "November 28, 2022, 07:08:22 AM",
      "body": "Quote from: khaled0111 on November 27, 2022, 06:37:58 PMFor better anonymity, you should use mixers and/or private coins such as monero. It's really hard to reaching complete anonymity. It is hard to reach complete anonymity, but it is possible. If you do not depend and be using those centralized exchanges and custodial wallet, including instant exchanges, but focusing and using noncustodial wallet and decentralized exchanges, you are getting closer to privacy. If you then download your own blockchain and have your own node, you are increasing the possibility to privacy. Also using Tor instead of IP address.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}