{
  "id": "topic_5469295",
  "title": "Forever101",
  "author": "Forever101",
  "created_time": "October 05, 2023, 12:34:36 PM",
  "content": "If I no correct , senior men go correct me. I know the joy wey dey to dey post for where you belong as e dey make you feel comfortable but e good make we make something's clear for newbie for the forum. This matter na something wey Dem don discus before but base on say the mistake they come up again, I believe say make we still touch the matter.Naija board na one better board and the activities for the board this days dey make belle sweet person.  Senior men Dem don try their best to keep the board clean from every form of spam but the joy and happiness of newbie always dey blindfold Dem make them forget the rule. If u post topic and you come post another topic/thread wey dey related, that one na spam, Dem fit they desame place .If your reply dey too short, Dem no dey neccessary, this place no he social media for all those kind chat, that one self is considered spam.If you dey quote unnecessarily or your quote too dey long. When your quote they carry multiple quote , that one self dey more like sparm cause e dey always de hard to read am by others. If you dey respond to topic wey you know understand con dey talk out of point , even that one na spam.If others dey wey I no mention, Dem senior men go yarn them with us. If Dem correct you, abeg no see am as attack, na the right board you dey sooo. I no say everyboard like grow ihn account but make respect the rules. For this local board, I fit boastfully tell una say, people for here get love inside them, and for here, your account fit get the merit wey you wan hustle for but apply sense make we dey enjoy the board as usual",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5469295",
  "comments": [
    {
      "author": "Fivestar4everMVP",
      "created_time": "October 05, 2023, 12:59:07 PM",
      "body": "Insightful thought, but very sorry if i say that this is not needed, i mean this thread, there are no specified rules for the local board that is not already specified in the general forum rules and regulation, so any user breaking the rules in the local board is as well breaking the rules of the forum in general, spam is spam, no matter where it is posted, be it in the local board or global board.And let me also say that we dont correct a spam by spam, and what to i mean by this?..Quote from: Forever101 on October 05, 2023, 12:34:36 PMIf u post topic and you come post another topic/thread wey dey related, that one na spam, Dem fit they desame place .The user who created the thread, which brought about the idea of this, has already been told on the thread that what he or she did or is doing is completely wrong, and that he or she should lock the thread, there is no need creating another thread based on that same issue.QuoteIf your reply dey too short, Dem no dey neccessary, this place no he social media for all those kind chat, that one self is considered spam.This I disagree with, you don't have to type the page page of a book before you be considers as a quality poster, for all care, there are some one line replies that are so accurate and at the same time, so straight to the point.And do i need to tell you that many who type long walls of texts are mostly doing so to make sure their post or comment meet the requirement of what ever company they are promoting through signature ad campaign.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hatchy",
      "created_time": "October 05, 2023, 01:14:42 PM",
      "body": "Quote from: Forever101 on October 05, 2023, 12:34:36 PM~I agree with you,but not all your points listed are considered spamming. I want to add some more advice1. Newbies should always try to check if a similar topic already exists before creating a new one. Sometimes, you'll notice repeated topics on the board which to me is spamming and it's better to avoid that. You can easily scroll through older posts to check. This is why we need a moderator for our local board. I hope they give us one soon.2. While we've talked about this before, it's essential to create meaningful topics that are worth discussing. Just because the board doesn't frown that much to some unessesary thread doesn't mean you should post low-quality content. Some threads make no sense at all. Remember, this is a Bitcoin forum, not a place for daily updates on our personal lives. Let's engage in high-quality discussions.3. You should also remember that we're all one family here, and there's no need to get upset over anything or someone's reply. If someone's reply seems offensive, it's better to ignore it and not start unnecessary fights. We all want what's best for ourselves. Even if someone has a higher forum rank, we're all equal here, so don't feel unfairly treated if someone acts a bit out of line.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Antotena",
      "created_time": "October 05, 2023, 01:32:17 PM",
      "body": "I am even of the opinion of how people post and reply quotes, you know I have seen a lot of replies especially the newbies I’m not saying I’m not a newbie though, but the way people quotes I disturbing. When you want to go to post you don’t have to reply the whoel page of the entire content. Kindly take out D information that you don’t need and then leave the ones you want to reply, and then quote it and submit but when I see one line post that quote an entire page looks disturbing in the eye.I find challenging in this loacl is that there is no direction or probably is because we don’t have boards for appropriate discussion. I think it will be more better if that is discuss by the elders in this local board. Not as if I am good or too good in crypto related discussion, but it will be better if we regulate the kind of topics that are been dump in this our local becausesome is not encouraging. I mean somebody bring discussion how to make our life better, I just feel like the topic is kind of off-topic, there are many more of these  topics and threads in our local community that are supposed to be deleted as soon as they even posted, but I would like the elders to speak on this and not to be reporting some threads because the moderators that we have in this forum don’t understand pigin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Forever101",
      "created_time": "October 05, 2023, 01:47:57 PM",
      "body": "Quote from: Fivestar4everMVP on October 05, 2023, 12:59:07 PMThis I disagree with, you don't have to type the page page of a book before you be considers as a quality poster, for all care, there are some one line replies that are so accurate and at the same time, so straight to the point.And do i need to tell you that many who type long walls of texts are mostly doing so to make sure their post or comment meet the requirement of what ever company they are promoting through signature ad campaign. Well I no talk say, short reply but I say too short, if person write \"good\" as reply in a forum where we have moderator, that reply will deleted . So on this point I know what am saying. I do not think, this thread is ever  a spam, this is best way to get the information to others. I have seen in other board how people have complained about this things and one can learn from those things. I didn't write this by assumption.  I once said something about this, that we should try as much as possible to get the moderator to pin the rules for this local board. Not all newbie go round other boards not to talk about reading rules. We all have made such error at one point or the other.QuoteThe user who created the thread, which brought about the idea of this, has already been told on the thread that what he or she did or is doing is completely wrong, and that he or she should lock the thread, there is no need creating another thread based on that same issue.We should also get it clear, that even if correction have been made, there is no crime a creating a thread that can help keep the board clean or help others.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "promise444c5",
      "created_time": "October 05, 2023, 02:26:59 PM",
      "body": "Quote from: Forever101 on October 05, 2023, 01:47:57 PMWe should also get it clear, that even if correction have been made, there is no crime a creating a thread that can help keep the board clean or help others.  This  could be considered  spamming  or trying to farm merits  in some  boards ,which could also give you some bad reputations if it actually being termed to farming merits",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Forever101",
      "created_time": "October 05, 2023, 02:31:51 PM",
      "body": "Quote from: promise444c5 on October 05, 2023, 02:26:59 PMQuote from: Forever101 on October 05, 2023, 01:47:57 PMWe should also get it clear, that even if correction have been made, there is no crime a creating a thread that can help keep the board clean or help others.  This  could be considered  spamming  or trying to farm merits  in some  boards ,which could also give you some bad reputations if it actually being termed to farming merits Thank you for making it clear, no be say na merit person dey Hussle for , most time, I dey go offline for weeks . But as you talk am now, I get the point wey u dey make, na wetin make local board dey unique be that. One love",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Richbased",
      "created_time": "October 05, 2023, 03:03:18 PM",
      "body": "Quote from: Hatchy on October 05, 2023, 01:14:42 PMQuote from: Forever101 on October 05, 2023, 12:34:36 PM~I agree with you,but not all your points listed are considered spamming. I want to add some more advice1. Newbies should always try to check if a similar topic already exists before creating a new one. Sometimes, you'll notice repeated topics on the board which to me is spamming and it's better to avoid that.Yes you are right on going through topics before posting to avoid repeating same topic but you know sometimes there are so many topics on this forum and in the aspect of checking topics one might topic unknowingly and then still bring up same topic, so for me if it is being analyze on a different view different from the way the first person viewed it though it's still a spam but it should be considered since it is said differently.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "promise444c5",
      "created_time": "October 05, 2023, 03:55:20 PMLast edit: October 05, 2023, 04:36:55 PM by promise444c5",
      "body": "Quote from: Forever101 on October 05, 2023, 02:31:51 PMThank you for making it clear, no be say na merit person dey Hussle for , most time, I dey go offline for weeks . But as you talk am now, I get the point wey u dey make, na wetin make local board dey unique be that. One love  People believe that threads talking about rules & regulations  are used to farming merits that's y its being pinned at the top of some boards.Yeah , normally you might not have d intention but d tin be sey some nah their way for getting merits  be dat and dem dey look for people wey go make mistakes  , but if you know you have a genuine  reason you fit stand your ground , so if it get you merits  it's normal",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sim_card",
      "created_time": "October 05, 2023, 04:30:34 PM",
      "body": "Quote from: Forever101 on October 05, 2023, 12:34:36 PMIf your reply dey too short, Dem no dey neccessary, this place no he social media for all those kind chat, that one self is considered spam.If your comment is the fact of the discussion, and it is  short, that is not called spamming @Loyce Mobile replie is an example. What if you talk so many story and na off topic, so it is not by the length of your reply that confirms that you are a shit poster.Quote from: Forever101 on October 05, 2023, 12:34:36 PM When your quote they carry multiple quote , that one self dey more like sparm cause e dey always de hard to read am by others. This also depends on the board of discussion, for example the gambling board that majority of forum members visit and contribute there base on their signature campaign demand and for the love of sport. Although, I understand what you mean OP.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Forever101",
      "created_time": "October 05, 2023, 05:43:42 PM",
      "body": "Quote from: Sim_card on October 05, 2023, 04:30:34 PMIf your comment is the fact of the discussion, and it is  short, that is not called spamming @Loyce Mobile replie is an example. What if you talk so many story and na off topic, so it is not by the length of your reply that confirms that you are a shit poster.Well, I go agree with you base on your view and observation. QuoteThis also depends on the board of discussion, for example the gambling board that majority of forum members visit and contribute there base on their signature campaign demand and for the love of sport. Although, I understand what you mean OP.No be lie for that one but e better if newbie they cautious as Dem dey try grow on the forum",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Makus",
      "created_time": "October 06, 2023, 08:10:22 AM",
      "body": "Newbies abeg make una try read the forum rules and some guide wey dey for the Beginners and Help board e go help una for the race for this forum, because e never tay when the op create this thread so as to draw the newbies attention for the board make dem for make quality post and avoid spamming. Now for our board I dey see up to 4 thread wey dey talk about Mohbad, e nor good for the health of our local board, to me e just be like say all these things dey make wen the admin dey delay our request for extra merit source, e nor good make we stop am. And the worse part na be say all the 4 threads dey for this first page.Newbies abeg make we nor do make the efforts of our legends dem go to waste.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptSafe",
      "created_time": "October 06, 2023, 09:51:35 AM",
      "body": "Quote from: Forever101 on October 05, 2023, 12:34:36 PMNaija board na one better board and the activities for the board this days dey make belle sweet person.  It is good that our local board is fast gaining attention coupled with the activities these days and that has made the local boards to start looking into our activities here. Of lately reputable members have started paying attention to our plight as a result of our presence and contributions in making the platform lively. This is a really a good thing to behold.Quote from: Forever101 on October 05, 2023, 12:34:36 PMSenior men Dem don try their best to keep the board clean from every form of spam.This one na true talk. Our senior men dem dey really try their best to keep this board clean.Dem dey do well to dey call attention of members wey dey go off keys sometimes to correct them so that dem no go use am go outside go paint the house another colour. The activities wey dem initiate too na another one wey make our people come sit up to their doings here. For sure them don create enabling environment for us to freely yan mata as e be here.Quote from: Forever101 on October 05, 2023, 12:34:36 PMIf u post topic and you come post another topic/thread wey dey related, that one na spam, Dem fit they desame place. This one na true you talk here. Sometimes related topic no make any sense but most at times too e no dey intentional say person go see topic wey person don create him go create that same topic too no. Maybe the person no see say that similar topic dey exist for am to just put mouth make him own contribution or maybe the topic don shift enter another page wey make him no see am come make create that same topic. I dey yan like this because e happen to me recently. I create topic wey i no know say person don already create similar thing of that nature as one of our senior man call my attention immediately i lock the topic. That na the step wey person suppose to take anytime dem call their attention to things of that nature.Quote from: Forever101 on October 05, 2023, 12:34:36 PMIf your reply dey too short, Dem no dey neccessary, this place no he social media for all those kind chat, that one self is considered spam.This one na wetin i think say no go well. Your perspective about this one no tally. I don come across post wey dey short and very insightful with lots of message to pass  to some reading. It is called short and simple. No much talk here.The issue of plagiarism too na another trap wey dey always hold newbies dem down. As newbie dem no sabi say this platform na advanced one so dem go just copy from any where come post here forget to also put link to reference where dem copy from and that one na crime here wey don lead to many newbie being tagged. As a newbie, if you copy from anywhere make you do well put the link to where you copy from so that e go dey clear say you get reference to back up your post.Quote from: Forever101 on October 05, 2023, 12:34:36 PMIf Dem correct you, abeg no see am as attack, na the right board you dey sooo. I no say everyboard like grow ihn account but make respect the rules. For this local board, I fit boastfully tell una say, people for here get love inside them, and for here, your account fit get the merit wey you wan hustle for but apply sense make we dey enjoy the board as usualPerson wey see correction as attack never ready to learn and grow na because anybody wey wan learn go open ear listen to advise and take correction so that him go do well and too dem go continue dey guide am any time him make mistake. I know say we love ourselves here hence the rate at which we help each other grow is very much encouraging and welcoming. Let the love we share here continue to lead us through.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sexylizzy2813",
      "created_time": "October 06, 2023, 10:41:49 AM",
      "body": "Quote from: Forever101 on October 05, 2023, 02:31:51 PMQuote from: promise444c5 on October 05, 2023, 02:26:59 PMQuote from: Forever101 on October 05, 2023, 01:47:57 PMWe should also get it clear, that even if correction have been made, there is no crime a creating a thread that can help keep the board clean or help others.  This  could be considered  spamming  or trying to farm merits  in some  boards ,which could also give you some bad reputations if it actually being termed to farming merits Thank you for making it clear, no be say na merit person dey Hussle for , most time, I dey go offline for weeks . But as you talk am now, I get the point wey u dey make, na wetin make local board dey unique be that. One love OP and promise444c5 I like the way una understand una selves, one person (Forever101) make mistake and the next person (promise444c5) correct am without making a big deal about the whole thing.This correction of a thing I believe say no be everybody sabi call out person attention then correct the mistake person make so as all of us dey here nah learn we dy learn no matter your rank, rank no dy indicate say you sabi all.. So I go still talk am again OP weldone for this thread you open.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lida93",
      "created_time": "October 06, 2023, 12:42:45 PM",
      "body": "Quote from: promise444c5 on October 05, 2023, 03:55:20 PMQuote from: Forever101 on October 05, 2023, 02:31:51 PMThank you for making it clear, no be say na merit person dey Hussle for , most time, I dey go offline for weeks . But as you talk am now, I get the point wey u dey make, na wetin make local board dey unique be that. One love  People believe that threads talking about rules & regulations  are used to farming merits that's y its being pinned at the top of some boards.Yeah , normally you might not have d intention but d tin be sey some nah their way for getting merits  be dat and dem dey look for people wey go make mistakes  , but if you know you have a genuine  reason you fit stand your ground , so if it get you merits  it's normalNa this same tin about people tinkin say certain posts wey person go mk say na to farm merit dey make me de avoid makin sum kind post dem wey I see say e go dey necessary to post am mk e serve as reminder for sum fvck up we don de wan turn normal. But as @promise tok am no be evry bodi get dat energy to spend time d explain explain in the name of standing ground so nah to just let the supos post just slide maybe sum bih name inside the LB fit observ am com raise alarm, dat one nobodi go reason am as merit farming shaaa.Or anoda alternative be say u fit PM any big name for the LB tell am wetin u de observe make him raise alarm about am , dat too goes well lik dat.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptopreneurBrainboss",
      "created_time": "October 06, 2023, 02:37:17 PMLast edit: October 06, 2023, 05:44:40 PM by CryptopreneurBrainboss",
      "body": "Quote from: Forever101 on October 05, 2023, 12:34:36 PMIf your reply dey too short, Dem no dey neccessary, this place no he social media for all those kind chat, that one self is considered spam.No, no talk am like dat because some questions need short and direct reply, wetin you go talk na say make we no get a habit of only writing one line spams as when your posts get reported it'll be deleted and if many posts get deleted it can lead to your account getting banned. QuoteIf you dey quote unnecessarily or your quote too dey long. When your quote they carry multiple quote , that one self dey more like sparm cause e dey always de hard to read am by others. To emphasize on this, the multiple quoting here na qoute pyramid and not responding to different questions been asked. If you see post wey many people dun quote (e come belike 5 above quote) just delete others and leave the last person wey you wan respond to. QuoteIf others dey wey I no mention, Dem senior men go yarn them with us. [Rules] Unofficial General Guidelines For Posting( Na de koko dem)Quoteif Dem correct you, abeg no see am as attack, na the right board you dey sooo. I no say everyboard like grow ihn account but make respect the rules. For this local board, I fit boastfully tell una say, people for here get love inside them, and for here, your account fit get the merit wey you wan hustle for but apply sense make we dey enjoy the board as usualHere na our own so na for us to protect am, but dat one no mean say we go dey abuse the forum rules and expect us to overlook am. Person go only correct you when you dey do something wrong so wetin come dey make you vex, him dey actually look after you because if him no wan make you progress him for just leave you and you go continue in your wrong way come put your account for trouble. And for those correcting try use small love, na hustle we all dey so no go spoil another man own.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AYOBA",
      "created_time": "October 06, 2023, 05:42:43 PM",
      "body": "Quote from: CryptopreneurBrainboss on October 06, 2023, 02:37:17 PMHere na our own so na for us to protect am, but dat one no mean say we go dey abuse the forum rules and expect us to overlook am. Person go only correct you when you dey do something wrong so wetin come dey make you vex, him dey actually look after you because of him no wan make you progress him for just leave you and you go continue in your wrong way come put your account for trouble. And for those correcting try use small love, na hustle we all dey so no go spoil another man own.Thanks @Brainboss this is well Stated I like the wey you clearly it for everybody seriously most of us here don't won't to see some people progress at least if they see sey we newbie we want to get wrong instant of them to correct us their will not after that, their only look for a wey to criticize us which is no good we all gather here to help each other but some still no understand.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Forever101",
      "created_time": "October 06, 2023, 09:12:48 PM",
      "body": "QuoteNo, no talk am like dat because some questions need short and direct reply, wetin you go talk na say make we no get a habit of only writing one line spams as when your posts get reported it'll be deleted and if many posts get deleted it can lead to your account getting banned. no be lie boss, u too much, na the truth you make clear so. Thanks for sharing this knowledge",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Truthlovecoins",
      "created_time": "October 07, 2023, 02:10:55 PM",
      "body": "Na true talk you yarn so o, because I still dey observe watin dey happen for this forum and I dey very careful before I make any post or comment, just to avoid the case of say I don spam or do something wey no follow. This post dey important for any newbie to read so as them go understand watin Dem need to do so as not to disgrace or fall out hand for any board here. I thank God say I read am and understand am and I go try to adhere as much as possible to the rules wey this forum get.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Samlucky O",
      "created_time": "October 07, 2023, 02:36:03 PM",
      "body": "Quote from: CryptopreneurBrainboss on October 06, 2023, 02:37:17 PMQuote from: Forever101 on October 05, 2023, 12:34:36 PMIf your reply dey too short, Dem no dey neccessary, this place no he social media for all those kind chat, that one self is considered spam.No, no talk am like dat because some questions need short and direct reply, wetin you go talk na say make we no get a habit of only writing one line spams as when your posts get reported it'll be deleted and if many posts get deleted it can lead to your account getting banned. QuoteIf you dey quote unnecessarily or your quote too dey long. When your quote they carry multiple quote , that one self dey more like sparm cause e dey always de hard to read am by others. To emphasize on this, the multiple quoting here na qoute pyramid and not responding to different questions been asked. If you see post wey many people dun quote (e come belike 5 above quote) just delete others and leave the last person wey you wan respond to. QuoteIf others dey wey I no mention, Dem senior men go yarn them with us. [Rules] Unofficial General Guidelines For Posting( Na de koko dem)Quoteif Dem correct you, abeg no see am as attack, na the right board you dey sooo. I no say everyboard like grow ihn account but make respect the rules. For this local board, I fit boastfully tell una say, people for here get love inside them, and for here, your account fit get the merit wey you wan hustle for but apply sense make we dey enjoy the board as usualHere na our own so na for us to protect am, but dat one no mean say we go dey abuse the forum rules and expect us to overlook am. Person go only correct you when you dey do something wrong so wetin come dey make you vex, him dey actually look after you because if him no wan make you progress him for just leave you and you go continue in your wrong way come put your account for trouble. And for those correcting try use small love, na hustle we all dey so no go spoil another man own.I sincerely appreciate the way you are handling the situation here. This thread ona bring here na very useful thread and many of us go lean from am. In as much as we wan grow, many hoddles dey to cross but for us to cross it we need guidance. This thing you just analys like this na one of my quest, but no body explain am like d way you did. If to say I get merit I for give you. But morover I appreciate your efforts on making our 9ja local board solid🙏",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}