{
  "id": "topic_5401682",
  "title": "Joker_Mad",
  "author": "Joker_Mad",
  "created_time": "June 07, 2022, 01:39:51 PM",
  "content": "Ciao ragazzi, volevo esporvi una idea che ho in testa per sapere la vostra opinione. Spero di potertela spiegare brevemente e bene.Vista la mia passione per l'arte urbana (street art) e il fatto che sono fan del mondo crypto e blockchain, ho pensato, perchè non unire le cose e creare una piattaforma per invertire in arte? Accessibile a tutti.. Cioé, esempio, da anni è diventato famoso Banksy per le sue opere e si è arrivati a venderle per milioni di € presso la casa d'aste Chriestie's. Però \"l'investitore medio\" non ha i mezzi per entare in questo mondo.Al momento se uno volesse fare un investimento in arte si é obbligati a comprare per intero un'opera, un quadro, una scultura, mettendo sul piatto molti soldi. Gente come me, con capitale pressochè nullo, non si puó neanche avvicinare a queste cose, anche se mi piacerebbe. La domanda è, secondo voi non si potrebbe creare un progetto, per frazionare \"l'opera d'arte\" come si fa con le azioni??? Immagino, tokenizzare es. il quadro, creando un NFT, e successivamente frazionarlo per rendere possibile l'acquisto anche di una sola piccola parte di esso? In questo caso si potrebbe mantenere le \"azioni\" e la piattaforma si incarica di cercare possibilitá speculative, facendo aumentare il valore del'opera reale nel tempo con conseguente aumento del valore del token. La piattaforma guadagnarebbe una commissione sul profitto generato. Mi piace anche l'idea di creare una nuova comunità di investitori in arte.E' sottointeso che non ho chiaro tutto il progetto in ogni sua fase, esempio: come avere accesso all'opera? Tramite un contratto di esclusiva di vendita con l'artista? o siamo obbligati a compare l'opera e solo dopo poter tokenizzarla? Dove incontare il valore aggiornato di un'opera (STILE ORACOLO) per poter tracciare una stima futura ecc..Ci sono un sacco di artisti che hanno aumento visto aumentare il valore dei propri lavori in questi anni, a parte il caso banksy, c'è C215, pixel pancho, blu, olek, invader e moltissimi altri. So che un idea primitiva però sarebbe molto interessante come cosa a mio riguardo ma ho bisogno di un feedback da parte di uno che se ne intende di progetti onchain e nel caso che fosse positivo, cerco persone interessate alla creazione del progetto insieme. Grazie per il vostro tempo, un saluto",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5401682",
  "comments": [
    {
      "author": "bitbollo",
      "created_time": "June 07, 2022, 05:58:17 PM",
      "body": "in generale si devono tenere conto di tutta una serie di costi che potrebbero incidere sul prezzo finale di vendita (sempre se si riesce a vendere un'opera ad un prezzo maggiore di quanto acquistato), come le spese di acquisto, tassazione, ricerca del bene, storage, assicurazione, spese legali etc...Tra l'altro esistono già dei progetti simili non in blockchain effettuati con pura intenzione speculativa perchè al di la di questo aspetto ... Perchè dovrei possedere una quota di un'opera d'arte se non posso nemmeno esporla/possederla/toccarla? Esistono sul mercato tantissime opere d'arte abbordabili per qualsiasi portafoglio... basta fare un giro nelle varie case d'aste... IMHO l'idea potrebbe funzionare ma serve un team dedicato ed un investimento notevole (tra l'altro con un expertise non da poco).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "duesoldi",
      "created_time": "June 07, 2022, 07:40:57 PM",
      "body": "Lo scorso anno avevo letto qualcosa di analogo fatto dagli Uffizi di Firenze.Sono andato a ricercare la notizia e.... va beh era solo una collaborazione con gli Uffizi ma la promotrice era una società terza: https://www.ilsole24ore.com/art/gli-uffizi-sdoganano-tondo-doni-versione-nft-AEuiMFKhttps://insideart.eu/2021/05/14/gli-uffizi-vendono-il-tondo-doni-di-michelangelo-in-formato-digitale-autenticato-da-blockchain/Ho visto poi un aggiornamento proprio di settimana scorsa. Leggi questo che spiega molto meglio il meccanismo usato per la tokenizzazione e le perplessità del ministero dei beni culturali:https://www.agendadigitale.eu/mercati-digitali/il-museo-degli-uffizi-vende-nft-ora-la-paura-non-blocchi-linnovazione/Le perplessità del ministero riguardano beni pubblici e quindi probabilmente non ciò che pensavi di fare visto che parli di opere di privati, tuttavia penso che possa essere di tuo interesse leggere per avere un'idea dei possibili ostacoli.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Joker_Mad",
      "created_time": "June 08, 2022, 09:53:34 AM",
      "body": "Quote from: bitbollo on June 07, 2022, 05:58:17 PMin generale si devono tenere conto di tutta una serie di costi che potrebbero incidere sul prezzo finale di vendita (sempre se si riesce a vendere un'opera ad un prezzo maggiore di quanto acquistato), come le spese di acquisto, tassazione, ricerca del bene, storage, assicurazione, spese legali etc...Tra l'altro esistono già dei progetti simili non in blockchain effettuati con pura intenzione speculativa perchè al di la di questo aspetto ... Perchè dovrei possedere una quota di un'opera d'arte se non posso nemmeno esporla/possederla/toccarla? Esistono sul mercato tantissime opere d'arte abbordabili per qualsiasi portafoglio... basta fare un giro nelle varie case d'aste... IMHO l'idea potrebbe funzionare ma serve un team dedicato ed un investimento notevole (tra l'altro con un expertise non da poco). Si senza dubbio come dici te si parlerebbe di puro fattore speculativo, non di collezionismo nel vero senso della parola. Per i costi ci ho pensato anche io, l'investimento sarebbe sicuramente non indifferente, è qualcosa che sarebbe alla portata di una venture e non di un singolo investitore. Per la possibilità di guadagno è chiaro che bisognerebbe fare uno studio delle opere o artisti in trend, conoscere il mercato e anche rischiare, come in tutti gli investimenti. Per l'aumento della rendita mi immagino una parte di holding nel tempo e poi la possibilitá di vendita o tramite casa d'aste o su un market secondario, cioè tra gli utenti della community o piattaforma.Era più che altro il dubbio sulla idea, sicuramente se supportata da gente con esperienza si incontrerebbe la soluzione per la fattibilità.Grazie mille",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Joker_Mad",
      "created_time": "June 08, 2022, 10:28:03 AM",
      "body": "Quote from: duesoldi on June 07, 2022, 07:40:57 PMLo scorso anno avevo letto qualcosa di analogo fatto dagli Uffizi di Firenze.Sono andato a ricercare la notizia e.... va beh era solo una collaborazione con gli Uffizi ma la promotrice era una società terza: https://www.ilsole24ore.com/art/gli-uffizi-sdoganano-tondo-doni-versione-nft-AEuiMFKhttps://insideart.eu/2021/05/14/gli-uffizi-vendono-il-tondo-doni-di-michelangelo-in-formato-digitale-autenticato-da-blockchain/Ho visto poi un aggiornamento proprio di settimana scorsa. Leggi questo che spiega molto meglio il meccanismo usato per la tokenizzazione e le perplessità del ministero dei beni culturali:https://www.agendadigitale.eu/mercati-digitali/il-museo-degli-uffizi-vende-nft-ora-la-paura-non-blocchi-linnovazione/Le perplessità del ministero riguardano beni pubblici e quindi probabilmente non ciò che pensavi di fare visto che parli di opere di privati, tuttavia penso che possa essere di tuo interesse leggere per avere un'idea dei possibili ostacoli. Grazie mille per le info, interessante!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}