{
  "id": "topic_5398742",
  "title": "GrLinkey",
  "author": "GrLinkey",
  "created_time": "May 15, 2022, 12:07:47 PM",
  "content": "В истории России поражения в войнах приносили простому народу больше пользы, чем победы. Поражение в Крымской войне привело к реформам Александра 2: все поняли, что построенная Николаем 1 система одряхлела, Россия начала отставать от Европы в технологиях, и нужно проводить реформы. За эти реформы Александру 2 поставили памятники.Поражение в Русско-японской войне привело к революции 1905г. Народ получил констутуцию, выборы в парламент, свободу слова и многое другое. То, что эта революция была успешной, доказывает тот факт, что в 1917г произошла новая революция. Внешних причин для неё не существовало: население особо не голодало, армия даже начала побеждать в войне (Брусиловский прорыв). Просто слово \"революция\" тогда было крайне популярное, все верили что чем больше революций - тем лучше. На выборах в Учредительное собрание 1917г. больше всего голосов набрала партия, в названии которой было слово \"революционеры\".Поражение в Холодной войне привело к перестройке. Как и с Крымской войной, причиной было отставание СССР в технологиях - сначала невоенных, потом военных. Мно возразят, что в Перестройку и в 90-е население жило плохо; отвечу на это, что люди хотели рыночной экономики и большей свободы, и они это получили в нулевые годы, а в 90-е всё было плохо потому что совковая экономика демонтировалась очень мучительно (а также из-за дешёвой нефти).Единственная война, где внешний враг был реально страшный и поражение было хуже победы - Великая отечественная.Меня раньше очень угнетали посты упоротых сталинистов/черносотенцев, которые писали, что они против Путина, потому что считают его прозападным либералом. Но сейчас я был бы рад увидеть такие высказывание, потому что это может сбыться - в Путине проснётся либерал и он начнёт очередную оттепель. Это произойдёт, когда он поймёт простую истину: российская армия воюет неэффективно, поскольку Путин и его генералы стали продуктами собственной пропаганды.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5398742",
  "comments": [
    {
      "author": "The0ldl_lser",
      "created_time": "May 15, 2022, 01:52:10 PM",
      "body": "Quote from: GrLinkey on May 15, 2022, 12:07:47 PM. Но сейчас я был бы рад увидеть такие высказывание, потому что это может сбыться - в Путине проснётся либерал и он начнёт очередную оттепель. Это произойдёт, когда он поймёт простую истину: российская армия воюет неэффективно, поскольку Путин и его генералы стали продуктами собственной пропаганды.Хотел дать мерит но дочитал до конца. Нет он не поймет и не уйдет. Он либо умрет, либо его сожрут чуваки из окружения. И если он проебет эту \"невойну\", то это произойдет намного быстрее. Наша (всех здравомыслящих кто переживает за будущее себя или детей) задача сейчас поспособствовать этому.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bonfire66",
      "created_time": "May 16, 2022, 09:59:43 AMLast edit: May 20, 2022, 09:43:28 PM by Xal0lex",
      "body": "Сталин выиграл ВОВ, а точнее, правильнее, было бы назвать эту войну Первой Социалистической. Войну одного социалистического государства с другим социалистическим государством. Но Сталин проиграл Вторую мировую войну. Он ее развязал с единственной главной целью - завоевать Европу. Ведь даже в песнях пели - \"мы разжигаем пожар мировой, церкви и тюрьмы сровняем с землей, даешь варшаву, даешь Берлин, а от тайги до БРИТАНСКИХ морей красная армия всех сильней\" - есть еще десятки свидетельств того, что глобальная цель СССР в 30х годах - было установление диктатуры пролетариата на бОЛьшей части земного шара. Но не сраслось. Не получилось. Пришлось довольствоваться только частью курильских островов и калининградской областью. Это типа как сейчас Путин решил за 3 дня завоевать всю Украину, а получилось только  Херсон. Запал большой, да выхлоп слабый.. Я не профессор, я просто кхн.А понедельник - это тот день, когда я бухаю (строго по-расписанию), чего и всем остальным рекомнедую.А вот переходить на личности, вместо того, чтобы ответить по-существу - это значит, заранее сдать свои позиции. То есть, проспорить спор.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}