{
  "id": "topic_5449010",
  "title": "xwinnergame",
  "author": "xwinnergame",
  "created_time": "April 16, 2023, 09:26:40 AMLast edit: April 18, 2023, 11:36:38 AM by xwinnergame",
  "content": "On-chain lottery and scratch games are decentralized gaming applications built on a blockchain network. These games allow users to participate in a trustless and transparent environment, where the game results are determined by smart contracts and recorded on the blockchain. By using blockchain technology, on-chain lottery and scratch games eliminate the need for intermediaries and ensure that the games are provably fair. Players can trust that the games are not rigged or manipulated, and the payout system is automated, making it quick and secure. Moreover, the use of cryptocurrencies as the primary payment method enables players from all over the world to participate in the games without being limited by geographical boundaries or financial institutions.There are several \"Lottery system\" on chain, we take pancake lottery as an example, here are some comments:https://www.reddit.com/r/CryptoCurrency/comments/myymvw/pancakeswap_lottery_is_extremely_suspicious/?onetap_auto=truehttps://www.reddit.com/r/CryptoCurrency/comments/ohqxt5/tried_the_pancake_swap_lottery_with_one_ticket_on/Our team figure out that the primary goal of lotteries is to provide entertainment, it's worth noting that for many players, winning money is a significant part of the appeal. Lottery games that offer large cash prizes and the chance to change one's financial situation can be a powerful draw. That being said, it's important for lottery operators to ensure that their games are fair, transparent, and enjoyable for all players, and not solely focused on maximizing profits.Our team have being developing lottery system for over 6 months. We would like share our ideas and get more feedbacks from players!!If you are interested please check out @ alpha.xwinner.win. Since the game is running on polygon mumbai network, which means it is free!Please try it out and let us know where to improve !!Gitbook: https://xwinnergame.gitbook.io/x-winner/xwinner-introduction/x-winner",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5449010",
  "comments": [
    {
      "author": "dimonstration",
      "created_time": "April 16, 2023, 01:54:05 PM",
      "body": "Do you and your team don’t browse much in the internet because blockchain based game especially lottery is not new anymore. I think I saw first lottery games that based on blockchain during 2017 but most of them didn't succeed because of the few interest in this type of game.It's shocking that we are on year 2023 that you finally launched this kind of game that is already available 5 years ago.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "xwinnergame",
      "created_time": "April 17, 2023, 05:59:15 AM",
      "body": "Quote from: dimonstration on April 16, 2023, 01:54:05 PMDo you and your team don’t browse much in the internet because blockchain based game especially lottery is not new anymore. I think I saw first lottery games that based on blockchain during 2017 but most of them didn't succeed because of the few interest in this type of game.It's shocking that we are on year 2023 that you finally launched this kind of game that is already available 5 years ago. Thank you for your feedback and insights. We understand that the lottery industry is not new, but we believe that our approach and technology can bring a fresh perspective and innovation to the market. We appreciate your interest in our project and would love for you to take a look at our documentation. Your suggestions and feedback are always welcome as we strive to continuously improve and evolve our platform.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "klidex",
      "created_time": "April 17, 2023, 08:11:36 AM",
      "body": "After I tried to open your lottery site it seemed to provide a MATIC faucet and a USDT faucet, but only MATIC worked when I clicked the button and it appeared like a testnet.My question is whether the faucet is obtained from the testnet and can it be used to purchase lottery tickets?On the USDT faucet when I click it doesn't work like the MATIC faucet or maybe this is under development or something went wrong?This polygon network-based lottery will be an interesting lottery to try at a low cost.But I think I prefer the bitcoin network-based lottery because it's my favorite coin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Outhue",
      "created_time": "April 17, 2023, 08:20:03 AM",
      "body": "I don't have a lot to say, since this idea is not new in this space anymore, those who embarked on this journey years ago failed, but I am not saying failure is yours too, I do wish you guys all the best. The best advice I can give you guys is to stand out among the rest, since this is not a new thing in this space anymore, you need a better strategy to confuse people that you guys are different, do it differently and introduce something appealing.Like you've said, it's not always about the cash grab, it's always about the experience. All the best",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Porfirii",
      "created_time": "April 17, 2023, 10:19:24 AM",
      "body": "Quote from: Outhue on April 17, 2023, 08:20:03 AMI don't have a lot to say, since this idea is not new in this space anymore, those who embarked on this journey years ago failed, but I am not saying failure is yours too, I do wish you guys all the best. The best advice I can give you guys is to stand out among the rest, since this is not a new thing in this space anymore, you need a better strategy to confuse people that you guys are different, do it differently and introduce something appealing.Like you've said, it's not always about the cash grab, it's always about the experience. All the bestIn fact, their approach might not be so bad if used in other kinds of media. Because, does the average Joe know that lottery systems in blockchain exist since 2017?Here in Bitcointalk most members know a lot about crypto and blockchain and what is seen as an innovation outside this circle seems old-fashioned here. And it doesn't mean that, although the concept is not brand new, it can't succeed in another markets with another targets.All the best from me too. As a recommendation, avoid such dramatic expressions here, because those who read shocking can feel disappointed if the content of the OP doesn't surprise them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Beparanf",
      "created_time": "April 17, 2023, 11:13:36 AM",
      "body": "Quote from: xwinnergame on April 17, 2023, 05:59:15 AMQuote from: dimonstration on April 16, 2023, 01:54:05 PMDo you and your team don’t browse much in the internet because blockchain based game especially lottery is not new anymore. I think I saw first lottery games that based on blockchain during 2017 but most of them didn't succeed because of the few interest in this type of game.It's shocking that we are on year 2023 that you finally launched this kind of game that is already available 5 years ago. Thank you for your feedback and insights. We understand that the lottery industry is not new, but we believe that our approach and technology can bring a fresh perspective and innovation to the market. We appreciate your interest in our project and would love for you to take a look at our documentation. Your suggestions and feedback are always welcome as we strive to continuously improve and evolve our platform.Don’t take personally such comment from him. Your title probably is just to catchy for the games you are offering that is not new here. I believe on a successful business for decentralized game like this. You should just make the approach more professional and not like this.Most of the decentralised casino nowadays has lottery and scratch cards games in the house game. Making it as your only game will make you inferior to other casino since all of them is offering various type of game that most user here preferred than a single lottery game.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AmoreJaz",
      "created_time": "April 17, 2023, 12:03:11 PM",
      "body": "Quote from: Beparanf on April 17, 2023, 11:13:36 AMQuote from: xwinnergame on April 17, 2023, 05:59:15 AMQuote from: dimonstration on April 16, 2023, 01:54:05 PMDo you and your team don’t browse much in the internet because blockchain based game especially lottery is not new anymore. I think I saw first lottery games that based on blockchain during 2017 but most of them didn't succeed because of the few interest in this type of game.It's shocking that we are on year 2023 that you finally launched this kind of game that is already available 5 years ago. Thank you for your feedback and insights. We understand that the lottery industry is not new, but we believe that our approach and technology can bring a fresh perspective and innovation to the market. We appreciate your interest in our project and would love for you to take a look at our documentation. Your suggestions and feedback are always welcome as we strive to continuously improve and evolve our platform.Don’t take personally such comment from him. Your title probably is just to catchy for the games you are offering that is not new here. I believe on a successful business for decentralized game like this. You should just make the approach more professional and not like this.Most of the decentralised casino nowadays has lottery and scratch cards games in the house game. Making it as your only game will make you inferior to other casino since all of them is offering various type of game that most user here preferred than a single lottery game.from what we have seen from previous lottery-based platforms, they didn't survive because they couldn't sustain the interest of players. they may get the attention at initial launch but after even couple of months, there will be less and less players that will join the lottery game.so yeah, this may not be a very new idea here. but if they can sustain or increase their number of players throughout their operations, that would be a success story.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "seoincorporation",
      "created_time": "April 17, 2023, 02:01:11 PM",
      "body": "Quote from: xwinnergame on April 16, 2023, 09:26:40 AMOn-chain lottery and scratch games are decentralized gaming applications built on a blockchain network. These games allow users to participate in a trustless and transparent environment, where the game results are determined by smart contracts and recorded on the blockchain. By using blockchain technology, on-chain lottery and scratch games eliminate the need for intermediaries and ensure that the games are provably fair. Players can trust that the games are not rigged or manipulated, and the payout system is automated, making it quick and secure. Moreover, the use of cryptocurrencies as the primary payment method enables players from all over the world to participate in the games without being limited by geographical boundaries or financial institutions.This kind of lottery as you mention is probably fair, and we can verify their fairness in the smart contract, all good at that point, but talking about a decentralized project, I'm not totally sure about that for the next two factors... 1.- Someone has to put the money in the lottery to make it attractive to the users and 2.- Someone is winning money each time a user buys a ticket, and that profit hasn't to be direct profit, I mean, they can profit with the fees on that transaction if it's in their own token, or by bumping the token price in the market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fivestar4everMVP",
      "created_time": "April 17, 2023, 02:33:00 PM",
      "body": "This is a good good development I must say, I tried checking the site out, but unfortunately, it's not loading for me, I don't know what could be the reason but that by the way..Games, be it lottery or gambling games, built on-chain are decentralized quite alright, and win or loss is determined by the smart contract as stated by the op, but my major concern here is trust, how can players really trust that the smart contract is not rigged/rugged, i.e written with some malicious code in it to ensure that the game favors the owners the most, and favor the user a little, just so the users don't suspect fowl play?This I believe is something you guys will have to really assure the community of, else, many are just gonna be skeptical.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "goldkingcoiner",
      "created_time": "April 17, 2023, 02:56:05 PM",
      "body": "I am glad to see websites popping up with blockchain gambling services. But blockchain lottery is nothing new, really. A lot of such projects like to make claims like \"trustless and transparent\" however they fail to provide an open source as well as a a smart contract audit and a non-custodial wallet experience. So unless your lottery system has been tried and proven by the community, I would not be ready to accept such grandiose claims. Decentralized does not automatically make it \"provably fair\". QuotePlayers can trust that the games are not rigged or manipulatedI think word trust should not be used together with \"provably fair\". A Certik security audit is not the same as an audit in functionality and fairness. So which audits other than security audits can you offer?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tusandii",
      "created_time": "April 17, 2023, 04:22:24 PM",
      "body": "Quote from: goldkingcoiner on April 17, 2023, 02:56:05 PMQuotePlayers can trust that the games are not rigged or manipulatedI think word trust should not be used together with \"provably fair\". A Certik security audit is not the same as an audit in functionality and fairness. So which audits other than security audits can you offer? Yes, that's true, because if we look deeper into these two words, it's clear that the two have quite a big difference.No one can provide excerpts from these two audits as they really have to be held accountable and otherwise reputation is at stake.Maybe he said this to gain the trust of all of us but he forgot that we have different and more advanced interpretations and thoughts of course. I'm not sure he has any other options to offer because what he's offering is a statement that isn't necessarily true.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fivestar4everMVP",
      "created_time": "April 17, 2023, 06:37:12 PM",
      "body": "Quote from: goldkingcoiner on April 17, 2023, 02:56:05 PMI am glad to see websites popping up with blockchain gambling services. But blockchain lottery is nothing new, really. A lot of such projects like to make claims like \"trustless and transparent\" however they fail to provide an open source as well as a a smart contract audit and a non-custodial wallet experience. So unless your lottery system has been tried and proven by the community, I would not be ready to accept such grandiose claims. Decentralized does not automatically make it \"provably fair\". QuotePlayers can trust that the games are not rigged or manipulatedI think word trust should not be used together with \"provably fair\". A Certik security audit is not the same as an audit in functionality and fairness. So which audits other than security audits can you offer? You are absolutely correct my friend, this is exactly the same direction I was going to in my previous comment, like you said, this is not the first decentralized lottery game being announced on this forum, there have been many of them, but at the current states of things, centralized casinos that have built a good reputation over time are trusted more than any decentralized casino at the moment, this is why non of the previously announced decentralized casino have succeeded so far.For me personally, before I can try any decentralized casino or lottery system, the owners must make the code of the entire system open source, and must present a full smart contract audit from a reputable and reliable audit company, any thing less, I will prefer to keep playing on centralized casino I trust.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cabron",
      "created_time": "April 17, 2023, 06:56:03 PM",
      "body": "The Pancake lottery system was implemented two years ago just as the Reddit thread was created. Doesn't sound shocking I have seen this on the lottery system in one of the casinos that offer gambling tokens for shared revenue.Can't say people will really play on a decentralized casino even if its code is open source, there are lots of them trying hard but none successfully made it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Agbe",
      "created_time": "April 17, 2023, 07:29:29 PM",
      "body": "Quote from: cabron on April 17, 2023, 06:56:03 PMThe Pancake lottery system was implemented two years ago just as the Reddit thread was created. Doesn't sound shocking I have seen this on the lottery system in one of the casinos that offer gambling tokens for shared revenue.Can't say people will really play on a decentralized casino even if its code is open source, there are lots of them trying hard but none successfully made it.  I have not seen lottery games system in the decentralized system before. This is a welcome development. But I have seen the pancake in binance and trust wallets. And not on gaming sites. For the last paragraph of you, I agreed with that, if such does exist, I have not seen success of the lottery games on the chain. But persistent trial can lead to the successful break through of lottery games in the ecosystem.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o48o",
      "created_time": "April 17, 2023, 07:30:31 PM",
      "body": "I started to read your gitbook to see how this would be innovative or shocking compared to other blockchain games. And as an idea it's not original, people have been trying to keep similar sites alive more or less successfully.But an instant red flag right away is revenue forecast. If you are building something revolutionary (which you are not) you don't start my transparent marketing tapping on human greed. If you need to sell it by promising moon from the sky by comparing your casino to global game market. That just shows that you don't trust your own product. You would talk about your tech and game theory if you had something to talk about. yours reminded me cash grab ICOs of 2017 that failed or got sued.You know i can make a token that could be used in dental industry and compare the whole dental industry revenue to that. It doesn't mean it would get any users or had value in the future.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hispo",
      "created_time": "April 17, 2023, 07:54:44 PM",
      "body": "Quote from: cabron on April 17, 2023, 06:56:03 PMThe Pancake lottery system was implemented two years ago just as the Reddit thread was created. Doesn't sound shocking I have seen this on the lottery system in one of the casinos that offer gambling tokens for shared revenue.Can't say people will really play on a decentralized casino even if its code is open source, there are lots of them trying hard but none successfully made it. People simply prefer to stick to the centralized casinos which they already know and trust.Part of it, I assume it must be because the bulk of the gamblers do not even know how to read code and verify the fairness of an entire casino before starting to play, added to the fact each interaction with smart contracts can be translated to a transaction and the fees associated to it. Gamblers just want to deposit and play.There is still a long path ahead before decentralized gambling can become mainstream, in my opinion.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "crzy",
      "created_time": "April 17, 2023, 08:40:50 PM",
      "body": "Quote from: cabron on April 17, 2023, 06:56:03 PMThe Pancake lottery system was implemented two years ago just as the Reddit thread was created. Doesn't sound shocking I have seen this on the lottery system in one of the casinos that offer gambling tokens for shared revenue.Can't say people will really play on a decentralized casino even if its code is open source, there are lots of them trying hard but none successfully made it. This is not new anymore but at least, developer are tying their best to enter the competition.There’s always a room for a new projects and if this one succeed, the better. Trying to understand now how this site works, will need to know more information about this first before anything else. Lottery is fine for me as lot us its fairness is ok and doing this on a blockchain can be more ok, maybe this site just need more market exposure.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DoublerHunter",
      "created_time": "April 17, 2023, 09:09:52 PM",
      "body": "Quote from: AmoreJaz on April 17, 2023, 12:03:11 PMfrom what we have seen from previous lottery-based platforms, they didn't survive because they couldn't sustain the interest of players. they may get the attention at initial launch but after even couple of months, there will be less and less players that will join the lottery game.so yeah, this may not be a very new idea here. but if they can sustain or increase their number of players throughout their operations, that would be a success story. ^That is definitely right and like me how many of us here witnessed that the lottery game did not have an interest to the gamblers.The main reason is that the odds of winning the lottery jackpot are typically very low, often less than 1 in several million. This means that players have a very small chance of winning a significant amount of money, which can make the game less appealing to some. So now, OP, how you can make your platform unique so that everyone will have an interest in the lottery? With the rise of online gambling and other forms of entertainment, some players may choose to spend their money and time on other activities instead of playing the lottery.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "wiss19",
      "created_time": "April 18, 2023, 05:41:04 AM",
      "body": "Quote from: Porfirii on April 17, 2023, 10:19:24 AMIn fact, their approach might not be so bad if used in other kinds of media. Because, does the average Joe know that lottery systems in blockchain exist since 2017?Here in Bitcointalk most members know a lot about crypto and blockchain and what is seen as an innovation outside this circle seems old-fashioned here. And it doesn't mean that, although the concept is not brand new, it can't succeed in another markets with another targets.All the best from me too. As a recommendation, avoid such dramatic expressions here, because those who read shocking can feel disappointed if the content of the OP doesn't surprise them.Well, I totally agree with what you said, what I think is that they need a very good marketing strategy and promotional material that will make viewers excited about the platform and the games and products it provides. Even if the business model isn't very new, they can still do pretty well using it if they know how to manage things initially.If their platform proves to be good, especially with the rewards and interesting games, they might even gain some popularity within this forum as well after they launch the platform and manage to get some popularity outside with their marketing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}