{
  "id": "topic_5397966",
  "title": "roadrunnerjaiv2025",
  "author": "roadrunnerjaiv2025",
  "created_time": "May 10, 2022, 01:35:50 AM",
  "content": "Three things stuck in my mind this week:1. It might take a few more months before BTC's price finally exits the bear market. That is if we have a similar situation to the 2018 bear market where fear and greed levels plateaued for a whole year.2. BTC's price free-fall will slow down between $24K and $27K unless more macroeconomic and geopolitical risks emerge. 3. Short-term holders are responsible for most of the capitulation (day trading and scalping don't fall in this category, right?).But one thing has a high certainty---the bear market is temporary. The bull is not a matter of if but when.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5397966",
  "comments": [
    {
      "author": "tbct_mt2",
      "created_time": "May 10, 2022, 03:12:36 AM",
      "body": "Quote from: roadrunnerjaiv2025 on May 10, 2022, 01:35:50 AM1. It might take a few more months before BTC's price finally exits the bear market. That is if we have a similar situation to the 2018 bear market where fear and greed levels plateaued for a whole year.Price will recover strongly with bounces after dumps but to complete and exit the bear market, we must see capitulation from both investors (short term investors) and miners. It's more important with miner capitulation because it will trigger a bear market exit.Quote2. BTC's price free-fall will slow down between $24K and $27K unless more macroeconomic and geopolitical risks emerge. Probably it will be a next destination for Bitcoin because the wallet cohort shows that. From $29k to $24k is not too far and I would like to see it happens because it will help the market to clean gamblers and become more healthy.Quote3. Short-term holders are responsible for most of the capitulation (day trading and scalping don't fall in this category, right?).Because they are not actually investors or holders. I consider them as speculators. When their speculation goes wrong, they don't have plan B or exchanges don't allow them to go ahead with Plan B or Plan C. Market and exchanges will liquidate their gambling positions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Baofeng",
      "created_time": "May 10, 2022, 03:37:42 AM",
      "body": "We are still in the early phase of the bear market and there's a lot of things that can happen.Maybe we can see the price < $30k'ish and then we will have a bounce back around $33k-$35k. But then again, with the current situation like the wars at the background and maybe we will hear another negative news that will affect not just crypto but the rest of traditional markets. So possible so see the price between $24k-$27k, but it will be slow and not that drastic changes that we will see this month.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "May 10, 2022, 03:43:47 AM",
      "body": "Quote from: roadrunnerjaiv2025 on May 10, 2022, 01:35:50 AM3. Short-term holders are responsible for most of the capitulation (day trading and scalping don't fall in this category, right?).This has been the case, like — since literally  forever. But I wouldn't say they're responsible for most of the capitulation. Let's not forget that markets in general have been a total utter shitshow for a while now, and market correlation between BTC and the SPY is at an all-time high.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nrcewker",
      "created_time": "May 10, 2022, 03:54:45 AM",
      "body": "Quote from: roadrunnerjaiv2025 on May 10, 2022, 01:35:50 AM2. BTC's price free-fall will slow down between $24K and $27K unless more macroeconomic and geopolitical risks emerge. This is just the initial stage of the bearish market, we shouldn’t judge the market so quickly.But sad to see Bitcoin’s price currently.If I am not wrong then, in the past year this is the all time lowest amount for Bitcoins.This month might be hard for all the Bitcoin holders, but soon the coin will bounce back.We can just hope that no more issue should arise, so that Bitcoin’s price will affect again.Earlier Today Morning, i heard a news that El Salvador Bought 500 Bitcoins when the price was around 30k usd. This might be looked as a positive approach towards the coin and here we can again see the growth in the price of the coin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tbct_mt2",
      "created_time": "May 10, 2022, 04:58:26 AM",
      "body": "Quote from: mk4 on May 10, 2022, 03:43:47 AMThis has been the case, like — since literally  forever. But I wouldn't say they're responsible for most of the capitulation. Let's not forget that markets in general have been a total utter shitshow for a while now, and market correlation between BTC and the SPY is at an all-time high.When the market is grown on speculation, speculators will panic sell when they don't see more future for higher speculation.Worse, capital from speculators might even not come from their own pockets. Liquidation will aim at speculators and clean the market for better future. Price can not increase forever without correction, without liquidation.In ride, you should know price does not simply rise because of buy or demand of investment. Its ride is supported by liquidation, short squeeze too.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yazher",
      "created_time": "May 10, 2022, 05:18:31 AM",
      "body": "The fall of the price is inevitable but the good thing about it is the way the bitcoins price recovered just like in the past. I think some of the people who are panicking right now are those who bought at a high price with the money they cannot afford to lose which is really bad news for those people since the price right now is staying at its lower since the great bull runs. Only patience can remedy this kind of scenario in the market or you can just do some other things outside your home and don't mind this bearish market in the meantime.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ahli38",
      "created_time": "May 10, 2022, 05:39:36 AM",
      "body": "as we know the trigger for bitcoin's decline this time was starting from the decision of the central bank of the United States (US), The Federal Reserve (The Fed) announcing an increase in interest rates. even analysts estimate, the price of this cryptocurrency (cryptocurrency) continues to fall to below US $ 30,000 and even past US $ 28,000. so said analyst and chief executive at Factor Peter Brandt via twitter.Even senior analyst at Token Metrics Bill Noble estimates the bitcoin price to hit $20,000 in the worst case scenario.but now we still see the strength of support at US$30,000 - $31.000 which is still strong. hopefully it bounces back up and turns bullish",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "peter0425",
      "created_time": "May 10, 2022, 05:43:00 AM",
      "body": "Quote from: roadrunnerjaiv2025 on May 10, 2022, 01:35:50 AMThree things stuck in my mind this week:1. It might take a few more months before BTC's price finally exits the bear market. That is if we have a similar situation to the 2018 bear market where fear and greed levels plateaued for a whole year.2. BTC's price free-fall will slow down between $24K and $27K unless more macroeconomic and geopolitical risks emerge. 3. Short-term holders are responsible for most of the capitulation (day trading and scalping don't fall in this category, right?).But one thing has a high certainty---the bear market is temporary. The bull is not a matter of if but when. All of those might correct but at least we are  heading towards favorable for us Holder because we can purchase more to Hold and stays having the coins in our pocket for longer time while waiting for the Bull run again.and about that temporary Bear > Indeed as we have seen this many times before and Price will surely increase in the future.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Don Pedro Dinero",
      "created_time": "May 10, 2022, 06:04:50 AM",
      "body": "Quote from: Ahli38 on May 10, 2022, 05:39:36 AMas we know the trigger for bitcoin's decline this time was starting from the decision of the central bank of the United States (US), The Federal Reserve (The Fed) announcing an increase in interest rates. even analysts estimate, the price of this cryptocurrency (cryptocurrency) continues to fall to below US $ 30,000 and even past US $ 28,000. so said analyst and chief executive at Factor Peter Brandt via twitter.Even senior analyst at Token Metrics Bill Noble estimates the bitcoin price to hit $20,000 in the worst case scenario.but now we still see the strength of support at US$30,000 - $31.000 which is still strong. hopefully it bounces back up and turns bullishLuna has also been involved in selling Bitcoin en masse.https://u.today/luna-foundation-sells-15-billion-in-bitcoin-bought-at-47000-for-33000-detailsThe level of between 24 and 27 thousand given by the creator of the thread seems arbitrary to me and he does not argue it. I wonder what might happen if we have more cases like Luna or people with leverage who are forced to sell at a loss or margin call.When things are going down as they are now it is difficult to see a way out.Quote from: roadrunnerjaiv2025 on May 10, 2022, 01:35:50 AMThe bull is not a matter of if but when. Waiting two months is not the same as waiting two years.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zanab247",
      "created_time": "May 10, 2022, 02:36:06 PM",
      "body": "Quote1. It might take a few more months before BTC's price finally exits the bear market. That is if we have a similar situation to the 2018 bear market where fear and greed levels plateaued for a whole year. I don't think what happened to bitcoin price in 2018 will not happen in this 2022 because bitcoin price can only decrease to $30 but it will not decrease more than $30 in this month of May. Bitcoin price will increase higher soon for those that purchased bitcon at a lower price to have something suitable to achieve from their investment. Bear market will soon be over, because BTC team are seriously working to stop people panic than to concentrate with the beautiful future that is about to happen in the community for people to smile again with massive profits.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "buwaytress",
      "created_time": "May 10, 2022, 03:08:18 PM",
      "body": "A few more months at this stage is optimistic. Likelier to me this is the move bears have been waiting for to make a more persuasive, sustained push into a winter. $24k definitely as likely to happen now in a week as it is in 4 months, as it is over the next 2 years coming up to Bitcoin halving. Even so, as it does take a year or so after halving for buying to kick in, we could still see further drops before that happens.Bitcoin's never retreated in price beyond the ATH of the previous cycle, but if we already have the ATH in this cycle, it's barely 3.5x of 2017's, so sub 20k has to be a distinct, even if historic, possibility I feel.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "maydna",
      "created_time": "May 10, 2022, 03:49:47 PM",
      "body": "Quote from: roadrunnerjaiv2025 on May 10, 2022, 01:35:50 AM1. It might take a few more months before BTC's price finally exits the bear market. That is if we have a similar situation to the 2018 bear market where fear and greed levels plateaued for a whole year.We can do nothing but just follow where the market will move and prepare ourselves for what will happen next.Quote from: roadrunnerjaiv2025 on May 10, 2022, 01:35:50 AM2. BTC's price free-fall will slow down between $24K and $27K unless more macroeconomic and geopolitical risks emerge. Hopefully, the bitcoin price doesn't touch that price and stays above $31k for a while and then the price will bounce back up.Quote from: roadrunnerjaiv2025 on May 10, 2022, 01:35:50 AM3. Short-term holders are responsible for most of the capitulation (day trading and scalping don't fall in this category, right?).People who panic are also responsible for this situation because they have already sold bitcoins out of panic. But we can't blame them because they can't handle their emotions yet.Quote from: roadrunnerjaiv2025 on May 10, 2022, 01:35:50 AMBut one thing has a high certainty---the bear market is temporary. The bull is not a matter of if but when. Yes, the bear market is temporary and the bull market is coming back. All we can do right now is persist and be patient.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "alisonwonder",
      "created_time": "May 10, 2022, 04:01:48 PM",
      "body": "Quote from: maydna on May 10, 2022, 03:49:47 PMYes, the bear market is temporary and the bull market is coming back. All we can do right now is persist and be patient.I am not sure that the bear market has stopped as your speculation about the bear market is temporary, although it is temporary but we have seen bad conditions this month with more than $10k decline, but the market needs time to return to bullish and price stability to maintain market conditions not easily broken after the bear market phase.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "batang_bitcoin",
      "created_time": "May 10, 2022, 06:06:23 PM",
      "body": "Quote from: roadrunnerjaiv2025 on May 10, 2022, 01:35:50 AMThree things stuck in my mind this week:1. It might take a few more months before BTC's price finally exits the bear market. That is if we have a similar situation to the 2018 bear market where fear and greed levels plateaued for a whole year.2. BTC's price free-fall will slow down between $24K and $27K unless more macroeconomic and geopolitical risks emerge. 3. Short-term holders are responsible for most of the capitulation (day trading and scalping don't fall in this category, right?).But one thing has a high certainty---the bear market is temporary. The bull is not a matter of if but when. 1. The same goes for last year, the bear market didn't stay for long.2. That's likely if we're going to see the lowest for this bear market. It's even possible that it will go potentially to $20k just for the sake of volatility.3. I guess they're all included with that but, mostly those are the investors that have been shorting with thousands of btcs.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Eternad",
      "created_time": "May 10, 2022, 06:19:09 PM",
      "body": "Quote from: roadrunnerjaiv2025 on May 10, 2022, 01:35:50 AMThree things stuck in my mind this week:1. It might take a few more months before BTC's price finally exits the bear market. That is if we have a similar situation to the 2018 bear market where fear and greed levels plateaued for a whole year.2. BTC's price free-fall will slow down between $24K and $27K unless more macroeconomic and geopolitical risks emerge. 3. Short-term holders are responsible for most of the capitulation (day trading and scalping don't fall in this category, right?).But one thing has a high certainty---the bear market is temporary. The bull is not a matter of if but when. Nothing is permanent on crypto unless stablecoins so Bitcoin should probably exit on this trend once the price already consolidated on a support area. No one can give exact date on when and how but Bitcoin will surely bounce back when there is no fear already and the selling pressure stop on exchange. I really believe that some institutional investor is selling off slowly which is the reason for this huge sell pressure. The price already reduce the volume so probably we can see a relief on price in the next few weeks.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dbc23",
      "created_time": "May 10, 2022, 08:50:31 PM",
      "body": "No trend is there to stay forever. To every bull run there is an equal and opposite bear run. The bear market might seem scary at the moment but it's never here to stay that long. I won't dispute the fact short-term holders are responsible for capitulation but however when the bull sets to run it moves even faster than the bear can resist",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dark1234",
      "created_time": "May 10, 2022, 09:59:48 PM",
      "body": "the market at the moment is so scary and many of the holders are waiting for the market to fall further while the traders prefer to pause for a moment to watch the bear market which may seem to continue at 28k or even beyond that",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SaveOurSea",
      "created_time": "May 10, 2022, 10:28:05 PM",
      "body": "Quote from: roadrunnerjaiv2025 on May 10, 2022, 01:35:50 AMThree things stuck in my mind this week:1. It might take a few more months before BTC's price finally exits the bear market. That is if we have a similar situation to the 2018 bear market where fear and greed levels plateaued for a whole year.2. BTC's price free-fall will slow down between $24K and $27K unless more macroeconomic and geopolitical risks emerge. 3. Short-term holders are responsible for most of the capitulation (day trading and scalping don't fall in this category, right?).But one thing has a high certainty---the bear market is temporary. The bull is not a matter of if but when. Bitcoin's strongest support is at $28000, that's really a support to keep in mind, otherwise we'll see the biggest dump of the year, but I really hope institutions can hold the price at $28k to $30k too",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "milewilda",
      "created_time": "May 10, 2022, 10:29:54 PM",
      "body": "Quote from: roadrunnerjaiv2025 on May 10, 2022, 01:35:50 AMThree things stuck in my mind this week:1. It might take a few more months before BTC's price finally exits the bear market. That is if we have a similar situation to the 2018 bear market where fear and greed levels plateaued for a whole year.2. BTC's price free-fall will slow down between $24K and $27K unless more macroeconomic and geopolitical risks emerge. 3. Short-term holders are responsible for most of the capitulation (day trading and scalping don't fall in this category, right?).But one thing has a high certainty---the bear market is temporary. The bull is not a matter of if but when. 1. No one knows on what would happen next.Comparing it on 2018? A sort of but that one is more red.  2. Im already eyeing into those levels you do mentioned and lastly, i dont believe about economic conditions which will affect crypto market majorly.3. Scalpers doesnt really care about these market trend or conditions so they are exempted but we know that majority isnt really having that kind of trading.Market do only have 2 possible movement or path either bears or bull.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}