{
  "id": "topic_5445491",
  "title": "Ever-young",
  "author": "Ever-young",
  "created_time": "March 19, 2023, 09:58:07 AM",
  "content": "Have been seeing Freebitco ad's on few reputable members signature space lately, have been wondering where I might have seen the name before now. Click on the link and I realize I have an account with them which I created since 2017. I just reset the password now and logged in the account, I realize the account was kind of active back then. Made few clicks and few SATs which I wager most of them on lottery which i can't recall ever winning. Still saw some few Satoshi in my account and about 90+ lottery ticket. It's seems my time there was just fun no good earning was achieved though. Want to ask is this site still rewarding users? Believe back then that I can raise so what could have worth something by just solving some captcha and roll free after some few minutes. .",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5445491",
  "comments": [
    {
      "author": "Maus0728",
      "created_time": "March 19, 2023, 10:16:43 AM",
      "body": "They still do!Apart from being one of the OG bitcoin faucet, they have manage to introduced their own casino token called $FUN token which from I have read, it can be used for investment on their platform[1], and is also being traded on BINANCE!They even have a signature campaign running on the forum right now![2][1] https://bitcointalk.org/index.php?topic=5405945.0[2] https://bitcointalk.org/index.php?topic=5230893.0",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Adbitco",
      "created_time": "March 19, 2023, 10:20:03 AM",
      "body": "Freebitcoin launched a signature campaign since from 2020 and was managed by Reputable manager Hhampuz, though I haven't red much about them but I believe is a good project otherwise we would have heard their story over here or possibly would been paused by the manager.Maybe you keep trying again to see if they are that active in rewarding users, I hardly click on some of the website which I think I don't have anything to do over there, I only visit website whenever I want to use their services otherwise I do avoid random visiting.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptSafe",
      "created_time": "March 19, 2023, 10:31:06 AM",
      "body": "Freebitco is still very much active and as matter of fact, their faucets are still functional and running twenty four hours non stop. Freebitco further expanded their capacity and capability in running a casino or online betting/gambling platform if you may wish am it did not just end there, they have their own token as earlier was mentioned here by Maus0728 and currently trading at a good price. You can stake it on their platform to earn more, use it as well to play games on their platform. From what adbitco had said, I have not really heard any complaint onboard this platform before from any member about or against freebitco. They seems reliable and trustworthy to deal with.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ultegra134",
      "created_time": "March 19, 2023, 01:43:09 PM",
      "body": "I also recovered my Freebitcoin account two years ago, which contained a few thousand satoshi. It's one of the oldest, if not the oldest, faucets around and probably the most trusted one. I personally like its simple design and layout, which has stayed the same throughout the years. I still use the faucet and often their multiplier as well. I've never won a significant amount, though despite using the platform for years, the most I've won is 5,000 Satoshi, twice, in their daily wheel of fortune, and 820 Satoshi, twice, two days ago. It doesn't consume any time, so I occasionally roll the hourly spin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sheenshane",
      "created_time": "March 19, 2023, 02:11:15 PM",
      "body": "Yes, it's working in my account now.I tried to recover it now and it was created in 2017 when I was new in crypto. Quote from: Ever-young on March 19, 2023, 09:58:07 AMBelieve back then that I can raise so what could have worth something by just solving some captcha and roll free after some few minutes. .It's 60 minutes or 1 hour cool down before you can collect again.It seems wasting of time for me.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ultegra134",
      "created_time": "March 19, 2023, 03:38:16 PM",
      "body": "Quote from: sheenshane on March 19, 2023, 02:11:15 PMYes, it's working in my account now.I tried to recover it now and it was created in 2017 when I was new in crypto. Quote from: Ever-young on March 19, 2023, 09:58:07 AMBelieve back then that I can raise so what could have worth something by just solving some captcha and roll free after some few minutes. .It's 60 minutes or 1 hour cool down before you can collect again.It seems wasting of time for me. Unfortunately, the good ol' days of faucets have ended. I remember Freebitcoin giving as much as 1,000 Satoshi per roll. It wasn't worth much back then, but the amount of Bitcoin you could receive from just a faucet with almost zero effort and a few minutes of your time was impressive. Moreover, you're having a bonus, so you're receiving 7 satoshi per roll; the normal payout is 2 satoshi. It's certainly not worth it anymore, but it doesn't require any effort, so I may occasionally use it from my phone, hoping to get lucky sometime in the future.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PX-Z",
      "created_time": "March 19, 2023, 04:43:28 PM",
      "body": "Quote from: Ultegra134 on March 19, 2023, 03:38:16 PMUnfortunately, the good ol' days of faucets have ended. I remember Freebitcoin giving as much as 1,000 Satoshi per roll. It wasn't worth much back then, but the amount of Bitcoin you could receive from just a faucet with almost zero effort and a few minutes of your time was impressive. Indeed, i remember back in the days i start doing faucets first for several years as i started bitcoin in 2015 then just got introduced in this forum after few years. The price was something like $300 and the highest i can get in famous faucets that day were 0.003 it is indeed a memorable experience unlike now faucets are considered as waste of time either for newbies and OGs.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "YOSHIE",
      "created_time": "March 19, 2023, 08:00:43 PM",
      "body": "Quote from: Ever-young on March 19, 2023, 09:58:07 AMWant to ask is this site still rewarding users? Great, if you have found and regained access to the FreeBitco account that you have, that's a good opportunity for you to increase your winnings on the FreeBitco gambling site.Yes, FreeBitco still monitors and rewards its users, who bet and win there.You see in the quote below, to this day it is still active for awards that bet there.Quote from: wetsuit on April 01, 2017, 12:27:42 PMRecently I have started asking users who win $20 and $200 at FreeBitco.in to start posting about their wins in the forum for a small reward in addition to their prize. To keep the place clean, I'll be asking them to post it in this thread. Since FreeBitco.in has a lot more users than this forum, these posts might be from newbies but I have also asked them to post their winning seeds and a screenshot of their win to get the reward. Hopefully we get a lot more people posting about their wins now!You can review here: https://bitcointalk.org/index.php?topic=1850855.2580Well, if you are active again and want to use the FreeBitco site, definitely don't lose contact in their thread: FreeBitco.in-$200 FreeBTC🏎Win Lambo🔥0.2BTC DailyJackpot🏆$32,500 Wager Contest., whatever the problem you can discuss there, awards, bonuses, bets and so on.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Timelord2067",
      "created_time": "March 21, 2023, 08:47:35 AM",
      "body": "If you want to check that the website is up and running without actually having to log in, then all you have to do is follow the link: https://freebitco.in/ - thanks for reading.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LTU_btc",
      "created_time": "March 21, 2023, 08:59:32 PM",
      "body": "I think most of us have Freebitco.in from old times. Especially if we talk about people who got into Bitcoin somewhere in 2015-2018. Back then faucets were big thing and most of newbies started their journey there. Like users above, I still remember times when they were giving 1000 Satoshi per hour. Now faucets is not significant thing, only Freebitco.in is still standing strong.But I don't get, if your account was inactive for few years, how you still have lottery tickets on it?Quote from: Ultegra134 on March 19, 2023, 03:38:16 PMMoreover, you're having a bonus, so you're receiving 7 satoshi per roll; the normal payout is 2 satoshi.Didn't knew that their basic reward now is just 2 Satoshi. I'm always getting $0.002 worth reward, what is 7 Satoshi now and I have no idea how exactly my bonus is activated.Quote from: PX-Z on March 19, 2023, 04:43:28 PMThe price was something like $300 and the highest i can get in famous faucets that day were 0.003 it is indeed a memorable experience unlike now faucets are considered as waste of time either for newbies and OGs.People always were calling faucets as waste if time, even when in prime time of it, when it was possible to earn not bad money with some efforts.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ever-young",
      "created_time": "March 23, 2023, 11:49:55 PM",
      "body": "Quote from: sheenshane on March 19, 2023, 02:11:15 PMIt's 60 minutes or 1 hour cool down before you can collect again.It seems wasting of time for me. It's really a big waste of time, back in those days when I think I can actual do that and earn some free Bitcoin which even if I spend every 1 hour to win 0.0000007 BTC, which is probably time wasting even if i spend 24 hours daily spinning, which is impossible, I will only realize 0.00000168 BTC, and if I decide to sleep on the site so that I can make up something, that's probably spending the whole 8760 hours that make up a year, which will just give about 0.0006132 BTC, which is equalivant to about 16$+ for a whole year, is it really worth it? I was really not thinking straight when I started this free spinning.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Accardo",
      "created_time": "March 24, 2023, 10:43:35 AM",
      "body": "Quote from: Ever-young on March 23, 2023, 11:49:55 PMQuote from: sheenshane on March 19, 2023, 02:11:15 PMIt's 60 minutes or 1 hour cool down before you can collect again.It seems wasting of time for me. It's really a big waste of time, back in those days when I think I can actual do that and earn some free Bitcoin which even if I spend every 1 hour to win 0.0000007 BTC, which is probably time wasting even if i spend 24 hours daily spinning, which is impossible, I will only realize 0.00000168 BTC, and if I decide to sleep on the site so that I can make up something, that's probably spending the whole 8760 hours that make up a year, which will just give about 0.0006132 BTC, which is equalivant to about 16$+ for a whole year, is it really worth it? I was really not thinking straight when I started this free spinning. In the past, I had such experience too and spent a handful of time spinning on different faucet sites until I was fed up, as I didn't come up with a tangible amount. Though some faucets paid out good BTC that was in the early days of bitcoin. On the other hand, your screenshots reminds me that amongst the faucets I used then, I must have came in contact with freebitco. But, I can't recall if I still have the email attached to the account. Between it was fun to use those faucets, at least during leisure. Paying time to earn BTC.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "noorman0",
      "created_time": "March 24, 2023, 11:15:48 AM",
      "body": "Quote from: sheenshane on March 19, 2023, 02:11:15 PM-snip-It's 60 minutes or 1 hour cool down before you can collect again.It seems wasting of time for me. They used to reward faucets hundreds of times bigger than they are now. But that one is a waste of time with relatively little value. After all it is a game, what can be expected is that you with a few spins a day have a lucky jackpot prize. So even though it will spin 24 times every day it will not add to that potential luck.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ultegra134",
      "created_time": "March 24, 2023, 12:55:53 PM",
      "body": "Quote from: noorman0 on March 24, 2023, 11:15:48 AMQuote from: sheenshane on March 19, 2023, 02:11:15 PM-snip-It's 60 minutes or 1 hour cool down before you can collect again.It seems wasting of time for me. They used to reward faucets hundreds of times bigger than they are now. But that one is a waste of time with relatively little value. After all it is a game, what can be expected is that you with a few spins a day have a lucky jackpot prize. So even though it will spin 24 times every day it will not add to that potential luck.The amount of money it returns per roll hasn't changed throughout the years; that was generally standard. I always remember the maximum reward being $200; correct me if I'm wrong. The \"issue\" is that the value of Bitcoin has risen so much that the corresponding payment in Bitcoin has severely lowered, but the payment amount has remained the same. Faucets were never a means to generate money, or Bitcoin in this case; they were supposed to introduce you to cryptocurrencies. The increase however benefited those who had acquired Bitcoin through faucets in the earlier days.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ethereumhunter",
      "created_time": "March 24, 2023, 04:11:09 PM",
      "body": "You may already feel sad for neglecting your account at Freebitco.in, especially when you find out that their rewards have become very small. But you don't need to be sad because now Freebitco.in has some additional features like investing in FUN tokens and if you have a BTC balance in your account, you can also earn a little income which is accumulated by your BTC balance. And now, if you still want to play with the faucet, you can still get free rewards from them so you can collect every satoshi every hour. But whether it's worth it or not, only you know.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "uneng",
      "created_time": "April 06, 2023, 05:03:03 PM",
      "body": "I'm still using the website in a daily basis, most often as possible, to claim free bitcoin every hour, to use wheel of fortune's free spins which are sent to your email everyday and to watch my investments in BTC and FUN token. The platform is pretty complete, has many different features, promotions and advantages when referring new active users to the website. That is how it has been working since 2013... One of the oldest bitcoin sites alive still paying.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cointxz",
      "created_time": "April 06, 2023, 05:12:18 PM",
      "body": "Quote from: ethereumhunter on March 24, 2023, 04:11:09 PMYou may already feel sad for neglecting your account at Freebitco.in, especially when you find out that their rewards have become very small. But you don't need to be sad because now Freebitco.in has some additional features like investing in FUN tokens and if you have a BTC balance in your account, you can also earn a little income which is accumulated by your BTC balance. And now, if you still want to play with the faucet, you can still get free rewards from them so you can collect every satoshi every hour. But whether it's worth it or not, only you know.I have a freebitco.in account since 2016 because I use this website faucet frequently before but the reward is only small if you are looking on Bitcoin currency and not on fiat because IIRC the amount they are giving on faucet is just the same in fiat value equivalent.They offer bigger sats reward before because Bitcoin value is very low unlike now that Bitcoin price is already insane. At least this faucet still working and evolved to full size casino. Freebitco.in hi-lo game is one of my first gambling experience online because their game attracts faucet user to gamble there hard earned money on the faucet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}