{
  "id": "topic_5429960",
  "title": "BlackBoss_",
  "author": "BlackBoss_",
  "created_time": "December 18, 2022, 02:10:01 PMLast edit: January 01, 2023, 09:07:11 AM by BlackBoss_",
  "content": "Twitter: https://twitter.com/bitcointalkDiscord: Invite link https://discord.gg/ahgHyku (shouldn't expire)Reddit: Forum does not have an account on Reddit, but theymos has one account on Reddit: https://www.reddit.com/user/theymos/ and one account for BitcointalkShow: https://www.reddit.com/user/BitcoinTalkShowFacebook: No accountYoutube: No account but there is BitcointalkShow https://www.youtube.com/BitcoinTalkShowQuote from: theymos on July 21, 2018, 04:22:44 AMTwitter @bitcointalk is official, but I only use it for outage notices and such. If there are no problems, then there will be no @bitcointalk messages.I don't use social media. If you think that some social media functionality would be useful (such as pointing to interesting posts), feel free to do it yourself. If it's an interesting project, I might be willing to create APIs to help you. But since I don't use these sites, I don't even know what people would want.Bitcointalk Halving Party - Discord serverBitcointalk.org YouTube channel?TheBitcoinTalkShow - 5 feb - Bitcointalk was hacked",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5429960",
  "comments": [
    {
      "author": "RocketSingh",
      "created_time": "December 18, 2022, 09:27:05 PM",
      "body": "Its time for a NOSTR account for BitcoinTalk. Details @ https://bitcointalk.org/index.php?topic=5429814.msg61463490#msg61463490",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Coyster",
      "created_time": "December 18, 2022, 09:53:21 PM",
      "body": "Most users, like Theymos do not use or care so much about social media, thus Bitcointalk forum social media accounts would never have so much traffic, and sooner or later may fade into oblivion. I think quite a lot of people stopped being too active on social media when they joined the forum, it happened to myself, and i'm pretty sure i am not the only one. The forum is more like everything enmeshed in one, so anything outside the forum might never be popular amongst the Bitcointalk community.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "owlcatz",
      "created_time": "January 01, 2023, 03:37:21 AM",
      "body": "Sadly, bitcointalk is both ahead of and (ofc)  ... \"behind\" on the \"Social Media\" Scene. I think it's for good reason. This was satoshi's forum first. He would not like social media I think ,but just guessing. It's not really needed anyhow, people find there way here through many different ways already. I have helped quite a few people from ebay find this forum, I know that much...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mpamaegbu",
      "created_time": "January 01, 2023, 07:10:22 AM",
      "body": "Quote from: Coyster on December 18, 2022, 09:53:21 PMMost users, like Theymos do not use or care so much about social media, thus Bitcointalk forum social media accounts would never have so much traffic, and sooner or later may fade into oblivion. I think quite a lot of people stopped being too active on social media when they joined the forum, it happened to myself, and i'm pretty sure i am not the only one. The forum is more like everything enmeshed in one, so anything outside the forum might never be popular amongst the Bitcointalk community.You're right. I share the same kindred spirit with you on this. For me the most active SM is telegram in relation to cryptos, that's if that counts for anything at all because we've a lot of scammers on it. I've a Reddit, Twitter and Discord accounts but I can't remember the last time I got on them. It doesn't even seem like I miss anything not frequenting them because I get enough tutorials here.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "January 01, 2023, 07:44:26 AM",
      "body": "I raised the question: what was the advantage of Bitcointalk, having an account on one of these social networks?Honestly, I don't see any advantage.Perhaps a Twitter could serve to communicate some offline moment, as it happened. But that was when the forum was much smaller. At the moment it is in a very large dimension, that the probability of this happening is very small. Of course it can happen, as it sometimes happens to large companies, but it is unlikely and this extra communication would be of little relevance.We can say that this forum is also a social network, so it's not worth being in the \"rivals\".",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackBoss_",
      "created_time": "January 01, 2023, 09:09:27 AM",
      "body": "I did the list for members who don't know about accounts or channels of forum on other media. If they knew but forgot, this topic saves their time.I did not create the list for discussions that the forum should use those accounts, channels and those are helpful.Newbies who love Twitter and want to find forum Twitter, I listed it here.When I joined forum, no similar list and I had to search to make this list.Hayppy New Year",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Agbe",
      "created_time": "January 01, 2023, 01:58:02 PM",
      "body": "Quote from: BlackBoss_ on January 01, 2023, 09:09:27 AMI did the list for members who don't know about accounts or channels of forum on other media. If they knew but forgot, this topic saves their time.Those accounts are dyfunctional and stopped working, so there is no need for that. By the way many users in the forum are not interested in social media probably that is the reason why theymos abandoned or for anonymity reason. If those accounts are functional you wouldn't be the first person to talk about them. I had been seen a thread on those media channels in my early days in the forum.Quote from: BlackBoss_ on January 01, 2023, 09:09:27 AMI did not create the list for discussions that the forum should use those accounts, channels and those are helpful.Then what is the purpose of creating the thread, then your thread is off topic. Because you are trying to tell us that, such is there and should go there and see and when we go there and see them and if they are working, what do you think the person will do? Be a passerby? When serious discussions going on there? It is not possible.Quote from: BlackBoss_ on January 01, 2023, 09:09:27 AMNewbies who love Twitter and want to find forum Twitter, I listed it here.When I joined forum, no similar list and I had to search to make this list.Hayppy New Year Why newbies? Newbies that have not even understand the forum well, should go and use social media? What a thought.When you come here, you didn't make a good search so you end up with Spamming. You would have make comment either, or reference it. Look at this https://bitcointalk.org/index.php?topic=4712844.msg42575101#msg42575101 Happy new year to You!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackBoss_",
      "created_time": "January 01, 2023, 02:25:58 PM",
      "body": "Quote from: Agbe on January 01, 2023, 01:58:02 PMThose accounts are dyfunctional and stopped working, so there is no need for that. By the way many users in the forum are not interested in social media probably that is the reason why theymos abandoned or for anonymity reason. If those accounts are functional you wouldn't be the first person to talk about them. I had been seen a thread on those media channels in my early days in the forum.Dysfunctional or inactive, those accounts must be listedQuoteThen what is the purpose of creating the thread, then your thread is off topic.Discussions can be off topic but topic can only be off board. If you think my post does not belong to Meta, report itQuoteWhy newbies? Newbies that have not even understand the forum well, should go and use social media? What a thought.If newbies can be scam by impersonators in Telegram, they can be scammed by fake accounts, fake channels.QuoteWhen you come here, you didn't make a good search so you end up with Spamming. You would have make comment either, or reference it. Look at this https://bitcointalk.org/index.php?topic=4712844.msg42575101#msg42575101  I see but does it make my topic is spamming or off-board?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Aanuoluwatofunmi",
      "created_time": "January 06, 2023, 01:44:53 PM",
      "body": "Quote from: Coyster on December 18, 2022, 09:53:21 PMMost users, like Theymos do not use or care so much about social media, thus Bitcointalk forum social media accounts would never have so much traffic, and sooner or later may fade into oblivion. I think quite a lot of people stopped being too active on social media when they joined the forum, it happened to myself, and i'm pretty sure i am not the only one. The forum is more like everything enmeshed in one, so anything outside the forum might never be popular amongst the Bitcointalk community.This depends on how one takes it, because to me i see the forum as being social itself bit not only that it has been a source for an accurate accountable information point that educate and got members informed in a particular trends of news around the globe including the major target on bitcoin discussions,the kind of opportunities that lies with this forum is incomparable to other social media where no etiquettes is been kept or maintained, this forum is a one big community that is reserved as a citadel for information and knowledge and been social as well rendering diverse opportunities.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cointxz",
      "created_time": "January 06, 2023, 05:35:09 PM",
      "body": "Quote from: Aanuoluwatofunmi on January 06, 2023, 01:44:53 PMQuote from: Coyster on December 18, 2022, 09:53:21 PMMost users, like Theymos do not use or care so much about social media, thus Bitcointalk forum social media accounts would never have so much traffic, and sooner or later may fade into oblivion. I think quite a lot of people stopped being too active on social media when they joined the forum, it happened to myself, and i'm pretty sure i am not the only one. The forum is more like everything enmeshed in one, so anything outside the forum might never be popular amongst the Bitcointalk community.This depends on how one takes it, because to me i see the forum as being social itself bit not only that it has been a source for an accurate accountable information point that educate and got members informed in a particular trends of news around the globe including the major target on bitcoin discussions,the kind of opportunities that lies with this forum is incomparable to other social media where no etiquettes is been kept or maintained, this forum is a one big community that is reserved as a citadel for information and knowledge and been social as well rendering diverse opportunities. Forum is indeed a social media too because exchanging information. The only difference between forum and social was the way you interact on someone. Forum is topic basis which user attract to engage base on topics listed while social media mainly focus on personal things to engage interaction.Imho Social media is just the evolved form of the forum. Some forum already catching up the feature of social media like reddit. Bitcointalk is really the best social media for Bitcoin discussion if you want to see a more serious discussion and less troll/scammers that randomly posting on some post or comment. Twitter is garbage in terms of crypto discussion.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}