{
  "id": "topic_5437752",
  "title": "Rruchi man",
  "author": "Rruchi man",
  "created_time": "February 02, 2023, 10:22:29 AM",
  "content": "There are two categories of people when it comes to the choice of when to receive payment for work. There is the category that prefers it be paid weekly so they can off set bills as they come so they do not become a burden, while there is the category that prefers it monthly so they can plan well for the month.If employers put out the option before you to either to be paid weekly or monthly for your job, which will you prefer? Please give reasons asides the ones I have stated to support your answer.Would you prefer to be a contract staff for a company that is being paid a certain percentage for every job delivered, or would you prefer a job with a fixed monthly or weekly income? (Give a reason for your answer aside the reason that will be stated)With percentage earnings, you can earn more and you will be very motivated to work, but the disadvantage will be when there is no job.With Fixed earnings, you are sure of what to receive, but sometimes the workload you may encounter may be so much that the salary you are paid does not befit the work you put in.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5437752",
  "comments": [
    {
      "author": "Lucius",
      "created_time": "February 02, 2023, 11:25:30 AM",
      "body": "In my environment, people mostly work for a fixed monthly salary, which can be increased if they work on Sundays, holidays or at night, and I think that most people still prefer that way of payment. Maybe in some industries weekly salary payments make sense, but in most cases it just creates additional work for the administration, because it is much easier to calculate the salary once a month than every week.I also know that there are companies that, although they pay a fixed monthly salary, also motivate their employees with additional bonuses in the form of a percentage of sales. In this way, people who work in direct sales are motivated to try to sell as much as possible, because in addition to a regular salary, they can also expect additional earnings.I would therefore always opt for a fixed payment because it still provides much greater financial security, and I know a lot of people who do something extra in addition to their job, so sometimes you can get the best of both payment methods.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Synchronice",
      "created_time": "February 02, 2023, 11:40:01 AM",
      "body": "Quote from: Rruchi man on February 02, 2023, 10:22:29 AMThere are two categories of people when it comes to the choice of when to receive payment for work. There is the category that prefers it be paid weekly so they can off set bills as they come so they do not become a burden, while there is the category that prefers it monthly so they can plan well for the month.If employers put out the option before you to either to be paid weekly or monthly for your job, which will you prefer? Please give reasons asides the ones I have stated to support your answer.I prefer weekly payments, simply because I love early access on my money but most people prefer monthly payments and believe the reason behind it for majority is that they don't have good self-control and once they get money, they spend it immediately on entertainment, including clubs, drinks, clothes, restaurants, expensive food, etc.Because of lack of self-control, people prefer monthly salary, it also makes them happy when they see big numbers wholly deposited on their bank account.Quote from: Rruchi man on February 02, 2023, 10:22:29 AMWould you prefer to be a contract staff for a company that is being paid a certain percentage for every job delivered, or would you prefer a job with a fixed monthly or weekly income? (Give a reason for your answer aside the reason that will be stated)With percentage earnings, you can earn more and you will be very motivated to work, but the disadvantage will be when there is no job.With Fixed earnings, you are sure of what to receive, but sometimes the workload you may encounter may be so much that the salary you are paid does not befit the work you put in.Depends on company and type of job. There are companies where you work less and get pretty good fixed salary and there are companies where you work a lot and don't earn too much.For example, if you work in a tech store in a location where people rarely shop, you may prefer fixed salary but if you work in a location where a lot of people come, then commissions from sold items would generate much higher salary.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lovesmayfamilis",
      "created_time": "February 02, 2023, 11:55:40 AM",
      "body": "Quote from: Lucius on February 02, 2023, 11:25:30 AMI also know that there are companies that, although they pay a fixed monthly salary, also motivate their employees with additional bonuses in the form of a percentage of sales. In this way, people who work in direct sales are motivated to try to sell as much as possible, because in addition to a regular salary, they can also expect additional earnings.Yes, I worked in the field of sales, where there is a guaranteed payment, and it is much less than the percentage that the boss determines after successful purchases. It's really motivating. Just a guaranteed payment, which implies that you can do nothing, in theory, in the absence of buyers, and you will still not be left without money, is not so calming anymore, and there is always a desire to work better, call and invite customers, and engage in full product advertising.In addition, with a successful sale, there is also a moment of tipping, with which good and generous customers very often thank sales managers.Therefore, a fixed salary is nice for me, but it must be accompanied by good bonuses.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wexnident",
      "created_time": "February 02, 2023, 11:59:25 AM",
      "body": "Monthly. It's just something I'm used to I guess? And it also helps in setting up the general payments all at once in one sitting, compared to setting it up weekly. It's also the default method most companies use for paying their employees, so I pretty much got used to it already. Even with my signature campaign, I usually let it pile up and then only use it properly every month (though I do forget it sometimes and go past a few weeks). As for percentage vs fixed, I guess it depends on the job, but I'm more into fixed salary, it's much more stable after all. Though if more instances were to happen where the salary isn't worth the amount of work you'd put in most of the time, either get a raise or just leave and find a better job.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cointxz",
      "created_time": "February 02, 2023, 12:21:12 PM",
      "body": "When I’m a new employee without a family that needs to feed, I preferred the monthly salary because I can save all my money by limiting myself from expenses because I’m always tempted to buy things even if I didn’t need it when I see a sale on the mall. But this kind of thinking was changed when I have wife and kids because I think for my family first and I need money to sustain my family daily necessities including bills so I want to get my salary as much as possible. I believe preferences on salary will varies based on our priorities in life.As for the salary type. I preferred the percentage earning due to the nature of my work. My work is worth millions of dollars for the company but the company only paid me a fixed amount which is not even close to 0.01% percentage of my work value. Only sales job here has the feature of percentage base salary and the rest was fixed salary type. Sadly.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hyudien",
      "created_time": "February 02, 2023, 12:26:55 PM",
      "body": "Monthly or weekly salary is actually the same, the difference is when we receive our salary, of course. lol. So here we are actually being tested about our financial management, after all, if you talk about the nominal between weekly and monthly salaries, it's the same, isn't it? unless the weekly salary is greater than the monthly salary, or vice versa, we definitely prefer whichever is the largest. What is needed here once again I say is financial management, we must be good at managing our expenses every day, week and even every month.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DanWalker",
      "created_time": "February 02, 2023, 12:29:45 PM",
      "body": "Quote from: Rruchi man on February 02, 2023, 10:22:29 AMIf employers put out the option before you to either to be paid weekly or monthly for your job, which will you prefer? Please give reasons asides the ones I have stated to support your answer.Honestly, I hardly care about the salary that will be paid weekly or monthly. What I care about is how much they pay me when I work with them, and the payment cannot be delayed. Receiving a weekly or monthly salary, it is not so important because we will have appropriate adjustments and plans.Quote from: Rruchi man on February 02, 2023, 10:22:29 AMWould you prefer to be a contract staff for a company that is being paid a certain percentage for every job delivered, or would you prefer a job with a fixed monthly or weekly income? (Give a reason for your answer aside the reason that will be stated)I prefer working with a fixed monthly salary rather than a commission-based one. Because I like a job that is not too stressful and has a stable income so that I have more time to look for other opportunities for myself, such as investment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Taskford",
      "created_time": "February 02, 2023, 12:36:49 PM",
      "body": "Quote from: Rruchi man on February 02, 2023, 10:22:29 AMThere are two categories of people when it comes to the choice of when to receive payment for work. There is the category that prefers it be paid weekly so they can off set bills as they come so they do not become a burden, while there is the category that prefers it monthly so they can plan well for the month.If employers put out the option before you to either to be paid weekly or monthly for your job, which will you prefer? Please give reasons asides the ones I have stated to support your answer.Would you prefer to be a contract staff for a company that is being paid a certain percentage for every job delivered, or would you prefer a job with a fixed monthly or weekly income? (Give a reason for your answer aside the reason that will be stated)With percentage earnings, you can earn more and you will be very motivated to work, but the disadvantage will be when there is no job.With Fixed earnings, you are sure of what to receive, but sometimes the workload you may encounter may be so much that the salary you are paid does not befit the work you put in.Its rare to find weekly fixed salary especially when you are dealing with traditional jobs since most of those companies pay fixed monthly payments to their workers.But for me I would like to get weekly percentage pays because the earnings we can get will depends on the effort we put on the job since the more task we can do the huge the earnings we can get compare to fix salaries where even if we do all out efforts to the job the payments still the same.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "avikz",
      "created_time": "February 02, 2023, 12:53:59 PM",
      "body": "Quote from: Rruchi man on February 02, 2023, 10:22:29 AMWould you prefer to be a contract staff for a company that is being paid a certain percentage for every job delivered, or would you prefer a job with a fixed monthly or weekly income? (Give a reason for your answer aside the reason that will be stated)I will prefer a fixed job with a fixed salary over contractual opportunities. The reason is very simple as I have experienced it myself. I had worked as a contractual staff for 2 years. The main reason why I don't like it because no banks will offer loan to a contractual employee unless you are able to find a guarantor. Banks even deny secured loans like housing loan. I have experienced this myself. Things may be different in different countries. We still need the support from banks to buy any high value things like home or car. In my country, these are not available for a contractual employee. That's my reason!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "xSkylarx",
      "created_time": "February 02, 2023, 01:07:02 PM",
      "body": "Quote from: Rruchi man on February 02, 2023, 10:22:29 AMThere are two categories of people when it comes to the choice of when to receive payment for work. There is the category that prefers it be paid weekly so they can off set bills as they come so they do not become a burden, while there is the category that prefers it monthly so they can plan well for the month.If employers put out the option before you to either to be paid weekly or monthly for your job, which will you prefer? Please give reasons asides the ones I have stated to support your answer.Weekly payments from work are very rare right now, but I think most people want this, as we want money right away. Imagine you can receive it on a weekly basis, but I don't like being paid weekly; I prefer being paid every half of the month or a month long because you can save money and receive a big amount. Unlike on a weekly basis, on a monthly basis, you can really purchase things that you need using your bigger amount. I have also tried being paid every 15 days, which was also good, but the problem with this is how you will budget it with bills since it is not enough, so usually your end-of-month salary will be used for bills.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Spaceman1000$",
      "created_time": "February 02, 2023, 01:19:53 PM",
      "body": "I think I will be going for a weekly pay, because my bills comes in everyday, from the transport, electricity, food, internet service and miscellaneous expenditure all comes in on a daily basis.so weekly payment will help me plan and strategize myself on how to foot my bills on a weekly basis and keep up with my savings as against compounding them to 31 days which I believe as parents, it will be difficult to keep up with the day to day running of the family because wanting to wait till the end of 31 days before getting paid will leave you lagging behind with your bills. sometimes because of the lengthy days, you must have borrowed from a friend to keep up with a sudden need, and that will make you struggle to keep up with a lot of things.In terms of the job preference, I think I will go for a job with a fixed monthly or weekly income because it will help determined the scale of things I can budget for myself on a weekly or monthly basis.If the work load is too much, at the long run I will apply for increase in wage.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AverageGlabella",
      "created_time": "February 02, 2023, 01:25:15 PM",
      "body": "Weekly pay is always preferred because you can manage your expenses better and there is no chance of missing a payment because you get paid at the end of the month. Most companies like to pay monthly because its a reduction on the workload and expenses of their accountant. Most bills are converting to monthly because of this but I remember years ago it was always weekly pay and you always looked forward to pay day and would use that to go out. These days you have to manage your money more closely because you have to wait for the end of the month and then plan next months expenses to make sure you do not use all your money. Luckily I am past that stage in my life but I would hate to have monthly payments.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hydrogen",
      "created_time": "February 02, 2023, 01:31:24 PM",
      "body": "Quote from: Rruchi man on February 02, 2023, 10:22:29 AMWith percentage earnings, you can earn more and you will be very motivated to work, but the disadvantage will be when there is no job.With Fixed earnings, you are sure of what to receive, but sometimes the workload you may encounter may be so much that the salary you are paid does not befit the work you put in.An example of percentage earnings, would be commissions in sales. Unfortunately percentage based earnings are not inflation or recession protected assets. Rising fossil fuel, food costs and inflation can quickly diminish disposable income. Which results in decreasing sales across the board. Decreasing sales correlate with decreasing commissions. Making percentage based earnings less desirable under inflation and recession conditions.Fixed earnings would probably be the more stable and high demand wage model for inflation and recession conditions. Sales, disposable income and consumer markets would likely plummet during this time. Which could make fixed earnings the better salary model for most.Of course there are exceptions to this. Luxury items and markets catering to the wealthy would not be as affected by inflation or recession. Commission based sales in those markets could still remain viable.Personally, I would rather be paid weekly than monthly. I'm not certain anyone would prefer to be paid on a monthly basis. Although I would be curious to know their reasons for it, if it were the case.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Erumo",
      "created_time": "February 02, 2023, 02:21:36 PM",
      "body": "I haven never had weekly paid job. I have only experienced monthly pay and piecework. I prefer monthly pay. That is more convenient. We have monthly utility bills, usually monthly subscriptions and etc. With weekly pay, I find it more difficult to follow expenses, savings, planning with such payment graphs. I find it easier to spend all your money when you are paid weekly. Coz after all expenses are done, you end with a smaller amount, then with monthly payment minus expenses. Easier to take a decision to spend if you have 50 dollars left and few days before next pay, comparing when you have 1500 dollars and 3 more weeks until pay.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yatsan",
      "created_time": "February 02, 2023, 03:02:19 PM",
      "body": "A weekly paid job would be more sustainable and would be more reliable with stability of one's daily living. Monthly is what's common but often yields to the employee not being able to save because throughout the month, money is being consumed not unlike with weekly wherein an individual could save on every cut off for future purposes. In terms of fixed or percentage payment, I'd also stick with fixed one. But if is regarding bigger salary? Ofcourse percentage basis would make sky, the limit. Problem is to exert extra effort to generate bigger salary because it would be somehow an output based. If you won't have something to present then don't expect for a high return.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yogee",
      "created_time": "February 02, 2023, 03:24:45 PM",
      "body": "I don't really see the point of others about spending or saving money on a weekly or a monthly basis. How you'll manage your expenses will be the same no matter the method of payment.I prefer weekly payment as a matter of protection from potential losses. I mean you'll have an idea sooner whether you will get or not when you're on a weekly payroll compared to those getting monthly. This option is particularly good for service contractors.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sana54210",
      "created_time": "February 02, 2023, 03:29:03 PM",
      "body": "Quote from: Rruchi man on February 02, 2023, 10:22:29 AMIf employers put out the option before you to either to be paid weekly or monthly for your job, which will you prefer? Please give reasons asides the ones I have stated to support your answer.In my country and tradition, low profile workers do get paid daily and higher-end executives do fix the salary per annum basis and will get paid monthly. Weekly salary is not in use here.If an employer is ready to pay me weekly and monthly then I am glad to get weekly salary on every week and monthly salary on every month, I will not have any objection.... lol; just kidding. When my bills are monthly basis, then I guess I should opt for monthly salary. I guess there is no commitment in my country for weekly so no weekly paying jobs as well but here fortunately bitcointalk campaigns are paying weekly basis (there were campaigns paid fortnight and monthly as well).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "alastantiger",
      "created_time": "February 02, 2023, 03:31:22 PM",
      "body": "Monthly pay please. Things are too tough and difficulty to right now to choose weekly pay that may not be consistent. I can't deal with that. Especially when you have dependents. Monthly pay, you are sure at it comes in come rainfall or sunshine and one may actually have the opportunity to do some side gigs. This is not the case with weekly pay that may consume your time and energy and give you no room to do other things. It is too risky in my opinion.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rikafip",
      "created_time": "February 02, 2023, 03:50:10 PM",
      "body": "Quote from: alastantiger on February 02, 2023, 03:31:22 PM Things are too tough and difficulty to right now to choose weekly pay that may not be consistent. I can't deal with that. Especially when you have dependents. Monthly pay, you are sure at it comes in come rainfall or sunshine and one may actually have the opportunity to do some side gigs. This is not the case with weekly pay that may consume your time and energy and give you no room to do other things. It is too risky in my opinion.Why would weekly pay be less reliable and consistent than a monthly pay and consume more energy? As long as you have a secure job, it shouldn't matter to your employed whether they send you the salary salary on the weekly, bi-weekly or a monthly basis.Having said that, in my country monthly pay is a standard and since I got used to plan my expenditures that way, I wouldn't like to change it to a different schedule. And I prefer a fixed salary simply due stability. One thing I would like to see different though is if people in my country are aware of their gross salary because everyone here speaks only in net terms, just because so they know how much government acvtually takes from them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}