{
  "id": "topic_5450855",
  "title": "Charles-Tim",
  "author": "Charles-Tim",
  "created_time": "May 01, 2023, 01:01:51 PMLast edit: May 01, 2023, 08:39:11 PM by Charles-Tim",
  "content": "According to Bloomberg, the SEC is not regulating exchanges that lists cryptocurrencies like bitcoin, ether and others. The SEC wants to regulate exchanges that lists tokenized coin offerings backed by assets including equity, debt and property.Quote from: https://www.bnnbloomberg.ca/nigeria-s-sec-plans-to-allow-asset-backed-tokens-but-not-crypto-1.1914338.amp.htmlThe SEC is considering permitting tokenized coin offerings on licensed digital exchanges that are backed by assets including equity, debt, property but “not crypto,” Abdulkadir Abbas, head of securities and investment services at the Abuja-based commission said in an interview in Lagos. “We always like to start, as a regulator, with a very simple clear proposal before we go into the complex ones.”The SEC is not ready to regulate cryptocurrencies like bitcoin and others because they are waiting for the CBN. Is this not funny? Although, I am surprised that without regulation, there is no world standard known exchange in Nigeria. Most exchanges started in the past with no regulation until regulators are looking into them for possible regulations.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5450855",
  "comments": [
    {
      "author": "She shining",
      "created_time": "May 01, 2023, 03:14:12 PM",
      "body": "Quote from: Charles-Tim on May 01, 2023, 01:01:51 PMThe SEC wants to regulate exchanges that lists tokenized coin offerings backed by assets including equity, debt and property.The SEC is focused in security's so regulating companies that deals with tokenized coin backed by an asset falls under security, their jurisdiction, but the ongoing case of SEC and XRP has proven that it has yet to be stated if ethereum and others are securities or commodities (which Bitcoin has been categorized as).Quote from: Charles-Tim on May 01, 2023, 01:01:51 PMThe SEC is not ready to regulate cryptocurrencies like bitcoin and others because they are waiting for the CBN. Is this not funny? Although, I am surprised that without regulation, there is no world standard known exchange in Nigeria. Most exchanges started in the past with no regulation until regulators are looking into them for possible regulations.Maybe its because CBN can be considered their 'parent', besides no country has created a body to regulate crypto currency in a country except El Salvador who left it in the hands of their court of account. In all I think a law needs to be made first to regulate cryptocurrency before SEC or CBN can temporary supercede, Afterwards an independent body would be created to regulate it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hyphen(-)",
      "created_time": "May 01, 2023, 05:26:26 PM",
      "body": "Quote from: Charles-Tim on May 01, 2023, 01:01:51 PMAccording to Bloomberg, the SEC is not regulating exchanges that lists cryptocurrencies like bitcoin, ether and others. The SEC wants to regulate exchanges that lists tokenized coin offerings backed by assets including equity, debt and property.I just know say \"there is no smoke without fire\".In my opinion, the Nigerian Government just wan use this medium start something related to cryptocurrency so that when they ready to legalize cryptocurrency e go they easy and them as them go don use this one to monitor the way the process go be.QuoteQuote from: https://www.bnnbloomberg.ca/nigeria-s-sec-plans-to-allow-asset-backed-tokens-but-not-crypto-1.1914338.amp.htmlThe SEC is considering permitting tokenized coin offerings on licensed digital exchanges that are backed by assets including equity, debt, property but “not crypto,” Abdulkadir Abbas, head of securities and investment services at the Abuja-based commission said in an interview in Lagos. “We always like to start, as a regulator, with a very simple clear proposal before we go into the complex ones.”The SEC is not ready to regulate cryptocurrencies like bitcoin and others because they are waiting for the CBN. Is this not funny? Although, I am surprised that without regulation, there is no world standard known exchange in Nigeria. Most exchanges started in the past with no regulation until regulators are looking into them for possible regulations.The matter actually de funny, as dem talk say dem they wait for CBN directives to see if dem go legalize am.Some people no actually no the difference between these Asset-Backed Tokens and Cryptocurrency, therefore the public might misinterpret it and start saying that Nigeria is about to legalize crypto.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "May 02, 2023, 12:06:34 PM",
      "body": "Quote from: She shining on May 01, 2023, 03:14:12 PMThe SEC is focused in security's so regulating companies that deals with tokenized coin backed by an asset falls under security, their jurisdiction, but the ongoing case of SEC and XRP has proven that it has yet to be stated if ethereum and others are securities or commodities (which Bitcoin has been categorized as).Refer to other SEC with the name of their country because you refer to both Nigeria SEC and Untied States SEC, but people will only consider SEC as Nigeria SEC on this local board. Mention others with their country name next time. Example: United States SEC.About considering a coin or some categories of coins and tokens as securities or commodities depends on the government, they have the final say about this, but commodity regulor is not yet claiming that any cryptocurrencies is a commodity yet. Let use see how the whole thing will be in the future, it is not what we got good answer to, for now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}