{
  "id": "topic_5405494",
  "title": "Cnut237",
  "author": "Cnut237",
  "created_time": "July 07, 2022, 10:20:44 AM",
  "content": "Meanwhile, in a benighted little backwater nation, just off the coast of Europe... Boris Johnson has this morning finally acknowledged that his position is untenable, and has promised to resign as Prime Minister. I've lost count, but he's probably the last minister remaining, as all the others seem to have resigned their posts already.However, he says he wants to remain in charge until the autumn. Given his Trumpish personality and history, will he actually leave voluntarily later this year, or is he planning to use the next few months to rile up his base of racists, xenophobes and other assorted bigots and half-wits, and turn them into his own private militia, ready to storm the Capitol parliament just after Christmas (say, Jan 6th?) and 'take back control'?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5405494",
  "comments": [
    {
      "author": "suchmoon",
      "created_time": "July 07, 2022, 01:04:24 PM",
      "body": "Isn't November 5th the traditional date of doing bad things to the parliament?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cnut237",
      "created_time": "July 07, 2022, 01:11:32 PM",
      "body": "Quote from: suchmoon on July 07, 2022, 01:04:24 PMIsn't November 5th the traditional date of doing bad things to the parliament?You have a point. If Johnson can drag this thing out for another couple of years, he can time his assault on democracy to coincide with the one Trump has scheduled for November 5th 2024.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BADecker",
      "created_time": "July 07, 2022, 03:03:28 PM",
      "body": "Trump LiteExcept that Trump Heavy is coming in 2024, but maybe sooner.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cnut237",
      "created_time": "July 07, 2022, 03:50:52 PM",
      "body": "Quote from: BADecker on July 07, 2022, 03:03:28 PMTrump HeavyMethane is lighter than air. But I suppose it depends on what he's eaten, there's probably some other stuff mixed in there.Quote from: BADecker on July 07, 2022, 03:03:28 PMis coming in 2024, but maybe sooner.Sooner, really? Do you have news on the kraken? I can't wait*.*I mean, I can wait, but I've been waiting so long already, and absolutely nothing has happened.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BADecker",
      "created_time": "July 07, 2022, 04:15:08 PM",
      "body": "Quote from: Cnut237 on July 07, 2022, 03:50:52 PMQuote from: BADecker on July 07, 2022, 03:03:28 PMTrump HeavyMethane is lighter than air. But I suppose it depends on what he's eaten, there's probably some other stuff mixed in there.Quote from: BADecker on July 07, 2022, 03:03:28 PMis coming in 2024, but maybe sooner.Sooner, really? Do you have news on the kraken? I can't wait*.*I mean, I can wait, but I've been waiting so long already, and absolutely nothing has happened.The final analysis on the Kraken is this. It seems that Trump was shocked at the unexpected amount of Dem and other forceful evil and corruption in the election. He actually woke up to just how deeply rooted the Deep State is in its corruption. So...He backed off to study and learn, and to prepare his war against evil for 2024... and to fight in other ways. But will he even run in 2024? After all, he is realizing that general old age is attacking him, if in ways different than the way it's attacking Biden, still, it is attacking him.If Trump doesn't run, who will the Reps bring in? Biden won't run, so who will the Dems bring in? I don't see any big talk about anybody other than Trump. This doesn't mean that the Dems don't have a plan. After all, out of nowhere they pushed Obama into office back then.If Trump doesn't run, I hope they get someone who is far more expert and destroying the Deep State than Trump was. Or, if he runs, I hope he has learned how to destroy the Deep State for good this time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DooMAD",
      "created_time": "July 07, 2022, 04:55:02 PM",
      "body": "The blonde blowhard's resignation comes as no solace for me.  He'll be replaced with someone equally as useless, greedy and corrupt.  There isn't a single front-bench Tory that I would feel comfortable with in charge of the UK.  Britain is destined to be a run-down nation governed by thieving kleptocrats because the voting public are absolute fucking morons.  Scotland and Wales, if they have any sense, should demand independence as soon as they possibly can.  It's only going to get worse.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cnut237",
      "created_time": "July 07, 2022, 05:20:17 PM",
      "body": "Quote from: DooMAD on July 07, 2022, 04:55:02 PMThe blonde blowhard's resignation comes as no solace for me.  He'll be replaced with someone equally as useless, greedy and corrupt.  There isn't a single front-bench Tory that I would feel comfortable with in charge of the UK.  Britain is destined to be a run-down nation governed by thieving kleptocrats because the voting public are absolute fucking morons.  Scotland and Wales, if they have any sense, should demand independence as soon as they possibly can.  It's only going to get worse.  Yes, I agree completely. Except I might replace \"single front-bench Tory\" with \"single Tory\".",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zlantann",
      "created_time": "July 07, 2022, 06:11:20 PM",
      "body": "Quote from: Cnut237 on July 07, 2022, 10:20:44 AMMeanwhile, in a benighted little backwater nation, just off the coast of Europe... Boris Johnson has this morning finally acknowledged that his position is untenable, and has promised to resign as Prime Minister. I've lost count, but he's probably the last minister remaining, as all the others seem to have resigned their posts already.However, he says he wants to remain in charge until the autumn. Given his Trumpish personality and history, will he actually leave voluntarily later this year, or is he planning to use the next few months to rile up his base of racists, xenophobes and other assorted bigots and half-wits, and turn them into his own private militia, ready to storm the Capitol parliament just after Christmas (say, Jan 6th?) and 'take back control'?The UK have stronger political systems than the US. They have a workable checks and balance institutions that ensure that the Prime Ministers doesn't act like Emperors. And I think British politicians are morally stable than their US counterparts. In few days, we have seen almost the entire cabinet members (more than 50 ministers) resign. But in the face of his grievous political sins, Donald Trump was still surrounded by sycophants that supported and treated him like an emperor. They defended his actions and tagged every form of criticism as political witch-hunting. Prime Minister Boris Johnson has lost the confidence of his strong supporters, hence he would leave immediately his successor is chosen.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gyfts",
      "created_time": "July 07, 2022, 06:34:42 PM",
      "body": "Quote from: Zlantann on July 07, 2022, 06:11:20 PMQuote from: Cnut237 on July 07, 2022, 10:20:44 AMMeanwhile, in a benighted little backwater nation, just off the coast of Europe... Boris Johnson has this morning finally acknowledged that his position is untenable, and has promised to resign as Prime Minister. I've lost count, but he's probably the last minister remaining, as all the others seem to have resigned their posts already.However, he says he wants to remain in charge until the autumn. Given his Trumpish personality and history, will he actually leave voluntarily later this year, or is he planning to use the next few months to rile up his base of racists, xenophobes and other assorted bigots and half-wits, and turn them into his own private militia, ready to storm the Capitol parliament just after Christmas (say, Jan 6th?) and 'take back control'?The UK have stronger political systems than the US. They have a workable checks and balance institutions that ensure that the Prime Ministers doesn't act like Emperors. And I think British politicians are morally stable than their US counterparts. In few days, we have seen almost the entire cabinet members (more than 50 ministers) resign. But in the face of his grievous political sins, Donald Trump was still surrounded by sycophants that supported and treated him like an emperor. They defended his actions and tagged every form of criticism as political witch-hunting. Prime Minister Boris Johnson has lost the confidence of his strong supporters, hence he would leave immediately his successor is chosen. Wait till you realize that most politicians are rotten to the core. Boris Johnson wasn't terrible. Conservatives are already perceived as morally corrupt therefore worthy of contemptuous attacks so once you peel that notion off of him, he isn't like Trump at all. Trump isn't even a conservative, he just pretends to be one. Boris Johnson could be pretending too, he might be a better actor",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DooMAD",
      "created_time": "July 07, 2022, 07:18:38 PM",
      "body": "Quote from: Zlantann on July 07, 2022, 06:11:20 PMAnd I think British politicians are morally stable than their US counterparts. In few days, we have seen almost the entire cabinet members (more than 50 ministers) resign. You're definitely giving them too much credit.  They're merely bowing to public perception.  Every single MP who has just resigned publicly supported Johnson up until that moment.  It's not like they suddenly grew a conscience.  They simply realised Johnson was doing too much damage to their chances at the next election.  They aren't resigning because they disagree with anything Johnson has done.  They're resigning because the court of public opinion won't let Johnson get away with it anymore and these MPs don't want to be seen as being associated with that.  They're just shallow opportunists.  Nothing more.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TheNineClub",
      "created_time": "July 07, 2022, 09:26:23 PM",
      "body": "Quote from: Cnut237 on July 07, 2022, 10:20:44 AMMeanwhile, in a benighted little backwater nation, just off the coast of Europe... Boris Johnson has this morning finally acknowledged that his position is untenable, and has promised to resign as Prime Minister. I've lost count, but he's probably the last minister remaining, as all the others seem to have resigned their posts already.However, he says he wants to remain in charge until the autumn. Given his Trumpish personality and history, will he actually leave voluntarily later this year, or is he planning to use the next few months to rile up his base of racists, xenophobes and other assorted bigots and half-wits, and turn them into his own private militia, ready to storm the Capitol parliament just after Christmas (say, Jan 6th?) and 'take back control'?No he's not planing anything like that. Firstly he dosen't have that pull that Trump had, that cult of personality. Secondly, the only ones the public (for some reason) likes over there are some of the royal familly, but besides that, the majority of the politicians really don't have that strong of a support.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PrimeNumber7",
      "created_time": "July 08, 2022, 08:26:37 AM",
      "body": "Quote from: Cnut237 on July 07, 2022, 10:20:44 AMBoris Johnson has this morning finally acknowledged that his position is untenable, and has promised to resign as Prime Minister. I blame this largely on his imposing crazy covid policies that are not rooted in science. They are so unrooted in science, that he displayed that the restrictions were worthless by repeatedly violated these policies. The UK political system seems to be fairly strange. Perhaps the July 4th committee in the UK can learn something from the January 6th committee in the US, and vice versa.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cnut237",
      "created_time": "July 08, 2022, 10:59:35 AM",
      "body": "Quote from: PrimeNumber7 on July 08, 2022, 08:26:37 AMThe UK political system seems to be fairly strange.It has a lot in common with other capitalist democracies, in that the capitalist element invariably subverts the democracy element. Money is a synonym for (and often a quantification of) power, and those with money are able to manipulate the electorate, often through their friends in the media.One element that makes the UK worse than many similar nations is that we never had a French-style revolution, we still have a monarch, lords and ladies, barons, \"knights\", etc. The Conservative part is the party of old money, the old boys club who have trodden the same path from Eton school to a PPE degree at Oxbridge and then into politics. Then throw in a few women and non-white faces as a superficial concession to modernity. Boris Johnson is the embodiment of a tradition going back centuries, the talentless, arrogant, entitled rich boy to whom the rules that everyone else has to live by simply don't apply.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "July 08, 2022, 04:47:24 PM",
      "body": "ive never supported the conservatives however this silly drama about throwing out a PM over a lie about a social event does not even come close to comparison to bombing civilians or threatening nuclear war in the past.i find it funny how british ministers stood back and said \"we dont think putin is bad enough for us to send troops in and take him off his seat. but boris had a few drinkies with his (non-risk) work bubble colleagues, he needs to go\"that said. yes boris lied. and someone with his wealth and position should have at best/worse just said \"F*CK it, yea i had a party, my staff needed it after 2 years of keeping this country alive, ill own up, ill pay the fines 10x over and even donate to many charities, now lets move on and do the job of politics\" right from the startinstead he lied, and lied and lied hiding the parties denying his involvement and trying his damned hardest to not pay a fine, which to him is less than a parking ticket.the things i despise is all the silly pokes of \"oh you dont comb your hair, must mean your not organised, you should step down\"or\"you are not wearing the traditional blue tie, you must step down\"\"your too old...\" \"your too young.. \" \"your to blonde...\"you know the silly petty reasons they try to get someone thrown out.yes he lied. but he never done putin-esq level of tyranny. he didnt even tell people to drink bleach and swallow light bulbs or go invade parliament and trash things.. so i see it as petty lies in comparison to the real world events playing out.a 'loss of confidence' is a bubble in an ocean compared to tyrannical dictators making people literally fear for their lives.yes he made the no party rule so he should be the top guy enforcing the rule not the one breaking the rule.but if rules were to be broken. a politician should have the confidence and the determination to stand by his actions. own up and pay the penalty. no lies, no evasion. just confidence. reasoning and explanation and paying the penaltyi cannot see anyone having what i would consider the balls to do the job properly. they are all stupid and selfish with their own priorities and side businesses they care about more..take rishi sunak.. when treasurer (AKA taxman #1). he should have been the tax enforcer. yet. he let his own wife evade billions in taxes, and then said that there are not even just a couple billions in the treasury to uplift the poorest peoples income by £20 a week.. hypocritelets his wife keep billions but doesnt think the treasury can cope with letting millions have just £20",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TwitchySeal",
      "created_time": "July 09, 2022, 02:44:15 AM",
      "body": "Quote from: PrimeNumber7 on July 08, 2022, 08:26:37 AMQuote from: Cnut237 on July 07, 2022, 10:20:44 AMBoris Johnson has this morning finally acknowledged that his position is untenable, and has promised to resign as Prime Minister. I blame this largely on his imposing crazy covid policies that are not rooted in science. They are so unrooted in science, that he displayed that the restrictions were worthless by repeatedly violated these policies. The UK political system seems to be fairly strange. Perhaps the July 4th committee in the UK can learn something from the January 6th committee in the US, and vice versa. Perhaps they have already learned something from the J6 committee.  Let a sociopath in power get away with too much and eventually he will try and steal your democracy.Quote from: franky1 on July 08, 2022, 04:47:24 PMive never supported the conservatives however this silly drama about throwing out a PM over a lie about a social event Party gate is old news, he survived it. Quote from: BADecker on July 07, 2022, 04:15:08 PMThe final analysis on the Kraken is this. It seems that Trump was shocked at the unexpected amount of Dem [votes]and other forceful evil and corruption in the election.fyp",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PrimeNumber7",
      "created_time": "July 09, 2022, 07:25:38 AM",
      "body": "Quote from: TwitchySeal on July 09, 2022, 02:44:15 AMQuote from: PrimeNumber7 on July 08, 2022, 08:26:37 AMQuote from: Cnut237 on July 07, 2022, 10:20:44 AMBoris Johnson has this morning finally acknowledged that his position is untenable, and has promised to resign as Prime Minister. I blame this largely on his imposing crazy covid policies that are not rooted in science. They are so unrooted in science, that he displayed that the restrictions were worthless by repeatedly violated these policies. The UK political system seems to be fairly strange. Perhaps the July 4th committee in the UK can learn something from the January 6th committee in the US, and vice versa. Perhaps they have already learned something from the J6 committee.  Let a sociopath in power get away with too much and eventually he will try and steal your democracy.There is no evidence that Johnson is going to try to \"steal\" democracy.Johnson campaigned as being a conservative, but when he governed, he was governing from the left. This is basically the same as Biden -- he campaigned as being a moderate, but has governed from the far, radical left.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "be.open",
      "created_time": "July 11, 2022, 06:58:51 AM",
      "body": "Looks like Scholz is next.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DooMAD",
      "created_time": "July 11, 2022, 03:27:47 PM",
      "body": "Quote from: PrimeNumber7 on July 09, 2022, 07:25:38 AMJohnson campaigned as being a conservative, but when he governed, he was governing from the left. LOLWHUT?If Boris Johnson is left-wing, then I'm the fucking Intergalactic Space Pope.  I'm fairly sure you're being unintentionally hilarious, but just no.  Boris Johnson is continuing the tory trend of asset-stripping public services to sell to private companies.  He believes in private health insurance rather than an NHS which is free at the point of need.  His primary interest in taking the UK out of the European Union is slashing consumer protections, environmental protections and workers rights in order to benefit private companies.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TwitchySeal",
      "created_time": "July 11, 2022, 11:30:36 PM",
      "body": "Quote from: PrimeNumber7 on July 09, 2022, 07:25:38 AMQuote from: TwitchySeal on July 09, 2022, 02:44:15 AMQuote from: PrimeNumber7 on July 08, 2022, 08:26:37 AMQuote from: Cnut237 on July 07, 2022, 10:20:44 AMBoris Johnson has this morning finally acknowledged that his position is untenable, and has promised to resign as Prime Minister. I blame this largely on his imposing crazy covid policies that are not rooted in science. They are so unrooted in science, that he displayed that the restrictions were worthless by repeatedly violated these policies. The UK political system seems to be fairly strange. Perhaps the July 4th committee in the UK can learn something from the January 6th committee in the US, and vice versa. Perhaps they have already learned something from the J6 committee.  Let a sociopath in power get away with too much and eventually he will try and steal your democracy.There is no evidence that Johnson is going to try to \"steal\" democracy.Johnson campaigned as being a conservative, but when he governed, he was governing from the left. This is basically the same as Biden -- he campaigned as being a moderate, but has governed from the far, radical left. You know he put into motion a plan to ship refugees to Rwanda, right?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}