{
  "id": "topic_5521777",
  "title": "Wonder Work",
  "author": "Wonder Work",
  "created_time": "December 05, 2024, 08:01:10 PM",
  "content": "Four years ago he thought Bitcoin price would never reach 100k. I think he had no idea about Bitcoin. A few days ago I saw a post like this, NotAeTher made a post, that is PeterSchiff said this a long time ago.PeterSchiff said it through his tweet that Bitcoin price will never reach 100k. It will just have to be a dream, he made such comments. I think he has no confidence in Bitcoin, he always says reactionary things.If I had something to say to him at this moment, I would say it in the language of a story (you must know the story of the tortoise and the hare. The hare, despite being a fast animal, lost to the slow tortoise). He wants to tell you that Bitcoin is a coin that has very good stability, without which the crypto market cannot be expected. It is not right for you to make such comments about it. We have seen many ups and downs in the market, but we are not disappointed at all because Bitcoin has gradually reached its milestone in the final stage.What kind of comments would you have made to Peter Schiff at this moment? Do you think he actually made this comment correctly?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5521777",
  "comments": [
    {
      "author": "Rruchi man",
      "created_time": "December 06, 2024, 10:19:55 AM",
      "body": "Quote from: Wonder Work on December 05, 2024, 08:01:10 PMWhat kind of comments would you have made to Peter Schiff at this moment? Do you think he actually made this comment correctly?In most cases, I would just read through without giving a response, but if I must respond, I would say that he's entitled to his opinions, and it's okay to think as he wants.It most likely would have been very futile trying to convince somebody who already has a rigid opinion formed; the best thing in most cases is to allow time to tell, which it has done in this case. Time has shown everyone that someone as knowledgeable as Peter Schiff, who is a stockbroker, economist, and financial advisor, can be very wrong in their opinions. I hope he has now accepted the errors of his thinking.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SmartGold01",
      "created_time": "December 06, 2024, 10:39:36 AM",
      "body": "Quote from: Wonder Work on December 05, 2024, 08:01:10 PMWhat kind of comments would you have made to Peter Schiff at this moment? Do you think he actually made this comment correctly?To me it's ignorant and lack of foresight he didn't know what he was saying. Though I can specifically say that he had no knowledge about bitcoin and he wasn't that into crypto-space to know what was the true vision of bitcoin. The only thing I would say to him is not to lose hope in everything he is doing because he seems to have lost hope in bitcoin when at the new stage and I believe bitcoin is till young there will be more stumbling results from bitcoin only if he would still believe again and take chance of what he has missed four years ago.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ultrloa",
      "created_time": "December 06, 2024, 10:45:53 AM",
      "body": "Quote from: SmartGold01 on December 06, 2024, 10:39:36 AMQuote from: Wonder Work on December 05, 2024, 08:01:10 PMWhat kind of comments would you have made to Peter Schiff at this moment? Do you think he actually made this comment correctly?To me it's ignorant and lack of foresight he didn't know what he was saying. Though I can specifically say that he had no knowledge about bitcoin and he wasn't that into crypto-space to know what was the true vision of bitcoin. The only thing I would say to him is not to lose hope in everything he is doing because he seems to have lost hope in bitcoin when at the new stage and I believe bitcoin is till young there will be more stumbling results from bitcoin only if he would still believe again and take chance of what he has missed four years ago.Well that indicate that everything he say is wrong and for sure he lose his credibility when bitcoin successfully reached at $100k since that is big slap on his face that everything he think about bitcoin is wrong.Now I guess its better not to talk about that guy anymore since we are just giving him unnecessary exposure by mentioning his name. I think its enough that Bitcoin prove him wrong and for sure many people already know that he's just another clown in the scene. For sure there would be a lot more for bitcoin and let see on where does bitcoin take us especially if we are consistently taking good decision to continue accumulating.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "betswift",
      "created_time": "December 06, 2024, 10:47:40 AM",
      "body": "Quote from: Rruchi man on December 06, 2024, 10:19:55 AMQuote from: Wonder Work on December 05, 2024, 08:01:10 PMWhat kind of comments would you have made to Peter Schiff at this moment? Do you think he actually made this comment correctly?In most cases, I would just read through without giving a response, but if I must respond, I would say that he's entitled to his opinions, and it's okay to think as he wants.It most likely would have been very futile trying to convince somebody who already has a rigid opinion formed; the best thing in most cases is to allow time to tell, which it has done in this case. Time has shown everyone that someone as knowledgeable as Peter Schiff, who is a stockbroker, economist, and financial advisor, can be very wrong in their opinions. I hope he has now accepted the errors of his thinking. Agreed. Better for such people to just be left and to push forward yourself.It's his loss, not yours.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fikrett",
      "created_time": "December 06, 2024, 10:53:06 AM",
      "body": "Quote from: SmartGold01 on December 06, 2024, 10:39:36 AMQuote from: Wonder Work on December 05, 2024, 08:01:10 PMWhat kind of comments would you have made to Peter Schiff at this moment? Do you think he actually made this comment correctly?To me it's ignorant and lack of foresight he didn't know what he was saying. Though I can specifically say that he had no knowledge about bitcoin and he wasn't that into crypto-space to know what was the true vision of bitcoin. The only thing I would say to him is not to lose hope in everything he is doing because he seems to have lost hope in bitcoin when at the new stage and I believe bitcoin is till young there will be more stumbling results from bitcoin only if he would still believe again and take chance of what he has missed four years ago.Everybody has a second chance with BTC.The only thing that matters is the willingness to dive into it and understand it. Believe in it and understand what happens with it as time goes on.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SmartGold01",
      "created_time": "December 06, 2024, 11:16:35 AM",
      "body": "Quote from: ultrloa on December 06, 2024, 10:45:53 AMQuote from: SmartGold01 on December 06, 2024, 10:39:36 AMQuote from: Wonder Work on December 05, 2024, 08:01:10 PMWhat kind of comments would you have made to Peter Schiff at this moment? Do you think he actually made this comment correctly?To me it's ignorant and lack of foresight he didn't know what he was saying. Though I can specifically say that he had no knowledge about bitcoin and he wasn't that into crypto-space to know what was the true vision of bitcoin. The only thing I would say to him is not to lose hope in everything he is doing because he seems to have lost hope in bitcoin when at the new stage and I believe bitcoin is till young there will be more stumbling results from bitcoin only if he would still believe again and take chance of what he has missed four years ago.Well that indicate that everything he say is wrong and for sure he lose his credibility when bitcoin successfully reached at $100k since that is big slap on his face that everything he think about bitcoin is wrong.Now I guess its better not to talk about that guy anymore since we are just giving him unnecessary exposure by mentioning his name. I think its enough that Bitcoin prove him wrong and for sure many people already know that he's just another clown in the scene. For sure there would be a lot more for bitcoin and let see on where does bitcoin take us especially if we are consistently taking good decision to continue accumulating.Bitcoin future is till bright and if bitcoin could hit 100k plus by 2024 what more of next 16 years to come, and of course there is every possibility and tendency that it may work on the reversed but I don't think that would happened but we can expect unexpected from the from the cryptospace. My person overview I still have this believed that we would break newer price before the next year over, we may like see bitcoin at 250k or above, especially now that lot of institutions and government is involved.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Synchronice",
      "created_time": "December 06, 2024, 11:23:12 AM",
      "body": "To be honest, I didn't know Peter Schiff before seeing these threads on Bitcointalk about him but I wouldn't be too quick to judge him for that tweet because we are humans and we make mistakes. Quick google result shows me that he is one of a few who accurately predicted the housing and financial crisis and he deservers a merit for that. We weren't 100% sure that Bitcoin ETFs would be approved, we weren't sure about many things. Now there is a war between Russia and Ukraine, this war probably also boosts the usage of Bitcoin (if you saw Putin's last interview, you know what I'm talking about).He made a mistake and that's all but my suggestion to every famous economist would be to not make a prediction out of thin air, it affects their reputation and they should be more careful when they predict something.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MusaMohamed",
      "created_time": "December 06, 2024, 11:24:16 AM",
      "body": "Quote from: Wonder Work on December 05, 2024, 08:01:10 PMFour years ago he thought Bitcoin price would never reach 100k. I think he had no idea about Bitcoin. A few days ago I saw a post like this, NotAeTher made a post, that is PeterSchiff said this a long time ago.It can be a continuous discussion in a thread created by NotATether too.QuoteWhat kind of comments would you have made to Peter Schiff at this moment? Do you think he actually made this comment correctly?You can have your own thinking that can be different than Peter Schiff's but you, me and Peter Schiff must respect differences, it's basic. Furthermore, by sharing this news, and by being in this market a long time, I believe that you already knew well and enough about Peter Schiff. He is pro-Gold and by that he is Anti-Bitcoin, so do you think you will be able to change him?My answer is \"I can not change Peter Schiff\", and probably you can not too, Bitcoin can not too. Let him be with his obsession about Gold and hate against Bitcoin. Without Peter Schiff, Bitcoin has been continuing its growth in adoption and price very well.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitterguy28",
      "created_time": "December 06, 2024, 11:53:49 AM",
      "body": "Quote from: Wonder Work on December 05, 2024, 08:01:10 PMWhat kind of comments would you have made to Peter Schiff at this moment? Do you think he actually made this comment correctly?why should i waste my words on him?  let bitcoin’s price talk for itself i do not want to talk to people who doesn’t wanna listen anw their minds are closed and they will not be changed ever i do wonder now if he feels any shame or does he still stand by what he said? if he still does then like i said no point in wasting my words on a man like that",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o48o",
      "created_time": "December 06, 2024, 12:00:07 PM",
      "body": "I am not sure that even his fans and followers are taking him seriously when it comes to bitcoin. Peter Schiff is someone who has consistently been wrong about bitcoin for 17+ years, so maybe his tweets about bitcoin should be considered as reverse indicators. I am fairly sure that he doesn't ever get bullish on it, but when he does, i am definitely selling. Maybe in the future bitcoin has a major reversal from absolute ATH, but even that wouldn't mean he was right. That would just probably mean it fell for some unrelated reasons, like that economic growth wasn't infinite and actually had a top.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "john_egbert",
      "created_time": "December 06, 2024, 12:02:34 PM",
      "body": "Quote from: o48o on December 06, 2024, 12:00:07 PMI am not sure that even his fans and followers are taking him seriously when it comes to bitcoin. Peter Schiff is someone who has consistently been wrong about bitcoin for 17+ years, so maybe his tweets about bitcoin should be considered as reverse indicators. I am fairly sure that he doesn't ever get bullish on it, but when he does, i am definitely selling. Maybe in the future bitcoin has a major reversal from absolute ATH, but even that wouldn't mean he was right. That would just probably mean it fell for some unrelated reasons, like that economic growth wasn't infinite and actually had a top.His posts are to be shown for those still not believing in how BTC truly feels after these long years.Stronger and bigger.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FortuneFollower",
      "created_time": "December 06, 2024, 12:03:55 PM",
      "body": "Quote from: bitterguy28 on December 06, 2024, 11:53:49 AMQuote from: Wonder Work on December 05, 2024, 08:01:10 PMWhat kind of comments would you have made to Peter Schiff at this moment? Do you think he actually made this comment correctly?why should i waste my words on him?  let bitcoin’s price talk for itself i do not want to talk to people who doesn’t wanna listen anw their minds are closed and they will not be changed ever i do wonder now if he feels any shame or does he still stand by what he said? if he still does then like i said no point in wasting my words on a man like thatTruly so.Better yet just to use him as an example of someone too ignorant to see the potential behind BTC and its community.A great example for that matter.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "December 06, 2024, 02:08:33 PM",
      "body": "Why do so many people care about PeterSchiff's opinions when for years he has proven to be a shitposter and has a long history of biased opinions.The price reaching 100k will reassure many that this is not a bubble or a fraud scheme.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cryptoprincess101",
      "created_time": "December 06, 2024, 02:58:41 PM",
      "body": "I don't think there is any need to deliberate about what any bitcoin critics said about bitcoin years ago, hope they are still alive to witness the performance of bitcoin ever since they made those hate speeches. Peter Schiff, just like other bitcoin haters made such speech out of lack of vision for the future to see that bitcoin is a substantial coin that has the potentials for future growths. I guess he will hide his face in shame now that bitcoin has surpassed the amount he said it will never get to. I'm just happy for the performance of bitcoin since it's invention because it has proven lots if it's critics wrong about their prediction of a crash. Bitcoin cannot be destroyed because it has scale through those tough times and still got stronger, so no hate speeches or anti bitcoin activists can stop the price from experiencing further growth. Shame to all those who said hateful words about bitcoin in the past, they should either embrace it now or bury their heads in shame.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dr.Bitcoin_Strange",
      "created_time": "December 06, 2024, 03:06:35 PM",
      "body": "I already said that he would be covered in shame by niw. You know, the fact that one doesn't like a particular asset, I don't think it's enough reason to start making hate speech or dropping criticism about the asset. He didn't have the foresight of what Bitcoin was going to grow into and he was not a Bitcoiner so the statement was actually made out of misconception.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FortuneFollower",
      "created_time": "December 06, 2024, 03:08:39 PM",
      "body": "Quote from: hugeblack on December 06, 2024, 02:08:33 PMWhy do so many people care about PeterSchiff's opinions when for years he has proven to be a shitposter and has a long history of biased opinions.The price reaching 100k will reassure many that this is not a bubble or a fraud scheme.I think people that got into the space would understand it even beforehand.The spike in price will just spike the interest for the BTC as this mysterious coin for moneymakers, when in fact, everybody can get to know it and be a Bitcoiner to a different extent.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jawhead999",
      "created_time": "December 06, 2024, 03:45:48 PM",
      "body": "Watch your mouth, it's one of important thing now.Many people like to say anything they like and promise to punish themselves in order to make people sure if they're correct.The good thing is Peter Schiff isn't a coward who not want to reply if he was wrong, many speculators avoid to clarify if they were wrong. It's not only for people who talk bad about Bitcoin, but the one who predict Bitcoin with crazy price in short term period.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptoHeadlineNews",
      "created_time": "December 06, 2024, 06:45:54 PM",
      "body": "Quote from: Wonder Work on December 05, 2024, 08:01:10 PMIt is not right for you to make such comments about it. We have seen many ups and downs in the market, but we are not disappointed at all because Bitcoin has gradually reached its milestone in the final stage.Many people made several comments about Bitcoin many years ago, which was ideally a reflection of how much they understood about Bitcoin and how it works, because for the fact that Peter Schiff may have said Bitcoin can never cross $100k benchmark, it obviously could have reviewed his level of understanding about Bitcoin. And as such, I'm such he must be regretting today if only he is alive to witness Bitcoin crossed the $100k price margin he never thought could be possible. QuoteWhat kind of comments would you have made to Peter Schiff at this moment? Do you think he actually made this comment correctly?Just like I said, he may have made that comment base on his level of understanding about Bitcoin back then in 2019 when the price of Bitcoin was still around $10k to $15k per BTC.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "headingnorth",
      "created_time": "December 06, 2024, 07:16:02 PMLast edit: December 06, 2024, 10:28:03 PM by headingnorth",
      "body": "The list of those who once held the same attitude as Peter Schiff is long. Michael Saylor, Donald Trump, Larry Fink, to name a few, all used to be extremely critical of bitcoin once thinking it was nothing but a ponzi or scam that had no value. But they have long since been orange-pilled and are now some of the biggest advocates of bitcoin in the world. One even became President of the United States! (again) Why? Because such people have an open mind, are open to new ideas and can admit they were wrong. And I have great respect for those who can admit they were wrong. I wish I can say the same for Peter Schiff. If Schiff had any valid criticisms of bitcoin then I could respect that, but he doesn't. He just continues to repeat the same old mindless talking points that he has been parroting for years. Like a broken record, it has become very old and stale. Schiff has nothing new or interesting to say, even after he has been proven wrong many times. That is the sure sign of a very closed-minded person.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}