{
  "id": "topic_5405516",
  "title": "Majestic-milf",
  "author": "Majestic-milf",
  "created_time": "July 07, 2022, 02:29:22 PM",
  "content": "World largest crypto currency exchange, Binance celebrate their 5 years anniversary and with this comes the announcement to remove trading fees in it's worldwide platform.  This initiative was promoted by a strategy devised by its US subsidiary, Binance.US. who smashed fees for Bitcoin spot traders with an aim to foster growth, increase its popularity and also boost competition. The move taken by Binance.US has sorely affected the stocks of rivals, Coinbase and this will take effect from 8th of July 2022. Reports have it that Coinbase stock fall by 10% as announcement on Wednesday by rival crypto currency exchange company, Binance was released same day as well, of their intentions to make sure users be able to spot trade across 13 stable coins and fiat combination including BTC/ usdt, BTC usdc and BTC/ BUSD. This news should elate traders as they can be able to enjoy the fee cut benefit with US dollars. https://www.google.com/url?q=https://www.coindesk.com/business/2022/07/06/binance-extends-zero-fee-bitcoin-trading-globally/&sa=U&ved=2ahUKEwiKnKbG9-b4AhUqQEEAHUTGDOcQFXoECAEQAg&usg=AOvVaw2uvS5um43s7TIK2-IVMlHl",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5405516",
  "comments": [
    {
      "author": "Despairo",
      "created_time": "July 07, 2022, 02:40:23 PM",
      "body": "They have mentioned this and they might disqualify any trades if they feel many users taking too much advantages on their promotions and might stop it intentionally if they it's already enough. Honestly 0.1% fees in Binance isn't expensive and I don't think I need to sell my coins to save 0.1% fees only considering Bitcoin price drop around 65% lol. I will keep holding and wouldn't care such promotions.Quote from: https://cryptobriefing.com/binance-becomes-first-exchange-to-cut-bitcoin-trading-fees/In anticipation of the potential problems zero trading fees might cause, Binance has reserved the right to “disqualify trades that are deemed to be wash trades or [from] illegally bulk registered accounts, as well as trades that display attributes of self-dealing or market manipulation.”",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jackg",
      "created_time": "July 07, 2022, 02:48:09 PM",
      "body": "Quote from: Despairo on July 07, 2022, 02:40:23 PMThey have mentioned this and they might disqualify any trades if they feel many users taking too much advantages on their promotions and might stop it intentionally if they it's already enough. Honestly 0.1% fees in Binance isn't expensive and I don't think I need to sell my coins to save 0.1% fees only considering Bitcoin price drop around 65% lol. I will keep holding and wouldn't care such promotions.Yeah it probably won't be noticed, the spread is normally the part of trading that costs the most too.I saw claims coinbase had a trackable price premium over binance too, if this is still the case (especially at times of volatility) then a fee reduction might improve things for buyers but do little for sellers there.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "noorman0",
      "created_time": "July 07, 2022, 03:24:15 PM",
      "body": "They took the right reward initiative choosing bitcoin which has certainly prospectively become a favorite trading pair of all traders. Keep in mind that at some point they will remove this gift, so anyone don't get too excited.Quote from: https://www.binance.com/en/support/announcement/10435147c55d4a40b64fcbf43cb46329Validity Period: 2022-07-08 14:00 (UTC) until further noticeUnfortunately I wasn't able to attend binance's anniversary party due to (imo) inconvenient policies.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "July 07, 2022, 03:24:21 PM",
      "body": "The competition between platforms is good for users, as the platforms will compete in offering lower fees and various services without closing accounts randomly because there is always an alternative ready to meet the desires of traders, so I think it is more bad news for Coinbase.Will the cancellation be temporary for the celebration period (which may extend for a week or a month) or will it be open until this policy is changed?Surprised how they have cash flow at a time when most platforms are struggling.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husires",
      "created_time": "July 07, 2022, 04:09:00 PM",
      "body": "If the platform focuses on providing better and cheaper services to users instead of wasting money on football leagues or Cristiano Ronaldo and YouTube channels, things will be better.When will they adopt the Lightning Network? It would be better than keeping the fees low, which I doubt they'll keep at zero forever.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cookdata",
      "created_time": "July 07, 2022, 04:14:59 PM",
      "body": "Quote from: Despairo on July 07, 2022, 02:40:23 PMThey have mentioned this and they might disqualify any trades if they feel many users taking too much advantages on their promotions and might stop it intentionally if they it's already enough. Honestly 0.1% fees in Binance isn't expensive and I don't think I need to sell my coins to save 0.1% fees only considering Bitcoin price drop around 65% lol. I will keep holding and wouldn't care such promotions.Quote from: https://cryptobriefing.com/binance-becomes-first-exchange-to-cut-bitcoin-trading-fees/In anticipation of the potential problems zero trading fees might cause, Binance has reserved the right to “disqualify trades that are deemed to be wash trades or [from] illegally bulk registered accounts, as well as trades that display attributes of self-dealing or market manipulation.”Of course, freebies from a big place like Binance would have terms and conditions, but if you follow their tweets, CZ purposely did that to appreciate traders as a form of a bear market discount so that traders wouldn't get discouraged, especially now that it is very sad some traders aren't making many percentage gains.You undervalue Binance, according to some of their recent report, they claim that most of their revenue comes from institutional investors, that 0.1% is significant with those that have the power to switch between USDT and BTC except traders who frequently get discount for holding some bnb.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fiulpro",
      "created_time": "July 07, 2022, 04:46:35 PM",
      "body": "Considering the trading fee cut, it's particularly from the BTC to USD right which means that not all traders would be able to enjoy it, at the same time during trading many people used usdt, which had a massive setback in the recent months and caused so much unrest as well. Therefore I do think that their new promotion or the celebration of anniversary would have limited party goers as well. The fact that there are other trading platforms offering different fee should make people more choosy, since even if you set back this fee at some trading places you can find better price which sometimes changes according to the country as well. Then again at least they did something amazing for people! That's good, most of them would he able to gain profits and people making big trades would be highly benefited.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "teosanru",
      "created_time": "July 07, 2022, 05:21:40 PM",
      "body": "Quote from: Majestic-milf on July 07, 2022, 02:29:22 PM World largest crypto currency exchange, Binance celebrate their 5 years anniversary and with this comes the announcement to remove trading fees in it's worldwide platform.  This initiative was promoted by a strategy devised by its US subsidiary, Binance.US. who smashed fees for Bitcoin spot traders with an aim to foster growth, increase its popularity and also boost competition. The move taken by Binance.US has sorely affected the stocks of rivals, Coinbase and this will take effect from 8th of July 2022. Reports have it that Coinbase stock fall by 10% as announcement on Wednesday by rival crypto currency exchange company, Binance was released same day as well, of their intentions to make sure users be able to spot trade across 13 stable coins and fiat combination including BTC/ usdt, BTC usdc and BTC/ BUSD. This news should elate traders as they can be able to enjoy the fee cut benefit with US dollars. https://www.google.com/url?q=https://www.coindesk.com/business/2022/07/06/binance-extends-zero-fee-bitcoin-trading-globally/&sa=U&ved=2ahUKEwiKnKbG9-b4AhUqQEEAHUTGDOcQFXoECAEQAg&usg=AOvVaw2uvS5um43s7TIK2-IVMlHlI think these days the listing fees, withdrawal fees and primarily the funding fees from leveraged position is enough for any exchange to operate smoothly so taking the hit of the overall trading fees in spot exchanges to foster your popularity isn't a bad idea that also when there are exchanges becoming your good competitors. This in longer run will make people habitual of trading and infact will bring people to leverage trading, so it's more of a cross selling strategy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zlantann",
      "created_time": "July 07, 2022, 05:48:36 PM",
      "body": "Quote from: Husires on July 07, 2022, 04:09:00 PMIf the platform focuses on providing better and cheaper services to users instead of wasting money on football leagues or Cristiano Ronaldo and YouTube channels, things will be better.When will they adopt the Lightning Network? It would be better than keeping the fees low, which I doubt they'll keep at zero forever.Better and cheaper services would attract more persons to use Bitcoin for business and other transactions. Signing sponsorship deals with football stars and other celebrates also help to spread the gospel of Bitcoin, hence it is also a good strategy to attract more people to the Bitcoin fold. We must not also forget that Binance is a business and must cover its running cost and also make profit. Generally, I always celebrate any perceived good news that would directly or indirectly promote the adoption and use of Bitcoin. Hence, still in the atmosphere of five years anniversary celebration, I request that this trade fees removal should continue for a longer period.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kryptqnick",
      "created_time": "July 07, 2022, 05:50:56 PM",
      "body": "That's what I like about market competition: if Binance does it, competitors will need to make similar moves or offer something else that is no less attractive to their users if they don't want to lose customers. Binance is a good exchange company. Of course, many are unhappy with it because of its KYC policy and how tightly it follows international and local legislations (such as abiding by EU anti-Russian sanctions), but it's a reputable and convenient platform. With their level of popularity, they probably don't need trading fees for revenue anymore, so I'd a good move.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coupable",
      "created_time": "July 07, 2022, 05:58:59 PM",
      "body": "I can read the news in the context of the intense competition between the various platforms to bring in the largest possible number of users, especially after the total number of cryptocurrency traders declined following the recent collapse of the Luna Network. We have recently seen many other platforms compete to obtain licenses in African and Asian countries such as the UAE, where Binance seems to have obtained the lion's share as usual.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dansus021",
      "created_time": "July 08, 2022, 03:06:38 AM",
      "body": "Quote from: Eternad on July 07, 2022, 02:47:19 PMThey should do buy back or airdrop instead of removing the fees since it’s almost negligible especially if you use BNB to pay transaction fee. Binance anniversary reward this year is kinda not generous compared to previous years which they gave a lot of bonus and free tokens to all there active user.    I think this is because of the bear market and they don't have much money and back years ago they give  a  lot of money Is try to gain more user but now binace is number one exchange based on marketcap so they need give some much bonus to feed to the old user too",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Diplester6666",
      "created_time": "July 08, 2022, 03:11:48 AM",
      "body": "Not only Coinbase, this is going to hit FTX and Kraken hard too.Has anyone compared the volumes on these exchanges before and after the announcement? Is CoinGecko the reliable source to check this?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "July 08, 2022, 08:08:36 AM",
      "body": "Quote from: Husires on July 07, 2022, 04:09:00 PMIf the platform focuses on providing better and cheaper services to users instead of wasting money on football leagues or Cristiano Ronaldo and YouTube channels, things will be better.In a business sense in the case of Binance, advertising will be the right move. The platform itself is great enough today anyway. At least personally I have zero complaints for now.Quote from: Husires on July 07, 2022, 04:09:00 PMWhen will they adopt the Lightning Network? It would be better than keeping the fees low, which I doubt they'll keep at zero forever.They'll adopt the lightning network if there's enough demand. I could almost guarantee that the current demand is too minuscule for them to bother adding lightning today.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NeuroticFish",
      "created_time": "July 08, 2022, 08:28:44 AM",
      "body": "Quote from: Despairo on July 07, 2022, 02:40:23 PMThey have mentioned this and they might disqualify any trades if they feel many users taking too much advantages on their promotions and might stop it intentionally if they it's already enough. Honestly 0.1% fees in Binance isn't expensive and I don't think I need to sell my coins to save 0.1% fees only considering Bitcoin price drop around 65% lol. I will keep holding and wouldn't care such promotions.It's a great advertising for Binance, it puts their name into the news once more.It doesn't help you and me, but it does help those who make 10s or 100s of trades every day with small margin to earn some money (btw, I expect more trading bots with this announcement).The day traders will prefer Binance with this move, hence there will be even more liquidity there.It's a smart move imho, although, as an \"average Joe\" who doesn't use trading bots I think I'd prefer such promotion don't last too log",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "wmaurik",
      "created_time": "July 08, 2022, 08:41:33 AM",
      "body": "Quote from: Majestic-milf on July 07, 2022, 02:29:22 PM World largest crypto currency exchange, Binance celebrate their 5 years anniversary and with this comes the announcement to remove trading fees in it's worldwide platform.  This initiative was promoted by a strategy devised by its US subsidiary, Binance.US. who smashed fees for Bitcoin spot traders with an aim to foster growth, increase its popularity and also boost competition. The move taken by Binance.US has sorely affected the stocks of rivals, Coinbase and this will take effect from 8th of July 2022.If today it applies to the whole world, then Binance users worldwide will definitely benefit greatly from the elimination of trading fees on the platform.And what I want to know is how long this will go on or if it's just for one day considering this is only about Binance celebrating its 5th anniversary right now.QuoteThis news should elate traders as they can be able to enjoy the fee cut benefit with US dollars. Of course, it is very encouraging because there are so many users on the Binance exchange at this time and it is clear that the benefits can be felt directly by traders on the Binance platform.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "July 08, 2022, 08:53:09 AM",
      "body": "Quote from: wmaurik on July 08, 2022, 08:41:33 AMIf today it applies to the whole world, then Binance users worldwide will definitely benefit greatly from the elimination of trading fees on the platform.And what I want to know is how long this will go on or if it's just for one day considering this is only about Binance celebrating its 5th anniversary right now.I'm not sure, but I wouldn't be surprised if it was permanent. I'm guessing that Binance is taking away their revenue from the BTC/USD trading pairs to increase their user base further, and hoping to earn revenue through Binance's other revenue streams(card/loans/earn/futures).This move is kinda risky imo because they're taking out revenue from their biggest trading pairs, but could be a gamechanger if what they wanted ends up happening.Some stats from CoinGecko:BTC/USDT: 17.01%BTC/BUSD: 7.78%BTC/USDC: 1.19%They are effectively removing revenue from these trading pairs which consists of a total of 25.98% of their overall spot trading volume. Insane.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "el kaka22",
      "created_time": "July 08, 2022, 12:19:35 PM",
      "body": "This is a cool move, it is going to definitely get the volume higher for a while, and since people who are willing to sell won't be doing it just because the fee is gone, I am sure that it improved the price a bit as well, well by the looks if it it's already working. I guess that the best thing to do right now is to congratulate binance, get some if you can, and watch the market.These type of promotional stuff certainly has a bigger meaning in the crypto world, it is not going to be sudden and right away, but it is going to be something cool that will end up with a good result in the long run for all of us, at least for the market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ShowOff",
      "created_time": "July 08, 2022, 02:54:22 PM",
      "body": "I got a notification about this promotion but haven't made any trades so far. Honestly this is a great promotion from Binance and I'm sure people will probably take advantage of it especially if they are day traders. 0.1% wouldn't be that big even I never calculated it but it would mean a lot to those who trade more than 10 times a day \"but that's not my habit\". If this promotion lasts longer then I'm sure the user base of Binance will increase more and that will have an impact on the liquidity there.But anyway I wouldn't think this promotion would last more than a week, or if I'm wrong it wouldn't be more than a month. This is simply a celebration that loyal Binance users will welcome.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}