{
  "id": "topic_5462338",
  "title": "alastantiger",
  "author": "alastantiger",
  "created_time": "August 07, 2023, 09:55:44 AM",
  "content": "Quote A study published by the American private nonprofit research organization the National Bureau of Economic Research found that the productivity of workers randomly assigned to work from home was 18% lower than that of those in the office.https://africa.businessinsider.com/careers/new-research-finds-that-fully-remote-workers-are-less-productive-than-their-in-office/4vxn4syThese researchers found that if you work from home you will be less efficient and productive than people who from their office. Can we say the same about freelance workers?  Do you think that if workers are given the chance to \"own\" a task like freelancers they'll be more productive because it is just like being self-employed where you treat it as your business and not with the mindset of another man's business?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5462338",
  "comments": [
    {
      "author": "EarnOnVictor",
      "created_time": "August 07, 2023, 10:35:23 AM",
      "body": "Quote from: alastantiger on August 07, 2023, 09:55:44 AMhttps://africa.businessinsider.com/careers/new-research-finds-that-fully-remote-workers-are-less-productive-than-their-in-office/4vxn4syI beg to disagree with this publication, it's their view but it doesn't matter if you are working in the office or at home, all that matters is to get the job done and be gainfully employed as a citizen of a country. In that way, you will be able to live the good life you desire and will also be able to transact financially among other people in the country which is what encourages the economy. Everybody can't be the CEO and top-ranking officials of a company and every sector of the economy can't demand your physical appearance. They only do that mostly to fulfil all righteousness, I see nothing wrong with online work, some companies even prefer it now to cut costs, yet the work goes well. What your work demands from you matters, even those who are working at home (freelancers) might be earning Forex for the country which is one of the benefits of exportation because they are exporting their knowledge/service to foreign people and get money in return which is usually domiciled in the USD.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sim_card",
      "created_time": "August 07, 2023, 11:03:38 AM",
      "body": "That is not true. It depends on the kind of job,there are some jobs that you don't need to be in the office before you can be efficient. Working in the office are for those workers that does some of their work manually. The efficiency of an employee depends on the zeal and passion that the person puts into his/her job irrespective of wherever the person is working from. There are some jobs that are best done at home than in the office e.g a web designing computer programming e.t.c. Freelancer job is something that one must carry out the task to get paid and it gives you freedom to manage your time and share knowledge with other persons.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "xSkylarx",
      "created_time": "August 07, 2023, 12:05:14 PM",
      "body": "It is completely opposite because first, if you are onsite and you are commuting, like riding a bus or taxi, for sure you'll get tired of it, and after you arrive in the office, you'll go straight to your phone for social media or like take a sip of coffee and not start your work. It is like you'll spend most of your time at leisure and commuting, unlike remotely, where you'll do mostly your task because you've already gotten tired, keep checking your social media, and also because you are more prepared to go to work as you've rested well. This is really what I've noticed before: I am too lazy at my office, mostly spending half a day on the coffee table or on the couch using my phone, but when I work remotely, I am more productive.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Despairo",
      "created_time": "August 07, 2023, 01:30:27 PM",
      "body": "It's really depend on the job and how they get paid.If he get paid per hour, day, month and after he completed his task, his boss or manager will give him more task, why he need to deliver his job as soon as possible if he can cheat or work slower?If he's a freelancer and he get paid according to his task, he will his best to deliver his job as soon as possible to earn maximum money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sunsilk",
      "created_time": "August 07, 2023, 01:43:46 PM",
      "body": "Quote from: alastantiger on August 07, 2023, 09:55:44 AMQuote A study published by the American private nonprofit research organization the National Bureau of Economic Research found that the productivity of workers randomly assigned to work from home was 18% lower than that of those in the office.https://africa.businessinsider.com/careers/new-research-finds-that-fully-remote-workers-are-less-productive-than-their-in-office/4vxn4syThese researchers found that if you work from home you will be less efficient and productive than people who from their office. Can we say the same about freelance workers?  Do you think that if workers are given the chance to \"own\" a task like freelancers they'll be more productive because it is just like being self-employed where you treat it as your business and not with the mindset of another man's business?I guess so for those that have been new to this transition, they're not feeling to be productive because they're not in an office setup. But with freelancers, I don't think that it should be the case.This is what freelancers like, to work at home and avoid the hassle of traffic if there's any with commuting. The drive from the employees that are new to this setup are the ones that can't be productive that much.But those that have been too tired with the office setup, this is a blessing to them and they'll work more productively than this stats says.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "so98nn",
      "created_time": "August 07, 2023, 01:54:38 PM",
      "body": "Quote from: alastantiger on August 07, 2023, 09:55:44 AMQuote A study published by the American private nonprofit research organization the National Bureau of Economic Research found that the productivity of workers randomly assigned to work from home was 18% lower than that of those in the office.https://africa.businessinsider.com/careers/new-research-finds-that-fully-remote-workers-are-less-productive-than-their-in-office/4vxn4syThese researchers found that if you work from home you will be less efficient and productive than people who from their office. Can we say the same about freelance workers?  Do you think that if workers are given the chance to \"own\" a task like freelancers they'll be more productive because it is just like being self-employed where you treat it as your business and not with the mindset of another man's business?You have no idea how they are making complete use of peeps being at their homes. They are literally giving more work to the peeps at home since there are no real restrictions on the work hours. A manager calls at any time and he can start the Team Meet at any time of the day or even late at night. That's the face of current employment which has turned into the Work from home culture. The IT friends, the devs, or the tester are literally working more than 10 hours when they are at home. Since it's in their comfort it's like they keep working now and then. I highly doubt that the study was conducted with real-life situation candidates. Lolz. Perhaps there might be various pros and cons behind such research: varies according to region, nature of the job, cultural aspects and many factors. Not sure how this one was done and how much significance it really adds?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "isaac_clarke22",
      "created_time": "August 07, 2023, 02:00:18 PM",
      "body": "Quote from: alastantiger on August 07, 2023, 09:55:44 AMQuote A study published by the American private nonprofit research organization the National Bureau of Economic Research found that the productivity of workers randomly assigned to work from home was 18% lower than that of those in the office.https://africa.businessinsider.com/careers/new-research-finds-that-fully-remote-workers-are-less-productive-than-their-in-office/4vxn4syThese researchers found that if you work from home you will be less efficient and productive than people who from their office. Can we say the same about freelance workers?  Do you think that if workers are given the chance to \"own\" a task like freelancers they'll be more productive because it is just like being self-employed where you treat it as your business and not with the mindset of another man's business?Well it depends on your state as a freelancer. When I first started freelancing, there's like no sleep at all since you would need to hunt for clients especially if we're talking about saturated markets like Data Entry jobs from my experience at Upwork wherein there would be already 50+ applicants waiting to be picked by the client.Going back to the topic, if you're on the office, you don't have any purpose anyway other than just working on your clock. Time in and time out.For the question at the end of the post, it depends to every worker themselves if they really love what they do. I gotta admit, I usually wake up late when I tend to work from home but still clock in time since I really love to program.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nwada001",
      "created_time": "August 07, 2023, 02:06:16 PM",
      "body": "Statistics might show that, based on the method of data collection they used in running their research, which gave them that convincing figure, their findings do not remain final as they can still be argued by other researchers. Being productive is based on individuals; there are people who enjoy working from home, in their own private space, because that's where they can think outside the box without undergoing some kind of pressure from colleagues and superiors, with assigned duties to them, knowing that their salary is dependent on how they can deliver a Job given to them. Sometimes working from the office looks productive in the eyes of many, but looking behind that productivity, there is some persuasion by higher-ranking members, which makes those employees not work against their will but under pressure.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zlantann",
      "created_time": "August 07, 2023, 02:41:11 PM",
      "body": "Quote from: alastantiger on August 07, 2023, 09:55:44 AMQuote A study published by the American private nonprofit research organization the National Bureau of Economic Research found that the productivity of workers randomly assigned to work from home was 18% lower than that of those in the office.https://africa.businessinsider.com/careers/new-research-finds-that-fully-remote-workers-are-less-productive-than-their-in-office/4vxn4syThese researchers found that if you work from home you will be less efficient and productive than people who from their office. Can we say the same about freelance workers?  Do you think that if workers are given the chance to \"own\" a task like freelancers they'll be more productive because it is just like being self-employed where you treat it as your business and not with the mindset of another man's business?I read the abstract of the study and the reason for the less productivity of workers that work at home is distractions from family responsibilities and poverty. Workers especially those that have underaged children will not be productive working from home because of the responsibility of taking care of children. Other forms of household responsibility can lead to distractions which can lead to poor productivity. The financial constraints of some workers might lead to certain work challenges like uncomfortable workspace due to lack of space in the home. Working from home will be impactful when the workers have a good home space that can enable them to set up a comfortable workspace. Some persons might also be limited by electric power or internet data. But these problems might be absent in work offices. Some workers need supervision. This is in line with Theory X and Y by Douglas McGregor. Some of these workers are naturally lazy, so working from home might lead to less supervision. But this doesn't dispute the fact that many workers need little or no supervision.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "348Judah",
      "created_time": "August 07, 2023, 02:58:39 PM",
      "body": "Quote from: alastantiger on August 07, 2023, 09:55:44 AMThese researchers found that if you work from home you will be less efficient and productive than people who from their office.Working from home or in office does not determine the quality of the productivity one can offer as long as there are certain working terms and conditions guiding the job, you can be in the office and be less concentrated or deliver below expectations, i think the work station barrier here shouldn't be the major reason why some csn perform below standard as long as adequate measures were put in place for them to be monitored and provide the best quality outputs required from them to deliver on the assigned job or responsibilities.Quote from: alastantiger on August 07, 2023, 09:55:44 AMCan we say the same about freelance workers?  Do you think that if workers are given the chance to \"own\" a task like freelancers they'll be more productive because it is just like being self-employed where you treat it as your business and not with the mindset of another man's business?We've gone advanced with what others are thinking regarding employability and job descriptions for maximum produce, now in this developed era of digitalization, there are jobs that are specifically an office job role while some were online jobs, ours is to set a standard to how we can best fit in any of these, if you think having a profile reputable enough to make you stand eligible for the role you may be applying for, then go for it, but if you deliver below standard, you have just reduced your profile proficiencies to being accepted the next time an opportunity comes in for offer.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mindrust",
      "created_time": "August 07, 2023, 03:07:59 PM",
      "body": "That might be true but then some workers don’t like to work in an office and these people will also be less productive. There is no easy solution to this problem. The employer should find the workers that loves to work in the whatever current environment (home or office) and move on. If the majority of the workers are doing sloppy work while working from home then he should move to an office…",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yogee",
      "created_time": "August 07, 2023, 03:14:44 PM",
      "body": "Quote from: EarnOnVictor on August 07, 2023, 10:35:23 AMQuote from: alastantiger on August 07, 2023, 09:55:44 AMhttps://africa.businessinsider.com/careers/new-research-finds-that-fully-remote-workers-are-less-productive-than-their-in-office/4vxn4syI beg to disagree with this publication, it's their view but it doesn't matter if you are working in the office or at home, all that matters is to get the job done and be gainfully employed as a citizen of a country. In that way, you will be able to live the good life you desire and will also be able to transact financially among other people in the country which is what encourages the economy.You sound like a politician giving vague speeches. The article actually raised some specific points so what exactly are you disagreeing about? The \"net speed\" is a valid metric for measuring productiveness for data entry types of jobs. The one in the office could complete the job in 8 hours while the one at home would need 2 more hours so are you saying that the extra time doesn't matter as long as the job gets done?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ucy",
      "created_time": "August 07, 2023, 04:35:26 PM",
      "body": "It depends on the kind of workers, and the kind of work environments they like. There are people who do really well & better in works done from home, they are likely the independent minded ones who need lots of quiet time and feel more comfortable working alone. If you are employers (or workers) who don't like remote work, maybe create quiet places that feel like home for such unique workers (who are likely in the minority) in your companies for example, for more productivity. Other workers will probably like the opposite kind of environments for obvious reason and still do well.  Researchers need to take the difference in personality into consideration when conducting such research. A proper research would first of all inquire about the kind of work environment people really like and do well in and base the result on that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dimonstration",
      "created_time": "August 07, 2023, 04:47:45 PM",
      "body": "Quote from: alastantiger on August 07, 2023, 09:55:44 AMQuote A study published by the American private nonprofit research organization the National Bureau of Economic Research found that the productivity of workers randomly assigned to work from home was 18% lower than that of those in the office.https://africa.businessinsider.com/careers/new-research-finds-that-fully-remote-workers-are-less-productive-than-their-in-office/4vxn4syThese researchers found that if you work from home you will be less efficient and productive than people who from their office. Can we say the same about freelance workers?  Do you think that if workers are given the chance to \"own\" a task like freelancers they'll be more productive because it is just like being self-employed where you treat it as your business and not with the mindset of another man's business?I can vouch to this, I experienced work from home during the pandemic and it’s very hard to become productive while there’s a lot of temptation to be lazy at work since there’s no one watching you. I believe freelance and work from home is not the same because freelance have a target deadline for their work while work from home is just a regular employee that being paid for the day of work without any commitment to finish work since they are not project based salary.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yhiaali3",
      "created_time": "August 07, 2023, 05:14:46 PM",
      "body": "If you work for others, you will certainly be less efficient and productive than if you worked for yourself, at least that's how I feel through my experience.When you work for others, you lose ambition and work according to the employer's mentality, and you do not care to develop in your work, and this causes you to become bored.But if you are self-employed, then you have the ambition and determination to constantly develop and improve your work, especially if you work in a profession that you love, then it is certain that your efficiency and productivity will be very high.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "n0ne",
      "created_time": "August 07, 2023, 05:27:36 PM",
      "body": "When one is committed to work from home he/she will be assigned with the proper eight hours of job. This keeps them productive, but these days work from home were like 24X7 work. This makes them really unproductive. Apart from that some companies have cut salaries, and the same will make them work according to the pay. Without reason employees won't go low in their productive work. Now most of the employees have got adopted to the work from home life style and so they don't concentrate effectively which could also be a reason for going low in productive work.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "serjent05",
      "created_time": "August 07, 2023, 05:31:43 PM",
      "body": "Quote from: alastantiger on August 07, 2023, 09:55:44 AMQuote A study published by the American private nonprofit research organization the National Bureau of Economic Research found that the productivity of workers randomly assigned to work from home was 18% lower than that of those in the office.https://africa.businessinsider.com/careers/new-research-finds-that-fully-remote-workers-are-less-productive-than-their-in-office/4vxn4syThese researchers found that if you work from home you will be less efficient and productive than people who from their office. Can we say the same about freelance workers?  Do you think that if workers are given the chance to \"own\" a task like freelancers they'll be more productive because it is just like being self-employed where you treat it as your business and not with the mindset of another man's business?I think this depends on the dedication of the person who is working from home.  I believe it became less productive because people who are working from home do not experience the same pressure when they are at the office where many people eyes are observing the employee.  This make them get easy in doing their job. But to a person who prioritized integrity and credibility, I do not think that the result of working from home will make any difference when he is working at the office.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rachael9385",
      "created_time": "August 07, 2023, 06:01:56 PM",
      "body": "Some jobs that pays good doesn't stress workers at all, most stressful jobs doesn't pay well, but I can tell that your level of education thats what secures your pay (salaries) online or offline, so I will conclude that anyone who wants a stressfree job should try as mush as possible to go higher on education so that the salaries can Worth it.Like on Bitcointalk, all Bitcointalkers who work on a signature campaign get paid according to their ranks, I take Bitcointalk as a college were you starts from nonage to high class, so education is what matters to the pays.Some non-educated people who get biggest pay as salaries are those who got the job either by luck or maybe their friends / family member are the ones who manages the business or companies that they work on.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TimeTeller",
      "created_time": "August 07, 2023, 06:05:50 PM",
      "body": "Quote from: n0ne on August 07, 2023, 05:27:36 PMWhen one is committed to work from home he/she will be assigned with the proper eight hours of job. This keeps them productive, but these days work from home were like 24X7 work. This makes them really unproductive. Apart from that some companies have cut salaries, and the same will make them work according to the pay. Without reason employees won't go low in their productive work. Now most of the employees have got adopted to the work from home life style and so they don't concentrate effectively which could also be a reason for going low in productive work.I believe this depends on your line of work, the accomplishments you need to meet for a certain period of time. If you are tasked to certain responsibilities, that means, you need to accomplish it as required by your job.Whether you are at home or office, you should always give your best to satisfy what is needed from your side.There may be distractions at home but as an employee, you should always keep in mind that you are paid to do certain work. We don't know the specific metrics of this study, but such findings may not be the general sentiment from all industries which are allowing their employees to work from home.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}