{
  "id": "topic_5470952",
  "title": "AB de Royse777",
  "author": "AB de Royse777",
  "created_time": "October 19, 2023, 06:22:12 PMLast edit: November 06, 2023, 08:21:52 PM by Royse777",
  "content": "/]ABOUT THE CAMPAIGNAfter successfully collecting the feedback from the review campaign#1, The /][banned mixer] management worked on their website and mixing mechanism to improve website functionality and user friendliness. Now it's time to collect feedback from the community to understand how this improvement is making effect for the mixer...Again, we require experienced mixer users, not just an average review with screenshots explaining the steps of mixing...In this stage, we are seeking 20 (+2 additional*) Bitcointalk members. You are required to test the service, including its website functionality. Please identify any competitive disadvantages and shortcomings in the functionality. ..Please pay some attention: .. For [banned mixer], it is important to get not only feedback about the system, but also real ideas for improving the service or comments on the functionality based on your experience with other services, to consider what is better in other services than [banned mixer]'s. [banned mixer] wants to make the best service with the help of the community, let's make the best mixer together with the Bitcointalk community!*Our winners from the review campaign#1 @Ratimov and @TryNinja. You will be invited separately by the team. You do not need to apply again. But since you already have the 50% discount code hence, you will not receive the code again and your reviews will be funded by the [banned mixer] separately...NOTE..  The campaign will be closed once I approve 20 applications. You will be selected in groups. Each group will have a deadline to submit reviews. Please ensure not to miss the deadline, as any reviews submitted late will be rejected.REWARD..0.006 BTC.. and a ..LIFETIME DISCOUNT OF 50%.. on mixing in [banned mixer] service. One review, will be rewarded ..0.01 BTC.. from [banned mixer] management for the best review...10% LIFETIME DISCOUNT CODE.. for applying in the review program.MUST DO- Please perform mixing at least two times using two different browsers, and in your review, kindly mention the names of the browsers used.- For each mixing, please use a different security level, Premium level (mandatory) and Basic/Standard on own choice.TERMS- You need to be a Senior Member or higher and have earned at least 50+ lifetime merits.- No negative trust feedback from the DT network should be present on your account.- You must apply with a Bech32 address. - Payment will be made after the review is accepted, I may have different mind for selective applications.- Discount code will be sent via PM after the review is accepted. - Reviewers from campaign#1 will not receive 50% discount code anymore since they already have a LIFETIME discount code.- Commence the review only upon acceptance. (Accepted members will be added to the campaign spreadsheet)- Kindly submit the review within the assigned deadline, or your review will be rejected.- The [banned mixer] team and I reserve the right to reject any application, including reviews.- Enrolling with more than one account is not allowed. Any accounts found in violation will be tagged.- No AI or ChatGPT content is permitted; if found, you will be banned from any signature and review campaign.ELIGIBILITY FOR 10% LIFETIME DISCOUNT CODE- You must write a brief and HONEST overall impression of using the service on [banned mixer] ANN thread. Make it informative for the readers. - You must fulfill the application eligibility requirement explained on TERMS.- Approved participants are not be eligible for 10% discount code since they will receive the 50% discount code.HOW TO APPLY : Post the following information.Code:Bitcointalk username:Bitcointalk Rank:Lifetime earned merit:Bech32 address:When you apply you automatically agree that : ..Transferring the discount code that you receive to third parties and their subsequent generations is prohibited.....The [banned mixer] will be able to use your feedback (whole or partially) from review campaign#2 on their service's website at present or in the future...HOW TO SUBMIT THE REVIEW :Post the review in this thread using following format:Code:[b][banned mixer] Mixer Review Program #2Bitcointalk username: <YOUR BITCOINTALK USERNAME>[/b][hr]<YOUR REVIEW>..SPREADSHEET: Approved application R2..📣This campaign is designed and managed by:General Disclaimer: We would like to make it clear that 💹📈 Bitcointalk Campaign Management 💪🔥 Signature & Bounty, managed by Bitcointalk member Royse777, is an independent entity and is not directly affiliated with any of the crypto startups we advertise. While we strive to promote these startups in the best possible light, our views and opinions expressed in our advertising materials do not necessarily reflect those of the startups themselves. We work with various clients across the crypto industry, and our goal is to provide high-quality advertising services to help them achieve their marketing objectives.Payment Disclaimer: Please always check the escrow wallet (if available). If the escrow wallet does not have enough balance and you think you have risk not to get paid then discontinue from the campaign. We are not liable to pay you anything that is not available on the escrow wallet.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5470952",
  "comments": [
    {
      "author": "AB de Royse777",
      "created_time": "October 19, 2023, 06:22:28 PM",
      "body": "Reserved",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nwada001",
      "created_time": "October 19, 2023, 06:23:17 PM",
      "body": "Bitcointalk username: Nwada001Bitcointalk Rank: Snr member rank Lifetime earned merit: 522Bech32 address: bc1qaql8wk9x8h69lwutymah53sv5d8zzcmw3vvw80",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Unknown Op",
      "created_time": "October 19, 2023, 06:24:34 PM",
      "body": "Bitcointalk username: Unknown OpBitcointalk Rank: Sr member Lifetime earned merit: 262Bech32 address: bc1qhgc56hf4ynpp9rmdxcv84aq9ma2l9kwpydk0rl",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "paid2",
      "created_time": "October 19, 2023, 06:24:42 PMLast edit: December 19, 2023, 01:21:57 AM by paid2",
      "body": "Bitcointalk username: iwantmyhomepaidwithbtc2Bitcointalk Rank: HeroLifetime earned merit: 949Bech32 address:",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "komisariatku",
      "created_time": "October 19, 2023, 06:24:48 PM",
      "body": "Bitcointalk username: komisariatkuBitcointalk Rank: Sr. memberLifetime earned merit: 252Bech32 address: bc1qzmclauq7dme0l0w0lmn9xkk27t2qcuah5hg9na",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Woodie",
      "created_time": "October 19, 2023, 06:26:46 PMLast edit: October 20, 2023, 07:36:23 PM by Woodie",
      "body": "Bitcointalk username: WoodieBitcointalk Rank: HeroLifetime earned merit: 646Bech32 address: bc1q6pm0afcphvqp594fgna8u63gza37qkrm3wvf0s",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Davidvictorson",
      "created_time": "October 19, 2023, 06:27:12 PM",
      "body": "Bitcointalk username: Davidvictorson Bitcointalk Rank: HeroLifetime earned merit: 773Bech32 address: bc1q7tlqg8qfwnqcf9tanceuut6qhcgyvv5agzkslq",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaNNy001",
      "created_time": "October 19, 2023, 06:27:35 PM",
      "body": "Bitcointalk username: DaNNy001Bitcointalk Rank: senior member Lifetime earned merit: 360Bech32 address: bc1q8y85d0kegf9y2g536acps0pjcdypk6yv8wu0pk",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ojima-ojo",
      "created_time": "October 19, 2023, 06:28:10 PM",
      "body": "Bitcointalk username: Ojima-ojoBitcointalk Rank: senior memberLifetime earned merit: 346Bech32 address: bc1q3v0m88sjj99xxp2afjjrjkzeeuengzqlmhj90h",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dr.Bitcoin_Strange",
      "created_time": "October 19, 2023, 06:28:25 PM",
      "body": "Bitcointalk username: Dr.Bitcoin_StrangeBitcointalk Rank: Sr. MemberLifetime earned merit: 417Bech32 address: bc1qkcnglxmm8hxr9lzxdk95e5jj3xcujag442zxgu",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ajiz138",
      "created_time": "October 19, 2023, 06:29:47 PMLast edit: October 25, 2023, 07:41:43 PM by ajiz138",
      "body": "Bitcointalk username: ajiz138Bitcointalk Rank:  Hero MemberLifetime earned merit: 689Bech32 address: bc1qnkpv5d232z7uh2nxalxgftygzfwfjd2uvh865n",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AnonBitCoiner",
      "created_time": "October 19, 2023, 06:33:15 PM",
      "body": "Bitcointalk username: AnonbitcoinerBitcointalk Rank:  Senior memberLifetime earned merit:216Bech32 address: bc1q2fmcghf34dkpfmf9d46xukuflumvvvd3tcnjq4",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SmartGold01",
      "created_time": "October 19, 2023, 06:33:19 PM",
      "body": "Bitcointalk username: SmartGold01Bitcointalk Rank: Hero memberLifetime earned merit: 545Bech32 address: bc1qv5ewv4z2q62lkyxcszkw43kp3842xyup92mwh2Hey Royse777 if previous participants in phase1 review are permitted to apply or are accepted I tender my application for the next review again to oversee their general improvement.Thank you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fivestar4everMVP",
      "created_time": "October 19, 2023, 06:34:38 PMLast edit: October 19, 2023, 06:47:42 PM by Fivestar4everMVP",
      "body": "Bitcointalk username: Fivestar4everMVPBitcointalk Rank: Hero member Lifetime earned merit: 916Bech32 address: bc1qq9rq5azcnjgq086vu0vlv9uxmcdmd00mhl8qm7",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rockstarguy",
      "created_time": "October 19, 2023, 06:35:42 PM",
      "body": "Bitcointalk username: Rockstarguy Bitcointalk rank: Hero member Lifetime earned merit: 543Bech32 address:bc1qe6tmfgpt8n7jtq9tlfy8u6h3g7ryhn3p3278vn",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptSafe",
      "created_time": "October 19, 2023, 06:36:03 PM",
      "body": "Bitcointalk username: CryptSafe Bitcointalk Rank: Snr. MemberLifetime earned merit: 308Bech32 address: bc1q2fcj8hnhkeyhstzy9k8fav5ympkfdmafvd56g5",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mr.suevie",
      "created_time": "October 19, 2023, 06:39:18 PM",
      "body": "Bitcointalk username: Mr.suevieBitcointalk Rank: senior memberLifetime earned merit: 263Bech32 address: bc1qtwnndmhnxsfk8asjwdwh6ln8jdkt6d5txdpe5r",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Igebotz",
      "created_time": "October 19, 2023, 06:40:17 PMLast edit: October 19, 2023, 06:55:09 PM by Igebotz",
      "body": "Bitcointalk username: Igebotz Bitcointalk Rank: Legendary Lifetime earned merit: 1551Bech32 address: bc1qh3r40vwu4c5hjgjjscyjdyd02vd39g3glu3chx",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dothebeats",
      "created_time": "October 19, 2023, 06:40:45 PM",
      "body": "BTT username: dothebeatsRank: LegendaryLifetime earned merit: 1348Bech32 address: bc1q2e9twmpft44cylacrp6v743xey7v02ks93jfn5Used mixers before (Chipmixer, Bestmixer, yes, that too long ago)  and would love to give out my honest opinion on [banned mixer].",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}