{
  "id": "topic_5406782",
  "title": "jubalix",
  "author": "jubalix",
  "created_time": "July 19, 2022, 02:23:23 AM",
  "content": "I am still not persuade that the 69K was the bull run, it reminds me more of the 2013 run up to 200$ then fall the run up later to 1K in late 2013.it feels like the cycle is just longer .... and have been getting longer we are in a bull trap / short squeeze.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5406782",
  "comments": [
    {
      "author": "mk4",
      "created_time": "July 19, 2022, 06:10:41 AM",
      "body": "I'd probably have the same conclusions as you if only we weren't in an uncharted territory when it comes to the current economy. There's just so much economic uncertainty that it's too risky to be bullish imo (unless talking about short-term trades).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ethereumhunter",
      "created_time": "July 19, 2022, 11:24:12 AM",
      "body": "At least, we see that $69k was the highest price at the time and the price could rise above that price again in the future. But it could be it's just a start and not a real bull run because what has happened to bitcoin before suggests that its price could drop even deeper. But whatever it is, we must be ready for all the possibilities and don't forget to prepare our money so that we can buy bitcoin at the lowest price.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NeuroticFish",
      "created_time": "July 19, 2022, 11:47:57 AM",
      "body": "Quote from: jubalix on July 19, 2022, 02:23:23 AMI am still not persuade that the 69K was the bull run, it reminds me more of the 2013 run up to 200$ then fall the run up later to 1K in late 2013.it feels like the cycle is just longer .... and have been getting longer we are in a bull trap / short squeeze.I've had this kind of feeling in April. And the market has failed me. Now the numbers look more like crypto winter than bull run really and it lasts for a bit long too. A bit too long for \"short squeeze\"...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tabas",
      "created_time": "July 19, 2022, 12:47:21 PM",
      "body": "If it isn't for those economic crises aside from the pandemic, maybe we've seen more from the market. But what's done is already there and it happened.Maybe these squeezes will result out to a better outcome when we're done to the next halving. Just like what happened with the last run, it happened after the halving.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ultrloa",
      "created_time": "July 19, 2022, 12:57:14 PM",
      "body": "Quote from: jubalix on July 19, 2022, 02:23:23 AMI am still not persuade that the 69K was the bull run, it reminds me more of the 2013 run up to 200$ then fall the run up later to 1K in late 2013.it feels like the cycle is just longer .... and have been getting longer we are in a bull trap / short squeeze.Although that's pump and fall cycle is bit much crazy to think but for sure many people get used to it then might provably that many people are much aware that once bull or bear market came there's golden opportunities given to us. And its up to us now how we can defy all the risk then convert it to profit, for sure in future we can see more than that since bitcoin has potential to rise up to $100k.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "July 19, 2022, 01:38:36 PM",
      "body": "2013 and 2022 are not really something to compare when it comes to the price of Bitcoin, because almost 10 years ago, compared to today, very few people were even aware that Bitcoin existed. Things are much more complex today, considering that the price is influenced by the power players we know about, but I'm sure there are those from the shadows who are currently unknown to us.If someone manages to persuade Mr. Mars to buy a few tens of thousands of BTC and to re-enable payment with BTC in his company, in a week the price will jump by at least 30%",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jackg",
      "created_time": "July 19, 2022, 02:15:37 PM",
      "body": "Quote from: NeuroticFish on July 19, 2022, 11:47:57 AMQuote from: jubalix on July 19, 2022, 02:23:23 AMI am still not persuade that the 69K was the bull run, it reminds me more of the 2013 run up to 200$ then fall the run up later to 1K in late 2013.it feels like the cycle is just longer .... and have been getting longer we are in a bull trap / short squeeze.I've had this kind of feeling in April. And the market has failed me. Now the numbers look more like crypto winter than bull run really and it lasts for a bit long too. A bit too long for \"short squeeze\"...If we couple that with the last two aths being made at times around when stimulus/furlough was being given out too (in 2021) then I'd say we're not doing great atm for making a new peak (although property prices might have to crash soon - even though stock market crashes aren't really crashes because no one knows what else to invest in so the money floods back into the same places after a while).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "July 19, 2022, 05:14:12 PM",
      "body": "Its hard/impossible to back to 69k Because we need to pump a lot of liquidity and continue to pump that liquidity that will be absorbed in the following: - The size of the altcoin market has grown. - The economic situation, high interest rates, and difficulty in obtaining loans. - Uncertainty makes high-risk investments as low as possible. - Trading bots, traders, people who have lost their money, they will all try to withdraw their money.Therefore, all these factors make it impossible to see levels near $60,000 in the near future.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hatshepsut93",
      "created_time": "July 19, 2022, 06:40:09 PM",
      "body": "Quote from: jubalix on July 19, 2022, 02:23:23 AMI am still not persuade that the 69K was the bull run, it reminds me more of the 2013 run up to 200$ then fall the run up later to 1K in late 2013.it feels like the cycle is just longer .... and have been getting longer we are in a bull trap / short squeeze.That's what happened in the last year - bull run to $66k, crash to $30k, bull run to $69k - then bear market. The current market falls well within the halvening pattern - a 1-1.5 year-long bull market that starts 1 year after the halvening, then a bear market until the next halvening. This means that this and next year will generally have a stagnating price, it would be slowly climbing to $30-40k, and then it will start going up faster in late 2024, and will brake $100k in 2025",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dave1",
      "created_time": "July 20, 2022, 06:16:26 AM",
      "body": "Quote from: jubalix on July 19, 2022, 02:23:23 AMI am still not persuade that the 69K was the bull run, it reminds me more of the 2013 run up to 200$ then fall the run up later to 1K in late 2013.it feels like the cycle is just longer .... and have been getting longer we are in a bull trap / short squeeze.Well we all have heard about this theory many months ago, they called it super-cycle, wherein the 4 year cycle will be broken or at least the pattern not repeating anymore as bitcoin narrative has change.However, I still don't think that, we have reach the bull run at $69k and it will have to wait after the halving in May 2024 to see another of this run. Unless if it proven otherwise this year or next year, I won't bite on the idea of super cycle.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitcoinPanther",
      "created_time": "July 20, 2022, 10:44:43 PM",
      "body": "Looking at the future growth of Bitcoin, I believe the $69k was just a part of a longer bull run.  With that, we can say that the current trend of the market is just a higher low where it will pick up its pace again to continue its price surge once the hype and good news flock in the media and internet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JoyMarsha",
      "created_time": "July 21, 2022, 12:00:33 AM",
      "body": "Every bitcoin halving has its own new ATH. It's just like a circle. The more the bitcoin halving we encounter, the new ATH is set in place in the bitcoin price. If the last halving gave us $69k, we are more likely to see bitcoin hit her next ATH of $90k by 2024.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wilhelm",
      "created_time": "July 21, 2022, 12:15:52 AM",
      "body": "Quote from: JoyMarsha on July 21, 2022, 12:00:33 AMEvery bitcoin halving has its own new ATH. It's just like a circle. The more the bitcoin halving we encounter, the new ATH is set in place in the bitcoin price. If the last halving gave us $69k, we are more likely to see bitcoin hit her next ATH of $90k by 2024.90k is way to low. We went from $19k to $69k when a worldwide pandemic was raging...And the halving is traditionally on the low side of the log curve channel...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Don Pedro Dinero",
      "created_time": "July 21, 2022, 04:58:08 AM",
      "body": "Quote from: jubalix on July 19, 2022, 02:23:23 AMI am still not persuade that the 69K was the bull run, it reminds me more of the 2013 run up to 200$ then fall the run up later to 1K in late 2013.it feels like the cycle is just longer .... and have been getting longer we are in a bull trap / short squeeze.Since we are basing this on feelings, I will tell you that I have the opposite feeling. The best of the cycle is over, and although in the remainder of the cycle the price will go up, there is no way we are going to have great joy with regard to the price. Quote from: mk4 on July 19, 2022, 06:10:41 AMI'd probably have the same conclusions as you if only we weren't in an uncharted territory when it comes to the current economy. Yes, the overall economy does not look very bullish, with war, inflation and central banks reducing liquidity or about to do so. Even Tesla has sold to obtain liquidity, which is what happens in crises, that people value liquid, worthless cash, because it is the most easily exchangeable for goods and services and it is increasingly scarce in times of crisis.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GreatArkansas",
      "created_time": "July 21, 2022, 05:25:39 AM",
      "body": "Quote from: jubalix on July 19, 2022, 02:23:23 AMI am still not persuade that the 69K was the bull run, it reminds me more of the 2013 run up to 200$ then fall the run up later to 1K in late 2013.it feels like the cycle is just longer .... and have been getting longer we are in a bull trap / short squeeze.For me YES, $69,000 for this cycle. As we can also see from the previous cycle if we will base on the Bitcoin block halving, that event is very important in the market. Because for most of all the past bitcoin block halvings, there will be always a massive rally for the price of Bitcoin, and multiple all-time highs are always recorded.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "July 21, 2022, 06:50:52 AM",
      "body": "We have been in a very new trend ever since 2022 started. So we could say that this cycle turned into a two step cycle with $69k being the first ATH or step of the bull run followed by a big drop due to Western economic crash introducing a temporary discount situation in the market and eventually a much bigger rise before we reach the next halving year.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "July 21, 2022, 09:59:45 AM",
      "body": "Quote from: pooya87 on July 21, 2022, 06:50:52 AM~snip~I can't say that I am a supporter of this theory, although I think that it should not be completely rejected considering that we are in a very specific situation considering the things that have happened in the last 2 years in addition to everything that has been happening in the last few months. However, I think that we can legitimately ask ourselves whether the situation in the West can be significantly improved before the new halving, which I personally doubt, taking into account the current situation in Europe and the US.If the new ATH (phase 2) happens before the next halving, then it will definitely be a completely new development, but I believe that no one would protest too much if 2023 is an extremely interesting year for Bitcoin, and if everything continues in 2024.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "boltz",
      "created_time": "July 21, 2022, 10:56:48 AM",
      "body": "Yes , I'm very confident when I believe and say that BTC had his bull run towards 69k and from there we entered in a bear market that today is manipulating the price , making investors and people thinking that Bitcoin will rally up again very soon which I'm totally against as I don't believe BTC price is going to rally anywhere this year.  As I've said in some of my previous posts about predictions , BTC had to overtake the 23k range and move into 24k-25k if he wanted to break the 30k resistance and it didn't happen and now we are under 30k again.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Silberman",
      "created_time": "July 27, 2022, 01:44:33 AM",
      "body": "Quote from: jubalix on July 19, 2022, 02:23:23 AMI am still not persuade that the 69K was the bull run, it reminds me more of the 2013 run up to 200$ then fall the run up later to 1K in late 2013.it feels like the cycle is just longer .... and have been getting longer we are in a bull trap / short squeeze.For a time there was a theory that we were in a supercycle and I believed this could be the case but after the drop in the price and the subsequent failures to break away from such a negative trend then I think we are still in the same four year cycle, it is just that bitcoin is so big now that the price cannot skyrocket as it did years ago and now bull runs are nowhere near as intense as they were before, something that is not as bad as it seems as this means bear markets will have a lower intensity as well.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}