{
  "id": "topic_5473120",
  "title": "Hatchy",
  "author": "Hatchy",
  "created_time": "November 06, 2023, 07:02:27 PM",
  "content": "The phrase \"invest what you can afford to lose\" has long been the go to advice when it comes to Bitcoin investments. In the past, it seemed to be a norm, a safety net, but it's time to reconsider its relevance. Over the years, Bitcoin investment has undergone a significant transformation. What was once a realm fraught with doubts, fears of capital loss, and scam risks has evolved into a more stable and less volatile investment landscape. While risks and scams still exist, Bitcoin itself has proven its worth, emerging as the premier cryptocurrency, demonstrating its dominance over others. The short-term fluctuations are there, but historical data consistently indicates growth over time.So, why should we continue to echo the sentiment of \"invest what you can afford to lose\" when referring to Bitcoin? I believe this phrase is more suited to gambling or trading, which we all know come with inherent risks.For those looking to HODL Bitcoin for the long term, with no intentions of actively trading, the focus should shift. Instead of investing what you can afford to lose, consider investing what you have to invest. Unlike other traditional investments like real estate or the stock market, Bitcoin allows entry with even a small capital  as low as $5 to $10, which isn't something I will even want to lose.such an investment should not fall under the category of what you can afford to lose.Investing in Bitcoin means being part of one of the world's most revolutionary technologies. It's not just an investment in today but potentially one of the most valuable assets in the future. So, instead of wasting time and money on 'shitcoins', consider starting now it's not too late. The focus should be on investing what you are willing to HODL for the long run, rather than what you can afford to lose.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5473120",
  "comments": [
    {
      "author": "komisariatku",
      "created_time": "November 06, 2023, 10:37:32 PM",
      "body": "Quote from: Hatchy on November 06, 2023, 07:02:27 PMThe phrase \"invest what you can afford to lose\" In fact, it is an expression that we must be prepared for all risks. I think no one wants to lose their money, especially those who invest large amounts of bitcoin. That expression is just an illustration of risk, that bitcoin has a high risk and in my opinion if we are not cheated or our bitcoins are stolen then the value of our investment will never run out, at most it will only decrease due to fluctuations in the price of bitcoin One investment that can make our money run out is if we invest in bitcoin futures, this trading model is like forex and has a very high risk, our money can run out in a day. However, if we buy bitcoin and store it in our own wallet, our money will not run out because bitcoin never loses value and price.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "oktana",
      "created_time": "November 06, 2023, 10:59:15 PM",
      "body": "Even after reading this post, all I can advise everyone is to still invest what they can afford to lose!. Do not think that just because Bitcoin has done well over the years we should neglect risk management. I think of investment in a way that once I've put my money in there, I have lost it (just to keep myself from being too anxious and always checking). I have lost quite some amount of money in crypto, and for the times that it happened, I never felt shocked cause I always acknowledged that I could lose it all. So, investment as a whole is a risk and one should be risk-conscious when being a part of any investment (be it Bitcoin or not.)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dr.Bitcoin_Strange",
      "created_time": "November 06, 2023, 11:03:18 PM",
      "body": "Yeah, one of the old members of the forum said that bitcoin investment doesn't really have any serious static rules for investment, and that's true. Most investors usually have some strategy or rule that they think is best for them to invest in bitcoin, but the most commonly used formula some people use in accumulating bitcoin is DCA. For some common non-static rules, like; buy the dip and hold, hold until you make a profit; if you can't hold, you won't be rich; not your key, not your coin; and the last, \"invest what you can afford to lose.\" In one of my comments just a few days ago, I said that that last common rule should have been modified to \"Invest what you are willing to hold for the long term, until you make a profit.\"Bitcoin has lived for a decade now, and I don't really think that people have actually invested in it and experienced a total loss like they do with altcoins. Whichever loss that any investor might have experienced with bitcoin is either because they bought at a high price and sold very low, or maybe it is a trader who is leveraging or trading for a short-term profit.Normally, those that invested in bitcoin and held it for a long time made a profit from it, while those that did not hold it for a long time did not make a profit because they could not hold it for a long time. In such a situation, we can't say bitcoin is actually responsible for their loss, but they themselves were responsible for the loss they encountered. So, that was the reason I said that the rule should be, \"Invest what you are willing to hold until the market has earned you the profit you desire.\"",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sunsilk",
      "created_time": "November 06, 2023, 11:13:47 PM",
      "body": "It is applicable to everything wherein we apply risks, just like you have said in gambling and trading and the same goes with investing in Bitcoin. As long as you get to hold that you're investing what you have or what you can afford to lose, they're all the same logic and understanding. There is no dynamics in investing in holding Bitcoin.You buy and you hold, whether that's your life savings or spare money as long as you can afford to do that, no one will stop you. But of course, we always tell that invest only what you can or what you have.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hatshepsut93",
      "created_time": "November 06, 2023, 11:14:44 PM",
      "body": "Quote from: Hatchy on November 06, 2023, 07:02:27 PMThe focus should be on investing what you are willing to HODL for the long run, rather than what you can afford to lose.There can be two meanings of \"can afford to lose\". One is a relatively small sum that can be lost without any notice. Another one is a larger portion of your wealth that can still be lost without completely ruining your life. The second still applies to Bitcoin and any other investment  Do not put your house as a collateral for investment, do not invest your child's education fund, do not invest your safety net, and so on. This is all especially true for Bitcoin precisely because you have to hodl it and can't afford to take your investment out early during an emergency, because that could force you to take a loss.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitDane",
      "created_time": "November 06, 2023, 11:39:43 PM",
      "body": "Quote from: Hatchy on November 06, 2023, 07:02:27 PMWhile risks and scams still exist, Bitcoin itself has proven its worth, emerging as the premier cryptocurrency, demonstrating its dominance over others. The short-term fluctuations are there, but historical data consistently indicates growth over time.So, why should we continue to echo the sentiment of \"invest what you can afford to lose\" when referring to Bitcoin? I believe this phrase is more suited to gambling or trading, which we all know come with inherent risks.Regardless of what one is investing, it is a common knowledge to not use the money that is allocated to other spending.  No matter what kind of investment one has, it has its risk and the possibility of losing the capital is still there.Bitcoin market price is not set in stone that it will eternally surge, the future of Bitcoin is still uncertain even though it is quite popular that it is on the uptrend when we zoom out its price history.  Within that history, there are lots of recorded losses from Bitcoin traders  and investments due to the fact that the price of Bitcoin swings and there are instances that an investors are forced to sell because of unexpected events in their life.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SquirrelJulietGarden",
      "created_time": "November 07, 2023, 01:01:12 AM",
      "body": "Quote from: Hatchy on November 06, 2023, 07:02:27 PMThe phrase \"invest what you can afford to lose\" has long been the go to advice when it comes to Bitcoin investments.The principle of investment is applied for all types of investment, not only applied for Bitcoin investment or cryptocurrency investment.If you can not afford to lose your money because your investment goes to a wrong way, you should simply keep your cash at home. Keep it at home, don't keep it at bank accounts because when banks have bankruptcies, you can lose your money in bank accounts.With Bitcoin investment, after you buy it, you must do another vital step, move your bitcoin (withdraw) it from your exchange account to your own wallet, non custodial, open source to keep it safe by yourself. You have private key and you can control, secure your bitcoin.How to back up a seed phrase",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "November 07, 2023, 03:10:32 AM",
      "body": "invest what you wont need in the short term, play the long game",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "michellee",
      "created_time": "November 07, 2023, 03:28:21 AM",
      "body": "Invest what you can afford to lose not only for investing in Bitcoin but also for other things. Bitcoin has high volatility. Bitcoin prices can change at any time and if people are not prepared for that, they can panic. That's where they must understand the meaning of investing what you can afford.If they can afford to invest $25 or even $100 for a single purchase, that's an amount they can afford. We are not buying or investing more than we can afford. Our life is not just about investing in Bitcoin. There are other things that we have to fulfill. So we must keep trying to fulfill it.And if you already have Bitcoin, HODL is what you should do and don't panic if the price drops. The price reduction is only temporary and later, the price will increase. So be patient in holding Bitcoin until the price rises again.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BALIK",
      "created_time": "November 07, 2023, 03:48:12 AM",
      "body": "Quote from: oktana on November 06, 2023, 10:59:15 PMEven after reading this post, all I can advise everyone is to still invest what they can afford to lose!. Do not think that just because Bitcoin has done well over the years we should neglect risk management. I think of investment in a way that once I've put my money in there, I have lost it (just to keep myself from being too anxious and always checking). I have lost quite some amount of money in crypto, and for the times that it happened, I never felt shocked cause I always acknowledged that I could lose it all. So, investment as a whole is a risk and one should be risk-conscious when being a part of any investment (be it Bitcoin or not.)Not only with bitcoin and with any investment, once it can bring profit, it can also create risks for us. So I still maintain my opinion, let's only invest what we can lose. You're right, just because bitcoin has done well for many years doesn't mean it's risk-free or absolutely safe. Even gold and real estate are not absolutely safe, so with an asset like bitcoin that is only 15 years old, nothing is certain. Don't be too subjective with bitcoin because the future is unpredictable.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rat03gopoh",
      "created_time": "November 07, 2023, 03:54:27 AM",
      "body": "This advice must remain, especially for new people, there are security aspects that must be considered in addition to value risks. Everyone wants to invest just because they hear \"it's profitable\", but not everyone understands the mechanism. However, this is still relevant to the security factor of Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "libert19",
      "created_time": "November 07, 2023, 04:10:09 AM",
      "body": "The phrase has more to with Bitcoin volatility and not exactly that Bitcoin would go to zero and he'd lose his investment. Although there are ways he could lose his investment like losing pvk, hacks, scams, etc. You wouldn't wanna make investment and remove half-way just because some need arose.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Despairo",
      "created_time": "November 07, 2023, 04:32:05 AM",
      "body": "Not every people who own Bitcoin is a Bitcoin enthusiast or even maxi.The phrase of \"invest what you can afford to lose\" is for Average Joe who's interested with Bitcoin, obviously it's different to Bitcoin maximalist who own near 90% of their assets in Bitcoin. Since Bitcoin is still a fairly new asset and it's not yet as sustain as gold, so it's correct to say that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "aylabadia05",
      "created_time": "November 07, 2023, 04:41:40 AM",
      "body": "Quote from: Hatchy on November 06, 2023, 07:02:27 PMInvesting in Bitcoin means being part of one of the world's most revolutionary technologies. It's not just an investment in today but potentially one of the most valuable assets in the future. So, instead of wasting time and money on 'shitcoins', consider starting now it's not too late. The focus should be on investing what you are willing to HODL for the long run, rather than what you can afford to lose.In the long term, not the short term.In practice, people don't buy Bitcoin because the price will fall from the purchase price, which is a mistake in thinking. Putting such thoughts into altcoins has some truth to it. Among the many people who invest in crypto, only a small percentage focus on other types of assets besides Bitcoin. The rest are those who don't know the benefits of converting fiat to Bitcoin.Investing in Bitcoin with long-term targets has very little chance of losing. On the contrary, people will win if they are consistent in Bitcoin with long-term targets.Long term, strength to hold that feels heavy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "November 07, 2023, 05:06:21 AM",
      "body": "It seems like you are confusing a couple of things.First of all the scams and their variants have nothing to do with \"invest what you can afford to lose\" statement. Nobody should even touch them to be at any kind of risk to need an statement like the one in the title.Secondly \"invest what you can afford to lose\" applies to any investment you make in anything, even the most stable markets like gold. You should always take reasonable risks and indeed invest what you can afford to lose. Meaning for example you should not borrow money to invest in gold, bitcoin or whatever else. You should invest the money that you already have and don't need so that if you lost all that money, you wouldn't be devastated. Apart from that, I agree with the part of your post that Bitcoin has already grown and the market is not as volatile and unpredictable as it once was which makes it a more solid \"investment\" even though we still have some way to go before we can get rid of the high volatility and market manipulations.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fiatless",
      "created_time": "November 07, 2023, 05:08:38 AM",
      "body": "Quote from: Hatchy on November 06, 2023, 07:02:27 PMInvesting in Bitcoin means being part of one of the world's most revolutionary technologies. It's not just an investment in today but potentially one of the most valuable assets in the future. So, instead of wasting time and money on 'shitcoins', consider starting now it's not too late. The focus should be on investing what you are willing to HODL for the long run, rather than what you can afford to lose.Your thoughts are insightful and I believe in some of them. The slogan Invest what you can afford to lose shouldn't be the main advice for Bitcoin because it has over the years shown that it is a dependable and consistent long-term investment. To me, the right phrase should be \"invest what you can live without\" or what you can afford to bear\" . We have seen some people out of greed or high expectations take loans or sell some valuables because they want to invest in bitcoin. Others go to the extent of investing their entire income without considering basic needs or making emergency provisions. Indeed, bitcoin is now a major player in the global financial market, but it doesn't erase the fact that it is a new invention that still needs time to evolve into a stronger and widely accepted currency and investment. So we still need to invest with caution. Don't invest an amount that can put you into a financial mess if there are any challenges.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "avikz",
      "created_time": "November 07, 2023, 05:16:22 AM",
      "body": "Quote from: Hatchy on November 06, 2023, 07:02:27 PMThe phrase \"invest what you can afford to lose\" has long been the go to advice when it comes to Bitcoin investments. In the past, it seemed to be a norm, a safety net, but it's time to reconsider its relevance. It is still very much relevant! It all depends on your local regulations on bitcoin. You time when you have invested in Bitcoin etc. This statement is here to remind you about the risks of Bitcoin investment. But it is something you can ignore at your own risk. Today when the Bitcoin price is increasing, we are seeing a whole lot of new crowd becoming super bullish on it. But let's assume you invest at pick and then the price starts going down! Will you be at the same position with the early adopters?So Bitcoin is a risky investment and you must not gamble with whatever you have. Have patience and take a cautious approach toward Bitcoin investment. That might save you from being bankrupt.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zaguru12",
      "created_time": "November 07, 2023, 09:06:01 AM",
      "body": "The phrase invest what you can afford to lose doesn’t apply to only risky investments but to also stable investments, we might have experienced from past trends that bitcoin isn’t like shit coins and can never go dust but at least there is still volatility affecting bitcoin price, although with a long term holding you might be beating that risk. Where this phrase comes to play is the area where you hold in dare patience and not been afraid of any circumstances. Imagine someone that had invest a little above what he could actually lose as at of early last year when the price was above $45k, you would certainly know that the person wouldn’t be at peace like a person who is invested a throwaway amount. Investing in what you can afford to lose might also be a warning that should you be face with adversities like mistakenly getting your funds stolen either through hacking you don’t lost everything ( although this can be prevented if you’re careful). The phrase also applies to one diversifying there funds too and not relying on a single investment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Don Pedro Dinero",
      "created_time": "November 07, 2023, 09:51:32 AM",
      "body": "I agree with the general view, contrary to that of the OP, that investing only what one can afford to lose still stands. Quote from: franky1 on November 07, 2023, 03:10:32 AMinvest what you wont need in the short term, play the long gameThis is what I wanted to focus on. The problem with mature assets such as bitcoin is not so much that you can lose everything, although it is a possibility that cannot be ruled out 100%, as volatility. If you put all the money you can into bitcoin even though you might need it in the short term, maybe when you need it the market is down 60%, and you haven't lost it all, but you have lost 60% of your money that you couldn't afford, and now you will have to go into debt or figure out how to get the money you have lost.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}