{
  "id": "topic_5406200",
  "title": "bbc.reporter",
  "author": "bbc.reporter",
  "created_time": "July 14, 2022, 03:05:12 AM",
  "content": "How is bitcoin maximalism presently taken by everyone in bitcointalk? Is it still strong or is it beginning to become weaker after 10 years?In any case, the bitcoin community lost a smart man when it went against Nic Carter. I do not agree with all of his arguments, however, he is certainly one of the best representatives for bitcoin with arguements based on reality. Many people might disagree but he is certainly smarter than Max Keisler.The fight began when Carter and his fund, Castle Island Ventures, announced an equity investment in a start-up called Dynamic. Dynamic is building a wallet-based platform with decentralized identity features, one of the most interesting applications of Web3 technology.The problem is that Dynamic is multichain. For self-declared bitcoin maximalists, this amounts to heresy. That’s almost literal, as we’ll get into, because bitcoin maximalism possesses many features of a religion – and maxis were under the impression Carter was one of them. Source https://www.coindesk.com/layer2/2022/07/06/nic-carter-and-the-case-for-bitcoin-mediumism/",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5406200",
  "comments": [
    {
      "author": "Lucius",
      "created_time": "July 14, 2022, 10:29:17 AM",
      "body": "This is the first time I'm hearing about this man, and by his appearance I would say that he is a young person who, like many others like him, is just trying to profit by pretending to know something more than other people. If he is some kind of intellectual who abandons the ship, let him feel free to take other like-minded people with him - because Bitcoin survived without its founder and people like Hal Finney, and I'm sure it can survive without one philosopher who should stick to what he studied at university, which is Philosophy and International Relations.Maybe this man means something to you, but for 99% of people on this forum, he is completely irrelevant, as are the projects in which he participates.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bbc.reporter",
      "created_time": "July 15, 2022, 01:33:37 AM",
      "body": "@Lucius. Yes this is a problem because much of the community only knows and listens to Max Keisler and Michael Saylor and consider them as something similar to leaders of the community. However, when you listen to them speak, they only extend the bitcoin maximalism circle jerk preaching like this is a religion. It is head shaking why many people listen to them.In any case, I am not saying you are part of those people.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "July 15, 2022, 10:36:18 AM",
      "body": "@bbc.reporter, I don't think that such individuals are important for Bitcoin, at least not in the long term and in the big picture. What they say or do can have a short-term impact on people who think that Bitcoin needs central figures and that its fate depends on them. This has never been the case, nor will it be in the future, and we really do not need to have any kind of leaders - and even Saylor should not be placed in that role, because he is first and foremost a businessman, and not any kind of leader who should have an influence on that whether someone wants to invest in Bitcoin or not.I don't listen to any of them in the sense that I'm obsessed with what they say, and everything I see and hear comes from this forum. People should be a little more intelligent and think for themselves, not just rely on the opinion of other people, regardless of who it was.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "July 15, 2022, 04:34:50 PM",
      "body": "Quote from: bbc.reporter on July 14, 2022, 03:05:12 AMIn any case, the bitcoin community lost a smart man when it went against Nic Carter.~Source https://www.coindesk.com/layer2/2022/07/06/nic-carter-and-the-case-for-bitcoin-mediumism/This is funny, an article on Coindesk, for which Carter is an author and investor describes his fight and why maximalists are wrong.Nic carter was a shitcoin lover from the start, and his Dynamic investors have nothing to do with anything related to bitcoin, he tried to enter a war on Twitter and tried to debunk stuff only digging his hole deeper when it turned out that most of his investments had only to do with hype and centralized solutions.Seriously, he acted like a kid who was losing subscribers on Twitter, having that kind of attitude while bragging about millions of investments sounded to everyone like the last moments of Do Kwon.  If you're preaching how you love bitcoin and cryptos and what they stand for and you deal with Palantir...Quote from: bbc.reporter on July 15, 2022, 01:33:37 AMYes this is a problem because much of the community only knows and listens to Max Keisler and Michael Saylor and consider them as something similar to leaders of the community.The problem is labeling people, and you're doing the same here.I'm a bitcoin maximalist and a hardcore shitcoin hater, and I don't think there was a week in which I didn't make a fund of Saylor laser eyes or about how Bukele is buying the dip every single time, only for the price to go down after. Real bitcoin maximalists don't give a damn about individuals, you've mistaken a horde of wanna-be millionaires who don't care what and how it makes them rich for bitcoiners.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bbc.reporter",
      "created_time": "July 16, 2022, 02:25:13 AM",
      "body": "Quote from: Lucius on July 15, 2022, 10:36:18 AM@bbc.reporter, I don't think that such individuals are important for Bitcoin, at least not in the long term and in the big picture. I very much agree. I am only saying that the bitcoin community has lost a very intelligent man who has been making good arguments for why bitcoin should adopted by much of the people in the world. Many of his arguments are very much similar to Andreas Antonopolous.It also appears the bitcoin maximalists are pushing away some of the smart people and support those people who are willing to continue the circle jerk. We should be more careful because this might be the community's own undoing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "July 16, 2022, 09:48:16 AM",
      "body": "Quote from: bbc.reporter on July 16, 2022, 02:25:13 AMIt also appears the bitcoin maximalists are pushing away some of the smart people and support those people who are willing to continue the circle jerk. We should be more careful because this might be the community's own undoing.If someone turns against the very essence of what Bitcoin stands for, then it is only logical that the community will turn against him in one way or another. I don't think that we lose that way, but on the contrary that we defend those positions that come from everything that Satoshi left us.Did our community lose important people in the form of all those who were pro-Bitcoin and then a few years ago decided to try to destroy it by creating their own version of Bitcoin? Roger Ver, Faketoshi (CW), Jihan Wu, and many others who once meant something are now despised by the community, as well as some new traitors like Mr. Mars, who also did us great harm with his childish moves. We do not push anyone away from us, but we cannot be irresponsible and pretend that some people should have the status of gods and that they can do whatever they want.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "July 16, 2022, 11:57:28 AM",
      "body": "Oh boy, I could write a whole book about this!Quote from: bbc.reporter on July 14, 2022, 03:05:12 AMHow is bitcoin maximalism presently taken by everyone in bitcointalk? Is it still strong or is it beginning to become weaker after 10 years?Perhaps the best way to explain it is by using examples and metaphors of the Republican party and its most notorious member (Trump).A few notes before I begin explaining:[1] I am not in any way implying that bitcoiners and nocoiners are similar to one or the other groups, I'm just drawing a comparison between them.[2] Apologies for digging the dead out of the grave, but I chose Trump & conservatives for this example simply because most people are readily familar with him.So you see Republican voters and conservatives, and you're a democrat/liberal and fundamentally disagree with their opinions. That's completely natural.All bitcoiners who actively use bitcoins and altcoins are in a similar category. They are \"moderates\", people who don't mind what changes go inside the network as long as they don't adversely affect the way they use their money.Of the maximalists category there are two different kinds, which I shall mention below:The first is the \"moderate maximalist\". Politically speaking, there are similar to the republicans who (perhaps reluctantly) supported Trump, as opposed to, say, a rival republican, simply because they believed there was no better alternative in the red sphere - these are people who are quite horrified by some of his remarks, but they literally do not see another candidate who is more determined to fix the economy/country.Most self-proclaimed maximalists fall in a similar category - they are happy with changes that improve the Bitcoin network, but care from little to none about what other people do on their own networks. Most likely they are against certain proposals for philosophical reasons, but not because their usage of cryptocurreny depends on them.Because most maximalists are in this category, \"moderrate maximalist\" can be shortened to simply \"maximalist\".Lastly, there are the fanatics. The people who would quite literally jump off a cliff if they saw Trump do it. In the bitcoin-sphere, I call these \"extreme maximalists\".These represent people who insist the Bitcoin network be left exactly how Satoshi made it - with no soft forks that add rules & functionality of any kind [as a side note, this is how coins like Bitcoin XT/Gold/Unlimited/Cash/SV were made]. On the polar opposite, it also includes people who insist that a major archetectural change be made to the Bitcoin network at all costs. Like their political counterparts, it is very difficult to debate/negotiate with extreme maximalists as they have a tendancy to resort to personal attacks whenever their opinions are challenged.Logically speaking, even people who exorbitantly denounce some coins in favor of others could be argued to belong in a similar category. The point is that, this category does not think in moderation with respect to the coins that they support (otherwise, they would be in the \"moderates\" category, but not in the \"minimalists\" category).Of course, unlike politics, the crypto-sphere is not dominated by two parties. There are in fact more denominations of moderates, moderate maximalist, and extreme maximalist for each crypto currency. [examples: ETH/Ethereum Classic, Monero/Most monero derivatives, Bitcoin Cash/Bitcoin SV (LOL!), and others...]. So, crypto politics should not be viewed in greyscale, because it is a fully colorized picture with multiple hues A similar case can be made for nocoiners - the \"moderate\", the \"moderate maximalist\", and \"extreme maximalist\" nocoiner with similar grades as those above for Bitcoiners (and the appropriate analogue for the political parties example).The point is that nobody's the same, and lumping some of these groups together in the same denomination is wrong - for example, lumping together the maximalist categories, or simply all the denominations representing a particular coin as \"the anticrist\", is going to cause more emnity than actual work being done, as the guy in the news article must've discovered by now [for example: I don't like Max Keiser's conclusions about the economy, as I believe them to be too extreme, but do you see me running around the forum trashing him in my posts?]",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bbc.reporter",
      "created_time": "July 17, 2022, 02:46:52 AM",
      "body": "Quote from: Lucius on July 16, 2022, 09:48:16 AMQuote from: bbc.reporter on July 16, 2022, 02:25:13 AMIt also appears the bitcoin maximalists are pushing away some of the smart people and support those people who are willing to continue the circle jerk. We should be more careful because this might be the community's own undoing.If someone turns against the very essence of what Bitcoin stands for, then it is only logical that the community will turn against him in one way or another. I don't think that we lose that way, but on the contrary that we defend those positions that come from everything that Satoshi left us.Did our community lose important people in the form of all those who were pro-Bitcoin and then a few years ago decided to try to destroy it by creating their own version of Bitcoin? Roger Ver, Faketoshi (CW), Jihan Wu, and many others who once meant something are now despised by the community, as well as some new traitors like Mr. Mars, who also did us great harm with his childish moves. We do not push anyone away from us, but we cannot be irresponsible and pretend that some people should have the status of gods and that they can do whatever they want.What occured is an overreaction by some cultish maximalists within the bitcoin community which might clearly be very head shaking also for you. Nic Carter's venture fund invested in a seed round of a company who will develop a cryptocoin wallet. However, this wallet to be created is going to be a multicoin wallet. This has made some people in the bitcoin community see him as someone who has commited heresy hehehehehe.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hv_",
      "created_time": "July 24, 2022, 01:18:48 PM",
      "body": "Quote from: NotATether on July 16, 2022, 11:57:28 AMOh boy, I could write a whole book about this!Quote from: bbc.reporter on July 14, 2022, 03:05:12 AMHow is bitcoin maximalism presently taken by everyone in bitcointalk? Is it still strong or is it beginning to become weaker after 10 years?Perhaps the best way to explain it is by using examples and metaphors of the Republican party and its most notorious member (Trump).A few notes before I begin explaining:[1] I am not in any way implying that bitcoiners and nocoiners are similar to one or the other groups, I'm just drawing a comparison between them.[2] Apologies for digging the dead out of the grave, but I chose Trump & conservatives for this example simply because most people are readily familar with him.So you see Republican voters and conservatives, and you're a democrat/liberal and fundamentally disagree with their opinions. That's completely natural.All bitcoiners who actively use bitcoins and altcoins are in a similar category. They are \"moderates\", people who don't mind what changes go inside the network as long as they don't adversely affect the way they use their money.Of the maximalists category there are two different kinds, which I shall mention below:The first is the \"moderate maximalist\". Politically speaking, there are similar to the republicans who (perhaps reluctantly) supported Trump, as opposed to, say, a rival republican, simply because they believed there was no better alternative in the red sphere - these are people who are quite horrified by some of his remarks, but they literally do not see another candidate who is more determined to fix the economy/country.Most self-proclaimed maximalists fall in a similar category - they are happy with changes that improve the Bitcoin network, but care from little to none about what other people do on their own networks. Most likely they are against certain proposals for philosophical reasons, but not because their usage of cryptocurreny depends on them.Because most maximalists are in this category, \"moderrate maximalist\" can be shortened to simply \"maximalist\".Lastly, there are the fanatics. The people who would quite literally jump off a cliff if they saw Trump do it. In the bitcoin-sphere, I call these \"extreme maximalists\".These represent people who insist the Bitcoin network be left exactly how Satoshi made it - with no soft forks that add rules & functionality of any kind [as a side note, this is how coins like Bitcoin XT/Gold/Unlimited/Cash/SV were made]. On the polar opposite, it also includes people who insist that a major archetectural change be made to the Bitcoin network at all costs. Like their political counterparts, it is very difficult to debate/negotiate with extreme maximalists as they have a tendancy to resort to personal attacks whenever their opinions are challenged.Logically speaking, even people who exorbitantly denounce some coins in favor of others could be argued to belong in a similar category. The point is that, this category does not think in moderation with respect to the coins that they support (otherwise, they would be in the \"moderates\" category, but not in the \"minimalists\" category).Of course, unlike politics, the crypto-sphere is not dominated by two parties. There are in fact more denominations of moderates, moderate maximalist, and extreme maximalist for each crypto currency. [examples: ETH/Ethereum Classic, Monero/Most monero derivatives, Bitcoin Cash/Bitcoin SV (LOL!), and others...]. So, crypto politics should not be viewed in greyscale, because it is a fully colorized picture with multiple hues A similar case can be made for nocoiners - the \"moderate\", the \"moderate maximalist\", and \"extreme maximalist\" nocoiner with similar grades as those above for Bitcoiners (and the appropriate analogue for the political parties example).The point is that nobody's the same, and lumping some of these groups together in the same denomination is wrong - for example, lumping together the maximalist categories, or simply all the denominations representing a particular coin as \"the anticrist\", is going to cause more emnity than actual work being done, as the guy in the news article must've discovered by now [for example: I don't like Max Keiser's conclusions about the economy, as I believe them to be too extreme, but do you see me running around the forum trashing him in my posts?]Nobody can vote what Satoshi created and gave his name to Bitcoin.Maxilists see that. His work is conserved and set in stone by his own wordsNow deal with it. Btc, bch changing all day, passing off is the result ending in sth else. Funny calling that still Bitcoin",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "goldkingcoiner",
      "created_time": "July 24, 2022, 04:49:57 PM",
      "body": "I think not all altcoins are shitcoins. Although 90% of altcoins are shitcoins.What I believe is that they are meant to compliment the larger Bitcoin ecosystem. But we do have a lot of shitcoins that are dragging Bitcoin down. We need to start clipping the sick parts off and we will see Bitcoin gain value in a short amount of time.Although I say I am ok with some altcoins, I still see myself as a Bitcoin maxi. Why? Because I would not feel safe storing my money in form of any cryptocurrency but Bitcoin, long term. Maybe 5% into altcoins for the lulz and community and shorting Bitcoin with usdt whenever we are in a bear market. And even then I don't feel safe enough to short all of my coin. Maybe 25% but thats it really. I feel my money is safest in the form of Bitcoin.The toxic maximalism going around is basically altcoiner hatred (I assume from bad shitcoin experiences in the past) and newbie snobs pretending they invested in Bitcoin 10 years ago.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bbc.reporter",
      "created_time": "July 25, 2022, 02:09:13 AM",
      "body": "Quote from: goldkingcoiner on July 24, 2022, 04:49:57 PMAlthough I say I am ok with some altcoins, I still see myself as a Bitcoin maxi. Why? Because I would not feel safe storing my money in form of any cryptocurrency but Bitcoin, long term. You should not say that. The maximalists might remove you from their membership hehehe. There is no second best, only bitcoin. If you break the circle jerk, you are out.Also, I give you an argument. What if bitcoin was overtaken by another coin in market capitalization because bitcoin has been falling in value. Would this cause you to reconsider bitcoin as a store of value?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "goldkingcoiner",
      "created_time": "July 25, 2022, 02:55:05 AM",
      "body": "Quote from: bbc.reporter on July 25, 2022, 02:09:13 AMQuote from: goldkingcoiner on July 24, 2022, 04:49:57 PMAlthough I say I am ok with some altcoins, I still see myself as a Bitcoin maxi. Why? Because I would not feel safe storing my money in form of any cryptocurrency but Bitcoin, long term. You should not say that. The maximalists might remove you from their membership hehehe. There is no second best, only bitcoin. If you break the circle jerk, you are out.Also, I give you an argument. What if bitcoin was overtaken by another coin in market capitalization because bitcoin has been falling in value. Would this cause you to reconsider bitcoin as a store of value?Thats a very hypothetical question. I see it as this: If Bitcoin died while some other coin was rising, then there is no more reason to believe in cryptocurrency at all, as the fall of Bitcoin can only mean one thing: Blockchain technology has developed a fatal flaw. At that point I would be buying gold and turning my back to the blockchain world. Bitcoin would be just a failed, glorious experiment.But lets save the boogey man stories for the kids.  Bitcoin has become the pinnacle of blockchain technology to the point where countries are adopting it as legal tender.Bitcoin won't die and nothing greater can be created from blockchain technology. 1 BTC = 1 BTC",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bbc.reporter",
      "created_time": "July 25, 2022, 05:02:21 AM",
      "body": "@goldkingcoiner. So according to your argument, if bitcoin fails, no other project in the cryptospace should succeed? Is this not very much removed from reality?I am also not saying that bitcoin will die. I am only asking if the people would reconsider using bitcoin as a store of value if it has been overtaken in market capitalization by another coin and if bitcoin's value falls continuously.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cr1776",
      "created_time": "August 01, 2022, 03:50:07 PM",
      "body": "Quote from: bbc.reporter on July 25, 2022, 05:02:21 AM@goldkingcoiner. So according to your argument, if bitcoin fails, no other project in the cryptospace should succeed? Is this not very much removed from reality?I am also not saying that bitcoin will die. I am only asking if the people would reconsider using bitcoin as a store of value if it has been overtaken in market capitalization by another coin and if bitcoin's value falls continuously.I didn't think that he meant \"no other project in the cryptospace should succeed\" but that if bitcoin were to die, it would indicate some fatal flaw with crypto in general which would mean that no other crypto would succeed.  Perhaps it is a subtle difference, but that was the way I understood it.  :-)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kakmakr",
      "created_time": "August 03, 2022, 01:22:55 PM",
      "body": "In my experience.... ideology and principles are thrown overboard when profit is the new goal. We saw this with people like \"butthurt\" Mike Hearn and Gavin Andresen ..... and \"Circle\" when they changed their business model and basically kicked Bitcoiners in the nuts. Money can \"cloud\" people's judgement ....so they can do a 180 on their previous statements and/or principles, when they hunt for that. Let's be honest.... the world are ruled by \"money\" these days.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bbc.reporter",
      "created_time": "August 08, 2022, 12:51:09 AM",
      "body": "Quote from: cr1776 on August 01, 2022, 03:50:07 PMQuote from: bbc.reporter on July 25, 2022, 05:02:21 AM@goldkingcoiner. So according to your argument, if bitcoin fails, no other project in the cryptospace should succeed? Is this not very much removed from reality?I am also not saying that bitcoin will die. I am only asking if the people would reconsider using bitcoin as a store of value if it has been overtaken in market capitalization by another coin and if bitcoin's value falls continuously.I didn't think that he meant \"no other project in the cryptospace should succeed\" but that if bitcoin were to die, it would indicate some fatal flaw with crypto in general which would mean that no other crypto would succeed.  Perhaps it is a subtle difference, but that was the way I understood it.  :-)I reckon that it is much worse because it is telling everyone that if bitcoin cannot succeed, no other cryptocoin can succeed. The arrogance of this type of thinking within some groups in the bitcoin community is what is causing to make it comedic and intolerable. This is very head shaking behavior. If you do not know what I am talking about, there are many Max Keiser videos in conferences.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nullius",
      "created_time": "August 08, 2022, 11:12:16 AM",
      "body": "Quote from: bbc.reporter on July 14, 2022, 03:05:12 AMHow is bitcoin maximalism presently taken by everyone in bitcointalk?New policy:  I present myself as a fearsome “Bitcoin maxi” to altcoiners, and I chat about my favourite altcoins to Bitcoiners.  Thus, I can discover who my true friends are.  This optimizes for the human element.  So does intransigent opposition to scams.I have been intending to write an essay with my own take on Bitcoin maximalism, but I am not sure if this forum is the right place to publish it.Quote from: NotATether on July 16, 2022, 11:57:28 AMThese represent people who insist the Bitcoin network be left exactly how Satoshi made it - with no soft forks that add rules & functionality of any kind [as a side note, this is how coins like Bitcoin XT/Gold/Unlimited/Cash/SV were made].That’s backwards.  All of the scams that you list made hardfork changes, while most of them accept post-Satoshi softfork changes such as P2SH (activated 2012-04-01).  Only Bitcoin has retained the status quo, with only backwards compatible changes since (IIRC) BIP 50/Bitcoin v0.8.1 (?) in 2013.  AFAIK, the only forkscam that even claims to be “exactly how Satoshi made it” is BSV—the perpetrator of which demands that Bitcoin make hardfork changes to seize coins.  I think that shows the nature of Faketoshi’s nonsense about Bitcoin being allegedly “carved in stone”:  He is upset that Bitcoin’s blockchain is actually carved in stone, never mind the consensus rules.(I need not reach the rest of this discussion.)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bbc.reporter",
      "created_time": "August 09, 2022, 12:55:17 AMLast edit: August 10, 2022, 02:03:38 AM by bbc.reporter",
      "body": "Quote from: nullius on August 08, 2022, 11:12:16 AMQuote from: bbc.reporter on July 14, 2022, 03:05:12 AMHow is bitcoin maximalism presently taken by everyone in bitcointalk?New policy:  I present myself as a fearsome “Bitcoin maxi” to altcoiners, and I chat about my favourite altcoins to Bitcoiners.  Thus, I can discover who my true friends are.  This optimizes for the human element.  So does intransigent opposition to scams.I have been intending to write an essay with my own take on Bitcoin maximalism, but I am not sure if this forum is the right place to publish it.You should write and publish it in the forum, I reckon. I would also like to know your opinion on some bitcoin maximalists who appear to want everyone to believe that there is only bitcoin and bitcoin's failure will be the whole cryptospace's failure without any other cryptocoin having to find and achieve success.I also want to hear your opinion on the comments of people similar to Max Keiser who said in an interview that all fiat will be going to zero against bitcoin. Is this right?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "August 09, 2022, 08:41:14 AM",
      "body": "Quote from: bbc.reporter on August 09, 2022, 12:55:17 AMI also want to hear your opinion on the comments of people similar to Max Keisler who said in an interview that all fiat will be going to zero against bitcoin. Is this right?Completely unrealistic in the developed Western world. I know it's fashionable to peddle an impending collapse of economy, but the govts. simply don't allow that to happen.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}