{
  "id": "topic_5450993",
  "title": "thevoyager23",
  "author": "thevoyager23",
  "created_time": "May 02, 2023, 04:58:18 PM",
  "content": "FEAR + GREED AUG 2019 BTC has just had a good pump from $3000 to $10,000 apprpox. I would have assumed F&G would have been more in the 60s/70s because we eventually got a drop to $6000 and back to $3000.Why was F&G so low (fear) after a pump. It would suggest the sentiment was to buy?I know it's not a science but just curious as to why the siganls and market sentiment offered by F&G didn't line up",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5450993",
  "comments": [
    {
      "author": "MCUKing",
      "created_time": "May 02, 2023, 05:06:03 PM",
      "body": "What?What is Fear and Greed had to do with the Bitcoin Price pump? more Importantly bro Why are you discussing the 2019 sentiment of the market in this timeline is it relatable in any circumstances? Haha bro bro what re talking about?I would call it spamming you've said QuoteWhy was F&G so low (fear) after a pump? Haha what si this man obviously when market is bullish there will be Greed sentiments rather than fear.OP Improve your post Quality",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "May 02, 2023, 06:05:41 PM",
      "body": "Quote from: MCUKing on May 02, 2023, 05:06:03 PMWhat?What is Fear and Greed had to do with the Bitcoin Price pump? It's an indicator and indicators can be used on speculation, nobody says that the scenario will repeat itself but that's what speculation is about, people try to guess patterns, nothing wrong with it. As for your other advice, I have a story about the pot and kettle for you.  Quote from: thevoyager23 on May 02, 2023, 04:58:18 PMWhy was F&G so low (fear) after a pump. It would suggest the sentiment was to buy?It's a pretty normal thing, a lot except after a sudden pump a correction, check the graph, the fear index went down far faster than the price, and not just once, it does it quite regularly especially when the price is near a round number or what trades perceive as resistance.BTW, OP, move this to speculation, it fits better there.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "May 02, 2023, 06:24:08 PM",
      "body": "High volumes of fear & greed doesn't automatically mean we're going to go down more, and higher volumes of bullishness doesn't automatically mean we're going to go up more. Market participants on social media aren't really the best indicators in the first place.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lonerangerh",
      "created_time": "May 02, 2023, 06:31:31 PM",
      "body": "Quote from: thevoyager23 on May 02, 2023, 04:58:18 PMFEAR + GREED AUG 2019 BTC has just had a good pump from $3000 to $10,000 apprpox. I would have assumed F&G would have been more in the 60s/70s because we eventually got a drop to $6000 and back to $3000.Why was F&G so low (fear) after a pump. It would suggest the sentiment was to buy?I know it's not a science but just curious as to why the siganls and market sentiment offered by F&G didn't line upThe Fear and Greed Index (F&G) is a measure of market participants' sentiment towards Bitcoin. While it can be helpful in assessing the overall sentiment towards cryptocurrencies, it is important to note that it is not a perfect science and can be influenced by many factors.In the case you mentioned, with BTC having a good pump from $3000 to $10,000, it makes sense for the market sentiment to lean more towards greed. However, it is possible that other factors, such as regulatory concerns or market volatility, may have kept F&G at short-term lows.It's also important to remember that F&G is not the be-all and end-all of market analysis, and investors should consider a range of other factors when making investment decisions. Finally, market sentiment can be difficult to accurately predict, and even the most sophisticated tools and techniques may not provide a complete picture of what is driving market behavior.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dunfida",
      "created_time": "May 02, 2023, 11:41:35 PM",
      "body": "Quote from: thevoyager23 on May 02, 2023, 04:58:18 PMFEAR + GREED AUG 2019 BTC has just had a good pump from $3000 to $10,000 apprpox. I would have assumed F&G would have been more in the 60s/70s because we eventually got a drop to $6000 and back to $3000.Why was F&G so low (fear) after a pump. It would suggest the sentiment was to buy?I know it's not a science but just curious as to why the siganls and market sentiment offered by F&G didn't line upJust remember up those years where Internet was just starting and lots had been skeptical about its existence. We do have lots of pumps and increases whether on those stocks and other things had increased out significantly. It is really just on someones call whether they would really be taking up some risks or not. When you do have that fear then you would be missing out things and same goes with greed on which if you do let these things to control your mind then you would really be that susceptible to errors and mistakes. This is why to those people who would really be taking up risks are the ones who do have the chance on improving their lives.Lots of us did miss out that golden train and now we've been regretting out and hope that time would come back but well its late but its not something you could really bethat late if you do tend to invest now. Its a matter of risks taking.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yaunfitda",
      "created_time": "May 03, 2023, 02:33:49 AM",
      "body": "Quote from: thevoyager23 on May 02, 2023, 04:58:18 PMFEAR + GREED AUG 2019 BTC has just had a good pump from $3000 to $10,000 apprpox. I would have assumed F&G would have been more in the 60s/70s because we eventually got a drop to $6000 and back to $3000.Why was F&G so low (fear) after a pump. It would suggest the sentiment was to buy?I know it's not a science but just curious as to why the siganls and market sentiment offered by F&G didn't line upNot sure, maybe some of us doesn't remember that because that was 4 years ago and it doesn't make sense to bring it up. And I can speculate that if could be just a manipulation from the whales that time that's why the price goes up from $3k-$10k.I remember one thing around that time frame, perhaps it was in the beginning of the year that there were reports that 3 big whales colluding with each other to push the price higher and then after that, the price goes down hard. Again, my memory could be sketchy at times but that kind of news could stuck in my mind.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cuenta Alternativa",
      "created_time": "May 03, 2023, 03:50:58 AM",
      "body": "Correlation does not imply causation, let alone single-factor correlation. To look at a correlation in the past and assume that it must necessarily be repeated in the future is a bit simplistic to be honest and you admit it yourself:Quote from: thevoyager23 on May 02, 2023, 04:58:18 PMI know it's not a science <...>",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MCUKing",
      "created_time": "May 03, 2023, 06:43:30 PM",
      "body": "Quote from: thevoyager23 on May 02, 2023, 05:35:33 PMYou need to relax and be a little more accomodating.  I was relaxed even though I read your post twice and tried to understand but all I found was a lame fear and greed theory... So after that, you know my reaction above.Quote from: thevoyager23 on May 02, 2023, 05:38:14 PMI don't need to remind you of the foundational lesson: \"Be fearful when others are greedy, be greedy when others are.....\"(I left the last bit for you to work out).   Hmm now got your view here. The last Bit is not hard to say but it's hard to follow.Quote from: thevoyager23 on May 03, 2023, 07:06:04 AMYep, there is one thing I know and that is I know nothing.Here I'm with you, haha just kidding.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "boyptc",
      "created_time": "May 03, 2023, 11:18:12 PM",
      "body": "Quote from: dunfida on May 02, 2023, 11:41:35 PMLots of us did miss out that golden train and now we've been regretting out and hope that time would come back but well its late but its not something you could really bethat late if you do tend to invest now. Its a matter of risks taking.And those that have taken risk on the earlier days and chose to be brave were the ones that have been enjoying this season. There will always be those risk takers, safe investors and those that want to test the waters. You choose your own battle and if it's not inline with what you're thinking just as what you're saying OP. It probably hasn't yet shown that trend that you're comparing way back then. As many are saying, this is a cycle and we could have been in there or not yet and is about to come.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Adbitco",
      "created_time": "May 03, 2023, 11:56:27 PM",
      "body": "Quote from: thevoyager23 on May 02, 2023, 04:58:18 PMFEAR + GREED AUG 2019 BTC has just had a good pump from $3000 to $10,000 apprpox. This weren't the main thing that triggers the market to that extent, i believe there were lot of demand in the market which causes the price to soar to that level. Most time when the supply is much then the price seems to drop or dump due to so much panic from investor and little traders, sometimes the market can also be influenced by some positive news across the crypto space and this automatically triggers the price of bitcoin and entire cryptocurrency.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dragonvslinux",
      "created_time": "May 04, 2023, 05:17:34 PM",
      "body": "Quote from: thevoyager23 on May 02, 2023, 04:58:18 PMWhy was F&G so low (fear) after a pump. It would suggest the sentiment was to buy?The pattern being formed back in then in 2019 after the rise to around $14K was a descending triangle. However you want to interrupt this, it was lower highs with a horizontal weakening support. Thus there was a lot of fear that price would fall back down to $6K or lower, which eventually happened. If the market is extremely fearful, or greedy or that matter, it does not suggest a buy or sell. For example the market was already getting greedy around $5K before reaching $14K, so if anything it suggests that the price is likely to continue higher (as long as the greedy is maintained). Likewise with the fear sentiment.Quote from: thevoyager23 on May 02, 2023, 04:58:18 PMI know it's not a science but just curious as to why the siganls and market sentiment offered by F&G didn't line upThis is simply because market sentiment doesn't often align with other technical signals. Market sentiment is usually wrong as it's based on it's participants.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coolcoinz",
      "created_time": "May 04, 2023, 07:47:27 PM",
      "body": "Fear & Greed index is just a chart made by putting together different sources of data. These sources are by no means a way to predict what's coming. It's important you take into account that according to the creators of the index:QuoteDominance (10%)Anyhow, analyzing the dominance for a coin other than Bitcoin, you could argue the other way round, since more interest in an alt-coin may conclude a bullish/greedy behaviour for that specific coin.Trends (10%)We pull Google Trends data for various Bitcoin related search queries and crunch those numbers, especially the change of search volumes as well as recommended other currently popular searches. For example, if you check Google Trends for \"Bitcoin\", you can’t get much information from the search volume. But currently, you can see that there is currently a +1,550% rise of the query „bitcoin price manipulation“ in the box of related search queries (as of 05/29/2018). This is clearly a sign of fear in the market, and we use that for our index.This means that 20% of their whole indexed data is pure speculation of them checking if people are googling bitcoin and if people are selling altcoins to buy bitcoin. Does that really tell you anything? It definitely doesn't tell me if I should buy or sell bitcoin because google trends and market dominance are both a hit or miss. I'll give you an example. When bitcoin crashes people are googling it to see what happened. Google trends for bitcoin and crypto went up when FTX got shut down. It also went up when Bitcoin reached its ATH in 2021. It only means there's something going on. Dominance can grow in the bear market when altcoins lose more in price than bitcoin, but it can also grow when altcoins are going bust and are troubled by outside problems like the SEC. Bitcoin can be going up and gaining dominance and it can be going down and doing the same. Bottom line, don't rely on fear index. It's only decent at showing the extreme values, meaning that if it's in ATH fear or ATH greed levels it's usually a good moment to do something with your stash, either sell or buy more. When it shows something between 30 and 70 it can mean anything.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "darkangel11",
      "created_time": "May 04, 2023, 08:09:44 PM",
      "body": "It doesn't add up in most situations. I hope you guys aren't making financial decisions based on what fear index is showing. Let's be serious here, you don't need to watch an index to know bitcoin is in the buy zone. You can do the same or even better by watching moving averages and calculating simple percentage loss from the top. If bitcoin is down more than 50% from ATH, you're entering the bear market buy zone.When you're reaching over 70% loss from ATH, you're at or very close to the bear market bottom. When it regains the 200WMA, it's usually a sign that the bear market is over.When you're more than 2x over the last ATH it's always a good time to start preparing for another bear market because the it is getting overheated, especially if there were recent moves of more than 50% up. You don't need the index to know all of it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husires",
      "created_time": "May 05, 2023, 12:01:03 AM",
      "body": "The Fear and Greed Index (F&G) is a psychological indicator that tries to track the psychology of traders and is not necessarily associated with technical analysis indicators because it measures fear and greed according to many circumstances, some of which may not be directly related to bitcoin trading. I use the indicator in the case of fear because it is the emotion that controls the majority of people, just tell people that there is an epidemic and you will notice an increase in fever and fatigue, and therefore as soon as negative news is published, even if the price trend is not downward, the price will go in that direction.Greed is not quite the same, use it after a rally or a lot of negative news as a tool to enter the market and buy low.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yhiaali3",
      "created_time": "May 05, 2023, 02:17:36 AM",
      "body": "Quote from: thevoyager23 on May 02, 2023, 04:58:18 PMI know it's not a science but just curious as to why the siganls and market sentiment offered by F&G didn't line upSimply because there are many factors that control the market and not just F&G, the market maker always tries to use F&G to manipulate traders and direct the market in the direction he wants, but this does not always work.F&G often succeeds in new markets when there is no complete certainty in the future of the market, as was the case with Bitcoin at the beginning of the market, but today I think that its impact has decreased very much due to the increased certainty of Bitcoin traders and their acquisition of great experience over time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "taufik123",
      "created_time": "May 05, 2023, 03:51:51 AM",
      "body": "Quote from: yhiaali3 on May 05, 2023, 02:17:36 AMSimply because there are many factors that control the market and not just F&G, the market maker always tries to use F&G to manipulate traders and direct the market in the direction he wants, but this does not always work.F&G often succeeds in new markets when there is no complete certainty in the future of the market, as was the case with Bitcoin at the beginning of the market, but today I think that its impact has decreased very much due to the increased certainty of Bitcoin traders and their acquisition of great experience over time.Playing F&G manipulation to make them panic. this is a common thing for Whales to do, they control the market well. 2023 is a pretty good year for Bitcoin, close to the Halving that will occur. Although currently the price is still stuck in the $29k area but the possibility of breaking $30k is still very possible. In the last few weeks, Greed is still in control and the F&G index is still stable at 60-65.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "retreat",
      "created_time": "May 05, 2023, 07:33:55 AM",
      "body": "Quote from: thevoyager23 on May 02, 2023, 04:58:18 PMFEAR + GREED AUG 2019 BTC has just had a good pump from $3000 to $10,000 apprpox. I would have assumed F&G would have been more in the 60s/70s because we eventually got a drop to $6000 and back to $3000.Why was F&G so low (fear) after a pump. It would suggest the sentiment was to buy?I know it's not a science but just curious as to why the siganls and market sentiment offered by F&G didn't line upThe price jump could have been a game of whales or because the adoption of Bitcoin in that year increased significantly, we don't know for sure, but for those who took risks in that year and held on until now they have already reaped the fruits of their investment and maybe it is the best investment of their lifetime.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dunfida",
      "created_time": "May 08, 2023, 07:42:59 PM",
      "body": "Quote from: taufik123 on May 05, 2023, 03:51:51 AMQuote from: yhiaali3 on May 05, 2023, 02:17:36 AMSimply because there are many factors that control the market and not just F&G, the market maker always tries to use F&G to manipulate traders and direct the market in the direction he wants, but this does not always work.F&G often succeeds in new markets when there is no complete certainty in the future of the market, as was the case with Bitcoin at the beginning of the market, but today I think that its impact has decreased very much due to the increased certainty of Bitcoin traders and their acquisition of great experience over time.Playing F&G manipulation to make them panic. this is a common thing for Whales to do, they control the market well. 2023 is a pretty good year for Bitcoin, close to the Halving that will occur. Although currently the price is still stuck in the $29k area but the possibility of breaking $30k is still very possible. In the last few weeks, Greed is still in control and the F&G index is still stable at 60-65.For the benefit of some newbie readers then you could make use of thatF & G index which it might be that common to be used when it comes to market investment but its not really thatbad to peek up on these indicators on the time you would be knowing on whats the current level of the market.https://edition.cnn.com/markets/fear-and-greedhttps://alternative.me/crypto/fear-and-greed-index/We do know that crypto market could independently be able to move out specially on crypto and in difference between traditional markets like forex and stocksbut cant really be denied that these tools and indicators are somewhat that significant for you to check out and see on whats the current market conditionwhen it comes to this aspects.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}