{
  "id": "topic_5463314",
  "title": "FASTPROFITTRADER",
  "author": "FASTPROFITTRADER",
  "created_time": "August 15, 2023, 02:06:59 AM",
  "content": "💻Why do many people always step on the same rake??? 😼1️⃣. Greed, lack of knowledge and patience. They just want \"easy money\". We do not intend to wait for the \"market to give\". Everyone wants a lot in the moment. As a rule, they are always super poor (crazy. displays of who a person is in real life).2️⃣\"This time will be different than yesterday\" (guided by the desire of what you want, not what is happening in the market).3️⃣Manipulations in the accumulation/distribution zones with the help of crypto media, public opinion (those who should always lose), expert opinion - in other words, the lack of their own understanding.4️⃣ \"fortune-telling on daisies up / down\" instead of a clear work plan. There is no trading strategy (that is, the basis with which the market character was going to make money).5️⃣The use of an exchange instrument that was invented to take money 100% (it's only a matter of time when this will happen and with which \"market is to blame\") - futures. Violation of elementary concepts of risk management, and in some characters (mapping who is in reality) generally adequate logic of a mentally healthy person.6️⃣ Margin (a risky instrument only in the hands of #Stupid money, but very greedy). 👏The list goes on, but these are the main points. Think about it. I'm sure you thought you were completely different, but absolutely everyone thinks so))))🧘",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5463314",
  "comments": [
    {
      "author": "mk4",
      "created_time": "August 15, 2023, 04:15:37 AM",
      "body": "That's simply because of human nature. Now our only goal is to not fall into the same pits that people in the past have fallen onto.Though unfortunately for the most of us, experience is the best teacher. That's not necessarily bad though; as long as you jump back up and try again.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fivestar4everMVP",
      "created_time": "August 15, 2023, 04:52:46 AM",
      "body": "We are not necessarily all the same, remember the saying that \"as our faces are different, so is our desires\", so going by that phrase, human being are not actually the same , though due to human nature, it sometimes seems like we all are doing things alike, most especially when it comes to the pursuit for money , it is naturally in human's nature to be greedy, and never be contented, that is, no matter how much one has or has made in profit, he or she some how will always want more, and people will look and use  every means available to them, as long as there is an opportunity to make money, So yeah, people will always be greedy, and some will never learn until they experience something bad themselves, which is why people often say that \"experience is the best teacher\", in terms of trading, the greedy and non-greedy will sometimes lose money, the most important thing is the aftermath reaction, how we react, as long as we understand and move on like nothing happened, that's alright.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oshosondy",
      "created_time": "August 15, 2023, 06:31:03 AM",
      "body": "If someone did not fail in life, the person may not appreciate his success. Because you fail ones does not mean you are a loser. Because of failure, some people will not have become successful.In trading, experience matters. Not just the knowledge. But it is important to trade with just the amount of money that you can afford to lose.Quote from: FASTPROFITTRADER on August 15, 2023, 02:06:59 AM6️⃣ Margin (a risky instrument only in the hands of #Stupid money, but very greedy). Margin can be of help if you use it wisely and professionally. But some people just prefer the other way and go 10x more up to 200x.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "michellee",
      "created_time": "August 15, 2023, 08:14:07 AM",
      "body": "Even though you say we are the same, we are different, and not everyone is greedy in wanting profits. Some people could be wary of trying to make a profit. Only people trying to stay sane can reap those benefits without any desire to get greedy and want more money.People can get greedy easily, but some people can still hold back their greed so as not to harm themselves. And it depends on how strong you can hold that greed so it doesn't grow big.If you can, that's great. If you can't, that's a problem for you so you will follow what other people have done. The choice is yours",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yudi09",
      "created_time": "August 15, 2023, 11:33:14 AM",
      "body": "The desire to reach our goals may be the same, but the ways to achieve our goals may be different.Many people involve themselves in trading or investing. Some are greedy and rush and neglect important things in doing so. There are those who carry out trades or investments in a patterned manner by putting forward methods and strategies patiently waiting for predetermined targets and continuing to study so they can analyze when the best time is to buy and sell for profit.Basically that's what makes people different/not the same.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jody.Drummer",
      "created_time": "August 15, 2023, 01:12:15 PM",
      "body": "Quote from: yudi09 on August 15, 2023, 11:33:14 AMThe desire to reach our goals may be the same, but the ways to achieve our goals may be different.Many people involve themselves in trading or investing. Some are greedy and rush and neglect important things in doing so. There are those who carry out trades or investments in a patterned manner by putting forward methods and strategies patiently waiting for predetermined targets and continuing to study so they can analyze when the best time is to buy and sell for profit.Basically that's what makes people different/not the same.Well that's right, everyone, especially us as traders, has a different path in achieving success in this field. And also in my opinion the personality of people is very influential in this field, as we know that trading is very involved psychologically and also mentally self, so in my opinion for those who have a personality easily fooled or provoked in terms of meosi then it is very likely they will experience many losses in trading. As an example, for example they experience a loss and when it is very likely they will feel emotional and then return to open the same position and eventually lose again. So in my experience and some of my friends, most people will get stuck there when their psychology is disturbed, they will find it difficult to predict the direction of prices and in the end they open long positions in a bearish and strong down market, of course they will experience losses. In addition to the difference, there are also those of us who do it with some analysis, for example some trade with technical analysis and some use fundamentals, in my opinion this is quite a lot of differences.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GeorgeJohn",
      "created_time": "August 15, 2023, 01:23:59 PM",
      "body": "Quote from: yudi09 on August 15, 2023, 11:33:14 AMThe desire to reach our goals may be the same, but the ways to achieve our goals may be different.Many people involve themselves in trading or investing. Some are greedy and rush and neglect important things in doing so. There are those who carry out trades or investments in a patterned manner by putting forward methods and strategies patiently waiting for predetermined targets and continuing to study so they can analyze when the best time is to buy and sell for profit.Basically that's what makes people different/not the same.The method of people investment are differs from other people investment, but all are the same, come to talk of your views, trading have different strategies and it maybe that the strategies I'm using the one you are using is not same, but other people will think we are using same method, buying and selling of cryptocurrency, someone to be successful in such kind of investment, I believe that we have to acquire the knowledge, while some people lose in trading is because they don't know when to buy and when to sell, and any trader who uses chart will be a successful one.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bettercrypto",
      "created_time": "August 15, 2023, 01:58:26 PM",
      "body": "Whatever we have experienced that is not good in the world of trading business, let's make it a way for us to learn from the mistakes we made, we should not repeat them so that the capital we release for this will not be wasted.That's why we shouldn't have a wild attitude when we experience a good income here, to avoid the profit that hopefully will be lost in the end. Even a small profit is good and at least there is a source that is obtained every day.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "August 15, 2023, 02:26:57 PM",
      "body": "QuoteWe're all the same!It's a wrong conclusion in every sense, whether it's about investing, trading, everyday things in life or just promises we made to others. For example, you stand out from others because you don't keep your word and your reputation is obviously worth $50 or maybe not even that much. On the other hand, most members of this forum do not allow themselves such things, so we are not all the same, fortunately.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "shivansps",
      "created_time": "August 15, 2023, 03:25:44 PM",
      "body": "Good article. Agree with a lot from here.I always say that one of the main reasons for losing money is greed. Even when the desired result has already been obtained, it seems that it can be done better. Therefore, it is better to always place the upper and lower points, upon reaching which to exit the transaction.Another big common reason is the fact that it happened to someone and we think that it will happen to us, but the situation is already different and the deal is different and time has passed and everything is flying down\"This time will be different than yesterday\" - You can write a separate book on this topic. A painful and very relevant topic",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "taufik123",
      "created_time": "August 15, 2023, 05:04:56 PM",
      "body": "Quote from: GeorgeJohn on August 15, 2023, 01:23:59 PM-snip-I believe that we have to acquire the knowledge, while some people lose in trading is because they don't know when to buy and when to sell, and any trader who uses chart will be a successful one.Are you that sure?Will every trader who uses charts be successful?In fact, every trader has the same risk when trading. Those who use charts may know what is happening in the market, but it will not be 100% successful. There will definitely be some losses incurred, even though they have good technical analysis knowledge. This is all related to mental trading issues and how to use the right strategy. There is no guarantee that someone who has technical analysis knowledge can always succeed, there will be some obstacles such as trading psychology which includes mental health such as greed, fear, panic, and others.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dr.Bitcoin_Strange",
      "created_time": "August 15, 2023, 08:21:07 PM",
      "body": "It's like a circle, where we learn different things altogether, get misinformed, and get influenced by different things, particularly the wrong perception of others that some people allow to pass through them. Trading is not a job with a stamped agreement of a fixed monthly salary, both for those that assume to be professionals and for those that are not. That is to say, we all make mistakes in trading, learn from them, try again, and keep trying until we increase the rate of profit. That's why it's said that trading is not for everyone; if you are not really willing to experience some loss, then you can't trade.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Finestream",
      "created_time": "August 15, 2023, 08:40:14 PM",
      "body": "Quote from: mk4 on August 15, 2023, 04:15:37 AMThat's simply because of human nature. Now our only goal is to not fall into the same pits that people in the past have fallen onto.Though unfortunately for the most of us, experience is the best teacher. That's not necessarily bad though; as long as you jump back up and try again. True. No matter how we think of ourselves differently, it all comes into a conclusion that we all do the same things because we shared the same goals and targets in life. And that is not to fall from the traps of losing. And if ever we fall, we always make sure to get up again because that’s probably life should be. No quitter becomes a winner. And winner never quits. While losing is inevitable, but know that there’s always hope to change what you have been going through.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ololajulo",
      "created_time": "August 15, 2023, 08:52:33 PM",
      "body": "Upon discovering the extent of effort invested in each bull market, along with research into market trends and people's financial psychology, it becomes evident that human behavior remains consistent. Those who fail to control their emotions concerning money are prone to encountering repeated losses in any market. The most effective approach involves determining a suitable point to liquidate a significant portion of your holdings, establishing a rational price for this action, and adhering to the plan.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Quidat",
      "created_time": "August 15, 2023, 08:56:35 PM",
      "body": "Quote from: mk4 on August 15, 2023, 04:15:37 AMThat's simply because of human nature. Now our only goal is to not fall into the same pits that people in the past have fallen onto.Though unfortunately for the most of us, experience is the best teacher. That's not necessarily bad though; as long as you jump back up and try again.Sustain yourself and able to get back up on the time that you do fall which its true that all of us would inevitably be able to experience those worst things, no matter how many times you wouldbe reading up other peoples experience and errors on which it is really that something that you would be able to experience it too.The only difference for those people who are fully aware with those other mistakes is that you've been wary about on the potential movement that you might do on a specific condition or situation which i could say that it is really that a good headstart.Mistakes and errors are the best teachers on which it would really be honing up your skills and we know that on dealing with this unpredictable space would really be requiring that kind of having that lots of possible methods and ways which you could be able to eventually apply on with every trading or positioning that you are tending to make.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jeraldskie11",
      "created_time": "August 15, 2023, 10:21:46 PM",
      "body": "Quote from: FASTPROFITTRADER on August 15, 2023, 02:06:59 AM5️⃣The use of an exchange instrument that was invented to take money 100% (it's only a matter of time when this will happen and with which \"market is to blame\") - futures. Violation of elementary concepts of risk management, and in some characters (mapping who is in reality) generally adequate logic of a mentally healthy person.We all know that the common use of an exchange is to convert the cryptocurrency into fiat. But since we are in the modern world, exchanges are continue to develop where we can see a lot of new features in it. That's why instead of just converting, people were use to stay on the exchanges because they are still using their other features. That's why we have to vigilant and aware of this, because sometimes we are losing money in exchanges. Not only that, the biggest fear is that when you are using Cex and you used to put all your money in to exchange for awhile to convert but unfortunately the exchange was shutdown, you can't recover all your funds at not until they do a refund. However, people have similarities but they are not totally the same.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hamza2424",
      "created_time": "August 15, 2023, 11:28:34 PM",
      "body": "First of all, Op is a newbie and OP has a decent reputation tag to justify how we're all the same! I'm not sure if is there anyone who has the reputation as Op currently owns on just a few posts. The future seems to be Shining, Not tuning and offending but explaining the current status.So now moving on to the points Op mentioned here in this post sounds to be redundant but I won't judge because I can see a new approach in the points at least its not as same as always. The disturbed accumulation and distribution zones are quite interesting because if a small investor is not getting anything then a major investor on the same time cant manipulate it easily because currently the hodl-ers status is very strong and they wont give up either.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "carlfebz2",
      "created_time": "August 15, 2023, 11:33:34 PM",
      "body": "Quote from: Hamza2424 on August 15, 2023, 11:28:34 PMFirst of all, Op is a newbie and OP has a decent reputation tag to justify how we're all the same! I'm not sure if is there anyone who has the reputation as Op currently owns on just a few posts. The future seems to be Shining, Not tuning and offending but explaining the current status.So now moving on to the points Op mentioned here in this post sounds to be redundant but I won't judge because I can see a new approach in the points at least its not as same as always. The disturbed accumulation and distribution zones are quite interesting because if a small investor is not getting anything then a major investor on the same time cant manipulate it easily because currently the hodl-ers status is very strong and they wont give up either.A little bit off topic but i do have same views about that reputation tag which it is really that unlikely for a complete newbie to do so since they wont really be that having that full knowledge about on how this forum works or the things involved around but it seems that he is really that getting used to it or that familiar on how things been doing.So i do presume or assume out that he might be having other main account on this forum. Speaking with those points above on which it is really that true that it is really that redundant, we've seen tons of similar post about advises and other stuffs in correlation with trading and investment.We've been flooded out by lots of advises and those common points which a person should really be following but in overall it is really that something that cant be done by someone so easily or able to follow it out.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FASTPROFITTRADER",
      "created_time": "August 15, 2023, 11:36:10 PM",
      "body": "Quote from: mk4 on August 15, 2023, 04:15:37 AMThat's simply because of human nature. Now our only goal is to not fall into the same pits that people in the past have fallen onto.Though unfortunately for the most of us, experience is the best teacher. That's not necessarily bad though; as long as you jump back up and try again.Yes, unfortunately, you have to endure for a long time before you start earning))",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}