{
  "id": "topic_5476641",
  "title": "mikheilg",
  "author": "mikheilg",
  "created_time": "December 05, 2023, 03:37:46 PM",
  "content": "Dear members of this amazing forum.I hope this message finds you well. I'm reaching out to share an exciting opportunity that could be mutually beneficial. Recently, I've made a significant breakthrough in digital security, specifically in recovering access to lost or stolen Bitcoin and cryptocurrency accounts.To put my discovery into practice, I require a high-performance computer, far more advanced than my current equipment, a laptop with a 4060GTX. This is where I seek your support. I propose a community-funded initiative to acquire this necessary technology. In return, I offer my services at significantly reduced rates to those who contribute to this cause.This initiative is not a general solicitation for funds; it's a targeted request to those who will directly benefit from my services. My recent experiments, conducted on my personal accounts and it was a success. Took 3 days but nowhere near enough power as is a laptop. There are two paths forward:Community Support: With your help in funding the required equipment, I can start assisting you without imposing substantial fees.Waiting Period: Without the necessary equipment, I'm unable to offer these services, delaying potential recovery of your accounts.I assure you, this is not a plea for charity. I offer a tangible solution and am willing to demonstrate its efficacy, barring the disclosure of my proprietary methods for security reasons.To maintain the integrity of this service, I will require a government-issued ID from potential clients to ensure that I'm assisting the rightful owners of the accounts. This step is crucial to prevent misuse of this service and to comply with legal standards.For those interested, please feel free to reach out. I have provided a link to my Skype profile and my Bitcoin address for contributions. Your support will not only help in recovering your assets but also in pioneering a new standard in cryptocurrency security.A bit about myself: I'm a 36-year-old professional from Toronto, working in healthcare. My interest in digital security is born out of personal experiences with online scams and the challenges I faced in recovering from them. This project is not just a service; it's a mission to offer a safer, more secure digital financial environment.I'm also exploring the development of an innovative cryptocurrency wallet, prioritizing unparalleled security and ease of use, addressing common issues like lost seed phrases.Your support and trust mean the world to me. If you have any questions or need further clarification, please don't hesitate to contact me. Together, we can make a significant impact in the world of cryptocurrency security.Thank you for considering this opportunity. I look forward to potentially working together towards a safer digital future.Ampount needed is $10,000 min for the computerWarm regards,Michael",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5476641",
  "comments": [
    {
      "author": "robelneo",
      "created_time": "December 05, 2023, 04:39:02 PM",
      "body": "Quote from: mikheilg on December 05, 2023, 03:37:46 PMAmpount needed is $10,000 min for the computerWhile reading the first line of your post I just knew I would come to something like asking for a donation or funding and I was right so I quoted it here, and afterward, I checked your other 2 posts to see if I could discover something that will make me believe and trust what you're offering.Unfortunately, I cannot find something, you are just one of the other thousands who come here as a newbie asking for funding on their ideas without telling us their credentials you just introduced yourself as Michael and thought that we are that gullible to believe in what you're saying or ideas.Sorry Michael you have to come out something better than this.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "WillyAp",
      "created_time": "December 05, 2023, 04:47:03 PMLast edit: December 05, 2023, 05:27:52 PM by WillyAp",
      "body": "You requiere funding due to having an idea? As a healthcare professional you should be able to fetch a credit from your bank.QuoteA bit about myself: I'm a 36-year-old professional from Toronto, working in healthcare. My interest in digital security is born out of personal experiences with online scams and the challenges I faced in recovering from them. This project is not just a service; it's a mission to offer a safer, more secure digital financial environment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "December 05, 2023, 05:15:12 PM",
      "body": "Quote from: mikheilg on December 05, 2023, 03:37:46 PMRecently, I've made a significant breakthrough in digital security, specifically in recovering access to lost or stolen Bitcoin and cryptocurrency accounts.Yeah of course!Quote from: mikheilg on December 05, 2023, 03:37:46 PMTo put my discovery into practice, I require a high-performance computer, far more advanced than my current equipment, a laptop with a 4060GTX. This is where I seek your support. I propose a community-funded initiative to acquire this necessary technology. And you need a 4060GTX for that, you couldn't settle for a older card, you need a brand new one cause...Quote from: mikheilg on December 05, 2023, 03:37:46 PMWaiting Period: Without the necessary equipment, I'm unable to offer these services, delaying potential recovery of your accounts.How about this, you try with your older equipment, no matter how long it takes one recovery for a member here on the forum with enough reputation, so we would know this thing is legit before handing you money? Deal?Quote from: mikheilg on December 05, 2023, 03:37:46 PMTo maintain the integrity of this service, I will require a government-issued ID from potential clients to ensure that I'm assisting the rightful owners of the accounts. So now we have to hand you also our documents, to a complete stranger on the internet who isn't even allowed to have them lawfully in the first place.Quote from: mikheilg on December 05, 2023, 03:37:46 PMAmpount needed is $10,000 min for the computerAnd from $500 card we're up to $10000.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "decodx",
      "created_time": "December 05, 2023, 10:33:49 PM",
      "body": "Quote from: mikheilg on December 05, 2023, 03:37:46 PMI assure you, this is not a plea for charity. I offer a tangible solution and am willing to demonstrate its efficacy, barring the disclosure of my proprietary methods for security reasons.Michael, I'm not fully convinced your crypto recovery biz idea stacks up.  You say you've had this huge breakthrough recovering lost coins, but gotta level about needing more deets to back that up.  Like, show me case studies of it working.  Or have someone reputable audit your technique.  Make sense? It's nothing personal.  The crypto world has scammers running wild so you really gotta prove yourself trustworthy if youre asking for a truckload of cash and  i wanna believe you dude but extraordinary claims need extraordinary proof these days, feel me?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Vod",
      "created_time": "December 06, 2023, 12:47:10 AM",
      "body": "Michael, use your leet skills to hack abandoned bitcoin wallets.  You will be set for life, without scamming anyone!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "digaran",
      "created_time": "December 06, 2023, 02:09:54 AM",
      "body": "Here, there are 13 Bitcoins in there, grab them and keep them if you can.Code:03633cbe3ec02b9401c5effa144c5b4d22f87940259634858fc7e59b1c09937852We do this for a living around here, is your rent due or what? Lol this Brandon is every where.!!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "moneystery",
      "created_time": "December 07, 2023, 08:58:26 AM",
      "body": "why not sell your laptop to get some money? as far as i know, a laptop with a gtx 4060 is over $1000 usd, i think that's enough money to support this project that you say is revolutionary.or, because you are an employee in the health sector, you should be able to ask for help from the clients you are helping or your network to support your project. i think people in this field are generally rich and maybe you can get thousands of dollars from scamming  them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coin-investor",
      "created_time": "December 07, 2023, 03:57:22 PM",
      "body": "Quote from: moneystery on December 07, 2023, 08:58:26 AMor, because you are an employee in the health sector, you should be able to ask for help from the clients you are helping or your network to support your project. i think people in this field are generally rich and maybe you can get thousands of dollars from scamming  them.We are not sure if he is working in the health sector, we are not sure if this is a copy-paste post and we are not sure if this guy name is Michael but we are all sure this is a scam attempt from an outsider who thinks that it's easy to make money here by just asking, he is already tagged by VOD for asking money and this is the end of his journey here.This is not the first time I have seen a thread like this we already have hundreds of this coming from newly opened accounts, although this one is innovative it's still a scam attempt, we all know about this attempt I'm just surprised that many people have the impressions that its easy to make money here by asking or should I say begging.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pmalek",
      "created_time": "December 07, 2023, 05:51:41 PM",
      "body": "That's not going to work. No one is going to give you $10.000 or even $10 because you haven't demonstrated your revolutionary method. You can also forget about acquiring people's KYC details. Many members here don't even want to provide it to centralized exchanges and casinos to pay out their winnings, let alone to an unknown person on the internet who made a cute post.  You haven't even stated what you are recovering exactly besides saying it's \"accounts\". What accounts? Is it web wallets? If so, which ones? Is it exchange accounts? If so, which ones? How are you going to prove that this is working? And no, I am not going to go on Skype or Telegram to find out. Tell us here.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joniboini",
      "created_time": "December 08, 2023, 01:25:43 AM",
      "body": "I just checked your Skype and I can't say it gives me confidence at all. Your profile pic looks cool tho. Maybe you can share some pics related to your Byteback project if you don't want to market yourself as a scammer. You can also go public with your personal details first before asking people about KYC. That's just an easy way to sell data to the darknet for you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Saisher",
      "created_time": "December 08, 2023, 09:28:16 AM",
      "body": "A professional guy who he claims to be will not do what he did you don't go to a forum or any online community without putting up his credentials and asking to get funded this is like begging, in the case of this Michael he did not how to properly present his ideas this is just an attempt to maybe scam because he is not putting his credentials to show readers that he is honest with what he is asking.This is unprofessional and unethical for someone who claims to be professional and obviously, he has no idea what Bitcointalk is and how harsh people will deal with this kind of offer.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mikheilg",
      "created_time": "December 11, 2023, 03:27:16 PM",
      "body": "Alright, let's set the record straight. I've come here with a genuine proposal, driven by real experience and a breakthrough that has potential. Yet, what do I get? A barrage of skepticism and nitpicking. I'm not here to play games or waste anyone's time. I'm here because I believe in what I've developed and its potential to make a real difference.To those who've decided to question my credibility without even a shred of curiosity about what I've accomplished – I find your lack of openness and quick judgment frankly disappointing. I'm not just 'some guy' making baseless claims. My proposal is grounded in substantial personal experience and expertise. Yes, I asked for support, because real progress requires real resources. This isn't about begging for handouts; it's about seeking collaboration on something that could benefit us all.For those quick to label me an idiot or a scammer, I urge you to take a step back. Challenge my ideas, sure, but do it constructively. How about engaging in a meaningful conversation instead of jumping to conclusions? If you're not interested, fine, but there's no need for disparagement.To those genuinely interested or curious, I'm here to answer questions and discuss further. Let's focus on potential and constructive dialogue. This project isn't just about me; it's about what we can achieve together in the realm of digital security. For those willing to see beyond their doubts, I'm ready to collaborate and make a significant impact.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stepsinvesting",
      "created_time": "December 12, 2023, 07:30:54 AM",
      "body": "Your idea sounds interesting, but I'm a bit in the dark here. Could you throw me a few more clues? Anything you add will help me understand better and I can chip in with some cool suggestions or insights.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Vod",
      "created_time": "December 12, 2023, 09:32:57 AM",
      "body": "Quote from: mikheilg on December 11, 2023, 03:27:16 PMI'm not just 'some guy' making baseless claims.Yes you are.  If you can hack encryption, go get a job with the CIA instead of begging for funds on an anonymous forum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "arabspaceship123",
      "created_time": "December 12, 2023, 08:22:09 PM",
      "body": "I'm a dev looking for work. I'd like to be part of a good team trying to achieve results. I'm open to working with ppl who're handling serious business projects but you aren't running serious business. You don't have a breakthrough project. You aren't inviting collaboration you're after investment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "aioc",
      "created_time": "December 15, 2023, 04:00:35 PM",
      "body": "Quote from: mikheilg on December 05, 2023, 03:37:46 PMAmpount needed is $10,000 min for the computerWarm regards,MichaelYou're misleading the people you're not looking for collaborators, you're looking for investors, and you're not going to ask for money from your would-be partners it should first start with an exchange of ideas, people can do it on forums because they are anonymous compared to social media sites like Linked where people will see and verify your identity.So they composed topics like this in the hope they could get at least one victim who would agree to send them money, but unfortunately, the community is too fast to refute and tag those who will try to deceive people.OP should take a long vacation and not come back here anymore, your account is already tagged and people will always suspect your motives each time you create a topic like this, while on vacation take time to reflect and find a better job to sustain yourself instead of begging for money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "wallet4bitcoin",
      "created_time": "December 16, 2023, 11:26:19 PM",
      "body": "Quote from: robelneo on December 05, 2023, 04:39:02 PMQuote from: mikheilg on December 05, 2023, 03:37:46 PMAmpount needed is $10,000 min for the computerWhile reading the first line of your post I just knew I would come to something like asking for a donation or funding and I was right so I quoted it here, and afterward, I checked your other 2 posts to see if I could discover something that will make me believe and trust what you're offering.Unfortunately, I cannot find something, you are just one of the other thousands who come here as a newbie asking for funding on their ideas without telling us their credentials you just introduced yourself as Michael and thought that we are that gullible to believe in what you're saying or ideas.Sorry Michael you have to come out something better than this. To add to you observations..Someone with solutions will give details or evidence of jobs done. The nature of solution you claim to have arrived at is priceless and will attract high valued clients and if you have truly achieved it and have recorded success then the recipient is in no other way than to pay heavily for it. You can also reachout to agencies that does what you do but at a lesser level to sponsor or get you hired so you can offer your services there. In here, you are only a newbie with a few posts and no evidence of reputation",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}