{
  "id": "topic_5410990",
  "title": "Punt.com",
  "author": "Punt.com",
  "created_time": "August 23, 2022, 11:44:45 PMLast edit: May 17, 2024, 09:30:31 PM by Punt.com",
  "content": "untitled",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5410990",
  "comments": [
    {
      "author": "Punt.com",
      "created_time": "August 23, 2022, 11:52:21 PMLast edit: May 17, 2024, 09:36:58 PM by Punt.com",
      "body": ".",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yahoo62278",
      "created_time": "August 24, 2022, 12:20:04 AM",
      "body": "Welcome to the forum!!! I look forward to working with you and seeing how this casino grows. Bitcointalk, stay tuned as we prepare some promotions for the community including a signature campaign.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Punt.com",
      "created_time": "August 24, 2022, 12:32:56 AMLast edit: May 17, 2024, 09:37:11 PM by Punt.com",
      "body": ".",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "btc78",
      "created_time": "August 24, 2022, 01:24:24 AM",
      "body": "Quote from: yahoo62278 on August 24, 2022, 12:20:04 AMWelcome to the forum!!! I look forward to working with you and seeing how this casino grows. Bitcointalk, stay tuned as we prepare some promotions for the community including a signature campaign.surely this will be a Big event as Yahoo is one of the most reputable and respected campaign manager and forum member.________________________________Welcome to the forum Punt.com  i like the idea of Dueling pvp in dice its a rare casino that offers this kind of gaming.looking forward trying that 0% commission later this day as i still have been waiting for my work to end now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cabron",
      "created_time": "August 24, 2022, 02:44:08 AM",
      "body": "Similar to Blackjack.fun  but they do have sports and also wanna try that Player vs Player. I wonder what users have to say about it and was it good to engage. I just took at it and I can only see 1 player waiting. TOS is prompted when you are about to register, if you ever want to read it but its the same as any casino. https://punt.com/policies/terms-and-conditionsWelcome to Bitcointalk!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Chato1977",
      "created_time": "August 24, 2022, 02:54:23 AM",
      "body": "Its love seeing that P vs P gaming , this is very interesting in our part that is mostly bored in regular way of betting and gambling.Welcome to Bitcointalk.org forum guys and also welcome in your Signature campaign that had been posted by our Good and Popular Bounty manager yahoo62278Will be loving to see you go Big time in this platform and Out.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ethereumhunter",
      "created_time": "August 24, 2022, 02:55:10 AM",
      "body": "Quote from: Punt.com on August 23, 2022, 11:52:21 PMTo celebrate the launch of Punt.com, we are currently offering 0% Commission on our Provably Fair Player vs. Player Dice Duels! This is completely unprecedented. There is no code needed to take part. Enjoy!  -Punt Management Welcome to Bitcointalk.org. I hope you have your greatest time expanding your business using this forum and become one of the recommended casinos to play. I want to ask about something. Is there any estimate of how long you will let the offers run? Or will you update it when the offering ends?I already visited your website and have 9 cryptocurrencies that we can use to deposit. It is good for gamblers because I see that the currency you have is something they like. So I think it is easier for gamblers to choose any coins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "btc78",
      "created_time": "August 24, 2022, 03:01:35 AM",
      "body": "Quote from: cabron on August 24, 2022, 02:44:08 AMSimilar to Blackjack.fun  but they do have sports and also wanna try that Player vs Player. I wonder what users have to say about it and was it good to engage. I just took at it and I can only see 1 player waiting. yeah and something alike of how Duelbits started , Duel is one way to lure players because of its uniqueness comparing to other regular kind of casino.QuoteTOS is prompted when you are about to register, if you ever want to read it but its the same as any casino. https://punt.com/policies/terms-and-conditionsWelcome to Bitcointalk!and also this is what shows them good, they are not Hiding their TOS instead they wanted players to read it first even before  planning to deposit and play.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Strongkored",
      "created_time": "August 24, 2022, 03:04:36 AM",
      "body": "A Warm welcome for you punt casino, It's nice to see your casino working with a reputable manager in this forum, sports betting is still unavailable, there is the exact date to launch?Quote from: yahoo62278 on August 24, 2022, 12:20:04 AMWelcome to the forum!!! I look forward to working with you and seeing how this casino grows. Bitcointalk, stay tuned as we prepare some promotions for the community including a signature campaign.Glad to read that there will be other promotions for members of this forum apart from the signature campaign. I like the signature code design because it looks perfect.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rodskee",
      "created_time": "August 24, 2022, 03:20:30 AM",
      "body": "Quote from: Punt.com on August 23, 2022, 11:52:21 PMTo celebrate the launch of Punt.com, we are currently offering 0% Commission on our Provably Fair Player vs. Player Dice Duels! This is completely unprecedented. There is no code needed to take part. Enjoy!  -Punt Management Hello and welcome in our Humble forum , and also glad to see you collaborating with  yahoo for your plans of running advertising in bitcointalk.0 commission seems to be generous for the launch so how long this will run? any way its always glad to see new site promoting and focusing here in this forum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "StakeGG",
      "created_time": "August 24, 2022, 03:29:42 AM",
      "body": "I thoroughly enjoyed my time on Punt and will likely make it my preferred online casino moving ahead. It is very rare to see a brand new site that checks all the boxes a great domain, variety of games, generous odds, and an owner who seems to be in it for the long haul. It wouldn't surprise me if Punt.com is the #1 crypto gambling site by the end of the year by rate you're growing. Look forward to seeing you make a positive impact on this scene.By the way could you elucidate what 0% commission means in regards to Dice Duels. Does 0% commission mean that the duel is essentially a coin flip since the site doesn't take a percentage of the pot/wager. If so, that is incredible and something that crypto gambling has needed for a long time now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dimonstration",
      "created_time": "August 24, 2022, 03:31:04 AM",
      "body": "Welcome to the forum. I see the resemblance of Duelbits when I browse the website due to the PVP  concept games and design but it has its own uniqueness especially the casino design  that so attractive in the eyes. I try to browse the casino and I can't find the category for the VIP or loyalty reward program. Is it accessible only for user with casino account or this feature is not yet available in the casino?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ludmilla_rose1995",
      "created_time": "August 24, 2022, 03:31:18 AM",
      "body": "welcome to this BTT forum Punt.com, nice to see you guys competing with other gambling sites, I'll try to explore your site.Quote from: rodskee on August 24, 2022, 03:20:30 AMQuote from: Punt.com on August 23, 2022, 11:52:21 PMTo celebrate the launch of Punt.com, we are currently offering 0% Commission on our Provably Fair Player vs. Player Dice Duels! This is completely unprecedented. There is no code needed to take part. Enjoy!  -Punt Management Hello and welcome in our Humble forum , and also glad to see you collaborating with  yahoo for your plans of running advertising in bitcointalk.0 commission seems to be generous for the launch so how long this will run? any way its always glad to see new site promoting and focusing here in this forum.yahoo is a very amazing Bounty Manager. Punt.com will surely be a big success under yahoo management!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "babygun",
      "created_time": "August 24, 2022, 03:35:20 AM",
      "body": "Welcome to the forum! Always nice to see new casinos popping up and the player vs player duels seems interesting especially with the 0% commission. There are already 10 house games which is nice and the collection of third party slots that you offer is not bad also (a lot of the top providers are present). Hopefully the sports book will be added soon!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "malcovi2",
      "created_time": "August 24, 2022, 03:52:19 AM",
      "body": "Quote from: cabron on August 24, 2022, 02:44:08 AMSimilar to Blackjack.fun  but they do have sports and also wanna try that Player vs Player. I wonder what users have to say about it and was it good to engage. I just took at it and I can only see 1 player waiting. TOS is prompted when you are about to register, if you ever want to read it but its the same as any casino. https://punt.com/policies/terms-and-conditionsWelcome to Bitcointalk!I clicked the sportsbook and still says coming soon.I hope there would be bonuses and promotions that will be offered in the near future, I would surely be happy to try the site of there is one. Will there be a poker room to be offered? There seems to be a lack of casinos offering this kind of feature.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitinity",
      "created_time": "August 24, 2022, 04:01:56 AM",
      "body": "Quote from: dimonstration on August 24, 2022, 03:31:04 AMI try to browse the casino and I can't find the category for the VIP or loyalty reward program. Is it accessible only for user with casino account or this feature is not yet available in the casino?Yes you have to have an account to see the benefit of the VIP program, I created a throw away account to check and here you can see what are the benefits of being VIP in punt.com: Quite similar to the one you can see in the casino you are promoting in your signature. Of course the information about the VIP program in punt.com is still not enough because we do not know how much to wager to reach each level of the VIP level/rank. Punt.com need to have separated page to explain more details about their VIP program so potential player do not need to create an account first to check the benefits/advantages of being active players in their casino.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "acroman08",
      "created_time": "August 24, 2022, 04:08:44 AM",
      "body": "Welcome to the forum! I haven't really checked the website but one thing that caught my eye after seeing your post is that the design is highly similar to stake.com but the color is similar to duelbits. anyway, Goodluck!it's a good choice that you hired yahoo as your campaign manager. he is one of the most trusted campaign managers here in the forum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lienfaye",
      "created_time": "August 24, 2022, 04:20:42 AM",
      "body": "Quote from: Punt.com on August 23, 2022, 11:52:21 PMTo celebrate the launch of Punt.com, we are currently offering 0% Commission on our Provably Fair Player vs. Player Dice Duels! This is completely unprecedented. There is no code needed to take part. Enjoy!  -Punt Management Welcome to the forum.After seeing the signature campaign managed by one of the reputable campaign manager here, I became interested to know more about your casino. I have not registered yet but I will do it later. Looking forward to play on your site.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cointxz",
      "created_time": "August 24, 2022, 04:35:51 AM",
      "body": "Is there any existing promotion for newly registered member in the casino? I knew that you are planning to have promotion here in forum aside from signature campaign. I hope for a free spin or cash drop to try the casino besides the 0% commission fee on your games. The casino is interesting because it has already a complete set of games and the upcoming sportsbook will make it more attractive. Yahoo is the best choice to manage your promotion here in the forum since he is reputable and he will surely attract viewers and players here because of that credential. Looking forward on your promotion guys!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}