{
  "id": "topic_5417383",
  "title": "NotATether",
  "author": "NotATether",
  "created_time": "October 17, 2022, 07:12:06 AM",
  "content": "New York introduced the Bitlicense back in 2015 in order to stop crypto fraud, but the verification requirements for businesses are so excessive that we can compare it to a random crypto casino asking for a lot of KYC after a big win.This has resulted in many exchanges and fintechs (read: international banks 2.0) shutting down operations in New York. Which is particularly annoying if you happen to live there since these operations are available in every other state.It was hoped that the New York mayor Eric Adams would do something about it, but so far, there's only been more anti-mining billsSo, to people living there or hopping between different states, the normal cryptocurrency users - how are you guys coping with this?Is there any way/hope that they will reform the regulations to make the requirements easier to comply with?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5417383",
  "comments": [
    {
      "author": "SFR10",
      "created_time": "October 17, 2022, 04:10:48 PM",
      "body": "Quote from: NotATether on October 17, 2022, 07:12:06 AMIs there any way/hope that they will reform the regulations to make the requirements easier to comply with?I don't think so... Despite reading \"this [refer to the \"NEW DEVELOPMENTS\" section]\", I still can't think of an instance where they actually made life easier for BitLicense holders [e.g. I couldn't find the exact thread, but there was a user on this forum that mentioned he spent more to gather & fulfill the requirements than he paid for the application fee] and \"this\" is one of their recent additions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "October 17, 2022, 05:22:44 PM",
      "body": "Quote from: SFR10 on October 17, 2022, 04:10:48 PM\"this\" is one of their recent additions.To put it bluntly - that's fucking stupid. Periodic compliance fees? That will make non-compliance fines useless.Anything special action groups for crypto can do to campaign for a change in legislature?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jackg",
      "created_time": "October 17, 2022, 09:46:08 PM",
      "body": "Is it possible to circumvent this with a vpn too for a lot of sites or is there tougher legislation about that (such as proof of address).This probably adds the an argument of trying to make things more decentralised. Convert to cash with a large company (I assume coinbase and binance are still operating there, binance is operating in the UK illegally still lol) and just use dexes for converting between cryptos (and stable coins).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "October 18, 2022, 05:27:55 AM",
      "body": "Quote from: jackg on October 17, 2022, 09:46:08 PMIs it possible to circumvent this with a vpn too for a lot of sites or is there tougher legislation about that (such as proof of address).This probably adds the an argument of trying to make things more decentralised. Convert to cash with a large company (I assume coinbase and binance are still operating there, binance is operating in the UK illegally still lol) and just use dexes for converting between cryptos (and stable coins).A VPN from NY or some other state to some location in another unbanned state in the US should do fine, but not one to a different country obviously. The exchanges seem to care only that you are using the account in the US as you are supposed to, but they don't have the means to track your state - it's not on your ID card, so it can only be determined from the IP address, which has just been masked.It would be better if there was VPN software that tunneled your connection only for specific websites / domain names.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "philipma1957",
      "created_time": "October 21, 2022, 10:39:55 PM",
      "body": "Quote from: NotATether on October 17, 2022, 07:12:06 AMNew York introduced the Bitlicense back in 2015 in order to stop crypto fraud, but the verification requirements for businesses are so excessive that we can compare it to a random crypto casino asking for a lot of KYC after a big win.This has resulted in many exchanges and fintechs (read: international banks 2.0) shutting down operations in New York. Which is particularly annoying if you happen to live there since these operations are available in every other state.It was hoped that the New York mayor Eric Adams would do something about it, but so far, there's only been more anti-mining billsSo, to people living there or hopping between different states, the normal cryptocurrency users - how are you guys coping with this?Is there any way/hope that they will reform the regulations to make the requirements easier to comply with?Well I moved to New Jersey years ago. Problem was improved a lot.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}