{
  "id": "topic_5413301",
  "title": "totti67",
  "author": "totti67",
  "created_time": "September 12, 2022, 05:00:01 PM",
  "content": "Az önce okuduğum ilginç bir haberde ( belki de sadece bana ilginç gelmiştir ), 1950'de ortalama IQ yaklaşık 93.6 iken, günümüzde küresel ortalama IQ 85 civarında ve yüzyılın sonunda 74 olacak deniyor. Konunun gelişmiş ülkeler ve daha az gelişmiş ülkelerde nasıl ilerlediği ile ilgili bilgiler de var.Kişisel olarak coğrafya ve bunun getirdiği sosyo ekonomik şartların ülkelerin herseyine olduğu gibi IQ seviyelerine de etki ettiği fikrine katılmakla beraber, genetiğin de diğer faktörlerden olumlu veya olumsuz mutlaka etkilenebilecegi fikrine de uzak değilim. Peki sizce, dünyanın IQ su nereye gidiyor, biz bu serüvenin neresindeyiz?https://georgefrancis.substack.com/p/dysgenics-by-the-numbers",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5413301",
  "comments": [
    {
      "author": "Phoenix Anka",
      "created_time": "September 12, 2022, 05:06:57 PM",
      "body": "Dünyanın iqsu düşüyor bunu görmek için mükemmel gözlere sahip olmak gerekmiyor zaten. Üniversite sınavında barajı geçemeyen o kadar çocuk var ki (aslında bunu iq’ye bağlamak doğru olmuyor ama bir yerde iq ile de ilgili ) barajı kaldırdılar ülkede. 10-15 sene önceki gençler ile bu sene gençleri arasındaki farkı bile biz görürken bizden öncekilerden farkı anlamak daha kolay olur.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LGD2Business",
      "created_time": "September 12, 2022, 05:22:00 PM",
      "body": "Akıllı adamın çeşitli nedenlerle üremediği veya az çocuk yaptığı, düşük IQluların gelecek kaygısı taşımadan 20şer çocuk yapıp nasılsa devlet bakar diye sokağa bıraktığı bir ortamda dünyanın IQ seviyesinin düşmesi hiç şaşırtıcı gelmedi. Araştırmalara derinlemesine bakılırsa aslında çok zeki insan sayısında da artış var ama ortalamalara bakınca durum içler acısı. Aşırı zekilerin dünyayı iyi yönde değiştirmesini beklerken örgütlü cehaletin de dünyayı cehenneme çevirdiğine tanıklık ediyoruz. Bakalım bu savaşı kim kazanacak.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "totti67",
      "created_time": "September 12, 2022, 05:32:18 PM",
      "body": "İste tam olarak konudaki ana fikir bu hocam, tebrikler gercekten",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "totti67",
      "created_time": "September 12, 2022, 05:34:41 PM",
      "body": "Quote from: Phoenix Anka on September 12, 2022, 05:06:57 PMDünyanın iqsu düşüyor bunu görmek için mükemmel gözlere sahip olmak gerekmiyor zaten. Üniversite sınavında barajı geçemeyen o kadar çocuk var ki (aslında bunu iq’ye bağlamak doğru olmuyor ama bir yerde iq ile de ilgili ) barajı kaldırdılar ülkede. 10-15 sene önceki gençler ile bu sene gençleri arasındaki farkı bile biz görürken bizden öncekilerden farkı anlamak daha kolay olur. Eğitimin her dönemde etkin bilim adamları tarafından yapılacak çalıştaylar ile revize edilmesi gerekli bence. Biz aynı şeyi aynı yöntemlerle ezbere dayalı şekilde vermeye devam ettikçe sonuç değişmeyecek ne yazık ki...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "eightdots",
      "created_time": "September 12, 2022, 05:37:30 PM",
      "body": "Sayı arttıkça kalite düşer her şeyde olduğu gibi. Nüfusun plansız olarak artması sonucu ortaya çıkması kaçınılmaz istatistik. Şartlar bakımından az biraz iq'sü yüksek kişiler dünyaya getirecekleri çocuğun binbir türlü aşamasını düşünüp zar zor karar verirken diğer tarafta üremeyi hedef edinmiş bir insan toplulukları varken çok da şey yapmamak lazım. Düşer de düşer.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "RaltcoinsB",
      "created_time": "September 12, 2022, 06:04:50 PM",
      "body": "Quote from: totti67 on September 12, 2022, 05:34:41 PMQuote from: Phoenix Anka on September 12, 2022, 05:06:57 PMDünyanın iqsu düşüyor bunu görmek için mükemmel gözlere sahip olmak gerekmiyor zaten. Üniversite sınavında barajı geçemeyen o kadar çocuk var ki (aslında bunu iq’ye bağlamak doğru olmuyor ama bir yerde iq ile de ilgili ) barajı kaldırdılar ülkede. 10-15 sene önceki gençler ile bu sene gençleri arasındaki farkı bile biz görürken bizden öncekilerden farkı anlamak daha kolay olur. Eğitimin her dönemde etkin bilim adamları tarafından yapılacak çalıştaylar ile revize edilmesi gerekli bence. Biz aynı şeyi aynı yöntemlerle ezbere dayalı şekilde vermeye devam ettikçe sonuç değişmeyecek ne yazık ki...Aynen öyle hocam revize edilen çalıştaylar ile ancak kendini bulur eğitim sistemi aslında sadece onunla da değil ezbere dayalı sistemi komple hayatımızdan çıkarmak lazım yoksa durum beter bir hal alır aslında sadece beter bir hal almakla kalmaz IQ seviyesi sürekli olarak düşüş gösterir bu da genetiklerimize işleyip bizi kötü yapar",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kriminall",
      "created_time": "September 12, 2022, 07:36:27 PM",
      "body": "Kuşaklardan kuşaklara kalite düşebilir veya yükselebilir, şimdilerde Z kuşağı denilen kuşağın içindeki erişkin olmak üzere olanların zamanı ve her elin parmaklarının aynı olmadığı gibi, her kuşak aynı kişi değildir, birinci ve ikinci dünya savaşında kuşaklar yok olmuşken, bugün kuşakların zekasını kıyaslamak doğru değil, önemli olan bu sorunun nasıl çözülebileceği üzerine hani daha zeki olan bizim kuşak ya bizim kuşağın çözüm bulması olabilir,",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "karabiber",
      "created_time": "September 12, 2022, 09:24:22 PM",
      "body": "Bana kalırsa zihinsel gerilemenin temelde yediğimiz gıdalardan kaynaklandığını düşünüyorum. Ludwig Feuerbach “insan, yediği şeydir” diye boşuna söylememiş. Modernleşen ve gelişen dünyanın öteki tarafında daha fazla kar ve büyüme hedefleyen şirketlerin kobayları haline geliyoruz. Kalabalıklaşan şehirler, hemen hemen şey de hazıra alıştırılmamız, çözüm üretmek yerine şikayet etmeyi birinci sıraya koymamız bizi bu hale getiriyor. Özellikle dünyadaki eğitim kalitesinin de düştüğünü ve sosyal medya ile beraber IQ’nun daha hızlı düşüşe geçtiğini düşünüyorum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "meser#",
      "created_time": "September 12, 2022, 09:53:12 PM",
      "body": "Ben bu durumu ne yazık ki teknolojik gelişmelere bağlıyorum. Teknoloji geliştikçe insanın yapacağı iz azalıyor ve insan bu noktada tembelliğe alışıyor. Örnek veriyorum: https://twitter.com/furkangulsenn/status/1568509580765794305?s=20&t=gJL60cIYkY5m7UsAftz1bgŞu videoda şu an piyasada bulunan iyi yazılımcı diyebileceğimiz kişilerin ortak noktasından bahsetmiş hacı abimiz. Seneler seneler önce bir üniversite topluluğunun hazırlamış olduğu teknoloji çalıştayına gitmiştim. İçinde önde gelen yazılımcıların konuşma yaptığı kısımlar vardı ve bir tanesiyle molada çay sigarada sohbet etmiştik. Sohbet etmiştik derken tek ben yoktum etrafında rahatlıkla bi 30 kişi vardı. Şöyle demişti biz bu işi öğrenirken elimizde bir kitabın bir sayfası vardı onu bulmak ise gerçekten zordu. Biz kütüphanelerde bulabildiğimiz her kitabı defalarca okuyorduk. Çünkü o zamanlar bilgi bir hazineydi şimdi ise her yerde kaynak var ve gençler tembellikten kendini geliştirmiyor. Şuanda binlerce yazılım nasıl öğrenilir videosu vardır milyonlarca kez izlenmiş ancak kafasında bir proje olup şurasını nasıl yaparım burasını nasıl ederim diyen sayısı bu sayının belkide 1000'de biridir ki gayet ılımlı bir sayı ssöyledim. Zaten teknolojinin temelleri atan şey insanın kendini ve çevresini sorgulayıp anlam kazandırmaya bir sonuç elde etmeye iten isteği değil miydi? Şuan google'da aratıp tak diye bir sonucu bulabiliyor ancak o sonucu kendisinin nasıl bulabileceğini bilmiyor. Beyin öyle bir organ ki, çalıştırmadıkça hamlaşıyor hamlaştıkça zeka seviyesi yerlere iniyor. Başka  bir örnek vereyim sizlere. Bir ara çok dalgası geçilmişti çobanların Türkiye birincisi olması. Bunun en büyük sebebi teknolojinin dikkatini dağıtmaması dağın başında önündeki soruları çözebilecek tek şey kendisi ve biricik beyni. Bir soruyu çözene kadar zorladıkça zorluyor. Sürekli çalışıyor ve beynini çalıştırıyor. Sonuç Türkiye 1.si oluyor arkadaş. Teknoloji hamlaştırıyor insanları. Ve öyle bir noktaya gelinir ki teknolojiyi beslemeyemeyecek insanoğlu ve tekrardan teknoloji icat etmek zorunda kalacak.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "totti67",
      "created_time": "September 13, 2022, 05:25:43 AM",
      "body": "Quote from: eightdots on September 12, 2022, 05:37:30 PMSayı arttıkça kalite düşer her şeyde olduğu gibi. Nüfusun plansız olarak artması sonucu ortaya çıkması kaçınılmaz istatistik. Şartlar bakımından az biraz iq'sü yüksek kişiler dünyaya getirecekleri çocuğun binbir türlü aşamasını düşünüp zar zor karar verirken diğer tarafta üremeyi hedef edinmiş bir insan toplulukları varken çok da şey yapmamak lazım. Düşer de düşer.nüfusu plansız artan ülkeler zaten geri kalmış ülkeler, sevişmenin doğal sonucu olarak çocuk olması gerektiğine inananlar yani. aslında mevzu daha az üremesi gerekenlerin çok, çok üremesi gerekenlerin de az üremesi belki de",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "totti67",
      "created_time": "September 13, 2022, 05:28:06 AM",
      "body": "Quote from: meser# on September 12, 2022, 09:53:12 PMBen bu durumu ne yazık ki teknolojik gelişmelere bağlıyorum. Teknoloji geliştikçe insanın yapacağı iz azalıyor ve insan bu noktada tembelliğe alışıyor. Örnek veriyorum: https://twitter.com/furkangulsenn/status/1568509580765794305?s=20&t=gJL60cIYkY5m7UsAftz1bgŞu videoda şu an piyasada bulunan iyi yazılımcı diyebileceğimiz kişilerin ortak noktasından bahsetmiş hacı abimiz. Seneler seneler önce bir üniversite topluluğunun hazırlamış olduğu teknoloji çalıştayına gitmiştim. İçinde önde gelen yazılımcıların konuşma yaptığı kısımlar vardı ve bir tanesiyle molada çay sigarada sohbet etmiştik. Sohbet etmiştik derken tek ben yoktum etrafında rahatlıkla bi 30 kişi vardı. Şöyle demişti biz bu işi öğrenirken elimizde bir kitabın bir sayfası vardı onu bulmak ise gerçekten zordu. Biz kütüphanelerde bulabildiğimiz her kitabı defalarca okuyorduk. Çünkü o zamanlar bilgi bir hazineydi şimdi ise her yerde kaynak var ve gençler tembellikten kendini geliştirmiyor. Şuanda binlerce yazılım nasıl öğrenilir videosu vardır milyonlarca kez izlenmiş ancak kafasında bir proje olup şurasını nasıl yaparım burasını nasıl ederim diyen sayısı bu sayının belkide 1000'de biridir ki gayet ılımlı bir sayı ssöyledim. Zaten teknolojinin temelleri atan şey insanın kendini ve çevresini sorgulayıp anlam kazandırmaya bir sonuç elde etmeye iten isteği değil miydi? Şuan google'da aratıp tak diye bir sonucu bulabiliyor ancak o sonucu kendisinin nasıl bulabileceğini bilmiyor. Beyin öyle bir organ ki, çalıştırmadıkça hamlaşıyor hamlaştıkça zeka seviyesi yerlere iniyor. Başka  bir örnek vereyim sizlere. Bir ara çok dalgası geçilmişti çobanların Türkiye birincisi olması. Bunun en büyük sebebi teknolojinin dikkatini dağıtmaması dağın başında önündeki soruları çözebilecek tek şey kendisi ve biricik beyni. Bir soruyu çözene kadar zorladıkça zorluyor. Sürekli çalışıyor ve beynini çalıştırıyor. Sonuç Türkiye 1.si oluyor arkadaş. Teknoloji hamlaştırıyor insanları. Ve öyle bir noktaya gelinir ki teknolojiyi beslemeyemeyecek insanoğlu ve tekrardan teknoloji icat etmek zorunda kalacak. daha zekilerin yaptığı buluşlar icatlar vs. yüzünden, diğerlerinin git gide zeka seviyesinin düşmesi fikri, gerçekten mantıklı geliyor kulağa hocam.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "totti67",
      "created_time": "September 13, 2022, 05:32:27 AM",
      "body": "Quote from: karabiber on September 12, 2022, 09:24:22 PMBana kalırsa zihinsel gerilemenin temelde yediğimiz gıdalardan kaynaklandığını düşünüyorum. Ludwig Feuerbach “insan, yediği şeydir” diye boşuna söylememiş. Modernleşen ve gelişen dünyanın öteki tarafında daha fazla kar ve büyüme hedefleyen şirketlerin kobayları haline geliyoruz. Kalabalıklaşan şehirler, hemen hemen şey de hazıra alıştırılmamız, çözüm üretmek yerine şikayet etmeyi birinci sıraya koymamız bizi bu hale getiriyor. Özellikle dünyadaki eğitim kalitesinin de düştüğünü ve sosyal medya ile beraber IQ’nun daha hızlı düşüşe geçtiğini düşünüyorum.Besin endüstrisi dünya üzerinde belki de en çok karanlık nokta bulunan endüstrilerden. Dünya da en nihayetinde bir gezegen, toprak alanı belli, su alanı belli, dolayısıyla üzerinde barındırabileceği insan sayısı da üç aşağı beş yukarı bellidir. Ama nüfus öyle bir noktaya geldi ki, önümüzdeki yüzyılda savaşlar petrol gaz vs. için değil, besin kaynakları için olacak.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "RaltcoinsB",
      "created_time": "September 13, 2022, 11:45:18 AM",
      "body": "Quote from: totti67 on September 13, 2022, 05:25:43 AMQuote from: eightdots on September 12, 2022, 05:37:30 PMSayı arttıkça kalite düşer her şeyde olduğu gibi. Nüfusun plansız olarak artması sonucu ortaya çıkması kaçınılmaz istatistik. Şartlar bakımından az biraz iq'sü yüksek kişiler dünyaya getirecekleri çocuğun binbir türlü aşamasını düşünüp zar zor karar verirken diğer tarafta üremeyi hedef edinmiş bir insan toplulukları varken çok da şey yapmamak lazım. Düşer de düşer.nüfusu plansız artan ülkeler zaten geri kalmış ülkeler, sevişmenin doğal sonucu olarak çocuk olması gerektiğine inananlar yani. aslında mevzu daha az üremesi gerekenlerin çok, çok üremesi gerekenlerin de az üremesi belki de Üremeyle dünyaya gram faydası olmayan insanlar ürediler ve etrafta parazit gibi dolaşıyorlar bir de bakıyorsun bilim adamları vb insanlar çok çocuk politikasına karşı keşke o insanlar da en az 5 çocuk yapsalar zeka genetik sonuçta en azından gerizekalılar yerine halkın içinde kalsa bile belirli bir seviyeyi geçmiş insanlar olurlar",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SUPERSAIAN",
      "created_time": "September 13, 2022, 02:52:03 PM",
      "body": "Nüfus fazlalığı en büyük etken birde yaşam şekli çok önemli bir çok insan bende dahil yaşamaya başladığında okul ardından üniversite bitiriyorsun sonra calışmaya başla emeklilik bitti bu kadar, eğitim değil buradaki problem direk kalıba oturtulmak keşke tam anlamıyla gereken eğitimi alsa çocuklarımız o da yok. Bir çok insan mesleğini sevmeden sadece zorunluluktan ve geçinmek için zorunluluktan böyle yaşıyorlar bu durum negatif ve bence insanın ıq'sunu düşürecek etkenler biriside istemediğin durumlarla mücadele etmek. IQ geliştiren durumlardan biride bana göre rekabet etmek, motivasyonu bu şekilde sağlamak daha kolay.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "totti67",
      "created_time": "September 14, 2022, 06:24:41 AM",
      "body": "rekabet gerçekten önemli bir motivasyon ama işte burada da karşımıza psikolojik dayanıklılık çıkıyor ve bunun da yolu yine eninde sonunda muhakeme yeteneği, olayları analiz edebilme becerisinden geçiyor ki bu da direkt IQ seviyesiyle bağlantılı aslında.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "xzone",
      "created_time": "September 14, 2022, 05:13:34 PM",
      "body": "Eskiden insanlar hayatta kalmak için zekasını kullanmak zorundaydı, artık her şey bedava. Zamanla yaşamak daha da kolay bir hale gelecek ve insanların zekasını geliştirmesine gerek kalmayacak. Çalıştırmadığınız şey zamanla küçülür, beyninizi kullanmazsanız bir süre sonra zekanızda gerileme olur gibi bir mantıkla düşünebilirsiniz.Artık her şeyi yerimize düşünen cihazlar, bizim için yapan teknolojik aletler var. Kendimizi çok fazla kasmaya gerek duymuyoruz. Genetik olarak da sonraki nesile aktarılan kafa değiştikçe ilerleyen yıllarda daha düşük IQ seviyelerini görmemiz olası bir durum olacak.Bununla birlikte teknolojik gelişmeler IQ'dan çok EQ konusunda bize sorun yaşatacak. Duygusal Zeka anlamına gelen EQ insanların duygularını tanıma, anlama, karşılaştığı olayları anlamlandırma, sentez yeteneği, kendini ifade etme becerisi, insanlarla iletişim kurma, birlikte iş yapma gibi işin içerisinde duygu bulunduran her şeyi kapsıyor.Teknolojik gelişmeler ise insanları duygusal boşluğa, yalnızlığa, depresyona itiyor ve bireyselleşen dünyanın gelişmesine ve kişinin yabanileşmesine sebep oluyor",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Phoenix Anka",
      "created_time": "September 14, 2022, 05:20:18 PM",
      "body": "Quote from: totti67 on September 14, 2022, 06:24:41 AMrekabet gerçekten önemli bir motivasyon ama işte burada da karşımıza psikolojik dayanıklılık çıkıyor ve bunun da yolu yine eninde sonunda muhakeme yeteneği, olayları analiz edebilme becerisinden geçiyor ki bu da direkt IQ seviyesiyle bağlantılı aslında. Iq seviyesine bağlı muhakeme yeteneği zamanla yok olacak. Olayların analiz edilmesi de eskisi gibi olamayacak. Zekaların düştüğü bir döneme giriyoruz. Dikkat ederseniz imkanların dar olduğu geçmiş zamanlarda insanlar daha büyük buluşlar yapmışlar ancak bugün bilgiye ulaşım serbestken zekanın geriliğinden bahsediyoruz. Teknoloji ile akıllılık ters orantılı galiba.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "totti67",
      "created_time": "September 14, 2022, 07:36:30 PM",
      "body": "Quote from: Phoenix Anka on September 14, 2022, 05:20:18 PMQuote from: totti67 on September 14, 2022, 06:24:41 AMrekabet gerçekten önemli bir motivasyon ama işte burada da karşımıza psikolojik dayanıklılık çıkıyor ve bunun da yolu yine eninde sonunda muhakeme yeteneği, olayları analiz edebilme becerisinden geçiyor ki bu da direkt IQ seviyesiyle bağlantılı aslında. Iq seviyesine bağlı muhakeme yeteneği zamanla yok olacak. Olayların analiz edilmesi de eskisi gibi olamayacak. Zekaların düştüğü bir döneme giriyoruz. Dikkat ederseniz imkanların dar olduğu geçmiş zamanlarda insanlar daha büyük buluşlar yapmışlar ancak bugün bilgiye ulaşım serbestken zekanın geriliğinden bahsediyoruz. Teknoloji ile akıllılık ters orantılı galiba.  teknolojiyi üreten ile faydalanan oranı gittikçe olumsuz yönde değişmekte. Ayrıca bilgiye kolay ulaşimin bunda negatif etkisi olduğunu düşünüyorum. Bizim cocuklugumuzda her evde bir ansiklopedi seti vardı neredeyse. Şimdi ise bir telefon kadar uzağız bilgiye.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "execijutiere",
      "created_time": "September 14, 2022, 07:41:18 PM",
      "body": "Tembelliğe alıştığımız için iq kaybı yaşıyor olmamız olası. Özellikle basit şeyler için bile teknolojik alet çıkmış durumda. Yani beynimizi kullanmadan basit bir teknolojik aletle bunu halledebiliyorsak sıkıntı buradan başlıyor demektir. Tembellik,üşengeçlik vs gibi durumlar IQ’yu ters etkilediğini düşünüyorum. Bu sayede beyin jimnastiği yapmaktan kaçıp basite indirgenmiş hayat sayesinde hemen hemen herşeyden kaçıyoruz gibi yansır.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}