{
  "id": "topic_5462162",
  "title": "Porfirii",
  "author": "Porfirii",
  "created_time": "August 05, 2023, 10:51:27 AMLast edit: September 10, 2023, 10:21:23 AM by Porfirii",
  "content": "Autor: fillipponeHilo original: #meritislife: how to be notified on a smartband of merits and mentions#meritislifeNo estarías leyendo esto si no pensaras lo mismo.¿Por qué actualizar constantemente tu página de méritos y hacer click en el enlace a \"\"show new replies to your posts\" cuando puedes ser notificado con retroalimentación háptica (N. del T.: término a incluir por la RAE, ya están tardando) y acudir inmediatamente al foro en el hipotético caso de que la vida real interfiriera con el tiempo de inicio de sesión?En esta guía te mostraré cómo configurar una máquina de notificaciones muy rápida, sencilla y barata.Este es el plan:1. Compra una smartband simple y fiable2. Suscríbete a un Bot de Notificaciones3. Configura la smartband para recibir las notificaciones correctas en el móvil/celular.¡Comencemos!1. Compra una smart band simple y fiable. Necesitamos una smartband para mostrar las notificaciones entrantes.Estamos enfocados en el foro, así que queremos que sea fiable, con una batería de larga vida (no queremos perdernos notificaciones porque se esté cargando). Las funcionalidades adicionales son un extra.Mi elección fue Xiaomi MI band 4Aquí están las especificaciones: https://www.mi.com/global/mi-smart-band-4/specsQuotePeso 22.1gGrado de Impermeabilidad 5 ATMTipo de Pantalla AMOLEDTamaño de Pantalla 0.95\"Resolución 120 x 240 RGBProfundidad del Color 24bitBrillo de Pantalla Hasta 400 nits (brillo máximo), el brillo es ajustableTipo de Pantalla Táctil Pantalla táctil \"capacitiva\" On-cellProtección de Pantalla Cristal templado 2.5D con capa anti huellas dactilaresBotón Botón de un solo toque (para encender y retroceder)Tipo de Correa Correa de muñeca intercambiable(Las correas de Mi Smart Band 4 son compatibles con las de Mi Band 3)Anchura de la Correa 18mmMaterial de la Correa Poliuretano TermoplásticoLongitud de la Correa ajustable 155-216mmRAM 512KBROM 16MBSensores Acelerómetro 3-axis + giroscopio 3-axis;Sensor de ritmo cardiaco PPG;Sensor de proximidad \"capacitivo\"Conectividad Inalámbrica BT5.0 BLEBatería LiPo, 135mAhTipo de Carga2Pin Pogo PinTiempo de Carga ≤ 2 horasTiempo en Reposo Hasta 20 díasTipo de Motor RotorMaterial de la Carcasa PolicarbonatoApp Mi FitRequisitos del Sistema Android 4.4, iOS 9.0 o superiorFuncionalidadesFuncionalidades Deportivas: 6 modos de entrenamiento: cinta de correr, ejercicio, correr al aire libre, ciclismo, andar, natación; número de pasos, distancia, y calorías quemadasMonitorización de Salud Notificaciones de entrenamiento completado, fijación de objetivos, estudio del sueño, estudio del ritmo cardiaco, comprobación todo el día del ritmo cardiaco, ritmo cardiaco en reposo, gráficos de ritmo cardiaco, alertas por inactividadOtras funcionalidades Alarma, sensor de proximidad, corona de reloj preestablecida, corona de reloj personalizable, pantalla de bloqueo, temporizador, cronómetro, alarma de teléfono y notificaciones, llamadas entrantes, notificaciones de mensajes, notificaciones de calendario, notificaciones de apps, previsión meteorológica, Encuentra mi teléfono, desbloqueo de teléfono, notificaciones de eventos, Modo nocturno, Modo no molestar (funciona incluso sin el teléfono), controles de música en el reloj, Bluetooth broadcasting, nivel de batería en pantalla, distintas maneras de vestir, actualizaciones OTACreo que se trata de una pieza de hardware bastante barata a unos 30 USD.Puedes encontrarla fácilmente en Amazon.(N. del T.: dejo un link a un listado más reciente de las smartbands del fabricante: Xiaomi Mi Band)Una vez que la tenemos en nuestras manos tenemos que instalar la App, emparejarla con nuestro teléfono y activar las alertas de app.La App requiere un enlace a un perfil de red social (Facebook o Google) o una activación por email.Si te preocupa tu privacidad te recomiendo que crees una cuenta de email de un solo uso en @protonmail usándola solo para esta tarea específica.Para activar las notificaciones en la App procede como se indica a continuación:...––––––––––––––––––––––––––––-–Como puedes ver en la imagen de arriba, estoy a un 18% de batería habiéndola cargado por última vez hace 20 días. Bastante bien considerando que tengo el monitor de pulso cardiaco y el estudio de sueño activados y otras notificaciones aparte de esta.Esto te permitirá mostrar notificaciones del teléfono en la smartband.Ahora ya podemos suscribirnos al Bot de Notificaciones.2. Suscríbete a un Bot de Notificaciones. Estaba tan acostumbrado a @Piggy Bot, que cuando de repente falló, me di cuenta de lo que me había facilitado el uso del foro.Un buen Bot de notificaciones es como la libertad o la buena salud: uno de esos activos menospreciados de los que no te das cuenta hasta que un buen día los pierdes de repente.En cuanto al Bot que usar, hay al menos dos opciones principales de donde elegir:[TelegramBot] Merit watcher and Mention Notification Bot  Instrucciones específicas del Bot de Giammangiato[TELEGRAM] Yet Another BitcoinTalk Notification BOT (merits, mentions, topics,+)  instrucciones específicas del Bot de TryNinja3. Configura la smartband para recibir las notificaciones correctas en el móvil/celular.No sé nada sobre ti, pero estoy en varios canales de Telegram con miles de miembros.Por ello, recibir una notificación de cada canal sería un desastre, con una pesadilla de notificaciones constantes y un agotamiento constante de la batería.Así que decidí configurar Telegram para que muestra notificaciones solo de este canal en particular.Vete aSettings=>Notifications =>TelegramToggle Allow Notifications: ON Dicha personalización es opcional y considérala viable solo para tu UI móvilSelecciona tu estilo de notificaciones para el dispositivo principalLuego haz Click en la última línea Code: Telegram Notification Settingspara que te lleve al Menú de Notificaciones de Telegram Notification. Aquí, la parte relevante es la primera, pues el Bot se clasifica como un chat.Tienes que desactivar todas las notificaciones excepto las del Bot.Aquí todas..––––––––––––––––––––––––––––-–Todas las demás secciones (Group/Channel) tienen que ser desactivadas: ..––––––––––––––––––––––––––––-–En caso de que quieras evitar ser notificado durante las horas de sueño puedes activar la función No Molestar en iOS.Puedes leer más sobre esta función aquí.Con esta configuración las notificaciones se desactivan entre las 23:00 y las 7:00 cuando puedes dormir  y concentrarte más en el foro sin ser molestado por las notificaciones.El resultado es el siguiente:Galería de PeludosFillipponeQuote from: fillippone on January 27, 2020, 09:51:10 AMVB1001Quote from: VB1001 on February 06, 2020, 06:18:11 PMTheBeardedBabyQuote from: TheBeardedBaby on May 18, 2020, 01:38:48 PMRosilitoQuote from: Rosilito on May 25, 2020, 01:13:24 PMVodQuote from: Vod on June 19, 2020, 10:12:16 AMTheBeardedBaby (MI5)Quote from: TheBeardedBaby on October 09, 2020, 02:55:37 PM Fillippone (MI5)Quote from: fillippone on October 18, 2020, 09:11:24 PM Maus0728 Quote from: Maus0728 on April 01, 2021, 06:51:08 AMChuckBuk Quote from: ChuckBuck on April 02, 2021, 05:19:50 PM NeuroticFish Quote from: NeuroticFish on May 07, 2021, 09:12:33 AMTryNinja Quote from: TryNinja on September 06, 2021, 06:36:25 PMMendace Quote from: mendace on November 21, 2022, 03:45:59 PM cygan Quote from: cygan on March 15, 2023, 03:43:10 PMPorfirii Quote from: Porfirii on July 22, 2023, 10:45:20 AMN. del. T.: ¡Orgulloso de haber sido añadido aquí!Instrucciones específicas del Bot para los Bots principales:1.  Instrucciones Específicas del Bot de GiammangiatoHilo Principal del Bot:[TelegramBot] Merit watcher and Mention Notification BotCómo unirse al Bot: Abre el Chat de Telegram t.me/Btctalk_meritbotEscribe \"/start\"Code:/startSuscríbete al Bot de méritos con tu UIDCode: /uid $$tuIDdeBitcointalk$$Subscribe to the mention Bot with your NICKNAMECode: /nick $$tuNICKNAMEdeBitcointalkEl Bot se ejecuta cada minuto. Cada vez que eres mencionado en un post, se menciona un post tuyo, o recibes un mérito, aparece una notificación de Telegram en el chat de Telegram con el Bot.Ahora la última tarea es configurar Telegram para que muestre solo las notificaciones relevantes (solo las que provienen del bot del foro, por supuesto).2.  Instrucciones Específicas del Bot de TryNinjaHilo Principal del Bot:[TELEGRAM] Yet Another BitcoinTalk Notification BOT (merits, mentions, topics,+)Unirse al Bot es muy sencillo, ya que hay un proceso de configuración muy cómodo que te guía todo el tiempo.Te guiaré paso por paso.Abre el Chat de Telegram t.me/BTTSuperNotifier_botEscribe \"/start\"Code:/startSelecciona el idioma que prefieras usarEscribe tu nicknameEscribe tu nickname y confírmalo. Escribe tu ID de BitcoinTalkEscribe tu UID y confírmalo. Ahora concreta qué notificaciones quieres activar, hay dos opciones separadas para menciones y méritos:Aprueba la petición para notificaciones de menciones:Aprueba la petición para notificaciones de méritos:¡Listo! Puedes volver al menú con el comando[/list]Code:/menuComo te habrás dado cuenta, cabe la posibilidad de personalizar el idioma de interfaz. Hay unos pocos idiomas disponibles, y más en camino. Contacta con TryNinja para una traducción en tu propio idioma.N. del T.: Hay algunos enlaces a IMGUR, que se editarán en cuanto sea posible Otro hilo en español sobre este tema aquí de la mano de solosequenosenada.Traducción ofrecida a iniciativa de:",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5462162",
  "comments": [
    {
      "author": "Csmiami",
      "created_time": "August 05, 2023, 03:21:59 PM",
      "body": "Igual es modificar un poco mucho el OP, pero el bot de Giammangiato está inoperativo; por lo que igual se podria meter un tijeretazo a esa zona...PS: se echa bastante en falta la presencia por estas tierras del otro spanish local de la lista de brazos",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Porfirii",
      "created_time": "August 08, 2023, 04:46:41 AM",
      "body": "Quote from: Csmiami on August 05, 2023, 03:21:59 PMIgual es modificar un poco mucho el OP, pero el bot de Giammangiato está inoperativo; por lo que igual se podria meter un tijeretazo a esa zona...PS: se echa bastante en falta la presencia por estas tierras del otro spanish local de la lista de brazosVaya, pues habrá que comentarlo con fillippone, ya que lo suyo sería que editara el hilo original y a partir de ahí que actualizáramos las traducciones en las secciones locales. Si no lee esto (me imagino que le mencionarán muchas veces y no traducirá todos los posts de local en los que lo hacen) le aviso por otras vías. Gracias Csmiami!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fillippone",
      "created_time": "August 09, 2023, 01:32:45 PM",
      "body": "Well done @Porfirii!This is a fun thread. I am just sorry that so many images got erased. Maybe you can do some magic and recover them. In case, let me know!Traducción de cortesía a través de GT¡Bien hecho @Porfirii!Este es un hilo divertido. Lamento que se hayan borrado tantas imágenes.Tal vez puedas hacer algo de magia y recuperarlos. Por si acaso avisame!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "famososMuertos",
      "created_time": "August 09, 2023, 02:24:53 PM",
      "body": "Quote from: Csmiami on August 05, 2023, 03:21:59 PMI-...//::-__PS: se echa bastante en falta la presencia por estas tierras del otro spanish local de la lista de brazosPues, si te soy sincero de ahí recordé al mencionado 1001, en su momento fue algo de moda, en mi particular opinión para alguien en proceso de llegada le vendría bien esta combinación de gadget-notificación. Esa en particular, tal cual Creo que, para los \"nuevos\" usuarios, una notificación de Telegram con el bot de Ninja funciona bien, y puede ser en cualquier dispositivo inteligente, no tiene que ser precisamente un smartband, ignoraba, eso si, que existiera una guía para tal cosa tan común en estos días.En cuanto al \"corte\", edición, OP quiere evitar demandas por ediciones no autorizadas de contenido TM.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DdmrDdmr",
      "created_time": "August 20, 2023, 04:08:54 PM",
      "body": "Estando en posesión de un chisme de estos, he logrado (tiene algo de mérito) históricamente no sucumbir a su uso para recibir notificaciones del foro como las descritas en el OP. El motivo es meramente para evitar tener operativo un nuevo ente que pueda potencialmente interrumpirme, por si no tuviésemos pocos ya de por sí en nuestro entorno. Por otro lado, mostrar el grado de pelumbrera de la muñeca puede dar algo de rubor …Dicho eso, es un gran caso de uso para el entretenimiento asociado al foro.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "famososMuertos",
      "created_time": "August 21, 2023, 09:03:49 PM",
      "body": "Quote from: DdmrDdmr on August 20, 2023, 04:08:54 PMEstando en posesión de un chisme de estos, he logrado (tiene algo de mérito) históricamente no sucumbir a su uso para recibir notificaciones del foro como las descritas en el OP. El motivo es meramente para evitar tener operativo un nuevo ente que pueda potencialmente interrumpirme, por si no tuviésemos pocos ya de por sí en nuestro entorno. Por otro lado, mostrar el grado de pelumbrera de la muñeca puede dar algo de rubor …Dicho eso, es un gran caso de uso para el entretenimiento asociado al foro.Bueno! si me asemeja al estar \"atado\" o preso al más estilo de este brazalete:Quizás algún día, por qué no? alguna campaña que pague $100 por post de 1000 palabras exija tenerlo, y para aquellos que les parezca un poco exagerado:Dado que al 10001 y al italiano, la única manera de identificarlos es contrastar foto, esa mano y pie no me pertenecen.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Porfirii",
      "created_time": "September 10, 2023, 10:27:02 AM",
      "body": "Quote from: fillippone on August 09, 2023, 01:32:45 PMWell done @Porfirii!This is a fun thread. I am just sorry that so many images got erased. Maybe you can do some magic and recover them. In case, let me know!Traducción de cortesía a través de GT¡Bien hecho @Porfirii!Este es un hilo divertido. Lamento que se hayan borrado tantas imágenes.Tal vez puedas hacer algo de magia y recuperarlos. Por si acaso avisame!Imágenes recuperadas, fillippone Por cierto, como comentaba Csmiami más arriba, parece que el bot de giammangiato no funciona. ¿Convendría editar la parte obsoleta?Immagini recuperate, fillippone A proposito, come ha commentato Csmiami sopra, sembra che il bot di Giammangiato non funzioni. Sarebbe opportuno modificare la parte obsoleta?Quote from: famososMuertos on August 21, 2023, 09:03:49 PMQuote from: DdmrDdmr on August 20, 2023, 04:08:54 PM<...><...>Ah, yo sí lo llevo usando hace bastante tiempo: he preferido quitarme de otras M****** como Instagram o Twitter (¿se permite seguir llamándose así?) y en cambio recibir notificaciones más productivas.fM, los usos para dispositivos que comentas, a este paso cualquier día ; lo bueno que el día que quieras desconectar, nadie debería impedirte quitártelo salvo la propia codicia.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fillippone",
      "created_time": "September 10, 2023, 12:37:16 PM",
      "body": "Quote from: Porfirii on September 10, 2023, 10:27:02 AMImmagini recuperate, fillippone A proposito, come ha commentato Csmiami sopra, sembra che il bot di Giammangiato non funzioni. Sarebbe opportuno modificare la parte obsoleta?Looks like I asked you to recover the image, and then I did it myself in my OP.Regarding @giammangiato bot maybe he will answer here, but I guess you are right.The Tryninja bot is actually a standard on the forum, and it would make sense to use it mainly.Quote from: DdmrDdmr on August 20, 2023, 04:08:54 PMDicho eso, es un gran caso de uso para el entretenimiento asociado al foro.This is the only way to use it. Any other use case is a dangerous hesitation on the road to perdition(the road I took a while ago, as @ddmrddmr knows from his weekly dashboard updates).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}