{
  "id": "topic_5477673",
  "title": "NotATether",
  "author": "NotATether",
  "created_time": "December 13, 2023, 05:39:17 AMLast edit: December 13, 2023, 03:55:09 PM by NotATether",
  "content": "Since yesterday, people have reported to me seeing 403 errors on my new website, BitMixList, a bitcoin mixer list, DEX list, and CoinJoin list and an explanation and chronological history of the above. You reading this may have noticed as well, if you have read my ANN thread.I was in the process of finalizing some link placements with some sellers when yesterday afternoon, I discovered that my web host, Hostinger, had suspended access to BitMixList.com. At first I thought, maybe it was because of the way I was updating the onion site. The Tor onion site had always been hosted on my own hardware as a read-only mirror of the clearnet site, and I updated it with an cronjob that periodically mirrored the site. The reason why I did that was because some people had trouble accessing the COM domain from Tor Browser.So here I was thinking the suspension was DoS (denial of service) related, and any reasonable person probably would've thought that as well. That's why the response I got when talking to a support agent was truly shocking.QuoteChatGPT Bot: Hi 👋! I'm here to answer your questions, and our team is available if you need extra help. How can I assist you?Me: Hi, I accidently left a cronjob running that mirrors the contents of my website bitmixlist.com, and it got suspended. I turned it off once I learned about it right now. What should I do to get the site restored?ChatGPT Bot: I'm sorry to hear that your website got suspended. To get your website restored, you will need to take the following steps:<long paragraph about spam and bots omitted>If you have any further questions or need assistance with the restoration process, please let me know.Me: This is not helpful. Can you get me in touch with a human?ChatGPT Bot: Please briefly describe the issue you're experiencing before I connect you with one of our specialists.Me: My bitmixlist.com website got suspended because on one of my computers, I left a cronjob running that ran \"wget\" every 5 minutes to mirror the contents of my website (for archival). I need to grt the site restored now that I stopped itChatGPT Bot: I’m redirecting you to the Customer Success Team. One of our specialists will join you shortly. They will see our conversation history, so there’s no need to explain the situation again, unless you want to add more details.Me: Thank you.<a few minutes later>Support Agent: Hello there! Thank you for contacting us. I am Yassin, ready to help you 👋Agent: Please give me a few moments to check everything for you.Me: thanks, your help is much appreciated Yassin!Me: Some additional context which I think may help you - I was querying the website from my IP address <redacted>, and I started it at around 6 or 7 AM UTC time. The website in question was not being used to run any background software, and as far as I can tell, this is all that occurred.Support Agent: I have checked the reason of your hosting plan suspension is due to abuse: Illegal Activity.Here is the main point of the suspension:the website https://bitmixlist.com currently allocated under your hosting is promoting money-laundering services and prohibited entities within jurisdictions of European Union, United States of America and others that adhere to complying with OFAC/SDN, FATF and other international anti-money laundering regulation protocols.Our company is rooting for safe internet and the best user experience, so any abusive actions might lead to suspension. You can find it in our Terms of Service.​We cannot unsuspend the plan, only the dedicated can unsuspend after verification.In this case, please forward the relevant documentation to this form.Fill in this form [FORM FOR DOCUMENTS]The documentation must includeBusiness RegistrationID registrationAddress ProofAfter providing the required information, we will forward the issue to the dedicated team so they can analyze the documentation.And we will inform via e-mail after the analysis for further clarifications.If you have any other doubts, I'll be glad to help 🙏Me: But I'm not a business, just an individual.Support Agent: I do understand your concern. Our team needs the business registration to unsuspend the website and running at Hostinger in this case.Me: So what ahould I be doing instead?Support Agent: At the moment, should you wish to make the website active again you would need to provide the business registration document. If you do not have any, you can register your business to the government and provide the document to the provided form.Support Agent: I hope it clarifies. Please try this recommendation when you have the opportunity and in case you need more assistance, please let me know on this thread.Support Agent: We are here 24/7 and will be happy to help! In the meantime, stay safe and take care.I'm sorry to bore you guys with a log monologue, but these guys just accused me of promoting money laundering services and abuse! And it had nothing to do with DoS!In other words, the website was suspended because they think that bitcoin mixers, Bisq, Localmonero, Robosats, Wasabi, Samourai, JoinMarket are all money laundering services and prohibited entities, that have no real civilian use. The promotion part is also baloney because there were no ads.And despite being able to clearly see the domain registration information, they insist on me on performing business KYC so that I can host a blog about mixers?It is ironic this web host has a problem with hosting blogs about mixers, and yet they are perfectly fine with  hosting Tor exit nodes which are perhaps used for real illegal activity.To add insult to the injury, the website only contained 3 tables with lists of mixers, DEXs, and CoinJoin wallets respectively, and the vast majority of the over-8000 word page was about past history. Not to mention that it also had a disclaimer:QuoteIt should be said right now that mixers are an attractive service for criminals who want to launder dirty money. However, I will prefix this by saying some mixers because chain analysis firms like Elliptic have already identified most of the entry and exit points of a lot of mixers. The vast majority of bitcoin mixers do not allow cybercrime and never supported it in the first place. Unfortunately, a small number do, but you won’t find any of them on this bitcoin mixer list. I will never list any illegal mixers here, and the ones that do exist to help Lazarus and Co. can go where they belong: prison.Even though I myself have advertised mixers, I have never advertised a sanctioned mixer, and they will never be promoted here. Hence, I kindly ask you, the reader, that if you find any illegal service on this bitcoin mixer list, for you to report it to me by the email or Telegram channel linked below. Your vigilance is much appreciated.In particular, I will not be responsible for what you use the content on this site for. The action of using a bitcoin mixer is supposed to be to help protect your funds, not to help you commit crimes. And yes, I spoke with my hosting provider, who said that publishing cryptocurrency topics (including mixers) is OK.And this:QuoteBitcoin mixers, and for that matter, CoinJoin wallets and DEXs, are all abused by criminals, and that is not going to change anytime soon, if ever. But the last thing we need is complete, Orwellian surveillance over our digital transactions. That is why people make bitcoin mixers. Even the wallets that implement blacklisting do so begrudgingly, because the natural evolution of that is to decide who gets to use your service and who can’t. (Like PayPal.)To me, this is unacceptable, because if they had an issue about any of this, they could've emailed me a notice instead, and I would've happily moved elsewhere. (Read below to see the \"permission\".)Also, I have a reason to suspect, that the suspension was done automatically by a robot, and that no staff had actually read the website. I specifically SEO-optimized the website for the keywords \"bitcoin mixer\" and \"bitcoin mixer list\" <because you know, do you want people to click on phishing links while search engines do nothing about it?>And also, if it was not automatic, then why were multiple public drafts of the site allowed to exist without notice, but less than 24 hours after I make the ANN thread and a few dozen people visit the website, then it's gets suspended?Honestly, the above made me shocked, but not upset. What really made me angry was that I had received explicit permission from their compliance team to host a website about mixers, and suddenly they do a 180° as soon as I got traffic. If you don't believe me, here is the email and response I sent and got:Quote from: my emailHi.I'm a Hostinger customer, but using a different email address.Section 5, General Rules Of Conduct, of the Universal Terms of Service Agreement (https://www.hostinger.com/legal/universal-terms-of-service-agreement) says:3. You will not use this Site or the Services in a manner (as determined by Hostinger in its sole and absolute discretion) that:* Is illegal, or promotes or encourages illegal activity;I would like to ask about a possible scenario.Let's consider the topic of cryptocurrency mixing. In recent days, some websites related to cryptocurrency mixing have been seized. Example: https://www.fiod.nl/fiod-takes-large-crypto-currency-mixer-off-the-air/This page of FIOD says:Cryptocurrency mixingA cryptocurrency mixing service is not necessarily illegal. It is an online service that allows users to disguise the origin and destination of cryptocurrencies. [...] Mixing criminal assets and concealing the origin of criminal funds is a criminal offense.From this, it can be concluded that some cryptocurrency mixing,websites engage in illegal activity, particularly the ones found on the \"darknet\". Also, it can be seen that some other cryptocurrency mixing websites are not subject to such illegal activity.From my understanding of the Universal Terms of Service Agreement, hosting any website that engages in illegal activity is prohibited. However, if somebody were to compile a list of legally operating cryptocurrency mixers, and posted it on a website, this would be allowed by the agreement, correct?Thanks in advance.The reply I got (emphasis mine):QuoteHi there!I hope you are doing well.I am providing clarification regarding your e-mail about cryptocurrency.There's this one statement:However, if somebody were to compile a list of legally operating cryptocurrency mixers, and posted it on a website, this would be allowed by the agreement, correct?The answer is yes; your understanding is correct. It is considered acceptable as long as the website in question does not host any form of cryptocurrency transactions or registrations or engage in any activities related to cryptocurrency.If you have further questions or need additional information, please let me know. I am here to help you out.Best Regards,AudrisHostingerSo as you can see, I clearly received permission to host this kind of content, and most importantly, NOWHERE in their terms of service says that it is ... \"illegal\" or \"abuse\" to host content about mixers. So either Hostinger is incompetent, or it has a malicious agenda against privacy, and by extension, Bitcoin privacy.It's important to note that Hostinger accepts crypto payments, so clearly they are pro-bitcoin, but at the same time, they are also anti-privacy. So to receive this kind of email, only to have your hosting suspended a week later for BS reasons, can only mean that there is a wider censorship campaign going on against bitcoin privacy. Now I understand why Wasabi started adding blacklisting tech, because in a few years, most of the internet will label you a criminal, a sanctions evader, an OFAC-flouter for supporting bitcoin privacy.But this kind of enforcement is not done fairly, to everybody, because Google can promote (literally) mixers, even scam mixers, and Section 230 in the USA protects them. But if I blog about mixers, that must be a crime, amirite? The terms are not even enforced consistently on their own service. For example on my other site, I have a blog post about \"Top 5 bitcoin mixers\" made last year, but nothing was ever done to it.To give them some credit, at least they let me download my website data. And the rest of my sites are accessible. Unfortunately, I made the mistake of buying the domain on Hostinger's DNS, and since it's so new, I have to wait until the mandatory 60-day registration period passes before I can transfer it to Porkbun (PS. Porkbun rocks. They never gave me any problems.) So meanwhile, the site has been moved to BitMixList.org, and maybe I'll just let the old domain redirect to this one.The TOR onion link was not affected by this circus and continues to be hosted my own hardware. For now, the clearnet site is there too. Although long-term, I want to find a new web host for that since my hardware does not have particularly good uptime.It is a sad world when you are able to host a scam without any repercussions, but you are punished if you share information about privacy.Someone here warned me that hosting there would be a bad idea. In hindsight, I should've listened to them. (But the suggested Russian hosting as an alternative would not be much better than this).So, what does this have to do with Bitcointalk?Well remember the mixer ban? You can't promote a mixer, you apparently can't tell people to go to a specific mixer, and you are allowed to talk about mixers in general. But if you can't have a neutral list of privacy services without some offended person viewing it as promotion, then it is a failure of \"being free as possible\".Already if you go on X/Twitter, there are thousands of morons taking issue with Wikipedia. They also take an issue with commonly accepted facts resources. And the result is that we have all these people on a mission to delete knowledge, and keep only the information they like.There were people here joking about requiring KYC to use the forum, which was ironically the subject of an April Fools joke, but now this is serious, we are actually seeing more and more hosting providers requiring KYC to post stuff that they have an issue with, or just booting you off the network (*cough* AWS).If we do not take our bitcoin privacy seriously and protect it, we will lose it forever, and we will never get it back.@theymos: Please consider revising the guidelines to allow \"impartial, neutral lists of mixers\", because while promoting mixers is obviously a problem, we cannot allow independent coverage of mixers to be censored. News sites like WIRED can do it, even having an interview with Sinbad many months ago, but they do not censor such information and call it \"promotion\" like these political web hosts.And I'll say what o_e_l_e_o wrote about the subject again, in my own words: If regulators ban mixers, then they will go after pseudonymous bitcoin addresses and CoinJoin, and soon the only way you'd be able to use Bitcoin is by keeping it on an exchange, surrendering your identity.Is this how you want people to use the Peer-to-Peer digital currency?If you are a web host who is interested in hosting BitMixList.org, please send me a PM.Edit: there have been credible reports that some bitcointalk.org user(s) may have been behind the ruckus. If you are one of those people: I hope one day you appreciate how lucky you are to have the privacy that bitcoin gives you.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5477673",
  "comments": [
    {
      "author": "pinggoki",
      "created_time": "December 13, 2023, 06:08:57 AM",
      "body": "There's no other way around this and this will be the future if the community doesn't do any actions about this right now, no more talking will be needed because the authorities are just shrugging off our plights and concerns about our privacy, either a protest or something that creates a big ripple has to happen, no way to fight against this injustice anymore besides taking an action and saying what they need to hear in their faces. It's a crazy time for mixers and crypto and this events will definitely be a make or break for many of us.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LoyceV",
      "created_time": "December 13, 2023, 08:32:39 AM",
      "body": "Quote from: NotATether on December 13, 2023, 05:39:17 AMQuoteSupport Agent: I have checked the reason of your hosting plan suspension is due to abuse: Illegal Activity.Here is the main point of the suspension:the website https://bitmixlist.com currently allocated under your hosting is promoting money-laundering services and prohibited entities within jurisdictions of European Union, United States of America and others that adhere to complying with OFAC/SDN, FATF and other international anti-money laundering regulation protocols.From their perspective, I think this makes sense. It's simply not worth the risk for them.QuoteQuoteSupport Agent: At the moment, should you wish to make the website active again you would need to provide the business registration document. If you do not have any, you can register your business to the government and provide the document to the provided form.This is weird. Why would the same thing they deemed illegal be okay after you register a business with some government somewhere?QuoteAlso, I have a reason to suspect, that the suspension was done automatically by a robot, and that no staff had actually read the website.This is the part I was curious about: it didn't take long to be taken down.Quoteand yet they are perfectly fine with  hosting Tor exit nodes which are perhaps used for real illegal activity.It's about liability. They get away with running Tor nodes, and they must host enough of them to make it worth it.QuoteI had received explicit permission from their compliance teamHave you contacted Audris again?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BenCodie",
      "created_time": "December 13, 2023, 09:24:53 AM",
      "body": "These websites can be used for money laundering, it's that simple. However the next step in this logic pattern is completely disregarded by all entities and that is that everything can be used for money laundering...businesses, individuals, websites, everything...As long as a transaction can be made, ML can occur.Anyway, they don't see it that way. They see it as...You visit a mixing website, you are only doing so to hide the source of your money This is ultimately true but the legitimate desire for privacy is disregarded. In fact, we are on the road right now that the desire for privacy will be illegitimate in itself...in fact, this ban that you have mentioned and the ban of mixers in general, kind of signifies the end of that transition.... (being on that road is why I've been pushing for the board, I know where we're headed and it's not pretty )As for Hostinger, they seem to change their excuse. Their previous responses indicated it was due to money laundering, later it was just anything to do with cryptocurrency. If the latter was the truth and the former was not the reason (unlikely though) this is like Hetzner. A host that sells cheap servers commonly used for bitcoin/altcoin nodes due to how cheap their servers are, though bans anyone they catch running a node (or do it on a routine basis, anyway). I am fearful of what will come of privacy in the new age of crypto. It is clear governments, institutions and businesses are putting up the battle flag. They're coming after our rights, and I see it getting a lot worse before it gets better, if even at this Bitcoin forum we can only rally together a handful of people to stand up for both cybersecurity and privacy over a near-12 month period.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dkbit98",
      "created_time": "December 13, 2023, 10:10:12 AM",
      "body": "Quote from: NotATether on December 13, 2023, 05:39:17 AMI discovered that my web host, Hostinger, had suspended accessHostinger is probably one of the worst web hosting providers I know, so better look for some alternative option that is more bitcoin friendly (there are few of them available).Maybe start with kycnot.me with their list of hosting providers.You should also think about renaming, and using more neutral domain name.Quote from: NotATether on December 13, 2023, 05:39:17 AMAnd despite being able to clearly see the domain registration information, they insist on me on performing business KYC so that I can host a blog about mixers?Crazy!It's not like you are the owner of any services you listed on your website.Quote from: NotATether on December 13, 2023, 05:39:17 AMIt is ironic this web host has a problem with hosting blogs about mixers, and yet they are perfectly fine with  hosting Tor exit nodes which are perhaps used for real illegal activity.Tor is in the grey zone, it was made by government and they also use it, so they can't simply ban it that easy, and they don't want to do that.Quote from: NotATether on December 13, 2023, 05:39:17 AMThere were people here joking about requiring KYC to use the forum, which was ironically the subject of an April Fools joke, but now this is serious, we are actually seeing more and more hosting providers requiring KYC to post stuff that they have an issue with, or just booting you off the network (*cough* AWS).It's no joke.Some people are working real hard on implementing kyc to entire Internet, so you won't be able to use it if you are not ''verified''  They have deadline for this and it's 2030... so don't be surprised if you see this soon, for ''our own protection'' against ''evil enemy hackers''  Quote from: NotATether on December 13, 2023, 05:39:17 AMHonestly, the above made me shocked, but not upset. What really made me angry was that I had received explicit permission from their compliance team to host a website about mixers, and suddenly they do a 180° as soon as I got traffic. Maybe someone reported you and your website",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yamane_Keto",
      "created_time": "December 13, 2023, 10:12:34 AM",
      "body": "This is strange. I suggest you to wait for several days and ask the support team again. Sometimes they give you inaccurate answers or complicated answers so that you are forced to abandon your idea.Some mixers work and do not have problems with many hosting service, and there are no laws that criminalize or prohibit these activities, so the best advice is to stay away from using Hostinger.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "digaran",
      "created_time": "December 13, 2023, 10:20:36 AM",
      "body": "You realize they are here right now reading everything we say, right? I wonder why every time I post on a mixing related topic it gets in trouble, lol similar thing happened to tumbler, someone said the clearnet site is down after I posted there. Lol. Seriously though, they are actively trying to identify bad actors, so it might get uglier than this, but we are not criminals, we'd like nothing more to cut down true criminals ourselves, we just don't know how to separate ourselves from actual criminals. Maybe it'd be better to stop mentioning such services and stop constantly defending them. 😉",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "December 13, 2023, 10:48:38 AM",
      "body": "Quote from: LoyceV on December 13, 2023, 08:32:39 AMQuoteI had received explicit permission from their compliance teamHave you contacted Audris again?No I haven't. And I don't even think I'll get a hold of the same person if I try. Yesterday I sent a email to the abuse address similar to the support ticket, and all they replied was:Thank you for contacting us.The requested resource(s) has been suspended.Regards,Hostinger Abuse teamIf this is the kind of result I'm getting from the abuse department, then what is the point of trying to contact the compliance department again.Quote from: dkbit98 on December 13, 2023, 10:10:12 AMMaybe someone reported you and your website  I don't think so. Because I had only posted it here, which was viewed by about 90 people at the time, so it would've meant that a bitcointalk user reported it, which doesn't make sense.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dkbit98",
      "created_time": "December 13, 2023, 11:03:38 AM",
      "body": "Quote from: NotATether on December 13, 2023, 10:48:38 AMso it would've meant that a bitcointalk user reported it, which doesn't make sense.It makes sense to me.Not all bitcointalk members have good intentions, and some of them have nothing better to do in life than to report stuff they don't like or support.I am sure hosting providers now have AI bots, so that could also be one of the reasons.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LoyceV",
      "created_time": "December 13, 2023, 11:06:36 AM",
      "body": "Quote from: NotATether on December 13, 2023, 10:48:38 AMit would've meant that a bitcointalk user reported it, which doesn't make sense.Phishing sites went as far as sending Google a DMCA takedown for the real site, claiming the real site copied their site. I wouldn't rule anything out.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitcoinGirl.Club",
      "created_time": "December 13, 2023, 01:00:22 PM",
      "body": "Quote from: dkbit98 on December 13, 2023, 11:03:38 AMQuote from: NotATether on December 13, 2023, 10:48:38 AMso it would've meant that a bitcointalk user reported it, which doesn't make sense.It makes sense to me.Not all bitcointalk members have good intentions, and some of them have nothing better to do in life than to report stuff they don't like or support.I am sure hosting providers now have AI bots, so that could also be one of the reasons.I don't think anyone would want to report an unknown site, I mean the site has just launched a few days ago, hasn't it. On the other hand, many times in the scam accusations we saw people reported a scam site but still it was there. So reporting a site and it worked quickly to ban the site, is not the case.They obviously have algorithm to detect such sites and to ban it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "suchmoon",
      "created_time": "December 13, 2023, 02:09:58 PM",
      "body": "Quote from: dkbit98 on December 13, 2023, 11:03:38 AMQuote from: NotATether on December 13, 2023, 10:48:38 AMso it would've meant that a bitcointalk user reported it, which doesn't make sense.It makes sense to me.Not all bitcointalk members have good intentions, and some of them have nothing better to do in life than to report stuff they don't like or support.I am sure hosting providers now have AI bots, so that could also be one of the reasons.I have no doubt that a bitcointalker reported the site to the hosting provider. There are some really deranged trolls here with huge axes to grind against mixers, including some posting in this thread. Hosting providers, particularly the reseller types that employ chat bots as \"support\", don't really have the resources to police the content proactively, and don't have the resources to properly review complaints either. That's why the excuse keeps changing and they won't back down not so much because of money laundering / \"cryptocurrency\" / etc, but because it's too much hassle for them and they want this client to go away.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "December 13, 2023, 02:54:38 PM",
      "body": "Quote from: suchmoon on December 13, 2023, 02:09:58 PMQuote from: dkbit98 on December 13, 2023, 11:03:38 AMQuote from: NotATether on December 13, 2023, 10:48:38 AMso it would've meant that a bitcointalk user reported it, which doesn't make sense.It makes sense to me.Not all bitcointalk members have good intentions, and some of them have nothing better to do in life than to report stuff they don't like or support.I am sure hosting providers now have AI bots, so that could also be one of the reasons.I have no doubt that a bitcointalker reported the site to the hosting provider. There are some really deranged trolls here with huge axes to grind against mixers, including some posting in this thread. Hosting providers, particularly the reseller types that employ chat bots as \"support\", don't really have the resources to police the content proactively, and don't have the resources to properly review complaints either. That's why the excuse keeps changing and they won't back down not so much because of money laundering / \"cryptocurrency\" / etc, but because it's too much hassle for them and they want this client to go away.Now it's making sense.As a precaution, I enabled Cloudflare on the site and will start searching around on web hosting forums for DMCA-free hosting.by the way - can you or @ibminer update the donators page in bpip to point to BitMixList.org instead of .com?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "digaran",
      "created_time": "December 13, 2023, 04:29:45 PM",
      "body": "So who really reported NotATether's site? Because if certain somebody quoted by OP, is talking about me, news flash I never leave this forum to look for any sources, whatever I have said so far against mixers was only based on Bitcointalk posts, I barely even opened another mixer/software provider using browser.lol after someone confronted me as to whether I had a look or not.@Op, I didn't expect this from you.😏So who ever reported that site, come forward peacefully and exonerate an innocent man. you guys will have to answer to your maker by setting me up.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "December 13, 2023, 04:34:53 PM",
      "body": "Quote from: digaran on December 13, 2023, 04:29:45 PMSo who really reported NotATether's site? Because if certain somebody quoted by OP, is talking about me, news flash I never leave this forum to look for any sources, whatever I have said so far against mixers was only based on Bitcointalk posts, I barely even opened another mixer/software provider using browser.lol after someone confronted me as to whether I had a look or not.For the record, I don't think it was you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DooMAD",
      "created_time": "December 13, 2023, 06:17:40 PM",
      "body": "I commend NotATether for their efforts in seeing this project through, despite adversary.  This is clearly a full-on war now.Quote from: suchmoon on December 13, 2023, 02:09:58 PMQuote from: dkbit98 on December 13, 2023, 11:03:38 AMQuote from: NotATether on December 13, 2023, 10:48:38 AMso it would've meant that a bitcointalk user reported it, which doesn't make sense.It makes sense to me.Not all bitcointalk members have good intentions, and some of them have nothing better to do in life than to report stuff they don't like or support.I have no doubt that a bitcointalker reported the site to the hosting provider. There are some really deranged trolls here with huge axes to grind against mixers.Shameful if true.  It's bad enough that we have numerous enemies outside of the community.  But to recognise we have enemies within looking to undermine freedom and privacy is deeply unsettling.   If a bitcointalk user did this, then it effectively amounts to an act of sabotage.  There is too much at stake for us to allow our efforts to be brought down by such cancerous elements.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "suchmoon",
      "created_time": "December 13, 2023, 09:45:32 PM",
      "body": "Quote from: NotATether on December 13, 2023, 02:54:38 PMby the way - can you or @ibminer update the donators page in bpip to point to BitMixList.org instead of .com?Sure thing, I think ibminer has already taken care of that.Quote from: digaran on December 13, 2023, 04:29:45 PMis talking about me Awww so cute that you recognize yourself from that description.BTW I also don't think you're enough of a keyboard warrior to actually report the website, but that doesn't excuse your trollfuckery... I mean you're admitting you have no clue what you're talking about, why are you even here (rhetorical question, don't bother).Quote from: digaran on December 13, 2023, 04:29:45 PMwhatever I have said so far against mixers was only based on Bitcointalk postsLie with dogs, wake up with fleas.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ibminer",
      "created_time": "December 14, 2023, 01:35:07 AM",
      "body": "There are unfortunately members of this forum who have done far worse than reporting a site, so it's definitely a possibility, especially if you've pissed anyone off recently. Even if not, it could just be someone who doesn't like mixers trying to annoy you. That said, a scanning tool used to manually scan the content of a particular customer for various things they've deemed prohibited isn't far fetched either, although, they'd probably only use it if a customer/site were reported. Quote from: LoyceV on December 13, 2023, 08:32:39 AMWhy would the same thing they deemed illegal be okay after you register a business with some government somewhere?It may be easier to offload legal liability with a registered business to point to as being responsible for the content.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "digaran",
      "created_time": "December 14, 2023, 02:15:09 AM",
      "body": "If you guys wanna talk in general, that's fine but if you want to go after a certain person, it would be better if you name that person, otherwise it could be misinterpreted by others. However to clarify, I was a part of a mixing campaign with a reserved spot on another forum, I realized I was being targeted for wearing the sig, so I tried to make certain people more angry by asking a raise from the manager, they ignored my request and I removed myself from that campaign. Then I wanted to know if certain services is allowed or not. Later I posted on 2 mixer related topics, and after each post someone mentioned those sites were down, so I also mentioned that here as well.I'm here to support Bitcoin, unlike many milkers pretending to care for the same. 😉 Can someone open the window? Too many fleas after waking up here. Lol.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Vod",
      "created_time": "December 14, 2023, 03:03:23 AM",
      "body": "Before any troll suggests it, I was not the one that reported the mixer.   Two years ago I discovered reporting scams here to be useless, as for every one I took down, five more would pop up in the games and rounds section.  It is far more effective to take out the head of the snake.A serious question - what can a mixer be used for other than obfuscate the source of the coins?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}