{
  "id": "topic_5464705",
  "title": "UmerIdrees",
  "author": "UmerIdrees",
  "created_time": "August 27, 2023, 03:27:55 AM",
  "content": "I was just browsing YouTube and found a video NEW | Halal Casino? - Mufti MenkIs there any concept of Halal Casino   By the way Mufti Ismail ibn Musa Menk is an Islamic Scholar from Zimbabwe and also he is leading the fatwa department in that country.Just watch the video and let me know the views about it.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5464705",
  "comments": [
    {
      "author": "Cantsay",
      "created_time": "August 27, 2023, 03:40:34 AM",
      "body": "To be honest, I thought the video was about an Islamic casino or a casino that allows Muslims to gamble because I have seen so many of his videos on other topics and also some short clips from TikTok and his teachings are always good to listen to.And to see his picture on a casino post really got my attention. Although his post didn’t ponder entirely on casino but I still got something from it, like we shouldn’t discourage one from doing something good even if all they have been doing in their life has been evil. And since gambling is haram we shouldn’t discourage those that partake in it to not do other holy things because we are all human and we can change for the better and that little good they did could be the catalyst for it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "--Encrypted--",
      "created_time": "August 27, 2023, 04:34:04 AM",
      "body": "It sounds to me that they're trying to work around their own beliefs which is just weird to say the least.I'm not a muslim and don't consider gambling a sin but I believe that you shouldn't knowingly commit the same sin every day even if you pray and do something good right after commiting that sin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Taskford",
      "created_time": "August 27, 2023, 05:15:20 AM",
      "body": "Quote from: UmerIdrees on August 27, 2023, 03:27:55 AMI was just browsing YouTube and found a video NEW | Halal Casino? - Mufti MenkIs there any concept of Halal Casino   By the way Mufti Ismail ibn Musa Menk is an Islamic Scholar from Zimbabwe and also he is leading the fatwa department in that country.I'm not a muslim but isn't gambling is haram for them? Its a grave sin to them so I don't think there's halal and not halal on that. Maybe the one running that casino just want to convince muslims to gamble to their casino for profit and they use the halal word so that they can convince muslim that they are safe to commit sin for playing on their casino. Also for those who follow the teaching of Islam will not risk to exchange their faith just to gamble and have short time glory with this casino.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ever-young",
      "created_time": "August 27, 2023, 06:17:22 AM",
      "body": "Quote from: --Encrypted-- on August 27, 2023, 04:34:04 AMIt sounds to me that they're trying to work around their own beliefs which is just weird to say the least.Yea if we look at the title alone we could say that they are misleading the public base on there belief but going through the entire video the speaker is actually making some points and it’s not encouraging gambling but rather he is advising those Muslim who already found them self in the means of gambling to not use that as an excuse of not praying because of the surrounding that they finds their self that doing that could be seen as a double sin, anyone who see any Muslim in the means of gambling should not also stop them from praying that they should allow them pray, that everything is done one step at at time, with them doing a little of good thing and praying always that they will have better chances of realizing that they are committing a great sin and are likely to change and come out of the sin over time, But discouraging them and calling them siners won’t help the matter at all, he also gave an instance of those who see people who dress half native that it’s better to advise them to dress decently than telling them to completely remove the cloth since they choose to be naked. I finds his teachings educative rather than weird.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stadus",
      "created_time": "August 27, 2023, 06:34:03 AM",
      "body": "I thought gambling is forbidden according to the Quran. This situation seems to be an attempt to make an exemption. I don't know if it's approved by other Muslim leaders. When you mention gambling, it should be automatically considered forbidden.This pertains to religion; I am not Muslim. We would like to hear from our Muslim brothers here whether they would agree to gambling at a Halal Casino.So how about eating pork? Is there some kind of Halal Pork, or something?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "noormcs5",
      "created_time": "August 27, 2023, 06:34:23 AM",
      "body": "Quote from: Ever-young on August 27, 2023, 06:17:22 AMQuote from: --Encrypted-- on August 27, 2023, 04:34:04 AMIt sounds to me that they're trying to work around their own beliefs which is just weird to say the least.Yea if we look at the title alone we could say that they are misleading the public base on there belief but going through the entire video the speaker is actually making some points and it’s not encouraging gambling but rather he is advising those Muslim who already found them self in the means of gambling to not use that as an excuse of not praying because of the surrounding that they finds their self that doing that could be seen as a double sin, anyone who see any Muslim in the means of gambling should not also stop them from praying that they should allow them pray, that everything is done one step at at time, with them doing a little of good thing and praying always that they will have better chances of realizing that they are committing a great sin and are likely to change and come out of the sin over time, But discouraging them and calling them siners won’t help the matter at all, he also gave an instance of those who see people who dress half native that it’s better to advise them to dress decently than telling them to completely remove the cloth since they choose to be naked. I finds his teachings educative rather than weird. Yes, I watched the whole video and found that the title of this video plus the thumbnail in this video does not match the content presented in the video. This is more like a clickbait title/thumbnail and there is no talk about the legit casino in this video.The speakers say that if you are doing one bad thing, that should not force you to do many bad things. Rather he is of the point of view that one bad deed should not stop you from doing other good deeds and when you keep on doing good deeds, you will automatically be refrain from doing the bad deeds which you were doing. That's the whole concept that is being explained there.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "knowngunman",
      "created_time": "August 27, 2023, 06:51:28 AM",
      "body": "Quote from: stadus on August 27, 2023, 06:34:03 AMI thought gambling is forbidden according to the Quran. This situation seems to be an attempt to make an exemption. I don't know if it's approved by other Muslim leaders. When you mention gambling, it should be automatically considered forbidden.This pertains to religion; I am not Muslim. We would like to hear from our Muslim brothers here whether they would agree to gambling at a Halal Casino.So how about eating pork? Is there some kind of Halal Pork, or something?Did you even take your time to watch the video or you just made your point from the headline? Gambling is haram and no one is attempting to make it halal in anyway. The point is when some people are engaging in sinful act, they do make it as an excuse not to perform prayers and other obligations again thinking that it will not be accepted from them since they are gambling or doing other haram things.I have a friend here who doesn't pray the whole day whenever he misses subhi (morning prayer) and when I ask him either in the afternoon or evening why he's not praying? He says because he misses the morning prayer and even if he prays in the afternoon and evening God will not accept it. Lol that's the mentality the video is talking about.You're gambling should not discourage you from performing other good deeds but you should know that you are sinning and must be punish for it if you don't repent.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stadus",
      "created_time": "August 27, 2023, 07:04:17 AM",
      "body": "Quote from: knowngunman on August 27, 2023, 06:51:28 AMQuote from: stadus on August 27, 2023, 06:34:03 AMI thought gambling is forbidden according to the Quran. This situation seems to be an attempt to make an exemption. I don't know if it's approved by other Muslim leaders. When you mention gambling, it should be automatically considered forbidden.This pertains to religion; I am not Muslim. We would like to hear from our Muslim brothers here whether they would agree to gambling at a Halal Casino.So how about eating pork? Is there some kind of Halal Pork, or something?Did you even take your time to watch the video or you just made your point from the headline? Gambling is haram and no one is attempting to make it halal in anyway. The point is when some people are engaging in sinful act, they do make it as an excuse not to perform prayers and other obligations again thinking that it will not be accepted from them since they are gambling or doing other haram things.I have a friend here who doesn't pray the whole day whenever he misses subhi (morning prayer) and when I ask him either in the afternoon or evening why he's not praying? He says because he misses the morning prayer and even if he prays in the afternoon and evening God will not accept it. Lol that's the mentality the video is talking about.You're gambling should not discourage you from performing other good deeds but you should know that you are sinning and must be punish for it if you don't repent. I started watching the video but didn't finish it because it didn't provide the type of explanation I was anticipating. I had hoped for a more in-depth clarification on why gambling is considered halal, but the content seemed rather general. It's possible that the video was just clickbait, as the previous poster pointed out.Also, I don't want to debate other things; I just want to stick to gambling. To be honest, in religious debates, there is no absolute right or wrong, as both sides always want to be right.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "piebeyb",
      "created_time": "August 27, 2023, 07:42:22 AM",
      "body": "Quote from: noormcs5 on August 27, 2023, 06:34:23 AMYes, I watched the whole video and found that the title of this video plus the thumbnail in this video does not match the content presented in the video. This is more like a clickbait title/thumbnail and there is no talk about the legit casino in this video.Yes, maybe people immediately catch what is seen from the title that contains clickbait and are provoked by it, so they draw conclusions and immediately comment outside the actual context of the video, actually in Islam it teaches good things so always remember worship, even if you are a gambler or criminals, it's good that worship should never be abandoned because that way it will make people lose their way and make themselves worse.Any worship will prevent us from doing something other evil in the future, maybe that's what is meant and captured from this video, acting as good people will help us become better later, therefore I can't comment much about this video before watching it's finished videos properly.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Solosanz",
      "created_time": "August 27, 2023, 07:45:16 AM",
      "body": "Ridiculous, gambling is obviously haram, even a conventional bank which only give interest rate from their operational income are considered as haram too. The only way gambling is halal in Islam is you're not put anything to bet, but you're play the game or make a guess with your opponent. But we've discuss it before where gambling without risking anything isn't a gambling.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MArsland",
      "created_time": "August 27, 2023, 08:34:52 AM",
      "body": "As we have seen the title and contents are very far away. It's not surprising that this content will definitely attract attention, because especially during the season, it's clear that gambling is prohibited. So to satisfy our curiosity about the delivery in the video, it definitely encourages us to watch it. Good marketing techniques only associated with a rule or religious law is highly unacceptable because it can damage the image of certain religious beliefs and be considered inconsistent. Apart from the contents of the video, which turned out not to match the thumbnail, it has its own agenda. I don't like that way of bringing religious law to a final action cannot be justified.We admit we are gamblers but never dare to bring up the name of a particular religion in order to justify wrong actions, because religious matters are not a realm that can be toyed with arbitrarily.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "knowngunman",
      "created_time": "August 27, 2023, 08:51:47 AM",
      "body": "Quote from: stadus on August 27, 2023, 07:04:17 AMI started watching the video but didn't finish it because it didn't provide the type of explanation I was anticipating. I had hoped for a more in-depth clarification on why gambling is considered halal, but the content seemed rather general. It's possible that the video was just clickbait, as the previous poster pointed out.Also, I don't want to debate other things; I just want to stick to gambling. To be honest, in religious debates, there is no absolute right or wrong, as both sides always want to be right.Now you understand the motive behind the headline. Religious argument is unhealthy especially in a platform like this but tbh your first comment sounds like a mockery to a certain religion by saying halal pork. However, there are some scholars who like to deviate from general public and their gullible followers will blindly follow them else gambling can not be polish in whatever way to make it halal. I am also a gambler by the way.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stadus",
      "created_time": "August 27, 2023, 08:58:40 AM",
      "body": "Quote from: knowngunman on August 27, 2023, 08:51:47 AMQuote from: stadus on August 27, 2023, 07:04:17 AMI started watching the video but didn't finish it because it didn't provide the type of explanation I was anticipating. I had hoped for a more in-depth clarification on why gambling is considered halal, but the content seemed rather general. It's possible that the video was just clickbait, as the previous poster pointed out.Also, I don't want to debate other things; I just want to stick to gambling. To be honest, in religious debates, there is no absolute right or wrong, as both sides always want to be right.Now you understand the motive behind the headline. Religious argument is unhealthy especially in a platform like this but tbh your first comment sounds like a mockery to a certain religion by saying halal pork. However, there are some scholars who like to deviate from general public and their gullible followers will blindly follow them else gambling can not be polish in whatever way to make it halal. I am also a gambler by the way. Sorry if you feel like I'm mocking but I'm not. What I'd like to point out is this: if they can reinterpret gambling as halal or permissible in English, even though it was originally preached as forbidden, then the same logic should apply to eating pork, shouldn't it? There shouldn't be any exceptions or attempts to deviate from the teachings. I'm not certain, but I'd like to conclude my opinion here.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ethereumhunter",
      "created_time": "August 27, 2023, 09:00:32 AM",
      "body": "Quote from: naira on August 27, 2023, 08:34:52 AMWe admit we are gamblers but never dare to bring up the name of a particular religion in order to justify wrong actions, because religious matters are not a realm that can be toyed with arbitrarily.It is true. I don't know what the agenda of the video is because the content and title don't match, but I may be wrong in this matter.We know Islam prohibits gambling. But many Muslims play gambling and they don't think about halal or haram. And it seems that the speaker also did not say clearly what a halal casino is and I think there is another intention behind the video. If we already know that gambling is haram, we don't need to gamble and even stay away from it. But if we don't think about halal or haram, it will be up to each person how best to do it.Sometimes, we as the audience, cannot take something from what the speaker is saying because maybe what the speaker said is too difficult for the average person to understand. This is where the audience misunderstood while the speaker did not provide clarification.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Outhue",
      "created_time": "August 27, 2023, 09:02:29 AM",
      "body": "Muslim brothers where are you?   I thought gambling is a sin, how come this is happening or this is fake? Some lives will be made through this casino and some will be ruined. That aside, OP you are promoting Roobet, that's one of the best casinos out there, why do you feel you need to try this halal casino out? I think this video is simply telling people to intentionally commit sin since Allah is a forgiver and because we are all human we shouldn't blame anyone, I understand that no one can be perfect but I feel this is wrong, there are many crazy people in suits and the only thing keeping them from showing their craziness is word of God, now I can't imagine if this gets out in the public, it's likely going to encourage people into doing things that are sinful all because no one is perfect.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mindrust",
      "created_time": "August 27, 2023, 09:10:59 AM",
      "body": "I don't think gambling is halal in Islam. I am no authority but it is just common sense. Interest is no good for example and gambling is way worse than interest. However, anybody can say that it is halal to gamble and establish \"halal casinos\" and probably nobody is going to stop them unless they live in SA. It is probably better to leave religions out of gambling because it will make things pretty messy pretty quickly. Gambling itself is not the cleanest business in the world and mixing it with religion will only make the matters even worse. Remember we are here to make money, not to make our lives worse.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "iv4n",
      "created_time": "August 27, 2023, 09:11:42 AM",
      "body": "Well, I stopped watching after 1st minute... this is not for me. Maybe some religious people have some inner confrontation about their gambling habits and they need some \"clarification\" from their religious representatives, but not me. I am okay with my gambling habits.Quote from: stadus on August 27, 2023, 07:04:17 AMAlso, I don't want to debate other things; I just want to stick to gambling. To be honest, in religious debates, there is no absolute right or wrong, as both sides always want to be right.Same here...  Let's just stick to gambling.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kakmakr",
      "created_time": "August 27, 2023, 09:42:55 AM",
      "body": "I do not think this is in any way related to gambling, but rather a subtle way to spread information about the Muslim religion and how they should practice their religion. The Muslim religion does not allow their followers to gamble, so those people should not even hang out in a gambling section of this forum. If they need answers, they must go find it in their Quran or their religious leaders.    Let's just talk about gambling here...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Juse14",
      "created_time": "August 27, 2023, 10:16:52 AM",
      "body": "I like to play gambling and I am a Muslim. And for whatever reason there is no such thing as sharia gambling, there is no lawful gambling \"whatever the reason, gambling is still illegal\"And this is a legal stipulation that cannot be changed, this is a religious order and this rule has been stipulated in God's word. I realized that what I was doing was \"gambling\" which was wrong and prohibited by religion. However, I like gambling for entertainment and I also cannot justify what I have done because the provisions are clearly \"haram\"Gambling is about likes and dislikes, because the sin is borne by oneself.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}