{
  "id": "topic_5407848",
  "title": "Gerceklerisoyleyen",
  "author": "Gerceklerisoyleyen",
  "created_time": "July 27, 2022, 08:51:33 PMLast edit: July 31, 2022, 12:01:38 PM by Gerceklerisoyleyen",
  "content": "Edit",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5407848",
  "comments": [
    {
      "author": "judas",
      "created_time": "July 27, 2022, 09:06:17 PM",
      "body": "Futbolun holiganlığa dönüştüğü anda futboldan soğuyorum bir anda. Ne olursa olsun bir kişinin bile sırf takımı gol yedi diye Ukrayna halkının elinden zulüm çektiği adamın lehine tezahüratlar yapması kesinlikle kabul edilemez. Burada bir spor müsabakası oynanıyor ve sen takımını desteklemeye gelmişsin. Hatta belki de aralarında farklı takımların taraftarlarından da gelenler olmuştur sonuçta Şampiyonlar Ligi maçıydı bu. Böyle güzel bir ortamı böyle çirkin laflarla bir anda yok etmek çok kötü bir hareket.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "VKcams.com",
      "created_time": "July 27, 2022, 09:08:56 PM",
      "body": "https://www.youtube.com/watch?v=Q5S2t7kpyHsFenerbahçe - Dinamo KievBütün Ruslar bayıldı.Quote from: judas on July 27, 2022, 09:06:17 PMFutbolun holiganlığa dönüştüğü anda futboldan soğuyorum bir anda. Ne olursa olsun bir kişinin bile sırf takımı gol yedi diye Ukrayna halkının elinden zulüm çektiği adamın lehine tezahüratlar yapması kesinlikle kabul edilemez. Burada bir spor müsabakası oynanıyor ve sen takımını desteklemeye gelmişsin. Hatta belki de aralarında farklı takımların taraftarlarından da gelenler olmuştur sonuçta Şampiyonlar Ligi maçıydı bu. Böyle güzel bir ortamı böyle çirkin laflarla bir anda yok etmek çok kötü bir hareket.Kimse Ukrayna halkına zulmetmiyor, böyle şeyler yazıyorsanız beyniniz yıkanmış demektir.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bobita",
      "created_time": "July 27, 2022, 11:17:21 PM",
      "body": "Quote from: VKcams.com on July 27, 2022, 09:08:56 PMhttps://www.youtube.com/watch?v=Q5S2t7kpyHsFenerbahçe - Dinamo KievBütün Ruslar bayıldı.Quote from: judas on July 27, 2022, 09:06:17 PMFutbolun holiganlığa dönüştüğü anda futboldan soğuyorum bir anda. Ne olursa olsun bir kişinin bile sırf takımı gol yedi diye Ukrayna halkının elinden zulüm çektiği adamın lehine tezahüratlar yapması kesinlikle kabul edilemez. Burada bir spor müsabakası oynanıyor ve sen takımını desteklemeye gelmişsin. Hatta belki de aralarında farklı takımların taraftarlarından da gelenler olmuştur sonuçta Şampiyonlar Ligi maçıydı bu. Böyle güzel bir ortamı böyle çirkin laflarla bir anda yok etmek çok kötü bir hareket.Kimse Ukrayna halkına zulmetmiyor, böyle şeyler yazıyorsanız beyniniz yıkanmış demektir.Evet, hatta biz de 2023'de gizli maddeler sayesinde dünya lideri olacağız, SABIR isimli ekonomik modelimizle ilk üç ekonomiden birisi olacağız, ayrıca Putin Nobel Barış Ödülü'ne aday gösterilmeli, bir de covid/pandemi diye bir şey yok, o tamamen aşı ayağına hepimize çip takmaya çalışan Bill Gates'in gizli planı.Ha, bir de Ukrayna bütün Afrika kıtasını işgal etmeye kalktığı için bunları hak ediyor.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Retro Harmony",
      "created_time": "July 28, 2022, 12:51:35 AM",
      "body": "Ukrayna halkı tamamen kendini savunan bir halk. Rusya şu an ülkede resmî olarak işgalci pozisyonunda ister kabul edin, ister etmeyin. Ukrayna, bu zor zamanlarında empati yaparsanız ne kadar kötü ve aşağılayıcı bir durumla karşılaştı tahmin edin. Türkiye’nin ve Fenerbahçe’nin uluslar arası arenada saygınlığını azaltıcı bir olay yaşandı. Bunun savunulacak bir tarafı yok.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "VKcams.com",
      "created_time": "July 28, 2022, 07:38:31 AM",
      "body": "Quote from: Retro Harmony on July 28, 2022, 12:51:35 AMUkrayna halkı tamamen kendini savunan bir halk. Askerlerin konuşlandığı yerlerde Ukraynalılar değil Ruslar yaşıyor.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ajanwalker",
      "created_time": "July 28, 2022, 09:57:18 AM",
      "body": "Maçı izlemedim. Zaten bizim şampiyonlar liginile girmemiz mucize. Sadece Fenerbahçe değil hangi Türk takımı ön eleme oynarsa hele bir de 1 den fazla ön eleme oynarsa katılımı çok zor. Ki öyle de oldu. Beni üzen sonuç vs değil. Ukrayna takımı varken Putin Putin demek hiç uygun olmadı. Bizim böyle işlere kalkışmamiz hiç yakışık almadı. Skor unutulur ama o tezahürat akıllarda kalır.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Phoenix Anka",
      "created_time": "July 28, 2022, 01:05:30 PM",
      "body": "Quote from: ajanwalker on July 28, 2022, 09:57:18 AMMaçı izlemedim. Zaten bizim şampiyonlar liginile girmemiz mucize. Sadece Fenerbahçe değil hangi Türk takımı ön eleme oynarsa hele bir de 1 den fazla ön eleme oynarsa katılımı çok zor. Ki öyle de oldu. Beni üzen sonuç vs değil. Ukrayna takımı varken Putin Putin demek hiç uygun olmadı. Bizim böyle işlere kalkışmamiz hiç yakışık almadı. Skor unutulur ama o tezahürat akıllarda kalır. Skor unutulur aynen öyle ama bugün atılan slogan ömür boyu Ukraynalı taraftarları yaralar. Kulübün bu sloganları atanlar ile ilgili bir çalışması olur mutlaka tespit edilenlerin bir daha stadyuma girişi engellenir ve üstü kapatılır. Yine de yaptırım yaptırımdır.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Red Pie",
      "created_time": "July 28, 2022, 01:11:05 PM",
      "body": "Spor dostluk, kardeşliktir diye iki millet ilk maçta sıkı sıkıya sarılmıştı. bu maçta fenerbahçe gibi köklü bir Türk takımının taraftarına asla yakışmayan hareketler sergilendi. bunlar taraftar değil resmen holiganlar, ırkçılar, haysiyetsiz ve şerefsizler. bir insanın milletini öldüren bir caniye nasıl destek verirsiniz futbol bu değil !",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LGD2Business",
      "created_time": "July 28, 2022, 03:28:15 PM",
      "body": "Quote from: VKcams.com on July 27, 2022, 09:08:56 PMKimse Ukrayna halkına zulmetmiyor, böyle şeyler yazıyorsanız beyniniz yıkanmış demektir.Maalesef ülkede ciddi şekilde Ukrayna ve Nato propagandası yapılarak ana akım medyada beyin yıkanıyor. Herkes Rusya'yı suçlayıp masum Rus halkını hedef gösteriyor.Türkiye hiçbir şekilde bu savaşın tarafı değildir. İki ülke ile de ilişkilerini koruması gereken nötr bir ülkedir. Burada yapılan tezahürat ise maçta yaşanan anlık bir tepkiden fazlası değildir. UEFA mafyası ise yine boş durmamış ve soruşturma açmış. Buradan çıkacak herhangi bir ceza tamamen siyasidir ve kabul edilemez. UEFA önce kendi pisliğini temizlesin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gospodin",
      "created_time": "July 28, 2022, 05:35:17 PM",
      "body": "ulan ne abarttınız be!!!maç sonunda da sahaya inip rakip futbolcuları tartakladılar değil mi yoksa alkış mı geldi? (fb takımı alkışlandı aslında )ay dünyaya rezil olduk, vay insan içine çıkamayız... amk böyle yapa yapa ukrayna'yı temsil eden herkese kupa verecekler.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Red Pie",
      "created_time": "July 28, 2022, 09:13:19 PM",
      "body": "Quote from: gospodin on July 28, 2022, 05:35:17 PMulan ne abarttınız be!!!maç sonunda da sahaya inip rakip futbolcuları tartakladılar değil mi yoksa alkış mı geldi? (fb takımı alkışlandı aslında )ay dünyaya rezil olduk, vay insan içine çıkamayız... amk böyle yapa yapa ukrayna'yı temsil eden herkese kupa verecekler.Doğru değil ama hocam ya putin denilmesi hiç hoş değil. avrupada dünyada spor manşetlerine çıkmamıza ne gerek vardı neden böyle yapıldı çok mu lazımdı o 20 saniye boyunca putin denmesinin ya da empati yapalım aynı şeyi biz yaşasak nasıl hissederdik büyük bir olay değil ama gerekli de değil. boş yere tatsız bir anı olarak kaldı bu.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gospodin",
      "created_time": "July 29, 2022, 03:37:29 PM",
      "body": "Quote from: Red Pie on July 28, 2022, 09:13:19 PMQuote from: gospodin on July 28, 2022, 05:35:17 PMulan ne abarttınız be!!!maç sonunda da sahaya inip rakip futbolcuları tartakladılar değil mi yoksa alkış mı geldi? (fb takımı alkışlandı aslında )ay dünyaya rezil olduk, vay insan içine çıkamayız... amk böyle yapa yapa ukrayna'yı temsil eden herkese kupa verecekler.Doğru değil ama hocam ya putin denilmesi hiç hoş değil. avrupada dünyada spor manşetlerine çıkmamıza ne gerek vardı neden böyle yapıldı çok mu lazımdı o 20 saniye boyunca putin denmesinin ya da empati yapalım aynı şeyi biz yaşasak nasıl hissederdik büyük bir olay değil ama gerekli de değil. boş yere tatsız bir anı olarak kaldı bu. ya hocam yapılan zaten saçmalık buna kimse bir şey demez ama öyle bir lanse ediliyor ki sanki 90 dakika boyunca tüm stad putin diye bağırmış, ellerinde z harfli bayraklarla tribünleri doldurmuşuz gibi. yunanistan, güney kıbrıs vs bu takımlarla zamanında sürekli saçma sapan olaylar yaşanıyordu. bir kere bile bik bik eden olmadı. bir de unutmadan konuyla alakalı olmasa da yarın yunanistan ile bir savaş durumu yaşasak şu an rusya'ya uygulanan yaptırımın 100 katını bize yaparlardı. tüm rus takımlarının/bireysel sporcuların men edilmesi nedir allah aşkına? ne yapsın adamlar putin'e kafa mı atsın amk!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "VKcams.com",
      "created_time": "July 29, 2022, 04:39:43 PM",
      "body": "Quote from: gospodin on July 29, 2022, 03:37:29 PM tüm rus takımlarının/bireysel sporcuların men edilmesi nedir allah aşkına? ne yapsın adamlar putin'e kafa mı atsın amk!Gelecek Olimpiyatların sloganına dikkat edin - Herkese açık.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "püsür",
      "created_time": "July 29, 2022, 08:21:41 PM",
      "body": "Maçı tabi ki izlemedim ve twitterdaki kısa video dışında ne oldu bilmiyorum ama bence aşırı gereksiz bir olay. Tribünde insanlar gerçekten çok ayrı bir kafaya girebiliyor. Maalesef yaklaşık 5 yıl tuttuğum takımın her maçına giderek zamanımı çöpe atmıştım. Bu yüzden çok iyi şekilde biliyorum ki tribündeki profilin en az %70'i çöp. Bir de topluluk psikolojisine ve tribün adrenaline maruz kalınca inanılmaz gerizekalı şeyler yapılabiliyor. Putin diye bağırmaları gerizekalıca, Uefa'nın yaptığı da gerizekalıca. Nasıl bir şey yapabilirler ki böyle bir tezahürata",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "RaltcoinsB",
      "created_time": "July 31, 2022, 07:02:38 AM",
      "body": "Abartmaya gerek yok bence de Putin sloganları atılmadan önce gol sevinciyle taraftarların nasıl tahrik edildiğini görmüş olmalısınız ondan sonra insanların sinirle 20 saniye attığı sloganın uluslararası arenada Türkiye ve Fenerbahçe aleyhine kullanıyorsunuz hiç partizan maçı izlemediler herhalde veya Yunan Türk maçlarında Yunanistan’da asarız keseriz ırkçı pankartlara neden ses etmiyordu bu UEFA adamına göre muamelede üstlerine yok bırakın ya Suriye’de savaş varken sesleri yoktu Ukraynalılar sarı saçlı mavi gözlü veya aynı din mensupları diye mi onlara daha çok acıyorlar",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "eightdots",
      "created_time": "July 31, 2022, 11:03:44 AM",
      "body": "O zaman her maçta bir iki tane yanlış tezahürat bulalım tüm takımı suçlayalım hatta tüm ülkeyi suçlayalım. Geçin şu işleri gündeme gelmesi bile bomboş bir olay. Fenerbahçe düşmanlığı yapacağız diye boş işler yapmayın. Yanlış bir tezahüratı tüm Fenerbahçe'ye yıkamazsınız.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}