{
  "id": "topic_5415312",
  "title": "_act_",
  "author": "_act_",
  "created_time": "September 29, 2022, 07:44:08 AMLast edit: September 29, 2022, 07:54:36 AM by _act_",
  "content": "https://cryptodirectories.com/news/next-bitcoin-bull-run-to-be-half-story-half-utility-mike-novogratz-at-token2049/QuoteThe next Bitcoin (BTC) bull run will have to be much different from historical cryptocurrency rallies in terms of story and utility, Galaxy Digital CEO Mike Novogratz believes.Compared to previous bull runs, the next Bitcoin rally will have to be more focused on utility and less on the story, Novogratz predicted at a panel at the Token2049 crypto event on Wednesday. One of the biggest historical rallies, the Bitcoin bull run of 2017, was mostly about the story, the CEO said, referring to the cryptocurrency’s run from about $1,000 to $20,000 within one year.According to Novogratz, the 2017 bull run was mostly about the story of people not trusting the government and wanting more privacy and decentralization. “It was a Gen Z millennial revolution. And it was global. That’s a powerful story,” the CEO noted.Another big rally, with Bitcoin hitting all-time highs above $69,000 in November 2021, was “really generated” by the COVID-19 pandemic, Novogratz said. He suggested that the price action in 2020 and 2021 was “probably 80% of the story and 20% of utility,” referring to the growing utility use case of digitalization amid the pandemic.Mike Novogratz has made a prediction in the past which was correct, but people that understand bitcoin price history would have predicted in 2020 that the price of bitcoin would significantly increase after halving and it was like that. But some people still always use something happening in the world to be the cause of bitcoin price increase, some are true but not all the cause. When COVID-19 started to affect the world in March 2020, the price of bitcoin decreased from $10500 to $3800, it was said that COVID-19 caused it. Bitcoin price later increased and reach $63500 or so in 2020, it was said that COVID-19 caused it. I believe halving is the main cause, but people like to link what is not to something relevant at times. What I will not agree about here is the indirect statement that story like halving will not have effect on the next all-time-high. People should not believe this. After 2024 halving, be expecting all-time-high again. It is best to hold now.Bitcoin is highly utilized already and the utility is increasing which is part of the adoption and price increase, but the story part has never gone too which is halving.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5415312",
  "comments": [
    {
      "author": "Baofeng",
      "created_time": "September 29, 2022, 08:11:51 AM",
      "body": "Of course it will always be the halving that is the catalyst of the next bull run. But there could be underlying factors that might have contributed to the massive spike in price.So it might be the question as to what will be the next story for bitcoin's bull run, or where all the money will come from to push it to at least 6 digits.Will it be bitcoin becoming as narrative \"act as a reserve currency \"?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Despairo",
      "created_time": "September 29, 2022, 08:16:29 AM",
      "body": "Quote from: https://cryptodirectories.com/news/next-bitcoin-bull-run-to-be-half-story-half-utility-mike-novogratz-at-token2049/“The word inevitable keeps coming up. There’s a sense of inevitability that we’re in the right space, inevitable that Bitcoin will have its day,” Novogratz stated. He also expressed confidence that Web3 and nonfungible tokens will be a big part of the gaming space in the future.After I read this, he's just a random person who didn't know anything about cryptocurrency including Bitcoin. How it's possible the scam Web 3.0 and non fungible tokens will become a big part of gaming space? it will ruin the gaming space and many people will get scammed since they will only get worthless token.There's no correlation with the previous ATH and covid-19 pandemic, he's lying if he doesn't believe the halving event, he said in the next few years will see Bitcoin break new ATH. He actually refer to the next Bitcoin halving.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "electronicash",
      "created_time": "September 29, 2022, 08:18:25 AM",
      "body": "probably halving combined with what is happening globally will be the cause of massive spike to more than $69k. and only few retailed investors that will drive it because the crisis these days may dried up retail investor's wallet. when it comes to utility, i think he is talking about ETH. although there are already doubts, it may be true when investors will wanna find investment  asset that will generate income. thats one utility besides the eth use case in the network.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DeathAngel",
      "created_time": "September 29, 2022, 08:20:29 AM",
      "body": "I don’t pay too much attention to Novogratz, this is a guy who has a LUNA tattoo, after all. The next bull run is going to be epic though. You must use this bear market now, to buy as much bitcoin as possible so you can profit from the most powerful bull market we will have seen.Fiat system is dying, bitcoin will absolutely rocket in 2024/25.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "September 29, 2022, 08:33:58 AM",
      "body": "a bull run is something that lasts more then 6 monthsthis is how the wall street defines it(along with some other parameters) because they invented the wordhere is something you all need to learnthe ATH temporary events were just that.. BUBBLE events.. they pump and dump.the reasons for each one is not a \"story\"its actually infrustructuretthe 2011 ATH was triggered by the mining change from CPU to GPUwhere difficulty jumped thus mining cost jumped thus cost to get bitcoin jumped.its logic. common sensethe 2013 was when ASICS took overthe 2017 event was when ASICS got more efficientthe 2021 event was when ASICS got even more efficientat each of these triggers. speculation took over and pumped prices mega high as over reactions. hense the corrections after the bubble reached maximum inflation and burst2011 $0.30->100x->$30->correct to-> $2.50the cpu to GPU cost increase should have moved the price by a factor of 6 months of bull to 8x not 100xlosts of people over speculated an instant 100x cost increase. also added in some emotional pokes about silkroad, wiki and other uses to hype up the speculation to cause the bubblethe 2013 was a mix of thingsbitcoins GPU mining caused a snowball effect to the market. to get price to $6 in 2012.. then the halving done its job to get to $15 (just over its 2x)then new exchanges and services hyped up the market.but the underlying value before the 2013 ATH had a 6x before ATH to its ultimate correction after the ATHthe 2016 halving done its job moving the underlying value of ~$350 to ~$700 (market prices were higher)the 2017 before ATH and after ATH had a ~$700-$3500the 2020 halving done its job of a 2xrthe 2021 moved at a healthy 6x to the ATH and corrected due to better asics to a 3x correction back to good valueoverall the 2020 pre ATH was a underlying value of ~7k(market price earing $10k at the time)and after ATH corrected to underlying value ($15k) with market at ~$20k..DO NOT EVER trat ATL temporary events as a show of bull markets of value or long term stuff. because ATH moments dont last 6 months. ATH moments are temporary unjustified bubble events. they are not based on prices that should sustain that high that early.. yes value underlying the market swill eventually surpass those points. but people need to stop confusing temporary bubble pump and dump events as actual bull markets of value indictor movements.oh and please do some research on what the actual triggers of certain events are. even if the following speculation that over prices the triggers is speculation and hypeyou will learn alot more that way",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "September 29, 2022, 09:46:31 AM",
      "body": "Quote from: DeathAngel on September 29, 2022, 08:20:29 AMI don’t pay too much attention to Novogratz, this is a guy who has a LUNA tattoo, after all. Mike has lost all credibility when it comes to any serious discussions about cryptocurrencies, especially Bitcoin - because someone who was part of the biggest scam in history should feel ashamed and apologize to everyone he caused financial losses to. What he is talking about now is not worth more than reading a few entries of a classic shitposter on this forum - and they all have in common that they don't care about anything more than how they will profit as much as possible.For those who haven't seen it yet, I have to post this picture one more time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Taskford",
      "created_time": "September 29, 2022, 10:26:52 AM",
      "body": "He just speculate base on current situation but actually there's no actual facts about his claim since eventhough how bad the condition happen to bitcoin it change when halving came's. This was proven for so many times so what he claim is totally a non sense random speculation.I'd rather believe for something great to happen rather than speculating that there will be more dumps to come.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "September 29, 2022, 11:15:46 AM",
      "body": "Quote from: _act_ on September 29, 2022, 07:44:08 AMMike NovogratzWho? lolQuoteCompared to previous bull runs, the next Bitcoin rally will have to be more focused on utility and less on the story,Price rises have always been based on utility and partly based on short lived hypes. It is not going to change until we reach mass adoption.QuoteAccording to Novogratz, the 2017 bull run was mostly about the story of people not trusting the government and wanting more privacy and decentralization. “It was a Gen Z millennial revolution. And it was global.I disagree. It is more like nonsense opinion if you ask me. The 2017 bull run was not any different from the previous one in 2013 or the one before that or the first bull run. We have a combination of halving cutting supply creation rate by 50% and adoption that increases day by day. Every person has a slightly different reason to adopt bitcoin, specially during bull runs the reasons are mostly profit oriented like in 2017 bull run not privacy and decentralization oriented. QuoteWhat I will not agree about here is the indirect statement that story like halving will not have effect on the next all-time-high.It's very weird using the term \"story\" in this context but I agree, halving will always have a significant effect on the price.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sunsilk",
      "created_time": "September 29, 2022, 11:18:07 AM",
      "body": "Quote from: _act_ on September 29, 2022, 07:44:08 AMWhen COVID-19 started to affect the world in March 2020, the price of bitcoin decreased from $10500 to $3800, it was said that COVID-19 caused it. Looking at the historical chart, it wasn't $3800 as the lowest on March 2020 which was the start of the lock downs. The lowest at that time was $5000.But, it's true that when the bitcoin has decreased, it was most likely due to the start of the pandemic and many have panicked.As for these predictions of Mike Novogratz. I recognize and appreciate all of his bullishness but it's that many times he had predicted and most of it didn't go accurately.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DapanasFruit",
      "created_time": "September 30, 2022, 08:04:50 AM",
      "body": "The world already know a lot on the Bitcoin story...and now we must be focusing on its utility or adoption so it can be more solid and more resilient in the face of many challenges. Indeed, the more people are using Bitcoin and the more business organizations are adopting it the more it will have value...which is of course can be leading to its next bull run. Now, while I understand somehow the insight provided by the famous Mike Novogratz there is no guarantee whatsoever that his prediction can really come true...but I am hoping that we will have a bull run at least by 2023.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}