{
  "id": "topic_5410733",
  "title": "ninis45",
  "author": "ninis45",
  "created_time": "August 21, 2022, 10:21:46 PM",
  "content": "setelah saya melihat beberapa post dan topik di forum ini,kebanyakan topik sudah tidak lagi ada pembaruan[balasan] dan mereka yang masih aktif melakukan kebanyakan adalah anggota furum itu-itu saja ....menurut kalian apakah ini dampak dari momen bearis sehingga banyak pemburu bounty khususnya pendatang baru yang mulai tidak berpartisipasi di dalamnya",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5410733",
  "comments": [
    {
      "author": "nurilham",
      "created_time": "August 21, 2022, 11:29:16 PM",
      "body": "Quote from: ninis45 on August 21, 2022, 10:21:46 PMsetelah saya melihat beberapa post dan topik di forum ini,kebanyakan topik sudah tidak lagi ada pembaruan[balasan] dan mereka yang masih aktif melakukan kebanyakan adalah anggota furum itu-itu saja ...Tidak masalah jika threadnya tidak ada pembaruan, terutama thread yang pada dasarnya bukan thread yang perlu diupdate secara berkala. Daripada komen di situ cuman nyepam, lebih baik cari thread baru yang masih fresh topiknya.Agan bisa pilih beberapa thread baru ini kalau memang serius mau bikin post berkualitas:1. https://bitcointalk.org/index.php?topic=5409959.02. https://bitcointalk.org/index.php?topic=5397274.03. https://bitcointalk.org/index.php?topic=5409635.04. https://bitcointalk.org/index.php?topic=5403436.0Quote from: ninis45 on August 21, 2022, 10:21:46 PMmenurut kalian apakah ini dampak dari momen bearis sehingga banyak pemburu bounty khususnya pendatang baru yang mulai tidak berpartisipasi di dalamnya Tidak ada hubungan samasekali dengan bearish karena bounty jumlahnya tetap banyak meskipun kita ada di fase bearish. Selain itu, ada juga sigcamp berbayar BTC atau berbayar koin top yang selalu berjalan meskipun market bearish ataupun bullish. Kalau minim post di board lokal, mungkin mereka post di board global.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mu_enrico",
      "created_time": "August 22, 2022, 05:46:15 PM",
      "body": "Quote from: ninis45 on August 21, 2022, 10:21:46 PMmenurut kalian apakah ini dampak dari momen bearis sehingga banyak pemburu bounty khususnya pendatang baru yang mulai tidak berpartisipasi di dalamnya Lha menurut agan gimana?Kalau menurut ane, user casual sudah mulai bosan morum karena tidak ada yang menarik pasca booming ICO, kala itu token masih jadi perbincangan hot, mana proyek yang go to the moon juga hot. Setelah itu DeFi dan NFT yang meskipun kurang berasa hypenya dibanding ICO tapi masih jadi sesuatu yang menarik. Nah, sekarang ini baru sepi tidak ada yang menarik (dari kacamata user casual). Jadi ya yang masih stay adalah user yang memang ada ketertarikan di segala sesuatu tentang kripto - altcoin, seperti depegging UST, Celcius bangkrut, dan Tornado Cash (belom ada threadnya, mungkin ane lagi yang bikin ).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ninis45",
      "created_time": "August 22, 2022, 10:08:23 PM",
      "body": "Quote from: mu_enrico on August 22, 2022, 05:46:15 PMQuote from: ninis45 on August 21, 2022, 10:21:46 PMmenurut kalian apakah ini dampak dari momen bearis sehingga banyak pemburu bounty khususnya pendatang baru yang mulai tidak berpartisipasi di dalamnya Lha menurut agan gimana?Kalau menurut ane, user casual sudah mulai bosan morum karena tidak ada yang menarik pasca booming ICO, kala itu token masih jadi perbincangan hot, mana proyek yang go to the moon juga hot. Setelah itu DeFi dan NFT yang meskipun kurang berasa hypenya dibanding ICO tapi masih jadi sesuatu yang menarik. Nah, sekarang ini baru sepi tidak ada yang menarik (dari kacamata user casual). ia sih ....ketertarikan morum mereka mungkin sudah redup pasca buming-bumingnya ICO,dan kalau ane inget pada waktu itu forum ini,rame ame  topik bounty translate campaig ... itupun pada momen tinggi-tingginya pendatang baru di sini dan aturan merit masih belum berlaku  sehingga banyak anggota yang melakukan spamQuote from: mu_enrico on August 22, 2022, 05:46:15 PMJadi ya yang masih stay adalah user yang memang ada ketertarikan di segala sesuatu tentang kripto - altcoin, seperti depegging UST, Celcius bangkrut, dan Tornado Cash (belom ada threadnya, mungkin ane lagi yang bikin ). sebuah refrensi yang menarik untuk di bahas kalau itu memang bisamembantu dan memberi wawasan kenapa tidak .... uantuk agan buat topik tersebut .... karna saya yakin setiap anggota yang mw bikin topik, apalagi tentang perkembangan altcoin  pasti dia mengerti dan sudah mempelajarinya dengan seksama, jadi bukan hanya bikin topik dan meninggalkanya",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bigjuk",
      "created_time": "August 23, 2022, 04:29:13 AM",
      "body": "Quote from: ninis45 on August 21, 2022, 10:21:46 PMsetelah saya melihat beberapa post dan topik di forum ini,kebanyakan topik sudah tidak lagi ada pembaruan[balasan] dan mereka yang masih aktif melakukan kebanyakan adalah anggota furum itu-itu saja ....menurut kalian apakah ini dampak dari momen bearis sehingga banyak pemburu bounty khususnya pendatang baru yang mulai tidak berpartisipasi di dalamnya Pantau saya banyak akun berperingkat tinggi yang tidak aktif dan tidak join dalam kampanye bounty, sebagian yang aktif kebanyakan mereka di terima dalam kampanye yang berbasis perjudian, Papan Altcoin tidak di perhitungkan, saya pikir berdasarkan alasan ini yang membuat papan Altcoin sepi, bagian perjudian seperti pasar tanah abang, rame pengunjung, persyaratan harus di penuhi.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mamesso",
      "created_time": "August 23, 2022, 10:03:47 AM",
      "body": "Quote from: bigjuk on August 23, 2022, 04:29:13 AMPantau saya banyak akun berperingkat tinggi yang tidak aktif dan tidak join dalam kampanye bounty, sebagian yang aktif kebanyakan mereka di terima dalam kampanye yang berbasis perjudian, Papan Altcoin tidak di perhitungkan, saya pikir berdasarkan alasan ini yang membuat papan Altcoin sepi, bagian perjudian seperti pasar tanah abang, rame pengunjung, persyaratan harus di penuhi.Salah satu alasan yang paling masuk akal karena banyak user SFI yang diterima di Bounty atau signature paid BTC yang tidak menghitung post board lokal, karena alasan itu sebagian dari user SFI jarang singgah di board lokal. Berdasarkan update aktivitas posting lokal Board bulan juli tahun 2022 yang di share agan @skarais ada 74 nama yang aktif di Board Lokal SFI.Quote from: skarais on August 10, 2022, 07:55:41 PMTop 10 Poster Teraktif Lokal Board Bahasa Indonesia Bulan Juli tahun 2022Code:1. Husna QA [80]2. Razmirraz [55]3. DroomieChikito [48]4. erep [47]5. Bobrox [46]6. mamesso [42]7. lalabotax [35]8. masulum [35]9. Oneandpure [34]10. abhiseshakana [34]Nama-nama pengguna yang aktif di Lokal Board bulan Juli tahun 2022Code:1. Husna QA [80]2. Razmirraz [55]3. DroomieChikito [48]4. erep [47]5. Bobrox [46]6. mamesso [42]7. lalabotax [35]8. masulum [35]9. Oneandpure [34]10. abhiseshakana [34]11. Luzin [31]12. blue Snow [28]13. taufik123 [26]14. nurilham [24]15. skarais [23]16. mu_enrico [20]17. Antonas1 [13]18. Davian144 [13]19. Sarah Azhari [13]20. Falconer [11]21. kawetsriyanto [11]22. Tumanggor [10]23. Fawwaz wildan [9]24. 8rch7 [7]25. roycilik [7]26. BITCOIN4X [6]27. Bitinity [6]28. ShowOff [6]29. Uang_kartal [6]30. indah rezqi [6]31. Ahli38 [5]32. bestcoins1 [5]33. elgayul [5]34. hotimbineh [5]35. teslag [5]36. ETFbitcoin [4]37. MAAManda [4]38. Renampun [4]39. aylabadia05 [4]40. ryzaadit [4]41. AnakJendral [3]42. Rengga Jati [3]43. Xiaomie A1 [3]44. cloudfir3e [3]45. dansus021 [3]46. vv181 [3]47. Bayu kurniawan [2]48. Kweek [2]49. Liberalisasi [2]50. Radja Rimba [2]51. Rasa nanas [2]52. TelolettOm [2]53. Yabes [2]54. abia [2]55. adammuiz [2]56. dark1234 [2]57. len01 [2]58. reza7777 [2]59. BitSwapNow [1]60. Dayx [1]61. Dilladupak [1]62. Hagz [1]63. Legioner519 [1]64. Note3 [1]65. PanduGeddonrozak [1]66. RB000 [1]67. SawiPait [1]68. abi1988 [1]69. ancafe [1]70. chum_yum [1]71. marcous [1]72. panjul07 [1]73. velikamagarca [1]74. yanadefis [1]Dan angka itu bisa berkurang dibulan Agustus karena sebagian besar nama yang dulunya Aktif di SFI sudah tidak lagi singgah disini akibat postingannya tidak dihitung.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blue Snow",
      "created_time": "August 23, 2022, 10:13:58 AM",
      "body": "Quote from: ninis45 on August 21, 2022, 10:21:46 PMmenurut kalian apakah ini dampak dari momen bearis sehingga banyak pemburu bounty khususnya pendatang baru yang mulai tidak berpartisipasi di dalamnya Kalau ane lihat kayak bounty sosmed, artikel dan video masih ramai-ramai saja (walau tidak seramai dulu), kecuali bounty signature karena kemungkinan besar sudah banyak yang pindah ke signature bayaran bitcoin. Lalu, Kalau ditanya, apakah ini dampak bearish?, bisa jadi iya, karena banyak yang masih menunggu momen dan beristirahat sejenak. Tapi, bukankah bearish ini membuat harga token makin murah?, dan peluang bagus untuk nimbun pakai bounty?, seharusnya menurut ane, inilah kesempatan besar buat nabung, sedangkan tren bullish itu saatnya istirahat.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "skarais",
      "created_time": "August 23, 2022, 02:25:54 PM",
      "body": "Quote from: bigjuk on August 23, 2022, 04:29:13 AMPantau saya banyak akun berperingkat tinggi yang tidak aktif dan tidak join dalam kampanye bounty,Bukan lagi alasan baru gan, itu sudah jadi alasan paling umum. Saya ambil satu contoh saja, pada bulan Agustus tahun 2018 untuk melihat berapa banyak poster aktif di bagian altcoin Bahasa Indonesia dan berapa banyak posting yang dibuat selama satu bulan.Total pengguna aktif pada Agustus 2018 adalah 1620, sementara jumlah posting yang dibuat adalah 23.769. Berikut 50 pengguna teraktif saat itu.Code:1. aidit45@gmail.com [114]2. coinsycrip09 [93]3. Asensio [83]4. ancafe [83]5. aruldaroy [82]6. sayaya17 [80]7. wildey [79]8. camat gampong [77]9. Arcas [75]10. ajomanih [75]11. v0nyu [75]12. BaeSuzy [74]13. q(O_O)p [72]14. Al-Ghifary [71]15. bocahebitren [71]16. tebzzz [71]17. Joke [70]18. abramovich [69]19. apa don [68]20. kopisusu [68]21. junifebriani [67]22. tyo dreamer [67]23. DavenporK [66]24. abi1988 [66]25. ayisganteng [66]26. tyoA7X [66]27. xianU [66]28. Fadliai [65]29. Groundbit [65]30. kincit88 [65]31. tzuzulmbakzul [65]32. vania vin [65]33. bigjuk [64]34. Davian144 [63]35. andyou1234 [63]36. Ngemmeng [62]37. anggi [62]38. kiply [62]39. tu_kang [62]40. Ezravdb [61]41. Gajaradupala [61]42. Hendra gunawan [61]43. benuardo [61]44. xinaxi [61]45. qory [60]46. NeelMariaWarner [59]47. izmael ahmadi [59]48. kakonlin [59]49. liao chandra [59]50. imortal teknik [58]Quotesebagian yang aktif kebanyakan mereka di terima dalam kampanye yang berbasis perjudian,Yang di bounty juga ada gan, tapi jumlahnya tidak banyak.QuotePapan Altcoin tidak di perhitungkan,Siapa kata? Asalkan campaign menerima posting lokal maka dimanapun agan mau mempostingnya akan dihitung juga kecuali syaratnya tidak tercapai, jumlah karakter misalnya. Quotesaya pikir berdasarkan alasan ini yang membuat papan Altcoin sepi,Pasang surutnya pasti bisa terjadi kapan saja. Misalnya bulan depan ada banyak bounty yang legit dan menerima postingan lokal, maka saya yakin jumlah poster juga bisa bertambah banyak. Dulu itu CB altcoin selalu padat penghuninya, tapi sekarang sudah migrasi ke board lain karena kebutuhan campaign atau mungkin karena lebih mudah capai kouta posting tanpa terlalu peduli pada kualitas diskusi.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "masulum",
      "created_time": "August 23, 2022, 04:17:31 PM",
      "body": "Tidak hanya di SFI Altcoin, tapi main board juga sepi. Ini karena kebanyakan thread sudah tidak dikomentari lagi. Sejatinya banyak sekali thread yang bisa dilanjutkan pembahasannya tidak hanya itu-itu saja. Namun, seperti yang diungkapkan sih, adanya peraturan untuk tidak menghitung post lokal menjadi salah satu pemicu menurunnya posts. Padahal, kita bisa tetap aktif walau hanya 1 atau 2 posts seminggu untuk meramaikan board kita ini. Ya, kembali pada pribadi masing-masing, kalau mereka nyaman di luar ya ga masalah juga. Saya pribadi berharap mereka yang pernah aktif kembali ke rumah agar bisa kembali ramai.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mamesso",
      "created_time": "August 24, 2022, 03:39:32 AM",
      "body": "Quote from: masulum on August 23, 2022, 04:17:31 PMTidak hanya di SFI Altcoin, tapi main board juga sepi. Ini karena kebanyakan thread sudah tidak dikomentari lagi. Sejatinya banyak sekali thread yang bisa dilanjutkan pembahasannya tidak hanya itu-itu saja. Namun, seperti yang diungkapkan sih, adanya peraturan untuk tidak menghitung post lokal menjadi salah satu pemicu menurunnya posts. Padahal, kita bisa tetap aktif walau hanya 1 atau 2 posts seminggu untuk meramaikan board kita ini. Ya, kembali pada pribadi masing-masing, kalau mereka nyaman di luar ya ga masalah juga. Saya pribadi berharap mereka yang pernah aktif kembali ke rumah agar bisa kembali ramai.Setuju, thread yang seharusnya dapat dilanjutin pembahasannya mulai ditinggalkan dan sebagian besar user lokal yang wara-wiri di Main Board atau Child Boards sudah tidak lagi terlihat karena alasan postingan di board lokal tidak dihitung lagi. Semua itu kembali lagi pada kemauan mereka masing-masing Om, jika dilihat dari historis postingan mereka yang ikut Campaign yang mengecualikan post lokal, rata-rata mereka membuat 5 atau 6 posting per/hari, jika terus konsisten seperti itu mereka sudah dapat menyelesaikan target mingguan hanya dalam dalam 5 hari saja. Selebihnya mereka dapat singgah di Sub lokal dengan beberapa post untuk meramaikan SFI, namun ya itu, kembali pada pribadi mereka masing-masing (mau atau tidak).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blue Snow",
      "created_time": "August 24, 2022, 07:50:16 AM",
      "body": "Quote from: skarais on August 23, 2022, 02:25:54 PMQuote from: bigjuk on August 23, 2022, 04:29:13 AMPapan Altcoin tidak di perhitungkan,Siapa kata? Asalkan campaign menerima posting lokal maka dimanapun agan mau mempostingnya akan dihitung juga kecuali syaratnya tidak tercapai, jumlah karakter misalnya. betul, kayak ane ini, manajer tidak memperbolehkan kami mosting di altcoin board, tapi ini ada pengecualian jika altcoin-nya di lokal board, dalam hal ini manajer tetap menghitung meski altcoin. Jadi menurut ane tidak tepat jika ditinggalkan, apa lagi jika karena tidak dihitung lagi terus pergi begitu saja. Karena menurut ane, seindah dan senyaman apa pun kehidupan di negeri luar lebih nyaman hujan batu di negeri sendiri.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "skarais",
      "created_time": "August 24, 2022, 04:26:50 PM",
      "body": "Quote from: blue Snow on August 24, 2022, 07:50:16 AMbetul, kayak ane ini, manajer tidak memperbolehkan kami mosting di altcoin board, tapi ini ada pengecualian jika altcoin-nya di lokal board, dalam hal ini manajer tetap menghitung meski altcoin. Jadi menurut ane tidak tepat jika ditinggalkan, apa lagi jika karena tidak dihitung lagi terus pergi begitu saja. Karena menurut ane, seindah dan senyaman apa pun kehidupan di negeri luar lebih nyaman hujan batu di negeri sendiri.  Ya, tapi di kondisikan saja gan dan saya harap siapapun mereka agar tidak mempostingnya secara terpaksa di SFI terlepas dihitung atau tidaknya postingannya di campaign. Bagi saya tidak masalah, tetapi saya selalu berusaha untuk tetap aktif di SFI karena keinginan saya untuk berkontribusi ke pengguna yang ada. Beberapa thread yang saya buat adalah bukti bahwa saya punya keinginan, tapi karena mungkin waktu terbatas dan saya juga memiliki minat di board lain maka saya tidak selalu bisa aktif di SFI. Pengguna lain juga sama, mungkin. Jadi tidak ada paksaan untuk itu dan bagusnya emang didasarkan pada kesadaran masing-masing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Razmirraz",
      "created_time": "August 24, 2022, 09:45:22 PM",
      "body": "Quote from: skarais on August 24, 2022, 04:26:50 PMQuote from: blue Snow on August 24, 2022, 07:50:16 AMSnip.Ya, tapi di kondisikan saja gan dan saya harap siapapun mereka agar tidak mempostingnya secara terpaksa di SFI terlepas dihitung atau tidaknya postingannya di campaign. Bagi saya tidak masalah, tetapi saya selalu berusaha untuk tetap aktif di SFI karena keinginan saya untuk berkontribusi ke pengguna yang ada. Beberapa thread yang saya buat adalah bukti bahwa saya punya keinginan, tapi karena mungkin waktu terbatas dan saya juga memiliki minat di board lain maka saya tidak selalu bisa aktif di SFI. Pengguna lain juga sama, mungkin. Jadi tidak ada paksaan untuk itu dan bagusnya emang didasarkan pada kesadaran masing-masing.Memang tidak bisa dipaksakan Om, butuh kesadaran untuk terus meramaikan SFI meski post di Board Lokal tidak dihitung di Campaign. Jika dilihat dari segi keaktifan penggunaan lokal, seharusnya SFI sangat ramai, namun hanya sebagian atau jika dihitung lebih rinci lagi hanya seperempat dari user asal SFI yang meramaikan forum lokal, saya tidak perlu menyebut namanya satu persatu disini karena kita sudah sama-sama tau siapa-siapa saja yang selalu berkontribusi disini.Saya harap SFI tidak hanya digunakan ketika ada maunya saja, maksud saya SFI tidak hanya dijadikan sebagai tempat transit ketika ada maunya saja, kemudian mereka akan berangkat lagi setelah yang dicari sudah didapat.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ninis45",
      "created_time": "August 24, 2022, 10:18:28 PM",
      "body": "sebenarnya sangat manusiawi bila seseorang datang karna sebuah keperluan dan pergi bila tidak di perlukan. ini adalah merupakan sebuah watak,dan jujur sayapun juga begitu di forum ini ,tapi pada dasarnya kita sebagai orang local tentunya sangat bijaksana untuk berkotrobusi di dalam SFI untuk memberiikan sebuah pengalaman,info dan tegoran/koreksi bagi mereka yang mungkin, salah dalam sebuah penulisan ataupun topik yang terlalu di luar pembahasan. khususnya mereka yang notabenya mempunyai banyak pengalaman, berprestasi dan anggota yang posisi keanggotaanya sudah tinggi karna mereka adalah yang paling banyak pengalamanya di sini",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kawetsriyanto",
      "created_time": "August 24, 2022, 11:40:30 PM",
      "body": "Quote from: bigjuk on August 23, 2022, 04:29:13 AM~sebagian yang aktif kebanyakan mereka di terima dalam kampanye yang berbasis perjudian, Papan Altcoin tidak di perhitungkan, saya pikir berdasarkan alasan ini yang membuat papan Altcoin sepi,~Asalkan post di board local masuk dalam hitungan weekly post, mau di sub altcoins atau mining atau jual-beli, semuanya diperhitungkan. Faktanya, sebenarnya yang paling rame postnya adalah di sub Altcoin karena banyak thread dengan topik bahasan yang ringan. Sedangkan sub yang butuh pemahaman khusus seperti sub mining, paling sepi dari dulu sampe sekarang. Sebab topiknya rata-rata terkait hal spesifik, jarang yang hal umum.Quote from: blue Snow on August 23, 2022, 10:13:58 AMbisa jadi iya, karena banyak yang masih menunggu momen dan beristirahat sejenak. Tapi, bukankah bearish ini membuat harga token makin murah?, dan peluang bagus untuk nimbun pakai bounty?, seharusnya menurut ane, inilah kesempatan besar buat nabung, sedangkan tren bullish itu saatnya istirahat.Memangnya bounty hunter menunggu momen apa?  Menimbun apa, Om? Kalau yang ditimbun shitcoin, percuma saja. Entah bearish atau bullish gak terlalu ada bedanya, shitcoin hasil bounty tetap murah dan bahkan mungkin sudah delisting. Kalau yang good coin/token, sudah pasti dijual secepatnya setelah distribusi.  Quote from: Razmirraz on August 24, 2022, 09:45:22 PMSaya harap SFI tidak hanya digunakan ketika ada maunya saja, maksud saya SFI tidak hanya dijadikan sebagai tempat transit ketika ada maunya saja, kemudian mereka akan berangkat lagi setelah yang dicari sudah didapat.Ini masuk ke ranah kebijakan masing-masing, tiap orang mungkin bisa beda pandangan. Kalau menurut saya, jika SFI diibaratkan rumah kita, mungkin bisa dikelompokkan ada penghuni tetap dan ada penghuni tidak tetap. Ada yang selalu hadir, ada yang sesekali datang, juga ada yang sama sekali tidak pernah datang/hadir. Tidak ada paksaan mau jadi yang mana, hanya masalah apreasiasi tentu akan lebih ke pada yang loyal dan yang punya kontribusi lebih. Sudah alaminya seperti itu, dalam kehidupan sosial juga punya dinamika yang sama. IMO",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kamvreto",
      "created_time": "August 26, 2022, 07:06:30 AM",
      "body": "Quote from: kawetsriyanto on August 24, 2022, 11:40:30 PMQuote from: Razmirraz on August 24, 2022, 09:45:22 PMSaya harap SFI tidak hanya digunakan ketika ada maunya saja, maksud saya SFI tidak hanya dijadikan sebagai tempat transit ketika ada maunya saja, kemudian mereka akan berangkat lagi setelah yang dicari sudah didapat.Ini masuk ke ranah kebijakan masing-masing, tiap orang mungkin bisa beda pandangan. Kalau menurut saya, jika SFI diibaratkan rumah kita, mungkin bisa dikelompokkan ada penghuni tetap dan ada penghuni tidak tetap. Ada yang selalu hadir, ada yang sesekali datang, juga ada yang sama sekali tidak pernah datang/hadir. Tidak ada paksaan mau jadi yang mana, hanya masalah apreasiasi tentu akan lebih ke pada yang loyal dan yang punya kontribusi lebih. Sudah alaminya seperti itu, dalam kehidupan sosial juga punya dinamika yang sama. IMOya contohnya seperti ane gan, jarang post di local. tapi itu udah jadi pilihan masing2. ane sih kadang2 suka nimbrung disini, mau jadi penghuni tetap atau tidak yang penting masih hadir. dan betul ini hanya masalah apresiasi dan tentu kontribusi di lokal atau rumah sendiri lebih berarti untuk menjalih silaturahmi sesama saudara di SFI. Sepi tidak jadi masalah yang penting gak terlalu banyak spam, thread tetap tertata rapi dan masih ada anggota yang berkontribusi.ane juga lahir dan belajar dari SFI dan dulu selalu aktif di altcoin untuk memenejeri beberapa bounty, tapi sekarang sudah enggak lagi dan milih untuk jadi anggota biasa aja.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Razmirraz",
      "created_time": "August 26, 2022, 03:12:32 PM",
      "body": "Quote from: kawetsriyanto on August 24, 2022, 11:40:30 PMQuote from: Razmirraz on August 24, 2022, 09:45:22 PMSaya harap SFI tidak hanya digunakan ketika ada maunya saja, maksud saya SFI tidak hanya dijadikan sebagai tempat transit ketika ada maunya saja, kemudian mereka akan berangkat lagi setelah yang dicari sudah didapat.Ini masuk ke ranah kebijakan masing-masing, tiap orang mungkin bisa beda pandangan. Kalau menurut saya, jika SFI diibaratkan rumah kita, mungkin bisa dikelompokkan ada penghuni tetap dan ada penghuni tidak tetap. Ada yang selalu hadir, ada yang sesekali datang, juga ada yang sama sekali tidak pernah datang/hadir. Tidak ada paksaan mau jadi yang mana, hanya masalah apreasiasi tentu akan lebih ke pada yang loyal dan yang punya kontribusi lebih. Sudah alaminya seperti itu, dalam kehidupan sosial juga punya dinamika yang sama. IMOBenar. Ada yang datang, ada yang pergi. Ada yang hanya fokus di board luar dan ada juga yang memanfaatkan situasi. SFI tidak pernah mati meskipun mereka tidak pernah kembali, selalu ada user yang meramaikan SFI dengan segala bentuk kontribusi, baik dari segi mengedukasi pengguna lain maupun mengapresiasi pada postingan yang layak. Yang disayangkan ada sebagian user yang hanya memanfaatkan situasi saja, seperti maksud penjelasan saya yang Om kutip di atas. Sebagian hadir disini ketika ada maunya saja (mungkin Om mengerti yang saya maksud), mereka singgah sekali hanya untuk menghadiri pesta saja, setelah itu langsung pergi dengan sebuah kalimat ucapan Terimakasih, ini yang paling disayangkan.Memang tidak ada paksaan bagi siapapun untuk terus berada disini, tapi alangkah baiknya ada sedikit kontribusi sebelum pesta dimulai.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TelolettOm",
      "created_time": "August 26, 2022, 11:25:25 PM",
      "body": "Quote from: kamvreto on August 26, 2022, 07:06:30 AMya contohnya seperti ane gan, jarang post di local. tapi itu udah jadi pilihan masing2. ane sih kadang2 suka nimbrung disini, mau jadi penghuni tetap atau tidak yang penting masih hadir. dan betul ini hanya masalah apresiasi dan tentu kontribusi di lokal atau rumah sendiri lebih berarti untuk menjalih silaturahmi sesama saudara di SFI. Sepi tidak jadi masalah yang penting gak terlalu banyak spam, thread tetap tertata rapi dan masih ada anggota yang berkontribusi.Sama, saya juga tidak terlalu sering post di board SFI. Saya ikut nimbrung ketika ada topik atau ada post yang saya anggap saya bisa komentari. Kalau topiknya sulit-sulit, saya jarang ikutan nimbrung karena takut post saya dianggap nyepam. Menurut saya ini pilihan kita dan tidak ada salahnya demikian, selama kita tidak melanggar aturan yang ada di SFI. Mau jadi penghuni tetap atau tidak tetap, saya tidak merasa masalah dengan keduanya. Untuk apresiasi, saya yakin masih banyak member SFI yang objektif.Quote from: kamvreto on August 26, 2022, 07:06:30 AMane juga lahir dan belajar dari SFI dan dulu selalu aktif di altcoin untuk memenejeri beberapa bounty, tapi sekarang sudah enggak lagi dan milih untuk jadi anggota biasa aja.Kenapa gak dilanjut jadi managernya, gan?Saya pikir dengan menjadi manager itu adalah contoh kontribusi yang sangat positif. Agan bisa menyeleksi proyek bagus atau tidaknya dari situ, agan bisa menjadi pioneer untuk memfilter scam di forum ini.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kamvreto",
      "created_time": "August 27, 2022, 08:12:51 AM",
      "body": "Quote from: TelolettOm on August 26, 2022, 11:25:25 PMQuote from: kamvreto on August 26, 2022, 07:06:30 AMane juga lahir dan belajar dari SFI dan dulu selalu aktif di altcoin untuk memenejeri beberapa bounty, tapi sekarang sudah enggak lagi dan milih untuk jadi anggota biasa aja.Kenapa gak dilanjut jadi managernya, gan?Saya pikir dengan menjadi manager itu adalah contoh kontribusi yang sangat positif. Agan bisa menyeleksi proyek bagus atau tidaknya dari situ, agan bisa menjadi pioneer untuk memfilter scam di forum ini.udah capek gan dan timnya juga udah gak kompak. ada yang sibuk dengan kerjaannya utamanya dana ada yang pensiun. ane mutusin untuk stop aja, itu juga karena banyak bounty yang gak sepadan pembayarannya, juga kalah pamor sama manajer yang lebih pro. kalo cuman mau filter proyek yang bagus atau tidak sudah banyak thread yang ngejelasin  bagaimana melakukan riset menggunakan tool khusus.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mamesso",
      "created_time": "August 27, 2022, 09:12:20 AM",
      "body": "Quote from: kamvreto on August 27, 2022, 08:12:51 AMudah capek gan dan timnya juga udah gak kompak.Masalah tim tidak kompak itu alasan nomor sekian, yang penting ada kemauan dari agan untuk membentuk tim baru.Quote from: kamvreto on August 27, 2022, 08:12:51 AMitu juga karena banyak bounty yang gak sepadan pembayarannya, juga kalah pamor sama manajer yang lebih pro. Berbicara masalah pembayaran, tergantung pada personal masing-masing, lagian menjadi BM tidak mudah seperti yang dibayangkan. Awalnya Mark Marquez juga kalah pamor sama Rossi, berkat kegigihannya dia mampu menjadi pembalap pro.Kalau agan sudah punya Basis sebagai BM, saran ane mending dilanjutin aja, bisa jadi berkat pengalaman dan kegigihan suatu saat agan bisa menjadi BM pro yang dapat menghandle proyek yang bagus dan Signature paid BTC. Btw sudah menjadi tugas kita untuk terus aktif disini, kita sebagai user yang pernah merangkak dari kecil dan besar disini punya tanggung jawab secara emosional untuk terus meramaikan SFI. Meski bukan sebuah kewajiban untuk terus ada disini, setidaknya kita tau dari mana tempat kita berasal.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}