{
  "id": "topic_5446464",
  "title": "Godlovesyou",
  "author": "Godlovesyou",
  "created_time": "March 27, 2023, 10:51:13 AM",
  "content": "Am trying to run a my node and NFT for games and tutorials but it seems difficult to navigates the cores rom! Could be a network issues or there is a some tracks am missing behind. I have hard this issues for some times now but someone put me through! I have a compatible device with tentacles flat drives to built a suitable node but its keeps troubling",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5446464",
  "comments": [
    {
      "author": "Pmalek",
      "created_time": "March 27, 2023, 01:32:31 PM",
      "body": "You need to provide much more information than that if you expect someone to help you. I have the feeling you used Google translate to make that post. Maybe you would be more comfortable asking this question in your local language forum if it exists on Bitcointalk.The info you gave can be compared to someone going to the doctor and saying \"I feel bad, it hurts\" and that's it. Make the doctor figure out the rest.What kind of node are you trying to run?Is it even a Bitcoin node (asking since you are mentioning NFTs)?What software are you using?What hardware do you have?What error messages do you see?Any logs that show those error messages?Are you using a guide you found on the forum or somewhere else, and which one?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Godlovesyou",
      "created_time": "March 27, 2023, 04:46:39 PM",
      "body": "Quote from: Pmalek on March 27, 2023, 01:32:31 PMYou need to provide much more information than that if you expect someone to help you. I have the feeling you used Google translate to make that post. Maybe you would be more comfortable asking this question in your local language forum if it exists on Bitcointalk.The info you gave can be compared to someone going to the doctor and saying \"I feel bad, it hurts\" and that's it. Make the doctor figure out the rest.What kind of node are you trying to run?Is it even a Bitcoin node (asking since you are mentioning NFTs)?What software are you using?What hardware do you have?What error messages do you see?Any logs that show those error messages?Are you using a guide you found on the forum or somewhere else, and which one?[/quoteSir, it wasn't google translator,  that's my original language but I guess I didn't give the real expression of my challenge but thank you for coming in.I wanted to run bitcoin node but it kind difficultAm using spreadsheet and multimedia software installationWhile the hardware I have home spark.The errors messages am seeing the showing error in contents and if I try again it will show system fails.If I can see the guide on the forum it will be more preferable to use because I'm trying to follow what I learn from eBook Marco.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Godlovesyou",
      "created_time": "March 28, 2023, 12:29:51 PM",
      "body": "Quote from: ETFbitcoin on March 28, 2023, 10:03:52 AMQuote from: Godlovesyou on March 27, 2023, 04:46:39 PMQuote from: Pmalek on March 27, 2023, 01:32:31 PM--snip--Sir, it wasn't google translator,  that's my original language but I guess I didn't give the real expression of my challenge but thank you for coming in.I wanted to run bitcoin node but it kind difficultAm using spreadsheet and multimedia software installationWhat do you mean by using spreadsheet and multimedia software instillation? Could you provide example or some detail about it?Quote from: Godlovesyou on March 27, 2023, 04:46:39 PMWhile the hardware I have home spark.I never heard of computer, laptop, server or computer parts brand which has name \"Spark\" or \"Home Spark\".Quote from: Godlovesyou on March 27, 2023, 04:46:39 PMThe errors messages am seeing the showing error in contents and if I try again it will show system fails.If I can see the guide on the forum it will be more preferable to use because I'm trying to follow what I learn from eBook Marco.Could you tell us what is the error message?Sir, sorry am making it difficult to understand. What I mean by spreadsheet software is example of Microsoft excel, WPS, Minitab Statistical software or google workplace.And the home spark is Java, Python, R and Scala. The spark usually support the multiple uses. We locally call it spark. The error message is your device does not support this program. And am using Lenovo ideapad S400 Touch.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pmalek",
      "created_time": "March 28, 2023, 01:27:51 PM",
      "body": "Quote from: Godlovesyou on March 28, 2023, 12:29:51 PMSir, sorry am making it difficult to understand. What I mean by spreadsheet software is example of Microsoft excel, WPS, Minitab Statistical software or google workplace. I don't understand what any of that has to do with setting up and configuring your node. Quote from: Godlovesyou on March 28, 2023, 12:29:51 PMThe error message is your device does not support this program. And am using Lenovo ideapad S400 Touch. What are the specs of that device? What tutorial are you following to run a node?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Godlovesyou",
      "created_time": "March 28, 2023, 10:19:12 PM",
      "body": "Quote from: Pmalek on March 28, 2023, 01:27:51 PMQuote from: Godlovesyou on March 28, 2023, 12:29:51 PMSir, sorry am making it difficult to understand. What I mean by spreadsheet software is example of Microsoft excel, WPS, Minitab Statistical software or google workplace. I don't understand what any of that has to do with setting up and configuring your node. Quote from: Godlovesyou on March 28, 2023, 12:29:51 PMThe error message is your device does not support this program. And am using Lenovo ideapad S400 Touch. What are the specs of that device? What tutorial are you following to run a node?  Sir, the spec of the device is Core i3-3217U 1.8 GHz.While the Tutorial am following is like mostly; QuickNode guides, Beginners guides, and crypto glossary sir. Sir, i really appreciates you giving me help.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ABCbits",
      "created_time": "March 29, 2023, 09:42:44 AM",
      "body": "Quote from: Godlovesyou on March 28, 2023, 12:29:51 PMQuote from: ETFbitcoin on March 28, 2023, 10:03:52 AM--snip--Sir, sorry am making it difficult to understand. What I mean by spreadsheet software is example of Microsoft excel, WPS, Minitab Statistical software or google workplace.And the home spark is Java, Python, R and Scala. The spark usually support the multiple uses. We locally call it spark.Software and programming language you mentioned isn't relevant to run full node.Quote from: Godlovesyou on March 28, 2023, 12:29:51 PMThe error message is your device does not support this program. And am using Lenovo ideapad S400 Touch.The default OS for your device is Windows 8 Pro 64-bit Edition [1]. Assuming you still use that or newer version of Windows OS, visit to Bitcoin Core download page[2] to download Windows version of Bitcoin Core, then run the installer. The installation process should be easy, but you can easily find guide to install Bitcoin Core on Windows[3] on internet easily.[1] https://specspro.net/laptops/10164-lenovo-ideapad-s400-touch/[2] https://bitcoincore.org/en/download/[3] https://en.bitcoin.it/wiki/Help:Installing_Bitcoin_Core",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Godlovesyou",
      "created_time": "March 29, 2023, 03:59:41 PM",
      "body": "Quote from: ETFbitcoin on March 29, 2023, 09:42:44 AMQuote from: Godlovesyou on March 28, 2023, 12:29:51 PMQuote from: ETFbitcoin on March 28, 2023, 10:03:52 AM--snip--Sir, sorry am making it difficult to understand. What I mean by spreadsheet software is example of Microsoft excel, WPS, Minitab Statistical software or google workplace.And the home spark is Java, Python, R and Scala. The spark usually support the multiple uses. We locally call it spark.Software and programming language you mentioned isn't relevant to run full node.Quote from: Godlovesyou on March 28, 2023, 12:29:51 PMThe error message is your device does not support this program. And am using Lenovo ideapad S400 Touch.The default OS for your device is Windows 8 Pro 64-bit Edition [1]. Assuming you still use that or newer version of Windows OS, visit to Bitcoin Core download page[2] to download Windows version of Bitcoin Core, then run the installer. The installation process should be easy, but you can easily find guide to install Bitcoin Core on Windows[3] on internet easily.[1] https://specspro.net/laptops/10164-lenovo-ideapad-s400-touch/[2] https://bitcoincore.org/en/download/[3] https://en.bitcoin.it/wiki/Help:Installing_Bitcoin_CoreThank you so much sir, this really help.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pmalek",
      "created_time": "March 29, 2023, 04:17:27 PM",
      "body": "If the specs that ETFbitcoin posted correspond to the exact laptop you have, hard disk space might become an issue. Does your device have a 500 GB drive? The Bitcoin blockchain is getting close to 500 GB I think. Running a pruned node might be your only option unless you have additional storage capacities.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Godlovesyou",
      "created_time": "March 29, 2023, 10:15:55 PM",
      "body": "Quote from: Pmalek on March 29, 2023, 04:17:27 PMIf the specs that ETFbitcoin posted correspond to the exact laptop you have, hard disk space might become an issue. Does your device have a 500 GB drive? The Bitcoin blockchain is getting close to 500 GB I think. Running a pruned node might be your only option unless you have additional storage capacities.  Probably the storage capacity was the issues because my device properties is 4GB ROM and 380 GB drive. That's why it has proven difficult to run such high gigabytes network system like the Bitcoin nodes which you said it takes up 500GB to keep your device convenient and accessible.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pmalek",
      "created_time": "March 30, 2023, 01:14:45 PM",
      "body": "Quote from: ETFbitcoin on March 30, 2023, 11:34:41 AMWe don't know what you did previously. OP seems reluctant in sharing the exact steps he did so far. It just wastes his own time in getting his node up and running and causes everyone to guess if it's this or that. The only useful piece of information we have is that something (hopefully a legit Bitcoin Core software) displayed a warning message saying his device can't run the software. The proper way to ask for help would be: I did this,1. 2. 3. etc.- I followed these setup tutorials (list them)- I downloaded this software from here (link)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Godlovesyou",
      "created_time": "March 30, 2023, 04:55:26 PM",
      "body": "Quote from: Pmalek on March 30, 2023, 01:14:45 PMQuote from: ETFbitcoin on March 30, 2023, 11:34:41 AMWe don't know what you did previously. OP seems reluctant in sharing the exact steps he did so far. It just wastes his own time in getting his node up and running and causes everyone to guess if it's this or that. The only useful piece of information we have is that something (hopefully a legit Bitcoin Core software) displayed a warning message saying his device can't run the software. The proper way to ask for help would be: I did this,1. 2. 3. etc.- I followed these setup tutorials (list them)- I downloaded this software from here (link)Sir, initially it was difficult for me to understand because that was my first time, please let me answer you properly.First: I do beginners tutorials from- Node.js Tutorials W3Schools. Where were taught how to use Java, JavaScript, Python, HTML, CSS, PHP and so on to run nodes. Secondly I downloaded a software called: Svnode which comprises; parallel tx validation, parallel block validation, advanced configuration option and merchant service integration.Here is the downloaded link https://www.bitcoinsv.com/svnodeFinally sir, the device am using is lenovo ideapad S400 Touch with 380 GB drive, 4GB ROM.Each time I try to apply what I have learned from the tutorials and use the software I downloaded, the device will stop functioning and it will show error message; this device do not support such format, please upgrade to new version and try again.Boss, I guess I make a little sense with this explanations here sir. Thank you for your patients.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pmalek",
      "created_time": "March 30, 2023, 06:08:27 PM",
      "body": "Bitcoin SV is not Bitcoin. I thought you said you were trying to run a Bitcoin node. Bitcoin SV is a fork, but it's not a fork of the original Bitcoin. It's a fork of Bitcoin Cash, which in turn forked from Bitcoin. You are trying to run a copy of a copy. This support child forum is for help with the real Bitcoin and Bitcoin-related issues and inquiries. You have either made a mistake and you are trying to setup the wrong type of software, or you have opened this discussion in the wrong place.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Godlovesyou",
      "created_time": "March 30, 2023, 06:39:29 PM",
      "body": "Quote from: Pmalek on March 30, 2023, 06:08:27 PMBitcoin SV is not Bitcoin. I thought you said you were trying to run a Bitcoin node. Bitcoin SV is a fork, but it's not a fork of the original Bitcoin. It's a fork of Bitcoin Cash, which in turn forked from Bitcoin. You are trying to run a copy of a copy. This support child forum is for help with the real Bitcoin and Bitcoin-related issues and inquiries. You have either made a mistake and you are trying to setup the wrong type of software, or you have opened this discussion in the wrong place.I really appreciates your efforts trying to put me through.I have discard the downloaded software and stop the node process. I think is right i open a new post in a related forum where I can gather more information on how to run bitcoin nodes before doing anything. To know the simple steps to take, softwares needed and functional device required.God bless you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}