{
  "id": "topic_5463740",
  "title": "Justin999",
  "author": "Justin999",
  "created_time": "August 18, 2023, 09:04:37 PM",
  "content": "Some known popular altcoins are eth bnb ada xrp matic etc and so many are available in crypto market where eth bnb is common investment. But i saw some people, buy matic but don't want to go for ada! Some buy xrp but not Interested with solana!What is the name of that Top altcoin that you won't buy anymore?? Example: i Won't buy TRON(trx) anymore cause it makes me disappointed several time with its stable price since 2017",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5463740",
  "comments": [
    {
      "author": "goaldigger",
      "created_time": "August 18, 2023, 09:09:23 PM",
      "body": "There’s a reason why investors are avoiding other project just to have move holdings with the other coin. I’m buying ADA than to SOL because see its potential and I know they will continue to grow. Also, I’m buying XRP because I’m confident that they can finally win the case. If you have limited budget you can’t have everything, you just need to choose what is best for you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kentrolla",
      "created_time": "August 18, 2023, 09:54:09 PMLast edit: August 18, 2023, 10:41:38 PM by kentrolla",
      "body": "Tron is the first name which comes to my mind as it has always been disappointment for me though I had given multiple chances but it failed miserably. It's better to go BNB and other top coin instead of Tron as the dev team is least bothered about further enhancement. XRP was once in the same list of altcoins which I wouldn't buy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TimeTeller",
      "created_time": "August 18, 2023, 09:59:23 PM",
      "body": "Quote from: kentrolla on August 18, 2023, 09:54:09 PMTron is the first name which comes to my mind as it has always been disappointment for me though I had given multiple chances but it failed miserably. It's better to go BNB and other top coin instead of Tron as the dev team is least bothered about further enhancement .TRX and XRP for me, not for long-term investments because their platforms are shrouded by uncertainty.But don't get me wrong, I like both of these alts when it comes to transfer purposes because they are cheap.Their availability in most trading platforms is also a very good choice when it comes to transfer and trading purposes.However, because of SEC issues and all, it is hard to consider them for long-term holding. You can't guarantee that when you forget that you have these alts for years, they will be here and increasing its value.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "The Cryptovator",
      "created_time": "August 18, 2023, 10:09:09 PM",
      "body": "I'm open to purchasing top coins under various conditions. For instance, if ETH were to decrease to $100, there'd be no clear reason not to consider buying. This illustrates one possible scenario. Additionally, I'm keen on acquiring top coins when they're undervalued. While this approach carries risk, it's essential to take risks to generate profit. Thorough market analysis is crucial for successful investment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Apocollapse",
      "created_time": "August 19, 2023, 04:18:43 AM",
      "body": "ETH, USDT, BNB, XRP, USDC, Cardano, Doge, Solana, Tron, Polkadot, Polygon, Shiba Inu, Toncoin, WBTC, etc etc are the top altcoins which I won't buy anymore because it's centralized, can be frozen in non custodial wallet and low security. There's no point for me to buy those coins since I need to check my coins everyday and make sure my coins not disappear. Only few coins can be trusted, one of the example is BTC.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitcampaign",
      "created_time": "August 19, 2023, 04:50:34 AM",
      "body": "Quote from: Justin999 on August 18, 2023, 09:04:37 PMSome known popular altcoins are eth bnb ada xrp matic etc and so many are available in crypto market where eth bnb is common investment. But i saw some people, buy matic but don't want to go for ada! Some buy xrp but not Interested with solana!I'm not really interested in TRX, XLM, DOGE coins these three prices really make me bored to invest with these three coins, I'd rather switch to some coins that have promising movement and growth of these coins, I don't like to play long term I prefer short term even if only a little profit but if you have large capital then the profit will be even greater.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o48o",
      "created_time": "August 19, 2023, 09:41:16 AM",
      "body": "Quote from: Justin999 on August 18, 2023, 09:04:37 PMSome known popular altcoins are eth bnb ada xrp matic etc and so many are available in crypto market where eth bnb is common investment. But i saw some people, buy matic but don't want to go for ada! Some buy xrp but not Interested with solana!What is the name of that Top altcoin that you won't buy anymore?? Example: i Won't buy TRON(trx) anymore cause it makes me disappointed several time with its stable price since 2017 Anymore? Do you mean because i have changed my mind has changed about them? I used to like ADA long time ago when it first came to market, but my opinions about it changed pretty soon, even though it has decent code, i don't think it's going to solve correct issues. And some coins have toxic communities and apparently working environment. Profit hungry devs sacrificing quality over buzzwords so i never even buy them.I really haven't gone from positive to negative about anything else than ada, and maybe AVAX on short time, at least on those that are still in the top marketcap. I used to buy XRP and LTC to use them on transaction between exchanges, but only because those were cheap to use. I never liked to hold them, and now there are cheaper L2 options. There are still coins that i never really bought except when i tried their ecosystems, like Tron and ADA.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "August 19, 2023, 10:08:07 AM",
      "body": "For long term maybe a lot on the basket that I eont buy anymore. But for short term I could always do some short order depends on the potential on an upside. But why wasted time and money on buying them if you gonna hold for long term right? I might agree on you about tron since Im not a fan of Justin and how he handle tron though I like tron usdt when doing fund transfer as it is the lowest one can be used for transaction with low fees.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wexnident",
      "created_time": "August 19, 2023, 10:22:55 AM",
      "body": "Hmm I've never really deviated from the altcoins I've always wanted to buy, I've never had any issues with other altcoins as well (other than me being dumb in the past and selling them at a low price). I guess some would be XRP and BNB? Stablecoins are also one, I've never seen any use in trying to hold them, I've used them before and still use them now, but mostly for transfers and whatnot, for hodling/investing? Not so much. There's also a bunch of altcoins that I used to buy that just died down, so I just gave up on them later on after selling whatever I can.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sunsilk",
      "created_time": "August 19, 2023, 10:27:00 AM",
      "body": "Quote from: Justin999 on August 18, 2023, 09:04:37 PMSome known popular altcoins are eth bnb ada xrp matic etc and so many are available in crypto market where eth bnb is common investment. But i saw some people, buy matic but don't want to go for ada! Some buy xrp but not Interested with solana!That is because we have our own differences and preferences if it's to the crypto that we want to hold. So if someone likes the latter, there will be someone on the other side of the world that doesn't.Quote from: Justin999 on August 18, 2023, 09:04:37 PMWhat is the name of that Top altcoin that you won't buy anymore?? Example: i Won't buy TRON(trx) anymore cause it makes me disappointed several time with its stable price since 2017 And what a coincidence that you have the same name of the owner of that project. Maybe I'll only buy tron if I need some gas fee for a TRC20 transaction for Tether.Otherwise, I won't.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "August 19, 2023, 11:49:32 AM",
      "body": "Each investor has his own criteria in which he sees logical justifications for why he invested in X coin and did not invest in Y coin, so I can say that I did not invest in solana because it is very centralized, and I did not invest in ada because it has been removed from some platforms or I want to invest in matic because I think the fees Ethereum is high, or I want to buy TRON because the use of USDT will increase in the future, and so on. There are many reasons, but some find it sufficient to invest or stop investing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptomaniac_xxx",
      "created_time": "August 19, 2023, 12:36:09 PM",
      "body": "Quote from: Justin999 on August 18, 2023, 09:04:37 PMSome known popular altcoins are eth bnb ada xrp matic etc and so many are available in crypto market where eth bnb is common investment. But i saw some people, buy matic but don't want to go for ada! Some buy xrp but not Interested with solana!What is the name of that Top altcoin that you won't buy anymore?? Example: i Won't buy TRON(trx) anymore cause it makes me disappointed several time with its stable price since 2017 I agree with Tron, it's just a disappointment to see this project not enjoying the support of the community. Maybe it's because of Justin Sun as shilling God that it got a bad impression.It's depends though, there are no one size fits all formula here, I like ADA and SOL but I don't like MATIC.And with that, there could be investors who don't think like me and perhaps like the coins that I don't want to put my money into.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "HONDACD125",
      "created_time": "August 19, 2023, 05:36:41 PM",
      "body": "Quote from: Justin999 on August 18, 2023, 09:04:37 PMSome known popular altcoins are eth bnb ada xrp matic etc and so many are available in crypto market where eth bnb is common investment. But i saw some people, buy matic but don't want to go for ada! Some buy xrp but not Interested with solana!What is the name of that Top altcoin that you won't buy anymore?? Example: i Won't buy TRON(trx) anymore cause it makes me disappointed several time with its stable price since 2017 Everyone is investing according to their own perspective and according to their own thinking and research. Maybe the token that I don't want to invest in anymore, other investors are interested in it. The token I no longer want to buy in my portfolio is Dot. I invested in it a year and a half ago, and I was buying more periodically when the price dropped. I have never seen it increase in value. Its price is constantly going down. While there is no doubt that coin prices have fallen across the market, there are some coins that have given good returns to their investors even during the bear season. I never saw any movement in my tokens, so I stopped investing further in Dot.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jocuserious",
      "created_time": "August 19, 2023, 05:58:53 PM",
      "body": "2017 has been a truly remarkable year and many great coins have achieved success in this year and are still surviving in the crypto market. But now it's an exception because today I see the price of btc has decreased due to which the altcoins market is now red light. But new chart my research very soon btc price will come back green chart. Moreover, my profit rate was high in 2017 because it was ICO time and almost all projects were full of investors. On the other hand now the investors of ico have decreased because scam projects have increased at a massive rate.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "irsykes",
      "created_time": "August 19, 2023, 08:58:00 PM",
      "body": "do your own research it is better to avoid something happening, if we follow someone's information. there are lots of big potential projects by the end of 2023. sometimes hype moments are also important from the investor's side to get big profits, such as hype memes, NFT, DEFI. which is still in question what is next from the upcoming hype",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nelson4lov",
      "created_time": "August 19, 2023, 09:13:38 PM",
      "body": "TRON and ADA are my picks. Both of these projects don't seem to having anything big or interesting going on with them (the protocol itself) or its ecosystem. At this point, it feels like TRON's main benefits only include the cheap fee for transferring TRC20 USDT or the TRON token itself. Otherwise, nada.I'm tempted to put NEAR on the list as well. I used to be a big supporter but the NEAR foundation made mistakes with how funds were disbursed for the ecosystem especially the sail gp partnership which a lot of people deemed to be more unnecessary than \"groundbreaking\".",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Justin999",
      "created_time": "August 19, 2023, 09:37:53 PM",
      "body": "Quote from: Apocollapse on August 19, 2023, 04:18:43 AM ETH, USDT, BNB, XRP, USDC, Cardano, Doge, Solana, Tron, Polkadot, Polygon, Shiba Inu, Toncoin, WBTC, etc etc are the top altcoins which I won't buy anymore because it's centralized, can be frozen in non custodial wallet and low security. There's no point for me to buy those coins since I need to check my coins everyday and make sure my coins not disappear. Only few coins can be trusted, one of the example is BTC.Mate, it seems you are ignoring the whole crypto universe but those are like heart beats of Crypto universe and most suggested and most trusted Altcoins ever (except few). Being centralized doesn't means all of those are bad and all of those are going to free anytime. I just wondered how you thought but as money is yours, so decision is also yours. And bitcoin is enough i guess",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DabsPoorVersion",
      "created_time": "August 19, 2023, 10:41:40 PM",
      "body": "One of the coin that I won't consider buying anymore is ada. I am really disappointed in that coin, its price movement is really slow that every other altcoin already follows the price movement of btc,eth and more, then you will see ada which feels like it doesn't care. I also don't consider tron, it is not worth buying as it is just a cheap copy of eth. Founder can't be trusted and risking my money on that altcoin is a no no.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yudhisthir",
      "created_time": "August 19, 2023, 11:22:38 PM",
      "body": "I would not like to close my doors for future opportunities on trading and investment. Bit there are few altcoins that I prefer not to buy as a long term investment. One of the top coins is Ripple. I don't see a future of it and it's continuously slipping towards failure. More and more promising coins would make Ripple outdated. Other popular coins I have less interest on are NEM, Polkadot and Shib. Solana too seems overhyped.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}