{
  "id": "topic_5461248",
  "title": "pawel7777",
  "author": "pawel7777",
  "created_time": "July 27, 2023, 09:09:32 PM",
  "content": "https://www.forbes.com/sites/siladityaray/2023/07/27/doj-will-not-pursue-campaign-finance-charge-against-sam-bankman-fried/https://www.dailymail.co.uk/news/article-12345699/Ex-FTX-boss-Sam-Bankman-Fried-federal-charges-90M-donations-Dems-woke-causes.htmlhttps://cointelegraph.com/news/sam-bankman-fried-campaign-contribution-charge-dropped-by-prosecutorsThe thread title says it all, Sam Bank-Fried has had the campaign finance violation charge dropped (donating ~$90m to the Democratic party). I haven't been following his case too closely, but apparently it was one of the 8 charges present in the DOJ’s original indictment.The reason for this is said to be the treaty obligations to the Bahamas. Under the terms of the extradition, any additional charges (made after his initial arrest) would have to be approved by the Bahamas.Daily Mail also reports that he had five other charges dropped in June (I don't know any details of that though). If this trend continues, he'll be free in no time.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5461248",
  "comments": [
    {
      "author": "nelson4lov",
      "created_time": "July 27, 2023, 09:49:44 PM",
      "body": "Quote from: pawel7777 on July 27, 2023, 09:09:32 PM~ Snipped If this trend continues, he'll be free in no time.It's really convenient that they dropped charges that involves being the government being a beneficiary of the FTX cake. For someone that donated that much amount to the democratic party, he should be very much be prosecuted for that charge but nothing else to do since the charge has already been dropped. If SBF is set free despite his crimes, it would be overall bad for crypto since it just means that anyone can take that as a cue to create a bigger mess in the future.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BenCodie",
      "created_time": "July 27, 2023, 09:54:23 PMLast edit: July 27, 2023, 10:08:15 PM by BenCodie",
      "body": "A pawn in the game. His Stanford parents and their rich friends probably briefed him before he launched FTX, and now all of what they planned for SBF is coming to fruition. That is why he has had that disgusting grin on his face from the beginning of the collapse, he knows he'll be fine, mommy and daddy and their powerful friends have him covered. With the campaign donations to the party in power, it only validates the theory more, and protects him more too.How this is all being overlooked (in terms of family connection and network) is beyond me. We all want to pin the tail on the donkey but no one is looking or talking about the demons surrounding it - either by choice from fear, or by ignorance.Does anyone else believe that market manipulation should be a charge too? It seems that everyone is overlooking the fact that even if FTX comes back and refunds everyone, they still caused hundreds of millions/billions worth of liquidations that otherwise may not have happened if FTX did not artificially pump and dump the market. Can't believe this shit is still happening in 2023. While Ulbricht sits in jail, this guy who is 1000x worse will potentially roam free.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pawel7777",
      "created_time": "July 27, 2023, 10:07:01 PM",
      "body": "Quote from: nelson4lov on July 27, 2023, 09:49:44 PMIt's really convenient that they dropped charges that involves being the government being a beneficiary of the FTX cake. For someone that donated that much amount to the democratic party, he should be very much be prosecuted for that charge but nothing else to do since the charge has already been dropped. If SBF is set free despite his crimes, it would be overall bad for crypto since it just means that anyone can take that as a cue to create a bigger mess in the future.I wonder what the implications could be for the Dems if that funding was proven to be illicit (i.e. made from the stolen clients' funds). Would they be required to pay it back (or whatever remained out of it)?But it's easier just to drop it and blame it on the Bahamas. Although, with all that money and connections, I don't think it would be a very hard task to either bribe, blackmail, or intimidate Bahamian officials to make them obey SBF or his string pullers.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EFS",
      "created_time": "July 27, 2023, 10:38:36 PM",
      "body": "After such a large donation, it cannot be expected that he will be detained for longer. The American law system is very interesting indeed. They define themselves as the most democratic country and you can be guilty or innocent according to your money. What a free country. That's not about Dems vs. Reps either. On the other hand, it looks like DPR will stay inside until he dies. It's okay to scam people if you have strong connections, that's sad.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bbc.reporter",
      "created_time": "July 28, 2023, 03:35:07 AM",
      "body": "@EFS. Also, everyone should be asking how much of this $90 million in donations were made using stolen money from FTX's customers hehehe.In any case, I do not care about these reasons why a federal case is being dropped, however, this action makes the speculation that Sam Bankman-Fried has become the government's informant much more persuasive.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "July 28, 2023, 04:24:47 AMLast edit: July 28, 2023, 04:39:26 AM by franky1",
      "body": "FTX also donated to the REP.. so if charged both political sides need to give the money back from both sides of the political line. which they both dont want so they dropped it obviously. in other newsSBF breached (possibly) bail conditions. which in the next several days means he has to see if he ends up jailed until trialQuoteAssistant U.S. Attorney Danielle Sassoon said Bankman-Fried should be jailed because he gave The New York Times some personal correspondence by Caroline Ellison. She was the CEO of Alameda Research, a cryptocurrency trading hedge fund that was an offshoot of FTX.“Having contact with the press alone isn’t witness-tampering” or grounds for revoking bail, Sassoon said. But, she said, by setting out to tarnish Ellison in an international publication read by many potential jurors in the New York-based case, Bankman-Fried “crossed a line toward inappropriately influencing jurors, intimidating that witness and sending a message to other prospective jurors.”Earlier this year, Kaplan(judge) suggested he might jail Bankman-Fried after prosecutors complained that he found ways to get around the restrictions on his electronic communications.In February, prosecutors said he might have tried to influence a witness when he sent an encrypted message in January over a texting app to a top FTX lawyer, saying he “would really love to reconnect and see if there’s a way for us to have a constructive relationship, use each other as resources when possible, or at least vet things with each other.”At a February hearing, the judge said prosecutors described conduct by Bankman-Fried after his arrest “that suggests to me that maybe he has committed or attempted to commit a federal felony while on release.”alsoQuote from: pawel7777 on July 27, 2023, 09:09:32 PMDaily Mail also reports that he had five other charges dropped in June (I don't know any details of that though). If this trend continues, he'll be free in no time.actually SBF TRIED to get several charges dropped in june (11 of the 13 charges filed last year), but the judge declined that challengehttps://www.reuters.com/legal/bankman-fried-loses-bid-toss-criminal-charges-over-ftxs-collapse-2023-06-27/the 5 charges are a different group of charges(done after extradition) separate to the 8 charges that the US filed last year. which the 5 charges needed bahamas government agreement..if agreed it would have become 13 charges... 12ll more then 10. but instead those 5 newer charges were dropped from the october trial but can become a new trial in 2024so he is still liable to over 10 charges... (if we go by medias maths and descriptors of events) just not all happening in october 2023 trial",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wapfika",
      "created_time": "July 28, 2023, 04:30:24 AM",
      "body": "Quote from: bbc.reporter on July 28, 2023, 03:35:07 AM Also, everyone should be asking how much of this $90 million in donations were made using stolen money from FTX's customers hehehe.I think that time crypto is booming which means most of their money comes from the profit of exchange while their reserves value is increasing due to the increased of crypto price. Most of the customers funds is now on SBF hardware wallet and those funds invested on different crypto projects since FTX has billion dollars valuation before they crash after CZ attack them.Quote from: bbc.reporter on July 28, 2023, 03:35:07 AM In any case, I do not care about these reasons why a federal case is being dropped, however, this action makes the speculation that Sam Bankman-Fried has become the government's informant much more persuasive.This information is already established after some info leaked about his connections.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "davis196",
      "created_time": "July 28, 2023, 04:50:17 AM",
      "body": "QuoteThe reason for this is said to be the treaty obligations to the Bahamas. Under the terms of the extradition, any additional charges (made after his initial arrest) would have to be approved by the Bahamas.Daily Mail also reports that he had five other charges dropped in June (I don't know any details of that though). If this trend continues, he'll be free in no time.Those are some weird treaty obligations.  I guess that Sam Bankman-Fried has connections with the establishment in the Bahamas, so they will cover his back and refuse to approve any additional charges. I guess that there might be some sort of settlement between SBF and the prosecution, so that SBF will have to pay a big amount back to the FTX investors in exchange of not going to jail. Donating money to a political party isn't such a big crime(even though it violates the law). Stealing money from your investors is the biggest crime here and I don't believe that SBF will get away without any consequences.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gyfts",
      "created_time": "July 28, 2023, 10:28:25 AMLast edit: July 29, 2023, 09:38:52 AM by Gyfts",
      "body": "The U.S. DoJ will usually overcharge defendants to coerce them to accept a plea deal, or it's part of a strategy to throw everything at them and hoping most of the charges stick at trial (95% conviction rate for the feds, so it's a strategy that works). Depending on legal counsel, they can get some of those charges dropped prior to trial due to improper application of law if the judge is willing to rule on the issue (other times it's taken to trial and the jury decides). Assume that SBF has the best legal counsel money can buy.In this particular case, Merrick Garland's DoJ would never pursue charges related to political contributions because it would be an indictment on democrats accepting bribes. None of these donations implicate criminality on behalf of the receiver, it just makes them look bad.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Alpha Marine",
      "created_time": "July 28, 2023, 10:31:02 PM",
      "body": "Quote from: EFS on July 27, 2023, 10:38:36 PMAfter such a large donation, it cannot be expected that he will be detained for longer. The American law system is very interesting indeed. They define themselves as the most democratic country and you can be guilty or innocent according to your money. What a free country. That's not about Dems vs. Reps either. On the other hand, it looks like DPR will stay inside until he dies. It's okay to scam people if you have strong connections, that's sad.This is common in every country of the world, not just the U.S. You're only guilty where your money and connections stop. So if your money goes all the way then you might always walk free. Maybe a few times you might lose minor cases that will require you to pay a fine or something, but when it's a case where you'll do time, the rich and powerful mostly win. Someone made a topic a while ago, something like \"Is justice blind\". Well, there goes your answer. Justice ain't blind at all.No matter how a country advertises itself to be a democratic country, the rich always win.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blockman",
      "created_time": "July 29, 2023, 11:33:02 AM",
      "body": "We have this discussion in our local thread and it's disappointing to see that it's very likely that he'll have no jail time soon because of how he funded these politicians with people's money. A sad potential moment for those that have been a victim of this FTX fiasco. While this guy can go free and lone everywhere where he wants to go after those charges will be dropped against him. Is there any other court that will have no benefit from these people that have been giving them a favor and are for the favor of the people and its victims? And potentially when Sam and the other that's involved with this issue could just rinse and repeat the process and will just hide under someone's name trying to build a new scam exchange or project that they will work on.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OgNasty",
      "created_time": "July 30, 2023, 08:35:59 PM",
      "body": "This is the way the world works now. Liberal politicians will do any corrupt thing they can to gain influence and power. Of course they weren’t going to prosecute someone for paying their bribery fees. In fact, this in itself shows you exactly what he was paying for with those donations. Corruption right out in the open and even though he stole billions from people, they’ll still deny the facts and think this is fair. Had he donated a dollar to Trump I promise you he’d be in a gulag right now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}