{
  "id": "topic_5408976",
  "title": "raslimali",
  "author": "raslimali",
  "created_time": "August 07, 2022, 08:34:05 AM",
  "content": "Hi everyone. There is this coin named Advanced Bitcoin (aBTC). I was primarily once involved in their airdrop but stoped due to lack of information about their authenticity. Has anyone traded this token?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5408976",
  "comments": [
    {
      "author": "raslimali",
      "created_time": "August 07, 2022, 08:44:26 AM",
      "body": "I am wondering that there isnt even a thread about it here",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "raslimali",
      "created_time": "August 07, 2022, 08:48:46 AM",
      "body": "https://bscscan.com/token/0x12A7a976FC10779773631C51733Ce7081aE0A0D7That is the contract address",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bittick",
      "created_time": "August 07, 2022, 09:06:37 AM",
      "body": "So have you received something from the airdrop? I saw that if this token is having a very small liquidity for now. https://www.dextools.io/app/bnb/pair-explorer/0x59dc07dd84006792d3536667331882e72686df5aThe possible thing if this is another meme token / scam token (potentially) created by someone. The liquidity was small caused by if the creator only puts small amounts money to lure people to connect their wallet. You must be careful if there are dusting attack but if you wanna to sell it and just us the new wallet that didn't connect with your primary wallet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "raslimali",
      "created_time": "August 08, 2022, 04:19:45 AM",
      "body": "Quote from: bittick on August 07, 2022, 09:06:37 AMSo have you received something from the airdrop? I saw that if this token is having a very small liquidity for now. https://www.dextools.io/app/bnb/pair-explorer/0x59dc07dd84006792d3536667331882e72686df5aThe possible thing if this is another meme token / scam token (potentially) created by someone. The liquidity was small caused by if the creator only puts small amounts money to lure people to connect their wallet. You must be careful if there are dusting attack but if you wanna to sell it and just us the new wallet that didn't connect with your primary wallet. Yes i received some tokens",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackBaron",
      "created_time": "August 08, 2022, 04:43:52 AM",
      "body": "Quote from: raslimali on August 07, 2022, 08:34:05 AMHi everyone. There is this coin named Advanced Bitcoin (aBTC). I was primarily once involved in their airdrop but stoped due to lack of information about their authenticity. Has anyone traded this token?  Lately I've found a lot on social media and telegram or email various types of Airdrops that are strange to me such as mwBTC, eBTC, wBTC, nBTC, sWBTC and many others, so be careful of any form of airdrop that has no clarity.I didn't find anything about Advanced Bitcoin, it seems it's a scam that needs to be avoided.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hd49728",
      "created_time": "August 08, 2022, 06:48:51 AM",
      "body": "If you want to own (buy for your investment) or trade (buy for trading and hunting profit), you should buy the real Bitcoin. Don't fall into any token that claims to represent Bitcoin. They are not real Bitcoin and if the projects, companies behind these tokens have issues with their treasuries, governments, regulations, these tokens will lose values, depegged and you will not be able to exchange 1 token to get 1 Bitcoin.Trade or invest with Bitcoin and say no with others, tokens or Bitcoin forks.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "YellowSwap",
      "created_time": "August 08, 2022, 06:54:31 AM",
      "body": "Never heard of aBTC before, if you get this for free maybe through airdrop pls do not try to sell, the sender is trying to lure you and you will end up losing your private key or money, you will be asked to connect your wallet to a strange platform, that's when all hell will break loose.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "asriloni",
      "created_time": "August 08, 2022, 09:32:03 AM",
      "body": "This is fake bitcoin. The price getting manipulated by its own creator. As you can see that the price of abtc was even higher compared with the real bitcoin. that to lures you to connect your wallet. It can be called as a spam token. There's an intention from the creators by giving you free tokens like that. It's a very risky to connect your wallet. Just keep it sitting in your wallet and don't do anything with it. It's a fake bitcoin. Money will be rarely coming for free.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bakasabo",
      "created_time": "August 08, 2022, 11:42:37 AM",
      "body": "If it is not a scam, then it definitely not worth spending time. There is only one, true Bitcoin. aBTC is just another Bitcoin copycat, that wants to get attention by using sound name. Just like all the altcoin, which you find when typing \"Bitcoin\" on coinmarketcap. They are all created to drawn users money into greedy creators pocket.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitkanu",
      "created_time": "August 08, 2022, 01:42:38 PM",
      "body": "I have heard so many bitcoin token created by various people were being sent to the so many unknown address. You must be careful when receive any random airdrop like that. In my opinion even if that's traded on exchange site and it doesn't mean it was a legit airdrop. So many people getting fooled by scammers through various scam airdrop that people thought that was a legit airdrop.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Doell",
      "created_time": "August 08, 2022, 03:33:57 PM",
      "body": "Quote from: asriloni on August 08, 2022, 09:32:03 AMThis is fake bitcoin. The price getting manipulated by its own creator. As you can see that the price of abtc was even higher compared with the real bitcoin. that to lures you to connect your wallet. It can be called as a spam token. There's an intention from the creators by giving you free tokens like that. It's a very risky to connect your wallet. Just keep it sitting in your wallet and don't do anything with it. It's a fake bitcoin. Money will be rarely coming for free. You are right, even there isn't a buy order in some of that token markets, developers only manipulate prices to trap investors. I see their twitter accounts token abtc at there are a lot followers and I am surprised, why there are still people who consider crypto as a scheme to get rich quickly, so that trusting that kind of shit token will clearly trap only for them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PaulBf1",
      "created_time": "August 08, 2022, 03:38:56 PM",
      "body": "It's just another shit token created to get as many people in as possible before the creator dumping everything and leaving for good. There is a famous rule created by yours truly that you should abide by, if a new token has \"btc\" added to its name then it's probably (most likely) a scam.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blockman",
      "created_time": "August 08, 2022, 03:52:11 PM",
      "body": "Don't be too overjoyed when there are airdrops like this. And most projects that put BTC on their project names mostly end up in a bad fate. Because they're all copycats of BTC and these developers won't do good to those gullible people that would like to have that positive thought that these airdrops are really free money. Well, it's also now being used by scammers and developers that would just like to see pump and dump as it's easy to create tokens these days.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MarjorieZimmermanGinger",
      "created_time": "August 08, 2022, 04:26:06 PM",
      "body": "Quote from: raslimali on August 07, 2022, 08:34:05 AMHi everyone. There is this coin named Advanced Bitcoin (aBTC). I was primarily once involved in their airdrop but stoped due to lack of information about their authenticity. Has anyone traded this token?  So far I haven't seen the coin and have never been involved at all, so you have to be careful to start taking part in it, but if you only receive from Airdrop it's not a problem, this Token has quite a little Liquidity, maybe just to find people, to connect directly to their wallets, but next we need to check further, in order to make sure it's correct, I suggest to be careful starting to take part in this kind of token",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coinerer",
      "created_time": "August 08, 2022, 05:01:30 PM",
      "body": "Quote from: raslimali on August 07, 2022, 08:34:05 AMHi everyone. There is this coin named Advanced Bitcoin (aBTC). I was primarily once involved in their airdrop but stoped due to lack of information about their authenticity. Has anyone traded this token?  There are many scammer creating new token and send to everyone wallet as drop and many time they arrange airdrop too and give token free .is is there another way to attract people to that token and scam a big fund. so please be carefull from that scamming",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tvplus006",
      "created_time": "August 08, 2022, 07:40:04 PM",
      "body": "Quote from: raslimali on August 08, 2022, 04:19:45 AMYes i received some tokensIf you received this coin as an airdrop, then you should not hold aBTC, but should try to sell them on poocoin.app or pancakeswap.finance. And if you manage to swap, then you will be able to buy some real bitcoin for the money you receive.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "wallet4bitcoin",
      "created_time": "August 08, 2022, 07:58:13 PM",
      "body": "1st time I am hearing about this token. And the liquidity is only 8 BNB, is it reliable? Where the token value is $40k.If you get it from airdrop, I recommend selling. I've seen some tokens don't allow contract transactions, I'm not sure if this is one of these.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TimeTeller",
      "created_time": "August 08, 2022, 08:01:37 PM",
      "body": "Quote from: wallet4bitcoin on August 08, 2022, 07:58:13 PM1st time I am hearing about this token. And the liquidity is only 8 BNB, is it reliable? Where the token value is $40k.If you get it from airdrop, I recommend selling. I've seen some tokens don't allow contract transactions, I'm not sure if this is one of these. Sell it fast while you can. This type of token trying to use the name of btc will not survive long.Even known forked BTCs are slowly losing their market value because there is no reason for them to exist.And now, an unheard project attaching btc to its name, high likely that it is a scam or crap project.If you have via airdrop, better sell and never look back. You will understand later on.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "serjent05",
      "created_time": "August 08, 2022, 08:08:25 PM",
      "body": "Quote from: wallet4bitcoin on August 08, 2022, 07:58:13 PM1st time I am hearing about this token. And the liquidity is only 8 BNB, is it reliable? Where the token value is $40k.If you get it from airdrop, I recommend selling. I've seen some tokens don't allow contract transactions, I'm not sure if this is one of these. Same here, there are lots of shit tokens being distributed as an airdrop mostly on BSC network, and worst some of them can be used for dust attacks.  Be careful in accessing tokens in your wallet.  Access only those tokens that you verified to be safe.   If you are not careful, you might find all the tokens that have value in your wallet swiped.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}