{
  "id": "topic_5450335",
  "title": "Prestongold",
  "author": "Prestongold",
  "created_time": "April 27, 2023, 07:07:37 AM",
  "content": "From my experience and observations, I noticed both Bitcoin mixing and online gambling using Bitcoin are mostly regarded as bad actors in Bitcoin despite both being the highest Bitcoin adopters and having the largest Bitcoin volume in transactions and services.Secondly, if Gambling and Bitcoin mixing services are called bad actors, what about centralized exchanges are they also perceived as bad actors in Bitcoin?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5450335",
  "comments": [
    {
      "author": "SamReomo",
      "created_time": "April 27, 2023, 07:31:14 AM",
      "body": "Quote from: Prestongold on April 27, 2023, 07:07:37 AMFrom my experience and observations, I noticed both Bitcoin mixing and online gambling using Bitcoin are mostly regarded as bad actors in Bitcoin despite both being the highest Bitcoin adopters and having the largest Bitcoin volume in transactions and services.Secondly, if Gambling and Bitcoin mixing services are called bad actors, what about centralized exchanges are they also perceived as bad actors in Bitcoin?I don't think that mixing falls into the category of bad actors in Bitcoin world. They are doing a great job for cleaning our of bitcoins and are increasing the privacy. The use case might make somewhat fall into the category of bad actors, however that doesn't makes them bad actor.Gambling has always been called as a bad actor for the society either in Bitcoin world or in fiat world. The Gambling has caused some trouble for those drunkards who plays without any control over their emotions and lose everything in the game. Other than that general point of view the gambling in Bitcoin is also as harmless as other forms of gambling, but it depends on the one who is gambling.Centralized exchanges are the best actors, calling them as bad actors is an insult to the whole crypto-community. It's because of those centralized exchanges that many new users have been able to start crypto trading. Those centralized exchanges are user-friendly and they are easy to work with for beginners. They offer so good service to the users and thus as a result the crypto users are getting hinger in number.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "YUriy1991",
      "created_time": "April 27, 2023, 07:58:11 AM",
      "body": "I think The reason why the mixing of Bitcoin and online gambling is often called bad actors in Bitcoin is because of the presumption that it is related to illegal activities such as money laundering and other illicit transactions. Additionally, Bitcoin's anonymity and decentralization make it an attractive option for those involved in such activities. However, it is important to note that not all Bitcoin mixing services and online gambling are inherently bad, and many legitimate businesses operate in the industry and provide value to their users and As for centralized exchanges, they face scrutiny for example for issues like security breaches, market manipulation, and lack of transparency but it is also undeniable that they also play an important role in the Bitcoin ecosystem by providing liquidity and facilitating the buying and selling of cryptocurrencies.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "April 27, 2023, 08:01:56 AM",
      "body": "different things for different reasonsgambling is trying to get wealthy via high riskpeople entering bitcoin can do wiser things to increase their wealth. by hoarding bitcoin. but to then hand bitcoin to a service who in most cases has algos where \"the house always wins\" is not wealth creating. its the DREAM or the pursuit or the fantasy of wealth creating. where in over half of cases people lose. yep for each winner must be a loser. and the higher the multiplier win reward of gambling is, means the more losers are needed to fund the winner. bitcoin is different. bitcoins risk management is different. avoid putting funds into third parties promising richesi can guarantee you no one went from rags to lambos via gambling..mixing is a fake promise made by criminals desparate to grab innocent peoples funds and palm off criminal gains on those innocent people. leaving the innocent people holding the bag of red flags that make services suspicious. mixing DOES put people onto watch lists. its in regulations in services own polices. its not something you should ignore even though the criminals think its not a thing. all they care about is recruiting innocent people to hand over funds. they dont care about the innocent people after handing them ill gotten gains. ..cex's if regulated will pass on details if you are flagged for suspicious behaviours. this means if you stay clean \"government\" wont know about you. however CEx and any service can and does sell your information to other businesses, so read their policies to see what they do with your data. and if you dont like the terms. dont use them. especially the ones that mention things like \"we can close your account for any reason without warning\"",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kryptqnick",
      "created_time": "April 27, 2023, 08:11:07 AM",
      "body": "To me, Bitcoin gambling is largely neutral, as it's just another form of human entertainment, and I enjoy using BTC for occasional gambling and sports betting myself. It's indeed a good use case for Bitcoin, where it's treated as a currency rather than just as an investment. But mixing is another thing entirely, as it's not really a field in which Bitcoin is used. Instead, it's a tool used for Bitcoin, to make it 'clean', untraceable. The concept itself is very much like money laundering, which is why mixers are justifiably treated as 'bad actors, I believe, even though some may use them just for privacy reasons.As for centralized exchanges, they can be legitimate businesses (like Binance) or something very risky and waiting to perform an exit scam. So exchanges are neutral actors.Truly positive cases of using Bitcoin are when it's used for charities, for good causes.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BIT-BENDER",
      "created_time": "April 27, 2023, 08:17:24 AM",
      "body": "You have a great point. But I would try to break it down for you the best way I can.#Bitcoin gambling and bitcoin mixing: this are considered bad by people because of morals, this isn’t a concrete view because morals differs, gambling isn’t illegal (atleast in many countries) and people has different motive for using Bitcoin mixing higher reason is to protect their privacy (anonymous). Honestly if no one is hurt or any one funds stolen then there is nothing bad using any of the two.#Centralized Exchanges: every strong bitcoin enthusiast would know that centralized exchange goes against the value of crypto-currency which is decentralization, there are dangers and live examples is the bankruptcy of FTX where many lost their funds, attacks on Trust Wallet where over $100,000 was stolen. Centralized exchange doesn’t give you that autonomy even over your own funds which is bad.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Crypt0Gore",
      "created_time": "April 27, 2023, 08:21:09 AM",
      "body": "Did you say online gambling using Bitcoin? As if Bitcoin is the only currency you can use to gamble online, how about USD? If Bitcoin is bad because of gambling so is Fiat, and others, many people don't like gambling because the risk is the highest, it's on the same level with HYIP if you are familiar with it, gambling is gambling and most people don't like it, this has nothing to do with Bitcoin, some gamblers prefer to use Bitcoin as the currency for gambling if no casino is accepting Bitcoin no one will use Bitcoin for gambling. Bitcoin mixers are for covering tracks when moving your Bitcoin but the government doesn't like this, they believe that bad actors, criminals, and drug dealers will be using mixers to move illegal funds around the globe and the money will be untraceable. Mixers became a thing after Bitcoin was launched, bitcoin isn't to be blamed for this, mixer stands alone and gambling stands alone, if you don't like them then stay away, I have never used mixers for once because I don't need them but I do gamble responsibly, many people can't control their greed, such people should not get involved with gambling.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oshosondy",
      "created_time": "April 27, 2023, 08:48:13 AM",
      "body": "Quote from: Prestongold on April 27, 2023, 07:07:37 AMFrom my experience and observations, I noticed both Bitcoin mixing and online gambling using Bitcoin are mostly regarded as bad actors in Bitcoin despite both being the highest Bitcoin adopters and having the largest Bitcoin volume in transactions and services.Secondly, if Gambling and Bitcoin mixing services are called bad actors, what about centralized exchanges are they also perceived as bad actors in Bitcoin?Do not mind the rubbish.Gambling is not illegal, but you can see Muslims or some people that detest gambling because of their religion to call it illegal with passion. Some people are not also using mixers only what they know is that mixers are used by bad actors, they do not know that banks and centralized exchanges too are used by some bad actors.Let me answer your question. Assuming I am into internet fraud, I scammed a white woman using western union or money gram, I successfully scammed the woman without trace. I can decide to use exchanges. There are some scammers that have been linked to exchanges. Not only that, there are some scammers that are using exchanges too to do their work, not all scam transactions can be known or investigated.Life is scam if you can not avoid scam.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Eternad",
      "created_time": "April 27, 2023, 08:54:30 AM",
      "body": "Quote from: SamReomo on April 27, 2023, 07:31:14 AMI don't think that mixing falls into the category of bad actors in Bitcoin world. They are doing a great job for cleaning our of bitcoins and are increasing the privacy. The use case might make somewhat fall into the category of bad actors, however that doesn't makes them bad actor.By bad actor terms means its a services often use by criminals to commit crime such as money laundering. It’s not literally the bad guy that committing the crime. Mixing and Online Gambling is commonly use for mixing purposes to commit money laundering because they offer an easy way to create privacy on someone coin especially if it was obtained through illegal activity.Mixer and Gambling is not a bad services. Actually, It’s the industry that gives volume huge volume on Bitcoin. The problem are those bad people that using it to commit the crime which they can’t regulate because they promised privacy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CreativeCat",
      "created_time": "April 27, 2023, 09:38:40 AM",
      "body": "Gambling and mixing services are often labeled as \"bad actors\" within the Bitcoin community due to several reasons. Firstly, gambling using Bitcoin raises concerns about the integrity and transparency of the platforms involved. Unregulated gambling sites can be prone to fraud, unfair practices, and lack of player protection. Additionally, the anonymity provided by Bitcoin can attract illicit activities and money laundering.Bitcoin mixing, on the other hand, is perceived negatively because it allows users to obscure the transaction history and break the traceability of funds. While privacy is an important aspect of cryptocurrencies, mixing services can be exploited for illegal purposes, such as hiding the source of illicitly obtained funds or evading taxes.These negative perceptions are not unfounded, as there have been instances of scams, fraud, and criminal activities associated with both gambling and mixing services. However, it's crucial to note that not all gambling platforms or mixing services are inherently bad. Regulated and licensed gambling operators and responsible mixing services exist, emphasizing transparency, fairness, and compliance with legal requirements.Ultimately, the goal should be to promote responsible and secure use of Bitcoin, ensuring that gambling and mixing services operate within a regulated framework that safeguards users and prevents illicit activities.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kgdktac",
      "created_time": "April 27, 2023, 09:41:54 AM",
      "body": "I think it has to do with the connotation attached to gambling and gambling addiction plus Money laundering etc.   Bitcoin mixing and online gambling are often associated with illegal activities such as money laundering and gambling addiction, which is why they have a negative connotation in the Bitcoin community, even though not all Bitcoin mixing and online gambling services are used for illegal purposes.As for exchanges, exchanges are not inherently considered bad actors in the Bitcoin community. though there have been instances of centralized exchanges being hacked or engaging in fraudulent activities, which has led to the loss of user funds. but inherently not considered bad actors. thanks",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ludmilla_rose1995",
      "created_time": "April 27, 2023, 09:57:47 AM",
      "body": "why is CEX considered a bad actor in Bitcoin? it is precisely because of CEX that crypto adoption is easier and crypto trading is more secure. even though there are several cases where CEX went bankrupt or took the money away, this is only natural, because that is the negative thing about CEX, but that doesn't make CEX a bad actor in Bitcoin, we have to see it in full, because there are still many other CEX platforms that run their services well.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kakmakr",
      "created_time": "April 27, 2023, 10:06:11 AM",
      "body": "Bitcoin's enemies will target any controversial link between Bitcoin and any activity that might be linked to crime. They know that not all gambling operations are bad actors, but the concentrate on the ones that are, because it suits their agenda. The same goes for \"Mixer\" services.... not everyone that use mixer services ..are criminals. I use mixer services to break the link between my main hoard of bitcoins and the other wallets that I use to protect myself.... not for criminal reasons.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Solosanz",
      "created_time": "April 27, 2023, 10:12:42 AM",
      "body": "Gambling source is included in high risk money because not all countries are allow to gamble and some people who live in restricted jurisdiction can gamble as long as the casino doesn't restrict their jurisdiction. They also can use VPN despite their internet provider blocking the casino domain, usually the casino will ask to verify KYC to make sure the gambler not lying.Mixing source is included in high risk because the government don't like privacy and want to control or monitor everything.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "goldkingcoiner",
      "created_time": "April 27, 2023, 10:20:43 AM",
      "body": "Quote from: Prestongold on April 27, 2023, 07:07:37 AMFrom my experience and observations, I noticed both Bitcoin mixing and online gambling using Bitcoin are mostly regarded as bad actors in Bitcoin despite both being the highest Bitcoin adopters and having the largest Bitcoin volume in transactions and services.Secondly, if Gambling and Bitcoin mixing services are called bad actors, what about centralized exchanges are they also perceived as bad actors in Bitcoin?Both services are, from the viewpoint of the government, bad actors because they make it so much harder to pin out the money launderers and other undesirables, as the government would view them...The Bitcoin community itself would not consider these services as bad actors unless they are scams. Ironically, unregistered/unlicensed gambling casinos as well as anonymous mixers can be considered shady because if they decide to scam their clients, there is nothing the clients can do since the services are out of the government's reach.If you were to ask me, I would consider the government itself a bad actor (too much incompetence and corruption in politics), but a necessary one to keep such services in check.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blockman",
      "created_time": "April 27, 2023, 10:34:29 AM",
      "body": "Quote from: Prestongold on April 27, 2023, 07:07:37 AMFrom my experience and observations, I noticed both Bitcoin mixing and online gambling using Bitcoin are mostly regarded as bad actors in Bitcoin despite both being the highest Bitcoin adopters and having the largest Bitcoin volume in transactions and services.Secondly, if Gambling and Bitcoin mixing services are called bad actors, what about centralized exchanges are they also perceived as bad actors in Bitcoin?They'll link to anything they want to just to give that bad impression for bitcoin. Look, they're already concluding that mixers and casinos are bad things but aren't they looking at the good side of it that it increases someone's privacy if he uses a mixer?Whilst in gambling, is there any different from it as someone does bitcoin gambling and those that are gambling in the traditional casinos? I don't think that there's that much difference on it as it's just someone who gambles bitcoin as the currency and someone goes to the casinos that gambles with fiat, they're bias and simply hate bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Stable090",
      "created_time": "April 27, 2023, 10:38:07 AM",
      "body": "Quote from: Prestongold on April 27, 2023, 07:07:37 AMFrom my experience and observations, I noticed both Bitcoin mixing and online gambling using Bitcoin are mostly regarded as bad actors in Bitcoin despite both being the highest Bitcoin adopters and having the largest Bitcoin volume in transactions and services.Secondly, if Gambling and Bitcoin mixing services are called bad actors, what about centralized exchanges are they also perceived as bad actors in Bitcoin?I don’t see anything bad in bitcoin mining and online gambling, the only reason why I think bitcoin mixer is tag as a bad actor is because they believe it’s used for illegal activities, they believe most stolen bitcoins is always sent to bitcoin mixer just to lose track of the bitcoin. Also they see online gambling as a bad actor because they believe it leads to gambling addiction. But most of them are wrong, not everyone that uses bitcoin mixer use it for illegal activities, some use it just for privacy sake and online casino those not leads to addiction, only if you choose to be addicted.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Die_empty",
      "created_time": "April 27, 2023, 10:56:24 AM",
      "body": "Quote from: Prestongold on April 27, 2023, 07:07:37 AMFrom my experience and observations, I noticed both Bitcoin mixing and online gambling using Bitcoin are mostly regarded as bad actors in Bitcoin despite both being the highest Bitcoin adopters and having the largest Bitcoin volume in transactions and services.Secondly, if Gambling and Bitcoin mixing services are called bad actors, what about centralized exchanges are they also perceived as bad actors in Bitcoin?Firstly we must recognize that Bitcoin can achieve its goals and objectives without gambling and mixers. Bitcoin is a currency that is used for transactions and investments. Both gambling and mixers are services that adopted bitcoin or affiliated themselves with the coin. We should also know that almost every good product or service can be misused by negative actors. Drugs are essential in the medical field but bad actors convert them to harmful substances. Guns are used for hunting and self-defense but criminals use them to commit atrocities. I can mention more examples. Using bitcoin for gambling is like using fiat for staking, it becomes a problem when it leads to addiction or is used for criminal activities like money laundering. Mixers are wonderful services that promote privacy and I am a fan because it suits my way of life. I have never been engaged in any criminal activity but I like the mixing services. But it doesn't need that criminal elements will not take advantage of this great product. And the use of this service by criminals doesn't make the service bad.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TravelMug",
      "created_time": "April 27, 2023, 11:01:39 AM",
      "body": "Quote from: Prestongold on April 27, 2023, 07:07:37 AMFrom my experience and observations, I noticed both Bitcoin mixing and online gambling using Bitcoin are mostly regarded as bad actors in Bitcoin despite both being the highest Bitcoin adopters and having the largest Bitcoin volume in transactions and services.Secondly, if Gambling and Bitcoin mixing services are called bad actors, what about centralized exchanges are they also perceived as bad actors in Bitcoin?Let's just be clear here, mixing is not that bad, perhaps there are bad actors (terrorists, drug dealers, hackers and others), that might take advantage of mixing services or tumblers. And that's where the whole notion that mixing service is really bad and just cater to this kind of individuals. However, I think majority are using mixing for their privacy and anonymity.As for crypto based gambling, I don't see wrong with it, gambling is the first use case of bitcoin for all we know.So that argument is very flaw in the beginning, maybe those who tell that mixing and gambling are bad are those who are anti-bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hyudien",
      "created_time": "April 27, 2023, 11:37:00 AM",
      "body": "Quote from: Prestongold on April 27, 2023, 07:07:37 AMFrom my experience and observations, I noticed both Bitcoin mixing and online gambling using Bitcoin are mostly regarded as bad actors in Bitcoin despite both being the highest Bitcoin adopters and having the largest Bitcoin volume in transactions and services.Secondly, if Gambling and Bitcoin mixing services are called bad actors, what about centralized exchanges are they also perceived as bad actors in Bitcoin?I want to clarify the question back to you, are Bitcoin actors or individuals themselves abusing the power of decentralization?Because basically it is impossible for us to generalize Bitcoin as a whole as the bad actor behind the ongoing action? have you ever heard of humanitarian donations in the form of Bitcoins? so we talk about actors, both individuals and specific groups. So it is difficult to find the background that a fully centralized exchange provides facilities or access to any crime. They have enforced KYC/AML, so neither CEX nor Bitcoin as an option can be assigned to any category of criminals , except users who must be prosecuted.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}