{
  "id": "topic_5420440",
  "title": "devil2man",
  "author": "devil2man",
  "created_time": "November 10, 2022, 09:32:32 PM",
  "content": "Can i mine ethw or etc for some profit with a vega 11 integrated into the amd ryzen 5 if yes can i overclock it? better settings?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5420440",
  "comments": [
    {
      "author": "batsonxl",
      "created_time": "November 11, 2022, 08:06:29 AM",
      "body": "No you cant mine that on onboard vga.but cpu can mine.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FP91G",
      "created_time": "November 11, 2022, 08:10:24 AM",
      "body": "Quote from: devil2man on November 10, 2022, 09:32:32 PMCan i mine ethw or etc for some profit with a vega 11 integrated into the amd ryzen 5 if yes can i overclock it? better settings?How did you come up with this? I really like your questions Integrated graphics in the central processor is very much inferior in performance to discrete graphics cards, because there are fewer cores and other computing modules.It is more profitable to buy RX 470 4 GB to get more profit.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sxemini",
      "created_time": "November 11, 2022, 12:49:25 PM",
      "body": "It is possible to mine with IGPU, but makes not much sense for you.For example - my old Amd 2400G give me 77mh on Radiant or around 50mh on Kaspa  and only need 5w more. Not much, but if you have 1 in every rig, it can give some extra money. But everyone must calculate by yourself.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pterosaur",
      "created_time": "November 11, 2022, 02:00:44 PM",
      "body": "I have a laptop with vega 11 igpu, I've never tried using the laptop for mining any crypto but my advice is if you want to do this make sure you choose the algorithms that are not too power hungry like KawPoW ( Ravencoin ). Mining Flux is way cooler on graphic cards compare to Ethereum Classic and other.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "devil2man",
      "created_time": "November 11, 2022, 04:03:18 PM",
      "body": "So it is not so convenient, there is little performance maybe i will try for a while with ravencoin, if instead i wanted to add a gpu to it what would you recommend between nvidia gtx 1650 and amd rx 580 they cost almost the same",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JayDDee",
      "created_time": "November 11, 2022, 04:54:10 PM",
      "body": "Four major problems with the idea. The most powerful iGPU is still much weaker than the smallest dGPU, iGPUs use the CPU's DDR memory not GDDR, miner devs don't care so the SW isn't optimised for iGPUs, like CPUs there is only one per system.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FP91G",
      "created_time": "November 12, 2022, 12:07:22 PM",
      "body": "Quote from: devil2man on November 11, 2022, 04:03:18 PMSo it is not so convenient, there is little performance maybe i will try for a while with ravencoin, if instead i wanted to add a gpu to it what would you recommend between nvidia gtx 1650 and amd rx 580 they cost almost the sameThe GTX 1650 has 4gb of ram, if you want graphics card with 4gb of ram you'd better get a rx470/570, they're very cheap.Another problem is to buy these video cards in good condition, because most of them are after mining.If you mine Ethereum forks, then for the next year, the performance of Rx 580 8 GB and Rx 470 4 GB and energy consumption will be the same.But these video cards should only be bought if you have very cheap or free electricity.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fmz89",
      "created_time": "February 02, 2023, 12:43:34 PM",
      "body": "Quote from: devil2man on November 10, 2022, 09:32:32 PMCan i mine ethw or etc for some profit with a vega 11 integrated into the amd ryzen 5 if yes can i overclock it? better settings?Vega 11 on igpu doesnt have vram, they only use from ram, which is not fast enough for mining, and wont be profitable, for testing and learning is ok, normal vega has hbm2 memory quite ton of bandwidth, fit for memory extensive algo like eth, progpow, autolyko2",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FP91G",
      "created_time": "February 03, 2023, 10:56:19 AM",
      "body": "Quote from: fmz89 on February 02, 2023, 12:43:34 PMQuote from: devil2man on November 10, 2022, 09:32:32 PMCan i mine ethw or etc for some profit with a vega 11 integrated into the amd ryzen 5 if yes can i overclock it? better settings?Vega 11 on igpu doesnt have vram, they only use from ram, which is not fast enough for mining, and wont be profitable, for testing and learning is ok, normal vega has hbm2 memory quite ton of bandwidth, fit for memory extensive algo like eth, progpow, autolyko2AMD Ryzen 5 is a regular budget processor with 12-16 threads, which is useless in mining. One processor will pay off for a very long time, and a computer with this processor will not pay off in mining. Devil2man asked funny questions, without him I'm very bored.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}