{
  "id": "topic_5416935",
  "title": "udayantha11",
  "author": "udayantha11",
  "created_time": "October 13, 2022, 04:06:41 AM",
  "content": "i have gone through some articles and i got confused on regarding some topics. Please explain it and it will be beneficial for new comers adopt the new knowledge.Question no 1 - what is the meaning of the  permissionless Layer 1 blockchain?Question no 2 -what is the meaning of open and fast layer-1 blockchain ?Question no 3 -scalable layer 1 blockchain?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5416935",
  "comments": [
    {
      "author": "vv181",
      "created_time": "October 13, 2022, 05:36:50 AM",
      "body": "It would be better if you also cite the article you have read since those terms could open up many terminologies, or simply just a buzzword.Generally speaking, you can adhere to layer 1 as a base layer. A base layer is the essential one because of the \"base\" or the foundation of the system. For example, Bitcoin, ETH, BNB, and SOL, can be categorized as layer 1.By permissionless, it means that in order to participate within the layer or even interact with it, there is no authority that filter who can or cannot access it, and there is no obligation of someone to prevent anyone to not interacting with the blockchain. The word open can be synonymously perceived with permissionless. Fast could mean it has a high TPS. And lastly, scalable could be simply interpreted as the layer able to be updated with scalability improvements.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "October 13, 2022, 06:10:25 AM",
      "body": "Quote from: vv181 on October 13, 2022, 05:36:50 AMIt would be better if you also cite the article you have read since those terms could open up many terminologies, or simply just a buzzword.Actually the answers to his question can simply be googled or look for close answer from the same topic since this is a just a description basis when it comes to explanation.Pertaining to scalable blockchain layer 1 it about how efficient the layer1 you are using. By means of scalable is a broad topic whereas some exhibit a huge difficulty when it comes to scalability.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}