{
  "id": "topic_5454843",
  "title": "stompix",
  "author": "stompix",
  "created_time": "June 02, 2023, 09:48:02 AM",
  "content": "Had to chop the title so it really sucks but I can't do better right now!  With everyone focused on the debt of the US, the freezing Europeans, yeah lol, there is some really bad news on the horizon and for all sides in this game. If a slowdown in the Western world could be explained by jumping energy prices last year, prices that have since gone down to 2013 levels when it comes to pipe gas, in China manufacturing is dropping right after the reopening, at a continuous pace and despite the downturn in both raw materials and energy prices, copper, coal, iron, steel, wheat, everything is sliding with the PMI alongside.So, to not be biased and using only the English version of the mouthpiece of the Chinese government:China’s factory activity growth falters in March due to weaker demand, slowing productionChina’s factory activity dipped in April on weak demand as bumpy post-Covid economic recovery continueChina’s official manufacturing purchasing managers’ index (PMI) fell to 48.8 in May from 49.2 in AprilAnd things get worse, remember this is Chinese information, so take it with a grain of salt since it might be far worse:QuoteYouth unemployment has become one of Beijing’s biggest economic headaches amid its recovery efforts, and in April, 20.4 per cent of China’s 16-24 age group were unemployed, up from 19.6 per cent in March.So no manufacturing so now jobs for the not qualified, no jobs for the young ones that have finished college, which is a different area, and this can lead only to one direction.If the economic slowdown is present everywhere, China and the Western World, manufacturing is affected on all continents there is only one culprit in sight, and that is demand destruction, and with this, there is a chance we might end in a deflation period if things don't change.There is simply no demand, and with no demand, there are two choices, prices going down, which means obvious deflation, or bankruptcies which I doubt anyone is that stupid to do before trying the first solution, but the first choice is pretty hard to do when you just had an influx of free money and the rate rises have not yet started to be serious enough.There is an interesting piece on this from Forbes:https://www.forbes.com/sites/greatspeculations/2023/05/13/more-proof-deflation-is-the-future/of course, it's just an opinion and I will from the start warn you it's a bit speculative even with the data presented but it ends with the same warning as many others on the incoming deflation, although their take on what to do and what next is really not my cup of tea.Now, slowly turning from this to Bitcoin.Bitcoin was mainly designed as a p2p way of exchanging and transmitting value, due to its limited supply it turned into a way of safekeeping your wealth and further down the line evolved into an investment!Now, assuming all the required stars align and we really head into a deflationary period for fiat currencies, how will the price of Bitcoin react, since this is the only thing that can be affected by the economy, the rest, the p2p payments, the cold storage, the be your own bank will for sure not be affected, but lately those are of less interest and the focus is on the price most of the time.For sure, Bitcoin has the required advantage to erase all fears, that is adoption, unlike other commodities it can still attract users, and since I don't really believe those hundreds of millions of users quoted by most sources right now I can safely bet in my mind an x10 adoption rate would be doable at any time from the current moment. But, the question is, will it happen in this short span with enough traction?So, to make this long story short, two simple opinions:- do you believe we're heading to deflation?- how do you think the price of BTC will be influenced if we do so?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5454843",
  "comments": [
    {
      "author": "DrBeer",
      "created_time": "June 02, 2023, 10:21:37 AM",
      "body": "Let's just say this is just the beginning. The problem with the Chinese economy is that it:1. At its core, it is based on the production of consumer goods. Then the truth was added high-tech \"toys\"2. Export-oriented3. Has hidden internal problems4. Doesn't adhere to \"international norms\"All this leads to:1. The domestic consumption market is falling, which means that production is declining. Further, you can write a lot more, but you yourself understand what chain of problems is starting2. External consumers, who brought strong currency to the treasury, also reduced the consumption of Chinese goods. And here is the most difficult. Firstly, the United States took the vector to:- stop supplying high-tech solutions to China- move high-tech production outside of China.- to the extent possible to recreate the production of high-tech products in their own country.And this is a huge and yet unsolvable problem for the Chinese economy. Who will replace more than 50% of exports? India? Russia ? Iran? Do they have dollars? What about technology? NO one or the other!So now we are seeing only the \"tip of the iceberg\", and within 2-3 years, if China does not come up with an extraordinary solution, we will actually see the decline of the \"Chinese miracle\".Yes, despite the fact that \"the second economy in the world\", \"the largest country\", \"the largest population\" and \"de-dollarization and the transition to the yuan\" ...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ucy",
      "created_time": "June 02, 2023, 10:57:10 AM",
      "body": "I think the inflationary pressure on most of the Fiat currencies will still outweigh whatever price reduction is recorded in commodities. And don't forget that the industries or attentions could move to least affected countries to fill up the demand gap. That could force China to take a different approach to keep their jobs and industries. Bitcoin is actually more deflationary, and it is new, unique and developing... with potential to attract users to other of its interesting features aside just the deflation. Notwithstanding, its deflationary feature will continue to be more attractive to users especially those trading on volatility",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "killerfrost",
      "created_time": "June 02, 2023, 11:16:27 AM",
      "body": "IMO, China reopening is a big step in increasing the acceptance of cryptocurrencies like Bitcoin. However, this is a lengthy process and there may be some setbacks along the way. In terms of deflation, Bitcoin has some advantages in that it works without central bank money printing and the remaining supply is limited. However, some experts say that the increase in the value of Bitcoin also contributes to the disruption of deflationary efforts.When investing in Bitcoin, you need to carefully consider and understand the risks and benefits of this currency. If you want to invest in Bitcoin or any other cryptocurrency, I suggest you do a thorough research on it before making a decision.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Aanuoluwatofunmi",
      "created_time": "June 02, 2023, 11:42:33 AM",
      "body": "Quote from: stompix on June 02, 2023, 09:48:02 AMAnd things get worse, remember this is Chinese information, so take it with a grain of salt since it might be far worse:QuoteYouth unemployment has become one of Beijing’s biggest economic headaches amid its recovery efforts, and in April, 20.4 per cent of China’s 16-24 age group were unemployed, up from 19.6 per cent in March.So no manufacturing so now jobs for the not qualified, no jobs for the young ones that have finished college, which is a different area, and this can lead only to one direction.If state capital like Beijing one of the major cities could be affected to this rate i wonder how other rural places will be so affected to an extent, the problem with China is it's over dependence on itself, in this life, there's no how we will not need the role or help of each other for survival at some point in time, but China undermined this and thinks it's self sustainable well enough with it internal economy Quote from: stompix on June 02, 2023, 09:48:02 AMThere is simply no demand, and with no demand, there are two choices, prices going down, which means obvious deflation, or bankruptcies which I doubt anyone is that stupid to do before trying the first solution, but the first choice is pretty hard to do when you just had an influx of free money and the rate rises have not yet started to be serious enough.I will personally preferred the deflationary consequences on the economy than having inflation which has been a consistent reoccurrence in most economic settings, but the issues with deflation is that the government got affected than in inflation where the people are the ones affected most, we cannot do without having the encounter of either of the two in a standard economy, but in place of China, if it has developed a racial economy ties with other countries in collaboration, the rate of this consequences would have been reduced oner going deflated.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zasad@",
      "created_time": "June 02, 2023, 12:24:56 PM",
      "body": "Now real inflation is XX% in the US and Europe, but since countries are constantly changing their calculation methods, it is less in the tables. In many countries, inflation is XXX%. To achieve deflation, governments need to stop printing money, which is impossible to do now. If the bankers reduce the amount of money in the economy, then this will be done in order for large companies to buy out smaller and medium-sized companies.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SamReomo",
      "created_time": "June 02, 2023, 02:10:28 PM",
      "body": "Quote from: stompix on June 02, 2023, 09:48:02 AMSo, to make this long story short, two simple opinions:- do you believe we're heading to deflation?- how do you think the price of BTC will be influenced if we do so?It's always the dream of the economies to move towards deflation, but the reality is quite different from a dream. In current situation I don't think that we are yet heading towards deflation and even I think that we might have to face another phase of huge inflation if things continue this way. The US economy might face huge challenges in coming months and as a result the inflation can vary in ranges. The situation isn't that bad in China and they still have good control over inflation in their country.I think the price of Bitcoin will be impacted in a good way because most of the investors will transition from fiat to Bitcoin and that will mostly cause an increase in its value. The adoption rate will increase in coming months and of course the halving event isn't that far away now and with that the value of a Bitcoin could be anywhere from $80k to $120k, and the investors who put money into it right now will have good ROI. I'm hoping that within 2 years the growth of users who will somehow transition to Bitcoin will increase drastically and the change will be really positive for the crypto-currency and its community.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "June 02, 2023, 07:52:19 PM",
      "body": "Quote from: Ucy on June 02, 2023, 10:57:10 AMI think the inflationary pressure on most of the Fiat currencies will still outweigh whatever price reduction is recorded in commodities. And don't forget that the industries or attentions could move to least affected countries to fill up the demand gap. You're mistaken things, industries will not move to other countries when there is no demand for their goods in the first place, neither local nor exports, industries move because of favorable locations and low wages and!! because of demand there. Not the other way around.Quote from: killerfrost on June 02, 2023, 11:16:27 AMIMO, China reopening is a big step in increasing the acceptance of cryptocurrencies like Bitcoin. Just as much as the gate to hell opening will mean a lot of devils will buy into Bitcoin! Seriously? China and Bitcoin?Quote from: Aanuoluwatofunmi on June 02, 2023, 11:42:33 AMI will personally preferred the deflationary consequences on the economy than having inflation which has been a consistent reoccurrence in most economic settings, but the issues with deflation is that the government got affected than in inflation where the people are the ones affected most, we cannot do without having the encounter of either of the two in a standard economy, but in place of China, if it has developed a racial economy ties with other countries in collaboration, the rate of this consequences would have been reduced oner going deflated. Deflation sounds good on paper, in reality, is a nightmare!You think only of your current wage and how much you can buy from it monthly but deflation will sap n t the value of all your assets, your house will be less, your assets will be less, your stocks will be less, and everything you own will be worth less than before.It might sound good if you live paycheck to paycheck but in reality, not even there it's all rosy!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "arallmuus",
      "created_time": "June 02, 2023, 09:19:27 PM",
      "body": "Quote from: DrBeer on June 02, 2023, 10:21:37 AMSo now we are seeing only the \"tip of the iceberg\", and within 2-3 years, if China does not come up with an extraordinary solution, we will actually see the decline of the \"Chinese miracle\".Yes, despite the fact that \"the second economy in the world\", \"the largest country\", \"the largest population\" and \"de-dollarization and the transition to the yuan\" ...China always come up with a solution although the solution might be abit on the extreme side. The difference that China has compared to western countries is that they dont really have to deal with massive debate over a solution as long as it served a good purposes on the country's economy issue because of the communism principleQuote from: SamReomo on June 02, 2023, 02:10:28 PMThe adoption rate will increase in coming months and of course the halving event isn't that far away now and with that the value of a Bitcoin could be anywhere from $80k to $120k,Gotta factor in the deflation as well so we could be lucky if we get to around 60k though",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hatshepsut93",
      "created_time": "June 02, 2023, 10:23:26 PM",
      "body": "Quote from: stompix on June 02, 2023, 09:48:02 AM- how do you think the price of BTC will be influenced if we do so?I don't think a lot of investors buy Bitcoin because they believe it will protect them from inflation, it's just a narrative for promoting Bitcoin. The actual reason is that people believe Bitcoin will be worth more in the future and they will dump it when it will happen, and with their action of investing in Bitcoin they turn it into a self-fullfilling prophecy. This is why we have these bull-bear cycles.Deflation could have some negative effect because people would be less genuinely interested in Bitcoin's anti-inflation, but we might not even notice this effect because it will get overshadowed by Bitcoin's bubbles.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Free Market Capitalist",
      "created_time": "June 03, 2023, 03:52:27 AM",
      "body": "Quote from: hatshepsut93 on June 02, 2023, 10:23:26 PMI don't think a lot of investors buy Bitcoin because they believe it will protect them from inflation, it's just a narrative for promoting Bitcoin. The actual reason is that people believe Bitcoin will be worth more in the future ...Here you contradict yourself. Buying things that will be worth more in the future is the way to hedge against inflation, as long as the percentage increase exceeds it.  In other words, if cumulative inflation over the next 4 years is 20%, the assets you have that equal or exceed that 20% in cumulative return have served to protect you from inflation.Quote from: stompix on June 02, 2023, 09:48:02 AM- do you believe we're heading to deflation?I do not dare to give a categorical answer, but I would say that brief periods of deflation are not all bad, they reduce the overheating of the market, which cannot live in a permanent bull.Since the 2008 crisis, there have been a couple of periods of deflation in Europe and, like everything else, the bad thing is that deflation is prolonged or very pronounced, but if it were to happen now we could see it, optimistically, as a prelude to the next bull market. Quote from: stompix on June 02, 2023, 09:48:02 AM- how do you think the price of BTC will be influenced if we do so?In the short term, anything can happen. In the medium and long term the price will tend to continue to rise, although I think less spectacularly than in previous cycles in percentage terms, and even if we are in deflation it would be expected that the printing presses will go back to full steam to try to stimulate the economy and much of that money will go into financial assets, including Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "huu78",
      "created_time": "June 03, 2023, 07:02:05 AM",
      "body": "Quote from: zasad@ on June 02, 2023, 12:24:56 PMNow real inflation is XX% in the US and Europe, but since countries are constantly changing their calculation methods, it is less in the tables. In many countries, inflation is XXX%. To achieve deflation, governments need to stop printing money, which is impossible to do now. If the bankers reduce the amount of money in the economy, then this will be done in order for large companies to buy out smaller and medium-sized companies.To address inflation or achieve deflation, governments and central banks typically use various monetary and fiscal policies. Reducing the money supply is one way to combat inflation, but it is a delicate process that requires careful consideration of the broader economic implications.but i think its impossible, because since the first government already have debt and its only just buying time until the number continues to grow.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bittraffic",
      "created_time": "June 03, 2023, 07:29:42 AM",
      "body": "I think its too early to say the market didn't change when the Hongkong start. Some are saying that it will need 6 months to see the effect in the market.They were cl armthat June 1 is just the start of reviewing international exchanges to be approved to operate. This is only in Hongkong though, I don't think Mainland people are already up buying every coins they see in the market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "killerfrost",
      "created_time": "June 03, 2023, 02:29:28 PM",
      "body": "Quote from: stompix on June 02, 2023, 07:52:19 PMQuote from: killerfrost on June 02, 2023, 11:16:27 AMIMO, China reopening is a big step in increasing the acceptance of cryptocurrencies like Bitcoin. Just as much as the gate to hell opening will mean a lot of devils will buy into Bitcoin! Seriously? China and Bitcoin?Thinking backwards a bit, what if they continue to oppose bitcoin? And this story turns positive or negative for the crypto market, what is happening is reflecting, I don't want to talk about news stories that validate the price line, but positive changes. for the crypto space is always well received and responded. There will be those who see this as an opportunity and there are also those who see the risks of the problem, but those are the things that always happen not only for the crypto market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "June 03, 2023, 02:47:28 PM",
      "body": "Quote from: killerfrost on June 03, 2023, 02:29:28 PMsnipDon't force yourself to write four mandatory lines if you don't have anything to say!Quote from: killerfrost on June 03, 2023, 02:29:28 PMThinking backwards a bit, what if they continue to oppose bitcoin? And this story turns positive or negative for the crypto marketIn what dimension could a continuous ban from China be a positive thing?Quote from: bittraffic on June 03, 2023, 07:29:42 AMI think its too early to say the market didn't change when the Hongkong start. Some are saying that it will need 6 months to see the effect in the market.This is not about HK it's not about their laws regarding Bitcoin but about the whole Chinese economy that is starting to suffer right after the most anticipated economic event in the last years, it's roar back from the lockdowns, which turned into prolonged suffering.HK laws or HK acceptance are a speck in the global economy if China's output drops further, it's like comparing 10 guys going to Salvador beach with the FED rising rates, two things different by orders or magnitude.Quote from: Poker Player on June 03, 2023, 03:52:27 AMQuote from: hatshepsut93 on June 02, 2023, 10:23:26 PMI don't think a lot of investors buy Bitcoin because they believe it will protect them from inflation, it's just a narrative for promoting Bitcoin. The actual reason is that people believe Bitcoin will be worth more in the future ...Here you contradict yourself. Buying things that will be worth more in the future is the way to hedge against inflation, as long as the percentage increase exceeds it.  In other words, if cumulative inflation over the next 4 years is 20%, the assets you have that equal or exceed that 20% in cumulative return have served to protect you from inflation.He can still be correct.A true hedge against inflation must work at every single moment, if inflation is 50% a year next year it must be worth 50% more, if inflation goes 30%,40%, or 50% it must follow this by at least the inflation rate to keep being a hedge against it because you need it at every single point in the future to preserve the value.A long time investment doesn't need to follow these steps, it can go down in value by 50% next month and can linger there for years, as long as in 4 years it goes 10x it has earned you profit even against inflation, but with a difference, it hasn't been able to do this for every single day. So if you're out of luck and you need money you're going to have to sell it at a loss before the spike, and that's not really protecting you from inflation one tiny bit.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Renampun",
      "created_time": "June 03, 2023, 05:03:56 PM",
      "body": "Quote from: stompix on June 02, 2023, 09:48:02 AM...- do you believe we're heading to deflation?i believe that we will lead to deflation, but of course the level of deflation for each country will be different, because it is related to their economic and foreign policies. even though in the future the deflation of a country, for example America, will have a domino effect on other countries, it will not have a significant effect on other countries, unless the country is completely dependent on America. so we're right into deflation, but it's not as scary as one might think.Quote from: stompix on June 02, 2023, 09:48:02 AM...- how do you think the price of BTC will be influenced if we do so?it depends, it can have a good impact on bitcoin or not. it will have a good impact if during the deflation, people short sell their stocks or bonds and transfer them to bitcoin to get better profits. or they will sell their bitcoins to be able to secure the value of their investment, which will have a negative impact on the price of bitcoins. all possibilities will happen, but i hope in the first possibility.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DrBeer",
      "created_time": "June 03, 2023, 09:11:45 PM",
      "body": "Quote from: arallmuus on June 02, 2023, 09:19:27 PMQuote from: DrBeer on June 02, 2023, 10:21:37 AMSo now we are seeing only the \"tip of the iceberg\", and within 2-3 years, if China does not come up with an extraordinary solution, we will actually see the decline of the \"Chinese miracle\".Yes, despite the fact that \"the second economy in the world\", \"the largest country\", \"the largest population\" and \"de-dollarization and the transition to the yuan\" ...China always come up with a solution although the solution might be abit on the extreme side. The difference that China has compared to western countries is that they dont really have to deal with massive debate over a solution as long as it served a good purposes on the country's economy issue because of the communism principleUnfortunately, I cannot agree with you .. For one simple reason - China, over the past 2 years, has not made a single REASONABLE decision. Moreover, over the past 2 years, after the change in the vector of development, to the vector of totalitarianization and politics and economics, there can no longer be REASONABLE decisions. Everything that is being done now is not a very successful attempt to delay the collapse of the economy, not the most logical moves. Although .. I agree - the expanded virtual \"de-dollarization\", under the guise of which they launched the \"yuanization\" of the unfortunate supporters of this idea, will lead to a temporary \"stabilization\" of the falling economy. I am sure that it will be possible to slow down the collapse of the economy a little, but to solve the problem - no. The problem is secondary - attempts to cure the \"seriously ill organism of the Chinese economy\" will lead to \"infection with the problem\" of those who become supporters of \"yuanization\". China, with a non-zero probability, will be able to, if not solve the problem, then mitigate its consequences. And those who chose the path of \"de-dollarization / yuanization\", for many more decades, will suffer from this rash step ...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hatshepsut93",
      "created_time": "June 03, 2023, 09:55:36 PM",
      "body": "Quote from: Poker Player on June 03, 2023, 03:52:27 AMQuote from: hatshepsut93 on June 02, 2023, 10:23:26 PMI don't think a lot of investors buy Bitcoin because they believe it will protect them from inflation, it's just a narrative for promoting Bitcoin. The actual reason is that people believe Bitcoin will be worth more in the future ...Here you contradict yourself. Buying things that will be worth more in the future is the way to hedge against inflation, as long as the percentage increase exceeds it.  In other words, if cumulative inflation over the next 4 years is 20%, the assets you have that equal or exceed that 20% in cumulative return have served to protect you from inflation.People who invest in Bitcoin expect performance that is orders of magnitude higher than inflation, while those who only seek to hedge against inflation can even be satisfied with breaking even against inflation. You can see it in this forum too - the discussions are focused around whether Bitcoin can reach $100K or $1M, or $10M in 20 years - no one here insterested in 2-3% growth per year.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "d5000",
      "created_time": "June 03, 2023, 10:46:51 PMLast edit: June 03, 2023, 10:57:55 PM by d5000",
      "body": "Quote from: stompix on June 02, 2023, 09:48:02 AM- do you believe we're heading to deflation?I think there is a certain probability we'll reach a zero-inflation to slight deflation scenario in 1-2 years. But not exclusively due to China's problems and the worldwide weak economic moment. Energy prices may go downhill permanently and steadily from now on (with some hiccups of course), and that will lead to downward pressures in all markets closely related to energy.Quote from: stompix on June 02, 2023, 09:48:02 AM- how do you think the price of BTC will be influenced if we do so?The influence of inflation to Bitcoin prices is a bit \"paradoxical\". As others wrote, Bitcoin is marketed as a way to protect patrimony from inflation. So you would estimate that it could react negatively in a deflation.But in the past Bitcoin did generally really well in low-inflation/deflation periods. The reason may be quite obvious: in deflation periods the central banks reccurr to QE and other \"money printing\" solutions and to low/negative interest rates to boost inflation to ~2%. This leads not only to \"free\" money flowing into Bitcoin, but also to Bitcoin being seen as an alternative to low-interest traditional financial products. While in inflationary periods it's the opposite: markets are drying up and BTC is negatively affected.However that is also not the whole story. In countries with really high inflation (let's say more than 20-30%/y, Argentina is the prime example), Bitcoin is also doing exceptionally well. If you invest in Bitcoin in these countries, you will win even in bear markets (if you don't invest exactly at a bubble top, perhaps) compared to holding fiat. For example, in Argentina inflation is 100-120%/y (and currency devaluates to a similar pace), but bank deposit interest rates are around 80-90%/y. This means: If BTC/USD loses less than 20%-30% per year you win even against a bank deposit. This means the risk investing in BTC drops seriously in these countries - in the absolute worst case (~65% drop like in 2022) you're still not losing much against simply holding cash.So I guess the mechanism is:- Very high inflation: Bitcoin price tends to go up, because even a downtrend price still is better than national currency.- Moderately high inflation: Bitcoin tends to go down, because of the restrictive central bank methods (high interest rates, no more QE)- Low inflation or deflation: Bitcoin tends to go up, because of the tendency to a high fiat money supply growth, and the attractivity against low-interest traditional financial products.Quote from: DrBeer on June 02, 2023, 10:21:37 AMWho will replace more than 50% of exports? India? Russia ? Iran? Do they have dollars? What about technology? NO one or the other!Europe, and most of the rest of the world (by the way: 50% is not true, its ~16 % (2022)). Chinese state and corporations are investing heavily there to penetrate the European market even more. The most notorious example is cars - Chinese carbuilders are building up a strong position in Europe. They may soon get a similar position to Japan and South Korea, with expectations to grow even more.However, I think that China's growth rates may really enter a (temporary) recession now due to short-term economic policy errors, and in the long term reduce sustainably, i.e. staying largely below ~5% and approaching 1-2% in most years, because it's becoming a stable industrialized economy and there are less opportunities to cheaply catch up. But I also don't see really a catastrophic outcome, even if some seem to desire this. Their internal market is probably strong enough to survive all external crises.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DrBeer",
      "created_time": "June 04, 2023, 10:57:43 AM",
      "body": "Quote from: d5000 on June 03, 2023, 10:46:51 PMQuote from: DrBeer on June 02, 2023, 10:21:37 AMWho will replace more than 50% of exports? India? Russia ? Iran? Do they have dollars? What about technology? NO one or the other!Europe, and most of the rest of the world (by the way: 50% is not true, its ~16 % (2022)). Chinese state and corporations are investing heavily there to penetrate the European market even more. The most notorious example is cars - Chinese carbuilders are building up a strong position in Europe. They may soon get a similar position to Japan and South Korea, with expectations to grow even more.However, I think that China's growth rates may really enter a (temporary) recession now due to short-term economic policy errors, and in the long term reduce sustainably, i.e. staying largely below ~5% and approaching 1-2% in most years, because it's becoming a stable industrialized economy and there are less opportunities to cheaply catch up. But I also don't see really a catastrophic outcome, even if some seem to desire this. Their internal market is probably strong enough to survive all external crises.The Chinese car industry is a good example, but... I am absolutely sure that this will all end with the introduction of additional duties on Chinese cars, which will cross out the benefits of buying them. The EU will protect its market, as the EU car industry is one of the most important elements of the economy.The second side of the Chinese car industry is Western technology, without which there are no production lines or high-quality implementation of car functionality. I have a friend who has been living and working in China for a long time. He is connected with the state sector in the oil and gas segment. And a couple of years ago when they started to appear fantastic reviews of Chinese automobiles I asked him a question. The answer was: yes, we have a huge number of manufacturers both for the domestic market, and for local markets (South Asia, Africa, South America) and for export to the \"big league\" countries. Nominally they meet the requirements, but in reality... The quality is far from perfect, or even to today's level of middle class European cars. Many people in China buy our cars only because of their availability, those who have money buy American or European cars. This is quality. I myself drive a European car (he has his own Mercedes).China, if you look at its activity, in the last decade has a strong emphasis on \"enslaving\" markets in Africa, Asia, and Latin America. China is well aware that it is not welcome in the U.S. or the EU. And most importantly - China has lost its former key advantage - cheap labor. The level of income in the industrial, highly developed and competitive segment of Chinese production is certainly not comparable to the salaries of Europeans, but it has become significantly higher compared to 10 years ago. And this, as you understand, affects the cost of production and competitive advantage. Plus Europe understands that by supporting their own manufacturers, they can survive, so they consciously choose European goods. And this trend will develop.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}