{
  "id": "topic_5438701",
  "title": "totti67",
  "author": "totti67",
  "created_time": "February 08, 2023, 06:20:18 AM",
  "content": "Aslında hemen hemen her toplumun içinde, yasalara, kurallara veya genel geçerliliği olan ahlaki ve insani kurallara aykırı hareket eden şerefsizler mutlaka vardır. Bunlara karşı öncelikle yürürlükteki hukuk kuralları, sonrasında ise toplumsal yaptırımlar mutlaka devreye girer, girmelidir. Yaptırımların yeterince caydırıcı olmadığı durumlarda ise maalesef zaten şerefsizliği meslek edinmiş o küçük grup, eylemlerine devam etmekten çekinmez.   https://cdn.istanbul.edu.tr/FileHandler2.ashx?f=klasik-donem-osmanli-hukukunda-hirsizlik-sucunun-algilanmasi-ve-cezalandirilma-sekilleri_cihan-osmanagaoglu-karahasanoglu.pdf    İşin tarihsel gelişimini merak edenler için Osmanlı döneminde hırsızlık ile ilgili uygulamalara dair bilgiler yukarıda yer almaktadır. Günümüze gelecek olursak, en son yaşadığımız felaketten yola çıkarak, daha olayın ilk gününde marketleri yağmalayanların görüntülerini hepimiz izledik. Hatta şerefsizin bir LCD televizyonu sırtlamış götürmekteydi, gözlerime inanamadım o an. Ulan hadi gıdayı anlarım, kıyafeti anlarım, be orospu çocuğu o televizyonu götüne mi sokacaksın da çalıyorsun. 99 depremini yaşayanlar bilirler, o günlerde de enkaz edenlere yardım etme çabasındaymış gibi görünüp, enkazların altından ziynet eşyası çalmaya gelenler vardı, hatta bazı meftaların ellerinden bilezikleri çıkaramayıp, ellerini keserek o bilezikleri analar bile olmuştu.    Kişisel olarak insan hayatına önem veririm, ancak telefonda yaşlı insanların (bazen gençler de yem oluyor ya onları hiç anlamıyorum) duygularıyla oynayıp kandıranlara, emekli maaşını yeni çekmiş insanları dolandırıp elindeki üç beş kuruşa tamah edenlere, dişinden tırnağından arttırarak araba alanların arabalarını çalıp bir saatte yok edenlere, gece uyurken evlere girip bazı durumlarda hırsızlık dışında maalesef ev halkının canına kıyanlara, inşaat yapıdan malzemeden üç kuruş fazla kar edeyim diyerek malzemeden çalanlara, (azınlıkta olsalar da) dün haberlerde izledim, gaziantep de bir fırın ekmeği 14 lira yapmış, bir önceki gün Malatya' ydı sanırım bir lokanta bir koli suya 150 lira demiş, bunun gibi örneklere konu olan esnaflara acımayacaksın. Rehabilite edilebilir durumdakilere lafım yok, ya da evinde çocuğu açtır, son çaresi hırsızlık kalmıştır, ona bir lafım yok ki o durumda olanların vebali önce devlet olmak üzere hepimizin boynunda kalır, geri kalanlara kesinlikle acımamak lazım.   Bu konular benim çok hassas olduğum konular o yüzden geriliyorum, sizlerin çözüm önerileri nelerdir?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5438701",
  "comments": [
    {
      "author": "trendcoin",
      "created_time": "February 08, 2023, 07:16:40 AM",
      "body": "michel foucault'nun hapishanenin doğuşu kitabına kadar suç ve ceza ilişkilerindeki sözde modern teamüllerin zamanla insanlık onuruna yakışır şekilde düzenlenmiş olduğu zırvasına inanıyordum. bu kitap tek kelimeyle benim ufkumu açtı; bu konu hakkında kafasında soru işaretleri olan arkadaşlara doğrudan tavsiyemdir.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mandown",
      "created_time": "February 08, 2023, 07:27:42 AM",
      "body": "350-400 bin askerimiz var bütün sınırlarımız sonuna kadar açık bizden olsun olmasın birçok çeşit suş unsuru olabilir sen gereken tedbiri ilk gece almadıkça her geçen dakika risk daha da arttığı halde sen ilk deprem anından sonra gereken tedbiri almazsan herşey olur.Bak çoluk çocuk kaçırılıyor. Nasıl kaçırılır abi.Askeriyeye vur emri çoktan verilip gereken güvenlik orada sağlanmalıydı vur emri verilmese bile bu tarz bir haber yayılmalı ve korku salınmalıydı. Neyse yapacak birşey yok.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Phoenix Anka",
      "created_time": "February 08, 2023, 05:20:38 PM",
      "body": "Her yerde var bu kalitesiz onun bunun çocukları. Dün sanırım haberlerde gördüm AFAD gönüllüsü gibi kıyafet giyip hırsızlık yapan kişiyi polisler yakalamıştı. Şimdi de sahte internet siteleriyle fake linkler ile oltalama yöntemiyle insanların paralarını çalmaya çalışıyorlar. Lütfen linklere dikkat edin arkadaşlar paranızı iyi niyetle gönderirken hırsızlara varlığınızı kaptırmayın.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "husdemba",
      "created_time": "February 10, 2023, 03:22:17 PM",
      "body": "Bir sunucunun sözleri vardı binaların çökmesinin altından kalkabiliriz ama ahlaki çökkünlüğün nasıl üstesinden geleceğiz diye. Hainliğin bin türlüsünü yapanlar var bu ülkede ve yapacaklarının bir yaptırımı olmayacağını bilmek onları cesaretlendiriyor asıl sorunumuz bu.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kriminall",
      "created_time": "February 10, 2023, 04:53:38 PM",
      "body": "Quote from: husdemba on February 10, 2023, 03:22:17 PMBir sunucunun sözleri vardı binaların çökmesinin altından kalkabiliriz ama ahlaki çökkünlüğün nasıl üstesinden geleceğiz diye. Hainliğin bin türlüsünü yapanlar var bu ülkede ve yapacaklarının bir yaptırımı olmayacağını bilmek onları cesaretlendiriyor asıl sorunumuz bu. Oğuzhan uğur galiba, onun da buna benzer bir açıklaması olmuş, artan ihtiyaçlara yönelik söylemiş, depremle birlikte çöken ahlakla da savaşacağız galiba diye, çok doğru söylemiş, şu an inanılmaz bir yozlaşmanın içerisinde yer alıyoruz, toplumun iyi niyetli suistimal ediliyor, bunları kullanmak isteyenleri vatandaşlıktan çıkarılıp sınırdışı etmeli !",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cacabey_40",
      "created_time": "February 10, 2023, 07:21:49 PM",
      "body": "Quote from: husdemba on February 10, 2023, 03:22:17 PMBir sunucunun sözleri vardı binaların çökmesinin altından kalkabiliriz ama ahlaki çökkünlüğün nasıl üstesinden geleceğiz diye. Hainliğin bin türlüsünü yapanlar var bu ülkede ve yapacaklarının bir yaptırımı olmayacağını bilmek onları cesaretlendiriyor asıl sorunumuz bu. Şu anki tablo zaten ahlakî çöküntünün sonucudur. Doymak bilmeyen gözün, ahlakî yozlaşmanın, hırsızlığın ve liyakatsızlığın neticesidir. Çok kazanma hırsı, torpil, rüşvet ve yozlaşmanın geldiği son noktadır. 1. dereceden deprem ülkesiyiz ama fay hatlarının tam üzerine koca koca şehirler inşa etmişiz, ruhsat vermişiz. Alüvyal topraklar üzerine onlarca katlık binalar dikmişiz. Zemin analizi yapmadan, rüşvet yedirerek, çalarak çırparak, depreme uygun olup olmadığını hiç araştırmadan...Yetmiyormuş gibi 200-300 bin etmeyen evleri 2-3 milyon yazarak ahlaksızlık konusunda zirve yapmışız. Sonuç ortada... Olası bir Marmara depremini aklım almıyor!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "wolwoo",
      "created_time": "February 12, 2023, 10:40:52 AM",
      "body": "bizim binada biri anlatıyor arkadaşı depremzede diye bir aileye dairesini 1 yıllık bedava tahsis etmiş, sonra araştırıyor ki herif suç kaydı olan dilencilik yapan biri, depremzede de değil, çıkartmaya çalışıyormuş.bireysel yardım yapanlar iyi araştırıp soruşturmalı ya da kurumsal yardıma yönelmeli..",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "50promil",
      "created_time": "February 12, 2023, 06:45:03 PM",
      "body": "Quote from: mandown on February 08, 2023, 07:27:42 AM350-400 bin askerimiz var bütün sınırlarımız sonuna kadar açık bizden olsun olmasın birçok çeşit suş unsuru olabilir sen gereken tedbiri ilk gece almadıkça her geçen dakika risk daha da arttığı halde sen ilk deprem anından sonra gereken tedbiri almazsan herşey olur.Bak çoluk çocuk kaçırılıyor. Nasıl kaçırılır abi.Askeriyeye vur emri çoktan verilip gereken güvenlik orada sağlanmalıydı vur emri verilmese bile bu tarz bir haber yayılmalı ve korku salınmalıydı. Neyse yapacak birşey yok.bugün suriye sınırında 2 sınır kağısı daha açıldı. sebep depremden dolayı 2 milyon suriyeli nin göç edecek olması . başka bir şey demiyorum. önümüzdeki boku yedik 2 milyon mültecinin boku kalmıştı onu da yiyeceğiz.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cacabey_40",
      "created_time": "February 12, 2023, 06:58:06 PM",
      "body": "Kahramanmaraş E Tipi Cezaevi'nden deprem sonrası 165 mahkum firar etmiş arkadaşlar. Kendilerini depremzede diye tanıtıp ev arayanlar varmış. Bu gerçek bir bilgi. Hatta fotoğrafları bile var. Dikkat edin. Çevrenizdekileri de uyarın.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mandown",
      "created_time": "February 12, 2023, 07:19:39 PM",
      "body": "Gider ayak ellerinden gelen zararı vermeye çalışıyorlar.Umarım hesap sorabilecek bir iktidar olur. Hala oy verecek ortada eli dili düzgün parti malesef yok. Seçtimin kişiler insanları öldürüyor deprem değil.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "RaltcoinsB",
      "created_time": "February 12, 2023, 07:28:23 PM",
      "body": "Quote from: Cacabey_40 on February 12, 2023, 06:58:06 PMKahramanmaraş E Tipi Cezaevi'nden deprem sonrası 165 mahkum firar etmiş arkadaşlar. Kendilerini depremzede diye tanıtıp ev arayanlar varmış. Bu gerçek bir bilgi. Hatta fotoğrafları bile var. Dikkat edin. Çevrenizdekileri de uyarın.Hemen bir düzeltme yapayım arkadaşlar konuya hakim arkadaşlarımdan edindiğim bilgiyi söylüyorum bu sızan liste yoklama listesi bir kaç kişi kaçmaya yeltenmiş ama müdahale edilmiş şu an firar yok gereksiz galeyana getiren insanlar yüzünden büyüyen bir olay bu sosyal medyada yayılan hızlı yanıltıcı bilgi sadece",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cacabey_40",
      "created_time": "February 12, 2023, 07:31:22 PM",
      "body": "Quote from: RaltcoinsB on February 12, 2023, 07:28:23 PMQuote from: Cacabey_40 on February 12, 2023, 06:58:06 PMKahramanmaraş E Tipi Cezaevi'nden deprem sonrası 165 mahkum firar etmiş arkadaşlar. Kendilerini depremzede diye tanıtıp ev arayanlar varmış. Bu gerçek bir bilgi. Hatta fotoğrafları bile var. Dikkat edin. Çevrenizdekileri de uyarın.Hemen bir düzeltme yapayım arkadaşlar konuya hakim arkadaşlarımdan edindiğim bilgiyi söylüyorum bu sızan liste yoklama listesi bir kaç kişi kaçmaya yeltenmiş ama müdahale edilmiş şu an firar yok gereksiz galeyana getiren insanlar yüzünden büyüyen bir olay bu sosyal medyada yayılan hızlı yanıltıcı bilgi sadeceSosyal medya üzerinden değil de resmî bir kurumdan bize gelen bilgi. Dikkatli olmamız ve çevremizdekileri uyarmamız istendi. Umarım firar yoktur.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "RaltcoinsB",
      "created_time": "February 12, 2023, 07:36:44 PM",
      "body": "Quote from: Cacabey_40 on February 12, 2023, 07:31:22 PMQuote from: RaltcoinsB on February 12, 2023, 07:28:23 PMQuote from: Cacabey_40 on February 12, 2023, 06:58:06 PMKahramanmaraş E Tipi Cezaevi'nden deprem sonrası 165 mahkum firar etmiş arkadaşlar. Kendilerini depremzede diye tanıtıp ev arayanlar varmış. Bu gerçek bir bilgi. Hatta fotoğrafları bile var. Dikkat edin. Çevrenizdekileri de uyarın.Hemen bir düzeltme yapayım arkadaşlar konuya hakim arkadaşlarımdan edindiğim bilgiyi söylüyorum bu sızan liste yoklama listesi bir kaç kişi kaçmaya yeltenmiş ama müdahale edilmiş şu an firar yok gereksiz galeyana getiren insanlar yüzünden büyüyen bir olay bu sosyal medyada yayılan hızlı yanıltıcı bilgi sadeceSosyal medya üzerinden değil de resmî bir kurumdan bize gelen bilgi. Dikkatli olmamız ve çevremizdekileri uyarmamız istendi. Umarım firar yoktur. Hocam biz de güvenlik sektöründeyiz bu konuyu soruşturduk ona göre duyarlı olalım dedik öyle bir şey olmadığı kurum tarafından iletildi eğer yalan söylüyorlarsa bilemem oranın söylediği bilgiyi paylaşıyorum ben",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MK-74",
      "created_time": "February 12, 2023, 10:55:51 PM",
      "body": "Her topluda olduğu gibi bizimkinde de var maalesef, buna yapacak bir durum yok, cazelar hafif olunca sadece çoğalması kolay oluyor, cezalarını sertleştir ve eğitim seviyesini yüksek tut azalır bunlar.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "totti67",
      "created_time": "February 13, 2023, 05:31:14 AM",
      "body": "Bu coğrafya deprem coğrafyası, normal şartlarda her depremden sonra topyekün en azından biraz daha akıllanmamız gerekirken, insanımızın seferberlik duygusu, yardımlaşma çabası dışındaki herşey daha da kötüye gidiyor, aksayan şeylerden bahsediyoruz, siyaset yapma diye ortaya çıkan troller ile uğraşıyoruz, ki şu an savundukları güruhun 99 depremi sonrası ne dedikleri çarşaf çarşaf ortadayken... Bakın siyasi görüşümden bağımsız söylüyorum, ki ben oldum olası muhalifim, yani yarın güç dengeleri değişse yine aynı yerimde duracağım, ama bu demek değil ki doğru yapılan, zamanında ve gerektiği gibi yapılan her şeyi görmezden geleceğim. Forumda da mevcut olan ama gündelik hayatımızda daha da sık gördüğümüz tiplere söylüyorum, insanları sevebilirsiniz, görüşleri sizin için bi nevi tabu olabilir, hiç yanlış yapabileceklerine ihtimal vermeyebilirsiniz, ama unutmayın yaradılış gereği zaten hatasız kul olmaz, sizler sevdiklerinizin hatalarını göstermeye çalışanları, şimdi siyaset zamanı değil gibi basit bir argümana sığınarak ötekileştirip şucu bucu diye yaftaladıkça, aslında daha yaşanamaz bir dönemlin temelini atıyorsunuz, ve bunu oturduğunuz yerden rahatınız yerindeyken yapıyorsunuz. Bilmem gördünüz mü deprem bölgesinde komünist arkadaşların kurduğu düzenekte ülkücü arkadaşlara yemek dağıtımı yapılıyordu, bunun gibi binlerce örnek var an itibariyle orada yaşanan, bizler normalde zaten bu şekilde de yaşayabiliriz, fikirlerimiz uyuşmaz ama biz aslında bölünmez bir bütünün parçalarıyız siyasi görüşümüz, bölgemiz dilimiz dinimiz ne olursa olsun. Tek eksiğimiz bunu sadece felaketler sonrası farkediyor oluşumuz, herşey düzelip yaralar sarıldıktan sonra da bu birlikteliği devam ettirebilirsek, o zaman bu ülkenin geleceği için güneş hep daha güzel doğacaktır...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Phoenix Anka",
      "created_time": "February 13, 2023, 06:05:16 AM",
      "body": "Quote from: MK-74 on February 12, 2023, 10:55:51 PMHer topluda olduğu gibi bizimkinde de var maalesef, buna yapacak bir durum yok, cazelar hafif olunca sadece çoğalması kolay oluyor, cezalarını sertleştir ve eğitim seviyesini yüksek tut azalır bunlar.Hocam ırkçılık yapıyor gibi olacağım da bakın yakalanan hainlerin bir çoğu Suriyeli ve diğer mülteciler. Türkçeyi çat pat konuşuyorlar. Tabi aralarında Türk vatandaşları da var ama ekseriyetle yabancı. İnsanlıktan nasibini almamış bu insanlar. Hiç bir eğitim almamışlar, vicdan merhamet sahibi değiller. Bir yanda verilen suyu gururundan içemeyen depremzede abiler, diğer yanda bu şerefsizler.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "totti67",
      "created_time": "February 13, 2023, 07:58:40 AM",
      "body": "Quote from: Phoenix Anka on February 13, 2023, 06:05:16 AMQuote from: MK-74 on February 12, 2023, 10:55:51 PMHer topluda olduğu gibi bizimkinde de var maalesef, buna yapacak bir durum yok, cazelar hafif olunca sadece çoğalması kolay oluyor, cezalarını sertleştir ve eğitim seviyesini yüksek tut azalır bunlar.Hocam ırkçılık yapıyor gibi olacağım da bakın yakalanan hainlerin bir çoğu Suriyeli ve diğer mülteciler. Türkçeyi çat pat konuşuyorlar. Tabi aralarında Türk vatandaşları da var ama ekseriyetle yabancı. İnsanlıktan nasibini almamış bu insanlar. Hiç bir eğitim almamışlar, vicdan merhamet sahibi değiller. Bir yanda verilen suyu gururundan içemeyen depremzede abiler, diğer yanda bu şerefsizler. Asıl önemli süreç herşey bittikten sonra başlayacak, Suriye'deki deprem sonrası evsiz kalanlarin ki sayıları milyonlarla ifade ediliyor, yine ülkemize entegre edilmesi çabasına başladı Avrupa ülkeleri, diğer yandan an itibariyle deprem bölgesindeki yaşananlarda da özellikle enkazlardan hırsızlık yapanlar, yol kesenler vs. İçinde mültecilerin de olduğu gerçek ama kimsenin günahına girmek de istemiyorum, benim derdim kafamızda acaba ne kadar az olabilir, hele ki şu anda orada insanlar tükenme noktasına iken durum her zamankinden daha da bıçak sırtı...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "flipme",
      "created_time": "February 16, 2023, 09:12:54 PM",
      "body": "Gelişmiş dediğimiz Avrupa toplumlarında da benzer örneklerle karşılaştık. Ukrayna'da savaş sırasında yağma olayları yaşandı. Hırsızları arkaları açık kalacak şekilde direğe bağlayıp kırbaçladılar. Bazıları bu uygulamanın barbarca olduğunu söyledi ama hırsızlık olaylarını önemli ölçüde azalttığını söyleyenler de oldu. Sert bir uygulama gibi ama işe yarıyorsa neden uygulanmasın? Bence bizim için de bir ihtiyaca dönüşürse uygulanabilir çünkü olağanüstü durumlarda sert uygulamalar olağan cezalar haline dönüşebilir. Biz de şu anda olağanüstü bir dönemden geçiyoruz.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}