{
  "id": "topic_5461877",
  "title": "Pablo-wood",
  "author": "Pablo-wood",
  "created_time": "August 02, 2023, 10:37:01 PM",
  "content": "I was having this strong contemplation, between emotion and patience which factor affects traders the most. I know we have other factors that can make a trader experience huge losses such as FUD, greed, lack of contentment, indiscipline and high expectations and over zealousness.But I had to narrow my scope to just the emotional and patient factors. I am sure many traders can relate better with this two factors compared to the rest this lead me to seek the answer from traders and prospective traders which do you think should be handled with more caution and between the two which has higher chances of helping a trader have at least 70% of total control of their profit cycle.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5461877",
  "comments": [
    {
      "author": "dansus021",
      "created_time": "August 03, 2023, 02:40:04 AM",
      "body": "I think emotion is the biggest enemy of trader, the biggest emotion is fear and Greed. You fear when the market at lowest point and greed when at the top of point. you need control your emotion so you can manage your money when you are loses or dont overtrade when you made a profit.Know when Stop Loss and know when take profit",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Free Market Capitalist",
      "created_time": "August 03, 2023, 04:21:44 AM",
      "body": "Quote from: Pablo-wood on August 02, 2023, 10:37:01 PMBut I had to narrow my scope to just the emotional and patient factors. I am sure many traders can relate better with this two factors compared to the rest this lead me to seek the answer from traders and prospective traders which do you think should be handled with more caution and between the two which has higher chances of helping a trader have at least 70% of total control of their profit cycle.I don't see the difference here. Patience is an emotional component, it falls under emotional factors. It's not like the calculations you can do or the charts you can plot. And I think that in his answer dansus021 also speaks only of emotion, because he does not see that patience is something different from it. Anyway, from the way you talk it seems that you have not had good experiences with trading, so I would tell you to consider a longer term investment in which emotions do not play such an important role.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BD Crypto",
      "created_time": "August 03, 2023, 06:07:29 AM",
      "body": "Quote from: Pablo-wood on August 02, 2023, 10:37:01 PMBut I had to narrow my scope to just the emotional and patient factors. I am sure many traders can relate better with this two factors compared to the rest this lead me to seek the answer from traders and prospective traders which do you think should be handled with more caution and between the two which has higher chances of helping a trader have at least 70% of total control of their profit cycle.When you have no patience then you have emotions on your trading. Actually emotions cause FUD, FOMO, sudden sell or revenge trading and many more. These all the things which should be avoided because this isn't a place to show your emotions. Here everything happens on analysis and potentiality.So I will say obviously emotions affect most of the time and as a human being we can't neglect our emotions but we have to use it positively. We should have emotions to find a better investment or a perfect investment or exit level but not for panic selling. But to be a perfect trader we have to focus on many factors because if you only control your emotions isn't all what you help you to get profit. For proper trading you must have basic technical analysis, fundamental analysis and should know about current events. Only discussing about emotions or patience will not be helpful at all as it's a part just.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "noorman0",
      "created_time": "August 03, 2023, 08:55:26 AM",
      "body": "Quote from: Pablo-wood on August 02, 2023, 10:37:01 PMI was having this strong contemplation, between emotion and patience which factor affects traders the most.All of them, patience is part of emotional intelligence that must be controlled as much as possible. If you are trading in the spot market, patience is your last bet when you take the \"wrong\" entry or the market moves against your predicted scenario. So emotional intelligence is more in demand when you have open positions or when buy orders are filled.Nearly 70% of trading lessons is theory about pre-trade setups that you can learn from others. But the lesson of emotion is a special thing where you have to practice more on your own and you can only learn it self-taught.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EarnOnVictor",
      "created_time": "August 03, 2023, 10:58:38 AM",
      "body": "It took me three times reading before I could understand your lumps...lolPlease, note that traders can be successful in trading only if they can take care of three aspects of it.These are;1. Strategy/System2. Management3. PsychologyUnfortunately, almost all traders are mainly working on how to improve their trading strategy/system, while a few more consider the management, while a very little fraction considers the psychological part of it which you are talking about.All these contribute their quota to the success of any trader, and if you must achieve it flawlessly, you have to avoid emotion totally and be determined to the course. You can do this by being disciplined and keeping to your trading plans irrespective of the situation and market temptations.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "michellee",
      "created_time": "August 03, 2023, 12:28:59 PM",
      "body": "Every trader has to deal with emotions because, after all, when the market changes direction, the emotions will change and follow its mood. These emotions will lead them to other feelings, such as greed, lack of satisfaction, and indiscipline. And when the market changes fast, they will also act in a hurry, panic, and worry.They really have to learn to control their emotions so they won't be affected by anything going on in the market and can analyze market conditions well. And when you have to trade, you must have good skills and self-control. You can analyze the market conditions and find the right time to enter and exit the market.There is still a lot to learn before trading but it can be learned slowly. The important thing is that you have to learn to trade well and also learn to control yourself.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cookdata",
      "created_time": "August 03, 2023, 12:56:59 PM",
      "body": "Quote from: Pablo-wood on August 02, 2023, 10:37:01 PMI was having this strong contemplation, between emotion and patience which factor affects traders the most. I know we have other factors that can make a trader experience huge losses such as FUD, greed, lack of contentment, indiscipline and high expectations and over zealousness.But I had to narrow my scope to just the emotional and patient factors. I am sure many traders can relate better with this two factors compared to the rest this lead me to seek the answer from traders and prospective traders which do you think should be handled with more caution and between the two which has higher chances of helping a trader have at least 70% of total control of their profit cycle.Does been patience affect traders? I think you are mixing things up. Patience is a practical discipline every trader should have before starting trading, you need it more than any other factors you mentioned there, you wouldn't go far if you even lack it because one of the main problems of being emotional is when we don't have the patience to overlook trade, the emotion starts building up and at the end, you make an inconclusive and silly judgement that will affect your trades.Whatever magic that works for you, it's pretty fine as long as you don't pile up losses at the end of the day; emotion and patience are experienced by every trader but we react differently to each of them because we are experienced in trading than each other, we have exposure to money to each other and we have a different level of tolerance than each other, so if your emotion and patient gives you 70% chance of profit cyle, continue your trading degen.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "arwin100",
      "created_time": "August 03, 2023, 01:07:49 PM",
      "body": "Quote from: Pablo-wood on August 02, 2023, 10:37:01 PMI was having this strong contemplation, between emotion and patience which factor affects traders the most. I know we have other factors that can make a trader experience huge losses such as FUD, greed, lack of contentment, indiscipline and high expectations and over zealousness.But I had to narrow my scope to just the emotional and patient factors. I am sure many traders can relate better with this two factors compared to the rest this lead me to seek the answer from traders and prospective traders which do you think should be handled with more caution and between the two which has higher chances of helping a trader have at least 70% of total control of their profit cycle.Consistency to do trades is all needed by a trader so that you can experience so many scenarios that can help you strengthen your emotions,skills and any other things that helpful on your trading career. So we shouldn't get discourage if we lose since if we totally quit just because we lose then we might be a total loser since we don't have any chance to recover since we cut our chances to learn from the mistakes happen to us.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yamane_Keto",
      "created_time": "August 03, 2023, 01:10:10 PM",
      "body": "Without passion and patience, you will not invest in bitcoin. You will not have incentives to invest in any high-risk investment, and you will suffice with US Treasury bonds. Emotions are what drive you to invest, but you must learn how to control them, when to invest and when to withdraw without emotions affecting you negatively.The real trader knows that he will lose and knows that trading is a gain and a loss, the loss should not affect you, and you should enjoy your life, as if you spent your day following the signals, it is better to look for a job.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "awik p",
      "created_time": "August 03, 2023, 01:38:31 PM",
      "body": "in short-term trading, I think the emotional factor is the most decisive, because in short-term trading, we don't wait in the long term, usually it can be called daily trading, with a short range we take advantage of opportunities to get a little profit but it is often done so that the same like we get a big profit in the calculation. therefore it takes an emotional well-established in order to launch the strategy to be executed",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Minecache",
      "created_time": "August 03, 2023, 01:44:52 PM",
      "body": "Quote from: dansus021 on August 03, 2023, 02:40:04 AMI think emotion is the biggest enemy of trader, the biggest emotion is fear and Greed. You fear when the market at lowest point and greed when at the top of point. you need control your emotion so you can manage your money when you are loses or dont overtrade when you made a profit.Know when Stop Loss and know when take profit In the same opinion, emotions are the biggest enemy of traders, emotions govern all decisions when we trade. So as long as we can manage and control our emotions, we can control the rest. It is easy to say but extremely difficult to do, it can be said that fear and greed are the two most difficult things to control for anyone. I even outlined specific plans and goals, even writing them down and putting them on my desk. But when I started trading and saw my profits increase, it was almost impossible for me to control my greed. I failed in trading, it can be said largely due to my lack of control over my emotions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "shivansps",
      "created_time": "August 03, 2023, 02:08:08 PM",
      "body": "It is difficult to say what influences the trading of emotions or patience more. These factors are difficult to consider in isolation, they are like two bicycle pedals. You cannot use just one. Emotions are different. Some emotions can protect us, others can kill us. One of the main things is not to drag out a trade when you are losing money or making money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "shivansps",
      "created_time": "August 03, 2023, 02:16:44 PM",
      "body": "Quote from: Yamane_Keto on August 03, 2023, 01:10:10 PMWithout passion and patience, you will not invest in bitcoin. You will not have incentives to invest in any high-risk investment, and you will suffice with US Treasury bonds. Emotions are what drive you to invest, but you must learn how to control them, when to invest and when to withdraw without emotions affecting you negatively.The real trader knows that he will lose and knows that trading is a gain and a loss, the loss should not affect you, and you should enjoy your life, as if you spent your day following the signals, it is better to look for a job.I agree with you that emotions can be different. The same emotions can help us and also be an enemy. Greed, for example, can lead us to lose money. Fear can both help us make money, that is, get out of a deal when you are afraid of losing money and in the end turn out to be right, and sometimes fear leads to the fact that you complete the deal ahead of time. Patience is a good quality, but it can also sometimes work against us. I would say that composure is a very important part of trading, perhaps one of the most. There will always be emotions, but the ability to control is a separate ability that a successful trader must have.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bettercrypto",
      "created_time": "August 03, 2023, 02:42:56 PM",
      "body": "Quote from: dansus021 on August 03, 2023, 02:40:04 AMI think emotion is the biggest enemy of trader, the biggest emotion is fear and Greed. You fear when the market at lowest point and greed when at the top of point. you need control your emotion so you can manage your money when you are loses or dont overtrade when you made a profit.Know when Stop Loss and know when take profit Yes, I agreed that our emotion are the one most of the time lead us to do something that is sometimes against our will, this was happened to me before during the time that I am not deeply mature here in this crypto field of business.But I also believe that our emotions too could lead us to get profit while we do trade in the actual exchange whether CEX or DEX. Therefore I also agreed that we mist control oir emotions in a right way when we do some kind of trading activity.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "palle11",
      "created_time": "August 03, 2023, 02:56:51 PM",
      "body": "Quote from: Pablo-wood on August 02, 2023, 10:37:01 PMwhich do you think should be handled with more caution and between the two which has higher chances of helping a trader have at least 70% of total control of their profit cycle.This is the focus of your post. To go direct into it, emotion is what makes your trade or mares it. Emotion can be good in the sense that sometimes when you listen to it and follow what it pushes you to, it helps you. Emotion can be bad if you follow it and take a bad decision. So it can be helpful and destructive. Therefore, to narrow it down to patients, if it is good then it acts on your patient in that same good way and if it is bad it also have bad effect on the patient. It means sometimes applying patient could be good at times and bad at times. For example on bad patients, you could be having patient for your losses to return into profit instead of stopping your trade but the patient will eventually lead you to lose all.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Litzki1990",
      "created_time": "August 03, 2023, 04:00:58 PM",
      "body": "Emotions or excessive anger will never be good for your business. Excessive anger emotions or excessive greed can destroy your business. Excessive greed is not good for business because excessive greed will make your business partners or your customers have a bad attitude towards you which will cause them not to help you in business later on. If you charge customers more than the fair price due to excessive greed, customers will never come back to your store. Thus thinking about selling more products at a relatively lower profit than losing customers will result in extra greed making you earn several times more than what you are earning by selling products at lower prices. Especially those who are involved in trading will never make extra profit. When you feel that your profit is enough and you should sell the coins now, you should never sit back thinking that the market will go higher as soon as you sell the coins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "livingfree",
      "created_time": "August 03, 2023, 04:32:03 PM",
      "body": "Quote from: Pablo-wood on August 02, 2023, 10:37:01 PMI was having this strong contemplation, between emotion and patience which factor affects traders the most. I know we have other factors that can make a trader experience huge losses such as FUD, greed, lack of contentment, indiscipline and high expectations and over zealousness.But I had to narrow my scope to just the emotional and patient factors. I am sure many traders can relate better with this two factors compared to the rest this lead me to seek the answer from traders and prospective traders which do you think should be handled with more caution and between the two which has higher chances of helping a trader have at least 70% of total control of their profit cycle.Just don't get flamed and chill at most times whenever you're trader. Once your emotion is triggered, you'll be affected that much and every performance you're about to do with your trades could ended up badly.It's a matter of how you handle situations and don't at least be affected on it which may be significant for the potential good result that you may have. News are normal whether they're good or bad, it will happen and you've got no control over it unlike your emotion and self.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Flexystar",
      "created_time": "August 03, 2023, 05:07:57 PM",
      "body": "That depends. Some of them control it some of them give away every bit of ounce they have in them and lose. It entirely depends on the fact that how they were train or how they created their journey of trading so far (if they are trained). Anyone who is just getting into trade recently or anyone who isn’t properly mastered can end up in dead zone quickly. They are the people who try to bet more money when they lose and they keep the target of recovering that money and then going for the new profits. Highly miscalculated risks and methods they would follow always. While the trained one would never repeat such mistakes and their positions are always new irrespective of the previous losses. It’s big world mate, the more you enter the more you learn.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tjtonmoy",
      "created_time": "August 03, 2023, 05:49:45 PM",
      "body": "I put both emotion and patience in a single category. Having emotional control will make sure that you don't take any wrong decision. If you are able to do this, then patience will not be an issue. When you are thinking logically, you can tell yourself that this is not the right time to do this. Thus, you will be safe from emotional influence.Selling quickly and not selling later in hopes for more profits are fear and greed. This is also a part of emotional decision. So in order to be a good trader, the first thing that you should master is emotion control. People tend to learn the basic fundamental of trading first, without focusing on emotion control. No matter how much you learn and apply your knowledge in the field, if you have no control over your emotions, you are most likely to make a loss. And then you think, I am doing everything right, yet I am in a loss.So the very first thing we need to learn is emotion control. After that, if you just follow the basic rules, fear greed, patience all of these things will not affect your trades anymore. The most important thing is emotion. Master it first, then things will be much more easy and you can become a successful trader.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}