{
  "id": "topic_5416053",
  "title": "S3cco",
  "author": "S3cco",
  "created_time": "October 05, 2022, 04:27:11 PM",
  "content": "Blockchain Fest Singapore 2023  | 16-17 February 2023 | Singapore, Marina Bay SandEvent Website: https://blockchain-fest.asia/Blockchain Fest Singapore is one of the most interactive events in South East Asia on Blockchain, Exchanges, Cryptocurrencies, Decentralized Finance (DeFi), NFTs, Mining, Gaming and Gambling, Online Payments, Investment and Fintech Industry.Singapore is the most crypto-friendly environment and a real hub of modern financial Asia inviting companies from Europe and the world to join the event. Top-professionals, global leaders and even beginners in the industry from different sectors such as blockchain, cryptocurrencies, crypto exchanges, decentralized finance (DeFi), mining, payment systems and investment chose to join the event in Singapore.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5416053",
  "comments": [
    {
      "author": "S3cco",
      "created_time": "October 07, 2022, 11:24:56 AM",
      "body": "FINEXPO Presents Blockchain Fest Singapore 2023 https://bitcoingarden.org/finexpo-presents-blockchain-fest-singapore-2023/FINEXPO is proud to bring Blockchain Fest 2023 to Marina Bay Sands Convention Center, Singapore, one of the biggest venues in Singapore. Singapore is the most crypto friendly environment and a real hub of modern financial Asia inviting companies from Europe and the world to join the event. The event will be held on 16-17 February 2023 starting at 10 AM Singapore time until 6 PM. FINEXPO is the largest company experienced in organizing financial and trading events, fairs, and expo worldwide since 2002. This event will gather top professionals, global leaders, or even beginners in this industry from different sectors such as blockchain, cryptocurrencies, crypto exchanges, decentralized finance (DeFi), mining, payment systems, and investment choose to join this event in Singapore.After 20 years of producing conferences, forums, summits, shows, exhibitions, festivals, all over Europe, South East Asia, Russia, and USA, FINEXPO is going to take place in Singapore to attract the world of blockchain enthusiasts to one place during the day. FINEXPO always aims to create phenomenal shows and substantial series of events. Its main goal is to connect people from all over the world at unique events like this. FINEXPO is eager to discover the potential of the connected world and exchange knowledge from the speakers and attendees....",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "S3cco",
      "created_time": "November 02, 2022, 04:00:45 PM",
      "body": "A Number of Renowned Speakers are Expected to Take Part in Blockchain Fest Singapore 2023 https://bitcoingarden.org/a-number-of-renowned-speakers-are-expected-to-take-part-in-blockchain-fest-singapore-2023/ The place that has been chosen by FINEXPO to hold Blockchain Fest 2023. The event will be held on 16-17 February 2023 starting at 10 AM Singapore time until 6 PM. Blockchain Fest Singapore is one of the most interactive events in South East Asia on Blockchain, Exchanges, Cryptocurrencies, Decentralized Finance (DeFi), NFTs, Mining, Gaming and Gambling, Online Payments, Investment and Fintech Industry.Meet founders and executives of leading international companies and share views on the industry’s current situation. Some of the founders and experts are invited to become speakers at this event. Let’s get to know them! Toya Zhang, a seasoned marketing and communications specialist with a background in technology, finance, and blockchain. Toya now finds herself as Chief Marketing Officer at Bit.com. We also have Myrtle Anne Ramos, the founder of the Award Winning Blockchain, Crypto, Defi, NFT, IoT, AI, and Metaverse PR Firm Block Tides. She is also in the Global Advisory Board of the International Council of E-Commerce. Yvonne Siow, the one who created Web 3.0 strategic models where community and purpose converge....",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "S3cco",
      "created_time": "January 12, 2023, 06:56:33 PM",
      "body": "Crypto Industry Key Topics to be Explored at Blockchain Fest Singaporehttps://bitcoingarden.org/crypto-industry-key-topics-to-be-explored-at-blockchain-fest-singapore/On 16-17 February 2023, thousands of professionals in the Blockchain, Exchanges, Cryptocurrencies, NFTs, DeFi, Mining, Gaming, Online Payments, Investment, and FinTech Industries will gather at the Marina Bay Sands Convention Center for the Blockchain Fest Singapore 2023.The two-day event will feature a range of interactive sessions and panel discussions on a variety of topics, including Blockchain and Cryptocurrency Laws and Regulations 2023, featuring Surya Sarella, CEO of Blocksol Media, Jonathan C. Dunsmoor, founder and principal of Dunsmoor Law, and Anndy Lian, best-selling book author of ‘NFT: From Zero to Hero’. Another highlight of the event will be a discussion on “How Blockchain and Cybersecurity Work Together”.There will be a freeside chat session on the topic. One of the standout topics for the event is “True Digital Ownerships with DeFi & NFTs”, featuring Jonas Thuerig, Head of F10 Asia at F10 Global, and Krinza Momin, Developer Relations Engineer at Ankr....",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "S3cco",
      "created_time": "February 07, 2023, 05:16:26 PMLast edit: February 09, 2023, 02:29:24 PM by S3cco",
      "body": "Countdown to the Blockchain Fest Singapore 2023:https://bitcoingarden.org/countdown-to-the-blockchain-fest-singapore-2023/ As the countdown to the highly anticipated Blockchain Fest Singapore 2023 begins, the countdown is officially on! FINEXPO, one of the world’s leading companies specializing in the organization of financial, trading, international events, fairs and expos, is proud to present Blockchain Fest 2023 in Marina Bay Sands Convention Center, Singapore on 16-17 February 2023. The event will gather leading professionals, global leaders and beginners in the areas of blockchain, cryptocurrency, crypto exchanges, decentralized finance (DeFi), mining, payment systems, and investment sectors.As part of the event, there will be a pre-party for VIPs only at Maison Ikkoku on 15 February from 4 PM onwards. This exclusive opportunity will bring together development teams, traders, OTC providers, fund managers, centralized exchanges, DeFi protocols, and NFT artists to network and collaborate.The two-day event will feature a packed schedule of keynote speeches and panel discussions that will address a wide range of topics related to the blockchain and cryptocurrency industry in an effort to provide a complete. In order to view the complete agenda and to register....",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}