{
  "id": "topic_5426007",
  "title": "Fiatless",
  "author": "Fiatless",
  "created_time": "December 06, 2022, 04:25:52 PM",
  "content": "Indonesia's legislative arm has passed a new law that criminalizes sex before or outside marriage. People convicted of extramarital sex could face as much as one year in prison.This law would also affect foreigners and tourists that came to visit the country. Some citizens of the country are protesting against this law. While others are seeing it as a welcome development.Business owners in the country are lamenting that this law can discourage tourists from visiting the country which would affect their businesses negatively. I am also perceiving that this policy might also scare investors from investing in Indonesia. But some religious business owners are of the view that this policy would attract business to the country from other religious or conservative nations or investors.What are your thoughts?https://www.bbc.com/news/world-asia-63869078",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5426007",
  "comments": [
    {
      "author": "South Park",
      "created_time": "December 06, 2022, 04:39:21 PM",
      "body": "Quote from: Fiatless on December 06, 2022, 04:25:52 PMIndonesia's legislative arm has passed a new law that criminalizes sex before or outside marriage. People convicted of extramarital sex could face as much as one year in prison.This law would also affect foreigners and tourists that came to visit the country. Some citizens of the country are protesting against this law. While others are seeing it as a welcome development.Business owners in the country are lamenting that this law can discourage tourists from visiting the country which would affect their businesses negatively. I am also perceiving that this policy might also scare investors from investing in Indonesia. But some religious business owners are of the view that this policy would attract business to the country from other religious or conservative nations or investors.What are your thoughts?https://www.bbc.com/news/world-asia-63869078Those kind of laws are very difficult to enforce, however in countries were similar laws are in place if for example you want to stay at a hotel with a person of the opposite sex you will need to stay in different rooms, so this could raise the costs for couples which are not married or for friends, which could indeed reduce tourism, however it would be interesting to see what has been the effect in other countries which have passed similar laws before.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "December 06, 2022, 05:27:21 PM",
      "body": "tin foil hat narrative i can see happeningpeople claim that women should not sit in cars with men unless married. and should not visit men in cafe's, as the future tin foil had fear.. howeverthis law was originally designed to stop child sex trafficking and prostitution. (the big problem of indonesia)however the religious groups have took it to extremes of making adult consensual sex illegal outside the marriage. (unhappy in your marriage due to cheating, report your spouse to the police)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ahli38",
      "created_time": "December 06, 2022, 05:45:11 PM",
      "body": "If those of you who talk about this are Indonesians. So I think you will know that actually Indonesia has long banned adultery or having sex outside of marriage. even in the source you linked it was also explained that the law regarding sex outside of marriage had existed before but was not enforced. and the new law has only been slightly modified or clarified, namely to prohibit sex outside of marriage in its entirety.while the old law only prohibited sex outside of marriage with non-married couples themselves. like the prohibition of the husband having sex with women other than his wife.So this problem does not need to be exaggerated. because actually this thing has been around for a long time.And remember that in Indonesia only accept citizens who are religious. so that Atheists are not allowed in Indonesia based on the 1st PANCASILA, namely Belief in One Almighty God. So that Indonesian citizens are required to have a religion. while in all religions it is said that sex outside of marriage is prohibited. So the law prohibiting sex outside of marriage is actually in line with Pancasila No. 1. although humans have their own rights. But if he has Religion. then he is also obliged to comply with the rules of the religion he adheres to.And once again that this law is nothing new. because almost the same law has existed in Indonesia since the beginning of Indonesia's independence.And as we can see, Indonesia's Economic Sector will be fine.And because Indonesia's majority population is Muslim, this law will actually be welcomed by its citizens. and in fact many countries already have the same laws regarding the prohibition of sex outside of marriage as in Qatar, Saudi Arabia, Iran, Afghanistan, Pakistan, Somalia, Sudan, Philippines, Egypt, Malaysia. And many more and All is well. sourch : LinkAnd when talking about business. Maybe some businesses will be affected by this law. But only part of the business. And because this Law is not entirely new. so actually businesses in Indonesia are used to this. Actually, the punishment for sex outside of marriage in Indonesia is quite light when compared to Arab countries like Qatar, where the applicable sentence is 7 years in prison. Sourch : google",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Findingnemo",
      "created_time": "December 06, 2022, 06:25:08 PM",
      "body": "Its their country and their policy doesn't seem to be harming anyone unless they are violating it but how they are going to implement it? I don't know they have enough infrastructure to monitor all the things happening in their country especially some Islands are famous for foreign visitors so this will wnd up in more corruption and nothing else.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Anonylz",
      "created_time": "December 06, 2022, 06:36:20 PM",
      "body": "Quote from: Fiatless on December 06, 2022, 04:25:52 PMIndonesia's legislative arm has passed a new law that criminalizes sex before or outside marriage. People convicted of extramarital sex could face as much as one year in prison.This law would also affect foreigners and tourists that came to visit the country. Some citizens of the country are protesting against this law. While others are seeing it as a welcome development.Business owners in the country are lamenting that this law can discourage tourists from visiting the country which would affect their businesses negatively. I am also perceiving that this policy might also scare investors from investing in Indonesia. But some religious business owners are of the view that this policy would attract business to the country from other religious or conservative nations or investors.What are your thoughts?https://www.bbc.com/news/world-asia-63869078Yeah it will affect some part of their business that is somewhat connected to tourism because the tourists coming from other countries don't have such laws  and they are use to socialising in such ways. In this case, they don't have much choice than to adapt to the new laws if the government is not ready to make any form of amendment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coupable",
      "created_time": "December 06, 2022, 06:44:29 PM",
      "body": "Quote from: Fiatless on December 06, 2022, 04:25:52 PMIndonesia's legislative arm has passed a new law that criminalizes sex before or outside marriage. People convicted of extramarital sex could face as much as one year in prison.This law would also affect foreigners and tourists that came to visit the country. Some citizens of the country are protesting against this law. While others are seeing it as a welcome development.This is one of the most foolish decisions ever. This will expose the largest profitable sector in the economy (tourism) to a decline to record levels. Of course, do not believe that this law will prevent people from having sex outside marriage, because this is human nature that cannot be restricted by customary provisions.The most logical explanation for issuing such a decision is that Indonesia will receive support from one of the major Islamic countries, such as Saudi Arabia or Qatar, and it needed to prove that it is a real Muslim country, since Indonesia is the country with the largest number of Muslims around the world.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dickiy",
      "created_time": "December 06, 2022, 07:05:33 PM",
      "body": "I don't think it will have a significant impact on the Indonesian economy in connection with the passage of this law, especially regarding investors, in my opinion, it is just a trick for those who have businesses like that, and if such entrepreneurs want to continue operating they can do it in secret.I think the Indonesian government is now playing it safe from sentiment with the people there.Talking about investment, Indonesia has received sizable investment funds from big countries for the advancement of its industry at the G20 Summit last November in Bali and I see that Indonesia prioritizes the use of existing natural resources and even stops exporting abroad for domestic production. Naturally, if Indonesia no longer pays attention to such industries.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kryptqnick",
      "created_time": "December 06, 2022, 07:12:55 PM",
      "body": "The law is very unexpected, given the real life and the 21st century we live in. Since it is going to affect not only the citizens but also foreigners, I think it will have adverse economic effects because I am not sure foreigners would want to live in a country or even visit a country where they can be imprisoned for living together and having sex without marriage. Harsh legislation can also play a negative role when it comes to foreign investments, as it signifies an unstable political climate (if they can imprison people for sex, what's going to be banned next?). Outside Indonesia, though, I don't think we'll feel the economic impact of this decision.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blockman",
      "created_time": "December 06, 2022, 07:22:38 PM",
      "body": "That surely will affect the tourism of that country. Most people know that when foreigners arrived in their country, it's more than the tourism that they need.And, when such laws have been passed it'll be a basis for tourists to avoid Indonesia because they don't want to get in jail or face some problems just because of it.That's why if there are businesses protesting on this law, it is because they know that they'll be affected by it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "December 06, 2022, 07:42:10 PM",
      "body": "when it comes to law and religion.. i never just look at it as a rule to just abide by because law/religion. i like to research the origins of the reasonsEG christianity banned gays because of STD's in the roman era of thousands of years agoreligion relaxed that when contraception and medication became a solutionsex before marraige was about child abuse. sex outside of marriage was about prostitution and splitting the family up in the aftermath of the spouse finding out. knowing the WHY's aid in what the reason for rules should exist. and if there why's are not fitting the modern abilities of today the rules should not applyEG making prostitution and underage sex illegal means that it free's up the need to outlaw \"sex outside of marriage\" so that people can have sex with someone they like. to then marry them. rather then the other way round. marrying them to then find out they are crap in bed and you want a diverse",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MArsland",
      "created_time": "December 06, 2022, 07:54:40 PM",
      "body": "Quote from: Fiatless on December 06, 2022, 04:25:52 PMIndonesia's legislative arm has passed a new law that criminalizes sex before or outside marriage. People convicted of extramarital sex could face as much as one year in prison.This law would also affect foreigners and tourists that came to visit the country. Some citizens of the country are protesting against this law. While others are seeing it as a welcome development.Business owners in the country are lamenting that this law can discourage tourists from visiting the country which would affect their businesses negatively. I am also perceiving that this policy might also scare investors from investing in Indonesia. But some religious business owners are of the view that this policy would attract business to the country from other religious or conservative nations or investors.What are your thoughts?https://www.bbc.com/news/world-asia-63869078What's the problem for you, our country is indeed a country that has the right to anything and any policies in order to maintain its own sovereignty. I think you are consuming too much news from one side and one source for referrals. FunnyIf you are Indonesian, you see that a strong country is a country that establishes its own rules, not subject to being dictated by western countries. After all, if you know Bali, then the rules for foreigners are relaxed as a form of respecting their customs. Don't pretend that one generalized rule is bad.In all beliefs sex outside marriage is not allowed Christianity, Buddhism, and Catholicism. Even if you read the Old Testament. Moreover, Indonesia is a majority Islamic country and that is their rule.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "December 06, 2022, 07:58:23 PM",
      "body": "Quote from: naira on December 06, 2022, 07:54:40 PMIn all beliefs sex outside marriage is not allowed Christianity, Buddhism, and Catholicism. Even if you read the Old Testament. Moreover, Indonesia is a majority Islamic country and that is their rule.we all understand that. but instead of just saying \"them the rules\" or more preciously \" Indonesia is a majority Islamic country and that is their rule.\" do you ever question the reason and the need of the rule. what does it protect or prevent. and are those rules still fit for purpose. or have those original rules been extremitised outside their origin purpose where by it now affects many things outside of their base purposei can understand sex before marriage can be troublesome for the young that are not ready for a sexual life.i can understand that cheating breaks up a marriagebut when 2 adults of mentally ready age, fall inlove. having to get them to be married before they can find out if they can 'fit' together. enforces unwanted marriages. where your stuck with someone that does not satisfy you",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MArsland",
      "created_time": "December 06, 2022, 08:12:48 PM",
      "body": "Quote from: franky1 on December 06, 2022, 07:58:23 PMwe all understand that. but instead of just saying \"them the rules\" or more preciously \" Indonesia is a majority Islamic country and that is their rule.\" do you ever question the reason and the need of the rule. what does it protect or prevent. and are those rules still fit for purpose. or have those original rules been extremitised outside their origin purpose where by it now affects many things outside of their base purposei can understand sex before marriage can be troublesome for the young that are not ready for a sexual life.i can understand that cheating breaks up a marriagebut when 2 adults of mentally ready age, fall inlove. having to get them to be married before they can find out if they can 'fit' together. enforces unwanted marriages. where your stuck with someone that does not satisfy youIsn't it better to prevent than nothing? I know that everything is run according to the principles of a country. But if the rules only focus on the economic sector without paying attention to other sectors, what is the main basis? Indonesia has other economic resources, but that doesn't mean we don't appreciate foreign tourists who come with their culture. Visiting Bali, all tourists are greeted with what they are accustomed to, but not in all parts of Indonesia.This is the difference that we need to appreciate, you might generalize that compatibility can only be felt and proven by having sex. Oh, is it that simple to get married? Marriage is not just to satisfy desire alone, marriage is much bigger in purpose. Perfecting each other, accepting born and inner all of each other's shortcomings. Talking about satisfaction? can be searched for and worked on together, that is the beauty of marriage, doesn't it mean that when you don't have sex with your wife, you have to have an affair?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stomachgrowls",
      "created_time": "December 06, 2022, 08:50:20 PM",
      "body": "Quote from: Findingnemo on December 06, 2022, 06:25:08 PMIts their country and their policy doesn't seem to be harming anyone unless they are violating it but how they are going to implement it? I don't know they have enough infrastructure to monitor all the things happening in their country especially some Islands are famous for foreign visitors so this will wnd up in more corruption and nothing else.For sure there would really be those under the table kind or type of transactions but totally this isnt something that could really be monitored out on 100% precision as these things do happen in private and there's no way that they could be having those camera and staffs or agent everywhere to monitor out on each citizens activity or something like connected on sex.As for business talks then it would really be mainly be affectingthose who are really that in connected with sexual aspect.Just like the rest been saying that its their country then its their law to be imposed and its citizens doesnt really have that choice but to follow on whats mandated and on whats been prohibited.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coolcoinz",
      "created_time": "December 06, 2022, 08:54:08 PM",
      "body": "Quote from: Ahli38 on December 06, 2022, 05:45:11 PMIf those of you who talk about this are Indonesians. So I think you will know that actually Indonesia has long banned adultery or having sex outside of marriage. even in the source you linked it was also explained that the law regarding sex outside of marriage had existed before but was not enforced. and the new law has only been slightly modified or clarified, namely to prohibit sex outside of marriage in its entirety.while the old law only prohibited sex outside of marriage with non-married couples themselves. like the prohibition of the husband having sex with women other than his wife.The reason why people ignored the law is because it was stupid. It has been long debated whether we should obey laws that are outright stupid or oppressive. Let's say that someone decides you no longer can use a mobile phone, or that you are not allowed to drink alcohol, even at home. I feel like there's a huge difference between not allowing married people to have sex outside marriage and not allowing any unmarried couple to do it. Having sex is a natural human interaction. People meet, start dating, have sex, get married - this is how it's done everywhere.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "December 06, 2022, 09:05:47 PM",
      "body": "Quote from: naira on December 06, 2022, 08:12:48 PMQuote from: franky1 on December 06, 2022, 07:58:23 PMwe all understand that. but instead of just saying \"them the rules\" or more preciously \" Indonesia is a majority Islamic country and that is their rule.\" do you ever question the reason and the need of the rule. what does it protect or prevent. and are those rules still fit for purpose. or have those original rules been extremitised outside their origin purpose where by it now affects many things outside of their base purposei can understand sex before marriage can be troublesome for the young that are not ready for a sexual life.i can understand that cheating breaks up a marriagebut when 2 adults of mentally ready age, fall inlove. having to get them to be married before they can find out if they can 'fit' together. enforces unwanted marriages. where your stuck with someone that does not satisfy youIsn't it better to prevent than nothing? I know that everything is run according to the principles of a country. But if the rules only focus on the economic sector without paying attention to other sectors, what is the main basis? Indonesia has other economic resources, but that doesn't mean we don't appreciate foreign tourists who come with their culture. Visiting Bali, all tourists are greeted with what they are accustomed to, but not in all parts of Indonesia.\"better than nothing?\"no one said remove all laws because it doesnt fit the other cultures that want to visit.. its not about remove all laws to get tourists to come.. its about tailoring laws to the current modern lifestyles and need of a population foreign and domestic, due to laws actually making senseEG if the main premiss of no sex outside of a wedding was for 2 thingsreduce prostitution/child sex trafficking. instead of a broad rule that stops any sex unless its inside of wedlock. set rules for prostitution and child abuse. that way it still meets the goal without limiting other lifestyle things that people do want to experience. imagine it this way.. imagine your a woman. you meet a guy you have a crush, you flirt you kiss but dont do anything sexual until wedding day. that night you find out he as a little nubby that does nothing for you sexually. or he has a massive wang that hurts every time.. and now your stuck for the next 60 years with a guy that cant satisfy you. so you end up cheating anyway..same goes for the guy would he want to stay loyal to a woman that says \"nope\" each night for 60 years or it only happens if he pushes her thus it doesnt feel intimate and instead feels like a choredid the law really solve anything? nope.adding laws to force a woman to satisfy a guy. is then not a good law to add to the unsatisfied husbands situation instead have laws that meet the needs. stopping child exploitation and prostitution and STD spreading. but allow consenting adults to explore and find their soulmate that fits and satisfies them to then marry and be happy for 60 years to not need to cheat on or catch STD via other partners. its not about a rule for sake of rule. or a outlaw if rule doesnt fit.. its about the right rules for the right reasons",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MArsland",
      "created_time": "December 06, 2022, 09:09:56 PM",
      "body": "Quote from: coolcoinz on December 06, 2022, 08:54:08 PMQuote from: Ahli38 on December 06, 2022, 05:45:11 PMIf those of you who talk about this are Indonesians. So I think you will know that actually Indonesia has long banned adultery or having sex outside of marriage. even in the source you linked it was also explained that the law regarding sex outside of marriage had existed before but was not enforced. and the new law has only been slightly modified or clarified, namely to prohibit sex outside of marriage in its entirety.while the old law only prohibited sex outside of marriage with non-married couples themselves. like the prohibition of the husband having sex with women other than his wife.Having sex is a natural human interaction. People meet, start dating, have sex, get married - this is how it's done everywhere.Unfortunately, Op is discussing a certain country, maybe where you live the stages are like that but in our country, we get married first and then have sex. So in our country, not everything is generalized like that and cannot be equated with the stages you mentioned. I think everything is clear, I appreciate your concept! For us, a woman needs to be kept pure.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "December 06, 2022, 09:13:53 PM",
      "body": "Quote from: naira on December 06, 2022, 09:09:56 PMa woman needs to be kept pure.for what reason?a. to be \"tight\" to allow the males nubby to feel the inner lining of her genitals? (seems one sided and selfish)b. STD prevention?c. have no other experience to compare so think that bad sex is normal and just put up with a guy that cant do it right?explain why you think a woman needs to limit her life experiences for the gratification of a man(im male but i can see the gender equality/inequality of the issues)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MArsland",
      "created_time": "December 06, 2022, 09:22:48 PM",
      "body": "Quote from: franky1 on December 06, 2022, 09:13:53 PMQuote from: naira on December 06, 2022, 09:09:56 PMa woman needs to be kept pure.for what reason?a. to be \"tight\" to allow the males nubby to feel the inner lining of her genitals? (seems one sided and selfish)b. STD prevention?c. have no other experience to compare so think that bad sex is normal and just put up with a guy that cant do it right?explain why you think a woman needs to limit her life experiences for the gratification of a man(im male but i can see the gender equality/inequality of the issues)Sorry, as a Muslim, I think it's an obligation that women need to be kept chaste before marriage. And sorry, maybe we don't share the same beliefs, so it's only natural for you to say so. It doesn't matter, but the context needs to be scrutinized friends, we focus on the context of one country, and what we talk about needs to refer to the rules of that country. Not compared to foreign countries that already have different rules from this point of view.Can we get back on track as per the OP's topic? if the OP didn't mention a specific country, then you're free to speak broadly about such and such a policy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}