{
  "id": "topic_5467567",
  "title": "Skrhsws",
  "author": "Skrhsws",
  "created_time": "September 21, 2023, 11:04:33 AM",
  "content": "HelloRecently I have recovered and old wallet of mine from a really old laptop. I used to have Bitcoin Core on it but I have forgotten the password. By checking the wallet on the blockchain it shows it has just over 1 BTC but in the application it says balance not available.Also I cannot cash out on the funds as the wallet is password protected. I followed a YouTube video on bruteforcing the wallet.dat file but no luck.I contacted people online and they asked to send over the file but I'm quite hesitant. I need some advice here. Thanks",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5467567",
  "comments": [
    {
      "author": "Orpichukwu",
      "created_time": "September 21, 2023, 11:08:03 AMLast edit: September 21, 2023, 11:18:07 AM by Orpichukwu",
      "body": "Quote from: Skrhsws on September 21, 2023, 11:04:33 AMI contacted people online and they asked to send over the file but I'm quite hesitant. I need some advice here. ThanksDon't ever make the mistake of sending your file to anyone; they will not help you; instead, they will look for a way to crack the file and steal your crypto from it.Lucky for you, you discovered this forum. I believe you can get a lot of help here. If there's any possibility left for you to use and recover your funds, we have experienced members who are always willing to help.This topic could have been best suited for . Bitcoin technical  or  wallet software   I don't know the best place, but these two boards have enough members who have technical knowledge active there.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OmegaStarScream",
      "created_time": "September 21, 2023, 11:08:35 AMLast edit: September 21, 2023, 11:55:02 AM by OmegaStarScream",
      "body": "Do you have the slightest idea about the complexity of the password? Like at its length, whether you used digits, special characters, etc.? If so, then you might be able to recover the funds.Which services did you reach out to by the way? This one[1] is trustworthy. I dealt with him before, but make sure to do your own research first.[1] https://www.walletrecoveryservices.com/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AYOBA",
      "created_time": "September 21, 2023, 11:59:06 AM",
      "body": "Quote from: Skrhsws on September 21, 2023, 11:04:33 AMI contacted people online and they asked to send over the file but I'm quite hesitant. I need some advice here. ThanksNo one is trusted online, so always be careful with such kind people. You did well as you refused to send your file to them because they're not after to help you; they're only looking for a way how they can cheat you. You will learn more about how to prevent such occurrences as you introduce yourself to this amazing forum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Findingnemo",
      "created_time": "September 21, 2023, 04:16:52 PM",
      "body": "Quote from: Skrhsws on September 21, 2023, 11:04:33 AMRecently I have recovered and old wallet of mine from a really old laptop. I used to have Bitcoin Core on it but I have forgotten the password. By checking the wallet on the blockchain it shows it has just over 1 BTC but in the application it says balance not available.First of all, make sure that your wallet has a balance by visiting any of the Bitcoin blockchain explorers. Bitcoin core is supposed to show the balance but you are saying the balance is not available.Quote from: OmegaStarScream on September 21, 2023, 11:08:35 AMDo you have the slightest idea about the complexity of the password? Like at its length, whether you used digits, special characters, etc.? If so, then you might be able to recover the funds.Which services did you reach out to by the way? This one[1] is trustworthy. I dealt with him before, but make sure to do your own research first.[1] https://www.walletrecoveryservices.com/Wallet recovery services are the only legitimate recovery services available as far as I know so try contacting them. But if he might have any idea about few words in the password then he might able to crack it on his own with tool such btcrecover .",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SamReomo",
      "created_time": "September 21, 2023, 07:06:58 PMLast edit: September 22, 2023, 08:44:12 AM by SamReomo",
      "body": "Quote from: Skrhsws on September 21, 2023, 11:04:33 AMHelloRecently I have recovered and old wallet of mine from a really old laptop. I used to have Bitcoin Core on it but I have forgotten the password. By checking the wallet on the blockchain it shows it has just over 1 BTC but in the application it says balance not available.Can you please show us a screenshot of the message where its says the balance is not available and do you have even a slight idea about the password that you used? You mean you checked the wallet address on a block explorer and there the balance appears to be over 1 Bitcoin. I recommend you to check the balance once again on https://blockchair.com/ and then take a screenshot of it and share that screenshot here so we can be confirmed that you are really trying to recover your own wallet's password and it has balance in it. You can blur the wallet address from that screenshot for privacy reasons but at least we can get the idea that really the wallet is present in blockchain and you're the owner of it. The only option you have to know that password is to brute-force it because you have forgotten the password and trusting someone else about it not going to be helpful at all.I would recommend you to rent a good beefy setup and then try to brute-force the encrypted wallet because brute-forcing require much powerful hardware and if you tried it using a normal pc then that isn't sufficient enough to crack those passwords. I would also recommend you to be careful from online recovery services because they can't be trusted at all.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitMaxz",
      "created_time": "September 21, 2023, 08:14:07 PM",
      "body": "I just want to add this if you are going to use the service from walletrecoverysevicea.com but don't trust them to send your wallet.dat then learn how to extract the password hash. You can submit only the hash.txt to them to brute force the password without giving your original wallet.dat file.Check my old post below how to extract the hash of your wallet.- https://bitcointalk.org/index.php?topic=5309200.msg56090163#msg56090163",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Skrhsws",
      "created_time": "September 22, 2023, 12:38:09 AM",
      "body": "Quote from: SamReomo on September 21, 2023, 07:06:58 PMQuote from: Skrhsws on September 21, 2023, 11:04:33 AMHelloRecently I have recovered and old wallet of mine from a really old laptop. I used to have Bitcoin Core on it but I have forgotten the password. By checking the wallet on the blockchain it shows it has just over 1 BTC but in the application it says balance not available.Can you please show us a screenshot of the message where its says the balance is not available and do you have even a slight idea about the password that you used? You mean you checked the wallet address on a block explorer and there you the balance appears to be over 1 Bitcoin. I recommend you to check the balance once again on https://blockchair.com/ and then take a screenshot of it and share that screenshot here so we can be confirmed that you are really trying to recover your own wallet's password and it has balance in it. You can blur the wallet address from that screenshot for privacy reasons but at least we can get the idea that really the wallet is present in blockchain and you're the owner of it. The only option you have to know that password is to brute-force it because you have forgotten the password and trusting someone else about it not going to be helpful at all.I would recommend you to rent a good beefy setup and then try to brute-force the encrypted wallet because brute-forcing require much powerful hardware and if you tried it using a normal pc then that isn't sufficient enough to crack those passwords. I would also recommend you to be careful from online recovery services because they can't be trusted at all.Hey heres a screenshot, the balance was unavailable as the application isnt synced yet. https://imgur.com/a/A8w3WtxAlso here is the address on the blockchainhttps://blockchair.com/bitcoin/address/1AxhH9CKkP1WBoT9bF1jFQo2nEdPDooP4i",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nc50lc",
      "created_time": "September 22, 2023, 06:52:24 AM",
      "body": "Quote from: Skrhsws on September 21, 2023, 11:04:33 AMAlso I cannot cash out on the funds as the wallet is password protected. I followed a YouTube video on bruteforcing the wallet.dat file but no luck.This will be your main issue.That \"balance not available\" isn't too much since after you fully sync your blockchain to the network, that 'triangle ! icon' will disappear.First of all, not even the developers can recover users' password from a server or some sort, only the owners know about their password.Bruteforcing is your only option so you need to at least know something about your password: parts of it, some characters, etc. to limit the search space.Without remembering any info, your only chance is if you've used a very short or simple password that can be bruteforced with 4~9 character combinations or \"dictionary attack\".Since you tried bruteforcing already, I'd guess that you've already done those simple bruteforce attacks, if not, try them.If you do not have the resources, I'd also suggest you to try the mentioned service by others above, the owner has quite the reputation.He wont accept it though if you do not have the slightest idea of the possible password.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o_e_l_e_o",
      "created_time": "September 22, 2023, 08:15:45 AM",
      "body": "Quote from: Skrhsws on September 21, 2023, 11:04:33 AMI followed a YouTube video on bruteforcing the wallet.dat file but no luck.What software did you try to bruteforce the wallet with?Before you enlist any third parties, I would encourage you to try yourself using https://btcrecover.readthedocs.io/. Make sure you make a back up copy of your wallet.dat first.We can guide you through the process of setting up a tokens file for your attempt, but as others have mentioned, you'll need to have some idea of what your password will look like. Letters, numbers, symbols? Uppercase, lowercase? Any words or patterns? Dates? Names? What other passwords were you using at the time? Will this password be similar?Quote from: Findingnemo on September 21, 2023, 04:16:52 PMBut if he might have any idea about few words in the password then he might able to crack it on his own with tool such btcrecover .The version you have linked is very out of date and hasn't been maintained in 6 years. This is the active fork:https://github.com/3rdIteration/btcrecoverhttps://btcrecover.readthedocs.io/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SamReomo",
      "created_time": "September 22, 2023, 09:06:07 AM",
      "body": "Quote from: Skrhsws on September 22, 2023, 12:38:09 AMHey heres a screenshot, the balance was unavailable as the application isnt synced yet. Also here is the address on the blockchainhttps://blockchair.com/bitcoin/address/1AxhH9CKkP1WBoT9bF1jFQo2nEdPDooP4iGood job, now that you have proved that you're the real owner of the account and now you should sync your Bitcoin core with Bitcoin Network and once syncing is completed then try to recheck if the balance appears there or not. If even after syncing Bitcoin core that balance unavailable message still appears then you will have to brute-force the password once again.  I must say that brute-forcing the password requires some very powerful hardware and those hardware will not help in brute-forcing it until you don't know some part of the password. In that case you will have to rely on a legit crypto recovery service to brute-force the password for you and you'll have to do that at your own risk. That's the only available option for you, but if you have some idea about the password then you can still try your luck by brute-forcing it yourself once again.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ABCbits",
      "created_time": "September 22, 2023, 09:43:49 AM",
      "body": "Before another attempt to crack your wallet.dat file, i would advice you to,1. Backup wallet.dat, preferably on different secure device or storage drive.2. Write down everything you remember, such as characteristic of your password and what you've tried so far.3. Check all personal data on your old laptop and online service (e.g. email, storage, note) you use. Who knows you might write down hint or even the password itself.4. Do you currently or used to have habit of reusing same/similar password? If yes, that could be hint to brute-force faster.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nc50lc",
      "created_time": "September 22, 2023, 10:44:57 AM",
      "body": "Quote from: SamReomo on September 22, 2023, 09:06:07 AMGood job, now that you have proved that you're the real owner of the account and now you should sync your Bitcoin core with Bitcoin Network and once syncing is completed then try to recheck if the balance appears there or not. If even after syncing Bitcoin core that balance unavailable message still appears then you will have to brute-force the password once again.  Take note that providing screenshot of Bitcoin Core's main tab proves nothing since anyone can do that with any bought, given or tampered wallet.dat files.Proof can be anything that involves the usage of that address' private key like signing a message or spending an agreed amount of satoshi at a given time.So for now, we should just assume that it's his lost old wallet as he told. (being skeptical isn't bad either)Also, the \"balance unavailable\" has nothing to do with the password since Bitcoin Core encrypted wallets can show balance even if it stay locked.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SamReomo",
      "created_time": "September 22, 2023, 11:29:19 AM",
      "body": "Quote from: nc50lc on September 22, 2023, 10:44:57 AMTake note that providing screenshot of Bitcoin Core's main tab proves nothing since anyone can do that with any bought, given or tampered wallet.dat files.Proof can be anything that involves the usage of that address' private key like signing a message or spending an agreed amount of satoshi at a given time.So for now, we should just assume that it's his lost old wallet as he told. (being skeptical isn't bad either)I agree with you that providing a screenshot will not prove that someone is the owner of the wallet, but I asked that in order to see that what's happening on his side. The guy also provided us with his wallet address via blockchair link and that's why I said that he's the owner of the wallet and has access to wallet.dat file. I know that people can share someone else's wallet address and they can have screenshots of Bitcoin Core's main tab in order to prove that they own the wallets. But in this case the guy seems genuine I guess and he has tried his best to decrypt the wallet himself but didn't get any success in decrypting the wallet.Quote from: nc50lc on September 22, 2023, 10:44:57 AMAlso, the \"balance unavailable\" has nothing to do with the password since Bitcoin Core encrypted wallets can show balance even if it stay locked.I guess when the wallet is encrypted then it's required to enter the password in order to view the balance and transactions. Sometimes when core is not synced fully that can be another reason to show the message \"balance unavailable.\"",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pmalek",
      "created_time": "September 23, 2023, 07:41:22 AM",
      "body": "Quote from: SamReomo on September 22, 2023, 09:06:07 AMGood job, now that you have proved that you're the real owner of the account and now you should sync your Bitcoin core with Bitcoin Network and once syncing is completed then try to recheck if the balance appears there or not. That doesn't fix the underlying problem, and that is that he can't spend his coins without the password that he has lost. The balance is already confirmed by looking at the information available on blockchain explorers. Seeing the coins appear as available in his Bitcoin Core software doesn't bring OP any closer to getting access to them.Quote from: Stablexcoin on September 22, 2023, 08:16:04 PMI was quite happy when i heard it had over 1 BTC in the application i would have suggested you try sweeping them using Electrum. Download from www.electrum.org or use BlueWallet on Android or iOS He doesn't have the password, remember! If he had the private key for the address that holds the coins, there would be no need for this thread and he could spend the coins at any time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Odohu",
      "created_time": "September 24, 2023, 02:52:33 PM",
      "body": "Quote from: Skrhsws on September 21, 2023, 11:04:33 AMI contacted people online and they asked to send over the file but I'm quite hesitant. I need some advice here. ThanksYou are lucky to have arrived here before sending them the requested file. Hopefully you have learnt that you would have made a serious mistake sending the data to them. 1BTC is a huge amount of money to loose. I'm glad you shared this here so others can learn.Quote from: Orpichukwu on September 21, 2023, 11:08:03 AMQuote from: Skrhsws on September 21, 2023, 11:04:33 AMI contacted people online and they asked to send over the file but I'm quite hesitant. I need some advice here. ThanksDon't ever make the mistake of sending your file to anyone; they will not help you; instead, they will look for a way to crack the file and steal your crypto from it.Lucky for you, you discovered this forum. I believe you can get a lot of help here. If there's any possibility left for you to use and recover your funds, we have experienced members who are always willing to help.This topic could have been best suited for . Bitcoin technical  or  wallet software   I don't know the best place, but these two boards have enough members who have technical knowledge active there. Thanks for this clue. I have been in this situation before and I actually lost my funds to the scammers. I was just lucky it was not huge amount so it was very easy moving on. There always people out there waiting to take advantage of others and that make it necessary for people to put extra effort in terms of security.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Smartprofit",
      "created_time": "September 25, 2023, 09:16:33 PM",
      "body": "Of course, under no circumstances transfer the file to third parties.  This is almost guaranteed to result in you losing money.  Your main task now is to be able to recover your wallet password.  How to do it?  In NLP (neurolinguistic programming) there is such a thing as an anchor.  When you came up with the password, you were in a certain psychological state.  This psychological state was associated with certain external objects, for example, the room you were in, the music you were listening to at that moment, etc. These external objects in NLP are called external anchors.  If you can remember which external anchors are associated with the psychological state in which you came up with the wallet password at that moment, then you will be able to recover the password itself.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}