{
  "id": "topic_5469383",
  "title": "Mr. Magkaisa",
  "author": "Mr. Magkaisa",
  "created_time": "October 06, 2023, 07:57:53 AMLast edit: October 06, 2023, 08:29:14 AM by Mr. Magkaisa",
  "content": "Quote    -   Hello mga kabayan ko dito sa ating lokal seksyon, may isa na namang magandang balita para sa ating mga OFW na nagpapadala ng pera para sa kanilang mga mahal sa buhay dito sa bansa natin. Ano ang magandang balita ito? Siyempre ang Moneygram ay magla launch ng kanilang non-custodial crypto wallet sa susunod na taon 2024 first quarter gamit ang network ng stellar.Ibig sabihin ang makikinabang dito ng husto ang ating mga bayani na OFW na nagpapadala ng kanilang suporta sa kanilang mga pamilya. Siyempre ang advantage nito ay makakabawas ito ng costing, although meron siyang KYC which is normal naman dahil si Moneygram ay talagang humihingi ng KYC dahil remitance outlet ito. Ika nga ay \" Moneygram is now turning into a global ATM concept gamit ang Blockchain Technology \".Alam naman din natin kasi na kapag magpapadala ang ating mga OFW sa kanilang pamilya ay inaabot ng ilang araw bago marecieved at dahil gagamit na ng blockchain ay mas mapapabilis na ngayon at mas mapapamura pa sigurado yan.Source: https://cointelegraph.com/news/money-gram-non-custodial-crypto-wallets-q1-2024",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5469383",
  "comments": [
    {
      "author": "Johnyz",
      "created_time": "October 06, 2023, 08:20:56 AM",
      "body": "Crypto remittances is a big threat sa negosyo nila, and siguro naisip nila ito at need na talaga nila magadopt.Cheaper fees for our kababayan is a must, sana mas maging cheap pa at fast ang kanilang transaction.Money remittances should see this as a big challenge and a big improvement for them to adopt, Western Union should also do the same thing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gunhell16",
      "created_time": "October 06, 2023, 02:08:19 PM",
      "body": "Medyo magandang balita nga yan, sa ngayon dito sa pinas merong moneybees ba yun na nakipagpartnered sa Tambunting pawnshop sa mga nais bumili o magbenta ng Bitcoin ay pwede at ang pagbabatayan naman ay ang presyo sa moneybees. Tapos ngayon, eto naman international remittances na moneygram, mapapabilis talaga ang transaction nyan kapag konektado na sa blockchain sa pamamagitan ng stellar, at sa aking pagkakaalam din madaming gumagamit nyan sa bansang Canada na mga Filipinong ofw, kaya malaking tipid makukuha nila dyan for sure yan. Malalaunch pa siya next year mukhang kasagsagan pa ng halving o bull run.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "robelneo",
      "created_time": "October 06, 2023, 03:43:12 PM",
      "body": "Para makinabang ang mga kababayan natin dito need nila na ma educate kung ano ang blockchain at kung ano ang Cryptocurrency maintindihan nila ang technology na ito karamihan kasi ng mga kababayan natin sanay sa mga centralize na payment processor yung basta na lang sila magbabayad at kukunin na lang yung code ay yun ang papdala nila.Siguro magkakaroon ng similarity pero ganunpaman need nila mag dagdag ng kaalaman sa security at paano at ano ba ang Cryptocurrency, at dahil dito marami ng mga kababayan natin na maeenlighten sa kahalagahan ng Cryptocurrency at blockchain technology.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SFR10",
      "created_time": "October 06, 2023, 05:32:45 PM",
      "body": "Quote from: Mr. Magkaisa on October 06, 2023, 07:57:53 AMIbig sabihin ang makikinabang dito ng husto ang ating mga bayani na OFW na nagpapadala ng kanilang suporta sa kanilang mga pamilya. Siyempre ang advantage nito ay makakabawas ito ng costing,I'm not a MoneyGram user, pero if tama ang pagkakaintindi ko, ang bago lang sa balitang ito is the fact na maglalabas sila ng noncustodial wallet dahil mahigit isang taon na may crypto feature sa platform nila: Crypto, Meet Cash: New digital wallets activated by MoneyGram, built on StellarMoneyGram Access Demo",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rhomelmabini",
      "created_time": "October 06, 2023, 09:05:02 PM",
      "body": "Quote from: SFR10 on October 06, 2023, 05:32:45 PMQuote from: Mr. Magkaisa on October 06, 2023, 07:57:53 AMIbig sabihin ang makikinabang dito ng husto ang ating mga bayani na OFW na nagpapadala ng kanilang suporta sa kanilang mga pamilya. Siyempre ang advantage nito ay makakabawas ito ng costing,I'm not a MoneyGram user, pero if tama ang pagkakaintindi ko, ang bago lang sa balitang ito is the fact na maglalabas sila ng noncustodial wallet dahil mahigit isang taon na may crypto feature sa platform nila: Crypto, Meet Cash: New digital wallets activated by MoneyGram, built on StellarMoneyGram Access DemoMukhang ngayon lang talaga nila linalabas publicly considering malapit na ang halving at possible bull market na naman syempre makikinabang din naman sila lalo na sa transaction fees. Speaking of transaction fees hoping na it wouldn't turn out na hindi pang masa kasi most traditional remittances o mga bangko ang laki ng fees na kinukuha nila at sana naman hindi.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bhadz",
      "created_time": "October 07, 2023, 08:17:06 AM",
      "body": "Ito yung sinasabi dati, na \"If you can't beat them, join them.\"Parang ito na yung nangyayari sa mga kilalang financial companies na nasasagasaan yung services nila dahil sa cryptocurrencies. Lalo na ngayon na sobrang daming exchanges at ito lang naman gusto ng tao kung pano papalitan yung crypto sa totoong pera. Tapos itong monegram kilalang name na sa remittances din yan.Quote from: SFR10 on October 06, 2023, 05:32:45 PMI'm not a MoneyGram user, pero if tama ang pagkakaintindi ko, ang bago lang sa balitang ito is the fact na maglalabas sila ng noncustodial wallet dahil mahigit isang taon na may crypto feature sa platform nila: Crypto, Meet Cash: New digital wallets activated by MoneyGram, built on StellarMoneyGram Access DemoIsang taon na din pala silang may ganyang feature. Parang familiar nga pero di ko lang talaga maalala. Sana mas marami pang tulad nila na services ang mag adopt sa crypto.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bettercrypto",
      "created_time": "October 07, 2023, 09:48:19 AM",
      "body": "Quote from: bhadz on October 07, 2023, 08:17:06 AMIto yung sinasabi dati, na \"If you can't beat them, join them.\"Parang ito na yung nangyayari sa mga kilalang financial companies na nasasagasaan yung services nila dahil sa cryptocurrencies. Lalo na ngayon na sobrang daming exchanges at ito lang naman gusto ng tao kung pano papalitan yung crypto sa totoong pera. Tapos itong monegram kilalang name na sa remittances din yan.Quote from: SFR10 on October 06, 2023, 05:32:45 PMI'm not a MoneyGram user, pero if tama ang pagkakaintindi ko, ang bago lang sa balitang ito is the fact na maglalabas sila ng noncustodial wallet dahil mahigit isang taon na may crypto feature sa platform nila: Crypto, Meet Cash: New digital wallets activated by MoneyGram, built on StellarMoneyGram Access DemoIsang taon na din pala silang may ganyang feature. Parang familiar nga pero di ko lang talaga maalala. Sana mas marami pang tulad nila na services ang mag adopt sa crypto. Huwag kang mag-alala alam naman nating magsisisunuran din yung ibang mga remittances for sure sa hakbang na ginawang ito ng moneygram. Eto kasing stellar halos kaparehas lang din ng Ripple, kaya for sure kapag nasimulan na nila maglaunch ng kanilang non-custodial wallet siguradong downloadable ito, at malamang both parties dapat merong wallet na sinasabi yung magpapadala at tatanggap ng padala mula sa ibang bansa. Ang maganda lang dyan yung tatanggap ng mga padala mula sa mga Ofw ay magkakaroon din ng pamilyarization sa cryptocurrency or digitalization na tinatawag sa industry na ating ginagalawan kahit na wala pa silang alam dito sa crypto space.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bhadz",
      "created_time": "October 07, 2023, 12:12:04 PM",
      "body": "Quote from: bettercrypto on October 07, 2023, 09:48:19 AMQuote from: bhadz on October 07, 2023, 08:17:06 AMIto yung sinasabi dati, na \"If you can't beat them, join them.\"Parang ito na yung nangyayari sa mga kilalang financial companies na nasasagasaan yung services nila dahil sa cryptocurrencies. Lalo na ngayon na sobrang daming exchanges at ito lang naman gusto ng tao kung pano papalitan yung crypto sa totoong pera. Tapos itong monegram kilalang name na sa remittances din yan.Huwag kang mag-alala alam naman nating magsisisunuran din yung ibang mga remittances for sure sa hakbang na ginawang ito ng moneygram. Eto kasing stellar halos kaparehas lang din ng Ripple, kaya for sure kapag nasimulan na nila maglaunch ng kanilang non-custodial wallet siguradong downloadable ito, at malamang both parties dapat merong wallet na sinasabi yung magpapadala at tatanggap ng padala mula sa ibang bansa. Ang maganda lang dyan yung tatanggap ng mga padala mula sa mga Ofw ay magkakaroon din ng pamilyarization sa cryptocurrency or digitalization na tinatawag sa industry na ating ginagalawan kahit na wala pa silang alam dito sa crypto space. Isa nanamang use case na in general natin na tungkol sa cryptocurrencies. Kahit ano pa mang blockchain o crypto ang gamitin nila dito as front, yung adoption na mako-contribute nito ay sobrang laki. Gusto ko makita kung ano ang kahihinatnan ng sinasabi nilang non custodial wallet. At sana nga ganon yung kalalabasan dahil maaaring pang front lang din nila yun at ang ending pala ay custodial wallet pala siya dahil nga remittance company sila at centralized ang kanilang business at regulated din naman ng gobyerno kung saan sila nakabase at may mga opisina.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Twentyonepaylots",
      "created_time": "October 07, 2023, 06:08:48 PM",
      "body": "I wonder if this is considered as a national security matter, since money remittance company si Moneygram, may tendency na magamit sya sa money laundering although may KYC sa paggamit ng remittance and need gumamit ng IDs sa pagpapadala abroad. Indeed good news pa rin sa crypto community and mga kababayan natin na nagtatrabaho sa abroad since magkakaron sila ng other options para magpadala across globe, but I also believe na irereconsider pa rin nila yung feed hence tataasan nila yung palitan ng crypto sa institution nila if ever.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PX-Z",
      "created_time": "October 07, 2023, 09:27:38 PM",
      "body": "Never used Moneygram before so di ko alam anu ang fee stricture nila compare sa ibang remittance, pero if isa ito sa mga ginagamit ng mga OFW for remittance then it is really a good news to hear about sa mga OFWs natin. At sa business side, since alam naman nila na volatile ang crypto, i guess they already find ways para maiwasang pag kalugi if ever na mag de-decrease value nito.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dothebeats",
      "created_time": "October 08, 2023, 09:34:00 AM",
      "body": "Quote from: SFR10 on October 06, 2023, 05:32:45 PMQuote from: Mr. Magkaisa on October 06, 2023, 07:57:53 AMIbig sabihin ang makikinabang dito ng husto ang ating mga bayani na OFW na nagpapadala ng kanilang suporta sa kanilang mga pamilya. Siyempre ang advantage nito ay makakabawas ito ng costing,I'm not a MoneyGram user, pero if tama ang pagkakaintindi ko, ang bago lang sa balitang ito is the fact na maglalabas sila ng noncustodial wallet dahil mahigit isang taon na may crypto feature sa platform nila: Crypto, Meet Cash: New digital wallets activated by MoneyGram, built on StellarMoneyGram Access DemoAno satingin nyo? Okay ba na nag labas sila ng noncustodial wallet? Or since hindi na rin naman bago ito ay wala rin masyadong impact? Personally, hindi naman ako gumagamit ng moneygram so hindi ako sure if mas smooth ba ang transaction dito, if ever na ganun edi may advantage na sila sa iba.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "peter0425",
      "created_time": "October 08, 2023, 09:50:01 AM",
      "body": "Quote from: Mr. Magkaisa on October 06, 2023, 07:57:53 AMQuote    -   Source: https://cointelegraph.com/news/money-gram-non-custodial-crypto-wallets-q1-2024I don't wanna count this as valid until it happened .we are couple of months far bago to mangyari so ayoko na muna asahan kung ano ang tunay na pakay nila dito.Pero kung loobin na magkakatotoo to eh malamang na threaten na sila ng paglago ng Crypto users sa pinas at since remittance center sila eh kailangan nila makisabay or mawawalan sila ng users.Actually iilan nalang ang Moneygram outlet dito sa lugar namin samantalang in the past eh napakarami at halos dikit dikit.siguro Nilamon na talaga sila ng Cebuana at Palawan and crypto transacting  kaya halos humina na ang gumagamit nito  now so need nila ng adoption .",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bettercrypto",
      "created_time": "October 08, 2023, 11:02:10 AM",
      "body": "Quote from: peter0425 on October 08, 2023, 09:50:01 AMQuote from: Mr. Magkaisa on October 06, 2023, 07:57:53 AMQuote    -   Source: https://cointelegraph.com/news/money-gram-non-custodial-crypto-wallets-q1-2024I don't wanna count this as valid until it happened .we are couple of months far bago to mangyari so ayoko na muna asahan kung ano ang tunay na pakay nila dito.Pero kung loobin na magkakatotoo to eh malamang na threaten na sila ng paglago ng Crypto users sa pinas at since remittance center sila eh kailangan nila makisabay or mawawalan sila ng users.Actually iilan nalang ang Moneygram outlet dito sa lugar namin samantalang in the past eh napakarami at halos dikit dikit.siguro Nilamon na talaga sila ng Cebuana at Palawan and crypto transacting  kaya halos humina na ang gumagamit nito  now so need nila ng adoption .Nageget ko na naman yung gusto mong ipoint out, parang walang pinagkaiba sa prediction na binibigay ng mga eksperto tungkol sa prive value nito sa paparating na bull run sa Bitcoin na around 100k$ bawat isa. Though hindi pa ngyayari pero madami ng umaasa na magiging 100, 000$ bawat isa ng Bitcoin prediction palang yan.Eto pa kaya na planado sa susunod na taon ng 2024 sa launching ng non-custodial wallet gamit ang stellar network. Saka ganyan naman ang kumpetisyon sa remittances business, at least nauna na si Moneygram sa mga kilalang remittances sa ating lokal.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Reatim",
      "created_time": "October 08, 2023, 11:12:20 AM",
      "body": "Quote from: dothebeats on October 08, 2023, 09:34:00 AMQuote from: SFR10 on October 06, 2023, 05:32:45 PMQuote from: Mr. Magkaisa on October 06, 2023, 07:57:53 AMIbig sabihin ang makikinabang dito ng husto ang ating mga bayani na OFW na nagpapadala ng kanilang suporta sa kanilang mga pamilya. Siyempre ang advantage nito ay makakabawas ito ng costing,I'm not a MoneyGram user, pero if tama ang pagkakaintindi ko, ang bago lang sa balitang ito is the fact na maglalabas sila ng noncustodial wallet dahil mahigit isang taon na may crypto feature sa platform nila: Crypto, Meet Cash: New digital wallets activated by MoneyGram, built on StellarMoneyGram Access DemoAno satingin nyo? Okay ba na nag labas sila ng noncustodial wallet? Or since hindi na rin naman bago ito ay wala rin masyadong impact? Personally, hindi naman ako gumagamit ng moneygram so hindi ako sure if mas smooth ba ang transaction dito, if ever na ganun edi may advantage na sila sa iba. Gumamit ako ng Moneygram noon nung nasa US pa ang cousin ko at madalas nagpapadala ako sa kanya ng pambili ng mga gadget na need ko since noon mas mura ang mga second hand na Laptop sa US(at least bago magpandemic)medyo mabagal ang dating noon na kailangan pa ng 1-2 hours bago pumasok  , ewan ko nalang now dahil di  na ako nagsesend.and kung may kailangan ako bayaran eh through crypto na kami nag tratransact mula nung lumipat sya ng Canada.Pero para sakin eh malaking hakbang to dahil magkakaron na din ng option ang mga users nila para sa crypto related transactions .and also lahat ng papabor sa ating mga crypto users ay tingin ko dapat nating suportahan tulad ng action na ito ng Moneygram.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mr. Magkaisa",
      "created_time": "October 08, 2023, 12:55:21 PM",
      "body": "Quote from: dothebeats on October 08, 2023, 09:34:00 AMQuote from: SFR10 on October 06, 2023, 05:32:45 PMQuote from: Mr. Magkaisa on October 06, 2023, 07:57:53 AMIbig sabihin ang makikinabang dito ng husto ang ating mga bayani na OFW na nagpapadala ng kanilang suporta sa kanilang mga pamilya. Siyempre ang advantage nito ay makakabawas ito ng costing,I'm not a MoneyGram user, pero if tama ang pagkakaintindi ko, ang bago lang sa balitang ito is the fact na maglalabas sila ng noncustodial wallet dahil mahigit isang taon na may crypto feature sa platform nila: Crypto, Meet Cash: New digital wallets activated by MoneyGram, built on StellarMoneyGram Access DemoAno satingin nyo? Okay ba na nag labas sila ng noncustodial wallet? Or since hindi na rin naman bago ito ay wala rin masyadong impact? Personally, hindi naman ako gumagamit ng moneygram so hindi ako sure if mas smooth ba ang transaction dito, if ever na ganun edi may advantage na sila sa iba.        -  Next year pa ang pag launch nila ng non-custodial wallet sang-ayon sa kanilang inanunsyo. So sa tingin ko may impact parin ito sa aking palagay, hindi nga lang sa crypto market. Pero sa mga taong madalas gumamit ng remittances pwede itong magkaroon ng impact, kahit pa nga sa mga taong wala pang awareness sa cryptocurrency ay pwede silang magkaroong ng idea na kahit sa susunod na taon pa ito masisimulan ang implementation ay paniguradong bibigyan na sila ng updates or awareness ng moneygram outlets sa kanilang mga users.So kahit papaano meron paring impact ito, kahit hindi tayo gumagamit nito maganda paring balita, dahil yung crypto adoption ang pinapakita dito, Oo maaring sa simula wala pang gaanong impact, pero kapag dumami na ang users ng moneygram na gumagamit na ng noncustodial wallet in the future, sa tingin mo hindi yan magkakaroon ng impact sa crypto market?Ang point ko huwag natin tignan yung ngayon, sa halip yung future ang tignan natin, gaya ng ginagawa nating paniniwala na pwedeng maging 100k$ bawat isa ng value ni Bitcoin sa pagdating ng bull market kahit na ito sa ngayon ay isang speculation palang.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Asuspawer09",
      "created_time": "October 08, 2023, 02:57:03 PM",
      "body": "Quote from: Mr. Magkaisa on October 06, 2023, 07:57:53 AMQuote    -   Hello mga kabayan ko dito sa ating lokal seksyon, may isa na namang magandang balita para sa ating mga OFW na nagpapadala ng pera para sa kanilang mga mahal sa buhay dito sa bansa natin. Ano ang magandang balita ito? Siyempre ang Moneygram ay magla launch ng kanilang non-custodial crypto wallet sa susunod na taon 2024 first quarter gamit ang network ng stellar.Ibig sabihin ang makikinabang dito ng husto ang ating mga bayani na OFW na nagpapadala ng kanilang suporta sa kanilang mga pamilya. Siyempre ang advantage nito ay makakabawas ito ng costing, although meron siyang KYC which is normal naman dahil si Moneygram ay talagang humihingi ng KYC dahil remitance outlet ito. Ika nga ay \" Moneygram is now turning into a global ATM concept gamit ang Blockchain Technology \".Alam naman din natin kasi na kapag magpapadala ang ating mga OFW sa kanilang pamilya ay inaabot ng ilang araw bago marecieved at dahil gagamit na ng blockchain ay mas mapapabilis na ngayon at mas mapapamura pa sigurado yan.Source: https://cointelegraph.com/news/money-gram-non-custodial-crypto-wallets-q1-2024Mukang okey ito dahil non custodial cryptocurency wallet siya kaya for sure maraming magiging interested dito sa wallet na ito kapag nasubukan na nila at nilaunch na ng Moneygram, mukang nagaadapt na rin sila sa cryptocurrency lalo na siguro na narealize na nila kung gaano kabilis kumalat ang cryptocurrency sa buong mundo, kung titignan naten dati ay kahit ang mga banko ay takot talaga sa crytpcorurency at marami pa nga ang nagsasabi na ang cyptocurrency daw ang tatapos talaga sa mga banko, at agree naman talaga ako sa statement na yun bakit mo nga naman isasave ang pera mo sa bangko unang una dahil sa inflation, at wala kang kontrol dito. Kaya ngayon makikita naten na kahit mga banko ay nagadapt na rin talaga sa cryptocurrency, at talagang nagstart na sila na ilagay ito sa kanilang platform, sa Gcash at maya available na ito at kahit sa mga banko talaga like Unionbank ay mukang maiimplement na rin ito soon. So hindi na rin talaga nakakapagtaka na makita na sumasabay na ang tulad ng Moneygram dahil sa mga remittances talaga magiging useless lang sila sa cryptocurrency kaya kelangan din nila magadapt habang maaga pa.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "0t3p0t",
      "created_time": "October 09, 2023, 04:37:14 AM",
      "body": "Mas maganda kung ganun kasi para magkaroon ng maraming options ang ating mga kababayang OFW sa pagpapadala ng kanilang pera dito sa atin. Hindi lang sa ating mga kababayang OFW kundi pati na rin sa ating mga crypto enthusiasts. Though may iilan tayong mga OFW na kababayans na mahilig sa crypto but still majority parin naman sa mga gumagamit eh yung mga nandito lang sa Pinas. Mas marami competency mas mababa fees ganun yata yun correct me if I'm wrong.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bettercrypto",
      "created_time": "October 10, 2023, 02:54:06 PM",
      "body": "Quote from: Asuspawer09 on October 08, 2023, 02:57:03 PMQuote from: Mr. Magkaisa on October 06, 2023, 07:57:53 AMQuote    -   Hello mga kabayan ko dito sa ating lokal seksyon, may isa na namang magandang balita para sa ating mga OFW na nagpapadala ng pera para sa kanilang mga mahal sa buhay dito sa bansa natin. Ano ang magandang balita ito? Siyempre ang Moneygram ay magla launch ng kanilang non-custodial crypto wallet sa susunod na taon 2024 first quarter gamit ang network ng stellar.Ibig sabihin ang makikinabang dito ng husto ang ating mga bayani na OFW na nagpapadala ng kanilang suporta sa kanilang mga pamilya. Siyempre ang advantage nito ay makakabawas ito ng costing, although meron siyang KYC which is normal naman dahil si Moneygram ay talagang humihingi ng KYC dahil remitance outlet ito. Ika nga ay \" Moneygram is now turning into a global ATM concept gamit ang Blockchain Technology \".Alam naman din natin kasi na kapag magpapadala ang ating mga OFW sa kanilang pamilya ay inaabot ng ilang araw bago marecieved at dahil gagamit na ng blockchain ay mas mapapabilis na ngayon at mas mapapamura pa sigurado yan.Source: https://cointelegraph.com/news/money-gram-non-custodial-crypto-wallets-q1-2024Mukang okey ito dahil non custodial cryptocurency wallet siya kaya for sure maraming magiging interested dito sa wallet na ito kapag nasubukan na nila at nilaunch na ng Moneygram, mukang nagaadapt na rin sila sa cryptocurrency lalo na siguro na narealize na nila kung gaano kabilis kumalat ang cryptocurrency sa buong mundo, kung titignan naten dati ay kahit ang mga banko ay takot talaga sa crytpcorurency at marami pa nga ang nagsasabi na ang cyptocurrency daw ang tatapos talaga sa mga banko, at agree naman talaga ako sa statement na yun bakit mo nga naman isasave ang pera mo sa bangko unang una dahil sa inflation, at wala kang kontrol dito. Kaya ngayon makikita naten na kahit mga banko ay nagadapt na rin talaga sa cryptocurrency, at talagang nagstart na sila na ilagay ito sa kanilang platform, sa Gcash at maya available na ito at kahit sa mga banko talaga like Unionbank ay mukang maiimplement na rin ito soon. So hindi na rin talaga nakakapagtaka na makita na sumasabay na ang tulad ng Moneygram dahil sa mga remittances talaga magiging useless lang sila sa cryptocurrency kaya kelangan din nila magadapt habang maaga pa.Actually,, meron akong nabasa na hindi ko nalang matandaan kung saang section ko nabasa dito na tumataas na ang average ng mga remittances business ang nagaadopt na ng digitalization sa kapanahunang ito. Nakita na siguro marahil ng mga remittances na kapag hindi nila ginawang iadapt ang crypto o Bitcoin ay talagang hindi imposibleng magsarado sila kalaunan dahil mapag-iiwanan sila ng technology na meron tayo for sure. Kaya ngayon palang ay inuunti-unti na nilang tanggapin ito tulad ng ginawa ng moneygram.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SFR10",
      "created_time": "October 10, 2023, 05:13:46 PM",
      "body": "Quote from: dothebeats on October 08, 2023, 09:34:00 AMAno satingin nyo? Okay ba na nag labas sila ng noncustodial wallet?Kung ang non-custodial wallet na ilalabas nila is open-source at reproducible habang may feature din for connecting our own nodes sa wallet nila, magiging okay ito.Quote from: dothebeats on October 08, 2023, 09:34:00 AMOr since hindi na rin naman bago ito ay wala rin masyadong impact?Kahit alternative version ito ng existing product nila, may impact pa rin ito, dahil magbibigay sila ng more power/control sa mga users nila.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}