{
  "id": "topic_5458066",
  "title": "Scaling Labs",
  "author": "Scaling Labs",
  "created_time": "June 30, 2023, 02:17:57 AM",
  "content": "https://miro.medium.com/v2/resize:fit:1400/format:webp/1*G5cWGydc1Z7c2wRydblTRQ.pngWeb3 Twitter Damus Phenomenon ExplosionA social app that can’t even post pictures has become the first star of Web3 in 2023. This is the social APP “Damus” based on the decentralized social protocol Nostr. A large number of users inside and outside the circle poured into this extremely simple social APP full of curiosity. People who didn’t know much about Web3 were disappointed when they found that there was no function for group chat or deleting text.As soon as Damus appeared, he came to “beat Twitter”. The decentralized protocol Nostr enables Damus to have features such as no registration and encryption, ensuring the privacy and freedom of users to the greatest extent. The simplicity of the Nostr protocol is also impressive.https://miro.medium.com/v2/resize:fit:1400/0*P65J28jdgZOhmoitAfter the download of Damus is complete, the user can directly create an account without a phone number, email verification, and real-name verification. Just enter the user name that is used by the user, and the system will pop up the public key (starting with npub, similar to the user’s “account”), click Click the copy button next to the public key, and then the system will automatically pop up the private key (starting with nsec, similar to the user’s “password”). Continue to click the copy button next to the private key to enter the Damus product interface. Familiar but novel experience, as well as the fanfare of a group of KOLs, made Damus quickly become a phenomenon-level product.https://miro.medium.com/v2/resize:fit:1400/0*xcMsCpYY2eFNHORwThe Web3 version of Discord is coming too?In fact, at this stage, many users of Nostr only care about the appearance of the application layer, but do not understand the essence of the protocol layer. Nostr does not adopt the decentralized solution of blockchain.Recently, Show3, a decentralized social application similar to Discord, has begun to attract people’s attention. Unlike Damus, it chose the path of complete data on-chain and adopted the decentralized identity protocol “MetaID”. During the small-scale internal testing time, more than 20 million Tx numbers have been accumulated. Some people even commented that Show3 will be an all-around dimensionality reduction product to attack Nostr and Damus.https://miro.medium.com/v2/resize:fit:1400/0*XOjRCMVQCmywcsFVIn fact, the Show team has entered the DID track in 2019 and has accumulated more than 150,000 registered users. The team did not choose to enter the mainstream Ethereum circle but immersed themselves in doing something different — underlying construction and creating a new Web3 ecological foundation, including participating in the construction of new public chains, protocol layers, open-source middleware, various class applications, etc. A technical team of less than 20 people has built a complete ecology in obscurity within 3 years. It was not until the release of the Show3.io application that it began to exert its strength in the market.https://miro.medium.com/v2/resize:fit:1400/0*TXVGJbwDEiiO5NCkIn the short term, the Show team’s approach is relatively clumsy and has a high risk of survival; but in the long run, this may change the entire blockchain ecosystem.Who can represent the future of Web3 social networkingThe success of a decentralized social platform depends on various factors and requires speculation and evaluation of multiple factors such as market trends, technological development, and competition, including:1. User needs: meet the new needs of users for privacy, security, chat experience, making money, etc.;2. Technical advantages: more efficient, safer, easier to use, and other technical advantages, which can attract users to use;3. Marketing: A successful social platform requires effective marketing and communication methods to increase user awareness and utilization;4. Social Network Effect: The success of social platforms is often affected by the social network effect, that is, users prefer to use platforms with a large number of friends.As far as the advantages of the two are concerned, the degree of decentralization of both is very high, no single institution or individual controls user data, and provides higher privacy protection. At the same time, the decentralized nature also increases the security of the application, because there is no single point that can be hacked.What is more worth mentioning is that the Damus community is driven by users, which means that the community can change and evolve according to needs, that is, the product updates of Damus mainly depend on the needs and suggestions of users, etc., which truly embodies the user-oriented Web3 spirit. At the level of asset interoperability, Show3 supports asset interoperability, allowing users to easily buy, sell and exchange digital assets in social networks.Show3 has only started to ferment in small circles. In comparison, a “semi-finished product” Damus can be popular, and there is no reason for it to stay out of the circle. The biggest difference between Show3 and Damus is:1. The data generated by users on Show3 is completely on-chain, so real data interconnection can be realized, and the underlying protocol has been completely decentralized; Damus is just a semi-finished product under the banner of “Twitter Killer”;2. Show3 builds a Web3 social network with NFT as the core. In addition to providing users with NFT-related functions and services such as discovery, discussion, use, and circulation, the platform itself is also completely composed of NFT elements, such as user avatars, avatars, personal Space decorations, pets, emoticons, etc. are all tradable NFTs, and users are allowed to accumulate experience to forge their own exclusive NFTs. Even the latest status, posts, on-chain pictures, and on-chain videos posted by users every day can be easily cast into NFTs and become their own on-chain digital assets. NFT social networking is the wind vane and entry barrier of the current Web3 application graph, and Damus does not even have basic group chat and image posting functions;https://miro.medium.com/v2/resize:fit:1400/0*1iDfQlCow7eJIdKZ3. Show is currently adapted and can display and use ETH, and NFT in Polygon format, and will continue to adapt to more different blockchains in the future; in the past, NFT Holders were often distinguished by chains. Holders on Ethereum rarely have the opportunity to contact Holders of other blockchains. And Show’s support for multiple chains will build a larger, richer, and more diverse community.https://miro.medium.com/v2/resize:fit:1400/0*AuaX8qpzZUYovLsz4. Show3 is based on MetaID’s open-source social network and Web3 middleware — MetaSo. Developers can deploy new Web3 social applications within 20 minutes by simply editing configuration files. MetaSo will break down data silos and build an ultimate decentralized Web3 social platform. The Nostr protocol that Damus is based on is relatively isolated. Due to the lack of infrastructure, it is difficult for developers to quickly build application networks through Nostr.What is MetaSohttps://miro.medium.com/v2/resize:fit:1400/0*sIX84HQadqTXDQ_HImage Source：https://www.metaso.network/Web3 social needs to be brokenHowever, at present, the Web3 social landscape we see still has great limitations. The scenarios for Web3 social networking to provide user experience beyond the Web2 experience are limited, and the social data or content on the chain provided to users is limited, which cannot make the DID/social media ecology The system is more fleshed out. Web3 social applications that truly have the future have the following characteristics:1. Elegant underlying protocol. When the problem of the underlying protocol is solved, the application based on the protocol can be conveniently developed and the experience can be better, so that users can willingly abandon the familiar centralized social platform;2. With NFT as the core, it has rich application scenarios, allowing a wider range of people to appreciate the value of NFT;3. Cross-chain capability and high concurrency performance allow all chains to coexist. This is the premise for maintaining the healthy development of social ecology and the premise for billions of users to enter without threshold;4. Perfect infrastructure. The B-side (KOL, group owner) and the A-side (developers, project parties) can actually promote the rapid progress of the application;5. Incorporate AI. On the one hand, the huge data on the chain every day can provide fuel for the AI ​​engine, on the other hand, AI can help users skip tedious operations, generate virtual people with their own personalities in Web3 social networking, detect fake NFT projects, etc.6. The operation experience is as simple as that of Web2, which is a necessary prerequisite for popularizing users all over the world, allowing Web2 users to enter Web3 and discover a new world unconsciously.I believe that in the long run, whether it is Damus or Show3, it will be an unstoppable trend for Web3 social applications to surpass Web2 giants in the future.Support independent authors and access the best of Medium.Become a member",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5458066",
  "comments": []
}