{
  "id": "topic_5397719",
  "title": "cryptotalklab1",
  "author": "cryptotalklab1",
  "created_time": "May 07, 2022, 06:44:24 PM",
  "content": "Recently I viewed ninjastic.space which is a awesome website . But there I found 5 option to search in search bar which is -Post ID , Topic ID , Address , User name , User ID . I understand what is Address and Username But I don't get it what is Post ID , Topic ID, User ID. Can anybody give the source or tell me how can I Find those ID's ? Thanks in Advance.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5397719",
  "comments": [
    {
      "author": "acroman08",
      "created_time": "May 07, 2022, 07:01:12 PM",
      "body": "just look at the end part of the URL of every topic, post, and user profile you visit. for the topic ID, you have to look for \"topic=123\", for the user ID you have to look for \"profile;u=1234\" and for the post ID you have to look for \"msg1234567\".also, besides the ninjastic.space you can also visit LoyceV's thread 56M posts! View unedited/deleted posts (search per post, per user or per topic)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "decodx",
      "created_time": "May 07, 2022, 08:09:40 PM",
      "body": "ID means an identifier. Each post, topic, or user in this forum is assigned a unique identifier by which they are stored in the system. This is simply the way forum software works.As acroman08 has already said, you can find those ID tags from URLs in your browser.For example, if you look at the url of this thread, you will see this part: \"topic = 5397719\". So, the ID of this topic is 5397719.In a similar way, you can find the ID of an individual post or user by clicking on them and opening them in your browser.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nakamura12",
      "created_time": "May 07, 2022, 09:27:51 PM",
      "body": "User ID is a number represents your account. Let's use my user id as an example, to get my user ID, I need to go to Profile and then click summary. After that, you'll see it in your URL which mine is https://bitcointalk.org/index.php?action=profile;u=1726595;sa=summary. You may delete the ;sa=summary which leaves the https://bitcointalk.org/index.php?action=profile;u=1726595. As you can see there's a number at the last which is 1726595 and that is my User ID. For Post ID and topic ID can be found at the thread you're in like this one. The Topic ID is 5397719.0. It can be found in the address bar on your browser.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "khaled0111",
      "created_time": "May 07, 2022, 09:48:33 PM",
      "body": "Quote from: nakamura12 on May 07, 2022, 09:27:51 PMUser ID is a number represents your account. Let's use my user id as an example, to get my user ID, I need to go to Profile and then click summary. After that, you'll see it in your URL which mine is https://bitcointalk.org/index.php?action=profile;u=1726595;sa=summary. You may delete the ;sa=summary which leaves the https://bitcointalk.org/index.php?action=profile;u=1726595I just want to add that you need to do this only when you want to get your own user ID, you click on Summary or any of the links on the left sidebar on your profile page. To get the ID of any other member, just click on its username and you will be redirected to his profile page.To get the message ID, you need to click on its number (#xx) which you can find on top right of the post next to +Merit.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "notocactus",
      "created_time": "May 08, 2022, 05:52:40 AM",
      "body": "Quote from: khaled0111 on May 07, 2022, 09:48:33 PMTo get the message ID, you need to click on its number (#xx) which you can find on top right of the post next to +Merit. It is one way to find a post ID. Another way is to click on \"Re: How to find ID number ?\" of that post (I name it as a post title), then you will get the post ID at the browser.For example, it is your post linkCode:https://bitcointalk.org/index.php?topic=5397719.msg60073131#msg6007313160073131 is your post ID. From that link, you have a topic ID as well, that is 5397719.There is another way to get topic ID, click on \"How to find ID number\" at the top \"Bitcoin Forum > Other > Beginners & Help (Moderator: MiningBuddy) > How to find ID number ?\", then you will be directed to this oneCode:https://bitcointalk.org/index.php?topic=5397719.05397719 is the topic ID. This link directs you to the Opening post of this topic.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptotalklab1",
      "created_time": "May 10, 2022, 02:42:47 PM",
      "body": "Thanks to all who gives answer of my questions. Specially thanks to acroman08I am satisfied with the answer now I am locking this topic.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}