{
  "id": "topic_5454770",
  "title": "dkbit98",
  "author": "dkbit98",
  "created_time": "June 01, 2023, 02:12:07 PM",
  "content": "Jade hardware wallet is open source and it's not very expensive, Blockstream is currently selling it for around $65 plus shipping, and there is a 10% discounts if you pay with L-USDT.You still have to trust Blockstream to keep all your personal information safe, and hope there won't be any leaks or attacks that will steal and sell your data.Solution for this is to make your own Jade DIY wallet, and there are several options for everyone to choose.CryptoGuide posted a wonderful video instructions how to do everything, with more details on his github page and this will have secure boot same as original Jade device:https://www.youtube.com/watch?v=PeqP6oVnlIsThere is one more quick and dirty solution using Blockstream Jade DIY flasher utility BUT in this case there is no secure boot and flash encryption!This works for TTGO T-Display, M5Stack Fire, M5Stack Black/Gray and M5StickC PLUS.https://blockstream.github.io/jadediyflasher/TTGO (Lilygo) T-Display ~$10 USD https://github.com/3rdIteration/Jade/blob/master/diy/readme.mdM5 StickC-Plus ~$20 USDhttps://github.com/3rdIteration/Jade/blob/master/diy/readme.mdM5 Stack Basic ~$40 USDhttps://github.com/3rdIteration/Jade/blob/master/diy/readme.mdAll this devices are running with Open Source code so I am adding it to my list of DIY open source hardware wallets:https://bitcointalk.org/index.php?topic=5288971.0",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5454770",
  "comments": [
    {
      "author": "BitcoinGirl.Club",
      "created_time": "June 01, 2023, 02:20:23 PM",
      "body": "Quote from: dkbit98 on June 01, 2023, 02:12:07 PMYou still have to trust Blockstream to keep all your personal information safe, and hope there won't be any leaks or attacks that will steal and sell your data.This made me laugh and sad at the same time when I know what experience we had with Ledger. It's hard to break the link unless you convince someone to receive the delivery for you and they don't know what will it be. This way you put them in risk too.Quote from: dkbit98 on June 01, 2023, 02:12:07 PMCryptoGuide posted a wonderful video instructions how to do everything, with more details on his github page and this will have secure boot same as original Jade device:https://www.youtube.com/watch?v=PeqP6oVnlIsOn my watch list and I am still looking for a better way for my crypto to keep safe after ledger came up with this wired wallet backup concept. A multisig wallet is still the safest option for me.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hZti",
      "created_time": "June 01, 2023, 06:22:07 PM",
      "body": "Very cool project, what I kind of miss as usual with this devices is a good (3D printed) case option, since the display is nice for just 10 USD, but nothing more then a gimmick without the option to put it in a casing.The more expensive options are nice tho, even also them I would not really consider as more as a gimmick to play around with.Quote from: BitcoinGirl.Club on June 01, 2023, 02:20:23 PMQuote from: dkbit98 on June 01, 2023, 02:12:07 PMYou still have to trust Blockstream to keep all your personal information safe, and hope there won't be any leaks or attacks that will steal and sell your data.This made me laugh and sad at the same time when I know what experience we had with Ledger. It's hard to break the link unless you convince someone to receive the delivery for you and they don't know what will it be. This way you put them in risk too.You can consider to let them ship the device to some kind of parcel box like it is usually possible in most countries. With that option a thief will maybe be able to get to your name but that’s all. I think this information will not be enough for somebody really trying to Trackballes down and rob you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dkbit98",
      "created_time": "June 02, 2023, 07:57:15 PM",
      "body": "Quote from: BitcoinGirl.Club on June 01, 2023, 02:20:23 PMThis made me laugh and sad at the same time when I know what experience we had with Ledger. It's hard to break the link unless you convince someone to receive the delivery for you and they don't know what will it be. This way you put them in risk too.You always have the option to buy wallet with cash in store, or use PO box delivery with alternative name and address.For people who want to break the link there is always a way to do it Quote from: hZti on June 01, 2023, 06:22:07 PMVery cool project, what I kind of miss as usual with this devices is a good (3D printed) case option, since the display is nice for just 10 USD, but nothing more then a gimmick without the option to put it in a casing.There is a bunch of STL files available online for free, so everyone can print their own case version.I know a guy who printed two case versions, one of them is more square shaped and other with oval shape.CryptoGuide released one more video with custom cases and added camera:https://www.youtube.com/watch?v=V2yVKag2wlc",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hZti",
      "created_time": "June 03, 2023, 05:57:30 AMLast edit: June 03, 2023, 06:15:44 AM by hZti",
      "body": "Very nice that there is such a big scene of people modding this wallet and creating accessories for it. If I have the opportunity I will definitely try to create a high quality casing for a wallet like this to be able to offer it at a competitive price point to other mainstream wallets. Because so far not really any hardware wallet I know does qualify what I consider a well built case. Well built will for me especially include some kind of moisture and water protection.People may ask why this is necessary but most of those people are relatively new to the crypto world. After 10 years and many destroyed USB Sticks with wallet.dat files on them you will get more cautious  What would maybe be possible would be fill the case with Silikone. Does someone has experience with that?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaveF",
      "created_time": "June 03, 2023, 11:31:15 AMLast edit: June 03, 2023, 01:24:07 PM by DaveF",
      "body": "From the paranoid tinfoil hat wearing department, be careful where you buy some of these boards from. Not necessarily anything malicious directed towards Bitcoin wallets, but even at the ridiculously low price points that you could find and online there are still a ton of counterfeits out there. I'm assuming that they are just cheap knockoffs being passed off as the less cheap real thing. But in the end you don't have a verifiable source of where some of these chips came from or even who did what at the factory when they were assembled.Why anyone would create a pirate / clone M5 stack is beyond me, but they are out there -Dave",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hZti",
      "created_time": "June 03, 2023, 11:46:06 AM",
      "body": "It’s super cheap to buy them and they end up in every kind of envoirements, scientist, government, businesses etc.. In those kind of envoirments devices like this are also very hard to track, so in my opinion the only reason to counterfeit such a device would really be some kind of malicious activity. I think otherwise the profit would be to small. Is there a good way to see if a chip is real or counterfeit?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaveF",
      "created_time": "June 03, 2023, 01:09:36 PM",
      "body": "Quote from: hZti on June 03, 2023, 11:46:06 AMIt’s super cheap to buy them and they end up in every kind of envoirements, scientist, government, businesses etc.. In those kind of envoirments devices like this are also very hard to track, so in my opinion the only reason to counterfeit such a device would really be some kind of malicious activity. I think otherwise the profit would be to small. Is there a good way to see if a chip is real or counterfeit?Yes & no.If you buy from them: https://shop.m5stack.com/ you can probably assume it's real. And I would think the ones coming out of their approved resellers are also real.Beyond that, I don't think you can. A tech I know bought a bunch from them and when he needed more went to what he thought was a reputable site since at the time M5 had no stock. When one died and he sent it back to M5 it came back as not made by us. Looking at them side by side they were the same. Even in the same packing. Their attitude was we sell them and so do these people, getting it elsewhere you are on your own.So, yes people will clone a $25 thing. Might not even be for evil reasons, just something cheap to make with a good profit margin. There are even youtube videos about people selling counterfeit IC chips in the $3 range so.....   https://www.youtube.com/watch?v=12u_hBkHB88-Dave",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitcoinGirl.Club",
      "created_time": "June 03, 2023, 07:26:24 PM",
      "body": "Quote from: dkbit98 on June 02, 2023, 07:57:15 PMYou always have the option to buy wallet with cash in store, or use PO box delivery with alternative name and address.That's what I had to do when I was buying those Ledger Devices.Quote from: DaveF on June 03, 2023, 11:31:15 AMFrom the paranoid tinfoil hat wearing department, be careful where you buy some of these boards from. It did not miss my eyes 😉",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dkbit98",
      "created_time": "June 03, 2023, 08:11:53 PM",
      "body": "Quote from: hZti on June 03, 2023, 05:57:30 AMVery nice that there is such a big scene of people modding this wallet and creating accessories for it. If I have the opportunity I will definitely try to create a high quality casingI don't understand why would you need a high quality case for this?  It's just a cheap DIY 3d printing that is available anywhere...People did make premium metal cases for similar DIY devices like SeedSigner, but this is not needed at all and it can only attract attention.Quote from: hZti on June 03, 2023, 05:57:30 AMWhat would maybe be possible would be fill the case with Silikone. Does someone has experience with that?No.Silicone is used for isolation, not so much for cases and 3d printing.Quote from: DaveF on June 03, 2023, 11:31:15 AMFrom the paranoid tinfoil hat wearing department, be careful where you buy some of these boards from. This is general used electronic hardware and it's not connected with Bitcoin in any way, and this DIY bitcoin wallets are not very popular, so I don't see any danger here.Official shop is always the best place to purchase stuff like this.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaveF",
      "created_time": "June 05, 2023, 12:23:34 AM",
      "body": "Quote from: dkbit98 on June 03, 2023, 08:11:53 PMThis is general used electronic hardware and it's not connected with Bitcoin in any way, and this DIY bitcoin wallets are not very popular, so I don't see any danger here.Official shop is always the best place to purchase stuff like this.That is that is because your not thinking like a paranoid tinfoil hat person. Also keep in mind that compromising device like this would not just be about compromising a hardware Bitcoin wallet, it would be about compromising thousands of IoT things that could be anywhere doing anything giving who knows whom access to who knows what.Getting some Bitcoin out of the deal would just be a bonus, but how many people would buy some like the field tech I know, and then hook these devices up to whatever and have no clue that they're not original hardware. They look like it, they act like it, but they're not. So who the heck knows what is embedded deep down inside. Could be nothing and these were just cheap knockoffs that they were selling , or they could have some vicious code buried somewhere. Personally I'm going with the benign theory and people are just out to make a buck. But why risk it, which is why I and then you pointed out that anybody getting these should only be buying them from m5stack.com or their approved suppliers. -Dave",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dkbit98",
      "created_time": "June 06, 2023, 07:02:51 PM",
      "body": "Quote from: DaveF on June 05, 2023, 12:23:34 AMThat is that is because your not thinking like a paranoid tinfoil hat person. Also keep in mind that compromising device like this would not just be about compromising a hardware Bitcoin wallet, it would be about compromising thousands of IoT things that could be anywhere doing anything giving who knows whom access to who knows what.On contrary, I am thinking like a paranoid tinfoiler most of the time, but I am realistic about this subject.If you think this devices are compromised than you shouldn't use your smartphone, laptop or any other electronic device for anything related with bitcoin....since you are 100% ''paranoid tinfoil hat person''.Quote from: DaveF on June 05, 2023, 12:23:34 AMBut why risk it, which is why I and then you pointed out that anybody getting these should only be buying them from m5stack.com or their approved suppliers. Better don't risk anything and don't use bitcoin at all, your computer and smartphone are compromised already",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Onset",
      "created_time": "June 07, 2023, 02:49:06 AM",
      "body": "Quote from: dkbit98 on June 06, 2023, 07:02:51 PMBetter don't risk anything and don't use bitcoin at all, your computer and smartphone are compromised already  Is someone who’s buying a PC more vulnerable to being hacked or targeted than someone who’s buying random boards off the internet? Now that’s a stat I’d like to see! I feel like if you buy random boards it’s much easier to be the victim of a compromised batch than if you buy a computer. But now that I think about it, this fear can be easily bypassed.. the more hardware wallets launch and the more complicated these things get, the more I start loving the idea of a traditional cold storage wallet by transforming old devices into the cold storage. It’s not as convenient as a device like Ledger, but it gets the job done better than any other such device in my opinion. Why even bother purchasing possibly counterfeit boards and all if maybe there’s a pre-Bitcoin era laptop out there in the attic laying down & waiting for you to give it life again?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hZti",
      "created_time": "June 14, 2023, 05:42:07 PM",
      "body": "Quote from: Onset on June 07, 2023, 02:49:06 AM It’s not as convenient as a device like Ledger, but it gets the job done better than any other such device in my opinion. Just create a seed and some adresses offline and store them securely on a metal plate. Then completely reset the device that you use for creating those informations. Simply store 80% off your bitcoin on those adresses and never worry about anything again. With 20% still liquid you should usually not worry about having to move the other 80% regularly.Most hardware wallets also have the disadvantage that they are pretty expensive and if you plan to buy multiple ones then you will mess up your profits pretty big.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dkbit98",
      "created_time": "June 16, 2023, 01:55:20 PM",
      "body": "Quote from: Onset on June 07, 2023, 02:49:06 AMIs someone who’s buying a PC more vulnerable to being hacked or targeted than someone who’s buying random boards off the internet? Now that’s a stat I’d like to see! Yes they are obviously more vulnerable, I never heard anyone getting hacked using this devices, and every minute someone who is using computers is hacked in the world.Anyone with a working brain could realize why this is the case, and chips are all coming from same places anyway.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cygan",
      "created_time": "October 21, 2023, 08:17:21 AM",
      "body": "apparently customer data has been leaked at Blockstream! numerous users of the Jade hardware wallet have received the fake email shown below, which looks deceptively real at first glance.Adam Back has already confirmed that it is a scam.if you have received this type of email, please delete it immediately and do not click on any link.https://twitter.com/adam3us/status/1715621325883265505",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pmalek",
      "created_time": "October 21, 2023, 08:31:32 AM",
      "body": "Not one more leak. It's a well-written email that sounds believable unless you pay attention and look at the email address for example.It will be interesting to see what exactly leaked and in which quantity. I am subscribed to Blockstream's blog and newsletter in my experiment to see if any fake data will leak or if I will receive phishing emails. I can confirm that I haven't received such phishing emails. They might target Jade users exclusively.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dkbit98",
      "created_time": "October 23, 2023, 09:32:58 PM",
      "body": "Quote from: cygan on October 21, 2023, 08:17:21 AMapparently customer data has been leaked at Blockstream! numerous users of the Jade hardware wallet have received the fake email shown below, which looks deceptively real at first glance.Adam Back has already confirmed that it is a scam.if you have received this type of email, please delete it immediately and do not click on any link.I saw this but it doesn't have to be database leak, and this was not confirmed. From what I heard random people received this phishing email even if they never purchased Jade hardware wallet or signed up for any other Blockstream services.It is possible this people used their email for some stupid airdrops or they signed up for other crypto newsletters or they purchased some other brand of hardware wallets like ledger aka leaker.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "apogio",
      "created_time": "October 24, 2023, 05:10:08 PM",
      "body": "I liked this option: https://github.com/3rdIteration/Jade/blob/master/diy/readme.mdIs it following SeedSigner's (https://seedsigner.com/) footsteps, or am I thinking wrong? Is there any reason not to construct a seed signer? If you order the hardware pieces from separate stores, then it will not let anyone know you want it for Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pmalek",
      "created_time": "February 26, 2024, 04:22:49 PM",
      "body": "The Blockstream Jade is one of the cheapest hardware wallets. Besides its affordable price at around €61, the device is also airgapped. If you use the discount code NAKADAI, you can get an additional 10% off and make the purchase even cheaper. I don't know for how long the code will be valid.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}