{
  "id": "topic_5439841",
  "title": "Raptoreum",
  "author": "Raptoreum",
  "created_time": "February 14, 2023, 01:47:33 PMLast edit: October 18, 2023, 03:16:26 PM by Raptoreum",
  "content": "About GhostPress and WordPressWordPress currently powers about 43% of websites and e-commerce stores, that is approximately 455 million websites. The problem here is that WordPress hosting providers require personal and financial information to use their services. Some even going as far as to require copies of drivers license, passport, and utility bills.Hosting companies are high value targets for hackers because of this, and there are large breaches every year.There are also some providers that share and trade your information.GhostPress fixes this by only requiring a valid email address and some Raptoreum (RTM) to provision WordPress hosting, there is 0 personal or financial information required.GhostPress StatusGhostPress is OPEN- Backend with RTM integration (100% complete) (updated 2023-03-07)- Frontend with RTM integration (100 complete) (updated 2023-03-07)- Referral system (100%) (updated 2023-02-07)- RAS (Raptoreum Authentication System) (100%) (updated 2023-10-18)- Automated GhostPress provisioning and management (50%) (updated 2023-10-18)- Ticket System 100% complete (updated 2023-10-18)- Configurable self destructing tickets 100% complete (updated 2023-10-18)GhostPress Reduced Operating CostsFraud is the bane of WordPress hosting providers, costing millions a year in additional manhours, fees, additional software, and licenses. This has a substantial effect on their service prices. GhostPress is able to offer reduced prices in comparison to other providers as fraud concerns are greatly reduced.The Tech and PerformanceGhostPress is build for speed, efficiency, and security from the order process to the end service (your WordPress site). Existing payment gateways for Crypto do not take advantage of Raptoreums features, such as Chainlocks. So GhostPress has built its own, when ordering you only need to wait for one confirmation (Raptoreum has 2 minute block time). This is safe due to Chainlocks.When your order GhostPress you receive a SSD powered KVM VPS built, tuned, and hardened specifically for WordPress. the \"stack\" is a combination of pure NGINX, Percona 8 (Mariadb is also an option), Redis, and PHP 8-8.1. Page and object caching (Redis) are on out of the box. This combination of services and caching offers a light, efficient, wicked fast WordPress environment.Security out of the box is wpFail2ban integration, 7G WAF, additional security measures are also available (listed on site once ready).Daily backups are included, these are stored offsite and can be restored on request.FAQ<in progress...>Join Us!Discord: https://discord.gg/YyN3UAZFC6Twitter: https://twitter.com/kawwwoinEmail: hello@ghostpress.io",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5439841",
  "comments": [
    {
      "author": "Raptoreum",
      "created_time": "February 19, 2023, 07:53:05 PM",
      "body": "Both backend and frontend systems are in closed testing, getting close!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Raptoreum",
      "created_time": "February 27, 2023, 11:25:36 PM",
      "body": "A referral system has been added. If you refer somebody and they purchase WordPress hosting your earn a recurring commission for as long as they have their service.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Raptoreum",
      "created_time": "March 02, 2023, 09:18:34 PM",
      "body": "It is coming along",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Raptoreum",
      "created_time": "March 07, 2023, 09:11:17 PM",
      "body": "First post updated as front and back RTM integration for payments is 100% complete.RAS system is now under development. RAS (Raptoreum Authentication System) removes hacks that effect traditional 2FA methods, such as sim swaps.First post will also be updated with a stack change, we are moving away from NGINX. OLS (OpenLiteSpeed) offers better efficiency and performance with much better and more reliable caching through LScache. It also performs better under high traffic load and integrates seamlessly with QUIC CDN which we make use of. This allows for all around better performance and best \"bang\" for the buck. A new GhostPress service is being addedGhostPress clients will have free access to a cache warmer. Domains Which do not have busy sites or frequent international visitors will not have their site available on all of QUIC CDN nodes. This means when a visitor visits from a location where a node does not have the site cached the visitor may experience slow load times. It will also help lessen the load on the origin server a little.The GhostPress \"cache warmer\" can be set on a schedule and will make sure all 130+ QUIC nodes always have the site cached and current.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Raptoreum",
      "created_time": "April 07, 2023, 09:18:44 PM",
      "body": "Charlie shows how you can make a anonymous GhostPress account using just a Raptoreum wallet. No password e-mail needed. Also touched on is the reason why RAS (Raptoreum Authentication System) was implemented as well as why GhostPress was started.https://youtu.be/qymekOMLSRk",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Raptoreum",
      "created_time": "October 18, 2023, 02:53:39 PM",
      "body": "GhostPress is now open: https://ghostpress.io",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}