{
  "id": "topic_5461445",
  "title": "Silence Scream",
  "author": "Silence Scream",
  "created_time": "July 30, 2023, 03:56:51 AM",
  "content": "Ekonomide sert adımlarla birlikte bazı sonuçlar elde edildi. Bunlardan en somut olan ve bizlerin hayatını etkileyeni ise kredilerin oranlarının çok yükselmesi ve ihtiyaç kredisine 70 bin lira tavan limit belirlenmesi. Bunun dışında ticari işletmelere daha fazla kredi verilebiliyor.Bunlarla birlikte artık özellikle birinci ve ikinci el oto satışı işinde artık sinek avlar oldu çakal sürüsü. Önceden arabamı satar üstüne kredi çeker daha iyi arabaya binerim diyen insanlar artık kredi çekemediğinden araç alamaz oldu. İkinci el piyasasında hükümete yakın kaynaklar kâr elde etmek için yapılacak satışların liste fiyatı üstüne listeleme yasağıyla ikinci el piyasasının düştüğünü iddia ediyorlar ama öyle bir şey yok. Artık merkez bankası yıl sonu enflasyon beklentisini de gerçekçi düzeye oluşturdu. Buradan düşünce ile faizlerin daha da yukarı çıkacağından bahsedebiliriz. Bu durumda araç piyasası iyice durgunlaşacak çünkü inanılmaz seviyelerde ikinci eller sıfırı geçmiş durumda.Şimdi de galerici arkadaşlar Whatsapp durumunda kaliteli marka araçları hemen teslim veya ağustos teslim gibi seçeneklerle satışa hızlı şekilde çıkarmışlar. Pakette istemiyorlar, haraç talep etmiyorlar. Arabaların satılmama ihtimali gözlerini korkutmuş gibi. Nakiti olan arabaya gömmez, gider şu ortamda faize koyar ne bileyim döviz yapar ama durduğu yerde ayda 3-4 bin lira zarar ettirecek bir yatırıma parasını gömmez bunu anladılar herhalde. İhtiyacı olan haricinde satışlar neredeyse durmuş. Artık galerilerde arabalar var beyler haberiniz olsun.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5461445",
  "comments": [
    {
      "author": "totti67",
      "created_time": "July 30, 2023, 04:58:10 AM",
      "body": "Bu konuya ilgili geçenlerde dikkat çekici bir video vardı, rakamları karıştırıyor olabilirim ama bir genç, 600 e aldığı arabayı birkac gun sonra 750 ye satmıştı, bu arada noter aşamasında dönen akıl oyunlarini falan da videoda görmüştük ayrıca. Devlet kendince önlemler alıyor ama bizim halktan bir kesim sürekli her ortamda her şartta çok kazanma derdinde. Bu yeri geliyor vatandaş oluyor, yeri geliyor galerici, yeri geliyor müteahhit.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Silence Scream",
      "created_time": "July 30, 2023, 05:04:58 AM",
      "body": "Quote from: totti67 on July 30, 2023, 04:58:10 AMBu konuya ilgili geçenlerde dikkat çekici bir video vardı, rakamları karıştırıyor olabilirim ama bir genç, 600 e aldığı arabayı birkac gun sonra 750 ye satmıştı, bu arada noter aşamasında dönen akıl oyunlarini falan da videoda görmüştük ayrıca. Devlet kendince önlemler alıyor ama bizim halktan bir kesim sürekli her ortamda her şartta çok kazanma derdinde. Bu yeri geliyor vatandaş oluyor, yeri geliyor galerici, yeri geliyor müteahhit.Vatandaşın kendini koruma çabasını takdir ederim. Devlet vatandaşı koruyacak adımlar atmıyorsa vatandaş kendini koruyacak adımlar atıp, kendine ek gelir oluşturmak için al sat yapacak tabii ki. Bu arada devlet kendine aldığı önlemleri vatandaş için değil, kendisi için alıyor sonuçta kayıp yaşamak istemiyor. Her satış vergi demek. Devlet kendini koruyor. Aslında sosyal devlette devlet vatandaşını koruyor olmalıydı. Mesela ÖTV, üstünden hesaplanan KDV, araçlara ulaşımın zorluğu, pahalılığı bunların hepsi birer etken. Sosyal devlet arabası olanı zengin görmemeli, arabası olmayanı araba sahibi yapmak için neler yapmalıyım bunun derdine düşmeli.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "totti67",
      "created_time": "July 30, 2023, 05:20:06 AM",
      "body": "Quote from: Silence Scream on July 30, 2023, 05:04:58 AMQuote from: totti67 on July 30, 2023, 04:58:10 AMBu konuya ilgili geçenlerde dikkat çekici bir video vardı, rakamları karıştırıyor olabilirim ama bir genç, 600 e aldığı arabayı birkac gun sonra 750 ye satmıştı, bu arada noter aşamasında dönen akıl oyunlarini falan da videoda görmüştük ayrıca. Devlet kendince önlemler alıyor ama bizim halktan bir kesim sürekli her ortamda her şartta çok kazanma derdinde. Bu yeri geliyor vatandaş oluyor, yeri geliyor galerici, yeri geliyor müteahhit.Vatandaşın kendini koruma çabasını takdir ederim. Devlet vatandaşı koruyacak adımlar atmıyorsa vatandaş kendini koruyacak adımlar atıp, kendine ek gelir oluşturmak için al sat yapacak tabii ki. Bu arada devlet kendine aldığı önlemleri vatandaş için değil, kendisi için alıyor sonuçta kayıp yaşamak istemiyor. Her satış vergi demek. Devlet kendini koruyor. Aslında sosyal devlette devlet vatandaşını koruyor olmalıydı. Mesela ÖTV, üstünden hesaplanan KDV, araçlara ulaşımın zorluğu, pahalılığı bunların hepsi birer etken. Sosyal devlet arabası olanı zengin görmemeli, arabası olmayanı araba sahibi yapmak için neler yapmalıyım bunun derdine düşmeli. Hocam serbest piyasada kendi malının değerini istediğin gibi belirleyebilirsin, benim videoda asıl takıldığım yer satışı 601k üzerinden gosterip, orada KDV ile ilgili rakamı düşük tutma cabasiydi, yoksa bu genç video çektiği için ifşa oldu, benim çevremde de var, ev ve arabadan ozellikle son bir yılda çok iyi paralar kazananlar. Ki kimse kimseye zorla birşey satmiyor,  devlet sizin de dediğiniz gibi vatandaşı koruyacak adımları atmiyorsa vatandaş ek gelir oluşturmak için bu yolu gayet tabii ki seçebiliyor.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gospodin",
      "created_time": "July 30, 2023, 06:30:17 AM",
      "body": "pandemi döneminde yaşanan çip krizi harici bayilerde hep araba vardı ama bununla birlikte bizde de ahlaksızlık olunca normal bir insan arabaya ulaşmak için türlü türlü taklalar atmak zorundaydı. düşünsenize araba almak için rüşvet ödüyorsunuz! birileri kendi arasında arabaları paslaşıp havadan araba fiyatının en az %10'unu cukkalıyordu. şimdi para yok hadi bakalım yap yine aynı artistliği çakal kardeş! ilerleyen dönemde nakit parası olan çok keyifli yaşayacak.@totti67 o videoyu çeken eleman yaptığı hareketin suç olduğunu bilmeyecek kadar dünyadan habersiz yaşıyor. videoya çekip dünyaya paylaşmak nedir? bu gibi insanlar araba alım satım işinden deli gibi para kazandılar. işin komik tarafı da bence tam olarak bu.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "halloweenn666",
      "created_time": "July 30, 2023, 06:46:49 AM",
      "body": "Çok büyük rezaletler gördük.Bayilerde nasıl araç olmaz hala anlamadım tam 3 yıldır araba piyasası ne hale geldi.Bayide nasıl araba yok ben araba firmalarının yerinde olsam tüm satışları internetten yapar arabayı kamyona koyar evinin önüne bırakırım müşterinin.Gir siteye öde aracın ücretini teslimat tarihini al aracın evine gelsin. Çünkü 3 yıldır paran oluyor araba alayım diyorsun paranla rezil oluyorsun.Bayide araba olmayacaksa nerede olacak ? Bu üretilen arabalar nereye gidiyor.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "totti67",
      "created_time": "July 30, 2023, 06:56:04 AM",
      "body": "Quote from: gospodin on July 30, 2023, 06:30:17 AMpandemi döneminde yaşanan çip krizi harici bayilerde hep araba vardı ama bununla birlikte bizde de ahlaksızlık olunca normal bir insan arabaya ulaşmak için türlü türlü taklalar atmak zorundaydı. düşünsenize araba almak için rüşvet ödüyorsunuz! birileri kendi arasında arabaları paslaşıp havadan araba fiyatının en az %10'unu cukkalıyordu. şimdi para yok hadi bakalım yap yine aynı artistliği çakal kardeş! ilerleyen dönemde nakit parası olan çok keyifli yaşayacak.@totti67 o videoyu çeken eleman yaptığı hareketin suç olduğunu bilmeyecek kadar dünyadan habersiz yaşıyor. videoya çekip dünyaya paylaşmak nedir? bu gibi insanlar araba alım satım işinden deli gibi para kazandılar. işin komik tarafı da bence tam olarak bu.Hocam bence yaptığından gayet te haberi var, artık reklamın iyisi kötüsü olmaz diye mi düşündü bilemiyorum. Öte yandan işin içindeki satış rakamınin 601k gösterilerek düşük KDV ödeme cakalligi dışında başka arızalı bir durum da yok sanırım. Alıcısını bulursan sıfır fiyatının altında olmak kaydıyla istediğin fiyata satışa koyarsın, etik midir bilemem ama alan da çoğunlukla bir süre sonra biraz karla satma mantığında olduğundan çiçek gibi sistem kurulmuş oluyor onlar için. Bayilere gelince çok duydum açıktan para isteyenleri ama bence bundan sonra olayın seyri sizin dediğiniz gibi olacak.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mandown",
      "created_time": "July 30, 2023, 08:24:59 AM",
      "body": "Bir başka konuda söylediğim gibi bayide her zaman araç vardı sadece zenginler, stokçular, iş çevreleri vb yerler alabiliyordu nereden baksan 2-3 yıldır bu konu var kardeşim bu araç yoksa bu bayiler nasıl ayakta kalıyor kim bu adamların maaşını ödüyor. Araç problemi aslında 2023'ün başında yavaş yavaş çözülmeye başlamıştı karadenizin belli noktalarındaki bayilerde araçları birkaç ay içerisinde alabiliyordunuz ama bnazı bayiler bildiğin stokluyordu. Araçlar son 2 yılda dolar bazlı 2x yaptı.  2 Yıl önce 30k usd ile aldiğin araç şuan 60k usd seviyesinde bunu erken gören iş adamları araçları stokladı. Nereye girip baksan bir şekilde sıfır araç görüyorsun.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jakdanyel",
      "created_time": "July 30, 2023, 10:52:11 AM",
      "body": "Bazı otoparklarda stoklanan onlarca hatta yüzlerce araba video kaydına alınmıştı. Bu uyanıklılık hakkında adam gibi bir yaptırım sistemi olmadığı için de galericiler istedikleri gibi at koşturabiliyordu. Hukuk sistemimiz biraz daha iyi çalışsa bu gibi şeyler cezasız kalmaz zaten. Artık araç bulma konusunda dediğiniz gibi bir gelişme varsa araç alacaklar için iyi haber tabi.Bir de Mercedes'in yaşadığı durum aklıma geldi şimdi. Ne güzel online satış sistemi kurmuşlardı. Sonrasında birtakım uyanık galericilerin siteye bot kurup herkesten önce davranarak araçları hızlıca satın alma aşamasına getirdikleri tespit edildi. Sonrasında da Mercedes bu sistemi sona erdirdiğini duyurdu.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SUPERSAIAN",
      "created_time": "July 30, 2023, 11:21:37 AM",
      "body": "Dünyada yaşanan chip kriziyle beraber otomobil üretimleri sekteye uğramıştı. Aslında bayilerde gene araçlar oluyordu fakat fırsatçılar stokçuluğa çevirdiği için aktif bir denetim mekanizması olmadığından dolayı insanlar alacak araç bulamadılar. Yeterli araç olmadığından olan aracının da garajlarda yattığı içinde piyasayı alt üst etti bu çakallar. İkinci el arabalarının satışlarının sıfır bayi satışlarının önüne geçmesi gibi mantıksızlık içerisinde yaşıyoruz.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zonefloor",
      "created_time": "July 30, 2023, 03:21:25 PM",
      "body": "Fiyatlar iyice arşa yükseldikten sonra açıkçası olmasınında pek anlamı yok. En azından belli bir kesim için olmasının bir anlamı yokSıfır araçları alacak olanlar ellerinde hazır malı olanlar veya zamanında belli birikim yapmış insanlar. Devlet belli bir kesimi güvence altına almadığı sürece ki almayacak sıfır aracı geçtim düşük modelli 2. El araç almak dahi büyük sıkıjtı oldu",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "wolwoo",
      "created_time": "July 30, 2023, 03:22:41 PM",
      "body": "Bayilerde artık araç var ama para yok",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "püsür",
      "created_time": "July 30, 2023, 05:42:58 PM",
      "body": "Quote from: Silence Scream on July 30, 2023, 03:56:51 AMEkonomide sert adımlarla birlikte bazı sonuçlar elde edildi. Bunlardan en somut olan ve bizlerin hayatını etkileyeni ise kredilerin oranlarının çok yükselmesi ve ihtiyaç kredisine 70 bin lira tavan limit belirlenmesi. Bunun dışında ticari işletmelere daha fazla kredi verilebiliyor.Bunlarla birlikte artık özellikle birinci ve ikinci el oto satışı işinde artık sinek avlar oldu çakal sürüsü. Önceden arabamı satar üstüne kredi çeker daha iyi arabaya binerim diyen insanlar artık kredi çekemediğinden araç alamaz oldu. İkinci el piyasasında hükümete yakın kaynaklar kâr elde etmek için yapılacak satışların liste fiyatı üstüne listeleme yasağıyla ikinci el piyasasının düştüğünü iddia ediyorlar ama öyle bir şey yok. Artık merkez bankası yıl sonu enflasyon beklentisini de gerçekçi düzeye oluşturdu. Buradan düşünce ile faizlerin daha da yukarı çıkacağından bahsedebiliriz. Bu durumda araç piyasası iyice durgunlaşacak çünkü inanılmaz seviyelerde ikinci eller sıfırı geçmiş durumda.Şimdi de galerici arkadaşlar Whatsapp durumunda kaliteli marka araçları hemen teslim veya ağustos teslim gibi seçeneklerle satışa hızlı şekilde çıkarmışlar. Pakette istemiyorlar, haraç talep etmiyorlar. Arabaların satılmama ihtimali gözlerini korkutmuş gibi. Nakiti olan arabaya gömmez, gider şu ortamda faize koyar ne bileyim döviz yapar ama durduğu yerde ayda 3-4 bin lira zarar ettirecek bir yatırıma parasını gömmez bunu anladılar herhalde. İhtiyacı olan haricinde satışlar neredeyse durmuş. Artık galerilerde arabalar var beyler haberiniz olsun.Hocam galeri ile bayi farklı şeyler. Galeride hep araç vardı. Bayilerden nasıl alıyorlarsa artık, rüşvet midir yoksa başka bir şey midir bilmiyorum, alıyorlardı ve bayiden alamadığımız sıfır aracı bunlar üstüne hayvan gibi para ekleyip satıyorlardı. İlginç bir şekilde bu aralar arabaların fiyatlarının çok yükselmesi sebebiyle ve artık yatırım aracı olma durumunun giderek azalması sebebiyle iptaller artmış. Sıra bekleyen insanlar vazgeçmiş yani. Temmuzda 110.000'den fazla araç satış rakamı bekleniyor. Böyle bir piyasa olmasına rağmen artık bir yavaşlama olacak galiba. Herkes bayilerin peşinden koşuyordu, şimdi bayiler aramalara, insanları ikna etmeye başlamışlar diyorlar. Umarım piyasa düzelir.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bthd",
      "created_time": "July 30, 2023, 10:09:13 PM",
      "body": "Quote from: Silence Scream on July 30, 2023, 03:56:51 AM...Artık galerilerde arabalar var beyler haberiniz olsun.Arabaların olması artık pek bir şeyi değiştirmez. Asgari ücret 11k TL, ortalama sayabileceğimiz devlet memuru maaşı 22k TL civarındayken ortalama sayılabilecek çoğu arabanın fiyatı 1 milyon liranın üzerinde. Ortalama bir arabaya sahip olabilmesi için insanların 4 seneden fazla süre hiç bir harcama yapmaması ve kazandığı parayı yüksek enflasyona karşı ezdirmeden 4 sene boyunca korumanın bir yöntemini bulması gerekiyor ki enflasyonun bu denli güçlü olduğu bir ülke de paranın değerini enflasyona karşı koruyabilmek ekonomik anlamda ciddi bir bilinç gerektiriyor. Kredi musluklarını er yada geç açmak zorunda kalacaklar ve aynı filmi baştan izleyeceğiz. Zira şu anki şartlar altında toplumun çok büyük bir bölümünün günümüz en temel ihtiyaçlarından birisi olan arabaları alabilecek gücü yok. Hani avrupanın bazı şehirleri gibi çok gelişmiş metro ağları v.b. olsa araba almadan yaşasınlar diyeceğim ama maalesef toplu taşıma alanında da halen çok gerideyiz.Bir diğer seçenek dünya geneline bakıldığında absürd olan özel tüketim vergisinin indirilmesi lakin bunca senedir herhangi bir verginin kalıcı olarak indirildiğini yada ortadan kalktığını görmedim. En azından sıradan halkı etkileyen vergiler için durum böyle.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "totti67",
      "created_time": "July 31, 2023, 06:31:23 AM",
      "body": "Eskiden (80-90 lari kastediyorum )para değerliydi, araba vardı ve paramız güçlüydü, çünkü piyasada karşılığı vardı, alım gücü vardı, çoğu aile tek maaşla temel gereksinimlerini karşılayabiliyordu, şimdi ise bence yine araba var ama paranın pul olması, karşılığının olmaması yani alım gücünün yerlerde olması nedeniyle bırakın tek kişinin çalıştığı aileyi karı koca calisan hatta çocukları da çalışan ailelerin bile sıfır araba almaları çok zor, ev için ise işler daha zor.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "eightdots",
      "created_time": "July 31, 2023, 07:46:14 AM",
      "body": "Quote from: totti67 on July 31, 2023, 06:31:23 AMEskiden (80-90 lari kastediyorum )para değerliydi, araba vardı ve paramız güçlüydü, çünkü piyasada karşılığı vardı, alım gücü vardı, çoğu aile tek maaşla temel gereksinimlerini karşılayabiliyordu, şimdi ise bence yine araba var ama paranın pul olması, karşılığının olmaması yani alım gücünün yerlerde olması nedeniyle bırakın tek kişinin çalıştığı aileyi karı koca calisan hatta çocukları da çalışan ailelerin bile sıfır araba almaları çok zor, ev için ise işler daha zor.Gençleri eskiden rahat rahat yapabildikleri şeyler ile kıyaslayan insanlar oluyor. Günümüzden bir haberler ve gerçeği görmüyorlar. Görmek istemiyorlar demiyorum, göremiyorlar. Öyle bir bakış açıları yok. Paranın değerli olduğu zamanlarda memur ve işçi hedeflediği şeyi alabiliyordu. Hemen alamazsa bile bir süre sonra ona ulaşma imkanı vardı.Şimdi ev araba hayali bile kurmak çok zor. Eşi ve kendisi çalışan için bile zor. Zaten durum böyle iken bir de halden anlamayan bazı kişiler karşılarına çıkıp biz şunları şunları aldık çok çalıştık demeleri canlarını iyice sıkıyor. Şartların aynı olmadığını o dönemle bu dönemin aynı olduğunu düşünüyorlar. Bayilerde araç yok da hadi var diyelim zaten aksesuar muhabbetine iyice fiyatlar uçuyor. Araç konusu ülkede zaten çözülemeyecek bir durum olmuş. Biri video çeker 3 günde araç al sattan şu kadar kar ettim diye. Diğeri araç yok çeker ama otoparklar sıfır araçla dolu. Nerden başlasak ne konuşsak boş.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "totti67",
      "created_time": "July 31, 2023, 09:06:06 AM",
      "body": "Quote from: eightdots on July 31, 2023, 07:46:14 AMQuote from: totti67 on July 31, 2023, 06:31:23 AMEskiden (80-90 lari kastediyorum )para değerliydi, araba vardı ve paramız güçlüydü, çünkü piyasada karşılığı vardı, alım gücü vardı, çoğu aile tek maaşla temel gereksinimlerini karşılayabiliyordu, şimdi ise bence yine araba var ama paranın pul olması, karşılığının olmaması yani alım gücünün yerlerde olması nedeniyle bırakın tek kişinin çalıştığı aileyi karı koca calisan hatta çocukları da çalışan ailelerin bile sıfır araba almaları çok zor, ev için ise işler daha zor.Gençleri eskiden rahat rahat yapabildikleri şeyler ile kıyaslayan insanlar oluyor. Günümüzden bir haberler ve gerçeği görmüyorlar. Görmek istemiyorlar demiyorum, göremiyorlar. Öyle bir bakış açıları yok. Paranın değerli olduğu zamanlarda memur ve işçi hedeflediği şeyi alabiliyordu. Hemen alamazsa bile bir süre sonra ona ulaşma imkanı vardı.Şimdi ev araba hayali bile kurmak çok zor. Eşi ve kendisi çalışan için bile zor. Zaten durum böyle iken bir de halden anlamayan bazı kişiler karşılarına çıkıp biz şunları şunları aldık çok çalıştık demeleri canlarını iyice sıkıyor. Şartların aynı olmadığını o dönemle bu dönemin aynı olduğunu düşünüyorlar. Bayilerde araç yok da hadi var diyelim zaten aksesuar muhabbetine iyice fiyatlar uçuyor. Araç konusu ülkede zaten çözülemeyecek bir durum olmuş. Biri video çeker 3 günde araç al sattan şu kadar kar ettim diye. Diğeri araç yok çeker ama otoparklar sıfır araçla dolu. Nerden başlasak ne konuşsak boş.Hocam ben memur bir babanın üç evladindan biriyim, annem de ev hanimiydi, biz üç kardeş çok iyi olmasa da iyi şartlarda okuduk, yaşadık, babam ev için arsa almıştı, emekli olunca rahatlıkla evini yapabildi, arabasını da almıştı hatta, evet bazı şartların bugünle aynı olmadigi doğru o dönemlerde, özellikle kapitalist düzenin korukledigi tüketim çılgınlığı bizim cocuklugumuzda yoktu, herkes ihtiyacı olana yoneliyordu, nesiller gün geçtikçe daha doyumsuz hale getirildi bence bilinçli olarak.Burada asıl husus, idareyi elinde bulunduran erk, neredeyse çeyrek asırdır hükmettiği bir ülkede kontrolü nasıl bu denli kaybeder. Cumhuriyet dönemi kazanımları neredeyse tamamen eridi, cari açık enteresan boyutlarda, ülke mülteci siginagina döndü vs şeklinde sürekli anlatmaktan yorulduk, bıraktım artık herkes hakettiği şekilde yaşasın bizden bu kadar .",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ajanwalker",
      "created_time": "July 31, 2023, 10:26:17 AM",
      "body": "Quote from: totti67 on July 30, 2023, 04:58:10 AMBu konuya ilgili geçenlerde dikkat çekici bir video vardı, rakamları karıştırıyor olabilirim ama bir genç, 600 e aldığı arabayı birkac gun sonra 750 ye satmıştı, bu arada noter aşamasında dönen akıl oyunlarini falan da videoda görmüştük ayrıca. Devlet kendince önlemler alıyor ama bizim halktan bir kesim sürekli her ortamda her şartta çok kazanma derdinde. Bu yeri geliyor vatandaş oluyor, yeri geliyor galerici, yeri geliyor müteahhit.Hepimiz aynıyız ne yazık ki hocam. ( Millet olaraktan yani) Aldığımız şeyi nasıl çok fazla karla satarız derdimiz o. Benim bir arkadaşım arsasını sattı 4 milyon TL'ye aradan 2 ay geçti o arsa 6 milyon olmuş tüh ucuza gitti diyore. Ben 10 kat kar elde ettim şükür demiyor. Hep daha fazla. Araç galaeri işleri de öyle. Alıcı daha ucuza satıcı daha pahalıya dert bu",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "halloweenn666",
      "created_time": "July 31, 2023, 05:49:22 PM",
      "body": "Araç firmaları bayiler nakit kral olacak kış aylarından önce nakite dolara geçelim fikrine büründü galiba.Ama alır mıyım asla. Araba alacağımız gunlerde gelecek elbet o şimdi değil  ben altın ve doların kudretli olacağı günlere hazırlanırken ikinci el otoyu ya da arabayı garajda bakamam.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hvdv",
      "created_time": "July 31, 2023, 05:58:36 PM",
      "body": "Quote from: totti67 on July 31, 2023, 06:31:23 AMEskiden (80-90 lari kastediyorum )para değerliydi, araba vardı ve paramız güçlüydü, çünkü piyasada karşılığı vardı, alım gücü vardı, çoğu aile tek maaşla temel gereksinimlerini karşılayabiliyordu, şimdi ise bence yine araba var ama paranın pul olması, karşılığının olmaması yani alım gücünün yerlerde olması nedeniyle bırakın tek kişinin çalıştığı aileyi karı koca calisan hatta çocukları da çalışan ailelerin bile sıfır araba almaları çok zor, ev için ise işler daha zor.Ev alamayan adamlar artık araba alarak yatırım yapmak istedikleri için arabalara rağbet artmıştı ancak kredi muslukları kapandığı için artık sıfır araba almak çok zor. Zaten başlıkta da bu yüzden herhalde araba var deniliyor. Daha düne kadar çocukları çalışmayan tek maaş insanlar istedikleri sıfır arabayı alabilirken şimdi çift maaş olanlar bile sıfır araba alamaz duruma geldiler.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}