{
  "id": "topic_5460236",
  "title": "Sidney986",
  "author": "Sidney986",
  "created_time": "July 18, 2023, 02:50:51 PM",
  "content": "I imported 2 master public keys from Android Electrum to Windows Electrum.When checked all the addresses in Electrum on Windows I noted both wallets were missing an address.On android the addresses go from 0 to 20On window the addresses go from 1 to 20Address 20 on android is missing from the addresses list in windows.  Surely the master public key should have created all 21 addresses.All the change addresses were present.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5460236",
  "comments": [
    {
      "author": "OmegaStarScream",
      "created_time": "July 18, 2023, 02:56:28 PM",
      "body": "Are you using an older version by any chance? I just tried to import a master public key from Android to the Windows version and I couldn't reproduce the problem. The Android version is showing 20 addresses (from #00 to #19) and so is the Windows wallet, same addresses.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "July 18, 2023, 02:59:09 PM",
      "body": "Quote from: OmegaStarScream on July 18, 2023, 02:56:28 PMAre you using an older version by any chance? I just tried to import a master public key from Android to the Windows version and it's working fine. The Android version is showing 20 addresses (from #00 to #19) and so is the Windows wallet.I do not even know the point of this thread at all (I mean the topic). I checked it too, I saw 0 to 19. I generated master public key and import it on Android Electrum and it was still 0 to 19 receiving addresses.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sidney986",
      "created_time": "July 18, 2023, 03:02:11 PM",
      "body": "Quote from: OmegaStarScream on July 18, 2023, 02:56:28 PMAre you using an older version by any chance? I just tried to import a master public key from Android to the Windows version and I couldn't reproduce the problem. The Android version is showing 20 addresses (from #00 to #19) and so is the Windows wallet, same addresses.Both versions are the latest v4.4.5.0I checked multiple time line by line and counted them.  Address 20 on android is missing from the windows version.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "July 18, 2023, 03:05:10 PM",
      "body": "Quote from: Sidney986 on July 18, 2023, 03:02:11 PMBoth versions are the latest v4.4.5.0I checked multiple time line by line and counted them.  Address 20 on android is missing from the windows version.It started from 0 to 19 which makes it 20 addresses.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitcoin_Arena",
      "created_time": "July 18, 2023, 03:10:26 PM",
      "body": "Quote from: Charles-Tim on July 18, 2023, 02:59:09 PMI do not even know the point of this thread at all (I mean the topic). I checked it too, I saw 0 to 19. I generated master public key and import it on Android Electrum and it was still 0 to 19 receiving addresses.#00 to #19 = 20 addressesCheck again Never mindI think OP got confused by the numbering.If OP wants to confirm that they are the same exact number. Let him look at the first receiving address and the last receiving address. They are both the same on PC and android.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sidney986",
      "created_time": "July 18, 2023, 03:37:33 PMLast edit: July 18, 2023, 03:59:48 PM by Sidney986",
      "body": "I just created a new wallet on Android and it does shows green addresses 0 to 19My wallet on Android showing green addresses 0 to 20 was imported master public key from electrum wallet created in tails.  I could give a screen shot but don't want to reveal by used public addresses.I did screen captures, how do I upload them.  No option to select my image files that I can see on this website.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mpamaegbu",
      "created_time": "July 18, 2023, 04:15:57 PM",
      "body": "Quote from: Sidney986 on July 18, 2023, 03:37:33 PMI could give a screen shot but don't want to reveal by used public addresses.Not as if anyone would care to see what's in those addresses anyway. I'm not sure public addresses put anyone in danger apart from unveiling how much they've received. However, you can block part of the letters in the addresses or blur them out to prevent the public knowing what's there.QuoteI did screen captures, how do I upload them.  No option to select my image files that I can see on this website.There's a new image hosting site for the forum created by user joker_josue after imgur started misbehaving. You can find everything about it at the Image hosting for BitcoinTalk thread.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hosemary",
      "created_time": "July 18, 2023, 04:40:59 PMLast edit: July 18, 2023, 04:54:43 PM by hosseinimr93",
      "body": "Quote from: Sidney986 on July 18, 2023, 03:37:33 PMMy wallet on Android showing green addresses 0 to 20 was imported master public key from electrum wallet created in tails. What was explained by OP is completely possible. The default gap limit on electrum is 20. This means that electrum generates more addresses until in reaches 20 consecutive unused addresses. If your wallet is showing 21 receiving addresses, that's because you have used the first address. You should see the same number of addresses on the desktop version of your wallet, unless that wallet is offline and electrum doesn't know that the first address has been used. Assuming you have used the first address and not more, you should see addresses 0-20 on your online wallet and addresses 0-19 on your offline wallet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sidney986",
      "created_time": "July 18, 2023, 05:58:44 PM",
      "body": "Quote from: hosseinimr93 on July 18, 2023, 04:40:59 PMQuote from: Sidney986 on July 18, 2023, 03:37:33 PMMy wallet on Android showing green addresses 0 to 20 was imported master public key from electrum wallet created in tails. You should see the same number of addresses on the desktop version of your wallet, unless that wallet is offline and electrum doesn't know that the first address has been used. Assuming you have used the first address and not more, you should see addresses 0-20 on your online wallet and addresses 0-19 on your offline wallet. Yes is just the first address used.  Have to go online tomorrow and see if that missing address shows on windows version.Am I correct in thinking that more addresses are not created.  Just the fixed amount generated by the seed and the change addresses.  What happened when all addresses used up, do old ones get reused again?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hosemary",
      "created_time": "July 18, 2023, 06:02:24 PMLast edit: July 18, 2023, 06:14:02 PM by hosseinimr93",
      "body": "Quote from: Sidney986 on July 18, 2023, 05:58:44 PMYes is just the first address used.  Have to go online tomorrow and see if that missing address shows on windows version.There is no need to connect your wallet to internet.Just go to console and increase the gap limit using the following command. (If you don't see the \"console\" tab, click on \"View\" at top of the window and check \"Console\".)Code:wallet.change_gap_limit(50)This command will increase the gap limit to 50. You can change the 50 to any number you want. You can also generate more addresses without increasing the gap limit using the following command. Code:[wallet.create_new_address(False) for i in range(10)]This command will generate 10 more addresses. You can change the 50 to any number you want.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sidney986",
      "created_time": "July 18, 2023, 06:21:38 PM",
      "body": "Quote from: hosseinimr93 on July 18, 2023, 06:02:24 PMQuote from: Sidney986 on July 18, 2023, 05:58:44 PMYes is just the first address used.  Have to go online tomorrow and see if that missing address shows on windows version.There is no need to connect your wallet to internet.Just go to console and increase the gap limit using the following command. (If you don't see the \"console\" tab, click on \"View\" at top of the window and check \"Console\".)Code:wallet.change_gap_limit(50)This command will increase the gap limit to 50. You can change the 50 to any number you want. You can also generate more addresses without increasing the gap limit using the following command. Code:[wallet.create_new_address(False) for i in range(10)]This command will generate 10 more addresses. You can change the 50 to any number you want. Thank you. Useful info to know.So if I increased the gap limit and used all those extra addresses, then restored the wallet afresh, those extra addresses would not show.  Would electrum be able to spend from them or only once I increased the gap limit.to let electrum know about them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mpamaegbu",
      "created_time": "July 18, 2023, 06:52:37 PM",
      "body": "Quote from: Sidney986 on July 18, 2023, 06:05:15 PMQuote from: Mpamaegbu on July 18, 2023, 04:15:57 PM~snipped~I'll admit to being a novice.Well, on this admittance; let me quickly remind you that you posted in a roll and that's not good. It's against the forum rule. You've to merge your two posts or ask mods to do it if you don't know how to do it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hosemary",
      "created_time": "July 18, 2023, 07:17:40 PM",
      "body": "Quote from: Sidney986 on July 18, 2023, 06:21:38 PMSo if I increased the gap limit and used all those extra addresses, then restored the wallet afresh, those extra addresses would not show.  Would electrum be able to spend from them or only once I increased the gap limit.to let electrum know about them.It depends. As I already said, the default gap limit on electrum is 20. If you have used the 21st address without using the first 20 addresses, electrum wouldn't show the transaction history of the address 21, unless you increase the gap limit. Electrum starts from the first address, checks the transaction history of your addresses one by one and it stops once it sees 20 consecutive unused addresses. Take note that your seed phrase generates numerous addresses and it's impossible for electrum to check them all.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Stalker22",
      "created_time": "July 18, 2023, 09:45:40 PM",
      "body": "Quote from: Sidney986 on July 18, 2023, 05:58:44 PM~Am I correct in thinking that more addresses are not created.  Just the fixed amount generated by the seed and the change addresses.  What happened when all addresses used up, do old ones get reused again?Initially, Electrum generates the first 20 addresses and another 10 that are labeled and used as \"change addresses\". There is no real difference between receiving and change addresses, it is just the way Electrum uses them, and all funds received at any of those addresses will be added to the balance of your wallet. When those first 20 addresses are used, Electrum generates the next batch of 20 addresses, and so on. There is no limit because the number of possible addresses generated from one seed is unlimited.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hosemary",
      "created_time": "July 18, 2023, 10:03:15 PM",
      "body": "Quote from: Stalker22 on July 18, 2023, 09:45:40 PMWhen those first 20 addresses are used, Electrum generates the next batch of 20 addresses, and so on. This is not true. It's not that electrum generates new addresses after all first 20 addresses are used.Electrum generates the 21st address once  you use the first address, the 22nd address, once you use the second address and so on.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sidney986",
      "created_time": "July 19, 2023, 06:11:12 PMLast edit: July 19, 2023, 08:36:11 PM by Mr. Big",
      "body": "That missing address showed up today when I allowed the wallet online access.  So everything fine now.  Quote from: hosseinimr93 on July 18, 2023, 10:03:15 PMQuote from: Stalker22 on July 18, 2023, 09:45:40 PMWhen those first 20 addresses are used, Electrum generates the next batch of 20 addresses, and so on. This is not true. It's not that electrum generates new addresses after all first 20 addresses are used.Electrum generates the 21st address once  you use the first address, the 22nd address, once you use the second address and so on.So true.  I checked my android wallet today and have extra addresses despite not using all of them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Stalker22",
      "created_time": "July 20, 2023, 09:48:19 PM",
      "body": "Quote from: hosseinimr93 on July 18, 2023, 10:03:15 PMQuote from: Stalker22 on July 18, 2023, 09:45:40 PMWhen those first 20 addresses are used, Electrum generates the next batch of 20 addresses, and so on. This is not true. It's not that electrum generates new addresses after all first 20 addresses are used.Electrum generates the 21st address once  you use the first address, the 22nd address, once you use the second address and so on.Yes, you are correct. My bad, I didn't actually count them. I just went with what I remembered, and I was pretty sure that electrum shows (generates) addresses in batches of 20. Well, either I stumbled upon an ancient version of Electrum, or I just had a classic case of \"memory corrupt\" here.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}