{
  "id": "topic_5441852",
  "title": "G.Seed",
  "author": "G.Seed",
  "created_time": "March 01, 2023, 02:24:05 PMLast edit: March 02, 2023, 01:23:32 PM by Halab",
  "content": "Edit modo : En provenance de : https://bitcointalk.org/index.php?topic=5382972.msg61833336#msg61833336Quote from: Halab on February 28, 2023, 01:46:02 PMEt petit HS sur les religions car c'est un point qui te semble important. Désolé de briser ta narrative, mais je ne suis pas juif (et si tant est que je l'aurais été, ça aurait été pareil). Un curé m'a fait prendre un bain contre ma volonté quand j'étais bébé, c'est tout.Je vais essayer d'être très clair : j'encule tous les dieux et tous les fanatiques d'un dieu. Il est pas né le dieu qui me dira quand (ramadan, carême, etc...) ou quoi manger (j'aime le porc et le boeuf). Tu peux être croyant, c'est ton choix de croire des fables pour faire peur aux enfants. Spoiler : le paradis et l'enfer n'existent pas, tu finiras bouffer par des vers ou dans un four crématoire.Si jamais je croise un génie qui m'octroie 2 voeux. Le premier voeu sera de faire disparaitre toutes formes de religion (et les écologistes et les wokes (c'est gratuit, c'est cadeau)). Je ne doute pas de la capacité de l'Homme à se foutre sur la gueule pour autre chose, mais au moins ça ne sera pas au nom d'un charlatan imaginaire. Le 2ème voeu sera le BTC à 10 millions $, ça résoudra beaucoup de mes problèmes .Non, tu n'es pas juif, mais on a tous une religion, camarade. Il y a ceux qui savent en quoi ils croient, les musulmans, les juifs, les chrétiens et ceux qui prétendent ne croire en rien, ce qui les rend encore plus prisonniers de leur croyance. Si toutes les religions disparaissent la tienne aussi, et tu seras obligé d'utiliser ton cerveau pour disqualifier des gens, ça ne suffira plus d'utiliser le mot magique (que ce soit \"antisémite\" ou \"mécréant\"...), tu es sûr que tu veux ça ? Utiliser ton cerveau pour de vrai ?QuoteA noter qu'Israel n'a pas pris une position tranchée en faveur de l'Ukraine dans ce conflit. Israel a même tenté, avec cependant moins de succés que par exemple la Turquie, de jouer un rôle d'intermédiaire entre russes et ukrainiens.Ton \"Israël\" a vendu des armes à l'Azerbaïdjan, et tous les lobbyistes juifs français, enfin tout le pouvoir français, ça revient au même, a poussé la France a soutenir l'Arménie.Ton \"Israël\" ne prend de positions tranchées que pour \"Israël\" et pour son porte-monnaie. Quant au Rav Ron Chaya (le grand ami d'Oscar2000, il déclare que la guerre entre GOG et MAGOG (qu'il assimile à la Russie et aux Etats-Unis) profitera à ton \"Israël\" et seulement à ton \"Israël\".QuoteIl y a une sorte d'estime réciproque entre états gaullistes. Pour moi Israel et la Russie (et peut-être aussi la Turquie) font partie des rares Etats gaullistes du monde actuel. Ce qui caractérise un Etat gaulliste, c'est principalement l'indépendance, une forte armée, la prise en compte de l'Histoire de la nation.Quote from: WikipediaIsraël reçoit assistance militaire de la part des États-Unis plus que n'importe quel autre pays au monde. Depuis 1987, Israël reçoit en moyenne chaque année 1,8 milliard de dollars en termes de vente ou de financement. Cette aide fut portée à 2,4 milliards sous l'administration Clinton.En 2007, les États-Unis accroissent de 25 % leur enveloppe pour Israël portant leur subvention à 3 milliards de dollars chaque année pour la décennie à venir. Le président américain George W. Bush assure au premier ministre israélien Ehud Olmert que les États-Unis garantiront « un avantage qualitatif » à Israël par rapport aux autres pays du Moyen-Orient.Le 2019 à 2028 l'aide militaire sera élevée à près de 4 milliards de dollars par an.Est ce que c'est cela que tu appelles une \"politique indépendante\" ? Est ce que De Gaulle avait pris cette direction ?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5441852",
  "comments": [
    {
      "author": "patrickus",
      "created_time": "March 01, 2023, 03:20:47 PM",
      "body": "Quote from: G.Seed on March 01, 2023, 02:24:05 PMEst ce que c'est cela que tu appelles une \"politique indépendante\" ? Est ce que De Gaulle avait pris cette direction ?Dans les années 50, l'allié principal d'Israel était la France. Maintenant ce sont les USA. Plus tard ça sera peut-être la Russie, la Chine voire, l'Allemagne ou l'Arabie saoudite. Etre indépendant n'interdit pas d'avoir des alliés. Si un allié fait défaut, on peut en trouver un autre.Quand je dis souhaiter que la France quitte l'UE, on me répond qu'elle va se retrouver seule et trop petite pour se défendre. Je réponds alors \"regardez Israel, c'est un pays encore plus petit que la France et ils ont pourtant une armée trés forte\". Il y a alors toujours quelqu'un pour me rétorquer qu'Israel est aidé par les USA (genre \"c'est pas du jeu\") et je conclus en disant qu'Israel a certes, des alliés, en particulier les USA, mais que la bonne nouvelle, c'est que la France aura aussi le droit d'en avoir, des alliés.Pas besoin d'une grosse Europe impuissante et en réalité très faible et qui aura vocation à rester toujours désunie. La France n'aura jamais les mêmes intérêts que la Pologne ou le Danemark. L'UE n'a aucun avenir.\"Si l'Europe avait vocation à s'unir, ça ferait longtemps que ça serait fait\" (je crois que c'est de Gaulle qui a dit ça mais pas certain)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "G.Seed",
      "created_time": "March 02, 2023, 11:28:41 AM",
      "body": "Quote from: patrickus on March 01, 2023, 03:20:47 PMQuote from: G.Seed on March 01, 2023, 02:24:05 PMEst ce que c'est cela que tu appelles une \"politique indépendante\" ? Est ce que De Gaulle avait pris cette direction ?Dans les années 50, l'allié principal d'Israel était la France. Maintenant ce sont les USA. Plus tard ça sera peut-être la Russie, la Chine voire, l'Allemagne ou l'Arabie saoudite. Etre indépendant n'interdit pas d'avoir des alliés. Si un allié fait défaut, on peut en trouver un autre.Une alliance, c'est mutuel.Tu me donnes ça et je te donne ça. Une alliance, c'est \"on a des intérêts, et on s'entend pour les défendre\".J'ai bien compris ce qu'on sacrifie pour ton \"Israël\" :- Notre culture, les jolis films, les libres, la musique à la Française, on arrête. Brassens tout ça, c'était la vieille France \"antisémite\". C'est beaucoup mieux d'entendre Gainsbourg chanter \"l'ami Caouette me fait la tête\" ou \"le sable d'Israël\", ou carrément de mettre sa fille de 12 ans en culotte sur son lit en couverture de son disque, ou d'entendre par la suite Bruel, et avoir envie de se dire qu'en fait Gainsbourg en comparaison, c'était génial. Mais oui, c'est tellement plus drôle d'écouter Kev Adams que Dieudonné, c'est mieux quand on vit les gags arriver à 1000 km, comme ça n se claque pas les neurones. Bref, la liste est tellement longue...- Notre influence au Moyen-Orient. Ton \"Israël\" a détruit tout nos alliés, toute notre diplomatie au Moyen-Orient, contre rien. On avait une influence au Liban, on avait une influence en Irak, tout ça c'était les réseaux gaullistes. Je suis pas gaulliste, je suis lepéniste, mais je dois reconnaître que les réseaux gaullistes ont travaillé. Un des avantages étant évidemment le ravitaillement en pétrole à prix raisonnable. Israël a détruit tous nos alliés pour mettre en place des Etats islamistes pour son intérêt.- Notre armée : Via les lobbies sionistes (qui ont détruit les lobbies gaullistes) en France. On a attaqué l'Irak, on a attaqué la Libye, on a attaqué la Syrie, c'est à dire que notre Quai d'Orsay a perdu toute crédibilité, et en plus, une guerre ça coûte cher, c'est payé avec nos impôts, suite aux injonctions des lobbies pro-Israël en France, BHL, Kouchner, Fabius, etc.Si tu avais le courage de passer une heure avec moi, de vive voix, mais tu n'as pas ce courage parce que tu sais qu'il y en a un des deux qui sait de quoi il parle et que ce n'est pas toi, je pourrais pendant une heure, t'expliquer ce que ton \"Israël\" coûte à ma France.Je suis tout à fait prêt à t'entendre m'expliquer ce qu'il nous rapporte.Quant aux Etats-Unis, ils ont la moitié des pays du Golfe prêt à leur lécher le cul pour avoir le droit de faire la police à leur place et pour beaucoup moins cher. Je ne pense pas du tout que les Etats-Unis aient besoin de ton \"Israël\", je pense en revanche que ton \"Israël\" a besoin du pognon des USA et travaille pour ça, par un lobbying très puissant. Quote from: Ariel SharonJe veux vous dire une chose très claire : ne vous inquiétez pas des pressions américaines sur Israël. Nous, le peuple juif, contrôlons l'Amérique, et les Américains le saventC'est pas une alliance, c'est une soumission.QuoteQuand je dis souhaiter que la France quitte l'UE, on me répond qu'elle va se retrouver seule et trop petite pour se défendre.La politique, c'est pas du \"souhait\", c'est du rapport de force.Est-ce que tu es prêt à endurer les représailles américaines si on quitte l'UE ? (Parce que UE = USA, j'espère que t'es d'accord au moins sur ça)Est-ce que tu as compris que la liberté, ça se réclame pas, ça s'arrache dans la douleur ?Quoteje conclus en disant qu'Israel a certes, des alliés, en particulier les USA, mais que la bonne nouvelle, c'est que la France aura aussi le droit d'en avoir, des alliés.Est ce que tu veux bien aller organiser des PARTOUZES AVEC DES ENFANTS avec des hauts-placés américains, et les faire chanter avec des vidéos pour qu'ils votent des budgets en faveur de l'armée française ? Parce que c'est ça la méthode \"israélienne\".Est ce que tu veux bien aller détruire le porte-avion de ton \"allié\" en faisant accuser un autre pays pour que ce pays soit attaqué par ton allié ? Parce que c'est ça la méthode \"israélienne\".Est ce que tu veux bien maintenir un espèce de camp de gens dans la misère que tu massacres un peu de temps en temps pour faire la démonstration de tes armes et mieux les vendre par la suite ?Parce que c'est ça la méthode \"israélienne\".Et là je ne te parle que de la version \"wikipédia\", j'évite nombre d'affaire où on a des soupçons énormes.Le problème est que tu vas un peu vite en pensant que la méthode de ton \"Israël\" est si facilement transposable en France. Quand on ne croit pas profondément qu'on fait parti d'un \"peuple élu\", qu'on a une fin, et que la fin justifie tous les moyens, cette méthode est difficilement reproductible dans ma France. Si tu étais français, je n'aurais pas besoin de te dire tout ça.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "patrickus",
      "created_time": "March 02, 2023, 12:27:53 PMLast edit: March 02, 2023, 12:48:53 PM by patrickus",
      "body": "Quote from: G.Seed on March 02, 2023, 11:28:41 AMSi tu avais le courage de passer une heure avec moi, de vive voix, mais tu n'as pas ce courage parce...Tu veux que je répète ce que je t'ai déjà dit ? Il est vain de débattre avec des antisémites. Comment débattre avec des gens qui pensent que les juifs sont l'explication des malheurs du monde ? Par ailleurs, les antisémites sont souvent des moulins à paroles qui se croient supérieurement intelligents parce qu'ils s'étourdissent de dialectique (un peu comme les gauchistes) Je préfère te laisser macérer seul dans ton jus de passions tristes.Quoteje pense en revanche que ton \"Israël\" a besoin du pognon des USA et travaille pour ça, par un lobbying très puissant. oui ils sont trés forts. Pas besoin de complot pour expliquer ça. L'Histoire et les souffrances passées suffisent. Ce qui ne te tue pas te renforce. Et l'Etat juif \"profite\" aussi de l'immense culpabilité qui imprégne les sociétés occidentales qui n'ont pas empêché le génocide nazi. Il faut bien tout de même que cette immense tragédie rapporte un peu quelque chose aux juifs. Mais je crois qu'ils auraient préféré que l'holocauste n'ait pas lieu.QuoteParce que c'est ça la méthode \"israélienne\".Merci de mettre de l'eau dans mon moulin en expliquant en quoi Israel est fort. J'aurais pu aussi prendre d'autres exemples d'Etats petits mais forts : la Suisse, la Norvège, Taiwan, le Qatar...Et dans le passé, on a vu Athènes vaincre l'immense empire perse, l'Angleterre, un pays 4 fois moins peuplé que la France, coloniser presque le monde entier, ou bien la Prusse qui au XVIII éme siécle, n'était guere plus grande que la Belgique mais qui a administré des raclés militaires à la plupart des grands puissances européennes.Dans les années 30, on a même vu le Japon envahir un pays 10 fois plus peuplé: la Chine.Tu vois: pas besoin d'être gros pour être fort.QuoteLe problème est que tu vas un peu vite en pensant que la méthode de ton \"Israël\" est si facilement transposable en France. Quand on ne croit pas profondément qu'on fait parti d'un \"peuple élu\", qu'on a une fin, et que la fin justifie tous les moyens, cette méthode est difficilement reproductible dans ma France.hé oui les français croient de moins en moins dans leur pays. Mais ce n'est pas la faute des juifs. Les français sont 100% responsables de leur destin.QuoteSi tu étais français...Puéril",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Melja",
      "created_time": "March 02, 2023, 03:22:27 PM",
      "body": "QuoteMerci de mettre de l'eau dans mon moulin en expliquant en quoi Israel est fort.J'aurais pu aussi prendre d'autres exemples d'Etats petits mais forts : la Suisse, la Norvège, Taiwan, le Qatar...Et dans le passé, on a vu Athènes vaincre l'immense empire perse, l'Angleterre, un pays 4 fois moins peuplé que la France, coloniser presque le monde entier, ou bien la Prusse qui au XVIII éme siécle, n'était guere plus grande que la Belgique mais qui a administré des raclés militaires à la plupart des grands puissances européennes.Dans les années 30, on a même vu le Japon envahir un pays 10 fois plus peuplé: la Chine.Tu vois: pas besoin d'être gros pour être fort.Par ces exemples,patrickus nous met en évidences les visées expensionistes et dominatrices d'Israel!!!Comment dévier le sujet sur la guerre en Ukraine(ou tout autres sujets) pour faire l'apologie d'Israel. Bravo patrick,du grand art!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "patrickus",
      "created_time": "March 02, 2023, 03:56:06 PM",
      "body": "Quote from: Melja on March 02, 2023, 03:22:27 PMPar ces exemples,patrickus nous met en évidences les visées expensionistes et dominatrices d'Israel!!!Comment dévier le sujet sur la guerre en Ukraine(ou tout autres sujets) pour faire l'apologie d'Israel. Bravo patrick,du grand art!je ne crois pas , non!  Tu m'avais devancer dans ton post qui commence par \"Bouffon\" et où tu parlais de BHL Cohn-Bendit etc...https://bitcointalk.org/index.php?topic=5382972.200J'avais voulu montrer que l'Etat juif n'était pas forcément du côté ukrainien... (pour contredire tes accusations contre les juifs)Mais l'essentiel n'est pas là: l'essentiel c'est que tu deviens hystérique dés lors que l'on parle des juifs ou d'Israel. Donc déjà, CALME TOI.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "G.Seed",
      "created_time": "March 03, 2023, 07:18:38 PM",
      "body": "Quote from: patrickusComment débattre avec des gens qui pensent que les juifs sont l'explication des malheurs du monde ?Qui pense que les juifs sont l'explication des malheurs du monde ?Cite-moi expliquant que les juifs sont l'explication des malheurs du monde, j'ai même dit exactement le contraire dans un de mes derniers messages a destination de \"legaulois\" qui a été effacé (parce que j'y suis allé un petit peu fort).Maintenant faire semblant comme toi de ne pas voir les ravages du lobby pro-Israël sur la France, non. La méthode israélienne, c'est aussi ça, s'attaquer à la logique du goy dès l'enfance, pour le traumatiser.Tu tombes des fois en soirée sur une Véronique qui est caissière à Franprix, qui n'a aucun rapport avec l'histoire, et qui fait une crise de nerfs parce qu'on commence à dire qu'échapper aux \"camps de la mort\" à l'âge de 4 ans et survivre en étant élevée par des loups, c'est peut-être un peu romancé. Elle est de ce côté là, l'hystérie.Quoteoui ils sont trés forts.Ah on ne parle plus d'alliance maintenant ! Si tu reconnais que les USA ne sont pas les alliés de ton \"Israël\", mais que ces derniers ont soumis les USA, on avance.QuotePas besoin de complot pour expliquer ça. A quel moment, je parle de complot ? Il y a des mots que tu sors de temps en temps comme des automatismes, essaie de t'en délivrer, ça te fera du bien.Il y a un lobby juif aux Etats-Unis, il est à fond pour ton \"Israël\". Ce lobby se vante lui-même de posséder à sa botte plus de la moitié des politiciens américains.Lorsque Trump est allé officiellement durant la campagne présidentielle parler à ce lobby, il a déclaré (pardonne ma traduction pas 100% parfaite) \"je ne suis pas contre vous mais vous croyez que je suis contre vous parce que je ne veux pas de votre argent\". C'est passé à la télévision, il n'y a eu aucune contestation et au contraire ils étaient plutôt contents.Dans ces conditions, il est complètement délirant que Jean-Frédéric Poisson par exemple, se soit fait lynché, pour avoir parlé d'une évidence. Et il est délirant qu'on soit traité \"d'antisémite\" pour dire quelque chose qui aux USA est public.Maintenant, je pourrais parler de complot. Ce que je n'avais pas fait jusqu'à maintenant. Par exemple, pour le 11 septembre, bien sûr, je pense que ton \"Israël\" est responsable (ou co-responsable), mais j'ai pas de preuves. J'ai des indices, j'ai des déductions logiques qui m'amènent à croire cela. Evidemment, je ne suis pas le seul. Alors ça, c'est d'après certains une \"théorie du complot antisémite\".Les affaires Weinstein, Epstein, Blablastein, c'était des \"théories du complot antisémites\", les milieux où on discutait de ces affaires étaient dit \"antisémites\", ce fut le cas pendant des années. Maintenant non. C'est juste des vérités, quoi.La Covid... Au départ, la thèse de la fuite de laboratoire, c'était une \"théorie complotiste\". on nous disait que c'était le pangolin et qu'on était vraiment des connards de complotistes de penser que ça pouvait être un laboratoire.Maintenant, la \"thèse complotiste\" n'est plus complotiste.Quote from: TF1La thèse d'un virus fuité du laboratoire de Wuhan revient dans l'actualité.Longtemps écartée, car trop proche des positions complotistes, elle gagne de plus en plus en crédibilité face à de nouveaux éléments.On n'écarte pas une thèse parce qu'elle est \"complotiste\", \"antisémite\" ou \"pipicaca\". On écarte une thèse parce qu'elle est peu logique, parce qu'on n'a pas d'indices allant dans ce sens. On a quelques milliers d'années d'expérience connue d'Histoire de la pensée, du raisonnement. Les pyramides tiennent parce que la base est large est le sommet fin. Ca tiendrait moins bien dans l'autre sens a priori.Quotehé oui les français croient de moins en moins dans leur pays. Mais ce n'est pas la faute des juifs. Les français sont 100% responsables de leur destin.Mais je suis d'accord, je ne confonds pas le symptôme et la maladie, et encore moins le symptôme et le diagnostic. Les pogroms ont été des catastrophes, si ça te rassure que je l'écrive, je l'écris. Et ça n'a rien réglé. Exemple : il n'y a pas de juifs en Algérie (ou presque, je veux dire, il n'y a pas de lobby juif puissant comme en France, l'Algérie ne reconnaît pas \"Israël\"). Est ce que l'Algérie a échappé à la corruption ? Non. C'est pire qu'en France.Est ce que l'Algérie a pu utiliser ses ressources énergétiques intelligemment, je ne crois pas.Autre exemple : je ne crois pas que l'URSS se soit effondré à cause des juifs. Je crois que ça s'est effondré parce que ça ne marchait plus. En revanche, ce que je vois, c'est que les mafias juives s'en sont donné à coeur joie, pour profiter de la misère, racheter des sociétés russes à vil prix, pousser des femmes russes à la prostitution pour leur compte, s'infiltrer au coeur de l'Etat. Tout cela est parfaitement documenté.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Melja",
      "created_time": "March 04, 2023, 04:26:32 PM",
      "body": "Dès lors que les candidats a la présidentielle sont quasiment obligés de se présenter devant l'AIPAC(pour les Etats Unis) et le CRIF(pour la France) pour espérer d'etre élus,c'est qu'il y a soumission. Period.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}