{
  "id": "topic_5452007",
  "title": "karabiber",
  "author": "karabiber",
  "created_time": "May 08, 2023, 09:12:01 PM",
  "content": "Bittrex isimli popüler kripto para borsası, iflas başvurusunda bulundu. Seattle merkezli borsa, son gerçekleştirdiği iflas başvurusu ile kripto para sektörünün gündemine oturmuş durumda.Bir süredir ABD Menkul Kıymetler ve Borsa Komisyonu (SEC) ile mücadele veren Bittrex, iflas kararı ile tarihin tozlu sayfalarına gömülmüş gibi gözüküyor.Kaynak: https://www.kriptopiyasasi.com/son-dakika-bu-bitcoin-borsasi-iflas-etti-nasil-olur/amp/",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5452007",
  "comments": [
    {
      "author": "Bthd",
      "created_time": "May 08, 2023, 10:22:30 PM",
      "body": "Tarihin tozlu sayfalarına gömülmediler. Sadece ABD vatandaşları ve ABD için geçerli bu başvuru. Bittrex tarafından gerçekleştirilmiş duyuruyu dikkatli incelerseniz duyuru içerisinde bu olayın bittrex globali etkilemeyeceğine dair içeriği bulabilirsiniz. Bittrex'in ABD'den çekileceği zaten daha önceden de biliniyordu.QuoteThis announcement does not impact Bittrex Global, which will continue operations as normal for its customers outside the U.S.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "teramit",
      "created_time": "May 09, 2023, 12:59:37 PM",
      "body": "Dolandırıcı firmanın tekidir, global lokali farketmez, birçok başlıkta millet parasını alamadığından bahsediyor. bir arkadaşın 1 btc si çalınmıştı 2fa lı hesaptan, ben hackerler yapmıştır diyordum ama borsanın kendi yapmış birçok kişinin başına gelmiş. 1-2 bin dolar varsa ellemiyorlar ama 5-10 bin dolar olunca çekemiyorsun parayı binbir bahane öne sürüyorlar. şimdide iflas bahanesiyle paralara çökecekler, Bayadır id nizin süresi geçti diye mesaj atıyordu, sanki son kullanma tarihi var. Rezil herifler.  poloniex te bununla aynı yolda",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kriminall",
      "created_time": "May 10, 2023, 11:47:38 AM",
      "body": "Quote from: teramit on May 09, 2023, 12:59:37 PMDolandırıcı firmanın tekidir, global lokali farketmez, birçok başlıkta millet parasını alamadığından bahsediyor. bir arkadaşın 1 btc si çalınmıştı 2fa lı hesaptan, ben hackerler yapmıştır diyordum ama borsanın kendi yapmış birçok kişinin başına gelmiş. 1-2 bin dolar varsa ellemiyorlar ama 5-10 bin dolar olunca çekemiyorsun parayı binbir bahane öne sürüyorlar. şimdide iflas bahanesiyle paralara çökecekler, Bayadır id nizin süresi geçti diye mesaj atıyordu, sanki son kullanma tarihi var. Rezil herifler.  poloniex te bununla aynı yolda Binance’dan önce Bittrex ve Poloniex’e muhtaç bir piyasa bile vardı bir dönem, sanki o dönemde insanları mecburen onları kullanmak zorundaydı gibi, artık günü geçen durumlarda baktığınızda bir çok şaibeli hareketleri var, bence Bittrex çoktan iflas etmeyi hak etmişti, hala orada işlem yapanlar mecburiyetten yapıyordur eminim, çok para bulundurmak gerekiyorsa daha iyi borsalarda işlemleri yapmak daha mantıklı olur, risk alıyorsak düşük risk alalım  Binance benim işimi fazlasıyla görüyor ,",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bthd",
      "created_time": "May 10, 2023, 10:05:00 PM",
      "body": "Quote from: kriminall on May 10, 2023, 11:47:38 AMBinance’dan önce Bittrex ve Poloniex’e muhtaç bir piyasa bile vardı bir dönem, sanki o dönemde insanları mecburen onları kullanmak zorundaydı gibi, artık günü geçen durumlarda baktığınızda bir çok şaibeli hareketleri var, bence Bittrex çoktan iflas etmeyi hak etmişti, hala orada işlem yapanlar mecburiyetten yapıyordur eminim, çok para bulundurmak gerekiyorsa daha iyi borsalarda işlemleri yapmak daha mantıklı olur, risk alıyorsak düşük risk alalım  Binance benim işimi fazlasıyla görüyor , Poloniex'deki sohbet alanıyla ilgili bir kaç efsane dinlemişliğim var. Güncel pump/dump grubu olayını borsanın sohbeti üzerinden gerçekleştiriyorlarmış ben hiç kullanmadım poloniex. Sadece Justin Sun satın almadan hemen önce elime bounty karşılığı gelmiş bir birimi satmak için çaba sarf ettim, onu da başaramadım. Yeniliğe kapalı olan kim olursa olsun eninde sonunda yok oluyor. Bunun en büyük ve canlı örneklerinden birisi Nokia. Bir dönem cep telefonu ile eşdeğer markaydı. İşletim sisteminde uzun süre ısrar etmenin bedelini ağır ödediler. Aynı şey kripto borsaları için de geçerli. Bittrex, poloniex be hatta bitfinex'de artık eski popülerliklerinin yanından bile geçemiyorlar. Benzer hataları binance yönetimi de yaparsa aynı sonu yaşarlar.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "wolwoo",
      "created_time": "May 11, 2023, 01:30:00 AM",
      "body": "2017'nin o ilk kıpırtlarında polo oldukça hareketliydi, sevimli bir arayüzü vardı  daha çok manuel işlem yapıyormuş havası vardı yeşil-beyaz daktilo sayfası gibiydi Poloniex- PUMP/DUMP Takip/Analiz2017 ortalarına doğru bittrex rüzgarı esti, manyaq munyaq pumplar olurdu, 2017 halvingten sonra (bi de cash mi ne çıkmıştı) yaz aylarında piyasa kötüye gitti, bittrex kyc istedi ve çekim limitini sürekli indirmeye başladı, bi türlü kyc yapamadım nalet ossun dedim binance'a geçtim, ara sıra tekrar üye olmaya çalıştım ama de get len yeter artık didim, bazen mail atıyorlar hala Bittrex / Analiz / AL - SAT",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pierre 2",
      "created_time": "May 11, 2023, 10:28:28 AM",
      "body": "Rahmetli bittrex ile az buz değil çok uzun süreler geçirmişizdir. En büyük ethereum sahipliğini ben bittrex cüzdanımda görmüştüm. O günden beri bir daha asla o miktara erişemedim erişemem de imkanı yok. İyi çok anım var. Hayatıma dokunan, hayatımı olumlu yönde etkileyen, al-sat yaptığım hatta bazen bitcoin de sakladığım bir yerdi. Keşke binance ın yanında yedek olarak hayatta kalabilseydi. Eski ralli dönemlerinde çok çok daha popüler bir yerdi.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "flipme",
      "created_time": "May 11, 2023, 06:32:46 PM",
      "body": "Eski üyelerin çoğunu ilk göz ağrısı. Mtgox'u kullananların da burada olduğunu biliyorum. Ben yalnızca çoğunluğu kastettim. Bittrex yalnızca Amerikan vatandaşlarına işleme kapatılmış ama tamamen kapansaydı da hiçbir şey hissetmezdim.  Amerikan kanunlarının vatandaşlarını koruması beni bazen imrendiriyor. Aslında birçok ICO ve IEO'ya katılamıyorlar ama karar vericiler tarafından risklerden arındırılmış bir markette işlem yapıyorlar. Coinbase'de bulunan coinler ve Binance'de bulunan coinleri karşılaştırınca bile aradaki farkı görmek mümkün. Bir de Binance en eli yüzü düzgün borsa. Binance harici borsalara bakınca durumun ne kadar vahim olduğu daha çarpıcı bir şekilde gözüküyor.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hvdv",
      "created_time": "May 13, 2023, 08:53:38 AM",
      "body": "Quote from: flipme on May 11, 2023, 06:32:46 PMEski üyelerin çoğunu ilk göz ağrısı. Mtgox'u kullananların da burada olduğunu biliyorum. Ben yalnızca çoğunluğu kastettim. Bittrex yalnızca Amerikan vatandaşlarına işleme kapatılmış ama tamamen kapansaydı da hiçbir şey hissetmezdim.  Amerikan kanunlarının vatandaşlarını koruması beni bazen imrendiriyor. Aslında birçok ICO ve IEO'ya katılamıyorlar ama karar vericiler tarafından risklerden arındırılmış bir markette işlem yapıyorlar. Coinbase'de bulunan coinler ve Binance'de bulunan coinleri karşılaştırınca bile aradaki farkı görmek mümkün. Bir de Binance en eli yüzü düzgün borsa. Binance harici borsalara bakınca durumun ne kadar vahim olduğu daha çarpıcı bir şekilde gözüküyor.Hepi topu 178 Btc’lik hacmi var. Amerikan vatandaşlarının bile Bittrex kullanmadıklarından eminim.Eskiden çok meşhur bir site olmuş olabilir ancak yukarıdaki Nokia örneğinde olduğu gibi nesil değiştikçe siz kendinizi yenileyemiyorsanız işte böyle bir kaçınılmaz son sizi bekler. Türk borsalarının bile gerisinde kalırsınız.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "RaltcoinsB",
      "created_time": "May 14, 2023, 04:27:59 AM",
      "body": "Vay be Bittrex deyince aklıma ilk katıldığım dönemler geldi benim de ilk borsam bittrexti demek amerigalılara kapatıyor bittrex zaten artık kullanılmıyor denilebilir o dönemde de shit borsası gibi 1000 tane altcoin vardı saçma sapan pump dump yapıyorlardı   kimin elinde kalırsa birbirine düdüklemeye çalışıyorlardı",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dzigie",
      "created_time": "May 14, 2023, 12:22:13 PM",
      "body": "Bittrex'i bilmiyorum, hiç işlem yapmadım. Fakat Bittrex SEC'e hangi coinlerin menkul kıymet olduğunu sormuş ama bir cevap alamamış. Amerika istediğine izin verir istediğine izin vermez. Yok etmek istediğini de dünyanın hangi ucunda olursa olsun anında ortadan kaldırır. Bittrex global ile çalışan bankalara yaptırım uygulamaya başladıkları anda borsanın global faaliyetleri de sekteye uğrar. Sonra Bittrex tamamen kapandığına dair açıklama yapar. Menkul kıymet sınıfına giren coinler nedeniyle baskı görmeleri bana göre biraz bahane olmuş. Bittrex'in Amerika'daki faaliyetlerine son vermek istemişler ve bir gerekçe gösterek bunu yapmışlar. Başka bir gerekçe göstererek de bunu yapabilirlerdi. Onları engelleyebilecek kimse yoktur.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}