{
  "id": "topic_5430209",
  "title": "Fivestar4everMVP",
  "author": "Fivestar4everMVP",
  "created_time": "December 19, 2022, 07:21:57 PM",
  "content": "We have just a few days to Christmas, so I guess now, it's Okey if we start wishing everyone a happy Christmas in advance.This is a season when we all need money for various expenses like buying children Christmas apparels, shoes and anything that will make them look good. Buying stuffs for ourselves to probably show off to neighbors, family and friends how wealthy we are and all that. Spending lavishly on food and drinks that might end up perishing the next day if everything is not consumes in 24 hours or less.. We need money for several stuff this festival period, yeah, but it is a simple advice I've got for the crypto community which you are part of, Don't sell your Bitcoin to buy stuffs that will perish few days or weeks after Christmas.Christmas comes and in 24 hours, it's gone, Bitcoin is here and will remain with you for as long as you keep, we definitely will sell it one day, but we all know that now is not the right time to sell.If you sell your bitcoin to maybe buy new set of clothes and shoes, you threw away your bitcoin because, in three months time maybe, you probably will Not be wearing those clothes and shoes anymore..Why then lose your Bitcoin for items that perishes in such a short time?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5430209",
  "comments": [
    {
      "author": "Upgrade00",
      "created_time": "December 19, 2022, 07:27:29 PM",
      "body": "This probably is not a topic for Bitcoin discussion, maybe Beginners & Help.Quote from: Fivestar4everMVP on December 19, 2022, 07:21:57 PMIf you sell your bitcoin to maybe buy new set of clothes and shoes, you threw away your bitcoin because, in three months time maybe, you probably will Not be wearing those clothes and shoes anymore..Why then lose your Bitcoin for items that perishes in such a short time? Firstly, I have clothes and shoes I've been wearing for years now and they are still in good condition, I think I'll still be wearing something I got three months ago,Secondly, people are allowed to enjoy things. Investing, of course takes time and patience, in addition to understanding of the market; one should know when to buy and when to sell. If you need to take some profits to enjoy the festive season, by all means do so, have fun and enjoy the holidays with family.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Iroh",
      "created_time": "December 19, 2022, 07:36:12 PM",
      "body": "I think we’re all allowed to chill a bit and enjoy ourselves, at least for the Christmas holidays. During this festive period, we exchange gifts and try to spread joy and cheer to family, friends and everyone around. And if that means letting go of a few satoshi to achieve that, I personally don’t see anything wrong in that. You’re right on the fact that the Christmas Day is just a 24 hour period and then it’s gone. All the more reason to cherish, chill and make merry, isn’t it?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LFC_Bitcoin",
      "created_time": "December 19, 2022, 07:38:15 PM",
      "body": "I’d rather eat yellow snow than sell bitcoin to pay for Christmas presents. Not long until Christmas now so Happy Xmas to you OP & all on the forum. I haven’t been preparing well to be honest, I have been struck down with a bad case of man flu, I’m on day four now. I’ll be better by Christmas though, I have a beast of a turkey to enjoy As I do every Xmas I have printed off & funded bitcoin paler wallets for my loved ones. As far as I am aware they HODL every year & are yet to sell going back many years.Xmas is a great time of year, a special time to spend with people you love. Please have the best one possible.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fivestar4everMVP",
      "created_time": "December 19, 2022, 08:13:55 PM",
      "body": "Quote from: Upgrade00 on December 19, 2022, 07:27:29 PM~Snip~Quote from: Fivestar4everMVP on December 19, 2022, 07:21:57 PMIf you sell your bitcoin to maybe buy new set of clothes and shoes, you threw away your bitcoin because, in three months time maybe, you probably will Not be wearing those clothes and shoes anymore..Why then lose your Bitcoin for items that perishes in such a short time? Secondly, people are allowed to enjoy things. Investing, of course takes time and patience, in addition to understanding of the market; one should know when to buy and when to sell. If you need to take some profits to enjoy the festive season, by all means do so, have fun and enjoy the holidays with family.Yeah, you are absolutely right mate, I never said peeps shouldn't enjoy their Christmas, but personally, I don't think doing so at the expense of selling their bitcoin at a loss is really advisable, watching Bitcoin's performance this year, I can tell you that not very many persons are in profit, except those that have been holding since 2015 or earlier, any body that bought bitcoin beginning from eleven(11) months ago till yesterday is probably not in profit (and I am not talking about day traders), this is why I said in the op that we all know they now is not the best time to sell bitcoin, except you choose to sell at a loss, that's your decision, your bitcoin is your bitcoin and no body has a right to decide what you do with it for you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PrivacyG",
      "created_time": "December 19, 2022, 08:33:21 PM",
      "body": "Generally, Christmas presents are not something I find a pleasure about.  While Christmas itself is a very cozy holiday, I always feel like I am wasting money on useless stuff when buying presents and I always feel like others are wasting money on presents for me.  The idea is not bad, but in practice most of us spend without much sense if any at all.I would be much happier knowing I gave some body a hundred bucks and they bought what ever they really needed or invested in Bitcoin or other commodities.  Now that you know my view, you can imagine I would never spend Bitcoin to purchase myself some presents I do not need.  If all my clothes were worn out and really needed new shoes but had no more Fiat on me, maybe.  But the money I invested?  It should continue to be used carefully, not spent away on things just to have a mental pleasure for five seconds then forget about it.-Regards,PrivacyG",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptoPanda",
      "created_time": "December 19, 2022, 09:38:35 PM",
      "body": "Quote from: LFC_Bitcoin on December 19, 2022, 07:38:15 PMI’d rather eat yellow snow than sell bitcoin to pay for Christmas presents. Not long until Christmas now so Happy Xmas to you OP & all on the forum. I haven’t been preparing well to be honest, I have been struck down with a bad case of man flu, I’m on day four now. I’ll be better by Christmas though, I have a beast of a turkey to enjoy As I do every Xmas I have printed off & funded bitcoin paler wallets for my loved ones. As far as I am aware they HODL every year & are yet to sell going back many years.Xmas is a great time of year, a special time to spend with people you love. Please have the best one possible.Happy Xmas to you too. I must confess your opening line cracked me up  . can’t stop laughing. As much I want to have fun and unwind this festive period I wouldn’t trade my bitcoins for a few days of pleasure. Festive periods come and go, it will be foolish of me to spend so much money trying to look good for Xmas or any such celebration. I have been inspired by recent activities on the forum, and I think dedicating my time to teach at least one person bitcoin would be a great way to sign off the year.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "aoluain",
      "created_time": "December 19, 2022, 09:43:19 PM",
      "body": "Christmas is becoming more and more a commercial and capitalist season and a time of excess and with it brings financial pressures on a lot of people to spend and buy unnecessary items.While it's traditionally a season on good will and generosity we should be mindful ofover spending on unnecessary items and squandering precious Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AmoreJaz",
      "created_time": "December 19, 2022, 09:45:54 PMLast edit: December 19, 2022, 09:58:03 PM by AmoreJaz",
      "body": "Quote from: CryptoPanda on December 19, 2022, 09:38:35 PMQuote from: LFC_Bitcoin on December 19, 2022, 07:38:15 PMI’d rather eat yellow snow than sell bitcoin to pay for Christmas presents. Not long until Christmas now so Happy Xmas to you OP & all on the forum. I haven’t been preparing well to be honest, I have been struck down with a bad case of man flu, I’m on day four now. I’ll be better by Christmas though, I have a beast of a turkey to enjoy As I do every Xmas I have printed off & funded bitcoin paler wallets for my loved ones. As far as I am aware they HODL every year & are yet to sell going back many years.Xmas is a great time of year, a special time to spend with people you love. Please have the best one possible.Happy Xmas to you too. I must confess your opening line cracked me up  . can’t stop laughing. As much I want to have fun and unwind this festive period I wouldn’t trade my bitcoins for a few days of pleasure. Festive periods come and go, it will be foolish of me to spend so much money trying to look good for Xmas or any such celebration. I have been inspired by recent activities on the forum, and I think dedicating my time to teach at least one person bitcoin would be a great way to sign off the year. when pandemic hit this humanity, i guess a lot of us figured out what things are important to us. so i believe a lot of people are not into spending habits anymore but taking care of their top priorities in life. or should i say, diverting their extra funds to something important that can help them survive in any type of crisis. but of course, some people still celebrate. you can observe such festive mood when you enter the malls and shops. but for most of us, this holiday season comes and goes, much better take care of necessary things that you think can help you when everyone is shutting their doors from you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "serjent05",
      "created_time": "December 19, 2022, 11:12:46 PM",
      "body": "Nothing to prepare for Christmas, for me it is just a waste of money preparing for such things.  I just do my usual stuff, wake up, thank God for a great new day then go back to what I normally do, browsing the forum, checking the market for possible discounted cryptocurrency in sale, if there is a visitor then will entertain them but I wish there is none though so that I can go back to my normal activities.Anyway, to those who celebrate Christmas, Have a merry Christmas to all of you.  (just for your information:  some Christians are offended when someone greets people with words written in Xmas than Christmas because for them they think, Xmas is factoring out Christ who is the true center of the celebration.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nullama",
      "created_time": "December 20, 2022, 03:09:11 AM",
      "body": "Well you can't spell Christmas without sats Sats can travel all around the world in an instant, just like Santa.Sats bring joy to everyone in the world, just like Santa.Sats are always going to be there for you, just like Santa.Merry Xmas Bitcoiners!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "UserU",
      "created_time": "December 20, 2022, 03:26:14 AM",
      "body": "Quote from: serjent05 on December 19, 2022, 11:12:46 PMAnyway, to those who celebrate Christmas, Have a merry Christmas to all of you.  (just for your information:  some Christians are offended when someone greets people with words written in Xmas than Christmas because for them they think, Xmas is factoring out Christ who is the true center of the celebration.That's actually a thing? Those snowflakes.Actually it's an abbreviation of Christmas.QuoteIn the early days of the Christian church, Christians used the letter X as a secret symbol to indicate their membership in the church to others. If you know the Greek meaning of X, Xmas and Christmas essentially mean the same thing: Christ + mas = ChristmasSource: https://www.grammarly.com/blog/why-do-we-shorten-christmas-as-xmas/#:~:text=In%20the%20early%20days%20of,%3A%20Christ%20%2B%20mas%20%3D%20Christmas.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitzizzix",
      "created_time": "December 20, 2022, 03:40:31 AM",
      "body": "If you have other income, it's better not to use your bitcoins for Christmas celebrations, but that's up to you and your rights, and there's nothing wrong with just using a little as needed or just as an extra to celebrate.the market is still not friendly to use for things that are not too important and it is still good for us to make purchases, and also don't rely too much on bitcoin or other crypto to celebrate something even though it is important, apart from investing, we must also have savings for urgent needs including celebrating something without using up your investment that will be more profitable in the long run.and it's all up to you and one more time. It's better not to use it and even if you have to, just do it as needed and as needed to celebrate Christmas.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bittraffic",
      "created_time": "December 20, 2022, 04:09:13 AM",
      "body": "I understand that I could be wasting my coins which I will profit more if I hold.it's the feeling and the initiative you give gifts to your kids that matter. When you're a father, you wouldn't really mind spending the coins to make them feel they are loved well by their father. The other day I bought my daughter an earring made of silver, sort of a music note design, and a new ukulele. I would hope she'll remember me this way forever and that I give importance to what she likes doing which will last forever. What do you recommend buying for our kids that will not deteriorate in years?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "_BlackStar",
      "created_time": "December 20, 2022, 06:22:04 AM",
      "body": "Quote from: Fivestar4everMVP on December 19, 2022, 07:21:57 PMWhy then lose your Bitcoin for items that perishes in such a short time? When someone starts adopting bitcoins as a means of payment, then what's wrong with them spending their bitcoin to pay for something? I don't know what your idea really is, and I think bitcoin is not only about investment but bitcoin is also used as a means of payment. Don't you think that's normal?But whatever it is, you have the right to be a holder for your bitcoin and never spend them in the long term. We are here hoping that bitcoin is adopted more, so it should become a means of payment so that it is safe to spend their bitcoin regardless of their current price. So it's just about mindset and about what bitcoin means to you in the financial system.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "December 20, 2022, 08:38:00 AM",
      "body": "We don't celebrate Christmas and there is still 3 months (92 days to be exact) left to New Year However, we do celebrate Chelle Night (aka Yalda) which is tomorrow night and is much older and is what some of the Christmas traditions were borrowed from like the lights you guys put on the Christmas tree. We've already prepared for it by purchasing a ton of fruits, nuts and sweets but I didn't have to sell bitcoin to buy any of it though! The shops don't accept bitcoin payments either, which is unfortunate since I would have loved to pay with bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "December 20, 2022, 10:21:45 AM",
      "body": "It's strange to me if someone has some kind of significant amount in BTC, and they won't allow themselves anything for Christmas and New Year just because the price of Bitcoin is so low compared to the last ATH. Christmas is once a year, life is too short to hold back all your life and wait for a new opportunity that may never come.I'm not saying we should act like drunken millionaires and spend like there's no tomorrow, but don't hold back on some basic things because \"it's not the right time to sell Bitcoin\".",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "buwaytress",
      "created_time": "December 20, 2022, 10:43:34 AM",
      "body": "Don't use your Bitcoin to buy presents? So don't use Bitcoin for an activity it was meant for?It's Christmas, you scrooge! I gave away Bitcoin to 2 couples already (one a festive gift, one celebrating a newborn) and they think it's really cool, even though it's just a small amount. And no, not bragging, just remembering how I often benefited from Bitcoin generosity in the past.If price does go up and these guys still hold, they're happy, and I'm happy. It's bloody Christmas! haha",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BALIK",
      "created_time": "December 20, 2022, 10:45:25 AM",
      "body": "A pretty good piece of advice, I agree that we should not waste bitcoins on unnecessary things. But in my opinion, there is nothing wrong if we sell our bitcoin to serve life, especially big holidays like Christmas or new year. We invest in bitcoin for a more stable economy, and a better life, so spend bitcoin wisely. We have worked hard for a long year and the end of the year is the time for us to relax and enjoy life, don't make it difficult for yourself or be too strict with life. Bitcoin is worth nothing if it doesn't help us.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Die_empty",
      "created_time": "December 20, 2022, 03:39:43 PM",
      "body": "Quote from: Fivestar4everMVP on December 19, 2022, 07:21:57 PMWe have just a few days to Christmas, so I guess now, it's Okey if we start wishing everyone a happy Christmas in advance.This is a season when we all need money for various expenses like buying children Christmas apparels, shoes and anything that will make them look good. Buying stuffs for ourselves to probably show off to neighbors, family and friends how wealthy we are and all that. Spending lavishly on food and drinks that might end up perishing the next day if everything is not consumes in 24 hours or less.. Its not bad to celebrate Christmas with friends and family, but it would be unacceptable to go the extra mile just to satisfy these wants. It is not also wrong to sell some of your investment if it is necessary or important to do that for the sake of this season. But it would not also be nice if your reason for doing that is just to showoff or compete with other people. The best advice still remains that you buy what you can afford and ensure that you don't borrow or take a loan because you want to celebrate like others. In my location, there is always high rate of crime this period because people want to spend like others. For me I am not spending on clothing or other accessories, I have to mange the ones I have now because I cannot afford such expenses. Maybe next year would be better.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}