{
  "id": "topic_5431489",
  "title": "Mate2237",
  "author": "Mate2237",
  "created_time": "December 25, 2022, 09:15:08 PMLast edit: December 25, 2022, 09:36:01 PM by Mate2237",
  "content": "Nigerian General Election Saturday, 25 February 2023FULL TIMETABLETinubu APC presidential candidate said, he will continue from where Buhari stoppedAtiku PDP presidential candidate said, he will open all the boardersPeter Obi LP presidential candidate said, he will create new NigeriaWhat do you have to say?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5431489",
  "comments": [
    {
      "author": "sokani",
      "created_time": "December 27, 2022, 11:18:54 AM",
      "body": "One year jail term, N500,000 fine awaits vote buyers – INECE get common yarn wey people dey talk say put your mouth wey your money dey, but me I go rephrase am to put your mouth wey your PVC dey. Some of us don get our PVCs ready for the forth coming election while some are yet to get theirs and also many stake holders don come out to say dem dey support or don endorse a particular presidential candidate, some say na Obi, some say na Tinubu while some say na Atiku. As all these dey go on, The Independent National Electoral Commission INEC, don come out come talk say any person wey dem find guilty of vote buying during the 2023 election got get one year imprisonment or go pay fine of N500,000. Na d Jigawa state INEC commissioner Professor Muhammad Lawal Bashar na im talk this one when news people been interview am. Also, him don advice electorates make dem go collect their PVC because the deadline for the distribution go end 22 January 2023.https://dailypost.ng/2022/12/26/2023-one-year-jail-term-n500000-fine-awaits-vote-buyers-inec/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mate2237",
      "created_time": "December 27, 2022, 01:53:34 PM",
      "body": "Quote from: sokani on December 27, 2022, 11:18:54 AMOne year jail term, N500,000 fine awaits vote buyers – INECE get common yarn wey people dey talk say put your mouth wey your money dey, but me I go rephrase am to put your mouth wey your PVC dey. Some of us don get our PVCs ready for the forth coming election while some are yet to get theirs and also many stake holders don come out to say dem dey support or don endorse a particular presidential candidate, some say na Obi, some say na Tinubu while some say na Atiku. As all these dey go on, The Independent National Electoral Commission INEC, don come out come talk say any person wey dem find guilty of vote buying during the 2023 election got get one year imprisonment or go pay fine of N500,000. Na d Jigawa state INEC commissioner Professor Muhammad Lawal Bashar na im talk this one when news people been interview am. Also, him don advice electorates make dem go collect their PVC because the deadline for the distribution go end 22 January 2023.https://dailypost.ng/2022/12/26/2023-one-year-jail-term-n500000-fine-awaits-vote-buyers-inec/Di way INEC dey tok gud but me I no believe INEC, INEC na won of di problem we dey get 4 dis Democratic dispensation. If voting e no dey again sef, INEC go still rig dis forthcoming election for won political party. All those things wey Dem dey tok na just 4 audio, in practice nothing go come out. I know INEC, Dem bi election riggers.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NdaMk",
      "created_time": "December 27, 2022, 03:25:44 PM",
      "body": "Quote from: sokani on December 27, 2022, 11:18:54 AMOne year jail term, N500,000 fine awaits vote buyers – INECE get common yarn wey people dey talk say put your mouth wey your money dey, but me I go rephrase am to put your mouth wey your PVC dey. Some of us don get our PVCs ready for the forth coming election while some are yet to get theirs and also many stake holders don come out to say dem dey support or don endorse a particular presidential candidate, some say na Obi, some say na Tinubu while some say na Atiku. As all these dey go on, The Independent National Electoral Commission INEC, don come out come talk say any person wey dem find guilty of vote buying during the 2023 election got get one year imprisonment or go pay fine of N500,000. Na d Jigawa state INEC commissioner Professor Muhammad Lawal Bashar na im talk this one when news people been interview am. Also, him don advice electorates make dem go collect their PVC because the deadline for the distribution go end 22 January 2023.https://dailypost.ng/2022/12/26/2023-one-year-jail-term-n500000-fine-awaits-vote-buyers-inec/Them make better decisions to deal with those that buy votes during elections, but I feel the punishment for it is still lenient. We need a more vigorous punishment that will scare away this vote buyers from indulging in vote buying. N500,000 is a little amount for this politicians to pay off when they’re caught. But nevertheless, it is good that a punishment is prescribed for violators of free and fair elections in the country.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sokani",
      "created_time": "December 27, 2022, 04:42:05 PM",
      "body": "Quote from: NdaMk on December 27, 2022, 03:25:44 PMThem make better decisions to deal with those that buy votes during elections, but I feel the punishment for it is still lenient. We need a more vigorous punishment that will scare away this vote buyers from indulging in vote buying. N500,000 is a little amount for this politicians to pay off when they’re caught. But nevertheless, it is good that a punishment is prescribed for violators of free and fair elections in the country.I feel the same way. 500k is a little sum of money for these politicians to throw away but like you said it is still good that some sorts of punishment is in place. Quote from: Mate2237 on December 27, 2022, 01:53:34 PMDi way INEC dey tok gud but me I no believe INEC, INEC na won of di problem we dey get 4 dis Democratic dispensation. If voting e no dey again sef, INEC go still rig dis forthcoming election for won political party. All those things wey Dem dey tok na just 4 audio, in practice nothing go come out. I know INEC, Dem bi election riggers.  We no say na naija we dey and anything is possible but that want no mean say make we no get small faith for the system. No doubt, INEC fit influence the election but I just get this feeling say this coming election go be one of the best for our country as naija people go come out and decide wisely. That wan no mean say some persons no go try to hijack am in one way or the other but the people choice go prevail las las.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Agbe",
      "created_time": "December 29, 2022, 08:15:49 AM",
      "body": "Quote from: NdaMk on December 27, 2022, 03:25:44 PMQuote from: sokani on December 27, 2022, 11:18:54 AMOne year jail term, N500,000 fine awaits vote buyers – INECE get common yarn wey people dey talk say put your mouth wey your money dey, but me I go rephrase am to put your mouth wey your PVC dey. Some of us don get our PVCs ready for the forth coming election while some are yet to get theirs and also many stake holders don come out to say dem dey support or don endorse a particular presidential candidate, some say na Obi, some say na Tinubu while some say na Atiku. As all these dey go on, The Independent National Electoral Commission INEC, don come out come talk say any person wey dem find guilty of vote buying during the 2023 election got get one year imprisonment or go pay fine of N500,000. Na d Jigawa state INEC commissioner Professor Muhammad Lawal Bashar na im talk this one when news people been interview am. Also, him don advice electorates make dem go collect their PVC because the deadline for the distribution go end 22 January 2023.https://dailypost.ng/2022/12/26/2023-one-year-jail-term-n500000-fine-awaits-vote-buyers-inec/Them make better decisions to deal with those that buy votes during elections, but I feel the punishment for it is still lenient. We need a more vigorous punishment that will scare away this vote buyers from indulging in vote buying. N500,000 is a little amount for this politicians to pay off when they’re caught. But nevertheless, it is good that a punishment is prescribed for violators of free and fair elections in the country.Many pple wey get PVC go still sell their vote, oboy di hunger wey di naija politicians e don give di pple 4 di kwantri no bi here... Someone even drop me a link 4rom Atikowa sae, Dem dey give #10,000 to all 9ja pple, nd wen I checked bdi site, na scam. Even though na scam, na di new method wey Dem go use buy pple vote. Vote buying e no go end until INEC e don ready 2 do di necessary.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Frankolala",
      "created_time": "December 29, 2022, 10:53:59 AM",
      "body": "How INEC won know people wey sell their votes,abi camera dey everywhere to capture people for their secret places. Make INEC go sit down all of them dey work together, na only for Nigeria thief dey go beat thief like am. Wetin dey tire me for this country be say everybody know the truth and right thing to do but them no fit hold their longer throat for money wet them dey see,even though, e go cost them their head. Instead,Nigeria man go prefer chop the money and make e die.I dey discuss with pple and I see say everybody know say Obi na e go change the country to better,but them go say e no fit dey possible for Obi to win because them no won sacrifice for the right thing to happen, but e go shock them If Obi come win this election. Our election dey God hand and the youths hand.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jumongy",
      "created_time": "December 29, 2022, 12:49:37 PM",
      "body": "I pray we all make the right choice next year because we can't continue like this again.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Maestro75",
      "created_time": "December 29, 2022, 06:13:45 PM",
      "body": "Quote from: Mate2237 on December 25, 2022, 09:15:08 PMWhat do you have to say?Wetin me I get to say be say number 1 person weh be Tinubu deh very sick and he will disgrace us like that South Sudan presido weh wee wee on himself for public. That disgrace no get description. Number 2 weh be Atiku no get any agenda apart from to enrich himself and friends just like number one person too. Shebi Obasanjo don give us scorecard of Atiku but na Nigerians no want to reason am. PO na him get better record pass all of them and his records are there for all to verify. He is the only former governor with clean record. Make I just stop here.Quote from: sokani on December 27, 2022, 11:18:54 AMOne year jail term, N500,000 fine awaits vote buyers – INECMake INEC just go sit down for somewhere jo and leave us alone. Na so them go deh bark like mad dog weh get rabies but when time reach for action them go keep quiet. No be weh deh hear all this their action without action speeches.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zaguru12",
      "created_time": "December 29, 2022, 06:30:23 PM",
      "body": "Quote from: Maestro75 on December 29, 2022, 06:13:45 PMWetin me I get to say be say number 1 person weh be Tinubu deh very sick and he will disgrace us like that South Sudan presido weh wee wee on himself for public. That disgrace no get description. Number 2 weh be Atiku no get any agenda apart from to enrich himself and friends just like number one person too. Shebi Obasanjo don give us scorecard of Atiku but na Nigerians no want to reason am. PO na him get better record pass all of them and his records are there for all to verify. He is the only former governor with clean record. Make I just stop here.You talk say na only PO be former governor wey get better clean but I disagree, because personal I feel say Rabiu Kwankoso get track record pass all of them if you look Kano state before Kwankoso become governor they bin dey behind in both education and infrastructure but compare them to now you see say na the best option for them four but sadly him party no get structure to win this electionQuote from: Maestro75 on December 29, 2022, 06:13:45 PMMake INEC just go sit down for somewhere jo and leave us alone. Na so them go deh bark like mad dog weh get rabies but when time reach for action them go keep quiet. No be weh deh hear all this their action without action speeches.Make give credit to this Current INEC chairman because the last elections wey him conduct bin go free and fair example na Osun election. I like him idea of say him go use electronic means count this election votes I just hope say he go through but as he be now ehnn them dey try",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sokani",
      "created_time": "December 29, 2022, 08:16:34 PM",
      "body": "Quote from: Frankolala on December 29, 2022, 10:53:59 AMHow INEC won know people wey sell their votes,abi camera dey everywhere to capture people for their secret places. Make INEC go sit down all of them dey work together, na only for Nigeria thief dey go beat thief like am. Wetin dey tire me for this country be say everybody know the truth and right thing to do but them no fit hold their longer throat for money wet them dey see,even though, e go cost them their head.Most of these parties send their agents to polling units to convince electorates to sell their votes for money. The voter that is trying to sell his/her vote and the one trying to buy the vote, if caught would be persecuted by law. Now you asked how is INEC going to know. These agents do not buy votes in the open. They do it discreetly, they hang around and carryout their act... Many atimes na law enforcement agent like police dey catch dem and if them no reach agreement with dem na there wey dem dey hand them over for persecution.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaNNy001",
      "created_time": "December 29, 2022, 08:50:34 PM",
      "body": "Quote from: Jumongy on December 29, 2022, 12:49:37 PMI pray we all make the right choice next year because we can't continue like this again.Nigerians making the right choice no be even the problem because even if we make the right choice and vote who we want to vote how are we sure that these politicians won't just rig the whole election like they have always done. A similar case happened in my state whereas for the first time everyone came out and voted the candidate of their choice with their whole heart some voters even refused to take the money giving to them by other party and voted who was in their mind. Their candidate did  win election but just a day to his swearing in as the new governor the whole situation changed and the masterminds at the top who plot everything turn the whole situation around and the news left so many people sad and promised not to vote again as their vote dont even count.The whole system should just change if we really want to get it right.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "HajiBagi",
      "created_time": "December 30, 2022, 05:54:47 PM",
      "body": "My brother all this people just dey use their mouth talk waiting dey go use confuse nigeria people because na so them dey do after people suffer their self vote finish dem go close their eyes like say people no exist, waiting I get to talk be say make we clear our eyes before voting and for me I reason ATiku matter because na boarder be our main thing for Nigeria now, at least if he open boarder now things go fit come down and even petroleum issues wey they burder us for nigeria fit get solve and my prayer be say make God bless us with better person wey go make our country proud.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sexylizzy2813",
      "created_time": "January 01, 2023, 06:46:45 AM",
      "body": "Where we dy go for this contri nah? No mata how Dem dress dia speech rub am cream reach politicians no go fit change. This politicians wey dy never fit explain to me y my neighbor carry em family go park to travel still carry dem come back house say Dem no do again becos transportation don sky rocket go up plus our own fuel wey go high like high-tension, how we go take get mind dy go vote dis new year nah? Eh? No be to carry voters card dy go stand for line say we go vote in better person oh cos better person no dy as e be now.Make baba chineke help this contri cos we just dy without leaders like this, things just dy go against we the poor piple, every little little mata wey we dy face them dy see am as nothing but nah the type of mata wey we government need to sit down calm down dress cloth Wella so that every place for this contri go stew con better pass as we dy see am.My senior comrades I wish una Happy New Year...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dzwaafu11",
      "created_time": "January 01, 2023, 09:28:23 AM",
      "body": "Me I no get much to say but all these people wey Context for these post they just they use sweet mouth convince people and wen deh got elected now they go forget say na we vote them...Even INEC na them be the main problem because the way they're selling even the form e too cost so if person con geh vote why e no go turn the position to business he/she go talk they must invest the money weh buy form e dey among the problem wey we they see nowadays",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}