{
  "id": "topic_5452730",
  "title": "shasan",
  "author": "shasan",
  "created_time": "May 14, 2023, 07:24:26 PM",
  "content": "Real Site: https://robishop.com.bd/Fake Site: https://robishop.pw/On the fake site, I have seen they are offering a lot of discounts which I found via a Facebook sponsor add. To see such a discount make me curious to know then I could be able to check and came to know they are asking for payment directly to their personal account instead of the company's account. At the time of writing the post they have used bkash number 01885811869Their discount offer:Facebook Ads:All the comments on their Facebook page are their self-accounts. If any legit user posts a comment then that will be deleted within a short time.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5452730",
  "comments": [
    {
      "author": "shasan",
      "created_time": "May 14, 2023, 07:24:51 PMLast edit: May 14, 2023, 07:44:06 PM by shasan",
      "body": "Reserve:Edit:Another scam site: https://robishop.org/The same type of offerAll the information are same except the bKash number.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "God Of Thunder",
      "created_time": "May 15, 2023, 04:00:12 AM",
      "body": "Nice Catch, Brother!It is unfortunate! But if you are a little careful, you can avoid this scam. If you notice, you will see that they have also made many spelling mistakes on the payment page, which no such reputable company would do. As written below, it has been written, Transection has been written for Transaction, Confrom has been written for Confirm, Redix has been written for Redex. Moreover, such reputed companies never accept payment on personal numbers.As a conscious user, I informed Robi and Bkash about this. I got a pre-written reply from Robi. I don't think they will take any steps in this matter. But a representative of BKash spoke to me. I don't know what will happen next. But they should be stopped. The one who gets scammed understands how it feels. I don't know how much money I lost in the new condition.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "shasan",
      "created_time": "May 27, 2023, 09:39:24 AM",
      "body": "Quote from: Learn Bitcoin on May 15, 2023, 04:00:12 AMAs a conscious user, I informed Robi and Bkash about this. I got a pre-written reply from Robi. I don't think they will take any steps in this matter. But a representative of BKash spoke to me. I don't know what will happen next. But they should be stopped. The one who gets scammed understands how it feels. I don't know how much money I lost in the new condition.I have also contacted Robi and they sent me a pre-written message. I have not contacted with bKash but I tried to contact a reporter about the matter the reporter has said that nowadays these types of incident is common. So, we have to skip these and the steps necessary. I think we should/government should make aware of these types of incidents.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "348Judah",
      "created_time": "May 27, 2023, 10:54:51 AM",
      "body": "This kind of scam is very comm and most times it happens that when we never oay attention to the website address we are typing from the one the google suggested or we found on the internet, it may land us onthe wrong address and those scammers have developed a well informative network on their own purnicode site to have a lookalike from the original one we are searching for, we need to be very careful with website addresses that have additional symbols, punctuation marks, or letters to their web address either wirtten in English or other languages. For more information on this kind of scam related activities, read from the link below and learn something more attractive from the threads discussion https://bitcointalk.org/index.php?topic=5184169.0",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}