{
  "id": "topic_5432006",
  "title": "Marykeller",
  "author": "Marykeller",
  "created_time": "December 27, 2022, 08:55:12 AM",
  "content": "Just 2weeks to the main presidential election, em get some increasing likelihood sae we no fit get clear winner for presidential election. Em get about four strong candidates wey we all know, wey be strong contestants for presidential election. 1. Atiku Abubakar(PDP)2. Bola Tinubu(APC)3. Peter Obi(LP)4. Rabiu Kwankwaso(NNPP)Una believe sae this runoff presidential bout given by all states for this upcoming presidential election go fit work out as the write am? Wetin be una take for the matter as we see the stronghold of some of the parties for each geopolitical zones and statesLink to the ogenke information: https://www.arise.tv/thisday-why-run-off-is-increasingly-likely-in-nigerias-2023-presidential-election/",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5432006",
  "comments": [
    {
      "author": "Hyphen(-)",
      "created_time": "December 28, 2022, 01:24:58 PM",
      "body": "Na some people sit down run dis analysis which me and u know say e no de possible. The rating was done based on how people wey do d analysis think say d result go be, na prediction sha but it is not possible.Many people de underrate Peter Obi, dem know no say him go shock the entire nation; dis election no too de predictable because d way youths wan participate in this election I de sure say we go see small change from d other elections wey been de happen before.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "RockBell",
      "created_time": "December 28, 2022, 01:39:02 PM",
      "body": "Predicting this election of a things with this kind analysis I no believe am oh, if you look am now north people have their own candidate and if you want make I talk true Obi is good man but the thing no go easy for the guy to win and my prayer every day na make tinubu no win because is looking as if the nigga get memory lost if you look him speech na contradictions full am Make God choose better person for us.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pokapoka124",
      "created_time": "December 28, 2022, 07:29:15 PM",
      "body": "Na for naija election way them dey snatch ballot box nai them dey do mathematics for? Make we nor deceive ourself Oyibo say self deceit na the greatest sin. The only analysis way dey work na who ready go cause kassala pass, To me na Tinibu get tools pass…the man dey very determined to rule…e don open mouth say na e turn to rule so na turn by turn him and e cartel dey run am since. PDP still Dey shake, Atiku go sly Governor Wike come carry delta state Governor Okowa as VP. I trust wike to fall Atiku hand for Rivers State and other states way him get influence. Peter Obi don come see Wike couple of times their two Dey rappor well. @hyphen say them dey underrate Peter Obi, I nor know for that one but I know say e nor go win this election na online twitter voters Peter Obi get. Enter street you go see say people still Dey vote party nor be individual. Make we accept say if Peter Obi nor win this year make e try again next one.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dzwaafu11",
      "created_time": "December 30, 2022, 04:42:42 PM",
      "body": "All this things na prediction na some people sit down one place create these analysis based one what they thing say the result go be but sha we never know how the thing go be we just they pray for better person that's wetin we they plan for.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}