{
  "id": "topic_5460884",
  "title": "patrickus",
  "author": "patrickus",
  "created_time": "July 24, 2023, 12:13:42 PM",
  "content": "https://fr.investing.com/news/technology-news/le-fondateur-dopenai-lance-sa-cryptomonnaie-worldcoin-2193021QuoteLe directeur général et fondateur de la start-up d'intelligence artificielle (IA) OpenAI, Sam Altman, a lancé lundi Worldcoin, une cryptomonnaie sécurisée avec un système d'identification à partir de l'iris humain.Ce cryptoactif repose sur un système baptisé World ID (identité, NdlR), un identifiant numérique obtenu après que l'utilisateur a scanné son iris avec un appareil appelé \"orbe\", pour prouver qu'il n'est pas un robot. Je ne connaissais pas ce projet qui veut profiter du succés de ChatGPT. Bof...Et pourquoi les robots ne pourraient ils pas en acquérir eux aussi ?Et puis Sam Altman, ça sonne un peu comme Sam Bankman-fried, non ?!  (je me trouve des raisons d'être passé à côté)",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5460884",
  "comments": [
    {
      "author": "Halab",
      "created_time": "July 25, 2023, 07:25:36 AM",
      "body": "J'ai vu pas mal de choses négatives passer à propos de cet alt. Notamment :Quote from: https://twitter.com/zachxbt/status/1452017760788258819Let me sum up how bad @worldcoin  is-Distributed “fairly” yet the team gets 20% of the supply and every major VC is invested-User acquisition model imitates that of a MLM (Herbalife)-Privacy policy permits them to give your data to 3rd parties-Name resembles a 2017 ICO scamBon le dernier point est assez discutable, mais le reste...Et le nom est mal choisi, il aurait plutôt du prendre VcCoin Quote from: patrickus on July 24, 2023, 12:13:42 PMEt puis Sam Altman, ça sonne un peu comme Sam Bankman-fried, non ?!  Il fait partie des VCs qui ont mis des billes dedans",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Melja",
      "created_time": "July 25, 2023, 09:21:44 AM",
      "body": "Le nom de ce scamcoin a été intentionnellement choisi afin de toucher un publique du tiers monde.Ces gens la n'ont aucunes morales lorsqu'il s'agit d'argent et d'arnaque.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Joan of Arc official",
      "created_time": "July 29, 2023, 09:46:00 PM",
      "body": "Ca sent le projet qui va finir rapidement en une société de données et qui, comme vous pouvez deviner la suite, exploitera leurs données personnellesDans un marché assez fleurissantLe marché mondial de la reconnaissance de l'iris était évalué à 2 911,7 millions USD en 2021 et devrait atteindre 7 903,9 millions USD d'ici 2027, enregistrant un TCAC d'environ 18,22 % au cours de la période 2022-2027QuoteWorldcoin is taking full advantage of the fact that the vast majority of humans are complete fucking idiots who lack any ability to critically think about why they shouldn’t be exchanging their retina scan for a few dollars worth of absolute shitcoin.https://twitter.com/ChrisBlec/status/1683470727909916675?s=20Pour le côté éthique, ben RIP...La CNIL de France, Allemagne et Angleterre seraient déjà sur le coup...on vous fait confiance sur le résultat Quote from: Melja on July 25, 2023, 09:21:44 AMLe nom de ce scamcoin a été intentionnellement choisi afin de toucher un publique du tiers monde.pas que.https://s3.mordorintelligence.com/iris-recognition-market/iris-recognition-market_1643877914666_Screenshot_2022-02-03_141504.webp?embed=true",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}