{
  "id": "topic_5404360",
  "title": "Franctoshi",
  "author": "Franctoshi",
  "created_time": "June 28, 2022, 11:44:32 AMLast edit: June 28, 2022, 03:03:56 PM by Franctoshi",
  "content": "‌They said when you identify a problem then the solution is possible. Addition is a Big problem to Most gamblers out there and one very big challenge with gamblers is that they don't even get to notice they're already addicted to gambling even when they're told , I was a victim even to the extent I used most of my University school fees to gamble back days until when I realized myself and put a permanent stop to my addiction and now Play moderately. I have a lot of friends too currently involved into same addiction whom I have made necessary efforts to getting them out only few were able to buy the idea. So I'm talking from the point of experience. However, After lots of advice from my friends who saw where I was headed to coupled with the last bet that almost got me drop out of school then, had me took that bold decision.                           HOW I DID GET TO SOLVING THAT PROBLEM1•I penalized myself by having myself deassociated from all kind of gambling friends and taking up a new friends who was into Bitcoin and have that time transferred to things related to crypto currency activities and it was actually part of what lead me into my discovery of Bitcoin and today here I am.2• I stopped visiting betting shops in my locality and online betting sites too.3• I stopped myself from watching football and anything related to footballing activities for months and I used those time to engage in  other valuable things like going to the gym and reading more books during the time when there are important football matches going on. 4• Relocating from my house to another area where my friends could not find me easily because there was this pressure from them why I      suddenly started to ingnoring them so I had to relocate.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5404360",
  "comments": [
    {
      "author": "crwth",
      "created_time": "June 28, 2022, 11:56:52 AM",
      "body": "Identifying that you have a problem in the first place is a great initial step. I think you should discuss in more detail how you have become now and not just saying that you stopped and that’s it. Addiction is very hard to stop and that’s a challenge for everyone. It’s not an easy task to do so maybe you can share a more specific detail to what are the things that you have experienced that made it hard. Maybe then people can realize WHY it’s important to stop.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitcoinPanther",
      "created_time": "June 28, 2022, 12:24:49 PM",
      "body": "Good move there.  I believe you have the iron will to fix your gambling addiction.  It is good that you identified the problem sooner and are able to admit and undergo self-treatment.  Quote from: Franctoshi on June 28, 2022, 11:44:32 AM                          HOW I DID GET TO SOLVING THAT PROBLEM4• Relocating from my house to another area where my friends could not find me easily because there was this pressure from them why I      suddenly started to ingnoring them so I had to relocate. Lol, it looks like you and your friends are very close.  Sadly they influenced you in the wrong way.   Friends like that should be avoided and it's a great thing that you decided to move out because I believe there will be an issue if you just ignore them and did not move away.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ultrloa",
      "created_time": "June 28, 2022, 12:30:00 PM",
      "body": "Good action taken because from that you can really get out slowly on gambling and also maybe if you have excess money on hand or you are using your debit or credit card better cut it because sometimes if you have money you will get urge to gamble especially when you hear some news about it especially if you accidentally see a big event on mainstream media. But since you already do a big move to take care on your addiction for sure you became a freeman in next couple of months.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Saisher",
      "created_time": "June 28, 2022, 01:30:52 PM",
      "body": "I'm glad that you did it, you are not yet fallen into a compulsive gambler, and don't need a physician to cure yourself of addiction, every one of us has ways to solve your addiction, and you're lucky to find yourself your own ways to control your addiction keep doing that and you will not fall into a compulsive gambler, remember an ounce of prevention is better than a pound of cure.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mauser",
      "created_time": "June 28, 2022, 01:48:13 PM",
      "body": "Quote from: Franctoshi on June 28, 2022, 11:44:32 AM4• Relocating from my house to another area where my friends could not find me easily because there was this pressure from them why I      suddenly started to ingnoring them so I had to relocate. First of all congratulations on beating your gambling addiction. We have several addiction problems in our family, I know that any form of addiction is hard to overcome. My cousin is struggling with drug addiction and lives for more than two years on a farm now because he cat be alone. My uncle is addicted to cigarettes and tried probably 15 times to stop already. It's very hard to overcome an addiction on your. Reading through the things that helped you to get better I especially feel the last part. You write that \"friends\" give you pressure to gamble more, that really hurts because I had similar experiences in the past. It might be hard to realise but they are not real friends. If friends try to convince you to do things that are bad for you, they are no real friends and we need to avoid them. I had people like that around me in high-school who wanted to go out drinking every night. It took me a long time to realise they are no friends who actually help me.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fiulpro",
      "created_time": "June 28, 2022, 01:51:34 PM",
      "body": "Not everyone can do that honestly, leaving their friends and relocating from the area is a big step and does need a lot of money and emotional support as well. Therefore I do think what you did was admirable and at the same time it is specific to your situation, therefore people have to understand that all situations are pretty much individual so what worked for you couldn't have worked for someone else since they might not have the required investment. Thus I do think that one can always : 1. Get medical Help 2. Contact the Gambling help section in their country, you can even talk online to the experts3. Make sure you do not use the website by collectively banning them from your phone/account.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dart18",
      "created_time": "June 28, 2022, 01:52:56 PM",
      "body": "It's just always been the mentality. You can still watch football if that's the sport that you really love but you only have to stop the urge of betting at every game. Your football stars might get sad if they knew one of their fans is not supporting them anymore or literally just watching their games. There's nothing wrong in that. I am glad at how much change you did just to avoid it but isn't it too much to ignore friends? You can still text them or whatever means to contact them but it doesn't mean you have to meet and gamble again. They are still your friends and they have the right to know what's happening to you so that they won't worry.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "$crypto$",
      "created_time": "June 28, 2022, 02:03:55 PM",
      "body": "I know every gambler will definitely have the same problem but it can be controlled how from my own desires, I have also experienced it but I have never left gambling but I know my own limits and emotional control so that it doesn't plunge me into making a loss that spends everything .I do this gradually and often discuss with friends or other relatives how to prevent but not give up gambling, it is certainly a long process.Now that I understand and never push myself just because I want to gamble, I interpret this as my pleasure or hobby that doesn't hurt me, meaning I use the money I have prepared.But after all there must be an intention in us that addiction is a dangerous thing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jackg",
      "created_time": "June 28, 2022, 02:04:20 PM",
      "body": "Quote from: Dart18 on June 28, 2022, 01:52:56 PMI am glad at how much change you did just to avoid it but isn't it too much to ignore friends? You can still text them or whatever means to contact them but it doesn't mean you have to meet and gamble again. They are still your friends and they have the right to know what's happening to you so that they won't worry. If most of what they did was gamble and pressure each other to then it might not be much of a loss for op. Also I'd think trying to get past the addiction would be more important than those friends at least for the first couple of months/years. If gambling was a big part of their group/life then op or the group might feel rejected if they go back too soon too.Quote from: fiulpro on June 28, 2022, 01:51:34 PM1. Get medical Help 2. Contact the Gambling help section in their country, you can even talk online to the experts3. Make sure you do not use the website by collectively banning them from your phone/account. The medical help could point in this direction but I think addictions are easiest to replace with an enjoyable hobby (as long as you pick the right one - especially if there's similar aspects to the previous addiction; such as the social aspect op mentioned).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jawhead999",
      "created_time": "June 28, 2022, 02:05:28 PM",
      "body": "This mean you're trying to say you're already free from gambling addiction because you're avoid any kind of gambling activities correct? Well if this is true, then why you're still discuss about gambling related as you're want to keep away from gambling. I wouldn't surprised if in the next few weeks or months, I will see your account carrying a signature about casino projects Quote from: Franctoshi on June 27, 2022, 10:30:47 PMI'm still wondering what is keeping the transfer to not have become a done deal by now.Leowandoski is a good product for Barca , with him in the front I think we might see a comeback Barca interms of scoring goals and winning games ,So Barcelona should deep hands into their pocket and make payment to meet up with every necessary requirements needed to land the player in Camp Nou.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Franctoshi",
      "created_time": "June 28, 2022, 02:27:06 PM",
      "body": "Quote from: crwth on June 28, 2022, 11:56:52 AMIdentifying that you have a problem in the first place is a great initial step. I think you should discuss in more detail how you have become now and not just saying that you stopped and that’s it. Addiction is very hard to stop and that’s a challenge for everyone. It’s not an easy task to do so maybe you can share a more specific detail to what are the things that you have experienced that made it hard. Maybe then people can realize WHY it’s important to stop. To answer your question those steps I listed above helped me come out of such addiction and have control over myself  I now bet moderately now in the sense that I do not only rely on betting as the only source of income I now engaged with lots of things that is yielding me income unlike when I put all my attention in gambling.Quote from: BitcoinPanther on June 28, 2022, 12:24:49 PMLol, it looks like you and your friends are very close.  Sadly they influenced you in the wrong way. I was living in same street with them and which happens that we normally meet at the gaming shop in that street to bet games.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "crwth",
      "created_time": "June 28, 2022, 02:37:52 PM",
      "body": "Quote from: Franctoshi on June 28, 2022, 02:27:06 PMQuote from: crwth on June 28, 2022, 11:56:52 AMIdentifying that you have a problem in the first place is a great initial step. I think you should discuss in more detail how you have become now and not just saying that you stopped and that’s it. Addiction is very hard to stop and that’s a challenge for everyone. It’s not an easy task to do so maybe you can share a more specific detail to what are the things that you have experienced that made it hard. Maybe then people can realize WHY it’s important to stop. To answer your question those steps I listed above helped me come out of such addiction and have control over myself  I now bet moderately now in the sense that I do not only rely on betting as the only source of income I now engaged with lots of things that is yielding me income unlike when I put all my attention in gambling. Did your why become solid as time goes by? I think saying that parts that you have \"penalized yourself\", \"stopped visiting sites\", \"no watching of entertainment\" and \"relocating\" is just some of the ways that you can really get rid of something like addiction. It's still going to be hard and you need to find a solid \"why\".",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptopreneurBrainboss",
      "created_time": "June 28, 2022, 02:48:49 PM",
      "body": "Good you identify your problem on time before it destroyed you but running away from you problem isn't actually solving it. Sure it'll disappear for the main time but studies shows that when former addicts are in bad times (depression etc) they tend to return back to their old ways. What assurance do you have of not returning back to gamble if you were in a financial situation. Glad you found Bitcoin but I hope you aren't coming with the mentality of gambling with it because you might be disappointed and get pushed back.It seems the search of finance assistance was the reason behind your gambling problem. You needed funds to push through school, now what are you doing that's giving your funds to avoid the temptations of gambling resurfacing. Investing in Bitcoin requires funds so substituting gambling with Bitcoin and avoiding your friends isn't enough as you can always encounter gamblers in different form. Even in the crypto space we have gamblers that embark in trading shitcoin etc.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Franctoshi",
      "created_time": "June 28, 2022, 02:53:46 PMLast edit: June 29, 2022, 07:32:51 AM by Franctoshi",
      "body": "Quote from: Jawhead999 on June 28, 2022, 02:05:28 PMThis mean you're trying to say you're already free from gambling addiction because you're avoid any kind of gambling activities correct? Well if this is true, then why you're still discuss about gambling related as you're want to keep away from gambling. I wouldn't surprised if in the next few weeks or months, I will see your account carrying a signature about casino projects Quote from: Franctoshi on June 27, 2022, 10:30:47 PMI'm still wondering what is keeping the transfer to not have become a done deal by now.Leowandoski is a good product for Barca , with him in the front I think we might see a comeback Barca interms of scoring goals and winning games ,So Barcelona should deep hands into their pocket and make payment to meet up with every necessary requirements needed to land the player in Camp Nou. Don't quote me wrong mate revisit the title of this thread which says \"how I controlled my \" Gambling addiction\" and not how I stopped gambling.I went ahead and listed how I put a permanent stop to my addiction and I didn't mean permanent stop to betting in order to clear readers and writing this thread does not mean it happened recently, this was my past experiences back days when I was in the University. There is a different between being a gambler and being a gamble addict, Hope you understand.Thanks",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bisdak40",
      "created_time": "June 28, 2022, 02:55:41 PM",
      "body": "Quote from: Franctoshi on June 28, 2022, 11:44:32 AM4• Relocating from my house to another area where my friends could not find me easily because there was this pressure from them why I      suddenly started to ingnoring them so I had to relocate. From the looks of it, seems that you stopped gambling because you realized that you were already broke. I mean it is very hard to stop gambling if you are addicted to it and you have money to gamble because you won't care what other people will say because you are winning but if it is the opposite then you have no other option but to quit.Hiding from your friends is not forever, one day you will see each other and before you knew it, you are at it again. Why, because you have the money. Have experienced that also but if you are firm on your decision to stop gambling, you need not relocate, it's your strong will that will put an end to it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "madnessteat",
      "created_time": "June 28, 2022, 03:03:41 PM",
      "body": "In my opinion, these recommendations can really help if you are faced with a gaming addiction. I always say that if you decide to beat a gambling addiction you need to change your place of residence (at least for a few months) and find yourself a new hobby that will bring you pleasure. Sports and studying cryptocurrencies are really interesting activities that will benefit you.I'm really happy for TS that he was able to overcome his gambling addiction!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitbollo",
      "created_time": "June 28, 2022, 03:04:56 PM",
      "body": "These are very interesting and useful suggestions even if from a certain point of view they can be really \"hard\" (not everyone can change houses or friendships in a short time)...I am curious to know more. Why did you decide to change your betting habits? Was there any event in particular?From 1 to 100 how much do you think your betting habits have changed taking these changes?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cling18",
      "created_time": "June 28, 2022, 03:10:25 PM",
      "body": "Quote from: bisdak40 on June 28, 2022, 02:55:41 PMQuote from: Franctoshi on June 28, 2022, 11:44:32 AM4• Relocating from my house to another area where my friends could not find me easily because there was this pressure from them why I      suddenly started to ingnoring them so I had to relocate. From the looks of it, seems that you stopped gambling because you realized that you were already broke. I mean it is very hard to stop gambling if you are addicted to it and you have money to gamble because you won't care what other people will say because you are winning but if it is the opposite then you have no other option but to quit.Hiding from your friends is not forever, one day you will see each other and before you knew it, you are at it again. Why, because you have the money. Have experienced that also but if you are firm on your decision to stop gambling, you need not relocate, it's your strong will that will put an end to it.Sometimes we have to disassociate ourselves from colleagues that influence and push us to gamble. It may not take forever but if it could keep us away from gambling, we should sacrifice our friendship for a while for our own good. There are really steps that we have to take and things to sacrifice if gambling has invaded our entire life. We might easily say that we should control ourselves but to a person who has been addicted to gambling, it's already a hard thing. They have to give up anything that keeps them from gambling.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Franctoshi",
      "created_time": "June 28, 2022, 03:22:14 PM",
      "body": "Quote from: crwth on June 28, 2022, 02:37:52 PMDid your why become solid as time goes by? I think saying that parts that you have \"penalized yourself\", \"stopped visiting sites\", \"no watching of entertainment\" and \"relocating\" is just some of the ways that you can really get rid of something like addiction. It's still going to be hard and you need to find a solid \"why\".It solved my major problem as at that time which was that \"addition\"  ,I brought up this article because it helped me in the past come back to normal betting guy and I do think it might equally help someone who finds theirselves in this kind of situation and may be looking for a way out, Therefore after I saw improvement in me, my social life activities was back and my life is moving and betting smoothly without such addiction.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}