{
  "id": "topic_5462974",
  "title": "mistarlupo",
  "author": "mistarlupo",
  "created_time": "August 11, 2023, 09:04:57 PM",
  "content": "Hi fellas,I have a significant amount of BTC held by Blockchain.com (wallet service) and blocked for no apparent reason.I would like to take legal action against them and therefore I am looking for recommendations on legal firms in the UK.Can anyone out there suggest anyone that specializes with crypto cases?Thanks in advance!",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5462974",
  "comments": [
    {
      "author": "joniboini",
      "created_time": "August 12, 2023, 10:53:00 AM",
      "body": "What do you mean by blocked? As far as I can remember, you can export your private key using their web wallet service[1]. Did you use their custodial service or their web wallet? You can try exporting your key and using other wallets to move your Bitcoin if it is the latter. CMIIW.You can try making a post on social media if you still want to hire some lawyers.[1] https://support.blockchain.com/hc/en-us/articles/9042429259420-Can-I-get-the-private-key-for-my-Blockchain-com-Account-",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fiatless",
      "created_time": "August 12, 2023, 09:57:34 PM",
      "body": "Quote from: mistarlupo on August 11, 2023, 09:04:57 PMHi fellas,I have a significant amount of BTC held by Blockchain.com (wallet service) and blocked for no apparent reason.I would like to take legal action against them and therefore I am looking for recommendations on legal firms in the UK.Can anyone out there suggest anyone that specializes with crypto cases?Thanks in advance! You need to give more insight into your problem. Just mentioning that your wallet was blocked is not really a clear description of your problems. Since you experience this issue have you contacted their support service to rectify the problem?  What was their response? What do the terms of service recommend about your issue? Do you have proof of your transactions and chats with Blockchain.com? A Google search will give you the contact of crypto lawyers in the UK. Maybe a member might recommend one to you. Good luck.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husires",
      "created_time": "August 13, 2023, 08:46:31 AM",
      "body": "If you using Blockchain.com, you are agree to its terms of use, which include that they do not have access to your private key, which means that you are fully responsible for the security of your account.If you have access to your wallet or can remember your wallet ID and part of the password, you can access your coins. The court won't help you with anything, or I don't even think there is a legal framework will help you. looking for seeds or how to remember the password.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "YOSHIE",
      "created_time": "August 13, 2023, 04:12:11 PM",
      "body": "Quote from: mistarlupo on August 11, 2023, 09:04:57 PMI have a significant amount of BTC held by Blockchain.com (wallet service) and blocked for no apparent reason.I would like to take legal action against them and therefore I am looking for recommendations on legal firms in the UK.As I see crypto wallet service Blockchain.com, registered with two authorities that exist in the UK.1. Financial Conduct Authority2. British National Crimes.For example:QuoteAt present, Blockchain Access UK Ltd is registered with the Financial Conduct Authority (in connection with the provision of Blockchain.com's custodial wallet and the operation of the Blockchain.com Exchange). This entity is also registered with the UK's National Crime Agency.For more information you can see here: An update to UK customers' Blockchain.com accounts.My understanding is, if you want to pursue legal action in the UK regarding the actions that are happening to you at this time against the Blockchain.com wallet, maybe you can ask or contact the two authorities above, for legal clarity that is there, maybe it's a better way to find a bright spot why Blockchain.com, blocked your account.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yhiaali3",
      "created_time": "August 13, 2023, 04:57:39 PM",
      "body": "It is difficult to determine what exactly your problem is because you did not provide enough information about your problem and the reason for the ban, can you access your account or not? Also, did you complete the KYC verification procedures or not?Anyway, I recommend you to visit this site:https://www.kingsleynapley.co.uk/services/specialist-group/crypto-assetsmay provide you with legal advice that helps you to understanding your problem and knowing the solutions and legal measures that can be taken. It is important that you understand your legal position before you hire a lawyer and lose more additional costs.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mistarlupo",
      "created_time": "August 13, 2023, 08:02:20 PM",
      "body": "Hi all,Thanks for replies.My funds are blocked in Blockchain.com custodial wallet (Trading account). I've been using their service for 10+ years with a fully verified account.Once I decided to withdraw my funds, they put the transaction \"In review\" and it is in this state for months. Of course, I raised this with support, but I am getting non-sense replies without clear explanation what is the actual problem.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Potato Chips",
      "created_time": "August 13, 2023, 08:16:15 PM",
      "body": "Quote from: mistarlupo on August 13, 2023, 08:02:20 PMMy funds are blocked in Blockchain.com custodial wallet (Trading account). I've been using their service for 10+ years with a fully verified account.Once I decided to withdraw my funds, they put the transaction \"In review\" and it is in this state for months. Of course, I raised this with support, but I am getting non-sense replies without clear explanation what is the actual problem.Disappointed but not surprised. They're kinda known for testing your patience when things go south and you'd need their hand to fix it.Most recent case I remember:Quote from: GekkeBelg on June 29, 2023, 10:59:00 PMGood news: after 2 months and 8 days of waiting, Blockchain Exchange finally sent me the funds. I will never use Blockchain again, let that be sure!This was their comment:QuoteDue to a breach of our terms and conditions, your account has been suspended. The funds have been refunded to the crypto address you have provided and the account holds no custodial funds. Unfortunately, we are not able to provide any details about individual applications or specific reasons for rejection. We apologize for any inconvenience this may cause.Back to your question, I know kroll.com from the crypto news I've read and from what I'm seeing they're on lots of locations including UK and Luxembourg. But I would guess, they're more expensive than the rest in the market. Have you tried writing to UK subreddits as well? for instance: https://www.reddit.com/r/BitcoinUK/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dansus021",
      "created_time": "August 14, 2023, 06:41:06 AM",
      "body": "First of all what is the reason they blocked your account, and secondly like everyone said that blockchain.info had private key that you can extract and transferred your bitcoin to other address. Me personally user of blockchain wallet back a couple of years ago. Maybe they can still unlock your account by emailing and ask what happened to your account",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joniboini",
      "created_time": "August 15, 2023, 06:28:26 AM",
      "body": "Quote from: mistarlupo on August 13, 2023, 08:02:20 PMOnce I decided to withdraw my funds, they put the transaction \"In review\" and it is in this state for months. Of course, I raised this with support, but I am getting non-sense replies without clear explanation what is the actual problem.Try to raise some noise in social media since I've seen some cases get processed quicker after the user complaints on Reddit. By quicker I mean months. It is unfortunate but some exchanges are as quick as snails when processing complaints. But this also depends on luck since they might no longer care about their reputation at this point. Just keep in mind that the cost to make a case against them is probably a lot, and for some users moving to other platforms might be better. Best of luck if you try to sue them though.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "August 15, 2023, 06:31:57 AM",
      "body": "Quote from: dansus021 on August 14, 2023, 06:41:06 AMFirst of all what is the reason they blocked your account, and secondly like everyone said that blockchain.info had private key that you can extract and transferred your bitcoin to other address. They said their trading custodial account was blocked, so there are no private keys available for exporting there.Quote from: joniboini on August 15, 2023, 06:28:26 AMTry to raise some noise in social media since I've seen some cases get processed quicker after the user complaints on Reddit. By quicker I mean months. It is unfortunate but some exchanges are as quick as snails when processing complaints. But this also depends on luck since they might no longer care about their reputation at this point. Just keep in mind that the cost to make a case against them is probably a lot, and for some users moving to other platforms might be better. Best of luck if you try to sue them though.I don't think that will work, especially if Blockchain.info has a history of ignoring customer complaints on social networks.To the OP:Maybe you should try looking at lawsuits against other crypto exchanges and see what attorneys they are using, and then see if you can try to lawyer up with them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zoomic",
      "created_time": "August 15, 2023, 08:53:58 AM",
      "body": "Quote from: dansus021 on August 14, 2023, 06:41:06 AMFirst of all what is the reason they blocked your account, and secondly like everyone said that blockchain.info had private key that you can extract and transferred your bitcoin to other address. Me personally user of blockchain wallet back a couple of years ago. Maybe they can still unlock your account by emailing and ask what happened to your account I don't use blockchain.com but I want to ask you that users their services. Is it a non custodial wallet or an exchange. I heard here that they issue private keys, if they do it therefore means that the OP is in charge of his coin. How then did they lock his money. I feel Op's case is very much resolvable. They should try to give a good insight of the problem, members of this forum might help him. Unless the OP have already known that it is a legal matter, maybe relating to crime accusation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husires",
      "created_time": "August 16, 2023, 01:09:05 AM",
      "body": "Quote from: mistarlupo on August 13, 2023, 08:02:20 PMHi all,Thanks for replies.My funds are blocked in Blockchain.com custodial wallet (Trading account). I've been using their service for 10+ years with a fully verified account.Once I decided to withdraw my funds, they put the transaction \"In review\" and it is in this state for months. Of course, I raised this with support, but I am getting non-sense replies without clear explanation what is the actual problem.Did you get the 12-word Secret Private Key Recovery Phrase because it appears that the Blockchain.com account verification is the possibility of using their trading option where you can buy bitcoins or convert them to altcoins.go to Security Center > Backup Phrasehttps://support.blockchain.com/hc/en-us/articles/4417061860116-How-do-I-withdraw-crypto-from-my-Blockchain-com-Account-If you get it, you can extract the private key and use electrum wallet to withdraw your coins.use BIP39 option and use this bc1 address: Derviation Path m/84'/0'/0'Segwit address (start with 3): Derviation Path m/84'/0'/0'address start with 1: Derviation Path — m/44'/0'/0'",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dansus021",
      "created_time": "August 16, 2023, 02:31:02 AM",
      "body": "Quote from: Zoomic on August 15, 2023, 08:53:58 AMI don't use blockchain.com but I want to ask you that users their services. Is it a non custodial wallet or an exchange. I heard here that they issue private keys, if they do it therefore means that the OP is in charge of his coin. How then did they lock his money. I feel Op's case is very much resolvable. They should try to give a good insight of the problem, members of this forum might help him. Unless the OP have already known that it is a legal matter, maybe relating to crime accusation. As far as I know, Blockchain.info can lock your account because this wallet is kinda centralized and decentralized wallet   decentralized yes you can extract the private key from your account and it is easy back couple year ago, and centralized because they can lock example you lost your 2fa they can freeze your account.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}