{
  "id": "topic_5435482",
  "title": "leftover_potato",
  "author": "leftover_potato",
  "created_time": "January 17, 2023, 12:21:11 PM",
  "content": "Good day fellow degens,I would like to introduce my very first pet project www.web3ramen.com. It is a platform with free-to-use web3 tools to manage risk and protect yourself from potential scams/rugs especially in the wild wild west of DeFi.Officially launched on 1st January 2023. So it's less than a month old. At this point of time, there is only revoke token allowances tool. I'm adding more networks as time goes by with the short term goal to support 30+ EVM chains. Next tool that I'm aiming to put in would be the honeypot token checker, and would need some time to tweak it to achieve high % rate of detecting honeypot tokens.Hope you guys could give it a try and share me your thoughts and feedback. Also, do let me know what kind of tools that might be useful for your DeFi experience. I'll seriously consider it, of course, depending on my ability.For those who do not know what is revoke token allowances tool, FAQ here. https://web3ramen.com/faq  Currently, i'm thinking about portfolio checker across 30+ EVM chains, emergency withdrawal? LP breaker? Honeypot checker is 2nd tool in the pipeline. And open to ideas. Thank you and cheers.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5435482",
  "comments": [
    {
      "author": "joniboini",
      "created_time": "January 17, 2023, 01:53:16 PM",
      "body": "What's the difference between your tool and using another tool like Etherscan built-in revoked, or Revoke.cash other than the support for multiple networks? Also, is there no plan to publish the source code so others can verify it? Some of your competitors have a Github page/open source code, if it were me I'd be more interested in using them regardless of whether I can verify it or not. Especially after the recent fall of some exchanges, so many scams using smart contracts, etc.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "leftover_potato",
      "created_time": "January 17, 2023, 02:32:04 PM",
      "body": "Hello there,At this moment it's based built based on revoke.cash as reference, but with the intention to build a \"revoke all\" function which is possible, just need more time to test it out. In comparison to Etherscan built-in revoked, i believe it's limited to ERC20, ERC1155 and ERC721 (do correct me if im wrong). Yes publishing the source code is in the pipeline, but reason not at this point because i'm planning to have at least 2-3 tools published before doing so. As this is my 3rd week since launch, im spending more time in adding some other functions, based on feedback and also some inspirations from githubs. i want to have some sort of \"volume\" of tools usage in this coming months.Ultimate goal is to have 10+ defi tools in-house, without checking or bookmarking extra websites.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joniboini",
      "created_time": "January 18, 2023, 09:41:28 AM",
      "body": "Quote from: leftover_potato on January 17, 2023, 02:32:04 PMAt this moment it's based built based on revoke.cash as reference, but with the intention to build a \"revoke all\" function which is possible, just need more time to test it out. In comparison to Etherscan built-in revoked, i believe it's limited to ERC20, ERC1155 and ERC721 (do correct me if im wrong). Yes, that's what I understand too. However, I believe other explorers also have a similar function. I can see the appeal for an all-in-one revoke tool for different chains though, but if I don't use that many chains maybe I'll stick with an explorer instead. But, I might be interested if the tool is open source and can be verified by others, regardless if I use multiple chains or not.Quote from: leftover_potato on January 17, 2023, 02:32:04 PMYes publishing the source code is in the pipeline, but reason not at this point because i'm planning to have at least 2-3 tools published before doing so. As this is my 3rd week since launch, im spending more time in adding some other functions, based on feedback and also some inspirations from githubs. i want to have some sort of \"volume\" of tools usage in this coming months.I see. Do you plan to publish it on your GitHub then? If that's the case, I'll probably wait until the code is available to use the platform if I feel the need to revoke some contracts. I believe some people don't feel safe using a closed-source platform even if it's so convenient unless we use a throwaway wallet to test the tool.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "leftover_potato",
      "created_time": "January 19, 2023, 06:12:33 AM",
      "body": "Hello again,Yes the plan is there, but not a priority at the moment as the current plan is to build more tools. something like i want to have a few vegetables to sell, than just 1 potato right now.   at this point it's in personal private github, might transfer all that into a proper github ones as the codes needs more organised. the reason i want it to support as much network as possible, because there is still some sort of discrimination in chains. Example, it's hard to find a revoke tool for ETHPOW chain. Popular chains would already have dapps catering to it.another reason for multiple chain is based on experience. as a DeFi degen, i follow where the money flows.  ETH > BSC > POLYGON > AVAX > FTM > ARBITRUM  so in my personal opinion, makes sense to have it there. as people say, better to have it and no use uses it than not having it when people needed it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bettercrypto",
      "created_time": "January 20, 2023, 06:15:47 AM",
      "body": "It's hard to trust the kind of tools you're talking about and sharing here, to be honest. I'm sorry, I'm just telling the truth, there's a lot to prove compared to other tools that are better to use compared to the one you mentioned.    Actually, it is better to use these tools such as Myetherwallet, DEX, yield farming platform, Development tools like OpenZeppelin for smart contract development, and Borrowing and lending platforms, tools like this you will never doubt because something has been proven in this industry.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "leftover_potato",
      "created_time": "January 21, 2023, 03:34:50 PM",
      "body": "Quote from: bettercrypto on January 20, 2023, 06:15:47 AM It's hard to trust the kind of tools you're talking about and sharing here, to be honest. I'm sorry, I'm just telling the truth, there's a lot to prove compared to other tools that are better to use compared to the one you mentioned.    Actually, it is better to use these tools such as Myetherwallet, DEX, yield farming platform, Development tools like OpenZeppelin for smart contract development, and Borrowing and lending platforms, tools like this you will never doubt because something has been proven in this industry.Hello there,I don't mind the comment/truth, cause this is my first project and i admit straightforward that i'm not well verse on what's on the market. for sure, there are better tools out there that can inspire me to do better. this revoke tool is just my 1st stepping stone. and it's only my first month of many years of development. so i'm pretty excited about building own tools and who knows one day i'll create something that isn't in the market right now.   dummy like me can only hope.  but my idea still remains, useful defi tools all under 1 roof.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}