{
  "id": "topic_5398574",
  "title": "noormcs5",
  "author": "noormcs5",
  "created_time": "May 13, 2022, 07:11:19 PM",
  "content": "Unfortunately we have seen one of the biggest scam/failure of the project LUNA /UST where people have lost million/billions of dollars invested in them. We can't foresee such incidents but one thing is that if we follow the best practices of portfolio management, we could have minimize the loss.No crypto assets in our portfolio should be that big, that in case of a mishap, our whole portfolio get a big hit. Also this means not to put all eggs in one basket in our crypto portfolio.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5398574",
  "comments": [
    {
      "author": "BitcoinGirl.Club",
      "created_time": "May 13, 2022, 07:18:44 PM",
      "body": "Quote from: noormcs5 on May 13, 2022, 07:11:19 PMNo crypto assets in our portfolio should be that big, that in case of a mishap, our whole portfolio get a big hit. Also this means not to put all eggs in one basket in our crypto portfolio.Not the fiat too. Some day the authority find something wrong with you and they will take everything from you. If bitcoin was not invented then no crypto would exists. Have bitcoin, the trustless money. If people are not learning today then they will not ever.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yaunfitda",
      "created_time": "May 13, 2022, 08:07:31 PM",
      "body": "Quote from: noormcs5 on May 13, 2022, 07:11:19 PMUnfortunately we have seen one of the biggest scam/failure of the project LUNA /UST where people have lost million/billions of dollars invested in them. We can't foresee such incidents but one thing is that if we follow the best practices of portfolio management, we could have minimize the loss.No crypto assets in our portfolio should be that big, that in case of a mishap, our whole portfolio get a big hit. Also this means not to put all eggs in one basket in our crypto portfolio.For altcoins yeah? it's not good to have your portfolio to the majority. But I would say that there is nothing wrong with going full BTC, it has been proven already as compare to those altcoins that has been what like 2 years in the market and investors think they are safe? So in the case of Luna, from billions worth to mere millions and then the biggest exchange halting it because it went down almost close to 0, what a failure.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coupable",
      "created_time": "May 13, 2022, 08:08:49 PM",
      "body": "Quote from: BitcoinGirl.Club on May 13, 2022, 07:18:44 PMQuote from: noormcs5 on May 13, 2022, 07:11:19 PMNo crypto assets in our portfolio should be that big, that in case of a mishap, our whole portfolio get a big hit. Also this means not to put all eggs in one basket in our crypto portfolio.Not the fiat too. Some day the authority find something wrong with you and they will take everything from you. If bitcoin was not invented then no crypto would exists. Have bitcoin, the trustless money. If people are not learning today then they will not ever.You have thousands and thousands of projects having token integration. There are no reliable method to select the solid ones.From another side, it becomes almost impossible to stop using all of them just because one of them failed. Failure might be caused by many factors and we all know how many projects fallen because of a successful hack attempt or a glitch in the system.I remember the fork of Ethereum from Eth Classic ETC, isn't this possible in the case of Luna?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Odusko",
      "created_time": "May 13, 2022, 08:43:32 PM",
      "body": "Quote from: BitcoinGirl.Club on May 13, 2022, 07:18:44 PMQuote from: noormcs5 on May 13, 2022, 07:11:19 PMNo crypto assets in our portfolio should be that big, that in case of a mishap, our whole portfolio get a big hit. Also this means not to put all eggs in one basket in our crypto portfolio.Not the fiat too. Some day the authority find something wrong with you and they will take everything from you. If bitcoin was not invented then no crypto would exist. Have bitcoin, the trustless money. If people are not learning today then they will not ever.Right store Bitcoin in your cold wallet that way you have total freedom of your money, don't ever trust centralized currency to the extent of storing your life savings in them while what you can control it flows as long as you operate within the best practice you will never have such problem with Bitcoin. I feel for investors who have put their trust in stable coins their highly risky.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "virtualdn",
      "created_time": "May 13, 2022, 08:48:51 PM",
      "body": "No need to put your eggs in more baskets. There is only one true coin out there: BTC. Invest and HODL. Easy recipe for success. The rest are s*itcoins and they will all end sooner or later.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nurilham",
      "created_time": "May 13, 2022, 11:16:00 PM",
      "body": "Quote from: Yaunfitda on May 13, 2022, 08:07:31 PMFor altcoins yeah? it's not good to have your portfolio to the majority. But I would say that there is nothing wrong with going full BTC, it has been proven already as compare to those altcoins that has been what like 2 years in the market and investors think they are safe?I think it is no problem to have most assets in Altcoins as long as it is the top altcoins like ETH or BNB. Even though we have a full asset in BTC, doesn't mean it is secure enough. We don't compare Luna with top altcoins, it is a different level. The altcoins like ETH or BNB have a better way to ensure their values, they are the most popular altcoins and they have bigger holders. These altcoins also dominate the altcoins market, so nothing to be worried so much.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rengga Jati",
      "created_time": "May 13, 2022, 11:44:26 PM",
      "body": "Quote from: noormcs5 on May 13, 2022, 07:11:19 PMNo crypto assets in our portfolio should be that big, that in case of a mishap, our whole portfolio get a big hit. Also this means not to put all eggs in one basket in our crypto portfolio.I do agree with \"never put all eggs in one basket\", \"not all in\" and \"diversification wisely\".This is how our fud management roles manage the risks of investing. No crypto moreover altcoins will guarantee 100% to belong life and also profitable always. AsLUNA, I wonder how so many people really admire this coin, and we also can see that the Luna project and teams are actually so strong. But in fact, everything can happen, even unpredictably, and surprisingly, this is the crypto world. however, I also don't know if those people who invest billions in LUNA are exactly big investors or whales that have diversified their money or not. We don't actually know what their money management is on investing in LUNA. But I read from many chats orcomments in telegram groups and other social media, that most of them are trapped on hype, buying LUNA when at the top, and some of them are also panic buying when the price drops, thinking of the price will be p rising again, but in fact, the price keeps decreasing. From LUNA, we can also learn several things besides never all in:- Fund & risk management- Holding, holding and holding may not be always worthy except that you really know which coin will guarantee worth it for long-term hold. And this kind of holding is only suitable for Bitcoin. - It may be useful to set CL in certain price to anticipate the extreme drop, even in the spot market. Moroever in the fuure market, needs for CL and also hedging mode.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hatshepsut93",
      "created_time": "May 13, 2022, 11:52:23 PM",
      "body": "Quote from: noormcs5 on May 13, 2022, 07:11:19 PMUnfortunately we have seen one of the biggest scam/failure of the project LUNA /UST where people have lost million/billions of dollars invested in them. We can't foresee such incidents but one thing is that if we follow the best practices of portfolio management, we could have minimize the loss.You can foresee such incidents by not investing in altcoins. Quote from: noormcs5 on May 13, 2022, 07:11:19 PMNo crypto assets in our portfolio should be that big, that in case of a mishap, our whole portfolio get a big hit. Also this means not to put all eggs in one basket in our crypto portfolio.Diversification doesn't work in crypto. Altcoins are nothing more than gambling tools, they get used and then thrown away when new ones arrive. You can invest in 10 different altcoins, but the outcome will be the same - they will all lose most of their value sooner or later.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CaVO32",
      "created_time": "May 13, 2022, 11:53:55 PM",
      "body": "Quote from: nurilham on May 13, 2022, 11:16:00 PMQuote from: Yaunfitda on May 13, 2022, 08:07:31 PMFor altcoins yeah? it's not good to have your portfolio to the majority. But I would say that there is nothing wrong with going full BTC, it has been proven already as compare to those altcoins that has been what like 2 years in the market and investors think they are safe?I think it is no problem to have most assets in Altcoins as long as it is the top altcoins like ETH or BNB. Even though we have a full asset in BTC, doesn't mean it is secure enough. We don't compare Luna with top altcoins, it is a different level. The altcoins like ETH or BNB have a better way to ensure their values, they are the most popular altcoins and they have bigger holders. These altcoins also dominate the altcoins market, so nothing to be worried so much.This is the risk of putting your money to other alts not including in the very top. The risk is always there, so better diversify your portfolio and as much as possible keep some of your funds to top coins like BTC, ETH or BNB. If they may crash, the possibility of recovering is high but something like LUNA, what do you think will be the reason that they can recover from this slump?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Viscore",
      "created_time": "May 13, 2022, 11:57:46 PM",
      "body": "Quote from: noormcs5 on May 13, 2022, 07:11:19 PMUnfortunately we have seen one of the biggest scam/failure of the project LUNA /UST where people have lost million/billions of dollars invested in them. We can't foresee such incidents but one thing is that if we follow the best practices of portfolio management, we could have minimize the loss.No crypto assets in our portfolio should be that big, that in case of a mishap, our whole portfolio get a big hit. Also this means not to put all eggs in one basket in our crypto portfolio. That is applicable if you are investing in altcoins or in any project that is still no guaranteed profits, but bitcoin will always be an exception. You can diversify your portfolio as much as you want but always see to it that a bigger portion is fill in with bitcoin. As bitcoin will appreciate its value in the next possible years, then its good to hold coins like bitcoin. However, a lot have been losing now due to Luna, but i think there's no need to regret about it since we also made a lot of profits from Luna before this happens. So its not really a huge loss for most of us.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Disruptivas",
      "created_time": "May 13, 2022, 11:57:51 PM",
      "body": "Anyone who has lived intensely through the 2017/2018 cycle has learned that even serious projects in the top 20 can quickly lose positions according to new trends, needs and industry narratives. A clear example is the case of privacy-focused cryptocurrencies. In the last cycle, it became evident that the cryptocurrency narrative for anonymity was no longer the 'trend' of the market, the issue of DeFi as a narrative gained much more value.This perspective of the mobility of the collective interest makes any exposition – even in projects with strong foundations – extremely dangerous. The lesson at the end seems to me to be more learning to take profit than anything else.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "perla",
      "created_time": "May 14, 2022, 03:04:04 AM",
      "body": "That's right and it is not smart to just let your investment in one coin only, my investment is composed of 70% Bitcoin and 30% varieties of altcoins. One lesson I learned about it is that stable coins were not that stable, right now I am not sure where I should rest my asset when selling, USDT, BUSD or DAI?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "UmerIdrees",
      "created_time": "May 14, 2022, 04:57:06 PM",
      "body": "Quote from: virtualdn on May 13, 2022, 08:48:51 PMNo need to put your eggs in more baskets. There is only one true coin out there: BTC. Invest and HODL. Easy recipe for success. The rest are s*itcoins and they will all end sooner or later.I agree that 50% of your portfolio should be in bitcoin. For the remaining 50%, you can add Ethereum and other cryptocurrencies. In this way, even if a bad incident happens as it happened with luna recently, then your portfolio will not be affected much. Recently I knew many people who invested everything in LUNA and now they are left with nothing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "makishart",
      "created_time": "May 14, 2022, 05:13:12 PM",
      "body": "The problem was if the greedy person will not care about that, this being said that when they have a choice to divided or invested small - medium amounts of money to the tokens but they instead of gambling their life to the coin with the hope if they can doubled their life instantly or even make it tripled. People didn't learn after they have been loosing millions dollars of money from this case. I see that so many people said if they wanna try to do the worst things like suicide but again life is only once.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sulendra12",
      "created_time": "May 14, 2022, 06:12:04 PM",
      "body": "Quote from: noormcs5 on May 13, 2022, 07:11:19 PMNo crypto assets in our portfolio should be that big, that in case of a mishap, our whole portfolio get a big hit. Also this means not to put all eggs in one basket in our crypto portfolio.There is just a possibility every coin in the market would have such big crash like LUNA. That just means you have to prepare for the risk that could happen anytime in the future. Also, putting one bag of money on the only single coin is just wrong at all, this is why we have seen so many bad incident happen when the price is crashing, so you can at least have backup money for your living/another investment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Henrobakkara",
      "created_time": "May 14, 2022, 07:31:30 PM",
      "body": "Quote from: noormcs5 on May 13, 2022, 07:11:19 PMUnfortunately we have seen one of the biggest scam/failure of the project LUNA /UST where people have lost million/billions of dollars invested in them. We can't foresee such incidents but one thing is that if we follow the best practices of portfolio management, we could have minimize the loss.No crypto assets in our portfolio should be that big, that in case of a mishap, our whole portfolio get a big hit. Also this means not to put all eggs in one basket in our crypto portfolio.I believe you are right. Investing soo much in any other crypto outside Bitcoin for me is an even bigger risk when we know cryptocurrency investment is a risk, to begin with. I believe some poepple thought they could just be taking their daily, weekly, or monthly earnings from that investment and see how it all turns out, maybe we sometimes get carried away from Investing how much you can afford to lose.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitcoin-shark",
      "created_time": "May 14, 2022, 07:50:16 PM",
      "body": "let's say that to minimize the risks in the world of crypto you need to adopt the right strategy, that is to diversify your investments, i personally would do so half bitcoin which is the fulcrum of this virtual world and the other half divided equally among the top ten of the ranking , it happened to luna and terra usd but there could be any altcoin in its place",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jating",
      "created_time": "May 14, 2022, 08:51:42 PM",
      "body": "Quote from: bitcoin-shark on May 14, 2022, 07:50:16 PMlet's say that to minimize the risks in the world of crypto you need to adopt the right strategy, that is to diversify your investments, i personally would do so half bitcoin which is the fulcrum of this virtual world and the other half divided equally among the top ten of the ranking , it happened to luna and terra usd but there could be any altcoin in its placeNot sure if that is safe as well, we might as well put the majority to bitcoin and less to altcoin because of the risk, just like what happen if you invest maybe 10-20% in Terra, your investment could have been a wipe out if you invested more. So at least have more into bitcoin and I believed this is what most of us is doing. And I wouldn't be surprised if there is some that really just have 100% in their wallet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jackl87",
      "created_time": "May 14, 2022, 09:44:23 PM",
      "body": "Quote from: noormcs5 on May 13, 2022, 07:11:19 PMUnfortunately we have seen one of the biggest scam/failure of the project LUNA /UST where people have lost million/billions of dollars invested in them. We can't foresee such incidents but one thing is that if we follow the best practices of portfolio management, we could have minimize the loss.No crypto assets in our portfolio should be that big, that in case of a mishap, our whole portfolio get a big hit. Also this means not to put all eggs in one basket in our crypto portfolio.I caught myself a lot of time in the last few weeks and months regretting the fact that i did not invest into terra a last year or early this year because a few weeks ago it was often the case that Terra was losing way less when the whole market went down but gained more than the average projects when the market went up. This way Terra found it's way into the top 10 of all crypto projects which was pretty amazing at that point. Now of course i am lucky that i did not invest into Terra because it looks like that it would be a total loss of my funds at the moment. I feel sad for everyone who had a bag of Terra and i hope that you did not invest money that you can not afford to lose into it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}