{
  "id": "topic_5425209",
  "title": "ovcijisir",
  "author": "ovcijisir",
  "created_time": "December 03, 2022, 01:27:02 AMLast edit: December 04, 2022, 10:58:05 AM by ovcijisir",
  "content": "Pozdrav svima,Ukoliko nekome treba MATIC za obavljanje transakcija na Polygon mrezi slobodno mozete ovdje poslati svoju adresu, te cu vam poslati 0.01 MATIC koji je dovoljan za obavljanje osnovnih transakcija na mrezi. Trenutno imam fond za oko 30 ak fauceta.Za one koji ne znaju Faucet = posaljite adresu, posaljem vam Matic.Razlog zasto sam se odlucio za ovaj faucet je što je Matic je odlicna \"početnička\" kriptovaluta za sa kojom se korisnici mogu lako upoznati i lako je korisiti (jefitne transakcije, puno sadrzaja tipa NFT tokeni, lako se koristi sa Metamask walletom itd.) Takoder i starijim clanovima se zna dogoditi da im u nekom trenutku nestane MATIC-a, a ne isplati im se slati male kolicine BTC ili ETH na mjenjacnicu i nazad. Tako sam i dobio ideju za ovaj thread CasperBGD i Trofo su me inspirirali za ovaj faucet kad mi je nestalo MATICA za neke transakcije.Dva uvjeta za ovaj faucet    -da osoba ima vise od 5 postova na Croatian localu   -molim da bude max. jedna prijava dnevno po osobi.Malo upozorenje, mozda necu biti bas azuran, jer nisam svaki dan na forumu, ali bez brige svakih par dana cu baciti oko na ovaj thread. Takoder ostale kolege sa foruma su takoder dobrodosli poslati MATIC prijavljenima ukoliko zele.Edit. Do daljnjega ako trebate Matic javite mi na PM, dok me napravim Google forms formular za faucet. Nemojte slati i prijavljivati se u thread.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5425209",
  "comments": [
    {
      "author": "btcltcdigger",
      "created_time": "December 04, 2022, 07:58:09 AM",
      "body": "Kolko dajes MATICa dnevno po adresi? Cisto da vidim dal se isplati uopce, bar meni",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pmalek",
      "created_time": "December 04, 2022, 08:41:55 AM",
      "body": "Lijepa incijativa, ali ovo ne bi smio raditi na forumu. Ako neko od moderatora zaluta u našu altcoin sekciju i pronađe ovu temu i prevede je da provjeri sadržaj, mogao bi ti i svi koji su učestvovali dobiti kratkotrajni ban na 1-2 tjedna. To se je dešavalo u prošlosti u engleskom dijelu foruma.Bilo koja vrsta altcoin giveaway-a je zabranjena po pravilima. Samo se Bitcoin smije davati u zamjenu za poruke koje sadrže adrese od korisnika. Altcoini ne. Ja bi ti preporučio da napraviš Google doc gdje se onda oni koji su zainteresovani mogu prijaviti i poslati podatke za isplatu MATICa. Alternative je da ti se ljudi jave preko PMa.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ovcijisir",
      "created_time": "December 04, 2022, 10:54:18 AM",
      "body": "Quote from: btcltcdigger on December 04, 2022, 07:58:09 AMKolko dajes MATICa dnevno po adresi? Cisto da vidim dal se isplati uopce, bar meni0.01 Matic, Ali nije ideja da se netko obogati, nego da pokrije osnovne transakcije na Polygon mrežiQuote from: Pmalek on December 04, 2022, 08:41:55 AMLijepa incijativa, ali ovo ne bi smio raditi na forumu. Ako neko od moderatora zaluta u našu altcoin sekciju i pronađe ovu temu i prevede je da provjeri sadržaj, mogao bi ti i svi koji su učestvovali dobiti kratkotrajni ban na 1-2 tjedna. To se je dešavalo u prošlosti u engleskom dijelu foruma.Bilo koja vrsta altcoin giveaway-a je zabranjena po pravilima. Samo se Bitcoin smije davati u zamjenu za poruke koje sadrže adrese od korisnika. Altcoini ne. Ja bi ti preporučio da napraviš Google doc gdje se onda oni koji su zainteresovani mogu prijaviti i poslati podatke za isplatu MATICa. Alternative je da ti se ljudi jave preko PMa.     Hvala ti na upozorenju Pmalek! Upravo sam vidio da bih prekršio pravilo 15. sa ovom temom:( A ništa onda mi preostaje da napravim Google form, objaviti cu u ovoj temi kad ga napravim. Ukoliko netko treba Matic slobodno javite na PM.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}