{
  "id": "topic_5398845",
  "title": "BitcoinIsABubble",
  "author": "BitcoinIsABubble",
  "created_time": "May 16, 2022, 08:55:12 AM",
  "content": "Hello Bitcointalkers,In this thread, I will post all the relevant information about the game which we're building - Path of Survival.We believe that traditional gamers are left out of the blockchain gaming space due to the highly demanding entry (crypto knowledge, wallet, crypto), which eventually turns down the everyday player, who is not familiar with blockchain.The game is going to be free-to-play, with off-chain game mechanics and a chain-agnostic approach.We are doing the \"gameplay first\" approach, which will allow us to build the necessary player base from Day 1 and simulate the game economy before releasing it to the public.The game will feature a traditional RPG progression in the form of PVP and PVE content and once the player base increases, we will release the RTS mode, which will be a season-based mode in which players will team and compete for resources.Our most unique approach is the team-to-earn mechanics in the form of clan lands, in which the owners will be able to onboard other members, decide on the governing model and receive passive income from the fees generated by clan members on the in-game marketplace.Things such as team members, tokenomics model and whitepaper can be found on our website: https://pathofsurvival.io/Here I will mainly post insights on how the project is developing and what are our imminent goals. This being said, I would be happy to hear your feedback and general feel about Path of Survival.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5398845",
  "comments": [
    {
      "author": "BitcoinIsABubble",
      "created_time": "June 21, 2022, 07:50:40 AM",
      "body": "Hello everyone,A quick update on the project:We have released a closed alpha on the 15th of June, which was meant to showcase the game mechanics and give the players a feel about the game.Stage 1: Dungeon(PvE), Skills & Character equipmentIn this stage, players will be able to compete in an unlimited dungeon, test out different skills and change their equipment.Duration: 1 week (15th to 22nd of June)Stage 2: Player-versus-player (PvP), improved battle mechanics, additional skills, improved UI/animationsDuration: 2 to 4 weeksThe reveal of PvP will be huge and we are excited about it. Tell us which builds should be nerfed or which class you enjoyed playing the most, we will implement these changes for the Beta release.Stage 3: Polished PvP and PvE, crafting, character upgrades, AND a sneak peek on the Clan Lands!This stage will represent the go-to-version, which is designed to simulate the actual game economy. Players will be earning testSRV which will be convertible to actual SRV. Rate of conversion TBA.We had over 70 people for Stage 1 of the closed alpha testing and we expect these numbers to increase with the release of the PvP (1 on 1) mode.Clan lands & Global Map:We have started working on the Global Map visualization and we aim to implement it within the next two development milestones. The Global Map will feature a dynamic environment with resource farming and hostile encounters along the way.Until next time",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "RussianEnglishTranslation",
      "created_time": "June 21, 2022, 04:37:03 PM",
      "body": "Quote from: BitcoinIsABubble on May 16, 2022, 08:55:12 AMHello Bitcointalkers,In this thread, I will post all the relevant information about the game which we're building - Path of Survival.We believe that traditional gamers are left out of the blockchain gaming space due to the highly demanding entry (crypto knowledge, wallet, crypto), which eventually turns down the everyday player, who is not familiar with blockchain.The game is going to be free-to-play, with off-chain game mechanics and a chain-agnostic approach.We are doing the \"gameplay first\" approach, which will allow us to build the necessary player base from Day 1 and simulate the game economy before releasing it to the public.The game will feature a traditional RPG progression in the form of PVP and PVE content and once the player base increases, we will release the RTS mode, which will be a season-based mode in which players will team and compete for resources.Our most unique approach is the team-to-earn mechanics in the form of clan lands, in which the owners will be able to onboard other members, decide on the governing model and receive passive income from the fees generated by clan members on the in-game marketplace.Things such as team members, tokenomics model and whitepaper can be found on our website: https://pathofsurvival.io/Here I will mainly post insights on how the project is developing and what are our imminent goals. This being said, I would be happy to hear your feedback and general feel about Path of Survival.If you are going to build a crypto game then you should consider receiving a grant. Several chains are offering grants now, a couple of them are Hedera and Candle Chain, with Candle Chain being the easiest to get.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Xal0lex",
      "created_time": "June 21, 2022, 07:43:46 PM",
      "body": "I don't know, now is not the best time to launch Play-to-Earn projects, simply because the hype for these projects has long ended, and the industry is going through liquidity crisis and this liquidity, first of all, leaves exactly such tokens (play-to-earn, NFT, Meraverse, etc.). There is uncertainty in the market right now and so it is not known how long the crypto-winter will last, so investing in such now is a huge risk.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitcoinIsABubble",
      "created_time": "June 24, 2022, 09:15:26 AM",
      "body": "Quote from: Xal0lex on June 21, 2022, 07:43:46 PMI don't know, now is not the best time to launch Play-to-Earn projects, simply because the hype for these projects has long ended, and the industry is going through liquidity crisis and this liquidity, first of all, leaves exactly such tokens (play-to-earn, NFT, Meraverse, etc.). There is uncertainty in the market right now and so it is not known how long the crypto-winter will last, so investing in such now is a huge risk.I can agree with your point to some extent. Right now the marketing is still quite volatile and we are going to go even lower in terms of total market cap. What we are trying to do is to create the game and polish the game economy as much as possible before releasing the token.This way we are approaching the market as a ready game, which will then link the game economy to the blockchain. By building a player base before releasing any kind of token the stage of the project and the amount of hype does not affect the financial performance of the native token as it is still not publicly tradeable.Once we have solid DAU (daily active users) and our community is already enjoying the game for the actual gameplay (w/out any earning incentive) we will push our funding round and then TGE, with token utility in terms of in-game sinks and staking from Day 1.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Xal0lex",
      "created_time": "June 24, 2022, 07:30:02 PM",
      "body": "Quote from: BitcoinIsABubble on June 24, 2022, 09:15:26 AMOnce we have solid DAU (daily active users) and our community is already enjoying the game for the actual gameplay (w/out any earning incentive) we will push our funding round and then TGE, with token utility in terms of in-game sinks and staking from Day 1.Do you already have ready-made solutions for attracting users to your product? It's just that these are extremely difficult times, and all these business models are not very popular among players, based on various reports from major analytical companies. There is a global lull in these business models. Also, games in this industry have a balance sheet problem. The number of players who come to the project for earnings greatly exceeds the number of players who bring money to the project.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitcoinIsABubble",
      "created_time": "July 04, 2022, 07:40:58 AM",
      "body": "Quote from: Xal0lex on June 24, 2022, 07:30:02 PMQuote from: BitcoinIsABubble on June 24, 2022, 09:15:26 AMOnce we have solid DAU (daily active users) and our community is already enjoying the game for the actual gameplay (w/out any earning incentive) we will push our funding round and then TGE, with token utility in terms of in-game sinks and staking from Day 1.Do you already have ready-made solutions for attracting users to your product? It's just that these are extremely difficult times, and all these business models are not very popular among players, based on various reports from major analytical companies. There is a global lull in these business models. Also, games in this industry have a balance sheet problem. The number of players who come to the project for earnings greatly exceeds the number of players who bring money to the project.Yes, we do, we are relying on industry-proven concepts for retaining and engaging new users in a traditional gaming environment. I 100% agree with the balance sheet problem, a lot of projects position themselves as \"play-to-earn\", which in the long run is not a sustainable way to attract new users.Using this approach, the majority of your userbase will indeed come for the earning incentive and only a few will bring fresh money in.As I mentioned earlier, we are focused on making a fun and enjoyable gameplay, which will then tie to the blockchain and allow for the player-driven economy to take place.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}