{
  "id": "topic_5439902",
  "title": "Davidvictorson",
  "author": "Davidvictorson",
  "created_time": "February 15, 2023, 02:08:08 AMLast edit: February 15, 2023, 02:23:16 AM by Davidvictorson",
  "content": "E be like say as the election dey near, d country dey hard. No food, no money, no light, no fuel. Security nko? Employmeny nko? Cata - cata just full everywhere. If with all these things wey they happen you never question why dem born you for Nigeria, omo you be strong person. Somebody talk say if them born you for Naija, life don dey win 1 - 0 or in gambling terms, the odds nor dey in your favour. If you look am sef na true in a way because why e be say the basic necessities of life or  like dem call am for civic education, the basic social amenities or infrastructure still dey lacking for Naija?Anyways, I nor come to rant, I sabi say na very hard times wey we dey experience for the country and I want to chip in some tips on how to move on and remain mentally strong despite as everi where jaga - jaga.1. Focus on wetin you fit control - The truth be say you fit nor control fuel price wey don be N350 - N400 plus, you fit no control weder money dey ATM or not but wetin you go fit control na your emotions, how you take react. You fit control mindset and thought patterns. If you fit do this, most of our worries go away and we go dey mentally strong.2. Try dey exercise - We sabi say exercise dey very important because dokitors don talk say e dey relieve stress and make us relax. E also good for the body too. Just 15 to 20 minutes of mild to moderate exercise go help your mental health wella especially now, wey e be say everi man fo country dey vex.3. Try maintain strong relationships -  We nor fit do without people. As people wey go school talk am say we be social animals. We need person or persons at the end of the dey to talk even if the person nor get solution to the problem but the feeling say \"we are in this together\" dey help well well. So find and maintain that strong relationships. 4. If you be religious person try maintain your spirituality - Religion get him own way of making people dey okay. Like when you go church and pastor talk say God know wetin dey sup with you and make you nor worry everytin go dey alright. Even if you dey depressed and anxious, you fit dey alright just by hearing those words. Plenty researchers don already talk say religion fit promote mental health. Abeg make una no vex. I sabi say this one nor be Bitcoin topic but my naija people dey go through a lot especially now, I say make I just put one or two words of encouragementNo matter wetin sup, abeg make we nor give up because na who give up fuck up. I hope day una grab one or two things here. Una doh",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5439902",
  "comments": [
    {
      "author": "Dzwaafu11",
      "created_time": "February 15, 2023, 06:03:37 AM",
      "body": "OP you talk and e make sense as you they motivate to not be discourage of what's going on in the country, these talk  wey you talk like this go make some people even relax there mind from bad things.If no be patient sef the country too hard for every one  now.Now wey this things they happen some people mind don go far.Some people life have been depressed because if there's no money how you take even chop and you get your money you know fit withdraw.You know say the matter go cast na.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wiwo",
      "created_time": "February 15, 2023, 08:37:53 AM",
      "body": "Baba you try for this reminder of waiten we done already know, as the entire atmosphere is intense due to political activities as we are few days to go into the general election accomoanied with the implementation of the CBN monetary policy that has resulted in a scarcity of the naira note and other banks wahala. -It is there for important for everyone to maintain a positive mindset knowing within themselves that las las everybody goes dey ok, building a high mental state is one of the qualities we should build so that our motivation level will surpass any environmental and other external factors that influence our mood and behaviour. -The ball is in our court and no one will do that for you and just as ops have mentioned a few points and habits that will sustain our mental well-being as Nigerains and the world at large. -Make we dey try to be the driver of our actions even though we are not in control of some things, but we are in charge of how we choose to react to them and maintain a balanced character is a big win in this period of aggression and high temperament in the country.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Belarge",
      "created_time": "February 15, 2023, 10:08:53 AM",
      "body": "Na better thing you talk oo, thanks for this motivation and reminder,but with the ways things be for this country now, we no need make person come advice or motivate us oo, because we for Nigeria don suppose get sense, because of wetin our eyes dey see for naija, my own opinion be say make naija people just dey do what is right and at the right time,I no need to talk plenty for this matter,We know our challenges for naija, monetary policy, fuel price and other problems, we know the people wey dey make us face this problems, and we know as we go take remove those people, so make we remove them, now no be time for plenty talk, now na the time to show hardwork and dedication, if we want make our naija Better..Thanks for your advice and motivation, we really appreciate..",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Merit.s",
      "created_time": "February 18, 2023, 08:53:53 PM",
      "body": "OP, I appreciate this piece of advice to tackle our emotions base on wetin dey sup for the country to keep ourselves in a healthy state so that we go jump and pass. He dey very frustrating say this condition wey we dey pass through fit lead to illness or death of some people wey think say na do or die affair. We hear everything wey happen for Edo state and life follow loss for the action. We fit adapt to any kind condition wey we find ourselves if we follow OP tips and put God first. I no go lie for you things for this country don tire me because every little change pple dey see am as opportunity to exploit each other.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Remiscoin5",
      "created_time": "February 19, 2023, 01:08:29 AM",
      "body": "Yeah alot has been going through many people minds ,some even lost appetite to eat ,relax and chill .with all the gbru gbru gbru happening some might even forget to take their bath or even brush teeth ,people are always running up and down ,no peace and rest of mind too,before you know dem go say make we still dea use the old money , before u know dem go say old money na of no use ,see now we use money to buy money .we really need peace ,some hardly have time for their children and loved ones ,now people hardly eat what they want ,if na 1k be ur last money na 500 for charges 😩😩😩how can people remember to do exercise or chill too ,many are starving and homes are broken ,na only God go help 🥺🥺",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Majestic-milf",
      "created_time": "February 21, 2023, 02:06:22 PM",
      "body": "Nah beta advice be this but where hit me nah your no.1 point. I see say pipo dey go about blaming the govt and loosing temper anyhow, but if we govt no do anything, mata go still dey as e dey. So e go beta to carry that energy do something useful as we all dey believe say tins go alright. The kata kata wey dey ground so dey put unnecessary pressure on pipo and e dey push dem to do wetin dem no wan do, but most times, patience and endurance nah tins we need to exercise since nah for a beta naija we all dey fight for.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cryptomultiplier",
      "created_time": "February 21, 2023, 08:20:37 PM",
      "body": "OP, if to say I dey contest for the oncoming election and I win, I for appoint you as minister of information. The way you deliver this post, na at the right moment, because for real, watin Nigerians dey see this period no funny o. I sincerely don ask myself more than once how I take find myself for this country because of the way hardship dey celebrated and some people dey call am power or control or whatever it is wey make them merger profit. The average Nigerian right now dey interested in ripping off his neighbour because of money. Every form of betterment is sabotaged yet the thought of being innovative both in exploring opportunity in cryptocurrency is even overlooked and if it were possible, taxed.Your post is on point, inner peace reflects outwardly, so is any unholy emotion that is not checked with a proper mindset.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}