{
  "id": "topic_5413474",
  "title": "Question:",
  "author": "OgNasty",
  "created_time": "September 14, 2022, 12:16:05 AM",
  "content": "As we approach the Ethereum merge (approximately 27 hours away) I'm curious what the community thinks the price will do.  Do you think the merge will cause a lot of selling as people look to book profits, or will people buy up all they can to enjoy the higher staking %?  Who knows what will happen.  Maybe this community?Be sure to vote which way you think it will go, even if you're not sure.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5413474",
  "comments": [
    {
      "author": "Gayong88",
      "created_time": "September 14, 2022, 03:19:29 AM",
      "body": "The price of ETH will be heavily influenced by broader forces in the cryptocurrency market and intrinsically in my opinion. it's good to wait a while before selling. The best way to play the market is to invest in a diverse portfolio of cryptocurrencies. By spreading your money across several promising projects, you will reduce risk and ensure your ability to reap the benefits of growth with more digital currencies being developed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OgNasty",
      "created_time": "September 14, 2022, 05:46:34 PM",
      "body": "I guess maybe I overestimated the excitement level on this forum about this crypto event. It’s literally one of the biggest things to happen in crypto in some time, if not ever, and this forum is mostly silent about it. Crazy… Personally I think we’ll see a buy the rumor sell the news selloff, but I don’t think anyone can say for sure what will happen. We’ll know soon enough.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jossiel",
      "created_time": "September 14, 2022, 08:52:27 PM",
      "body": "With the market now, I don't think that we'll see the positive reaction of its price when the merge happens. It's still known that ETH also follows the path of bitcoin.And as what we can see right now, it doesn't look good for bitcoin so the whole market is.We'll see, it's just a few hours left until the merge finally happens but I don't think we'll see a buff.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "goaldigger",
      "created_time": "September 14, 2022, 09:36:04 PM",
      "body": "The market is down and Bitcoin is down most probably the effect of this merge will not be felt immediately and I believe the trend will be sideways for ETH since altcoins follows the trend of Bitcoin regardless if there’s a good update or none at all. ETH merge is still good though, we might see the pump soon but not on it’s release date. Many will sell to prepare them buying more at the bottom, while others are just holding for a hope that this will bring good effect in the market and many are thinking if there is a fork as well that’s why they have to hold. So by this analysis, sideways trend are more feasible.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kawetsriyanto",
      "created_time": "September 14, 2022, 11:19:29 PM",
      "body": "Quote from: jossiel on September 14, 2022, 08:52:27 PMWith the market now, I don't think that we'll see the positive reaction of its price when the merge happens. It's still known that ETH also follows the path of bitcoin.As far as I understand, ETH doesn't always follow the current trend of crypto market or stick on the path of Bitcoin only. ETH is the same as other altcoins, if there is good news related to an altcoin, the price can increase temporarily. Moreover, there are whales who take advantage by spreading positive signals and trying to pump the price for taking instant profits. So, it is surely not impossible to see a rise in ETH value although we are still in the bearish or red market. Why not, dude?  CMIIW",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "harizen",
      "created_time": "September 14, 2022, 11:34:46 PM",
      "body": "Quote from: kawetsriyanto on September 14, 2022, 11:19:29 PMAs far as I understand, ETH doesn't always follow the current trend of crypto market or stick on the path of Bitcoin only. You have a point there that ETH price doesn't always follow the current trend but likely, referring to the current trend, it seems that the upcoming merge doesn't really build a big hype. Looking at the 24h monitoring, the price is up just by around 4% which can be considered just a normal price increase. Should be more than that if there's a really big buzz about it. Approximately, 6 hrs to go before the merge and the price isn't even shaking. The ETH market will be temporarily halted on exchanges few hours before the merge and still, there's no bullish movement.As usual, the post-effect can only be seen later on. Regardless of what will happen, if people think that it's a good chance now to accumulate, then just do it without a doubt and hesitation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "makishart",
      "created_time": "September 14, 2022, 11:49:33 PM",
      "body": "Im sure nothing happened even when merge already done. That might be buy in the rumour and sell for the news. Bitcoin was dumping back to the 20k sub after some wallets sending big chunks of bitcoin to the market. Ethereum chart didn't even show if that will be going to be bullish. Im sure it will be doing sideways like bitcoin. I didn't even expect hype from merge will gonna happen. Ethereum is just following what bitcoin does. Merge has no impact to the price at all.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitterguy28",
      "created_time": "September 15, 2022, 03:06:23 AM",
      "body": "Quote from: OgNasty on September 14, 2022, 12:16:05 AMBe sure to vote which way you think it will go, even if you're not sure.  since this is posted here then I may also bring my understanding according to what I am reading from this merging and mostly it is negativity .the vote says it self that it will make the price either go down or sideways , the more I read from old timer here in forum and has a better understanding about crypto? this event will make the price even lower .",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OgNasty",
      "created_time": "September 15, 2022, 08:43:21 AM",
      "body": "Quote from: NdaMk on September 15, 2022, 08:14:23 AMAs at now the merger is complete and every one now has is eyes on ethereum. The celebration will continue today and may affect its price (might slight increase) but is it just an hype and can it move up without depending on bitcoin?My vote is after the merger celebration is gone today Ethereum will still depend on bitcoin's riseI'm sure there will be lots of talk about it tomorrow.  So far it seems like things went off without a hitch.  I'm guessing a lot of confused ETH miners are going to wake up tomorrow and wonder why their GPU fans aren't loudly spinning.  ETC is already seeing a massive hashrate increase and Ravencoin is seeing price/hashrate increases as well.  It will be an educational experience watching how different networks are effected by this.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rhomelmabini",
      "created_time": "September 15, 2022, 10:40:52 AM",
      "body": "Quote from: OgNasty on September 14, 2022, 12:16:05 AMAs we approach the Ethereum merge (approximately 27 hours away) I'm curious what the community thinks the price will do.  Do you think the merge will cause a lot of selling as people look to book profits, or will people buy up all they can to enjoy the higher staking %?  Who knows what will happen.  Maybe this community?Be sure to vote which way you think it will go, even if you're not sure.  I vote to go down further consider the hype will die out in the first term when it hits the market. More whales will surely manipulate the price and go hit the shopping spree as we're approaching the Merge, the market seems not align with how the merge is doing so I'm expecting that the merge will just not be the catalyst we're waiting for in this bear market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bananington",
      "created_time": "September 15, 2022, 12:58:34 PMLast edit: September 15, 2022, 01:15:24 PM by Bananington",
      "body": "Quote from: OgNasty on September 14, 2022, 12:16:05 AM or will people buy up all they can to enjoy the higher staking %?   The merger is an upgrade for Ethereum to improve its current status, hence it is expected that it will have a positive effect on the current price of Ethereum. An improved status for Ethereum network will mean that more person will develop and have more trust in it, this is good and can affect buying behavior positively.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "piebeyb",
      "created_time": "September 15, 2022, 01:26:55 PM",
      "body": "https://twitter.com/VitalikButerin/status/1570306185391378434after vitalik announced the merger was successful that's when the price of ETH still didn't really show serious results on the price, even here we see bitcoin dominating the price of other crypto markets, if there is an increase in the price of bitcoin of course the price of ETH will go up too, I just made a choice that it will go up in the near future not today or tomorrow, so just buy and hold on to it",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "onecall123",
      "created_time": "September 15, 2022, 02:06:37 PM",
      "body": "We are about to see a drop. Already, it has fallen. I'm not expecting it, but the entire market is about to crash, look at the daily candle lmao, very weak. I've not placed a bet in a while, but I've shorted every coin runup, such as the Cardano upgrade. The cryptocurrency market has been slow to offer real purchasing opportunities. As a result of the merger, ETH becomes deflationary. It does not mean it will appreciate in value because it is deflationary.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dimonstration",
      "created_time": "September 15, 2022, 02:16:57 PM",
      "body": "Quote from: Bananington on September 15, 2022, 12:58:34 PMQuote from: OgNasty on September 14, 2022, 12:16:05 AM or will people buy up all they can to enjoy the higher staking %?   The merger is an upgrade for Ethereum to improve its current status, hence it is expected that it will have a positive effect on the current price of Ethereum. An improved status for Ethereum network will mean that more person will develop and have more trust in it, this is good and can affect buying behavior positively.Completely not true. Even there’s an improvement on Ethereum blockchain doesn’t mean that the price will follow on positive side because we are still in the bear market and the reason why Ethereum just make a noise is because of this merge that is now over. I think crypto market is now ready to continue to the original trend before it will bullish again. I don’t see any major reason that will make traders panic buy Ethereum because the global economy especially the US is still in not good condition. Maybe in the future this good effect of Merger will pay off but not with bearish market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ethereumhunter",
      "created_time": "September 15, 2022, 03:05:40 PM",
      "body": "Until now, the price of ETH has not changed significantly so we can't say that the ETH update is a sign of the rise of the ETH price. Maybe it's because market conditions are experiencing a correction while the price of bitcoin is also experiencing another correction. But in the long term, the price of ETH will likely be able to increase even higher and maybe even more than the previous ATH. So while we still have time to buy ETH, we better use it before the time runs out and the price increases.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "doomloop",
      "created_time": "September 15, 2022, 07:18:07 PM",
      "body": "Quote from: OgNasty on September 15, 2022, 08:43:21 AMQuote from: NdaMk on September 15, 2022, 08:14:23 AMAs at now the merger is complete and every one now has is eyes on ethereum. The celebration will continue today and may affect its price (might slight increase) but is it just an hype and can it move up without depending on bitcoin?My vote is after the merger celebration is gone today Ethereum will still depend on bitcoin's riseI'm sure there will be lots of talk about it tomorrow.  So far it seems like things went off without a hitch.  I'm guessing a lot of confused ETH miners are going to wake up tomorrow and wonder why their GPU fans aren't loudly spinning.  ETC is already seeing a massive hashrate increase and Ravencoin is seeing price/hashrate increases as well.  It will be an educational experience watching how different networks are effected by this.Them as an experienced miner I think they already expected this but only those who are newb and aren't a fan of reading the news are going to be confused about what's happening with their eth miners, and maybe some of them will think it was broken already.That is right, they say that hash rates of eth are going to be transferred on other coins and ETC is going to take most of it and then followed by ravencoin as these two coins are also a popular altcoins which miners are mining. Not only educational but can also be interesting for a less experienced person to see how stuffs will work or will be affected such as the networks right after the merge is done.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OgNasty",
      "created_time": "September 15, 2022, 07:49:37 PM",
      "body": "I went ahead and locked the polling.  It looks like so far the community is right as the price has declined somewhere close to 10% since the merge.  The crazy part is that coins haven't even been unlocked or are tradable yet on most exchanges.  This little drop was purely speculation from people trying to buy the rumor and sell the news.  Once ETH2 coins start trading on exchanges and people can unlock them from Coinbase and the like, I suspect we'll see another big dip.  It will likely only last a few months though.  Now that ETH is deflationary, it seems like the value will go crazy at some point.  It's just a matter of how long until investment funds scoop up all the access liquidity.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "carlfebz2",
      "created_time": "September 15, 2022, 08:28:57 PM",
      "body": "Quote from: OgNasty on September 15, 2022, 07:49:37 PMI went ahead and locked the polling.  It looks like so far the community is right as the price has declined somewhere close to 10% since the merge.  The crazy part is that coins haven't even been unlocked or are tradable yet on most exchanges.  This little drop was purely speculation from people trying to buy the rumor and sell the news.  Once ETH2 coins start trading on exchanges and people can unlock them from Coinbase and the like, I suspect we'll see another big dip.  It will likely only last a few months though.  Now that ETH is deflationary, it seems like the value will go crazy at some point.  It's just a matter of how long until investment funds scoop up all the access liquidity.Nothing is assured but most likely this would really be ending up on positive situation in longer runs.I wasnt shocked about the current decline which i could say that it isnt really just that big.It might even go morelower as you said when things turns out for the trade on resume and this is what make things more harder to speculate or guess out because we cant able to determine on how deep would be the price or consideredto be bottom.For those who do have huge support for ETH specially now on the recent update or changes happened then accumulation on the current price isnt really that a bad idea.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "KennyR",
      "created_time": "September 15, 2022, 11:47:00 PM",
      "body": "Quote from: crzy on September 15, 2022, 09:57:34 PMThe update was done and as expected by many, the price will start to drop since many will sell against the news and with this update, you can’t feel it right away. We’ve seen the good pump already on a pre-update news, but now we are now seeing investors taking profit. We might not be able to see ETH to pump right away, the market is down though and it’s not easy to see huge pump on a bear market. This merge is still a huge update, price will start to pump eventually.The immediate move is bearish. In the long term it'll bounce gaining good momentum. For now everyone will tend to make profit at the top. This will lower the price and now it have come down to $1500. That's a big change to get ended. Slowly the progress can be experienced. Without any flaw things got over, if now something like true ethereum and false ethereum could've created and turns to be controversial.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}