{
  "id": "topic_5418101",
  "title": "mustaphabenisaf",
  "author": "mustaphabenisaf",
  "created_time": "October 23, 2022, 09:17:39 PMLast edit: October 23, 2022, 10:10:49 PM by mustaphabenisaf",
  "content": "Hi Bitsler block my account with any reasonsmy account username mustaphaproimage PM/Chat LogsChats with customer servicehttps://i.imgur.com/iOxqQCu.pnghttps://i.imgur.com/2dQEfYj.pnghttps://i.imgur.com/cXAIBX0.pnghttps://i.imgur.com/fxX3WTB.pnghttps://i.imgur.com/R0ivf0h.pnghttps://imgur.com/a/MfIXcMPBitlser Profilehttps://bitcointalk.org/index.php?action=profile;u=668840",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5418101",
  "comments": [
    {
      "author": "Baofeng",
      "created_time": "October 23, 2022, 09:32:14 PM",
      "body": "I haven't check all the chat logs but my question is,1, are you sure you didn't violate any of Bitsler ToS?2. you didn't exploit their system?In any case the best way to deal with it is to open a scam accusation against them in this board, https://bitcointalk.org/index.php?board=83.0You just have to follow the format.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mustaphabenisaf",
      "created_time": "October 23, 2022, 09:42:09 PM",
      "body": "ok thank you",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blockman",
      "created_time": "October 23, 2022, 09:54:00 PM",
      "body": "With all that I've read, all they say is that there's nothing they can do if your account has been blocked. And reading some domain emails of the replies.Can someone verify if that's really the domain email of bitsler's representative? Code:@bitsler.intercom-mail.comCare to explain more of the details and why is it there's market cipher trading? Did you deposit from there to bitsler?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mustaphabenisaf",
      "created_time": "October 23, 2022, 10:03:09 PM",
      "body": "before i'm deposit from binance accountand my account is lock without any reasons i want to unlock my account bitsler",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ScamViruS",
      "created_time": "October 23, 2022, 10:08:43 PM",
      "body": "This screenshot does not say anything about the main reason for blocking your account. It is also important to know why their administration made this decision, and whether you have engaged in activities that led to the account being blocked. Bitsler has this forum representative offline for a long time, so you will have to wait for this complaint to be resolved here as well. Because no information will be known until their representatives come online.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mustaphabenisaf",
      "created_time": "October 23, 2022, 10:16:20 PM",
      "body": "domain email of bitsler is reply me henry@bitsler.intercom-mail.com maeve@bitsler.intercom-mail.comand i don't anythink for banned my accounti want to unlock my account",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blockman",
      "created_time": "October 23, 2022, 10:22:53 PM",
      "body": "Quote from: mustaphabenisaf on October 23, 2022, 10:03:09 PMbefore i'm deposit from binance accountand my account is lock without any reasons i want to unlock my account bitslerThen post it to their main announcement thread (https://bitcointalk.org/index.php?topic=1268718.0) and maybe Baryom and his representatives might take a look into your account. I still don't know if that email domain is literally from them. As I've checked an email from them coming from one of their support. It should be like this.Code:@bitsler.com",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mustaphabenisaf",
      "created_time": "October 23, 2022, 10:33:19 PM",
      "body": "my i want to unlock my account and why locked my account",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yogee",
      "created_time": "October 23, 2022, 10:34:16 PM",
      "body": "Your account is still under investigation for some suspicious activity from the looks of it. What you should be asking the customer support or look for is how long does this investigation usually last according to their TOS. Surely they cannot just suspend your account indefinitely.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mustaphabenisaf",
      "created_time": "October 23, 2022, 10:42:44 PM",
      "body": "Chat pmhelloMaeve profileHello mustaphapro, thank you for contacting us!﻿﻿I'm Maeve. How can I help you today? i want to betyou're not allowed to betMaeve profileOne moment, please, while I check.okayMaeve profileApologies for the delay. Just a bit longer, sir.and what i do nowMaeve profileI will have to report this issue, so that our admins can review it.﻿﻿Once we have an update on this, we will contact you.﻿﻿In the meantime, is there anything else I can assist you with?i want now to claim some free Bitsler Coins Bitlser coins are locked on this account.7:52 pmMaeve profileYes, sir. Your account is fully restricted at the moment, which is why I will have to report this for our Admins to check...............Hello again mustaphapro,﻿﻿As explained, there's nothing we can do to change the decision. I am sorry.﻿﻿Kind regards,﻿HenryHenry    Henry from Bitsler",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mustaphabenisaf",
      "created_time": "October 23, 2022, 10:50:15 PM",
      "body": "support reply meSir, we have already explained everything to you.﻿﻿Your account is currently restricted and will remain so, until further notice.﻿﻿And I have already reported the issue, which will be reviewed as soon as possible.new image chathttps://i.imgur.com/TIRwRgg.pnghttps://i.imgur.com/TIRwRgg.png",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blockman",
      "created_time": "October 23, 2022, 10:50:47 PM",
      "body": "Quote from: mustaphabenisaf on October 23, 2022, 10:42:44 PMChat pm....Quote from: mustaphabenisaf on October 23, 2022, 10:50:15 PMsupport reply meSir, we have already explained everything to you.﻿﻿Your account is currently restricted and will remain so, until further notice.﻿﻿And I have already reported the issue, which will be reviewed as soon as possible.Then there's nothing else that you have to do right now but wait for their admins to check what has happened to your account. They'll check the activities that you have made on it, the deposits, the withdrawals, etc. And as said, you need to be patient and I urge you to be patient there's no one that can help you at this moment but only them so, do and accept what they say. If they say to wait, you have to wait then regardless of how badly you want to bet. For the meanwhile, as you wait and you really want to bet, bet on other casinos.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mustaphabenisaf",
      "created_time": "October 23, 2022, 10:56:22 PM",
      "body": "yes patient but other supporttell me Hello again mustaphapro,﻿﻿As explained, there's nothing we can do to change the decision. I am sorry.﻿﻿Kind regards,﻿HenryHenry    Henry from Bitslerimage https://i.imgur.com/R0ivf0h.pnghttps://i.imgur.com/fxX3WTB.png",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "qwertyup23",
      "created_time": "October 23, 2022, 11:07:39 PM",
      "body": "Quote from: Yogee on October 23, 2022, 10:34:16 PMYour account is still under investigation for some suspicious activity from the looks of it. What you should be asking the customer support or look for is how long does this investigation usually last according to their TOS. Surely they cannot just suspend your account indefinitely.A popular online gambling website such as bitsler will not ban any account without any proper investigation and information. They will definitely not risk ruining the years of building their trusted membership and reputation due to banning one (1) account only- so rest assured that the decision that they made was taken seriously.Are you sure that you did not violate any of their TOS agreement? Bear in mind that the use of VPNs in most gambling websites is prohibited and may be a cause on why your account is blocked. Like what they said, they do not have the information right now so best to do is to wait, OP.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yogee",
      "created_time": "October 23, 2022, 11:15:00 PM",
      "body": "Quote from: mustaphabenisaf on October 23, 2022, 10:56:22 PMyes patient...It doesn't look like you are.You keep saying or asking the same thing so no wonder the support will also respond in a similar manner. I'm surprised that you're still not temporarily restricted from sending them messages. Don't let it go to the point where even the support is fed up with your impatience.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "acroman08",
      "created_time": "October 24, 2022, 12:53:38 AM",
      "body": "it's kind of frustrating when they keep saying the same thing. I always wonder why casinos are so bad when it comes to communication when they are doing an investigation or something. anyway, it looks like you can't do anything other than wait for them to contact you again regarding the issue you are facing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitzizzix",
      "created_time": "October 24, 2022, 01:06:35 AM",
      "body": "Quote from: acroman08 on October 24, 2022, 12:53:38 AMit's kind of frustrating when they keep saying the same thing. I always wonder why casinos are so bad when it comes to communication when they are doing an investigation or something. anyway, it looks like you can't do anything other than wait for them to contact you again regarding the issue you are facing. I've also experienced poor communication with the operator but in the end the problem was resolved and most importantly had to be patient waiting for a response and also their time to solve the problem even though it was a bit long.The OP should be patient on this, because there is no choice and you can do nothing but be patient and have a good communication with him and they will definitely solve it by investigating the real issue as per their rules.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mustaphabenisaf",
      "created_time": "October 24, 2022, 01:45:06 AM",
      "body": "i'm wait for unlock my account",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nrcewker",
      "created_time": "October 24, 2022, 01:51:32 AM",
      "body": "Quote from: acroman08 on October 24, 2022, 12:53:38 AMit's kind of frustrating when they keep saying the same thing. I always wonder why casinos are so bad when it comes to communication when they are doing an investigation or something. anyway, it looks like you can't do anything other than wait for them to contact you again regarding the issue you are facing. Yes sometimes they behave like robots, and we think some bots are replying us back. They aren’t also should be kept liable as they are doing there task as they are taught.OP are you sure you haven’t violated any terms of service of the site? Or try to cheat the game or exploit the system? As Bitsler is a big casino, before blocking any account, they might have a strong reason behind it.Instead of their live support, have you tried mailing baryom about this issue? Back in years he was great and really active on these matters. He is the last hope who can help you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}