{
  "id": "topic_5467820",
  "title": "aleks86",
  "author": "aleks86",
  "created_time": "September 23, 2023, 02:34:59 PM",
  "content": "Played this casino, making deposits from 100 usd and much more. When i loosed all was good.One day i won more that 24000 usd and now casino do not withdraw money.Do not play here it is SCAM CASINOI already made topic on casino guru and i will copy it here when casino guru will open it. wait for monday!500play.com 500casino.com SCAM CASINOReal review about 500casino 500play",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5467820",
  "comments": [
    {
      "author": "JeromeTash",
      "created_time": "September 23, 2023, 02:52:43 PM",
      "body": "Sorry about the bad experience with the casino. Is 500casino the same as 500play.com?Please use this scam report format on your OP to further elaborate on how you were scammed and the details should include some form of evidence.This can help members know how the scam was carried out and can be used for future referencesI am seeing different domain names, and it's a little confusing1. 500play.com2. csgo500.com3. 500.casino",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "aleks86",
      "created_time": "September 23, 2023, 03:02:53 PM",
      "body": "Like i understand this all is one casinohttps://500play.com/ is 500 casino",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ScamViruS",
      "created_time": "September 23, 2023, 05:29:19 PM",
      "body": "Sorry you are in this situation. You have made a serious complaint about this casino, and it is not unusual that we have seen many such cases where a gambler who wins big faces various problems when he tries to withdraw the winning funds. If you have more evidence please add it to the OP so that it will be easier for community members to understand exactly what kind of problem you are having.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "acroman08",
      "created_time": "September 23, 2023, 05:46:46 PM",
      "body": "I am guessing they are restricting your withdrawal because they are performing an investigation. I just did a quick read on their ToS, and it was mentioned there that gamblers might be subjected to a thorough investigation in case of a large win($24k is a big amount of money) and the investigation can last for hours or days. In the meantime, I'd say remain in contact with their support and get as much information as possible about the issue, but if you already did that, I'd suggest posting the conversation you had with their support here in the forum to let the members see what has been discussed and the progression of your case and it also proves that you are actually experiencing the issue.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ralle14",
      "created_time": "September 23, 2023, 08:19:30 PM",
      "body": "After reading your post on their ANN thread, I assume your winnings triggered their KYC because a few months ago, someone asked if there was KYC, and they said it only happens if you go above their monthly limits.Maybe $20k was their limit for non-verified users and you barely went over with your winnings.Quote from: UserU on June 10, 2023, 07:30:54 AMFor KYC, we usually request for it if a non-verified user's withdrawals exceed the monthly threshold and that's for cryptocurrency. If he or she is withdrawing CSGO/CS2 (Global Offensive) skins, that's seldom necessary.However like other casinos, exceptions may apply if someone decides to be hanky-panky. Rest assured the KYC is only to cross-check against malicious activities and nothing else.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "UserU",
      "created_time": "September 24, 2023, 04:09:48 AMLast edit: September 24, 2023, 04:20:40 AM by UserU",
      "body": "aleks86,Have you contacted Support? Providing some screenshots would be useful as well.Quote from: aleks86 on September 23, 2023, 02:22:11 PMCasino will waste time and will decline all your withdrawsCan you elaborate more on this? Is your account KYC-verified? And your 500 user ID?Like some have mentioned, accounts might be subjected to limitations and background checks to comply with the AML laws.Quote from: JeromeTash on September 23, 2023, 02:52:43 PMSorry about the bad experience with the casino. Is 500casino the same as 500play.com?Please use this scam report format on your OP to further elaborate on how you were scammed and the details should include some form of evidence.This can help members know how the scam was carried out and can be used for future referencesI am seeing different domain names, and it's a little confusing1. 500play.com2. csgo500.com3. 500.casinoThe site has multiple mirror links, as not all are accessible in every region.You may refer to the list of official ones @ https://500mirror.com/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Free Market Capitalist",
      "created_time": "September 24, 2023, 07:44:36 AM",
      "body": "Quote from: acroman08 on September 23, 2023, 05:46:46 PMI am guessing they are restricting your withdrawal because they are performing an investigation. I just did a quick read on their ToS, and it was mentioned there that gamblers might be subjected to a thorough investigation in case of a large win($24k is a big amount of money) and the investigation can last for hours or days. In the meantime, I'd say remain in contact with their support and get as much information as possible about the issue, but if you already did that, I'd suggest posting the conversation you had with their support here in the forum to let the members see what has been discussed and the progression of your case and it also proves that you are actually experiencing the issue.But in that case, shouldn't casino support have contacted the OP to tell him that they are conducting an investigation into the matter? I think that would be the logical thing to do, and it doesn't seem that they have said anything to him, although perhaps with the anger he has, they have contacted him and he hasn't said so.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "September 24, 2023, 10:05:58 AMLast edit: September 25, 2023, 11:10:14 AM by hugeblack",
      "body": "Is this the service you are referring to ----> 500 CASINO 🎰 €750K POWER WEEKENDS ⚽️ WHEEL, CASINO, SPORTS, PLINKO BATTLE?they have @UserU ANN contact him if the support team does not answer.I have no experience with gambling sites, so if there is another account they have here, please add it.Contact the support team and post what happened according to these format[1]. If they do not respond, we can ask their accounts here.[1] https://bitcointalk.org/index.php?topic=260073.0",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mahdirakib",
      "created_time": "September 24, 2023, 01:35:49 PM",
      "body": "Quote from: Poker Player on September 24, 2023, 07:44:36 AMBut in that case, shouldn't casino support have contacted the OP to tell him that they are conducting an investigation into the matter?OP has said in his other post that the support has told him to wait, which means he is aware of the ongoing investigation on his account. We don't know what is the actual issue here as OP hasn't clarified everything. But as acroman08 has said above, the casino team (or the games provider) is investigating on his bets if the delay isn't related to KYC verification.Quote from: https://500play.com/terms-of-serviceIn case of a large or abnormal win, players sometimes can be subjected to a thorough investigation by the games provider in order to confirm the validity of the win and compliance with the Terms of Service. This is handled on a case by case basis and can take from a few hours to a few days. During this time, the player is not able to initiate any withdrawals and is fully responsible for self excluding/refraining from playing in order to keep the balance untouched.In the above case, OP should control his gambling habits to not loss his account balance now. His complaint is already live on Casino Guru: 500 Casino - Player’s winnings are confiscated. UserU has also replied above. So, there could be a solution of the issue if the OP cooperates by providing the evidences.Quote from: hugeblack on September 24, 2023, 10:05:58 AM~ so if there is another account they have here, please add it.The owner of 500 casino has an account in Bitcointalk, but he isn't active in the forum. Perhaps, we don't need him in this case as UserU has already stepped in here.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lothian",
      "created_time": "September 29, 2023, 05:55:36 PM",
      "body": "Is there any update on this case? Im looking to play here but do not want to experience issues if winning big.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pmalek",
      "created_time": "September 30, 2023, 12:12:14 PM",
      "body": "Quote from: lothian on September 29, 2023, 05:55:36 PMIs there any update on this case? Im looking to play here but do not want to experience issues if winning big. aleks86 never returned to submit any evidence, neither in this thread or on the one on Casino Guru. The topic on Casino Guru was created on the same day as this one. The support agent asked OP if his account is verified and if the casino told him the reason why the withdrawal was declined and he has chosen to remain silent. The player has about 4 hours left to reply to Casino Guru, otherwise they will probably close the case. I doubt we will hear back from OP.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "holydarkness",
      "created_time": "September 30, 2023, 01:18:04 PM",
      "body": "Quote from: lothian on September 29, 2023, 05:55:36 PMIs there any update on this case? Im looking to play here but do not want to experience issues if winning big.So far, they have no case on AG and two from four of open dispute cases against them on CG [soon will be three with OP's case] were closed. Their rating on both sites are also quite high; 8.46 casino rating and 9.5 players rating on AG, and 7.5 on CG. Those are the facts as per when this post is made. Whether you'll have issues in the future or not, that's completely depends on your gambling activity. If you don't give them any reason to make any issue with you, I don't think any casino would want to start an issue.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TheSuspect500",
      "created_time": "October 30, 2023, 03:05:43 AM",
      "body": "Quote from: hugeblack on September 24, 2023, 10:05:58 AMThe owner of 500 casino has an account in Bitcointalk, but he isn't active in the forum. Perhaps, we don't need him in this case as UserU has already stepped in here.The user was unlocked after the investigation concluded and he was able to withdraw everything.Unfortunately, this is a necessary thing sometimes and the user was informed of that from the beginning. I don’t know why he chose to do this, but he does talk badly about Casinos pretty often in his CG account.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jannn",
      "created_time": "October 30, 2023, 02:43:22 PM",
      "body": "Quote from: TheSuspect500 on October 30, 2023, 03:05:43 AMQuote from: hugeblack on September 24, 2023, 10:05:58 AMThe owner of 500 casino has an account in Bitcointalk, but he isn't active in the forum. Perhaps, we don't need him in this case as UserU has already stepped in here.The user was unlocked after the investigation concluded and he was able to withdraw everything.Unfortunately, this is a necessary thing sometimes and the user was informed of that from the beginning. I don’t know why he chose to do this, but he does talk badly about Casinos pretty often in his CG account.This is fucking BULLSHIT.As OP said: Typical behavior of ALL this casinos.When user is LOSING THOUSANDS it's = SUPER FINEand no KYC is triggered, or anything, but if we HUSTLE them and WIN BIG at some point then they come with ALL SORTS of fucking bullshits  to PAY OUR FUCKING MONEY $.Typical behavior of ALL THIS CASINOS this days.They are just a bunch of nasty scammers, nothing else.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "holydarkness",
      "created_time": "October 30, 2023, 06:15:29 PM",
      "body": "Quote from: Jannn on October 30, 2023, 02:43:22 PMThis is fucking BULLSHIT.As OP said: Typical behavior of ALL this casinos.When user is LOSING THOUSANDS it's = SUPER FINEand no KYC is triggered, or anything, but if we HUSTLE them and WIN BIG at some point then they come with ALL SORTS of fucking bullshits  to PAY OUR FUCKING MONEY $.Typical behavior of ALL THIS CASINOS this days.They are just a bunch of nasty scammers, nothing else.The bullshit you're referring to, is a clause on their ToS saying large and abnormal winnings are subjected to investigation. If there's nothing wrong and the players play fair, the funds will very likely be released.The typical behavior you're referring to, is an attempt by casinos to balance customer's privacy and govt. intervention. They only ask for KYC when situation requires because they won't scare people by KYC when not necessary, while KYC is one of the things required for legal compliance.The bunch of nasty scammers you're referring to, is OP being impatient with the process. He literally only need to wait, and once processed and passed, he didn't bother clarifying things.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}