{
  "id": "topic_5463800",
  "title": "Question:",
  "author": "robelneo",
  "created_time": "August 19, 2023, 12:15:16 PM",
  "content": "Matagal na pinag debatehan itong Maharlika fund at ngayun at naipasana ang implementingrules at regulations ay ilalabas pa lamang sa darating na September sa mga hindi pa gaanong nakakaalam ng Maharlika fund kung ano ito Quote The Maharlika Investment Corp. (MIC) will be created to serve as the investment body responsible for the overall governance and management of the Fund and is expected to be fully operational by end-2024.It will identify financially and commercially viable infrastructure projects to invest in and will formulate investment strategies covering emerging megatrends, such as environment, social and governance, digitalization, and health care.QuoteThe MIC will be governed by a Board of Directors with nine members chaired by the Secretary of Finance.Ayon kay Rafael Padilla, the co-founder ng BlockDevs Asia at isa mga popular na lawyer sa Crypto space maaring isama ng Maharlika investment Corp., ang Bitcoin dahil wala namang legal restrictions para sa Central bank na gawin ito.Ayon kay Atty Rafael Padilla Quote“It is possible, as long as i-approve kasi mayroong provision doon na nagsasabing ‘other investments,’ ini-enumerate kung saan pwedeng mag-invest tapos mayroong ‘catch all.’ Basically, basta in-approve ng board, pwedeng mag-invest; which means, in my mind, presents the opportunity na if the Maharlika Fund would want to, they can also invest in Bitcoin,” he pointed out.Investing in Bitcoin with Maharlika Fund? Crypto Lawyer Weighs InKung kayo ang tatanungin payag ba kayo na gamitin ang government funds sa pag invest ng Bitcoin?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5463800",
  "comments": [
    {
      "author": "PX-Z",
      "created_time": "August 19, 2023, 05:13:10 PM",
      "body": "May existing discussion thread[1] na about this topic. So better na i-lock nalang to avoid  ns ma split ang replies about sa discussionm[1] https://bitcointalk.org/index.php?topic=5463690.0",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}