{
  "id": "topic_5457891",
  "title": "OmegaStarScream",
  "author": "OmegaStarScream",
  "created_time": "June 28, 2023, 02:08:27 PMLast edit: June 28, 2023, 02:25:00 PM by OmegaStarScream",
  "content": "كما كنت قد ذكرت في المنتدى الانجليزي منذ قليل، لقد انضمت منصة كوكوين لبقية المنصات التي تطلب توثيق الحسابات، هذا التغيير سوف يكون بداية من الخامس عشر من الشهر المقبل.السحوبات لن تتأثر و يمكن للمستخدمين سحب أموالهم متى أرادو، لكن من الأفضل القيام بهذا الأمر الان ان كانت عندكم أموال في المنصة، لتفادي المشاكل في المستقبل في حال كان هنالك تغيير لسياستهم.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5457891",
  "comments": [
    {
      "author": "albon",
      "created_time": "June 28, 2023, 02:42:57 PM",
      "body": "Quote from: OmegaStarScream on June 28, 2023, 02:08:27 PMكما كنت قد ذكرت في المنتدى الانجليزي منذ قليل، لقد انضمت منصة كوكوين لبقية المنصات التي تطلب توثيق الحسابات، هذا التغيير سوف يكون بداية من الخامس عشر من الشهر المقبل.السحوبات لن تتأثر و يمكن للمستخدمين سحب متى أرادو، لكن من الأفضل القيام بهذا الأمر الان ان كانت عندكم أموال في المنصة، خوفا من أن يكون تغيير في المستقبل سبقتنى أخي أوميجا، كنت على وشك نشر موضوع حوله فالقسم، يعطيك العافية ومشكور على هذا الإعلان الهام، كل عام وأنتم بخيرصراحة ما فعلته منصة كوكوين التي تتمتع بشعبية كبيرة بين منصات التبادل المركزية في السوق أمر طبيعي وكان من المفترض أن يحدث ذلك بعد كل هذه الصراعات التنظيمية من قبل الحكومات الأمريكية على منصات التبادل المركزية الرائدة في السوق وحتى تواصل خدماتها بشكل طبيعي دون انقطاع وتكون متوافقة مع متطلبات ولوائح المنظمين الماليين لحصولها على رخصة في جميع أنحاء العالم، حيث تعد إجراءات أعرف عميلك التي يجب أن يجتازها العملاء مهمة من أجل مكافحة غسل الأموال وتمويل الإرهاب والجرائم المالية ذات الصلة ومن أجل حماية أصول المستخدمين.وأضيف إلى أن الأشخاص الذين سجلوا قبل يوم 15 ولم يجتازوا إجراءات أعرف عميلك فإنهم سيكونون غير قادرين على الإيداع بالمنصة أو استخدام أي من ميزات كوكوين التالية:أوامر بيع التداول الفوري وإستراداد الأرباح من كوكوين Earn وخفض الرافعة المالية في التداول الآجل واسترداد صندوق ETF للمتداول.وجدت توصيات من بعض الخبراء حول أن يقوم المستخدمون الذين لا يريدون توثيق حساباتهم على كوكوين أن ينقلوا أصولهم إلى CoinEx ويقولون أنها لا تتطلب توثيقاً غير أنها تقبل وثائق الدول العربية، فهل منكم من جربها أو تعامل معها مسبقاً, وهل منصة CoinEx تعتبر بديل جيد لكوكوين, أم أنهم يرغبون في الحصول على نسبة مالية من عوائد الإحالات؟",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kavelj22",
      "created_time": "June 28, 2023, 02:52:29 PM",
      "body": "Quote from: OmegaStarScream on June 28, 2023, 02:08:27 PMكما كنت قد ذكرت في المنتدى الانجليزي منذ قليل، لقد انضمت منصة كوكوين لبقية المنصات التي تطلب توثيق الحسابات، هذا التغيير سوف يكون بداية من الخامس عشر من الشهر المقبل.السحوبات لن تتأثر و يمكن للمستخدمين سحب أموالهم متى أرادو، لكن من الأفضل القيام بهذا الأمر الان ان كانت عندكم أموال في المنصة، لتفادي المشاكل في المستقبل في حال كان هنالك تغيير لسياستهم. لقد كان هذا متوقعا من البداية. لا و بل انه توقع حتمي.لقد كنت أكرر هذا دوما. لا تصدق اي منصة مركزية تدعي انها ستقدم خدمات بدون توثيق هوية المستخدمين لأن هذا غير ممكن عمليا الا  ان كان فريقها مخفيا و لا احد يعرف شيئا عن اماكن خوادمها و لا من اين تدير عملياتها و هو ما لا يمكن أن يحصل أبدا في هذا النوع من الخدمات القائم أساسا على فكرة المركزية. تلك المنصات تقدم خدماتها دون الحاجة لاثبات هوية في بداية اطلاقها و طالما الظروف تسمح بذلك و لكن لا شيء يضمن انها ستستمر في نفس المنهج و هذا نجده تم الاقرار به في شروط الاستخدام التي يوافق عليها اي مستعمل للموقع. يعني لا يمكن الاعتراض على شيء و من الجيد ان كوكوين تسمح باجراء السحوبات و لا تفرض هذه الشروط على من يودون المغادرة.في الوطن العربي، منصة كوكوين هي من اكثر المنصات استخداما بعد بينانس. هذه الاجراءات لا اعتقد ان تؤثر على عدد المستخدمين بما انه ليس هناك بدائل. هذا محزن و لكنه صحيح Sad but True.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yhiaali3",
      "created_time": "June 29, 2023, 01:48:56 AM",
      "body": "Quote from: albon on June 28, 2023, 02:42:57 PMوجدت توصيات من بعض الخبراء حول أن يقوم المستخدمون الذين لا يريدون توثيق حساباتهم على كوكوين أن ينقلوا أصولهم إلى CoinEx ويقولون أنها لا تتطلب توثيقاً غير أنها تقبل وثائق الدول العربية، فهل منكم من جربها أو تعامل معها مسبقاً, وهل منصة CoinEx تعتبر بديل جيد لكوكوين, أم أنهم يرغبون في الحصول على نسبة مالية من عوائد الإحالات؟أنا مسجل في CoinEx منذ حوالي خمس سنوات تقريبا أي منذ بداية افتتاحها، بصراحة المنصة جيدة جدا وموثوقة وفيها حجم تداول وسيولة جيدة نوعا ما وتقدم خدمات عالية لاتقل عن كوكوين وأتوقع أنها البديل الأفضل في الوقت الحالي، كما أنها لا تطلب توثيق الحساب (في الوقت الحالي طبعا) ويمكن سحب لحد 10 آلاف دولار في اليوم بدون توثيق.كما أنها تقبل الوثائق العربية للتوثيق ولاتحظر أي دولة عربية (بما فيها سورية) وهذا أمر مهم بالنسبة لي، يعني بصراحة بالنسبة لي شخصيا CoinEx هي الخيار الأفضل، لكن طبعا أخي أنا واثق أنها مسألة وقت فقط قبل أن تحذو حذو أخواتها المنصات السابقة وتطالب ب KYC. هذا أمر طبيعي في ظل القوانين الصارمة التي تفرضها جميع الحكومات تقريبا لتنظيم سوق كريبتو.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "khaled0111",
      "created_time": "June 29, 2023, 10:37:39 PM",
      "body": "^^للأمانة لم استعمل هذه المنصة من قبل و أتساءل ان كانت مرخصة. لأنها ان كانت تمتلك رخصة للعمل فاستغرب ان تدعم دولة سوريا!بهذه الحالة عاجلا او اجلا ستواجه المنصة عديد المشاكل القانونية و الضغوطات من كل حدب و صوب.ربما تكون حلا مؤقتا بالنسبة لمن لا يرغبون في توثيق حساباتهم او من هم من دول محظورة، لكن يجب الحذر عند استعمالها و عدم تخزين مبالغ كبيرة فيها فكما ذكرت اخي كل هذه الميزات التي تقدمها هي ميزات مؤقتة و على اغلب الظن انها لن تتواصل لفترة طويلة مثل ما حدث مع غيرها.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ulven",
      "created_time": "July 04, 2023, 09:10:01 PM",
      "body": "Quote from: OmegaStarScream on June 28, 2023, 02:08:27 PMكما كنت قد ذكرت في المنتدى الانجليزي منذ قليل، لقد انضمت منصة كوكوين لبقية المنصات التي تطلب توثيق الحسابات، هذا التغيير سوف يكون بداية من الخامس عشر من الشهر المقبل.السحوبات لن تتأثر و يمكن للمستخدمين سحب أموالهم متى أرادو، لكن من الأفضل القيام بهذا الأمر الان ان كانت عندكم أموال في المنصة، لتفادي المشاكل في المستقبل في حال كان هنالك تغيير لسياستهم. تلقيت أيضاً إشعار توثيق الحساب أنا حالياً أشتغل عليها، و لكن الغريب في الأمر أن المنصة أصبحت مقتنعة لكي تكون تحت القانون المعمول به في أغلب دول المؤيدة للتشفير. هل كان هذا بسبب لجنة SEC مع العلم أن المنصة لا تملك ترخيص العمل في الولايات المتحدة الأمريكية. أم أنها تود أن تغزو السوق الأمريكي من خلال تطبيقها القانون التنظيمي في البلد؟",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OmegaStarScream",
      "created_time": "July 06, 2023, 06:53:08 AM",
      "body": "Quote from: Ulven on July 04, 2023, 09:10:01 PMتلقيت أيضاً إشعار توثيق الحساب أنا حالياً أشتغل عليها، و لكن الغريب في الأمر أن المنصة أصبحت مقتنعة لكي تكون تحت القانون المعمول به في أغلب دول المؤيدة للتشفير. هل كان هذا بسبب لجنة SEC مع العلم أن المنصة لا تملك ترخيص العمل في الولايات المتحدة الأمريكية. أم أنها تود أن تغزو السوق الأمريكي من خلال تطبيقها القانون التنظيمي في البلد؟من الصعب معرفة السبب، لكن أنا أفترض أن للأمر علاقة بطموحات المنصة، لقد رأينا منذ أسابيع قليلة فقط منصة Bybit و OKX تقوم بنفس الشئ و حتى و ان لم أرى أي مقالات تخص كوكوين، أنا أفترض أن للمنصة خطة للتوسع الى هونج كونغ، دبي/أبو ظبي الخ. و للقيام بهذا، يجب عليها الامتثال لقوانين هذه الأماكن..",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kavelj22",
      "created_time": "July 08, 2023, 11:30:15 PM",
      "body": "Quote from: Ulven on July 04, 2023, 09:10:01 PMQuote from: OmegaStarScream on June 28, 2023, 02:08:27 PMكما كنت قد ذكرت في المنتدى الانجليزي منذ قليل، لقد انضمت منصة كوكوين لبقية المنصات التي تطلب توثيق الحسابات، هذا التغيير سوف يكون بداية من الخامس عشر من الشهر المقبل.السحوبات لن تتأثر و يمكن للمستخدمين سحب أموالهم متى أرادو، لكن من الأفضل القيام بهذا الأمر الان ان كانت عندكم أموال في المنصة، لتفادي المشاكل في المستقبل في حال كان هنالك تغيير لسياستهم. تلقيت أيضاً إشعار توثيق الحساب أنا حالياً أشتغل عليها، و لكن الغريب في الأمر أن المنصة أصبحت مقتنعة لكي تكون تحت القانون المعمول به في أغلب دول المؤيدة للتشفير. هل كان هذا بسبب لجنة SEC مع العلم أن المنصة لا تملك ترخيص العمل في الولايات المتحدة الأمريكية. أم أنها تود أن تغزو السوق الأمريكي من خلال تطبيقها القانون التنظيمي في البلد؟أستبعد ايضا ان تكون غاية المنصة هو مجرد الدخول للسوق الامريكي و اعتقد انها اجراءات تم فرضها للحفاظ على موقعها كمنصة عالمية لتجنب التتبعات مهما كان مصدرها. تراخيص العمل من اي دولة تستوجب فرض اجراءات التثبت على المستخدمين و المنصة قد لا تستطيع فرض تلك الاجراءات بشكل جزئي اذا طلب منها ذلك في دولة واحدة من الدول التي تدعمها خصوصا ان كانت تلك الدولة تدعم او شرعت في دعم العملات المشفرة.الفرضية ايضا قائمة ان يكون هذا من قبيل الاجراءات الاحترازية لتجنب التتبعات من الهيئات الرقابية بما انه يمكن تتبعها في اي وقت بحجة ان مستخدميها منخرطون في انشطة مشبوهة دون ان تطلب منهم المنصة تثبيت الهوية و بالتالي فيمكن اعتبارها انها تدعمهم.الأمر ليس بجدبد و لا مستحدث و اكاد اكون متأكدا ان كل المستخدمين سينصاعون لهذا الاجراء لانه كما دوما ليس هناك حلول بديلة.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ulven",
      "created_time": "July 09, 2023, 07:55:40 PM",
      "body": "Quote from: OmegaStarScream on July 06, 2023, 06:53:08 AMQuote from: Ulven on July 04, 2023, 09:10:01 PMتلقيت أيضاً إشعار توثيق الحساب أنا حالياً أشتغل عليها، و لكن الغريب في الأمر أن المنصة أصبحت مقتنعة لكي تكون تحت القانون المعمول به في أغلب دول المؤيدة للتشفير. هل كان هذا بسبب لجنة SEC مع العلم أن المنصة لا تملك ترخيص العمل في الولايات المتحدة الأمريكية. أم أنها تود أن تغزو السوق الأمريكي من خلال تطبيقها القانون التنظيمي في البلد؟من الصعب معرفة السبب، لكن أنا أفترض أن للأمر علاقة بطموحات المنصة، لقد رأينا منذ أسابيع قليلة فقط منصة Bybit و OKX تقوم بنفس الشئ و حتى و ان لم أرى أي مقالات تخص كوكوين، أنا أفترض أن للمنصة خطة للتوسع الى هونج كونغ، دبي/أبو ظبي الخ. و للقيام بهذا، يجب عليها الامتثال لقوانين هذه الأماكن..فعلاً السبب لا زال غامض إلا أن أغلب المنصات بدأت أيضاً بفرض نفس الأسلوب و هو الإمتثال للقوانين التنظيمية للحكومات المختلفة حول العالم.و أعتقد أيضا أن الإمتثال للقوانين التنظيمية سيساعد على توسع المنصات المركزية على ما يبدو الإشتغال في المنصات المرخصة من الحكومات أفضل من التوجه نحو منصات مركزية غير مرخصة.Quote from: Kavelj22 on July 08, 2023, 11:30:15 PMQuote from: Ulven on July 04, 2023, 09:10:01 PMQuote from: OmegaStarScream on June 28, 2023, 02:08:27 PM….فعلا هناك توسع كبير عرفته بعض المنصات مثل بينانص و كوان باس و المزيد لهذا أعتقد أن أغلب المنصات المركزية ستأخذ نفس المسار الذي نهجته المنصة السالفة الذكر، ربما هذا التحديث الذي أطلقته منصة كوكواين سيساعدها في غزو الأسواق لمناطق الجغرافية المختلفة مما يزيدها في كسب المزيد من العملاء و هذا سينتج عنه زيادة حجم السيولة و هذا ما أتوقعه",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "khaled0111",
      "created_time": "July 12, 2023, 11:26:59 PM",
      "body": "Quote from: Ulven on July 09, 2023, 07:55:40 PMو أعتقد أيضا أن الإمتثال للقوانين التنظيمية سيساعد على توسع المنصات المركزية على ما يبدو الإشتغال في المنصات المرخصة من الحكومات أفضل من التوجه نحو منصات مركزية غير مرخصة.حسب قناعتي، اي منصة او خدمة مركزية يجب أن تكون مرخصة و تعمل في ظل قوانين واضحة و منظمة لعملها. لا اشجع على استخدام المنصات المركزية لكن في ظل غياب الحلول فإن هذا يعتبر الحل الوحيد لضمان حقوق المستخدمين او على الاقل ضمان جزء من حقوقه. فوجود جهاز رقابة يمكن الالتقاء اليه في حال حدوث خلاف افضل من عدمه و كلما كانت الجهة المانحة للرخصة أقوى و لديها قوانين صارمة كل ما كان ذلك افضل حتى و ان اختلفنا مع بعض تلك القوانين.طبعا يبقى البديل اللامركزية هو الأفضل، ان وجد.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}