{
  "id": "topic_5474467",
  "title": "Mia Chloe",
  "author": "Mia Chloe",
  "created_time": "November 17, 2023, 04:07:20 PMLast edit: November 17, 2023, 04:37:13 PM by Mia Chloe",
  "content": "Most people especially kids have heard about Bitcoin or crypto currency without really knowing what it is about or how it works.recently I came across a particular video which I found online.it was an animated video giving a very brief and basic knowledge about the concept of Bitcoin. It talked about why Bitcoin was created, how Blockchain works ,as well as mining.I saw it as a good approach to teaching young ones or even newbies about Bitcoin.Without saying much here is a link to the video.https://www.facebook.com/reel/3050082035123654?mibextid=Hn3EexMF1WhlYZLE",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5474467",
  "comments": [
    {
      "author": "Churchillvv",
      "created_time": "November 17, 2023, 05:30:29 PM",
      "body": "I acknowledge the fact that no knowledge is a waste but bordering kids with Bitcoin knowledge is completely irrelevant, at some age let children be children teaching them about bitcoin could be beneficial at some point but where they can't put this knowledge use for the time being then it should be set aside till when it is due. When it comes to newbies it's a basic beginners knowledge that is shared it's quite appreciated",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ajiz138",
      "created_time": "November 17, 2023, 05:40:44 PM",
      "body": "Yes there have been threads before see this - The World's First Kids Cartoon about BitcoinActually this is quite a good introduction for children through the animation made by Tuttle Twins on Youtube, maybe this is useful for you for children who want to understand it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cantsay",
      "created_time": "November 17, 2023, 05:50:58 PM",
      "body": "Quote from: ajiz138 on November 17, 2023, 05:40:44 PMYes there have been threads before see this - The World's First Kids Cartoon about BitcoinActually this is quite a good introduction for children through the animation made by Tuttle Twins on Youtube, maybe this is useful for you for children who want to understand it.I don’t think there are the same; the one in the Op is a vide meanwhile the one you linked in your post took me to a thread with a link to download an application.Fun fact: throughout the video the figure who played satoshi in the video didn’t reveal his face once, it’s either there’s an obstruction or it’s cut off from the screen.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "knowngunman",
      "created_time": "November 17, 2023, 06:01:47 PM",
      "body": "Quote from: Churchillvv on November 17, 2023, 05:30:29 PMI acknowledge the fact that no knowledge is a waste but bordering kids with Bitcoin knowledge is completely irrelevant, at some age let children be children teaching them about bitcoin could be beneficial at some point but where they can't put this knowledge use for the time being then it should be set aside till when it is due. When it comes to newbies it's a basic beginners knowledge that is shared it's quite appreciatedTeaching children about bitcoin may have its advantages but I'm also not too comfortable with that idea. Children should be allow to pick interest on their own and choose whether to learn about it or not. The video actually makes sense but it's passing a wrong message to children with that statement \"you mentioned criminals twice\" labeling government as criminals. Government has its lapses but giving children such impressions at their early age is not a good idea.The part that caught my attention in the video is the inflation of Bitcoin. Bitcoin can actually not be inflated in the same way that traditional fiat currencies can be because Bitcoin has a fixed supply with a maximum of 21 million coins that can ever be created and once all 21 million coins have been created, no more will be created. The supply will not increase to meet that demand that would lead to inflation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "electronicash",
      "created_time": "November 17, 2023, 06:11:53 PM",
      "body": "my eyes are now wide open. it's all because of corruption.  idk, kids will ask more about this and start distrusting your government. for now, I'll just teach my kid to purchase and how to make his wallet secure from compromise. nothing else to show yet because it seems like it could branch somewhere else instead of learning how BTC works. but i could also leave those for aantonop to explain. he is more entertaining to listen to than me.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Honyek",
      "created_time": "November 17, 2023, 06:34:41 PM",
      "body": "l think that is a nice video and introduction of bitcoin, especially for the newbies. Although the knowledge of bitcoin is very vital to everyone, children of very low age may  not require to know everything pertaining to bitcoin.  we actually have to know what exactly that we are teaching them and their age to avoid corruption or malpractices at such tender age. .",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ajiz138",
      "created_time": "November 17, 2023, 06:46:22 PM",
      "body": "Quote from: Cantsay on November 17, 2023, 05:50:58 PMQuote from: ajiz138 on November 17, 2023, 05:40:44 PMYes there have been threads before see this - The World's First Kids Cartoon about BitcoinActually this is quite a good introduction for children through the animation made by Tuttle Twins on Youtube, maybe this is useful for you for children who want to understand it.I don’t think there are the same; the one in the Op is a vide meanwhile the one you linked in your post took me to a thread with a link to download an application.You can click on the link in the thread, which leads to the 58-minute Youtube video.Quote from: Dickiy on May 16, 2023, 08:15:15 AMA few hours ago I received a notification from the YouTube channel Tuttle Twins Quote from: Cantsay on November 17, 2023, 05:50:58 PMFun fact: throughout the video the figure who played satoshi in the video didn’t reveal his face once, it’s either there’s an obstruction or it’s cut off from the screen. Satoshi is a mysterious person so naturally his face is not shown, but I forgot because I've been watching this cartoon for a long time. LolForgot to recall.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cantsay",
      "created_time": "November 17, 2023, 06:52:14 PM",
      "body": "Quote from: ajiz138 on November 17, 2023, 06:46:22 PMYou can click on the link in the thread, which leads to the 58-minute Youtube video.My bad, I didn’t see the link in the body of the post the first time I went to the thread I thought you were referring to the one at the bottom of the thread cause that one led me to AppleStore to download an app called “Angel Studios” while the one at the top led me to the channel you were referring to, and that’s were the clip the Op shared was cut from.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "terrific",
      "created_time": "November 17, 2023, 06:56:19 PM",
      "body": "Many videos like that are existing on the web about introduction to Bitcoin, the basics of it and the tutorials that are simplified and more interesting through animation. I have watched a few of them and the ones with greater visuals are the ones that catches the attention of the many. But the more we have like these videos, the better for everyone's reference and resource to know more about Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kentrolla",
      "created_time": "November 17, 2023, 09:10:56 PM",
      "body": "Why do we even teach kids about Bitcoin at the tender age? I don't think this would be a smart move as it would literally divert their mind because it will make them a rebel against the fiat system which. I think this should be taught at higher secondary level education or during graduation. I would say kids mindset might be more aligned towards bitcoin and crypto if we teach them about it and they will not be interested in the fiat system which is equally important in order to sustain.Rather, we should be teaching them about more real life skills and technical skills to be a successful person.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nwada001",
      "created_time": "November 17, 2023, 09:35:37 PM",
      "body": "Now days we don't even need to teach children much of a thing again regarding bitcoin as educational materials have been made readily available on the internet, which they can just run into. Using their iPad and browsing the internet saves parents stress, and if the children find the information useful, they can walk up to their parent, their older siblings, or anyone close to them to ask for more knowledge and explanation. That way, it will be easier for one to know where they will focus their efforts explaining to them. Quote from: ajiz138 on November 17, 2023, 05:40:44 PMYes there have been threads before see this - The World's First Kids Cartoon about BitcoinWhen I saw this thread, I just knew I had read about something of this nature, which got me engaged in the discussion, but checking the link you provided, I still got convinced the more that there are actually a lot of bitcoin animation videos on this forum because the one you shared is just the first time I came across it, but the first one I saw was also a YouTube video, which I can't seem to find a fine link to that thread again. Maybe I didn't search dipper.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "November 17, 2023, 09:36:57 PM",
      "body": "most adult people dont even know how credit cards function behind the plastic. they just learn how to swipe/use itmost adult people dont even know or even understand or even taught about the economics of credit/debt",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Baofeng",
      "created_time": "November 17, 2023, 09:50:20 PM",
      "body": "Quote from: kentrolla on November 17, 2023, 09:10:56 PMWhy do we even teach kids about Bitcoin at the tender age? I don't think this would be a smart move as it would literally divert their mind because it will make them a rebel against the fiat system which. I think this should be taught at higher secondary level education or during graduation. I would say kids mindset might be more aligned towards bitcoin and crypto if we teach them about it and they will not be interested in the fiat system which is equally important in order to sustain.Rather, we should be teaching them about more real life skills and technical skills to be a successful person. As much as this doesn't sound good, but I do agree here. Yes, definitely we can teach our kids about bitcoin or crypto or how to save and invest in general. But at a tender age, let they enjoy their life to the fullest. Who knows, maybe what you instil in their mind will come into fruition someday. But for me, I let my kids know about bitcoin, but not forcing them to learn about it. I want them to grow and set their own goals in life, just saying.If they decided in their own to go in crypto then good I can mentor them. But if not and they want to purse their own dreams and jobs and what kind of education they want, they I will still support them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SatoPrincess",
      "created_time": "November 17, 2023, 09:54:11 PMLast edit: November 17, 2023, 10:16:28 PM by SatoPrincess",
      "body": "I do not support the opinion that Bitcoin is only a topic for adults, if Bitcoin is to become the currency of the future, isn’t it our responsibility to prepare those who own that future for it? Btw I just watched the video and I’m impressed with how they explained the concept of Bitcoin in layman’s terms. Kudos to the creator for making a Bitcoin educational video that’s not boring but contains some humor. So far the reel has 841k views on Facebook, that means it’s going viral. I went through the comment section, and ofcourse there were a bunch of scam accounts promoting one exchange or the other.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitcoinPanther",
      "created_time": "November 17, 2023, 09:58:44 PM",
      "body": "It is really good to let children know about Bitcoin but I think making them involved in the Bitcoin economy in such early age makes no sense.  First kids has no capability to finance themselves, they are still reliant to their parents and should be enjoying their child hood.  Let them get interested on Bitcoin industry by themselves, I believe the right time for them to participate or get involved in Bitcoin will come one day but as a kid, let them enjoy being a kid.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Alpha Marine",
      "created_time": "November 17, 2023, 10:44:19 PM",
      "body": "Before a person can really appreciate Bitcoin, he has to understand how the traditional system works, he has to know that the system is built not to favor him. In other words, he has to understand the money system and know why it's good for him to look for an alternative. The person has to understand the limitations of the traditional money system and how Bitcoin solves most of those limitations and sadly, I don't think kids can understand these. Even a lot of adults in Bitcoin don't understand this and that is why Bitcoin is underutilized to an extent. Most people only care about the investment side of Bitcoin and that's not the only too good to be true feature of Bitcoin. As much as I like kids to know about Bitcoin, I feel there are certain knowledge they ought to have before they really grasp the innovation of Bitcoin. I like how the face of the person playing the creator of Bitcoin in the video was not revealed. I guess that's trying to portray the fact that nobody actually knows who he/they is/are.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mia Chloe",
      "created_time": "November 17, 2023, 10:51:49 PM",
      "body": "Quote from: SatoPrincess on November 17, 2023, 09:54:11 PMI do not support the opinion that Bitcoin is only a topic for adults, if Bitcoin is to become the currency of the future, isn’t it our responsibility to prepare those who own that future for it? Btw I just watched the video and I’m impressed with how they explained the concept of Bitcoin in layman’s terms. Kudos to the creator for making a Bitcoin educational video that’s not boring but contains some humor. So far the reel has 841k views on Facebook, that means it’s going viral. I went through the comment section, and ofcourse there were a bunch of scam accounts promoting one exchange or the other. Wow SatoPrincess it has been a long while since I saw your posts on this forum nice to actually see you reply here.Actually the cartoon was quite interesting due to the fact that it still had some humor and funny parts. Teaching kids about Bitcoin is not a bad idea but they simply should not be forced to learn about it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "n00ber",
      "created_time": "November 17, 2023, 11:14:27 PM",
      "body": "Quote from: Churchillvv on November 17, 2023, 05:30:29 PMI acknowledge the fact that no knowledge is a waste but bordering kids with Bitcoin knowledge is completely irrelevant, at some age let children be children teaching them about bitcoin could be beneficial at some point but where they can't put this knowledge use for the time being then it should be set aside till when it is due. When it comes to newbies it's a basic beginners knowledge that is shared it's quite appreciatedI agree, I don't know what age the OP is talking about children but if he was talking about children under 10 I would object too. I am the one with 2 children and I personally witnessed raising them and watching them grow up day by day. Therefore, I feel that teaching bitcoin to children at this age is a waste and useless thing. Let them have a beautiful childhood, don't force or force them to do things they don't like. Bitcoin is just money, an investment, they can learn at any time when they grow up. To become rich, it is not necessary to invest in bitcoin early, and those who do not invest in bitcoin do not necessarily become poor.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "panganib999",
      "created_time": "November 17, 2023, 11:47:05 PM",
      "body": "We’re talking about teenagers right? Cause I don’t think there’s merit to teaching kids about bitcointhis early without letting them know about other financial fundamentals like financial literacy. Yes you teach them about making money but you didn’t teach them how to save and keep it for rainy days? That’s going to be a massive problem in the future my friend.It’s much better teaching them about the most important stuff first, later down the line upon self-discovery they’d happen upon bitcoin and cryptocurrency for sure, let them have their own adventures and figure shit out on their oen. No knowledge is waste but knowledge without responsibilities is deadly.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}