{
  "id": "topic_5419600",
  "title": "Fullbear2222",
  "author": "Fullbear2222",
  "created_time": "November 06, 2022, 10:58:54 AM",
  "content": "Right now in world people have problems to pay bills and Same time Property prices not falling and rent prices not either becouse of greed of the property owners.Many people need Property still owners don't want to give for cheap so temporary it Will create quick pmp becouse demand is higher then supply but then it will dmp becouse many Property owners need to lower prices to rent out for people so atleast someone gona pay their bills.Same goes for used cars market.Off course nobody don't want to admit that we have Crisis the property owners still try to rent out with maximum prices and try to sell with maximum prices.But from here banks don't add anymore leverage and housing market and all assets.The greed is just keeping all this illusion up like Titanic those greedy ones Will try to eat best meals and drinks at the Resto while others allready exiting.The pmp is over it's done and now whales unload their assets and Will dmp soon suddenly If you stay too Late you gona be bag holder and Property prices will not turn to Same not before 5 years maybe it can take even longer. We don't live by real rules ur sills and real knowledge to provide value to society IS not prioroty.We live by numbers world and mercy of central Banks numbers up and down rates up rates down.Funny thing is that central Banks told to us they will crash hard the economy they will dmp becouse for every pmp the dmp must follow after.Anyways we been told they will crash the economy and companies will lay of workers even more.They said they gona do full crash of our economy and still people think we going up people been told by the central bank the economy will be crashed hard to protect value of fiat currency.So we been told and still people don't belive that it shows how foolish are the most of people.But Im happy to see whole world Will look like detroit city of us.Becouse everthing will be cheap and i can walk happy smile in face becouse money will have value again.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5419600",
  "comments": [
    {
      "author": "DVlog",
      "created_time": "November 06, 2022, 11:26:20 AM",
      "body": "If you have a property you will sell it low or you will try to get as high as you can? Property price depends on many things like its position, demands, quality, etc. When transportation price increase food price increase too. This also initiates price hikes of other commodities and assets too. Recent global fuel price hikes cause price hikes in every other sector and real estate is no exception.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "palle11",
      "created_time": "November 06, 2022, 12:50:06 PM",
      "body": "Quote from: Fullbear2222 on November 06, 2022, 10:58:54 AMRight now in world people have problems to pay bills and Same time Property prices not falling and rent prices not either becouse of greed of the property owners.Many people need Property still owners don't want to give for cheap so temporary it Will create quick pmp becouse demand is higher then supply but then it will dmp becouse many Property owners need to lower prices to rent out for people so atleast someone gona pay their bills.This is a serious matter that the government need to look into regarding building of houses and rentage. Many landlords do overhike of renting of there houses with the excuse of cost of materials. Building project is not a cheap project with the constant increase of building materials but the owners don't consider that some building have covered their expenses in renting and lease over the years, they keep increasing rentage saying that as the cost of materials is constantly increasing, the increase rent collected will cushion the effect of repairs. They have a case which they are defending but the government has to regulate the housing and accommodate aspect of the society.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fullbear2222",
      "created_time": "November 06, 2022, 02:02:00 PM",
      "body": "Quote from: palle11 on November 06, 2022, 12:50:06 PMQuote from: Fullbear2222 on November 06, 2022, 10:58:54 AMRight now in world people have problems to pay bills and Same time Property prices not falling and rent prices not either becouse of greed of the property owners.Many people need Property still owners don't want to give for cheap so temporary it Will create quick pmp becouse demand is higher then supply but then it will dmp becouse many Property owners need to lower prices to rent out for people so atleast someone gona pay their bills.This is a serious matter that the government need to look into regarding building of houses and rentage. Many landlords do overhike of renting of there houses with the excuse of cost of materials. Building project is not a cheap project with the constant increase of building materials but the owners don't consider that some building have covered their expenses in renting and lease over the years, they keep increasing rentage saying that as the cost of materials is constantly increasing, the increase rent collected will cushion the effect of repairs. They have a case which they are defending but the government has to regulate the housing and accommodate aspect of the society.The logical step here is the tax rich ones.Many can argue about that but rich people did get with their own hard work many of them but they forget one thing it was Also the resources from others.Life works logical way universal laws will influence over everything.Soomer or later when society well beeing as one will be questioned then everybody eyes and attention will be pointed towards to rich people not to super rich ones becouse they are out of the tax zones and out poor people reach most likely.If there is general crisis people start to put their attentions to rich ones who got just little better life then poor ones.Also the social democratic and wealth sharing equally ideas will come to the light becouse If there is more people who have nothing they will support those ones who want to share wealth equally its hard to capitalists mindset to get votes.The biggest drive of capitalism is more money i have then less work i have to do people don't want to work so If they have money and assets they try their best to not get poor so If they own assets they will off course ask highest price as possible.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "November 06, 2022, 03:07:42 PMLast edit: November 06, 2022, 03:42:25 PM by hugeblack",
      "body": "I do not expect that we will witness a major crisis in real estate, as happened in 2008, but real estate will be one of the factors that will make the crisis worse.The world is facing great economic challenges, including but not limited to the electronic chip crisis, interest rate, unemployment and others, all of which will push individuals to create liquidity and stop giving exaggerated prices.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "palle11",
      "created_time": "November 06, 2022, 05:28:09 PM",
      "body": "Quote from: hugeblack on November 06, 2022, 03:07:42 PMI do not expect that we will witness a major crisis in real estate, as happened in 2008, but real estate will be one of the factors that will make the crisis worse.The world is facing great economic challenges, including but not limited to the electronic chip crisis, interest rate, unemployment and others, all of which will push individuals to create liquidity and stop giving exaggerated prices.We have to be prepared for total recession in all sector of our lives in the area that is related to finance. The effect of covid-19 leading to the economic reality this time around is so biting severely. The real estate is seriously affected by interest rate, people who get loans to invest in the real estate business get at a high rate because the rate keeps climbing, nobody want to invest and not to benefit. This is worst where there are no price control from buying of building materials to labour force to renting or mortgage.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coupable",
      "created_time": "November 06, 2022, 05:52:02 PM",
      "body": "This happens with unstable currencies when the number of token holders is limited and most of the liquidity of the currency is owned by a very limited number of holders. As soon as one of them becomes greedy, he begins to buy the currency quickly in large quantities, which will raise the price in a short time so that the same person returns to sell what he bought. This will push the price down and spread a state of panic that makes everyone offer their currencies for sale, so the price will collapse. Some cases of greed lead to disasters, and this is one of the manifestations of the dangers of investing in new digital currencies.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rruchi man",
      "created_time": "November 06, 2022, 07:07:19 PM",
      "body": "Quote from: Fullbear2222 on November 06, 2022, 10:58:54 AMRight now in world people have problems to pay bills and Same time Property prices not falling and rent prices not either because of greed of the property owners.Immediately I read this offensive line about property owners being greedy I didn't bother going through the remaining write up because I know it may be filled with a lot of emotional one sided talk. Property owners who you have called greedy have also been affected by the economic hardship, they have to adjust the prices of the property to ensure that they stay in value, that is why they say investment in landed property or property is a good investment that appreciate with time, it appreciates by property owners adjusting the prices of the properties.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gozie51",
      "created_time": "November 06, 2022, 07:48:41 PM",
      "body": "Quote from: Rruchi man on November 06, 2022, 07:07:19 PMQuote from: Fullbear2222 on November 06, 2022, 10:58:54 AMRight now in world people have problems to pay bills and Same time Property prices not falling and rent prices not either because of greed of the property owners.Immediately I read this offensive line about property owners being greedy I didn't bother going through the remaining write up because I know it may be filled with a lot of emotional one sided talk. Property owners who you have called greedy have also been affected by the economic hardship, they have to adjust the prices of the property to ensure that they stay in value, that is why they say investment in landed property or property is a good investment that appreciate with time, it appreciates by property owners adjusting the prices of the properties. Land owners or property owners are part of the system like what @ Rruchi man is trying to say, they don't exist in isolation so we don't have to blame them if properties go higher. Investing in landed properties are surely one area you have security for financial growth and stability. Price of land usually appreciate even when there is less inflation but with the current inflation rate, you don't expect anything less.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husires",
      "created_time": "November 06, 2022, 08:45:29 PM",
      "body": "The rising cost of loans is one of the repercussions of the Fed's monetary tightening policies that will be painful in the short time.These policies will pose a problem in the long run if the Fed continues to raise interest rates to harmful levels such as 1%, and many may default.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "darkangel11",
      "created_time": "November 06, 2022, 09:26:36 PM",
      "body": "Quote from: Fullbear2222 on November 06, 2022, 02:02:00 PMThe logical step here is the tax rich ones.Many can argue about that but rich people did get with their own hard work many of them but they forget one thing it was Also the resources from others.So a socialist approach... Why not remove the majority of taxes and also cut the number of public services covered by the state? The rich already pay the highest taxes because the system is percentage-based. You might not be aware but someone who earns a a million euro in the EU, pays about 300k in income taxes + another 200k in VAT and you want to tax them even more? When you exceed 50% of taxation people usually migrate and you lose your 500k a year. Instead of getting another 100k from them you get nothing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "adaseb",
      "created_time": "November 07, 2022, 03:59:07 AM",
      "body": "I think he is referring to those which were flipping properties between 2020 and 2022. People would basically buy a property, do little work and sell it for 20% more.Housing market was hot and every month the property values were going up. So it seemed to be risk free. It was until interest rates started to go up and now many are holding the bag.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fullbear2222",
      "created_time": "November 07, 2022, 10:28:30 AM",
      "body": "Quote from: adaseb on November 07, 2022, 03:59:07 AMI think he is referring to those which were flipping properties between 2020 and 2022. People would basically buy a property, do little work and sell it for 20% more.Housing market was hot and every month the property values were going up. So it seemed to be risk free. It was until interest rates started to go up and now many are holding the bag. It's optimistic prediction housing 50%-60% crash",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}