{
  "id": "topic_5481312",
  "title": "Ravichnadra",
  "author": "Ravichnadra",
  "created_time": "January 12, 2024, 09:43:16 AM",
  "content": "Hey Crypto Crew,So, I've been pondering the whole \"Should Your Business Accept Bitcoin?\" conundrum. 🤔 Some say it's the future, while others think it's just a fad. What's your take on this crypto rollercoaster? Share your thoughts on whether diving into the Bitcoin sea is a savvy move or a shipwreck waiting to happen. Personally, I'm torn between embracing the digital gold rush and sticking to the good ol' cash. Let's chat about the pros, cons, and the downright unpredictable nature of this crypto beast. Are you ready to sail the Bitcoin waves or prefer to anchor in traditional waters? Drop your two satoshis below and let's hash it out! ⚓🚀",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5481312",
  "comments": [
    {
      "author": "criptoevangelista",
      "created_time": "January 12, 2024, 10:57:41 AM",
      "body": "I had a small business selling games and video games in my city, I promoted it and implemented one of the payment methods would be cryptocurrencies: bitcoin and tether. It gave discounts to anyone who used it.And incredible as it may seem, there was zero adherence to this payment method. Nobody has ever used cryptocurrencies to buy anything, most people don't even know how to use them, very sad and in short: we still have a lot of work to do, especially in educating and guiding people close to us.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Upgrade00",
      "created_time": "January 12, 2024, 11:11:54 AM",
      "body": "Quote from: Ravichnadra on January 12, 2024, 09:43:16 AMSome say it's the future, while others think it's just a fad. What's your take on this crypto rollercoaster? Share your thoughts on whether diving into the Bitcoin sea is a savvy move or a shipwreck waiting to happen. This is a much different question from the one in your topic title. Bitcoin can be the future but is not right as a means of payment for your business.15 years down the road, I'll say fiat is more of the shipwreck waiting to happen, but it's still better for SMEs as a means of payment than BTC.Quote from: Ravichnadra on January 12, 2024, 09:43:16 AMPersonally, I'm torn between embracing the digital gold rush and sticking to the good ol' cash. Do your personal analysis for your business;• Is it an online or offline business?• Is there a demand for an alternative means of payment?• Is there any limitation using your current payment method?• If you accept Bitcoin, do you plan to hodl it or convert to fiat immediately?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DeathAngel",
      "created_time": "January 12, 2024, 11:24:05 AM",
      "body": "Accepting Bitcoin as a means of payment in your business can have advantages. It provides a way to attract a cool, young tech savvy customer base that prefer using crypto. It allows fast & cheap cross border transactions because there are no intermediaries involved. To accept Bitcoin can increase your brand's visibility & appeal. There are a few drawbacks. Bitcoin's volatility can pose a risk as its value can fluctuate a lot. It might require additional time & effort to set up and manage a Bitcoin payment system. The limited acceptance of Bitcoin as a payment method may restrict its usefulness for some customers.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "angrybirdy",
      "created_time": "January 12, 2024, 11:44:03 AM",
      "body": "Quote from: Ravichnadra on January 12, 2024, 09:43:16 AMHey Crypto Crew,So, I've been pondering the whole \"Should Your Business Accept Bitcoin?\" conundrum. 🤔 Some say it's the future, while others think it's just a fad. What's your take on this crypto rollercoaster? Share your thoughts on whether diving into the Bitcoin sea is a savvy move or a shipwreck waiting to happen. Personally, I'm torn between embracing the digital gold rush and sticking to the good ol' cash. Let's chat about the pros, cons, and the downright unpredictable nature of this crypto beast. Are you ready to sail the Bitcoin waves or prefer to anchor in traditional waters? Drop your two satoshis below and let's hash it out! ⚓🚀I will consider bitcoin payment in the future, wherein I think Most people are engaging in this digital money but for now? I will stick to the traditional way of payment. I know that it depends to a nature of the business but come to think if it, Not all person has a bitcoin or aware about it especiamly those elders so We should consider them especially that they are your costumers.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "snowpega",
      "created_time": "January 12, 2024, 11:45:04 AM",
      "body": "In my opinion Dear, It can be a good step to accept Bitcoin For that business as it has many advantages like we can easily send and receive our business payments across borders and On the other hand, we also know that El Salvador Country has already accepted Bitcoin as their legal currency they have a massive amount of Bitcoin in their reservation for their economy stability which gives us a fair signal that their maybe alot of business who already have accepted Bitcoin for their business.A couple of months ago, I was watching a video on social media in which kids were paying their bills off using Bitcoin in stoshies which also leads many other businessmen to accept Bitcoin for their business through the video. We all know that Bitcoin is now the most strongest currency for now and give it a fair time it will show us the real potential after this bull run. After this event, many of other disbelievers starts believing in Bitcoin  Just give it time",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yazher",
      "created_time": "January 12, 2024, 11:51:18 AM",
      "body": "If I had some business in my city, I would have accepted bitcoins for the customer's payment and might gonna give them some discount for bitcoin promotions as well. But take note, this is not something you can just do lightly because it will always depend on what country you are residing in and what kind of people are there because sometimes when you are found with the government, others will envy you and they will look for any flaw that will gonna makes your business crash. so before doing anything like it, you should consider checking everything including the people if they are familiar with bitcoins or not or should you make a survey first.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "btc78",
      "created_time": "January 12, 2024, 11:52:22 AM",
      "body": "It would honestly depend on the business owner himself and his goalsIs his goal to make the most profit possible or to spread the use of bitcoin even further? What is the nature of the business? Does he want to acquire bitcoin or fiat money? It might seem unfair that by paying in bitcoin, the price of the goods and services to be sold will also depend on the price of bitcoin but if your goal is to have bitcoin i think it is ok to accept bitcoin at least you already have something to hold",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DanWalker",
      "created_time": "January 12, 2024, 11:58:47 AM",
      "body": "I think this depends on many factors such as is bitcoin legal in your country? Do people in your area use bitcoin regularly?...You should learn, evaluate all relevant factors and make decisions for your business. If accepting bitcoin for businesses is beneficial, why would you ignore it?After all, bitcoin is a currency and can be a means of payment, and adding more payment methods to businesses will benefit us, not harm us. Why do we ignore them? There are some people complaining about accepting bitcoin for their business and it doesn't bring any benefits, but that doesn't mean it will happen to you, too. It's better to experience it yourself and don't listen to them. Just like many people lose money investing in bitcoin, but that doesn't mean everyone will fail like them, a lot of people are making a lot of money investing in bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Victorik",
      "created_time": "January 12, 2024, 11:59:03 AM",
      "body": "Quote from: criptoevangelista on January 12, 2024, 10:57:41 AMI had a small business selling games and video games in my city, I promoted it and implemented one of the payment methods would be cryptocurrencies: bitcoin and tether. It gave discounts to anyone who used it.And incredible as it may seem, there was zero adherence to this payment method. Nobody has ever used cryptocurrencies to buy anything, most people don't even know how to use them, very sad and in short: we still have a lot of work to do, especially in educating and guiding people close to us.That's the issue. The Bitcoin literacy is still very low despite the promotion. There are still a lot of people who do not know anything about Bitcoin, let alone how to use it.The few that know about it might not want to transact using Bitcoin considering the transaction fee they will incure in the process, so they rather pay with fiat.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PytagoraZ",
      "created_time": "January 12, 2024, 12:47:18 PM",
      "body": "Quote from: Ravichnadra on January 12, 2024, 09:43:16 AMHey Crypto Crew,So, I've been pondering the whole \"Should Your Business Accept Bitcoin?\" conundrum. 🤔 Some say it's the future, while others think it's just a fad. What's your take on this crypto rollercoaster? Share your thoughts on whether diving into the Bitcoin sea is a savvy move or a shipwreck waiting to happen. Personally, I'm torn between embracing the digital gold rush and sticking to the good ol' cash. Let's chat about the pros, cons, and the downright unpredictable nature of this crypto beast. Are you ready to sail the Bitcoin waves or prefer to anchor in traditional waters? Drop your two satoshis below and let's hash it out! ⚓🚀First, this depends on your country, whether your country legalizes bitcoin as a transaction currency or not, if your country legalizes it then you can try it. You can use bitcoin as an alternative payment currency. If you only use bitcoin, then it is a careless action because bitcoin is still taboo and not yet familiar as a payment currency.Second, it depends on what business you do. If your business provides cheap goods then using Bitcoin is less effective, transaction costs become expensive. Better business activities in the digital sector that allow your consumers to buy from across borders, using bitcoin will make transaction costs cheaper and more effective than other currencies.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Miles2006",
      "created_time": "January 12, 2024, 12:59:46 PM",
      "body": "Accepting bitcoin as a means of payment is a thing of choice and you can decide to accept bitcoin but the issue here is no one will love to pay with bitcoin or they don't even know about bitcoin, the area you find yourself matters a lot and where is your business located?, what do you even sell cause I don't think petty traders will get involved in bitcoin payment.Have only seen such in the mall and supermarket and it's still very rare seeing someone paying with bitcoin. A competitor can accept bitcoin as a means of payment due to competition among marketers but the consumers will not pay with bitcoin, even some crypto enthusiast will see such and choose to pay with fiat.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AicecreaME",
      "created_time": "January 12, 2024, 01:15:04 PM",
      "body": "Quote from: criptoevangelista on January 12, 2024, 10:57:41 AMI had a small business selling games and video games in my city, I promoted it and implemented one of the payment methods would be cryptocurrencies: bitcoin and tether. It gave discounts to anyone who used it.And incredible as it may seem, there was zero adherence to this payment method. Nobody has ever used cryptocurrencies to buy anything, most people don't even know how to use them, very sad and in short: we still have a lot of work to do, especially in educating and guiding people close to us.Exactly. Though it looks cool seeing outside your store saying \"Bitcoin payment available here\". In my opinion, even if people who are buying in your shop has bitcoin, they would not use it to pay something that could be buy using fiat, even me, as much as possible, if it could be buy using fiat, I'll use fiat because bitcoin is an investment for me.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CageMabok",
      "created_time": "January 12, 2024, 01:21:30 PM",
      "body": "Quote from: Ravichnadra on January 12, 2024, 09:43:16 AMHey Crypto Crew,So, I've been pondering the whole \"Should Your Business Accept Bitcoin?\" conundrum. 🤔 Some say it's the future, while others think it's just a fad. What's your take on this crypto rollercoaster? Share your thoughts on whether diving into the Bitcoin sea is a savvy move or a shipwreck waiting to happen. Personally, I'm torn between embracing the digital gold rush and sticking to the good ol' cash. Let's chat about the pros, cons, and the downright unpredictable nature of this crypto beast. Are you ready to sail the Bitcoin waves or prefer to anchor in traditional waters? Drop your two satoshis below and let's hash it out! ⚓🚀In general, Bitcoin is quite well known and is also liked by many groups nowadays, where these groups also often use cash in their respective lives. So what makes some people feel confused about accepting Bitcoin in their own lives or in their own business is because they are afraid of losses, even though that is only when they sell at low prices.Meanwhile, for those who are sure to save it well enough, they will never experience losses or sink like you said, because everyone can see the reality that exists through Bitcoin itself from the first ATH to the next ATH within a period of once every four years. And for the puzzle that is in your head, I don't think there is any need to debate the pros and cons as long as you can still use cash while holding Bitcoin indefinitely and being distracted by the presence of Bitcoin into your own life.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "criptoevangelista",
      "created_time": "January 12, 2024, 01:21:48 PM",
      "body": "Quote from: AicecreaME on January 12, 2024, 01:15:04 PMQuote from: criptoevangelista on January 12, 2024, 10:57:41 AMI had a small business selling games and video games in my city, I promoted it and implemented one of the payment methods would be cryptocurrencies: bitcoin and tether. It gave discounts to anyone who used it.And incredible as it may seem, there was zero adherence to this payment method. Nobody has ever used cryptocurrencies to buy anything, most people don't even know how to use them, very sad and in short: we still have a lot of work to do, especially in educating and guiding people close to us.Exactly. Though it looks cool seeing outside your store saying \"Bitcoin payment available here\". In my opinion, even if people who are buying in your shop has bitcoin, they would not use it to pay something that could be buy using fiat, even me, as much as possible, if it could be buy using fiat, I'll use fiat because bitcoin is an investment for me. We also have this issue, if you have fiat and bitcoin you will always prefer to pay with fiat, as it is the currency that depreciates the most over time.Although our job is to propagate and encourage the use of bitcoin in everyday life, we are faced with one of its main fundamentals, which is capital protection, and this ultimately discourages people from spending it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitzizzix",
      "created_time": "January 12, 2024, 01:34:53 PM",
      "body": "If you want your business to accept Bitcoin payments, it all depends on whether your country is Bitcoin-friendly or not. And also are there many Bitcoin users around you and are there several merchants or shops that use Bitcoin payments?And what I mentioned will support you to accept Bitcoin as payment for your business, and if we talk about the future of Bitcoin. In my opinion, Bitcoin will be much more useful, apart from many people accepting Bitcoin as a means of payment, Bitcoin will also become very expensive.So the best choice now is how and in whatever way we can accumulate Bitcoin for the future, and besides the profits that can be obtained and the benefits of Bitcoin are also very large in the future.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fuguebtc",
      "created_time": "January 12, 2024, 01:56:44 PM",
      "body": "There have been many threads talking about this issue and many people have also accepted bitcoin for their business.  But the problem that bitcoin is facing is that the transaction fees are very high and I don't think it will be fixed any time soon . I'm not against accepting bitcoin for businesses , but we can't deny that bitcoin transaction fees are a big problem that needs to be solved first. Therefore, you need to consider carefully before making the final decision . Additionally , you need to consider other factors as everyone mentioned above , such as the legality and popularity of bitcoin in your country .",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fesxx",
      "created_time": "January 12, 2024, 02:04:56 PM",
      "body": "Quote from: fuguebtc on January 12, 2024, 01:56:44 PMThere have been many threads talking about this issue and many people have also accepted bitcoin for their business.  But the problem that bitcoin is facing is that the transaction fees are very high and I don't think it will be fixed any time soon . I'm not against accepting bitcoin for businesses , but we can't deny that bitcoin transaction fees are a big problem that needs to be solved first. Therefore, you need to consider carefully before making the final decision . Additionally , you need to consider other factors as everyone mentioned above , such as the legality and popularity of bitcoin in your country .I completely agree with you, but I would also like to add that due to the volatility of bitcoin, it would not be right to use it in B2B sales. Since B2B has a time difference between invoicing and payment",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sim_card",
      "created_time": "January 12, 2024, 02:19:15 PM",
      "body": "The high transaction fee currently, have discouraged a lot of businesses that accepts bitcoin to stop accepting bitcoin. If you must accept bitcoin in your business, it should be an alternative payment method and Fiat should be the first because we don't know if the high transaction fee will last for long and I believe that if it didn't last for long, there is high probability that it will still happen in future, until bitcoin devs look for a way to get rid of ordinals from the blockchain. Accepting bitcoin is an advantage because you will have more customers than businesses that accepts only fiat because customers can use any payment method of their choice. You can also keep your profit in bitcoin after payment and convert the capital to fiat due to the volatile nature of bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kotajikikox",
      "created_time": "January 12, 2024, 02:27:41 PM",
      "body": "Quote from: Ravichnadra on January 12, 2024, 09:43:16 AMHey Crypto Crew,So, I've been pondering the whole \"Should Your Business Accept Bitcoin?\" conundrum. 🤔 Some say it's the future, while others think it's just a fad. What's your take on this crypto rollercoaster? Share your thoughts on whether diving into the Bitcoin sea is a savvy move or a shipwreck waiting to happen. Personally, I'm torn between embracing the digital gold rush and sticking to the good ol' cash. Let's chat about the pros, cons, and the downright unpredictable nature of this crypto beast. Are you ready to sail the Bitcoin waves or prefer to anchor in traditional waters? Drop your two satoshis below and let's hash it out! ⚓🚀I am still not working for that now because my business is too small to be affected of fluctuations and and how high the fees like now.But if one time that I will accept something from crypto then this will not only for bitcoin but I will accept altcoins also because this is the safest and fair for every businesses and yes I am for good business and not just an investor.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}