{
  "id": "topic_5488429",
  "title": "Altcoiner007",
  "author": "Altcoiner007",
  "created_time": "March 11, 2024, 12:18:06 PM",
  "content": "Many times I've missed the opportunity of buying Bitcoin dip because of media sentiments. In 2022, when Bitcoin was $17,168.57, which would have been a good time to build a larger holding, some claimed Bitcoin was on the road to irrelevance others said it was dead. I could understand and agree with them because the value of bitcoin had peaked at USD 69,000 in November 2021 before falling to USD 17,000 as at the mid-June 2022. After that time, the value had fluctuated around USD 20,000. And the same media claimed it was an artificially induced last gasp before the road to irrelevance. It seemed true as the FTX  bust had sent the bitcoin price to well below USD 16,000. Later in 2023, Forbes headline crushed the confidence of many Bitcoin enthusiasts, saying if ETFs managed by asset managers are too successful, they will completely destroy bitcoin. Other sentiments like Bitcoin has failed on the promise to be a global decentralised digital currency and is still hardly used for legitimate transfers and that the approval of an ETF doesn’t change the fact that Bitcoin is not suitable as means of payment or as an investment. Yet today, I saw the image above and it suddenly got the question into my head, Is Bitcoin still dead? We've all seen how Bitcoin has weathered through all the critics and FUD to breaking above USD 70,000 steadily since the beginning of 2024. There's all indication it's headed toward USD 100,000. What are you all thinking about these feet. Should those who didn't buy all along dare to jump in or would you recommend going for ALTs as the rising of Bitcoin often drag along the altcoins. Let me hear your thoughts?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5488429",
  "comments": [
    {
      "author": "Jawhead999",
      "created_time": "March 11, 2024, 12:31:09 PM",
      "body": "When was exactly Bitcoin is dead? Bitcoin was never dead and won't die!Quote from: Altcoiner007 on March 11, 2024, 12:18:06 PMLater in 2023, Forbes headline crushed the confidence of many Bitcoin enthusiasts, saying if ETFs managed by asset managers are too successful, they will completely destroy bitcoin. Other sentiments like Bitcoin has failed on the promise to be a global decentralised digital currency and is still hardly used for legitimate transfers and that the approval of an ETF doesn’t change the fact that Bitcoin is not suitable as means of payment or as an investment. ETFs was accepted a month ago, saying those managers are success for 2 months is a big joke. They will not destroy Bitcoin, it's not their money, but the clients money. They're regulated, so it won't easy for them to file bankruptcy or exit scam because they get audited every year.Bitcoin was never failed to be a decentralized currency, if you use Bitcoin to pay service or buy a product from marketplace, you're already use Bitcoin as a currency.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Marvell1",
      "created_time": "March 11, 2024, 12:53:41 PM",
      "body": "QuoteIs Bitcoin Still Dead?Honestly, until now if someone still thinks bitcoin will die, bitcoin will go to zero then I think they deserve the poverty they are suffering. If this question were asked 10 years ago, we would have reason to doubt it. But now everything about bitcoin is clear as day and there are still people who are skeptical about bitcoin, I really don't want to explain it to them anymore.Recently a guy said similar things, he said that bitcoin is worthless and not worth even 1 cent. I didn't want to explain and told him directly, give me the 1BTC you said was useless, I will give you back 1k$. In the end, he quietly left and I didn't receive any BTC from him   .",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Abu-Naim",
      "created_time": "March 11, 2024, 12:56:26 PM",
      "body": "Quote from: Altcoiner007 on March 11, 2024, 12:18:06 PMShould those who didn't buy all along dare to jump in or would you recommend going for ALTs as the rising of Bitcoin often drag along the altcoins. Let me hear your thoughts?Those who are yet to buy probably did not buy because of lack money, and some failed to buy because of fear and trust they don’t have in bitcoin.If they still wants to buy bitcoin, they can buy now before the price will skyrocket after the incoming bitcoin halving, and if they didn’t buy now and waited for another time, they might be lucky to buy if the market made some corrections and they might be unlucky as the price might go up anytime soon.Going on altcoins is only advisable for short time investment. If you want a short time investment that can give good profit, then consider going altcoins with huge potential; DYOR before investing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MusaMohamed",
      "created_time": "March 11, 2024, 01:24:54 PM",
      "body": "Bitcoin will be dead again when it has corrections. People who dislike, hate Bitcoin will call it like this in future. They don't care about Bitcoin price growth over years and only look at corrections to say it is dead now.We can not stop them to do this, never.They already made hundreds of \"Bitcoin is dead\" callings.https://buybitcoinworldwide.com/bitcoin-is-dead/https://99bitcoins.com/bitcoin-obituaries/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lovesmayfamilis",
      "created_time": "March 11, 2024, 01:39:38 PM",
      "body": "You have been on the forum for many years, and it is quite stupid to believe only negative news background. Haven’t you talked here with people who, despite everything, walked this road of trust in Bitcoin? Yes, it is volatile, and yes, sometimes it is difficult to find the right time for a low price, but there is a DCA that covers all concerns. I can say one thing: not everyone has access to Bitcoin because not everyone is ready to have it. You are probably one of these people. But don’t despair; you can just watch how people next to you are happy that they took the right steps.Alternative coins? I would say this: if you didn’t believe in what worked and couldn’t invest in time, are you ready to have something that could disappear in an instant?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "btc78",
      "created_time": "March 11, 2024, 01:43:08 PM",
      "body": "What do you mean “still”? Bitcoin was never dead. We all need to learn the difference between simply a dip and a death. Markets are volatile and we do not know when will they go up or down and how much will they do but we know as long as there are movements in the market, the coin is not dead.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Altcoiner007",
      "created_time": "March 11, 2024, 01:59:08 PM",
      "body": "Quote from: Jawhead999 on March 11, 2024, 12:31:09 PMWhen was exactly Bitcoin is dead? Bitcoin was never dead and won't die!Quote from: Altcoiner007 on March 11, 2024, 12:18:06 PMLater in 2023, Forbes headline crushed the confidence of many Bitcoin enthusiasts, saying if ETFs managed by asset managers are too successful, they will completely destroy bitcoin. Other sentiments like Bitcoin has failed on the promise to be a global decentralised digital currency and is still hardly used for legitimate transfers and that the approval of an ETF doesn’t change the fact that Bitcoin is not suitable as means of payment or as an investment. ETFs was accepted a month ago, saying those managers are success for 2 months is a big joke. They will not destroy Bitcoin, it's not their money, but the clients money. They're regulated, so it won't easy for them to file bankruptcy or exit scam because they get audited every year.Bitcoin was never failed to be a decentralized currency, if you use Bitcoin to pay service or buy a product from marketplace, you're already use Bitcoin as a currency.It's the news publications from various media outlets that is a major contributor to the fear in the heart of those who would have wanted to venture into investing in Bitcoin however, those calling Bitcoin dead aren't winning. Every day, new people adopt cryptocurrency and use Bitcoin in a way. It's a currency they're failing to see the potential.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hatchy",
      "created_time": "March 11, 2024, 02:15:03 PM",
      "body": "Quote from: Altcoiner007 on March 11, 2024, 12:18:06 PMMany times I've missed the opportunity of buying Bitcoin dip because of media sentiments. In 2022, when Bitcoin was $17,168.57, which would have been a good time to build a larger holding, some claimed Bitcoin was on the road to irrelevance others said it was dead. I could understand and agree with them because the value of bitcoin had peaked at USD 69,000 in November 2021 before falling to USD 17,000 as at the mid-June 2022. After that time, the value had fluctuated around USD 20,000. And the same media claimed it was an artificially induced last gasp before the road to irrelevance. It seemed true as the FTX  bust had sent the bitcoin price to well below USD 16,000. Bitcoin has never been dead and will never be. I think it would be better to make good research and listen to the right persons before concluding generally in a way that might affect your plans like it is now. I really don't blame some of these so called social Media or Bitcoin hateist because most of them just say rubbish to help them promote their shit coins and some investors will still fall for their nonsense.Bitcoin has always been volatile and I've kept watch of it for a long time even before I started investing. It still was better then compared to other cryptocurrency in the market. Let's not be deceived into buying shit coins that would yield nothing in years to come. All Bitcoin investors will attest to the fact that so long you are able to hold for a very long time, you will make your profits now or in the future. It's still not too late mate. You can still invest now as Bitcoin hasn't even started the bull run yet. It's just warming it's legs up. We have seen how it has skyrocketed in just few weeks and we are expecting more from it before it's halving In April. I wonder what will happen after the halving.  Just stop doubting and start investing mate it still not too late to enjoy from the bull run.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Raflesia",
      "created_time": "March 11, 2024, 02:54:26 PM",
      "body": "Your question is also placed for the title is wrong because from the beginning of the creation of bitcoin from a decade ago until now bitcoin has never died so the words \"bitcoin is still dead\" are a mistake in my opinion.Regarding some of your statements, that's why I emphasize in this case especially for those new people who are trying to be in bitcoin to always try to do personal research so that we can be sure of what we are doing.Buying only because of the fomo that comes from the media will make your confidence diminish in the end because however we must be aware that until now there are some big media that are indeed like assigned to preach negativity only for bitcoin so surely when that happens then indeed we who initially knew bitcoin only from the media without doing research independently will certainly be carried away by the flow. independently will certainly be carried away from the narrative created by the media to weaken bitcoin but if indeed we start to be in bitcoin on independence because of research conducted no matter how hard the media reports that bitcoin has a negative influence then we will not consider it a complicated situation and sometimes will even make this a silly joke.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cryptomultiplier",
      "created_time": "March 11, 2024, 03:06:30 PM",
      "body": "How can we ask if BTC is dead when it is evidently clear that it is mainly only affordable by major brokerages, institutional advisors, and large consultants with hefty portfolios.Michael Saylor certainly doesn't agree that BTC is dead with the kind of purchase he made using the net proceeds from a $800million convertible note offering. He purchased about $12k BTC, which is of course an addition to the one already in his possession. More large businesses and individual investors with means, are still expected do more significant purchases of the spot ETF before we get to the middle of the year. So please explain again how is BTC dead?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "m2017",
      "created_time": "March 11, 2024, 03:12:58 PM",
      "body": "Quote from: Altcoiner007 on March 11, 2024, 12:18:06 PMMany times I've missed the opportunity of buying Bitcoin dip because of media sentiments. In 2022, when Bitcoin was $17,168.57, which would have been a good time to build a larger holding, some claimed Bitcoin was on the road to irrelevance others said it was dead. I could understand and agree with them because the value of bitcoin had peaked at USD 69,000 in November 2021 before falling to USD 17,000 as at the mid-June 2022. Now you are personally convinced that that time was ideal for purchasing bitcoin.Quote from: Altcoiner007 on March 11, 2024, 12:18:06 PMAfter that time, the value had fluctuated around USD 20,000. And the same media claimed it was an artificially induced last gasp before the road to irrelevance. It seemed true as the FTX  bust had sent the bitcoin price to well below USD 16,000. The media has repeatedly buried and will continue to bury bitcoin in the future. Why do you treat their words as the ultimate truth? Ignore the extra noise around you.Quote from: Altcoiner007 on March 11, 2024, 12:18:06 PMLater in 2023, Forbes headline crushed the confidence of many Bitcoin enthusiasts, saying if ETFs managed by asset managers are too successful, they will completely destroy bitcoin. Other sentiments like Bitcoin has failed on the promise to be a global decentralised digital currency and is still hardly used for legitimate transfers and that the approval of an ETF doesn’t change the fact that Bitcoin is not suitable as means of payment or as an investment. Bitcoin is unlikely to be suitable for some purposes (means of payment), but is certainly well suited for others (investment).Quote from: Altcoiner007 on March 11, 2024, 12:18:06 PMYet today, I saw the image above and it suddenly got the question into my head, Is Bitcoin still dead? We've all seen how Bitcoin has weathered through all the critics and FUD to breaking above USD 70,000 steadily since the beginning of 2024. There's all indication it's headed toward USD 100,000. What are you all thinking about these feet. The $100k level looks like the mark that bitcoin should at least reach, judging by the growth dynamics that are happening now. It is not necessary that this will happen in the near future (who the hell isn’t kidding, right?) and before the correction, but it will inevitably happen. The market is in high spirits and even these numbers seem easily achievable.Quote from: Altcoiner007 on March 11, 2024, 12:18:06 PMShould those who didn't buy all along dare to jump in or would you recommend going for ALTs as the rising of Bitcoin often drag along the altcoins. Let me hear your thoughts?Is it worth buying bitcoin now? It depends on the long-term investment. If you hold it for a long time, then you can buy it now, because the current price doesn't matter in terms of subsequent cycles. If you want to get rich quickly, then it would be better to wait for the correction for a more profitable purchase of bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Altcoiner007",
      "created_time": "March 11, 2024, 03:30:49 PM",
      "body": "Quote from: Hatchy on March 11, 2024, 02:15:03 PMQuote from: Altcoiner007 on March 11, 2024, 12:18:06 PMMany times I've missed the opportunity of buying Bitcoin dip because of media sentiments. In 2022, when Bitcoin was $17,168.57, which would have been a good time to build a larger holding, some claimed Bitcoin was on the road to irrelevance others said it was dead. I could understand and agree with them because the value of bitcoin had peaked at USD 69,000 in November 2021 before falling to USD 17,000 as at the mid-June 2022. After that time, the value had fluctuated around USD 20,000. And the same media claimed it was an artificially induced last gasp before the road to irrelevance. It seemed true as the FTX  bust had sent the bitcoin price to well below USD 16,000. Bitcoin has never been dead and will never be. I think it would be better to make good research and listen to the right persons before concluding generally in a way that might affect your plans like it is now. I really don't blame some of these so called social Media or Bitcoin hateist because most of them just say rubbish to help them promote their shit coins and some investors will still fall for their nonsense.Bitcoin has always been volatile and I've kept watch of it for a long time even before I started investing. It still was better then compared to other cryptocurrency in the market. Let's not be deceived into buying shit coins that would yield nothing in years to come. All Bitcoin investors will attest to the fact that so long you are able to hold for a very long time, you will make your profits now or in the future. It's still not too late mate. You can still invest now as Bitcoin hasn't even started the bull run yet. It's just warming it's legs up. We have seen how it has skyrocketed in just few weeks and we are expecting more from it before it's halving In April. I wonder what will happen after the halving.  Just stop doubting and start investing mate it still not too late to enjoy from the bull run.I know right, Bitcoin has always been volatile. The point is at every dip the hateist of Bitcoin often come up with publications that will make a common admirer of Bitcoin to think otherwise. While many people can't be blamed for not having as much faith as most of you here, you should understand that there are those who invested but not as much as they should have. That's still something to encourage their courage. Maybe that's where I am. I'm curious about the blockchain technology and even the whole possibilities of Bitcoin. Not just here for the money but for the concept and the idea around Bitcoin ecosystem.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bettercrypto",
      "created_time": "March 11, 2024, 03:45:31 PM",
      "body": "Quote from: Marvell1 on March 11, 2024, 12:53:41 PMHonestly, until now if someone still thinks bitcoin will die, bitcoin will go to zero then I think they deserve the poverty they are suffering.Well, honestly, I laughed a lot when you said this, but it really makes sense, my friend. That's because people who are wise are blessed with people who are wise and really know something about it. It's like you're the one who really saw real gold, and then the person who didn't see what you saw will say that it's not true. That's really insane, to be honest.When I look at that kind of person, it's pitiful; it's like they're blind, even though they're not really. They can see, but they are still blind to the truth. We can't do anything with people like that. They say there are only two types of people in this world: believers and unbelievers.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitbollo",
      "created_time": "March 11, 2024, 03:56:08 PM",
      "body": "even during its \"dark\" moments, months away from the glories of ATHs it is difficult to talk about a time when the bitcoin blockchain was in difficulty due to \"few transactions\" or something related to \"less interest\".Values in fiats are another thing and most not taking in count. anyone is talking about \"bitcoin is dead\" is going to dead etc etc has completely no idea of what is he talking about.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Altcoiner007",
      "created_time": "March 11, 2024, 04:39:08 PM",
      "body": "Quote from: bitbollo on March 11, 2024, 03:56:08 PMeven during its \"dark\" moments, months away from the glories of ATHs it is difficult to talk about a time when the bitcoin blockchain was in difficulty due to \"few transactions\" or something related to \"less interest\".Values in fiats are another thing and most not taking in count. anyone is talking about \"bitcoin is dead\" is going to dead etc etc has completely no idea of what is he talking about.You know it's just recently that investing in cryptocurrencies has gained popularity, surpassing traditional investment forms. Regardless of the chosen cryptocurrency or token, the unique features of these digital assets have attracted investors, especially those from a younger demographic. But have you considered some older folks who finds it difficult to adjust to new idea of investing especially as in Bitcoin? I know a couple of persons who bought into Bitcoin and in a matter of days, there came a huge dip. That caused a negative experience for them that made them withdraw. And there are those who came in when the pumps are being celebrated, you know the acceptance of Bitcoin as an asset will be different. Right?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Casdinyard",
      "created_time": "March 11, 2024, 04:45:12 PM",
      "body": "Quote from: Altcoiner007 on March 11, 2024, 12:18:06 PMMany times I've missed the opportunity of buying Bitcoin dip because of media sentiments. In 2022, when Bitcoin was $17,168.57, which would have been a good time to build a larger holding, some claimed Bitcoin was on the road to irrelevance others said it was dead. I could understand and agree with them because the value of bitcoin had peaked at USD 69,000 in November 2021 before falling to USD 17,000 as at the mid-June 2022. After that time, the value had fluctuated around USD 20,000. And the same media claimed it was an artificially induced last gasp before the road to irrelevance. It seemed true as the FTX  bust had sent the bitcoin price to well below USD 16,000. Later in 2023, Forbes headline crushed the confidence of many Bitcoin enthusiasts, saying if ETFs managed by asset managers are too successful, they will completely destroy bitcoin. Other sentiments like Bitcoin has failed on the promise to be a global decentralised digital currency and is still hardly used for legitimate transfers and that the approval of an ETF doesn’t change the fact that Bitcoin is not suitable as means of payment or as an investment. Yet today, I saw the image above and it suddenly got the question into my head, Is Bitcoin still dead? We've all seen how Bitcoin has weathered through all the critics and FUD to breaking above USD 70,000 steadily since the beginning of 2024. There's all indication it's headed toward USD 100,000. What are you all thinking about these feet. Should those who didn't buy all along dare to jump in or would you recommend going for ALTs as the rising of Bitcoin often drag along the altcoins. Let me hear your thoughts? Bitcoin for sure isn't dead, but it's not that alive either if you'd ask me. The reason why it's in this state right now is because of the massive anticipation that people have over the upcoming halving, and the subsequent ETF approvals that bitcoin has been under in the past few months. These are good, but I'm not necessarily seeing these things as sustainable hypes that would propel bitcoin and the crypto industry towards a massive bull run. The price is inflated as we speak and we may very well see a massive correction at the end of the run but at the same time, it's gonna take a couple while before they stand down and sell. It may not even come because there's no real selling pressure right now which may force these holders to hold off on the tight fists and let go of their positions in the market. Bitcoin's definitely up for a massive increase soon as the bullrun officially commences, but til then, we'll just have to make do and be prepared for all things, the market's grueling and cruel as we all know, and a single tap from the outside world could literally send it spiraling towards a massive crash, we have to be prepared for when that happens.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Aanuoluwatofunmi",
      "created_time": "March 11, 2024, 04:51:57 PM",
      "body": "OP you could have just readjust your image seize and make it moderately presentable, the image and its content are not too small to read even when you reduced the seize, this is what many don't get, you don't have to loud it and make everyone get your topic noticed, the contents do the working, as regarding bitcoin all time high, we have realized $72,000+ today and we are still expecting more coming from anytime soon, this year bullrun is interesting as its coming with many surprises, just as we begin it right before the halving, more are to come before the month end and after halving.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yhiaali3",
      "created_time": "March 11, 2024, 05:01:26 PM",
      "body": "I remember this disgusting phrase “Bitcoin is dead” They used it on our heads several times over many years to spread fear and panic, but they failed. Yes, there are many who became frightened and got rid of their Bitcoin, but now they inevitably cry over the precious opportunity they lost.This cycle, investing in Bitcoin is no longer very profitable because we are approaching the peak, although it is still possible to collect some profits, but not like those who invested from the beginning. Regret will befall all those who believed the rumors and did not overcome their fear.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kentrolla",
      "created_time": "March 11, 2024, 05:07:33 PM",
      "body": "Bitter was never dead and these are the terms which were used by mainstream media as well as banks sponsored media to create panic and fear amongst the Bitcoin investors. Now let's get back to your question whether you can still get into Bitcoin or not? My answer would be yes but at your own risk because usually there comes a correction after pump which we haven't seen yet, if you be actively monitoring the price then you can go ahead and it's much more preferable over Altcoin investment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}