{
  "id": "topic_5455969",
  "title": "Sexylizzy2813",
  "author": "Sexylizzy2813",
  "created_time": "June 10, 2023, 04:12:15 PM",
  "content": "Gambling brings so much joy especially when you're on the winning side, when things are all in your favor it just seems like you should never stop. But when it gets bad, you look for a way to pour out your anger, either on someone or on something. When someone is addicted to gambling I feel it's worst than one who's addicted to drugs.So much has been said about betting companies regarding how they should be responsible in helping those who are addicted to gambling, although is really hard to do so on there own path because gamblers can't be monitored.I don't know if booking an appointment with a therapist would help or is something you as a gambler who wants out should do on your own.The question is if you're a gambler or have someone who is, what's the best way to help out. And what's your story on escaping that addiction (gambling)...How do you fight this battle?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5455969",
  "comments": [
    {
      "author": "Oshosondy",
      "created_time": "June 10, 2023, 05:01:54 PM",
      "body": "There is a reason a gambler is addicted, that is what that you should tackle. Most addicts are seeing gambling as a way to get weekly or monthly income, while some can be addicted because they have nothing special that they are doing and getting themselves idle. You should let an addict know that gambling is not a way to get weekly or monthly income unless he is fooling himself. If it is because of idleness, he should get things he will be doing. There are real life examples that you can let him see, people that gambling make their lives turn into something they do not want. Gambling is good in moderation, but addiction is very bad and can turn someone's life into something not good at all.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CarnagexD",
      "created_time": "June 10, 2023, 05:09:29 PM",
      "body": "Quote from: Sexylizzy2813 on June 10, 2023, 04:12:15 PMGambling brings so much joy especially when you're on the winning side, when things are all in your favor it just seems like you should never stop. But when it gets bad, you look for a way to pour out your anger, either on someone or on something. When someone is addicted to gambling I feel it's worst than one who's addicted to drugs.So much has been said about betting companies regarding how they should be responsible in helping those who are addicted to gambling, although is really hard to do so on there own path because gamblers can't be monitored.I don't know if booking an appointment with a therapist would help or is something you as a gambler who wants out should do on your own.The question is if you're a gambler or have someone who is, what's the best way to help out. And what's your story on escaping that addiction (gambling)...How do you fight this battle?I would say that putting limitations would be the best thing to do. Set a goal for your wins, then stop when you reached it. It is a fallacy that \"you should push your luck\". This is a big NO because the tendency are you only end up giving your money back that you should have won if you just stop after you win. So setting a goal. For example, after doubling your money, you will stop. Because there will always be another day to bet.Another set a loss limit. This is in terms of a losing streak. You want a revenge, you want to get your money back, but the casino doesn't care. So set a limit how much can you loss in a day. And if it is once reach, again come back another day because there's always another day to bet.The most important part is sticking to it. Rules you set for yourself are just guidelines. But how well can you manage yourself to follow it well? It is an inside job.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "STT",
      "created_time": "June 10, 2023, 05:16:15 PM",
      "body": "Its usually the money which is a problem.   Allocate a set amount for playing the game, stop telling yourself anything about winning back money lost.  Its a game not work and not there for earning money like a job.  Just separate those two events in your life, a job can earn money a game will not.   Part of the game is winning some  money maybe but you need to literally write down that fallacy and then cross it out, once you recognize its a spending event for entertainment I think its alot easier to handle any addiction.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "molsewid",
      "created_time": "June 10, 2023, 05:22:15 PM",
      "body": "Quote from: Sexylizzy2813 on June 10, 2023, 04:12:15 PMGambling brings so much joy especially when you're on the winning side, when things are all in your favor it just seems like you should never stop. But when it gets bad, you look for a way to pour out your anger, either on someone or on something. When someone is addicted to gambling I feel it's worst than one who's addicted to drugs.So much has been said about betting companies regarding how they should be responsible in helping those who are addicted to gambling, although is really hard to do so on there own path because gamblers can't be monitored.I don't know if booking an appointment with a therapist would help or is something you as a gambler who wants out should do on your own.The question is if you're a gambler or have someone who is, what's the best way to help out. And what's your story on escaping that addiction (gambling)...How do you fight this battle?Actually , the word will be how to manage your gambling habit. It is not bad to play and play the bad thing will be if you cannot manage how to fix your assets and how to allocate your only amount to be played in gambling and everytime it runs out you will stop, you will add more that could be a problem. But for me if you are already addicted, stop and ask for professional help immediately.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Stepstowealth",
      "created_time": "June 10, 2023, 05:25:14 PM",
      "body": "Quote from: Sexylizzy2813 on June 10, 2023, 04:12:15 PMWhen someone is addicted to gambling I feel it's worst than one who's addicted to drugs.All kinds of addictions is bad and if you compare gambling and addiction to drugs, gambling takes away money that you have but also do drugs. It is even possible that someone who is addicted to drugs, will spend more money than someone who is just addicted to gambling. If you are addicted to drugs there is a very high chance that you will pick up other habits and addictions like gambling but an addiction to gambling may not lead to drug abuse.Quote from: Sexylizzy2813 on June 10, 2023, 04:12:15 PMThe question is if you're a gambler or have someone who is, what's the best way to help out. Find a way to stop yourself from gambling. You know the most effective method for you because you know yourself. An addict usually knows what to do, but there is no discipline to do it. You need to push yourself to stop even if means staying away from betting websites, or putting someone in charge of your finance, so you will not have a way to fund your gambling without them authorizing it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "panjul07",
      "created_time": "June 10, 2023, 05:26:06 PM",
      "body": "Quote from: Sexylizzy2813 on June 10, 2023, 04:12:15 PMThe question is if you're a gambler or have someone who is, what's the best way to help out. And what's your story on escaping that addiction (gambling)...Your closest one may help, it can be your girlfriend/wife and maybe your children or someone who you trust. In my case, my wife help me a lot as she has a full control of all my money that I earn IRL so basically what I use to gamble is the money I earn online (from this forum or from trading). She knows almost everything so she helps me a lot to control the money. This way, there are 2 parties who control my gambling activity.First I have to control myself and my wife help me to control if she feels that I'm going too far, not only in matter of money but also time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "goinmerry",
      "created_time": "June 10, 2023, 05:32:59 PM",
      "body": "The first thing in solving a self problem is to recognize what's the problem.Fortunately, there are addicted gamblers who able to cure their gambling addiction because they forced themselves to do it. That's called self-disciplined and being responsible as much as possible. It's difficult to do but with seriouness, gamblers will soon cope up.On the other hand, there are gamblers that gambling addiction is already out of their conrol. In that particular situation, don't expect these people to still be able to help themselves. They now need the help of their families and friend as a start.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PX-Z",
      "created_time": "June 10, 2023, 05:40:00 PM",
      "body": "Quote from: Sexylizzy2813 on June 10, 2023, 04:12:15 PMGambling brings so much joy especially when you're on the winning side, when things are all in your favor it just seems like you should never stop. But when it gets bad, you look for a way to pour out your anger, either on someone or on something. That's how usually me before until i manage to stop when I start winning huge (well, for me). But sometimes i still feel the same when i'm in a losing streak then tying to bet all hoping that maybe those 3-5 loss is enough so maybe I will win in the 6th yet, it still not lmao, and it's annoying. So I stop after that and come back again more later.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jody.Drummer",
      "created_time": "June 10, 2023, 06:05:38 PM",
      "body": "An addict must realize that what he is doing is wrong, because when they don't realize it themselves it will be difficult to stop it. I once had a friend who was very addicted to gambling, and when I told him about it and tried to get him to control himself he got angry with me. He said that he gambled with his own money and never lost me. It's true that I wasn't harmed by this, but as a friend I feel sorry if I see my own friend going bankrupt because of gambling and will feel very guilty if I don't advise him.However now that he is totally broke he has come to me and even apologized for what he had said to me. And I understand why he is, it's because it's not who he really is.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Adbitco",
      "created_time": "June 10, 2023, 06:06:09 PM",
      "body": "Ideally there are some specific thread that has said much about all just posted here, but that notwithstanding. Drugs addiction to me is more worst than gambling because their own case scenario are mostly involved with frustrations meaning, if they don't have money for drugs they would sell whatever that had for just to have some tips of drugs on their nose. Then being frustrated is like if they don't involved themselves with drugs for a night they feels like dying over night. But a gambler somehow has such life scenario might hold themselves if they don't have money at hand to gamble, although the chronic gamblers as well sells of their belongings but could likely and partially be controlled by either someone who is around them and, they are mentally stable unlike drugs addicts because it also affects their sense of reasoning whereby selling what they bought for some thousand dollars to just some fractions of dollars in order for them to be rolled over in their druging life style.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BITCOIN4X",
      "created_time": "June 10, 2023, 06:12:39 PM",
      "body": "Quote from: Sexylizzy2813 on June 10, 2023, 04:12:15 PMThe question is if you're a gambler or have someone who is, what's the best way to help out. And what's your story on escaping that addiction (gambling)...How do you fight this battle?Limit the amount of money you will spend on gambling, do some other activities when you have free time, and avoid associations that allow you to gamble more than before. Those are some of the ways I think of, while you can adapt yourself and your plans in your own way.Most problem gamblers should consult an expert especially when they are no longer able to control themselves about their gambling. The biggest impact is that the gambler becomes very desperate and tries to end his life by committing suicide. It's just the effects of gambling, so if you don't want to get in trouble then gamble responsibly.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Eureka_07",
      "created_time": "June 10, 2023, 07:24:43 PM",
      "body": "Quote from: Sexylizzy2813 on June 10, 2023, 04:12:15 PM<Snip>The question is if you're a gambler or have someone who is, what's the best way to help out. And what's your story on escaping that addiction (gambling)...How do you fight this battle?I didn't had any problem coping with the depressing side of losing. Addiction is hard to fight but I think being mentally aware would help someone to not be totally eaten by his addiction towards gambling.  Find other things/activities you will enjoy, play games, travel, watch movies, or more. Forget about gambling. It'll also be helpful if someone knew about acceptance.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "piebeyb",
      "created_time": "June 10, 2023, 07:26:32 PM",
      "body": "Quote from: Sexylizzy2813 on June 10, 2023, 04:12:15 PMGambling brings so much joy especially when you're on the winning side, when things are all in your favor it just seems like you should never stop. But when it gets bad, you look for a way to pour out your anger, either on someone or on something. When someone is addicted to gambling I feel it's worst than one who's addicted to drugs.So much has been said about betting companies regarding how they should be responsible in helping those who are addicted to gambling, although is really hard to do so on there own path because gamblers can't be monitored.I don't know if booking an appointment with a therapist would help or is something you as a gambler who wants out should do on your own.The question is if you're a gambler or have someone who is, what's the best way to help out. And what's your story on escaping that addiction (gambling)...How do you fight this battle?Actually it depends on the addict how he wants to stop and get out of the gambling game itself because I also haven't quit gambling yet so I can't tell how to stop and get out of gambling, but I can still control it and I'm not a gambling addict who continues to play gambling to spend time and money for fun, because I gamble only on weekends.For addicts, of course, it is very difficult to get out of there if you still have money, because the money factor also determines whether an addict can stop or not, because as long as there is still money in the addict's possession, it will be difficult to stop and get out of gambling, be it casino or sports betting.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kamvreto",
      "created_time": "June 10, 2023, 07:50:08 PM",
      "body": "Quote from: STT on June 10, 2023, 05:16:15 PMIts usually the money which is a problem.   Allocate a set amount for playing the game, stop telling yourself anything about winning back money lost.  Its a game not work and not there for earning money like a job.  Just separate those two events in your life, a job can earn money a game will not.   Part of the game is winning some  money maybe but you need to literally write down that fallacy and then cross it out, once you recognize its a spending event for entertainment I think its alot easier to handle any addiction. The majority of gambling players do not distinguish between play and work. Gambling has always been said to be a job that will bring in a lot of money. But in fact gambling is a place to waste their money. Professional gamblers think it's only a game, if you get a profit it's just a bonus.People who from the start have judged that gambling is a place to make a lot of money, he will not be able to stop once he loses and will eventually become an addict who always expects to win.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "darkangel11",
      "created_time": "June 10, 2023, 08:12:20 PM",
      "body": "Quote from: STT on June 10, 2023, 05:16:15 PMIts usually the money which is a problem.   Allocate a set amount for playing the game, stop telling yourself anything about winning back money lost.  Its a game not work and not there for earning money like a job.  Just separate those two events in your life, a job can earn money a game will not.   Part of the game is winning some  money maybe but you need to literally write down that fallacy and then cross it out, once you recognize its a spending event for entertainment I think its alot easier to handle any addiction. It's not about the money, but your attitude.Have you ever thought about why some people can smoke cannabis all their lives and never touch hard drugs, and other people start using meth after a few months and go to rehav, get out and are back on meth within a year?Why do some people drink alcohol once a week and never feel like they need more, and others keep drinking more and more until they can't do anything else?It's about how your brain works. Some of us are more prone to addictions, they're looking to escape reality more than others. I've been all of it. I like to get drunk once in a while, but it's occasional. I need friends to get drunk, so I do it when there's something to celebrate. I've gambled a bit, but never too much. I like to bet when I watch sports with friends, or when I'm bored I'll play poker or blackjack, or do some roulette. I don't lose what I'm not supposed to lose and I don't need to fight addiction",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "macson",
      "created_time": "June 10, 2023, 09:06:16 PM",
      "body": "Quote from: Sexylizzy2813 on June 10, 2023, 04:12:15 PMsnipThe question is if you're a gambler or have someone who is, what's the best way to help out. And what's your story on escaping that addiction (gambling)...How do you fight this battle?There are several ways you can do to cure someone from gambling addiction other than by going to a therapist, that is by focusing on the sufferer's hobbies (usually everyone has their own hobbies) or taking him/her to a spiritual place (such as a house of worship although in some reports, it is still not effective either).  but keep in mind that going to a therapist (especially a hypnotist) is the most effective thing in curing someone from gambling addiction because gambling is more about memory - not blood, like drug addicts.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ulven",
      "created_time": "June 10, 2023, 09:06:23 PM",
      "body": "Quote from: STT on June 10, 2023, 05:16:15 PMIts usually the money which is a problem.   Allocate a set amount for playing the game, stop telling yourself anything about winning back money lost.  Its a game not work and not there for earning money like a job.  Just separate those two events in your life, a job can earn money a game will not.   Part of the game is winning some  money maybe but you need to literally write down that fallacy and then cross it out, once you recognize its a spending event for entertainment I think its alot easier to handle any addiction. You make an excellent point about separating the mindset of gambling as a source of income versus a form of entertainment. It's crucial to recognize that gambling should be treated as a recreational activity rather than a means to earn money consistently.It's important to remember that seeking help is not a sign of weakness but rather a courageous step towards regaining control and improving one's well-being. Professional support can significantly increase the chances of successfully overcoming gambling addiction and living a healthier, more fulfilling life.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Johnyz",
      "created_time": "June 10, 2023, 09:09:14 PM",
      "body": "Quote from: Sexylizzy2813 on June 10, 2023, 04:12:15 PMThe question is if you're a gambler or have someone who is, what's the best way to help out. And what's your story on escaping that addiction (gambling)...How do you fight this battle?Gambling is fun but you should always have your limit and be responsible with your bets. Escaping addiction is not easy, you have to seek professional advices and ask someone to guide you while you are on the process of recovery. Don’t be ashamed asking for a help because you can’t do it alone and you might fall on the same situation if you didn’t pay attention to this. I fight addiction by being a responsible gambler, its not easy but you have to.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "QueenVera",
      "created_time": "June 10, 2023, 09:23:37 PM",
      "body": "Wow I think it's  just to break your phone and shot yourself  away from internet and smart phones or electronics.Just kidding 😂 .But the truth is that an addicted gambler will never accept that they're addicted and it .amen it hard for them to get help and most times, the victim might pick offense if they're been reported to security personnels and might not feel happy about such even the local community  might not happy with you.The moment you notice that someone is persistently  making bets and making huge losses, I think it is the responsibility  of everyone around the person to cautions the gambler and that's one of the ways to help call someone to other.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}