{
  "id": "topic_5457013",
  "title": "alastantiger",
  "author": "alastantiger",
  "created_time": "June 20, 2023, 06:01:30 PM",
  "content": "Around the world, astute politicians are actively courting Bitcoin users. Tulsi Gabbard, Vivek Ramaswamy, and Robert F. Kennedy Jr. were a few of the politician who were the speakers at the Miami Bitcoin Conference in 2023. Politicians in several nations have switched from outright banning Bitcoin to enacting taxing laws. They are aware of the prospective income tax payments made by bitcoin users.I make a plea to Bitcoiners who are in close contact with these elected officials, especially now that they are talking to us so frequently. Please make sure they know how important Bitcoin is to us when you meet with them. Point out that Bitcoin is the currency of the future and implore them to defend Bitcoin miners by reviewing the taxation policies that have been put in place. Please emphazise the importance of property rights, especially the ability to keep one's own Bitcoin and operate Bitcoin nodes. What other messages do you have for politicians as a bitcoin user",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5457013",
  "comments": [
    {
      "author": "Nwada001",
      "created_time": "June 20, 2023, 09:02:30 PM",
      "body": "The truth is that it's not as if those who are making laws and trying to impulse regulation and some form of high tax fee don't  know what they are doing; they already know; they just want to do it because they feel like they have the upper hand, and the people in the crypto world just have to abide by any rules they set.So even going to them and telling them what they know to try and talk in favor of the people they are actually against is just some form of waste of time. And you know, in every organization, there are always people who are of the top opinion. It might seem like others opinions matter, but deep down, what they say stands, so unless you are able to convince people of that nature in such a committee, everything and every effort will definitely be a waste of time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mr.right85",
      "created_time": "June 20, 2023, 10:20:43 PM",
      "body": "Quote from: Nwada001 on June 20, 2023, 09:02:30 PMThe truth is that it's not as if those who are making laws and trying to impulse regulation and some form of high tax fee don't  know what they are doing; they already know; they just want to do it because they feel like they have the upper hand, and the people in the crypto world just have to abide by any rules they set.I think one of the issues that have been about this is that  the government even with the imposition of tax on crypto assets through miners and exchanges, they still won't have complete dominance over the system and dominance us what the government is all about. To have complete control and be able to regulate what goes on within there territory. That's how to be truly sovereign and that they can't find in a decentralised bitcoin.Yet again, they have an issue of an approved and functional bitcoin to be a threat to local fiat currency which is there weapon of mass destruction. That too they can't allow.This makes convincing any government official a difficult task but, you could always try.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BADecker",
      "created_time": "June 21, 2023, 05:41:48 PMLast edit: June 21, 2023, 07:55:20 PM by BADecker",
      "body": "This is a flaw in Bitcoin and, at least, most of the other coins and tokens. The blockchains connect the address with the transaction amount. The amount of coins in each transaction is readily viewable by everyone who can program a blockchain viewer, or everyone who can use one of the blockchain viewers that is available. Why is this a flaw? Because it makes the transaction to be less-private.In the US (at least), Constitution, Amendments, written law, and a big bunch of Supreme Court cases, all uphold your right to privacy. Even giving info to the IRS is 'voluntary', according to what they say. So...Start by making your Bitcoin transaction amounts only visible to yourself and the person you are transacting with. They are still part of the blockchain total. But they are individually yours, only. Nobody else can see them or do anything but guess at the amount.The blockchain technology works! It has been proven over and over. Now extend it in such way that the amounts in the blockchain journal aren't visible to anyone. It would only take a tweak of the current blockchain and wallets to do this. In addition, add PMA wording to all the wallets.Again, PMA is for the US. Other countries might not have the same option. A PMA is a Private Member Association. It's like being at home. You can play cards for money or paper clips. It's private. If you report your earnings to the IRS, it's your fault for taking your private domain stuff into the public sector... from private, where the IRS doesn't have authority... to public where they do.If your transactions are private, and you state that they are private, government has no authority to interfere in any way, unless it can be shown by government that there was a clear and present danger to somebody in the PMA. BTW, make each transaction its own PMA... the hash being the identification number/name.Note that I don't have all the answers. But is anybody attempting to set this idea/process up for any Coin/Token?Biden To Deploy Thousands of Armed IRS Officers To Forcibly Seize Guns From Americanshttps://thepeoplesvoice.tv/biden-to-deploy-thousands-of-armed-irs-officers-to-forcibly-seize-guns-from-americans/In a disturbing first step, the IRS sent twenty armed Internal Revenue Service (IRS) and Bureau of Alcohol, Tobacco, Firearms and Explosives (ATF) agents to carry out a raid on a gun store in Great Falls, Montana, seizing all Form 4473s – documents that contain the buyer's information. It is believed this information will be used by the IRS in the near future to conduct unconstitutional raids on Americans.Tom Van Hoose, owner of Highwood Creek Outfitters, says he has been under constant surveillance by state and federal agencies for over two years, according to KRTV.Thegatewaypundit.com reports: On Wednesday, the gun shop owner reported an unexpected visit from 20 heavily armed IRS agents at his store.The agents reportedly arrived at the shop early in the morning, as Van Hoose was opening for the day.\"We have now confirmed that both the IRS and the ATF were at Highwood Creek Outfitters in Great Falls around 7 am this morning. Both the IRS and ATF would not say why they were there,\" KMON Radio reported.\"A spokeswoman for the IRS would only say they were there on official IRS business. The ATF says it was providing assistance to the IRS. We attempted to enter the store today and were stopped by agents at the door who would only say that the gun store is closed and will reopen tomorrow,\" the news outlet added.According to Hoose, the federal scrutiny began two years ago and has involved various agencies, including the Federal Bureau of Investigation, the Occupational Safety & Health Administration, the Department of Homeland Security, and now, the Internal Revenue Service.\"They must think we're making a fortune in the gun business to investigate us like this, assuming we're hiding thousands, hundreds of thousands, even millions of dollars. However, anyone familiar with gun business profit margins would know that's not the case,\" Van Hoose told MTN News....",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dr.Bitcoin_Strange",
      "created_time": "June 21, 2023, 07:00:56 PM",
      "body": "There are about 195 countries in the world, all of which have their own governments with their own laws and policies. One thing about governments is that they always want to be in power and in control of most things, so even if these messages are passed on to any of these governments, they're likely not to be taken by all of them. Some politicians love cryptocurrency, and if they become the president of their country, they will make their country a favorable place for all crypto users. But the problem is that most of those politicians who admire crypto may not get into power in their country; instead, another politician who doesn't like crypto will become president. I still remember when Donald Trump was still the president of the US and there were no issues with crypto restrictions for crypto users in the country, but it's now not a free heaven again with Joe Biden on the site (someone correct me if I am wrong).OP, All I am saying is that, of all the countries, not all of the governments of those countries will freely accept Bitcoin. If not, I am just of the same opinion as you that Bitcoin should be made a free-to-adopt thing; there should be no laws or rules against Bitcoin, bitcoiners and miners. just my opinion.Cheers 🥂, Dr.Bitcoin_Strange 👺👺",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}