{
  "id": "topic_5475057",
  "title": "user87654",
  "author": "user87654",
  "created_time": "November 22, 2023, 01:02:21 PM",
  "content": "Hello everyoneI have a very good friend who owns almost 4 Bitcoin in his early 20s.However, he told me he didn't know exactly what to do in his current situation(life).He doesn't know whether he should sell these 4 Bitcoins in the next bull run in order to live his life, since he is in his early 20s, or whether he should continue to work and stack, since the Bitcoin can continue to rise steadily.He finds himself in a mental dilemma between.Basically, we know that Bitcoin is something like a safe haven.Do you have any tips or how would you behave if you were in a similar situation?Thank you for your input.And I hope I can motivate him a bit with these inputs.Friendly HODL",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5475057",
  "comments": [
    {
      "author": "Samlucky O",
      "created_time": "November 22, 2023, 02:52:06 PM",
      "body": "Quote from: user87654 on November 22, 2023, 01:02:21 PMHello everyoneI have a very good friend who owns almost 4 Bitcoin in his early 20s.However, he told me he didn't know exactly what to do in his current situation(life).He doesn't know whether he should sell these 4 Bitcoins in the next bull run in order to live his life, since he is in his early 20s, or whether he should continue to work and stack, since the Bitcoin can continue to rise steadily.He finds himself in a mental dilemma between.I find this article as a false and fabricated story. I don't see reasons why someone with almost 4 bitcoin will be in mental delima situation according to you. To sell his bitcoin regarding the current price of bitcoin.You said he own bitcoin in his early 20s and that could be when bitcoin came out maybe 2009 2010 by now he should have been 33years old. How com he is still confused wether to sell in his early 20s or is that a typing error or am I the one who don't understand what you mean?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ambatman",
      "created_time": "November 22, 2023, 03:21:35 PM",
      "body": "A person who tells is friend he has 4 Btc is naive and childish.Your story is filled with loopholesSell the 4BTC to live his life?If he can make 4BTC in such a short time.Then money wouldn't be his problem.Since you know about HODL then u too should be able to make the decision for him.If your story is true which I doubtThen your story telling skill is poor.A person could provide information for you but its left to you to make the decision.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Spaceman1000$",
      "created_time": "November 22, 2023, 03:41:59 PM",
      "body": "Quote from: user87654 on November 22, 2023, 01:02:21 PMHello everyoneI have a very good friend who owns almost 4 Bitcoin in his early 20s.However, he told me he didn't know exactly what to do in his current situation(life).He doesn't know whether he should sell these 4 Bitcoins in the next bull run in order to live his life, since he is in his early 20s, or whether he should continue to work and stack, since the Bitcoin can continue to rise steadily.He finds himself in a mental dilemma between.Basically, we know that Bitcoin is something like a safe haven.Do you have any tips or how would you behave if you were in a similar situation?Thank you for your input.And I hope I can motivate him a bit with these inputs.Friendly HODLIt is very interesting to have 4 Bitcoin in your 20s, that is massive investment, he shouldn't be in a state of dilemma because he has made the right decision, if he doesn't know what to do with his investment yet, he can still continue to hold it, he is still young, maybe later part of his life, responsibilities might come in, and he will see the need to make use of his investment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptoHeadlineNews",
      "created_time": "November 22, 2023, 04:03:26 PM",
      "body": "Quote from: user87654 on November 22, 2023, 01:02:21 PMHe doesn't know whether he should sell these 4 Bitcoins in the next bull run in order to live his life, since he is in his early 20s, or whether he should continue to work and stack, since the Bitcoin can continue to rise steadily.He finds himself in a mental dilemma between.Do you have any tips or how would you behave if you were in a similar situation?Wait!! Did I just hear you said having a mental dilemma in trying to figure out how to spend/use his own money? Did I?... Because please I'm sorry to ask this \"Did he steal the 4 BTC?\" or \" Did he by any chance win the 4 Btc by lottery?\" which one of them.. Because I'm more confident that anyone that could afford to save up to half a Bitcoin or probably one should have a very good reason for what he/she intends to do such money, as it's not an easy task, not to mention a whole 4 btc. Moreover, for a person to have 4 BTC (i.e over $146,000) in Bitcoin investment, such individual is likely to have double of such investment in real life, and as such your friend is in the best possible to make the right choice according to his current financial status.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "November 22, 2023, 04:13:19 PM",
      "body": "It depends — what does he mean by \"in order to live his life\"? Because 4 BTC is actually a good amount of money.If it's for education, then sure as long as he has thought it out. Or if it's for some other purpose that'll be worth it in the end.If it's for partying and/or dating, then uh.. probably not. Probably just sell a very small amount? You don't need to sell everything.Work-life balance is always the key; it's not one or the other.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "user87654",
      "created_time": "November 22, 2023, 04:17:35 PM",
      "body": "Quote from: Samlucky O on November 22, 2023, 02:52:06 PMQuote from: user87654 on November 22, 2023, 01:02:21 PMHello everyoneI have a very good friend who owns almost 4 Bitcoin in his early 20s.However, he told me he didn't know exactly what to do in his current situation(life).He doesn't know whether he should sell these 4 Bitcoins in the next bull run in order to live his life, since he is in his early 20s, or whether he should continue to work and stack, since the Bitcoin can continue to rise steadily.He finds himself in a mental dilemma between.I find this article as a false and fabricated story. I don't see reasons why someone with almost 4 bitcoin will be in mental delima situation according to you. To sell his bitcoin regarding the current price of bitcoin.You said he own bitcoin in his early 20s and that could be when bitcoin came out maybe 2009 2010 by now he should have been 33years old. How com he is still confused wether to sell in his early 20s or is that a typing error or am I the one who don't understand what you mean?Thanks for your input.By mental dilemma I mean that he doesn't know exactly what to do in his current situation(for the next months).I think most people probably know this, when you're in your early 20s you want to live and barely \"invest/save\" your money and therefore wait for many years.Of course he would sell Bitcoin in a bull run.I myself have already told him that if he wants to sell, perhaps only a small fraction at the top of the bull run and under no circumstances all of it.And no, he didn't buy Bitcoin when it came out in 09/10, he actually bought them over the last few years and is currently in his early 20s.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "iBaba",
      "created_time": "November 22, 2023, 04:27:46 PM",
      "body": "While I do not easily find faults in information members drop on this platform, I do not think this sits down well with me because, how is it possible to acquire that much in his early age and still finding it difficult to make a decision on what next he should do with it.I don't think Bitcoin is some dice games where you role your dice and win 4 Bitcoins. It is hard to believe that he just made that much without passing through some hard decisions or making some deliberate efforts to acquire that much. It should be easier for him to take decisions on what next to do with his hard-earned money.Today, 4 Bitcoin is around 130k dollars which is a huge money to either spend or invest. Such money are capable of causing distrust amongst people and so on, so I don't think he would be that close to you to disclose such to you.Again. It is his personal decision to make whether to continue to hold the money or to spend it. Better still, he can invest some and spend others. If I was in the situation to decide on what to do, if I am in dire need of money, I will sell some of the coins for my need and leave the rest, whether Bull Run or not.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitzizzix",
      "created_time": "November 22, 2023, 04:32:09 PM",
      "body": "Having 4 BTC at 20 years old is amazing, and my question is where did your friend get it?You should ask your friend, what is your friend's purpose for having that much Bitcoin and I'm sure your friend must have knowledge and understanding about Bitcoin because to get that much Bitcoin it takes quite a long time. Unless he is a rich man who can buy Bitcoin at any price beforehand.And my advice, because it is still 20 years old, which in my opinion is still very young, it is better to continue holding it and also accumulating it. Because in the future the price of Bitcoin will be much higher and it also has many benefits that will make his life peaceful and calm with his new family.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TakeItEasy",
      "created_time": "November 22, 2023, 05:04:57 PM",
      "body": "Quote from: user87654 on November 22, 2023, 01:02:21 PMHello everyoneI have a very good friend who owns almost 4 Bitcoin in his early 20s.However, he told me he didn't know exactly what to do in his current situation(life).He doesn't know whether he should sell these 4 Bitcoins in the next bull run in order to live his life, since he is in his early 20s, or whether he should continue to work and stack, since the Bitcoin can continue to rise steadily.He finds himself in a mental dilemma between.Basically, we know that Bitcoin is something like a safe haven.Do you have any tips or how would you behave if you were in a similar situation?Thank you for your input.And I hope I can motivate him a bit with these inputs.Friendly HODLIf he have more money without holding these bitcoin and if he didn't need these bitcoin further in the life and at his own home needs then it would be better for him to hold it since the bitcoin halving that would be happening the next year. Also if he needs them then it would be better to sell them half but if they go above the $40k and he can also gain a huge profit in it.If he didn't have any intention of selling them before the time he has given then he should hold it for a better time and I don't think that there would be a better time for him to holding it till the bitcoin halving. He may be given more than that if it really pumps and there is also another possibility if he the price goes up then he can sell them at a good price then.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Marvelman",
      "created_time": "November 22, 2023, 06:18:31 PM",
      "body": "I'm not really sure what the issue is here.  Four bitcoin doesn't seem like all that much money, even if you think about what it could be worth if crypto prices go up again.  At most we're talking a couple hundred grand if he cashed out at the next peak.  And thats definitely not set for life money, unless he lives somewhere with a super low cost of living.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GbitG",
      "created_time": "November 22, 2023, 06:59:24 PM",
      "body": "Quote from: bitzizzix on November 22, 2023, 04:32:09 PMHaving 4 BTC at 20 years old is amazing, and my question is where did your friend get it?Yeah, I also think that is how the OP friend got these bitcoins. Maybe he is lying, which I am unable to understand because if a person earns 4 bitcoins, he doesn't know what to do with them or what the purpose of earning these bitcoins is. It makes me worried that if a person has this kind of ability that he's earning 4 bitcoins, and he doesn't know his way for purpose, it is doubtful. Because, as you see, OP's friend has earned 4 bitcoins but still doesn't know what to do next. Unfortunately, it doesn't seem realistic to me that a guy earns such a large amount of bitcoin at such a young age and doesn't know what to do with it. If he really earned 4 bitcoins despite being so young, then the OP should guide him so that he is not in a mental dilemma but should hold this bitcoin even more. Because Bitcoin halving is also coming, and it will be expected from the Bitcoin price that it might hit 150k, your friends can earn profit by selling this Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "decodx",
      "created_time": "November 22, 2023, 07:17:18 PM",
      "body": "Quote from: user87654 on November 22, 2023, 04:59:52 PMSince he has been working towards this amount for a really long time, I understand the despair of my friend's long wait.<...>I would ask him straight up: Dude, what would you even do if you didn't have to work no more? Does he really wanna spend his days drinking cocktails? Or does he have bigger dreams? Other stuff he cares about? I'd tell him to imagine life without the safety net - no bitcoins, no steady job and  maybe thatll help clarify what he really wants in life. Guide him through this little crisis.  He's gotta sort out his priorities.  Figure out if it's experiences and meaning he's after, or just the financial stability.  I hope he finds some clarity.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Renampun",
      "created_time": "November 22, 2023, 07:25:24 PM",
      "body": "Quote from: user87654 on November 22, 2023, 01:02:21 PMHello everyoneI have a very good friend who owns almost 4 Bitcoin in his early 20s.However, he told me he didn't know exactly what to do in his current situation(life).He doesn't know whether he should sell these 4 Bitcoins in the next bull run in order to live his life, since he is in his early 20s, or whether he should continue to work and stack, since the Bitcoin can continue to rise steadily.He finds himself in a mental dilemma between.Basically, we know that Bitcoin is something like a safe haven.Do you have any tips or how would you behave if you were in a similar situation?Thank you for your input.And I hope I can motivate him a bit with these inputs.Friendly HODLThe decision to sell the bitcoin you own is actually personal, you can't influence people not to sell or buy, you can only advise them whether they really want to sell the bitcoin they are currently holding!! when you don't need money urgently, you shouldn't sell the bitcoin you have, you should be able to restrain your desire to exchange the bitcoin you have for fiat, but if you do have a price target (such as selling the bitcoin you are holding in the next bullish) then you can freely sell the bitcoin, all the decisions you make must be on target but remember not to be complacent when you are still young.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Upgrade00",
      "created_time": "November 22, 2023, 07:41:07 PM",
      "body": "Quote from: user87654 on November 22, 2023, 01:02:21 PMHe doesn't know whether he should sell these 4 Bitcoins in the next bull run in order to live his life, since he is in his early 20s, or whether he should continue to work and stack, since the Bitcoin can continue to rise steadily.• He didn't buy Bitcoin before 2015 when it was cheap, but instead accumulated over the past couple of years. This means that he has a good source of income to live on and invest with as well.• He doesn't plan to sell bitcoins inorder to reinvest into something else. The phrase \"live his life\" sounds a lot like satisfying personal indulgence.My advice will be to not sell his bitcoins and even if he does sell them, it will be to short his coins; selling at the top and buying back when the price drops. But he should not sell without any investment plan.He doesn't even have to keep stacking bitcoins, there are other investments he can explore if he doesn't want to go all into Bitcoin. He can also steadily take out some from his income to live his life, without liquidating his principal investment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackHatCoiner",
      "created_time": "November 22, 2023, 07:49:30 PM",
      "body": "Does he have a job? 'Cause if he's thinking of spending the bitcoin for the bills, then no. Do something constructive, useful. If he's thinking of buying himself a car, or a house with the bitcoin (i.e., he might not want to live with his parents), then it's up to him to weight the tradeoffs. If he's held 4 BTC up until this point, then chances are he knows what he owns. I believe he knows he doesn't need to sell everything, at least I wouldn't do that. Maybe a couple of thousands, and the rest saved for the future.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SatoPrincess",
      "created_time": "November 22, 2023, 07:51:36 PM",
      "body": "Quote from: user87654 on November 22, 2023, 01:02:21 PMHe doesn't know whether he should sell these 4 Bitcoins in the next bull run in order to live his life, since he is in his early 20s, or whether he should continue to work and stack, since the Bitcoin can continue to rise steadily.He finds himself in a mental dilemma between.I feel this is the most important part of the conversation. I’m not going to question the authenticity of this story, I believe everyone can put two and two together and come to their own conclusions. So you say your friend is in his early 20s and somehow has 4 bitcoins (approximately $148,765 today) in his possession. That’s a lot of money but I think he is way to young to be thinking about retirement. Depending on where he resides and his lifestyle, there is a possibility he could lavish all the money in a few years. My advice would be for him to explore other ways to increase his income, he could start a business or invest in a startup. He’s already ahead of many of his peers, he should not lose his advantage trying to impress people on instagram.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dothebeats",
      "created_time": "November 22, 2023, 07:52:39 PM",
      "body": "If I was your friend, I'd sell half, start a small business, and keep the other half and continue to add something to the pot in the coming years. That's what I personally did, and it's giving me a lot of financial benefits and freedom that I wouldn't get on any other investments out there. The thought of going broke never crossed my mind again after selling some of the coins I have and establishing my printing business, and I still maintain my high-paying job since I don't like not doing anything for the whole day.Your friend should also have an excellent self-control in order to make sure that he'll not end up spending the proceeds of his sale into something unnecessary. Even if he has already a good chunk on his disposal, if he doesn't know how to control his spending, it still wouldn't be something that will work for him if he does not take the initiative for it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Raflesia",
      "created_time": "November 22, 2023, 08:01:48 PM",
      "body": "Having 4 bitcoins at a young age is very good but of course during the collection of 4 bitcoins he has I think he is not that weak and confused when determining life goals because after all he must also realize that collecting 4 btc is not something easy unless he is born into a rich family.If he comes from a simple family that has an economic situation that is not too good, collecting 4 bitcoins is one of the big things and he can already control his emotions and money management well so it is something silly if he still says he is confused about the future because I think when collecting the 4 btc he currently has, he already knows from the beginning what his goals are and the economic management he has.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "electronicash",
      "created_time": "November 22, 2023, 08:07:04 PM",
      "body": "some kids are just lucky to have gotten some BTC while the price was just very affordable. it's however unbelievable that he doesn't know what to do with his life when he has the privilege of doing what he wants to do. he is young and has money.he could just wait til the price goes $100k and just pursue a degree for now.  financial independence can actually make a person think clearly but if he is unstable despite being young and having no huge responsibility, he needs a girl.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}