{
  "id": "topic_5438813",
  "title": "Zanab247",
  "author": "Zanab247",
  "created_time": "February 08, 2023, 03:39:39 PM",
  "content": "Since the year started with a good results by moving from $20k to $24k this year, show that the price of BTC and crypto will move higher to satisfy investors soon. Now that the month is moving faster and investors need to think faster so that they will not miss their reward at the end of the year. The price of BTC just drop down to $22k few days ago, which is another opportunity for those that missed last year not to invest in a stable coins to do it now because, the price of BTC will surely reach $80k before the end of this year 2023.Are you sure investors will experience $80 this year?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5438813",
  "comments": [
    {
      "author": "Charles-Tim",
      "created_time": "February 08, 2023, 03:44:31 PM",
      "body": "Quote from: Zanab247 on February 08, 2023, 03:39:39 PMSince the year started with a good results by moving from $20k to $24k this yearOn January 1st 2023, bitcoin was around $16500.Quote from: Zanab247 on February 08, 2023, 03:39:39 PMThe price of BTC just drop down to $22k few days ago, which is another opportunity for those that missed last year not to invest in a stable coins to do it now because, the price of BTC will surely reach $80k before the end of this year 2023.The price of bitcoin is still low, you can continue to buy because all-time-high is possible, but not this year.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "February 08, 2023, 04:05:37 PM",
      "body": "Why are you so certain that we will continue to grind up just because we had a jump from 20k to 24k? A 20% increase in price of bitcoin or literally any asset at all doesn't guarantee anything.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "February 08, 2023, 04:50:42 PM",
      "body": "Regardless of the fact that the OP is not quite accurate with some facts, and that he mentions some kind of investment in stablecoins, he is obviously under the influence of some \"crypto expert\" who is playing with numbers just to attract as many followers as possible on a social network or YT channel. However, anything is possible when it comes to Bitcoin, but I am much more moderate with the numbers when it comes to the highest possible price this year.In one of the polls I think I voted for a max price of $40k by the end of this year. Maybe I'm wrong, but the new ATH before the halving doesn't seem like a viable option.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wapfika",
      "created_time": "February 08, 2023, 04:59:02 PM",
      "body": "Quote from: Zanab247 on February 08, 2023, 03:39:39 PMAre you sure investors will experience $80 this year?It will be very hard for that prize to reach given the circumstances that Bitcoin failed to reach it last year despite inflation is not yet brought up while lots of institutional investors buy in. Right now, most of the institutional investors and VC are already bleeding with loss. I doubt they will try to inject more money the moment the price reach to the level before the price ATH because this trapped whales will surely exit to take profit. 80k is very hard to attain but I won’t deny its chance to happened even if it’s small because Bitcoin reach its new ATH before during pandemic.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nrcewker",
      "created_time": "February 08, 2023, 05:01:29 PM",
      "body": "Quote from: mk4 on February 08, 2023, 04:05:37 PMWhy are you so certain that we will continue to grind up just because we had a jump from 20k to 24k? A 20% increase in price of bitcoin or literally any asset at all doesn't guarantee anything.Absolutely, this might be just some market manipulations done by big whales. But what I can see is that currently Bitcoins are at 22,900$. It has fell down in price if we compare to last week. But this doesn’t mean that Bitcoins will completely collapse now. As we know before any big rise, there is a small setback or fall. So this might be the same. Moreover if we see the OP’s doubt, then let me make clear that, the price majorly increases when the demand of the coin increases. So more demand will ultimately lead the price to rise up. So anything is possible to be honest.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Coyster",
      "created_time": "February 08, 2023, 05:20:13 PM",
      "body": "Quote from: Zanab247 on February 08, 2023, 03:39:39 PMThe price of BTC just drop down to $22k few days ago, which is another opportunity for those that missed last year not to invest in a stable coins to do it now because, the price of BTC will surely reach $80k before the end of this year 2023.Bitcoin is not a stablecoin, it isn't pegged to any other currency or commodity, in case you do not quite understand the difference, a good example of a stablecoin is USDT, you can research about it to know how they work and the difference between them and Bitcoin.Having said that, as for if Bitcoin can touch 80k this year, i'd say no, it doesn't mean i can't be wrong, i just don't think Bitcoin can get to that price when we are yet to experience the next Bitcoin halving. Bitcoin is a long term coin and it'd definitely get to that price, but since nobody can be sure of when, all one can do is continue to accumulate for now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "$crypto$",
      "created_time": "February 08, 2023, 05:32:18 PM",
      "body": "Just because of a little price jump you conclude at the end of this year bitcoin to $80k it is new ATH again but what might happen before the halving? I don't think too much like that, even though we know what will happen later, no one will know. Obviously, I always look at the previous history of Bitcoin, which is a 4-year cycle.Bitcoin is not a stablecoin, the proof is that this coin fell drastically 70% from the previous ATH, so you need to tell investors this is only for opportunities at low prices and one day there may be another chance to go up but in the long term not for the current year.I don't think this year will be ATH but my prediction is $30k-$50k still very likely depending on the news situation out there.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "February 08, 2023, 05:54:08 PM",
      "body": "Quote from: Nrcewker on February 08, 2023, 05:01:29 PMAbsolutely, this might be just some market manipulations done by big whales. But what I can see is that currently Bitcoins are at 22,900$. It has fell down in price if we compare to last week. But this doesn’t mean that Bitcoins will completely collapse now. As we know before any big rise, there is a small setback or fall. So this might be the same. Moreover if we see the OP’s doubt, then let me make clear that, the price majorly increases when the demand of the coin increases. So more demand will ultimately lead the price to rise up. So anything is possible to be honest.Doesn't really matter much regardless if the price movement was caused by whales, or actual market interest. You still can't make market decisions based off that move alone.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bittraffic",
      "created_time": "February 08, 2023, 05:56:51 PM",
      "body": "It won't make me sad to see BTC at $80k this year that's for sure. But $80k is just way ahead of halving. This hasn't happened in the past where the price exceeds its ATH before the halving. If the price goes up because of the debt default or because the government hurrying the crypto regulations, something is really shifting that we might not even benefit even when we hold stablecoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "February 08, 2023, 06:02:18 PM",
      "body": "What you are trying to say is not a prediction, but rather a form of astrology and divination of the unseen, which is either deception or based on emotions and hopes that will not be fulfilled, and if they happen, chance will play a role.It is difficult, and with all the current uncertainty, to break the previous peak. Therefore, the healthier the growth, the better, and it is better for you as an investor to build your accounts on the bottom, not the top.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sterbens",
      "created_time": "February 08, 2023, 06:24:58 PM",
      "body": "It might happen, I can't say it's impossible, on the other hand it looks like it would be very difficult to achieve. The reason is that even though all possibilities can happen, we have to be realistic with price movements that fast. Maybe you are too ambitious to see bitcoin prices that high in a very short time. I personally really believe that bitcoin will be able to reach that price, but it will be a long journey in my opinion.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NeuroticFish",
      "created_time": "February 08, 2023, 06:25:40 PM",
      "body": "Quote from: Zanab247 on February 08, 2023, 03:39:39 PMSince the year started with a good results by moving from $20k to $24k this yearAs said, you've started with inaccuracies. Even more, the tiny 4k movement means nothing in the grand scheme of things. Just look at the whole price chart.Quote from: Zanab247 on February 08, 2023, 03:39:39 PMbecause, the price of BTC will surely reach $80k before the end of this year 2023.Are you sure investors will experience $80 this year?So you fist say that people should take advantage of the low price because it'll rise to 80k... then kinda ask us if it's (surely) so?No, I'm not sure of any price level for Bitcoin. And, to go on the actual speculation area, I don't even expect 80k this year. I would be happy even with 50k. The 80k I expect for next year though. But again, what I expect and what will happen... those may be wildly different things.So it's nice to tell people be careful and don't miss the train, but on the other hand make sure you remind them only invest what they afford to lose, else if tomorrow the price will go a tad lower, they'll already panic and sell.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptomaniac_xxx",
      "created_time": "February 08, 2023, 06:43:17 PM",
      "body": "Quote from: Zanab247 on February 08, 2023, 03:39:39 PMSince the year started with a good results by moving from $20k to $24k this year, show that the price of BTC and crypto will move higher to satisfy investors soon. Now that the month is moving faster and investors need to think faster so that they will not miss their reward at the end of the year. The price of BTC just drop down to $22k few days ago, which is another opportunity for those that missed last year not to invest in a stable coins to do it now because, the price of BTC will surely reach $80k before the end of this year 2023.Are you sure investors will experience $80 this year?Isn't it too big for a prediction wherein we are still in the bear market? So I will say no, technically, as a I have said, the market is still in the bear market although we have like 40% increased in January.But after that, the price cannot go high above $25k, maybe the buyers are now exhausted and are waiting for a good news before they pour their money. So we might trade sideways again in the next quarter. So this is just my personal opinion and not a financial advise, I'm not seeing $80k, most likely a good estimate should be around $30k-$40k.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CoinEraser",
      "created_time": "February 08, 2023, 08:48:33 PM",
      "body": "Wow, $80,000 this year? That's very optimistic. Yes, that would be nice, but we certainly can't expect an price like this this year. Although I'm in a positive mood for this year, I can't imagine such an price with the best will in the world. If we get to $40,000 this year we'll be happy, but I actually think $80,000 is impossible since the next halving is about a year from now.Just because the year has started positively so far doesn't mean it will continue. So far it doesn't feel like a bull run for me.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Welsh",
      "created_time": "February 08, 2023, 08:55:25 PM",
      "body": "Quote from: mk4 on February 08, 2023, 04:05:37 PMWhy are you so certain that we will continue to grind up just because we had a jump from 20k to 24k? A 20% increase in price of bitcoin or literally any asset at all doesn't guarantee anything.In fact, someone could argue that if the price jumps up suddenly or a small period then it could potentially be subject to a bounce back or a correction. So yeah, quick rises actually make me worry that a correction will happen, and then users react to that negatively further driving down the price. Unfortunately, we're in one of those scenarios where Bitcoin will react to even the smallest negative news. I don't know if 4k in a matter of weeks is going to be enough for a correction, but definitely if it jumps have 1,000s in a few days I'd be expecting a correction at some point. Although, this is probably the most positive I've seen this section in a while. It's nice to see, instead of all the gloom, and doom recently.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kamvreto",
      "created_time": "February 08, 2023, 09:32:02 PM",
      "body": "Quote from: Wapfika on February 08, 2023, 04:59:02 PMQuote from: Zanab247 on February 08, 2023, 03:39:39 PMAre you sure investors will experience $80 this year?~snip~80k is very hard to attain but I won’t deny its chance to happened even if it’s small because Bitcoin reach its new ATH before during pandemic.don't be too pessimistic, bitcoin is still able to reach a price of $ 80k but not in the near future because the market is still not allowing it. A rapid increase will also have an adverse effect in the long term. Correction is sure to occur otherwise, expecting prices below $10k is possible. But the bitcoin market is not easy to predict. Currently, to reach the last ATH point, it still needs stronger hype.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ScamViruS",
      "created_time": "February 08, 2023, 09:35:04 PM",
      "body": "Quote from: Zanab247 on February 08, 2023, 03:39:39 PMSince the year started with a good results by moving from $20k to $24k this year, show that the price of BTC and crypto will move higher to satisfy investors soon. Now that the month is moving faster and investors need to think faster so that they will not miss their reward at the end of the year. The price of BTC just drop down to $22k few days ago, which is another opportunity for those that missed last year not to invest in a stable coins to do it now because, the price of BTC will surely reach $80k before the end of this year 2023.Are you sure investors will experience $80 this year?When the market is in positive movement, many people start discussing such big predictions. Bitcoin has started this year on a very positive note, which certainly makes us optimistic that Bitcoin can achieve any major targets this year. But it should also be remembered that if the market is pumped quickly, there is a possibility of a major correction. But I think it may take some time to see new ATH like till next year. But I wouldn't be surprised if Bitcoin goes to $80k this year because Bitcoin can do things we don't expect.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "decodx",
      "created_time": "February 08, 2023, 09:50:23 PM",
      "body": "Yeah, it's hard to say what the price of Bitcoin gonna be this year. Bitcoin market is so crazy and can change fast with any news or event. Just because price go up doesn't mean it gonna hit new high by end of year.My thought is, price gonna be around $40k to $50k, depends on market situation and news. But like you said, no one really know what's gonna happen.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "goaldigger",
      "created_time": "February 08, 2023, 09:55:40 PM",
      "body": "As much as we want to see new ATH this year, its too impossible because we are just starting to recover from bear and there’s no market that can recover that high instantly. This is just recovery year and I only expect Bitcoin price at the level of $30k, and next year will be a good one because that can be the start of the real bull trend. There’s a lot of uncertainties in this market, just take profit always and don’t be greedy waiting for the peak because you might missed a lot of opportunities.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}