{
  "id": "topic_5506547",
  "title": "Tyke",
  "author": "Tyke",
  "created_time": "August 19, 2024, 12:19:52 AMLast edit: September 12, 2024, 09:20:43 AM by Tyke",
  "content": "Original Thread: https://bitcointalk.org/index.php?topic=5475400.0Only 3 weeks until 'The Bitcoin History Book 200-2024' is self-published!If you want your name in the book, please contact me.284 A4 pages of historical content, price metrics, wallet upgrade information, and much more!It is a book like nothing else.  Once read, there is no excuse for the reader to forget what has happened since inception.Last chance people!!!",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5506547",
  "comments": [
    {
      "author": "SamReomo",
      "created_time": "August 21, 2024, 08:01:33 PM",
      "body": "Good to know that you're going to self publish the Bitcoin history book that you have been writing for a long time. I read some pages when it was still in its mid stages and there were formatting issues back then but now it seems that you have fixed all those issues and going to publish that awesome book for the readers.I wish you best of luck and hope you may get some good sales for your book.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Tyke",
      "created_time": "August 26, 2024, 11:11:12 PM",
      "body": "Quote from: SamReomo on August 21, 2024, 08:01:33 PMGood to know that you're going to self publish the Bitcoin history book that you have been writing for a long time. I read some pages when it was still in its mid stages and there were formatting issues back then but now it seems that you have fixed all those issues and going to publish that awesome book for the readers.I wish you best of luck and hope you may get some good sales for your book.Thank you",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dzungmobile",
      "created_time": "August 27, 2024, 05:18:33 AM",
      "body": "Tyke, after you publishing your book, you can consider to join this platform.https://ccfound.com/enIt has places for courses, books and so on and I believe that your classic book on Bitcoin history deserves to be welcomed there. Of course, ccfound is a young platform that was built in the last market cycle and it has rooms for further developments. Your book can be part of the platform history too.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "The Sceptical Chymist",
      "created_time": "August 27, 2024, 05:28:10 AM",
      "body": "Oh.....snap!  My man, congrats on finishing this!  My memory is absolutely shot, so I barely remember the original thread but it's obvious your book is a labor of love and I respect that greatly.I've not read all the way through that thread, so if you would pardon my laziness:  where is this going to be available for sale?  I don't care to have my name in it, I just want to buy a copy if possible.  That orange theme rocks.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Tyke",
      "created_time": "September 06, 2024, 02:21:09 AM",
      "body": "Quote from: The Sceptical Chymist on August 27, 2024, 05:28:10 AMOh.....snap!  My man, congrats on finishing this!  My memory is absolutely shot, so I barely remember the original thread but it's obvious your book is a labor of love and I respect that greatly.I've not read all the way through that thread, so if you would pardon my laziness:  where is this going to be available for sale?  I don't care to have my name in it, I just want to buy a copy if possible.  That orange theme rocks.Thank you. The book will be released on 12th September 2024. Keep an eye on Amazon.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SickDayIn",
      "created_time": "September 06, 2024, 03:09:47 AM",
      "body": "Congratulations! I read a few of your earlier releases and found it very beneficial. Releasing it on Amazon is a good idea. Have you considered Audible too? I imagine you'll also get a few print copies made for personal keeping also?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dansus021",
      "created_time": "September 06, 2024, 07:55:18 AM",
      "body": "Quote from: Tyke on September 06, 2024, 02:21:09 AMThank you. The book will be released on 12th September 2024. Keep an eye on Amazon. I just DM you I Hope I still have time hahaha. Tho I just want to say Congratulation for your Book.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitbollo",
      "created_time": "September 06, 2024, 08:16:23 AM",
      "body": "@Tyke Any chance for a collector to get some signed copies?   Maybe I can also send some copies to my exhibition scheduled for September's end... https://bitcointalk.org/index.php?topic=5503159.0https://filrougeproject.it/evento/mostra-cryptoarte-e-bitcoin/If this could be possible, please reach me in DM or telegram @user276514",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fivestar4everMVP",
      "created_time": "September 06, 2024, 10:07:31 AM",
      "body": "A big congratulations to you Tyke on the prospective self publishing of your long awaited book, I sure would love to have a hard copy of the book once it's available and ready to ship out worldwide, I hope you are able to ship to my country, Nigeria.And by the way, I shut you a dm, unfortunately, I am just coming across this thread for the very first time today, thought it's new thread but checking the date it was posted, I discovered it's way back last month, I am really hoping my dm is not coming in late, looking forward to a response.Thank you very much and once again, congratulations and do have a lovely day.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Tyke",
      "created_time": "September 07, 2024, 10:42:22 AM",
      "body": "Quote from: Fivestar4everMVP on September 06, 2024, 10:07:31 AMA big congratulations to you Tyke on the prospective self publishing of your long awaited book, I sure would love to have a hard copy of the book once it's available and ready to ship out worldwide, I hope you are able to ship to my country, Nigeria.And by the way, I shut you a dm, unfortunately, I am just coming across this thread for the very first time today, thought it's new thread but checking the date it was posted, I discovered it's way back last month, I am really hoping my dm is not coming in late, looking forward to a response.Thank you very much and once again, congratulations and do have a lovely day. Super. I hope the book becomes appreciated",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Tyke",
      "created_time": "September 09, 2024, 10:59:51 PM",
      "body": "Two days!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "348Judah",
      "created_time": "September 11, 2024, 03:39:14 PM",
      "body": "This a impressive to see and as you have already made a decision on taking this channel over the project, its in no doubt that success awaits, also for more clarifications on the name inclusion on the book and the availability of the book itself, is there any condition attached to having ones name on it, secondly, about the book availability, is it going to be online, physical and how much does get one may cost.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Tyke",
      "created_time": "September 11, 2024, 03:43:47 PM",
      "body": "Quote from: 348Judah on September 11, 2024, 03:39:14 PMThis a impressive to see and as you have already made a decision on taking this channel over the project, its in no doubt that success awaits, also for more clarifications on the name inclusion on the book and the availability of the book itself, is there any condition attached to having ones name on it, secondly, about the book availability, is it going to be online, physical and how much does get one may cost.The paperback version has already been submitted for review. It should be available later today or early tomorrow. I will post a link as soon as it is on Amazon.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "albon",
      "created_time": "September 11, 2024, 06:54:47 PM",
      "body": "Quote from: Tyke on September 11, 2024, 03:43:47 PMThe paperback version has already been submitted for review. It should be available later today or early tomorrow. I will post a link as soon as it is on Amazon.I have been waiting for this news for a long time, Chris.We hope that this book, which took so much effort from you, achieves remarkable success and helps the crypto community learn about the history of Bitcoin from the past to the present in a smooth and easy way, increases their understanding, and enriches their information and Hopefully, it will be remembered in the crypto sector as one of the valuable resources. For your information, I am following your official Amazon account and plan to be one of the buyers of this book. Best of luck to you, brilliant author!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JiiBs",
      "created_time": "September 11, 2024, 07:47:22 PM",
      "body": "Quote from: The Sceptical Chymist on August 27, 2024, 05:28:10 AMOh.....snap!  My man, congrats on finishing this!  My memory is absolutely shot, so I barely remember the original thread but it's obvious your book is a labor of love and I respect that greatly.It’s motivating to see just how the rest of you that have been ahead are taking Bitcoin. It goes to stress on how this has impacted life’s and the life’s it may get impact like myself and the forks that would come as time goes. Don’t know how the book is coming but, am so eager for some abstract on what to expect other than names but, it’s okay to live in the suspense. It would be a memorable one however sure to go down in the history as it says.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "famososMuertos",
      "created_time": "September 11, 2024, 10:07:27 PM",
      "body": "Quote from: Tyke on September 06, 2024, 02:21:09 AM:://::Thank you. The book will be released on 12th September 2024. Keep an eye on Amazon. +1Maybe this is my first post on the topic but I have been reading it. I am glad you have a release date. All the best. I am sure your idea makes sense to many, but in this forum we are anonymous even with our emotions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Tyke",
      "created_time": "September 12, 2024, 07:17:20 AM",
      "body": "https://www.amazon.com/dp/B0DGT2KRYV/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Tyke",
      "created_time": "September 12, 2024, 09:20:07 AM",
      "body": "Published!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JiiBs",
      "created_time": "September 12, 2024, 09:46:24 AM",
      "body": "Quote from: Tyke on September 12, 2024, 07:17:20 AMhttps://www.amazon.com/dp/B0DGT2KRYV/Oh nice!I checked it out and it seems all there is to reading your book is a hard copy and having to import it for foreign nationals is the only option at the time.Any chance of having maybe a soft copy PDF, even a paid version or perhaps, it’s subject to piracy.Either way, congrats on a successful publications and hope those who needs this finds it to enrich themselves with the knowledge there in.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}