{
  "id": "topic_5404829",
  "title": "eightdots",
  "author": "eightdots",
  "created_time": "July 01, 2022, 06:48:06 PMLast edit: September 14, 2022, 06:38:45 PM by eightdots",
  "content": "CHP Milletvekili Antmen, KYK yurtlarına %80 zam yapıldığını söyledi. Ayrıca KYK'da kalan öğrencilerden 478 TL tutarında depozito farkı istendi.Bilgi: Öğrencilerin aldığı burs ve kredi fiyatı: 850 TL. Geçen ayki KYK yurt ücreti: 450 TL. Zamla birlikte 850 TL.https://twitter.com/pusholder/status/1542937336887099395?ref_src=twsrc%5Egoogle%7Ctwcamp%5Eserp%7Ctwgr%5EtweetEdit: Bugün yapılan açıklamada (14.09.2022), Cumhurbaşkanı Erdoğan ''Yurt ücretlerinde bir değişiklik olmayacağının müjdesini buradan vermek isterim. 250-450 TL arasındaki ücretlerde değişiklik olmayacak.'' dedi.https://www.milliyet.com.tr/bilgi-rehberi/kyk-yurt-ucreti-ne-kadar-oldu-2022-2023-kyk-yurt-fiyatlari-aciklandi-mi-6824873/3",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5404829",
  "comments": [
    {
      "author": "mandown",
      "created_time": "July 01, 2022, 07:19:54 PM",
      "body": "Quote from: eightdots on July 01, 2022, 03:22:18 PMAsgari ücreti artırmak yerine şu fırsatçılara çözüm bulmaları lazım.Ev sahipleriZincir marketlerAraç alım satım yapan her kurum ve şahısTrafik sigortası şirketleriTekelleşen elektrik dağıtım şirketleriGSM şirketleriİnternet sağlayıcılarıBu mesajınızdaki gibi yurtlarda fırsatçımıdır? Yoksa neden zam yaptılar.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "eightdots",
      "created_time": "July 01, 2022, 07:27:47 PM",
      "body": "Quote from: mandown on July 01, 2022, 07:19:54 PMQuote from: eightdots on July 01, 2022, 03:22:18 PMAsgari ücreti artırmak yerine şu fırsatçılara çözüm bulmaları lazım.Ev sahipleriZincir marketlerAraç alım satım yapan her kurum ve şahısTrafik sigortası şirketleriTekelleşen elektrik dağıtım şirketleriGSM şirketleriİnternet sağlayıcılarıBu mesajınızdaki gibi yurtlarda fırsatçımıdır? Yoksa neden zam yaptılar.Asgari ücrete %25 zam verip, asgari ücretle geçinen bir ailenin evladına ödediği yurt ücretine %80 zam yapanlara fırsatçı demeyen var mıdır? Demiyorsan eğer sadece oto bayiilerine fırsatçı diyip diğerleri fırsatçı değil diyenlerle yolunuza devam edebilirsiniz",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gerceklerisoyleyen",
      "created_time": "July 01, 2022, 07:47:44 PM",
      "body": "Az içsinler.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lachrymose",
      "created_time": "July 01, 2022, 07:53:20 PMLast edit: July 01, 2022, 08:05:40 PM by Lachrymose",
      "body": "CDS’nin 870, enflasyonun %160 olduğu ülkede fırsatçılar olduğuna inanmak da ne bileyim.GSM operatorune aylik $4.7, 1000 gbit internet aboneliğine aylik $6.7 dolar ödüyorum mesela bu onlar için bir firsat midir? Verginin %200 olduğu ülkede trafik sigortacilari fırsatçı mıdır? Evlerin 100 senede roi olduğu ülkede ev sahipleri firsatci midir? Dükkan basina ayda sadece 30 bin lira kâr eden Bim firsatci midir?Bu ülke firsatlarla doluysa firsatlari değerlendirmek isteyen yatirimcilar neden buraya gelmiyorlar.. Neden firsatlari degerlendirmek yerine buradan kaçiyorlar?KYK yurdu %80 zam yapmis mesela (haber kesin degil); yapsa dahi firsatci diyebilir miyiz bunlara? neye %80 zam gelmedi ki?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "husdemba",
      "created_time": "July 01, 2022, 08:05:55 PM",
      "body": "Quote from: Lachrymose on July 01, 2022, 07:53:20 PMCDS’nin 870, enflasyonun %160 olduğu ülkede fırsatçılar olduğuna inanmak da ne bileyim.GSM operatorune aylik $4.7, 1000 gbit internet aboneliğine aylik $6.7 dolar ödüyorum mesela bu onlar için bir firsat midir? Verginin %200 olduğu ülkede trafik sigortacilari fırsatçı mıdır? Evlerin 100 senede roi olduğu ülkede ev sahipleri firsatci midir? Dükkan basina ayda sadece 30 bin lira kâr eden Bim firsatci midir?Bu ülke firsatlarla doluysa firsatlari değerlendirmek isteyen yatirimcilar neden buraya gelmiyorlar.. Neden firsatlari degerlendirmek yerine buradan kaçiyorlar?Söylediklerinize bütünüyle katılıyorum. Bugün verilen ara zam bile aslında bize ‘Yarın, bugünden daha iyi olmayacak.’ mesajı vermeli. KYK zaten bulduğu yere bina dikmekten de artık zarara geçmiş olacak ki yine zenginlerin yaptığı hatalar fakirlerin cebinden karşılanacak..",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mandown",
      "created_time": "July 01, 2022, 08:09:30 PM",
      "body": "@eightdots bilmemek değil de öğrenmemek ayıp  Quote from: eightdots on July 01, 2022, 07:27:47 PMQuote from: mandown on July 01, 2022, 07:19:54 PMQuote from: eightdots on July 01, 2022, 03:22:18 PMAsgari ücreti artırmak yerine şu fırsatçılara çözüm bulmaları lazım.Ev sahipleriZincir marketlerAraç alım satım yapan her kurum ve şahısTrafik sigortası şirketleriTekelleşen elektrik dağıtım şirketleriGSM şirketleriİnternet sağlayıcılarıBu mesajınızdaki gibi yurtlarda fırsatçımıdır? Yoksa neden zam yaptılar.Asgari ücrete %25 zam verip, asgari ücretle geçinen bir ailenin evladına ödediği yurt ücretine %80 zam yapanlara fırsatçı demeyen var mıdır? Demiyorsan eğer sadece oto bayiilerine fırsatçı diyip diğerleri fırsatçı değil diyenlerle yolunuza devam edebilirsiniz Açıklanan enflasyon oranında ülkenin yarısından fazlasının aldığı maaşa zam yapılmaması şaşırtmıyorda yurtlara %80 yapılması mı şaşırtıyor. Bakın bunlarda devlet yurtları enflasyon %60 ama zam %80 şaka gibi.Faiz artışının neden ihtiyaç olduğunu basit birkaç google aramasında bulabilirsiniz. 7/24 karşılıksız para basılırken kimsenin sesi çıkmıyor850 lira dediğiniz 51 dolar yapıyor yani geceliği 1.7 usd bırakında 1 kişinin 1 gece kalma bedeli 1.7 usd olsun.Benzinin fiyatı zaten belli 2 doların altında bıraksalar emin ol 60 liraya gitmemesi için en ufak sebep yok..Sebze meyve fiyatları  5 cent'e satılacak hali yok hepsi hepsi 50 cent çoğu sebzenin kg fiyatıSen paranın değerini koruma ekonominin içine sıç iktidar kanun kural tanımasın anayasayı kimse umursamasın zengin ve yandaşın kirası 20 yıl sonrasına bırakılsın sonra vay efendim bu zam ne. Bak 1kg pişmiş ekmek yıl başında 10 liraydı şimdi 20 lira2021 de 2800 liralık asgari ücret oldu şimdi 5500 lira.Fırsatçı kim göremedim.Zenginlerden vergi alınmadığı ve  yandaşların vergisinin çatır çatır silindiği bir dönemdeyiz. Vergi silinirse herşey olur.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "eightdots",
      "created_time": "July 01, 2022, 08:14:37 PM",
      "body": "Quote from: Lachrymose on July 01, 2022, 07:53:20 PMCDS’nin 870, enflasyonun %160 olduğu ülkede fırsatçılar olduğuna inanmak da ne bileyim.GSM operatorune aylik $4.7, 1000 gbit internet aboneliğine aylik $6.7 dolar ödüyorum mesela bu onlar için bir firsat midir? Verginin %200 olduğu ülkede trafik sigortacilari fırsatçı mıdır? Evlerin 100 senede roi olduğu ülkede ev sahipleri firsatci midir? Dükkan basina ayda sadece 30 bin lira kâr eden Bim firsatci midir?Bu ülke firsatlarla doluysa firsatlari değerlendirmek isteyen yatirimcilar neden buraya gelmiyorlar.. Neden firsatlari degerlendirmek yerine buradan kaçiyorlar?Siz diyorsunuz ki bunların ortaya çıkmasına sebep olan kişi ya da kişiler hakkında hepimiz hemfikiriz ama olay bize dokununca bu saydığımız şirketler kurumlar ve sizin gibi ev sahipleri piyasaya oranla zam yapıyorlar ve haklılar. Enflasyonun bu denli artmadığı zamanlarda bile yukarıda saydığınız hizmetlerin bedeli hak ettiğinden fazlaydı. Ama hepsinden örnek vermiyip sizin üzerinizden örnek vereyim. Siz şunu deseniz hadi bir ihtimal yanlı bakmıyor diyebilirim. Benim 500 binlik evim şu an 2 milyon ediyorken susayım ama kiracı bulamadığımda konuşayım diyorsunuz. Tamam enflasyon karşısında elbette zam yapacaklar kendi durumlarını koruyacaklar ama bunun bir oranı bir değeri vardır. Hani siz ev kiralama konusunda kimseyi kırmak istemiyorum diyip ölçülü davranmaya çalışıyorsunuz ya, ben de diyorum ki bu saydıklarımın hangisi ülkede ölçülü davranmış da şimdiki durumdan fazlasıyla faydalanmaya çalışmıyor? Quote Bu mesajınızdaki gibi yurtlarda fırsatçımıdır? Yoksa neden zam yaptılar. Burada sorulan soruya da cevap vermiş olayım. Bu sayılan kurumların hangisi gerçek anlamda insanların enflasyondan etkilendiği kadar etkilendi? Cevap belli. Hangi hakkaniyetli oranda zam yaptı? Cevap belli. Elinizdeki mal afaki bir oranda değerlendiğinde buna sevinen de fırsatçıdır önceki postta yazdığım kurumlar da. Herkes etkilendi kabul ettiğim nokta bu ama sadece birini ayırıp da diğerleri fırsatçılık yapmıyor demek yanlış fikrimce.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "eightdots",
      "created_time": "July 01, 2022, 08:16:29 PM",
      "body": "Quote from: mandown on July 01, 2022, 08:09:30 PM@eightdots bilmemek değil de öğrenmemek ayıp  Quote from: eightdots on July 01, 2022, 07:27:47 PMQuote from: mandown on July 01, 2022, 07:19:54 PMQuote from: eightdots on July 01, 2022, 03:22:18 PMAsgari ücreti artırmak yerine şu fırsatçılara çözüm bulmaları lazım.Ev sahipleriZincir marketlerAraç alım satım yapan her kurum ve şahısTrafik sigortası şirketleriTekelleşen elektrik dağıtım şirketleriGSM şirketleriİnternet sağlayıcılarıBu mesajınızdaki gibi yurtlarda fırsatçımıdır? Yoksa neden zam yaptılar.Asgari ücrete %25 zam verip, asgari ücretle geçinen bir ailenin evladına ödediği yurt ücretine %80 zam yapanlara fırsatçı demeyen var mıdır? Demiyorsan eğer sadece oto bayiilerine fırsatçı diyip diğerleri fırsatçı değil diyenlerle yolunuza devam edebilirsiniz Açıklanan enflasyon oranında ülkenin yarısından fazlasının aldığı maaşa zam yapılmaması şaşırtmıyorda yurtlara %80 yapılması mı şaşırtıyor. Bakın bunlarda devlet yurtları enflasyon %60 ama zam %80 şaka gibi.Faiz artışının neden ihtiyaç olduğunu basit birkaç google aramasında bulabilirsiniz. 7/24 karşılıksız para basılırken kimsenin sesi çıkmıyor850 lira dediğiniz 51 dolar yapıyor yani geceliği 1.7 usd bırakında 1 kişinin 1 gece kalma bedeli 1.7 usd olsun.Benzinin fiyatı zaten belli 2 doların altında bıraksalar emin ol 60 liraya gitmemesi için en ufak sebep yok..Sebze meyve fiyatları  5 cent'e satılacak hali yok hepsi hepsi 50 cent çoğu sebzenin kg fiyatıSen paranın değerini koruma ekonominin içine sıç iktidar kanun kural tanımasın anayasayı kimse umursamasın zengin ve yandaşın kirası 20 yıl sonrasına bırakılsın sonra vay efendim bu zam ne. Bak 1kg pişmiş ekmek yıl başında 10 liraydı şimdi 20 lira2021 de 2800 liralık asgari ücret oldu şimdi 5500 lira.Fırsatçı kim göremedim.Zenginlerden vergi alınmadığı ve  yandaşların vergisinin çatır çatır silindiği bir dönemdeyiz. Vergi silinirse herşey olur.Bu yazdıklarının aksini söylediğim bir cümle bul ki okuduğunu anladığına inanayım. Bu konuda hemfikiriz neyi nerede yanlış okudun da bunu yazdın?Quote850 lira dediğiniz 51 dolar yapıyor yani geceliği 1.7 usd bırakında 1 kişinin 1 gece kalma bedeli 1.7 usd olsun.Diyorum ki olmasın. Olmamalı. Hala 1 öğrencinin 1 aylık bedelini dolar üzerinden hesaplıyorsun. En başından çıktığımız nokta konu başlığı. Diyorum ki her kurum zaten zam yapıyor her şey ateş pahası. Gidip de öğrencinin kaldığı yere zam yapmayın oradan nemalancak olanlar fırsatçılık yapmasın diyorum. Hala dolar hesabı yapıp duruyorsun.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mandown",
      "created_time": "July 01, 2022, 08:25:37 PM",
      "body": "Hocam bakın sizin anlamadığınız şu 500 binlik evin 2 milyon ettiğinde kar eden yok sorunda bu. 500 binliraya geçen yıl 2 araba alabiliyordunuz 2 milyonada yine aynı şekilde sadece 2 araç alabiliyorsunuz ortada zam diye birşey yok. enflasyon oranında herşey arttığına göre bırakında kiralarda aynı oradanda artsın.  bu fırsatçılık değildir. O evin bir amortisman süresi vardır. 100 yıl ayakta kalma garantisi mi varda üç kuruşa kiralanacak.Yukarıda yazdığınız işletmelerin tamamında yurt dışına bağımlıyız elektriğe kadar. Döviz nereye giderse onlarda o tarafa gider.Geçen yıl 270 binlira olan aracın kaskosu 3000 lira yoktu ancak şuan o araç 750 bin lira ee kaskoda o oranda artmak zorunda diğer türlü nasıl 3.000 tl den devam etsin. işçilik artmış, malzeme fiyatı artmışaynı şey diğerleri için geçerli ortada fırsatçılık yok.Söylediğiniz işletmeler dışa bağımlı olmasaydı ve enflasyon bu denli yüksek olmasaydı derdikki fırsatçılık var ama şuan hala piyasanın herşeyi fiyatladığını düşünmüyorum o zamana kadar zamlar devam edecek.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mandown",
      "created_time": "July 01, 2022, 08:30:44 PMLast edit: July 01, 2022, 08:44:25 PM by mandown",
      "body": "Dışa bağımlıyız o yüzden herşeyi dolarla kıyaslıyorum ve piyasa da aynı şekilde dolarla kıyaslıyor. Dolarla kıyaslamak zorundasınız. Hammadde konusunda tamamaen dışa bağımlıyız o yüzden size her ne kadar anormal gelse bile herşey aslında paramızın değerine bağlı ne kadar paramız değerli ve güçlü o kadar fiyatlar iner.Domates ürettiğinizi düşünün baştan sona yazıyorum bakın1. gübre %100 dışa bağımlısınız2. ulaşım enerjisi dışa bağımlısınız.3. su için elektrik enerjisi lazım malesef onda da dışa bağımlısınız. Domatesi burada fiyatlayan şey nedir? Çoğu döviz ile  bağlantısı olan giderler bunu dövizle hesaplamayacağımda neyle hesaplayacağım. Dövizle hesaplamazsam satarken aradaki enflasyon yüzünden bir yıl sonra üretim yapacak para elimde kalmaz. Çünki yıl başından bu yana o gördüğün kalemlerin tamamına defalarca zam geldi gel fiyatla dövizle hesaplamadan üretim maliyetini hadi.Aslında her ürettiğiniz mal konusunda dışa bağımlıyız.Yıllardır iktidar bunun için uğraşmadı mı.O yurtta verilen 1 tane domates oraya kusura bakmayın dövizle geliyor.Satılan kağıt fabrikaları, şeker fabrikaları hepsi lazım olduğu dönemde hiçbiri bizim değil. En azından kendimize yeteri kadar zarar etsek üretip de satabilirdik.Ortada zam diye birşey yokkkkkkkkk bunun adı enflasyon. Bak geçen yılki döviz karşılığına getirmişler işte. O yurtların genel gideri enerji elektrik enerjisi ee bunda dışa bağımlısın 1'e dışarıdan alıp öğrenciye 0.1 den veremezsin. ÇÜNKİ KALMADI.SONUÇTA ZAM İLE BU İŞ ÇÖZÜLMEZ PARANIN DEĞERLENMESİ İÇİN ÇABALAMALISIN. BİZİMKİLER NE YAPIYOR GEÇİCİ ÇÖZÜMLER ZAM DA ZAM ZAM ZAM ZAM ZAM ZAMLA BU PROBLEM ÇÖZÜLMEZ.Zamanında silinen sıfırlar yavaş yavaş geri geliyor biri geri geldi yavaş yavaş 2. deyiz iktidara bu dokunmuyor çünki onlar yıllardır enflasyonun üstünde gelire sahipti ve hala da öyleler. Millet vekillerinin çoğunun ekmek fiyatından bile haberi yoktur.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "eightdots",
      "created_time": "July 01, 2022, 08:46:30 PM",
      "body": "Quote from: mandown on July 01, 2022, 08:25:37 PMHocam bakın sizin anlamadığınız şu 500 binlik evin 2 milyon ettiğinde kar eden yok sorunda bu. 500 binliraya geçen yıl 2 araba alabiliyordunuz 2 milyonada yine aynı şekilde sadece 2 araç alabiliyorsunuz ortada zam diye birşey yok. enflasyon oranında herşey arttığına göre bırakında kiralarda aynı oradanda artsın.  bu fırsatçılık değildir.Yukarıda yazdığınız işletmelerin tamamında yurt dışına bağımlıyız elektriğe kadar. Döviz nereye giderse onlarda o tarafa gider.Geçen yıl 270 binlira olan aracın kaskosu 3000 lira yoktu ancak şuan o araç 750 bin lira ee kaskoda o oranda artmak zorunda diğer türlü nasıl 3.000 tl den devam etsin. işçilik artmış, malzeme fiyatı artmışaynı şey diğerleri için geçerli ortada fırsatçılık yok.Söylediğiniz işletmeler dışa bağımlı olmasaydı ve enflasyon bu denli yüksek olmasaydı derdikki fırsatçılık var ama şuan hala piyasanın herşeyi fiyatladığını düşünmüyorum o zamana kadar zamlar devam edecek.Makul oranlarda artmalı diyorum, artmamalı demiyorum. Artma olacaksa bile en son öğrenciye yansıtılır diyorum.Daha geçen hafta memur bir arkadaşın ev sahibi siz 3 bin lira zam aldınız diye ev kirasını direkt 2 katına çıkarttı. Şimdi bu adam zam yapmalı evet doğru ama ölçüsü bu mudur. Bu adama ben fırsatçısın dememeli miyim? Bu işletmelerde dışa bağımlı olduğumuzu tabii ki biliyorum ama ölçü ve oran bu mudur. Ben üniversitede olduğum için böyle durumlarda direkt öğrenci şimdi ne yapacak diye düşünüyorum. Zamların insancıl olması yönünde eleştiri yapıyorum. Siz direkt bu şekilde yaklaşınca bizim için önemli olan zümreyi göz önünde alarak cevaplamak istedim. Bağımlıyız evet ama bu öğrencilerin suçu değil her şeye zam geliyor evet ama sırf KYK ücretinin bu denli zamlanması yüzünden okula devam edemeyecek öğrenciler tanıyorum. Quote bilmemek değil de öğrenmemek ayıp Tezimi ücret konusunda yaptım ekonomi alanında hatırı sayılır bilgiye sahibim. Fakat yaklaştığım noktadaki temel \"öğrenci\" olduğu için ve tüm yaşamlarını zerresine kadar bildiğim için aynı zamanda yurtdışındaki bu saydığımız konuların birçoğundaki hizmet kalitesinin bizde olmadığı için yapılan zamların zorunluluk değil \"bir orandan sonra\" fırsatçılık olduğunu tekrar yineliyorum. Enflasyona bağlı olarak zam yapılmalı evet bakın hemfikiriz bu konuda, anlaşamadığımız nokta bunu fırsatçılığa çevirmiş olmaları. Her kurumda yavaş yavaş çıkacak ortaya daha bir şey gördüğümüzü sanmıyorum.Quote Ortada zam diye birşey yokkkkkkkkk bunun adı enflasyon. Bak geçen yılki döviz karşılığına getirmişler işte. O yurtların genel gideri enerji elektrik enerjisi ee bunda dışa bağımlısın 1'e dışarıdan alıp öğrenciye 0.1 den veremezsin. ÇÜNKİ KALMADI.Peki.QuoteSONUÇTA ZAM İLE BU İŞ ÇÖZÜLMEZ PARANIN DEĞERLENMESİ İÇİN ÇABALAMALISIN. BİZİMKİLER NE YAPIYOR GEÇİCİ ÇÖZÜMLER ZAM DA ZAM ZAM ZAM ZAM ZAM ZAMLA BU PROBLEM ÇÖZÜLMEZ.Zamanında silinen sıfırlar yavaş yavaş geri geliyor biri geri geldi yavaş yavaş 2. deyiz iktidara bu dokunmuyor çünki onlar yıllardır enflasyonun üstünde gelire sahipti ve hala da öyleler. Millet vekillerinin çoğunun ekmek fiyatından bile haberi yoktur.Katılıyorum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mandown",
      "created_time": "July 01, 2022, 09:07:18 PM",
      "body": "Hocam makul oranda artmalı haklısın bu konuda sonuna kadar katılıyorum ama bu söylem ideal ortamlarda olur haksızmıyım? enflasyonun %60 açıklandığı gelecek ay ne çıkacağı belli olmayan, dövize mesai saati dışında müdehale yapılan bir ortamda malesef herkez kendi çözümünü üretmeye çalışıyor. Enflasyonun %60 olduğu bir yerde kira zam oranını sen %25'de bırakırsan kiracı ile ev sahibini karşı karşıya getirirsin. Yıl sonunu bırak ay sonuna kadar birçok kaleme zam gelmeyeceğinin bir garantisi yok. Böyle bir ortamda iadeal kirayı veya zammı nasıl belirleyebilirsin. Belirleyemezsin.İktidara güven malesef bitti ve güvensizlik farklı sonuçlar getiriyor.  Bugün bulunduğum ilçede ekmek 250 gram ekmek 5 tl iken şuan 200 gram ekmek 5 lira oldu şuan 1 kg ekmek 25 lira ve fırıncını söylemine göre yıl sonuna 30 lirayı geçecek diyor yıl başında 1 kg ekmek 10 tl idi. sonuçta yıl sonunda da asgari ücret zammı var.Bana soracak olursanız ideal bir ortamda eğitimin ve içme suyunun tamamının ücretsiz ve kaliteli olması gerektiğini savunuyorum. Öğrenci ömür boyu zaten devlete vergi ödeyecek bıraksında devlet eğitim süresince okutsun.canlılığın en önemli gereksinimi su arkadaş insan doğduğunda nasıl bir gelire sahipse içtiği sudan para isteniyor bence suda bedava olmalı.Hocam biz ancak konuşuruz iktidar gece gündüz para basmaya devam eder bunlar para basmaya devam ettikçe cebimizdeki her bir lira değer kaybetmeye devam edecek bizde burada bunları tartışmaya devam edeceğiz. Başka neyapabilirz ki.o yüzden kriptoya inanıyoruz kendi paramıza güvenimiz yok o yüzden buradayız.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "eightdots",
      "created_time": "July 01, 2022, 09:12:18 PM",
      "body": "Quote from: mandown on July 01, 2022, 09:07:18 PMHocam makul oranda artmalı haklısın bu konuda sonuna kadar katılıyorum ama bu söylem ideal ortamlarda olur haksızmıyım? enflasyonun %60 açıklandığı gelecek ay ne çıkacağı belli olmayan, dövize mesai saati dışında müdehale yapılan bir ortamda malesef herkez kendi çözümünü üretmeye çalışıyor. Enflasyonun %60 olduğu bir yerde kira zam oranını sen %25'de bırakırsan kiracı ile ev sahibini karşı karşıya getirirsin. Yıl sonunu bırak ay sonuna kadar birçok kaleme zam gelmeyeceğinin bir garantisi yok. Böyle bir ortamda iadeal kirayı veya zammı nasıl belirleyebilirsin. Belirleyemezsin.İktidara güven malesef bitti ve güvensizlik farklı sonuçlar getiriyor.  Bugün bulunduğum ilçede ekmek 250 gram ekmek 5 tl iken şuan 200 gram ekmek 5 lira oldu şuan 1 kg ekmek 25 lira ve fırıncını söylemine göre yıl sonuna 30 lirayı geçecek diyor yıl başında 1 kg ekmek 10 tl idi. sonuçta yıl sonunda da asgari ücret zammı var.Bana soracak olursanız ideal bir ortamda eğitimin ve içme suyunun tamamının ücretsiz ve kaliteli olması gerektiğini savunuyorum. Öğrenci ömür boyu zaten devlete vergi ödeyecek bıraksında devlet eğitim süresince okutsun.canlılığın en önemli gereksinimi su arkadaş insan doğduğunda nasıl bir gelire sahipse içtiği sudan para isteniyor bence suda bedava olmalı.Hocam biz ancak konuşuruz iktidar gece gündüz para basmaya devam eder bunlar para basmaya devam ettikçe cebimizdeki her bir lira değer kaybetmeye devam edecek bizde burada bunları tartışmaya devam edeceğiz. Başka neyapabilirz ki.o yüzden kriptoya inanıyoruz kendi paramıza güvenimiz yok o yüzden buradayız.Birbirimizi yiyoruz bunlar yüzünden, biz kendimizi kurtardık da ben hakkıyla okumaya çalışan öğrencilere üzülüyorum. Ancak konuşuruz dediğiniz gibi, bir şeyi değiştirmeye olan inancımız azalıyor her geçen gün. Umarım iyi şeyler olur.Kalın sağlıcakla.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "karabiber",
      "created_time": "July 03, 2022, 09:34:45 AM",
      "body": "Büyükşehirlerde okuyan öğrenciler için fiyatlar yine de özel mülk kiralarına göre düşük. Ancak satın alım gücünün azalmasından dolayı 850 TL’yi veremeyecek bir çok kişi olacaktır. Küçük şehirlerde, taşralarda okuyanların ise KYK’da kalacaklarını artık sanmıyorum. 3 arkadaş birleşip orta halli bir dairede oturabilir. Dişimizi sıka sıka diş kalmadı. Bıraktım gezmeyi tozmayı, yaşamanın maliyeti her geçen gün katlanarak artıyor.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Phoenix Anka",
      "created_time": "July 03, 2022, 09:40:20 AM",
      "body": "Quote from: karabiber on July 03, 2022, 09:34:45 AMBüyükşehirlerde okuyan öğrenciler için fiyatlar yine de özel mülk kiralarına göre düşük. Ancak satın alım gücünün azalmasından dolayı 850 TL’yi veremeyecek bir çok kişi olacaktır. Küçük şehirlerde, taşralarda okuyanların ise KYK’da kalacaklarını artık sanmıyorum. 3 arkadaş birleşip orta halli bir dairede oturabilir. Dişimizi sıka sıka diş kalmadı. Bıraktım gezmeyi tozmayı, yaşamanın maliyeti her geçen gün katlanarak artıyor.850 lira aslında çok para değil bugün bir market alışverişine gidiyorsunuz bu kadar tutuyor. Sorun alım gücü düşük olan kesime maaş zammı yapmayan insafsızlarda. Bu insafsızlar yüzünden 850 lira yurt parasını ödeyemeyecek onlarca insan olacak. Bir şekilde parayı bulacaklar. Özel sektörde kalmak hala uçuk aylık 3-3.5 bin lira vardır.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kriminall",
      "created_time": "July 03, 2022, 10:58:52 AM",
      "body": "Herşeye yapılan zamlardan yurtlar da nasibini almış desenize, oran çok yüksek ama yüzde 80 nasıl bir orandır, bu oranlarla gücü olmayanların çok zorlanacağını bende düşünüyorum, keşke makul seviyede tutulsaydı veya yapılan yüzde 40 zam gibi yüzde 40 arttırılsaydı, halk enflasyona ezdirilmiyor sözde ama yapılan zamlar yapılan maaş iyileştirmesinin 2 katı, sizin adaletiniz de böyle işte,",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SUPERSAIAN",
      "created_time": "July 03, 2022, 01:45:34 PM",
      "body": "Kyk yurt ücretlerine %80 zam, ev kiralarında fahiş artışlar ortada bu öğrenciler hangi birine para yetiştirecek ki bence artık bir çok öğrenci için universite eğitimi vs yalan olmuş gibi görünüyor bu çok üzücü bir durum. Ülkemizdeki gençler eğitim almak için derbeder bir durumda. Siyasilerde işlerine gelince Z kuşağıda Z kuşağı, hani bu zamlar yapıldığında sesiniz çıksın,muhalif kesime söylüyorum. Öğrenciler için ne düşünüyorsunuz, ne istiyorsunuz birde gelmiş yüzsüz yüzsüz oy istiyorsunuz.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "W Jr.",
      "created_time": "July 03, 2022, 06:50:50 PM",
      "body": "Dershanelerin fiyatlarının senelik 40 bin TL olduğu bir ülkede ailenin senelik 9-10 bin lira yurda rahatlıkla para vereceğini düşünüyorum.Düşünüyorum ama doğrusunu söylemek lazımsa oranın %80 gibi astronomik bir bedel olması doğru mu, etik mi tartışılır.Bana göre bu oran çok yüksek.Yarın Temmuz zammı açıklanacak, son veriler girilecek bakalım Haziran enflasyonunu nasıl çıkardılar.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "meser#",
      "created_time": "July 03, 2022, 08:07:06 PM",
      "body": "Tam zamanında mezun olduk dedirtti whatsapp grubumuzda bu olay. Öğrencilerin üzerinde o kadar büyük bir yük var ki anlatılmaz yani. Görünürde bir baskı yok gibi hissediyor büyüklerimiz ancak öyle bir baskı oluyor ki üzerlerinde anlatılmaz yaşanır yani. Birçok arkadaşımızı hala mezun olduğuna ikna etmeye çalışıyoruz düşünün  Bu ülkenin geleceğinin ne kadar batırılabileceğine dair bir iddiaya mı girildi falan yoksa başka açıklaması olamaz yani...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}