{
  "id": "topic_5445595",
  "title": "RentGPU",
  "author": "RentGPU",
  "created_time": "March 19, 2023, 07:54:22 PM",
  "content": "whats wrong on sending btc twice or many times from same address , someone told me that the publickey point which starts with 04 is shown while transacting and thats bad for security of the account",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5445595",
  "comments": [
    {
      "author": "digaran",
      "created_time": "March 19, 2023, 10:01:24 PM",
      "body": "Having a low range private key could put your funds at risk after revealing the public key, however if your private key is in a high enough range (256 bit range) to this date and for the 10 coming years in the future, there is no danger whatsoever. Think of it this way, your unused address is like a buried treasure, when you use it and send back the change to the same address is like digging the treasure out taking some coins from it and burying it again, now if anyone passes through and sees the fresh soil, they could dig and find it, unless you bury it so deep that digging it out could take years and so much energy.Above analogy is not completely relevant but it should give you an idea. More technical discussions here: https://bitcointalk.org/index.php?topic=5434896.0",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sheenshane",
      "created_time": "March 19, 2023, 11:20:28 PM",
      "body": "Quote from: RentGPU on March 19, 2023, 07:54:22 PMwhats wrong on sending btc twice or many times from same address , someone told me that the publickey point which starts with 04 is shown while transacting and thats bad for security of the accountThere's nothing wrong if you don't care about your security and privacy because each time transaction was made, it's possible that your public key was revealed and could be publicly seen by anyone in the blockchain.  That time, the address that you've used can be tracked and traced and it could be your wallet address is vulnerable to hacking or it could be at risk. It's the best practice to use different newly generated addresses per transaction and use the wallet that has this feature and AFAIK, Electrum wallet has this kind of feature. I don't understand why only a public key that starts with 04 is shown, I think all can be seen publicly once it will broadcast in the blockchain.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "March 20, 2023, 03:36:03 AM",
      "body": "There is no security risk whatsoever when revealing the public key. ECDLP remains impossible to solve with the existing hardware and algorithms and it is not about to change. In simple terms it is not possible to reverse a public key to get the private key and put you at a risk. And if some day that becomes possible, Bitcoin as a whole is going to fall apart not just your address being at risk.This is of course assuming your wallet doesn't have any bugs (eg. your key was created randomly, the nonce when signing tx is chosen randomly, etc.).The only issue with reusing addresses is a privacy related one.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hZti",
      "created_time": "March 20, 2023, 06:34:18 AM",
      "body": "As said above this will only decrease privacy and not your Security. What you Need to consider is that in contrast to your bank account all the Details are open in the blockchain. That means if you only use one adress everyone can See how much money you have and what you earn etc.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "odolvlobo",
      "created_time": "March 20, 2023, 07:06:38 AMLast edit: March 20, 2023, 09:17:30 AM by odolvlobo",
      "body": "Quote from: RentGPU on March 19, 2023, 07:54:22 PMwhats wrong on sending btc twice or many times from same address , someone told me that the publickey point which starts with 04 is shown while transacting and thats bad for security of the accountYou got bad information, or you misunderstood it.There is nothing wrong with sending bitcoins from the same address more than once. However, there is a privacy issue with receiving bitcoins at the same address more than once. And, generally the only way to send bitcoins from the same address more than once is to receive them at that address more than once, or to have the change returned to the sending address (which is the same as receiving it more than once).A public key that begins with 04 is an uncompressed public key. There are no security issues with using uncompressed public keys.Perhaps the issue is this: to send bitcoins from an address, you must reveal its private public key. If the public key is revealed, then that is one less step needed to find the private key. However, the reduction in security from exposing the public key is not worth worrying about. The reduction of privacy from giving an address to multiple people is a much bigger problem (if it is even a problem at all).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o_e_l_e_o",
      "created_time": "March 20, 2023, 07:47:09 AM",
      "body": "Quote from: digaran on March 19, 2023, 10:01:24 PMThink of it this way, your unused address is like a buried treasure, when you use it and send back the change to the same address is like digging the treasure out taking some coins from it and burying it again, now if anyone passes through and sees the fresh soil, they could dig and find it, unless you bury it so deep that digging it out could take years and so much energy.This is a misleading analogy. With current technology, no amount of time is sufficient to turn a public key in to a corresponding private key. It is perfectly safe to reveal your public key (and indeed, every used address has done exactly this), and it is not analogous to revealing the location of your treasure.Quote from: sheenshane on March 19, 2023, 11:20:28 PMbecause each time transaction was made, it's possible that your public key was revealed and could be publicly seen by anyone in the blockchain.It's not just possible - it's a necessity. You must reveal the public key as part of the signature. Without doing so, you cannot spend those coins.Quote from: sheenshane on March 19, 2023, 11:20:28 PMThat time, the address that you've used can be tracked and traced and it could be your wallet address is vulnerable to hacking or it could be at risk.This is not accurate. The address you have used is revealed on the blockchain the instant you first receive coins to it. And revealing the public key does not put that address at risk of being hacked.Quote from: sheenshane on March 19, 2023, 11:20:28 PMI don't understand why only a public key that starts with 04 is shownUncompressed public keys start with 04. Compressed public keys, which almost all software now uses, start with either 02 or 03.Quote from: odolvlobo on March 20, 2023, 07:06:38 AMPerhaps the issue is this: to send bitcoins from an address, you must reveal its private key.You've made a typo here.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dzungmobile",
      "created_time": "March 20, 2023, 11:16:22 PM",
      "body": "What is a change address in bitcoin wallet? Read to knowWhy not use the same address?  General privacy guidelines for your bitcoin transactions",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dkbit98",
      "created_time": "March 20, 2023, 11:30:09 PM",
      "body": "Quote from: RentGPU on March 19, 2023, 07:54:22 PMwhats wrong on sending btc twice or many times from same address , someone told me that the publickey point which starts with 04 is shown while transacting and thats bad for security of the accountThere is no ''account'' if you are using non-custodial wallet, and security is not affected at all with sending coins from same addresses, but maybe privacy can be affected, if you are not doing good address/change management.Reusing addresses for receiving coins can be even worse, that is why it's recommend to generate new address each time you want to receive payment, unless it's unique donation/payment address.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Saint-loup",
      "created_time": "March 25, 2023, 10:50:29 PMLast edit: March 25, 2023, 11:27:28 PM by Saint-loup",
      "body": "Quote from: dkbit98 on March 20, 2023, 11:30:09 PMThere is no ''account'' if you are using non-custodial wallet, and security is not affected at all with sending coins from same addresses, but maybe privacy can be affected, if you are not doing good address/change management.Reusing addresses for receiving coins can be even worse, that is why it's recommend to generate new address each time you want to receive payment, unless it's unique donation/payment address.I don't think it's always a good thing actually because when you always use a new address for any transaction, you can't manage easily your UTXOs. And when you need to spend one for paying something it can be joined with another one you didn't want to use for that transaction, if you don't pay attention. If you use an UTXO coming from a KYC platform it can be bad for your anonymity. If it comes from a darknet transaction, a mixer, a casino, a sex shop or something like that, it could hurt your privacy. While when you dedicate one address to one platform/use case and you label it rightly you are less likely to make this kind of mistake.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dkbit98",
      "created_time": "March 26, 2023, 09:46:50 PM",
      "body": "Quote from: Saint-loup on March 25, 2023, 10:50:29 PMI don't think it's always a good thing actually because when you always use a new address for any transaction, you can't manage easily your UTXOs. And when you need to spend one for paying something it can be joined with another one you didn't want to use for that transaction, if you don't pay attention. If you use an UTXO coming from a KYC platform it can be bad for your anonymity. If it comes from a darknet transaction, a mixer, a casino, a sex shop or something like that, it could hurt your privacy. While when you dedicate one address to one platform/use case and you label it rightly you are less likely to make this kind of mistake.Sure you don't have to use new address each time when you are receiving $1 worth of bitcoin or some small amount, but I find very handy to have many addresses with $30, $50 or $100 worth of BTC, it's better to use coin control and spent them separately for any payments.Good address management is needed for this and I suggest adding labels for addresses and transactions, but it's not hard to join them when needed, convert them to Lightning Network, or swap with other coins.I didn't say anyone should generate new addresses for same platform multiple times, one is enough.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "touseefahmad1999",
      "created_time": "March 27, 2023, 03:31:33 PM",
      "body": "Sending Bitcoin from the same address multiple times is not necessarily a problem in and of itself. However, there are some potential security risks to consider.First, when you send Bitcoin from an address, the public key associated with that address is typically included in the transaction data. This means that anyone who has access to the transaction data can see the public key, which could potentially compromise the security of the address. However, this is not necessarily a problem if you are using a secure wallet and taking other precautions to protect your private keys",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Coyster",
      "created_time": "March 27, 2023, 03:49:31 PM",
      "body": "Quote from: touseefahmad1999 on March 27, 2023, 03:31:33 PMSending Bitcoin from the same address multiple times is not necessarily a problem in and of itself. However, there are some potential security risks to consider.There are zero potential security risks to consider, none at all.Quote from: touseefahmad1999 on March 27, 2023, 03:31:33 PMFirst, when you send Bitcoin from an address, the public key associated with that address is typically included in the transaction data. This means that anyone who has access to the transaction data can see the public key, which could potentially compromise the security of the address. However, this is not necessarily a problem if you are using a secure wallet and taking other precautions to protect your private keysIt isn't a matter of using a secure wallet or taking other precautionary security measures, your public key simply cannot be used to steal your funds from your address. It is your private key that an attacker can use to steal your funds, but then a public key being revealed whenever Bitcoins are spent from an address cannot be used to derive the private key belonging to that address, so the funds are safe.I am pretty sure you didn't read the earlier replies on this thread because all of these has been said already, the only thing your protect when you don't reuse addresses is your privacy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mpamaegbu",
      "created_time": "March 27, 2023, 05:37:44 PM",
      "body": "Quote from: hZti on March 20, 2023, 06:34:18 AMThat means if you only use one adress everyone can See how much money you have and what you earn etc.I think that's the only reason most people don't like reusing addresses. It's not as if anyone can hack those wallets through the public keys offered. If anyone here cared about such happening to them, then engaging in signature campaigns shouldn't be a thing for them. Come to think of it, except someone knows you directly or in person I don't think anyone would want to spend their free time running through another person's transactions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}