{
  "id": "topic_5467738",
  "title": "Antotena",
  "author": "Antotena",
  "created_time": "September 22, 2023, 06:09:20 PM",
  "content": "The economy hard, the cost of living wan kill the living and everybody they find alternative to survive but e no mean say make we dy cut each other head for the country wey we gather dy struggle together.I will go straight to the point, there are some obvious scam that are happening in this country but many are afraid to speak up or because we are used to this \"even if I talk, no action will he taken\" but we can't be silent all in this country.There are many ways of scams that are going on in this country, they are mostly push by big guys because that's the only way they can get public outreach. Una remember that time when Davido advertise Racsterly that year when dem be they do bring 5k and get 10k, when the scam initiative later die, they drag am for advertising them to his fans but guess what, nothing was done because the right people are not speaking and fighting their fight, in a working country, he will be arrested and fine for misleading people.The scam wey I wan share una na the same thing wey dy happen as I explain and they are been fuel by them big boys, see them make I burst una head.Bitcoin Mining scam: Lack of information is the fastest way people fall for scam and this has been long existing in Nigeria because they don't have the right information and they are sometimes lazy to learn. Some months ago, there is this influential in Lagos called \"OLA OF LAGOS\", he advertised and also review products like cars and properties, they reach out to him because they know how influential he is to the public but I'm very confident that he don't know anything about Bitcoin mining.He was advertising this mining company that claimed to give out $3 per day and $4 per day when you buy the machine from the company called Metamining, all you have to do is to buy the machine from them at an exorbitant price while you sit at home to receive $3 to $4 depending on the type of ASIC miner you bought from them, they help you manage the mining machine in their mining farms and the electricity bill but its all scam, people are quick to fall for this scam.Bitcoin mining don't work this way, even cloud mining has long been proven to be scam and beside, the running cost of mining Bitcoin in Nigeria is high and that is why many tech people that has tried mining all closed down. This company Metamining CEO don't even understand how bitcoin mining work nor could explain how it works, people need to start reading or watching some tutorials about bitcoin not to fall victim of this scam because this is not the first but they spread fast using influencers.Gaming scam: This is another scam similar to Metamining scam, the only difference between this one and Metamining is that this one is gaming but they both used Tiktok influencers to do their dirty trick and the problem with these influencers is that they value money before anything, they don't put their fans before anything. We are all familiar with \"SIDNEY TALKER\" for his skit jokes on social media, he was the first person that started the advert for this gaming company, then other skit makers followed. The game was like pressing a button on your screen and then the stuff will start flying and continue to double your money, if it double, you are save but if it project and comes down, you will lose the amount you wager.Now, what this gaming scam company did was that they created a unique account for influencers, paid them to login with that account to demonstrate the game on how to win to their fans to give them confidence that millions can be make overnight but been a unique login will always give them winnings but when you create a new account, you will lose all your money anytime you play their games, so many people lose thousands and millions of naira because of this scam, it is possible that more of this may come back.Betting code: All of us like money and we understand how it is to have bonus for betting when you refer people with your referring code, however some skit makers make this code special as if it is very easy to win bet. Another thing they don't tell you about this bonus is that it comes with a condition but they will not tell you not until you deposit on any of the betting site they promote and use the bonus to play, it is when you want to withdraw they will tell you it is impossible, 1xbet is the most advertised betting site in this our country but they don't tell you the condition when you use their bonus to play.This are the few I could list but I'm very sure that there are many more of this scams that Nigerians are not paying attention but they are stealing from innocent Nigerians that are trying to make end means for themselves, please inform people to learn about more about new things before they push money into it. December is also coming, people need to be at alert because scammers will be looking for ways to scam people to celebrate dirty December.I'm going to share some videos of evidence even when some have deleted by the original author, some people still have the evidence of the scam adverts.1. https://www.tiktok.com/discover/sydney-talker-game-scam2. https://www.tiktok.com/discover/meta-mining-club-scam",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5467738",
  "comments": [
    {
      "author": "rachael9385",
      "created_time": "September 22, 2023, 06:41:19 PM",
      "body": "Thank you to bring to us this awareness, mostly this betting codes, I know know how people take they fall for that kind of thing, for some social media platforms like Facebook and Instagram their advert plenty, just take a good look at this, they are all lies, I my self, I believe say anything way nah legit something, no body go tell you untill you use your legs and your hands find out by your self, so those betting codes if nah legit them no go tell anybody unless them like the person but as nah scam them carry am come social media to find people way them go scam and people they carry their money go buy games way at last e go still cut.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ever-young",
      "created_time": "September 22, 2023, 07:41:15 PM",
      "body": "This bitcon mining something don they popular for this country, almost every day people they always come up with one of them with fake testimonies and some too nah real testimonies, but how them they carry convince them say this thing they pay nah Watin they shock me, like u go carry ur money give person make dem just use am do Watin, nah so mining they easy to do, way be say u go put money online dem come they pay u daily, diz ones nah just another Ponzi scheme way dem don they reform enter crypto side and some people still they fall victim. Diz part way celebrities dem they share and promote some games for their social media account that one nah one thing way be say dem they do, dem no wan know if the platform they scam people or not, Watin them need nah make the company pay them and make dem do Watin the company talk finish, and sometimes eh be like them they give them the kind game to okay make eh they dem easy to record and show am to the public to always believe how eh they waka. Nah for us to always they careful as no law they protect viewers from this kind thing, even 1xbet way they known for their scamming things, diz influencer they promote am with full force nah their eh go show say nothing concern them. This code side way them they sell online some nah real but some nah fake and those people way they sell the code, some of them no even dy sure if the game go work Or not, cuz if dem too sure for the game dem for don go borrow money go play the game when eh enter dem Pay back but them no sure for am nah why them they sell am.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hyphen(-)",
      "created_time": "September 22, 2023, 08:46:53 PM",
      "body": "Good job, @Antotena, for taking your time to compile this useful thread. I have been thinking of a way to share this with my fellow colleagues here, but you have said it all.These influencers are after money; they only advertise what they are paid to advertise; they don't care to know how legit it is because they do not value their fans. This particular game they have been advertising recently is called NGA Wins. I have been doubting the game because I know that no one has free money to give people, even though I know that game is about luck. But these influencers make it look like an easy way to make money; they are not explaining the risks behind it, and as the OP has said, maybe the accounts they are using in their skits are a special account created for them so that their fans will be attracted and think it is real and easy to play.The best thing to do is to always do external research before starting or investing in anything new that has been introduced to you by anyone to avoid falling for such scams, and we should also stop being greedy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}