{
  "id": "topic_5447732",
  "title": "Jossque",
  "author": "Jossque",
  "created_time": "April 05, 2023, 11:26:12 PM",
  "content": "Kripto piyasasıyla ilgili bazı yararlı sitelerden bazıları.Kullanışlı birkaç siteyi sizlere göstermek istedim.https://dune.com/browse/dashboardshttps://app.artemis.xyz/activity-monitorhttps://tokenterminal.com/",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5447732",
  "comments": [
    {
      "author": "gospodin",
      "created_time": "April 07, 2023, 03:22:09 PM",
      "body": "çok fazla site var. hatta geçtiğimiz yıllarda bütün bu siteleri linkleyen yabancı bir site vardı. (benzer şekilde yerli de vardı.)son dönemde https://chainbroker.io/projects/ sitesine bakıyorum. baktığım bilgileri de doğru olarak kabul ediyorum yoksa boş yere gözlerimi bozmuş olurum. işin aslı böyle siteleri takip etmek için inanılmaz bir emek gerekiyor. maalesef tek işimiz bu olmadığı için takip çok zor. mesela pandemi döneminde evde zaman geçirebildiğimiz için işler daha rahat oluyordu.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pierre 2",
      "created_time": "April 20, 2023, 05:50:55 AM",
      "body": "Birkaç tane de ben yazayım. Ara sıra baktığım bitcoin in boğa mı ayı mı olduğunu tahmin etmeye çalışan bir web sitesi: https://colintalkscrypto.com/cbbi/ İlginç tarafı şu, geri kalanlar hep matematiksel şeyleri hesaba katarken bu sosyal etkileri de matematiğe dökmeye çalışmış. Bu site var bir de: https://www.lookintobitcoin.com/charts/pi-cycle-top-indicator/ Bunun olayı da pi cycle top yoluyla bitcoin in halving dönemi tepe noktasını bulmaya çalışıyor. Geçen sefer bulmuştu hatta satmadığıma çok üzülmüştüm. Bu ikisi ile bitcoin trade iniz biraz daha kolaylaşacaktır diye düşünüyorum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jossque",
      "created_time": "April 23, 2023, 11:01:14 PM",
      "body": "Bu siteler arasında dune analytics sitesinin airdrop yapma potansiyeli çok yüksek ve bu siteyi daha aktif bir şekilde kullanmak gerekiyor.Yatırım olarak 80 milyon dolar yatırım aldıklarını belirtelim.platform üzerinde wizard rolü almak belki de ileride yapılabilecek bir airdrop adına kriter olabilir.Siteye gidip üyelik açıyoruz ve hesap bilgilerini dolduruyoruz.https://dune.com/homeArdından Dashboard ve Queries oluşturalım. Sağ taraftaki bölümden new dashboard'a tıklayarak oluşturabiliriz.Bununla ilgili youtube kanallarında zaten video mevcut.https://www.youtube.com/watch?v=S-cctFmR828Dashboard oluşturduktan sonra New Queries oluşturacağız.Bu SQL kullanarak veri kodlaması diyebiliriz.Oluşturduktan sonra save edip favorilenmesini bekliyoruz.https://dune.com/browse/wizardsLinkten de wizard rolü alıp almadığınızı kontrol edebilirsiniz.Burada biriken puanlar karşılığı airdrop alabilme imkanı olabilir.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jossque",
      "created_time": "June 07, 2023, 01:57:29 PM",
      "body": "Free veya ücretli mintlere ulaşabileceğiniz bir siteden bahsedelim.Subber NFT minti için bir multichain platformu.Bu sitede hem blockchain olarak filtreleyebilir hem de konu olarak şuanda mintlenebilecek projelere göz atabilirsiniz.Profil oluşturup hemen çekilişlere katılabilirsiniz.https://www.subber.xyz/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jossque",
      "created_time": "July 23, 2023, 12:35:11 AM",
      "body": "Blokchain ile ilgili bir roadmap isteyenler adına bu linki buraya bırakmakta fayda var.İlgili ve meraklı olanlar bu roadmapı inceleyerek kendilerine bir şey katabilirler.https://roadmap.sh/blockchain",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jossque",
      "created_time": "August 27, 2023, 04:50:37 PM",
      "body": "Airdropları,testnetleri ve daha fazlasını takip edebileceğimiz Linity sitesi WL dağıtıyor. maksimum 50 kişi alabilecek. WL almak için yapılması gerekenler ise;https://taskon.xyz/campaign/detail/9189Hem WL hem USDT ödüllü. Görevler basitBir diğer seçenek ise;https://zealy.io/c/linity/questboardZealy görevlerini tamamlayarak discordların rol alacağız. Bu rol sayesinde WL alabilme şansına sahip olabileceğiz.Son 4 gün olduğunu belirteyim.https://x.com/linity_com",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}