{
  "id": "topic_5403709",
  "title": "Tony116",
  "author": "Tony116",
  "created_time": "June 23, 2022, 04:32:08 AMLast edit: June 23, 2022, 01:40:54 PM by Tony116",
  "content": "Two of the top VC funds in the crypto market, Alameda Research and Multicoin Capital, have deleted all tweets on twitter and unfollowed all the projects they are holding. What is going on with cryptocurrencies? Is this a sign that the sharks are getting out of the market? In light of recent events, do we seem to be entering the longest crypto winter in the history industry crypto.?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5403709",
  "comments": [
    {
      "author": "bittick",
      "created_time": "June 23, 2022, 05:13:39 AM",
      "body": "Some VC became bankrupt caused by they were investing in the wrong project and got margin call. As far as i know that alameda was also giving loan to the another VC caused by this VC was also getting margin call or out of liquidity. Im sure that if both were taking such decision to prevent something by like being sued by regulators or something else. Erasing whole of its tweet was an usual behavior. It could be a signal from the worst thing will happen soon. We know that alameda was also the most successful VC",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "June 23, 2022, 05:17:19 AM",
      "body": "Could be. Market is experiencing a lot of down fall and these VCs are pobably saving some funds to be not able to liquidated their asset slowly. We can see some exited due to potential fear but of course, there are wrong factors such as project investment mistakes. Its not like they are careless about it but of course they are trying to save as much as fund as possible to be safe in a bear market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "worle1bm",
      "created_time": "June 23, 2022, 05:55:57 AM",
      "body": "The market conditions are very tight at this time and many big firms have got their position liquidated and this is why the prices are also going down for most of the coins they are holding so can't exactly say what will be the next move of the market but hope they don't have worse conditions that could affect the prices even more.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Queenboss",
      "created_time": "June 23, 2022, 06:42:02 AM",
      "body": "It's indeed a hard time for the market, but I only hope that it was not propelled by massive cash out of big names in the market. The bear could be longer this time, if news of this nature keeps making headlines. So many persons are losing trust in the industry and there's a call for regulations to bring some sort of sanity to the crypto space.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tjtonmoy",
      "created_time": "June 23, 2022, 07:18:43 AM",
      "body": "If you analyze the past data, you can see that BTC faced crash many times in the past. That didn't stop it to grow more! What doesn't kill you, makes you stronger. The market may crash a bit more but in the end when this all is over, Market will recover. All it needs is time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ketesnuko",
      "created_time": "June 23, 2022, 07:49:27 AM",
      "body": "Truth be told though, this present market price is a whole new bottom that people should be buying but things doesn't look as it should so I can smell more downfall in few more weeks, I think we are heading for a new all time low that weve seen many years ago.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "crypto-project",
      "created_time": "June 23, 2022, 07:54:14 AM",
      "body": "I think that they are just trying to change their investment strategy and when the market starts to recover they will reinvest their money. Or worst case scenario they shut down forever and don't want to reinvest in crypto. But even so, I am still optimistic about future crypto market conditions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "livingfree",
      "created_time": "June 23, 2022, 02:32:23 PM",
      "body": "I don't know these companies but if they've been big enough to handle the bull run and they're overwhelmed. I guess that there's a domino effect that had came from the Luna fiasco and it was passed on not just to the exchanges but also individual companies like those.Quote from: Tony116 on June 23, 2022, 04:32:08 AMIn light of recent events, do we seem to be entering the longest crypto winter in the history industry crypto.?I don't think it will be longer than 2018. We've got too many changes, we've got a 2 year bull run and then this bear market could last maybe less than a year.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Plaguedeath",
      "created_time": "June 23, 2022, 02:44:37 PM",
      "body": "During the bear market almost of altcoins wouldn't survive and then it will died, so those CEO didn't want it happen and then make decision to rug pull their own project. They can earn more because of the past investors, while the investors will suffer of losses. Then Bitcoin is the one coin that can be survive.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitstar_coin",
      "created_time": "June 23, 2022, 03:32:55 PM",
      "body": "Alameda Research and Multicoin Capital action to delete all their tweet history is very disturbing no doubt (being who they are and what they represent in the crypto space) and especially with the situation of market in general. But i believe the entire crypto space is bigger than just 2 vc for their action to cause any sort of panic, investors are already overwhelmed enough as it is. The bear is season is not permanent, it will pass after sometime, whatever the reason for their action can't be as a result of bear market, maybe it must have something to do with twitter (am not sure). But the market will be fine just as it always does whenever there is bear season. There is no need to be apprehensive.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dimonstration",
      "created_time": "June 23, 2022, 03:39:47 PM",
      "body": "Quote from: livingfree on June 23, 2022, 02:32:23 PMI don't know these companies but if they've been big enough to handle the bull run and they're overwhelmed. I guess that there's a domino effect that had came from the Luna fiasco and it was passed on not just to the exchanges but also individual companies like those.Almeda research is owned by Sam Bank Friedman which is the founder of FTX while this is behind the project like Solana, Serum, Raydium and other big name project on Solana ecosystem. This VC is extremely huge and this move is really a red flag because they are in possession a huge part on cryptomarketcap. They can dump the market if they will sonce they are bigger than Terra that recently collapsed. There is no official statement about this but this news is really intriguing. Thanks to OP for sharing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "wxa7115",
      "created_time": "June 23, 2022, 03:50:08 PM",
      "body": "Quote from: Tony116 on June 23, 2022, 04:32:08 AMTwo of the top VC funds in the crypto market, Alameda Research and Multicoin Capital, have deleted all tweets on twitter and unfollowed all the projects they are holding. What is going on with cryptocurrencies? Is this a sign that the sharks are getting out of the market? In light of recent events, do we seem to be entering the longest crypto winter in the history industry crypto.?This seems to be a clear indication they do in fact plan to change their investment strategy and cryptocurrencies are not included at the moment on that strategy, but I do not see a reason to worry about it.During the 2018 and the years afterwards it is not as if we got a lot of institutional investors that were interested on buying bitcoin on the open, so it is natural that when we are facing a bear market there are many investors which want to get out of this market and this includes institutional investors, but do not worry as once the market goes up again they will come back.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jrrsparkles",
      "created_time": "June 23, 2022, 04:00:05 PM",
      "body": "It is really bad time for the companies who invested their capital into shitcoin projects because they know atleast 90% will die when the recovery starts so they are probably regretting their decision and just showing it in someway.We don't need to take them because it is kind of influencing as well which may lead you to be in the wrong sode so its always go with your own strategies while making investment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "serjent05",
      "created_time": "June 23, 2022, 04:25:26 PM",
      "body": "Quote from: cryptoaddictchie on June 23, 2022, 05:17:19 AMCould be. Market is experiencing a lot of down fall and these VCs are pobably saving some funds to be not able to liquidated their asset slowly. We can see some exited due to potential fear but of course, there are wrong factors such as project investment mistakes. Its not like they are careless about it but of course they are trying to save as much as fund as possible to be safe in a bear market. But deleting traces on the internet means something nefarious.  I hope what I am thinking isn't correct but probably they are either getting broke and deleting proofs  or just staying out of regulations way.  I hope it was the latter because if it is the first, we might see another scandals in crypto industry.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GowithMi_GMAT",
      "created_time": "June 23, 2022, 04:27:19 PM",
      "body": "The deletion of tweets from two big companies Alameda Research and Multicoin Capital is very likely to have something to do with the current crypto market sentiment. I think that we will face a protracted bear market like in 2018-2020. but after all if you believe in the project you are investing in then you must also always be prepared for the consequences including facing the crypto market situation as well.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jackl87",
      "created_time": "June 23, 2022, 04:50:15 PM",
      "body": "Quote from: Tony116 on June 23, 2022, 04:32:08 AMTwo of the top VC funds in the crypto market, Alameda Research and Multicoin Capital, have deleted all tweets on twitter and unfollowed all the projects they are holding. In light of recent events, do we seem to be entering the longest crypto winter in the history industry crypto.?I have never heard of Multicoin Capital before but during the bull market of 2020 and early 2021 i mainly invested into new projects because i am part of a few launchpads and back then it was definitely a sign of quality if a new project also received an investment from Alameda Research. So if this company would now completely leave the crypto market that could definitely have an impact.Maybe i am also exaggerating and the investment volume of Alameda was relative small. I don't have the numbers about how big the total investment into the crypto markets of Alameda are maybe they are just a small fish and it has no impact at all if they are gone.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "andyou1234",
      "created_time": "June 23, 2022, 04:55:37 PM",
      "body": "if you look at the cycle that has happened, I think the crypto market will increase again, this can be seen from the market situation which is starting to stabilize even though it has not experienced significant growth, but I am very optimistic that the crypto market will not fall further, I think this is the time best to review, study and research the coin as the price is still very low.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sensimilia",
      "created_time": "June 23, 2022, 05:08:07 PM",
      "body": "The current situation in the crypto market will not last long. Don't panic, the price of all tokens has come down a lot but I think everyone should wait patiently and analyze and buy good tokens, the team that is doing well and implementing their roadmap should invest in tokens.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tomahawk9",
      "created_time": "June 23, 2022, 05:22:00 PM",
      "body": "Quote from: Tony116 on June 23, 2022, 04:32:08 AMIs this a sign that the sharks are getting out of the market? I think you're blowing things out of proportion.Multicoin Capital doesn't look like they're getting out of the market any time soon. My guess is that deleting those tweets means that they want a fresh new start after their recer partnership with Bitwise,\"Multicoin Capital Partners With Bitwise and Matthew Ball for Metaverse Crypto Index, Fund\" (Source)About Alameda Research, latest news tells us that they're bailing out Voyager (crypto platform that collapsed though not as hard as Celcius network) so, I'd say they still have faith in the crypto market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}