{
  "id": "topic_5494903",
  "title": "Riginac111",
  "author": "Riginac111",
  "created_time": "May 01, 2024, 09:32:20 AM",
  "content": "When you want to invest in Bitcoin don't because people is investing in Bitcoin and you invest, I prefer taking my time to make a research before I invest on Bitcoin, Bitcoin invest is good but when you don't take your time to invest in Bitcoin then you will invest wrongly, the first time I invested I did not follow anyone step rather I do follow the research I made before I invest, some persons does not control emotions before they invest they follow a side news to invest on Bitcoin and that is why some of them do experience hard luck for their invest, in summary invest when you want to invest, don't follow the crowd but follow your instinct",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5494903",
  "comments": [
    {
      "author": "mrust_mobile",
      "created_time": "May 01, 2024, 09:39:02 AM",
      "body": "True. If you invest in btc just because other people are also investing, then you will also be selling btc when they are selling and in my experience, the majority are always the losers. That means if you don't sell before everybody else, you will be selling at the bottom. If you don't buy before everybody, you will be buying the top. Following the majority the quickest way of getting poor.On the top of that, people need to understand what they are buying or selling. That's why they need to do their research before even touching btc or any other crypto. There are many resources that educates people for free. \"Price is what you pay, value is what you get.\"",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yaunfitda",
      "created_time": "May 01, 2024, 09:52:53 AM",
      "body": "Quote from: Riginac111 on May 01, 2024, 09:32:20 AMWhen you want to invest in Bitcoin don't because people is investing in Bitcoin and you invest, I prefer taking my time to make a research before I invest on Bitcoin, Bitcoin invest is good but when you don't take your time to invest in Bitcoin then you will invest wrongly, the first time I invested I did not follow anyone step rather I do follow the research I made before I invest, some persons does not control emotions before they invest they follow a side news to invest on Bitcoin and that is why some of them do experience hard luck for their invest, in summary invest when you want to invest, don't follow the crowd but follow your instinctYeah, but what do you need to research? I mean it's all over the media, it has it's historical past and we see it as the prime mover and in it's young data, you can see that after the halving, price goes on a parabolic rise and then we see it hitting new all time high. And if you will follow the crowd then maybe you will see some saying that altcoins are also a good investment, even better than Bitcoin because it's gives you a higher return. It might be true, but it's not that easy to find a altcoin that will give you that so called x100 returns in the future. Perhaps what you hear in the beginning about Bitcoin is that it's a \"get rich quick\" scheme, and you fall for that hype or be influence by others that you think it's going to be very easy sail, which is not.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Frankolala",
      "created_time": "May 01, 2024, 10:05:09 AM",
      "body": "We are in bitcoin forum and every information on bitcoin and technology is being discussed here. Price speculations and how to go about your bitcoin investment is also being discussed, so I don't see why anyone here in this forum will start making too much research on bitcoin, when he already have the basic knowledge of bitcoin. It is people who thinks that bitcoin is a get rich quick scheme, that will be carried away by FOMO and jump into investing without knowing how bitcoin works.Anyone that is ready to invest in bitcoin, as long you are active in this forum, it is easy as you can invest in bitcoin and continue learning more about bitcoin, you must not know everything first before you start up your investment because time waits for no one, and it is impossible for you to learn everything on bitcoin in one year, because bitcoin is complex and there are new developments in the network frequently. What I will say is that make a proper calculation on your income, and use the amount of discretionary income that you have to buy bitcoin, regular either weekly or monthly with DCA method, amd learn at the same time on bitcoin here in the forum. Investment should be a personal decision , and not because others are doing it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Plaguedeath",
      "created_time": "May 01, 2024, 10:08:59 AM",
      "body": "In general, I agree someone shouldn't only riding the wave without any knowledge. Because they need to learn about the reason they want to invest in Bitcoin except the price, non custodial wallet, how to backup their seed phrase, choosing CEX or DEX and basic computer security. But if someone buy Bitcoin without learn anything, it's still a good choice if they didn't panic sell and can hold for long term. The biggest mistake that did by Average Joe is sell the coins when it doesn't move like what they expect.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Reatim",
      "created_time": "May 01, 2024, 10:13:40 AM",
      "body": "Quote from: Riginac111 on May 01, 2024, 09:32:20 AM invest when you want to invest, don't follow the crowd but follow your instinctPeople who go against the general sentiment will come out on top trust me. When people are trying so hard to pull out of bitcoin, enter the market just as the price drops. Do not think or be worried that maybe there is something wrong with bitcoin. Do your own research and better if you learn to analyze the past trends from before and try to speculate how the market will move in the future.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptoBuds",
      "created_time": "May 01, 2024, 10:17:30 AM",
      "body": "I completely agree with what you said and besides that I also want to emphasize to those who like to give bitcoin investment advice to others. We should limit cramming or convincing someone to invest in bitcoin when they don't know anything about it. Instead, give them basic knowledge about bitcoin and let them decide for themselves whether to invest in it or not. Many bitcoin investors are ignoring the risks and fluctuations of bitcoin and giving investment advice to others just because they want bitcoin to quickly become popular. But this will not help bitcoin become popular quickly, on the contrary, it could damage bitcoin's reputation as well as harm those who receive advice from us.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "I_Anime",
      "created_time": "May 01, 2024, 10:23:47 AM",
      "body": "Quote from: Riginac111 on May 01, 2024, 09:32:20 AMWhen you want to invest in Bitcoin don't because people is investing in Bitcoin and you invest, I prefer taking my time to make a research before I invest on Bitcoin, Bitcoin invest is good but when you don't take your time to invest in Bitcoin then you will invest wrongly, the first time I invested I did not follow anyone step rather I do follow the research I made before I invest, some persons does not control emotions before they invest they follow a side news to invest on Bitcoin and that is why some of them do experience hard luck for their invest, in summary invest when you want to invest, don't follow the crowd but follow your instinctInvesting is one choice, but when it comes to investing in Bitcoin one don't actually require much knowledge like technical and all that before jumping into it. One just need the basic knowledge of Bitcoin and some good cashflow for the accumulation part . Because if you are the type that want to focus on knowing more about bitcoin before investing in it , you may endup missing out big time . Because the price movements actually wait for no one . That's why most time is better to gather some nice basic knowledge about bitcoin first , then start accumulating and as you are holding and accumulating you can focus more in knowing more about bitcoin while you hodl. Because is only those that are into shitcoins would have to take their time to learn more about that particular shitcoins Before jumping which is a total waste of time .Instead of wasting time with such , just focus on Bitcoin accumulation and this forum a whole is full with nice knowledge about Bitcoin so as you are holding you can learn more about Bitcoin here from knowledgeable users here.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "btc78",
      "created_time": "May 01, 2024, 10:36:14 AM",
      "body": "Quote from: CryptoBuds on May 01, 2024, 10:17:30 AMI also want to emphasize to those who like to give bitcoin investment advice to others. We should limit cramming or convincing someone to invest in bitcoin when they don't know anything about it. Instead, give them basic knowledge about bitcoin and let them decide for themselves whether to invest in it or not. When introducing bitcoin to someone let out all of it in front. Be it the good and the bad, you have to let the person you are talking to to be aware and exposed to what they could be entering.It seems complicated to be honest this is why I just don’t give any advices to anyone about bitcoin unless of course they ask me first but otherwise I keep my mouth shut.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Catenaccio",
      "created_time": "May 01, 2024, 10:54:10 AM",
      "body": "Quote from: Riginac111 on May 01, 2024, 09:32:20 AMWhen you want to invest in Bitcoin don't because people is investing in Bitcoin and you invest, I prefer taking my time to make a research before I invest on BitcoinIt is classic advice like from book or course and it is useless for many people. Successful and careful people will do their research before investment and they will not need this advice. It's because they are type of people who are carefully with their action and will do it naturally.For another type of people, careless ones, they will not keep this advice in their mind and will react carelessly as their natural actions not only in Bitcoin market but generally in their life, with everything.Most of people are careless and losers in this market but your advice is good. It can be helpful for people who are careless but can change themselves.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "batang_bitcoin",
      "created_time": "May 01, 2024, 11:09:45 AM",
      "body": "Quote from: Riginac111 on May 01, 2024, 09:32:20 AMWhen you want to invest in Bitcoin don't because people is investing in Bitcoin and you invest, I prefer taking my time to make a research before I invest on Bitcoin, Bitcoin invest is good but when you don't take your time to invest in Bitcoin then you will invest wrongly, the first time I invested I did not follow anyone step rather I do follow the research I made before I invest, some persons does not control emotions before they invest they follow a side news to invest on Bitcoin and that is why some of them do experience hard luck for their invest, in summary invest when you want to invest, don't follow the crowd but follow your instinctDYOR is really recommended thing to do. At least you have the idea why people are flocking to Bitcoin. We tell everyone to invest and then we don't forget to give them a remember that they should only invest what they can afford to lose but before that, they need to do their own research. Even I, I didn't invest because everyone is investing but I did my silent research on it before I have entrusted my hard earned money and invested into it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MeGold666",
      "created_time": "May 01, 2024, 11:19:51 AMLast edit: May 01, 2024, 12:05:25 PM by MeGold666",
      "body": "The problem is that people shouldn't be only investing in cryptocurrencies but instead using them as they are using regular banks and FIAT money - for a secure store of money and to be used everyday.Unfortunately most people got into cryptocurrency world due to countless stories of getting rich and they missed the point entirely, bought into X project and started mindlessly copy/pasting glorifying posts about it to hopefully increase their bags value which in the long term only hurts the value.If people would stop posting \"HODL\" and \"Number goes up\" threads and instead just used it as it supposed to be used (without CEX or any custodial wallet!) then the price would naturally go up anyway but would be more stable because it would be propelled by true usage and not mainly by speculators and their pumpy-dumpy scheme.Speculators who earn by pumping and dumping would still exist but the percentage of impact on the price would be much smaller as users (as oppose to hodlers) would have more moving force than them.By only holding (not using it) the true value disappears and what we get is a bubble of greater fool.I'm not saying you shouldn't use it as investment at all, you can just like you can FIAT money from different countries but mainly it should be used.Hodler = Zombie coins.If you're not using it, you are not participating in the market and actually making it weaker by handing more power to speculators who don't want for the \"number\" to go up but fluctuate, the more drastic the fluctuation the more gains they have.Cryptocurrency is not \"Digital Gold\", never was, never will. It is Digital Money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yazher",
      "created_time": "May 01, 2024, 11:23:32 AM",
      "body": "You will need to get your plan when you want to invest because not all people have the same capital for their investment and when you want to mimic the other's strategies, you better not do like those who invest big money while you are struggling with your financial needs. It's up to you to invest but to go overboard will cause more harm to you than benefit because the crypto market is volatile and you will have lots of depress moments before you actually see the results of your investment. You just need to follow the simple rules, where you invest what you can afford to lose and do it your own way no the other way around.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husires",
      "created_time": "May 01, 2024, 11:31:35 AM",
      "body": "Do not invest in something that you do not understand anything about, or at least do not have basic knowledge about.Investing in Bitcoin is good for those who want a stable, long-term investment and do not think about withdrawing their money within the next 6 years. However, for those who want a quick profit and wealth, Bitcoin is not the most suitable investment for that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rockstarguy",
      "created_time": "May 01, 2024, 11:37:16 AM",
      "body": "Quote from: Riginac111 on May 01, 2024, 09:32:20 AMthe first time I invested I did not follow anyone step rather I do follow the research I made before I invest, some persons does not control emotions before they invest they follow a side news to invest on Bitcoin and that is why some of them do experience hard luck for their invest, in summary invest when you want to invest, don't follow the crowd but follow your instinctThe best step one will take in bitcoin is to just be yourself and do the right things that can yield positive results.  It is common young people choose to invest in bitcoin because their are investing in Bitcoin and they showed interest because of their friends investment in bitcoin just to feel among without knowing anything concerning bitcoin.  It is always important for one to understand what you are investing on. Bitcoin is volatile and it is hard on how to go about it when their is no good understanding about bitcoin. The reason why people needs to invest in bitcoin should be because they know it and understand the volatility of the market and to understand the risk in bitcoin than investing on something you are not sure about.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rodskee",
      "created_time": "May 01, 2024, 11:45:21 AM",
      "body": "Quote from: Riginac111 on May 01, 2024, 09:32:20 AMWhen you want to invest in Bitcoin don't because people is investing in Bitcoin and you invest, I prefer taking my time to make a research before I invest on Bitcoin, Bitcoin invest is good but when you don't take your time to invest in Bitcoin then you will invest wrongly, the first time I invested I did not follow anyone step rather I do follow the research I made before I invest, some persons does not control emotions before they invest they follow a side news to invest on Bitcoin and that is why some of them do experience hard luck for their invest, in summary invest when you want to invest, don't follow the crowd but follow your instinctActually when you are talking about Bitcoin it is OK to just follow what others are doing because this is the safest and most promising and secured currency in crypto , tell this word if they are into shitcoin or other altcoins aside from bitcoin.and also Bitcoin is not about luck or instinct because this is a proven currency that have shownthe world what is this capable off.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yamifoud",
      "created_time": "May 01, 2024, 11:48:54 AM",
      "body": "I invest in Bitcoin because I see many people are into it. I see no wrong about it because it doesn't mean I don't do any research before deciding to take risks. It is just wrong if you invest blindly because someone told you, not because you already have an idea of what is all about. Never be doing this if we are; - lack of knowledge - uncertain - can't afford to take risk - impatientWe don't get jealous if somen becomes rich and successful from investing in Bitcoin instead, know what they are doing and do the same.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "leonair",
      "created_time": "May 01, 2024, 12:15:02 PM",
      "body": "Quote from: Riginac111 on May 01, 2024, 09:32:20 AMWhen you want to invest in Bitcoin don't because people is investing in Bitcoin and you invest, I prefer taking my time to make a research before I invest on Bitcoin, Bitcoin invest is good but when you don't take your time to invest in Bitcoin then you will invest wrongly, the first time I invested I did not follow anyone step rather I do follow the research I made before I invest, some persons does not control emotions before they invest they follow a side news to invest on Bitcoin and that is why some of them do experience hard luck for their invest, in summary invest when you want to invest, don't follow the crowd but follow your instinctPeople who invest in Bitcoin by because others are doing it, I am sure they also invest in other coins by watching others, and at the end of the day they face losses. There is no way you have to do any kind of investment just because someone else has done it. Before making any investment, you must do a good analysis by looking at its pros and cons and then make sure that the investment is suitable for you.  I always think that a new investor should start his investment with Bitcoin and it must be for long term so he won't face loss.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gaza13",
      "created_time": "May 01, 2024, 12:29:55 PM",
      "body": "Quote from: Riginac111 on May 01, 2024, 09:32:20 AMWhen you want to invest in Bitcoin don't because people is investing in Bitcoin and you invest, I prefer taking my time to make a research before I invest on Bitcoin, Bitcoin invest is good but when you don't take your time to invest in Bitcoin then you will invest wrongly, the first time I invested I did not follow anyone step rather I do follow the research I made before I invest, some persons does not control emotions before they invest they follow a side news to invest on Bitcoin and that is why some of them do experience hard luck for their invest, in summary invest when you want to invest, don't follow the crowd but follow your instinctIt's appropriate that if we want to invest anywhere, it's a good idea to search first before buying. Even if someone doesn't have the basics in tracking assets, but they want to invest and already know the risks, they will definitely look for news or information from anywhere, including influencers, if the influencer educates the public properly and correctly in investing, they will tell them to buy Bitcoin, I I think they chose correctly.In my opinion, the wrong person is what you said above, with minimal experience and knowledge. The first thing they think about is how to make very short profits in crypto so they look for hyped coin news, I think that's where they go wrong. What we all know is that investing in Bitcoin with the expected profits certainly requires a lot of time, we need extra patience in maintaining our assets.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PrivacyG",
      "created_time": "May 01, 2024, 12:39:38 PM",
      "body": "I rather have people invest in Bitcoin like sheep than purchasing NFTs and all the other Bull Shit they are offered that they think will make them Rich.Investing is a thing some body needs to experiment if they have not yet however.  You could feel ready for becoming an investor and once you put the Money in there and the Market enters a dump, you will not be so sure of your choices any more.  It is worth starting with a little bit of Money and building your Portfolio from there.  Every body under estimates how much a significant Market move can impact them emotionally, until it actually happens and they start panicking.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}