{
  "id": "topic_5402808",
  "title": "Kismet108",
  "author": "Kismet108",
  "created_time": "June 16, 2022, 08:26:29 AMLast edit: June 16, 2022, 08:36:35 AM by Kismet108",
  "content": "Any electricians with mining experience or miners with working electricity knowledge here?I’ve done a search of old posts and it’s a lot of information and I’m relatively new to ASIC mining.  I’m looking for advice on what to request my electrician.  The opportunity for me is asking here so I can forward plan and have the safest and as best a set up as possible for now and near future.  I’m betting and banking on Bitcoin and have caught the mining bug.  Already know about costs / profit so really just want to focus on what I need to run miners and whats good to have.Based in the UK and my home fuse box is 240V / 100amp .  I’m requesting as thick a gauge cable as possible that run 30m to the garage connected to the main box ( I believe it’s 25mm cable )But what else should I be asking for?  I want lots of plug points but do I need to ask for a certain type of ampage / plug / breakers ) . I will be  running 1 s19, 2 x Canaan 11 series,  2 x  L3s and maybe a couple of S9’s (until I can add another big machine - maybe another s19 if the prices drop further that I can’t say no). Oh and of course fans for moving air and controlling temps Any help would be appreciated.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5402808",
  "comments": [
    {
      "author": "a1 Hashrate LLC2022",
      "created_time": "June 16, 2022, 01:58:38 PMLast edit: June 16, 2022, 03:37:51 PM by a1 Hashrate LLC2022",
      "body": "Quote from: Kismet108 on June 16, 2022, 08:26:29 AMAny electricians with mining experience or miners with working electricity knowledge here?I’ve done a search of old posts and it’s a lot of information and I’m relatively new to ASIC mining.  I’m looking for advice on what to request my electrician.  The opportunity for me is asking here so I can forward plan and have the safest and as best a set up as possible for now and near future.  I’m betting and banking on Bitcoin and have caught the mining bug.  Already know about costs / profit so really just want to focus on what I need to run miners and whats good to have.Based in the UK and my home fuse box is 240V / 100amp .  I’m requesting as thick a gauge cable as possible that run 30m to the garage connected to the main box ( I believe it’s 25mm cable )But what else should I be asking for?  I want lots of plug points but do I need to ask for a certain type of ampage / plug / breakers ) . I will be  running 1 s19, 2 x Canaan 11 series,  2 x  L3s and maybe a couple of S9’s (until I can add another big machine - maybe another s19 if the prices drop further that I can’t say no). Oh and of course fans for moving air and controlling temps Any help would be appreciated. Okay1x  s19  =  3500 watts2x 1146 = 7000 watts3x L3+  =. 1600 watts2x s9     =. 2600 wattstotal     =  14700 watts14700/230 = 64 amps derate and you get 64/0.80 = 80 amps. your home is only 100 amps so If I were you I would up grade the main panel to 150 amps then run a 100 amp subpanel to the garage.I would put in 4 x 30 amp circuits in the sub panel.All of the above will cost you quite a bit of money.and the garage will be very hot and very loud. as 14.7 kwatts is over  50,000 btu of heat.it is also 10,800 kwatts of power per monthedit you will need to move a lot of air to cool it.maybe as much as 6000 cfm input and outputTHESE could work maybehttps://www.amazon.co.uk/VEVOR-Industrial-Extractor-Pivoting-Ventilation/dp/B08JPKGL68/ref=sr_1_60_sspa?they have duct work which helps",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kismet108",
      "created_time": "June 16, 2022, 11:58:33 PM",
      "body": "Thank you! My current fusebox does need updating so I can ask how much it would cost.As you said it’s probably going to cost a fair bit so it maybe more cost effective to use what I have for now and just prioritise my machines and max wattage accordingly. So stay within that 50/60A range for the garage and work within 11000W? I’m currently using tornado box fans, they seem to work well and quietly.  I’m looking at using PDU’s also !",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Coinfarm ventures",
      "created_time": "June 17, 2022, 01:41:05 AMLast edit: June 17, 2022, 01:58:14 AM by Coinfarm ventures",
      "body": "Quote from: Kismet108 on June 16, 2022, 11:58:33 PMI’m looking at using PDU’s also ! PDU's are a waste of $. Instead, install a 2-gang or 4-gang outlet box and simply connect each ASIC to each outlet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "spectre71",
      "created_time": "June 17, 2022, 03:07:52 AM",
      "body": "Are the L3's and S9's even worth the effort/cost?Seems to me the juice isn't worth the squeeze",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Coinfarm ventures",
      "created_time": "June 17, 2022, 04:07:59 AM",
      "body": "Quote from: spectre71 on June 17, 2022, 03:07:52 AMAre the L3's and S9's even worth the effort/cost?Seems to me the juice isn't worth the squeezeI don't know how he will get a power rate low enough in the UK for the Antminer L3 to even stay profitable, let alone compensate for depreciation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "altefritzbitz",
      "created_time": "June 17, 2022, 02:46:03 PM",
      "body": "I'm currently UK based and looking to build a mining rig next year. if you don't mind my asking, how are you getting electricity at a rate low enough to turn a profit?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mikeywith",
      "created_time": "June 17, 2022, 11:55:00 PM",
      "body": "Quote from: Kismet108 on June 16, 2022, 08:26:29 AMBased in the UK and my home fuse box is 240V / 100amp .  I’m requesting as thick a gauge cable as possible that run 30m to the garage connected to the main box ( I believe it’s 25mm cable )100a on 25mm2 cable is the max, and it won't be able to run 24/7 without a voltage drop for some degree, not sure what type of fuse do you have, but you are going to need to install smaller breakers to be on the safe side, the total amp you can draw from that 25mm2 cable would be 80amp so do work with that number.Also, you might have 3 phases at the main panel, not sure about the U.K but here most home panels have 3 phase set ups but the electric company will often run 4 wires (3 live and 1 natural ) but only plug 1 and leave 2 for future expansion purposes, if you are likey, you might find just that, if not just work with the 80amps you have.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Car72",
      "created_time": "June 23, 2022, 07:59:48 PM",
      "body": "Currently introduced with this gadget.I think it,s good working",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lloydye",
      "created_time": "July 14, 2022, 04:04:54 PMLast edit: July 18, 2022, 08:48:18 AM by lloydye",
      "body": "Surely there are electricians with experience in mining that you should find and ask for their help. Especially in the UK, I am sure it is very easy to find a good specialist to help you install electricity. I don't recommend you do it yourself. I once tried to install electricity on my own, but it wasn't the best ending. So I turned to the specialists at https://www.propointelectrical.com.au/serviced-areas/bayside/, and they fixed my problems quickly and qualitatively. I recommend you take the same steps.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}