{
  "id": "topic_5457935",
  "title": "alastantiger",
  "author": "alastantiger",
  "created_time": "June 28, 2023, 09:07:51 PM",
  "content": "Will I ever join the merit 5k plus merit club or reach 5k plus merits? I have pondered this question numerous times. The profiles of certain legendary members indicate that they have indeed achieved the impressive milestone of 5k plus merit. They are regarded as the most prominent figures on this platform and given preferential treatments during signature campaign application and selection, and I greatly admire them. In this forum, it is almost considered taboo for newcomers to discuss merits. The typical response received is often critical. Some individuals attempt to convey their message politely by advising new members not to focus on merits, but rather to concentrate on creating high-quality posts without making merits their primary goal. Personally, I have doubts about this perspective. In order to progress on this forum, one must actively pursue growth and development. Being intentional entails setting goals. This question is directed to everyone, but particularly to those who belong to the esteemed 5k plus merit club. Did you ever set a merit goal for yourself, such as aiming for 2000 or 5000 merits by a certain point in time? Or did you simply remain an active member without explicitly considering merits, only to one day discover that your account had accumulated 5000 plus merits?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5457935",
  "comments": [
    {
      "author": "un_rank",
      "created_time": "June 28, 2023, 09:12:21 PM",
      "body": "The way I see it, discussing merits in general is frowned upon, it just so happens that newbies are the ones who engage in it more often (while having earned very little of it) making them look like the target.Also it is one thing to have a desire to rank up and pursue a target in the forum and it is another thing to try to use merit discussions as bait for other members to give you some of their smerits. - Jay -",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "June 28, 2023, 09:19:04 PM",
      "body": "I did not expect I could have more than 3000 merits by this times, but I tried to make quality posts. I see merit system on this forum like how life is, you can not expect everyone to be the same, but if you are a good posted, you will join a campaign. Quote from: alastantiger on June 28, 2023, 09:07:51 PMThey are regarded as the most prominent figures on this platform and given preferential treatments during signature campaign application and selection, and I greatly admire them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nwada001",
      "created_time": "June 28, 2023, 09:24:34 PM",
      "body": "Since you already know it's like a tabu for you to discuss merit, why still engage in such a conversation? Well, we all have freedom of expression, and we are all entitled to express how we feel and what kind of question we want to ask. To me I don't think I have given my self that headache of thinking about how to climb that high in merit earning. I just believe that the less I pay attention to those, the more I can become more focused. If I'm consistent in what I'm doing, those will only take time, but one will definitely get there some day as long as the merit system keeps on going. Those who have such merit and even more than that are devoted to their task; they have areas in which they are good, and they are creative with them. If you want to be among the high merit earners, I will advise you to put more of those energies you are using to do the imagination work. Maybe luck will be on your side and you will happen to wear those badges some day.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tvplus006",
      "created_time": "June 28, 2023, 09:35:51 PM",
      "body": "Quote from: alastantiger on June 28, 2023, 09:07:51 PM...In this forum, it is almost considered taboo for newcomers to discuss merits. The typical response received is often critical. Some individuals attempt to convey their message politely by advising new members not to focus on merits, but rather to concentrate on creating high-quality posts without making merits their primary goal. Personally, I have doubts about this perspective. In order to progress on this forum, one must actively pursue growth and development. Being intentional entails setting goals. ..Obviously, this is due to the fact that a beginner does not have a general understanding of cryptocurrency, but at the same time he is interested solely in merit. And until such a beginner gets enough knowledge, he will not be able to publish high-quality posts for which he can get merit.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zaguru12",
      "created_time": "June 28, 2023, 09:39:27 PM",
      "body": "Quote from: alastantiger on June 28, 2023, 09:07:51 PMIn this forum, it is almost considered taboo for newcomers to discuss merits. The typical response received is often critical. Some individuals attempt to convey their message politely by advising new members not to focus on merits, but rather to concentrate on creating high-quality posts without making merits their primary goal. Personally, I have doubts about this perspective. In order to progress on this forum, one must actively pursue growth and development. Being intentional entails setting goals. Generally because it is not what the forum was created for. It was just to distinguish people some prominent and helpful members or find a way to appreciate people on the forum. Talking about it would only make it looks like it is a serious parameter on the forum and many would do all sort of things just to get them and this will dis-orient the sole aim of the forum. QuoteThis question is directed to everyone, but particularly to those who belong to the esteemed 5k plus merit club. Did you ever set a merit goal for yourself, such as aiming for 2000 or 5000 merits by a certain point in time? Or did you simply remain an active member without explicitly considering merits, only to one day discover that your account had accumulated 5000 plus merits?I doubt they set a goal to it because from there responses and threads you see how freely they engage in discussion but for those who seek this merit you would see from there discussion and how they eagerly creates threads. This doesn’t mean they don’t appreciate and feel some kind or pride when they get them ( this is gotten from their personal threads to show their reputation on the service board). But I don’t think they care. Because if they do they would been creating threads just to get them similar to this kind of threads you just created.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mate2237",
      "created_time": "June 28, 2023, 09:44:01 PM",
      "body": "Quote from: Charles-Tim on June 28, 2023, 09:19:04 PM,but I tried to make quality posts. I see merit system on this forum like how life is, you can not expect everyone to be the same, but if you are a good posted, you will join a campaign. Quality post is all the matter for meritting but what is quality is different from users who like to merits a poster. Whenever one does something nice in real life, they appreciate either by kind or by award and that is how the merit system works. Whenever you drop a quality post, some will give you merits while will talk good about the post all still contribute to the op thread for appreciation. The 5k merits op is talking about, he will also receive them when posts have been produced by him.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "The Cryptovator",
      "created_time": "June 28, 2023, 09:45:45 PM",
      "body": "The purpose of introducing merit to the forum was to encourage users to be productive rather than spamming aimlessly. In essence, if you contribute valuable posts that are recognized by other users, you can earn merit points effortlessly. Personally, I have amassed over 2,000 merits, which was no simple feat. However, I never set specific goals for earning merits; instead, I simply contribute to the forum to the best of my abilities.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sandra_hakeem",
      "created_time": "June 28, 2023, 09:53:06 PM",
      "body": "It all depends on how you see this whole meritocracy...There's nothing special about having 5k merits; as long as we ain't got any other formal rank after the legendary, then it's fine to \"take a slow Walk \" after that milestone ...Alot of members have gained recognition but with fewer merits - bringing that incase you're really keen on it too.  This whole thought would definitely come through your mind when you're stuckup, then you ain't got no merit flow anymore... If you're taking it that way then peeps that have been onboard for several years, with Alot of merits and recognition yet, they got no green tags should even be more worried too.. cus what's the reputation without 'em tags?? Hahahah... Funny human!Sandra 🧑‍🦰",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fullcoinese",
      "created_time": "June 28, 2023, 10:26:48 PM",
      "body": "Quote from: alastantiger on June 28, 2023, 09:07:51 PMIn this forum, it is almost considered taboo for newcomers to discuss merits. The typical response received is often critical. Some individuals attempt to convey their message politely by advising new members not to focus on merits, but rather to concentrate on creating high-quality posts without making merits their primary goal. Personally, I have doubts about this perspective. In order to progress on this forum, one must actively pursue growth and development. Being intentional entails setting goals. for some beginners who still don't have much knowledge and don't fully understand how this forum works, of course i think besides they have to spend more time to gain knowledge, they also have to focus on understanding as a whole how this forum works and adapting to how this forum works first before they think about making quality posts, getting merits and ranking up.if beginners can catch the outline of how this forum works, then all that remains is to think about it and be consistent in contributing by making quality posts to be able to get merits and rank up.Quote from: alastantiger on June 28, 2023, 09:07:51 PMThis question is directed to everyone, but particularly to those who belong to the esteemed 5k plus merit club. Did you ever set a merit goal for yourself, such as aiming for 2000 or 5000 merits by a certain point in time? Or did you simply remain an active member without explicitly considering merits, only to one day discover that your account had accumulated 5000 plus merits?i don't know but i think if we target to get merit within a certain time limit it will burden ourselves. because if the results cannot be in accordance with our wishes then it can cause a feeling of disappointment and easily give up on us.all I do is just try my best to contribute and enjoy it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BIT-BENDER",
      "created_time": "June 28, 2023, 10:34:24 PM",
      "body": "I am obviously not in the club, LOL but I am very good with what I have so far, I think I can remember many accounts I recognize when I was building seeing some of them in those low position is sad and also joyous because I don't want to see anyone's growth halted I also want to give myself some credit. I don't think there is anyone that when they came newly the would have taught they will be on 5k merit, that feeling van only come when you are very close to it. So it's best newbies get there priority in check. It's ok to dream big but try reaching out for achievable goals and steadily great goals can be reached.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ImThour",
      "created_time": "June 28, 2023, 11:09:04 PM",
      "body": "I do not recommend to create threads and ask when I will reach certain amount of merit(s). Instead, create good posts which lead you to earn more merits. Reaching 5000 merits is a good target however not an easy to achieve, you need to work hard and share seriously great stuff on the forum to get to that target and it might take 2-3 years if you post regularly. Good Luck with that!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Myleschetty",
      "created_time": "June 28, 2023, 11:44:21 PM",
      "body": "Quote from: alastantiger on June 28, 2023, 09:07:51 PMIn this forum, it is almost considered taboo for newcomers to discuss merits. It's not considered as taboo and the reason why it is not advisable for newbies to make discussion about merit is because it will be see by merit source as someone who is hungry to merit and the same maybe added to the ignore list of the merit source.To safe from the trouble it is good for newbie not to discuss about merit.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hatshepsut93",
      "created_time": "June 28, 2023, 11:45:54 PM",
      "body": "People who have 5000 merit don't care about merit, they are passionate about Bitcoin, and that makes them receive merit for almost every post, because they don't force themselves to post. Simply earning a lot of merit is such a pointless goal in life. Like 500-1000 merit is enough to join any signature campaign. And no one outside of this forum knows or cares what merit is. Quote from: alastantiger on June 28, 2023, 09:07:51 PMWill I ever join the merit 5k plus merit club or reach 5k plus merits?You can't earn 5k merit by trying to earn 5k merit, you need to have deep understanding of Bitcoin and many related topics and apply them in new contexts, like discussing fresh development in Bitcoin ecosystem.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lida93",
      "created_time": "June 29, 2023, 12:46:53 AM",
      "body": "Quote from: alastantiger on June 28, 2023, 09:07:51 PMThis question is directed to everyone, but particularly to those who belong to the esteemed 5k plus merit club. Did you ever set a merit goal for yourself, such as aiming for 2000 or 5000 merits by a certain point in time? Or did you simply remain an active member without explicitly considering merits, only to one day discover that your account had accumulated 5000 plus merits?I wonder how bad a member would need certain merits that would make him decides to set a goal target towards it. I strongly believe that such target if not we'll checked it manage could lead to the breeding of merits farming leading to shit posts.There are things in life we don't need to set goals for and in the case of this forum merits I suppose is one them. Just keep doing your thing with an express mind as one driven with quality both in your posting style and information and you'll wake up as a 5k+ merits owned member someday.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackBoss_",
      "created_time": "June 29, 2023, 01:28:39 AM",
      "body": "Quote from: alastantiger on June 28, 2023, 09:07:51 PMWill I ever join the merit 5k plus merit club or reach 5k plus merits?If you won't die or leave the forum, you will get it. Repeat 50 times from what you have gotten and you will get 5k merit if you continue your quality posts and help forum members.QuoteI have pondered this question numerous times. The profiles of certain legendary members indicate that they have indeed achieved the impressive milestone of 5k plus merit. They are regarded as the most prominent figures on this platform and given preferential treatments during signature campaign application and selection, and I greatly admire them. They don't care about those numbers when they got it but we care about those numbers because we did not get it for ourselves.QuoteThis question is directed to everyone, but particularly to those who belong to the esteemed 5k plus merit club. Did you ever set a merit goal for yourself, such as aiming for 2000 or 5000 merits by a certain point in time? Or did you simply remain an active member without explicitly considering merits, only to one day discover that your account had accumulated 5000 plus merits?When above Legendary member rank, no other ranks, they don't have any goal to rank up. Merit race among prominent members does not have many participants.Most merit club, initial merit includedMost earned merit club, initial merit excluded",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Liliana1304",
      "created_time": "June 29, 2023, 06:25:15 AM",
      "body": "According to your heading, you're trying to pass a message of not asking a merit related question but from your first line, it seems exactly what you are doing. Quite contradictory to me. Well, nothing good comes easy so as long as you don't get discouraged along the way, it can be achieved. The way I see the merit and ranking system, it's how quality you make your posts that these things will come, it's just like a magnet. No need to be in a haste to achieve that status because once there, I think at some point, that euphoria will die down and then you'd become nostalgic, remembering how you were once a newbie. So just let it flow.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hyphen(-)",
      "created_time": "June 29, 2023, 06:49:56 AM",
      "body": "Quote from: alastantiger on June 28, 2023, 09:07:51 PMWill I ever join the merit 5k plus merit club or reach 5k plus merits? I have pondered this question numerous times. The profiles of certain legendary members indicate that they have indeed achieved the impressive milestone of 5k plus merit. They are regarded as the most prominent figures on this platform and given preferential treatments during signature campaign application and selection, and I greatly admire them. Legendary members with more than 5000 merits are public figures in this forum since it takes a lot of hard effort and consistent support to the community through quality engagements for a person to come that far. That is why they are always rewarded.QuoteIn this forum, it is almost considered taboo for newcomers to discuss merits. The typical response received is often critical. Some individuals attempt to convey their message politely by advising new members not to focus on merits, but rather to concentrate on creating high-quality posts without making merits their primary goal. Personally, I have doubts about this perspective. In order to progress on this forum, one must actively pursue growth and development. Being intentional entails setting goals. Everything is a gradual process; merits will come when the newbie starts posting quality content or making quality contributions in the forum.Newbies did not need to show their disparity in looking for merits; they rather went extra-mind and thought of something that would be beneficial to the forum, which I am very sure would fetch them merits.QuoteThis question is directed to everyone, but particularly to those who belong to the esteemed 5k plus merit club. Did you ever set a merit goal for yourself, such as aiming for 2000 or 5000 merits by a certain point in time? Or did you simply remain an active member without explicitly considering merits, only to one day discover that your account had accumulated 5000 plus merits?Some of them have the objective in mind since they know they will reach that level as a result of the quality contributions they're given in this forum, and we all know that merits are a reward for quality contributions in the forum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lovesmayfamilis",
      "created_time": "June 29, 2023, 06:59:43 AM",
      "body": "I think that it is normal for a person to strive for growth, especially since there are privileges for ranks on this forum. This may contain not only financial interest but also the most common excitement. To prove first to yourself and maybe to others that you can do it is always considered a good character trait. The competition becomes interesting when a person understands that it is quite easy for him to get merit. I know a user who came to the forum later than some of the leaders, but he is literally a merit magnet and someone who really takes big steps. Look at Ratimov. But in order to achieve all the merits, you can see how much work and time were spent to get into the top ten.I am glad that from time to time people come to the forum and blow up the forum with their publications, and for those who like to compete, they will be a good motivator for growth.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rachael9385",
      "created_time": "June 29, 2023, 07:10:52 AMLast edit: June 29, 2023, 07:26:48 AM by rachael9385",
      "body": "Quote from: ImThour on June 28, 2023, 11:09:04 PMI do not recommend to create threads and ask when I will reach certain amount of merit(s). Instead, create good posts which lead you to earn more merits. Reaching 5000 merits is a good target however not an easy to achieve, you need to work hard and share seriously great stuff on the forum to get to that target and it might take 2-3 years if you post regularly. Good Luck with that!Yes mate, I can imagine that the OP is in a RUSH to earn a thousand merit's for his/her own favour, OP must be a greedy person that always want free thing and not liking to work hard to get want he want, merit is a reward for hard work so we have to work so we can get a reward.Quote from: lovesmayfamilis on June 29, 2023, 06:59:43 AMI think that it is normal for a person to strive for growth, especially since there are privileges for ranks on this forum.You are right on that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}