{
  "id": "topic_5406514",
  "title": "andrewliucheng88",
  "author": "andrewliucheng88",
  "created_time": "July 16, 2022, 11:29:04 AM",
  "content": "CryptoQWERTY is a play-to-earn, competitive typing and betting game using both blockchain and off-chain transactions. NFTs can be converted optionally into a real-world product (CQKeyboards) which is able to mine a cryptocurrency by using the product.Our goal is to established a customizable keyboard company that produce internationally that can use a cryptocurrency and fiat for transactions.CryptoQWERTY has a token utility; Click CLK with 100,000,000 limited supply (no mint functions). It can be used for any transactions within the app andfor payment on buying products in the future. Minting price for NFT is 0.3 BNB and it's limited to 50,000 mints only.visit our website for more information https://cryptoqwerty.io",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5406514",
  "comments": [
    {
      "author": "Saisher",
      "created_time": "July 16, 2022, 12:59:08 PM",
      "body": "Quote from: andrewliucheng88 on July 16, 2022, 11:29:04 AMCryptoQWERTY is a play-to-earn, competitive typing and betting game using both blockchain and off-chain transactions. NFTs can be converted optionally into a real-world product (CQKeyboards) which is able to mine a cryptocurrency by using the product.Our goal is to established a customizable keyboard company that produce internationally that can use a cryptocurrency and fiat for transactions.CryptoQWERTY has a token utility; Click CLK with 100,000,000 limited supply (no mint functions). It can be used for any transactions within the app andfor payment on buying products in the future. Minting price for NFT is 0.3 BNB and it's limited to 50,000 mints only.visit our website for more information https://cryptoqwerty.ioYou should post this in the altcoin announcement thread since you are introducing your project so it gains more attention if you are serious about promoting your project here in Bitcointalk get a copper account and hire a thread designer to design your announcement and you can also launch a bounty campaign posting your project is not enough you have to announce it to people who are looking for a new project to invest.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}