{
  "id": "topic_5458421",
  "title": "acroman08",
  "author": "acroman08",
  "created_time": "July 03, 2023, 11:24:27 AMLast edit: July 03, 2023, 12:37:08 PM by acroman08",
  "content": "I thought I'd share this with you guys.I stumbled upon a video on TikTok(link below) talking about a bathhouse business in New York using the heat from the Bitcoin mining rigs that they own to heat the water that they use for their pools. for anyone curious about the process of how they heat the water they use for their pools, they made a FAQ on their website about it, I'll share the link below. obviously, there are people who don't like what they are doing because of the carbon emission produced by the Bitcoin mining rigs. but personally, I think this idea is genius, they are saving money for their business by using the heat from the mining rigs and they are earning money from mining Bitcoin, it's a win-win.also, judging from their FAQ, it looks like they also accept Bitcoin as a payment method(surprising).TikTok videohttps://www.tiktok.com/@thechainsawdotcom/video/7249624706419117313FAQhttps://help.abathhouse.com/hc/en-us/articles/16748674443924-Do-you-mine-Bitcoin-How-does-it-work-",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5458421",
  "comments": [
    {
      "author": "tbct_mt2",
      "created_time": "July 03, 2023, 11:40:54 AM",
      "body": "That news are days ago Bitcoin mining heats water in Brooklyn Bathhouse, users flip outThis idea is not new in 3Rs principle and in Bitcoin mining, it is not new too. In 2018 we had that one This Guy Heated Bath Water With Bitcoin Mining and It Worked Too Well.The popularity of this practice is increasing and the level of application potentially can become bigger and it is part of Bitcoin adoption. Bitcoin mining is green enough and with such energy reuse, it becomes greener.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "KiaKia",
      "created_time": "July 03, 2023, 12:02:26 PM",
      "body": "Interesting, now can anyone clarify if this is safe to use on the human body? Is this healthy? Also do you think it makes sense to decide to use your Asic miner to heat up your bathing water when you can follow the normal everyday routine? Does this makes sense for human use or this person is just telling us that it's possible? Even if it's possible I don't want to use it, because there is really no reason to....Am I lacking some understanding? Fill me up with what I am missing, but no I don't see why this is necessary.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dansus021",
      "created_time": "July 03, 2023, 12:25:53 PM",
      "body": "I think the idea of using ASIC miner for the heater is not new I found a similar post in the Bitcoin Mining Section and I also found on the internet like this image shown below.and its pretty much a good idea though because heat from the miner is a waste of energy and if we can use it properly it benefits us Quote from: KiaKia on July 03, 2023, 12:02:26 PMInteresting, now can anyone clarify if this is safe to use on the human body? Is this healthy? Also do you think it makes sense to decide to use your Asic miner to heat up your bathing water when you can follow the normal everyday routine?  But I am also curious about this one since the heat maybe contain some radiation",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "acroman08",
      "created_time": "July 03, 2023, 12:36:28 PM",
      "body": "Quote from: tbct_mt2 on July 03, 2023, 11:40:54 AM-snipyeah, I've heard about using Bitcoin mining rigs as a way to heat areas, water or something before but seeing a business doing it is quite fun.Quote from: KiaKia on July 03, 2023, 12:02:26 PMInteresting, now can anyone clarify if this is safe to use on the human body? Is this healthy? Also do you think it makes sense to decide to use your Asic miner to heat up your bathing water when you can follow the normal everyday routine? Does this makes sense for human use or this person is just telling us that it's possible? Even if it's possible I don't want to use it, because there is really no reason to....Am I lacking some understanding? Fill me up with what I am missing, but no I don't see why this is necessary.yeah, the water heated by the mining rigs it is safe to use on the human body, from what I have read on their FAQ, the Bitcoin mining rigs basically just acts as a heater, but in order to heat the water, they have a safe process of doing it. I suggest you read their FAQ, it is just a quick read. also, just a clarification, the bathhouse that I am talking about is a business and not an individual. perhaps I should have clarified that in my original post.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "m2017",
      "created_time": "July 03, 2023, 12:56:31 PM",
      "body": "Quote from: acroman08 on July 03, 2023, 11:24:27 AMI thought I'd share this with you guys.I stumbled upon a video on TikTok(link below) talking about a bathhouse business in New York using the heat from the Bitcoin mining rigs that they own to heat the water that they use for their pools. for anyone curious about the process of how they heat the water they use for their pools, they made a FAQ on their website about it, I'll share the link below. obviously, there are people who don't like what they are doing because of the carbon emission produced by the Bitcoin mining rigs. but personally, I think this idea is genius, they are saving money for their business by using the heat from the mining rigs and they are earning money from mining Bitcoin, it's a win-win.also, judging from their FAQ, it looks like they also accept Bitcoin as a payment method(surprising).TikTok videohttps://www.tiktok.com/@thechainsawdotcom/video/7249624706419117313FAQhttps://help.abathhouse.com/hc/en-us/articles/16748674443924-Do-you-mine-Bitcoin-How-does-it-work-Obviously, it is foolish not to use energy in the form of heat released from rigs when bitcoin mining. Instead of simply releasing it into the atmosphere, it is more rational to use it for various household purposes. This allows you to save on utilities and at the same time, get the desired result, such as heating water in the bath and pool that you are talking about. Bitcoin mining is the main goal, but this by-product of heat can also be very useful.Perhaps in the future, almost all devices that generate heat will be replaced by bitcoin mining rigs (or alts). Why waste electricity just to generate heat when you can mine btc in parallel? The answer seems to be obvious and will become more relevant with each new increase in the price of bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ZAINmalik75",
      "created_time": "July 03, 2023, 05:36:49 PM",
      "body": "Scientists says a human can not use 100% of their minds but these are not humans these are legends. who had used their mind and made a use case just out of the mining of BTC. I am not referring to the use cases of BTC but only of the mining of BTC. Which i think i have not seen any.Because all i have seen is Supporters of the green world had always found a way to demotivate the mining of BTC. And they are correct too I am not saying they are doing a bad thing. But, they should also praise this good feature as well, who knows, a few days after another legend comes up with another idea to totally eliminate the carbon emission from mining rigsOr they might come up with ideas to use that carbon being emitted from the rigs completely. This proved that world and the people inside it are revolutionizing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sunsilk",
      "created_time": "July 03, 2023, 07:18:13 PM",
      "body": "So looking at it, people are scrutinizing the business for using the heat that they're getting from the rigs. Well, I'd say that's a better use rather than it will just be adding to the heat pollution of the world. These comments about carbon emission from bitcoin mining are all bias.They're only pointing out on it but they also know that there are factories that are doing more than it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "darkangel11",
      "created_time": "July 03, 2023, 07:58:07 PM",
      "body": "It's a great idea, but as others have said it's not new. A long time ago, probably in 2018 or something, there was an article about a guy who used his miners to heat a greenhouse, which allowed him to grow fruit all year round. He also could direct that heat into his driveway to melt snow. I know a guy who bought ASIC miners just for the winter season because it allowed him to save up on heating. He bought everything in Autumn, kept heating the house until late Spring and sold everything with nice profit.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wimex",
      "created_time": "July 03, 2023, 09:44:49 PM",
      "body": "I am in favor of preserving the environment, if we destroy the world we live in we would be destroying ourselves. That is why I understand in a certain way the controversies about bitcoin mining and the people who consider that nature is damaged; but as everyone should do, I investigate and try to find out if everything they argue is true. And yes, it causes damage, but compared to other industries, if we could classify mining that way, they are doing something about it, there are oil companies that have been causing excessive pollution for years and I don't see that they want to look for an alternative to avoid polluting, it was until bitcoin mining appeared recently that alternatives were being created to reduce this spread. And what's more……..seeing news like this, the interest in finding optimal solutions to continue with this type of work is demonstrated, the ingenuity of this person to use something that can generate a large amount of money, to create another business using the same raw material and at the same time making a positive impact in reducing energy use is a good thing. Always open manufactures that cause some kind of damaging factor, for me the important thing is to see what actions they take to reduce the impact.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "serjent05",
      "created_time": "July 03, 2023, 10:14:07 PM",
      "body": "This is not surprising, it is an obvious fact that mining rigs produce tremendous heat which can be manipulated to use as a heater.  It has been used as a heater during winter so it is not a surprise if they use it to heat baths.  With human mind being creative, I believe this is not the only useful thing miner can take advantage of the heat produced by the mining rig especially a  mining farm.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "July 03, 2023, 10:29:27 PM",
      "body": "Quote from: dansus021 on July 03, 2023, 12:25:53 PMQuote from: KiaKia on July 03, 2023, 12:02:26 PMInteresting, now can anyone clarify if this is safe to use on the human body? Is this healthy? Also do you think it makes sense to decide to use your Asic miner to heat up your bathing water when you can follow the normal everyday routine?  But I am also curious about this one since the heat maybe contain some radiationradiation??? (facepalm)asics do not produce radiation. its jsut the amount of electric flowing through metal circuits so fast it heats the metal.. the same as a coffee kettle or any electric heater operates.. its not radiation to worry about its if you heat water too much it boils and the heat can burn your skin. thats where you would need to have some thermometers and a flush system to pump in cold water into the bath to moderate the heat from the asic heating systems hot water.. much like most baths using a hot and cold tapanyone using or owning a heated swimming pool knows this. if you feel the inlet pumps for the pool some are warm water some are cold water and they open and close(push more or less water in) based on what the majority temperature of the pool is to keep it to a certain level",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fiatless",
      "created_time": "July 03, 2023, 10:48:11 PM",
      "body": "Quote from: darkangel11 on July 03, 2023, 07:58:07 PMIt's a great idea, but as others have said it's not new. A long time ago, probably in 2018 or something, there was an article about a guy who used his miners to heat a greenhouse, which allowed him to grow fruit all year round. He also could direct that heat into his driveway to melt snow. I know a guy who bought ASIC miners just for the winter season because it allowed him to save up on heating. He bought everything in Autumn, kept heating the house until late Spring and sold everything with nice profit.I checked the internet and I saw many people that are maximizing the heat from ASIC miners. I think this is creative thinking and it is also good for our environment. If miners can be able to divert the heat to other useful areas the attack that bitcoin mining consumes more electricity will reduce to some extent. I saw an article where mining heat was used to dry wood in Norway and it was also used to heat a greenhouse that produces flowers Netherlands.  Recycling of energy will help miners to the save cost of electricity. We will keep on seeing more innovation until the majority of miners will embrace the recycling of the heat that mining machines produce.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hannahB4",
      "created_time": "July 03, 2023, 10:49:51 PM",
      "body": "This is awesome, just wondering why people are innovative nowadays to think of such innovation but one just needs to be cautious and find out if there is any side effect on the individual internal and external body upon use.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tbct_mt2",
      "created_time": "July 03, 2023, 10:54:32 PM",
      "body": "Quote from: acroman08 on July 03, 2023, 12:36:28 PMyeah, I've heard about using Bitcoin mining rigs as a way to heat areas, water or something before but seeing a business doing it is quite fun.It has been changing to be bigger application. From individual to business levels, it is a very good upgrade of reusing heats from Bitcoin ASIC mining rigs. From small business, we will see bigger business companies apply this. 3Rs are already a big trend in the world and it helps to reduce carbon emission.If you already have a good heat source, why don't use it for other things, to save the environment and to save cost from electricity, fuel. Like from modern inccinerator facilities, they reuse heat from burning waste.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hatshepsut93",
      "created_time": "July 03, 2023, 11:11:33 PM",
      "body": "Quote from: KiaKia on July 03, 2023, 12:02:26 PMInteresting, now can anyone clarify if this is safe to use on the human body? Is this healthy? Also do you think it makes sense to decide to use your Asic miner to heat up your bathing water when you can follow the normal everyday routine? Does this makes sense for human use or this person is just telling us that it's possible? Even if it's possible I don't want to use it, because there is really no reason to....Am I lacking some understanding? Fill me up with what I am missing, but no I don't see why this is necessary.It can be unsafe to have an ASIC running at your home 24/7, because some component might overheat, short-circuit and start a fire while you are sleeping or away from home. Quote from: tbct_mt2 on July 03, 2023, 11:40:54 AMThis idea is not new in 3Rs principle and in Bitcoin mining, it is not new too. In 2018 we had that one This Guy Heated Bath Water With Bitcoin Mining and It Worked Too Well.The problem with this setup is that a miner constantly produces heat whether you need it or not, and it's hard to balance it, because heat consumption is not continuous and not well-predictable.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dansus021",
      "created_time": "July 04, 2023, 12:57:48 AM",
      "body": "Quote from: franky1 on July 03, 2023, 10:29:27 PMradiation??? (facepalm)asics do not produce radiation. its jsut the amount of electric flowing through metal circuits so fast it heats the metal.. the same as a coffee kettle or any electric heater operates.. Yeah    I just thought it will be harm to our body like I heard on the internet that home microwave is actually emit radiation to cook our food but after I quick search \"Microwaves are non-ionizing radiation, so they do not have the same risks as x-rays or other types of ionizing radiation.\" - https://www.fda.gov/radiation-emitting-products/resources-you-radiation-emitting-products/microwave-ovensSo probably it will be going safe to use but will take a long time to heat the cold water",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coolcoinz",
      "created_time": "July 04, 2023, 03:34:10 PM",
      "body": "Quote from: hatshepsut93 on July 03, 2023, 11:11:33 PMIt can be unsafe to have an ASIC running at your home 24/7, because some component might overheat, short-circuit and start a fire while you are sleeping or away from home.  Are you for real? I'm asking because this reads like a joke. Your TV, fridge, AC unit, computer can also overheat and short. What about wood or gas furnaces that most of us have? What about solar panels?That's why you follow safety rules. For instance, you can put miners in a dedicated room, where there's no furniture around them and nothing to catch fire. You also makes sure there's a smoke detector in that room and that you have a fire extinguisher in the house. The miners mentioned by OP are submerged, so there's low risk of fire, unless you somehow reach the temperatures where mineral oil or whatever fluid they have in there ignites, but that's well above boiling temperature so a mining unit would need to keep heating up the coolant in the tank until the whole thing starts boiling and then beyond that, to the level of ignition, so something above 150C. They'd get alarms all over the place well before that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hatshepsut93",
      "created_time": "July 04, 2023, 03:54:31 PM",
      "body": "Quote from: coolcoinz on July 04, 2023, 03:34:10 PMAre you for real? I'm asking because this reads like a joke. Your TV, fridge, AC unit, computer can also overheat and short. What about wood or gas furnaces that most of us have? What about solar panels?That's why you follow safety rules. For instance, you can put miners in a dedicated room, where there's no furniture around them and nothing to catch fire. You also makes sure there's a smoke detector in that room and that you have a fire extinguisher in the house. Bitcoin miners draw a lot more power than typical home appliances. And they do it 24/7. And the generate a lot of heat. These factors combined create a lot more fire hazards.Quote from: coolcoinz on July 04, 2023, 03:34:10 PMThat's why you follow safety rules. For instance, you can put miners in a dedicated room, where there's no furniture around them and nothing to catch fire. You also makes sure there's a smoke detector in that room and that you have a fire extinguisher in the house. Of course taking precautions will reduce the risks, but in real world not all people think ahead. If everyone was doing it, there would be no house fires. And about house fires, they tend to increase in winter when people start using electric heaters. Mass use of ASICS as electric heaters could have the same effect.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kryptqnick",
      "created_time": "July 04, 2023, 03:57:37 PM",
      "body": "This sounds like a great idea, actually. This means they use less energy than they normally would, and energy efficiency is a step toward a more eco-friendly future. Now, the carbon emmissions don't come from Bitcoin mining but just from using the electricity, if its source is bad for the environment. Companies often don't have a choice about their energy source because it's just something that depends on a country, city, and district. They should not be blamed for that, and, in any case, they are trying to make up for mining by using the residual heat for a good practical purpose. I don't know if it's safe for humans, but I don't see why not (unless we're talking about a fire hazard).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}