{
  "id": "topic_5439365",
  "title": "letteredhub",
  "author": "letteredhub",
  "created_time": "February 10, 2023, 04:32:27 PM",
  "content": "For like two days now I have been searching on YouTube watching videos about trading for beginners but it's like the ones I have come across are not giving me the basics of what I need to start up with as a pure beginner. Am still confused despite the countless number of videos on YouTube that pops up on each search. So I thought it wise to come to the forum to seek for materials or links that could really be helpful basically for starters on crypto trading. Your assistance will particularly go a long way for me.PS: I intend on locking up the post immediately I feel I have gotten sufficient helpful materials. Thanks in anticipation.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5439365",
  "comments": [
    {
      "author": "jackg",
      "created_time": "February 10, 2023, 08:46:53 PM",
      "body": "What are you looking for or at?I can't find the link I used to use to get a lot of information but the most important place you should start from is looking at support and resistance and then trading it on SPOT (or paper trading via sites like telegram or even making a spreadsheet for it).Technical and fundamental analysis often does just OK (fundamental does well if less people are looking at the news you've found or price hasn't already reacted). Videos might be a bad place to look too compared with other resources available online (like lecture slides or worksheets).Trading take a long time.to learn and a lot of dedication, don't expect to be good at it and don't gamble with more than you can afford to lose..",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "wajik-tempe",
      "created_time": "February 11, 2023, 07:04:45 AM",
      "body": "Quote from: letteredhub on February 10, 2023, 04:32:27 PMFor like two days now I have been searching on YouTube watching videos about trading for beginners but it's like the ones I have come across are not giving me the basics of what I need to start up with as a pure beginner. Am still confused despite the countless number of videos on YouTube that pops up on each search. So I thought it wise to come to the forum to seek for materials or links that could really be helpful basically for starters on crypto trading. Your assistance will particularly go a long way for me.PS: I intend on locking up the post immediately I feel I have gotten sufficient helpful materials. Thanks in anticipation. Youtube videos are more like sharing their experience about their trades and sometimes they ran a hidden campaign promoting a coin, if you are really wanna learn from the pure basic it's better to read some books or e-books that available free online.Also don't forget to join crypto trading communities, some popular forums include Reddit's r/CryptoCurrency also helpful if you dive down to it.After you know the basic, just start a demo account to trade at real market, experience will be your source of knowledge at the end.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GreatArkansas",
      "created_time": "February 11, 2023, 10:40:13 AM",
      "body": "For OP, if you are on Youtube, you need to find a good youtube channel that will help you focus on trading.Avoid channels that shill some random altcoins, do find teaching lessons channels.Here are the Youtube channels I can suggest to you:TechnicalRoundup CryptoCredThese channels are somehow connected but there lessons are different, most are on technical analysis, and it is very newbie friendly, there are a lot of videos for different topics on trading and sometimes they are doing live videos on the channel and or you can replay their live video later on.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rhomelmabini",
      "created_time": "February 11, 2023, 12:50:51 PM",
      "body": "You really need it to be video to learn? I think Binance Academy offers th best trading materials especially for beginners. I think they have short videos for that and more on articles that explains trading, you should really check them out. Just an opinion, if you learn the basics then I recommend to get your hands dirty by doing trading itself or maximize demo trading on some exchanges.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EarnOnVictor",
      "created_time": "February 11, 2023, 03:28:43 PM",
      "body": "Let me start with your \"PS,\" You simply don't need to lock the thread, I see no good purpose for doing that since another person could be lucky to benefit from the same information if useful.And as for your request, you have a lot of work to do. I will advise you to start by reading about trading articles and resources online, don't just jump, it affects people a lot. It's when you have educated yourself theoretically that you move to the videos which I don't think are different from what you get from theories.You should try babypips.com, investing.com and investopedia.com. Please, note that FX materials might be much there, but still, they serve the same purpose.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "crwth",
      "created_time": "February 11, 2023, 06:22:35 PM",
      "body": "Since we are here in a trading discussion, for sure there are tools in trading that could help you elevate your trading skills. In this case, I would like to share with you, Gunbot. Gunbot - The Automatic Trading BotIt's a good tool that could help you understand and be more consistent with trading. Check it out.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "teosanru",
      "created_time": "February 11, 2023, 06:40:35 PM",
      "body": "Quote from: letteredhub on February 10, 2023, 04:32:27 PMFor like two days now I have been searching on YouTube watching videos about trading for beginners but it's like the ones I have come across are not giving me the basics of what I need to start up with as a pure beginner. Am still confused despite the countless number of videos on YouTube that pops up on each search. So I thought it wise to come to the forum to seek for materials or links that could really be helpful basically for starters on crypto trading. Your assistance will particularly go a long way for me.PS: I intend on locking up the post immediately I feel I have gotten sufficient helpful materials. Thanks in anticipation. My assumption is you want to start with trading especially short term trading into crypto spots or futures. For this you have to learn Technical Analysis Also you want to learn very basics of trading like indicators, trading strategies & basic Psychology. I would suggest you a channel for this @RaynerTeo on YouTube he gives all basic lessons around candlesticks, indicators etc. Even on trading psychology as well so would be a great help.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bittraffic",
      "created_time": "February 11, 2023, 06:46:21 PM",
      "body": "Try this binance academy from youtube https://www.youtube.com/@BinanceAcademy/videosThis should give you an idea as t hey put some guide on how to do it. They even explain how indicators work and how its used to anticipate where the price goes. And then there's how to execute trading from spot to futures trading so all in all its right there. But basically you can find most tutorials in youtube.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LUCKMCFLY",
      "created_time": "February 11, 2023, 07:10:01 PM",
      "body": "Well, one of the things that should always be taken into consideration is that books are the best teachers in trading, there are many videos that can show the teaching of trading in a very simple way, it is said that people learn more by watching, but I am one of those who believe that it is much better to read, when it comes to teaching one should put laziness aside, I consider myself a pretty lazy person, but when it comes to learning something that involves money, my laziness no longer it exists, because it is something that I will always be willing to know so as not to make a mistake, every mistake in trading equals a loss of money, so that is why I insist that books are the best way to teach.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "adaseb",
      "created_time": "February 12, 2023, 05:05:22 AM",
      "body": "These videos can help you get a good understanding how trading works. Such as what does it mean to short or what is the importance of a moving average. However keep in mind that you won’t be able to make any actual profit from those videos alone.You will need to do the hard part yourself. Keep in mind if it was easy just by looking at a moving average cross then everybody would be doing it but it’s a zero sum game. For you to make money someone else has to lose it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oshosondy",
      "created_time": "February 12, 2023, 07:15:09 AM",
      "body": "Most trading sites are providing excellent videos about the basics of trading, like how to trading in the spot market, how to trade margin and future trading, including video tutorial for option trading and the likes. Also the exchanges are having trading guide which are sufficient to know how to do trade. Only what you need external articles and video for which you can all check on YouTube if it is video should be about indicators and other ways you can analyse the market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "noorman0",
      "created_time": "February 12, 2023, 10:34:43 AM",
      "body": "If you mean videos about the interface and how to use the trading platforms (especially their trading tools), you can find them on their respective guide pages. Each trading platform has different stuff.Or if it's related to the types of trading technical analysis, actually there are many and you don't have to use them all at once. Here you can find some people with their mainstay type of analysis. I will not provide any links as far as I don't know your native language, it is advisable to choose a tutorial in a language that you can easily understand.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husires",
      "created_time": "February 12, 2023, 03:46:33 PM",
      "body": "Trading is not something that you learned in cryptocurrency channels, so I advise you to read economics, technical analysis indicators, and then watch YouTube channels to learn how to use the tools available in your account.In short, any course that talks about Tradingview and is not related to cryptocurrency would be ideal for a start.After learning the basics, make your own way, as the rest depends on your ability to control yourself, and some of these programs may be useful to you https://bitsgap.com/demo-trading",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mr.right85",
      "created_time": "February 12, 2023, 04:45:29 PM",
      "body": "Quote from: Husires on February 12, 2023, 03:46:33 PMTrading is not something that you learned in cryptocurrency channels, so I advise you to read economics, technical analysis indicators, and then watch YouTube channels to learn how to use the tools available in your account.Sorry but, I don't really get you.How do you mean trading isn't something you learn on Channels?Technically, learning how to analyse the market, how to use various indicators and what candle sticks to watch out for before taking a buy or a sell is you as well learning how to trade.Of course, you've got to practice it more on your own as, most of what is presented there are from history, history that might not repeat and even if it does, not in the same way.There are a lot of channels out there and in contracts to just following up on a channel, you could pick out aspects to trading that you hope to study and focus on that and on to the next when you've got a hand on it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "RealMalatesta",
      "created_time": "February 12, 2023, 09:06:52 PM",
      "body": "Quote from: Mr.right85 on February 12, 2023, 04:45:29 PMQuote from: Husires on February 12, 2023, 03:46:33 PMTrading is not something that you learned in cryptocurrency channels, so I advise you to read economics, technical analysis indicators, and then watch YouTube channels to learn how to use the tools available in your account.Sorry but, I don't really get you.How do you mean trading isn't something you learn on Channels?Technically, learning how to analyse the market, how to use various indicators and what candle sticks to watch out for before taking a buy or a sell is you as well learning how to trade.Of course, you've got to practice it more on your own as, most of what is presented there are from history, history that might not repeat and even if it does, not in the same way.There are a lot of channels out there and in contracts to just following up on a channel, you could pick out aspects to trading that you hope to study and focus on that and on to the next when you've got a hand on it.It depends on the channel he mean. It if its on telegram channels then yeah because I never seen one that they can offer a trading course there but telegram channels are mostly created to give announcements. If it's about youtube channels then it is possible. We all know youtube. Almost everything nowadays can be found there.We only need to find a youtube channel which is reliable and honest when it comes to trading tutorials as some of them are fake and only in for the views to be able to make money. Usually what is being taught to the beginners are the terms and if on how to initiate them. When it comes to strategies, then indeed it should personally come from us because the market is changing from time to time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sheenshane",
      "created_time": "February 12, 2023, 11:36:11 PM",
      "body": "Here's my bucket list that you can also check on your own.BitBoy CryptoAltcoin DailyCoin Bureau But my advice is don't rely upon them, seek any other references that you learn technical and fundamental analysis as well. Be careful too for those youtube channels that obviously promote their own coins to pump up.  There are too many of them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husires",
      "created_time": "February 13, 2023, 08:12:19 AM",
      "body": "Quote from: Mr.right85 on February 12, 2023, 04:45:29 PMSorry but, I don't really get you.How do you mean trading isn't something you learn on Channels?YouTube channels do not teach you, they are closer to self-motivation videos, a group of people telling you that trading is easy and that you can make a quick profit from trading, draw some charts and you will get rich quickly soon, while trading is the last thing you will think about as a beginner. If you do not have technical knowledge, you will not predict the future of currencies, no matter how professional you are in trading.YouTube channels are the last place to learn cryptocurrency trading",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "albon",
      "created_time": "February 13, 2023, 08:06:30 PM",
      "body": "Quote from: letteredhub on February 10, 2023, 04:32:27 PMFor like two days now I have been searching on YouTube watching videos about trading for beginners but it's like the ones I have come across are not giving me the basics of what I need to start up with as a pure beginner. Am still confused despite the countless number of videos on YouTube that pops up on each search. So I thought it wise to come to the forum to seek for materials or links that could really be helpful basically for starters on crypto trading. Your assistance will particularly go a long way for me.PS: I intend on locking up the post immediately I feel I have gotten sufficient helpful materials. Thanks in anticipation. Yes, there are a lot of trading teaching videos on YouTube that they say are for beginners, but they are for other intermediate and advanced levels, so if you are a beginner and the teaching video is more advanced, you may get distracted, so I advise you on channels to teach trading in your native language by people who have experience and reputation in this field, books, courses, etc., there are a lot of teaching resources, only you need to spend some time in conducting your research in order to choose the material that suits your understanding, your comprehension, and your level, and I advise you to learn by doing, you can find good trading platforms that you can create demo accounts on them so that you can trade and practice in a risk-free arena and learn the patterns, strategies, and tools that suit you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kamvreto",
      "created_time": "February 13, 2023, 10:41:43 PM",
      "body": "YouTube gives you the freedom to choose what videos you want to watch. The choice of the right video certainly depends on yourself. If you are still new and don't understand the basics of trading, then look for videos that teach tutorials on basic trading and some understanding for beginners. If you are still confused, then you need to focus on continuing to learn and try to understand what is being taught in the video. The bitcointalk forum is just a place for you to ask questions and get the information you need. There is a lot of material to learn for beginners as well as many useful video tutorials.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}