{
  "id": "topic_5452235",
  "title": "collinscoinz",
  "author": "collinscoinz",
  "created_time": "May 10, 2023, 11:56:13 AM",
  "content": "Honestly am new here and with my little time that i have spent in this forum i have observed,and i wanna ask the forum mate if that is posible because i saw it happening amonge the forum mate and the person that invade this platform for me,people in this forum who are connected in one way or the other are trading on their sendable merit not only the their sndable merit but orher way of trading on merit is going on in this forum,so my question is,is it good and permitted to do such on the forum,",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5452235",
  "comments": [
    {
      "author": "_act_",
      "created_time": "May 10, 2023, 11:58:00 AM",
      "body": "Buying merit should be discouraged because selling of Bitcointalk account is discouraged Quote from: mprep on July 21, 2014, 05:27:51 PM18. Having multiple accounts and account sales are allowed, but account sales are discouraged.Read, learn more and understand how this forum is. Getting merit is not that hard but requires patientce, learning and understanding.Nobody cares about who you send your smerits, but you must send the smerits to only quality posts. If you have alts, do not also smerit to your alts, people to not like that on this forum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "examplens",
      "created_time": "May 10, 2023, 12:04:35 PM",
      "body": "Quote from: collinscoinz on May 10, 2023, 11:56:13 AMHonestly am new here and with my little time that i have spent in this forum i have observed,and i wanna ask the forum mate if that is posible because i saw it happening amonge the forum mate and the person that invade this platform for me,people in this forum who are connected in one way or the other are trading on their sendable merit not only the their sndable merit but orher way of trading on merit is going on in this forum,so my question is,is it good and permitted to do such on the forum,You expressed your doubts a little confused, but we will try to understand what you want to ask.No, it is not allowed to buy/sell merit, although there are no significant sanctions for that except a negative tag account. This is about certain rewards for contributing to this forum, not for making money or showing that you have money to pay for merit.The purpose of the metric is to highlight useful members from those who are only here to make money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SquirrelJulietGarden",
      "created_time": "May 10, 2023, 12:24:25 PM",
      "body": "It is not managed by forum but it is discouraged by community.If you make good contribution here, you will receive merit and you should not find merit from black markets.Quote from: theymos in 2018The current status quo seems OK. If you have to pay $20 per merit plus a risk of getting red trust, then that's a situation that doesn't concern me at all. I'm not going to lose sleep over people going to ridiculous lengths to buy merit, since only a small number of people will be willing and able to do that.As long as merit sales are a black market, I'm happy, since that makes it far more difficult and expensive to buy merit. If that's the case, then the small volume of black-market merit trades don't themselves bother me much, and I think that it does more harm than good to get too witch-hunty about it.Contribute and become future of forum like those members and you can become one of forum discoveries too.The future of Bitcointalk: Low Ranking Top Merit earners in the past 30 days",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Solosanz",
      "created_time": "May 10, 2023, 12:55:17 PM",
      "body": "Do you want to buy a merit too? what's your intention? if you only want to post an image, you can buy a copper membership, don't need to buy a merit.Quote from: collinscoinz on May 10, 2023, 11:56:13 AMbecause i saw it happening amonge the forum mate and the person that invade this platform for me,people in this forum who are connected in one way or the other are trading on their sendable merit not only the their sndable merit but orher way of trading on merit is going on in this forumWho's the user? can you provide an evidence if he's trading merit with another user? this would be interesting If you don't want to let know the user, you will get a red trust /jk",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husires",
      "created_time": "May 10, 2023, 01:07:43 PM",
      "body": "Let's say you buy merits, you need a lot of it to rank-up, signature campaigns are looking for a minimum effort in the quality of posts to get paid, if you don't make that effort, buying merit points won't change anything.It is a scam because other users get tired of creating high-quality posts while you get for merits for free are therefore merit is not a commodity to be bought or sold.You will not be banned for buying/selling merits but may get negative trust and many will ignore your posts.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cantsay",
      "created_time": "May 10, 2023, 01:08:37 PM",
      "body": "Quote from: collinscoinz on May 10, 2023, 11:56:13 AMHonestly am new here and with my little time that i have spent in this forum i have observed,and i wanna ask the forum mate if that is posible because i saw it happening amonge the forum mate and the person that invade this platform for me,people in this forum who are connected in one way or the other are trading on their sendable merit not only the their sndable merit but orher way of trading on merit is going on in this forum,so my question is,is it good and permitted to do such on the forum,Buying merit is strongly discouraged by forum members, and if you are caught doing so, your account will be negatively tagged. I'm not sure why you'd want to risk wasting your money by purchasing merits; the merit system was implemented to prevent spam and allow only those who make constructive posts and contributions to grow in the forum. All you need to do at this point is devote some of your time to learning; simply look for good material about Bitcoin and crypto in general and read it before you know you'll be making constructive posts.If you want to rank simply because of the limitations of a newbie account, you should consider purchasing a Copper membership; otherwise, try to develop yourself instead of looking for shortcuts.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitMaxz",
      "created_time": "May 10, 2023, 01:24:42 PM",
      "body": "Not good to buy merit because if you receive merit from users with a bad reputation you might also get red-tagged by DTs so it would be better to earn them organically. It's not hard to earn them just contribute to the forum and make sure you are helping and soon some of your posts will be merited if they found your post useful and helpful. If you don't know how to start there are some guides here already posted on the forum check this old thread below it is still useful to learn how to earn merit.- https://bitcointalk.org/index.php?topic=5189040.0",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "aioc",
      "created_time": "May 10, 2023, 01:31:23 PM",
      "body": "This is unethical and should be discouraged merit was not created to monetize and make a profit it is given to users who has good contribution it is a way of appreciating a user, even begging or asking for merit is not allowed merit flow should be natural, you can only move up or level up your rank based on merits you've accumulated, if you buy merits to rank up you don't deserve your rank and you only buy your way up, its disgracing.There's still so much for you to learn here I advise you to forget merit for now and learn about the rules and etiquette of this forum so you'll know how to act and communicate here.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hyphen(-)",
      "created_time": "May 10, 2023, 01:41:09 PM",
      "body": "Quote from: collinscoinz on May 10, 2023, 11:56:13 AMHonestly am new here and with my little time that i have spent in this forum i have observed,and i wanna ask the forum mate if that is posible because i saw it happening amonge the forum mate and the person that invade this platform for me,people in this forum who are connected in one way or the other are trading on their sendable merit not only the their sndable merit but orher way of trading on merit is going on in this forum,so my question is,is it good and permitted to do such on the forum,To be honest, as other members have stated, it is strongly discouraged because if you buy merits, your quality of posting will show because other forum members will discover that your account did not deserve the number of merits it has received. As a result, it is best to stick to quality posting, which will earn you merits, make the forum more interesting to you, and also qualify you for the signature campaign due to the quality of your posting.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Razmirraz",
      "created_time": "May 10, 2023, 01:41:21 PM",
      "body": "Before talking about Merit further, you need to understand how the Merit System functions and uses. Quote from: theymos on January 24, 2018, 11:00:11 PMI'm hoping that this system will increase post quality by: - Forcing people to post high-quality stuff in order to rank up. If you just post garbage, you will never get even 1 merit point, and you will therefore never be able to put links in your signature, etc. - Highlighting good posts with the \"Merited by\" line.The merit system is not moderated directly by the forum, but it is highly recommended to give Merit to high-quality posts, not posts that you like for any reason, including selling merit. Merit can be obtained for free for your efforts in spreading useful information packaged in high quality posts. If you can get merit for free why do you have to spend some money to buy it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "348Judah",
      "created_time": "May 10, 2023, 01:51:38 PM",
      "body": "Quote from: collinscoinz on May 10, 2023, 11:56:13 AMSnippedTrading merit is bot allowed on the forum and the forum kicked against it, i will assume that since you're a newbie you may not be well familiar to how the forum rules operate very well, we have merit sources on the forum that were assigned a particular number of smerits every months for them to give to posts they believed to be a quality post at their own discretion, you can also work hard in making good and quality post tgat could attract them or any member in giving you merit, there are also merit giveaway threads, merits rules and so on that everyone follows but you may be unaware of them, when you apply to a thread for merit to rank up and you're given should that be assumed for trading merits? Moreover there's a standard we follow that every member uses before giving or getting meirt and i will like you to see from below:Everything you need to know about forum rank, activities and merits.https://bitcointalk.org/index.php?topic=2766177.0compiled merit giveaways listhttps://bitcointalk.org/index.php?topic=5314054.0",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptopreneurBrainboss",
      "created_time": "May 10, 2023, 02:01:22 PM",
      "body": "Quote from: collinscoinz on May 10, 2023, 11:56:13 AMHonestly am new here and with my little time that i have spent in this forum i have observed,and i wanna ask the forum mate if that is posible because i saw it happening amonge the forum mate and the person that invade this platform for me,people in this forum who are connected in one way or the other are trading on their sendable merit not only the their sndable merit but orher way of trading on merit is going on in this forum,so my question is,is it good and permitted to do such on the forum,You can't say you saw that happening when there's no proof and don't go and implicate innocent users just to proof your point. If you see people meriting each other, first observe if the posts they are meriting are quality posts, if they're then there's nothing we can do about it. Meriting low quality posts is when we can build a case against the users. One or two members merit records might be looking like they're meriting themselves but there's nothing they can do since they both encounter each other and find their posts worth highlighting.Technically forum members can do to their spendable merits what they want since we can't tell anybody what to do with their merits or who to merits but can only encourage them to use it to highlight quality posts and when they do otherwise, if they're caught, they're to be blamed since the community is against doing such. Theymos only mandated the Merit source not to sell their merits and try to distribute all before the month ends therefore they're the only members who are to be held accountable for how they send their merits.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Z390",
      "created_time": "May 10, 2023, 02:04:40 PM",
      "body": "You only have 26 activity you are brand new OP you shouldn't be chasing after merits right now, if you are making good quality posts someone will merit you, there is a thread that is actively for writing quality posts that have not gotten merited yet, for now, focus on making noticeable contributions on the forum,  I won't hesitate to send you merit. Follow the comments and link that 348judah shares, it will be good if you can understand how the merit system works too, before looking fot merit giveaway threads they usually have a criteria so for a newbie I won't advice you look into that, spend time looking onto posts that are merited on the forum, there is a reason they get merit for making the post.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "elevates",
      "created_time": "May 10, 2023, 02:09:10 PM",
      "body": "Quote from: collinscoinz on May 10, 2023, 11:56:13 AMsnip..Why do you want to buy Merits when it is available for free? All you need to do is to be active, creative, informative & helpful. Active: Stay active and follow boards where you have expertise.Creative: Create topics that are engaging and solve issues. Issues can be as simple as creating a wallet.Informative: Post news that is about Bitcoin.Helpful: Reply to those topics in detail where you have complete knowledge. Follow the above and you will get merits. Buying merits can result in a permanent ban. In the same way, buying a high rank account will also result in a permanent ban.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nakamura12",
      "created_time": "May 10, 2023, 02:16:05 PM",
      "body": "Buying is not permitted in this forum and you will most likely get red tagged by a DT just like buying a forum account would also results in rhe same consequences. I am not sure why you ask if it is permitted but merit is free and you can earn it without paying a single cent to receive a merit. There are only things you can do which is be active in the forum and contribute then getting merits won't be a problem.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Taskford",
      "created_time": "May 10, 2023, 02:19:58 PM",
      "body": "Quote from: collinscoinz on May 10, 2023, 11:56:13 AMHonestly am new here and with my little time that i have spent in this forum i have observed,and i wanna ask the forum mate if that is posible because i saw it happening amonge the forum mate and the person that invade this platform for me,people in this forum who are connected in one way or the other are trading on their sendable merit not only the their sndable merit but orher way of trading on merit is going on in this forum,so my question is,is it good and permitted to do such on the forum,No not ideal action to do and this is been discourage by many forum users then once you get caught buying some merits to other users here both of you seller and buyer will get a red trust.If you think buying that because you want to join on a signature campaign well that's not really good since all your efforts and money will go to waste if you do that. Just rise up your merit organically since for sure you can learn a lot of things by frequently posting and researching here.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "acroman08",
      "created_time": "May 10, 2023, 03:04:29 PM",
      "body": "Quote from: collinscoinz on May 10, 2023, 11:56:13 AMpeople in this forum who are connected in one way or the other are trading on their sendable merit not only the their sndable merit but orher way of trading on merit is going on in this forumwould you mind providing any evidence supporting your claim? you are pretty much accusing members of this forum of merit abuse which is frowned upon by a lot of members. if you have evidence supporting your claim, it would be best to share it here.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Shamm",
      "created_time": "May 10, 2023, 03:10:46 PM",
      "body": "Quote from: Taskford on May 10, 2023, 02:19:58 PMQuote from: collinscoinz on May 10, 2023, 11:56:13 AMHonestly am new here and with my little time that i have spent in this forum i have observed,and i wanna ask the forum mate if that is posible because i saw it happening amonge the forum mate and the person that invade this platform for me,people in this forum who are connected in one way or the other are trading on their sendable merit not only the their sndable merit but orher way of trading on merit is going on in this forum,so my question is,is it good and permitted to do such on the forum,No not ideal action to do and this is been discourage by many forum users then once you get caught buying some merits to other users here both of you seller and buyer will get a red trust.If you think buying that because you want to join on a signature campaign well that's not really good since all your efforts and money will go to waste if you do that. Just rise up your merit organically since for sure you can learn a lot of things by frequently posting and researching here.Always remember that buying a merit is look like you are cheating on your exam or let's say that your lie on your self, even though buying merits is not permitted but if you do that then DT members here in forum will tag you a negative feed back and also those user who are selling Merits also got a Negative trust because it's abusing the merit system. We all know that Merit is a reward for those people who actually do a good job and contribute to this forum.  So no need to buy merits cause we will earn that through contributing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fiatless",
      "created_time": "May 10, 2023, 04:23:54 PM",
      "body": "Quote from: collinscoinz on May 10, 2023, 11:56:13 AMHonestly am new here and with my little time that i have spent in this forum i have observed,and i wanna ask the forum mate if that is posible because i saw it happening amonge the forum mate and the person that invade this platform for me,people in this forum who are connected in one way or the other are trading on their sendable merit not only the their sndable merit but orher way of trading on merit is going on in this forum,so my question is,is it good and permitted to do such on the forum,Merits are earned and not for sale. Maybe you are uncomfortable that you have written 26 posts and got no merit. This might be the motivation for this post. The truth is it takes commitment and hard work to create quality posts that will attract merit. You need to learn more about Bitcoin and the forum to help you improve your post and earn merit. A close look at your post history shows that politics and society, beginners and help, and gambling are the main sections you post. I will suggest you visit other sections and lean more about Bitcoin. 26 posts without merit is not a bad record because I have seen members with hundreds of posts without merit. Be encouraged mate.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}