{
  "id": "topic_5432657",
  "title": "franky1",
  "author": "franky1",
  "created_time": "January 01, 2023, 10:25:52 PM",
  "content": "the Bank of international settlement (BIS)have a guideline policy for how central banks can hoard crypto in the futurehttps://www.bis.org/bcbs/publ/d545.pdfthe short version for those that dont like to readcoins like BTC and ETH are set into a 'group 2b'where the BIS advised banks only have from 2025 a individual holding 2% of crypto assets vs all combined assets. which is about if combining all banks in BIS. about $3-4trillion in bitcoin/ethnow the lengthier explainerBIS originally set a limit of just 1% of the banks combined value, which the banks then got the BIS to change to 2%(banks want to hold crypto and more then the BIS first proposed was allowable)based on some sources. this means of the banks combined value of 180trillion(yep i was shocked too) the banks can hoard upto ~$3.7trillion of crypto such as ethereum/btcthere are other groups for second layer tokens and other groups for stable coins with their own limits and descriptorsbut the group 2b have descriptors where the \"market cap\" needs to be above 10billion. and market volume of over 50m a day. meaning that rules out alot of crap coins from being in the group 2b category (sorry doge. no go, no throw, no mo)",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5432657",
  "comments": [
    {
      "author": "Upgrade00",
      "created_time": "January 02, 2023, 03:56:36 AM",
      "body": "Would be interesting to know what the Bitcoin community thinks about this.For one, such purchases at such value would need a commensurate increase in the value of the asset to accommodate it, meaning the price of Bitcoin would have to grow to reach the demand, in another hand, it increases the amounts held by centralized agencies.Quote from: franky1 on January 01, 2023, 10:25:52 PMbut the group 2b have descriptors where the \"market cap\" needs to be above 10billion. and market volume of over 50m a day. meaning that rules out alot of crap coins from being in the group 2b category (sorry doge. no go, no throw, no mo)And it lets in a handful of crap coins. Plus doge at a market cap of $9.5 billion could very well be in that category before 2025.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "January 02, 2023, 07:08:15 AM",
      "body": "Quote from: Upgrade00 on January 02, 2023, 03:56:36 AMWould be interesting to know what the Bitcoin community thinks about this.For one, such purchases at such value would need a commensurate increase in the value of the asset to accommodate it, meaning the price of Bitcoin would have to grow to reach the demand, in another hand, it increases the amounts held by centralized agencies.Quote from: franky1 on January 01, 2023, 10:25:52 PMbut the group 2b have descriptors where the \"market cap\" needs to be above 10billion. and market volume of over 50m a day. meaning that rules out alot of crap coins from being in the group 2b category (sorry doge. no go, no throw, no mo)And it lets in a handful of crap coins. Plus doge at a market cap of $9.5 billion could very well be in that category before 2025.shh your not suppose to give the dog a bone, something to chase after. i prefer to leave it as a pet project that you smile at from a distance but fear even putting your hand near...but looking at the coinmarketcap. most of the other top listers are stable coins (group 1) where by it allows banks to invest healthily and heavily in mostly bitcoin, ethereum in 2Bthings like xrp and bnb are more of the 2A group not 2B (A centralised B decentralised)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fortify",
      "created_time": "January 02, 2023, 03:59:18 PM",
      "body": "Quote from: franky1 on January 01, 2023, 10:25:52 PMthe Bank of international settlement (BIS)have a guideline policy for how central banks can hoard crypto in the futurethe short version for those that dont like to readcoins like BTC and ETH are set into a 'group 2b'where the BIS advised banks only have from 2025 a individual holding 2% of crypto assets vs all combined assets. which is about if combining all banks in BIS. about $3-4trillion in bitcoin/ethnow the lengthier explainerBIS originally set a limit of just 1% of the banks combined value, which the banks then got the BIS to change to 2%(banks want to hold crypto and more then the BIS first proposed was allowable)based on some sources. this means of the banks combined value of 180trillion(yep i was shocked too) the banks can hoard upto ~$3.7trillion of crypto such as ethereum/btcthere are other groups for second layer tokens and other groups for stable coins with their own limits and descriptorsbut the group 2b have descriptors where the \"market cap\" needs to be above 10billion. and market volume of over 50m a day. meaning that rules out alot of crap coins from being in the group 2b category (sorry doge. no go, no throw, no mo)Banks aren't interested in buying crypto, they've already got many different assets and ways to make money. They also want to make money and look for a long history as part of their risk analysis, crypto has only been around 15 years which is barely anything and in that time it has gone sky high but then crashed back down to earth. The financial types that were interested in it have already made their money from this source and are unlikely to buy back into it - the advantages are simply not outweighed by the negatives. Traditional banking networks can already perform the transactions that crypto does much quicker and cheaper, so why bother with an inferior competitor?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "January 02, 2023, 04:29:08 PM",
      "body": "Quote from: Fortify on January 02, 2023, 03:59:18 PMBanks aren't interested in buying crypto, they've already got many different assets and ways to make money. They also want to make money and look for a long history as part of their risk analysis, crypto has only been around 15 years which is barely anything and in that time it has gone sky high but then crashed back down to earth. The financial types that were interested in it have already made their money from this source and are unlikely to buy back into it - the advantages are simply not outweighed by the negatives.I'm definitely not saying that banks are going to buy bitcoin/crypto, but it's not entirely impossible. There's a really small chance that they would buy bitcoin/crypto with a really really small amount just to hedge themselves.Quote from: Fortify on January 02, 2023, 03:59:18 PMTraditional banking networks can already perform the transactions that crypto does much quicker and cheaper, so why bother with an inferior competitor?Because not all cryptocurrencies(not even bitcoin itself) is trying to be the fastest and cheapest-to-transfer cryptocurrency.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "January 02, 2023, 06:26:25 PM",
      "body": "fortify sounds like a bitcoin hater trying to convince himself that banks are not interested in bitcoinits funny because the BIS initially set a 1% of reserves for crypto, and the banks said \"nope we want to invest in 5%\", which the BIS compromised with 2%as for explaining why banks want itunlike fortify that is trying to hate bitcoin about tx speedif he cared to read it they are describing things like bitcoin as crypto asset not crypto currency so its not to use bitcoin as a payment rail(method of transfer of value for customers) its for internal bank investmentas for the payment rail of transfer value for customers(wire transfers) they are developing CBDC, where they will have the 'm-bridge' for the IMF main reserve swaps of CBDC",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hydrogen",
      "created_time": "January 02, 2023, 06:29:26 PM",
      "body": "Quote from: franky1 on January 01, 2023, 10:25:52 PMBIS draws up framework to allow banks to hoard crypto in 2025based on some sources. this means of the banks combined value of 180trillion(yep i was shocked too) the banks can hoard upto ~$3.7trillion of crypto such as ethereum/btcBanks carrying trillions of dollars in derivatives exposure, was acknowledged after the 2008 crisis. It may have been a prominent factor which led to Satoshi being motivated to develop BTC.I think banks around the world have held and used bitcoin, and other crypto for cross border exchange for some years now. It being cheaper to move funds across national borders with crypto, in contrast to automated clearing houses (ACHs) used by banks. Make crypto naturally suited for this. There were news articles published claiming that banks in argentina used bitcoin for this purpose. It makes sense other banks would do the same, although it may not be as publicized.The BIS framework, might only be a formality at this point.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "January 02, 2023, 06:53:43 PM",
      "body": "commercial banks are their own business and i feel that yes they have dipped their toes into collecting coinbut central banks is a whole different ball gameits like the IMF saying no to el salvador in 2021 when el salvador wanted to accept bitcoin the IMF BIS were not interested in central bank trading with el salvador.. however the BIS/IMF stance is changingwith governments getting bitcoin friendly and wanting exposure to bitcoin. ofcourse they want their bank(central) to be investing part of a governments assets in crypto so the IMF/BIS has to adaptlike i said BIS only wanted to allow 1% of decentralised crypto(group 2b) banks wanted 5%. so the compromise of current proposal is so far 2%(it may update further by 2025)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "avikz",
      "created_time": "January 03, 2023, 05:48:15 AM",
      "body": "Wow! I will be terrified if it happens in reality! If banks are allowed to store crypto and if they show interest in doing that, all bitcoins will be out of sell quite quickly. Then banks will start playing with the market at their own will. As a retail investor, I will either become a millionaire or I will be royally f****d! Chances are high for both. It's not great when banks show interest into a certain asset class which has a capability of challenging the banking system. Since the bank couldn't conquer it, they will try to tame it! Only some whales will survive. Not ideal and not good!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kryptqnick",
      "created_time": "January 03, 2023, 11:32:54 AM",
      "body": "Given the current market capitalization, they are hoard much more than the total value of Bitcoin and pretty much all altcoins, right? So basically, they can engage with the crypto market as much as they desire in terms of how much to buy, but a $10 billion market cap actually limits the choice of coins to 7, 3 of which are stablecoins. Doge might make it when the market improves, and same for Cardano.Being allowed to invest is good, but doesn't mean that they actually will invest. We'll see if this has any impact in the future. I suspect that banks will largely stay away from the market anyway.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "January 03, 2023, 12:19:28 PM",
      "body": "Quote from: kryptqnick on January 03, 2023, 11:32:54 AMGiven the current market capitalization, they are hoard much more than the total value of Bitcoin and pretty much all altcoins, right? So basically, they can engage with the crypto market as much as they desire in terms of how much to buy, but a $10 billion market cap actually limits the choice of coins to 7, 3 of which are stablecoins. Doge might make it when the market improves, and same for Cardano.Being allowed to invest is good, but doesn't mean that they actually will invest. We'll see if this has any impact in the future. I suspect that banks will largely stay away from the market anyway.againcommercial banks are different category to central banks. commercial banks can do as they please.. its their business, the report to SEC/fca/finra and are family of banks becasue regulators are ex bankers most of the time  .. so can easily make rules fit.. so commercial banks can and do invest alreadycentral banks are a different category they have higher restrictions/standardsits actually the central banks that WANT TO INVEST. its why they are negotiating with the BISthe BIS initially said 'ok 1% limit\" .. the central banks responded with \"no, 5% please\" and BIS responded \"ok compromise 2%\"so it looks like the banks want to invest upto 2% of bank collateral/reserves in crypto. but the BIS are the ones limiting themmuch like the IMF wanted to limit el salvador",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "el kaka22",
      "created_time": "January 03, 2023, 09:23:54 PM",
      "body": "It is really not a shocker that Banks would want something like this. It is such a huge asset group right now in the world that retail investors are growing their accumulation and banks can't afford to let everyone do this. They need to make sure that others can do it as well so it would work very well. I am not really entirely sure if it is going to be right away, but we are going to see banks slowly get more and more of it for sure.Their entire existence depends on controlling assets, and money which means if they do not and we end up with most of the crypto then how could they control it. I am pretty sure their 2% would be equal to a lot of crypto.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}