{
  "id": "topic_5403761",
  "title": "Wind_FURY",
  "author": "Wind_FURY",
  "created_time": "June 23, 2022, 10:48:53 AM",
  "content": "If you were given a choice, would you play regularly in a cryptocurrency casino WITH KYC, and with added benefits like first deposit/welcome bonuses and cashbacks?Or would you like to play regularly in a casino, WITHOUT KYC, BUT also without the welcome bonuses, cashbacks and other extra rewards?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5403761",
  "comments": [
    {
      "author": "Gianluca95",
      "created_time": "June 23, 2022, 10:53:44 AM",
      "body": "Quote from: Wind_FURY on June 23, 2022, 10:48:53 AMIf you were given a choice, would you play regularly in a cryptocurrency casino WITH KYC, and with added benefits like first deposit/welcome bonuses and cashbacks?Or would you like to play regularly in a casino, WITHOUT KYC, BUT also without the welcome bonuses, cashbacks and other extra rewards?I always prefer to play on KYC Casino, because it has a license, and this mean that there is an higher safety for the users. That casino that doesn't use KYC seems to be place where to put bet only with dirty money. So,Better to play in casino with KYC and have a sort of safety, and avoid casino that doesn't offer KYC because you won't be never protected. About bonus, I prefer it always, I usually look only on that site which offer high bonus",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Beparanf",
      "created_time": "June 23, 2022, 10:57:10 AM",
      "body": "Quote from: Wind_FURY on June 23, 2022, 10:48:53 AMIf you were given a choice, would you play regularly in a cryptocurrency casino WITH KYC, and with added benefits like first deposit/welcome bonuses and cashbacks?Or would you like to play regularly in a casino, WITHOUT KYC, BUT also without the welcome bonuses, cashbacks and other extra rewards?This is a dilemma for me, Actually most of the casino didn't require KYC and offers bonus at the same time but for the sake of discussion given the circumstances that you provided. I will go for the no-KYC casino since I’m not gambling for the bonus so I can skip that part in exchange for KYC just to gamble. Even before, there is no bonus such as cashback and welcome bonus on casino like PD and Bitsler yet thre still a lot of players playing on it because they can freely play without KYC.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "peter0425",
      "created_time": "June 23, 2022, 11:05:46 AM",
      "body": "Quote from: Wind_FURY on June 23, 2022, 10:48:53 AMIf you were given a choice, would you play regularly in a cryptocurrency casino WITH KYC, and with added benefits like first deposit/welcome bonuses and cashbacks?In past I may hate KYC because i am more concern about the privacy , but eventually as I go along the time ? then I realized that there is no safest way to gamble but to play in KYC requiring site specially if they are here serving gambler for long years now so i may choose this KYC thing .QuoteOr would you like to play regularly in a casino, WITHOUT KYC, BUT also without the welcome bonuses, cashbacks and other extra rewards?No and will never .",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oshosondy",
      "created_time": "June 23, 2022, 11:18:55 AM",
      "body": "I have some privacy life and some non privacy life, what I have noticed about gambling sites is that they will still later request their customers to do KYC, that is normal, even the ones that are not yet common may not have stringent KYC policies, but as they are getting more known, they are also getting known to the government and they have to comply with AML and CTF rules who makes them not to have any other option than to request for KYC from their customers.I do not have much funds on gambling sites, just like $100, this makes me prefer no KYC gambling sites, but do not let us deceive ourselves, all the gambling sites will still request for KYC later which makye it impossible to play further on no KYC casino sites, but I will prefer no KYC.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Chato1977",
      "created_time": "June 23, 2022, 11:26:56 AM",
      "body": "absolutely no KYC in my part , I am small roller so there is no need for for KYC",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bttzed03",
      "created_time": "June 23, 2022, 11:41:51 AM",
      "body": "Reminds me of the CEX ads I often see on social media. They offer some money (spare change) if you sign up with them and complete KYC verification Now to the questions, I'm having a hard time because I know there are many casinos that are still offering those incentives and features without forcing KYC upon their users. You just need to reach a certain rank, a number of wager, or other requirements and that's about it. Anyway, I'll probably stick to non-KYC casino if those are the only options gamblers have.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "edgycorner",
      "created_time": "June 23, 2022, 12:00:31 PM",
      "body": "Without KYC for sure. I miss the directbet days. When you didn't even have to register to place a bet. No sane website will bring that option now. They closed down for a reason(matchfixing in some major league), and this is why KYC has become a must for big books to prevent any abuse. But if you aren't a whale, then you can still enjoy the promos without submitting any personal documents(like stake, cloudbet). This is what I do.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mindrust",
      "created_time": "June 23, 2022, 12:11:51 PM",
      "body": "Quote from: Wind_FURY on June 23, 2022, 10:48:53 AMIf you were given a choice, would you play regularly in a cryptocurrency casino WITH KYC, and with added benefits like first deposit/welcome bonuses and cashbacks?Or would you like to play regularly in a casino, WITHOUT KYC, BUT also without the welcome bonuses, cashbacks and other extra rewards?NO-KYC over anything tbh.I don't care about the promotions if I can't withdraw them just because they think I am a suspicious person and needs to be examined. Fuck KYC.I'd rather play on a non-KYC & zero promotions casino than playing on a pro-KYC & 100% promotions casino. You may have a good lucky run on a pro-KYC casino but sooner or later they'll want to know who you are and that's when the trouble will begin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "michellee",
      "created_time": "June 23, 2022, 12:34:56 PM",
      "body": "Of course, I would opt for no KYC because I don't have to send any documents to the casino and can protect my privacy. First deposit/welcome bonuses, cashback and other extra gifts are good for us but I guess in crypto casinos, they also give those bonuses so we needn't worry. We can look for crypto casinos that can provide those bonuses and choose which is comfortable for us to play gambling.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "panjul07",
      "created_time": "June 23, 2022, 12:37:52 PM",
      "body": "Choosing which casino between KYC and No-KYC just because of extra bonuses is stupid IMO. For me, privacy is more important than the bonuses you are talking about so I'll go with casino without KYC in this case. I'm not against KYC although I was, I can accept KYC in gambling but I will not do it in non reputable casinos. As I'm not a big gambler, sending my personal document is not worth the risk.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dimonstration",
      "created_time": "June 23, 2022, 12:45:10 PM",
      "body": "There are a lot of incidents from casino that leaking there users details including emails and personal info. I’m really not comfortable to send my personal documents that related to gambling because it might backfire to me once it was leaked online since online gambling is not allowed in my country.My personal documents is more valuable to bonuses in the casino so I will go for the no KYC option this time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Strongkored",
      "created_time": "June 23, 2022, 12:47:57 PM",
      "body": "Two choices that are quite difficult, KYC is not a fun thing but bonuses and other prizes are something that players look forward to. I would choose no KYC without a bonus but so far because the casino competition is quite tight, almost all casinos provide bonuses or promos to make their players stay with them and until now I have also been able to find or play on one of the gambling websites that never asked for KYC but still providing a promo that is quite interesting in my opinion.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FatFork",
      "created_time": "June 23, 2022, 12:48:04 PM",
      "body": "Quote from: Wind_FURY on June 23, 2022, 10:48:53 AMIf you were given a choice, would you play regularly in a cryptocurrency casino WITH KYC, and with added benefits like first deposit/welcome bonuses and cashbacks?Or would you like to play regularly in a casino, WITHOUT KYC, BUT also without the welcome bonuses, cashbacks and other extra rewards?In that case, would you prefer no-KYC casino, if that is the only difference. My right to privacy and the protection of my personal information are more important to me than bonuses and promotions. Additionally, I don't believe KYC increases the safety of my funds, as some are proclaiming. There are scam casinos and there are legitimate casinos, and KYC has nothing to do with it. In fact, scam casinos will probably sell your KYC info to third parties.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitcoinPanther",
      "created_time": "June 23, 2022, 12:59:37 PM",
      "body": "I don't mind playing in a casino without promo or cash back, as long as I do not reveal my private details.  Honestly, I seldom use promos since it requires certain numbers of wagering for a requirement to cash the winnings out.  I often look at these wagering requirements as a hassle.  I always intend to play in a deposit wager and withdraw when winning pattern and the wagering requirement often hinders this system.  So yeah I don't mind about the bonuses as long as they let me keep my privacy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "faitan86",
      "created_time": "June 23, 2022, 01:38:32 PM",
      "body": "Quote from: Wind_FURY on June 23, 2022, 10:48:53 AMIf you were given a choice, would you play regularly in a cryptocurrency casino WITH KYC, and with added benefits like first deposit/welcome bonuses and cashbacks?Or would you like to play regularly in a casino, WITHOUT KYC, BUT also without the welcome bonuses, cashbacks and other extra rewards?i will play on casino with bonus , just provide kyc , some casino just need a id , no need to verify with face . if you get what i mean , just id ,and the username u register just put in the same name",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "qwertyup23",
      "created_time": "June 23, 2022, 01:38:42 PM",
      "body": "Quote from: Wind_FURY on June 23, 2022, 10:48:53 AMIf you were given a choice, would you play regularly in a cryptocurrency casino WITH KYC, and with added benefits like first deposit/welcome bonuses and cashbacks?Or would you like to play regularly in a casino, WITHOUT KYC, BUT also without the welcome bonuses, cashbacks and other extra rewards?I think this question varies on the type of gambler, either an active or a casual gambler; and the amount that they wager regularly.Personally, I would prefer to choose a casino that requires KYC though offers several signup bonuses, etc. As someone who does not regularly gamble and only gambles only a relatively small amount, I doubt that there would be any harm nor conflict whenever I cash out my earnings even with all the KYC deposits.If you are someone who gambles large amounts of BTCs in a single bet, it is much preferred to choose a casino that does not require you to present KYC documents for your safety.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "YOSHIE",
      "created_time": "June 23, 2022, 01:57:01 PM",
      "body": "I rarely play and bet on online gambling sites that implement the KYC system, most online gambling sites that I play do not require KYC, although some people think the kyc system is good, for me sharing my personal identity is not a good idea.Of course, I prefer this one.Quote from: Wind_FURY on June 23, 2022, 10:48:53 AMOr would you like to play regularly in a casino, WITHOUT KYC, BUT also without the welcome bonuses, cashbacks and other extra rewards?Of course I have a reason for that, it's simple, with today's sophisticated technology and the rampant issue of fraud and data sales, for that reason I don't trust the kyc system to be safe for my identity, not a little personal data is stolen and distributed by certain parties or sites, the proof is from gmail or incoming messages from unknown.For that, I really enjoy betting on online gambling sites that don't have KYC with deposits, cashback, competence and so on.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jemzx00",
      "created_time": "June 23, 2022, 02:07:25 PM",
      "body": "It's best not to KYC, especially when gambling since we're dealing with our money, especially for crypto online gambling which has the main purpose to restrict people from knowing our identity. So, I choose to gamble on a website that will not require users to do KYC. Also, if these online casinos will try to do something like this that will give priority to KYC users than non-KYC users, then it will impact them greatly as whales and high rollers prepare to keep their identity to themselves. Probably this kind of question will better fit online casinos that don't involve cryptocurrency and have an offline location so that users will be able to contact and go to their location in case a problem arises.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wiwo",
      "created_time": "June 23, 2022, 02:10:07 PM",
      "body": "I will rather go for non-KYC and no bonuses, instead of optioning in for KYC, as long as the casino does not come up with though requirements for non-KYC players. Aside from that am not free with letting my information to a third party so I will remain with the casino that will not demand any form of verification no matter the amount of deposit or withdrawal.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}