{
  "id": "topic_5462899",
  "title": "Maria0815",
  "author": "Maria0815",
  "created_time": "August 11, 2023, 10:03:28 AM",
  "content": "Hello!Bittrex wrote me a mail they are bankrupt and I should withdraw my coins.It's not much. They wrote me it's totalling 105 $. Mostly stuff I collected from faucets back in the day where they were not yet banned by google.However, I cannot get this bittrex KYC thing to work. Their support does not respond to the zendesk ticket.I need a good soul to access that account for me to withdraw the few coins before they move into the pocket of the US government.Anyone out there able to use Bittrex and willing to help me out in that matter please write a PM.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5462899",
  "comments": [
    {
      "author": "OmegaStarScream",
      "created_time": "August 11, 2023, 10:06:59 AMLast edit: August 11, 2023, 10:19:06 AM by OmegaStarScream",
      "body": "What do you mean by you cannot get it to work? Do you keep failing the verification process? I'm afraid there's nothing anyone here can do to help you. If your documents are clear and show everything, and yet they can't verify your account, then the support is the only one who can help in this case.If you're looking for someone to pass the verification on your behalf, then I don't believe that would be possible. AFAIK, as soon as you enter your information on Bittrex, you can't change them afterward.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joniboini",
      "created_time": "August 11, 2023, 11:27:40 AM",
      "body": "Try to contact them through other means. Send them an e-mail, contact their social media, make a post on Reddit, and so on. As omega mentioned, we can't really help you. Anyone who said they can do your KYC is likely going to scam you. The only one who can help is Bittrex themselves. If they are still not responding then you can only take the lesson and move your funds from exchanges/any centralized service asap.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pandu Geddon",
      "created_time": "August 11, 2023, 12:11:34 PM",
      "body": "if you have done KYC before and were rejected, of course you must know the reason for the rejection first. when you try to replace data belonging to other people who might be willing to help you, chances are that it won't work. I hope you are more careful with people you don't know.maybe related to the quality of the picture you sent. you have to fix it. usually support provides an explanation of your failure so you can repeat it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oshosondy",
      "created_time": "August 11, 2023, 12:40:49 PM",
      "body": "Quote from: Maria0815 on August 11, 2023, 10:03:28 AMHowever, I cannot get this bittrex KYC thing to work. Their support does not respond to the zendesk ticket.I need a good soul to access that account for me to withdraw the few coins before they move into the pocket of the US government.Anyone out there able to use Bittrex and willing to help me out in that matter please write a PM.What do you mean? You should come out plainly. Are you under 18 or not having the identity documents needed for verification? Even if you are my friend, I can not help you, not to talk of when I do not know you. Even if you are a reputed members on this forum, I can not still help you because identification documents should remain personal to individuals. Mine is mine. Yours is yours. If you know that you have no documents to get yourself verified and you need the money, tell your parents about it and use their documents.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FatFork",
      "created_time": "August 11, 2023, 02:14:45 PM",
      "body": "Quote from: Maria0815 on August 11, 2023, 10:03:28 AM<cut>Anyone out there able to use Bittrex and willing to help me out in that matter please write a PM.No one can help you complete KYC verification with your personal documents except Bittrex, and I'd strongly advise against handing over your account details to anyone, even with good intentions. Have you checked if you have the option to internally send funds to another Bittrex account? This could be a possible solution if someone with a verified account is willing to help.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Eternad",
      "created_time": "August 11, 2023, 02:23:03 PM",
      "body": "Quote from: Maria0815 on August 11, 2023, 10:03:28 AMI need a good soul to access that account for me to withdraw the few coins before they move into the pocket of the US government.Anyone out there able to use Bittrex and willing to help me out in that matter please write a PM.LoL, Everyone here is avoiding KYC as much as possible. You use a wrong forum to ask someone to do KYC to your account and withdraw the funds. I can still use my Bittrex but that doesn't mean I can help you to withdraw your funds since the only one who can withdraw it is you by completing KYC requirements. Can you specify what specific problem you encounter for your failed KYC verification?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "RewFrew",
      "created_time": "August 11, 2023, 07:40:23 PM",
      "body": "Quote from: Maria0815 on August 11, 2023, 10:03:28 AMHello!Bittrex wrote me a mail they are bankrupt and I should withdraw my coins.It's not much. They wrote me it's totalling 105 $. Mostly stuff I collected from faucets back in the day where they were not yet banned by google.However, I cannot get this bittrex KYC thing to work. Their support does not respond to the zendesk ticket.I need a good soul to access that account for me to withdraw the few coins before they move into the pocket of the US government.Anyone out there able to use Bittrex and willing to help me out in that matter please write a PM. It is bad news for you and everyone who are using  Bittrex exchanger.I know Bittrex is good Exchanger But it’s KYC Processing is very strong. I think if you provide all documents and follow all rules then your KYC will Approve. I think some mistake has been happen to submit your KYC. So your KYC not approving. I will advice you please provide your all data clearly and and Submit KYC again. I think Your KYC will approve. But if creat problem again please contract with Bittrex support they will justify your documents and if all were valid then your KYC will approve there has no doubt.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "goldkingcoiner",
      "created_time": "August 11, 2023, 07:49:23 PM",
      "body": "Quote from: Maria0815 on August 11, 2023, 10:03:28 AMHello!Bittrex wrote me a mail they are bankrupt and I should withdraw my coins.It's not much. They wrote me it's totalling 105 $. Mostly stuff I collected from faucets back in the day where they were not yet banned by google.However, I cannot get this bittrex KYC thing to work. Their support does not respond to the zendesk ticket.I need a good soul to access that account for me to withdraw the few coins before they move into the pocket of the US government.Anyone out there able to use Bittrex and willing to help me out in that matter please write a PM.I am able to use Bittrex and I would be more than willing to help withdraw your coins for you but if the problem is that Bittrex is demanding KYC and not allowing you to withdraw without it, then that is not something that I can help you with. You will have to do the KYC procedure yourself. And yes, KYC procedures can take a long time, especially with exchanges that are having money troubles. This is also the reason why everyone on this forum is screaming \"DO NOT LEAVE YOUR COINS ON DECENTRALIZED PLATFORMS LIKE EXCHANGES\". But I guess that advice is too late for you...Did they deactivate your account until you do KYC? Because in that case, nobody can access your account as it currently stands.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ShowOff",
      "created_time": "August 11, 2023, 08:09:22 PM",
      "body": "Quote from: FatFork on August 11, 2023, 02:14:45 PMQuote from: Maria0815 on August 11, 2023, 10:03:28 AM<cut>Anyone out there able to use Bittrex and willing to help me out in that matter please write a PM.No one can help you complete KYC verification with your personal documents except Bittrex, and I'd strongly advise against handing over your account details to anyone, even with good intentions.Maria0815 can trust someone in good standing on this forum to help her but I think only Maria0815 and Bittrex can solve that problem in the end. It involves KYC, so of course it's hard to get someone else to do it. However, if the value of the existing assets is not much, then I think OP can also be left alone without having to take a worse risk to pass KYC.Quote from: FatFork on August 11, 2023, 02:14:45 PMHave you checked if you have the option to internally send funds to another Bittrex account? This could be a possible solution if someone with a verified account is willing to help.Some exchanges don't allow it without passing KYC, meaning the OP can't transfer his assets either by withdrawing them to another bittrex account or to his personal wallet. I don't know exactly what the case is, but hopefully the OP can find a good solution.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ultegra134",
      "created_time": "August 11, 2023, 08:23:16 PM",
      "body": "Where are you from, if you don't mind me asking? There might be some special requirements regarding your country of residence that make one of your documents not valid for their KYC process. I'm not going to get into details yet. Unfortunately for you, the only person who's able to solve your issue is you, along with their customer support. I've had a similar thing happen to me with the Xapo wallet; they wouldn't verify my details, and when they did, they blocked me out of my account and practically confiscated my balance.Although, judging from the recent Google reviews, it's an ongoing issue for other users too. I wouldn't be surprised if it's just an excuse to confiscate your money, and all this is a simple act, hence why your documents aren't being accepted.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blockman",
      "created_time": "August 11, 2023, 08:26:30 PM",
      "body": "Do you want someone to proceed with the KYC and use their identity so that you can withdraw? I doubt it that there's someone who's going to do that for you. Or if there's someone then that's possible that your terms won't be followed and that person will just have to withdraw everything and walk away with your remaining balance there. Could you tell us on what really does bother you on this one aside that the support isn't replying to you? If you have failed to pass on verification, the system has already your information and a change of names and details might even make it harder for you to withdraw that fund of yours as you're asking to use someone's identity for you to withdraw the money that you have there.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Stalker22",
      "created_time": "August 11, 2023, 09:59:37 PM",
      "body": "Quote from: Maria0815 on August 11, 2023, 10:03:28 AM~Anyone out there able to use Bittrex and willing to help me out in that matter please write a PM.Even if someone here is able to use Bittrex exchange, how will they help you with your account? If they require KYC verification from you, you should undergo KYC verification with your own documents. If you do not want to share your personal information with them, then you should say goodbye to that money. It is not that big of an amount anyway.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "logfiles",
      "created_time": "August 11, 2023, 10:50:19 PM",
      "body": "Quote from: Maria0815 on August 11, 2023, 10:03:28 AMI need a good soul to access that account for me to withdraw the few coins before they move into the pocket of the US government.Anyone out there able to use Bittrex and willing to help me out in that matter please write a PM.Carry your own cross mate.No one is going to do KYC for you here. If there is any, then that will be forgery, and it's likely to cause you even more problems. If you completely fail to get verified, then just assume the $105 as a loss. I mean, you were still doing well even before the contacted you, so you will be fine even after.The Best thing members can do for you here is to just advise you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OcTradism",
      "created_time": "August 12, 2023, 03:30:41 AM",
      "body": "Bittrex required KYC since years ago so if you have an account on Bittrex, you are already KYCed.Now they want you to re-submit KYC to approve your withdrawal before their exchange completely shuts down. You only can use your own documents, re-KYC by yourself and if you use documents of other people, that are different than documents for original KYC, your account will violate the Bittrex KYC and they will terminate your account. Surely you won't be able to withdraw money after that.Avoid doing KYC at night with low quality of light. Doing KYC with good natural light will help you to easily get KYC approval.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rat03gopoh",
      "created_time": "August 12, 2023, 05:36:21 AM",
      "body": "I read here [1], using someone else's identity will not increase your chances of passing the verification because in fact other people are experiencing the same thing with the verification request which is complicated at the end of withdrawal deadline.There seems to be no hope for you at this point. You've basically been over 3 months late[2].1. https://www.reddit.com/r/Bittrex/comments/134azdq/missed_the_deadline_to_withdraw_from_bittrex_us/?rdt=587582. https://cryptocurrencyfacts.com/2023/03/31/bittrex-is-shutting-down",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Maria0815",
      "created_time": "August 12, 2023, 08:48:37 AMLast edit: August 12, 2023, 09:04:26 AM by Maria0815",
      "body": "To answer some questions:I am from germany.I left the bittrex account inactive for many years when I stopped to use the faucets after google banned most of them into starvation.There never was a KYC required back when I used the account.What I had in mind is to give the complete control over the account to someone who can pass the KYC. (If that is still possible at this stage)That person could then send the coins to me. Though I am not yet exactly sure where to have them sent.EDIT: Where to contact bittrex aside from their \"support zendesk\" thing?I did not find any email adress one could write to.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OmegaStarScream",
      "created_time": "August 12, 2023, 09:18:07 AM",
      "body": "Quote from: Maria0815 on August 12, 2023, 08:48:37 AM-snip-EDIT: Where to contact bittrex aside from their \"support zendesk\" thing?I did not find any email adress one could write to.You could try to DM this Twitter account[1] or tweet at it. I'm not sure if you would be able to get a hold of them though, I see people complaining in the comments, with pretty much no response from Bittrex.[1] https://twitter.com/bittrexsupport?lang=en",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Potato Chips",
      "created_time": "August 12, 2023, 09:20:32 AM",
      "body": "Quote from: Maria0815 on August 12, 2023, 08:48:37 AMTo answer some questions:I am from germany.I left the bittrex account inactive for many years when I stopped to use the faucets after google banned most of them into starvation.There never was a KYC required back when I used the account.What I had in mind is to give the complete control over the account to someone who can pass the KYC.That person could then send the coins to me. Though I am not yet exactly sure where to have them sent.That's weird because if you're from Germany, then you must be on Bittrex Global which should be fine as only US users (bittrex.com) are affected. Try to bring this up to bittrex, perhaps there was a mistake or some sort. If your last login was when there was still no-mandatory-kyc, perhaps your account hasn't fully transitioned to global version hence you received an email about bankruptcy yada -- a guess.Quote from: https://bittrex.zendesk.com/hc/en-us/articles/10080271948701-Important-Information-for-Bittrex-U-S-CustomersDoes this affect Bittrex Global / customers outside the U.S.?This decision does not affect Bittrex Global, which only services non-U.S. customers and does not provide services in the U.S., and there will be no change to the Bittrex Global service offering. All Bittrex Global customer funds continue to be safe and accessible, and they remain committed to providing their customers with the safest, most secure, and most compliant exchange in the market.However, you still have to KYC if you wanna get your funds out as I believe KYC is still mandatory on both US-only and global platforms.QuoteEDIT: Where to contact bittrex aside from their \"support zendesk\" thing?I did not find any email adress one could write to.The submit a request should be the same as sending them an email. Have you received a confirmation from them confirming they have received your request?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "michellee",
      "created_time": "August 12, 2023, 09:51:57 AM",
      "body": "If it's KYC related, no one can help you because KYC is all about verifying a person and being able to show someone's documents. It may require your personal documents, so you must send them to Bittrex. The verification process at Bittrex is also simple and as long as the account is yours, you should be able to verify it easily and quickly.Bittrex needs to update its customer's data so Bittrex feels the need to re-verify its customers. My friend did this verification a year ago (if I'm not mistaken). He even sent his passport and scanned his face to pass the verification and he repeated several times to scan his face. He was lucky because he was assisted by a support service agent who saw the last status of his account was verified so he said that this was just a re-verification process.So you must verify yourself because other people can't help you. Your case can be resolved properly and you can verify your account.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}