{
  "id": "topic_5411455",
  "title": "Dekatron",
  "author": "Dekatron",
  "created_time": "August 27, 2022, 06:53:59 PM",
  "content": "Esta primeira série da coleção São Satoshi dos Milagres é composta por 6 NFTs, o primeiro é o zero e os demais de 1 à 5. Cada NFT equivale a uma imagem real de São Satoshi, feita por uma artista catarinense. O portador ou portadora do NFT receberá também a imagem, caso deseje. Enviaremos para todo o Brasil e para o exterior, caso o comprador more fora do Brasil. A forma de envio deve ser combinada posteriormente. O portador do NFT também poderá participar das próximas edições da BITCONF, realizadas nos próximos 5 anos, como convidado VIP.A imagem de São Satoshi apareceu pela primeira vez na VI BITCONF, no World Trade Center de São Paulo. Trata-se de uma brincadeira, obviamante, onde usou-se a imagem de Dorian Nakamoto, \"descoberto\" pela News Week como sendo o verdadeiro Satoshi Nakamoto. Claro que virou um grande meme e, agora, também virou o São Satoshi Nakamoto.Para ver as imagens acesse o perfil da BITCONF no Instagram instagram.com/bitconf e para dar seu lance acesse www.bitconf.com.br/nft As vendas dessa primeira série encerram hoje.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5411455",
  "comments": [
    {
      "author": "Paredao",
      "created_time": "August 28, 2022, 08:31:43 PM",
      "body": "Não é por nada não, mas esse imagem do tal de \"São Satoshi\" está me parecendo mais a imagem de Santo Antonio com os \"olhos puxados\". Não entendi o motivo do \"São Satoshi\" usar o Hábito Franciscano. Por acaso ele fez voto de pobreza     É que sou um estudioso na área da Hagiologia.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "August 29, 2022, 10:48:47 AM",
      "body": "Quote from: Paredao on August 28, 2022, 08:31:43 PMPor acaso ele fez voto de pobreza     Satoshi, voto de pobreza!? Só se for por não mexer nos endereços que são dele com bastante BTC. Mas de certeza que pobre ele não é...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "l3pox",
      "created_time": "August 30, 2022, 10:51:50 PM",
      "body": "Quote from: Paredao on August 28, 2022, 08:31:43 PM<...>É que sou um estudioso na área da Hagiologia.  nunca tinha ouvido essa palavra então fui pesquisarcaso alguém mais tenha ficado curioso como eu segue a definição:QuoteHagiológio é a descrição, estudo e tratado sobre a vida dos santos, no cristianismo, ciência também conhecida como hagiologia. O autor de hagiológios é conhecido como hagiólogo.Numa hagiografia, ao contrário da biografia, o hagiológio não tem a preocupação com o registro histórico de fatos, e sim da vida religiosa do biografado. Isso significa uma preocupação maior com os fenômenos da fé, e uma valoração das tradições e dos fatos milagrosos, rigorosamente comprovados por análises científicas, documentados, examinados pelo alto clero e, posteriormente aceitos como fenômenos de ordem divina.você falou sério ou de brincadeira @Paredao ?achei interessante",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Paredao",
      "created_time": "September 03, 2022, 08:32:45 PM",
      "body": "Quote from: Lucasgabd on August 30, 2022, 10:51:50 PMvocê falou sério ou de brincadeira @Paredao ?achei interessanteClaro que é sério   As hagiografias(biografias de santos e beatos) são bem interessantes. Você sabia que alguns santos não possuem comprovação científica que eles realmente existiram ? Mas nem por isso eles deixam de ser lembrados e evocados. Recomendo leituras na area. Infelizmente as melhores estão em língua espanhola e são difíceis de encontrar.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "l3pox",
      "created_time": "September 06, 2022, 10:47:25 PM",
      "body": "Quote from: Paredao on September 03, 2022, 08:32:45 PMQuote from: Lucasgabd on August 30, 2022, 10:51:50 PMvocê falou sério ou de brincadeira @Paredao ?achei interessanteClaro que é sério   As hagiografias(biografias de santos e beatos) são bem interessantes. Você sabia que alguns santos não possuem comprovação científica que eles realmente existiram ? Mas nem por isso eles deixam de ser lembrados e evocados. Recomendo leituras na area. Infelizmente as melhores estão em língua espanhola e são difíceis de encontrar.  muito interessante mesmo!acabo lendo pouco sobre issosó de vez em quando esbarro na oração de São Francisco de Assis que acho lindíssimacurioso Paredaonão esperava esse papo por aquilegal.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Paredao",
      "created_time": "September 09, 2022, 08:38:54 PM",
      "body": "Quote from: Lucasgabd on September 06, 2022, 10:47:25 PMmuito interessante mesmo!acabo lendo pouco sobre issosó de vez em quando esbarro na oração de São Francisco de Assis que acho lindíssimacurioso Paredaonão esperava esse papo por aquilegal.Sim, a vida de São Francisco e sua oração são muito bonitas. Ele largou tudo para viver sua fé. Recomendo a leitura da Hagiografia de São Francisco. O museu que existe na cidade de Assis mostra toda sua história. Tem até o hábito(roupa) que ele utilizava. Eu já visitei o lugar. É bem impactante.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}