{
  "id": "topic_5425294",
  "title": "Fivestar4everMVP",
  "author": "Fivestar4everMVP",
  "created_time": "December 03, 2022, 06:44:08 PM",
  "content": "Online Casinos Without Online Presence/CommunityFrom my observations, I think online casinos without online presence or community of users are likely to scam any user and get away with it easily, and it doesn't matter if they have a high trust rating, this is because when they refuse to process your withdrawal and the customer support is not responding or not helping, the user in reality have no place to complain that will force the casino to pay him of lose a great number of their users if not all...Like for example, if a casino have a community on bitcointalk, and you are a user of that casino, at any time you have an issue with that casino and the customer support is not helping, bringing such issue to their community on bitcointalk will force the casino to find solution(s) immediately so that they don't lose their other customers in the case where they are the ones at fault..But a casino without any kind of community anyway, if as a user, you encounter any problems and the customer refuse to help you, you are absolutely helpless, and complaining on forums where the casino is not even known won't help because it does not affect the casino on their business, they probably won't see your complaints, neither would their other customers do, so certainly, they won't answer and their other customers also don't know what is going on.. So it is best to avoid such casinos in my best opinion..This is just one out of many types of online casinos to avoid, so let's make the discussion long, what other types of online casinos do you think gamblers should avoid? You never can tell, your advice might help someone in a short of long way.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5425294",
  "comments": [
    {
      "author": "Piesel",
      "created_time": "December 03, 2022, 07:00:03 PM",
      "body": "We have seen how some newbie users on this forum make a complaint on casino ANN about their problem on the casino and the problem is attended to via their admin on their ANN thread, this shows that a casino with an active thread on this forum also helps to increase the chances of getting through to the dev team if all other options failed to yield result.most casinos will rather prefer users to use the live support on the site but the problem some time with online support is the use of bots by the casino as live chat support but bitcointalk members are human and can understand some English differently from what a hot will understand.The online casino to avoid are those that does not have an active admin here on bitcointalk even though their have various review scores.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nakamura12",
      "created_time": "December 03, 2022, 07:18:32 PM",
      "body": "That's more likely their chance to scam people since their casino isn't exposed that much in a community or other platform that can increase their popularity. I would also do the same if I want to scam people since if a person got scammed from that site then there's not much information for them to use against them and the gamblers could only open a scam accusation. Reaching them out won't be much faster or easier since they are not active on a platform or community and that's what I also think that we should be avoiding that kind of casinos even though there's some good reviews on other review sites.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "roslinpl",
      "created_time": "December 03, 2022, 07:48:50 PMLast edit: December 04, 2022, 08:08:02 PM by roslinpl",
      "body": "Our forum became a top most forum discussing the crypto currency. So most of the casino based of crypto currency had a chances here, they can easily promote their casino for sure. As we know many projects running the long term promotion. The new gamblers should check the background of the casino they are going to play. Because some scam gambling websites are their and many good campaign was their. Most of the trusted gambling websites running the campaign in forum to do their promotion.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dunamisx",
      "created_time": "December 03, 2022, 07:53:37 PM",
      "body": "The only online casino i can advise to avoid are the ones with bad reputation, poor website functionality and inconsistent casinos, anyone found to be cheating on gamblers should be totally avoided and how we can know this for sure is through our fellow experienced gamblers who have been a victim of their acts, we only need a tangible live witness to attest on their reputation, this will go far better than online reviews that could be instigated, but we just need someone who has their gambling experience to give us clue before we fall a victim, casinos also scam gamblers even though it's not common but they do so by placing some irregular restriction on gambler's account.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "decodx",
      "created_time": "December 03, 2022, 08:04:11 PM",
      "body": "There are literally hundreds of online casinos out there, spread across the internet in a maze of different affiliate sites and players' forums. Many casinos have been around for years, while others came and went before they could even be fully reviewed. In any case, there are simply too many to be able to keep track of, and many of them are simply not worth your time. Which means the best way to find the best online casino for your needs is to do some research and read reviews from reputable sources. But this is impossible if the casino does not have an online presence or a community on social networks and forums like this one. Just remember not to trust any single review site or player too heavily. It's up to you to research what kinds of things you should look for in a quality online casino - from design, quality of games, promotions, payouts and more - and then take those points into consideration when reading the reviews. It's important to remember that the best way to pick an online casino is to do your research. The internet is full of unreliable information and it can be hard to tell a safe bet from an online casino that you'll never hear from again. If an online casino wants your trust, they need to be more open and make more information available. Only then can you decide whether or not they're right for you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Johnyz",
      "created_time": "December 03, 2022, 09:25:14 PM",
      "body": "Quote from: Fivestar4everMVP on December 03, 2022, 06:44:08 PMOnline Casinos Without Online Presence/CommunityThis is one of the reason why every casinos encourages their players to join their telegram group, because this is where they started to communicate with the players and that could build a good relationship between the two parties so I agree, if there is no social media platform to communicate with them then I think, that's a red flag already. 24/7 support is always a good feature of any crypto gambling site, if they can do it on social media platform better. Though some site are still doing good even if they are not here in the forum so don't just limit your basis here in the forum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "livingfree",
      "created_time": "December 03, 2022, 09:31:42 PM",
      "body": "Quote from: Fivestar4everMVP on December 03, 2022, 06:44:08 PMThis is just one out of many types of online casinos to avoid, so let's make the discussion long, what other types of online casinos do you think gamblers should avoid? You never can tell, your advice might help someone in a short of long way. Those that has an online community despite that, they're still poor in addressing concerns. I think there are still a few of it that does have a poor way of catering customer complaints.And these days, if there's an online casino that's also accepting cryptocurrencies. It's essential to have their back on the forum with an announcement thread because it helps them build their online presence and gain reputation, and they have to learn from the first one's and as well as existing businesses that has been established today.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "meser#",
      "created_time": "December 03, 2022, 09:39:18 PM",
      "body": "Quote from: Piesel on December 03, 2022, 07:00:03 PMWe have seen how some newbie users on this forum make a complaint on casino ANN about their problem on the casino and the problem is attended to via their admin on their ANN thread, this shows that a casino with an active thread on this forum also helps to increase the chances of getting through to the dev team if all other options failed to yield result.most casinos will rather prefer users to use the live support on the site but the problem some time with online support is the use of bots by the casino as live chat support but bitcointalk members are human and can understand some English differently from what a hot will understand.The online casino to avoid are those that does not have an active admin here on bitcointalk even though their have various review scores.You pointed one of the major issue. Bitcointalk is one of well-known area for cryptocurrency. And if there is a company(it doesn't matter casino, exchange, phsycal or virtual product) which accept cryptocurrency they must know that building reputation in here is very important for their business. If I had to choose one company for purchasing with cryptocurrency; first thing must be checking their thread's messages (if its exist). The effort they put into problems here shows how successful a company they are. If they are not mentioned here, that means taking a risk, this is real gambling",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Queentoshi",
      "created_time": "December 03, 2022, 10:02:04 PM",
      "body": "Quote from: Fivestar4everMVP on December 03, 2022, 06:44:08 PMThis is just one out of many types of online casinos to avoid, so let's make the discussion long, what other types of online casinos do you think gamblers should avoid? You never can tell, your advice might help someone in a short of long way. Thank you for starting up this discussion. I think gamblers should also avoid casino's with very poor or no customer support. Not having any customer support or poor support for customers with issues and challenges is not a good sign for a casino that is interested in building a good name for themselves. And any casino that you observe is not interested very well on creating a good name for themselves, should be avoided because it also means they do not want to stay in the business for long, you can never tell their intentions with the many uncertainties, so best you avoid them and focus on casino's that are interested in building a name.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yahoo62278",
      "created_time": "December 03, 2022, 10:32:33 PM",
      "body": "Just because a casino has an online rep here on the forum doesn't mean they will give a damn about any feedback they might get. Sure, we can complain if we have an issue but that still doesn't mean they will solve that issue. It's kind of a what are you gonna do about it things. If someone is going to scam, they're going to scam no matter what is said or brought up on here. There are other ways to get help/complain to a casino or about a casino. Askgamblers is 1 option, Trustpilot and other review sites, most sites have an email address you can use to contact them, or they have live support. This is another topic of yours that belongs in the gambling discussion section IMO. Doesn't matter if you're posting here for more visibility, it's still probably not the right section.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "darkangel11",
      "created_time": "December 03, 2022, 10:41:04 PM",
      "body": "Quote from: Fivestar4everMVP on December 03, 2022, 06:44:08 PMLike for example, if a casino have a community on bitcointalk, and you are a user of that casino, at any time you have an issue with that casino and the customer support is not helping, bringing such issue to their community on bitcointalk will force the casino to find solution(s) immediately so that they don't lose their other customers in the case where they are the ones at fault..This won't help you if they do an exit scam.Unfortunately scammers know that and they abuse this way of thinking. There were many casinos that scammed people. I remember some of them back in 2014 and 2015 were launching big signature campaigns trying to be the biggest ones on bitcointalk. 1xbit is considered a scam and it has a presence on the forum, running a campaign. Bottom line is, you shouldn't think in these black or white terms. There can be legit casinos with no threads or campaigns on bitcointalk and the other way round.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitcoinPanther",
      "created_time": "December 03, 2022, 11:46:21 PM",
      "body": "I do not think that a casino without an online community presence or something like forum like this is an indication of  the Online Casino to be a scam.  Remember there is a chat panel in the Casino where the community can talk and share their game experience.  There is also a customer support to attend to all concerns.  It is indeed an advantage to have an online forum for a Casino but it isn't indicative of a Casino being shady or scam if they don't have it.If the support can't fix the scam accusation issue, there is always an online platform that deals with this kind of cases and a governing authority where we can report possible scam attempt of the Online Casino.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Chikito",
      "created_time": "December 04, 2022, 12:03:25 AM",
      "body": "Quote from: Fivestar4everMVP on December 03, 2022, 06:44:08 PMThis is just one out of many types of online casinos to avoid, so let's make the discussion long, what other types of online casinos do you think gamblers should avoid? You never can tell, your advice might help someone in a short of long way. If the casino read this they will try to grow up and begin to build the community. But of course, it will be hard to build in here if don't have enough knowledge, only spam and manipulated the newbie account. It's different when they build the community on Twitter because many services out there to grow the follower and retweet. So it's not necessary to believe that the casino has a million followers but nothing interactive for each other, we should pay attention to this, that possible fake to deceive people.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "seoincorporation",
      "created_time": "December 04, 2022, 12:28:22 AM",
      "body": "Quote from: Fivestar4everMVP on December 03, 2022, 06:44:08 PMthis is because when they refuse to process your withdrawal and the customer support is not responding or not helping, the user in reality have no place to complain that will force the casino to pay him of lose a great number of their users if not all...The user still has the option to complain on some sites like:trustpilot.comcasino.guruEven they can start a scam causation in this forum, it doesn't matter if the casino has an account here or not. https://bitcointalk.org/index.php?board=83.0But I think the same way as you, if the casino doesn't have the right reputation, then it doesn't worth risking our money with them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Genemind",
      "created_time": "December 04, 2022, 12:56:26 AM",
      "body": "Having an ANN thread here in this forum is a big plus for online casinos. There are chances that online supports or e-mail supports take time to respond and it's really a tough problem for gamblers, this forum is a good place to post your complaints to get the attention of the casino admin regarding your concern. To add, we can find information about the casino through this thread whether they are reputable, or if there are any existing scam issues about the casino, they can easily be tagged. It's also a good place to clarify such issues or even make announcements about updates or promotions. It's not a requirement for all casinos to have a thread here, but it boosts confidence and reliability.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wexnident",
      "created_time": "December 04, 2022, 01:29:20 AM",
      "body": "I reckon most casinos have their own internal forum where you can discuss the issues they have (afaik), not to mention there are review sites out there where you can put out some of your misgivings about what the casino has done to you. I do agree with not trying out big on any casinos that are new or have no rep, trying them out would be fine with a small amount, just to test whether their games are working or they can allow you to withdraw, but anything long term should be put on hold till you're able to judge that a sizeable amount of people use it and deem it trustworthy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitinity",
      "created_time": "December 04, 2022, 06:00:51 AM",
      "body": "Quote from: Fivestar4everMVP on December 03, 2022, 06:44:08 PMFrom my observations, I think online casinos without online presence or community of users are likely to scam any user We cant generalize that all Online Casinos without online presence/community are likely scam. If you use it as a standardization, how about 1xbit? This bookie has active representative in this forum, they are promoting themselves through signature campaign as well but in fact they are well known scammers. On the other side, there are also some casinos with no longer active presence in this forum such as Bitsler and Chips, but they are still reliable enough. Casino's presence/community is not a guarantee that they will not turn into scam. There are many other things to consider when it comes to which casinos to avoid.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joeperry",
      "created_time": "December 04, 2022, 06:12:43 AM",
      "body": "I would like to avoid casinos that was using the same script as the other scam projects from before. Lately I've seen some new gambling sites that was using the same website script which I don't really trust and even though they have a community here in the forum it doesn't mean that they don't have the chance to scam you. I would consider to avoid gambling site that has no previous reputation, no active support or community, no active promotions and probably have some open scam accusations for my own safety.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bittraffic",
      "created_time": "December 04, 2022, 06:41:59 AM",
      "body": "Quote from: Bitinity on December 04, 2022, 06:00:51 AMQuote from: Fivestar4everMVP on December 03, 2022, 06:44:08 PMFrom my observations, I think online casinos without online presence or community of users are likely to scam any user We cant generalize that all Online Casinos without online presence/community are likely scam. If you use it as a standardization, how about 1xbit? This bookie has active representative in this forum, they are promoting themselves through signature campaign as well but in fact they are well known scammers. On the other side, there are also some casinos with no longer active presence in this forum such as Bitsler and Chips, but they are still reliable enough. Casino's presence/community is not a guarantee that they will not turn into scam. There are many other things to consider when it comes to which casinos to avoid. 1xbit is purely business and massive marketing. You can browse crypto pages and you can definitely find thier ads on them including the block explorers.It likely will depend on the proof that the user has screenshots of his issues and the casino doing the right thing. But ultimately any casino with or without a community can scam. It's just a high possibility that a casino with a good reputation and a big community will protect to continue its online casino business.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}