{
  "id": "topic_5445978",
  "title": "Dave1",
  "author": "Dave1",
  "created_time": "March 23, 2023, 12:40:50 AMLast edit: November 18, 2023, 01:24:47 AM by Dave1",
  "content": "And we all know that Chipmixer has been seized, but there are still a lot of clone sites in the wild that someone might fall. Testing some keywords and this is the result:For sure there are still sites that mimic this mixing service for the purpose of stealing our BTC by this cyber criminals.Code:https://chipmixer.one/And if you are looking for tumbler services, you can check this thread: 2023 List Bitcoin Mixers Bitcoin Tumblers Websites",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5445978",
  "comments": [
    {
      "author": "pakhitheboss",
      "created_time": "March 23, 2023, 12:47:47 AM",
      "body": "This has been a constant issue with Google. Close website just pops up on the SERP and surprisingly when a genuine key word is entered. If not then you will see a lot of advertising of such scam sites on the result page. The only option is to report these website to Google.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LDL",
      "created_time": "March 23, 2023, 12:58:49 AMLast edit: March 23, 2023, 01:11:12 AM by LDL",
      "body": "Before the original Chipmixer website Sezied, a lots of false clone websites introduced..chipmixer.xyzchipmixer.cochipmixer.shopchipmixer.meBut recently after Sezied of Original Chipmixer website, A clone fake website introducechipmixer.oneVarious cybercriminals have created fake/scam websites at different times based on Chipmixer website. But in no case were they successful but the fraudsters did not stop their efforts. They continue their efforts.  So please do not fall into the trap of fraudsters. At various times various forum users have protested by writing against the ChipMixer fake website. Below are their awareness posts.sujonali1819's post: https://bitcointalk.org/index.php?topic=5433445.msg61561202#msg61561202Charles-Tim's post: https://bitcointalk.org/index.php?topic=5433445.msg61561375#msg61561375AnotherAlt's post: https://bitcointalk.org/index.php?topic=5396952.msg60026118#msg60026118Bitcoin_Arena's post: https://bitcointalk.org/index.php?topic=5396952.msg60030980#msg60030980DireWolfM14's post: https://bitcointalk.org/index.php?topic=5349904.msg57490881#msg57490881",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nwada001",
      "created_time": "March 23, 2023, 02:32:35 AM",
      "body": "Scammers are always ready to clone or develop anything that they think will make them money, so if your business is pulling heavy traffic and has lots of users, just be ready for impersonators. We just have to be careful, because no matter how perfect the clone looks, there will always be an open spot to differentiate the fake from the original when we look down closely. Quote from: pakhitheboss on March 23, 2023, 12:47:47 AMThe only option is to report these website to Google. Even when we report most of this sites google won't just stop bringing them out when we search, because most of them are not on the top 10 search because they are frequently used or search but because they paid google for that ads space.. google most of the times usually don't care what they feed to the public providing that the companies which they advertise are paying them huge. It's just business for them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "socks435",
      "created_time": "March 23, 2023, 04:12:11 AM",
      "body": "There are many of them not only in Google but also spreading on the other forums and social media such as telegram, discord, twitter, reddit and facebook.That is why we need to be careful especially to newbies who are planning to use mixer.I suggest uBlock Origin to protect our browser from seeing chipmixer fake/phishing sites you can add keyword filter like chipmixer and then let uBlock Origin block all those keywords and sites that use this keyword.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "reagansimms",
      "created_time": "March 23, 2023, 05:43:33 AM",
      "body": "Quote from: LDL on March 23, 2023, 12:58:49 AMBefore the original Chipmixer website Sezied, a lots of false clone websites introduced..chipmixer.xyzchipmixer.cochipmixer.shopchipmixer.meBut recently after Sezied of Original Chipmixer website, A clone fake website introducechipmixer.oneVarious cybercriminals have created fake/scam websites at different times based on Chipmixer website. But in no case were they successful but the fraudsters did not stop their efforts. They continue their efforts.  So please do not fall into the trap of fraudsters. At various times various forum users have protested by writing against the ChipMixer fake website. Below are their awareness posts.sujonali1819's post: https://bitcointalk.org/index.php?topic=5433445.msg61561202#msg61561202Charles-Tim's post: https://bitcointalk.org/index.php?topic=5433445.msg61561375#msg61561375AnotherAlt's post: https://bitcointalk.org/index.php?topic=5396952.msg60026118#msg60026118Bitcoin_Arena's post: https://bitcointalk.org/index.php?topic=5396952.msg60030980#msg60030980DireWolfM14's post: https://bitcointalk.org/index.php?topic=5349904.msg57490881#msg57490881The news that Chipmixer has been confiscated has shocked the world, this opportunity is immediately eaten by fraudsters to seek profits by creating cloned or fake sites. Members who have joined the forum are no strangers to this news, almost every day the Chipmixer seizure news is discussed.Forum users won't fall into the scammer's trap again, at least those who are aware of the news Chipmixer has been confiscated. Awareness must always be increased to prevent the increasing number of victims of fake sites designed by fraudsters.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Crypt0Gore",
      "created_time": "March 23, 2023, 07:02:03 AM",
      "body": "This is a well-known problem that can never be solved by complaining to the Google team, because they don't care, this is another good reason to get uBlock Origin running on your PC for yourself, and stop searching through Google search engine for official link of a website or platform you know nothing about. There is no way Google search won't pack take ads to users searching for answers using the search engine. *SOLUTION* •Ditch Chrome browser and Mozilla Firefox.•Download a well rated Ad-blocker.•Get Brave browser or Microsoft Edge browser. •Change your search engine, e.g Bing",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "March 23, 2023, 07:22:52 AM",
      "body": "Quote from: Dave1 on March 23, 2023, 12:40:50 AMAnd we all know that Chipmixer has been seized, but there are still a lot of clone sites in the wild that someone might fall. Testing some keywords and this is the result:Although, this is not new on this forum about Chipmixer, the site has many clone sites that belongs to scammers.Quote from: pakhitheboss on March 23, 2023, 12:47:47 AMThis has been a constant issue with Google. Close website just pops up on the SERP and surprisingly when a genuine key word is entered. If not then you will see a lot of advertising of such scam sites on the result page. The only option is to report these website to Google. That is true, it has been an issue with Google, but not only Google. When Chipmixer domain has not been seized, I used even Duckduckgo for it and I saw the fake mixers too, but the difference was that Duckduckgo placed the original site as the first that I saw, while Google placed several fake Chipmixers before the original one. If you use other search engines too, the fake ones might appear.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Taskford",
      "created_time": "March 23, 2023, 10:44:04 AM",
      "body": "Nothing new about this fake clone site  wandering around and searchable by google browsing. For sure there are people taking advantage on situation and they try to convince those other people who use mixers that chipmixer service is back on track. Chipmixer users should always verify before they try to use those service again since until there's no further notice to the representative of Chipmixer then they still not in good situation and their business still been stop by legal authorities.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o_e_l_e_o",
      "created_time": "March 23, 2023, 11:53:23 AM",
      "body": "Quote from: Crypt0Gore on March 23, 2023, 07:02:03 AMsnipOf the four browsers you have mentioned, Firefox is the only which isn't based on Chromium and filled with unremovable Google code. It is easily the best browser to use, other than Tor, when it comes to privacy and security.If you are going to change your search engine, then no point moving from one corporate spyware engine such as Google to another corporate spyware engine such as Bing. You should choose one which is actually private, such as DDG or SearX.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husires",
      "created_time": "March 23, 2023, 12:00:15 PM",
      "body": "Doesn't sized sites become the burden of the state to track down clone sites? meaning blocking all sites starts with chipmixer? Or is it possible for the same site to return again once the domain name is changed?If this is possible, the same site may come back using a new domain name and gain trust fast (although I think they did not)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "passwordnow",
      "created_time": "March 23, 2023, 12:15:48 PM",
      "body": "I bet that they'll never stop and even after a year or two, I'm guessing that there will still be those scam clone websites of chipmixer trying to take some victims on their board hoping that their service is still up and working. Also, possible that some chips have been left there and haven't been claimed to hope that with a simple google search, a website claiming that their CM and everyone who's got some chips can still be claimed. Well, AFAIK, most users of CM are wise and aware of these clone sites.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Adbitco",
      "created_time": "March 23, 2023, 12:18:36 PM",
      "body": "The forum is fully aware of their seized and anyone who falls victims from this forum doesn't read widely, even as google keep showing the results for ChipMixer i believe there are people who may not truly know the right site which might led them to click any of those site. The worst part about those clone site (scammers) is that they are active in all site, we just have to be very mindful and not too in a rush to click on whatever may pop up from the search engine.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "salad daging",
      "created_time": "March 23, 2023, 12:38:18 PM",
      "body": "Quote from: Adbitco on March 23, 2023, 12:18:36 PMThe forum is fully aware of their seized and anyone who falls victims from this forum doesn't read widely, even as google keep showing the results for ChipMixer i believe there are people who may not truly know the right site which might led them to click any of those site. The worst part about those clone site (scammers) is that they are active in all site, we just have to be very mindful and not too in a rush to click on whatever may pop up from the search engine. Well, we already know how we are often active in the forum, so the news of the Chipmixer seizure was shocking this year and all this has spread to various international media.About the Chipmixer clone site, it's been a very long time on Google or even on Yandex, the clone site has never died even though some have reported it, but in fact the scamers are still maintaining the clone site and until now, if you search for Chipmixer, it's still available for clones while for the original site it no longer appears in the search.In essence, be careful for those who don't know, once again the Chipmixer has been confiscated, meaning there will be no more operations.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "S3300",
      "created_time": "March 23, 2023, 12:44:58 PM",
      "body": "I prefer Brave browser, you don't need anything else if you have this browser, it comes with inbuilt ad blocker that blocks ads and trackers by default, it also has inbuilt script blocker, we all know how useful and script blocker can be for heavy internet users and it has access to the Tor Network easily, the second best on my list is Tor Browser.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "aysg76",
      "created_time": "March 23, 2023, 01:42:20 PM",
      "body": "Quote from: Charles-Tim on March 23, 2023, 07:22:52 AMThat is true, it has been an issue with Google, but not only Google. When Chipmixer domain has not been seized, I used even Duckduckgo for it and I saw the fake mixers too, but the difference was that Duckduckgo placed the original site as the first that I saw, while Google placed several fake Chipmixers before the original one. If you use other search engines too, the fake ones might appear.They are getting paid for it and usually you will find lot of ads if you are not using the ad blocker on google filled with all those scam links to drain your funds.While using google based browser such as Chrome it becomes your responsibility to check for the correct links as there are many fake one popping up on your screen and they don't concern about your privacy.So best option is to use Tor browser keeping your privacy and directing towards correct links.Quote from: S3300 on March 23, 2023, 12:44:58 PMI prefer Brave browser, you don't need anything else if you have this browser, it comes with inbuilt ad blocker that blocks ads and trackers by default, it also has inbuilt script blocker, we all know how useful and script blocker can be for heavy internet users and it has access to the Tor Network easily, the second best on my list is Tor Browser. At first I was also in favour of Brave browser but it only blocks ads but your connection is not secure and your privacy is open to them so for me it's not the best choice and instead of using TOR window through them you should directly use it by installing it on your system.It is best way to make private search with full safety while all other keep track of your records.The Brave browser gives you points and other services and say it's good for normal search and watch YouTube videos without any ads but not to make private search.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Coyster",
      "created_time": "March 23, 2023, 04:09:26 PM",
      "body": "Quote from: Husires on March 23, 2023, 12:00:15 PMDoesn't sized sites become the burden of the state to track down clone sites? meaning blocking all sites starts with chipmixer? The government/state wouldn't waste its time going after clone/dummy sites, once they have taken down the big fish that they are targeting, they go after other big targets, it is the duty of the person seeking to use the website to research and make sure that they are in the right place, and if you go to the correct website/domain, just as in the case of Chipmixer, you'd get a warning that the site/domain has been seized. Of course clone sites would be taken down if found, but i don't think the state 'exhausts' its resources to seriously go after them.Quote from: Husires on March 23, 2023, 12:00:15 PMOr is it possible for the same site to return again once the domain name is changed?If this is possible, the same site may come back using a new domain name and gain trust fast (although I think they did not)Woudn't that depend on the reason the site was seized, if a site was taken down for serious offenses, then a search and prosecution of those running the websites would follow, and surely that domain isn't returning, ever.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BTCGalaxyA12",
      "created_time": "March 23, 2023, 04:18:08 PM",
      "body": "Quote from: Dave1 on March 23, 2023, 12:40:50 AMAnd we all know that Chipmixer has been seized, but there are still a lot of clone sites in the wild that someone might fall. Testing some keywords and this is the result:For sure there are still sites that mimic this mixing service for the purpose of stealing our BTC by this cyber criminals.Code:https://chipmixer.one/And if you are looking for tumbler services, you can check this thread: 2023 List Bitcoin Mixers Bitcoin Tumblers Websites  A very useful warning for everyone in preventing being deceived by those who take advantage of the situation.When we do a search in the browser by typing chipmixer.com, an image is immediately displayed that displays the words THIS WEBSITE HAS BEEN SEIZED, complete with 8 logos of the parties acting as policy makers. Meanwhile, the chipmixer.io site can still operate as usual.Confusing. For some who don't know, they will think the chipmixer.io site is still operating as usual.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Adbitco",
      "created_time": "March 23, 2023, 04:31:07 PM",
      "body": "Quote from: salad daging on March 23, 2023, 12:38:18 PMQuote from: Adbitco on March 23, 2023, 12:18:36 PMSnipIn essence, be careful for those who don't know, once again the Chipmixer has been confiscated, meaning there will be no more operations.I wonder why google still advertising those scam site doesn't it mean they don't know the rightful site or they did allowed those for an aid. As a matter of taught google should be active in filtering out those shit sites that try clone people's original website, I also noticed there's a fake coingecko website nearly I would have fell victim of hastily clicking the site I came to my senses when I was asked to approve my metask or trustwallet to continue that was when I knew something was wrong I quickly delete the tab and clear my cache memory.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "_BlackStar",
      "created_time": "March 23, 2023, 04:39:21 PM",
      "body": "Quote from: Adbitco on March 23, 2023, 04:31:07 PMI wonder why google still advertising those scammer site doesn't it mean they don't know the rightful site or they did allowed those for an aid. As a matter of taught google should be active in filtering out those shit sites that try clone people's original website, I also noticed there's a fake coingecko website nearly I would have fell victim of hastily clicking the site I came to my senses when I was asked to approve my metask or trustwallet to continue that was when I knew something was wrong I quickly delete the tab and clear my cache memory.This is nothing new about Google, so you shouldn't be surprised anymore.I think you can install special extension to prevent future such ads from showing up on your search pages, uBlock Origin is one [but consider the risk].Google is terrible when it comes to preventing phishing or fake sites advertised on the search page, next action is to report it if you really care.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}