{
  "id": "topic_5454865",
  "title": "Filicius",
  "author": "Filicius",
  "created_time": "June 02, 2023, 01:19:50 PM",
  "content": "Larry Fink, el CEO de Blackrock, les explicó cómo la confianza mundial en el USD se ha visto deteriorada debido al reciente escándalo del tope de deuda de Estados Unidos a los asistentes a una conferencia reciente de servicios financieros de Deutsche Bank.Esto podría fortalecer el posicionamiento de Bitcoin como moneda de reserva, aunque los analistas tienen opiniones distintas según se apliquen o no más medidas de subidas de tipos de interés.Fuente: https://es.cointelegraph.com/news/blackrock-ceo-warning-debt-ceiling-bitcoin",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5454865",
  "comments": [
    {
      "author": "Hispo",
      "created_time": "June 02, 2023, 04:29:34 PM",
      "body": "Creo que la cuestión de la deuda de los Estados Unidos, aunque sea algo muy delicado de lo que hablar para el estatus a largo plazo de ese país, en el corro plazo estoy casi seguro que los representantes del partido Republicano cederán a aumentar o suspender de forma temporal el techo de la deuda. Un default seguramente también afectarían sus portafolios personales. El futuro del dólar y el cuestionamiento de el como moneda de reserva o moneda mundial tomara más que meras ideas de monedas alternativas de adversarios o bloques como el Brics, hasta que no hayan resultados indebatibales, el estatus quo seguiría igual",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Drawesome",
      "created_time": "June 02, 2023, 09:10:03 PM",
      "body": "Quote from: Hispo on June 02, 2023, 04:29:34 PMEl futuro del dólar y el cuestionamiento de el como moneda de reserva o moneda mundial tomara más que meras ideas de monedas alternativas de adversarios o bloques como el Brics, hasta que no hayan resultados indebatibales, el estatus quo seguiría igual La suerte que tienen es que no hay alternativa creible (como unidad de medida, como moneda de reserva ha perdido mucha credibilidad). Es muy difífil como dices que algo desplace un status quo tan implantado. Los brics no lo tendrán fácil porque no van sobrados de solvencia tampoco. En un mercado de divisas internacional, China no tendría fuerza para atacar realmente al dólar porque el valor de su yuan es más falso que un billete de 1000 Satoshis. Podría empezar a vender sus bonos americanos y entrar en una guerra, pero saldrían perdiendo poorque se destaparía toda la burbuja interna que tienen. Es un pulso que nadie quiere llevar al límite.  Sea como sea, la inflación va a ser muy grande en USD y habrá una crisis de producción, desabastecimiento etc. USA no está ahora mismo en buena posición ante el mundo que ha acumulado su deuda pensando en que era algo con cierta solvencia.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hispo",
      "created_time": "June 03, 2023, 10:06:04 AM",
      "body": "Quote from: Drawesome on June 02, 2023, 09:10:03 PMQuote from: Hispo on June 02, 2023, 04:29:34 PMEl futuro del dólar y el cuestionamiento de el como moneda de reserva o moneda mundial tomara más que meras ideas de monedas alternativas de adversarios o bloques como el Brics, hasta que no hayan resultados indebatibales, el estatus quo seguiría igual La suerte que tienen es que no hay alternativa creible (como unidad de medida, como moneda de reserva ha perdido mucha credibilidad). Es muy difífil como dices que algo desplace un status quo tan implantado. Los brics no lo tendrán fácil porque no van sobrados de solvencia tampoco. En un mercado de divisas internacional, China no tendría fuerza para atacar realmente al dólar porque el valor de su yuan es más falso que un billete de 1000 Satoshis. Podría empezar a vender sus bonos americanos y entrar en una guerra, pero saldrían perdiendo poorque se destaparía toda la burbuja interna que tienen. Es un pulso que nadie quiere llevar al límite.  Sea como sea, la inflación va a ser muy grande en USD y habrá una crisis de producción, desabastecimiento etc. USA no está ahora mismo en buena posición ante el mundo que ha acumulado su deuda pensando en que era algo con cierta solvencia. Yo tenía entendido que la cuestión del YUAN es que su valor es reducido de forma artificial para poder mantener su economía o industria de fabricación en un estado que se traduzca en una competitividad relativamente alta en comparación a la de sus vecinos. Las devaluaciones artificales, para que los fabricantes y factorías extranjeras no se vayan de territorio Chino, en resumen. Si BRICS quiere hacer una moneda alternativa o conjunta, tendrá que estar libre de esas devaluaciones artificiales para que se considere una reserva de valor a los ojos de los inversionistas",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "famososMuertos",
      "created_time": "June 03, 2023, 12:57:01 PM",
      "body": "BlackRock! Hay que entender antes el sentido implícito de quién dice \" Estados Unidos pone en peligro... mis inversiónes\".Y no es acaso el principal asesor del gobierno de los Estados Unidos, a veces no es a quien acusa, cuento viejo, la opinión pública es de tanto valor en los U.S. como el valor de BlackRock.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Filicius",
      "created_time": "June 03, 2023, 03:07:43 PM",
      "body": "Quote from: famososMuertos on June 03, 2023, 12:57:01 PMBlackRock! Hay que entender antes el sentido implícito de quién dice \" Estados Unidos pone en peligro... mis inversiónes\".Y no es acaso el principal asesor del gobierno de los Estados Unidos, a veces no es a quien acusa, cuento viejo, la opinión pública es de tanto valor en los U.S. como el valor de BlackRock.A veces nos centramos en el tema de la noticia y no en la noticia en sí. Efectivamente, quien hace la afirmación es determinante en este caso.Por otro lado, cuando dices \"mis inversiones\" ¿te refieres a en USD o en general? porque me imagino que Backrock algún Bitcoin ya tendrá también, y por ahí igual se abren nuevas derivadas.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hispo",
      "created_time": "June 03, 2023, 04:21:42 PM",
      "body": "Quote from: Filicius on June 03, 2023, 03:07:43 PMQuote from: famososMuertos on June 03, 2023, 12:57:01 PMBlackRock! Hay que entender antes el sentido implícito de quién dice \" Estados Unidos pone en peligro... mis inversiónes\".Y no es acaso el principal asesor del gobierno de los Estados Unidos, a veces no es a quien acusa, cuento viejo, la opinión pública es de tanto valor en los U.S. como el valor de BlackRock.A veces nos centramos en el tema de la noticia y no en la noticia en sí. Efectivamente, quien hace la afirmación es determinante en este caso.Por otro lado, cuando dices \"mis inversiones\" ¿te refieres a en USD o en general? porque me imagino que Backrock algún Bitcoin ya tendrá también, y por ahí igual se abren nuevas derivadas.Creo que se refiere a que Blackrock, sin duda te dará mucha exposición a acciones y bonos.de deuda del tesoro en los Estados Unidos. Y teniendo en cuenta su exposición, a ellos no les conviene que un posible default baje el valor de sus activos en un corto plazo. Apenas se diese la noticia de un default, todos los índices de la economía EstadoUnidense e incluso en otros lugares del mundo, sufrirían.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Don Pedro Dinero",
      "created_time": "June 04, 2023, 12:16:37 AM",
      "body": "Ya hace un tiempo que se habla de ello y recuerdo haber visto un par de hilos al respecto en el Norte. Por una parte, cada vez se oyen más países decir que van a tomar una alternativa al dólar, comerciando con sus propias monedas, pero por otra a día de hoy por lo menos, no parece que haya habido un impacto significativo y el dólar de EEUU sigue siendo la moneda de reserva mundial. Probablemente por esto:Quote from: Drawesome on June 02, 2023, 09:10:03 PMLa suerte que tienen es que no hay alternativa creible <...>A mí no me sorprendería que poco a poco el dólar vaya perdiendo este estatus pero todavía queda mucho camino por andar.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Silberman",
      "created_time": "June 04, 2023, 10:07:57 AM",
      "body": "Quote from: Don Pedro Dinero on June 04, 2023, 12:16:37 AMYa hace un tiempo que se habla de ello y recuerdo haber visto un par de hilos al respecto en el Norte. Por una parte, cada vez se oyen más países decir que van a tomar una alternativa al dólar, comerciando con sus propias monedas, pero por otra a día de hoy por lo menos, no parece que haya habido un impacto significativo y el dólar de EEUU sigue siendo la moneda de reserva mundial. Probablemente por esto:Quote from: Drawesome on June 02, 2023, 09:10:03 PMLa suerte que tienen es que no hay alternativa creible <...>A mí no me sorprendería que poco a poco el dólar vaya perdiendo este estatus pero todavía queda mucho camino por andar.  En el caso de una desdolarización de la economía este será un proceso que tardará décadas en tomar lugar, después de todo así fue la transición de la libra esterlina y el dólar en su momento y no me sorprendería que este fuese el caso una vez más.El problema como se ha planteado es que el candidato natural a tomar su lugar sería el yuan, pero la manipulación extrema a la que es sujeto no permite que esto tenga lugar, por lo tanto, estamos en terreno desconocido para la teoría económica, dado que al menos durante los últimos cientos de años siempre ha habido una moneda dominante usada para el intercambio de productos alrededor del mundo.Lo cual hace posible un escenario de la posible creación de una moneda global respaldada por una canasta de las monedas de las economías mas fuertes del mundo, o podríamos ver por primera vez en mucho tiempo un sistema sin moneda de reserva no oficial y en el cual cada país intenta el comercio de sus productos con otros países usando sus monedas locales.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "darxiaomi",
      "created_time": "June 05, 2023, 11:43:35 PM",
      "body": "Blackrock? Y que escandalo con la deuda? El de todos los años? De que usd habla, del que quieren hacer lo mismo pero en CBDC?.Despues extrapolar lo de BTC.... esta bien que es un medio cripto, pero eso es como que un medio chino extrapole lo mismo pero para el yuan, y asi todos los demas que se nos ocurran. Ojo no digo que no sea posible o un mal analisis pero a estas alturas lo veo como una nota relleno.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hispo",
      "created_time": "June 06, 2023, 12:35:56 AM",
      "body": "Bueno, parece que gigantes corporativos e inversionistas no tendrán que preocuparse por el techo de la deuda en un rato, porque tengo entendido que se ha alcanzado un acuerdo bi partidista en las camaras de los Estados Unidos con el proposito de evadir el default que se veía venir desde lejos.Por un lado, sigo pensando que es bastante notable como un país completo puede seguir viviendo de esa forma, de pedir prestado para poder cubrir un decifit que nunca tuvo que ser una realidad, pero bueno. Cada quien tendrá su opinion.Por aquí les dejo una fuente, en caso de que sientan curiosidad. Por supuesto, les invito a buscar más fuentes, ya sabemos lo sesgadas que pueden ser este tipo de páginas, en especial provenientes de los Estados Unidos, ni mas ni menos. El Senado de EE.UU. aprobó el acuerdo sobre el techo de la deuda Source: https://cnnespanol.cnn.com/video/techo-deuda-eeuu-senado-congreso-biden-eeuu-live-ione-molinares-cafe/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Porfirii",
      "created_time": "June 06, 2023, 09:08:56 AM",
      "body": "Quote from: Hispo on June 06, 2023, 12:35:56 AMBueno, parece que gigantes corporativos e inversionistas no tendrán que preocuparse por el techo de la deuda en un rato, porque tengo entendido que se ha alcanzado un acuerdo bi partidista en las camaras de los Estados Unidos con el proposito de evadir el default que se veía venir desde lejos.Por un lado, sigo pensando que es bastante notable como un país completo puede seguir viviendo de esa forma, de pedir prestado para poder cubrir un decifit que nunca tuvo que ser una realidad, pero bueno. Cada quien tendrá su opinion.Por aquí les dejo una fuente, en caso de que sientan curiosidad. Por supuesto, les invito a buscar más fuentes, ya sabemos lo sesgadas que pueden ser este tipo de páginas, en especial provenientes de los Estados Unidos, ni mas ni menos. El Senado de EE.UU. aprobó el acuerdo sobre el techo de la deuda Source: https://cnnespanol.cnn.com/video/techo-deuda-eeuu-senado-congreso-biden-eeuu-live-ione-molinares-cafe/¡Muy a tiempo tu actualización Hispo! Bueno, de momento parece que están salvando la situación y saliendo del paso. Personalmente, tampoco me parecería positivo que el valor del dólar cayera abruptamente porque seguramente arrastraría a otros actores en el mercado que nada tienen que ver ni culpa en este tema.Claro que una devaluación progresiva del dólar frente a otras divisas y su pérdida progresiva de estatus de moneda de referencia no tiene por qué suponer necesariamente una desgracia, y muchos por aquí desearán que suceda, pero el modo en que lo haga importa, y una crisis solo beneficiaría a unos pocos mismos de siempre.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wimex",
      "created_time": "June 07, 2023, 02:32:30 AM",
      "body": "El dólar sigue gobernando sobre muchos países, sobre todo en varias regiones de Latinoamérica que debido a la crisis económica que poseen han llegado incluso a tener que tomar una decisión difícil, dolarizar su país y dejar de usar su moneda original.  Si el dólar continuo de esta manera y no logran solucionar su deuda, es muy probable que pronto nos veamos en una crisis mundial, hasta tal grado que la pobreza aumente radicalmente, pues el dólar influye en sí, de forma indirecta en la economía de prácticamente todo el mundo, ¿Qué sucedería entonces?, es Obvio que bitcoin se beneficiaria de esto, pero ¿será suficiente para que puedan ver esta moneda como una reserva? Es una cuestión que implica una decisión que podría cambiarlo todo, a tal grado de prácticamente obligar al gobierno a ver bitcoin, como una opción que los puede sacar de aprietos como estos.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Don Pedro Dinero",
      "created_time": "June 07, 2023, 03:45:34 AM",
      "body": "Quote from: Porfirii on June 06, 2023, 09:08:56 AMQuote from: Hispo on June 06, 2023, 12:35:56 AMBueno, parece que gigantes corporativos e inversionistas no tendrán que preocuparse por el techo de la deuda en un rato, porque tengo entendido que se ha alcanzado un acuerdo bi partidista en las camaras de los Estados Unidos con el proposito de evadir el default que se veía venir desde lejos.<...>¡Muy a tiempo tu actualización Hispo! Bueno, de momento parece que están salvando la situación y saliendo del paso. <...>Pero si eso es todo un teatro, un paripé. Recuerdo que varios años en el foro ha pasado eso, problemas para ponerse de acuerdo con el techo de deuda entre demócratas y republicanos y varios hilos comentando, para que el final pues después de mucho tira y afloja lleguen a un acuerdo. Es una solución lógica de teoría de juegos, por muchas diferencias que tengan, ambos partidos salen ganando mucho más si hay acuerdo que si no. En próximos años se repetirá el teatro.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hispo",
      "created_time": "June 07, 2023, 10:08:19 AM",
      "body": "Quote from: Don Pedro Dinero on June 07, 2023, 03:45:34 AMQuote from: Porfirii on June 06, 2023, 09:08:56 AMQuote from: Hispo on June 06, 2023, 12:35:56 AMBueno, parece que gigantes corporativos e inversionistas no tendrán que preocuparse por el techo de la deuda en un rato, porque tengo entendido que se ha alcanzado un acuerdo bi partidista en las camaras de los Estados Unidos con el proposito de evadir el default que se veía venir desde lejos.<...>¡Muy a tiempo tu actualización Hispo! Bueno, de momento parece que están salvando la situación y saliendo del paso. <...>Pero si eso es todo un teatro, un paripé. Recuerdo que varios años en el foro ha pasado eso, problemas para ponerse de acuerdo con el techo de deuda entre demócratas y republicanos y varios hilos comentando, para que el final pues después de mucho tira y afloja lleguen a un acuerdo. Es una solución lógica de teoría de juegos, por muchas diferencias que tengan, ambos partidos salen ganando mucho más si hay acuerdo que si no. En próximos años se repetirá el teatro.Por ese mismo motivo uno de los comentaristas políticos que yo sigo en Youtube ha dado a entender que no ha dado cobertura a las noticias sobre el techo de la deuda y los acuerdos que pudiesen darse sobre ella, porque en su opinión estaría insultando la inteligencia de su audiencia. Pero, a pesar de que es algo que se ha visto varias veces en el pasado (y en este caso se ha repetido el resultado), por lo tiempos extraños que recorren en la política de estados unidos, no descartaría un default. Desde que Trump llegó a la presidencia han pasado cosas que nadie creería posible, entre ellas que un ex presidente fuese acusado de crímenes civiles.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Filicius",
      "created_time": "June 07, 2023, 04:16:28 PM",
      "body": "Quote from: Hispo on June 07, 2023, 10:08:19 AMQuote from: Don Pedro Dinero on June 07, 2023, 03:45:34 AMPero si eso es todo un teatro, un paripé. Recuerdo que varios años en el foro ha pasado eso, problemas para ponerse de acuerdo con el techo de deuda entre demócratas y republicanos y varios hilos comentando, para que el final pues después de mucho tira y afloja lleguen a un acuerdo. Es una solución lógica de teoría de juegos, por muchas diferencias que tengan, ambos partidos salen ganando mucho más si hay acuerdo que si no. En próximos años se repetirá el teatro.Por ese mismo motivo uno de los comentaristas políticos que yo sigo en Youtube ha dado a entender que no ha dado cobertura a las noticias sobre el techo de la deuda y los acuerdos que pudiesen darse sobre ella, porque en su opinión estaría insultando la inteligencia de su audiencia. Pero, a pesar de que es algo que se ha visto varias veces en el pasado (y en este caso se ha repetido el resultado), por lo tiempos extraños que recorren en la política de estados unidos, no descartaría un default. Desde que Trump llegó a la presidencia han pasado cosas que nadie creería posible, entre ellas que un ex presidente fuese acusado de crímenes civiles.Paripé o no, en la teoría de juegos no siempre los jugadores eligen la decisión que más les beneficia en conjunto, por lo que el riesgo es real, aunque te doy la razón Don Pedro Dinero que la probabilidad debe ser muy baja.Personalmente me molestan mucho más otras noticias sensacionalistas, que se pueden tirar semanas hablando de un accidente de un niño en una piscina y nadie le devolverá la vida a ese niño, pero ahí están, explotando la noticia repetitivamente. No me parece que sea el caso pues, aunque el contexto en el que se desarrolla la noticia del OP sí que se repite periódicamente, serían tan graves los resultados contrarios a lo que estamos acostumbrados que merece la pena una llamada de atención. Sin mencionar, claro, que la noticia va más bien sobre lo que opina el CEO de Blackrock y otros analistas sobre el impacto potencial en el Bitcoin que sobre el tema subyacente.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Silberman",
      "created_time": "June 07, 2023, 09:06:25 PM",
      "body": "Quote from: Filicius on June 07, 2023, 04:16:28 PMParipé o no, en la teoría de juegos no siempre los jugadores eligen la decisión que más les beneficia en conjunto, por lo que el riesgo es real, aunque te doy la razón Don Pedro Dinero que la probabilidad debe ser muy baja.Personalmente me molestan mucho más otras noticias sensacionalistas, que se pueden tirar semanas hablando de un accidente de un niño en una piscina y nadie le devolverá la vida a ese niño, pero ahí están, explotando la noticia repetitivamente. No me parece que sea el caso pues, aunque el contexto en el que se desarrolla la noticia del OP sí que se repite periódicamente, serían tan graves los resultados contrarios a lo que estamos acostumbrados que merece la pena una llamada de atención. Sin mencionar, claro, que la noticia va más bien sobre lo que opina el CEO de Blackrock y otros analistas sobre el impacto potencial en el Bitcoin que sobre el tema subyacente.Uno de los principios básicos de la teoría de juegos es que cada participante decide por propia voluntad el valor que asigna a las recompensas, así pues si le diéramos a 100 personas a elegir entre un millón de dólares y un vaso de agua esperaríamos que todos eligieran el millón de dólares, después de todo con ese dinero se puede comprar mucha agua, sin embargo hay circunstancias en las cuales una persona podría elegir el vaso de agua sobre el dinero, como por ejemplo estar perdido en el desierto sin nada para beber.Esto quiere decir que en teoría siempre existe la posibilidad de que un partido decida que todo explote en vez de llegar a un acuerdo, porque esto es lo que mas les conviene, un escenario poco probable al momento pero que podría ocurrir en el futuro.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hispo",
      "created_time": "June 08, 2023, 08:03:58 PM",
      "body": "Quote from: Silberman on June 07, 2023, 09:06:25 PMQuote from: Filicius on June 07, 2023, 04:16:28 PMParipé o no, en la teoría de juegos no siempre los jugadores eligen la decisión que más les beneficia en conjunto, por lo que el riesgo es real, aunque te doy la razón Don Pedro Dinero que la probabilidad debe ser muy baja.Personalmente me molestan mucho más otras noticias sensacionalistas, que se pueden tirar semanas hablando de un accidente de un niño en una piscina y nadie le devolverá la vida a ese niño, pero ahí están, explotando la noticia repetitivamente. No me parece que sea el caso pues, aunque el contexto en el que se desarrolla la noticia del OP sí que se repite periódicamente, serían tan graves los resultados contrarios a lo que estamos acostumbrados que merece la pena una llamada de atención. Sin mencionar, claro, que la noticia va más bien sobre lo que opina el CEO de Blackrock y otros analistas sobre el impacto potencial en el Bitcoin que sobre el tema subyacente.Uno de los principios básicos de la teoría de juegos es que cada participante decide por propia voluntad el valor que asigna a las recompensas, así pues si le diéramos a 100 personas a elegir entre un millón de dólares y un vaso de agua esperaríamos que todos eligieran el millón de dólares, después de todo con ese dinero se puede comprar mucha agua, sin embargo hay circunstancias en las cuales una persona podría elegir el vaso de agua sobre el dinero, como por ejemplo estar perdido en el desierto sin nada para beber.Esto quiere decir que en teoría siempre existe la posibilidad de que un partido decida que todo explote en vez de llegar a un acuerdo, porque esto es lo que mas les conviene, un escenario poco probable al momento pero que podría ocurrir en el futuro.Solo la existencia de esa mínima probabilidad futura es algo que me turbaria lo suficiente siendo yo un residenciado en los Estados Unidos o alguien con la suficiente exposición a las acciones de compañías Estado Unidenses. Cómo lo he dicho antes, los tiempos políticos que corren son bastante extraños y hay entre las filas del partido del Elefante un par de personas de renombre que no los importaría inflingir un daño considerable a las personas de a pie, solamente porque el presidente de turno es azul y no rojo. Veremos si algún día los encargados del poder en Washington ajustan sus prioridades y empiezan a hacer planes concretos para reducir el deficit lo más que puedan.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Filicius",
      "created_time": "June 15, 2023, 08:06:20 PM",
      "body": "Quote from: Hispo on June 08, 2023, 08:03:58 PMQuote from: Silberman on June 07, 2023, 09:06:25 PMQuote from: Filicius on June 07, 2023, 04:16:28 PMEsto quiere decir que en teoría siempre existe la posibilidad de que un partido decida que todo explote en vez de llegar a un acuerdo, porque esto es lo que mas les conviene, un escenario poco probable al momento pero que podría ocurrir en el futuro.Solo la existencia de esa mínima probabilidad futura es algo que me turbaria lo suficiente siendo yo un residenciado en los Estados Unidos o alguien con la suficiente exposición a las acciones de compañías Estado Unidenses. Cómo lo he dicho antes, los tiempos políticos que corren son bastante extraños y hay entre las filas del partido del Elefante un par de personas de renombre que no los importaría inflingir un daño considerable a las personas de a pie, solamente porque el presidente de turno es azul y no rojo. Veremos si algún día los encargados del poder en Washington ajustan sus prioridades y empiezan a hacer planes concretos para reducir el deficit lo más que puedan. Y es por ello la existencia de la noticia: por la mínima probabilidad.Está demostrado que nos pone muy nerviosos que algo pase de ser imposible a ser posible pero tremendamente improbable, y hay muchos que se han enterado hace tiempo y hacen negocio de ello, desde los descuentos bancarios hasta los seguros contra incendios o las alarmas antirrobo, y sí, también los grandísimos fondos de inversión y la prensa escrita por lo que se ve.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hispo",
      "created_time": "June 16, 2023, 10:14:42 AM",
      "body": "Quote from: Filicius on June 15, 2023, 08:06:20 PMQuote from: Hispo on June 08, 2023, 08:03:58 PMQuote from: Silberman on June 07, 2023, 09:06:25 PMQuote from: Filicius on June 07, 2023, 04:16:28 PMEsto quiere decir que en teoría siempre existe la posibilidad de que un partido decida que todo explote en vez de llegar a un acuerdo, porque esto es lo que mas les conviene, un escenario poco probable al momento pero que podría ocurrir en el futuro.Solo la existencia de esa mínima probabilidad futura es algo que me turbaria lo suficiente siendo yo un residenciado en los Estados Unidos o alguien con la suficiente exposición a las acciones de compañías Estado Unidenses. Cómo lo he dicho antes, los tiempos políticos que corren son bastante extraños y hay entre las filas del partido del Elefante un par de personas de renombre que no los importaría inflingir un daño considerable a las personas de a pie, solamente porque el presidente de turno es azul y no rojo. Veremos si algún día los encargados del poder en Washington ajustan sus prioridades y empiezan a hacer planes concretos para reducir el deficit lo más que puedan. Y es por ello la existencia de la noticia: por la mínima probabilidad.Está demostrado que nos pone muy nerviosos que algo pase de ser imposible a ser posible pero tremendamente improbable, y hay muchos que se han enterado hace tiempo y hacen negocio de ello, desde los descuentos bancarios hasta los seguros contra incendios o las alarmas antirrobo, y sí, también los grandísimos fondos de inversión y la prensa escrita por lo que se ve.Si. Y es que si al demócrata o al republicano promedio del año 2008 le hubieses dicho que efectivamente Donald Trump llegaría a ser presidente, utilizando un muro con México (que el propio México pagaría) cómo principal móvil de campaña y además de eso les mencionas la llamada telefónica de Trump precionando al secretario de Estado de Georgia para que le consiga 11000 votos. Creo que ellos te tacharían de loco o de una imaginación muy hiperactiva. Y eso que no estoy añadiendo las declaraciones previas de la senadora Taylor Green, sobre los falsos tiroteos escolares y los lasers espaciales secretos para causar incendios en los bosques de Norteamérica. Haciendo una extrapolación a lo que puede pasar en el futuro, un default no suena tan descabellado, ¿Que me dices?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}