{
  "id": "topic_5453380",
  "title": "DubemIfedigbo001",
  "author": "DubemIfedigbo001",
  "created_time": "May 20, 2023, 05:35:36 AM",
  "content": "HELLO FELLOW FOOTBALL LOVERSI'm super convinced that the champions league winners are very much more than obvious judging from Manchester city's outstanding display against Real Madrid. to me, that was the champions league finals. The real match is just a mere formality, but this not in any way to undermine Inter-Milan team. Wayne Rooney accurately Predicted the results of the match and I quote \"Manchester city will not only win Real Madrid, but they will blow them away\". and it happened straight up and can never be attributed to luck.These guys are in great form and I'm casting my bet totally in their favour. please refer me to any legit beting platform that accepts btcBTC for football betting . They've had a great season and deserve that victory. I think betting on their CHAMPIONS LEAGUE victory is much like a semi-sure Bet .BETTING IN THEIR FAVOUR WOULD SURELY NOT BE A WRONG INVESTMENT , or what do you think?.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5453380",
  "comments": [
    {
      "author": "swogerino",
      "created_time": "May 20, 2023, 06:28:22 AM",
      "body": "Quote from: DubemIfedigbo001 on May 20, 2023, 05:35:36 AMHELLO FELLOW FOOTBALL LOVERSI'm super convinced that the champions league winners are very much more than obvious judging from Manchester city's outstanding display against Real Madrid. to me, that was the champions league finals. The real match is just a mere formality, but this not in any way to undermine Inter-Milan team. Wayne Rooney accurately Predicted the results of the match and I quote \"Manchester city will not only win Real Madrid, but they will blow them away\". and it happened straight up and can never be attributed to luck.These guys are in great form and I'm casting my bet totally in their favour. please refer me to any legit beting platform that accepts btcBTC for football betting . They've had a great season and deserve that victory. I think betting on their CHAMPIONS LEAGUE victory is much like a semi-sure Bet .BETTING IN THEIR FAVOUR WOULD SURELY NOT BE A WRONG INVESTMENT , or what do you think?.There are a lot of legit platforms that accept Bitcoin and other crypto as a form of payment,just go to the Gambling section of this forum and read the ANN threads of the reputable casinos like Stake etc and choose one of them.Keep in mind though that the odd of City is really low at 1.40 and I don't think this is a normal odd for a final game of the Champions League level.I know that Manchester City completely destroyed Real Madrid but I think Inter is a more tactical team compared to them that will defend and counter attack so anything can happen and nothing is sure in football otherwise we would not have bookmakers around us,they would have all failed if it was 100% sure results.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cantsay",
      "created_time": "May 20, 2023, 06:45:33 AM",
      "body": "I always keep my mind open for new possibilities,  I don't just go with the fact that since a team played well and won their last game well or all other games they have took part in then they're sure to win their next opponent, sometimes we can have an upset and the team we least expected to come out victorious might turn out to be the champion. Although,  in this case I don't think will happen but let's see what's going to happen we still have few days to make more analysis on the game for proper predictions. As for the casino you spoke of here's a few list for you to go through and select the one that best suits your taste.  List of Casinos and Sportbooks to Avoid(Table) Withdrawal Fees and Withdrawal Amounts on Crypto Casinos(LIST) Gambling sites with internal exchangeInformation of Crypto Casinos License and KYC requirements",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "slapper",
      "created_time": "May 20, 2023, 11:36:16 AM",
      "body": "Gotta love your conviction, but don't you think it's a bit like counting your chickens before they've hatched? Damn, Manchester City did an outstanding job against Real Madrid, but isn't football the sport where miracles happen? Isn't that what makes it so thrilling?Rooney was right this time, but remember that even the greats of the game can't predict the future. Who saw Liverpool's comeback against Barcelona coming in 2019?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rahmad2nd",
      "created_time": "May 20, 2023, 08:35:21 PM",
      "body": "We have the casino you need, you can search for it according to the criteria you want. Instead, you start exploring and reading the available ANN threads. there are many casinos that we have that are reputable, you can even refer based on the signature campaign of the members in the community.Talk football, before you really get involved in it. you need to know, at least you have to have knowledge of football. also, the stakes. and I assume, you have very much understood it. referring to what you said, actually we don't always refer to famous figures who predict a match like Wayne Rooney said. in fact, we can also predict it according to the insight and knowledge we have. remember, that every prediction has the potential to miss. I mean, predictions are just conjectures and assumptions even though they are based on previous research. we usually call it, analysis.But what you need to know, in football we don't just talk based on data and statistics. but overall, it involves a bit of luck. well, talking about the final match later, in theory and statistics. City will crush Inter in the final, but in practice. anything can happen. remember in football, anything can happen.Apart from that, you should also check the available odds. the odds given by the bookies to City are @1.42. at least, for now. question, is it relevant for you to invest in City. if yes, every choice is yours.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Chikito",
      "created_time": "May 21, 2023, 01:02:38 AM",
      "body": "Quote from: DubemIfedigbo001 on May 20, 2023, 05:35:36 AM or what do you think?.The only one-man key who can bring Manchester to get the title for the 1st time is Pep Guardiola. because he is quite experienced in the Champions League where he will give the squad a fighting spirit, because when we talk about club, Manchester City does not have enough experience with the finals, They only had once in 2020/2021 and lost. While Inter has the 3rd title and 6th the final, and what makes Inter play loose without load this time because has a cheap squad, they don't have pressure like Manchester City with full of expensive players, and pressure from the owner which must get the title for the 1st time.And, I think we will get the surprise, and there is no harm to choose the underdog team. because there are always surprises in the Final.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "keyscore44",
      "created_time": "May 21, 2023, 10:22:06 AM",
      "body": "Quote from: Chikito on May 21, 2023, 01:02:38 AMQuote from: DubemIfedigbo001 on May 20, 2023, 05:35:36 AM or what do you think?.The only one-man key who can bring Manchester to get the title for the 1st time is Pep Guardiola. because he is quite experienced in the Champions League where he will give the squad a fighting spirit, because when we talk about club, Manchester City does not have enough experience with the finals, They only had once in 2020/2021 and lost. While Inter has the 3rd title and 6th the final, and what makes Inter play loose without load this time because has a cheap squad, they don't have pressure like Manchester City with full of expensive players, and pressure from the owner which must get the title for the 1st time.And, I think we will get the surprise, and there is no harm to choose the underdog team. because there are always surprises in the Final.Manchester City has 99% chance of securing the Champions League title. Because this team has been able to easily defeat teams like Real Madrid. As such, it will not be too difficult for Manchester City to defeat Inter Milan. Still, since this is the final, it would be wrong for Manchester City to think of Inter Milan as a weak opponent.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tusandii",
      "created_time": "May 21, 2023, 01:41:14 PM",
      "body": "Quote from: keyscore44 on May 21, 2023, 10:22:06 AMManchester City has 99% chance of securing the Champions League title. Because this team has been able to easily defeat teams like Real Madrid. As such, it will not be too difficult for Manchester City to defeat Inter Milan. Still, since this is the final, it would be wrong for Manchester City to think of Inter Milan as a weak opponent.If everything works Manchester City will have 2 trophies with 2 titles at once this season.Manchester City have performed very well this season and they have managed to become the only strongest team in the Premier League and defeat a dangerous team in the Champions League, Real Madrid.The Manchester City vs Inter Milan final is still on June 11, so Manchester City can still prepare everything to play well and beat Inter Milan.I still believe in the Champions League this season Manchester City will win.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cryptomultiplier",
      "created_time": "May 21, 2023, 01:48:20 PM",
      "body": "Manchester city from the beginning of the season till now has shown class and have differentiated from the boys in the leagues. This seasons best performing team and best player award should go to them in majority because from the manager to the strikers to defenders, to mid fielders, the excellence just couldn't hide itself. They got good chances of beating inter Milan and am sure about it, because their style of play and speed of finding the back of net is one experience Milan don't have in their league or squad.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "alastantiger",
      "created_time": "May 21, 2023, 02:10:10 PM",
      "body": "Quote from: DubemIfedigbo001 on May 20, 2023, 05:35:36 AMHELLO FELLOW FOOTBALL LOVERSI'm super convinced that the champions league winners are very much more than obvious judging from Manchester city's outstanding display against Real Madrid. to me, that was the champions league finals. The real match is just a mere formality, but this not in any way to undermine Inter-Milan team. Wayne Rooney accurately Predicted the results of the match and I quote \"Manchester city will not only win Real Madrid, but they will blow them away\". and it happened straight up and can never be attributed to luck.I believe that in these semifinals, Real Madrid faced the harsh reality. In my opinion, they were very lucky in the previous stages: in the group stage, they had fairly manageable opponents: Leipzig , Shakhtar, and Celtic. In the Round of 16, they faced a declining Liverpool, from which they took advantage by a wide margin. In the quarterfinals, they defeated Chelsea, which was also in decline. And now, in the semifinals, they faced Manchester City, which was the first real challenge in this Champions League. It was a tough nut to crack, and as we already know, they couldn't overcome it.I think that Real Madrid were padded through out the whole tournament until they faced Manchester City and buckled. I mean that they were very lucky in the previous stages: in the group stage, they had fairly manageable opponents: Leipzig which to me was the most competitive one, Shakhtar, and Celtic. In the Round of 16, they faced a declining Liverpool, from which they took advantage by a wide margin. In the quarterfinals, they defeated Chelsea, which was also in decline. Their real challenge in the tournament was Manchester City. They buckled. On the other hand, if underestimate Inter, that it their first and costly mistake. I know why Ronney already picked Manchester City to win because they are always seen as the trendy club due to Guardiola's boutique-style football, but it takes more than just pleasing the audience with attractive play to become the champion of the Champions League.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "shinratensei_",
      "created_time": "May 21, 2023, 02:24:56 PM",
      "body": "I just try to take care from the history between pep against intermilan. Pep was losing against intermilan when he was coaching prime barcelona. That proves that if pep's prime club could still be beaten. This time may be different with the last meeting. I know that if mostly of people will be picking manchester city instead of intermilan but by saying if the champion league winner is more like obvious and that means if you were also indirectly underestimating intermilan. Intermilan may not be coached by jose mourinho but simeone inzaghi may also able to adapt it too. I remind you that if intermilan is also having big striker like lukaku. He can compete with walker as CB from manchester city. I don't even feel doubt about that. It's still half half for inter vs city.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitzizzix",
      "created_time": "May 21, 2023, 02:27:42 PM",
      "body": "If you look at the results of the matches and the quality of the players from the two teams in all competitions, in my opinion Manchester City is superior on paper and is also the favorite to win the Champions League compared to Inter Milan this season.and this will be a serious challenge for Inter Milan against Manchester City who have just won the Premier League this season and are a scary team for any opponent because Manchester City have players from all lines with a complete package and very good quality, but anything can happen because in this final the coach has an important role in creating good strategies and tactics to beat him, even though the opposing team is stronger.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rdluffy",
      "created_time": "May 21, 2023, 02:29:18 PM",
      "body": "Never underestimate an opponent, even more so in football it is never 100%, many things can happen.Although I also think that Manchester City is favorite, for having a better team, an excellent coach who is able to set up the team according to each opponent, and having Haaland who can decide matches, besides the players who make a difference, like De Bruyne, Bernardo Silva etc., it is never a 100% guarantee that they will win.Inter's team has also defeated difficult opponents and is also in the same final as City's, they have won the Champions League 3 times, qualified ahead of Barcelona in the group stage and eliminated Porto, Benfica and Milan.If they can score a goal and then play defensively, it could be difficult for City.Check the odds of Man. City vs InterSourceI use Duelbits to place my bets.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}