{
  "id": "topic_5443962",
  "title": "collinscoinz",
  "author": "collinscoinz",
  "created_time": "March 08, 2023, 07:26:45 AM",
  "content": "Honestly i sat down and observed what people and soceity are saying about drugs,that is hamful.And the way is abused in this age,now we all get high in my view either by fire or drink.now what is this stimulus feelings that poop up on the system,that enables some people to enhances their reasoning,is that one a nice advantage.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5443962",
  "comments": [
    {
      "author": "Frankolala",
      "created_time": "March 08, 2023, 07:22:46 PM",
      "body": "Actually this depends on the drug user,some people uses drug to make them think faster and more active in carrying out their duties or commitment. Some persons uses drugs to relax and relief themselves from stress after the day's work.On the other hand some people uses drug to motivate the evil act in them when they wants to go into action so that they wouldn't care about whoever comes across their way. The abuse of drug is where the problem lies,too much of everything is bad because drug abuse has so many side effect .",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DeathAngel",
      "created_time": "March 08, 2023, 07:37:05 PM",
      "body": "I can’t recommend anybody to take drugs, addiction can cause devastating effects. Lots of people experiment with drugs when they’re young & if you are the type of person who is strong minded & can leave something after trying it a small number of times then why not, you are only young once.Addiction destroys lives & families though so if you’re not really strong mentally then I would advise against trying anything even once. Some of the greatest & most respected minds in history took class A drugs, like I said though I can’t advise you to do anything. A bit like one of the big rules in crypto, Do Your Own Research.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zlantann",
      "created_time": "March 08, 2023, 09:27:48 PM",
      "body": "Quote from: collinscoinz on March 08, 2023, 07:26:45 AMHonestly i sat down and observed what people and soceity are saying about drugs,that is hamful.And the way is abused in this age,now we all get high in my view either by fire or drink.now what is this stimulus feelings that poop up on the system,that enables some people to enhances their reasoning,is that one a nice advantage.I will not also support anyone to ever use drugs. Drug abuse could lead to social and financial problems. Some person take drugs and lose concentration and attention which might lead to job loss. It could also lead to accident because of lack of coordination and concentration. But I have always been a supporter of moderate use of Indian hemp. The reason why more harmful drugs are been invented is because of the criminalization of hemp. There is no difference between alcohol and Indian hemp.Indian hemp is medicinal and it has some benefits that could be an advantage to the users. But like I earlier stated, addiction could be devastating.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JeromeTash",
      "created_time": "March 10, 2023, 09:33:04 PM",
      "body": "The misinformation in this thread is quite alarming  You guys, do you even know what a drug is? Or you think that only cocaine or marijuana are drugs?Here, let me help you;Quotenouna medicine or other substance which has a physiological effect when ingested or otherwise introduced into the body.Source - https://languages.oup.com/google-dictionary-en/So whether you want it or not, we all take drugs one way or the other and obviously most drugs are also advantageous in fighting disease, including marijuana extracts.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "speedy963",
      "created_time": "March 11, 2023, 08:03:58 PM",
      "body": "This is why there are different classification of drugs such as stimulant and downers. That depends on what the user is using, coz some are using it not to abuse it and not also for medication but sometimes to boost whatever their body needs.There are people who are using stimulants to boost their energy while taking an exam, due to cramming and stress their body is already showing signs that it's about to rest but they are feeding/sustaining the energy needed to finish the task.While there're also people who're using downers to relieve stress and relax. To let their nerves calm down and take a restOne of the reasons why research shows that they didn't get addicted the drugs but the benefit or feeling they got from the drug or often times called abusive drugs.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Alphakilo",
      "created_time": "March 13, 2023, 01:05:31 PM",
      "body": "The only advantage i see i  drugs or the advantage drugs has on human is the possitive effect of the reason it was taken for. For instance,  someone who is suffering from malaria will be pescribed a malaria drugs from the physician and then he will take it accordingly. I have seen people that took drugs just because they want to get high. Some take over dose of it which is bad. People abuse drugs by not taking it according to the prescription and it is harmful to the body.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zlantann",
      "created_time": "March 13, 2023, 02:10:09 PM",
      "body": "Quote from: JeromeTash on March 10, 2023, 09:33:04 PMThe misinformation in this thread is quite alarming  You guys, do you even know what a drug is? Or you think that only cocaine or marijuana are drugs?Here, let me help you;Quotenouna medicine or other substance which has a physiological effect when ingested or otherwise introduced into the body.Source - https://languages.oup.com/google-dictionary-en/So whether you want it or not, we all take drugs one way or the other and obviously most drugs are also advantageous in fighting disease, including marijuana extracts.If you read the OP's post carefully you will discover that he is referring to drugs like cocaine or marijuana. He talked about getting high and improving performance. You are correct, everyone that uses medical medicine is indeed exposed to hard drug extract. I have also closely observed that some renowned singers and songwriters use drugs. Like in my country, the majority of well-known musicians in my country smoke marijuana. I hear people say it gives inspiration and improve performance. Is this true?  I am not promoting the use of drugs because of their addictive and health implications.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ebede",
      "created_time": "March 13, 2023, 03:13:46 PM",
      "body": "Quote from: collinscoinz on March 08, 2023, 07:26:45 AMHonestly i sat down and observed what people and soceity are saying about drugs,that is hamful.And the way is abused in this age,now we all get high in my view either by fire or drink.now what is this stimulus feelings that poop up on the system,that enables some people to enhances their reasoning,is that one a nice advantage.Youths is abusing drugs because they don't know the effect for now. Drugs has changed some youths behavior and also make some people to be mad, so i can't believe people of our days still have interest on drugs, because for the local communities many guys has run mad because drugs and some communities youths now drugs has become talk of town, so it's only their old age they will understand the implication.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Queentoshi",
      "created_time": "March 13, 2023, 07:18:47 PM",
      "body": "Quote from: collinscoinz on March 08, 2023, 07:26:45 AMHonestly i sat down and observed what people and soceity are saying about drugs,that is hamful.And the way is abused in this age,now we all get high in my view either by fire or drink.now what is this stimulus feelings that poop up on the system,that enables some people to enhance their reasoning,is that one a nice advantage.There are legal and illegal drugs. One is approved for use by the government, others declared illegal due to the proneness for them to be abused. Legal drugs can also be abused and then they become bad. Some illegal drugs have benefits, and the government sometimes allow use in recommended and restricted cases. For instance, Tramadol that is a good painkiller, but because of how it is being abused has been declared illegal when not recommended, another example is Rohypnol that has benefits but because of abuse has been declared illegal.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Newlifebtc",
      "created_time": "March 13, 2023, 09:14:36 PM",
      "body": "Quote from: collinscoinz on March 08, 2023, 07:26:45 AMHonestly i sat down and observed what people and soceity are saying about drugs,that is hamful.And the way is abused in this age,now we all get high in my view either by fire or drink.now what is this stimulus feelings that poop up on the system,that enables some people to enhances their reasoning,is that one a nice advantage.People in the society misuse drugs and I believe that only that measure alone is what is making some people to be thinking abnormal in their cycle because of drugs misuse of drugs abuse in society I think the government have to look into it to put a threat on the people who misuse drugs or who abuse drugs in their side especially the news in the country do abuse drugs so we don't know the outcome or why they exist trust for the main time",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CODE200",
      "created_time": "March 16, 2023, 03:27:17 PM",
      "body": "Quote from: Queentoshi on March 13, 2023, 07:18:47 PMQuote from: collinscoinz on March 08, 2023, 07:26:45 AMHonestly i sat down and observed what people and soceity are saying about drugs,that is hamful.And the way is abused in this age,now we all get high in my view either by fire or drink.now what is this stimulus feelings that poop up on the system,that enables some people to enhance their reasoning,is that one a nice advantage.There are legal and illegal drugs. One is approved for use by the government, others declared illegal due to the proneness for them to be abused. Legal drugs can also be abused and then they become bad. Some illegal drugs have benefits, and the government sometimes allow use in recommended and restricted cases. For instance, Tramadol that is a good painkiller, but because of how it is being abused has been declared illegal when not recommended, another example is Rohypnol that has benefits but because of abuse has been declared illegal. I know that some drugs are like medicine to some particular disease. Legal Drugs are those that is being used to cure pain and disease, and illegal drugs are those that makes people go crazy and do bad things. In my opinion, Drugs is good if people just know how to limit themselves, it will not lead to any bad action if they will just take light of it, but ones they start abusing it, that is where violence come in, how do I say so, its because its affects their body and mind, where they loses it to the point that they dont know if they are still doing right or wrong. They got high due to its effect. Most criminal in my country getting tested as a positive on using drugs and thats the reason why they got in to jail. They cant control themselves anymore once the drugs hit their system. Its one of many reason why government doesnt legalized it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Comingdown",
      "created_time": "March 16, 2023, 04:17:33 PM",
      "body": "Quote from: speedy963 on March 11, 2023, 08:03:58 PMThis is why there are different classification of drugs such as stimulant and downers. That depends on what the user is using, coz some are using it not to abuse it and not also for medication but sometimes to boost whatever their body needs.There are people who are using stimulants to boost their energy while taking an exam, due to cramming and stress their body is already showing signs that it's about to rest but they are feeding/sustaining the energy needed to finish the task.While there're also people who're using downers to relieve stress and relax. To let their nerves calm down and take a restOne of the reasons why research shows that they didn't get addicted the drugs but the benefit or feeling they got from the drug or often times called abusive drugs. I think that drugs has given advantages on humans but the way we use it causes it to be a disadvantage. Drugs used in medical field is a great example since it is a way to treat people but we should take note that doctors knows how much to prescribe on each person's case. This is where disadvantage comes in, people don't have any idea how these drugs would affect them yet they still use it without proper knowledge on the amount and effect of it. They often refer to those who have experience so in the end they would just misuse it and probably overdosed themselves. So the human behaviour is the main reason why these drugs have been illegal to use at most of the countries. And I think, it would always still be illegal since drug misuse is still high nowadays.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BADecker",
      "created_time": "March 16, 2023, 05:25:53 PM",
      "body": "Dose drugs have an advantage on human being.Maybe the OP really meant that people consider the 'dose' of the drugs that they are taking. He says 'dose' in the thread title. This might be important. All those poison drugs (mostly the medial ones) out there might be very beneficial if we took them in microscopic amounts. This is what homeopathy tries to do.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blockman",
      "created_time": "March 16, 2023, 10:03:38 PM",
      "body": "If a dose of the drug isn't recommended and suggested by your doctor, you shouldn't take it. Don't get advice from people that are not medical professionals. I've seen cases of too much does that they've taken drugs that weren't recommended and yet, they took the advice of nonmedical people and as result, they're the ones that suffered from taking doge of those unrecommended drugs. Use of it inappropriately does have side effects and even the correct usage of it so, it's more harmful if the use was inappropriate. Those reasonings that their takers are saying are just being said to justify their addiction on it, nothing less, nothing more.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Doan9269",
      "created_time": "March 17, 2023, 01:16:28 PM",
      "body": "Do you know that taking drugs is to cure us from any impeding illness in our body, taking overdose of it turn detrimental to is as well and a continuous intake of drugs is what turns a medical term often referred as drug addiction, which is a clear understanding that we need to apply moderacy in everything we do and must not allow taking too much of drugs becomes a habit in us because of the side effects, we can introduce diets and exercise as substitute for taking frequent drugs.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ChiBitCTy",
      "created_time": "March 17, 2023, 04:43:46 PM",
      "body": "Quote from: blockman on March 16, 2023, 10:03:38 PMIf a dose of the drug isn't recommended and suggested by your doctor, you shouldn't take it. Don't get advice from people that are not medical professionals. I've seen cases of too much does that they've taken drugs that weren't recommended and yet, they took the advice of nonmedical people and as result, they're the ones that suffered from taking doge of those unrecommended drugs. Use of it inappropriately does have side effects and even the correct usage of it so, it's more harmful if the use was inappropriate. Those reasonings that their takers are saying are just being said to justify their addiction on it, nothing less, nothing more.This is flat out wrong. Doctors are often biased, uneducated, scared due to potential legal ramifications for recommending some “drugs” etc.  Some doctors are flat out morons. My last two doctors are very pro-marijuana but my moms doctor is anti-marijuana because he’s uneducated and misinformed. This is why people often get opinions from multiple doctors.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yhiaali3",
      "created_time": "March 17, 2023, 05:10:08 PM",
      "body": "I do not see any good advantages in drugs other than their use in the medical field, otherwise they have very serious disadvantages for people and societies.Addiction to drugs makes people lose awareness of their surroundings and become out of this world, also when they get addicted they can do anything to get drugs that can sometimes reach the commission of murders.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DiMarxist",
      "created_time": "March 17, 2023, 07:34:26 PM",
      "body": "Drugs has good advantage, but people makes it more disadvantage, people will take drugs in a very legal way  to misbehave and nonsense thing, every particular drug cure a particular disease or sickness,you take the that particular drug what the doctor ask you to take or introduces for you, and if you take drugs more than what's the doctor ask you to take you take overdose and behave abnormal even the must hardest drug on earth has a for human to take if you take more than that limit,you might mad or die,even cocaine has advantage when you followed the instructions, it's will not be drugs abuse again  the same thing to weed, any hard drugs.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JeromeTash",
      "created_time": "March 17, 2023, 09:43:42 PM",
      "body": "Quote from: yhiaali3 on March 17, 2023, 05:10:08 PMI do not see any good advantages in drugs other than their use in the medical field, otherwise they have very serious disadvantages for people and societies.What other advantage would you want in drugs other than having a physiological effect on the body when administered to the body?You wanted them to give the body some magical powers/Cocaine and marijuana also have very good medicinal purposes.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}