{
  "id": "topic_5430393",
  "title": "Outhue",
  "author": "Outhue",
  "created_time": "December 20, 2022, 06:00:52 AM",
  "content": "It's looks like in every bear season crypto always gets a bad occurrence to be called a scam, this is why I still look at the whole bad situations that's happening as a planned attack, I am talking about FTX and co. The Politicians will try to ruin crypto and force KYC on every clean and unclean exchanges out there, this is a good opportunity for them to promote CBDC too because of this FTX fraud but I am here to tell you that FTX and Crypto are not the same things, FTX is a private company that did many bad things behind the curtain and Cryptocurrency is the most fascinating technology that humanity has ever emerge with.Don't get it confused.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5430393",
  "comments": [
    {
      "author": "_BlackStar",
      "created_time": "December 20, 2022, 06:42:23 AM",
      "body": "Quote from: Outhue on December 20, 2022, 06:00:52 AMThe Politicians will try to ruin crypto and force KYC on every clean and unclean exchanges out there,KYC was even introduced as a rule for centralized exchanges many years ago, and perhaps some additional rules will also be introduced in the future. So of course it's not just FTX and other project crashes in the industry.Quote from: Outhue on December 20, 2022, 06:00:52 AMthis is a good opportunity for them to promote CBDC too because of this FTX fraudIt's okay, maybe they will take advantage of the situation. Then what will they think, is the government brave enough to guarantee your funds are safe in its centralized system?Quote from: Outhue on December 20, 2022, 06:00:52 AMbut I am here to tell you that FTX and Crypto are not the same things, FTX is a private company that did many bad things behind the curtain and Cryptocurrency is the most fascinating technology that humanity has ever emerge with.Don't get it confused.Both are in the same industry, so what's the difference?Find something different than bitcoin, it's more interesting.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "December 20, 2022, 07:02:44 AM",
      "body": "Quote from: _BlackStar on December 20, 2022, 06:42:23 AMBoth are in the same industry, so what's the difference?Not because they're in the same industry doesn't automatically mean they're the same. The former is a totally custodial platform, while DeFi platforms are non-custodial.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EarnOnVictor",
      "created_time": "December 20, 2022, 08:17:48 AM",
      "body": "Quote from: Outhue on December 20, 2022, 06:00:52 AMIt's looks like in every bear season crypto always gets a bad occurrence to be called a scamThis is particularly not true, there have been many bearish events that nothing like scams was attached.Quote from: Outhue on December 20, 2022, 06:00:52 AMThe Politicians will try to ruin crypto and force KYC on every clean and unclean exchanges out thereThis is not about politicians, it's about government. If it's to be in terms of politics, they would even like crypto to be unregulated so that they can be getting their shady payments through it. No responsible government will not protect the lives and properties of their citizens, so I don't expect less.Quote from: Outhue on December 20, 2022, 06:00:52 AMthis is a good opportunity for them to promote CBDC too because of this FTX fraud but I am here to tell you that FTX and Crypto are not the same things, FTX is a private company that did many bad things behind the curtain and Cryptocurrency is the most fascinating technology that humanity has ever emerge with.FTX has messed up like the previous insolvent ones, but it's a centralized company, nothing can touch the truly decentralized BTC and other cryptos wallet, so the government will always have their limitations here. It's we that should be wise in our transactions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zlantann",
      "created_time": "December 20, 2022, 08:23:55 AM",
      "body": "Quote from: Outhue on December 20, 2022, 06:00:52 AMIt's looks like in every bear season crypto always gets a bad occurrence to be called a scam, this is why I still look at the whole bad situations that's happening as a planned attack, I am talking about FTX and co. I dont see the fall of FTX as a planned attack on the cryptocurrency industry, I might still be wrong. This challenge was caused by a bunch of CEOs   blinded by greed and strong desire to get more money and power. They lacked all forms of financial and risk management skills but they had access to people's hard-earned money. They made many costly financial blunder that brought down a once flourishing business.  Quote The Politicians will try to ruin crypto and force KYC on every clean and unclean exchanges out there, this is a good opportunity for them to promote CBDC too because of this FTX fraud but I am here to tell you that FTX and Crypto are not the same things, FTX is a private company that did many bad things behind the curtain and Cryptocurrency is the most fascinating technology that humanity has ever emerge with.Don't get it confused. Your enemy wants to see you fall and they would take advantage of any blunder you make to attack. The government would ensure they use FTX's fall to attack the entire industry. They would try to generalize the fall of FTX an use it as a means to promote their own agenda. There is a proverb in my area that states that if oil touches a finger, it will gradually affects other fingers. But I am very sure that Bitcoin would survive this attacks.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jossiel",
      "created_time": "December 20, 2022, 08:28:31 AM",
      "body": "Quote from: Outhue on December 20, 2022, 06:00:52 AMIt's looks like in every bear season crypto always gets a bad occurrence to be called a scam, this is why I still look at the whole bad situations that's happening as a planned attack, I am talking about FTX and co. The Politicians will try to ruin crypto and force KYC on every clean and unclean exchanges out there, this is a good opportunity for them to promote CBDC too because of this FTX fraud but I am here to tell you that FTX and Crypto are not the same things, FTX is a private company that did many bad things behind the curtain and Cryptocurrency is the most fascinating technology that humanity has ever emerge with.Don't get it confused. Yeah, there are many people that are confused about crypto related companies/exchanges and thinks that they're the actual crypto. And the same goes for blockchain. Little did these people know, it's quite vast and wide to think of its correlation. But other than that, anything that relates to the exchange hacking or exit scam, these no coiners think that the whole crypto matter is the scam.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Smack That Ace",
      "created_time": "December 20, 2022, 08:52:24 AM",
      "body": "Quote from: Outhue on December 20, 2022, 06:00:52 AMIt's looks like in every bear season crypto always gets a bad occurrence to be called a scam, this is why I still look at the whole bad situations that's happening as a planned attack, I am talking about FTX and co. That's what I think, if Luna and FTX don't crash to cause panic in the market, then I believe there will be another project or another exchange will crash, everything seems to be planned before, not by chance. If people pay attention, there is always something happening in every bear cycle that causes the market to go down. So I've never been surprised or scared by what's happening, and certainly as you say, the crash of FTX doesn't mean crypto will crash or people always assume that Binance will. They are entirely different.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "davis196",
      "created_time": "December 20, 2022, 11:03:55 AM",
      "body": "This is a Bitcoin/crypto forum, so I assume that most of the users must be familiar with the basic stuff surrounding the crypto world.Only total crypto newbies would think that Bitcoin/crypto is a scam, just because some random crypto company cheated it's investors and went bankrupt. It's same as saying that the US dollar is a scam, because a US bank went bankrupt.That's why I think that your forum thread title is totally wrong. The general public in the crypto world is completely aware of the fact that Bitcoin/crypto cannot be blamed for the FTX collapse. The scammers get what they deserve at the end of the day. Sam Bankman-Fried will end up in jail.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Frankolala",
      "created_time": "December 20, 2022, 11:43:16 AM",
      "body": "I don't think this is true that the politicians are part of the cause of the bearish market of bitcoin, if you look at the history of bitcoin it is always having a bear and bull run which makes it unique,so the politicians can't be involved in this bear market, its just that with government criticizing bitcoin since they are incapable to control the system and brought out CBDC makes you feel so.There is inflation and governments are giving more time to the war,causing hardship,which makes people not able to have more than enough to save. FTX crash is not the plan of any politician but that of greedy men who decided to steal peoples funds because they can.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Leviathan.007",
      "created_time": "December 20, 2022, 12:03:27 PM",
      "body": "Quote from: Outhue on December 20, 2022, 06:00:52 AMIt's looks like in every bear season crypto always gets a bad occurrence to be called a scam, this is why I still look at the whole bad situations that's happening as a planned attack, I am talking about FTX and co. You are right, but not completely. In every bear market, people will try to earn money and they're under pressure because of the market situation so they will trust the platform these platforms are under pressure because of the market situation, and that's why we will see more scams in a bear market. Quote from: Outhue on December 20, 2022, 06:00:52 AMThe Politicians will try to ruin crypto and force KYC on every clean and unclean exchanges out there, this is a good opportunity for them to promote CBDC too because of this FTX fraud but I am here to tell you that FTX and Crypto are not the same things, FTX is a private company that did many bad things behind the curtain and Cryptocurrency is the most fascinating technology that humanity has ever emerge with.Don't get it confused. Forcing people to pass KYC is just a part of the story, the politicians are surely against decentralization of the economy and that's why they will force people to pass KYC to have more control.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Eternad",
      "created_time": "December 20, 2022, 12:11:07 PM",
      "body": "Don’t get confused too, Some of part of the crypto market is really turning into scam and not just a FUD. There’s a lot of scam happening in the crypto market and FTX, Luna and others is really commit a fraud against there investors that cause the negative impact in the crypto market. The negative sentiment is not fake because it’s base on the real fall of a huge company that liquidating there crypto holdings on the market price.However Bitcoin shouldn’t be affected on this negative sentiment since it’s a different project which is why people need to understand to keep holding Bitcoin in time like this.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MArsland",
      "created_time": "December 20, 2022, 12:54:29 PM",
      "body": "Quote from: Outhue on December 20, 2022, 06:00:52 AMThe Politicians will try to ruin crypto and force KYC on every clean and unclean exchanges out there, this is a good opportunity for them to promote CBDC too because of this FTX fraud but I am here to tell you that FTX and Crypto are not the same things, FTX is a private company that did many bad things behind the curtain and Cryptocurrency is the most fascinating technology that humanity has ever emerge with.FTX is just one part in helping governments accelerate CBDC adoption. But is CBDC also able to fend off fraud where enforcing KYC also doesn't appear to require us to comply with requests. After all the biggest crypto holders will surely feel like their holdings are being watched, so the CBDC will just be a piece left out.I think the government will continue to use the FTX case as a reference, I mean because by bringing up the FTX issue they are able to scare off crypto users. This is where the government is weak in terms of finances, they focus on the policing sector, while the roots of the fraud itself are allowed to roam instead of obtaining a license to operate.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AicecreaME",
      "created_time": "December 20, 2022, 01:22:19 PM",
      "body": "Since Bitcoin started to become valuable, like its price booms up, some people find it a good way to scam people, because Bitcoin is a good bait or other potential cryptocurrency to lure people in, to invest their money on their \"company\" or to make their money triple in just 1 week or whatever. It's not new nowadays about cryptocurrency are being used on such things, after some time, it will dissipate. When it's bearish market, expect a lot of bad news about cryptocurrency and things that are related to it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "palle11",
      "created_time": "December 20, 2022, 03:59:16 PM",
      "body": "Quote from: Outhue on December 20, 2022, 06:00:52 AMIt's looks like in every bear season crypto always gets a bad occurrence to be called a scam, this is why I still look at the whole bad situations that's happening as a planned attack, I am talking about FTX and co. This does not look like a planned attack or one of such attack. It is a scam orchestrated by the FTX exchange manage who probably want to make unscrupulous money from the investment of genuine investors and he wasn't smart enough and the deeds he did in secret found way to meet him in the public. This is what happened and not that it was planned and it is not a way for politicians to sell CBDC down the throat of people. There is no similarity between CBDC and cryptocurrency exchange collapse.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Findingnemo",
      "created_time": "December 20, 2022, 04:10:48 PM",
      "body": "Quote from: Outhue on December 20, 2022, 06:00:52 AMIt's looks like in every bear season crypto always gets a bad occurrence to be called a scam, this is why I still look at the whole bad situations that's happening as a planned attack, I am talking about FTX and co. The Politicians will try to ruin crypto and force KYC on every clean and unclean exchanges out there, this is a good opportunity for them to promote CBDC too because of this FTX fraud but I am here to tell you that FTX and Crypto are not the same things, FTX is a private company that did many bad things behind the curtain and Cryptocurrency is the most fascinating technology that humanity has ever emerge with.Don't get it confused. FYI, KYC is already imposed on every centralized exchange we have but you can't say its completely bad and what you said is right they are company so what they will do is make money with their platform. Exchanges are supposed to be used for trading so if anyone understand that may not be worried if exchange scams or hacked because most of their cryptocurrency should be in their custody not with exchange's.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "noorman0",
      "created_time": "December 20, 2022, 04:19:31 PM",
      "body": "Quote from: Outhue on December 20, 2022, 06:00:52 AM-snip-this is a good opportunity for them to promote CBDC too because of this FTX fraud CBDCs are non-commercial so promotion is unnecessary, governments can make policies using CBDCs mandatory and ban conventional currencies outright if they want. The government also understands that crime will continue to occur in any financial system, including CBDCs, if people never increase their vigilance when using services.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rikafip",
      "created_time": "December 20, 2022, 04:29:01 PMLast edit: December 20, 2022, 05:19:16 PM by Rikafip",
      "body": "Quote from: Findingnemo on December 20, 2022, 04:10:48 PMFYI, KYC is already imposed on every centralized exchange we have but you can't say its completely bad and what you said is right they are company so what they will do is make money with their platform.Even though situation with KYC is getting worse as we speak, there are still some exchanges that can be used without need for going through KYC. Here is the list. Then again, they may ask for KYC at any point so unless you are willing to provide documents if asked (or ready to lose the money if you decline to do it), they should be avoided as well.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "electronicash",
      "created_time": "December 20, 2022, 04:29:13 PM",
      "body": "the cycle of bear and bull still happening and the worse issues we thought had happened already back in 2018 bear market. yet there are worse than worse to come. who knows what else will it be in 2026 bear market.and also FTX hearing makes the real issues disappear from public eye like border issues and the Ukraine-Russia war that is getting worse also. the news are all about FTX but the war was not on the headlines anymore.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Getmon",
      "created_time": "December 20, 2022, 04:33:15 PM",
      "body": "Do you know that Sam provided financial support for Joe Biden and his Democrat party in the US presidential election? Your theory is not true because Sam has a lot of politician friends. The events that took place on FTX were not the result of politicians attacking crypto. It was because of the illegal use of FTX deposits by Sam Bankman-Fried and the failures of the financial ventures it supported. The ideal time to promote CBDC is right now by persuading individuals with limited knowledge of the risks associated with cryptocurrencies.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gyfts",
      "created_time": "December 20, 2022, 05:33:33 PM",
      "body": "Quote from: Outhue on December 20, 2022, 06:00:52 AMThe Politicians will try to ruin crypto and force KYC on every clean and unclean exchanges out there, this is a good opportunity for them to promote CBDC too because of this FTX fraud but I am here to tell you that FTX and Crypto are not the same things, FTX is a private company that did many bad things behind the curtain and Cryptocurrency is the most fascinating technology that humanity has ever emerge with.Don't get it confused. CBDC's will be implemented independently of the FTX fiasco. Government realizes they have the perfect opportunity to regulate exchanges/crypto sector using FTX as the scapegoat, when the reality is FTX was a fraudulent organization ran by corrupt leaders. So, expect regulations to come out of this, not a launch of CBDC's.CBDC's will have the same problem FTX had, in a sense. Central authority and a reliance to trust the holder of your funds. I don't suppose it'd be prudent for the government to pitch to its citizens the same idea wrapped in a different package. Not now, at least.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}