{
  "id": "topic_5408355",
  "title": "Question:",
  "author": "redhack",
  "created_time": "August 01, 2022, 03:48:29 PM",
  "content": "Welcome to the non-self-moderated UEFA Champions League 2022/23 Season discussion thread.UEFA Champions League is the first cup of Europe.Real Madrid is the last winner of this cup.There are 80 teams total, 32 in group stage.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5408355",
  "comments": [
    {
      "author": "Pierre 2",
      "created_time": "August 01, 2022, 04:11:46 PM",
      "body": "After banning of Russian teams, order of teams going to Champions League changed. I don't expect huge surprises in qualifying rounds. Benfica will safely go next round. Monaco-PSV Eindhoven is little bit unlucky draw. At 4th round I think best team to look for is Trabzonspor, they are best performing Turkish team right now and may do surprise to go Group Stage.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LGD2Business",
      "created_time": "August 01, 2022, 04:12:44 PM",
      "body": "The 3rd qualifying round matches will start tomorrow. Benfica is the most secure match. Their opponents are very weak, not at their level. They need to score at least 3 goals against Midtjylland, and they are playing at home.Other match-ups look very balanced. Monaco - PSV Eindhoven will be particularly competitive. Union Saint-Gilloise - Rangers are open to any outcome. The Belgian team and the Scottish team are very close to each other. Rangers are better as a team, but the Belgian team has done well with low budgets.An interesting thing is that 5 German teams will take part this year. In addition to the teams that finished in the top 4 of the Bundesliga, Eintracht Frankfurt, which won the Europa League, will also play in the Champions League.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pmalek",
      "created_time": "August 01, 2022, 04:22:51 PM",
      "body": "It will be interesting to see if Sheriff manages to reach another Champions League group stage. Let's not forget they won against Real last season away from home. I think Rangers are the favorites in the double-header against Royale Union. Royale Union isn't even playing the match at their home turf, so it's like they have two away matches.   Ludogorets and Dinamo will be interesting. Dinamo is the slight favorite if you ask me.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ratash",
      "created_time": "August 01, 2022, 05:08:58 PM",
      "body": "Quote from: Pmalek on August 01, 2022, 04:22:51 PMIt will be interesting to see if Sheriff manages to reach another Champions League group stage. Let's not forget they won against Real last season away from home. I think Rangers are the favorites in the double-header against Royale Union. Royale Union isn't even playing the match at their home turf, so it's like they have two away matches.   Ludogorets and Dinamo will be interesting. Dinamo is the slight favorite if you ask me. Sheriff team was impressive last season but to be honest they were lucky to win against real madrid if you see the statistics but i think they can beat plzen i think they should be a slight favourite, all the matches are close its hard to predict except for benfica they seem to have an easier opponent but the odds are low i think i might take my chances and bet on rangers or sheriff.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Inwestour",
      "created_time": "August 01, 2022, 05:23:32 PM",
      "body": "Quote from: Pierre 2 on August 01, 2022, 04:11:46 PMAfter banning of Russian teams, order of teams going to Champions League changed. I don't expect huge surprises in qualifying rounds. Benfica will safely go next round. Monaco-PSV Eindhoven is little bit unlucky draw. At 4th round I think best team to look for is Trabzonspor, they are best performing Turkish team right now and may do surprise to go Group Stage.Benfica should beat Midtjylland without any problems, the Danes started the season poorly, they barely coped with Larnaca, and in the championship the results are not better, they can't handle Benfica. Monaco and PSV were the least fortunate, it will be a matchup of very strong teams at such an early stage and the departure from the Champions League of any of these teams will be a loss for the tournament, because the weaker teams will have a chance to advance to the group stage. It is somehow strange that such teams met in the qualification, most of the rest matches with weaker opponents, and if PSV and Monaco plat with these teams, they would definitely go to the group stage.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gencecikmen",
      "created_time": "August 01, 2022, 05:28:39 PM",
      "body": "There were UEFA Champions League 2nd Qualifying Round 2nd leg match last week. Fenerbahçe was eliminated from the UEFA Champions League. The only hope is for Trabzonspor to go Group Stage for Turkish fans. Also unluck was the draw for PSV and Monoca.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Unknown01",
      "created_time": "August 01, 2022, 09:18:26 PM",
      "body": "I have to say that I haven't actually liked PSG as a team so far because the harmony or the teamwork just never worked for me. But yesterday's game against Nantes was really great and the players played really well together. Maybe they are finally ready and will be a favorite for the CL too? Especially the new coach brings a lot of positive things!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LGD2Business",
      "created_time": "August 02, 2022, 03:05:03 PM",
      "body": "Trabzonspor's opponent in the Champions League was Copenhagen. This was definitely a match that Trabzonspor could pass. If they go to the Champions League, they will both make a significant contribution to the country's coefficient score and will be one of the rare Turkish teams to qualify. Of course, with the change in the format, a weaker competitor came, but at the same time, they couldn't go directly because Turkey's country coefficient score decreased. Even champions now have to play in the qualifiers.Despite all this, it's very important for a Turkish team to take part in this league. If Trabzonspor doesn't use this opportunity well, they will receive a great reaction, in a bad way. They should be aware of this.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zaki12",
      "created_time": "August 02, 2022, 05:21:37 PM",
      "body": "Quote from: LGD2Business on August 02, 2022, 03:05:03 PMTrabzonspor's opponent in the Champions League was Copenhagen. This was definitely a match that Trabzonspor could pass. If they go to the Champions League, they will both make a significant contribution to the country's coefficient score and will be one of the rare Turkish teams to qualify. Of course, with the change in the format, a weaker competitor came, but at the same time, they couldn't go directly because Turkey's country coefficient score decreased. Even champions now have to play in the qualifiers.Despite all this, it's very important for a Turkish team to take part in this league. If Trabzonspor doesn't use this opportunity well, they will receive a great reaction, in a bad way. They should be aware of this.Trabzonspor clinched the Turkish Super Lig title after a very successful season in which they collected 81 points and lost just three games.even so I think their opponents in the playoffs are not easy to beat, because they are face to face with Danish giants FC Copenhagen. I personally really hope Trabzonspor can win during the match later, because I see the Turkish League is now the most prestigious league in eastern Europe as the prestige of the Ukrainian, Greek and Russian leagues fades.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitcoinAccepted",
      "created_time": "August 02, 2022, 07:56:50 PM",
      "body": "Benfica is already leading 3-0 against Midtjylland at halftime. Benfica is not only a better team, but in this way it is no longer a competition. I expect it to be 6-0 or 7-0 rather than a draw. The return match in Denmark does not seem to matter anymore. The difference in level between the two teams is quite significant. Benfica did exceptionally well in the Champions League last year. I expect them to qualify for the group stage, but I don't know what the draw was today or yesterday for the next round.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mia_houston",
      "created_time": "August 02, 2022, 09:46:46 PM",
      "body": "Quote from: BitcoinAccepted on August 02, 2022, 07:56:50 PMBenfica is already leading 3-0 against Midtjylland at halftime. Benfica is not only a better team, but in this way it is no longer a competition. I expect it to be 6-0 or 7-0 rather than a draw. The return match in Denmark does not seem to matter anymore. The difference in level between the two teams is quite significant. Benfica did exceptionally well in the Champions League last year. I expect them to qualify for the group stage, but I don't know what the draw was today or yesterday for the next round.The results of today Qualifying first Leg  show that benfica are much stronger than Midtjylland, throughout the match Benfica continued to dominate and obviously it was not a balanced match,  win with score 4-1  makes benfica more comfortable to face Midtjylland in the second leg later and I think benfica looks like it will find an easy enough path to qualify for the playoffs, having almost 75% possession and 12 shots on target from 26 kicks, of course 4-1 is a pretty small winning score for benfica today, even when 3 goals came in first half, I also thought that benfica would end today match with a big enough score but unfortunately many good opportunities were wasted by benfica today.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ingiltere",
      "created_time": "August 03, 2022, 09:11:27 PM",
      "body": "We didn't see any surprise results in this qualifying round. Favorites won comfortably, Bodø/Glimt, Maccabi Haifa, Dynamo Kiev, Crvena Zvezda won their matches today and Benfica, Viktoria Plzen, Dinamo Zagreb won yesterday.For the similar match-ups Union Saint-Gilloise beat Rangers and took advantage. Monaco and PSV draw so PSV have home side advantage now. I didn't expect much surprises in this round but still I played safe. I try to stay away from balanced match-ups. Benfica handicap win and Dynamo Kiev win were no-brainer bets though.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Juggy777",
      "created_time": "August 04, 2022, 07:45:58 AM",
      "body": "Quote from: Unknown01 on August 01, 2022, 09:18:26 PMI have to say that I haven't actually liked PSG as a team so far because the harmony or the teamwork just never worked for me. But yesterday's game against Nantes was really great and the players played really well together. Maybe they are finally ready and will be a favorite for the CL too? Especially the new coach brings a lot of positive things!@Unknown01 if PSG fail once more then Neymar and Messi will be moved on, and both know that very few teams can afford their salaries hence they’ll be extra motivated this season to win the champions league. However they’ll have to constantly perform like they played against Nantes, but I have my doubts that they can play like this till the end of the season.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "1kodumtek7",
      "created_time": "August 04, 2022, 08:14:05 AM",
      "body": "This is another important season for PSG to reach the CL title. They have build a wonderful trio on the front with Neymar, Messi and Mbappe but still they haven't been able to win this title. It was related to Pochettino's vision as well I presume and we will see what Galtier will change in this team for achieving it. Galtier is actually a far more inexperienced manager and some of us still have doubts about him. I also have that to be honest but I'm still trying not to be prejudiced.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "boltz",
      "created_time": "August 04, 2022, 09:56:33 AM",
      "body": "Quote from: 1kodumtek7 on August 04, 2022, 08:14:05 AMThis is another important season for PSG to reach the CL title. They have build a wonderful trio on the front with Neymar, Messi and Mbappe but still they haven't been able to win this title. It was related to Pochettino's vision as well I presume and we will see what Galtier will change in this team for achieving it. Galtier is actually a far more inexperienced manager and some of us still have doubts about him. I also have that to be honest but I'm still trying not to be prejudiced.Yes they do but they same goes for all the other top tier clubs when it comes to UCL. I think City has the biggest chance this year as they always do but PSG is right next to them , followed by Real and Bayern. Hard to tell or guess who is going to win but City should have this one I think or it's an end of an era for them without winning UCL and I won't be sad as an United fan but as a football fan , they kinda deserve to win UCL but same goes for Juventus even if they don't have a great squad to fight for the UCL title.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GiftedMAN",
      "created_time": "August 04, 2022, 10:33:12 AM",
      "body": "Quote from: 1kodumtek7 on August 04, 2022, 08:14:05 AMThis is another important season for PSG to reach the CL title. They have build a wonderful trio on the front with Neymar, Messi and Mbappe but still they haven't been able to win this title. It was related to Pochettino's vision as well I presume and we will see what Galtier will change in this team for achieving it. Galtier is actually a far more inexperienced manager and some of us still have doubts about him. I also have that to be honest but I'm still trying not to be prejudiced.When you say the season is important for PSG, it sounds like they are the only team that needs it more but not so many teams need the Champions League and PSG is one of the teams. Juventus will battle this season to get to the final same as City who lost their dream of going to the final after a very good performance from them. So this season, I think PSG will do everything possible to get to the final or probably win the Champions League that's if they succeed in stopping other teams that are also looking forward to winning it.I believe you made a mistake by stating that the new PSG coach Galtier is inexperienced, you can edit your post and correct your mistake so that everyone who read through your write-up will not misquote you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tulusikhlas",
      "created_time": "August 04, 2022, 11:05:40 AM",
      "body": "Quote from: 1kodumtek7 on August 04, 2022, 08:14:05 AMThis is another important season for PSG to reach the CL title. They have build a wonderful trio on the front with Neymar, Messi and Mbappe but still they haven't been able to win this title. It was related to Pochettino's vision as well I presume and we will see what Galtier will change in this team for achieving it. Galtier is actually a far more inexperienced manager and some of us still have doubts about him. I also have that to be honest but I'm still trying not to be prejudiced.There is still a lot of work for Paris Saint Germain to be able to compete with other teams in the Champions League. Because other teams are doing the same thing to wade through the Champions League this season. Even some teams look better and more prepared than PSG for now. Honestly, I personally have a little doubt about Paris Saint Germain even though they have a capable squad.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ingiltere",
      "created_time": "August 04, 2022, 09:33:34 PM",
      "body": "Quote from: tulusikhlas on August 04, 2022, 11:05:40 AMThere is still a lot of work for Paris Saint Germain to be able to compete with other teams in the Champions League. Because other teams are doing the same thing to wade through the Champions League this season. Even some teams look better and more prepared than PSG for now. Honestly, I personally have a little doubt about Paris Saint Germain even though they have a capable squad.It's very hard to talk about Paris Saint-Germain's title chances right now as we are not even in group stage yet. Everything can be changed but the most important thing is the draw. If they get a lucky draw they can reach finals but if they draw like Real Madrid last season then I don't see much chance for them. You know Real Madrid passed Paris Saint-Germain, Chelsea, Manchester City and Liverpool and reached the trophy. Paris Saint-Germain couldn't survive in a draw like this. Besides Spanish and English teams dominate the competition, Paris Saint-Germain have light opponents in their local league and they don't get ready for bigger matches. I don't know if it's psychological, motivational problem but if they don't get ready mentally then they have no chance in this tournament.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "examplens",
      "created_time": "August 04, 2022, 09:44:03 PM",
      "body": "OP, redhack, maybe it would have been better if you had made this thread self-moderated to prevent unnecessary spam. previously opened similar threads ended up full of spam and mostly served to fill in the signature quote, no one would mind if the meaningless posts were removed.Back to the topic, I think I think this will be the year for the richest clubs (PSG or Man. City) to win the LS. I believe that they have gathered enough experience in previous yearsI'm also surprised that you don't give Bayern many chances to win, and it seems that they will be too strong this year.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}