{
  "id": "topic_5477580",
  "title": "shanz",
  "author": "shanz",
  "created_time": "December 12, 2023, 02:29:46 PMLast edit: December 12, 2023, 03:38:19 PM by shanz",
  "content": "¿Qué técnicas estás utilizando para predecir el precio y qué hilo de Bitcointalk es el mejor para aprender a operar? (en inglés)... ¿Alguna ayuda?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5477580",
  "comments": [
    {
      "author": "Drawesome",
      "created_time": "December 13, 2023, 06:38:15 AM",
      "body": "Quote from: shanz on December 12, 2023, 02:29:46 PM¿Qué técnicas estás utilizando para predecir el precio y qué hilo de Bitcointalk es el mejor para aprender a operar? (en inglés)... ¿Alguna ayuda?IMAO la única técnica es pensar en medio y largo plazo y el DCA (comprar una cantidad cada x tiempo e ir ahorrando minimizando la volatilidad). Si quieres operar en el mercado, compra acciones o invierte en fondos de inversión de quienes pueden realmente operar en el mercado (que no somos nosotros). Todas las técnicas de análisis que te cuenten no sirven más que para vender cursos o crear falsos profetas.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Don Pedro Dinero",
      "created_time": "December 13, 2023, 06:54:21 AM",
      "body": "Yo técnica tampoco utilizo aparte de mi experiencia siguiendo los mercados durante años. El del bitcoin y la bolsa también. Lo que pienso es que es bastante probable que en el próximo ciclo el precio traspase los 100.000$, y que el máximo se quede a medio camino entre esa cifra y los 200.000$. Aunque no descartaría un escenario más a la baja que ese, visto lo que ha pasado este ciclo. Escenarios más al alza prácticamente los descarto. Hace falta mucha pasta para mover el precio y la capitalización de mercado en estos niveles, no es como cuando el bitcoin valía céntimos.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DdmrDdmr",
      "created_time": "December 13, 2023, 08:04:21 AM",
      "body": "Uno diría que el tablero por excelencia sería el de Speculation en la parte inglesa del foro, el cual apenas visito, y por ende, no puedo redirigirte a hilos concretos. Le he echado un vistazo por encima y, a primera vista, me parece que hay que hacer un arduo ejercicio de selección para separar lo útil con perspectiva de ver la perspectiva del precio de bitcoin y cómo operar con él.Uno siempre puede darse de alta en alguna de las plataformas demo de trading para toda la información allí disponible a modo de ayudas, y probar su pericia sin gastar nada realmente. En el siguiente hilo (contenido borrado en Bitcointalk por su OP) podrás ver algunas de estas plataformas:https://ninjastic.space/post/57707179",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "famososMuertos",
      "created_time": "December 13, 2023, 03:21:42 PM",
      "body": "1:La primera pregunta es la que todos queremos conocer, pero incluso tiene sus variantes, pues predecir el precio tiene su vertiente(s) y es el tiempo o el cuándo. (Etc)Y en esa idea predecir, que está lleno de posibilidades y un acierto, el para cuándo lo necesitas en casos muy específicos cada segundo, cada minuto, cada hora, cada 24h, cada semana,cada mes,cada año y el más usado, cada Halving. Los menos despreocupados y dicen llamarse comerciantes, expertos hablan de décadas.Lo anterior es básico para iniciar el AT, que empieza por mirar la gráfica si o si, no importa a qué temporal o cuándo quieras ir, todas las predicciones inician, pasan o terminan en \"tener\" que mirar la gráfica.Luego cómo interpretar esa información, diría que es como tan simple como solo mirar y deducir o tan complejo como leer todos los libros de J. K. Rowling, y si hay dudas ver las películas, no una vez, cada vez que mires la gráfica, ya que a diferencia de esa historia, la del bitcoin se escribe cada segundo.2:La otra inquietud, si eres comerciante, estás en el sitio correcto, y hay lugares tan específicos para leer como el que mencionan, especulación, pero una noticia en el tablero de... Bitcoin discusión, por ejemplo, puede ser indicio de algo por venir...3:Aprender a leer el foro/ tablero.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Porfirii",
      "created_time": "December 13, 2023, 06:33:43 PM",
      "body": "Quote from: Drawesome on December 13, 2023, 06:38:15 AM-snip-Todas las técnicas de análisis que te cuenten no sirven más que para vender cursos o crear falsos profetas. Soy de la misma opinión que mi compañero Drawesome en lo que a TA respecta. Entiendo cómo una pseudociencia se vende como ciencia, y por qué la gente lo compra, pero seamos realistas y démonos cuenta de que ninguna técnica puede predecir lo que va a pasar mañana en los mercados, basándose meramente en lo que hizo ayer o haga hoy. O no, cada uno debería ser libre .Quote from: Don Pedro Dinero on December 13, 2023, 06:54:21 AMYo técnica tampoco utilizo aparte de mi experiencia siguiendo los mercados durante años. El del bitcoin y la bolsa también. Lo que pienso es que es bastante probable que en el próximo ciclo el precio traspase los 100.000$, y que el máximo se quede a medio camino entre esa cifra y los 200.000$. Aunque no descartaría un escenario más a la baja que ese, visto lo que ha pasado este ciclo. Escenarios más al alza prácticamente los descarto. Hace falta mucha pasta para mover el precio y la capitalización de mercado en estos niveles, no es como cuando el bitcoin valía céntimos.Yo también espero que la subida ronde las seis cifras, aunque cada vez tengo sentimientos más enfrentados. Por un lado, el último ciclo está siendo flojito, en parte por lo que comentas de la alta capitalización. Por otro lado, en cambio, recuerdo cómo en el último ciclo veníamos de un precio de 4.000€ que fue el mínimo en marzo de 2020 a causa de la pandemia (cerca de un añito antes del ATH), y eso no fue impedimento para que el precio se multiplicara por más de 15.Como decía más arriba, no deberíamos confiar en lo que ha pasado hasta ahora para creer a pies juntillas lo que se avecina, pero cuando se trata de mera especulación sí que creo en el valor de hacer vaticinios, por el simple placer de hacerlo.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "danadc",
      "created_time": "December 14, 2023, 11:33:03 PM",
      "body": "Yo cuando estoy buscando estrategias para hacer algo del trading,no me da ni me funciona nada,es como si tuviera dos piernas izquierdas,prefiero ver los articulos para poder saber que piensan los demas o los que se ven que saben mucho.Los que hacen análisis técnico ienen puntos de vista muy difernetes, y eso es algo que no cofnío, yo pienso que si hacen análisis técnico y son los análisis correctos deberían coincidir todos, y como esto del trading se refiere a  dar una prediccion de lso precios,movimentos, pues prefiero ver esas cosas y o que piensan en wall observer que cuando hacen predicciones creo que tienen mucha acertividad, ¿Cómo lo hacen? no sé, pero los análisis del movimiento del bitcoin es algo que se puede estruidiar mejor por ahi,y es bien divertido porque de un momento a otro hablan de otra cosa que está pasnado en el mundo,son cosas que derepente salen y se aprenden,veo mejor información aqui en el foro.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Drawesome",
      "created_time": "December 15, 2023, 12:11:17 AM",
      "body": "Quote from: danadc on December 14, 2023, 11:33:03 PM o que piensan en wall observer que cuando hacen predicciones creo que tienen mucha acertividad, ¿Cómo lo hacen? no sé, pero los análisis del movimiento del bitcoin es algo que se puede estruidiar mejor por ahi,y es bien divertido porque de un momento a otro hablan de otra cosa que está pasnado en el mundo,son cosas que derepente salen y se aprenden,veo mejor información aqui en el foro.¿Cómo hacen los que aciertan? Muy sencillo: tenemos miles de gurús prediciendo cada uno una cosa, por azar muchos acertarán incluso con rachas enormes. Pero por la falta de memoria de ese proceso estocástico, que hayan acertado n veces por azar no les da más probabilidad de acertar n+1 que cualquier otro. Si analizas el mercado como un sistema complejo, no existe un método de predicción universal por definición, ya que al usar ese método empezarás a arbitrarlo y se \"secaría\". Es imposible predecir el mercado, tan sólo es posible contar con más recursos que el resto:- Capacidad técnica para tener los datos y procesarlos antes que el resto (al alcance de casi nadie)- Capacidad de manejar la información. Conociendo información privilegiada y/o lanzando información relevante después de realizar tu operación- Directamente manipulando el mercado: si tienes y manejas un % muy grande de liquidez puedes crear precios artificiales y si además manejas la información eres un gorila quitando caramelos a los niños.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitmagister",
      "created_time": "December 23, 2023, 08:09:11 PM",
      "body": "Yo tengo cerca de 15 años estudiando los mercados, especialmente el Forex, donde me inicié, y a pesar del buen éxito con el que me mantuve antes de entrar de lleno al mundo cripto, y te puedo decir que el tema del análisis técnico es difícil de fundamentar como algo preciso y 100% fiable. Evidentemente, un mercado tan diferente y disruptivo como bitcoin está en un continuo descubrimiento de precios, soportes, resistencias y tendencias, por lo que la única forma en la que me permito confiar en su crecimiento futuro es la innegable caída a la que el sistema actual, tan insostenible, parece estarse dirigiendo día con día 🤷🏽‍♂️",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Silberman",
      "created_time": "December 23, 2023, 09:06:29 PM",
      "body": "Quote from: Porfirii on December 13, 2023, 06:33:43 PMQuote from: Drawesome on December 13, 2023, 06:38:15 AM-snip-Todas las técnicas de análisis que te cuenten no sirven más que para vender cursos o crear falsos profetas. Soy de la misma opinión que mi compañero Drawesome en lo que a TA respecta. Entiendo cómo una pseudociencia se vende como ciencia, y por qué la gente lo compra, pero seamos realistas y démonos cuenta de que ninguna técnica puede predecir lo que va a pasar mañana en los mercados, basándose meramente en lo que hizo ayer o haga hoy. O no, cada uno debería ser libre .Sin lugar a dudas puedo entender porque el TA es considerado una pseudociencia, después de todo la ciencia se basa en obtener los mismos resultados dadas las mismas circunstancias, cosa que no es posible en los mercados, porque a pesar de que las graficas puedan verse iguales, no hay dos días iguales, cada día es diferente al anterior no importando que tan similares puedan parecer.Habiendo dicho esto, he dedicado mucho tiempo al estudio del TA y hay algunas formas que de hecho funcionan, sin embargo, su numero es limitado, las estrategias que no funcionan son aquellas que son altamente subjetivas, como Elliot waves, análisis de velas, etc., y esto es porque sus defensores siempre pueden argumentar que en tal momento se le debió dar la interpretación opuesta a ciertos parámetros, convirtiendo a esos métodos, que desafortunadamente son los mas populares que puedes encontrar en libros y el internet, en lo mismo que una lectura de cartas del Tarot.¿Pero que es lo que funciona? Las estrategias que se conocen como mecánicas, estrategias que no dejan nada al azar, estrategias que basadas en una serie de parámetros y reglas te dicen cuando entrar al mercado, cuando salir, cuando cortar tus perdidas, el tamaño de tu posición, las perdidas que puedes obtener, las ganancias e incluso las probabilidades de que esto ocurra, pero como ya te imaginarás crear tal estrategia toma mucho tiempo y esfuerzo, porque hay que verificarla contra décadas de movimientos en muchos mercados distintos y muy pocas personas están dispuestas a hacer todo esto.Sin embargo, una de las cosas curiosas que pude verificar, es que a pesar de que las personas ponen un hincapié enorme en las señales de cuando comprar y cuando vender, la habilidad mas importante para un trader no es su habilidad de predecir los futuros movimientos de los mercados, sino su habilidad de manejar su dinero y evitar pérdidas catastróficas, así que alguien podría tener habilidades casi sobrenaturales para predecir los mercados, pero si no sabe como manejar su dinero y usa un apalancamiento de 10x o mas, te puedo garantizar que a la larga perderán todo su dinero.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Porfirii",
      "created_time": "December 24, 2023, 06:06:59 PM",
      "body": "Quote from: Silberman on December 23, 2023, 09:06:29 PM-snip-Sin embargo, una de las cosas curiosas que pude verificar, es que a pesar de que las personas ponen un hincapié enorme en las señales de cuando comprar y cuando vender, la habilidad mas importante para un trader no es su habilidad de predecir los futuros movimientos de los mercados, sino su habilidad de manejar su dinero y evitar pérdidas catastróficas, así que alguien podría tener habilidades casi sobrenaturales para predecir los mercados, pero si no sabe como manejar su dinero y usa un apalancamiento de 10x o mas, te puedo garantizar que a la larga perderán todo su dinero.Y eso quien tenga dicho superpoder, pero es que encima el común de los mortales no tenemos de eso. Demasiados factores en contra a la hora de hacer trading. Tienes razón en que sí que debe existir algún nicho, quizás en arbitraje? en el que con mucho esfuerzo pero sí es posible conseguir ganancias constantes, relativamente aseguradas. Pero no es el trading al que ninguno podemos aspirar desde nuestras casas.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "seoincorporation",
      "created_time": "December 25, 2023, 03:20:27 PM",
      "body": "Creo que predecir no es la palabra correcta, yo usaría estimar, o Adivinar.Y es algo que solo los que se dedican al traiding hace, no todos los usuarios aquí son traders, y la mayoría no trata de estimar el precio, la forma correcta es no gastar los bitcoins y esperar a que suban hasta que estemos conformes con el precio, ahí es donde los usuarios aprovechan para vender.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Andreesep",
      "created_time": "December 25, 2023, 06:18:59 PM",
      "body": "Depende que sea para ustedes una trayectoria \"futura\"En lo personal pienso que Bitcoin seguirá su curso alcista con el paso de los años, con sus respectivas correcciones. Para mí el trading no sirve, solo sirve acumular y esperar algunos años (2 halvings quizás)- Menos estrés- Menos riesgo y mejor rendimiento- Promediar la volatilidad con compras mensualesSaludos.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DdmrDdmr",
      "created_time": "December 26, 2023, 05:09:40 PM",
      "body": "Quote from: shanz on December 12, 2023, 02:29:46 PM<…>He leído acerca de una empresa ubicada en China llamada MicroAlgo Inc., y donde gran parte de su activo consiste en el desarrollo de algoritmos de diversa índole, ha hecho público hoy que ha desarrollado un algoritmo para la predicción del precio de bitcoin, combinando en su algoritmo predictivo técnicas de deep learning, análisis técnico, y estrategias cuantitativas de trading.El artículo (de autobombo) no indica no obstante cual es la ventana de predicción que tiene por objetivo (no es lo mismo intentar predecir el precio máximo/mínimo a lo largo de la jornada de mañana que el precio de mercado dentro de 1 hora, que dentro de 5 minutos), ni la bondad de los resultados.A su vez, si bien a buen seguro que tendrá su complejidad por las técnicas empleadas y los volúmenes de datos manejado, da la sensación de que es un complemento con base muy técnica, pero poco o nada se cita sobre la inclusión de fundamentales, sentimiento del mercado, noticias, acontecimientos en otros mercados, etc.Ver: https://www.prnewswire.com/news-releases/microalgo-inc-announced-bitcoin-trading-prediction-algorithm-based-on-machine-learning-and-technical-indicators-302022381.html",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}