{
  "id": "topic_5438616",
  "title": "CYBER_COWBOY",
  "author": "CYBER_COWBOY",
  "created_time": "February 07, 2023, 11:25:59 PMLast edit: June 10, 2023, 11:04:04 AM by CYBER_COWBOY",
  "content": "-already done-",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5438616",
  "comments": [
    {
      "author": "examplens",
      "created_time": "February 07, 2023, 11:37:45 PM",
      "body": "Quote from: CYBER_COWBOY on February 07, 2023, 11:25:59 PMHi. I need help to make a website that gonna be a gambling & sports forum.I pay with PayPal or BTC.If you need only a forum (like bitcointalk for example) you can probably do the basic installation yourself. Almost every hosting service has the possibility of automatic script installation, it only takes a few clicks and you don't forget the password you entered during the installation. and that is the easiest part of the job.later come complications during the maintenance of the functionality of the site, most often security. that's why you will need someone with such knowledge, but always available. Or to learn something about it yourself.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jackg",
      "created_time": "February 08, 2023, 05:03:43 AM",
      "body": "There are quite a few options you have for hosting a forum. One of the main ones is the software this forum uses called smf (or simple machines forum). There are a lot of other open source forums out there you can easily install and configure yourself (as they're designed to be used like that). As well as remembering your passwords as mentioned above, be sure to use ones that are hard to guess.There's also a lot of hosting providers that'll let you lease/run forum software from their servers and they'll maintain it for you too and fix bugs when the fixes become available from the developers. Typically speaking, if you spend about a day learning how to use the command line on Linux, you'll be able to set one up yourself really easily and can then get full control and customisation of it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GxSTxV",
      "created_time": "February 08, 2023, 02:38:21 PM",
      "body": "All you need is a hosting and a domain name if you don’t have one yet, namecheap for example offers  that and also accept cryptocurrencies doe payments, they may have a simple free forum with quick installation. Otherwise you can download any free forum script for example this one : codoforum.com all you have to do is download the script and install it on your host or CpanelIf you need help let me know and i will do for free since it’s simple",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Betfair23",
      "created_time": "February 08, 2023, 05:28:16 PM",
      "body": "I can help I have a friend who is programmer and I my self rknow about betting and all send me your contact thanks",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "shasan",
      "created_time": "February 09, 2023, 03:56:04 AM",
      "body": "Quote from: CYBER_COWBOY on February 07, 2023, 11:25:59 PMHi. I need help to make a website that gonna be a gambling & sports forum.I pay with PayPal or BTC.My budget is 300 USD so I dont need anything really really complicated.If you serious, and honest and have the aknowlegde and are in need of some fast money.Hit me up!Cheers.If you can do that yourself as mentioned in the above posts then that is perfect. But if you are unable to do that yourself then you are free to post such a project on freelancer.com I think you would be able to get a good freelancer who will be able to do the task lower than your budget.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fortunecrypto",
      "created_time": "February 09, 2023, 05:12:04 AM",
      "body": "Quote from: CYBER_COWBOY on February 07, 2023, 11:25:59 PMHi. I need help to make a website that gonna be a gambling & sports forum.I pay with PayPal or BTC.My budget is 300 USD so I dont need anything really really complicated.If you serious, and honest and have the aknowlegde and are in need of some fast money.Hit me up!Cheers.Actually, you can launch your own gambling and sports forum for as little as $50 that is right the figure is correct, but if you are going to hire people to launch and manage your forum that $300 will not go far, you've got to have a basic knowledge of how to manage your Cpanel So let's break it down domain: I'm talking about a not-so-popular domain it will cost you from $5 to $ 20 Namecheap is the best place to buy a domain because of its free privacy forever and you can top up your wallet with Bitcoin for renewing your domain and hostingWebhost : For easy linking your domain to your host I highly recommend https://www.namecheap.com/hosting/ since you are hosting one site for a start-up get Stellar Shared Hosting $22.88How to start:  sign up to Namecheap and buy a https://www.namecheap.com/domains/domain-name-search/ after buying your domain buy a one-year subscription to web hosting use the domain you bought from NamecheapAfter you bought your domain and your web host you can log in to your Cpanel through your Namecheap account or from the information they will send to your email from your Cpanel on your Cpanel you can link your domain and launch your script Please check the image I provided here this is what a Cpanel looks like there is a WordPress script, the SMF, the same script Bitcointalk is using If you plan to do it yourself do a follow-up post here and we can post a step-by-step installation here if you bought a domain you will need to wait 24 hours for propagation.To make things easy ask Namecheap support for a library link on how to run and manage a Cpanel, Namecheap support will even help you with the installation",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}