{
  "id": "topic_5461073",
  "title": "Crypt0Gore",
  "author": "Crypt0Gore",
  "created_time": "July 26, 2023, 07:28:43 AM",
  "content": "If you are aware that your neighbor living next door is into drug dealing and he come seek your advice how to buy Bitcoin, will you teach him? What comes straight to mind is embezzling the ill-gotten money, but is this even safe? My other neighbor knows I am into Bitcoin and he learned from me, I guess that's how this other neighbor knew, I told him to go meet the next neighbor but he said he is not ready to teach.What will you do if something like this is happening around you? Why would a drug dealer want to learn Bitcoin if not for a safer haven for running the business?My mind isn't settled as I keep thinking different things, what is on your mind readers?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5461073",
  "comments": [
    {
      "author": "EL MOHA",
      "created_time": "July 26, 2023, 07:34:26 AM",
      "body": "My question is, did you get concerned immediately about his dealings and felt he is doing a wrong thing immediately he asked to learn bitcoin. What made you sure that he wanted to learn bitcoin to aid his crime. He has been into the business long before without bitcoin knowledge and he wasn’t caught, so if you’re concerned about him doing something wrong then you can report him to the authorities for investigation.But this right here is like saying criminals use bitcoin and that is a wrong narrative spread around bitcoin. Also since he doesn’t know a thing about bitcoin I doubt he will know that it can be used to evade crime. Quote from: Crypt0Gore on July 26, 2023, 07:28:43 AMWhat will you do if something like this is happening around you? Why would a drug dealer want to learn Bitcoin if not for a safer haven for running the business?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Accardo",
      "created_time": "July 26, 2023, 07:45:27 AM",
      "body": "If you already told him, that you are not teaching, why is your mind not settled? In my mind, I see a person that is tired of running errands in drug business and wants another source of survival, looking at his curiosity in your description. You can't think of him as a person that needs btc as a slush fund, because if he is that big in the business like you want to portray him he would have boys that will do the bitcoin research for him. Hence, if he is serious send him the bitcoin white paper to read he won't bother you anymore.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Faisal2202",
      "created_time": "July 26, 2023, 07:46:04 AM",
      "body": "Quote from: Crypt0Gore on July 26, 2023, 07:28:43 AMIf you are aware that your neighbor living next door is into drug dealing and he come seek your advice how to buy Bitcoin, will you teach him? What comes straight to mind is embezzling the ill-gotten money, but is this even safe? My other neighbor knows I am into Bitcoin and he learned from me, I guess that's how this other neighbor knew, I told him to go meet the next neighbor but he said he is not ready to teach.What will you do if something like this is happening around you? Why would a drug dealer want to learn Bitcoin if not for a safer haven for running the business?My mind isn't settled as I keep thinking different things, what is on your mind readers? Answer to your query is very obvious. He will definitely use BTC for illegal purposes. It would be like adding fuel to the fire. And you must not add that fuel. If you would, then you will also be caught in that fire. I hope you got my point. In first place, if you have the option then report that person to police. If you can't do that then at least do no tell him about BTC.Think for a second, if he got caught up by police, and on investigation he says your name that you teaches him how to use BTC for illegal purposes. Then what will you do, how will you justify yourself. My only advice for you to is, Stay away from such environment make some excuses and try to avoid him.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "retreat",
      "created_time": "July 26, 2023, 08:06:34 AM",
      "body": "Quote from: Crypt0Gore on July 26, 2023, 07:28:43 AMIf you are aware that your neighbor living next door is into drug dealing and he come seek your advice how to buy Bitcoin, will you teach him? What comes straight to mind is embezzling the ill-gotten money, but is this even safe? My other neighbor knows I am into Bitcoin and he learned from me, I guess that's how this other neighbor knew, I told him to go meet the next neighbor but he said he is not ready to teach.What will you do if something like this is happening around you? Why would a drug dealer want to learn Bitcoin if not for a safer haven for running the business?My mind isn't settled as I keep thinking different things, what is on your mind readers? If I was in that position, the thing I would do is not communicate with him as much as possible. Even if he insists, I will find any reason not to teach him to buy Bitcoin. Because when we teach him to buy Bitcoins and at the same time the police raid his house, surely those who are related to him will be suspected and we will definitely become the target of the police because we have taught him to launder money in Bitcoins. Indeed, this is a pretty difficult situation, but if you can, never teach a criminal to buy Bitcoins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jrrsparkles",
      "created_time": "July 26, 2023, 08:32:10 AM",
      "body": "Quote from: Crypt0Gore on July 26, 2023, 07:28:43 AMIf you are aware that your neighbor living next door is into drug dealing and he come seek your advice how to buy Bitcoin, will you teach him? What comes straight to mind is embezzling the ill-gotten money, but is this even safe? My other neighbor knows I am into Bitcoin and he learned from me, I guess that's how this other neighbor knew, I told him to go meet the next neighbor but he said he is not ready to teach.What will you do if something like this is happening around you? Why would a drug dealer want to learn Bitcoin if not for a safer haven for running the business?My mind isn't settled as I keep thinking different things, what is on your mind readers? I would avoid any interaction at all in the future if I ever felt that the person is someone who is dealing with illegal activities not just because of its ethically wrong it will put me under trouble in future so I wouldn't take any chances that will affect my future.But it is not going to stop them from learning about anything they want cause seriously we are living in internet era, a google search will give you everything what they need to do so I will step away its none of my business to sniff their jobs.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sim_card",
      "created_time": "July 26, 2023, 08:33:15 AM",
      "body": "Just tell him that you are not comfortable with teaching him bitcoin since he is rich already. I can smell trouble if you teach him because he might end up exposing you if he gets caught in his business. Another thing that you should do is to tell the other of your neighbour that directed the drug dealer to you that he shouldn't direct people to you anymore for your own safety because you don't know who he will direct next to you. Maybe the cops or an arm robber. There is no need to teach anything on bitcoin without the wallet aspect and how to send and receive coins. This shows that there is every possibility of him using bitcoin for his business.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "xSkylarx",
      "created_time": "July 26, 2023, 08:41:19 AM",
      "body": "You already answered your question, which says no, but again, saying this to a drug dealer is very difficult. Mostly,  my strategy if someone is asking me to teach them about crypto is to always say I am busy, which works a lot, but with this, it is somewhat dangerous as well. It is better to say that you've already quit using Bitcoin and focus more on trading forex, and also tell him that you can search it on YouTube because you taught him before, right? Just say that the same method as before, where you just searched it on YouTube, makes him do it on his own.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gunhell16",
      "created_time": "July 26, 2023, 08:41:37 AM",
      "body": "Quote from: Crypt0Gore on July 26, 2023, 07:28:43 AMIf you are aware that your neighbor living next door is into drug dealing and he come seek your advice how to buy Bitcoin, will you teach him? What comes straight to mind is embezzling the ill-gotten money, but is this even safe? My other neighbor knows I am into Bitcoin and he learned from me, I guess that's how this other neighbor knew, I told him to go meet the next neighbor but he said he is not ready to teach.What will you do if something like this is happening around you? Why would a drug dealer want to learn Bitcoin if not for a safer haven for running the business?My mind isn't settled as I keep thinking different things, what is on your mind readers? Just answer what he wants to know about Bitcoin. But you have no obligation to teach him this, unless he asks you about it again. In fact, it's a bit worrying because you know he's a drug dealer or pusher.Now, the question is, why did he get interested in learning about Bitcoin? maybe he wants to change his transaction to something illegal so it is possible that he thought that this Bitcoin could be a substitute for what he is doing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "arbiter5",
      "created_time": "July 26, 2023, 08:44:44 AM",
      "body": "Quote from: Crypt0Gore on July 26, 2023, 07:28:43 AMMy other neighbor knows I am into Bitcoin and he learned from me, I guess that's how this other neighbor knew, I told him to go meet the next neighbor but he said he is not ready to teach.Your entire neighborhood knows about Bitcoin?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "KiaKia",
      "created_time": "July 26, 2023, 08:50:18 AM",
      "body": "I can't help you pick a side but there are two possibilities to this 1. This neighbor of yours might have heard that Bitcoin can change his life, the other neighbor that failed to teach him might be a good example, maybe he sees how life-changing with Bitcoin is possible looking at the two of you, maybe he want a change? If he isn't a dangerous addict, like those that use guns and weapons you can ask questions, ask him why he want to get involved, his answer will bring out the clear intentions he have in mind.2. Normal once a drug dealer is always a drug dealer and everything they get involved with is for the purpose of nurturing their illicit business, this can one one of those way to get away with easy crime life, this is one of those ways you can tarnish the image of Bitcoin, do not do it if his intent are unknown or he failed to speak up his mind. Now I leave the rest to you, do the finding yourself, also my advice is leave that premises it's not safe living with a drug dealer, unless he is ready to change and give up on the business, maybe that's why he want to know Bitcoin? That's your job to find out.Most times it's not safe living with such people,  stay safe.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MusaMohamed",
      "created_time": "July 26, 2023, 09:28:46 AM",
      "body": "Quote from: Crypt0Gore on July 26, 2023, 07:28:43 AMIf you are aware that your neighbor living next door is into drug dealing and he come seek your advice how to buy Bitcoin, will you teach him? Why do that neighbor need to find you and need your guide, advice?Your neighbor can find many guides from Internet. I smell something is wrong from your neighbor who maybe has some plans behind.QuoteWhat comes straight to mind is embezzling the ill-gotten money, but is this even safe?It is not about clean or unclean money and you don't directly sell your bitcoin to that drug seller. It is about your safety when someone knows you have bitcoin and know where you are living.The only advice to that neighbor is use non KYC exchange https://kycnot.me/?cash=on",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yaunfitda",
      "created_time": "July 26, 2023, 09:35:09 AM",
      "body": "Quote from: Crypt0Gore on July 26, 2023, 07:28:43 AMIf you are aware that your neighbor living next door is into drug dealing and he come seek your advice how to buy Bitcoin, will you teach him? What comes straight to mind is embezzling the ill-gotten money, but is this even safe? My other neighbor knows I am into Bitcoin and he learned from me, I guess that's how this other neighbor knew, I told him to go meet the next neighbor but he said he is not ready to teach.What will you do if something like this is happening around you? Why would a drug dealer want to learn Bitcoin if not for a safer haven for running the business?My mind isn't settled as I keep thinking different things, what is on your mind readers? You have clearly stated it, you teach him bitcoin so we can speculate that,a. He is using it to cover his tracks or at least the money that he is receiving in his dealings.b. He wants to be a investors and hide his money.I guess you are in a lose-lose situation, you can't say no to him if he approach you and wanted to learn about bitcoin. Because maybe he will take it negatively and maybe come after you. If you teach him, then it might bothered you later as you are the one who lead him to launder his money thru bitcoin and stay under the radar from the government or the authorities.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BALIK",
      "created_time": "July 26, 2023, 09:39:49 AM",
      "body": "Quote from: Crypt0Gore on July 26, 2023, 07:28:43 AMIf you are aware that your neighbor living next door is into drug dealing and he come seek your advice how to buy Bitcoin, will you teach him? What comes straight to mind is embezzling the ill-gotten money, but is this even safe? My other neighbor knows I am into Bitcoin and he learned from me, I guess that's how this other neighbor knew, I told him to go meet the next neighbor but he said he is not ready to teach.What will you do if something like this is happening around you? Why would a drug dealer want to learn Bitcoin if not for a safer haven for running the business?My mind isn't settled as I keep thinking different things, what is on your mind readers? If it were me, I would refuse to teach him bitcoin because I don't know his real purpose. I am thinking negative things that he is looking to use bitcoins for his illegal activities, so I will decline. Not for the reputation of bitcoin but for my safety, because if the police catch him and find out that he is using bitcoin to buy and sell drugs, that means I am abetting with the criminal, and I am his accomplice. So I won't get into that unnecessary trouble. There's so much bitcoin knowledge on the internet, you could say he should learn everything on his own.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cantsay",
      "created_time": "July 26, 2023, 09:40:55 AM",
      "body": "Quote from: Crypt0Gore on July 26, 2023, 07:28:43 AM~~~My mind isn't settled as I keep thinking different things, what is on your mind readers? First of all how did your drug lord neighbor got to know that you're into Bitcoin. If you feel you don't want to teach him, then just tell him that he has to look for someone else to do it since the knowledge you have is not sufficient enough to tutor someone and if he should listen to your teaching that there is a high chance of him losing his money.This should be a warning to you and others, if you know you're not ready for the outside world then keep your financial life to yourself, don't go around telling everyone about your financial life unless you're ready to handle what comes after i.e aside from the health risk.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ImThour",
      "created_time": "July 26, 2023, 09:43:33 AM",
      "body": "I have a neighbor who is a drug dealer and I am not telling police is one concern itself. If you are fine with that, you shouldn't have to worry about teaching him about Bitcoin and how it works.And the question arises, how does he know you know about Bitcoin? If you yourself told him about it in the massive bull run, you should help him out in the current period too no matter what he deals in. That's how I think this should be thought of.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Die_empty",
      "created_time": "July 26, 2023, 09:44:24 AM",
      "body": "Quote from: Crypt0Gore on July 26, 2023, 07:28:43 AMIf you are aware that your neighbor living next door is into drug dealing and he come seek your advice how to buy Bitcoin, will you teach him? What comes straight to mind is embezzling the ill-gotten money, but is this even safe? My other neighbor knows I am into Bitcoin and he learned from me, I guess that's how this other neighbor knew, I told him to go meet the next neighbor but he said he is not ready to teach.What will you do if something like this is happening around you? Why would a drug dealer want to learn Bitcoin if not for a safer haven for running the business?My mind isn't settled as I keep thinking different things, what is on your mind readers? If you are certain that he is a drug dealer, you shouldn't teach him. Your conviction that he deals drugs shouldn't be based on hearsay or speculation but on concrete facts and evidence. Teaching him will lead to using Bitcoin to hide his ill-gotten wealth and also use it to engage in illegal transactions. But you should also be careful in handling such criminals because they can be dangerous. You have to seek a way to say no without offending them. Arrange a meeting with him and ask him why he wants to use bitcoin. If he informs you that it is for his business. Most of them have this misconception that Bitcoin transactions are secrets. You can politely tell him that the bitcoin transaction system is public and traceable. He should know that such transactions are recorded in the blockchain and can be tracked or traced by law enforcement agencies. He should know that bitcoin is not an ideal currency when it comes to drug dealing transactions. Quote from: ImThour on July 26, 2023, 09:43:33 AMI have a neighbor who is a drug dealer and I am not telling police is one concern itself. If you are fine with that, you shouldn't have to worry about teaching him about Bitcoin and how it works.And the question arises, how does he know you know about Bitcoin? If you yourself told him about it in the massive bull run, you should help him out in the current period too no matter what he deals in. That's how I think this should be thought of.Reporting a drug dealer to the police is very risky in my country. Some of them have connections with the police. They pay the police heavily for protection. The police will even tell them that you are the person that reported them and you have to be ready to bear the consequences. So you might be attacked by these drug dealers or even implicated by the police. They best option is to mind your business and live in peace.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husires",
      "created_time": "July 26, 2023, 09:51:30 AM",
      "body": "The popular saying that it is easy to hide illegal activities using Bitcoin is wrong, especially if the amount is in the millions of dollars.Cash is easier, more widely accepted, and it is difficult to track it. most of the drug trade is based on cash, where they can trade without being tracked, but your purchase or payment for a cryptocurrency product is recorded for life, and after 10 years, when the fraudster is caught, all buyers can be known. Which is almost impossible in the cash.If my neighbor suggests learning bitcoin, I will learn him because he probably won't use it for most activity, or at least it won't be for large sums.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mvdheuvel1983",
      "created_time": "July 26, 2023, 09:59:15 AM",
      "body": "Quote from: Crypt0Gore on July 26, 2023, 07:28:43 AMIf you are aware that your neighbor living next door is into drug dealing and he come seek your advice how to buy Bitcoin, will you teach him?The question should be, \"Will I teach him for free?\" No, I won't. Secondly, just because he is into drugs doesn't mean his purpose for wanting to learn about bitcoin is to use it for doing drugs. What if life circumstances forced him into it, and learning about bitcoin is the only alternative to leaving the drug business?50 Cent did drugs but left and started making music. Do you think that if Dr. Dre had said, \"No, I won't give you a chance because you are into drugs and gangs,\" he would have become a celebrity? I don't think so. There's nothing wrong with teaching your neighbor. He may just want a better life for himself, and Bitcoin may rightly be what would offer him that freedom.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "paid2",
      "created_time": "July 26, 2023, 09:59:21 AM",
      "body": "Quote from: Crypt0Gore on July 26, 2023, 07:28:43 AMIf you are aware that your neighbor living next door is into drug dealing and he come seek your advice how to buy Bitcoin, will you teach him? What comes straight to mind is embezzling the ill-gotten money, but is this even safe? My other neighbor knows I am into Bitcoin and he learned from me, I guess that's how this other neighbor knew, I told him to go meet the next neighbor but he said he is not ready to teach.What will you do if something like this is happening around you? Why would a drug dealer want to learn Bitcoin if not for a safer haven for running the business?I'm not interested in how people and my neighbors earn their money, it doesn't concern me.The real question is more (from my point of view) : is it a good idea for your neighbors to know that you own Bitcoin? Depending on the place, the neighborhood, the country, this can be a pretty risky choice. Personally, I'm a little wary of telling everyone. I only tell friends, and if it's the same for you, it implies that you're friends with your neighbor. So if you can be friends with a drug dealer, you can talk to him about BTC too, can't you?In any case, it's enough to advise people to read some books, there's no need to be more specific. And if they're smart enough to understand the White Paper or the Bitcoin Standard, for example, they won't need any more advice. If you just point them in the right direction, and then they can get on Bitcoin without you, at least they won't bother you if they have a problem or get ripped off",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}