{
  "id": "topic_5452844",
  "title": "jeremypwr",
  "author": "jeremypwr",
  "created_time": "May 15, 2023, 07:04:11 PM",
  "content": "UFC Fight Night 224Multi Master Challenge   Prizes1st place: 2 mbtc Free Bet2nd place: 1 mbtc Free Bet3rd place: 0.5 mbtc Free BetThe Rules are similar to the original Sportsbet.io Multi Master that we all enjoyed so muchRulesa)  Predict the winner of each match (earn 1-2 points)b)  Predict how many matches will NOT go the Full Distance (will be adjusted accordingly if matches get cancelled)Odds @ https://sportsbet.io/sports/mma/ufc/ufc-fight-night-pennington-vs-aldana-2/matchesMatches(2 points each)12. Mackenzie Dern vs. Angela Hill 11. Anthony Hernandez vs. Edmen Shahbazyan 10. Emily Ducote vs. Loopy Godinez 9. Joaquin Buckley vs. Andre Fialho 8. Diego Ferreira vs. Michael Johnson(1 point each)7. Viacheslav Borshchev vs. Hayisaer Maheshate 6. Vanessa Demopoulos vs. Karolina Kowalkiewicz 5. Orion Cosce vs. Gilbert Urbina 4. Ilir Latifi vs. Rodrigo Nascimento 3. Nick Fiore vs. Chase Hooper 2. Victoria Leonardo vs. Natalia Silva1. Themba Takura Gorimbo vs. Takashi Sato NOT go the Full Distance   Make sure your Prediction is in this format    Example12. Mackenzie Dern 11. Anthony Hernandez 10. Emily Ducote 9. Joaquin Buckley 8. Diego Ferreira 7. Viacheslav Borshchev 6. Vanessa Demopoulos 5. Orion Cosce 4. Ilir Latifi 3. Nick Fiore 2. Victoria Leonardo 1. Themba Takura Gorimbo NOT go the Full Distance 5(Small print)* Must be active in Sports betting and/or Sports betting discussion (some exceptions) *** The declared winners are final and up to my discretion **",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5452844",
  "comments": [
    {
      "author": "jeremypwr",
      "created_time": "May 15, 2023, 07:05:11 PM",
      "body": "Sportsbet.io has been kind enough to sponsor my Prediction Contests and Promos for a while now.Sportsbet.io is a sports betting website; therefore these Prediction Contests and Promos are catered to those who actually bet on/discuss sports.Given the nature of my threads, please do not bother making a Prediction if you have not read the OP and qualify.If you are unsure if you qualify, just shoot me a PM.   Thank you for your cooperation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LFC_Bitcoin",
      "created_time": "May 15, 2023, 08:58:51 PM",
      "body": "12. Mackenzie Dern  11. Anthony Hernandez 10. Emily Ducote 9. Joaquin Buckley 8. Michael Johnson  7. Viacheslav Borshchev 6. Vanessa Demopoulos 5. Orion Cosce 4. Rodrigo Nascimento 3. Nick Fiore 2. Natalia Silva 1. Themba Takura Gorimbo NOT go the Full Distance 7",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "notblox1",
      "created_time": "May 15, 2023, 09:15:01 PM",
      "body": "12. Mackenzie Dern11. Anthony Hernandez10. Loopy Godinez9. Joaquin Buckley8. Michael Johnson7. Hayisaer Maheshate6. Karolina Kowalkiewicz5. Gilbert Urbina4. Rodrigo Nascimento3. Nick Fiore2. Natalia Silva1. Themba Takura GorimboNOT go the Full Distance 6",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "famososMuertos",
      "created_time": "May 15, 2023, 09:59:18 PM",
      "body": "12. Mackenzie Dern 11. Anthony Hernandez10. Emily Ducote9. Joaquin Buckley8. Michael Johnson 7. Hayisaer Maheshate6. Vanessa Demopoulos5. Orion Cosce4. Rodrigo Nascimento3. Nick Fiore2. Natalia Silva1. Themba Takura GorimboNOT go the Full Distance 4",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Barcode_",
      "created_time": "May 16, 2023, 01:40:24 AM",
      "body": "12. Mackenzie Dern11. Anthony Hernandez10. Loopy Godinez9. Joaquin Buckley8. Diego Ferreira7. Viacheslav Borshchev6. Karolina Kowalkiewicz5. Orion Cosce4. Rodrigo Nascimento3. Nick Fiore2. Natalia Silva1. Takashi SatoNOT go the Full Distance 5",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "slaman29",
      "created_time": "May 16, 2023, 06:07:57 AM",
      "body": "12. Mackenzie Dern11. Anthony Hernandez10. Emily Ducote9. Joaquin Buckley8. Diego Ferreira7. Viacheslav Borshchev6. Vanessa Demopoulos 5. Orion Cosce 4. Ilir Latifi 3. Nick Fiore2. Natalia Silva1. Themba Takura GorimboNOT go the Full Distance 5",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "leea-1334",
      "created_time": "May 16, 2023, 07:47:16 AM",
      "body": "12. Mackenzie Dern11. Anthony Hernandez10. Loopy Godinez9. Andre Fialho8. Diego Ferreira7. Hayisaer Maheshate6. Karolina Kowalkiewicz5. Gilbert Urbina4. Rodrigo Nascimento3. Chase Hooper2. Natalia Silva1. Takashi SatoNOT go the Full Distance 8",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Betwrong",
      "created_time": "May 16, 2023, 08:27:34 AM",
      "body": "12. Mackenzie Dern11. Anthony Hernandez10. Loopy Godinez9. Joaquin Buckley8. Diego Ferreira7. Viacheslav Borshchev6. Karolina Kowalkiewicz5. Orion Cosce4. Rodrigo Nascimento3. Nick Fiore2. Natalia Silva1. Themba Takura GorimboNOT go the Full Distance 6",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tokeweed",
      "created_time": "May 16, 2023, 12:11:32 PM",
      "body": "12. Mackenzie Dern11. Anthony Hernandez10. Emily Ducote 9. Joaquin Buckley 8. Michael Johnson7. Viacheslav Borshchev6. Vanessa Demopoulos5. Gilbert Urbina 4. Rodrigo Nascimento 3. Chase Hooper 2. Natalia Silva1. Themba Takura GorimboNOT go the Full Distance:  8",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kryptqnick",
      "created_time": "May 16, 2023, 01:47:41 PM",
      "body": "12. Angela Hill11. Anthony Hernandez10. Loopy Godinez9. Joaquin Buckley 8. Diego Ferreira7. Hayisaer Maheshate6. Karolina Kowalkiewicz5. Orion Cosce4. Rodrigo Nascimento3. Nick Fiore 2. Natalia Silva1. Takashi SatoNOT go the Full Distance 5",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bullrun2024bro",
      "created_time": "May 16, 2023, 03:42:59 PM",
      "body": "12. Mackenzie Dern11. Anthony Hernandez10. Loopy Godinez9. Joaquin Buckley8. Diego Ferreira7. Viacheslav Borshchev6. Karolina Kowalkiewicz5. Orion Cosce4. Rodrigo Nascimento3. Nick Fiore2. Natalia Silva1. Takashi SatoNOT go the Full Distance 7",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "buwaytress",
      "created_time": "May 16, 2023, 03:58:44 PM",
      "body": "12. Mackenzie Dern11. Anthony Hernandez10. Loopy Godinez9. Andre Fialho8. Diego Ferreira7. Hayisaer Maheshate6. Vanessa Demopoulos5. Gilbert Urbina4. Ilir Latifi3. Nick Fiore2. Natalia Silva1. Themba Takura GorimboNOT go the Full Distance 4",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Woodie",
      "created_time": "May 16, 2023, 04:06:41 PM",
      "body": "12. Mackenzie Dern 11. Anthony Hernandez 10. Emily Ducote 9. Joaquin Buckley 8. Michael Johnson7. Viacheslav Borshchev6. Karolina Kowalkiewicz5. Gilbert Urbina4. Rodrigo Nascimento3. Chase Hooper2. Natalia Silva1. Themba Takura Gorimbo NOT go the Full Distance 3",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Slissy",
      "created_time": "May 16, 2023, 05:09:34 PM",
      "body": "12. Mackenzie Dern 11. Anthony Hernandez 10. Emily Ducote 9. Joaquin Buckley 8. Diego Ferreira 7. Viacheslav Borshchev 6. Karolina Kowalkiewicz 5. Gilbert Urbina 4. Rodrigo Nascimento3. Chase Hooper 2. Natalia Silva 1. Takashi SatoNOT go the Full Distance 4",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "morvillz7z",
      "created_time": "May 16, 2023, 10:38:38 PM",
      "body": "12. Mackenzie Dern11. Anthony Hernandez10. Loopy Godinez9. Andre Fialho8. Michael Johnson7. Viacheslav Borshchev6. Vanessa Demopoulos5. Gilbert Urbina4. Rodrigo Nascimento3. Chase Hooper2. Natalia Silva1. Themba Takura GorimboNOT go the Full Distance 4",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Harkorede",
      "created_time": "May 17, 2023, 05:29:22 AM",
      "body": "12. Mackenzie Dern11. Anthony Hernandez10. Loopy Godinez9. Joaquin Buckley8. Diego Ferreira7. Viacheslav Borshchev6. Karolina Kowalkiewicz5. Orion Cosce4. Rodrigo Nascimento3. Nick Fiore2. Natalia Silva1. Takashi SatoNOT go the Full Distance: 8",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jeremypwr",
      "created_time": "May 17, 2023, 02:40:37 PM",
      "body": "12. Mackenzie Dern11. Anthony Hernandez10. Emily Ducote9. Joaquin Buckley8. Diego Ferreira7. Viacheslav Borshchev6. Vanessa Demopoulos5. Orion Cosce4. Ilir Latifi3. Nick Fiore2. Victoria Leonardo1. Themba Takura GorimboNOT go the Full Distance 5",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mole0815",
      "created_time": "May 17, 2023, 02:58:13 PM",
      "body": "12. Angela Hill11. Anthony Hernandez10. Emily Ducote9. Joaquin Buckley8. Michael Johnson7. Hayisaer Maheshate6. Vanessa Demopoulos5. Orion Cosce4. Rodrigo Nascimento3. Chase Hooper2. Victoria Leonardo1. Themba Takura GorimboNOT go the Full Distance 6",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "boltz",
      "created_time": "May 17, 2023, 10:20:57 PM",
      "body": "12. Mackenzie Dern 11. Anthony Hernandez10. Loopy Godinez9. Joaquin Buckley 8. Michael Johnson7. Viacheslav Borshchev6. Vanessa Demopoulos5. Gilbert Urbina4. Ilir Latifi3. Chase Hooper2. Victoria Leonardo 1. Takashi Sato NOT go the Full Distance 4",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}