{
  "id": "topic_5423047",
  "title": "DaveF",
  "author": "DaveF",
  "created_time": "November 25, 2022, 01:29:21 AMLast edit: November 23, 2023, 10:20:24 PM by DaveF",
  "content": "Made you look :-)  Proof of Steak:Proof of (lack of) Work:But seriously, below are a couple of links for donating crypto for food for people & families in need. Send them some if you can.https://www.licares.org/donatecryptocurrency/https://www.foodbanknyc.org/donate/cryptocurrency/https://www.feedingamerica.org/ways-to-give/bitcoin-cryptocurrencyThere are others, but since I am in NY these are the ones I support.Happy Thanksgiving.-Dave",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5423047",
  "comments": [
    {
      "author": "Free Market Capitalist",
      "created_time": "November 25, 2022, 03:27:36 AM",
      "body": "Good idea. I donate regularly, and will probably make an extra donation to one of these organizations. Ideally, these people wouldn't need a donation because they all have a way to fend for themselves, but the world we live in is not ideal, so it's worth dedicating a part of your income to help others. \"Proof of Steak\", lol, very good, I like it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NeuroticFish",
      "created_time": "November 25, 2022, 09:35:28 AM",
      "body": "Quote from: DaveF on November 25, 2022, 01:29:21 AMMade you look :-)Most probably the altcoiners who cannot even spell correctly Ethereum will not even be noticing you wrote Steak instead of Stake  Happy Thanksgiving!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TheBeardedBaby",
      "created_time": "November 25, 2022, 09:45:56 AM",
      "body": "Lol you almost got me, until I double read the title Happy Thanksgiving Dave!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ABCbits",
      "created_time": "November 25, 2022, 09:52:13 AM",
      "body": "Quote from: DaveF on November 25, 2022, 01:29:21 AMBut seriously, below are a couple of links for donating crypto for food for people & families in need. Send them some if you can.https://www.licares.org/donatecryptocurrency/https://www.foodbanknyc.org/donate/cryptocurrency/https://www.feedingamerica.org/ways-to-give/bitcoin-cryptocurrencyThere are others, but since I am in NY these are the ones I support.I'm asking since i don't live on NY, have you done some research about those research? For example, how big is the operational/advertising overhead?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "drwhobox",
      "created_time": "November 25, 2022, 11:19:04 AM",
      "body": "Yeah, you made me look  I noticed the second time it was steak not stake! Happy thanksgiving!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coolcoinz",
      "created_time": "November 25, 2022, 11:20:36 AM",
      "body": "I can only blame myself for reading the thread wrong. There's so many PoS debates on the forum that you just don't see the word steak as legit. You want to read it as is, but your mind tells you \"it's not steak, it's stake, you're seeing wrong\" So you think it's another one of those trolls who will say ETH is the new bitcoin and it's so much better than btc because of carbon footprint and if we get rid of it then the glacier temperature will go up by 0.01*C per 10 years. Good job OP, stakes look delicious. Makes me wanna see them cooked. I hope you didn't overcook. Post some more food porn for us.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaveF",
      "created_time": "November 25, 2022, 12:28:49 PM",
      "body": "Quote from: ETFbitcoin on November 25, 2022, 09:52:13 AMQuote from: DaveF on November 25, 2022, 01:29:21 AMBut seriously, below are a couple of links for donating crypto for food for people & families in need. Send them some if you can.https://www.licares.org/donatecryptocurrency/https://www.foodbanknyc.org/donate/cryptocurrency/https://www.feedingamerica.org/ways-to-give/bitcoin-cryptocurrencyThere are others, but since I am in NY these are the ones I support.I'm asking since i don't live on NY, have you done some research about those research? For example, how big is the operational/advertising overhead?LI Cares is well known here to be legit, Billy Joel is a major fundraiser for it. It's been on LI for years, according to charity navigator 93% percent of program expenses goes towards foodFoodbank NYC is at 94% to food and feedingamerica is about the same.With LI Cares & Food Bank NYC there are a lot of eyes on them around here so I would think they better then most.Quote from: coolcoinz on November 25, 2022, 11:20:36 AMGood job OP, stakes look delicious. Makes me wanna see them cooked. I hope you didn't overcook. Post some more food porn for us. Not really a food porn kind of guy, except for the holidays I tend to eat whatever. Was going for medium-rare, but overshot it a bit not as much red as there should have been. I have never been good cooking thick cuts of meat.-Dave",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "November 25, 2022, 12:42:13 PM",
      "body": "This protocol lacks a lot of details- cooking time per block- the size of the steak- what kind of chain flavors or sauces it supports- any decentralized grill you recommend- how many of those did you age in secret before releasing it?Btw, wasn't it supposed to be Pork of Steak?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "November 25, 2022, 12:53:18 PM",
      "body": "DaveF, You missed the proof of stake. Explained in one image:Image how would it be if satoshi created bitcoin with PoS, not PoW.\"How do you secure the network?\"\"By staking the BTC you just created out of nowhere.\"People would just laugh and ignore it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "November 25, 2022, 12:54:08 PMLast edit: November 25, 2022, 01:18:45 PM by franky1",
      "body": "isnt a poof of steak the gas released after 6 hours of locking it into the digestive system",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaNNy001",
      "created_time": "November 25, 2022, 12:56:54 PMLast edit: November 25, 2022, 01:11:22 PM by DaNNy001",
      "body": "Nice one mate  Got confused abit on the  title,  though the steak just caught my attention now I feel like eating steak. LolHappy Thanksgiving man.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "November 25, 2022, 01:22:12 PM",
      "body": "Yes, I too like Proof of Steak indeed  Though I am surprised that the swarm of PoW-hating trolls have not descended on this thread yet.Quote from: Poker Player on November 25, 2022, 03:27:36 AMGood idea. I donate regularly, and will probably make an extra donation to one of these organizations. Ideally, these people wouldn't need a donation because they all have a way to fend for themselves, but the world we live in is not ideal, so it's worth dedicating a part of your income to help others. \"Proof of Steak\", lol, very good, I like it.I should probably start work on making a \"Proof of Steak\" Bitcoin Core based on the newly released version 24.0 now  Or maybe I can write the Proof of Steak whitepaper and email it to Chris Larsen as the next big thing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaveF",
      "created_time": "November 23, 2023, 10:21:42 PM",
      "body": "One year bump. Since it's Thanksgiving.But with all the crap still going on in the world, if you can afford to donate to those in need please do.-Dave",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}