{
  "id": "topic_5415815",
  "title": "RaltcoinsB",
  "author": "RaltcoinsB",
  "created_time": "October 03, 2022, 05:51:41 PM",
  "content": "350-400 leş kargasına karşılık 65 tane yiğit vatanın karakolunu savundular 17 tanesi şehitlik mertebesine ulaştı Yer Hakkari Şemdinli Aktütün karakoluDefalarca yapılan saldırılardan biri daha tam 14 yıl önce yapıldı Bayraktepeyi vermemek için direnen aslanlar geceli gündüzlü çatıştılar her taraftan saldıran leş kargalarından 23 tanesi de gebertildi YouTube üzerinde o güne ait kayıtları izleyince insanın içi bir daha cız ediyor göz göre göre saldırıyorlar yerel halktan destek alıyorlar terör bu boyutuyla bitmez bitirilemez terör zihinlerde bitirilmeli Şehitlerimizin mekanı cennet olsun inşallah Allah tekrarını yaşatmasın",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5415815",
  "comments": [
    {
      "author": "Cacabey_40",
      "created_time": "October 03, 2022, 05:58:33 PM",
      "body": "Tam bir ay sonra göreve gittiğim bölge. (Asker değilim) Nice olaylara şahitlik ettim.Vatanı, toprağı ve bayrağı için şehit olan neferlerin mekanı cennet, makamı âli olsun. Allah hepsine rahmet etsin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "meser#",
      "created_time": "October 03, 2022, 08:02:20 PM",
      "body": "Bu tarz konularda bir hocamızın bize sigarayı bıraktırmak için verdiği öğüt geliyor. Eğer bir kolun kangren olmuşsa satırı alıp dank diye indirmen gerekir öyle testere gibi gıy gıy iş tutarsan ne dayanmaya mecalin kalır ne de sorunu çözersin. Terör konusu artık gerçekten de bu ülkenin kangreni olan başlıca konulardan bir tanesi senelerdir çözüme kavuşturulamadı ve bu şekilde giderse de bir sonuca gidilmeyecek. Umarım bir gün bu sorunun ciddiyeti gerçek anlamda kavranıldığında çok geçmemiş olur.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Phoenix Anka",
      "created_time": "October 04, 2022, 04:18:08 AM",
      "body": "Terör saldırıyla maalesef içli dışlı olan ülkemizin bu ve buna benzer bir sürü saldırı girişimi olmuşluğu var. Geçmişte eli kanlı bebek katilleri savunmasız askerlerimizi sıraya dizip kurşuna dizecek kadar alçaklaşmış bir örgüttü. Cümlede dediğimiz gibi bebekleri kundağında öldüren bir örgüttü. Bu gibi saldırıları çoktu. Aktütün de bunlardan birisiydi. Allah rahmet eylesin şehitlerimize.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "judas",
      "created_time": "October 04, 2022, 10:50:56 AM",
      "body": "Maalesef bu tarz olayları çok çabuk unutuyoruz 17 vatan evladını hain bir terör saldırısı sonucu kaybettik.Şehitlerimiz için aradan ne kadar zaman geçerse geçsin dua etmek onları minnetle anmak boynumuzun borcu diye düşünüyorum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mandown",
      "created_time": "October 04, 2022, 10:52:39 AM",
      "body": "Geçenlerde cafemde büyüyen bir genç asker şehit oldu duyduğum gün kendime gelemedim   ne kadar üzüldüm hayatın ne kadar boş olduğu yüzüme tekrar çarptı. Yiğitlerimiz aslanlarımız şehit oldu Allah rahmet eylesin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "RaltcoinsB",
      "created_time": "October 04, 2022, 06:53:34 PM",
      "body": "Quote from: mandown on October 04, 2022, 10:52:39 AMGeçenlerde cafemde büyüyen bir genç asker şehit oldu duyduğum gün kendime gelemedim   ne kadar üzüldüm hayatın ne kadar boş olduğu yüzüme tekrar çarptı. Yiğitlerimiz aslanlarımız şehit oldu Allah rahmet eylesin.Şehitlik işte her zaman karşımıza çıkıyor hangi yaşta olursa olsun geçen gün Mersin’de şehit olan abimiz de 48 yaşındaydı emekliliği bekliyordu hatta biraz daha ilginç bir şey söyleyeyim emekliliği hak etmişti maaşlı emekliliği ama çocukları ve ailesi için 55 yaşına kadar çalışmayı düşünüyordu o hain saldırıda şehit oldu işte hayat bu kimi zaman 18 yaşında, kimi zaman kundakta kancık bir bombayla kimi zaman da 48 yaşında şehitlik mertebesine ulaştırıyor Allah rahmet eylesin",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kriminall",
      "created_time": "October 04, 2022, 08:04:30 PM",
      "body": "Bu konu ile tüm şehitlerimizin mekanı cennet olsun, o dönemde profesyonel askerlik diye bir kavramda olmadığı için saldırıda olan yerde bir çoğu ülkenin çeşitli yerlerinden giden genç er ve erbaş askerlerdi, büyük bir savunma gerçekleştirildiğini o dönemki tartışma programlarından hatırlıyorum, bir de hatırladığım yardıma giden helikopter falan olmamıştı galiba, neden gitmediği konusu da baya tartışılmıştı bu kısmı başka bir saldırı ile de karıştırıyor olabilirim emin değilim, sonuçta can verdiler yurdu yaşatmak için,",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Retro Harmony",
      "created_time": "October 05, 2022, 07:25:16 AM",
      "body": "Allah rahmet eylesin. Artık o kadar çok şehidimiz oluyor ki hepsini unutmaya, unutturulmaya başlandık. Eskiden böyle olaylar olduğunda geçmişe yönelik haberler yapılır, şehitler anılırdı. Artık hatırlatılmak bile istenmiyor sanki. Bu konuyu görünce haberim oldu benim mesela unutmuşum, unutturulmuşum. Keşke böyle manevi durumlarda o şehitlerimizin aileleri her sene ziyaret edilip elleri öpülse.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}