{
  "id": "topic_5458997",
  "title": "nathan_tek",
  "author": "nathan_tek",
  "created_time": "July 07, 2023, 05:09:12 PM",
  "content": "Suche eine Effektive Möglichkeit um ein Wallet (keystore) wiederherzustellen. Hab leider kein Passwort mehr. Jemand eine Idee?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5458997",
  "comments": [
    {
      "author": "Cricktor",
      "created_time": "July 07, 2023, 07:11:35 PM",
      "body": "Vielleicht solltest du noch mitteilen, um welche Wallet-Software es sich handelt, deren verschlüsselte Wallet du nicht mehr entsperren kannst.Bitcoin Core wallet.dat kann man z.B. mit Hashcat angreifen, es gibt Tools, die den Teil extrahieren können, mit dem man den Verschlüsselungskey dann angreifen kann.Dito sollte btcrecover Angriffsmöglichkeiten für andere Wallets bieten. Du solltest da schon etwas konkreter werden.Du solltest allerdings schon noch einige Ideen dazu haben, wie das Passwort aufgebaut gewesen sein kann. Vorausgesetzt es war dein eigenes Passwort und Wallet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nathan_tek",
      "created_time": "July 09, 2023, 04:19:23 PM",
      "body": "Quote from: Cricktor on July 07, 2023, 07:11:35 PMVielleicht solltest du noch mitteilen, um welche Wallet-Software es sich handelt, deren verschlüsselte Wallet du nicht mehr entsperren kannst.Bitcoin Core wallet.dat kann man z.B. mit Hashcat angreifen, es gibt Tools, die den Teil extrahieren können, mit dem man den Verschlüsselungskey dann angreifen kann.Dito sollte btcrecover Angriffsmöglichkeiten für andere Wallets bieten. Du solltest da schon etwas konkreter werden.Du solltest allerdings schon noch einige Ideen dazu haben, wie das Passwort aufgebaut gewesen sein kann. Vorausgesetzt es war dein eigenes Passwort und Wallet.Es handelt sich um ein Ethereum Wallet und darauf befinden sich Tokens. Es ist mein eigenes Wallet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bullrun2024bro",
      "created_time": "July 09, 2023, 09:46:25 PM",
      "body": "Quote from: nathan_tek on July 09, 2023, 04:19:23 PMEs handelt sich um ein Ethereum Wallet und darauf befinden sich Tokens. Es ist mein eigenes Wallet. Dann wäre diese Thread womöglich besser im Altcoin-Bereich aufgehoben. Denn hier geht es ausschließlich um Bitcoin.Zusätzlich ein weiterer Hinweis: Wenn du wirklich Hilfe haben möchtest, dann liefere im Ausgangspost doch gleich alle relevanten Informationen. Wenn du diese nur bruchstückhaft herausrückst und man gefühlt fünf mal nachfragen muss, bevor man dein Anliegen versteht, dann ist das nicht unbedingt förderlich, dass du hier Hilfe bekommst.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lafu",
      "created_time": "July 10, 2023, 01:01:59 PM",
      "body": "Quote from: nathan_tek on July 09, 2023, 04:19:23 PMEs handelt sich um ein Ethereum Wallet und darauf befinden sich Tokens. Es ist mein eigenes Wallet. Lohnt es sich überhaupt zu versuchen in die Wallet bzw das Passwort zu bekommen , sind die Token was wert oder nur irgendwelche Shit Tokens im cent bereich ?Wenn es nur Shit Tokens sind die nicht viel wert sind würde es lassen zu versuchen die Wallet zu knacken.Eventuell hast du das Passwort ja irgendwo noch aufgeschrieben oder in einer Textdatei dieses vermerkt (was man natürlich nicht machen sollte)Screenshot auf dem Handy oder tiefgründig nachdenken was es für ein Passwort sein könnte.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nathan_tek",
      "created_time": "July 10, 2023, 03:24:00 PM",
      "body": "Quote from: Lafu on July 10, 2023, 01:01:59 PMQuote from: nathan_tek on July 09, 2023, 04:19:23 PMEs handelt sich um ein Ethereum Wallet und darauf befinden sich Tokens. Es ist mein eigenes Wallet. Lohnt es sich überhaupt zu versuchen in die Wallet bzw das Passwort zu bekommen , sind die Token was wert oder nur irgendwelche Shit Tokens im cent bereich ?Wenn es nur Shit Tokens sind die nicht viel wert sind würde es lassen zu versuchen die Wallet zu knacken.Eventuell hast du das Passwort ja irgendwo noch aufgeschrieben oder in einer Textdatei dieses vermerkt (was man natürlich nicht machen sollte)Screenshot auf dem Handy oder tiefgründig nachdenken was es für ein Passwort sein könnte.Es wären halt doch ein paar hunderte von Euro. Aber egal, die Welt bricht nicht zusammen.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mole0815",
      "created_time": "July 11, 2023, 08:37:56 AM",
      "body": "Quote from: nathan_tek on July 07, 2023, 05:09:12 PMSuche eine Effektive Möglichkeit um ein Wallet (keystore) wiederherzustellen. Hab leider kein Passwort mehr. Jemand eine Idee?nathan_tek ich habe es mir erlaubt deinen Thread zu verschieben.Da es keinen BTC-Bezug gibt ist hier nun die passende Stelle dafür",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cygan",
      "created_time": "July 11, 2023, 09:21:35 AM",
      "body": "Quote from: mole0815 on July 11, 2023, 08:37:56 AM✂nathan_tek ich habe es mir erlaubt deinen Thread zu verschieben.Da es keinen BTC-Bezug gibt ist hier nun die passende Stelle dafür wäre es nicht besser bzw. sinnvoller dieses thema in dem dafür vorgesehenen bereich zu platzieren/verschieben: Anfänger und Hilfe",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bullrun2024bro",
      "created_time": "July 11, 2023, 09:54:27 AM",
      "body": "Quote from: cygan on July 11, 2023, 09:21:35 AMwäre es nicht besser bzw. sinnvoller dieses thema in dem dafür vorgesehenen bereich zu platzieren/verschieben: Anfänger und Hilfe Der Anfänger und Hilfe Bereich unseres Boards ist meines Wissens nach ausschließlich für Themen rund um Bitcoin, bei denen Anfänger Hilfe benötigen. Sofern ein Altcoinbezug gegeben ist, wird der Beitrag regelmäßig ins Altcoin-Board verschoben. Zumindest hat @mole0815 das in der Vergangenheit so gehandhabt.Über diese Einteilung kann man sicherlich diskutieren (und mir ist relativ egal wie es am Ende geregelt wird), aber ich finde, dass wir es zumindest einheitlich handhaben sollten.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nathan_tek",
      "created_time": "July 11, 2023, 12:10:29 PM",
      "body": "Quote from: bullrun2020bro on July 09, 2023, 09:46:25 PMQuote from: nathan_tek on July 09, 2023, 04:19:23 PMEs handelt sich um ein Ethereum Wallet und darauf befinden sich Tokens. Es ist mein eigenes Wallet. Dann wäre diese Thread womöglich besser im Altcoin-Bereich aufgehoben. Denn hier geht es ausschließlich um Bitcoin.Zusätzlich ein weiterer Hinweis: Wenn du wirklich Hilfe haben möchtest, dann liefere im Ausgangspost doch gleich alle relevanten Informationen. Wenn du diese nur bruchstückhaft herausrückst und man gefühlt fünf mal nachfragen muss, bevor man dein Anliegen versteht, dann ist das nicht unbedingt förderlich, dass du hier Hilfe bekommst.Werde in Zukunft alle möglichen Details, gleich im ersten Post liefern. Danke für den Hinweis.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mole0815",
      "created_time": "July 11, 2023, 03:08:58 PM",
      "body": "Quote from: nathan_tek on July 11, 2023, 12:10:29 PMWerde in Zukunft alle möglichen Details, gleich im ersten Post liefern. Danke für den Hinweis.Danke cygan es ist (leider, oder Gott sei Dank?) so wie bullrun2020bro das beschrieben hat.Alle Unterforen (außer OT, Marktplatz, Altcoin und Presse) sind für Themen rund um BTC.Es gab ja schon mehrfach den Wunsch Änderungen an der Struktur vorzunehmen aber meine bisherigen Versuche das ändern zu lassen haben leider nie Anklang gefunden.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lafu",
      "created_time": "July 11, 2023, 04:45:32 PM",
      "body": "Quote from: mole0815 on July 11, 2023, 03:08:58 PMAlle Unterforen (außer OT, Marktplatz, Altcoin und Presse) sind für Themen rund um BTC.Es gab ja schon mehrfach den Wunsch Änderungen an der Struktur vorzunehmen aber meine bisherigen Versuche das ändern zu lassen haben leider nie Anklang gefunden.Ja das wäre mit Sicherheit nicht schlecht wenn wir bestimmte Unterforen in gewissen Bereichen hätten.Ich weiß ja nicht wann du das letzte mal nachgefragt hast bezüglich einer kleinen änderung der Struktur , eventuell kann man da ja nochmals nachfragen.Quote from: nathan_tek on July 11, 2023, 12:10:29 PMWerde in Zukunft alle möglichen Details, gleich im ersten Post liefern. Danke für den Hinweis. Das ist erspart einige Fragen und mögliche missverständnisse wenn solche sachen gleich im ersten Beitrag mit dabei sind.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mole0815",
      "created_time": "July 12, 2023, 09:25:21 AM",
      "body": "Quote from: Lafu on July 11, 2023, 04:45:32 PMIch weiß ja nicht wann du das letzte mal nachgefragt hast bezüglich einer kleinen änderung der Struktur , eventuell kann man da ja nochmals nachfragen.Mache ich ca. 1x im Monat da es auch andere Unterforen gibt wo Änderungen gewünscht werden und wir uns so regelmäßig gegenseitig daran erinnern im Bereich so was Thema geklärt (oder eben nicht geklärt ) wird Also ich kann nichts versprechen aber bleibe dran!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lafu",
      "created_time": "July 12, 2023, 03:56:48 PM",
      "body": "Quote from: mole0815 on July 12, 2023, 09:25:21 AMMache ich ca. 1x im Monat da es auch andere Unterforen gibt wo Änderungen gewünscht werden und wir uns so regelmäßig gegenseitig daran erinnern im Bereich so was Thema geklärt (oder eben nicht geklärt ) wird Also ich kann nichts versprechen aber bleibe dran!Das ist sehr gut zu hören das du in dieser Sache am Ball bleibst.Würde es eventuell mehr anklang und aufmerksamkeit bei theymos bringen oder finden wenn wir einen Topic dafür im META Bereich eröffnen ?Wir müssten uns nur absprechen was und wie genau die änderung sein sollte , eventuell auch einen Poll dazu starten.Dann könnten aus dem deutschen bereich auch die User ihre meinung dazu schreiben dort in dem Thread.Ist nur eine IdeeSry für OT",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}