{
  "id": "topic_5468545",
  "title": "Y3shot",
  "author": "Y3shot",
  "created_time": "September 29, 2023, 12:03:40 PM",
  "content": "Since I know cryptocurrency my biggest fear is to lost all my capital or large amounts in trading or investment, because of the fear in me I don't do things that I'm not sure of or things I don't know. My fear to lose have always been a motivation or a reason for me to know things concerning cryptocurrency,  I fear to start trading when I'm of myself that I know nothing to trade , fear to start investment when I know that I don't have a source of income. My fear have been a motivation to learn,  even If I start trading I may lose but not to lose everything because of the understanding I have. My fear to lose have always made me to take the right decisions and not to make money money my first ultimate in trading and investment but understanding as my first priority. I know some of my mates who are into  cryptocurrency that phobia to lose but even with the fear to lose they still go ahead to trade. If beginners allows their fear to motivate them to learn first their won't be drastic lose in trading.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5468545",
  "comments": [
    {
      "author": "Mia Chloe",
      "created_time": "September 29, 2023, 12:14:29 PM",
      "body": "So are you trying to say fear is your drive in the crypto space? Your write up seems to be a form of motivation to newbies but in the real world fear in trading or hodling will only cause losses because you find yourself selling your hodlings in dip instead of strategizing when to sell and hodl in bull.instead of letting fear drive you I suggest you allow experience and research take the place of fear.QuoteSince I know cryptocurrency my biggest fear is to lost all my capital or large amounts in trading or investment,  the main reason people lose in the crypto space is lack of sufficient knowledge and research  I don't think if you have a good understanding of block chain and Bitcoin basics you will end up just losing your funds or hodlings.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yamane_Keto",
      "created_time": "September 29, 2023, 12:25:01 PM",
      "body": "Being afraid of losing or losing some of your money in trading is a natural feeling. We all do not like to lose money, but what is not understood is the loss of all of your capital or large amounts, as it indicates a problem in your investment strategy. If you diversify your investments, the possibility of there being a loss will decrease. All your capital and the problem becomes how to reduce losses to be much less than profits and thus trading will be profitable. More learning will put an end to the idea of losing all the money from your head and will reduce the loss of large amounts. The only problem remains reducing losses compared to profits.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hatchy",
      "created_time": "September 29, 2023, 12:25:25 PM",
      "body": "Why being scared mate? There's nothing to fear when you have good knowledge and understanding of how Bitcoin works. You just have to be smart and carful type, not the fearful one. Your fear exposes you to more risk and I don't see how fear can motivate someone. Quote from: Y3shot on September 29, 2023, 12:03:40 PMI know some of my mates who are into  cryptocurrency that phobia to lose but even with the fear to lose they still go ahead to trade. If beginners allows their fear to motivate them to learn first their won't be drastic lose in trading.I won't call that fear, but thier ability to recognize that trading  is risky and they should be aware of all potential risk involved before going into trading. I don't think newbies should allow fear or rather FOMO to be a motivation to them, I don't see how it motivates any one. But if you ask questions and do research properly, with enough knowledge theres nothing to be scared of when dealing with Bitcoin or cryptocurrency.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptSafe",
      "created_time": "September 29, 2023, 12:32:10 PM",
      "body": "Fear of the unknown has made lots of people remain in their comfort zones. It is a resistant force that gives one no reason to make an attempt to engage with what seems challenging to make end results. For some people, it is a way forward and to some people, it is a call for caution. When out of curiosity you make a move damning the result or outcome of the situation of the risk taken, you find out that you have learned something new. Ordinarily, one would not have done what you could have done if not for conquering fear. When you put effort into learning doing away with fear no matter the result of it, you find out that you have learned something new, and that knowledge you get keeps you up and doing. Until one conquers fear, one can not be able to make any move for achievement.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Obim34",
      "created_time": "September 29, 2023, 12:41:57 PM",
      "body": "Quote from: Y3shot on September 29, 2023, 12:03:40 PMSince I know cryptocurrency my biggest fear is to lost all my capital or large amounts in trading or investment, because of the fear in me I don't do things that I'm not sure of or things I don't know. My fear to lose have always been a motivation or a reason for me to know things concerning cryptocurrency,  I fear to start trading when I'm of myself that I know nothing to trade , fear to start investment when I know that I don't have a source of income. My fear have been a motivation to learn,  even If I start trading I may lose but not to lose everything because of the understanding I have. My fear to lose have always made me to take the right decisions and not to make money money my first ultimate in trading and investment but understanding as my first priority. I know some of my mates who are into  cryptocurrency that phobia to lose but even with the fear to lose they still go ahead to trade. If beginners allows their fear to motivate them to learn first their won't be drastic lose in trading.HaHa... Talking about FEAR, it is normal as human and no person who does not experience suchFrom research we can tell that fear kills before an incident occurs, it kills ones self esteem, it kills ones efficiency, it creates doubt and deduces one confidence. it is our ability to overcome fear, by not letting it get the better part of us, it is unavoidable as human to have this fear but we have to work on our self esteem and let that phobia get behindTrading is risky but speaking positively to the mind is the ultimate",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bureau",
      "created_time": "September 29, 2023, 12:45:20 PM",
      "body": "I can relate to your fear and I do understand that losing money is scary. The fear of losing money would either end up in ignoring trading or encouraging us to learn to trade. Too much fear will lead to overthinking and overthinking in a risky venture will always lead to failure. The best way to overcome it is by gaining knowledge and following your instincts afterward. I would like to add that trading is risky, if you have the guts to trade and you are open to losing funds while learning then only you should venture into it. Otherwise, stay away from it and think of other options to double your investment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Odohu",
      "created_time": "September 29, 2023, 12:54:12 PM",
      "body": "Quote from: Y3shot on September 29, 2023, 12:03:40 PMSince I know cryptocurrency my biggest fear is to lost all my capital or large amounts in trading or investment, because of the fear in me I don't do things that I'm not sure of or things I don't know. If you are overwhelmed with as a result of your investment, it means you are over investing and this is wrong. Irrespective of how lucrative it may appear, I think being about to invest only what you are comfortable with is the best decision. For clarity, you can never be sure of anything in life and even in cryptocurrency,  there is no guarantees.  Quote from: Y3shot on September 29, 2023, 12:03:40 PMMy fear to lose have always been a motivation or a reason for me to know things concerning cryptocurrency,  I fear to start trading when I'm of myself that I know nothing to trade , fear to start investment when I know that I don't have a source of income.  I will suggest you take some courses on psychology so you will be able to overcome these fears. You can search Mark Douglas on YouTube,  he did some nice work about trading psychology. You cannot win in this market with this level of fear. Understanding that there risk involve and taking steps to mitigate these risks is what lead to success in investing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tabas",
      "created_time": "September 29, 2023, 12:55:13 PM",
      "body": "Quote from: Y3shot on September 29, 2023, 12:03:40 PMSince I know cryptocurrency my biggest fear is to lost all my capital or large amounts in trading or investment, because of the fear in me I don't do things that I'm not sure of or things I don't know. My fear to lose have always been a motivation or a reason for me to know things concerning cryptocurrency,  I fear to start trading when I'm of myself that I know nothing to trade , fear to start investment when I know that I don't have a source of income. Don't trade and don't invest when you're unsure. But here's the catch, you can set aside trading and not learn about it but you need to learn how to take risk in investing. That's the way to go in order for you to gain on this market. If you're not going to learn how to invest and take risk, you'll gain nothing.Quote from: Y3shot on September 29, 2023, 12:03:40 PMMy fear have been a motivation to learn,  even If I start trading I may lose but not to lose everything because of the understanding I have. My fear to lose have always made me to take the right decisions and not to make money money my first ultimate in trading and investment but understanding as my first priority. I know some of my mates who are into  cryptocurrency that phobia to lose but even with the fear to lose they still go ahead to trade. If beginners allows their fear to motivate them to learn first their won't be drastic lose in trading.Overcome your fear, that's what you need to do. Because with fear, it sets the mood to yourself not to try something new or what you really want to do which is to trade and/or to invest. When you always think first of fear, you'll not progress believe me. Just forget about your fear and keep on doing things with thought that you'll learn a valuable lesson whether you achieve success or not.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lionheart78",
      "created_time": "September 29, 2023, 01:01:52 PM",
      "body": "It is normal to have fear and worry about the investment made with Bitcoin.  I agree with @OP that to quell that fear, one must strive to learn and acquire knowledge about the venture he is investing with or trading with.  Knowledge is the best solution for fear since fear is caused by worries about unknown circumstances and having knowledge about Bitcoin trading, the cycles, and the patter of the Bitcoin market will assure us of something in the future.  So learning these knowledge will make us diminish the fears and worries and we will have peace of mind holding our BTC and be ing patient to wait for the future great opportunity to profit.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mayor of ogba",
      "created_time": "September 29, 2023, 01:16:58 PM",
      "body": "QuoteI know some of my mates who are into cryptocurrency that a phobia of losing but even with the fear of losing they still go ahead to trade. If beginners allow their fear to motivate them to learn first there won't be drastic loss in trading.Even when you have prepared yourself with the necessary knowledge in trading the crypto market the first day you will want to trade you will be afraid of losing your funds in trading. Fear is one thing that stops someone from learning a new thing, leave fear aside and go ahead with your plans, if you do that thing and fail you be able to identify your errors, and next time if you do that same thing again you will be able to avoid those errors and do better on that. Experience is the best teacher if you do not leave your fear and try something new you will not have the experience and know how to do better",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pandu Geddon",
      "created_time": "September 29, 2023, 01:49:07 PM",
      "body": "Quote from: Y3shot on September 29, 2023, 12:03:40 PMSince I know cryptocurrency my biggest fear is to lost all my capital or large amounts in trading or investment, because of the fear in me I don't do things that I'm not sure of or things I don't know. My fear to lose have always been a motivation or a reason for me to know things concerning cryptocurrency,  I fear to start trading when I'm of myself that I know nothing to trade , fear to start investment when I know that I don't have a source of income. My fear have been a motivation to learn,  even If I start trading I may lose but not to lose everything because of the understanding I have. My fear to lose have always made me to take the right decisions and not to make money money my first ultimate in trading and investment but understanding as my first priority. I know some of my mates who are into  cryptocurrency that phobia to lose but even with the fear to lose they still go ahead to trade. If beginners allows their fear to motivate them to learn first their won't be drastic lose in trading.I see losses as the beginning of opening up new knowledge for trading or investing. I also failed in my initial trading. even now I can't make up my mind about making a profit in trading. I know it can be maximized with the skills we have. but everything can't just be learned without the courage to try. and losses are inevitable for every beginner who starts.If you feel confident with the skills and knowledge you have, you must have the courage to try. even though it is a failure. but the most important thing is your attitude after gaining trading or investing experience. If you are trapped in that fear, then when you fail you may not come back again.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jawhead999",
      "created_time": "September 29, 2023, 01:53:57 PM",
      "body": "Actually in reality most of people who fear to lose will not learn because they're scared to take a risk. When you're fear to lose your money, you will be very careful and you wouldn't leave your comfort zone. Just like someone who's start a business, there's no business will always make money constantly everyday.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EL MOHA",
      "created_time": "September 29, 2023, 02:08:03 PM",
      "body": "Quote from: Mia Chloe on September 29, 2023, 12:14:29 PMthe main reason people lose in the crypto space is lack of sufficient knowledge and research  I don't think if you have a good understanding of block chain and Bitcoin basics you will end up just losing your funds or hodlings.I would argue a bit about this in two cases, if a user gains knowledge of bitcoin then they can hold their bitcoins safe away from hackers better than the people that do not have knowledge because the knowledgeable person is aware of not storing his coins on exchanges or just any online wallet and also he is aware of things like phishing attacks and this will help him in storing the coins for a very long time even if they store the bitcoin in the same hot wallet as the less knowledgeable person. But in terms of trading which I believe the OP is referring to, no person is save from losing there funds on it. The knowledgeable person only reduces the risk of losing just anyhow that a less knowledgeable person does because he is knowledgeable on many aspects like analysis and stuffs like that. But saying they wouldn’t lose is not something right because even the most favourite team in a game of sport loses sometimes",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Free Market Capitalist",
      "created_time": "September 29, 2023, 02:29:51 PM",
      "body": "I don't know what you guys are so crazy about trading. It is clear that the marketing that promotes it has you well eaten in the head. If you are afraid of trading, just don't do it. I'll give you another reason, well over 90% of traders lose money, this in the stock market, and I'm sure that with cryptocurrency trading is even closer to 100%. So if you are afraid of losing money with trading, you are right. So don't do it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Patrol69",
      "created_time": "September 29, 2023, 02:40:27 PM",
      "body": "If you are afraid of trading or investing then you can never risk money trading or investing. There are many differences between saving and investing. If you save money, the money will be safe but the money will not grow, but if you invest, the money will be leaning but the money will have the potential to grow. If you think that if you invest your money there is a possibility of losing it and if that money is lost it can have a very bad effect on your life then you should refrain from investing. Investment experts always say that you invest as much money as you can afford to lose. You must invest at the risk of losing your money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Doan9269",
      "created_time": "September 29, 2023, 02:50:26 PM",
      "body": "Quote from: Y3shot on September 29, 2023, 12:03:40 PMIf beginners allows their fear to motivate them to learn first their won't be drastic lose in trading.Don't you know if you're considering the beginners, this may be hard to achieve, because there will always be a reason to fear on missing out for any crypto newbie even if their investment is only on bitcoin, now not to also consider those that took the higher risk on altcoins investment, maybe the experienced users may understand better on this than  newbies just starting, this will also not work for a newbie who only invested on memecoins and memetokens and thinking everything will be alright over time, there's no how we can escape the bear market during the period of our investment, but what we Invested is the first access to wether we should have the fear of missing out or not, so every cryptopreneurs should know that bitcoin should be their ultimate first and only decision when starting, especially the beginners.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptomaniac_xxx",
      "created_time": "September 29, 2023, 03:04:39 PM",
      "body": "Quote from: Y3shot on September 29, 2023, 12:03:40 PMSince I know cryptocurrency my biggest fear is to lost all my capital or large amounts in trading or investment, because of the fear in me I don't do things that I'm not sure of or things I don't know. My fear to lose have always been a motivation or a reason for me to know things concerning cryptocurrency,  I fear to start trading when I'm of myself that I know nothing to trade , fear to start investment when I know that I don't have a source of income. My fear have been a motivation to learn,  even If I start trading I may lose but not to lose everything because of the understanding I have. My fear to lose have always made me to take the right decisions and not to make money money my first ultimate in trading and investment but understanding as my first priority. I know some of my mates who are into  cryptocurrency that phobia to lose but even with the fear to lose they still go ahead to trade. If beginners allows their fear to motivate them to learn first their won't be drastic lose in trading.Everyone is afraid to lose mate, not just in crypto trading but as well like in the gambling world as well. However, maybe if you can gain enough experience when you to trading, then perhaps in the long run, you will understand how to mitigate that risk and not lose as much as when you started your journey.So for me it's the experience as you go along with your crypto trading, and this should be your motivation though. The first thing that comes to my mind when I read your post is somewhat negative. Don't get me wrong though, but I don't see how fear becomes a motivation when it's a negative word for everyone.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ultrloa",
      "created_time": "September 29, 2023, 03:05:08 PM",
      "body": "Quote from: Y3shot on September 29, 2023, 12:03:40 PMSince I know cryptocurrency my biggest fear is to lost all my capital or large amounts in trading or investment, because of the fear in me I don't do things that I'm not sure of or things I don't know. My fear to lose have always been a motivation or a reason for me to know things concerning cryptocurrency,  I fear to start trading when I'm of myself that I know nothing to trade , fear to start investment when I know that I don't have a source of income. My fear have been a motivation to learn,  even If I start trading I may lose but not to lose everything because of the understanding I have. My fear to lose have always made me to take the right decisions and not to make money money my first ultimate in trading and investment but understanding as my first priority. I know some of my mates who are into  cryptocurrency that phobia to lose but even with the fear to lose they still go ahead to trade. If beginners allows their fear to motivate them to learn first their won't be drastic lose in trading.That's still good that fear stop you to do risky decision so try to learn from other people and instead of thinking about investment maybe rather try to dig up some information then locate the statements or feedbacks given by people so that you can get a knowledge from them. Their experiences will be your guide so that you can minimize the losses and possibly can think right when profit taking stage is starting to come up on your trades.normal for us to get feared but we should assure that after learning from past experiences we will execute something and try to earn. Since if we don't do any action and continue to get afraid then maybe later on we will regret our decision for not taking early steps. Although its scary to lose but if you will not take the risk you will no gain anything from trading.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rruchi man",
      "created_time": "September 29, 2023, 03:13:39 PM",
      "body": "Quote from: Y3shot on September 29, 2023, 12:03:40 PMSince I know cryptocurrency my biggest fear is to lost all my capital or large amounts in trading or investment, because of the fear in me I don't do things that I'm not sure of or things I don't know. My fear to lose have always been a motivation or a reason for me to know things concerning cryptocurrency,  I fear to start trading when I'm of myself that I know nothing to trade , fear to start investment when I know that I don't have a source of income. Fear can be a good motivation to do or start something the right way, but fear which can be good, can also be very bad. Fear can limit you and make you set mental barriers for yourself. Fear can get you feeling the need to play it too safe which is not too good because in playing it too safe, never pushing yourself because of fear, you will remain the way you are. Fear can be cautioning to you when you think of trading bitcoins, but do not let the fear make you never consider getting knowledge about trading to start it or even trying to start investing in bitcoins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}