{
  "id": "topic_5444861",
  "title": "DevFile90",
  "author": "DevFile90",
  "created_time": "March 14, 2023, 11:33:20 AM",
  "content": "Will things turn around for Gpu miners in the next bull market? I don't want to wait till we are in a bull market before I buy cheap graphic cards, I am planning to buy once BTC halving is successful,  but do you think that a new life will be breath into graphic cards profits again.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5444861",
  "comments": [
    {
      "author": "sxemini",
      "created_time": "March 14, 2023, 12:52:35 PM",
      "body": "Like every time yes, but keep in mind bullmarket and cheap gpus - not really. Why waiting for the BTC halving? If you want to mine for long time, buy now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dowper_",
      "created_time": "March 14, 2023, 01:26:44 PM",
      "body": "Yes, the halving is too far away and the prices then will not be cheap for sure.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FP91G",
      "created_time": "March 15, 2023, 09:36:37 AM",
      "body": "Quote from: DevFile90 on March 14, 2023, 11:33:20 AMWill things turn around for Gpu miners in the next bull market? I don't want to wait till we are in a bull market before I buy cheap graphic cards, I am planning to buy once BTC halving is successful,  but do you think that a new life will be breath into graphic cards profits again. There are still a lot of video cards in mining and only old video cards of the 1000 and 2000 series of Nvidia and AMD analogs have fallen in price. Many miners do not sell cheap 3000 series, because it is still relevant in the mining of new coins. New coins will appear, and there will probably not be stable ones like Ethereum this year.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "batsonxl",
      "created_time": "March 16, 2023, 02:38:45 PM",
      "body": "It has to turn around this is big industry now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "swogerino",
      "created_time": "March 17, 2023, 08:37:46 AM",
      "body": "Quote from: sxemini on March 14, 2023, 12:52:35 PMLike every time yes, but keep in mind bullmarket and cheap gpus - not really. Why waiting for the BTC halving? If you want to mine for long time, buy now.To OP,Exactly this advice.If you want to be prepared follow this advice and buy cheap GPU-s now,now we are still in a crypto winter market and despite some sort of recovery the price of GPU-s are still low compared to the bull run which they were extremely high.Another limiting factor is the energy price but most cards are efficient and can make you a decent daily amount of crypto for a normal rig with 6 GPU-s and you will be with not a lot of loss (which people fighting for the long run should absorb as there is no other way around this) and hope for the best in the next bull run,that is the best strategy to prepare,you are not late even if you start now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FP91G",
      "created_time": "March 17, 2023, 01:31:56 PM",
      "body": "Quote from: swogerino on March 17, 2023, 08:37:46 AMQuote from: sxemini on March 14, 2023, 12:52:35 PMLike every time yes, but keep in mind bullmarket and cheap gpus - not really. Why waiting for the BTC halving? If you want to mine for long time, buy now.To OP,Exactly this advice.If you want to be prepared follow this advice and buy cheap GPU-s now,now we are still in a crypto winter market and despite some sort of recovery the price of GPU-s are still low compared to the bull run which they were extremely high.Another limiting factor is the energy price but most cards are efficient and can make you a decent daily amount of crypto for a normal rig with 6 GPU-s and you will be with not a lot of loss (which people fighting for the long run should absorb as there is no other way around this) and hope for the best in the next bull run,that is the best strategy to prepare,you are not late even if you start now.And what video cards are cheap now? Nvidia's 4000 series is very expensive and I don't like the new power connectors. The 3000 series is not so cheap, and I have no great desire to buy Chinese handmade with mobile chips without a guarantee.Maybe buy coins?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Synchronice",
      "created_time": "March 17, 2023, 08:37:59 PM",
      "body": "Quote from: FP91G on March 15, 2023, 09:36:37 AMQuote from: DevFile90 on March 14, 2023, 11:33:20 AMWill things turn around for Gpu miners in the next bull market? I don't want to wait till we are in a bull market before I buy cheap graphic cards, I am planning to buy once BTC halving is successful,  but do you think that a new life will be breath into graphic cards profits again. There are still a lot of video cards in mining and only old video cards of the 1000 and 2000 series of Nvidia and AMD analogs have fallen in price. Many miners do not sell cheap 3000 series, because it is still relevant in the mining of new coins. New coins will appear, and there will probably not be stable ones like Ethereum this year.According to whattomine.com, almost every GPU is useless if you don't have free electricity. Even if you pay 0.1 USD per kWh, Nvidia GeForce RTX 4090, Nvidia GeForce RTX 4080, and Nvidia GeForce RTX 4070 Ti are the only ones that generate income higher than ten cents. These GPUs are very expensive and price/expense to income ratio doesn't worth to my mind, especially when there is a chance that new ASICs increase mining difficulty and GPUs will become more useless for this purpose.Bitmain AntMiners, on another hand, are doing well and are way better choices for mining in terms of price/expense to income ratio.And if the aim is to mine new coins with the hope that one day they'll increase in price, then isn't trading more beneficial?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sp_",
      "created_time": "March 17, 2023, 09:37:18 PMLast edit: March 18, 2023, 12:11:51 AM by sp_",
      "body": "Quote from: Synchronice on March 17, 2023, 08:37:59 PMAccording to whattomine.com, almost every GPU is useless if you don't have free electricity. Even if you pay 0.1 USD per kWh, Nvidia GeForce RTX 4090, Nvidia GeForce RTX 4080, and Nvidia GeForce RTX 4070 Ti are the only ones that generate income higher than ten cents. These GPUs are very expensive and price/expense to income ratio doesn't worth to my mind, especially when there is a chance that new ASICs increase mining difficulty and It's still profitable to mine with the gpu but you have to mine more than one algorithm at once. Old calculators doesn't give the real profit. P102-100 (2018) profitable at $0.2 per kWh, mining ETC+VTC+ZIL+KASPA",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rdluffy",
      "created_time": "March 18, 2023, 11:09:08 AM",
      "body": "A few months ago I created a similar thread: https://bitcointalk.org/index.php?topic=5430177.0I am also curious to know the plans and strategies of each one, to help my choice and follow the trends.I have been through 2 mining cycles.I went into 2017, bought gpus for a good price and sold them for a good price too, but ended up with a bag of coins.In 2020 I was able to get back in at a great time, I bought gpus for great prices and mined as far as I could, and still sold some gpus at a good price (most rx5700 series). This time I learned my lesson and sold some coins to then buy again in the bear market.Now for the future, I'm always keeping an eye here in the forum, especially in the mining tab, and also in other places like twitter and youtube to try to find that moment again to buy new video cards.Of course it depends a lot on a new strong minable coin after ETH.It seems that is starting a new bull run of BTC and consequently altcoins, and perhaps in a brief future mining can return to give more profits, but my prediction until this moment was for 2024 and would be with the new Nvidia video cards, which would be the 5xxx series.There is also another detail that I am keeping an eye on: gpus are not selling as much as expected, of course, after most people have stopped mining and there are a lot of used gpus on the market.But at some point there might be a price cut in the 3xxx or 4xxx series that might be interesting to buy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pterosaur",
      "created_time": "March 18, 2023, 12:34:35 PM",
      "body": "Quote from: sp_ on March 17, 2023, 09:37:18 PMQuote from: Synchronice on March 17, 2023, 08:37:59 PMAccording to whattomine.com, almost every GPU is useless if you don't have free electricity. Even if you pay 0.1 USD per kWh, Nvidia GeForce RTX 4090, Nvidia GeForce RTX 4080, and Nvidia GeForce RTX 4070 Ti are the only ones that generate income higher than ten cents. These GPUs are very expensive and price/expense to income ratio doesn't worth to my mind, especially when there is a chance that new ASICs increase mining difficulty and It's still profitable to mine with the gpu but you have to mine more than one algorithm at once. Old calculators doesn't give the real profit. P102-100 (2018) profitable at $0.2 per kWh, mining ETC+VTC+ZIL+KASPA I have never seen where a graphic card is capable of mining four different coins at the same times, different algorithms for that matter, are you for real? For the fact that this is running on a P102-100 gpu makes me believe this can't be real, that is a weak graphic card, can you provide a screenshot?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FP91G",
      "created_time": "March 18, 2023, 03:50:42 PM",
      "body": "Quote from: Pterosaur on March 18, 2023, 12:34:35 PMQuote from: sp_ on March 17, 2023, 09:37:18 PMQuote from: Synchronice on March 17, 2023, 08:37:59 PMAccording to whattomine.com, almost every GPU is useless if you don't have free electricity. Even if you pay 0.1 USD per kWh, Nvidia GeForce RTX 4090, Nvidia GeForce RTX 4080, and Nvidia GeForce RTX 4070 Ti are the only ones that generate income higher than ten cents. These GPUs are very expensive and price/expense to income ratio doesn't worth to my mind, especially when there is a chance that new ASICs increase mining difficulty and It's still profitable to mine with the gpu but you have to mine more than one algorithm at once. Old calculators doesn't give the real profit. P102-100 (2018) profitable at $0.2 per kWh, mining ETC+VTC+ZIL+KASPA I have never seen where a graphic card is capable of mining four different coins at the same times, different algorithms for that matter, are you for real? For the fact that this is running on a P102-100 gpu makes me believe this can't be real, that is a weak graphic card, can you provide a screenshot? I have not heard about Kaspa coin mining in 2018. I looked at the history of this coin, the development has been going on since 2013, but the blockchain started in 2021 and was not popular. The P102-100 video card was an analogue of the GTX 1080 and this video card now has a very small profit when mining Kaspa.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sp_",
      "created_time": "March 18, 2023, 06:22:16 PM",
      "body": "Quote from: Pterosaur on March 18, 2023, 12:34:35 PMI have never seen where a graphic card is capable of mining four different coins at the same times, different algorithms for that matter, are you for real? For the fact that this is running on a P102-100 gpu makes me believe this can't be real, that is a weak graphic card, can you provide a screenshot? The team black miner can miner 3 coins at the same timehttps://github.com/sp-hash/TeamBlackMiner/tree/main/Windows%20Launch%20Scripts/ETC%2BVTC%2BZILKASPA doesn't use the memory part of the gpu so it can be mined in parallell with ETC+ZIL+VTC. ZIL pow is 1 minute of mining in every hour. VTC is only using 50% memory so ETC can be mined with a small profit in parallellP100-102 from 2018 (similar to gtx 1080ti)ETC: 10MHASH $0.0298  (Ethereum classic)ZIL: 50MHASH $0.2901 (Zilliqa)VTC; 860khash $0.1911 (vertcoin)kaspa: 440MHASH $0.2602 (kaspa)$0.77 profit per 24hour.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FP91G",
      "created_time": "March 19, 2023, 09:45:45 AM",
      "body": "Quote from: sp_ on March 18, 2023, 06:22:16 PM$0.77 profit per 24hour.Do you have instructions on how to set up mining of these 4 coins on Hive OS? I sold the Gtx 1080, but I want to try it on RTX 2070 graphics cards. I want to test the power consumption and temperature of the graphics cards while it's still cold.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sp_",
      "created_time": "March 19, 2023, 12:02:54 PM",
      "body": "Quote from: FP91G on March 19, 2023, 09:45:45 AMDo you have instructions on how to set up mining of these 4 coins on Hive OS? I sold the Gtx 1080, but I want to try it on RTX 2070 graphics cards. I want to test the power consumption and temperature of the graphics cards while it's still cold.Not possible in Hiveos because can't run more than one miner. But we are adding kaspa to TBM soon.setup 3 coins in hive.choose etc as main coinpool eu.crazypool.org port 7000adress is your ethereum classic adressThen you put zil and vertcoin in the Extras config (replace with your wallets).--algo etc+vtc --server-passwd %ZIL_WALLET% --vtc-wallet %VTC_WALLET% --vtc-hostname pool.eu.woolypooly.com --vtc-port 3102 Hiveos doesn't support stats on more than one coin, so you will have to use the pool stats. If you don't want to use crazypool you can use another pool with ETC+ZIL or nicehash daggerhashimoto port",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Synchronice",
      "created_time": "March 19, 2023, 06:39:02 PM",
      "body": "Quote from: sp_ on March 18, 2023, 06:22:16 PMQuote from: Pterosaur on March 18, 2023, 12:34:35 PMI have never seen where a graphic card is capable of mining four different coins at the same times, different algorithms for that matter, are you for real? For the fact that this is running on a P102-100 gpu makes me believe this can't be real, that is a weak graphic card, can you provide a screenshot? The team black miner can miner 3 coins at the same timehttps://github.com/sp-hash/TeamBlackMiner/tree/main/Windows%20Launch%20Scripts/ETC%2BVTC%2BZILKASPA doesn't use the memory part of the gpu so it can be mined in parallell with ETC+ZIL+VTC. ZIL pow is 1 minute of mining in every hour. VTC is only using 50% memory so ETC can be mined with a small profit in parallellP100-102 from 2018 (similar to gtx 1080ti)ETC: 10MHASH $0.0298  (Ethereum classic)ZIL: 50MHASH $0.2901 (Zilliqa)VTC; 860khash $0.1911 (vertcoin)kaspa: 440MHASH $0.2602 (kaspa)$0.77 profit per 24hour.Wait, you say that 1 GPU generates roughly 4 times more money with TBminer? I don't know too much about mining but as far as I know, when you mine coin, your GPU with whole resources is 100% focused on that coin, people even overclock it for maximum performance. If you mine two coins, than your GPU will automatically dedicate half of hashrate to one coin and another half to another coin, right? But as you say, KASPA doesn't use the memory part of the GPU, then what part is used?Can you link any calculator that gives us possibility to calculate the maximum profitability potential by including mining of as much coin as possible without significantly interapting with GPU performance?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sp_",
      "created_time": "March 19, 2023, 10:15:05 PM",
      "body": "Quote from: Synchronice on March 19, 2023, 06:39:02 PMWait, you say that 1 GPU generates roughly 4 times more money with TBminer? I don't know too much about mining but as far as I know, when you mine coin, your GPU with whole resources is 100% focused on that coin, people even overclock it for maximum performance. If you mine two coins, than your GPU will automatically dedicate half of hashrate to one coin and another half to another coin, right? But as you say, KASPA doesn't use the memory part of the GPU, then what part is used?Can you link any calculator that gives us possibility to calculate the maximum profitability potential by including mining of as much coin as possible without significantly interapting with GPU performance?Some coins can be mined together because they use different parts of the parallel gpu, or they have long pauses between the POW work. Kaspa is using the cache-memory and the cores inside the gpu. While the gpu is waiting for the random memory to complete, the cores are idle and can perform more work. ZIL POW is only 1 minute of mining every hour, and ETC is only able to use 5-10% ETC (5-10% of standalone)VTC (99% of standalone speed)ZIL (100% of standalone speed) (59 minutes idle with 0 gpu usage, and 1 minute of 100% gpu usage)KASPA (80% of standalone speed)Another profitable combo with the TBM miner is ETC+RVN+ZIL. Kaspa cannot be mined with raven because raven is using most of the cores already",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zenrog",
      "created_time": "March 20, 2023, 12:06:25 AM",
      "body": "So is there a calculator that includes all algorithms at once?Whattomine is out of date",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JayDDee",
      "created_time": "March 20, 2023, 12:27:26 AM",
      "body": "Quote from: zenrog on March 20, 2023, 12:06:25 AMWhattomine is out of date They all are because they predict the past. The math hasn't changed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dansus021",
      "created_time": "March 20, 2023, 12:46:38 AM",
      "body": "I would agree if you buy a whole bitcoin rather than buy a graphic card, Graphic Card is best for multi algorithm program. But if you have a spare money the best way is buy an asic Antminer has a bunch of multi algo miner - https://shop.bitmain.com/But yes there is always coin that can be mined by the GPU",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}