{
  "id": "topic_5409632",
  "title": "bonfire66",
  "author": "bonfire66",
  "created_time": "August 12, 2022, 03:48:02 PM",
  "content": "Навеяно последними новостями. Тут есть такая тема. А если вот силы НАТО блокируют путь кораблей с грузами для калининградской области, а Литва заблокирует транзит фур и поездов через свою территорию, то что дальше? Например, возможен ли ЧЕСТНЫЙ Референдум о вхождении калининградской области в состав Германии? Не прям сразу уж завтра, а пусть калининградцы поголодают 2-3 месяца и еще немного подумают. Может быть и передумают быть в составе России. Тем более, как мне кажется, на их стороне будет вся НАТА. А что тут такого? Почему ДНР и ЛНР можно выйтить из состава Украины, а Калининграду нельзя? Чем калининиградцы хуже? Или не хуже? Почему уже объявлен легитимным референдум о вхождении Запорожской области в состав России, то чем легитимность референдума о вхождении Калинингрдаской области в состав Германии хуже? Если исходить их исторических концептов, то Кенигсберг, увы, более немецкий, чем Херсон русский. Так что историческая справедливость должна восторжествовать! И пусть свою участь решают народы Калининградской области и окрестностей!",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5409632",
  "comments": [
    {
      "author": "Snork1979",
      "created_time": "August 12, 2022, 05:16:25 PM",
      "body": "Quote from: bonfire66 on August 12, 2022, 03:48:02 PMА если вот силы НАТО блокируют путь кораблей с грузами для калининградской области, а Литва заблокирует транзит фур и поездов через свою территорию, то что дальше?А дальше будет полный пиздец гордым прибалтийским хомячкам. Потому что блокировка нейтральных вод военными кораблями - это, по сути, объявление войны.Quote from: bonfire66 on August 12, 2022, 03:48:02 PMПочему уже объявлен легитимным референдум о вхождении Запорожской области в состав России, то чем легитимность референдума о вхождении Калинингрдаской области в состав Германии хуже?Так езжай в Калининград и объявляй там референдум имени Бонифация.В чем твоя проблема то, укро-бот? (которому, якобы, \"насрать на Украину\")",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bonfire66",
      "created_time": "August 12, 2022, 05:20:07 PM",
      "body": "Может быть и так. А может быть и нет. А вы можете обосновать. например, примерно рассказать как все будет? И  каким образом ЖАЛКИЙ балтийвский флот, который даже во времена ВОВ не мог противостоять фашистам, и жался по углам, теперь сможет противостоять силам НАТО?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Snork1979",
      "created_time": "August 12, 2022, 05:23:27 PM",
      "body": "Quote from: bonfire66 on August 12, 2022, 05:20:07 PMА вы можете обосновать. например, примерно рассказать как все будет?Вот же глупый то ...Я же тебе уже сказал: езжай в Калининград и организуй там свой референдум.Заодно и про Балтийский флот вопросы задашь местным. И, я уверен, что тебе понятно и доступно всё объяснят. Хоть ты и слепой как крот и глухой как полено )(ты ведь именно по этим причинам от призыва косишь? Я правильно помню?)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "xenon131",
      "created_time": "August 12, 2022, 07:01:33 PM",
      "body": "C 22 летием \"Курска\"!!!          Вода им серной кислотой.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}