{
  "id": "topic_5443704",
  "title": "Greg Tonoski",
  "author": "Greg Tonoski",
  "created_time": "March 06, 2023, 09:50:34 AM",
  "content": "What non-digital storage for secret material (private keys) would you recommend? What advantages would it have over handwriting with a regular pen on paper?There are example of CryptoSteel Capsule and Cassette. Anything else worth recommending?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5443704",
  "comments": [
    {
      "author": "digaran",
      "created_time": "March 06, 2023, 10:04:27 AM",
      "body": "Tattoo, engraving on the walls of caves, etc. Just don't think too much about it. How many backups do the banks have of account information? 2 or 3, so for bitcoin that's enough.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dzungmobile",
      "created_time": "March 06, 2023, 10:16:00 AM",
      "body": "Crypto security - Additional protection for your seed / private keyThere are different tests and you can see in that topic or in https://blog.lopp.net/metal-bitcoin-seed-storage-stress-tests-round-vi/amp/If you are not feasible to buy those metal sheets, you can backup your seeds in paper piece but must keep them safe from water, fire, etc.Don't store backup online as morr online exposure, more risk that it will be leaked, hacked.Cryptocurrency security checklistTry to set up and use multi signature wallet that is safer than single signature wallet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Plaguedeath",
      "created_time": "March 06, 2023, 01:10:52 PM",
      "body": "Quote from: digaran on March 06, 2023, 10:04:27 AMTattoo, engraving on the walls of caves, etc. Just don't think too much about it. How many backups do the banks have of account information? 2 or 3, so for bitcoin that's enough.  The problem of banks they're store every accounts information in online, so they can access it whenever they forgot or the data are corrupted in offline storage. Even the hacker know anything about the user's information, they can't have access with the funds or they could freeze your funds if you withdraw large amount money due to suspicious activity.In non custodial wallet, no one will control the user, that's why store private keys or seed phrase in online is really a bad idea.Honestly having a backup in physical are work same, the only thing is different is the media/tool you used.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cantsay",
      "created_time": "March 06, 2023, 01:34:29 PM",
      "body": "Quote from: Greg Tonoski on March 06, 2023, 09:50:34 AMWhat non-digital storage for secret material (private keys) would you recommend? What advantages would it have over handwriting with a regular pen on paper?There are example of CryptoSteel Capsule and Cassette. Anything else worth recommending?Buy a fireproof and waterproof safe and put your secret phrase inside if it's written on a piece of paper. But make sure you add other paper as well, don't just keep only the paper that holds the phrase add others as well to help you mask the real one.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "March 06, 2023, 01:36:26 PM",
      "body": "What else are your looking for specifically? I couldn't think of anything close to being better than steel(either a sheet or preferably, washers due to it looking a lot more non-important), or at least paper on a fire-proof safe.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Macadonian",
      "created_time": "March 06, 2023, 01:46:55 PM",
      "body": "Quote from: digaran on March 06, 2023, 10:04:27 AMTattoo, engraving on the walls of cavesI do not know if you are joking I think you might be but a tattoo is a terrible idea because it could be displayed to other people and your 2nd option is only good if people do not have access to the cave and because most people do not have caves in their yards it is a terrible idea.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Welsh",
      "created_time": "March 06, 2023, 02:56:51 PM",
      "body": "This thread talks about various different methods, but mainly focused around metal washers. The advantages are mainly durability. Obviously, paper isn't exactly water proof, is sensitive to heat, and has some concerns regarding the ink used. So, hammers your seed into metal or potentially engraving it, could have some benefits for longevity. Personally, I wouldn't recommend using a steel card or something provided by a company, when you can source the material yourself for much cheaper, and it doesn't have their branding on it which could potentially be a security concern in itself if any ever happened upon it. Whereas, with things like washers, they can easily go unnoticed even if someone does stumble upon them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TabernaBitcoin",
      "created_time": "March 06, 2023, 03:13:23 PM",
      "body": "I think this is a good option: https://incoherency.co.uk/blog/stories/diy-cryptosteel-capsule.html",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "348Judah",
      "created_time": "March 06, 2023, 03:26:13 PM",
      "body": "Quote from: digaran on March 06, 2023, 10:04:27 AMTattoo, engraving on the walls of cavesI will go with this recommendation, recently, i saw a post online that also talks about yhe discovery of bitcoin painting in a cave, we can consider it safe because people rarely go there and seing lives around such environment is something not too common, one can give it a try but yet it has do go along with coding the keys by writing it along with a sentence in other not to focus attention on it for something of importance and value.Archeologist made a discovery of bitcoin painting in a cave over decadeshttps://twitter.com/MemeingBitcoin/status/1613920469421522944?t=SI6HKelP9ywR1B6iGkjwiQ&s=19",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nwada001",
      "created_time": "March 06, 2023, 04:30:58 PMLast edit: March 06, 2023, 05:52:52 PM by Nwada001",
      "body": "Electronic or handwritten private key for safekeeping. All that matters is safety, so choose the option you think you can best secure. If you are good at maintaining electronic devices, which you must make sure no damage can come to, and they are stored offline out of the reach of hackers, then you can use electronic devices. And if you happen to be the type who can keep your handwritten private key somewhere where it can't be exposed, then you can use that. Its ability to be an advantage depends on who uses it and how protective they can be.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "thecodebear",
      "created_time": "March 06, 2023, 05:53:47 PM",
      "body": "Paper wallet and engraving on metal would be the best. Obviously engraving only for an address you plan to hold a long time without using. You should have a few backups so you could do a couple metal engravings and a couple paper wallets for the same address, keep them different places.I personally have 3 paper wallet backups to the paper wallet that I keep.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dkbit98",
      "created_time": "March 06, 2023, 09:24:19 PM",
      "body": "Quote from: Greg Tonoski on March 06, 2023, 09:50:34 AMWhat non-digital storage for secret material (private keys) would you recommend? What advantages would it have over handwriting with a regular pen on paper?Best option for me is to buy stainless steel washers in local store, engrave on them seed words with hammer/tools, connect them with screw and keep in secure place.This will survive much longer than pen and paper, it will resist fire or water, and you can bring it anywhere with yourself or hide it in multiple locations.If you search in bitcointalk forum (and internet) you will find several instructions how to make your own DIY version stainless steel washers, and some stress testing. Here is one example with lot of extra stuff added:https://bitcointalk.org/index.php?topic=5389446.0",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hatshepsut93",
      "created_time": "March 06, 2023, 09:46:29 PM",
      "body": "There's a risk that if you are using a durable storage method, it can backfire. Consider a situation like a house fire or a flood or a tornado. A house gets destroyed, someone loots the ruins and finds the perfectly intact steel plates and takes the coins. While the owner is in the hospital or just wasn't lucky enough. But if a piece of paper was used, it would likely be destroyed.The best security model is having your backups in different places far apart from each other. This is more important than metal vs paper.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}