{
  "id": "topic_5398040",
  "title": "pakhitheboss",
  "author": "pakhitheboss",
  "created_time": "May 10, 2022, 02:46:00 PM",
  "content": "Did anyone watch NAS Daily's YouTube channel recently. They interviewed CZ as  Most Humble Crypto Billionaire . Does anyone here thinks this video really meant with the concept of \" truly believe in something\"? I felt it was more of a gimmick and a way to promote Binance in the middle east as he was wearing the Binance Tshirt and also at 3:20 Binance exchange was introduced. By using these statement \" Even his own mother said, he was a stupid kid and he was wasting money\", they showed nothing is impossible with Binance. Another intelligent and unique marketing approach by CZ. This is what is called  shadow marketing .Link to the video Code:https://youtu.be/W0vEdn2jwyI",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5398040",
  "comments": [
    {
      "author": "mk4",
      "created_time": "May 10, 2022, 04:38:03 PM",
      "body": "Not sure which specific part makes you think it's \"shadowy\", but it seems like pretty typical marketing to me. You pay a huge influencer (Nas Daily is pretty huge) and the influencer promotes you (and your business/platform) on his social channels. Nothing really new here.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cookdata",
      "created_time": "May 10, 2022, 05:07:35 PM",
      "body": "There is nothing bad in the video, just a marketing strategy making people believe that if CZ mum can call him a stupid kid and was able able to make it, they can do it too. I know that NAS guy and he has interviewed a couple of billionaires, some wealthy people who made the impossible become possible, some billionaires who were born and raise in trenches but now living large with huge steps in investments.CZ was able to create a platform to unite people, collect their Identifications and Documents, and collect withdrawal fees. Today, he is among the crypto richest but since you and I don't want to get involved in centralization, buy and hold your Bitcoin on your wallet like satoshi advice.Don't be like CZ.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackHatCoiner",
      "created_time": "May 10, 2022, 05:33:57 PM",
      "body": "If I have to hear one more time the phrase \"blockchain technology\", I think I'm going to puke.TLDR; a poker player sold his $1M house in 2013 to buy bitcoin. Now he's stopped playing poker, because it's a dumb idea to gamble (LOL) and 9 years now, he's working to make the world a better place. Happily ever after. Seriously now, I don't know about you, but I'm honestly annoyed from the fact that this, along with the following is the cryptocurrency content the media's showing nowadays:  In contrast with 8 years ago:",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "May 10, 2022, 06:02:41 PM",
      "body": "Quote from: pakhitheboss on May 10, 2022, 02:46:00 PM---snipped---No one will not want to promote his product or service, I do not see nything CZ did wrong and his story is touching as he stopped playing poker and downloaded bitcoin white paper which is the beginning of his career that we all know today.CZ did not change the fact that his friend asked him if he has heard about bitcoin in 2013, he downloaded bitcoin white paper and read about it and knew bitcoin is has future.He sold his appointment for $1 million and used it to buy bitcoin which crashed 70% after and he lost $700000 at the time, his mum called him stupid that he wasted money, but bitcoin increased to the extent that the $1 million he invested that people like his mum thought would have been a loses is now worth more a lot than $1 million.Although, that would promote Binance as he wore a shirt that Binance was written on it, but, yet, Binance is still the largest exchange in the world.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cabron",
      "created_time": "May 10, 2022, 06:32:40 PM",
      "body": "Nothing seem wrong in promoting in Middle East.  Nas Daily has 7.77M subscribers that's a lot to reach so why not. If Binance wants to get more people in the platform, he'd pay to get that exposure. You see in the end of the video they bump fist saying \"we're done.\" If the story is true then he didn't start being a poor man really, he just discover and fascinated by Bitcoin and then started a team to develop his exchange. Good timing I guess because it was also the time of ICOs.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackHatCoiner",
      "created_time": "May 10, 2022, 06:33:32 PM",
      "body": "Quote from: Charles-Tim on May 10, 2022, 06:02:41 PMNo one will not want to promote his product or serviceUm... What? The video is a synonym of advertisement. That's what Nas Daily does, and probably every other YouTuber of the same niche; the only thing he didn't say is \"Register to Binance with my promo!\". Quote from: Charles-Tim on May 10, 2022, 06:02:41 PMI do not see nything CZ did wrongFrom the video? No. Outside the video? Well, he's silently mocking everyone by impinging upon on every trickle of privacy that's left from his clients, sells their personal data to chain analyzers, Putin, his mom, charges unjustifiably high fees for withdrawals, blackmails for further info and promotes a scum token, so yeah, he's kinda wrong in some ways.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "May 10, 2022, 08:12:59 PM",
      "body": "Quote from: BlackHatCoiner on May 10, 2022, 06:33:32 PMFrom the video? No. Outside the video? Well, he's silently mocking everyone by impinging upon on every trickle of privacy that's left from his clients, sells their personal data to chain analyzers, Putin, his mom, charges unjustifiably high fees for withdrawals, blackmails for further info and promotes a scum token, so yeah, he's kinda wrong in some ways. I meant from the video. About others, Binance is a centralized exchange, anyone that gives his personal data and got registered on Binance or any other centralized exchange or service should expect that their data can be sold, hacked or exposed to other parties. We know that the best way to privacy is by never giving out personal data to get verified.About fee, Binance withdrawal fee for altcoins are not much, unlike exchanges like HitBTC and some others. For bitcoin, on Binance, the withdrawal fee was 0.0005 BTC before, but has been reduced to 0.0002 BTC. Although, it is still high if compared to onchain bitcoin transaction fee.About altcoins pegged with bitcoin on BEP2, BEP20, ERC20 and on other networks, that is really a means to make people mistaken those altcoins for bitcoin, and because of low fee, some people will withdrawal from such exchange into altcoin network thinking it is bitcoin network.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dkbit98",
      "created_time": "May 11, 2022, 02:48:07 PM",
      "body": "Quote from: pakhitheboss on May 10, 2022, 02:46:00 PMDid anyone watch NAS Daily's YouTube channel recently. They interviewed CZ as  Most Humble Crypto Billionaire . Does anyone here thinks this video really meant with the concept of \" truly believe in something\"? This is the first time I watched this video and only new thing I see here is that CZ has a new bald haircut, and he continues to spread marketing for his regulator ass kissing Binance exchange, but I can understand this.He is not stupid like his mother told him, but selling his apartment worth 1$ million dollars and buying bitcoin is proving that he was never really a poor humble guy.It funny that CZ saying he doesn't care about money while in the same time making his own copy of ethereum blockchain and fake bitcoin token.I don't know a single humble guy who brags everywhere how humble he is, and pays someone to advertise that...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Darker45",
      "created_time": "May 12, 2022, 02:47:10 AM",
      "body": "This is purely marketing. That's all. This is nothing but an effort to win hearts and money. And the latter is always more important than the former, although sometimes it is a bit necessary to capture the former to gain the latter. This is true to both CZ and NAS Daily. Of course, they have to make a script that is somehow touching and encouraging. That's typical NAS Daily. On the part of CZ, it doesn't matter for as long as it is promoting his name and business.From a certain standpoint there's nothing wrong with this. But from someone who has read a little more about CZ, Binance, NAS Daily, and Nuseir Yassin, this might come nauseating.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "May 13, 2022, 09:52:43 AM",
      "body": "I know and watch a lot of Arabic content on YouTube, but it is the first time that I hear about Nas Daily's[1] channel. They seem to be famous, but I don't think they are famous in the Arab world, or at least those who live in the Middle East countries.Frankly, the video is cute, and the promotion of the platform is not pretentious, but he showed himself in the advertisement, which suggests that he is trying to show himself as a figure with influence in cryptocurrencies and is not trying to hide himself as most developers do.[1] https://nasdaily.com/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ultrloa",
      "created_time": "May 13, 2022, 12:20:57 PM",
      "body": "Quote from: pakhitheboss on May 10, 2022, 02:46:00 PMDid anyone watch NAS Daily's YouTube channel recently. They interviewed CZ as  Most Humble Crypto Billionaire . Does anyone here thinks this video really meant with the concept of \" truly believe in something\"? I felt it was more of a gimmick and a way to promote Binance in the middle east as he was wearing the Binance Tshirt and also at 3:20 Binance exchange was introduced. By using these statement \" Even his own mother said, he was a stupid kid and he was wasting money\", they showed nothing is impossible with Binance. Another intelligent and unique marketing approach by CZ. This is what is called  shadow marketing .Link to the video Code:https://youtu.be/W0vEdn2jwyIAlthough the story shown by NAS is quite good but absolutely they do powerful marketing in that video and for sure for how big the audience what NAS got for sure Binance got huge impression to its viewers. I don't know if CZ paid NAS for that video but one thing we can sure here they do that for marketing Binance to the world.But I don't see any problem with this since if this one could help bitcoin or crypto then they are doing great with this.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}