{
  "id": "topic_5466656",
  "title": "Disruptivas",
  "author": "Disruptivas",
  "created_time": "September 13, 2023, 12:51:39 PM",
  "content": "Games, metaversos e memes muitas vezes ocupam os holofotes das #criptomoedas. Mas, como diz o ditado, o dinheiro de verdade foge dos holofotes.Recentemente, descobri alguns dados sobre Real World Assets  que me surpreenderam bastanteCrédito privado em DeFI Rails Valor dos empréstimos ativos: $ 552 milhõesValor total dos empréstimos: $4 bilhõesAvg. APR: 9.76%Número de Empréstimos: 1.7kTesouro dos US Tokenizados Valor total dos empréstimos: $625 milhõesAvg. APR: 5.25%Fonte: https://app.rwa.xyz/treasuriesA parte mais surpreendente talvez seja os players envolvidos nessas ofertas. Um dos exemplos, é o Franklin Templeton, responsável pela gestão de $1.5 TRILHÕES e negocia em crypto o Franklin OnChain U.S. Government Money Fund ($FOBXX)Vocês tinham ideia desses números?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5466656",
  "comments": [
    {
      "author": "tg88",
      "created_time": "September 13, 2023, 04:33:04 PM",
      "body": "Não fazia ideia, inclusive é esta gestora Franklin Templeton que entrou com pedido de ETF de BTC nessa semana. É impressionante atualmente para onde olharmos cripto está presente assim está ficando cada vez mais difícil para esse governo dos EUA lutar tão contra.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "September 13, 2023, 07:00:09 PM",
      "body": "Também desconhecia, esse envolvimento de tantos fundos de investimento - chamemos assim.Curioso é que é tudo praticamente recente. O mais antigo é WisdomTree Short-Term Treasury Digital Fund, que tem uma maturidade de quase 2 anos. Os restantes tem todos apenas alguns meses. Como esse tal Franklin, que começou apenas algumas semanas, e com muito dinheiro.Alguém conhece esse fundo Franklin? bitmover, você que andas nestas andanças, conhece?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "September 13, 2023, 08:48:17 PM",
      "body": "Quote from: joker_josue on September 13, 2023, 07:00:09 PMTambém desconhecia, esse envolvimento de tantos fundos de investimento - chamemos assim.Curioso é que é tudo praticamente recente. O mais antigo é WisdomTree Short-Term Treasury Digital Fund, que tem uma maturidade de quase 2 anos. Os restantes tem todos apenas alguns meses. Como esse tal Franklin, que começou apenas algumas semanas, e com muito dinheiro.Alguém conhece esse fundo Franklin? bitmover, você que andas nestas andanças, conhece?Não conheço..  olhei no Wikipédia e descobri q eles começaram a tokenização de ativos usando a Stellar, do fundador da xrpQuoteIn 2021, Franklin Templeton launched the first \"tokenised\" US mutual fund as a pilot – it uses a blockchain to process transactions and record share ownership. The technology is provided by the Stellar network and Blockchain Administrator, a Delaware company. The OnChain US Government Money Fund pilot started with $1.4M of seed money and investment from employees. The automated administration can trade around the clock and removes the need for brokerages, which should result in a \"highly significant decrease in fees\". However, the fund actually has a high level of costs because of its small size and the fact that, as a pilot, it is maintaining traditional records in parallel.[33][34]https://en.m.wikipedia.org/wiki/Franklin_Templeton_Investments",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Disruptivas",
      "created_time": "September 14, 2023, 06:24:35 PM",
      "body": "Eu também não conhecia o fundo. Foi só nas últimas semanas que ouvi falar deles e eles começaram a surgir de todos os lados. Sobre o uso da Stellar. Engraçado que há poucas semanas lembro que pensei, caramba esse projeto morreu, não ouvimos mais nada nada sobre. E ai, do nada comecei a ver vários projetos grandes até que usam a blockchain e eles começaram a surgir no Linkedin pra mim.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "September 14, 2023, 06:52:57 PM",
      "body": "Quote from: Disruptivas on September 14, 2023, 06:24:35 PMEu também não conhecia o fundo. Foi só nas últimas semanas que ouvi falar deles e eles começaram a surgir de todos os lados. Pois, se calhar a próxima moda não vai ser o IA, mas sim os ETFs ligados aos cripto.Enfim... desde que no final o Bitcoin sai valorizado, estejam a vontade.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Disruptivas",
      "created_time": "September 16, 2023, 07:32:33 PM",
      "body": "Quote from: joker_josue on September 14, 2023, 06:52:57 PMPois, se calhar a próxima moda não vai ser o IA, mas sim os ETFs ligados aos cripto.Enfim... desde que no final o Bitcoin sai valorizado, estejam a vontade.  Sim, mas ETF é veículo e não classe de ativo né, ai não pode ser classificado como moeda eu acho. Mas em relação a IA, essa semana a Goldman Sachs publicou um artigo que achei bem interessante, defendendo o ponto de que ia não está em comportamento de bolha e que eles acham que está nos estagios iniciais e ainda vai subir bastante. Achei bem interessante, o link pra quem quiser:Nas ultimas semanas eu testei vários serviços de IA pra conteúdo e o que achei é que são INCRIVEIS, mas ainda muito longes do ideal. Entao por exemplo, uma edição que eu demoro 20 min pra fazer, os serviços demoram de 15 a 50 min dependendo do video e serviço devido ao processamento. Mas claro, não ocupam meu tempo. E ainda não são TÁO BONS. Isso me faz pensar que realmente tem muita coisa que vai ser incrivel em breve, mas realmente nao chegamos no ponto de maturidade ideal dessas tecnologias",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "September 17, 2023, 11:00:51 AM",
      "body": "Quote from: Disruptivas on September 16, 2023, 07:32:33 PMAchei bem interessante, o link pra quem quiser:Qual link?  Disruptivas andas a inventar coisas!? Esta tudo bem, contigo?De resto, concordo que não seja bolha ou moda. O IA era uma coisa que estava a ser falado, há vários anos, mas nunca tinha chegado ao publico. Mas, com o surgimento do ChatGPT, ondes os desenvolvedores não tiveram medo de o disponibilizar ao publico, abriu a porta para que as empresas que estavam a desenvolver o IA internamente, se dessem a conhecer. Por isso, o IA veio para ficar e crescer, cada vez mais depressa.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "September 18, 2023, 03:54:15 PM",
      "body": "Quote from: joker_josue on September 17, 2023, 11:00:51 AMDe resto, concordo que não seja bolha ou moda. O IA era uma coisa que estava a ser falado, há vários anos, mas nunca tinha chegado ao publico. Mas, com o surgimento do ChatGPT, ondes os desenvolvedores não tiveram medo de o disponibilizar ao publico, abriu a porta para que as empresas que estavam a desenvolver o IA internamente, se dessem a conhecer. Por isso, o IA veio para ficar e crescer, cada vez mais depressa.Na verdade a AI já está presente nas nossas vida há muitos anos, até décadas.Sugestoes de filmes do netflix,  predicao da próxima palavra de pesquisa do Google, aquele monte de biblioteca de machine learning do python, redes neurais, etc etc estão aí a muito tempo.O chatgpt so está mais falado por ai e usado pq voce pode conversar com ele e levou o negócio pra outor nível.Mas já víamos muito AI nas nossas vidas antes do chatgpt",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}