{
  "id": "topic_5409638",
  "title": "followspider",
  "author": "followspider",
  "created_time": "August 12, 2022, 04:46:18 PMLast edit: August 15, 2022, 11:45:20 AM by mprep",
  "content": "Hey guys. I was thinking of a good hardware wallet to get. Now Ive heard of Ledger being a good one so that one is definitely on my list, but I also stumbled upon Trezor. Is anyone familiar with this? https://shop.trezor.io/?offer_id=10If anyone has any experience with hardware wallets, can you please help me out for when I should go for Ledger or Trezor? Thank you![moderator's note: removed referral code]",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5409638",
  "comments": [
    {
      "author": "Mbitr",
      "created_time": "August 12, 2022, 05:21:33 PM",
      "body": "You may want to post this in this section of the forum https://bitcointalk.org/index.php?board=261.0Or even better is to have a look at some of the threads in the section that debate the qualities of hardware wallets. Like this thread https://bitcointalk.org/index.php?topic=5403779.0Hope this helps",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pmalek",
      "created_time": "August 13, 2022, 07:52:54 AM",
      "body": "Ledger and Trezor are two of the most popular hardware wallet manufacturers in the crypto space. - Trezor is open-source, Ledger isn't.- Ledger is cheaper, Trezor is more expensive.- Ledger has greater support for altcoins.- Trezor's are built with better quality materials. Ledger's quality control is getting worse and worse. Although that also depends on how you treat electronic devices yourself.- Ledger has a secure element, Trezor doesn't.- Trezor has an unfixable vulnerability that allows a knowledgeable person to extract its seed and PIN by having physical access to the device. Ledger doesn't.- The above issue can be mitigated by using a passphrase or SD card that stores a unique access code.- Ledger has leaked customer data from their own servers and a 3rd-party company storing customer private data has also been hacked. Trezor's personal records have not been hacked, but a 3rd-party website that stores marketing data of Trezor users has.Which brand you should get also depends on what you are looking to store on your HW wallet, how much you want to spend on it, where in the world you are located, and how important features such as open-source and an airgapped system is.Maybe you can tell us something more about your needs here.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dkbit98",
      "created_time": "August 13, 2022, 10:00:44 PM",
      "body": "Quote from: followspider on August 12, 2022, 04:46:18 PMIf anyone has any experience with hardware wallets, can you please help me out for when I should go for Ledger or Trezor? Thank you!If you ask me I would never buy any Ledger hardware wallet in 2022, and I think that Trezor Model T is way to expensive and it's not worth that price.Ledger has closed source firmware and it has lot of problems with low built quality, especially with model Nono X.I think that Trezor Model One is still usable, open source device with decent price, but if you have more more  I would also check Bitbox02, Passport and Keystone.Good alternative for hardware wallets is to make your own signing device using raspberry pi (seed signer), esp32 devices (krux), or old offline laptop.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaveF",
      "created_time": "August 13, 2022, 11:10:01 PM",
      "body": "Quote from: dkbit98 on August 13, 2022, 10:00:44 PMQuote from: followspider on August 12, 2022, 04:46:18 PMIf anyone has any experience with hardware wallets, can you please help me out for when I should go for Ledger or Trezor? Thank you!If you ask me I would never buy any Ledger hardware wallet in 2022, and I think that Trezor Model T is way to expensive and it's not worth that price.Ledger has closed source firmware and it has lot of problems with low built quality, especially with model Nono X.I think that Trezor Model One is still usable, open source device with decent price, but if you have more more  I would also check Bitbox02, Passport and Keystone.Good alternative for hardware wallets is to make your own signing device using raspberry pi (seed signer), esp32 devices (krux), or old offline laptop.Just a bit of a PSA:I think we have discussed it here before, might have been on reddit, but don't just google search for things like this.There are bad actors that post ads with links to non legitimate sites:Verify all links if you search and check here too: https://bitcointalk.org/index.php?topic=5282364.0Bitbox02 https://shiftcrypto.ch/bitbox02/Passport https://foundationdevices.com/passport/Keystone https://shiftcrypto.ch/bitbox02/Remember not all links are as they appear: https://shiftcrypto.ch/bitbox02/ -Dave",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DireWolfM14",
      "created_time": "August 14, 2022, 12:44:09 AM",
      "body": "I've had both manufacturer's wallets, and prefer the Trezor over the Ledger models by far.  The Trezor should be used with the Bip39 passphrase enabled to ensure maximum security.  The Bip39 passphrase feature with a Ledger isn't as critical, but highly recommended nonetheless.  I really like the features of the Foundation Passport batch 2, which I hope to purchase soon.  I recently purchased a ColdCard (my review can be found here,) and I'm really liking it so far.  I've been using it as my main wallet for the past few months.Quote from: DaveF on August 13, 2022, 11:10:01 PMRemember not all links are as they appear: https://shiftcrypto.ch/bitbox02/So, which hardware wallet manufacturer will never give us up, let us down, run around and desert us?  Which will never make us cry, say goodbye, tell us lies, and hurt us?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cricktor",
      "created_time": "August 14, 2022, 04:14:58 AM",
      "body": "Quote from: DaveF on August 13, 2022, 11:10:01 PMVerify all links if you search and check here too: https://bitcointalk.org/index.php?topic=5282364.0Bitbox02 https://shiftcrypto.ch/bitbox02/Passport https://foundationdevices.com/passport/Keystone https://shiftcrypto.ch/bitbox02/Dave, your link to Keystone is wrong...To my knowledge it should be: https://keyst.one",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pmalek",
      "created_time": "August 14, 2022, 08:24:30 AM",
      "body": "Quote from: DireWolfM14 on August 14, 2022, 12:44:09 AMSo, which hardware wallet manufacturer will never give us up, let us down, run around and desert us?  Which will never make us cry, say goodbye, tell us lies, and hurt us?    All of them will do some or all of those things if it's good for business. If it's between you and their success, you will be thrown under the bus if needed. People think that if something bad has happened to Company A but not to company B, it's because Company B cares for us and wants to protect us. Nope. They just haven't experienced what Company A has...yet. If/when they do, you will see.Quote from: Cricktor on August 14, 2022, 04:14:58 AMDave, your link to Keystone is wrong... Yeah, he posted the link to Bitbox02 twice.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "August 14, 2022, 10:25:33 AM",
      "body": "Quote from: followspider on August 12, 2022, 04:46:18 PMIf anyone has any experience with hardware wallets, can you please help me out for when I should go for Ledger or Trezor? Thank you!@Pmalek wrote a good post and listed all the important things to consider before choosing a hardware wallet. However, I would add that people are starting to think that HW is some kind of ultimate solution for storing cryptocurrencies, while there is still a much safer solution in the form of creating something we call a cold wallet. The term \"cold wallet\" is also often used when referring to hardware wallets, although this name is correct only for those devices that never connect to the Internet - be it a smartphone or a computer. I think there are already a lot of people who have realized the risks that come from buying and using hardware wallets, whether it's about their personal safety, or the safety of their crypto assets.I don't want to say that hardware wallets are bad because in any case, they contribute to security, but we should point out the possibility that each user can create his own hardware wallet, which can be far more secure than any commercial HW on the market if it is created correctly.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackHatCoiner",
      "created_time": "August 15, 2022, 05:12:50 PM",
      "body": "I'd honestly not buy a Ledger or Trezor wallet, unless I wanted to gamble with altcoins.I wouldn't buy Ledger, because it's neither open-source nor reputable (according to their data breaches' history). I would definitely put Trezor above it, but wouldn't buy that either, mainly to preserve my privacy. I recommend SeedSigner.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hZti",
      "created_time": "August 16, 2022, 02:46:15 PM",
      "body": "If you dont need to send the coins regulary you can also just create a wallet on an old laptop that you do never connect to the internet. From that wallet you backup the Seed Phrase with a steel backup and you are 100% safe. People should not think that they need pricy hardware to store coins. If you want a hardware wallet however Im for example like to use a ColdCard.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NeuroticFish",
      "created_time": "August 16, 2022, 03:25:24 PM",
      "body": "Quote from: followspider on August 12, 2022, 04:46:18 PMQuite shame for so many good answers. From what I see, I think that OP was an one-time poster whose main goal was not to find info on the HW, instead get as many people click onto his ref link (link that was removed by a mod).Quote from: BlackHatCoiner on August 15, 2022, 05:12:50 PMI recommend SeedSigner.  +1I agree, it's one of the best options nowadays, by far.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}