{
  "id": "topic_5406865",
  "title": "Alik Bahshi",
  "author": "Alik Bahshi",
  "created_time": "July 19, 2022, 03:06:26 PM",
  "content": "Алик  Бахши      Вокруг Каспия      В соответствии с уже чётко обозначившимся политическим вектором путинской России “Назад в империю” Москва, провоцируя и используя национальные проблемы в странах, бывших советскими республиками, и жестоко подавляя всякие попытки, народов империи обрести свободу, не оставляет надежды вернуть беглецов под своё покровительство. И действовать в этом направлении надо как можно быстрее пока эти страны, по примеру Прибалтики, не оформили крышу в виде Объединённой Европы и НАТО. С целью дать отпор политическому давлению и энергетическому шантажу со стороны России, Грузия, Украина, Азербайджан и Молдавия объединились в союз ГУАМ. По территории этих стран может быть проложен газопровод Баку – Батуми – дно Чёрного моря – Крым – Молдавия – Румыния и далее Европа. Весьма перспективным видится также проект «Набукко», предусматривающий строительство Трубы в Европу через Турцию. То есть, в обход России газ и нефть из стран Каспийского бассейна могут транспортироваться в Европу, что не только исключит возможность России шантажировать свои бывшие колонии, перекрывая газ и электричество, но и лишит её монополии на поставки газа в Европу. Конечно, для осуществления этого проекта необходимо будет проложить трубу по дну Каспия из Туркмении в Баку, ибо в Азербайджане своего газа недостаточно. Таким образом, Баку становится ключевой геополитической точкой данного проекта и главным раздражающим Москву фактором, препятствующим её политике газового шантажа.      Географическое расположение Азербайджана таково, что здесь перекрещиваются многие политико–экономические нити евроазиатского континента. Азербайджан,  Туркмения и Казахстан, а также весь бассейн Каспия между этими странами, – это нефте–газовый клондайк, который потеряла Россия при распаде СССР и который является серьёзным потенциальным конкурентом России и Ирана на рынке нефти и газа. Безусловно, с началом коммерческой эксплуатация нефтепровода Баку–Джейхан уменьшится поток нефтедолларов в Россию, более того, это имеет большое политическое значение, так как будет способствовать консолидации тюркоязычных стран.           Распад Советского Союза – империи, занимавшей шестую часть суши, многое изменил на политической карте мира, перетасовав интересы и военно-стратегические планы многих государств.   В сфере геополитики Россия терпит жестокое поражение, особенно в Европе. НАТО расширяется на Восток, вплотную подобравшись к границам России и, если в будущем  Украина последует  примеру бывших прибалтийских республик СССР, то Черное море стратегически будет потеряно для России.        Не лучше складывается обстановка и на южном направлении, где Россия вполне резонно предвидит угрозу своему тюркоязычному подбрюшью со стороны Кавказа и Средней Азии. Здесь всё явственней вырисовываются контуры нарождающегося под эгидой Турции блока тюркоязычных стран на обширной территории от Малой Азии до Алтая, который, подобно клинку, врезается в самый центр азиатского материка. Это наследство Тимура обладает большим экономическим и военно-стратегическим потенциалом не только благодаря обширному пространству, но и из-за наличия громадных запасов нефти и газа, не уступающих запасам Персидского бассейна.   Уязвимое место у тюркского содружества – отсутствие между Турцией и Азербайджаном непрерывного территориального коридора. В стратегическом плане положение усугубляется оккупацией Арменией 20%  азербайджанской территории. Но в случае воссоединения Азербайджана с его южной частью, находящейся в Иране, создание монолитного политического блока вполне возможно. Численно азербайджанцев в Южном Азербайджане в два с лишним раза больше, чем в Северном Азербайджане, а их потенциальное и естественное стремление к политическому объединению не может не тревожить Тегеран.     Вот здесь и перекрещиваются геополитические интересы России и Ирана, а уже фактически существующая ось Москва-Ереван-Тегеран как раз и служит удавкой в этом самом уязвимом месте. Кроме того, неоконченная Карабахская война играет роль тлеющего запала, чтобы начать военные действия в этом районе руками Армении в выгодный для Москвы момент.      Армения, имеющая территориальные претензии к соседям, вновь, как и период Первой мировой войны, может послужить “козырной картой” для Москвы в её политической  игре на Кавказе. Этим и объясняются традиционно особые военно-политические связи России и Армении. Из всех республик бывшего Советского Союза  только Армения получила современные ракетные комплексы С-300. Кстати, здесь надо отметить, что всё тяжёлое вооружение поставлялось в Армению через территорию Ирана. Ось Москва – Тегеран должна оберегать и экономические интересы России. Москва  никак не может смириться с тем, что Азербайджан в одиночку ведёт добычу нефти у своих берегов и время от времени поднимает вопрос о каком-то невыясненном статусе Каспийского моря. Не исключено, что Каспийская нефть может быть причиной будущих политических, а возможно, и военных столкновений.     Сближение позиций России и Ирана в военно-политической области началось буквально сразу после исчезновения с политической карты Мира Советского Союза и объясняется изменением геополитической ситуации в Евроазии, которой послужили внутренние политические события, происшедшие в Иране и затем в СССР в 80-90гг.     Обеспокоенность Запада продажей Россией Ирану ядерной технологии не является напрасной, так как появление атомного оружия в руках очередного тоталитарного режима, теперь уже в его новом - религиозном обличье, представляет серьезную опасность для мира. Лидеры исламской революции, выдавая свои безумные планы за проявление божественной воли, могут поставить Мир перед угрозой ядерного шантажа. Заверения России и Ирана в том, что ядерный реактор предназначен исключительно для использования в мирных целях лишены логики и целесообразности. Спрашивается, для чего Ирану атомная электростанция в качестве альтернативного источника энергии при наличии громадных природных ресурсов энергии, каковыми являются нефть и газ. Неужели Иран настолько богатая страна, что может позволить себе иметь ядерный реактор в качестве дорогой игрушки? Без сомнения ядерный реактор нужен религиозному режиму для создания атомной бомбы. Безусловно, если принять во внимание, что соседи по региону Китай, Пакистан, Индия и Израиль обзавелись ядерным оружием, то и иранцы вправе приобрести его. Но это уже другой вопрос.     Какие же причины побудили Москву пойти на передачу Ирану ядерной технологии, несмотря на протесты из Вашингтона?     Считать, что такой поступок вызван чисто торговой сделкой было бы неправильно. Скорее всего, это своего рода плата за политическое сотрудничество.     На протяжении двух последних столетий Россия была для Ирана наиболее опасным соседом. Иран являлся последней преградой на пути продвижения Российской империи к Индийскому океану. И слабая, нищая страна непременно стала бы её очередной жертвой, если бы не заступничество Англии. Последнюю попытку осуществить свои захватнические планы Москва предприняла в конце Второй мировой войны, когда советские войска оккупировали часть иранской территории, так называемый Южный Азербайджан. Только политический талант и прозорливость Уинстона Черчеля, предвидевшего эпоху Холодной войны, вынудили Сталина вывести армию из Ирана.   Впоследствии, под американским покровительством был создан блок СЕАТО, в который вошли Турция, Иран и Пакистан. Эта тройка образовала военно-политический щит против возможной экспансии Советского Союза на Юг. С учётом того, что Турция является членом НАТО и имеет двусторонний договор с Соединенными Штатами Америки, СЕАТО был таким же неприступным для посягательств, как и НАТО. Иран в тот период получал немало американского вооружения и экономической помощи.    Шах Ирана Пехлеви, получивший высшее образование в Швейцарии, был сторонником развития своей страны по образцу Западной цивилизации, подобно Турции, совершившей довольно смелый для ортодоксального в религиозном отношении Востока шаг, отделивший религию от государства. Но, если у Ататюрка в его прогрессивных реформах была опора в лице младотурок, то Пехлеви такой опоры не имел. И всё же благодаря нефтедолларам страна быстро развивалась в технико-экономическом отношении и стояла на пороге экономического бума.   Вслед за американскими товарами в страну проникали семена Западной культуры. Американские фильмы буквально заполонили кинотеатры и телевидение. Молодёжь, как губка, впитывала всё новое и необычное. “Растление душ” правоверных вызывало гнев религиозной верхушки, усмотревшей в культурном преобразовании общества угрозу своему влиянию на массы. Все попытки убедить шаха свернуть с выбранного им пути, идущего вразрез с религиозными догмами, оказались безуспешными. Более того, шах не церемонился со своими идеологическими противниками, а будущему отцу Исламской революции аятолле Хомейни пришлось даже покинуть Иран и превратиться в своего рода мученика за Веру.   Всем известен трагический финал преобразований иранского общества, предпринятых не кем иным, как самим шахиншахом (шахом всех шахов) Ирана Мохаммедом Реза Пехлеви. Гордый одиночка, опередивший своё время, окончил последние дни в изгнании. Жестокий террор разметал ростки новой жизни. Стражи исламской революции с превеликим удовольствием устраивали публичные казни женщин, осмелившихся появиться с открытым лицом, или уличённых в измене. Горели кинотеатры с запертыми внутри зрителями. Чёрная вуаль религиозного фанатизма вновь опустилась на Иран, оградив от остального Мира, и в одно мгновение, ввергнув страну в эпоху средневекового мракобесия.      Цивилизованный мир был шокирован тем, что произошло в Иране, и только Москва хранила молчание. Коммунисты всегда с уважением относились ко всем тоталитарным режимам, близким им по духу, будь то фашистский в Германии, диктаторский в Ливии или Ираке, а теперь ещё одной его разновидности – религиозному тоталитаризму в лице исламского государства Иран.    Отлично понимая, что демократия является основным злом для своей власти, религиозная олигархия объявила западную цивилизацию врагом Ислама и всех мусульман. (Это в корне неверно, хотя бы потому, что именно военная акция Запада спасла боснийских и косовских мусульман от геноцида, учинённого сербами.) Естественно главным противником революции стала Америка и её союзник Израиль и не по той причине, что Израиль воюет с арабами, Иран и сам в течение 8 лет воевал с Ираком, а потому, что Ирану, как всякому тоталитарному режимы нужен враг для “мобилизации духа” и устранения малейшего вольнодумия внутри режима.      См.далее",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5406865",
  "comments": [
    {
      "author": "Alik Bahshi",
      "created_time": "July 19, 2022, 03:14:08 PM",
      "body": "Продолжение темы:Иран старается  взять на себя роль лидера в мусульманском мире и для этого необходимо пропаганду подкреплять какими-то более активными действиями. С этой целью, тегеранский режим умело использует арабо–израильский конфликт, поддерживая справедливое право палестинцев на свободу.        В военном сотрудничестве с Ираном Россия видит достойный ответ Западу на расширение НАТО, а помощь в строительстве ядерного реактора, который при избытке природных энергоресурсов, несомненно, нужен Ирану для создания атомной бомбы, является хорошим раздражающим Америку и Израиль фактором. И сильно ошибаются те политики, которые считают Россию уже поверженной. “Империя Зла” ещё способна спалить Землю ядерным дыханием в предсмертных конвульсиях или породить себе подобных в лице Ирана.       Союз России и Ирана ярко иллюстрирует политическое лицемерие их обоих и является своего рода политическим парадоксом. С одной стороны Кремль, запугивает Запад международными террористами и нашествием Ислама, с целью оправдания своей политики по “замачиванию чеченцев в сортире”, а с другой стороны помогает государству, у власти которого находятся те же исламисты,   создать ядерное оружие! Тождественная ситуация складывается с Ираном, который пытаясь представить себя в качестве оплота мусульман, против враждебного христианского мира, одновременно, находится в союзе с христианскими Россией и Арменией, и по сути, проводит политику против мусульманского Азербайджана!                  Как видите, нет противостояния религий и войны цивилизаций, а есть интересанты, которые пользуются этими категориями для прикрытия сугубо эгоистических политических целей.         Всего этого не дано понять президенту Бушу, своего рода эталонному образцу политической глупости, который, не понимая действительной причины нью–йоркской трагедии 11 сентября и поверив в виртуальный исламский заговор мирового масштаба, нашёл в лице Путина сотоварища по борьбе с международным терроризмом, что дало возможность последнему удушить Демократию в России и передать тегеранским клерикалам современное вооружение вплоть до возможности создания собственной атомной бомбы. Более того, с лёгкой руки Буша Америка, по сути, стала крышей пытающейся возродиться империи. Буш не понимает, что политический вектор Путина “Назад в империю” направлен в первую очередь против стран ГУАМ, надеющихся на помощь НАТО от нависающей над ними опасности поглощения.        Нефтепровод Баку – Джейхан, проходящий по территории Грузии, это мощный стратегический аргумент, наносящий политико–экономический удар по интересам Российской империи, и является главной причиной шантажа Грузии отторжением от неё части территорий и, если Грузия станет вассалом или вовсе потеряет свою независимость, то России при поддержке Армении и Ирана удастся, создать кольцо блокады и полностью перекрыть доступ каспийской нефти в Европу. Москве не выгодно появление ещё одного продавца на рынке энергоносителей. Нефтепровод, проложенный в первую очередь для стран каспийского бассейна, чтобы они могли продавать нефть без посредника, способного оказывать политическое давление, потому что в роли посредника не частник, а империя, является объектом русской провокационной политики на Кавказе, которую поддерживают не менее заинтересованные, – Армения и Иран. Вот что должно вызвать основную озабоченность Белого дома и Европы, а не виртуальная угроза Западной цивилизации со стороны Ислама, угроза, которой стращают интересанты из Кремля и Тель–Авива. Однако, Джорж Буш делает столько ошибок и упущений, что за оставшееся короткое время его каденции на посту президента Соединённых штатов трудно ожидать от него чего–то путного в политическом направлении.  30.05.2006",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}