{
  "id": "topic_5429118",
  "title": "Hydrogen",
  "author": "Hydrogen",
  "created_time": "December 15, 2022, 11:38:49 PM",
  "content": "QuoteFTX’s bankruptcy-era CEO, John J. Ray III, appointed to shepherd the collapsed crypto exchange through Chapter 11 reorganization, testified on Tuesday that the company’s founder and former CEO, Sam Bankman-Fried, made multiple misstatements about his companies’ financials.Ray, who oversaw Enron’s infamous corporate fraud, characterized FTX’s actions as “old fashioned embezzlement.”“This is just taking money from customers and using it for your own purpose,\" Ray said. \"Not sophisticated at all,” he said, explaining that what might have been sophisticated about the scheme was hiding it in plain sight.Ray’s testimony may also have shed light on the theories that underlie the Justice Department's accusations against Bankman-Fried, who was charged with eight counts of wire fraud, securities fraud, and conspiracy in an indictment unsealed on Tuesday.The agency’s criminal charges, which allege that Bankman-Fried misappropriated customer funds by allowing the funds to be used by his crypto hedge fund Alameda Research, require it to prove beyond a reasonable doubt that Bankman-Fried knew and intended to lie about the arrangement to customers or lenders.The FTX chief's testimony came before the U.S. House of Representatives’ Financial Services Committee, where Bankman-Fried was also scheduled to testify via video conference. However, the public’s opportunity to hear testimony from the embattled founder foreclosed after he was arrested Monday evening by Bahamian authorities.Bahamian authorities took Bankman-Fried into custody at the request of the U.S. Justice Department on Monday night, based on its indictment originally filed under seal.In the indictment, the DOJ charged Bankman-Fried with wire fraud and conspiracy to commit wire fraud against FTX customers and lenders, conspiracy to commit commodities fraud and securities fraud, conspiracy to violate money laundering laws, and conspiracy to defraud the U.S. government through violations of campaign finance laws.In separate civil actions filed Tuesday, the U.S. Securities and Exchange Commission, and the U.S. Commodity and Futures Trading Commission, respectively, alleged Bankman-Fried violated securities laws and the Commodity Exchange Act and the agency's regulations.Asked if there's any way that Bankman-Fried and FTX’s senior managers wouldn’t have known that its entities had commingled customer funds, allowing Alameda unlimited access to FTX customer accounts, Ray III said, “No.”In an interview at the New York Times' Dealbook Summit, Bankman-Fried said he didn’t “knowingly commingle [customer] funds.” He added that he “didn’t ever try to commit fraud on anyone,” that he “wasn’t “running Alameda,” and “didn’t know what was going on.”Ray was also asked about contentions in Bankman-Fried’s leaked prepared hearing remarks which suggested FTX was solvent but for a run on the bank caused when Binance walked away from a planned investment in FTX, and that FTX US remains solvent and capable of paying off all of its customers. Bankman-Fried also tweeted the claim on November 10, the day before the exchange’s bankruptcy filing.“Given the evidence you’ve gathered, is there any degree of truth to this claim,” Georgia Rep. Barry Loudermilk asked Ray.“We still have a hole in the U.S., so as we sit here today it is not solvent. That's just inaccurate. And I'm not sure how he would even know that, quite honestly. We're hopeful,” Ray said.“Prior to that episode, is your belief that FTX was solvent?” Ohio Rep. Anthony Gonzalez asked about Binance’s about-face. “No,” Ray replied.Missouri Rep. Ann Wagner asked Ray if the transfer of FTX funds to Alameda could have been done by mistake, given that Bankman-Fried has publicly apologized for making mistakes in leading his companies.“I don't find any such statements to be credible,” Ray III said.Rep. Wagner went on to say that FTX’s international trading platform, FTX.com, held itself out as having a sophisticated risk management system commensurate with the size of his operations.“I can say that it's absolutely false. There was no sophistication whatsoever,” Ray III said. “There was an absence of any management.”https://finance.yahoo.com/news/ftx-ceo-says-company-engaged-in-old-fashioned-embezzlement-under-sbf-023334039.html....More negative press on SBF. No one's trying to sugarcoat anything, \"old fashioned embezzlement\" is what they're calling it.If I was planning to do something like what SBF did. I would be scared out of my mind and probably try hard to take steps to protect myself and those involved. I don't understand how SBF can taunt people on social media over the FTX crash. Then have no concerns or fear that some of his questionable choices might backfire on him. How could anyone be so indifferent and unaware of the deep hole he was digging for himself. Until it was too late.Is there a chance SBF receives a minor slap on the wrist and short prison time. Or did his luck wear thin here, with him due to receive a more severe penalty?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5429118",
  "comments": [
    {
      "author": "franky1",
      "created_time": "December 15, 2022, 11:50:42 PM",
      "body": "Quote from: Hydrogen on December 15, 2022, 11:38:49 PMIf I was planning to do something like what SBF did. I would be scared out of my mind and probably try hard to take steps to protect myself and those involved. I don't understand how SBF can taunt people on social media over the FTX crash. Then have no concerns or fear that some of his questionable choices might backfire on him. How could anyone be so indifferent and unaware of the deep hole he was digging for himself. Until it was too late.firstly there many things like the perception of a transactionpaying someone for food has proof of intention of those funds were an agreement of funds for goodsa loan has a contract of terms that the purpose was to \"borrow\"however a business receiving a deposit. needs to have a user agreement that shows that funds entering a business remain the customers property, otherwise its a donationthere are some businesses in the crypto space that have even worse user agreement terms than FTXalthough FTX did have terms that deemed funds were users property. the standard clause is \"expect to lose all value and dont hold us liable for loses\"(not verbatim)so some dubious people can pretend customer losses were just the price of investing..he did have terms that standard depositors funds were not to be used for margin/insider trading. thus he broke his own rules thus defrauded customers.as for his actions afterwards.after having his personal accounts frozen by bahama authorities. he was left with limited (order requests of spending) of a total of $100k eaning he had to request the authorities for pocket money to cover billsso knowing he had to find more income some how and also try to set a narrative of defence. he went on a 'press tour' of paid speaking interviews. which would help cover his legal expenses and set the narrative.when arrested and in court where he was denied bail. he was anxious and jittery and was able to get the court to give him a few minutes to take some anti-depression meds. .. so he is not exactly cool-casual.. he is just on strong 'chill patch'(emsam)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jackg",
      "created_time": "December 15, 2022, 11:53:24 PM",
      "body": "I'd guess he'll at least end up serving over 30 years in prison if it proves he was complicit in the whole thing - and since he leant himself/stole $1bn+ as ftx went insolvent, that could be likely.I don't know what repeating \"ftx us remains solvent\" says to anyone except \"we knew what we did and want to know what happens if we don't affect the US\". If funds weren't insured separately, payouts might have to be done based on all creditors too. Perhaps he also thought his location made him untouchable enough by US authorities.Reuters seem to believe that a lot of funds were lost because alameda couldn't have their positions be liquidated on ftx if they got margin called - which sounds like something a lot of people would have to know.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "December 15, 2022, 11:59:33 PM",
      "body": "Quote from: jackg on December 15, 2022, 11:53:24 PMI'd guess he'll at least end up serving over 30 years in prison if it proves he was complicit in the whole thing - and since he leant himself/stole $1bn+ as ftx went insolvent, that could be likely.I don't know what repeating \"ftx us remains solvent\" says to anyoneof the ~$8bill missing of the co-mingled funds of .us and .com ~$1b was left in those funds which..the combined 'balance' of just the .us customer base was about $1b thus enough left to make them wholehowever its not that simple legally. as the co-mingling means the funds are not just allocated to the .us customers. they were broad for all customers of all platforms so the current administrator/ceo has to account for deposits which then result into taints of funds in the co-mingled wallet. to establish whos deposits are what. and work out a fair way to share it out.us had over 1-2mill customers(some dupe accounts) of small amounts totalling at their guestimates of only $1b total loss in .usand .com had under 200k customers of large amounts totalling upto $7billbut numbers are still fuzzy as they are trying to find records and logs that dont exist or hard to read through. it will take time.. months, not days",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lovesmayfamilis",
      "created_time": "December 16, 2022, 12:58:04 PM",
      "body": "According to the news that broke the story, the SBF faces a total sentence of about 115 years in all eight criminal cases in which he is charged.SBF is not being released on bail, which he offered in the amount of two hundred and fifty thousand dollars, for fear that he might escape. Therefore, since he has nothing to lose, he continues to tease the audience, exposing himself as an even bigger idiot. And I would like to hope that being in a prison with poor conditions will fulfill its mission of repentance for what they have done.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "el kaka22",
      "created_time": "December 16, 2022, 07:45:22 PM",
      "body": "This wasn't really a shocking thing to anyone, it was already obvious. The shocking part is the amount, I mean how did he managed to embezzle that much money without anyone noticing earlier? This company bankrupted with sooo much money from the funds of the users, which means that in order for this to be possible, a lot of people must have seen it and either not say a word, or they were paid to look the other way as well.You can't just embezzle billions without anyone knowing, you can embezzle it, that part is possible, but you would have to pay a lot of people to shut up about it as well. I want to know who those were, and SBF to clearly give names to the court.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Die_empty",
      "created_time": "December 17, 2022, 04:09:02 PM",
      "body": "Quote from: el kaka22 on December 16, 2022, 07:45:22 PMThis wasn't really a shocking thing to anyone, it was already obvious. The shocking part is the amount, I mean how did he managed to embezzle that much money without anyone noticing earlier? This company bankrupted with sooo much money from the funds of the users, which means that in order for this to be possible, a lot of people must have seen it and either not say a word, or they were paid to look the other way as well.You can't just embezzle billions without anyone knowing, you can embezzle it, that part is possible, but you would have to pay a lot of people to shut up about it as well. I want to know who those were, and SBF to clearly give names to the court.Sam Bankman-Fried and his senior managers ran FTX like their personal fiefdom. SBF had unlimited access to customers' funds which allowed him to use the funds anyhow he wanted. There was no sound financial checks and balance system which promoted wanton archaic style stealing. I am sure his senior managers also embezzled some part of these funds because they cannot authorize or fail to report what didn't benefit them. FTX senior managers should also be investigated to ascertain if they are accomplices to this crime. Maybe they were thinking that they have full control of the global economy or they are backed up by some powerful political connections that is assuring them that they cannot be indicted.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitstar_coin",
      "created_time": "December 17, 2022, 04:55:55 PM",
      "body": "Quote from: Hydrogen on December 15, 2022, 11:38:49 PM~ I don't understand how SBF can taunt people on social media over the FTX crash. Then have no concerns or fear that some of his questionable choices might backfire on him. How could anyone be so indifferent and unaware of the deep hole he was digging for himself. Until it was too late.Is there a chance SBF receives a minor slap on the wrist and short prison time. Or did his luck wear thin here, with him due to receive a more severe penalty? Because he is shameless and never thought his action would bring great consequences,  he kept apologizing for his mistakes yet his minions are all out taunting people most especially binance for not coming to the rescue of a sinking ship. He is a big baby that doesn't want to face responsibility, he was completely aware of what was going on but did nothing to prevent it from turning into a disaster. I hope the authority make example of him this time. All these criminal acts should not be patted on the back.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kryptqnick",
      "created_time": "December 17, 2022, 04:57:46 PM",
      "body": "If there was embezzlement, I hope relevant people (including but not limited to Sam Bankman-Fried) will be held responsible. For me, though, the most important thing is for victims to get their money back, at least most of it if getting all of it is impossible. The second priority is proper legislation that would make such sudden bankruptcies impossible (in case it wasn't a direct violation of already existing legislation, of course, and unfortunately I suspect it might not have been): oversight of the work of exchanges that would allow monitoring how things are going with their funds, preferably in some form of public accountability.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gozie51",
      "created_time": "December 17, 2022, 08:17:53 PM",
      "body": "Quote from: Hydrogen on December 15, 2022, 11:38:49 PMIs there a chance SBF receives a minor slap on the wrist and short prison time. Or did his luck wear thin here, with him due to receive a more severe penalty? No I don't think that luck will come to him. He should have known what the outcome will be when planning his agenda to use other people's money. The trick is of course old and nobody will fall for the unintentional plea for excuse on his offense. The court is suppose to get justice for the investors who were hopeful to benefit from their investment. He will either be investigated for hidden properties that will be used to offset the debt owed to investors or he goes in for prison.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Saint-loup",
      "created_time": "December 17, 2022, 08:33:28 PM",
      "body": "Quote from: kryptqnick on December 17, 2022, 04:57:46 PMIf there was embezzlement, I hope relevant people (including but not limited to Sam Bankman-Fried) will be held responsible. For me, though, the most important thing is for victims to get their money back, at least most of it if getting all of it is impossible. The second priority is proper legislation that would make such sudden bankruptcies impossible (in case it wasn't a direct violation of already existing legislation, of course, and unfortunately I suspect it might not have been): oversight of the work of exchanges that would allow monitoring how things are going with their funds, preferably in some form of public accountability.What he has done is clearly unlawful, and he will certainly pay the price of spending several years in jail along with his closest accomplices. So I don't think cryptos need more laws and regulations to punish this kind of guys. In addition, cryptos can be used from anywhere in the world, so exchanges will always be able to find less stringent places to make their business.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lionheart78",
      "created_time": "December 17, 2022, 08:34:17 PM",
      "body": "It is not a surprise that FTX's current CEO had exposed everything, he needs to save his skin else he would be charged as guilty as SBF.  What is surprising, in this case, is that Kevin Oleary (spokesperson of FTX who is paid possibly more than $15m) keeps on insisting that Binance is the reason why FTX gets bankrupt.Kevin Oleary stated that what he thinks triggered the collapse of FTX is when Binance forced FTX to buy back the 20% shares Binance is holding.  Surprisingly Oleary pointed out Binance as the reason for the FTX collapse and not the fraud SBF had done to the funds of FTX investors.  He even states that stuff during the house hearing when Oleary has been asked during the hearing, of course, SBF being absent due to the arrest prior that day.It looks like they are pinning Binance for this massive loss that makes FTX collapse which now put Binance in the hot seat.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jossiel",
      "created_time": "December 17, 2022, 09:39:21 PM",
      "body": "IF we are to judge SBF's case, he deserve jail time but let the due process go on and there will be intervention from powerful folks that he has given money before.I have seen this news that the new FTX CEO will receive $1300 per hour and that's a lot of money again coming from the company itself paying just to fix the ruckus SBF has made.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "erep",
      "created_time": "December 17, 2022, 09:58:33 PM",
      "body": "Quote from: lionheart78 on December 17, 2022, 08:34:17 PMIt is not a surprise that FTX's current CEO had exposed everything, he needs to save his skin else he would be charged as guilty as SBF.  What is surprising, in this case, is that Kevin Oleary (spokesperson of FTX who is paid possibly more than $15m) keeps on insisting that Binance is the reason why FTX gets bankrupt.Kevin Oleary stated that what he thinks triggered the collapse of FTX is when Binance forced FTX to buy back the 20% shares Binance is holding.  Surprisingly Oleary pointed out Binance as the reason for the FTX collapse and not the fraud SBF had done to the funds of FTX investors.  He even states that stuff during the house hearing when Oleary has been asked during the hearing, of course, SBF being absent due to the arrest prior that day.It looks like they are pinning Binance for this massive loss that makes FTX collapse which now put Binance in the hot seat.Monitoring from the beginning of the case they blame Binance to cover up the crimes they have committed, but however if their case is examined in detail and the trial is presented publicly then there is nothing valid to blame binance in this case, everyone has predicted what actually happened but they are just waiting for the outcome of the trial whether it goes normally or not, he could have gotten a luxury decision because he has the funds to get it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "palle11",
      "created_time": "December 17, 2022, 10:36:49 PM",
      "body": "Quote from: jossiel on December 17, 2022, 09:39:21 PMIF we are to judge SBF's case, he deserve jail time but let the due process go on and there will be intervention from powerful folks that he has given money before.I don't know how concrete this information is but it will be difficult for that to happen because the public is really watching to see the scenario that will finally play out in the case.. Those who have some criminal or embezzlement records with him would not show up because they will avoid the public from knowing their names and tracing their role in the crash.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dothebeats",
      "created_time": "December 17, 2022, 10:53:32 PM",
      "body": "And to think that I even watched a video not long ago about SBF's philanthropy is just laughable. I know that other head honchos of other companies are also using their customers' money for some other things, it's just that SBF misappropriated the money so bad that he blew a huge amount that everyone took notice easily. Had he been mild on doing this, I don't think he'll have a problem with the law and with other people at all.Quote from: lionheart78 on December 17, 2022, 08:34:17 PMKevin Oleary stated that what he thinks triggered the collapse of FTX is when Binance forced FTX to buy back the 20% shares Binance is holding.  Surprisingly Oleary pointed out Binance as the reason for the FTX collapse and not the fraud SBF had done to the funds of FTX investors.  He even states that stuff during the house hearing when Oleary has been asked during the hearing, of course, SBF being absent due to the arrest prior that day.It looks like they are pinning Binance for this massive loss that makes FTX collapse which now put Binance in the hot seat.It's like he's insisting that Sam Bankman-Fraud is the lesser of the two evils. Binance forcing them to buy back the stocks won't matter that much anyway. Perhaps it might be a separate case but I don't think it will catch steam and traction as this case against SBF progresses. The case is about SBF misappropriating the funds, and what Binance did that added to the downfall of FTX is another story.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "December 18, 2022, 12:14:32 AM",
      "body": "Quote from: dothebeats on December 17, 2022, 10:53:32 PMQuote from: lionheart78 on December 17, 2022, 08:34:17 PMKevin Oleary stated that what he thinks triggered the collapse of FTX is when Binance forced FTX to buy back the 20% shares Binance is holding.It's like he's insisting that Sam Bankman-Fraud is the lesser of the two evils. Binance forcing them to buy back the stocksthey were not shares or stocks. they were tokens where the exchange should have had enough value held to allow people to sell its token back to fiat or proper assets.. where the exchange should be able to fulfil requestsif you had tokens in a system and you found out that system was syphoning funds.. wouldnt you also want to sell your tokens and escape before the collapsefunny how they say \"forced\"thats like saying FTT cant be sold and there is no conversion feature. you need to break someones legs if you want out ..actual events is more like binance just sold its FTT and wanted out. but SBF was left with nothing becasue SBF stole value months prior and wasnt expecting a bank run",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jossiel",
      "created_time": "December 18, 2022, 08:45:27 PM",
      "body": "Quote from: palle11 on December 17, 2022, 10:36:49 PMQuote from: jossiel on December 17, 2022, 09:39:21 PMIF we are to judge SBF's case, he deserve jail time but let the due process go on and there will be intervention from powerful folks that he has given money before.I don't know how concrete this information is but it will be difficult for that to happen because the public is really watching to see the scenario that will finally play out in the case.. Those who have some criminal or embezzlement records with him would not show up because they will avoid the public from knowing their names and tracing their role in the crash.We're just watchers but talking about those influential people that he's got connection, there could be some magic that may happen.Yeah, things could really change if they will intervene but if they will just let the process go on. We're all sure that jail time is what he deserves because of what he did.I'm not a victim of it but many of us are looking into this case and hopefully it won't disappoint.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Moneyprism",
      "created_time": "December 19, 2022, 05:14:37 AM",
      "body": "Quote from: Hydrogen on December 15, 2022, 11:38:49 PMThen have no concerns or fear that some of his questionable choices might backfire on himhe is like someone who is under the influence of drugs ,, usually people like this are very confident and not afraid of anything .. the police should immediately carry out a psychiatric examination and drug test ,, maybe while in the Bahamas he used many types of drugs to make himself more self-confident",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "December 19, 2022, 05:47:41 AM",
      "body": "Quote from: Moneyprism on December 19, 2022, 05:14:37 AMhe is like someone who is under the influence of drugs ,, usually people like this are very confident and not afraid of anything .. the police should immediately carry out a psychiatric examination and drug test ,, maybe while in the Bahamas he used many types of drugs to make himself more self-confidentyes he was and is on drugshe is now on emsam as a counter to side effects and also give him a reduced but still receiving high he is used to getting from other drugshe planned he wont have access to hard drugs but didnt want to go cold turkey so is using prescribed drugs nowhe literally asked the judge at his charges hearing if he could go take his dopamine(high) drugs in the court house bathroom",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}