{
  "id": "topic_5400954",
  "title": "hZti",
  "author": "hZti",
  "created_time": "June 01, 2022, 09:08:56 AM",
  "content": "I recently found this address: https://mempool.space/de/address/1111111111111111111114oLvT2 I researched it and I found out that it is used as a proof of burn address. What are your thoughts of it?In my opinion it does not make sense, since the value is destroyed and not transferred to the other project even if it might seem like it in the first place. Also there could be an option built into the bitcoin network to burn coins, but actually insert them into blocks to be redistributed to the miners. What are your thoughts on this?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5400954",
  "comments": [
    {
      "author": "BlackHatCoiner",
      "created_time": "June 01, 2022, 09:18:47 AM",
      "body": "Quote from: hZti on June 01, 2022, 09:08:56 AMI researched it and I found out that it is used as a proof of burn address.Where is it used as a Proof of Burn? I only know 1Counterparty[1][2] that does it. Quote from: hZti on June 01, 2022, 09:08:56 AMIn my opinion it does not make sense, since the value is destroyed and not transferred to the other project even if it might seem like it in the first place. It does make sense. The value is destroyed from the Bitcoin network, but that's the condition for the other coin to create circulation. You can't have as much as you want, because you can't fake your bitcoin's burning, nor can you double-spend. It's a brand new coin that depends on bitcoin. What doesn't make sense is to buy it.  Quote from: hZti on June 01, 2022, 09:08:56 AMAlso there could be an option built into the bitcoin network to burn coins, but actually insert them into blocks to be redistributed to the miners.Transaction fees!  [1] https://counterparty.io/get-started/[2] https://mempool.space/address/1CounterpartyXXXXXXXXXXXXXXXUWLpVr",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NeuroticFish",
      "created_time": "June 01, 2022, 09:23:35 AM",
      "body": "Quote from: hZti on June 01, 2022, 09:08:56 AMWhat are your thoughts on this?My thoughts are that you are very new and you get confused by things already discussed.Oh well, it's still one way to learn Quote from: hZti on June 01, 2022, 09:08:56 AMproof of burn address. [~snip~]In my opinion it does not make sense, since the value is destroyed and not transferred to the other project even if it might seem like it in the first place.Lost and burned coins do have a good meaning: make everybody's coins more valuable. As Satoshi himself said:Quote from: satoshi on June 21, 2010, 05:48:26 PMLost coins only make everyone else's coins worth slightly more.  Think of it as a donation to everyone.Quote from: hZti on June 01, 2022, 09:08:56 AMAlso there could be an option built into the bitcoin network to burn coins, but actually insert them into blocks to be redistributed to the miners.Burning coins and redistributing coins are completely different things.Burning means making the coins completely gone. Those addresses' keys will never be found.Redistributing coins means still keeping them in circulation.There was a discussion somewhat related to this not long ago, maybe this link is in the right direction: https://bitcointalk.org/index.php?topic=5398949.msg60214879#msg60214879 (or a few posts before)From my understanding, you can easily make transaction that sends nothing to nobody (OP_RETURN) and instead send the funds as miners' fee only.Or, possibly, you can (also with OP_RETURN) lock completely some funds.So imho there are in-built functionalities, just the people don't really know how to use them.And many find it more \"cool\" to send pennies to Satoshi's address, to 1111111111111111111114oLvT2 or to 1BitcoinEaterAddressDontSendf59kuE.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hZti",
      "created_time": "June 01, 2022, 09:31:03 AM",
      "body": "Quote from: NeuroticFish on June 01, 2022, 09:23:35 AMQuote from: hZti on June 01, 2022, 09:08:56 AMWhat are your thoughts on this?My thoughts are that you are very new and you get confused by things already discussed.Oh well, it's still one way to learn Im here one year longer than you  But still in my opinion it does not make sense to burn the coins. If they get redistributed to the miners then they would also be lost to the people that \"burned\" them but are not lost to the network. The other coins that you get for the \"burned\" coins can't benefit in any way if the coins are not redistributed, since if they get redistributed also you can only buy the same amount of coins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hZti",
      "created_time": "June 01, 2022, 09:34:24 AM",
      "body": "Quote from: BlackHatCoiner on June 01, 2022, 09:18:47 AMQuote from: hZti on June 01, 2022, 09:08:56 AMI researched it and I found out that it is used as a proof of burn address.Where is it used as a Proof of Burn? I only know 1Counterparty[1][2] that does it. Here are the informations I found: https://bitcoin.stackexchange.com/questions/70241/whats-with-this-address-1111111111111111111114olvt2",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nullama",
      "created_time": "June 01, 2022, 09:39:07 AM",
      "body": "Quote from: hZti on June 01, 2022, 09:31:03 AM~snip~But still in my opinion it does not make sense to burn the coins. If they get redistributed to the miners then they would also be lost to the people that \"burned\" them but are not lost to the network. The other coins that you get for the \"burned\" coins can't benefit in any way if the coins are not redistributed, since if they get redistributed also you can only buy the same amount of coins.It makes perfect sense.People that send their coins there have their reasons. Those coins are lost forever. There's no need to do anything about these coins in Bitcoin.It's similar to throwing a coin into an unreachable space, it's lost forever.This reminded me of my favourite burner address: 1BitcoinEaterAddressDontSendf59kuEHere you can read a lot of articles about it: https://allprivatekeys.com/btc/1BitcoinEaterAddressDontSendf59kuE",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NeuroticFish",
      "created_time": "June 01, 2022, 09:39:32 AM",
      "body": "Quote from: hZti on June 01, 2022, 09:31:03 AMIm here one year longer than you  O M G.1. Apologies.2. No offense, but under what rock where you hiding? I mean, you're not asking about anything new...Quote from: hZti on June 01, 2022, 09:31:03 AMBut still in my opinion it does not make sense to burn the coins.Well, as said, to the rest it does make sense, for various reasons - from proving something to making some addresses of theirs \"seen\" or leaving on-chain messages to posterity, or simply getting rid of something they consider too small value.Quote from: hZti on June 01, 2022, 09:31:03 AMIf they get redistributed to the miners then they would also be lost to the people that \"burned\" them but are not lost to the network.That's correct. However, in some/many cases the goal is different. If they just don't need the (dust) coins they can simply leave them untouched forever in their own wallet.Quote from: hZti on June 01, 2022, 09:31:03 AMThe other coins that you get for the \"burned\" coins can't benefit in any way if the coins are not redistributed, since if they get redistributed also you can only buy the same amount of coins.This part I didn't really get, sorry. There are various motifs behind burning coins and I may have not understood good enough your use case.I will only tell that for example Binance is (more or less) regularly burn a fairly big amount of BNB just to make the other coins more scarce (i.e. more expensive).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hZti",
      "created_time": "June 01, 2022, 09:58:42 AM",
      "body": "Quote from: NeuroticFish on June 01, 2022, 09:39:32 AMO M G.1. Apologies.2. No offense, but under what rock where you hiding? I mean, you're not asking about anything new...No worries haha, I was under the same rock that satoshi is still sitting under  Quote from: NeuroticFish on June 01, 2022, 09:39:32 AMQuote from: hZti on June 01, 2022, 09:31:03 AMThe other coins that you get for the \"burned\" coins can't benefit in any way if the coins are not redistributed, since if they get redistributed also you can only buy the same amount of coins.This part I didn't really get, sorry. There are various motifs behind burning coins and I may have not understood good enough your use case.I will only tell that for example Binance is (more or less) regularly burn a fairly big amount of BNB just to make the other coins more scarce (i.e. more expensive).Well as far as I understand people burn their coins in many cases to be able to have the right to receive an altcoin. If they \"burn\" it by sending it to an address that nobody has the private key, they can get for example 10 Altcoin for 10 BTC. If now they would send 10 BTC to an address that just redistributes the BTC they would still only get 10 Altcoin. I can see the argument that you really want to burn the coins to make bitcoin more scarce but in my opinion the amounts are way to little for it to have an impact on the network.Also of course there are reasons why people would really want to burn their coins, but I don't really see that reason if you only want to have the right to get Altcoins. But I get it that many people would see that differently.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NeuroticFish",
      "created_time": "June 01, 2022, 10:04:47 AM",
      "body": "Quote from: hZti on June 01, 2022, 09:58:42 AMWell as far as I understand people burn their coins in many cases to be able to have the right to receive an altcoin.In that case, indeed, there are better ways.For example, I remember Byteball was using a bot that was requesting people sign a message (message the bot was sending) with the private key of the Bitcoin address. Then that one was getting the same amount of altcoin as the number of Bitcoin in that address.No coins are lost and ownership is also proven. A nicer and smarter approach imho.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackHatCoiner",
      "created_time": "June 01, 2022, 10:05:05 AM",
      "body": "Quote from: hZti on June 01, 2022, 09:31:03 AMThe other coins that you get for the \"burned\" coins can't benefit in any wayBut, they supposedly do benefit in some other way. That's why altcoins exist. They supposedly do something bitcoin can't do, and a mechanism to prevent double-spending is Proof-of-Burn.Quote from: nullama on June 01, 2022, 09:39:07 AMIt's similar to throwing a coin into an unreachable space, it's lost forever.That's a bad analogy, because you can't prove you've burnt it, and burning bitcoin makes sense only if you're able to prove it.Quote from: hZti on June 01, 2022, 09:34:24 AMHere are the informations I found: https://bitcoin.stackexchange.com/questions/70241/whats-with-this-address-1111111111111111111114olvt2Note that sending coins to perfectly valid addresses, such as 1Counterparty, doesn't necessarily mean they're removed from circulation. There are more than 79 octillion private keys, on average, that can unlock these outputs. For provably burning, use OP_RETURN. Quote from: hZti on June 01, 2022, 09:58:42 AMI can see the argument that you really want to burn the coins to make bitcoin more scarce but in my opinion the amounts are way to little for it to have an impact on the network.1Counterparty currently has 2,130.96 BTC. That's 0.01% of the total circulation. It does have a little impact, and that's just from counter party.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hZti",
      "created_time": "June 01, 2022, 10:07:51 AM",
      "body": "Quote from: BlackHatCoiner on June 01, 2022, 10:05:05 AMFor provably burning, use OP_RETURN. Why does that make it more provable? As far as I know this just adds am Message to the transaction?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o_e_l_e_o",
      "created_time": "June 01, 2022, 10:08:33 AM",
      "body": "Quote from: hZti on June 01, 2022, 09:31:03 AMBut still in my opinion it does not make sense to burn the coins.And it doesn't make sense to throw money in to wells, fountains, or other water features in order to \"make a wish\", and yet people do it probably tens of thousands of times a day all over the world. Ultimately, such is the beauty of bitcoin. Your coins are yours and yours alone, and you can use them however you wish. If you want to burn your coins then you are free to do so, even if everyone else thinks it's a stupid idea.Also worth pointing out that coins in such addresses are not provably burned. They could still be spent in the future, if someone either stumbles across the correct private key or if the ECDLP and hash functions are broken and someone can reverse engineer a necessary private key for one of these addresses. Only coins which are sent to unspendable outputs, such as OP_RETURN, are provably burned.Quote from: hZti on June 01, 2022, 10:07:51 AMWhy does that make it more provable? As far as I know this just adds am Message to the transaction?Because an OP_RETURN script cannot be unlocked, and so these coins cannot be spent. Coins in burn addresses can be unlocked by one of the correct private keys, it is just that no one knows what those private keys are.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hZti",
      "created_time": "June 01, 2022, 10:15:45 AM",
      "body": "Quote from: o_e_l_e_o on June 01, 2022, 10:08:33 AMQuote from: hZti on June 01, 2022, 09:31:03 AMBut still in my opinion it does not make sense to burn the coins.And it doesn't make sense to throw money in to wells, fountains, or other water features in order to \"make a wish\", and yet people do it probably tens of thousands of times a day all over the world. Well my whole point was, if it may be that people burn their coins maybe because the bitcoin network does not offer an address that does not lock the coins but redistributes them. But I guess it would be to difficult to implement such an address now in the network for a quiet little use that it would offer.Quote from: o_e_l_e_o on June 01, 2022, 10:08:33 AMQuote from: hZti on June 01, 2022, 10:07:51 AMWhy does that make it more provable? As far as I know this just adds am Message to the transaction?Because an OP_RETURN script cannot be unlocked, and so these coins cannot be spent. Coins in burn addresses can be unlocked by one of the correct private keys, it is just that no one knows what those private keys are.Ok that makes sense.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o_e_l_e_o",
      "created_time": "June 01, 2022, 12:16:23 PMLast edit: June 01, 2022, 02:04:19 PM by o_e_l_e_o",
      "body": "Quote from: hZti on June 01, 2022, 10:15:45 AMWell my whole point was, if it may be that people burn their coins maybe because the bitcoin network does not offer an address that does not lock the coins but redistributes them. But I guess it would be to difficult to implement such an address now in the network for a quiet little use that it would offer.The question would be - redistributes them to whom? You can't redistribute them to everyone since there would not be enough coins to go around. Provably burning coins such as with OP_RETURN outputs is the only way to effectively redistribute them to everyone, by making everyone else's coins equally more rare and therefore equally more valuable.If you want to redistribute them to miners, then as above, just add them all to the fee of your transaction. Alternatively, if you want to get rid of them then you could gift them to a charity or project which accepts bitcoin, such as Tor, Tails, Wallet Scrutiny, mempool.space, or the devs themselves.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ABCbits",
      "created_time": "June 01, 2022, 12:37:35 PM",
      "body": "Quote from: hZti on June 01, 2022, 10:15:45 AMWell my whole point was, if it may be that people burn their coins maybe because the bitcoin network does not offer an address that does not lock the coins but redistributes them. But I guess it would be to difficult to implement such an address now in the network for a quiet little use that it would offer.Bitcoin protocol simply doesn't have mechanism to redistribute your coin. Some altcoin have redistribute mechanism under certain condition (e.g. coin not moved in 3 years), but there's concern how should it works and who should receive it (all non-empty address, miner, master node, etc.). For Bitcoin, you need to do it by yourself.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaveF",
      "created_time": "June 01, 2022, 02:28:54 PM",
      "body": "Quote from: o_e_l_e_o on June 01, 2022, 10:08:33 AM....Because an OP_RETURN script cannot be unlocked, and so these coins cannot be spent. Coins in burn addresses can be unlocked by one of the correct private keys, it is just that no one knows what those private keys are.I know I have said this before but that is not 100% true / proven.With some of these addresses:We *assume* that due to the math that nobody has the address.We can prove that to generate the address through brute force cannot be done before the sun goes nova and destroys the Earth.We CANNOT prove that nobody has it.You can't prove a negative. And there is always the 2^160 to 1 chance (close enough to zero to be zero but still not zero)that someone has one of them.Sorry it's just one of those things that I think should be out there.-Dave",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dkbit98",
      "created_time": "June 02, 2022, 08:41:44 PM",
      "body": "Quote from: hZti on June 01, 2022, 09:08:56 AMIn my opinion it does not make sense, since the value is destroyed and not transferred to the other project even if it might seem like it in the first place. Also there could be an option built into the bitcoin network to burn coins, but actually insert them into blocks to be redistributed to the miners. What are your thoughts on this?There is no good reason why you should give miners any coins for free, and burn addresses is a good concept in my opinion.It's the similar thing like if you wanted to burn and destroy paper money for any reason, making it unusable in future, we have same thing here with Bitcoin.This only makes Bitcoin more valuable because it reduces real circulating supply of coins and it increases value and demand for Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "larry_vw_1955",
      "created_time": "June 03, 2022, 03:23:15 AM",
      "body": "Quote from: DaveF on June 01, 2022, 02:28:54 PMAnd there is always the 2^160 to 1 chance (close enough to zero to be zero but still not zero)that someone has one of them.Not only that but that someone will end up cracking to get the cash if the balance gets too big. The chance of that is probably even bigger.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "June 03, 2022, 03:34:52 AM",
      "body": "Quote from: larry_vw_1955 on June 03, 2022, 03:23:15 AMNot only that but that someone will end up cracking to get the cash if the balance gets too big. The chance of that is probably even bigger.It is not possible to \"crack\" a bitcoin address. Besides, if anyone wanted to waste their time on an impossible task they would have chosen one of the existing addresses with large balance instead of a burn address that would have far less.For example 1P5ZEDWTKTFGxQjZphgWPQUpe554WKDfHQ contains about $4 billion worth of bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "garlonicon",
      "created_time": "June 03, 2022, 04:28:49 AM",
      "body": "There are two nice ways to burn coins: the user-based way is called OP_RETURN, but there is also miner-based way: it is possible to just claim less coins in the coinbase transaction. Then, they are burned, and chain reorganization is the only way to get them back into the circulation. When it comes to burning, my favourite way is the miner way, because it has no trace in the UTXO set for all clients, just because there is no output that can be used to show that \"here are some burned coins\".",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}