{
  "id": "topic_5406698",
  "title": "GazetaBitcoin",
  "author": "GazetaBitcoin",
  "created_time": "July 18, 2022, 10:42:56 AMLast edit: May 14, 2023, 11:21:07 AM by GazetaBitcoin",
  "content": "I encountered yesterday a very curious situation, when I tried to merit a post, written by 1miau, and the system did not allow me to send any merit. I will show the error below but first I'll offer some more details.The post in question is this one: https://bitcointalk.org/index.php?topic=4415262.msg60579799#msg60579799.As you can see, it was written inside German local board.I do not have this board at my ignore list.I did not send more than 50 merits to 1miau within past 30 days, thus this can not be the reason (and, if I remember well, for trying to send more than 50 merits within 30 days you get a specific error message, not the one I present below).I tried more than once to merit that post, each time with same result. I even tried in the next day (meaning today).Does anyone have any idea why this happens?P.S.: feel free to merit that post",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5406698",
  "comments": [
    {
      "author": "PX-Z",
      "created_time": "July 18, 2022, 11:04:41 AM",
      "body": "Based on theymos' post...Quote from: https://bitcointalk.org/index.php?topic=3369731.msg35345872#msg35345872Permissions and ignored-boards can also cause info to be missing per-user. In this case I think that it happened because The Pharmacist is ignoring the board in which that post resides.The ignored-boards page says, \"Be advised that by ignoring a board it will be completely inaccessible to you.\" How it works is that almost all forum systems view you as being not allowed to see the board, just like hidden boards. This is also why you can't quote a post in an ignored board.So I tried to ignored the board \"Deutsch (German)\" thinking it will give me the same error and then tried to give merit and it through, you can see the post too. I wonder what are the conditions should be meet to encounter that error message, yet you cannot do it in the other hand since you say you didn't ignore the board.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FatFork",
      "created_time": "July 18, 2022, 11:39:55 AM",
      "body": "Quote from: GazetaBitcoin on July 18, 2022, 10:42:56 AMDoes anyone have any idea why this happens?Are you sure you don't have that board on ignore?Local > Deutsch (German) > Altcoins (Deutsch)PX-Z said he tried to ignore the \"Deutsch (German)\" board, but actually, when I ignored the \"Altcoins (Deutsch)\" board, I got the same message:https://bitcointalk.org/index.php?action=merit;msg=60579799EDIT: I was again able to merit that post after unignoring the board in my profile preferences.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PX-Z",
      "created_time": "July 18, 2022, 11:49:41 AM",
      "body": "Quote from: FatFork on July 18, 2022, 11:39:55 AMAre you sure you don't have that board on ignore?Local > Deutsch (German) > Altcoins (Deutsch)PX-Z said he tried to ignore the \"Deutsch (German)\" board, but actually, when I ignored the \"Altcoins (Deutsch)\" board, I got the same message:Yeah, you're right, what i have ignored is the Deutsch (German)  thinking that all the sub-board of german will automatically ignored too. So i tried to ignore particularly the \"Altcoins (Deutsch)\" and hit the merit button then got the same error.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PrimeNumber7",
      "created_time": "July 18, 2022, 02:11:39 PM",
      "body": "Quote from: GazetaBitcoin on July 18, 2022, 10:42:56 AMP.S.: feel free to merit that post I sent that post a merit on your behalf. QuoteDoes anyone have any idea why this happens?You have ruled out the only root causes that I can think of. Based on the fact that you received the same message that The Pharmacist did when he tried to merit a post in a board that he didn't have permission to view (because he ignored the board), I think there may be an issue with your permissions, but I don't know what is causing it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GazetaBitcoin",
      "created_time": "July 18, 2022, 03:51:03 PM",
      "body": "Quote from: PrimeNumber7 on July 18, 2022, 02:11:39 PMI sent that post a merit on your behalf.Thank you, PrimeNumber7  Much appreciated!Quote from: PrimeNumber7 on July 18, 2022, 02:11:39 PMYou have ruled out the only root causes that I can think of. Based on the fact that you received the same message that The Pharmacist did when he tried to merit a post in a board that he didn't have permission to view (because he ignored the board), I think there may be an issue with your permissions, but I don't know what is causing it.Thanks, I just managed to figure this out, based on your comment.The problem was the following: I did not have German board at ignore, as I stated in OP but (big but here ) I had its sub boards on ignore. And, because of this, I could not merit that post, since it was written in German Altcoin sub-board.And, when I checked yesterday to make sure that I do not have German board on my ignore list, I pressed \"Ctrl+F\" in the Ignore Boards Preferences page and typed \"German\". I just saw that German board is unchecked (meaning it was not ignored), without noticing that its sub-boards are ignored though...But now, thanks to your reply, I figured it out! Thanks again! I also sent a few merits to that post made by 1miau That's all, locking the topic now, as the problem is solved.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}