{
  "id": "topic_5448835",
  "title": "ATUK22",
  "author": "ATUK22",
  "created_time": "April 14, 2023, 12:54:43 PM",
  "content": "Hi EveryoneI have come across the UT Bot alert indictor/strategy on tradingview, what indictors are in the strategy? also what is the actual strategy ? https://www.tradingview.com/v/VKMgZdYr/CheersAndrew",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5448835",
  "comments": [
    {
      "author": "ImThour",
      "created_time": "April 14, 2023, 01:51:45 PM",
      "body": "All the indicators are derived from the price. If you understand the simple philosophy of price action, trading will be much easier for you.There are some indicators that are a must like RSI and Stoch RSI and Moving Averages. Other than that, it's just silly indicators. You should learn more about price action trading and that will be very beneficial for you if you want to continue your trading journey.Now let's talk about the post itself. You should have made this post in Trading Discussion Section: https://bitcointalk.org/index.php?board=8.0I think you have the option to move your thread just on the right-hand side of the screen. Try it or ask any moderator to help you to move the post to the correct board.This section (Beginners & Help) is mainly related to help you need on this forum rather than in any specific genre.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "April 14, 2023, 03:10:25 PM",
      "body": "Based on this article ----> https://www.tradingview.com/script/R9nsvSZR/, this is an explanation of what this strategy is:QuoteFor this strategy, 3 indicators are used:UT Bot Alerts indicator by QuantnomadOne Ema of 200 periods for indicate the trendAtr stop loss from GatherioSo the basis of this strategy is the Exponential Moving Average (EMA) for a period of 200 weeks with a stop loss order, so in short, it is dependent on one indicator and may give you good results, except that you see the market from one perspective and thus increase the possibility of achieving a loss.It is true that there is a stop order and a stop loss strategy at 2.5%, but repeating it without understanding in the long term may achieve real losses.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}