{
  "id": "topic_5465638",
  "title": "ImThour",
  "author": "ImThour",
  "created_time": "September 04, 2023, 04:17:33 PM",
  "content": "Crypto exchange Bitfinex holds bitcoin on its balance sheet. Bitfinex has historically kept part of its trading fee earnings in bitcoin, a source said. Bitfinex's sister firm Tether is the 11th largest bitcoin holder.https://www.theblock.co/post/248984/bitfinex-bitcoin-balance-sheetWhat do you guys want to say on this? I am sure every exchange holds Bitcoin on their balance sheet however maybe Bitfinex is holding more? I would love to see if we can get a clear amount of what exactly they hold.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5465638",
  "comments": [
    {
      "author": "Faisal2202",
      "created_time": "September 04, 2023, 04:35:47 PM",
      "body": "Quote from: ImThour on September 04, 2023, 04:17:33 PMCrypto exchange Bitfinex holds bitcoin on its balance sheet. Bitfinex has historically kept part of its trading fee earnings in bitcoin, a source said. Bitfinex's sister firm Tether is the 11th largest bitcoin holder.https://www.theblock.co/post/248984/bitfinex-bitcoin-balance-sheetWhat do you guys want to say on this? I am sure every exchange holds Bitcoin on their balance sheet however maybe Bitfinex is holding more? I would love to see if we can get a clear amount of what exactly they hold.Well 8 or 9 months ago Bitfinex hold around $3.5 Billion dollars. According to th following news. https://www.google.com/amp/s/cryptoslate.com/bitfinex-closes-week-leading-bitcoin-reserves-according-to-glassnode/  Well, the timespan is 9 months almost and BTC really had provided a lot of opportunities to buyer and without proper or official news nothing could be for sure but few days ago someone made a topic here about 3 most BTC holding exchanges and Robin exchange was at 3rd positions but in those 3 exchanges list Bitfinex was not included. So it indicates that Bitfinex is not the only exchange who is reinvesting in BTC after making profits out of BTC. But still, I am open to all ideas. If I have to guess then I will say they might have around $4 billion in BTC. I know guessing is not going to help you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nwada001",
      "created_time": "September 04, 2023, 06:00:31 PM",
      "body": "According to this data below, I notice that Bitfinex is ranked as the number 2 top exchange with the highest Bitcoin holdings on their custody, followed by Binance. Although I have come across some data that contains a few addresses that are identified as those of Binance, how can one verify the data of others that have merely been shown on some spreadsheets prepared by an analyst? I would really find it interesting if I could see the wallet of Bitfinex for correct data keeping and clarification and to be sure that the exchanges are not just claiming what they are not holding. Source",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DVlog",
      "created_time": "September 04, 2023, 06:34:27 PM",
      "body": "Quote from: ImThour on September 04, 2023, 04:17:33 PMCrypto exchange Bitfinex holds bitcoin on its balance sheet. Bitfinex has historically kept part of its trading fee earnings in bitcoin, a source said. Bitfinex's sister firm Tether is the 11th largest bitcoin holder.https://www.theblock.co/post/248984/bitfinex-bitcoin-balance-sheetWhat do you guys want to say on this? I am sure every exchange holds Bitcoin on their balance sheet however maybe Bitfinex is holding more? I would love to see if we can get a clear amount of what exactly they hold.We know that very well tether is a ticking bomb. It will put a big hole into the whole industry and it will be bigger than Luna, UST, and FTX combined. Keeping part of their earning in Bitcoin is a good move by them. Most of the exchanges do it I think. Big exchanges keep their holding in bitcoin not only for investment purposes but also to manipulate the market. Most of the manipulating happens in bitcoin market done by these big exchanges and whales. I think binance is holding more bitcoin that bitfinex because of its size.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SmartGold01",
      "created_time": "September 04, 2023, 06:56:12 PM",
      "body": "Quote from: Nwada001 on September 04, 2023, 06:00:31 PMSnipWell some data can't be taking as real factors following the image below and I noticed that they are unknown source so, this could be true or false since there is no solid and concrete evidence that proves those factors. However, does address displayed holders name?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ZAINmalik75",
      "created_time": "September 04, 2023, 06:57:28 PM",
      "body": "Quote from: Nwada001 on September 04, 2023, 06:00:31 PMAccording to this data below, I notice that Bitfinex is ranked as the number 2 top exchange with the highest Bitcoin holdings on their custody, followed by Binance. Although I have come across some data that contains a few addresses that are identified as those of Binance, how can one verify the data of others that have merely been shown on some spreadsheets prepared by an analyst? I would really find it interesting if I could see the wallet of Bitfinex for correct data keeping and clarification and to be sure that the exchanges are not just claiming what they are not holding.You are right, as sometimes ago flexystar made a topic in which he mentioned 3 exchanges that have the most holdings in BTC and those exchanges are Binance, Bitfinex and Robin exchange. https://bitcointalk.org/index.php?topic=5464851.msg62761183#msg62761183According to this topic Bitfinex had around 4.3 billions of dollars in holding in the the form of BTC I hope it would also help op. Quote from: DVlog on September 04, 2023, 06:34:27 PMWe know that very well tether is a ticking bomb. It will put a big hole into the whole industry and it will be bigger than Luna, UST, and FTX combined. Keeping part of their earning in Bitcoin is a good move by them. Most of the exchanges do it I think. Big exchanges keep their holding in bitcoin not only for investment purposes but also to manipulate the market. Most of the manipulating happens in bitcoin market done by these big exchanges and whales. I think binance is holding more bitcoin that bitfinex because of its size. You are totally right Binance has the most BTC in holding and Bitfinex is at second number. And you are also right about tether which is a sister firm of Bitfinex. And to be really honest I did not have that idea before but now while I Have the idea I think it is also not good for Bitfinex too. As after reading some of the articles both brother and sister firms are accused and blamed by many news medias that they are sharing funds to back each other up. To be honest, these holdings of exchanges in BTC are not that much in compare to the total market cap of the BTC so I do not really think these volumes could really have enough potential to create manipulation but of course there are many other factors also included that plays important role in manipulation of market and these 3 exchanges could play an important role there specially Binance.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DVlog",
      "created_time": "September 04, 2023, 07:45:06 PM",
      "body": "Quote from: ZAINmalik75 on September 04, 2023, 06:57:28 PMQuote from: DVlog on September 04, 2023, 06:34:27 PMWe know that very well tether is a ticking bomb. It will put a big hole into the whole industry and it will be bigger than Luna, UST, and FTX combined. Keeping part of their earning in Bitcoin is a good move by them. Most of the exchanges do it I think. Big exchanges keep their holding in bitcoin not only for investment purposes but also to manipulate the market. Most of the manipulating happens in bitcoin market done by these big exchanges and whales. I think binance is holding more bitcoin that bitfinex because of its size. You are totally right Binance has the most BTC in holding and Bitfinex is at second number. And you are also right about tether which is a sister firm of Bitfinex. And to be really honest I did not have that idea before but now while I Have the idea I think it is also not good for Bitfinex too. As after reading some of the articles both brother and sister firms are accused and blamed by many news medias that they are sharing funds to back each other up. To be honest, these holdings of exchanges in BTC are not that much in compare to the total market cap of the BTC so I do not really think these volumes could really have enough potential to create manipulation but of course there are many other factors also included that plays important role in manipulation of market and these 3 exchanges could play an important role there specially Binance.Yeah, we have seen how one company can impact another. Alameda research and FTX is a good example of it. If somehow tether go down in the future bitfinex will try to save it in any mean or their financial connection can cash destruction for both company. What I am concerned about is tether's market cap. When every other stablecoin's market cap is going down tether is going up. There is something that is not right about tether. Also, it's based in Singapore, and the SEC already mentioned that a foreign entity can not issue USD-pegged stablecoin. So they will have a hard time operating in the USA.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "The Cryptovator",
      "created_time": "September 04, 2023, 08:00:16 PM",
      "body": "We may get random data from the internet which exchange holding how much Bitcoin, but that doesn't mean this amount would be accurate. Holding means their holding actually, it shouldn't count users' funds. I believe all the exchanges hold Bitcoin but unfortunately, we won't get accurate data. They might hold different addresses and wallets. Unless they announce it officially we may just guess.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Upgrade00",
      "created_time": "September 04, 2023, 08:05:52 PM",
      "body": "It is no surprise that a crypto exchange is holding cryorocurrency in their balance sheet. They will obviously try to keep the exact amount on Bitcoin they hold secret as well as the means of storing the Bitcoin, but they all will definitely have some sats in their sheet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Aanuoluwatofunmi",
      "created_time": "September 04, 2023, 08:18:07 PM",
      "body": "Quote from: ImThour on September 04, 2023, 04:17:33 PMCrypto exchange Bitfinex holds bitcoin on its balance sheet. Bitfinex has historically kept part of its trading fee earnings in bitcoin, a source said. Bitfinex's sister firm Tether is the 11th largest bitcoin holder.https://www.theblock.co/post/248984/bitfinex-bitcoin-balance-sheetWhat do you guys want to say on this? I am sure every exchange holds Bitcoin on their balance sheet however maybe Bitfinex is holding more? I would love to see if we can get a clear amount of what exactly they hold.There are thousands of bitcoin non custodial wallets that hold larger a amount of money in them, and his are whales we only know about their holding capacity but couldn't establish a fact on who they really are, in the case of Bitfinex, who are the ones behind the wallet address involved here, how genuine is the source, are they truly from Bitfinex, lastly, what will be the aftermath to this discovery if found to be true, are the victim recovering back their looted assets or what.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nwada001",
      "created_time": "September 04, 2023, 09:02:45 PM",
      "body": "Quote from: SmartGold01 on September 04, 2023, 06:56:12 PMdoes address displayed holders name?Yes, most of the addresses have names on them, but a few don't. Some only have names without addresses, but there are figures added to their names, and the accuracy of those figures gets me worried.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SquirrelJulietGarden",
      "created_time": "September 05, 2023, 12:31:46 AM",
      "body": "According to Bitinfocharts.com for top 100 richest Bitcoin addresses, Bitfinex has two wallet addresses in the list. One at the second position and another one at 50th position.Two wallet addresseshttps://bitinfocharts.com/bitcoin/address/bc1qgdjqv0av3q56jvd82tkdjpy7gdp9ut8tlqmgrpmv24sq90ecnvqqjwvw97https://bitinfocharts.com/bitcoin/address/3JZq4atUahhuA9rLhXLMhhTo133J9rF97jWalletexplorer.com does not have clear figure for Bitfinex balance.https://www.walletexplorer.com/wallet/Bitfinex.com",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joniboini",
      "created_time": "September 05, 2023, 01:48:09 AM",
      "body": "Quote from: Nwada001 on September 04, 2023, 09:02:45 PMYes, most of the addresses have names on them, but a few don't. Some only have names without addresses, but there are figures added to their names, and the accuracy of those figures gets me worried.Are you referring to those self-reported figures or just the number of whales in general? Or are you referring to the privacy risk associated with it? If you're just a regular trader I don't think you need to worry that much. Most of these addresses are trackable and it doesn't take a lot of time to consolidate which address is owned by whom as long as you have enough data. Most of them are exchanges or organizations that can be tracked easily imo. If you never use centralized exchange or if you mix your coins/use coinjoin then it should add another layer of privacy to protect your identity. But then again it doesn't matter if you willingly give your details to somebody else including which addresses you own, etc.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GreatArkansas",
      "created_time": "September 05, 2023, 02:05:18 AM",
      "body": "Quote from: SquirrelJulietGarden on September 05, 2023, 12:31:46 AMAccording to Bitinfocharts.com for top 100 richest Bitcoin addresses, Bitfinex has two wallet addresses in the list. One at the second position and another one at 50th position.(....)But we don't know if these Bitcoins are really theirs because they have exchanges and they have customers. Maybe it is owned by their customers.I am really curious why these cryptocurrency exchanges don't have any transparency like other public listed companies like MicroStrategy who are transparent and need to disclose their total holdings of Bitcoin. Maybe it's because they are not public listed companies?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blue Snow",
      "created_time": "September 05, 2023, 02:27:44 AM",
      "body": "Quote from: ImThour on September 04, 2023, 04:17:33 PMWhat do you guys want to say on this? I am sure every exchange holds Bitcoin on their balance sheet however maybe Bitfinex is holding more? I would love to see if we can get a clear amount of what exactly they hold.I'm not surprised to see this data, since they have and created a tether that can be paired with Bitcoin, whatever the situation, they can do anything with that stablecoin. And, I am really sure they have another crypto besides bitcoin which may be more than that data. Maybe what they did in the past is true, they manipulated tether to buy a lot of Bitcoin and hold it. so it's not surprising if today they are in 11th place as the largest bitcoin holder.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "adaseb",
      "created_time": "September 05, 2023, 04:21:57 AM",
      "body": "I think the way it works is as follows. Tether holds mostly US treasuries with that tether. So they are getting 5% per year. They got like 60B worth so they make billions doing nothing pretty much.Some of that money they used to buy Bitcoin. I think they do this because there really isn’t much else to invest to be honest. Most other assets are already overpriced or risky. Hence Bitcoin at $20k or $25K seemed like a safe investment for tether.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "retreat",
      "created_time": "September 05, 2023, 08:32:49 AM",
      "body": "Quote from: Nwada001 on September 04, 2023, 06:00:31 PMAccording to this data below, I notice that Bitfinex is ranked as the number 2 top exchange with the highest Bitcoin holdings on their custody, followed by Binance. Although I have come across some data that contains a few addresses that are identified as those of Binance, how can one verify the data of others that have merely been shown on some spreadsheets prepared by an analyst? I would really find it interesting if I could see the wallet of Bitfinex for correct data keeping and clarification and to be sure that the exchanges are not just claiming what they are not holding. Source It's quite interesting to see how Binance holds almost 500k Bitcoins in their wallets, but if we look at the size of Binance globally, I think that they hold more than that, maybe up to 600k Bitcoins spread across many wallets.But even so, looking at how Binance operates up to now, I can quite admit that Binance is a global exchange whose operations are quite good and they manage their assets very well. Even though many people are worried that Binance might collapse like FTX or other exchanges, I think that CZ will not let that happen because Binance's collapse might shake up the crypto world globally and many people don't want that either.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SquirrelJulietGarden",
      "created_time": "September 05, 2023, 10:42:17 AM",
      "body": "Quote from: GreatArkansas on September 05, 2023, 02:05:18 AMBut we don't know if these Bitcoins are really theirs because they have exchanges and they have customers. Maybe it is owned by their customers.We can not know but my assumption is these bitcoins include Bitfinex exchange asset and some from their customers. It makes sense for all exchanges to move their customers' deposited bitcoin from hot wallets to cold wallets for better security and safety. They can store it in a same cold wallet or in different cold wallets.QuoteI am really curious why these cryptocurrency exchanges don't have any transparency like other public listed companies like MicroStrategy who are transparent and need to disclose their total holdings of Bitcoin. Maybe it's because they are not public listed companies?It is not only about transparency but also about safety for customers' funds. The rapid collapse of FTX because of misuse of customers' funds raised a lot of pressure and demand on centralized exchanges to publicly release report about their treasuries and fund managements, trusted credits. Binance is the one that went first with credits but so far, no big change in centralized cryptocurrency exchanges.We have to wait for more regulations on centralized exchanges to have that. Even banks with more regulations, requirements on fund management, still have bankruptcies.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Potato Chips",
      "created_time": "September 06, 2023, 04:23:36 AM",
      "body": "What's with the article though? The headline is \"Crypto exchange Bitfinex holds bitcoin on its balance sheet\" but it doesn't say much about this except that a trusted source has told them. The rest of the content are about how bitfinex invest a part of their money to bitcoin and their sister company.First part of the article and the 2nd stanza is already a different topic???Quote from: https://www.theblock.co/post/248984/bitfinex-bitcoin-balance-sheetCrypto exchange Bitfinex holds bitcoin on its balance sheet, a source with direct knowledge of the matter told The Block.Bitfinex has historically kept part of its trading fee earnings in bitcoin as a long-term commitment to the world's first and largest cryptocurrency, the source said, declining to comment on absolute figures.This looks like a promotional article for bitfinex to me lol.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}