{
  "id": "topic_5433464",
  "title": "Justaboredrandomguy",
  "author": "Justaboredrandomguy",
  "created_time": "January 08, 2023, 11:32:08 AM",
  "content": "I need to buy a HUGE amount of Bitcoins for a company, about 500+ bitcoins; so I prefer dealing with a company too or a TRUSTED INDIVIDUAL with this amount. We prefer Cash trade ... so we have to meet. Bank deposit is also a choice and your company account must be able to hold huge amounts! Location is Manila Philippines.  Trade will be done via Localbitcoins Escrow or another Trusted Escrow. Please anyone interested in this trade drop me a PM with your direct contacts too. Its urgent!Regards.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5433464",
  "comments": [
    {
      "author": "Tytanowy Janusz",
      "created_time": "January 13, 2023, 06:04:57 PM",
      "body": "This thread belong here -  Marketplace > Currency exchange And why not use Localbitcoins too find P2P trade?In Philippines there are 13 ATMs so there must be  many local companies that do cash/crypto trades on daily basis. https://coinatmradar.com/Just contact one of them and make an offer.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "The Cryptovator",
      "created_time": "January 13, 2023, 06:56:12 PM",
      "body": "I'm curious, why are you mentioning escrow when you're buying from Local Bitcoin? As far as I know, Local Bitcoin is a peer-to-peer exchange that escrows funds. So you can buy directly from there. Binance, on the other hand, is an option. It's recently become the most popular peer-to-peer exchange because it's fast and reliable. If you are serious about purchasing, choose the most secure option. Don't put your money in the hands of anyone online. By the way, don't put your money in any exchange. Keep your money in a hardware wallet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mendace",
      "created_time": "January 14, 2023, 01:53:31 PM",
      "body": "Quote from: Justaboredrandomguy on January 08, 2023, 11:32:08 AMI need to buy a HUGE amount of Bitcoins for a company, about 500+ bitcoins; so I prefer dealing with a company too or a TRUSTED INDIVIDUAL with this amount. We prefer Cash trade ... so we have to meet. Bank deposit is also a choice and your company account must be able to hold huge amounts! Location is Manila Philippines.  Trade will be done via Localbitcoins Escrow or another Trusted Escrow. Please anyone interested in this trade drop me a PM with your direct contacts too. Its urgent!Regards.Excuse me but does it seem normal to you to write in a forum that you are interested in 500 Bitcoins and that you would like to buy them for half a banknote mostly in Manila, a city that is certainly not as safe as a European or American one?  Who would be the fool to come in attendance?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "YOSHIE",
      "created_time": "January 14, 2023, 02:46:40 PM",
      "body": "Quote from: Justaboredrandomguy on January 08, 2023, 11:32:08 AMPlease anyone interested in this trade drop me a PM with your direct contacts too. Its urgent!500 BTC is a huge amount, you can choose a crypto trading platform here: The Rise of Cryptocurrency: Top Crypto Trading Platforms in the Philippines, that you want to use a certain amount, no company/individual wants to trade in the Escrow method with you.Escrow does not guarantee your assets, you need to do it yourself, that is for sure everything at your own risk. The Philippines has a local board here: https://bitcointalk.org/index.php?board=219.0, for you to talk about and there are members you can tap directly to talk about your method.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jrrsparkles",
      "created_time": "January 14, 2023, 07:21:38 PM",
      "body": "Quote from: Justaboredrandomguy on January 08, 2023, 11:32:08 AMI need to buy a HUGE amount of Bitcoins for a company, about 500+ bitcoins; so I prefer dealing with a company too or a TRUSTED INDIVIDUAL with this amount. We prefer Cash trade ... so we have to meet. Bank deposit is also a choice and your company account must be able to hold huge amounts! Location is Manila Philippines.  Trade will be done via Localbitcoins Escrow or another Trusted Escrow. Please anyone interested in this trade drop me a PM with your direct contacts too. Its urgent!Regards.FYI, Localbitcoin stopped escrowing offline trade for years now so if you're not familiar with that then understand it, and I don't believe no personal is trusted enough to hold 500 BTC with its current value so better prefer multi signature escrow so trust doesn't need to be completely on one person.Why it has become a trend to post these kind of topics and then let it become ghost!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}