{
  "id": "topic_5451142",
  "title": "tread93",
  "author": "tread93",
  "created_time": "May 03, 2023, 05:58:51 PM",
  "content": "So I now own an Android, I got sick of apple and wanted to change things up. I'm genuinely interested to know what are the real pros vs. cons on owning one vs. apple? Especially in the sense for BTC or crypto purposes in, how does android compare for anything crypto related vs. Apple?Are they way ahead of the game here? Are they behind? I feel like both appear to want to be more crypto user friendly.....",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5451142",
  "comments": [
    {
      "author": "BitMaxz",
      "created_time": "May 03, 2023, 06:52:05 PM",
      "body": "I'm an iPhone user before but it was a long time ago I already switch to Samsung Android.The only thing that I want on IOS they care for privacy compared to Android the only downside on IOS is they do have fewer supported apps and games compared to Android and another thing is IOS eats so much data.About Crypto then Android should be the best because it is more flexible and more wallets are supported compared to IOS.The only downside on Android most of the systems are built or integrated with Google services it feels like I was being monitored by Google(I do not know).However, ever since I have never experienced I was being hacked or compromised most of the Crypto wallet is in my Android phone.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FatFork",
      "created_time": "May 03, 2023, 07:01:58 PM",
      "body": "In my opinion, there isn't a clear winner between Android and Apple iOS when it comes to anything crypto related. Both platforms have their own strengths and weaknesses as operating systems, and both Android and Apple iOS are capable of supporting crypto-related apps. Apple iOS is proprietary software available exclusively on Apple devices, while Google Android is an open-source operating system used by a variety of smartphone manufacturers, which makes it more flexible and adaptable than its competitors. This means that Android users have access to a wider range of crypto-related apps and features. Plus, with Google Play Store's relaxed app submission guidelines, there are more crypto-related apps available for Android users to choose from. However, Android's open platform can also make it more susceptible to security vulnerabilities, so you'll want to be extra careful when it comes to protecting your crypto assets. Apple's App Store, on the other hand, is more restrictive in terms of the apps it allows, and this can actually be an advantage when it comes to security. Apple's stricter guidelines mean that users are less likely to download malicious apps from the official store.So, whether you prefer one platform over the other based on factors such as user interface, app or device availability, or any other factors is entirely a matter of personal choice.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "May 03, 2023, 08:11:31 PM",
      "body": "You got sick of iOS and now using Android device. That means you got sick of a mobile wallet and now using a mobile wallet.Mobile wallets are online wallets and not safe and secure like cold wallets. Do not hold more than what you can afford to lose on a mobile wallet. Get yourself a cold wallet instead for large amount of bitcoin.As for Android bitcoin wallets, you have many supported wallets like Electrum and Bluewallet.As for security, only hold the amount you can afford to lose on mobile wallet. Be careful of malware.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "logfiles",
      "created_time": "May 03, 2023, 09:14:42 PM",
      "body": "The security of your crypto wallet will mostly depend on you. A software wallet on a mobile phone that's always connected to the internet isn't as secure as on in an air gapped device.Android has an advantage because you will easily get a variety of apps that are not sometimes available in the App Store, but Googeplay is a sea of apps, some of which are malware. You have to be very careful when downloading apps.Just:1. Do not install apps from unknown sources2. Only install official and reputable apps3. Do not root your device.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dkbit98",
      "created_time": "May 03, 2023, 09:18:24 PM",
      "body": "Quote from: tread93 on May 03, 2023, 05:58:51 PMI'm genuinely interested to know what are the real pros vs. cons on owning one vs. apple? Unless you are using degoogled open source version of Android (like Graphene) experience is probably going to be worse than using iPhone.You have a bunch of ads, and there is good chance you will be spied by Chinese or other manufacturers, most of them distribute phones with bunch of crapware.Quote from: tread93 on May 03, 2023, 05:58:51 PMEspecially in the sense for BTC or crypto purposes in, how does android compare for anything crypto related vs. Apple?Most of the Bitcoin stuff, wallets and other apps are available both on Android and iPhones.Google Play is less secure, it's easier to install some scam application, mostly because it's much harder to get application listed in Apple store.Positive thing for Android is that you can install more applications and you can install open source operating system without use of any g00gle apps.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "_act_",
      "created_time": "May 03, 2023, 09:40:29 PM",
      "body": "Quote from: dkbit98 on May 03, 2023, 09:18:24 PMYou have a bunch of ads, and there is good chance you will be spied by Chinese or other manufacturers, most of them distribute phones with bunch of crapware.You can enjoy reading this google ways of helping scammers while the government are doing nothing:Google Ads data: $4M stolen through crypto phishing URLsThis is what that was researched, there will be more than this.Although I am not saying Apple is better either too.You can use either Android or Apple if you know ways to avoid hackers and they are just simple ways but people are not concerned about security.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tread93",
      "created_time": "May 05, 2023, 04:25:20 AM",
      "body": "Quote from: FatFork on May 03, 2023, 07:01:58 PMIn my opinion, there isn't a clear winner between Android and Apple iOS when it comes to anything crypto related. Both platforms have their own strengths and weaknesses as operating systems, and both Android and Apple iOS are capable of supporting crypto-related apps. Apple iOS is proprietary software available exclusively on Apple devices, while Google Android is an open-source operating system used by a variety of smartphone manufacturers, which makes it more flexible and adaptable than its competitors. This means that Android users have access to a wider range of crypto-related apps and features. Plus, with Google Play Store's relaxed app submission guidelines, there are more crypto-related apps available for Android users to choose from. However, Android's open platform can also make it more susceptible to security vulnerabilities, so you'll want to be extra careful when it comes to protecting your crypto assets. Apple's App Store, on the other hand, is more restrictive in terms of the apps it allows, and this can actually be an advantage when it comes to security. Apple's stricter guidelines mean that users are less likely to download malicious apps from the official store.So, whether you prefer one platform over the other based on factors such as user interface, app or device availability, or any other factors is entirely a matter of personal choice.Great write up FatFork, this is exactly what I was looking for. Did you use Chat GPT to spruce up your response a bit? haha, just kidding.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "May 05, 2023, 07:30:06 AM",
      "body": "Quote from: tread93 on May 05, 2023, 04:25:20 AMQuote from: FatFork on May 03, 2023, 07:01:58 PMIn my opinion, there isn't a clear winner between Android and Apple iOS when it comes to anything crypto related. Both platforms have their own strengths and weaknesses as operating systems, and both Android and Apple iOS are capable of supporting crypto-related apps. Apple iOS is proprietary software available exclusively on Apple devices, while Google Android is an open-source operating system used by a variety of smartphone manufacturers, which makes it more flexible and adaptable than its competitors. This means that Android users have access to a wider range of crypto-related apps and features. Plus, with Google Play Store's relaxed app submission guidelines, there are more crypto-related apps available for Android users to choose from. However, Android's open platform can also make it more susceptible to security vulnerabilities, so you'll want to be extra careful when it comes to protecting your crypto assets. Apple's App Store, on the other hand, is more restrictive in terms of the apps it allows, and this can actually be an advantage when it comes to security. Apple's stricter guidelines mean that users are less likely to download malicious apps from the official store.So, whether you prefer one platform over the other based on factors such as user interface, app or device availability, or any other factors is entirely a matter of personal choice.Great write up FatFork, this is exactly what I was looking for. Did you use Chat GPT to spruce up your response a bit? haha, just kidding. Google began as an open source, but they are no more completely open source again. The reason is that they have many apps that comes on Android devices that are completely close source. Chrome, Gmail, Drive, Playstore and other Google services are all close source applications.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "taufik123",
      "created_time": "May 05, 2023, 10:16:12 PM",
      "body": "Quote from: dkbit98 on May 03, 2023, 09:18:24 PM-snip-You have a bunch of ads, and there is good chance you will be spied by Chinese or other manufacturers, most of them distribute phones with bunch of crapware.This often happens and is also often ignored. Although I am also an android user, I did delete some blotware or crapware or junkware built into the smartphone that was deliberately installed (Sponsor). and it was very annoying. The removal process also requires root access and some devices also require bootloader access to remove completely. Bloatware that is installed will provide advertisements that continue to appear all the time. This will be the potential for malware to enter android because of some unclear advertising links. Quote from: dkbit98 on May 03, 2023, 09:18:24 PM-snip-Google Play is less secure, it's easier to install some scam application, mostly because it's much harder to get application listed in Apple store.About Google Play, it may be because of the case of the powerful Xenomorph malware that escaped Google Protect's monitoring, so it is a bad record for Google Play. Several apps were injected using Xenomorph Malware undetected and infected many victims targeting bank apps and crypto wallets. Android malware targets 13 bitcoin wallets and 400 banksQuote from: dkbit98 on May 03, 2023, 09:18:24 PMPositive thing for Android is that you can install more applications and you can install open source operating system without use of any g00gle apps. More applications can be installed and varied, all complete. But if you install via balckmarket it is also risky.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joniboini",
      "created_time": "May 06, 2023, 12:39:21 PM",
      "body": "Quote from: taufik123 on May 05, 2023, 10:16:12 PMThis often happens and is also often ignored. Although I am also an android user, I did delete some blotware or crapware or junkware built into the smartphone that was deliberately installed (Sponsor). and it was very annoying. The removal process also requires root access and some devices also require bootloader access to remove completely. From my experience, most low-end phones do this but mid-end and high-end phones don't. I believe manufacturers do this to cut costs so that they can sell as many budget phones as they can with better profits. Fortunately, most of them can be flashed with a new custom rom without ads as far as I'm aware (unless your phone is really unpopular). I don't think people looking for budget phones are going to find an iPhone to begin with unless they are okay with secondhand devices. That being said, I don't think you should use a phone as your option if security is your biggest concern regardless of the manufacturer/OS.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "taufik123",
      "created_time": "May 06, 2023, 09:17:56 PM",
      "body": "Quote from: joniboini on May 06, 2023, 12:39:21 PM-snip-Fortunately, most of them can be flashed with a new custom rom without ads as far as I'm aware (unless your phone is really unpopular). I don't think people looking for budget phones are going to find an iPhone to begin with unless they are okay with secondhand devices. That being said, I don't think you should use a phone as your option if security is your biggest concern regardless of the manufacturer/OS.It can be seen from the price of mid-range Android phones today, getting cheaper and more affordable but with a lot of annoying bloatware. Actually, there is no need to do a custom ROM to be free from annoying ad applications, just need to remove it from the system and keep using the official ROM. and nowadays there are many copycat phones such as iPhone Supercopy phones, even though the OS is still Android which is customized to look like Android. Whether or not using a cell phone for a crypto wallet is important depends on the needs of each user. Security is certainly the main thing to think about. I am an Android user since the beginning and my crypto wallet remains safe, as long as I remain vigilant.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tread93",
      "created_time": "May 07, 2023, 01:48:46 AM",
      "body": "Quote from: Charles-Tim on May 03, 2023, 08:11:31 PMYou got sick of iOS and now using Android device. That means you got sick of a mobile wallet and now using a mobile wallet.Mobile wallets are online wallets and not safe and secure like cold wallets. Do not hold more than what you can afford to lose on a mobile wallet. Get yourself a cold wallet instead for large amount of bitcoin.As for Android bitcoin wallets, you have many supported wallets like Electrum and Bluewallet.As for security, only hold the amount you can afford to lose on mobile wallet. Be careful of malware. Haha yeah, I was sick of the jam so I got the jelly instead, or is it the other way around? Oh I don't know.Definitely agree with you on the mobile wallets, its just as bad as keeping money on an online exchange IMO. Everything that scammers and hackers can do to these days is wild. I wish there was a way to create a defense bot for your own devices. Like a ninja bot to deter scammers or intrusive users on a device's IP that scans for like unusual activity or something, is there such a thing?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yudi09",
      "created_time": "May 07, 2023, 08:53:26 AM",
      "body": "Quote from: tread93 on May 03, 2023, 05:58:51 PMSo I now own an Android, I got sick of apple and wanted to change things up. -snip-Android supports more wallets than Iphone there are some difficulties for users in terms of wallets.Android also supports more features so that it makes it more flexible according to my experience or usage.Wallet security on Android and iPhone depends on how we look after it.Apart from privacy, the advantages of the Iphone lie in the quality of the camera. For other activities, Android is more interesting for me to use.If people say, this is just Apple's business game.If iPhone users have never tried using Android, maybe they will underestimate it. But if they try to use the high-spec Android type, they can forget about the iPhone.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "logfiles",
      "created_time": "May 07, 2023, 12:05:46 PM",
      "body": "Quote from: tread93 on May 07, 2023, 01:48:46 AMDefinitely agree with you on the mobile wallets, its just as bad as keeping money on an online exchange IMO. Everything that scammers and hackers can do to these days is wild. I wish there was a way to create a defense bot for your own devices. Like a ninja bot to deter scammers or intrusive users on a device's IP that scans for like unusual activity or something, is there such a thing? The best defence is to keep the device offline and make sure it only contains the necessary app (The mobile wallet). Perhaps keep it somewhere like in a vault and not move with it every day like how you would do when with a normal mobile phone.Apparently, there are USB cables that look like normal mobile phone chargers that can plant spyware/malware into your device if you connect them to your device even just once.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "khaled0111",
      "created_time": "May 13, 2023, 08:31:35 PMLast edit: May 13, 2023, 10:31:29 PM by khaled0111",
      "body": "Quote from: tread93 on May 03, 2023, 05:58:51 PM... Believe me, you should have known better than any other. Electrum is what you have been looking for unless you have some money to spare on buying a hardware wallet. Create a new wallet with Electrum then transfer all your assets to it. If your wallet's ssed/wallet file is safe enough then all your assets are safe.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "taufik123",
      "created_time": "May 19, 2023, 04:09:13 AM",
      "body": "Quote from: logfiles on May 07, 2023, 12:05:46 PMThe best defence is to keep the device offline and make sure it only contains the necessary app (The mobile wallet). Perhaps keep it somewhere like in a vault and not move with it every day like how you would do when with a normal mobile phone.To keep the device offline, the device is only made for wallet or backup only, not for use in other activities. But the possibility of death and damage will definitely exist. don't expect too much from storage that uses a smartphone. Better buy and use a secure hardware wallet.Quote from: logfiles on May 07, 2023, 12:05:46 PMApparently, there are USB cables that look like normal mobile phone chargers that can plant spyware/malware into your device if you connect them to your device even just once.So be careful with any USB that is not yours. Don't use USB cables carelessly.  Quote from: khaled0111 on May 13, 2023, 08:31:35 PMQuote from: tread93 on May 03, 2023, 05:58:51 PM... Believe me, you should have known better than any other. Electrum is what you have been looking for unless you have some money to spare on buying a hardware wallet. Create a new wallet with Electrum then transfer all your assets to it. If your wallet's ssed/wallet file is safe enough then all your assets are safe. Electrum is the best Open-source Bitcoin wallet, and I use it for my Android and computer, But Phrase security is the responsibility of the user. Make sure all devices are safe from malware. If you want to be more secure, you should use a Hardware wallet. It's very affordable, and even cheaper than the assets you hold. But choose a hardware wallet that has good security and does not provide phrase recovery because it is dangerous, like the current trending one (ledger) which will be updated with a 24-word phrase recovery system LOL.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yamane_Keto",
      "created_time": "May 19, 2023, 03:26:06 PM",
      "body": "There are a number of wallets available for each operating system, but it is noted that the number of open source wallets available for Android devices is much more, as you can downloadAndroid WalletsBitcoin WalletBitherBitPayEdgeElectrumMyceliumUnstoppablehttps://bitcoin.org/en/choose-your-wallet?step=5&platform=androidiOS WalletsBitherBitPayEdgeUnstoppable   https://bitcoin.org/en/choose-your-wallet?step=5&platform=iosThe wallets available for iPhone devices are limited. Unstoppable is slow in syncing, and the rest of the wallets are not popular, so you will not be able to use more good wallets such as Mycelium. In android you will have an option to download the wallet directly from outside the Google store, so if your phone is only for cryptocurrencies, then Android is a better option. If you have a phone, the available wallets serve the purpose for daily transactions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mindrust",
      "created_time": "May 19, 2023, 06:14:05 PM",
      "body": "Android itself isn't as bad as people claim it to be but there are certain differences between an android user and an ios user. IOS people are not mostly into jailbreaking (i don't even know if it is possible anymore) while android people usually like to try different mods for their phone. This is where it gets dangerous. If you try a mod which you are not sure about its security (and you can never be sure) then you are at risk of losing your funds. IOS had a few fuck ups in the past too but Apple patched it right away. Who knows when your cyanogen or whatever mod will get patched... likely after you get hacked.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bayu7adi",
      "created_time": "May 21, 2023, 10:16:38 PM",
      "body": "Quote from: mindrust on May 19, 2023, 06:14:05 PMIOS people are not mostly into jailbreaking (i don't even know if it is possible anymore) while android people usually like to try different mods for their phone. This is where it gets dangerous. If you try a mod which you are not sure about its security (and you can never be sure) then you are at risk of losing your funds. Currently, Android has significantly enhanced its security system. Now, when it comes to rooting or installing malicious applications, the system will detect them and issue a warning. As Android versions become more up-to-date, fewer people seem interested in modification, in my opinion. Most individuals who engage in modifications tend to focus on older Android versions that require performance improvements. On the other hand, the latest Android versions offer satisfactory performance for everyday activities and even heavy usage.The introduction of Google Play Protect proves highly beneficial for those of us who prioritize security. Android users receive notifications whenever harmful applications are detected and running on their devices.Up until now, relying on installing modified applications and ROMs from others does not guarantee the best security for users. Instead of risking our hard-earned money, we can opt for using a separate smartphone for financial purposes and another one for entertainment purposes.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}