{
  "id": "topic_5464380",
  "title": "Altcoin-Discussion-",
  "author": "Altcoin-Discussion-",
  "created_time": "August 24, 2023, 07:36:41 AMLast edit: August 25, 2023, 08:07:16 AM by Altcoin-Discussion-",
  "content": "According to a crypto analyst, Cardano (ADA) may experience further declines in its price before the end of the year. The analyst reviewed a chart that compared the Altcoin‘s price movements in 2019 to those in 2023 and found similarities between the two years. Benjamin Cowen, founder and CEO of Into the Cryptoverse (ITC), shared this data and suggested that the ADA is currently copying its price movements from 2019.The chart revealed inconsistencies in the price movements between the two years. While both years saw a gradual price increase in the first weeks of January, there was a difference in the asset’s price movements later on. In 2019, the altcoin began to consolidate with slight declines in January, whereas in 2023, it experienced an impressive 58% increase. Overall, the ADA showed disparities between the price movements in the first half of both years, with this year often going in the opposite direction compared to 2019.However, in the second half of the year, the similarities between the two years became more apparent. Since May 2023, the ADA has recorded consistent declines, leading to a decrease in its return on Investment. This trend was also dominant in 2019, with Cardano losing 60.11% of its value from June to August. This resulted in the altcoin giving back most of the gains it made earlier that year. Similarly, this year, the ADA has fallen by 31% since June. Although the altcoin has shown more resistance this year, the ITC chart predicts further declines.Source: https://btc.gripe/threads/this-altcoin-faces-further-declines-in-the-near-future.8954/",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5464380",
  "comments": [
    {
      "author": "EarnOnVictor",
      "created_time": "August 24, 2023, 08:43:49 AMLast edit: August 24, 2023, 09:10:47 AM by EarnOnVictor",
      "body": "As it is recently, altcoins' selloffs were largely driven by Bitcoin, and there is contradictory news about the dump of the coin that triggered the selloff across the crypto board.Now, by various personal analyses, I believe altcoins would not sell pretty much further, and the reason is simply that it would be difficult for Bitcoin to breach below $24,700-$25,000. And since Bitcoin was the cause of the recent fall and has also bottomed around the quoted levels with a sign of a bullish return. This highly suggests that altcoins have bottomed already and the correlation could cause them to reverse higher in response.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gurunanakji777",
      "created_time": "August 24, 2023, 01:37:10 PM",
      "body": "I believe that ADA and other altcoins experienced a decline due to a significant sell-off in BTC over the past week. Now, the market has regained some stability. As BTC starts to rise, I anticipate that ADA will likely follow suit. If BTC were to drop again, it's possible that ADA might also decrease. However, I currently don't think that ADA will experience a substantial drop from its current price. Moreover, considering the upcoming Bitcoin halving next year and the historical trend of increased buying activity 3-4 months prior, I would suggest that the market will remain relatively consolidated until December. Beyond that point, I expect significant movement, although I cannot provide a guarantee.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wapfika",
      "created_time": "August 24, 2023, 01:42:45 PM",
      "body": "QuoteThis Altcoin Faces Further Declines In the Near FutureThis is fact because there's a lot of new altcoin project created and share to crypto marketcap while there's no new money entering in crypto. Crypto projects keep developing and expanding that result to new project being form just to tackle a case which a single project can handle. This is not limited to altcoins but also to Bitcoin since investors will usually diversify assets on new projects that can give profit potential since they are new. I think the number of dead projects along with the deacreasing valuation of crypto will happened at the same time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zasad@",
      "created_time": "August 24, 2023, 02:07:35 PM",
      "body": "Quote from: EarnOnVictor on August 24, 2023, 08:43:49 AMAs it is recently, altcoins' selloffs were largely driven by Bitcoin, and there is contradictory news about the dump of the coin that triggered the selloff across the crypto board.Now, by various personal analyses, I believe altcoins would not sell pretty much further, and the reason is simply that it would be difficult for Bitcoin to breach below $24,700-$25,000. And since Bitcoin was the cause of the recent fall and has also bottomed around the quoted levels with a sign of a bullish return. This highly suggests that altcoins have bottomed already and the correlation could cause them to reverse higher in response.The price of bitcoin will easily fall to the desired level if it is profitable for manipulators to take money from long traders with leverage.Bitcoin ETFs work in Europe and Canada, they should also appear in the US in 2024. This news is already in the price of bitcoin.Therefore, we may still see a price below $24,000, but there may not be much liquidity there.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bussybuddy",
      "created_time": "August 24, 2023, 02:31:20 PM",
      "body": "The market is currently in a downtrend and can't move beyond the necessary milestones, so any Bitcoin volatility will affect alts, not only NEAR, ADA but also top altcoins as well. There can be strong drops, anyone who has been through a period where the market drops about 50% knows the feeling, the flash sell is really big and most of us are in a state of fear. However, on the positive side, a lot is coming in the next 1-2 years, so we have a lot of time to prepare to accumulate knowledge as well as assets.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Tipstar",
      "created_time": "August 24, 2023, 03:08:21 PM",
      "body": "This fate of cardano was in the making. It was an active project but never achieved the adoption and developmental progress as promised. There can't be hundreds of coins just for speculation and pump and dump. For that their are meme coins and Bitcoin. The success of a utility token depends on how successful the network is and just like some old coins like Neo and NEM, it didn't really made any progress on adoption as a utility coin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o48o",
      "created_time": "August 24, 2023, 09:41:46 PM",
      "body": "Quote from: Altcoin-Discussion- on August 24, 2023, 07:36:41 AMAccording to a crypto analyst, Cardano (ADA) may experience further declines in its price before the end of the year. The analyst reviewed a chart that compared the Altcoin‘s price movements in 2019 to those in 2023 and found similarities between the two years. Benjamin Cowen, founder and CEO of Into the Cryptoverse (ITC), shared this data and suggested that the ADA is currently copying its price movements from 2019.The chart revealed inconsistencies in the price movements between the two years. While both years saw a gradual price increase in the first weeks of January, there was a difference in the asset’s price movements later on. In 2019, the altcoin began to consolidate with slight declines in January, whereas in 2023, it experienced an impressive 58% increase. Overall, the ADA showed disparities between the price movements in the first half of both years, with this year often going in the opposite direction compared to 2019.However, in the second half of the year, the similarities between the two years became more apparent. Since May 2023, the ADA has recorded consistent declines, leading to a decrease in its return on Investment. This trend was also dominant in 2019, with Cardano losing 60.11% of its value from June to August. This resulted in the altcoin giving back most of the gains it made earlier that year. Similarly, this year, the ADA has fallen by 31% since June. Although the altcoin has shown more resistance this year, the ITC chart predicts further declines.I might be biased but i wouldn't mind if ADA just faded away and stopped being caleld a serious alternative to eth. I haven't looked at the chart but i am not the biggest fan of the fundamentals. Even if some of the ideas and code would be decent. Whole birth story of ada seems like more like a too much money and too much of everything. Instead of focusing to solve one thing at the time they seem to hype and go all over the map, like lite version of Internet computer.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TimeTeller",
      "created_time": "August 24, 2023, 09:45:35 PM",
      "body": "Quote from: Tipstar on August 24, 2023, 03:08:21 PMThis fate of cardano was in the making. It was an active project but never achieved the adoption and developmental progress as promised. There can't be hundreds of coins just for speculation and pump and dump. For that their are meme coins and Bitcoin. The success of a utility token depends on how successful the network is and just like some old coins like Neo and NEM, it didn't really made any progress on adoption as a utility coin.In the early stages of ADA, I thought also they can really compete with ETH when it comes to adoption.But it seems they are going to the stage of what happened to NEO or NEM.I remember the popular days of NEO and look at where they are now, they are also continuously going down.If the ADA team won't do any improvement, they can easily get out from ranks of the top 10 alts. We need to see more usage of ADA, if projects are deploying on this network, or else, their fate will be the same with most dying alts.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}