{
  "id": "topic_5426326",
  "title": "nullama",
  "author": "nullama",
  "created_time": "December 07, 2022, 07:12:33 AM",
  "content": "Strike partnered with Bitnob, an African Bitcoin company to allow US customers to send USD to Africa with almost no fees.This is possible because the transfer of value is done through the lightning network, so the transfer is done almost immediately and with almost no fees.People can still continue to use their local fiat currencies, but the actual transfer is done through the lightning network in this case.Quote from: https://bitcoinmagazine.com/business/strike-launches-instant-african-remittances“Payments are instantly converted into naira, cedi, or shillings, and deposited directly into a recipient’s bank, mobile money, or Bitnob account.”The company charges a small fee for the conversion of USD->Bitcoin->Local fiat in Africa, but it's nowhere near the huge fees traditional banks charge for international money transfers.Quote from: https://bitcoinmagazine.com/business/strike-launches-instant-african-remittancesWe can now save people sending money back home to Africa billions of USD in transfer fees.”Remittances are probably one of the biggest reason for people to use Bitcoin around the world, and Strike is using this to create a service around it. They are also planning to expand to other African countries.source: https://bitcoinmagazine.com/business/strike-launches-instant-african-remittances",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5426326",
  "comments": [
    {
      "author": "DapanasFruit",
      "created_time": "December 07, 2022, 09:11:53 AM",
      "body": "I agree that there is a huge market for domestic and international remittance business. And this can be really true in the continental Africa where many people are counting on this family abroad to be sending them money on a regular basis. There is a big business waiting for this facility established by Strike and Bitnob...am just hoping that they are doing some marketing activities to drum up support for the said option so that more and more will know and will be using it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "348Judah",
      "created_time": "December 07, 2022, 12:50:46 PM",
      "body": "Ever since there has been the avenue to send bitcoin on the comfort of the mobile phone without internet starting from South Africa in the African Continent i know that this could bring more about it effective usefulness even with the introduction of lightening network as an addition, as long as it has the ease to cross boarder transactions and it high charges it's a solution in addition to the entire Africans and other continents to imbibe through.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hd49728",
      "created_time": "December 07, 2022, 12:56:31 PM",
      "body": "Paxful is very popular in African countries too. Did you try Paxful with Bitcoin wallet and Lightning Network wallet too?In the last month, they integrated USDC on their Peer-to-Peer trading platform and it is a second stable coin on Paxful, after USDT. With USDT on Paxful, you can send it on two blockchains, Ethereum and TRON.https://paxful.com/university/bitcoin-lightning-network-explained/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Obari",
      "created_time": "December 07, 2022, 03:00:57 PM",
      "body": "This is truly a nice initiative and I'm happy seeing lightning doing this great work for the poor masses.I came across lightning on a centralized exchange Paxful precisely And i really enjoy the service and the fast service the offered.According to the OP, it seems this lightening are basically for fiat as stated by the OP and I hope the money sent can be converted to crypto if possible.I also do hope that they also do alot of marketing and adverts to create more awareness so that more people will get to know about their services too.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "December 07, 2022, 03:51:01 PM",
      "body": "just a notestrike played this game once before.. in el salvador....... didnt work out wellhttps://www.coindesk.com/business/2022/09/29/strike-ceo-el-salvadors-bitcoin-experience-doesnt-hurt-my-company-at-all/in short. el salvador dropped strike. due to LN issueel salvador tried a few things and found LN not to be the solution to the back-end of their chivo wallet. and instead went with a CEX custodian model for citizens funds back-end of the wallethope they learned their lessons and are not just repeating the same game",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EarnOnVictor",
      "created_time": "December 07, 2022, 03:54:03 PM",
      "body": "This is a welcome development yet for Africans, particularly Nigerian where the initiative has already kickstarted. This is one of the competitions that Bitcoin has brought to the payment system, it is driving more inclusion regarding the use of blockchain technology and it would better challenge the dominance of banks and other financial institutions that would move money slowly and still charge exorbitant amounts for it.This is about Bitcoin-Fiat transactions, which is good, and I always say that Bitcoin cannot thrive in isolation, therefore let's kick out the dominance of those old fashion financial ways to give room to faster transactions and low fees like this.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "December 07, 2022, 04:21:54 PMLast edit: May 20, 2023, 07:20:29 PM by stompix",
      "body": "Quote from: nullama on December 07, 2022, 07:12:33 AMThe company charges a small fee for the conversion of USD->Bitcoin->Local fiat in Africa, but it's nowhere near the huge fees traditional banks charge for international money transfers.This is going to be El Salvador again with promised trillions saved in fees and with less than a few million in total transactions.WU, US> Nigeria:MG , US> Nigeria:The last is for bank account, for cash pick-up the fee is indeed higher at 9$, but still nowhere near the \"huge\" fees.Some are really stuck in the '90s.QuoteWe can now save people sending money back home to Africa billions of USD in transfer feesYeah right, Nigeria gets an overall 6 billion in total emittance from the US and they will save them billions, while WU and MG were changing less than 2% in fees.Interestingly that while they claim they will save billions in fees they don't whisper a word on what fees they are going to charge, one single example!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husires",
      "created_time": "December 07, 2022, 04:59:46 PM",
      "body": "I did not understand the significance of Bitcoin here , specifically the Lightning Network. If there is a change in bitcoin price, who will bear the cost difference? And why such suspicious solutions?Ripple network contains a payment system that can be integrated into banking systems and can easily be used to transfer US dollars, as it will be converted into a stable currency linked to which transfers are made with low withdrawal fees.If centralized databases consume a lot of fees, then services such as TikTok provide solutions without the need for blockchain.There are better ways for these transfers to take place, but the use of Bitcoin here and the Lightning Network is incomprehensible.How local currency exchange used",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptoHeadlineNews",
      "created_time": "December 07, 2022, 05:33:25 PM",
      "body": "Quote from: nullama on December 07, 2022, 07:12:33 AMStrike partnered with Bitnob, an African Bitcoin company to allow US customers to send USD to Africa with almost no fees.This is a good development, but what \"strike\" needs now is an aggressive advertisment for more potential customers just as \"chipper cash\" ones did by using a well known popular celebrity \"Burnaboy\" for it's advertisment and got much users. So we still have the likes of \"Wizkid\" and \"Davido\" to do this job better in Africa as a wholeQuote from: EarnOnVictor on December 07, 2022, 03:54:03 PMThis is a welcome development yet for Africans, particularly Nigerian where the initiative has already kickstarted. Yes, this is actually a welcome development, and I knew Nigeria must have been a main target been the country with the highest crypto trading volume, which loves technology. But just as \"franky1\" earlier said, I hope \"strike\" must have learnt from it's mistakes in El Salvador, and ready to make improvement, because Nigeria in particularly is always a best place for doing online businesses",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Die_empty",
      "created_time": "December 07, 2022, 06:16:36 PM",
      "body": "Quote from: franky1 on December 07, 2022, 03:51:01 PMjust a notestrike played this game once before.. in el salvador....... didnt work out wellhttps://www.coindesk.com/business/2022/09/29/strike-ceo-el-salvadors-bitcoin-experience-doesnt-hurt-my-company-at-all/in short. el salvador dropped strike. due to LN issueel salvador tried a few things and found LN not to be the solution to the back-end of their chivo wallet. and instead went with a CEX custodian model for citizens funds back-end of the wallethope they learned their lessons and are not just repeating the same gameEl Salvador had some fundamental issues that hindered the success of Strike in that country. Strike tried all the could to contribute its own quota to the bitcoin of successful in El Salvador. The company even had to abandon USDT on its platforms in El Salvador just to promote bitcoin operations. I think the Strike's proposed operations Africa and its relationship with El Salvador is quite different. In the case of Africa it is just acting as a financial intermediary to receive or send funds from US to Africa and the firm has no relationship with the government. But in El Salvador, Strike was part of the countries vision to make bitcoin a success.Transfer fees have been a major tool of economic of neo-colonialism in Africa. Most western remittance firms charge very high fees that are very exploitative. But this service to a large extent would reduce these transfer fees. It is true that Strike's service might not be perfect because it is a new service but there is definitely a room for improvement.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "December 07, 2022, 08:00:48 PM",
      "body": "Quote from: Die_empty on December 07, 2022, 06:16:36 PMQuote from: franky1 on December 07, 2022, 03:51:01 PMjust a notestrike played this game once before.. in el salvador....... didnt work out wellhttps://www.coindesk.com/business/2022/09/29/strike-ceo-el-salvadors-bitcoin-experience-doesnt-hurt-my-company-at-all/in short. el salvador dropped strike. due to LN issueel salvador tried a few things and found LN not to be the solution to the back-end of their chivo wallet. and instead went with a CEX custodian model for citizens funds back-end of the wallethope they learned their lessons and are not just repeating the same gameEl Salvador had some fundamental issues that hindered the success of Strike in that country. Strike tried all the could to contribute its own quota to the bitcoin of successful in El Salvador. The company even had to abandon USDT on its platforms in El Salvador just to promote bitcoin operations.the chivo wallet claim of bitcoin was actually not users getting/having a bitcoin address of $XX btc locked and funded to them on keys of their users of the chivo wallet.they got to claim some LN-msat inbound balance from a strike hub channel(using LN temp ID not funded utxo ID for each chivo user) which users had to try to request routes out of the hubs channel to a payment service to close channel to or convert to btc with that end payee.but there was a bottleneck of liquidity. there were not enough end points to be able to convert/claim their \"free money\" due to a LN liquidity issue.it was not a bitcoin problem it was a LN problem of lack of liquiditystrike was hoping there would be enough remitters moving value into LN to offset the LN liquidity trying to move out of hub channels. in the end the el salv government just went with a CEX exchange as the account management and stopped the LN game",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}