{
  "id": "topic_5413881",
  "title": "seoincorporation",
  "author": "seoincorporation",
  "created_time": "September 17, 2022, 01:33:43 PM",
  "content": "Se podría decir que estos 2 factores son una bomba de tiempo para Bitcoin, Hay muchos hilos en la sección en ingles hablando sobre como la computación cuántica puede suponer una amenaza para las criptomonedas pero personalmente creo que la inteligencia artificial representa una mayor amenaza. Así que hablemos de cada escenario por separado.Computación cuántica VS Bitcoin.¿Que pasaría si usamos fuerza bruta con mucho poder absurdo para hacer fuerza bruta a las carteras que tienen balance? Sería cuestión de tiempo para que se encuentren las llaves privadas, mientras mas poder esto sería mas rápido y si alguien logra tal hazaña esto destruiría bitcoin.Inteligencia artificial VS Bitcoin.Aun recuerdo cuando hacía mi servicio social en la universidad, mi tarea fue programar redes neuronales artificiales para desarrollar ecuaciones con las que podríamos calcular propiedades del agua a partir de la presión y temperatura. Como dichas ecuaciones no existían la forma de desarrollarlas fue con una base de datos de mediciones reales la cual fue procesada a través de las redes neuronales artificiales generando así una ecuación con un índice de regresión lineal de 0.999 lo cual nos indica que nuestra ecuación es casi perfecta.Ahora, si una inteligencia artificial desarrolla una ecuación para obtener la llave privada directo a través de la dirección eso sería también destruiría las criptomonedas, se que suena a ciencia ficción pero podría suceder.¿Que opinan ustedes de estas dos amenazas al ecosistema?¿Creen que hay otra amenaza de la que deberíamos preocuparnos a futuro?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5413881",
  "comments": [
    {
      "author": "DdmrDdmr",
      "created_time": "September 17, 2022, 03:13:44 PM",
      "body": "Por lo que he leído y recuerde ahora mismo, la computación cuántica está todavía verde para ello, en términos de potencia y estabilidad. Aunque la potencia es algo que se va mejorando sustancialmente año a año, hay muchas dudas en la estabilidad e incluso fiabilidad de este tipo de máquinas todavía. El último artículo que leí ubicaba la computación cuántica en el terreno de la burbuja, siendo algo muy hypeado, con mucha inversión, y produciendo casos de uso para atraer esa inversión. Indicaba que aún se ha de demostrar su valía práctica más allá de la teórica.De llegar la computación cuántica a ser una amenaza real, bitcoin sería un pez menor entre los afectados, dado que toda la criptografía de los sistemas bancarios serían probablemente los primeros afectados. En todo caso, entiendo que los desarrolladores de bitcoin son plenamente conscientes y están encima de este asunto. Si la amenaza es real, y no se duermen en los laureles, habría algún tipo de fork para moverse a algoritmos de encriptación anti-cuantum. Eso sí, este tipo de fork no sería gratuito para la comunidad, dado que intuyo habría que migrar obligatoriamente, quedando potencialmente millones de BTCs que no se reclamarían y a los cuales habría que poner fecha de caducidad. En cuanto a la IA, cualquiera que tenga muchas direcciones ya tiene una buena BD de pruebas, con centenas de miles de inputs (direcciones públicas) y unas tantas como outputs (las direcciones asociadas del tenedor asociadas). Si hubiese algo que hacer con los procedimientos actuales de IA, que no son más que algoritmos en el fondo, ya se habría hecho. En el fondo, lo que manda es el concepto matemático, y si todo se basa en una curva elíptica, dudo que la AI pueda generar otra ecuación que sea más simple y mapee los mismos datos.Tampoco este tipo de vector tiene vistas de llegar muy lejos.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "famososMuertos",
      "created_time": "September 17, 2022, 05:49:26 PM",
      "body": "No, y quizás ¡No! pero con seguridad eso si, por ahora.Es un tema de avance de tecnología que involucra el estudio científico vigente y fase de desarrollo todavía, es decir, incluso no existen los laboratorios para llevar ciertos estudios que se requieren para avanzar en la investigación, aunque si que están bastantes avanzados y es una ventaja actual en el avance para no solo el estudio de la computación cuántica, si no de cualquier otra tecnología hoy en día, es decir, los tiempos requeridos de nuevos hardware son tan cortos actualmente que requieren de un par de años, incluso 10 años son tiempos actuales que se acortan conforme se avanza.Sacando todas las finitas aplicaciones que tendrían las computadoras cuánticas, por cierto una de las que más leo siempre, hay muchas, por cierto bitcoin no esta en el top 10, en ese top siempre aparece el clima, que en el relativo global resulta en la lista de prioridades, pero como hablamos de bitcoin créeme que cuando tal cosa suceda, a priori esta tecnología no va estar al alcance de \"cualquiera\", me explico, hay muchas tecnologías que tardan en incorporarse al consumo trivial de cualquiera, incluso teniendo los recursos económicos, un ejemplo simple serian los celulares, existen desde hace más de 50 años, que se sepa, pero quizás estaban desde mucho antes.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "wildavocado",
      "created_time": "September 18, 2022, 01:34:22 AM",
      "body": "Segun tendo entendido, la computacion cuantica solo podria usarse en un ataque para ciertos algoritmos en particular que se usan en Bitcoin actualmente, pero ya existen substitutos que se pueden usar para combatir esto. Si es que la computacion cuantica esta pronta a llegar, seria cosa de cambiar los algoritmos y Bitcoin seguiria sin problemas.Sobre inteligencia artificial, no creo que exista algo asi, ya que obtener una llave privada se basa en probabilidades. Es como decir que AI puede magicamente adivinar si va a salir cara o sello en una moneda con mayor probabilidad que 50%. Simplemente no se puede.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "seoincorporation",
      "created_time": "September 18, 2022, 03:48:15 PM",
      "body": "Quote from: DdmrDdmr on September 17, 2022, 03:13:44 PMEn cuanto a la IA, cualquiera que tenga muchas direcciones ya tiene una buena BD de pruebas, con centenas de miles de inputs (direcciones públicas) y unas tantas como outputs (las direcciones asociadas del tenedor asociadas). Si hubiese algo que hacer con los procedimientos actuales de IA, que no son más que algoritmos en el fondo, ya se habría hecho. En el fondo, lo que manda es el concepto matemático, y si todo se basa en una curva elíptica, dudo que la AI pueda generar otra ecuación que sea más simple y mapee los mismos datos.Tampoco este tipo de vector tiene vistas de llegar muy lejos.Como mencionas, tenemos la tecnología pero no el tiempo. La inteligencia artificial tiene un proceso llamado, Aprendisaje de la máquina y este es un proceso a prueba y error en el cual se van ajustando los índices con la intención de formar una ecuación lineal. esto luce algo así:Y mientras mas tiempo le demos a la maquina el error se irá reduciendo. Tal vez con nuestro poder actual tardaría mas de 100 años en encontrar la ecuación.Quote from: wildavocado on September 18, 2022, 01:34:22 AMSobre inteligencia artificial, no creo que exista algo asi, ya que obtener una llave privada se basa en probabilidades. Es como decir que AI puede magicamente adivinar si va a salir cara o sello en una moneda con mayor probabilidad que 50%. Simplemente no se puede.Obtener una llave privada no es un evento aleatorio, nosotros podemos elegir la llave privada de forma manual, por ejemplo podemos escoger:Code:0000000000000000000000000000000000000000000000000000000000000001Y saber que su dirección es:Code:1BgGZ9tcN4rm9KBzDn7KprQz87SZ26SAMH",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DdmrDdmr",
      "created_time": "September 19, 2022, 08:15:35 AM",
      "body": "Hasta que los ordenadores cuánticos sean una amenaza real para bitcoin, mientras tanto tenemos a hackers que intentan romper la encriptación de bitcoin mediante el uso de tres tipos de técnicas:-   El algoritmo de resolución Pollard’s Kangaroo interval ECDLP (Elliptic Curve Discrete Logarithm Problem), el cual no se espera que pueda tener ningún tipo de éxito en la práctica.-   El ataque Cronb.-   El ataque \"qué será\".Para sus actuaciones, el grupo de hackers TeamTNT consigue infiltrar servidores para ejecutar su código, adaptándose a las prestaciones del servidor.El artículo abajo reportado explica los tres casos brevemente, pero francamente, la claridad para el ajeno brilla por su ausencia, y me quedo con los intentos con cani nulas posibilidades de éxito, que no con el detalle de la metodología utilizada.Ver: https://www.bleepingcomputer.com/news/security/teamtnt-hijacking-servers-to-run-bitcoin-encryption-solvers/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "darxiaomi",
      "created_time": "September 19, 2022, 03:04:48 PM",
      "body": "Interesante topico el que lanzas, creo haberlo comentado en este foro mismo, o si no lo hice si estoy seguro de haberlo discutido con algunos maximalistas de muy mala manera en la vida real.Es que estos maximalistas decian como siempre que no que es imposible que es perfecto que bla bla, bueno palabras de maximalistas, y mi posicion era, muchachos esta bien pueden tener razon pero todo cae todo se termina, cayo Roma caen los imperios todo cae nos e puede escapar de las leyes de la fisica, de la entropia del universo, todo esto planteado mas bien en un sentido filosofico/fisico como veran.Pero en un momento yo les dije, esta bien con los metodos actuales es practicamente inviolable, pero y cuando la computacion cuantica de el salto que esta a la vulta de la esquina?, obviamente siguieron negando la cuestion y confabulando de que faltan mas de 100 años para algo asi y que ya se vera, lo cual como veran es un delirio.Yo creo que estamos a maximo 20 años de que la computacion cuantica este para usarse (siempre y cuando lo que esten contando sea cierto), que para mi son 10 porque en el mundo actual todo se reduce a velocidades estratosfericas, por ende el riesgo de lo cuantico para mi es algo MUY serio. que se pueda solucionar, puede que si pero escapa a mi conocimiento.Con respecto a la inteligencia artificial no tengo demasiado para comentar ya que desconozco su verdadero poder en estas cuestiones. Asi todo creo que es secundaria, ya que esta misma tambien se nutriria llegado el momento de la computacion cuantica, digamos que a mi entender la computacion cuantica pasaria a ser la Infraestructura y la IA seguiria perteneciendo a una  \"suprarestructura\".",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "seoincorporation",
      "created_time": "September 22, 2022, 03:46:00 PM",
      "body": "Quote from: DdmrDdmr on September 19, 2022, 08:15:35 AM... mientras tanto tenemos a hackers que intentan romper la encriptación de bitcoin mediante el uso de tres tipos de técnicas:-   El algoritmo de resolución Pollard’s Kangaroo interval ECDLP (Elliptic Curve Discrete Logarithm Problem), el cual no se espera que pueda tener ningún tipo de éxito en la práctica.-   El ataque Cronb.-   El ataque \"qué será\"....Ver: https://www.bleepingcomputer.com/news/security/teamtnt-hijacking-servers-to-run-bitcoin-encryption-solvers/Que buen artículo colega, gracias por compartirlo.Personalmente desconocía estos ataques, quien iba a pensar que hay un grupo de hackers vulnerando servidores para atacar bitcoin... Era sabido que los atacantes usan a las víctimas para minar criptomonedas, pero ver que usen el poder computacional para atacar la ECDLP se me hace algo realmente interesante.Estoy pensando en hacer una recopilación de los diferentes tipos de ataques que se pueden hacer a Bitcoin, creo que sería un buen aporte para la comunidad.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}