{
  "id": "topic_5458816",
  "title": "CARIBBEAN_TREASURES",
  "author": "CARIBBEAN_TREASURES",
  "created_time": "July 06, 2023, 07:11:08 AMLast edit: July 07, 2023, 11:20:36 PM by CARIBBEAN_TREASURES",
  "content": "I have two types of wallets available. Each piece is fully funded and will be shipped directly to you, if you live within the 50 states.If you live overseas, I'll use Miner Jones for shipping. Each piece will come self slabbed with an informative signed label. All purchases ship within 48 hours USPS Priority. 1. 0.25 Monero on 7.77 gram silver round.  Each piece will be hallmarked with my CT stamp and stamped with the mintage number. Only 15 pieces were made.  The Monero piece will be 0.008 btc  or 245 USD Will also accept monero of equal value. 2. 1000 DOGECOIN on 7.77 gram silver round. Each piece will be hallmarked with the CT stamp and hand stamped with the mintage number. Only 10 pieces were made. The DOGECOIN piece will cost 0.00881 btc or 270 USD. I will accept DOGECOIN for payment of equal value. I'm a trader, so if you have other items for trade, lets make a deal. I accept gold and silver bullion too. I also have Venmo, CA and PPFF Monero1. SOLD2. SOLD3. AVAILABLE----SOLD4. AVAILABLE5. AVAILABLE6. AVAILABLE7. AVAILABLE8. AVAILABLE9. AVAILABLE10. NOT AVAILABLE AT THIS TIME11. NOT AVAILABLE AT THIS TIME12. NOT AVAILABLE AT THIS TIME13. NOT AVAILABLE AT THIS TIME14. NOT AVAILABLE AT THIS TIME15. NOT AVAILABLE AT THIS TIMEDOGECOIN1. SOLD2. SOLD3. AVAILABLE4. AVAILABLE------SOLD5. AVAILABLE6. AVAILABLE7. AVAILABLE8. AVAILABLE9. AVAILABLE10. AVAILABLE",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5458816",
  "comments": [
    {
      "author": "tread93",
      "created_time": "July 07, 2023, 02:28:59 AM",
      "body": "Really digging these coins man! Great job on these love the use of DOGE and Monero on this. We are seeing a fun new wave of Bitcoin Silver hit the streets in the collectibles section and I can tell these were definitely made with some love! Props on the craftsmanship!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CARIBBEAN_TREASURES",
      "created_time": "July 07, 2023, 06:54:58 AMLast edit: July 07, 2023, 09:55:49 PM by CARIBBEAN_TREASURES",
      "body": "Quote from: tread93 on July 07, 2023, 02:28:59 AMReally digging these coins man! Great job on these love the use of DOGE and Monero on this. We are seeing a fun new wave of Bitcoin Silver hit the streets in the collectibles section and I can tell these were definitely made with some love! Props on the craftsmanship!  Only love my man! I love the more hands on feel. They will definitely be numismatic treasures. They remind me of territorial gold pieces mixed with fine jewelry and hallmarks. They are simple and to the point in design.I also have a small mini moon series coming soon with diamonds. Mintage of 5. MONERO, LITECOIN, BITCOIN AND Doge! As well as the 1 gram satoshi fractional bars.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CARIBBEAN_TREASURES",
      "created_time": "July 07, 2023, 10:19:03 AM",
      "body": "Monero #3 Sold",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CARIBBEAN_TREASURES",
      "created_time": "July 07, 2023, 09:51:35 PM",
      "body": "#4 DOGECOIN SOLD",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SatsLife",
      "created_time": "July 07, 2023, 11:33:56 PM",
      "body": "Did you laser cut those holos yourself? I've been looking for holos missing the inside square like that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CARIBBEAN_TREASURES",
      "created_time": "July 07, 2023, 11:46:33 PMLast edit: July 08, 2023, 10:47:40 PM by CARIBBEAN_TREASURES",
      "body": "Quote from: SatsLife on July 07, 2023, 11:33:56 PMDid you laser cut those holos yourself? I've been looking for holos missing the inside square like that. No, the transparent window is part of the design. I was talking to the hologram manufacturers recently and learned that this process is called the \"demoralize procedure\" to get this effect. So if you state this terminology to the manufacturing community they will more likely understand what you are looking for. And I sell holos for $2 ea. I have maybe 3 or 4 options and different sizes.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CARIBBEAN_TREASURES",
      "created_time": "July 16, 2023, 12:10:45 PMLast edit: July 16, 2023, 10:17:55 PM by CARIBBEAN_TREASURES",
      "body": "Just relized that these are the only pieces with \"Caribbean Treasures\" written out on the face of the round. Normally its just a hallmark stamp or CT in the design.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}