{
  "id": "topic_5461363",
  "title": "Mr_Peter Ben",
  "author": "Mr_Peter Ben",
  "created_time": "July 29, 2023, 01:10:15 AM",
  "content": "Today, I've signed up on Bitcointalk because it seems to be really interesting for a lot of Bitcoin contributions. It is interesting to see, how Satoshi achieved to grow Bitcoin community and how he created a very good coin, making it possible to establish Bitcoin and Bitcointalk was very important to make it succesfull. Satoshi build Bitcoin and as a coder, he really listened to community feedback and tried to explained it because Bitcoin was (and is) still very technical. Bitcoin is a great technological piece because Bitcoin needs to be safe from hacker. Much money is stored in Bitcoin network and if it's not safe, we are screwed, everyone. But Satoshi was good coder, he made it safe. Bitcoin is safe now for 10+ years and many hacker tried to hack Bitcoin. No hacker succeeded because Bitcoin is proven to be safe. It is very, very unlikely for Bitcoin to be proven unsafe after 10 years of hacker review. I don't read hacker news but it's common sense. I'm not coder, so I don't understand it but of course I tried to have education because education is always important for any issue. Like for Bitcoin, we can already summarize a few points: - not your keys, not your coins- decentralisation is important- always research first to avoid scam or shitcoinI hope, I'm not late for Bitcoin because Bitcoin already grew a lot. Also, Bitcointalk has many established member. I try to make a good contribution, I try to be polite ofcourse. Bitcointalk has many interesting topic. Everyone who knows Bitcoin should know Bitcointalk. And we can learn A LOT from Bitcointalk. Happy to be here and learn.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5461363",
  "comments": [
    {
      "author": "Amphenomenon",
      "created_time": "July 29, 2023, 03:26:07 AM",
      "body": "Welcome to bitcointalk, it seems like you already have idea about how this forum works but this post might makes it easier for your learning process Helpful Guides For Newbie on the Electrum Wallet.Also you are far from being late for Bitcoin though its over a decade since it was created but Bitcoin has many many more years so you can't be late now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Free Market Capitalist",
      "created_time": "July 29, 2023, 04:29:47 AM",
      "body": "Welcome, and now that you have expressed your enthusiasm, I recommend that you use the forum on a daily basis to learn mainly, since you say you don't know much, and with time you will also be able to contribute your knowledge and exchange impressions. That's what a forum is for. If you have doubts about the technical aspects, people who know a lot are quite helpful but you'd better do some research to have a minimum of knowledge before asking.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zaim7413",
      "created_time": "July 29, 2023, 05:09:17 AM",
      "body": "Welcome to the forum.I'm sure you studied Bitcoin before joining the Bitcointalk forum, your presentation at the start of the topic was very clear and I have no doubts about your abilities. It's never too late to trade and invest in Bitcoin even though its development has been very rapid. Here you can develop knowledge about Bitcoin and alternative Cryptocurrencies to become an established Investor, here you can get something that might be hard to find elsewhere. The first thing you need to do is increase your account knowledge and ranking to become an established member of the Bitcointalk forum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "July 29, 2023, 06:20:51 AM",
      "body": "I always get pretty skeptical when I see posts from new users that are pretty much just overly praising Bitcointalk as if it was some crypto's version of Jerusalem lol.Welcome, I guess.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lovesmayfamilis",
      "created_time": "July 29, 2023, 06:39:18 AM",
      "body": "Quote from: mk4 on July 29, 2023, 06:20:51 AMI always get pretty skeptical when I see posts from new users that are pretty much just overly praising Bitcointalk as if it was some crypto's version of Jerusalem lol.Welcome, I guess.Beginners have high hopes for Bitcoin, and the first days on the forum are probably compared to the beginning of a new, successful life for them. From here, we see a lot of enthusiasm from the newcomers.OP, everyone is happy to see you on the forum; feel free to ask where you do not understand or are very interested. But also be courageous so that you do not initially appear to be a defenseless child.Read the forum rules, and then be sure to learn how to use the search.Good luck.https://bitcointalk.org/index.php?topic=5276341.0https://bitcointalk.org/index.php?topic=5364418.msg58120931#msg58120931",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DYING_S0UL",
      "created_time": "July 29, 2023, 07:29:21 AM",
      "body": "Quote from: mk4 on July 29, 2023, 06:20:51 AMI always get pretty skeptical when I see posts from new users that are pretty much just overly praising Bitcointalk as if it was some crypto's version of Jerusalem lol.Welcome, I guess.We, the newbies wants to be like you. So that one day there would be a badge like yours. I don't know about others but I really like you guys and I think you guys can guide us to be like you. Being a legendary member meant you really had a tough journey and I cherish your hardwork and I hope one day I may also reach up to your rank.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dave1",
      "created_time": "July 29, 2023, 07:57:04 AM",
      "body": "Quote from: Mr_Peter Ben on July 29, 2023, 01:10:15 AMI hope, I'm not late for Bitcoin because Bitcoin already grew a lot. Also, Bitcointalk has many established member. I try to make a good contribution, I try to be polite ofcourse. Bitcointalk has many interesting topic. Everyone who knows Bitcoin should know Bitcointalk. And we can learn A LOT from Bitcointalk. Happy to be here and learn. No one is late here, everyone is welcome including newbies like you. Don't think that you are late, on the contrary, your timing is right, we are still in the bear market and if your intention is to become a long term holder, then this is the right time to accumulate.Of course, not just in this community, in any forum you need to be polite and that's why we have rules to follow here as well.If you want then you can play around and read threads that interests you. And if you have questions then you can ask. But used the search button first as your question might have been asked before.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Doan9269",
      "created_time": "July 29, 2023, 08:19:41 AM",
      "body": "Quote from: Mr_Peter Ben on July 29, 2023, 01:10:15 AM- not your keys, not your coins- decentralisation is important- always research first to avoid scam or shitcoinYou're just getting started, if you are really determined for learning you will still discover many more than this with bitcoin together with some opportunities that comes with using a decentralized digital currency like bitcoin, i believe with this your kind of move, you will always have more than you ever wanted with bitcoin over time.Quote from: Mr_Peter Ben on July 29, 2023, 01:10:15 AMI hope, I'm not late for Bitcoin because Bitcoin already grew a lot.Adoption opportunity is never ending in bitcoin as long as you kow how to get positioned for themQuote from: Mr_Peter Ben on July 29, 2023, 01:10:15 AMAlso, Bitcointalk has many established member. I try to make a good contribution, I try to be polite ofcourse. Bitcointalk has many interesting topic. Everyone who knows Bitcoin should know Bitcointalk. And we can learn A LOT from Bitcointalk.  You're rightly on point because you've made the best discovery by finding bitcointalk which is the only official bitcoin discussion board and already serving it's purpose, you meet people across the world and discuss bitcoin together, but my advice for you to have a smooth experience here is to begin with reading and understanding of the forum's rules and regulations, this is the most very important first step a bitcointalk newbie should take. Unofficial list of (official) Bitcointalk.org rules, guidelines, FAQhttps://bitcointalk.org/index.php?topic=703657.0",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dzungmobile",
      "created_time": "July 29, 2023, 09:04:24 AM",
      "body": "Quote from: Mr_Peter Ben on July 29, 2023, 01:10:15 AMBitcoin is safe now for 10+ years and many hacker tried to hack Bitcoin. No hacker succeeded because Bitcoin is proven to be safe.Hack Bitcoin is a vague phrase.Hack a Bitcoin wallet software, hack a Bitcoin wallet, hack a website that provides online wallet, paper wallet, attack the Bitcoin network. What did you mean about hack Bitcoin?About network attack, Bitcoin network has very high hashrate, very decentralized and risk to have such attacks is very slim.How many Bitcoin confirmations is enough?More important, if an attacker does such an attack, Bitcoin price will be dumped to the hell and even the attacker will not get much money from it.Practice with Bitcoin confirmation risk calculatorshttps://web.archive.org/web/20181231045818/https://people.xiph.org/~greg/attack_success.htmlhttps://jlopp.github.io/bitcoin-confirmation-risk-calculator/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BD Crypto",
      "created_time": "July 29, 2023, 09:57:00 AM",
      "body": "You are welcome to this Forum. I wish you a good journey with Bitcoin and this forum. Have you read forum rules before you start? It's really mandatory to know the rules of this forum to make a perfect start. Otherwise you may have a bad experience if you break any rules unfortunately. You may check them here:  Unofficial list of (official) Bitcointalk.org rules, guidelines, FAQNewbies - Read before postingQuote from: Mr_Peter Ben on July 29, 2023, 01:10:15 AMI hope, I'm not late for Bitcoin because Bitcoin already grew a lot. Also, Bitcointalk has many established member. I try to make a good contribution, I try to be polite ofcourse. Bitcointalk has many interesting topic. Everyone who knows Bitcoin should know Bitcointalk. And we can learn A LOT from Bitcointalk. Happy to be here and learn. Till now you aren't too late and still you can get Bitcoin in a cheap price but you may regret if you miss ride now for upcoming Bull run. We have many established members because they worked hard to grow and contributing with their best effort. They try to make forum discussions interesting and informative. So you may follow their strategy to contribute but never copy someone and try to contribute in your own way. Hope you all the best.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "God Of Thunder",
      "created_time": "July 29, 2023, 10:33:25 AM",
      "body": "Quote from: mk4 on July 29, 2023, 06:20:51 AMI always get pretty skeptical when I see posts from new users that are pretty much just overly praising Bitcointalk as if it was some crypto's version of Jerusalem lol.Welcome, I guess. Don't you get surprised when you see a newbie account registered a week ago and started writing about improving post quality and what mistakes they should not make in Bitcointalk? I guess I have seen this many times, yet I am not bored with it. I consider myself a newbie, and sometimes I feel like I write too much  It's also true that someone might be a newbie in this forum, but still, they know many things about technology. I know some skillful coders and I invited them to Bitcointalk, but they said they don't have time for BitcoinTalk.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Stepstowealth",
      "created_time": "July 29, 2023, 12:10:58 PM",
      "body": "Quote from: Mr_Peter Ben on July 29, 2023, 01:10:15 AMI hope, I'm not late for Bitcoin because Bitcoin already grew a lot. You are late to bitcoins like I was, thing is we should have started earlier, but since we are starting now, it is still good. Quote from: Mr_Peter Ben on July 29, 2023, 01:10:15 AMEveryone who knows Bitcoin should know Bitcointalk. Not everyone who know bitcoin, know about a forum for bitcoin. And even if some people knew about bitcointalk, they may still not be interested because some people already have knowledge about bitcoins are not interested in becoming members of any forum, they just want to invest in bitcoins. Bitcointalk is for people who want something more, asides just investing. The forum makes you feel among a family.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "aylabadia05",
      "created_time": "July 29, 2023, 01:00:10 PM",
      "body": "Set aside your free time for forums instead of spending your free time scrolling through social media because by getting used to being active in forums you will gain a variety of knowledge about Bitcoin.You are not late and you will later find people who come after you with the words that I hope I am not late.I want to say don't push yourself because for a goal, direction is more important than speed. Welcome and welcome to join. Hopefully later you will become a useful member of the community.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Patrol69",
      "created_time": "July 29, 2023, 01:05:04 PM",
      "body": "First of all congratulations on this forum. Everything seems so amazing to you because you just started in this forum but when you become a regular member of the forum you can tell about these things to the people who sign up as a newbie and want to know about these things. Bitcoin is an amazing invention. Just as the US dollar is used by people all over the world, Bitcoin is used by people in different countries around the world. While you cannot use US dollars as an investment, you can use Bitcoin as an investment. Bitcoin is a digital currency with which it is possible to conduct almost all types of activities such as with Bitcoin you can trade, invest for a long time, and in all countries where Bitcoin has a legal document, you can do various transactions through Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "alastantiger",
      "created_time": "July 29, 2023, 01:13:20 PM",
      "body": "I like your passion and enthusiasm. It's good. While you are here take the time to read and learn more about the forum while you are learning about Bitcoin. Bitcointalk has changed lives of many users and it can change your own life too and put you in a good, better or best position if you set your goals of what you wish to achieve by being here. That is all that matters. I would also like to give you a heads up that newbies often face critical comments on their posts by higher ranking members, therefore you should expect it and develop a thick skin. And if you feel it is too harsh, you can take some days off for your mental health. I wish you more bitcoins to your wallet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husires",
      "created_time": "July 29, 2023, 01:47:25 PM",
      "body": "Quote from: Mr_Peter Ben on July 29, 2023, 01:10:15 AMSatoshi build Bitcoin and as a coder, he really listened to community feedback and tried to explained it because Bitcoin was (and is) still very technical. Bitcoin is a great technological piece because Bitcoin needs to be safe from hacker. Much money is stored in Bitcoin network and if it's not safe, we are screwed, everyone. Bitcoin was not hacked, not because it is safe or because Satoshi developed it securely, and if this is true, it is because of its nature. Bitcoin, by its central nature, cannot be hacked because it is not the servers of a central company or service, but only paired spending is possible if the hackers have the longest chain starting from 51% from the network to launch a successful attack. learn a lot in a short time by reading some books or watching YouTube videos.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rozak",
      "created_time": "July 29, 2023, 01:58:59 PM",
      "body": "Quote from: Mr_Peter Ben on July 29, 2023, 01:10:15 AMI hope, I'm not late for Bitcoin because Bitcoin already grew a lot. nothing is too late, you are not alone because there are indeed many people who have just seen Bitcoin after the news in the media.welcome to the forum.Quote from: Mr_Peter Ben on July 29, 2023, 01:10:15 AMBitcointalk has many interesting topic. Everyone who knows Bitcoin should know Bitcointalk. not everyone will be interested in the forum. they are also many who are only interested in trading and investing in Bitcoin. or mining Bitcoin, even gambling in Bitcoin casinos.everyone has their own goals.Quote from: Mr_Peter Ben on July 29, 2023, 01:10:15 AMAnd we can learn A LOT from Bitcointalk. as you said, there are many topics and discussions in this forum. it all depends on your interests and ability to grow.I hope you get a lot of benefits from the forum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Billo_",
      "created_time": "July 29, 2023, 02:41:10 PM",
      "body": "Hello, bro! It is always important for Bitcointalk to have new member here to make Bitcointalk grow. You have said already in your comment very important knowledge for Bitcoin like not your keys, not your coins. Knowing it is already a big step to make our coins more safe. Because when Bitcoin really gains in value, we need to have our coins safe. Bitcointalk is really interesting platform for more Bitcoin topics and you made a good decision to sign up here.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Frankolala",
      "created_time": "July 29, 2023, 03:42:51 PM",
      "body": "Quote from: Stepstowealth on July 29, 2023, 12:10:58 PMQuote from: Mr_Peter Ben on July 29, 2023, 01:10:15 AMI hope, I'm not late for Bitcoin because Bitcoin already grew a lot. You are late to bitcoins like I was, thing is we should have started earlier, but since we are starting now, it is still good. I don't think so, Mr Peter Ben is still early to bitcoin because he can still invest now that the price of bitcoin is 29k+ and he will still experience the bull run next two years. Bitcoin is something that you must be ready and prepared for. You are in the right place to learn a whole lot on bitcoin and its blockchain technology. Feel free to navigate round the forum and look for boards that are of your interest. Whatever that you don't understand be free to ask questions as we have experts here that will help you. The technical side of bitcoin is not compulsory to know before you can invest in bitcoin. Bitcoin has its basics as soon as you know that your bitcoin journey will be a success.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}