{
  "id": "topic_5439186",
  "title": "Kenzoro13",
  "author": "Kenzoro13",
  "created_time": "February 09, 2023, 01:34:35 PM",
  "content": "I was always a gem seeker, you know how it is with this low mcaps. They are x100, ×1000 or zero. Since many years I invested in many coins, started with BTC and ETH like all of us and then some meme coins went with booming profits! Like Shiba and Doge for example.Its clearly that in our days the MEME Coins have a great potential to make really good money in a bullmarket.I am more of the guy that looks for some projects with limited supply, of course you cant find all of this in one project. The question would be what is your favourite coin now? Which meme Coins do you guys invest in now? Would be very interesting to know your opinion.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5439186",
  "comments": [
    {
      "author": "RikkiddyWrecked",
      "created_time": "February 09, 2023, 01:38:59 PM",
      "body": "Hey man, I've only jsut started getting back to cyrpto again. I understand the AI is the current trend atm but I'm a sucker for a meme coin. Have in been in any recently?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kenzoro13",
      "created_time": "February 09, 2023, 01:59:41 PM",
      "body": "AI is definitely in trend now. I got in some but i dont know if its a real pump or just some Fomo/Trend action.One coin got my atention recently and i am thinking about investing in it a little bit, i think its a good ''horse'' to bet on it on the long run.Its called Dinolfg. If im not mistaking they started when FTX crashed on 11 of November last year. Got limited supply and all in Uniswap. Joined them recently on telegram group, i still do my  DYOR there, but seems to be a very strong community with a based DEV.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DinoRitus",
      "created_time": "February 09, 2023, 02:07:31 PM",
      "body": "I knew about cryptocurrencies more than 3 years ago, and after researching a lot I saw that MEMECOIN has great potential. Meet Shiba that since its launch (Sep 01, 2020 = $0.000000000082) Its price increased by 16356489.26%... I know it's too late to buy Shiba. It has a high marketcap and its supply is very high so I'm looking for new memescoin for the high marketcap is late to buy DOGE, SHIBA or FLOKI, it is already difficult to have the growth they had and their supply is very highI have been researching for weeks, I discarded many tokens because they did not have whitepaper and were not clear as to the usefulness of it. Hear something about a token called DINO. You know something about that.Do you know anything about that?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "casper_crypto",
      "created_time": "February 09, 2023, 02:07:54 PM",
      "body": "It's hard to say because there are still a lot of projects being developed, but it's certainly worth looking at the likes of $SHIB $DOGE $FLOKI an interesting trend may emerge on the new shibarium chain. Of such newly emerging ones I'm also into dino lfg, tokenomics looks good, staking has interesting options, it certainly can't hurt to get in with a little capital. Ps. always invest as much as you can lose and do not feel discomfort, dyor",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kenzoro13",
      "created_time": "February 09, 2023, 02:14:10 PM",
      "body": "Of course we should invest just what we can loose.Thats the main rule in Crypto. I opened this thread extra that we share thought about some projects that everyone has. Cause of course everyone would tell you ''my project is the best'' but a little bit of brainstorming between this forum Users its never bad.@Ritus , you found Dino also ? I didnt even knew they had the Whitepaper ready. I should go and take a look, that would clear some questions i still have. Where can i find it? I assume on the website , right ?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DinoRitus",
      "created_time": "February 09, 2023, 02:30:23 PM",
      "body": "Yes, the whitepaper is ready, I saw it on their website. Here I leave the link if you want to know more ... https://dinolfg.com/On that website are their official social networks. Just see that your twitter is verified too.  It seems that something is coming about some NFTs ... . It is not clear to me yet what it is, I am still researching but the project looks very good",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kenzoro13",
      "created_time": "February 09, 2023, 02:33:46 PM",
      "body": "LOL! Fun fact, when you write www.dextools.com you are landing directly to their own chart. So i guess they bought the domain, i got to say it, this is a real intelligent move from their side.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DinoRitus",
      "created_time": "February 09, 2023, 02:42:14 PM",
      "body": "ah, I did not know, that explains why at first only in dextools could be bought. Find out and it seems that you can do staking of $DINO and have $shiba, $floki and $shibdao as rewards? I see that there is someone who commented that is called Casper, maybe he can explain a little more about this, if it is really like that ... And if I buy $DINO how can I staking?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kenzoro13",
      "created_time": "February 09, 2023, 02:52:35 PM",
      "body": "I saw they have a staking pool on Unicrypt. Interesting here is that you can stake Dinolfg and you get Floki,Shib,Dino of course and another coin as reward. I think its a new one Shibarium or something",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "casper_crypto",
      "created_time": "February 09, 2023, 03:15:13 PM",
      "body": "Quote from: DinoRitus on February 09, 2023, 02:42:14 PMah, I did not know, that explains why at first only in dextools could be bought. Find out and it seems that you can do staking of $DINO and have $shiba, $floki and $shibdao as rewards? I see that there is someone who commented that is called Casper, maybe he can explain a little more about this, if it is really like that ... And if I buy $DINO how can I staking? Once you have purchased the tokens, you can lock them for several months and receive a % of profit in return. There should be a link to staking on the official site. You choose the option for 3 or 9 months and subscribe to reward pools. You can earn at once shib floki shibdao and of course dino. Are you on their telegram group? You can always ask the admins there",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Shobhikhan_007",
      "created_time": "February 09, 2023, 03:24:28 PM",
      "body": "My favourite coins are DOGE & SHIB. Why? Because DOGE have Elon musk behind it.SHIB have large army behind it. So these two coins are best for trade for news and make some bucks for eat good meal or maybe buy a new iphone. Ha ha",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o48o",
      "created_time": "February 09, 2023, 04:16:20 PMLast edit: February 09, 2023, 04:27:10 PM by o48o",
      "body": "Quote from: Kenzoro13 on February 09, 2023, 01:34:35 PMI was always a gem seeker, you know how it is with this low mcaps. They are x100, ×1000 or zero. If we talk about microcaps, lowest meme token i am holding now is Pepe Solana. It's sitting now in $8.87K marketcap, which is ridiculous. Could be a scam from all i know so DYOR but i am thinking of doubling down as it wouldn't need much to raise a lot.There are other new low caps i am holding if you are interested but they are not meme tokensQuote from: Kenzoro13 on February 09, 2023, 02:33:46 PMLOL! Fun fact, when you write www.dextools.com you are landing directly to their own chart. So i guess they bought the domain, i got to say it, this is a real intelligent move from their side.That's because dextools.com isn't the right address for dextools.ioEdit: But ok i see now, this was just an advertisement for Dino, not a genuine question. Otherwise why would have you known about a fake url?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kenzoro13",
      "created_time": "February 09, 2023, 05:03:51 PM",
      "body": "Hey, totally agree with you that Shib and Doge are the strongest ones. I made alot of money also with the 2 of them, thank God. As for the dextools.com , wasnt some advertising, since i joined their group i saw that and i tryed it out. I still think its a clever idea from their side.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "casper_crypto",
      "created_time": "February 09, 2023, 05:11:53 PM",
      "body": "[/quote]If we talk about microcaps, lowest meme token i am holding now is Pepe Solana. It's sitting now in $8.87K marketcap, which is ridiculous. Could be a scam from all i know so DYOR but i am thinking of doubling down as it wouldn't need much to raise a lot.There are other new low caps i am holding if you are interested but they are not meme tokens[/quote]That's because dextools.com isn't the right address for dextools.ioEdit: But ok i see now, this was just an advertisement for Dino, not a genuine question. Otherwise why would have you known about a fake url?[/quote]Although I don't like solana and think it's a weak chain I also invested a penny in pepe, good catch!Lol how many domains have Io and how many have com, it's normal to type com from memory",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cabron",
      "created_time": "February 09, 2023, 05:26:43 PM",
      "body": "SHIB has gotten attention again because of its Shibarium. The ones who believe in this meme coin actually will get serious about buying more as people did with Doge. We didn't take Doge seriously back when it was less than a cent and gamblers bet 100K of Doge in dice and continue the martingale system but now, they have become precious. Time to pick one to take it seriously and wait for more than 5 years.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tvplus006",
      "created_time": "February 09, 2023, 07:00:20 PM",
      "body": "Quote from: Kenzoro13 on February 09, 2023, 01:34:35 PM...Would be very interesting to know your opinion.It is safe to say that the most favorite meme coin for a trader will be the one that allowed him to get the biggest profit. Accordingly, if a trader has made a loss by investing in any meme coin, then this coin will be the worst for him.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "btc_angela",
      "created_time": "February 09, 2023, 07:05:07 PM",
      "body": "Quote from: RikkiddyWrecked on February 09, 2023, 01:38:59 PMHey man, I've only jsut started getting back to cyrpto again. I understand the AI is the current trend atm but I'm a sucker for a meme coin. Have in been in any recently?I'm not into meme coins or what, but what struck me is,a. Shiba or any of it's variantsb. Doge - still the king of meme coins.Again, I don't have nothing against those who are into it, but going to be a long road for you guys. And unless you really know what you are doing, you might lose a lot of money when you invest your hard earn money on them, just saying.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kenzoro13",
      "created_time": "February 09, 2023, 08:41:29 PM",
      "body": "Thats the thing with this coins . People don’t take it seriously but the strong community’s make it so strong.I remember now the time I bought first time shib and doge . At the beginning I didn’t believe they will go that big , but this is how it ie .I actually bought my first bag today of Dinolfg after i read the whitepaper and spend more time in the community .i bought some shibarium also , you never know where the way leads you.thats why i open this thread to see other opinions also . the meme coin lovers know that .",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitbollo",
      "created_time": "February 09, 2023, 08:46:54 PM",
      "body": "I initially liked dogecoin because it offered practical advantages compared to other coins (cheap cost to transfer it, ease of exchange, and so on).today these uses are no longer needed and I believe that meme coins are simple speculative material, very dangerous for those who don't know what they are doing.nowadays I haven't any favorite meme coins  the only one that has some of my support is banano coin  but of course I will never suggest to any one to invest/mine etc etc",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}