{
  "id": "topic_5414497",
  "title": "SUPERSAIAN",
  "author": "SUPERSAIAN",
  "created_time": "September 22, 2022, 01:52:34 PM",
  "content": "Buz Banyosu Kaslara İyi Gelir mi?Daha yaygın olarak buz banyosu adıyla bilinen soğuk su terapisi, sporcuların müsabaka ya da antrenman sonrasında sıkça uyguladıkları toparlanma yöntemlerinden bir tanesi.Genellikle 10-15 °C aralığındaki suyla on dakika civarındauygulanan soğuk suya dalma uygulamasının kas onarımını artırdığı ve uzun vadede sportif performansı geliştirdiğiiddia ediliyor. Başarılı sporcuların paylaşımlarıyla popülerliği gittikçe artan buz banyosu üzerinde yapılan araştırmalar ise performansa etkisi konusunda soru işaretleri ortayaçıkarıyor.Yoğun egzersizler sırasında bazı kas dokularının fazlaca zorlanmasıyla hücre zedelenmeleri ve inflamasyon (yangı)oluşumu sıklıkla karşılaşılan durumlardan. Hücre hasarıylauyarılan dokularda, sorunlu bölgeyi iyileştirmek ve güçlendirmek için hummalı bir çalışma başlar. Genellikle egzersizden sonraki 12-72 saat aralığında ağrılarla kendini bellieden bu duruma gecikmiş kas ağrısı, halk arasında daha sıkkullanılan adıyla “hamlık” denir. Buz banyosunun sıcaklığı veuyguladığı basınçla hasarlı bölgedeki kan damarları büzülür. Bu sayede, bölgeye yığılmaya başlayan akıntının önü kesilirve hasarlı alandan uzaklaştırılması gereken laktik asit gibimaddelere de yol açılır. Böylece doku yıkımı ve şişlik miktarıazalır. Ek olarak, buz banyosunun kalp atım hızını düzenlemeye de yardımcı olduğu belirtiliyor.Egzersiz sonrası buz banyolarının rahatlatıcı ve ağrı azaltıcı etkisi üzerinde bir fikir birliği bulunurken sportif performansa etkisinin ölçüldüğü araştırmalar geniş bir yelpazedesonuçlar sunuyor. Örneğin, bir araştırma grubu ağırlık kaldırma gibi kuvvet odaklı egzersizler yapan sporcuların düzenli buz banyosu yapmalarının devam eden süreçte performanslarına etkisini inceledi ve bu sporcularda güç artışı,kas kütlesi ve hücresel gelişim bakımından eksilme ya dabaskılanma gerçekleştiği bulgularına ulaştı. Araştırmacılar,buz banyosunun kas hücreleri için gerekli protein sentezi işlemini sekteye uğrattığını düşünüyor. Yürüyüş ve koşugibi dayanıklılık odaklı sporlarda ise buz banyosunun etkisiolumlu yönde. Hücrelerimizde enerji üretiminden sorumluorganel olan mitokondri, yüksek miktarda enerji harcayankaslarımızda bolca bulunur. Yapılan bir araştırmada, dayanıklılık sporları sırasında artan mitokondri etkinliğinin buzbanyosu ile daha da arttığı görüldü. Araştırmacılar bunuPGC-1α adlı genin soğuk su sayesinde işleyişinin artmasınabağlıyor. Bu genin işleyişindeki artış, mitokondrilerde büyümeye, etkinlik artışına ve yapılarındaki proteinlerin daha aktif çalışmasına yol açıyor.Potansiyel yan etkiler: HipotermiSinir hasarıAğrıGünlük hayatınızda sıcak, soğuk nasıl duş almayı tercih ediyorsunuz. Etkilerini hiç karşılaştırdınız mı ?Son bir kaç haftadır ağır antremanalar yapıyordum. Buzdolabında bir ton yaptığım buzu küvete boşalttım, bu terapiyi denedim. Gerçekten de yenilenmiş gibi hissettirdi, buz banyosundan sonra. İlk başta fazlasıyla alışmak için fiziksel anlamda vücudunuz savaşıyor lakin alışıyorsunuz bir yerden sonra.Kaynaklar ;pubmed.ncbi.nlm.nih.gov/24561815sciencedaily.com/releases/2019/12/191202220355.htmtheconversation.com/health-check-do-ice-baths-after-sport-help-recovery-orimprove-results-44829wexnermedical.osu.edu/blog/ice-baths-muscle-growth",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5414497",
  "comments": [
    {
      "author": "meser#",
      "created_time": "September 22, 2022, 10:02:05 PM",
      "body": "Öncelikle yaz aylarında soğuk suyla duş yapan birisiyim. Soğuk mevsimlerde ise en son kısımda kısa süreliğine tüm vücuduma soğuk su tutup duştan çıkmaktayım. Bu özellikle sabahları kahveden daha kolay ayılmamı ve daha enerjik olmamı sağlıyor. Buz banyosunu denemedim ancak denemeyi istediğim zamanlar oldu olmadı değil. Çünkü gerçekten soğuğun eklem ve kas ağrılarına ne kadar iyi geldiğini çok iyi biliyorum. Dediğiniz gibi yan etkiler olabilir ama şu da var ki bahsettiğiniz gibi profesyonel sporcular veya ağır antrenmanlara tabi olan kişilerin soğuk kompres adı altında toplayabileceğimiz bölgesel buz tutma, soğuk duş ve duş banyosu gibi uygulamaları yapmalı. Antrenman sonrasında vücudunun iyi dinlenmesi ve bu bölgelerdeki hasarların bu yöntemlerle minimize edilmesi vücut gelişimine verdiği baskılamadan daha çok destek verecektir. Tabi bunlar bir uzman eşliğinde yapılmalı sonra recep ivedik gibi kuzu çevirme yaparlar  Çoğu zarar, azı karar der atalarımız. Siz buz banyosundan çok bölgesel komprese ve soğuk duşa yöneltin kendinizi. Ama arada bir de şoklamak iyi gelecektir vücudu",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "totti67",
      "created_time": "September 23, 2022, 05:23:55 AM",
      "body": "Ben genelde sıcak su severim ama, konu başlığında yazılanlar gerçek.ruslarin bebekleri buzlu suya sokup çıkardığını görmüştüm. Tamamen soğuk suya karşı olan benim gibiler için banyodan çıkarken en azından dizden altını soğuk suyla yıkamak da faydalı.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "RaltcoinsB",
      "created_time": "September 23, 2022, 05:30:06 AM",
      "body": "Soğuk su altında nefes alamayan bir ben mi varım arkadaş ya buz banyosu denilince bile titredim  sıcak soğuk dengesini iyi ayarlamak lazım tamam vücuda soğuk lazım da vücut ısısını direkt olarak düşüren buz banyosu vücutta bazı eklemleri, sinirleri kalıcı hasara sebep olacak şekilde etkileyebilir sonuçta vücuda şok yapıyorsunuz bence faydalıysa bile zararı daha fazla",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Phoenix Anka",
      "created_time": "September 23, 2022, 07:25:10 AM",
      "body": "Buz banyosunu futbolcularda çok görüyordum bende. İnstagram üzerinden paylaşım yapan bazı futbolcular özellikle buz banyosunu tercih ediyor. Tabi ağrı sızı yerlerinde şişlikleri indirmek için birebir olduğu aşikar. Çünkü normal bir şişlikte bile buz koyuyoruz onlar maç boyu ne kadar tekme yiyorlar kim bilir. Buz banyosu bu yüzden onlar adına çok iyi bir nimet. Tabi performansa etki etmez etmesi de mantıksız sadece şişlik ve maç sonrası yorgunluk için faydalı.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "püsür",
      "created_time": "September 23, 2022, 10:42:09 AM",
      "body": "Buz terapisini ben de NBA oyuncularında görmüştüm. Hatta Lebron James'in videolarında sürekli gözüküyor. O ne yapıyorsa işe yarıyordur hocam bence, bu bile kanıtı olmaya yetebilir. Yanlış bilmiyorsam neredeyse her zorlu performanstan sonra yapıyorlar bu cryotherapy denen olayı. Maçlardan sonra normal buz banyosu da yapıyorlar diye biliyorum. NBA'in maç programı inanılmaz yoğun, bu şekilde performanslarını koruyorlardır.Benim kişisel deneyimime göre ise ben bu soğuk duş genç tutar, sağlıklı tutar muhabbetini üniversitedeyken duymuştum. O zamandan beri duşlarımı hep buz gibi suyla bitiriyorum. Bence gerçekten işe yarıyor. Lisede falan kışları 1-2 kere aşırı ağır şekilde hasta olurdum, artık hiç olmuyorum.Ayrıca soğuk denize girmekte de büyük fayda oluyor bence. Örneğin geçen mayıstaki bayramda Bodrum'da 2-3 gün yüzdüm. Su cidden buz gibiydi ve kimse giremiyordu. Ben soğuk suyu sevdiğim için çok yüzdüm ve gerçekten bariz bir şekilde farkı hissettim. Kan damarlarının soğuk ve sıcak ortama göre davranışlarıyla bu kadar farklı hissedilmesi süper bir şey bence. Deniz kenarındaki yerlerde yaşayanlara soğuk havalarda yüzmelerini öneririm. Antalya'da güneşli bir Şubat zamanı yüzmüştüm 3 sene önce. Gerçekten gene süper olmuştu.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "W Jr.",
      "created_time": "September 23, 2022, 10:47:19 AM",
      "body": "Quote from: püsür on September 23, 2022, 10:42:09 AMBuz terapisini ben de NBA oyuncularında görmüştüm. Hatta Lebron James'in videolarında sürekli gözüküyor. O ne yapıyorsa işe yarıyordur hocam bence, bu bile kanıtı olmaya yetebilir. Yanlış bilmiyorsam neredeyse her zorlu performanstan sonra yapıyorlar bu cryotherapy denen olayı. Maçlardan sonra normal buz banyosu da yapıyorlar diye biliyorum. NBA'in maç programı inanılmaz yoğun, bu şekilde performanslarını koruyorlardır.Benim kişisel deneyimime göre ise ben bu soğuk duş genç tutar, sağlıklı tutar muhabbetini üniversitedeyken duymuştum. O zamandan beri duşlarımı hep buz gibi suyla bitiriyorum. Bence gerçekten işe yarıyor. Lisede falan kışları 1-2 kere aşırı ağır şekilde hasta olurdum, artık hiç olmuyorum.Ayrıca soğuk denize girmekte de büyük fayda oluyor bence. Örneğin geçen mayıstaki bayramda Bodrum'da 2-3 gün yüzdüm. Su cidden buz gibiydi ve kimse giremiyordu. Ben soğuk suyu sevdiğim için çok yüzdüm ve gerçekten bariz bir şekilde farkı hissettim. Kan damarlarının soğuk ve sıcak ortama göre davranışlarıyla bu kadar farklı hissedilmesi süper bir şey bence. Deniz kenarındaki yerlerde yaşayanlara soğuk havalarda yüzmelerini öneririm. Antalya'da güneşli bir Şubat zamanı yüzmüştüm 3 sene önce. Gerçekten gene süper olmuştu.Buz gibi havada yüzme tecrübesi edinmedim ama söylediklerinizi baz alarak ilk fırsatta kışın soğukta yüzmeyi deneyeceğim bakalım aradaki farkı bende hissedecek miyim.Buz banyosu olayını hep merak etmişimdir.Rusların böyle bir geleneği var diye biliyorum kuzey ülkelerinde de olması lazım.Bu soğuk iklimlere adaptasyon içinde önemli onlar için.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ZekiBeyy",
      "created_time": "September 23, 2022, 12:36:35 PM",
      "body": "Dalış yapan bir arkadaşın Youtube'da kışın bir videosuna denk gelmiştim karlı bir günde akan dereye girmişti su sıcaklığının 4 derece olduğundan bahsetmişti kısa süreliğine suya girip çıkmıştı sonrasında kendimi daha dinç hissediyorum demişti ve suya girmeden önceki duruma göre daha az üşüdüğünü söylüyor. videonun 16. dakikasında suya giriyor gerekli açıklamayı 18:40 dan sonra yapıyor izlemek isterseniz link aşağıda:https://www.youtube.com/watch?v=_aefjsMdf5AKışın bende deneyeceğim bu tarz soğuk suya girdiğiniz zaman güvenlik adına mutlaka yanınızda bir kişi olsun derim ne olur ne olmaz. Bir kaç sene önce 27 kasımdı sanırım denize girmiştim ilk başta bayağı bir üşüyorsunuz sudasınız üşüdüğünüzü biliyorsunuz ama soğuk sizi yakıyor bu yüzden üşümüyormuşsunuz gibi geliyor.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SUPERSAIAN",
      "created_time": "September 23, 2022, 02:37:22 PM",
      "body": "Quote from: ZekiBeyy on September 23, 2022, 12:36:35 PMDalış yapan bir arkadaşın Youtube'da kışın bir videosuna denk gelmiştim karlı bir günde akan dereye girmişti su sıcaklığının 4 derece olduğundan bahsetmişti kısa süreliğine suya girip çıkmıştı sonrasında kendimi daha dinç hissediyorum demişti ve suya girmeden önceki duruma göre daha az üşüdüğünü söylüyor. videonun 16. dakikasında suya giriyor gerekli açıklamayı 18:40 dan sonra yapıyor izlemek isterseniz link aşağıda:https://www.youtube.com/watch?v=_aefjsMdf5AKışın bende deneyeceğim bu tarz soğuk suya girdiğiniz zaman güvenlik adına mutlaka yanınızda bir kişi olsun derim ne olur ne olmaz. Bir kaç sene önce 27 kasımdı sanırım denize girmiştim ilk başta bayağı bir üşüyorsunuz sudasınız üşüdüğünüzü biliyorsunuz ama soğuk sizi yakıyor bu yüzden üşümüyormuşsunuz gibi geliyor.Sayende sıcacık bir kamp videosu seyrettim hocam arkadaşın youtube kanalına da abone oldum teşekkürler paylaşım için. Videonun sonuna kadar her şey güzeldi ufak bir aksilik çıkıyor neyse ki sorun hallediliyor. Benim yaptığım buz banyosunda 4 dereceden biraz daha fazla olduğunu tahmin ediyorum neredeyse aynı hisleri yaşadığımı gördüm bu videoda. buz banyosundan çıktıktan sonra gram üşüme hissetmiyorsun ve ayrıca modun tamamen değişiyor kendini yenilenmiş hissediyorsun, videodaki arkadaş anlatırken zaten o duyguyu tamamen yansıtmış",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ZekiBeyy",
      "created_time": "September 23, 2022, 03:24:23 PM",
      "body": "Quote from: SUPERSAIAN on September 23, 2022, 02:37:22 PMQuote from: ZekiBeyy on September 23, 2022, 12:36:35 PMDalış yapan bir arkadaşın Youtube'da kışın bir videosuna denk gelmiştim karlı bir günde akan dereye girmişti su sıcaklığının 4 derece olduğundan bahsetmişti kısa süreliğine suya girip çıkmıştı sonrasında kendimi daha dinç hissediyorum demişti ve suya girmeden önceki duruma göre daha az üşüdüğünü söylüyor. videonun 16. dakikasında suya giriyor gerekli açıklamayı 18:40 dan sonra yapıyor izlemek isterseniz link aşağıda:https://www.youtube.com/watch?v=_aefjsMdf5AKışın bende deneyeceğim bu tarz soğuk suya girdiğiniz zaman güvenlik adına mutlaka yanınızda bir kişi olsun derim ne olur ne olmaz. Bir kaç sene önce 27 kasımdı sanırım denize girmiştim ilk başta bayağı bir üşüyorsunuz sudasınız üşüdüğünüzü biliyorsunuz ama soğuk sizi yakıyor bu yüzden üşümüyormuşsunuz gibi geliyor.Sayende sıcacık bir kamp videosu seyrettim hocam arkadaşın youtube kanalına da abone oldum teşekkürler paylaşım için. Videonun sonuna kadar her şey güzeldi ufak bir aksilik çıkıyor neyse ki sorun hallediliyor. Benim yaptığım buz banyosunda 4 dereceden biraz daha fazla olduğunu tahmin ediyorum neredeyse aynı hisleri yaşadığımı gördüm bu videoda. buz banyosundan çıktıktan sonra gram üşüme hissetmiyorsun ve ayrıca modun tamamen değişiyor kendini yenilenmiş hissediyorsun, videodaki arkadaş anlatırken zaten o duyguyu tamamen yansıtmış Mustafa Beyaz arkadaşı 1 yıldan fazladır takip ediyorum izliyorum bu halde dalışa gidiyor bot taşıyor denize indiriyor tekrar çekiyor araba bağlıyor sabah erken kalkıp dalışa gidiyor şöyle bakıyorum gözlerindeki ışık benden fazla  helal olsun diyorum. Özellikle son 2 yıldır ben çok üşüyorum artık yaşlandıkmı ondanmı bilemiyorum tamam kışın bende denize giriyorum ama elbise olunca beni pek etkilemiyor soğuk ama bu sene soğuk suya bende girmeyi planlıyorum çok abartmadan vücut direncini artırmak gerek. Dediğim gibi önceden kasım ayında girmiştim ilk soğuğu hissettim sonrasında vücutta sanki kaynar su yakar gibi bir his bırakıyordu sanırım şokluyordu  öylece daha çok denizde kalabilirdim ama hipotermi olaylarını bildiğim için çok fazla kalmamıştım sanırım 5-10 dakika kadar kalmıştım. Hipotermi konusunda bilgiler içeren şu videoyuda ekliyeyim belki bir gün birine faydası olur. https://www.youtube.com/watch?v=IsPwD1fxmws",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LGD2Business",
      "created_time": "September 23, 2022, 03:30:31 PM",
      "body": "Quote from: püsür on September 23, 2022, 10:42:09 AMBuz terapisini ben de NBA oyuncularında görmüştüm. Hatta Lebron James'in videolarında sürekli gözüküyor. O ne yapıyorsa işe yarıyordur hocam bence, bu bile kanıtı olmaya yetebilir. Yanlış bilmiyorsam neredeyse her zorlu performanstan sonra yapıyorlar bu cryotherapy denen olayı. Maçlardan sonra normal buz banyosu da yapıyorlar diye biliyorum. NBA'in maç programı inanılmaz yoğun, bu şekilde performanslarını koruyorlardır.Bu soğuk suyla duş ve buza girme olayı iyice popüler oldu son zamanlarda. LeBron James kendini fit tutmak için kişisel antrenörleri vs. için yıllık 1.5 milyon dolar para harcıyor. Bu en üst düzey profesyonel sporcuların yaptığı şeylerin yanlış olmasına imkan yok. Mutlaka performansı artıran olaylardır bunlar. Kuzey ülkelerinde bebekler yeni doğmuşken soğuk suya atılıyor. Hem hayatta kalmayı yüzmeyi öğreniyorlar hem de daha dayanıklı ve sağlıklı oluyorlar. Bu konuda çok fazla araştırma olduğunu biliyorum, bilimsel olarak kanıtlanmış şeyler olmalı.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "judas",
      "created_time": "September 23, 2022, 07:55:48 PM",
      "body": "Hayatım boyunca hep soğuk hatta buz gibi suda duş almayı tercih ettim bunun bana bir faydası olmuş mudur bilmiyorum umarım olmuştur.   Benim bildiğim kadarıyla profesyonel sporcular zaman zaman kendilerini soğuk odalara kapatıyorlar hatta yıllar önce Ronaldo ile ilgili çıkan bir haberi de bu vesileyle sizinle paylaşayım:https://www.beinsports.com.tr/haber/ronaldonun-sirri-ortaya-cikti",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Retro Harmony",
      "created_time": "September 24, 2022, 06:13:14 AM",
      "body": "Quote from: judas on September 23, 2022, 07:55:48 PMHayatım boyunca hep soğuk hatta buz gibi suda duş almayı tercih ettim bunun bana bir faydası olmuş mudur bilmiyorum umarım olmuştur.   Benim bildiğim kadarıyla profesyonel sporcular zaman zaman kendilerini soğuk odalara kapatıyorlar hatta yıllar önce Ronaldo ile ilgili çıkan bir haberi de bu vesileyle sizinle paylaşayım:https://www.beinsports.com.tr/haber/ronaldonun-sirri-ortaya-ciktiSoğuk vücuda iyi geliyor diye söylerler hep. Soğuk iklimde büyüyen vatandaşlara bakın daha dirençliler. Hastalıklara karşı daha dayanıklılar ama sıcak iklim öyle mi az bir şey esse üşütülüyor. Vücudu soğuğa alıştırmak çok iyi aslında. En azından hastalıklara karşı bir direnç kazanma olarak görebiliriz. Bir de banyodan çıkmadan ayaklara soğuk su tutmanın kan dolaşımına pozitif etkisi olduğunu okumuştum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kriminall",
      "created_time": "September 26, 2022, 10:12:05 AM",
      "body": "Elbette faydalıdır, soğuk insanı bir çok zarardan korur, vücuda dinçlik verir, gençlik verir, soğuk duş çok önemlidir, bir çok insan sıcak suyla duş alırken uzmanlar hiç olmazsa ayakları soğuk suya tutma gerekliliğini dile getiriyorlar, vücuda zindelik katıyor, Cristiano Ronaldo özellikle soğuk buz banyosu yapıyor bildiğim kadarıyla, o adam yapıyorsa doğrudur zaten",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "karabiber",
      "created_time": "September 27, 2022, 05:07:08 PM",
      "body": "Profesyonel veya amatör farketmeksizin sporcuların buz banyosu yapması kesinlikle gelişimleri için faydalı bir şeydir. Ortaokul zamanlarında basketbol ile haşır neşirken bireysel antremanlardan sonra sevdiğim bir koçun tavsiyesiyle yapmıştım ve sonrasında inanılmaz bir rahatlama olmuştu. Bunu öğrendikten sonra normal hayatımda da buz banyosu olmasa da soğuk su ile duş almaya kendimi alıştırdım ve yaz-kış soğuk su ile duş almaya başladım. Başlarda inanılmaz ağır geliyordu ve hastalanıyordum ama vücudumu terbiye ettikten sonra inanılmaz faydalarını gördüm. Bende genetik damar hastalığı var ve soğuk duş sayesinde hastalığın ilerlemesini neredeyse durdurdum diyebilirim. Doktor bile bu duruma şaşırmıştı.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Red Pie",
      "created_time": "September 27, 2022, 05:28:05 PM",
      "body": "Quote from: karabiber on September 27, 2022, 05:07:08 PMProfesyonel veya amatör farketmeksizin sporcuların buz banyosu yapması kesinlikle gelişimleri için faydalı bir şeydir. Ortaokul zamanlarında basketbol ile haşır neşirken bireysel antremanlardan sonra sevdiğim bir koçun tavsiyesiyle yapmıştım ve sonrasında inanılmaz bir rahatlama olmuştu. Bunu öğrendikten sonra normal hayatımda da buz banyosu olmasa da soğuk su ile duş almaya kendimi alıştırdım ve yaz-kış soğuk su ile duş almaya başladım. Başlarda inanılmaz ağır geliyordu ve hastalanıyordum ama vücudumu terbiye ettikten sonra inanılmaz faydalarını gördüm. Bende genetik damar hastalığı var ve soğuk duş sayesinde hastalığın ilerlemesini neredeyse durdurdum diyebilirim. Doktor bile bu duruma şaşırmıştı.Aslında buz banyosundan önce soğuk su ile küvet keyfi yapmak ve vücudu soğuğa alıştırmak lazım. eğer vücut soğukla imtihan olmazsa bir faydası olmaz her seferinde hastalanmaktan başka bir işe yaramaz. soğuğa yavaş yavaş ve sık sık girmek lazım ki vücut buna alışsın. soğuk uygulamaları vücudun ağırlığını alıyor, şişkinliğini, ödemini alıyor. çok keyifli özellikle yorulduğunuz zamanlarda.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}