{
  "id": "topic_5461847",
  "title": "tjtoken",
  "author": "tjtoken",
  "created_time": "August 02, 2023, 05:06:49 PMLast edit: September 01, 2023, 01:09:06 PM by tjtoken",
  "content": "Token Site | Pre-Sale | Twitter | Medium | Telegram | Linkedin | Github | Whitepaper | Facebook | YouTube | WhatsApp GroupAbout TJ Doge TokenBy owning the TJ Doge Token, you take steps to protect the environment and support stray animals.Our goal is to set up a Metaverse Blockchain and be used all over the world as a currency for all buying and selling. We are working towards this end and trying to build our own Metaverse block network.Our other goal is to make the world greener with the support of GreenPeace, other nature conservation platforms and activists. In addition, we aim to raise awareness of street animals and spread the love of animals.More than 1 million saplings will be planted in the world with a portion of the revenue from all sales. This will be a work we will do to reduce the damage done by crypto mining to nature. In addition, we will support all projects that can solve the problems of stray animals.Another project of ours is to use TJD Token as a valid currency in our own developed shopping platforms. Thus, people will be able to shop with TJD Token in the future and we aim to increase the TJD Token supply and make it more valuable.More AboutRoadmapExpertsWhat Is Crypto TJD?Despite its name, the TJ Doge Coin is actually a fun collectible coin. It was built on the Binance smart chain with the aim of spreading stray animal awareness and love for animals.TJ Doge is a deflationary coin designed to become scarcer over time. In other words, it automatically burns itself at certain rates in every transaction. All TJ Doge holders earn more TJ Doges automatically sent to your wallet by keeping coins in their wallet. The community receives more TJ Doge coins than the fees generated for each transaction.TJ Doge is an animal lover, activist, environmentalist and has an extremely active community! Our Telegram and Whatsapp communities are full of members who will be happy to assist you 24/7. Do not trust random messages from people claiming to be \"support\" or give your wallet information to anyone.Utility & CharityUtilityIn addition, supporting the projects of nature lovers and activists for a greener world and making serious investments in these areas are among our main goals.After success, TJ Doge aims to establish a worldwide shopping platform where TJD currency can be used. Thus, people will make purchases/sells with TJD currency, which will increase the supply and allow TJ Doge to be more valuable. In addition, we will establish a platform for solar energy systems, we will implement NFT collection and Metaverse virtual reality services.CharityWe will donate some of the revenues generated to stray animal adoption projects and environmental projects for a greener world. We will encourage people and our community to do so as well. To this end, we will establish the charity and the TJ Doge foundation. In this way, all our campaigns will be more meaningful and more effective.The general purpose of our foundation and charity will be to adopt stray animals, to support projects that will solve the problems of stray animals, and to solve the problems of stray animals. In addition, supporting all environmental projects that will reduce carbon emissions for a greener world will be our most important goal.Token DistributionThe pre-sale usually takes place before the project is completed, and helps fund the expenses undertaken by the founding team until launch for some of the larger Metaverse projects.DetailsTo calculate the number of coins you’ll receive, you can follow the following formula. Note that this applies to public presale contributions only.Token Name: TJ DogeToken Symbol: TJDToken Decimal: 18Total Suply: 600,000,000 TJDToken Contract: 0xaf99a4f99b79e4651f1ab259b835c886699b6278Token Network: Binance Smart ChainToken Price: 1 TJD = 0,023$More Information",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5461847",
  "comments": [
    {
      "author": "tjtoken",
      "created_time": "August 29, 2023, 05:45:01 PMLast edit: September 01, 2023, 01:08:25 PM by tjtoken",
      "body": "How To Buy TJ Doge Token?How to  Buy new meme token TJ Doge Token? You can see how to buy in detail in our video.Click on the link to continue purchasing: https://tjtoken.org",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tjtoken",
      "created_time": "September 01, 2023, 01:06:51 PM",
      "body": "We reached 583,000 TJ Doge Token sales in 1 day. We are moving forward with confident actions for our stray animals project. Thank you for your support.Details: https://bscscan.com/token/0xaf99A4f99b79e4651f1Ab259B835C886699B6278Buy Token: https://tjtoken.orgHow To Buy? https://www.youtube.com/watch?v=rdJ3XxxCkMA",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}