{
  "id": "topic_5476646",
  "title": "stompix",
  "author": "stompix",
  "created_time": "December 05, 2023, 04:20:01 PM",
  "content": "For sure you have seen doomsday topics about impeding energy crises, one after the other (of course censored discussions as usual for propganda bullshit) all that crap about new world order, the mighty Iranian power, how the US is doomed, how bla bla bla...Now since our basij is censoring all actual info in his delusional topics like:Energy Crisis 2.0 in the New World Order eraIs energy prices about to shoot up?Let's stop a bit talking about fairy tales in which Iran is  superpower or something like that and talk about FACTS!You know, that shit that brings propaganda to a halt usually!And a FACT is THIS:Despite all that madness in the middle east, despite OPEC trying to cut 2 milllion barrels of oil of production the price goes down. And why is that?Let's  go step by step and debunk all that propaganda:First the oil consumption!This is actual the funny stuff, you know, when you take a bad situation for somebody and then you ignore completely the implications of that.So propaganda will tell you everything about Europe freezing, not affording fuel, 1860% of the business closing, industry production going down by 900%, mathematically impossible stuff like that but at the same time, they completely ignore that if that would happen, then there would be no demand for oil, right?And that is indeed happening, but in China, as China manufacturing has contracted this year in 9 months out of 11, and all the oil they've bought is  sitting there with no use in sight and a further 4% is predicted for 2024https://www.reuters.com/business/energy/china-oil-demand-growth-poised-slow-around-4-h1-2024-analysts-2023-11-23/The other drawback is that countries hit by high inflation will of course not consume that much, you can't have a country that deals with 50-70% annual inflation increase its oil consumption, so the rest of the world can't really take anything that China is not buying at all.Oil productionAnother painful chapter for OPEC and other countriesUS has hit a new oil production record:https://www.axios.com/2023/12/05/us-oil-production-recordCanada is doing the same:Canada steps up pace of oil production growth, seen rising 8% in two yearsAnd so do other countries, from Norway to Angola, which brings us to the main problem OPEC, which is that some countries are tired of it.https://www.reuters.com/markets/commodities/canada-steps-up-pace-oil-production-growth-seen-rising-8-two-years-2023-08-23/In short, African producers are not interested in what's happening in the middle east, seeing this as chance to replace their unreliable costumers with Europeans ones they are not having a thought of reducing oil production when they could earn a ton more selling how much they can. Even Brazil, complete defiant has said that they plan on observing OPEC, but they will never do a production cut, as they plan to ramp production in 5 years by 1.7 million barrels.Lula says Brazil never to be full member of OPEC+, only observerThe war issueWhat Iranian propaganda tells us is that when the war starts they will...do that and that1) Iran doesn't have the balls to cut the Hormuz straight!- Israel just martyred two Iranian generals, have you heard any reaction from Iran? Of course not because they know if they try to do something stupid it's operation praying Mantis again, in which in 2 hours Iran lost half of its naval fleet!2) No other country in interested in going to war for this, just look at everyone watching from the side as they don't really care about others since, they might hate the US but they hate each other way more than thatWorld war 3 , new world order and other bsWhen some delusional folks where drawing maps how they would cut all the Suez channel traffic they forgot a few things1) The most hit in this is China who depends on exports to North America and Europe on that route, you see China saying , please close the canal, we don't need exports as we will be happy to see our already shrinking manufacture go boom completely?And also, this is China, remember how China has solved the Uyghur problem? 2) The other regional power there is India, with Modi being one of the first presidents to call Hamas a terrorist's organization and with his radical views on Muslims, how do you think this will enfold if you cut one of their way of comerce?3) Egypt, do you honestly see Egypt closing the channel and not doing anything about it because of Palestinians?Egypt is the one country that has poured sewage, yeah, that's shit in Hamas tunnels, drowning hundreds like that, its the country that depends on the money from the canal, it's the country that whose leaders hate Hamas because of their affiliation with the Muslim brotherhood, do you them taking that approach? Of course no!So, to draw a conclusion:- countries that would be affected by the this fairytale scenario : all of NATO, Japan, Australia, South Korea, Vietnam, China, India and Egypt- countries that dream of it: Iran...Who would win?  4 billions against 100 million, 60 trillion economies versus a 300 billion one!But you know who the real loser is in this situation? And this is the real sad part and a classic story of pure betrayal!The ones that were promised backing to gain independence and when shit hit th fan they were thrown to the dogs, while Iranian and other middle east countries boast about their support for Palestine, nobody is doing a thing, not a single one, all they do is chant support while not doing one thing! And I'm not going to even think of considering 10 trucks of food doing something, that's less that our hyperstore gets on a regular day, rather than help I would call that sadism.Friendly reminder that is is not a censored topic, as it's always a pleasure to discuss FACTS!",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5476646",
  "comments": [
    {
      "author": "davis196",
      "created_time": "December 06, 2023, 11:56:39 AM",
      "body": "This topic seems to be more political, rather than related to economics. Unfortunately, global politics is really dominating the oil markets.Quote Iran doesn't have the balls to cut the Hormuz straight!Iran cutting the Hormuz straight would make China and India angry. Of course, China and India could potentially increase the import of Russian oil, but I'm not sure how much Russian oil would be needed to fully replace the Saudi oil.China spent a lot of diplomatic effort into deescalating the conflict between Saudi Arabia and Iran. Iran blocking the Persian gulf would mean another conflict with Saudi Arabia, and this time the Saudi Arabians will be mad.I agree that the speculations about an energy crisis are just lies and propaganda, but a 80 USD oil price is still pretty high. The world needs a lower oil price in order to help the global economy to avoid recession.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DrBeer",
      "created_time": "December 06, 2023, 12:57:36 PM",
      "body": "Even if my position were different, I would honestly have to admit that the topic is of high quality and built on logical conclusions based on facts!If we digress a little to general questions, propaganda has the advantage that they can lie 24*7, whatever they want and about anything! Telling the truth is more difficult because... the truth is limited to FACTS, verifiable and provable. Plus, in the rules of propaganda, it’s just stupid to deny the facts presented, demanding “proof of evidence” and “signature of the person in question” But let's get back to the topic. Especially OPEC+. The fact is that today, unlike past decades, OPEC+ members are not monopolists in the oil products market. Yes, they play an important role, but not an exclusive one. This is a nuance once. Nuance two. As you remember, past attempts to terrorize the oil market did not end very well. The problem is that by reducing oil production, and, accordingly, supplies to the foreign market, it is not always possible to reduce the price for a long period. What we are seeing now. This means that oil producing countries are losing not only from shortfalls but also from falling prices for the remaining sales volume. Considering that many OPEC+ countries are heavily dependent on oil sales, this results in a classic “shooting yourself in the foot.”Third, well, you need to understand who is “pulling the strings” in the oil market. Until recently, OPEC+ countries lived quietly, received income, and had their place in the market. And suddenly they decided to go on strike. The question is: who and what prompted them to do this? The answer is extremely simple: only those who really STRONGLY suddenly began to suffer from a sharp drop in profits, the usual foreign exchange profits, from oil sales. It's easy to guess who it is",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "December 07, 2023, 12:08:03 PM",
      "body": "Quote from: davis196 on December 06, 2023, 11:56:39 AMThis topic seems to be more political, rather than related to economics. Unfortunately, global politics is really dominating the oil markets.It's abut economics, but unfortunately economics are also influenced by some political decision's.Funny as it might seems, ironically at the same time politics alone can't influence economics in the exact way you want.Quote from: davis196 on December 06, 2023, 11:56:39 AMI agree that the speculations about an energy crisis are just lies and propaganda, but a 80 USD oil price is still pretty high. Brent was below $80 by the time I opened the topic already, and just yesterday WTI dropped below $70 for the fist time in 6 months.https://www.cnbc.com/2023/12/06/us-crude-drops-below-70-per-barrel-gas-prices-fall-to-11-month-low.htmlChina imports slumped last month, US is hitting records in production, the driving season is over, the OPCE hopes of keeping it at $90 is just wishful thinking right now.Quote from: DrBeer on December 06, 2023, 12:57:36 PMBut let's get back to the topic. Especially OPEC+. The fact is that today, unlike past decades, OPEC+ members are not monopolists in the oil products market. Yes, they play an important role, but not an exclusive one. This is a nuance once. Nuance two. As you remember, past attempts to terrorize the oil market did not end very well. The problem is that by reducing oil production, and, accordingly, supplies to the foreign market, it is not always possible to reduce the price for a long period. What we are seeing now. This means that oil producing countries are losing not only from shortfalls but also from falling prices for the remaining sales volume. Considering that many OPEC+ countries are heavily dependent on oil sales, this results in a classic “shooting yourself in the foot.”If they go on like this they end up cutting production to one barrel a day while earning $40 for it.They've always underestimated what others can produce and always thought that everyone is going to obey the cuts while everyone was instead making efforts to not do it in reality and just pump more, thy fail to understand that to keep prices up and keep other countries production low at the same time is impossible.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DeathAngel",
      "created_time": "December 07, 2023, 12:28:19 PM",
      "body": "Very detailed & thorough post, stompix. I can’t disagree with much of it. In Europe we are still paying a lot more for gas & electricity to supply our homes though. Fuel is still more per litre than before the pandemic. Energy gargantuans like Shell & BP are probably just taking advantage of supposed energy shortages & price rises due to situations like the Ukraine war etc. Many countries pay a lot less than what we do in my country so in some ways it shows the consumer is being exploited.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kryptqnick",
      "created_time": "December 07, 2023, 02:58:11 PM",
      "body": "The oil price has normalized and went down very significantly over the last few months. That's great news, and I also agree with the op that the oil crisis and oil countries dictating their conditions to the world because the world needs oil is just unrealistic speculations. That being said, oil economies can continue their existence and even when things are not going great, the money seems to be enough for the nasty stuff that some countries engage in. So yeah, no world dominance for the OPEN, but no collapse of their economies to a point of inability to function and cause some harm either.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jacafbiz",
      "created_time": "December 07, 2023, 05:54:23 PM",
      "body": "Relatively the price of oil is still high, we need to understand something that the world itself is sick, almost everyone I speak too from different part of the world complains about the increase in their standard of living, if what US and the western countries plan comes to pass the price would be close to zero by now, just look at these talk of renewables and all these alternative energy talk is it a response to the OPEC+ attack on the market. For now the demand for oil is low, that is why the OPEC+ cartel want to keep controlling the supply and keep the price of oil high.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "December 11, 2023, 04:10:26 PM",
      "body": "Quote from: DeathAngel on December 07, 2023, 12:28:19 PMEnergy gargantuans like Shell & BP are probably just taking advantage of supposed energy shortages & price rises due to situations like the Ukraine war etc. Many countries pay a lot less than what we do in my country so in some ways it shows the consumer is being exploited.  Look how much of that gas price is taxes, most EU countries have a 40% to 60% tax in the final price, and i'm not talking about VAT.There is mandatory minimum of 0.33E per liter and Italy has the highest at 60 cents, plus a ton of others.You can look when oil crashed below zero and nobody was buying gas how the prices still kept up because there were mandatory taxes that would make gas still around 1 euro in some countries even if the actual gasoline would be free of charge.Anyhow the China slowdown is cutting demand faster than OPEC can cu production:https://www.nasdaq.com/articles/oil-prices-fall-amid-market-skepticism-of-opecs-intent-to-keep-supply-cutsQuoteChinese refiners' demand for Saudi Aramco crude oil for January is the lowest in five months, people with knowledge of the matter said, as higher-than-expected prices prompted buyers to seek cheaper supply. About 40 million barrels were nominated by Chinese refiners for January loading, down from about 46 million for December, trading sources said, the lowest nominated volume since August.Same for gas demand in Europe as deposits are full and renewables and nuclear are eating on the gas demand more and more:https://www.nasdaq.com/articles/europe-gas-prices-fall-on-milder-weather-stronger-windQuoteDutch and British wholesale gas prices fell on Monday morning on expectations of higher temperatures and wind generation, as well as steady liquefied natural gas (LNG) and Norwegian pipeline supplies. The contract for January at the Dutch TTF hub TRNLTTFMc1 fell by 2.53 euros to 36.10 euros per megawatt hour (MWh) by 0855 GMT, its lowest level since Oct. 6, LSEG data showed. Meanwhile, French nuclear availability is expected to rise to 51 gigawatts (GW) by Wednesday from around 45 GW, data from LSEG showedSo it's December, a colder than usual one and still the prices of gas are falling.And some morons still scream crisis!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "spectre71",
      "created_time": "December 11, 2023, 04:19:59 PM",
      "body": "Well.....Iran doesn't mess around on the Straits of Hormuz because they are smart.They don't mess around because the Dwight D. Eisenhower and it's merry band of bandidos are sitting there.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ucy",
      "created_time": "December 13, 2023, 10:26:20 AM",
      "body": "Well, the global economic situation and other foreign affairs are beyond what the leaders of the world can control and their intrigues won't help them much if they are doing things that should not be done. When things especially foreign related ones are not going your way as nation it's most likely because you are part of nations, regions etc that are trying to bring about a system that tries to weaken sovereign nations to enable you have more control over them as a foreign force. You don't force or trick people to be part of you in order to rule over them. And you need to respect their boundaries in similar manner. If they don't have right to freely live in your community as part of a union or citizens then you may need to get ready to start buying their natural resources which probably is supposed to be shared amongst the union members. You may also need to start obtaining stuff like visa before coming into their regions. So, alots of the current global activities revolve around this. If a nation, region or any part of the world is suffering or not, then check to see if the nation is going against or not against what I listed above and you may be shocked what you see. If oil price is low or high, check to see who it benefits or don't benefit and that may give you clue what is going on behind the scene. Intrigues won't help anyone who crosses the red lines.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DrBeer",
      "created_time": "December 14, 2023, 12:28:46 PM",
      "body": "Looks like someone's dreams are crumbling just like gas prices LONDON, Dec 12 (Reuters) - Wholesale gas prices in the Netherlands and Britain fell on Tuesday morning, with the benchmark Dutch contract slipping to an 11-week intraday low in trading amid forecasts of warmer weather. Quotes are also being influenced by high liquefied natural gas supplies.January gas futures in the Dutch TTF hub fell by 2.33% to 35.65 euros per megawatt-hour by 13:36 MSC. The February contract was down 0.41 euros to 36.34 euros/MWh by 12:47 MSC.The price of gas with next-day delivery at TTF fell by 2.22% to 35.3 euros per megawatt-hour by 12:49 MSC.The price of gas with \"tomorrow\" settlement in the UK by 13:29 MSC fell 0.86% to 86.75 pence per therm, with \"immediate delivery\" by 13:35 MSC - fell 1.14% to 87 pence per therm.UK gas futures for delivery next month lost 1.7% to trade at 88.6 pence per therm.\"Fresh weather forecasts suggest that normal or slightly above seasonal temperatures are expected through early January, which will help temper market worries,\" consultancy Auxilione said in a morning note.European gas storage facilities are more than 90 percent full - suggesting Europe will emerge from the winter period with significant gas reserves, Auxilione analysts said.According to EnergyScan analysts, gas supplies remain at a stable high level, while significant exports of Norwegian fuel, high volumes of shipments from LNG terminals and the expected increase in capacity at French nuclear power plants in the coming days are likely to put pressure on short-term contracts.https://www.moscowtimes.ru/2023/12/12/tseny-na-gaz-v-evrope-idut-vniz-vvidu-myagkoy-pogody-stabilnykh-postavok-spg-a115894",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "serveria.com",
      "created_time": "December 14, 2023, 08:06:43 PM",
      "body": "Quote from: stompix on December 05, 2023, 04:20:01 PMYou know, that shit that brings propaganda to a halt usually!And a FACT is THIS:Despite all that madness in the middle east, despite OPEC trying to cut 2 milllion barrels of oil of production the price goes down. And why is that?That's probably because oil prices tend to fluctuate. After the last year's top this is a correction caused by many factors including the ones you mentioned in your post.Quote from: stompixLet's  go step by step and debunk all that propaganda:First the oil consumption!This is actual the funny stuff, you know, when you take a bad situation for somebody and then you ignore completely the implications of that.So propaganda will tell you everything about Europe freezing, not affording fuel, 1860% of the business closing, industry production going down by 900%, mathematically impossible stuff like that but at the same time, they completely ignore that if that would happen, then there would be no demand for oil, right?By not providing sources and just some unreal looking numbers your post in fact looks like propaganda. Of course, you're exaggerating for propaganda reasons, but that's reality, it's happening. Every day you can see articles about restaurants, pubs, stores closing. If the reason is mentioned it's mostly gas/electricity/fuel bills. That's reality, Europeans are facing it every day. Of course, nobody is freezing to death but people are forced to save as much as they can. It's not funny at all. Quote from: stompixAnother painful chapter for OPEC and other countriesUS has hit a new oil production record:https://www.axios.com/2023/12/05/us-oil-production-recordCanada is doing the same:Canada steps up pace of oil production growth, seen rising 8% in two yearsThis was totally expected. The US were spending their oil reserves intensively and right now they are at all time lowest. As they can't use their reserves anymore and they don't want to revoke sanctions the only thing left is to start producing themselves. US have huge oil deposits and up to this day they preferred to buy instead of using up these resources (probably for strategic reasons). Quote from: stompixBut you know who the real loser is in this situation? And this is the real sad part and a classic story of pure betrayal!The ones that were promised backing to gain independence and when shit hit th fan they were thrown to the dogs, while Iranian and other middle east countries boast about their support for Palestine, nobody is doing a thing, not a single one, all they do is chant support while not doing one thing! And I'm not going to even think of considering 10 trucks of food doing something, that's less that our hyperstore gets on a regular day, rather than help I would call that sadism.Hmm this sounds familiar. Let me tell you about betrayal on a much bigger scale... Ukraine is not getting any further support from the US this year. EU countries claim they have no armaments left they could send to Ukraine. Nobody is blaming them and nobody is saying they betrayed Ukraine. While many countries actually support Palestine: Turkey, UAE, Qatar, Jordan and Tunisia, Egypt, India. Not sure what are the 10 trucks you mentioned (perhaps in one day?) but shortly after Israeli war criminals started slaughtering children in Gaza at least 8 planes full of humanitarian aid arrived to Egypt. At least 200 trucks were located at the border waiting for Israel to permit entrance.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DrBeer",
      "created_time": "December 14, 2023, 09:23:14 PM",
      "body": "As you know - the UN COP28 climate summit is taking place in Dubai.Yesterday can already go down in history as the day when people made one of the most important decisions: About 200 countries gathered at the United Nations summit adopted a plan to develop renewable energy and move away from coal, oil and gas !\"Let's finalize what we started. Our final agreement has for the first time in history a speech about fossil fuels.  We are now united in a common endeavor to divest from fossil fuels\" - also calling the signed agreement historic, COP28 President Sultan Al Jaber said.Yes, it should be noted, this is \"not an executive order\" or \"enforceable law.\" It is an agreement of the developed countries of the world, and the main goal is to reduce the negative impact of fossil hydrocarbons on the environment and climate.  In addition, about 20 countries have signed a treaty on almost 3-fold increase of nuclear energy generation until 2050.Quote from: serveria.com on December 14, 2023, 08:06:43 PMHmm this sounds familiar. Let me tell you about betrayal on a much bigger scale... Ukraine is not getting any further support from the US this year. EU countries claim they have no armaments left they could send to Ukraine. Nobody is blaming them and nobody is saying they betrayed Ukraine. I'm sure - 2024 will give you an unforgettably strong feeling of the deepest dissonance between your dreams and reality !",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "December 15, 2023, 12:48:56 PM",
      "body": "Quote from: serveria.com on December 14, 2023, 08:06:43 PMThat's probably because oil prices tend to fluctuate. After the last year's top this is a correction caused by many factors including the ones you mentioned in your post.So despite Russia selling oil to China and starving Europe of energy , Iran closing all the straights in the world with their mighty navy, oil is going down?How is that oil at $300 coming?Quote from: serveria.com on December 14, 2023, 08:06:43 PMBy not providing sources and just some unreal looking numbers your post in fact looks like propaganda. Of course, you're exaggerating for propaganda reasons, but that's reality, it's happening. Every day you can see articles about restaurants, pubs, stores closing. Sauce?Spanish restaurants to reach 28 billion euros by 2023In 2023, the UK eating out market is set to witness a value increase of +4.6%, France is recovering nicely with France tourism growing by 12.3% In Q1 2023.Christmas: arrivals of foreign tourists in Italy increase by 17 percentBtw, you know that pizza place that claimed in 2022 it was going to shut down because it got a 500% increase in energy bill?https://tvmnews.mt/en/news/in-italy-places-energy-bill-of-e4000-in-show-window-has-to-charge-pizza-margherita-at-e10-or-face-closure/Guess what, is still open and has a Christmas special menu!https://maps.app.goo.gl/Q9M8TmpA75y5J7Vp9Quote from: serveria.com on December 14, 2023, 08:06:43 PMThis was totally expected. The US were spending their oil reserves intensively and right now they are at all time lowest. As they can't use their reserves anymore and they don't want to revoke sanctions the only thing left is to start producing themselves. The US sold their reserves at over $90.They've just bought at $75 and are currently refilling them.So they made more profit than ever and bought the price down, quite the strategic move compared to the putler fiasco!QuoteThe department has bought back nearly 9 million barrels for the reserve at about $75 a barrel. It has also secured the return of nearly 4 million barrels by February, several months ahead of schedule, from a previous exchange with oil companiesQuote from: serveria.com on December 14, 2023, 08:06:43 PMWhile many countries actually support Palestine: Turkey, UAE, Qatar, Jordan and Tunisia, Egypt, India.Egypt:https://www.theguardian.com/world/2023/nov/02/why-egypt-has-not-fully-opened-its-gaza-border-for-fleeing-palestinhttps://www.nytimes.com/2013/02/21/world/middleeast/egypts-floods-smuggling-tunnels-to-gaza-with-sewage.htmlIndia:https://twitter.com/narendramodi/status/1710614655620534296?lang=enQuoteDeeply shocked by the news of terrorist attacks in Israel. Our thoughts and prayers are with the innocent victims and their families. We stand in solidarity with Israel at this difficult hour.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hispo",
      "created_time": "December 16, 2023, 05:34:33 PM",
      "body": "Sure, one does not need to be a genius to realize the OPEC has lose much if its influence in the market compared to what it used to be back in the 2000s and the 2010s, when the barrel of oil stayed over 100$ per unit. Beside of the increasing production of the United States and other nations which do not dance at the rhythm of the oil cartel. We could effectively argue that the panic of energy crisis goes a little bit exaggerated for the sake of supporting the narrative of the clean and renewable energies being the future of energy, which would make sense if you consider that the average people nowadays do not even care for policies which face changes on the planet beyond their own lifespan. I still believe green energy development is important, though, but the truth is never supposed to be sacrificed in favor of any objective, not matter what side of the story is. As a Venezuelan, by the way, I believe the United States would like our corrupted government to be replaced with one which would quit the OPEC and also increase our dying local production, it is ironic how we have got so much oil and yet our production is so low we do not hold any impact over the market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "serveria.com",
      "created_time": "December 16, 2023, 08:27:07 PM",
      "body": "Quote from: stompix on December 15, 2023, 12:48:56 PMSauce?Spanish restaurants to reach 28 billion euros by 2023In 2023, the UK eating out market is set to witness a value increase of +4.6%, France is recovering nicely with France tourism growing by 12.3% In Q1 2023.Christmas: arrivals of foreign tourists in Italy increase by 17 percentSo what does it prove? Did you at least read the articles? For example, the article on French tourism says that tourism is experiencing growth of 12.3% but only after dropping 61% previously! Which makes a total growth of \"-48.7%\" Great success!    Btw, none of these articles is related to energy crisis, mostly they're telling us about covid consequences.   Quote from: stompixBtw, you know that pizza place that claimed in 2022 it was going to shut down because it got a 500% increase in energy bill?https://tvmnews.mt/en/news/in-italy-places-energy-bill-of-e4000-in-show-window-has-to-charge-pizza-margherita-at-e10-or-face-closure/Guess what, is still open and has a Christmas special menu!https://maps.app.goo.gl/Q9M8TmpA75y5J7Vp9So, you admit there was a 500% increase? How come? Energy is only getting cheaper!  Quote from: stompixThe US sold their reserves at over $90.They've just bought at $75 and are currently refilling them.So they made more profit than ever and bought the price down, quite the strategic move compared to the putler fiasco!QuoteThe department has bought back nearly 9 million barrels for the reserve at about $75 a barrel. It has also secured the return of nearly 4 million barrels by February, several months ahead of schedule, from a previous exchange with oil companiesIt probably was a clever move if true, I can't say as I see no link to source. And frankly, I can't see Putin's fiasco so far: he's not isolated from the rest of the world, keeps selling oil and gas and whatever else, and he's winning the war.  Quote from: serveria.com on December 14, 2023, 08:06:43 PMWhile many countries actually support Palestine: Turkey, UAE, Qatar, Jordan and Tunisia, Egypt, India.Egypt:https://www.theguardian.com/world/2023/nov/02/why-egypt-has-not-fully-opened-its-gaza-border-for-fleeing-palestinhttps://www.nytimes.com/2013/02/21/world/middleeast/egypts-floods-smuggling-tunnels-to-gaza-with-sewage.htmlIndia:https://twitter.com/narendramodi/status/1710614655620534296?lang=enQuoteDeeply shocked by the news of terrorist attacks in Israel. Our thoughts and prayers are with the innocent victims and their families. We stand in solidarity with Israel at this difficult hour.Yes, it was apparently initial reaction on HAMAS attacks. He had to say something as a PM. QuoteWhich countries have sent aid to Gaza?At least eight planes carrying aid from Turkey, the United Arab Emirates, Qatar, Jordan and Tunisia have landed at El Arish International Airport in Egypt’s Sinai Peninsula.India has sent medical and disaster relief to El Arish on Sunday.Source: https://www.aljazeera.com/news/2023/10/23/which-countries-have-sent-aid-to-gaza-so-far",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Captain Corporate",
      "created_time": "December 16, 2023, 09:35:07 PM",
      "body": "I rather not discuss about the \"west vs east\" argument that you guys are having right now, that amounts to absolutely nothing, westerners will say west is awesome and doing awesome and east is doomed, easterners will say east is doing awesome and nothing is wrong and west is doomed, that's always been the case and none of you will ever reach to any conclusion and will just argue for days and days until you find another topic and will continue to discuss there. However, on the topic of energy bill, I can say that it is definitely getting lower, that's quite true, from gas to our car to heating to our homes, I can only talk about what I am seeing, both my own bill, and when you check the data, you can see the prices, they are down, look at it 5 years ago and look at it now and see that its not really too far off, even from pre-pandemic period as well. The famous 2020 to 2022 period had some WILD moves, I have seen it be literally minus, which is more than even free, people were literally paying others to get rid of their oil, think about how \"free\" it is, that's not really your concern though, it wasn't for people like us, we are talking about companies, but we have seen 100+ too and that was insane, everything started to cost a lot, it was like %5 of my salary to fill my car up to full, that's just not normal.Now? Now it looks \"normal\", its not cheap, its not expensive, its really nothing to talk about, its just normal and I am fine with that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DrBeer",
      "created_time": "December 18, 2023, 09:05:11 PM",
      "body": "Quote from: Captain Corporate on December 16, 2023, 09:35:07 PMI rather not discuss about the \"west vs east\" argument that you guys are having right now, that amounts to absolutely nothing, westerners will say west is awesome and doing awesome and east is doomed, easterners will say east is doing awesome and nothing is wrong and west is doomed, that's always been the case and none of you will ever reach to any conclusion and will just argue for days and days until you find another topic and will continue to discuss there. However, on the topic of energy bill, I can say that it is definitely getting lower, that's quite true, from gas to our car to heating to our homes, I can only talk about what I am seeing, both my own bill, and when you check the data, you can see the prices, they are down, look at it 5 years ago and look at it now and see that its not really too far off, even from pre-pandemic period as well. The famous 2020 to 2022 period had some WILD moves, I have seen it be literally minus, which is more than even free, people were literally paying others to get rid of their oil, think about how \"free\" it is, that's not really your concern though, it wasn't for people like us, we are talking about companies, but we have seen 100+ too and that was insane, everything started to cost a lot, it was like %5 of my salary to fill my car up to full, that's just not normal.Now? Now it looks \"normal\", its not cheap, its not expensive, its really nothing to talk about, its just normal and I am fine with that.One question is what is the relationship between migration flows from East to West and from West to East. From which “camp” is the flow of migrants greater? I’ll say right away that it’s unlikely that anyone will say that people are fleeing from the countries of the developed West to the countries of the “east”. People travel to the countries of the developed West (EU, USA, Canada,...) from ALL corners of the world, knowing how much more comfortable it REALLY is to live there and how much more opportunities there are. At the same time, there are only isolated cases with the opposite direction of migration... Facts and figures of migration flows are the best proof and description of reality.Regarding energy resources, this is a market, and again this is the developed West, which is trying to make conditions more comfortable. Including from the point of view of a balanced price for electricity and gas, for households - because These are citizens of the country for whom the state is obliged to take care. At the same time, the state chooses a reasonable solution - not to compensate or make subsidies, burdening the budget, but to change inadequate suppliers and schemes for supplying the necessary resource. And the problem was solved GLOBALLY. This is one of the advantages of the Western approach to problem solving.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sithara007",
      "created_time": "December 19, 2023, 07:28:50 AM",
      "body": "Hmm... by now the OPEC should have realized this. New technology has helped non-OPEC nations to increase their crude output. Oil production is no longer dominated by the GCC and CIS nations. For example, USA is the top crude oil producer in the world, and they replaced Saudi Arabia from this spot recently. Anyway, global crude oil consumption has peaked due to rising share of EVs. Here in India, almost 10% of the domestic vehicles in my area are EVs and the share is rising steeply with each passing year. If OPEC+ cuts down on their output, it will not have any impact on the global prices. Only result would be that they will lose their market share to other countries such as Guyana and Canada.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DrBeer",
      "created_time": "December 19, 2023, 08:02:57 AM",
      "body": "Quote from: Sithara007 on December 19, 2023, 07:28:50 AMHmm... by now the OPEC should have realized this. New technology has helped non-OPEC nations to increase their crude output. Oil production is no longer dominated by the GCC and CIS nations. For example, USA is the top crude oil producer in the world, and they replaced Saudi Arabia from this spot recently. Anyway, global crude oil consumption has peaked due to rising share of EVs. Here in India, almost 10% of the domestic vehicles in my area are EVs and the share is rising steeply with each passing year. If OPEC+ cuts down on their output, it will not have any impact on the global prices. Only result would be that they will lose their market share to other countries such as Guyana and Canada. All the OPEC+ fiddling around trying to screw the world will only result in their revenues falling, while the US will increase its profits and earn \"thanks to the efforts of OPEC+\", as was already the case recently. It is not excluded a variant as it was in the 80s, when Saudi Arabia realizing that all \"production cuts\" and \"embargoes\" lead to one-time benefits but long-term losses, will start pumping oil again, trying to fill its budget. This will lead to a chain reaction and oil at 10 dollars per barrel will look very attractive to oil producing countries PS Chinese economy is withering and shrinking, as evidenced by many indicators. And China was one of the countries that formed the key demand for oil. Now China can buy cheap oil from its raw material appendage, but ... China doesn't need that much oil anymore....",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}