{
  "id": "topic_5493196",
  "title": "we-btc",
  "author": "we-btc",
  "created_time": "April 17, 2024, 01:26:41 PM",
  "content": "I ask this question because I wonder what Bitcoin will become now that the financial institutions and meme coin advocates have taken over.If Bitcoin is not peer-to-peer electronic cash then how do you see it?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5493196",
  "comments": [
    {
      "author": "Oshosondy",
      "created_time": "April 17, 2024, 01:34:05 PMLast edit: April 17, 2024, 05:35:23 PM by Oshosondy",
      "body": "Quote from: we-btc on April 17, 2024, 01:26:41 PMI ask this question because I wonder what Bitcoin will become now that the financial institutions and meme coin advocates have taken over.Financial institutions and meme coins have taken over? Why are you comparing financial institutions with bitcoin? But if you are comparing bitcoin with meme coins, add the marketcap of all existing meme coins together, divide the marketap of bitcoin by 5, all the meme coin marketcap is not worth one fifth of bitcoin marketcap.Quote from: we-btc on April 17, 2024, 01:26:41 PMIf Bitcoin is not peer-to-peer electronic cash then how do you see it?Your question has no sense. You are saying bitcoin is not what it is.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Churchillvv",
      "created_time": "April 17, 2024, 01:37:49 PM",
      "body": "Who said bitcoin is not longer digits cash? Is it because we are seeing a lot of people using bitcoin more as an investment? Personally, no matter what happens in the market it doesn't change the nature of bitcoin, bitcoin still remains a digital cash for payments purposes and also an asset that can be used as alternative for physical investments or for privacy focus investment. The volatility of bitcoin has not changed it's initial purpose it's only crested another opportunity for the everyday opportunist to captivate on it and make cool profits especially in a long term.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "April 17, 2024, 01:42:19 PM",
      "body": "Quote from: we-btc on April 17, 2024, 01:26:41 PMI ask this question because I wonder what Bitcoin will become now that the financial institutions and meme coin advocates have taken over.If Bitcoin is not peer-to-peer electronic cash then how do you see it?Bitcoin is and probably will always be a digital cash.We use it daily in this forum in the service board, just take a look.https://bitcointalk.org/index.php?board=52.0Basically anything you can do online someone is paying in bitcoin somewhere.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Plaguedeath",
      "created_time": "April 17, 2024, 01:51:07 PM",
      "body": "I don't understand why people like @OP is forcing Bitcoin must be used as a currency when the founder itself says Bitcoin can be like a commodity?I'm glad to see Bitcoin is a decentralized currency and we have a freedom to choose, not necessary to follow what people think/says if Bitcoin must be used as a currency, as a commodity, as a money laundry tool etc.Quote from: satoshi on August 27, 2010, 04:39:26 PMBitcoins have no dividend or potential future dividend, therefore not like a stock.More like a collectible or commodity.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husires",
      "created_time": "April 17, 2024, 02:05:41 PM",
      "body": "Look for stores that accept meme coin as a means of payment compared to Bitcoin, and you will find that their number is limited. Unlike Dogecoin, all meme coins are bubbles whose price is inflated to deceive new investors.Institutional investors buy Bitcoin, but you can still buy Bitcoin and use it to make peer-to-peer payments, so nothing has changed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mauser",
      "created_time": "April 17, 2024, 02:13:13 PM",
      "body": "Quote from: we-btc on April 17, 2024, 01:26:41 PMI ask this question because I wonder what Bitcoin will become now that the financial institutions and meme coin advocates have taken over.If Bitcoin is not peer-to-peer electronic cash then how do you see it?I don't understand, why is bitcoin not cash anymore? As far as I know you can still trade bitcoin into a large number of fiat and crypto coins, which means it's still cash. Just because a large number of institutional investors are using now bitcoin as a form of investment doesn't mean it's not digital cash anymore. Just look at Switzerland for example a very small country with a powerful currency. There are so many traders and investors that hold CHF as investment and would never use it as cash. Still nobody would argue that the Swiss franc is not cash anymore. Bitcoin can be cash, asset and investment at the same time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Upgrade00",
      "created_time": "April 17, 2024, 02:15:07 PM",
      "body": "Quote from: we-btc on April 17, 2024, 01:26:41 PMIf Bitcoin is not peer-to-peer electronic cash then how do you see it?As P2P electronic cash which is precisely what it is and has always been. Meme coins and other altcoins are products of bitcoin's existence and doesn't change how Bitcoin functions. Financial institutions existed before Bitcoin but also doesn't affect how Bitcoin functions.You probably have your head deep into the meme coin market that you think that's the reality everywhere else.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ChiBitCTy",
      "created_time": "April 17, 2024, 02:41:36 PM",
      "body": "Quote from: we-btc on April 17, 2024, 01:26:41 PMI ask this question because I wonder what Bitcoin will become now that the financial institutions and meme coin advocates have taken over.If Bitcoin is not peer-to-peer electronic cash then how do you see it?Who's to say it's not?  Who gets to decide that?  I still believe that bitcoin is digital cash and that bitcoin still has the potential to be  a much better form of payment, or digital cash, if you will.  I think that it's important for the maturation and adoption for bitcoin to act as such.  Perhaps I am wrong but this is a hill that I've been standing on for a long time and don't plan to get off of anytime soon.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Faisal2202",
      "created_time": "April 17, 2024, 02:45:21 PM",
      "body": "Quote from: we-btc on April 17, 2024, 01:26:41 PMI ask this question because I wonder what Bitcoin will become now that the financial institutions and meme coin advocates have taken over.If Bitcoin is not peer-to-peer electronic cash then how do you see it?As a source to store value, just like gold but it's a digital gold, As far as I have seen, not so many people used BTC as digital cash, they used it as digital gold, and then made different types of investments in it, some are long term and some are short term (trading). But still, besides this use-case, it did not lose its peer-to-peer electronic cash characteristic. As its infrastructure is still the same, what changes is, its use case.As how people are utilizing it, many people are even utilizing fiat cash as a store of value as well, for example, the dollar is being used to store the value of funds for a longer period of time. I still see it as Peer-to-peer cash and digital gold, I can use it for my daily buying and selling, and I have the option to hold it for eternity.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ojima-ojo",
      "created_time": "April 17, 2024, 02:49:31 PM",
      "body": "Quote from: we-btc on April 17, 2024, 01:26:41 PMI ask this question because I wonder what Bitcoin will become now that the financial institutions and meme coin advocates have taken over.If Bitcoin is not peer-to-peer electronic cash then how do you see it?I think the bigger question should be what the role of memecoins in the cryptocurrency ecosystem?Have memecoins becomes widely accepted?Are their used as electronic cash as you assume?Haven't bitcoin stood on it own outside of institutional involvement?What the role of financial institutions in cryptocurrency and bitcoin?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "peter0425",
      "created_time": "April 17, 2024, 03:01:18 PM",
      "body": "Quote from: we-btc on April 17, 2024, 01:26:41 PMI ask this question because I wonder what Bitcoin will become now that the financial institutions and meme coin advocates have taken over.If Bitcoin is not peer-to-peer electronic cash then how do you see it?I feel like bitcoin can only be two things: a decentralized payment method or a valuable investment It’s either one or the other. I don’t think they can be exclusive necessarily if bitcoin were to become strictly a peer to peer method then there should be some ways for it to be actually accessible. But since many are treating bitcoin as a mere investment only, bitcoin can not now be transferred as easily as we would have liked.It’s definitely not fiat and it would not become one even years after.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "April 17, 2024, 03:02:18 PM",
      "body": "Quote from: Ojima-ojo on April 17, 2024, 02:49:31 PMHave memecoins becomes widely accepted?Since Dogecoin has no smart contracts and no ordinals on the chain, seems like it shouldn't be as a surprise to anyone that cheap fees and acceptance everywhere have made it top sometimes by 4 to 5 times the transactions on Bitcoin.Even on this forum that starts with \"bitcoin\" people end up dealing in doge, ltc and usdt because of fees, you can see the usage washing away.Quote from: ChiBitCTy on April 17, 2024, 02:41:36 PMWho's to say it's not?  Who gets to decide that? The ones using it.And if more are using it as an investment on a CEX slowly it's losing it's p2p currency tag.After all, let's be real, even here, what's the majority looking at it for, a currency or an investment, imagine how the majority looks outside specialized themed forums or sub reddits.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "buwaytress",
      "created_time": "April 17, 2024, 03:03:06 PM",
      "body": "What do you mean by taken over? They may have taken over your media space, but certainly not mine.I \"got\" into Bitcoin in 2016 p2p. I'm still doing p2p now, it simply makes sense for me to use the network I've trusted (and who trusts me). I still have to scramble for a different wallet each time someone wants some other currency, Bitcoin's simply the easiest for me, the one I trust in the most, the one I know will always have a willing buyer wherever I travel.I don't know if that circle ever really did shrink. It's just other circles have grown. But the premise of digital cash has never lost its meaning for a lot of people.Edit: just saw stompix's post above mine and I agree, in the real world, everyone else might see Bitcoin differently, but I still tend to think those like me who found Bitcoin as a solution to every day problems like cross-border payments and remittances still see Bitcoin serve the same purpose. Yes, a lot more people I know online ask for payment in doge, ltc etc. But these are people who see and use crypto as cheaper alternatives to debit card or bank deposits for, say, gambling. Crypto was never a solution for them but a better alternative.Outside of CEX, I couldn't sell doge/ltc/eth as easily as Bitcoin where I travel or need to send money to, it's been that way since 2016.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Z-tight",
      "created_time": "April 17, 2024, 03:03:38 PM",
      "body": "BTC is a digital currency, meme coins haven't taking over anything, it is just a pump and dump tool for trading. BTC is p2p electronic cash and you can spend it because it is fungible and is a medium of exchange. You should provide more details in your post, because the little you did provide does not make much sense and is incorrect.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "YOSHIE",
      "created_time": "April 17, 2024, 03:09:23 PM",
      "body": "Quote from: we-btc on April 17, 2024, 01:26:41 PMI ask this question because I wonder what Bitcoin will become now that the financial institutions and meme coin advocates have taken over.How did you think to compare Meme coins with Bitcoin, don't mix jokes or silly cryptocurrencies with the concept of decentralization, that's a different story, There is no influence of financial institutions with Bitcoin, for example financial institutions completely adopt meme coins circulating in the crypto market.Whether it's an idea or a trick to destroy Bitcoin by financial institutions by taking over the online joke, no problem just tell them to take all those stupid Cryptocurrencies, remember, Bitcoin has often eaten salt, this is not the first thing for certain institutions to tear apart Bitcoin, the fact is that Bitcoin is increasingly developing and advancing, remember Meme coins are just memes, not the same as Bitcoin which has certainty or is innovative in the development of Cryptocurrency.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kryptqnick",
      "created_time": "April 17, 2024, 03:50:55 PM",
      "body": "Financial institutions and meme coin advocates taking over is just an opinion, and it's not even supported by any evidence by the op, which is unfortunate. Which financial institutions are we talking about? Is it about the ETFs? They exist now, but that doesn't exclude Bitcoin in its pure decentralized form. As for meme coins, I've honestly not heard people defending them or talking seriously about them for a while.Bitcoin is still digital cash, or at least it's still a part of what Bitcoin is. Sure, sometimes it's a more viable option and sometimes less, but overall, it still works as intended.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "we-btc",
      "created_time": "April 17, 2024, 03:55:53 PM",
      "body": "Quote from: Z-tight on April 17, 2024, 03:03:38 PMBTC is a digital currency, meme coins haven't taking over anything, it is just a pump and dump tool for trading. BTC is p2p electronic cash and you can spend it because it is fungible and is a medium of exchange. You should provide more details in your post, because the little you did provide does not make much sense and is incorrect.Ordinals and Runes have taken over the news cycle.  They have also congested the network and increased the fees to a level that Bitcoin is no longer a valid currency.  When it costs $10 to $30 USD to send and receive Bitcoin in 10 minutes it is no longer an efficient currency.  It is cheaper to use almost any other fiat currency or credit vehicle like Visa.Most people are buying bitcoin through 3rd parties like exchanges and ETFs and if people are using a 3rd party node instead of hosting their own node it is not a peer-to-peer transaction. All of these Bitcoin transactions are benefiting the 3rd party intermediaries and it is equivalent to the system we currently have.Wall street is attempting to use blockchains like Bitcoin to create securities that financial institutions can easily monetize.All the while no one is working to make Bitcoin a more suitable peer-to-peer digital cash system. It is getting slower and more expensive.In addition most people I hear from are okay with the transition of Bitcoin as an investment especially Wall street.All of these reasons lead to my question: If Bitcoin is not peer-to-peer digital cash then what?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Marvelman",
      "created_time": "April 17, 2024, 04:14:20 PM",
      "body": "Quote from: we-btc on April 17, 2024, 03:55:53 PMIf Bitcoin is not peer-to-peer digital cash then what?Bitcoin's still peer-to-peer digital cash to me, and likely to millions of other folks across the globe.  The high fees are temporary while developers try to expand the system (like Lightning Network) so it can process more payments efficiently.  For small everyday buys, you've got a point - there are probably better choices currently.  But Bitcoins great for larger transfers where normal finance can be slow and pricey and  plus Bitcoin's still the most widely accepted digital currency and most secure payment network out there.  That part hasn't changed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pmalek",
      "created_time": "April 17, 2024, 04:14:27 PM",
      "body": "Bitcoin can be whatever you want it to be. Who cares what the minority or majority uses it for. Surround yourself with likeminded people who use and think of Bitcoin the same way you do. I understand your frustrations, though. Bitcoin is currently not a useful type of digital cash, with mining fees as high as they are. I would rather have the Ordinal monkeys gone and have them spam other blockchains, but we can't always have what we want. Even with the current state, Bitcoin is cheap for international transactions compared to fiat via banks and with a much faster settlement.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}