{
  "id": "topic_5405376",
  "title": "zasad@",
  "author": "zasad@",
  "created_time": "July 06, 2022, 10:47:37 AM",
  "content": "https://coingape.com/big-boost-for-cryptocurrencies-as-us-fed-panel-gives-its-nod/Sensational Push For Cryptocurrencies As US Fed Panel Gives Its Nod\"In a surprising development, a panel of speakers hosted by the U.S. Federal Reserve had on Tuesday gave a big boost for the cause of cryptocurrencies. They recommended that crypto assets be allowed to flourish in the U.S. economy as it would further strengthen the dollar’s status. The Fed cryptocurrencies discussion gave rise to some interesting observations.\"",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5405376",
  "comments": [
    {
      "author": "Lucius",
      "created_time": "July 06, 2022, 12:57:00 PM",
      "body": "I have not read anywhere in the article that anything other than CBDC and stablecoins is explicitly mentioned, so I do not think that Bitcoin could benefit from this. It seems to me that the point of the whole story is that someone agreed that CBDC or digital $ could have a positive impact on the US economy. In other words, let's use what we can have under our control, and try to distract people from what we can't fully control.QuoteThe panel members said the usage of cryptocurrencies, especially the CBDCs, could strengthen U.S. dollar’s role in the international market. On the regulatory side, the services offered around crypto assets should be linked to the dollar, they suggested. Last month, Fed Chair Jerome Powell spoke about the rapid growth in cryptocurrencies and stablecoins. In light of the tremendous growth in crypto-assets and stablecoins, the Fed is examining the usage of CBDCs, he said.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "July 06, 2022, 02:06:32 PM",
      "body": "Personally, I do not expect the current administration of the US Federal Reserve to take any positive step with regard to Bitcoin, and therefore I do not expect a regulatory push or any direction for that.I did not read the article, but it seems that we are talking about central CBDC, not Bitcoin.The best we can see in this regard is Bitcoin ETF, who does not seem to be approved any time soon.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "July 06, 2022, 02:30:54 PM",
      "body": "Quote from: hugeblack on July 06, 2022, 02:06:32 PMThe best we can see in this regard is Bitcoin ETF, who does not seem to be approved any time soon.Futures BTC ETFs have already been approved in the US, but this is something completely different from what companies like Grayscale or VanEck are looking for, which is a spot ETF. The SEC still firmly defends its position and does not approve any request for such an ETF, and this is understandable if we consider that the policy is going in the direction of CBDC and stablecoins, and any approval of such a way of investing in Bitcoin would only give even more legitimacy to BTC, which some obviously want to avoid, or at least to prevent as long as possible.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "July 06, 2022, 03:30:29 PM",
      "body": "Quote from: Lucius on July 06, 2022, 12:57:00 PMI have not read anywhere in the article that anything other than CBDC and stablecoins is explicitly mentioned, so I do not think that Bitcoin could benefit from this. Well technically, both of them are cryptocurrency so that would be an excuse for such a clickbaitish title..Anyhow, the rest of the article is pretty much garbage and the obvious thing about it is that they link older articles of their own in order to boost the credibility of the story, so it's just recycled news with little to no meaning.If we go to the original document:https://www.federalreserve.gov/econres/notes/feds-notes/the-feds-inaugural-conference-on-the-international-roles-of-the-us-dollar-20220705.htmthe sensational push becomes a pull, since the only time cryptos are mentioned in in this context:QuoteAsani Sarkar and Jiakai Chen focus on digital assets and argue that part of the demand for some cryptocurrencies, like Bitcoin, is driven by the desire to evade capital controls. Using information for China, the research shows persistent and statistically significant differences between Bitcoin prices in multiple exchanges and that it trades at a premium on Chinese exchanges relative to foreign exchanges.How such an attitude is positive for BTC is beyond me.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "avikz",
      "created_time": "July 06, 2022, 05:18:25 PM",
      "body": "I believe it's a clickbait. FED had discussed about stablecoins and CBDCs and not about any other market leading cryptos loke Bitcoin or ETH. Otherwise, the below statement doesn't make sense,Quote“Digital assets could actually reinforce the dollar’s role in the international market over the medium run. This could be done if new sets of services structured around these assets are linked to the dollar.”Traditional cryptocurrency is actually challenging the dollar dominance. Fed is probably planning to bring dollar backed stablecoins or CBDC which will provide convenience to the international traders. FED can't become bullish about cryptos all of a sudden.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fiulpro",
      "created_time": "July 06, 2022, 06:07:04 PM",
      "body": "Just on 19th April 2022, they stated how cryptocurrencies might need more ' regulations '. They still believe that they need more rules and regulations for the cryptocurrencies as well. Now they made statements according to only one website where they state how it can lead to strengthening of the us dollar as well, I do think it's high time to realize that, they might need much more than that, they didn't talk about bitcoins seperate. What they said is : Quote Digital assets could actually reinforce the dollar’s role in the international market over the medium run. This could be done if new sets of services structured around these assets are linked to the dollar.” Taken from the source above. Digital assets for them might not be just cryptocurrencies like Bitcoins. They are more concerned with usage of CBDC's",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MArsland",
      "created_time": "July 06, 2022, 06:22:16 PM",
      "body": "Quote from: Lucius on July 06, 2022, 12:57:00 PMI have not read anywhere in the article that anything other than CBDC and stablecoins is explicitly mentioned, so I do not think that Bitcoin could benefit from this. It seems to me that the point of the whole story is that someone agreed that CBDC or digital $ could have a positive impact on the US economy. In other words, let's use what we can have under our control, and try to distract people from what we can't fully control.In essence in the article, The FED encourages CBDC to remain one of the benchmarks in restoring the US economy. Despite mentioning \"Cryptocurrency\", we are still led to the CBDC stablecoin which they can still control. It's really not right to let cryptocurrencies in general be allowed to roam around without centralized monitoring. The initial opinion does seem to attract attention because it connects the crypto community, but the more we read downwards it is the same as only strengthening the digital dollar which is the main topic. The Fed is not going to let things out of their control roam without making a profit.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fortify",
      "created_time": "July 06, 2022, 06:36:54 PM",
      "body": "Quote from: zasad@ on July 06, 2022, 10:47:37 AMhttps://coingape.com/big-boost-for-cryptocurrencies-as-us-fed-panel-gives-its-nod/Sensational Push For Cryptocurrencies As US Fed Panel Gives Its Nod\"In a surprising development, a panel of speakers hosted by the U.S. Federal Reserve had on Tuesday gave a big boost for the cause of cryptocurrencies. They recommended that crypto assets be allowed to flourish in the U.S. economy as it would further strengthen the dollar’s status. The Fed cryptocurrencies discussion gave rise to some interesting observations.\"Maybe the Fed is realizing that Bitcoin is not a threat to the hegemony of the US dollar, because it simply cannot handle anywhere near the amount of transactions required to be a direct competitor. It's starting to see it as a competing currency that is rather limited and inflexible in it's ability, yet embracing it will allow US companies to continue pioneering large companies in the cryptocurrency field. There may be a crypto one day that can supplant the US dollar, maybe it already exists, but this sort of signal suggests that the US central bank is willing to continue with a rather lenient policy about it. A lot of the cheap money that the Fed printed and released was the main driver for Bitcoin reaching it's previous all time high.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gyfts",
      "created_time": "July 06, 2022, 08:00:52 PM",
      "body": "CBDC's aren't crypto currencies and this is exactly what the fed is looking to install, among other central banks with out of control inflation. It centralizes power even further and makes it easier for the banks to control the money supply than the current methods. U.S. government will further regulate Bitcoin in a desperate attempt to save their miserable currency.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hydrogen",
      "created_time": "July 06, 2022, 11:52:38 PM",
      "body": "Quote from: zasad@ on July 06, 2022, 10:47:37 AMThey recommended that crypto assets be allowed to flourish in the U.S. economy as it would further strengthen the dollar’s status. I would be interested to know if it is possible for the dollar to significantly strengthen. Without stabilizing fossil fuel prices and inflation. They're proposing to move all passengers and cargo on the titanic to the stern of the ship to stabilize its nose dive, without plugging the hole.The ship is still sinking but the aesthetics will be better, I guess?Whatever moves they make, I doubt they'll cross a line to being more bitcoin friendly than florida, texas and US states which extend positive regulation towards crypto. Ethos of the central bank have always paralleled new york's approach towards crypto. Which has been to make friendly sounding announcements while cracking down hard behind the scenes, banning stablecoins like tether as new york has done.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gunhell16",
      "created_time": "July 07, 2022, 01:28:30 AM",
      "body": "Quote from: zasad@ on July 06, 2022, 10:47:37 AMhttps://coingape.com/big-boost-for-cryptocurrencies-as-us-fed-panel-gives-its-nod/Sensational Push For Cryptocurrencies As US Fed Panel Gives Its Nod\"In a surprising development, a panel of speakers hosted by the U.S. Federal Reserve had on Tuesday gave a big boost for the cause of cryptocurrencies. They recommended that crypto assets be allowed to flourish in the U.S. economy as it would further strengthen the dollar’s status. The Fed cryptocurrencies discussion gave rise to some interesting observations.\"Quite, innovative and I can't believe it because over the years I have read a lot of news and articles where the situation of bitcoin or cryptocurrency in the U.S. doesn't seem to be getting better, and now in their new administration they have an official who recommended cryptocurrency to help their economy, and it’s also good news to their communities of bitcoin and cryptocurrency enthusiasts. So it can be said if this is a good move and decision that will happen in the U.S. country",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wind_FURY",
      "created_time": "July 07, 2022, 12:15:06 PM",
      "body": "Quote from: zasad@ on July 06, 2022, 10:47:37 AMhttps://coingape.com/big-boost-for-cryptocurrencies-as-us-fed-panel-gives-its-nod/Sensational Push For Cryptocurrencies As US Fed Panel Gives Its Nod\"In a surprising development, a panel of speakers hosted by the U.S. Federal Reserve had on Tuesday gave a big boost for the cause of cryptocurrencies. They recommended that crypto assets be allowed to flourish in the U.S. economy as it would further strengthen the dollar’s status. The Fed cryptocurrencies discussion gave rise to some interesting observations.\"It might be their Trojan Horse for the REAL digital currency that they want to truly \"flourish\", a government-issued CBDC, with all your wallets directly connected to a centralized database that they can see ALL your transactions. It will be programable to block you from making any transaction they don't desire. They can lock/freeze your account without your permission. They control the currency 100%, and therefore control you too.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "July 07, 2022, 01:14:55 PM",
      "body": "Quote from: naira on July 06, 2022, 06:22:16 PMIn essence in the article, The FED encourages CBDC to remain one of the benchmarks in restoring the US economy. Despite mentioning \"Cryptocurrency\", we are still led to the CBDC stablecoin which they can still control. It's really not right to let cryptocurrencies in general be allowed to roam around without centralized monitoring. The initial opinion does seem to attract attention because it connects the crypto community, but the more we read downwards it is the same as only strengthening the digital dollar which is the main topic. The Fed is not going to let things out of their control roam without making a profit. I would not agree that the primary mission is profit, but the preservation of the US $ as the dominant world currency, which is at least one of the constants in all American policies. A country that considers itself the largest democracy, the largest military power and the strongest economy will do everything to keep it that way. I personally think that there will be a much greater chance that firearms will become more difficult to obtain (like, for example, in the EU), than that Bitcoin will ever achieve the status that many dream of in that country.Moreover, if things ever go seriously downhill, I wouldn't be surprised that it would be precisely because of some very negative decision in the US that will have global consequences.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zasad@",
      "created_time": "July 07, 2022, 01:40:47 PM",
      "body": "https://www.coingecko.com/en/categories/stablecoinsUSD Coin (USDC) and Binance USD (BUSD) operate in accordance with the regulations of the US regulators. There has been a lot of gossip about Tether (USDT) about its exposure to real assets. I have not seen a new audit for a long time.https://cryptonews.net/news/defi/8965627/MakerDAO voting on collaborating with a traditional bankHuntingdon Valley Bank (HVB) is an American bank. All control is in the hands of the United States.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ChrisPop",
      "created_time": "July 07, 2022, 04:16:06 PM",
      "body": "Positive declarations about crypto will encourage citizens to adopt Bitcoin. We need to understand that Fed is not likely to make massive steps towards adopting Bitcoin. Even if they might make plans secretly about hoarding Bitcoin as it might become a global reserve currency, they won't disclose it publicly - you don't want other countries to accumulate at these low prices, don't you?I'm not sure about laws and policies, but I think the government should announce if tax payers' money goes towards stacking, crypto right?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "justdimin",
      "created_time": "July 07, 2022, 08:28:28 PM",
      "body": "Quote from: ChrisPop on July 07, 2022, 04:16:06 PMPositive declarations about crypto will encourage citizens to adopt Bitcoin. We need to understand that Fed is not likely to make massive steps towards adopting Bitcoin. Even if they might make plans secretly about hoarding Bitcoin as it might become a global reserve currency, they won't disclose it publicly - you don't want other countries to accumulate at these low prices, don't you?I'm not sure about laws and policies, but I think the government should announce if tax payers' money goes towards stacking, crypto right? This is the right approach. I know that there are many people who will constantly be against crypto and that will continue to happen for a long time. But the reality is that if you keep an eye on bitcoin at all times, then you are going to be doing much better. I know that not many people will promote it, not the famous people who are known by the world a lot, not many Elon Musk type of deals.But this is fine, we do not need that type of people at all times, we should be able to feel proud with what we have and there is no need to do anything exceptional about this situation. As long as we are doing fine, that is fine by us and no need for big names to come.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "2stout",
      "created_time": "July 08, 2022, 05:03:28 AM",
      "body": "Nah, I don't see the fed loosening up anytime time soon, plus they nixed Grayscale's spot bitcoin ETF quite ambiguously.  I believe the fed is trying to set things up to contain or possibly hamstring bitcoin in the very near future and then push their own digital fiat.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Free Market Capitalist",
      "created_time": "July 08, 2022, 07:00:09 AM",
      "body": "Quote from: 2stout on July 08, 2022, 05:03:28 AMNah, I don't see the fed loosening up anytime time soon, plus they nixed Grayscale's spot bitcoin ETF quite ambiguously.  I believe the fed is trying to set things up to contain or possibly hamstring bitcoin in the very near future and then push their own digital fiat.The only doubt I have is whether they will do so at the end of the summer, in view of the mid-term elections. I am not saying that they will change radically and lower rates in a drastic way, but perhaps slightly, because the return of summer is expected to be tough and I do not think that the Democrats want to face the elections with a more catastrophic economic situation than the one we have today.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wind_FURY",
      "created_time": "July 09, 2022, 11:20:33 AM",
      "body": "Quote from: ChrisPop on July 07, 2022, 04:16:06 PMPositive declarations about crypto will encourage citizens to adopt Bitcoin. We need to understand that Fed is not likely to make massive steps towards adopting Bitcoin. Even if they might make plans secretly about hoarding Bitcoin as it might become a global reserve currency, they won't disclose it publicly - you don't want other countries to accumulate at these low prices, don't you?It's very laughable to expect for it. The Fed's mandate is to maintain the prices of goods and services, and maintain the stability of the U.S. Dollar through policies that are, or should be, \"suitable\" to the situation.QuoteI'm not sure about laws and policies, but I think the government should announce if tax payers' money goes towards stacking, crypto right? The United States is in a position that it does NOT need Bitcoin, but its enemies?  I believe Bitcoin is one of the technologies that could weaken political strongholds, such as that of the United States, and the G7 Nations.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}