{
  "id": "topic_5475191",
  "title": "xDeFixSolutionSx",
  "author": "xDeFixSolutionSx",
  "created_time": "November 23, 2023, 12:20:35 PM",
  "content": "Blast io, the new Ethereum layer 2 network launched by the Blur team, managed to grow their TVL from zero to $230M within 48 hours - even without all tech components/features completed yet.How did they manage to achieve this? A smart user acquisition strategy comprised of:1/ pyramid marketing (points system, invitation code, ... - same as Friend Tech)2/ airdrop as a user reward, based on points earned, which is in turn driven by asset staked, other users invited3/ yield as a user reward, for users on their staked assets on chain (which comes from restaking these assets on other platforms like Lido, Sparks/MakerDAO, ...)It must feel embarrassing for all the other 20 L2s who have collectively raised > $1B and have developed technologies for 2-3 years.Personally I think the appearance of Blast is good, because it's a wake-up call to the Ethereum L2 market. It tells how actually users are acquired in crypto, whether it should or should not be the case.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5475191",
  "comments": [
    {
      "author": "BabyJubJub",
      "created_time": "November 23, 2023, 01:12:01 PM",
      "body": "Agree, everyone is writing about Blast now.Blust is making moves, especially with its Total Value Locked (TVL) on the upswing. No glitz, just smart marketing and a fresh spin on Layer 2 solutions. They've got a good grip on marketing, and it shows in the quick TVL climb.Let’s get real about Layer 2 as they seem to be taking over DeFi market share, keeping things running smooth. Especially with DeFi blowing up, solutions like L2 seem to be playing a crucial role in DeFi and DEX development DEX development. In a nutshell, Blust isn't shouting from the rooftops; it's quietly showing us a different DeFi path. The TVL hike and Layer 2 play are worth a close look.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}