{
  "id": "topic_5451799",
  "title": "tn2lj",
  "author": "tn2lj",
  "created_time": "May 07, 2023, 07:09:22 AM",
  "content": "I was wondering what is clogging up the mempool lately and decided to have a look. In one of the blocks I found the following 3 transactions:https://mempool.space/tx/d0cc7f159d4be77b01954830ac02dd3717044fc63be5f0248fce822313c6ce86https://mempool.space/tx/47c44058bd770508f6f93864342020caeecc804f6f06204944a58ae9cab13cb6https://mempool.space/tx/7d2c3577250b452deb8c38f6881e8dd4dc9705c06d94370d5d11bdf8d43e3abcAll of the above pay a fee of ~10$ to produce a dust UTXO of 546 sats. There are a lot more like these, e.g. see the transaction history of the following address:https://mempool.space/address/bc1p0h74a5yq5v33x4det366jxvs5afvkzw592maeqdrpneld9h0amfs4la4waSo, somebody is paying miners outrageous fees to transfer almost no value. Why would anybody do that except for nefarious purposes?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5451799",
  "comments": [
    {
      "author": "Ryker1",
      "created_time": "May 07, 2023, 07:31:35 AM",
      "body": "There are two reasons that quickly come to my mind --it could be a [mistake or urgency].Speaking of nefarious, I dont think it is possible that someone is intentionally paying high fees to hide some nefarious activity. Just like perhaps they be trying to obscure the source or destination of funds by flooding the network with lots of low-value transactions with high fees --something like that? I don't think it is a DDoS attack --using high-fee, low-value transactions would not be an effective method since the transactions would still be processed by the network, even at a higher fee.Look at the high-priority transaction fee on mempool while posting this it is 251 sats and the value is $10.22, so perhaps that transaction using a non-customize transaction fee wallet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OgNasty",
      "created_time": "May 07, 2023, 08:09:57 AM",
      "body": "I think it might be related to the recent “NFTs” on Bitcoin movement. People are minting these inscriptions on the Bitcoin blockchain and taking up blockspace. They are fine to lay high fees and wait longer than most traditional users sending Bitcoin transactions. I think that is more likely than Bitcoin being under attack, as it’s already been proven that it can’t scale on the main layer.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "abubakar1998",
      "created_time": "May 07, 2023, 08:28:13 AM",
      "body": "Can you explain in simple andeasy manner... ?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tn2lj",
      "created_time": "May 07, 2023, 08:56:42 AM",
      "body": "Quote from: Ryker1 on May 07, 2023, 07:31:35 AMThere are two reasons that quickly come to my mind --it could be a [mistake or urgency].Speaking of nefarious, I dont think it is possible that someone is intentionally paying high fees to hide some nefarious activity. Just like perhaps they be trying to obscure the source or destination of funds by flooding the network with lots of low-value transactions with high fees --something like that?No, I used the word nefarious in the sense that someone is intentionally clogging up the mempool to make normal users pay outrageous fees and thus make Bitcoin less attractive.Quote from: Ryker1 on May 07, 2023, 07:31:35 AMI don't think it is a DDoS attack --using high-fee, low-value transactions would not be an effective method since the transactions would still be processed by the network, even at a higher fee.I used the the term DoS (Denial of Service) loosely, in the sense that it becomes prohibitively expensive to transact smaller BTC amounts.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EarnOnVictor",
      "created_time": "May 07, 2023, 08:58:49 AMLast edit: May 07, 2023, 06:12:12 PM by EarnOnVictor",
      "body": "Quote from: OgNasty on May 07, 2023, 08:09:57 AMI think it might be related to the recent “NFTs” on Bitcoin movement. People are minting these inscriptions on the Bitcoin blockchain and taking up blockspace. They are fine to lay high fees and wait longer than most traditional users sending Bitcoin transactions. I think that is more likely than Bitcoin being under attack, as it’s already been proven that it can’t scale on the main layer. I am with you on this, what is happening on the Mempool is not cool as the fees are being reviewed upwards daily and it gets worse as days go by. I started noticing all these Mempool of a thing since last year when I joined BTT and I've never seen something like this before. This calls for a question if miners can't be manipulative at times.This can't be an attack as you explained since it had some times of falling too, but only to be greeted with higher fees.#Edit: With the information gathered from my extensive queries, two main reasons could be the cause of the unbearable fee hikes. It could be because of the creation of BRC-20 on the Bitcoin blockchain and Ordinals issues. As a result, this issue might not soon go away, we should get used to it for a little while.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "May 07, 2023, 09:10:09 AM",
      "body": "Quote from: EarnOnVictor on May 07, 2023, 08:58:49 AMI am with you on this, what is happening on the Mempool is not cool as the fees are being reviewed upwards daily and it gets worse as days go by. I started noticing all these Mempool of a thing since last year when I joined BTT and I've never seen something like this before. This calls for a question if miners can't be manipulative at times.Miners are not manipulating anything. Ordinals are likely the reason this is happening.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tn2lj",
      "created_time": "May 07, 2023, 09:12:04 AM",
      "body": "Quote from: OgNasty on May 07, 2023, 08:09:57 AMI think it might be related to the recent “NFTs” on Bitcoin movement. People are minting these inscriptions on the Bitcoin blockchain and taking up blockspace. They are fine to lay high fees and wait longer than most traditional users sending Bitcoin transactions. I think that is more likely than Bitcoin being under attack, as it’s already been proven that it can’t scale on the main layer. Have you had a look at the transactions I linked? They are only ~330 bytes in size, so I don't see how they have anything to do with inscriptions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "entebah",
      "created_time": "May 07, 2023, 09:13:07 AM",
      "body": "Quote from: tn2lj on May 07, 2023, 07:09:22 AMI was wondering what is clogging up the mempool lately and decided to have a look. In one of the blocks I found the following 3 transactions:https://mempool.space/tx/d0cc7f159d4be77b01954830ac02dd3717044fc63be5f0248fce822313c6ce86https://mempool.space/tx/47c44058bd770508f6f93864342020caeecc804f6f06204944a58ae9cab13cb6https://mempool.space/tx/7d2c3577250b452deb8c38f6881e8dd4dc9705c06d94370d5d11bdf8d43e3abcAll of the above pay a fee of ~10$ to produce a dust UTXO of 546 sats. There are a lot more like these, e.g. see the transaction history of the following address:https://mempool.space/address/bc1p0h74a5yq5v33x4det366jxvs5afvkzw592maeqdrpneld9h0amfs4la4waSo, somebody is paying miners outrageous fees to transfer almost no value. Why would anybody do that except for nefarious purposes?I think it's because of BRC-20 that was created on the bitcoin blockchain even the total market cap for all brc-20 tokens has increased 2x/3x from last week when I visit that website.i read in this article that the total transaction on May 1 are already over 2m with generating over 109 btc in transaction fees https://azcoinnews.com/brc-20-transactions-reach-new-ath-on-bitcoin-network.html",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tn2lj",
      "created_time": "May 07, 2023, 09:21:08 AM",
      "body": "Quote from: entebah on May 07, 2023, 09:13:07 AMI think it's because of BRC-20 that created on bitcoin blockchainIs there an explorer that would show that the linked transactions are indeed linked to BRC-20?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "entebah",
      "created_time": "May 07, 2023, 09:33:21 AMLast edit: May 16, 2023, 07:49:53 AM by entebah",
      "body": "Quote from: tn2lj on May 07, 2023, 09:21:08 AMQuote from: entebah on May 07, 2023, 09:13:07 AMI think it's because of BRC-20 that created on bitcoin blockchainIs there an explorer that would show that the linked transactions are indeed linked to BRC-20?it's easy you can just use this website to check it https://brc-20.io/, I just check all the transactions that you shared on 1st page and I believe all of that transactions for Brc-20 tokens https://mempool.space/tx/d0cc7f159d4be77b01954830ac02dd3717044fc63be5f0248fce822313c6ce86https://scan.brc-20.io/index?address=bc1pdgzjfwlm52ghylpqd0am384k4uf75v002gfrhfkcnjcd0r0z79nqsp3t66https://mempool.space/tx/47c44058bd770508f6f93864342020caeecc804f6f06204944a58ae9cab13cb6https://scan.brc-20.io/index?address=bc1psyagz7lgr7zraac4ck8n0xrfejxka59262mfs9745dcgfkxjxz5st4f829https://mempool.space/tx/7d2c3577250b452deb8c38f6881e8dd4dc9705c06d94370d5d11bdf8d43e3abchttps://scan.brc-20.io/index?address=bc1p0h74a5yq5v33x4det366jxvs5afvkzw592maeqdrpneld9h0amfs4la4waif you want to check another address then just use this https://brc-20.io/ or this one https://unisat.io/brc20",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LoyceV",
      "created_time": "May 07, 2023, 09:43:46 AM",
      "body": "Quote from: entebah on May 07, 2023, 09:13:07 AMI think it's because of BRC-20 that was created on the bitcoin blockchainThat's not true. BRC-20 doesn't exist on the Bitcoin blockchain. All it does on-chain is create dust spam, and someone else says it's worth something. It's basically the next step after anything from ICOs and Forks to DeFi and NFTs: how to use gullible people's greed to get them to hand over their money.I can already tell you many people are going to lose their money, and a few people will get very rich. Until it busts, after which they'll make up the next pump and dump scheme.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tn2lj",
      "created_time": "May 07, 2023, 09:46:51 AM",
      "body": "Quote from: entebah on May 07, 2023, 09:33:21 AMit's easy you can just use this website to check it https://brc-20.io/, I just check all the transactions that you shared on 1st page and I believe all of that transactions for Brc-20 tokensThank you, that explains it all.Not sure why anyone would want to make a token on the BTC blockchain however. The ETH blockchain is much better suited to that, no?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "May 07, 2023, 09:58:32 AM",
      "body": "Quote from: LoyceV on May 07, 2023, 09:43:46 AMQuote from: entebah on May 07, 2023, 09:13:07 AMI think it's because of BRC-20 that was created on the bitcoin blockchainThat's not true. BRC-20 doesn't exist on the Bitcoin blockchain. All it does on-chain is create dust spam, and someone else says it's worth something. It's basically the next step after anything from ICOs and Forks to DeFi and NFTs: how to use gullible people's greed to get them to hand over their money.I can already tell you many people are going to lose their money, and a few people will get very rich. Until it busts, after which they'll make up the next pump and dump scheme.BRC20 tokens rely on Ordinals and Inscriptions is all that I know about this. And likely the reason for the increased fee? I mean both ordinals NFT and BRC20 tokens which are fungible tokens.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "UchihaSarada",
      "created_time": "May 07, 2023, 10:13:54 AM",
      "body": "Bitcoin network can not be DDos attacked. You can make 51% attack but it requires to own 51%+ hashrate to do it. It is impossible.Dust attacks are not strange and it happens many times on the network. Attackers do that to mislead bad fee rate estimators and force people to pay very expensive fee rate for their transactions. It is very bad if they don't know methodology to check fee rate and pick a good one. Or if they rely on estimators which are bad in formulas and give a overpaid suggested fee rate. Or if they use exchange wallet, they will have to accept withdrawal fee of exchange that is expensive.You can prevent dust attacks to your wallet (non custodial).Dust Attack, what it is, why it is dangerous and how to prevent falling to it",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "buwaytress",
      "created_time": "May 07, 2023, 10:26:01 AM",
      "body": "Just not sure why anyone wondering about mempool and uses Google doesn't find out what's behind it all heh.It's the latest fad, we all gotta bear it, unfortunately.Quote from: LoyceV on May 07, 2023, 09:43:46 AMQuote from: entebah on May 07, 2023, 09:13:07 AMI think it's because of BRC-20 that was created on the bitcoin blockchainThat's not true. BRC-20 doesn't exist on the Bitcoin blockchain. All it does on-chain is create dust spam, and someone else says it's worth something. It's basically the next step after anything from ICOs and Forks to DeFi and NFTs: how to use gullible people's greed to get them to hand over their money.I can already tell you many people are going to lose their money, and a few people will get very rich. Until it busts, after which they'll make up the next pump and dump scheme.A handful of people think it's worth something, indeed. And it doesn't even matter how the tech works, doesn't matter people are attaching arbitrary value to perceived rarity, people recognise it's a ponzi and they're jumping on it.Just like all other ponzis, the early entrants are making money, and that's what's fueling newer entrants.Actually surprised it took so long for these schemes to latch on to Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Artemis3",
      "created_time": "May 07, 2023, 04:35:33 PM",
      "body": "In short: spammers found a way to put data not strictly related to the actual transaction in a transaction. It wouldn't be a problem if it were only a few bytes like the famous Satoshi message in the first block, but no, these guys have a profit incentive like spam has always had, at the expense of flooding their attacked service with noise (Which is where the modern definition of spam comes from. illustrated by that Monthy Python sketch...).So yes, it is. And clearly shown here:This graph is showing that transactions under 20 sats/b are getting dropped, and the current peak is paying 200. You can check there what it was like until February. But this is not the end of it, as more and more spammers join thinking this is the new Ethereum, things are only going to get worse...According to some comments elsewhere, this is due to the relaxing of the consensus rules in the Bitcoin protocol that has been ongoing in the late years. Finally someone found a way to abuse it, performed a public demonstration that showed the way to the rest of the spammers who not only don't care if bitcoin fails, but might actually have incentives to make it fail while also get some side cash selling this spam in the process.While PoW makes it increasingly expensive to attack Bitcoin, because this spam is making them money, they found a sustainable way to keep increasing the attack. It is seriously wrong to ignore it and you should be wary of people saying nothing is wrong, for they must have an agenda against Bitcoin by siding with the spam. Perhaps they just want their altcoin/sidechain to be more used, or could be State/Banks infiltration...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OgNasty",
      "created_time": "May 07, 2023, 07:24:09 PM",
      "body": "Here’s a conspiracy theory for you… What if Pepecoin was a way to raise a ton of money to fund an attack against Bitcoin while simultaneously attempting to replace it with a rising memecoin? Possible? Probably not, but for conspiracy theorists it might be fun to think about. Funding attacks with the promise of shared riches could lead to interesting consequences.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "d5000",
      "created_time": "May 07, 2023, 10:49:41 PM",
      "body": "Quote from: Artemis3 on May 07, 2023, 04:35:33 PMAccording to some comments elsewhere, this is due to the relaxing of the consensus rules in the Bitcoin protocol that has been ongoing in the late yearsThis was true for the first Ordinals wave in March/early April. However, unfortunately, the BRC-20 fad has another character. They are relatively small transactions of 300-400 bytes each, but there are a LOT of them.So even if the devs did what you (and other Ordinals critics, and IMO you do have a point with that) proposed and limited the Taproot script size, the BRC-20 transactions would not be affected.By the way, BRC-20 is the most idiotic token protocol I saw on the blockchain (more on that here). There are already around 20 token protocols for Bitcoin, starting with coloured coins like EPOBC in ~2012, and Counterparty and Omni (home of the original Tether) being the most popular.BRC-20 stores a small JSON text in cleartext(!) on the blockchain, and even due the way Ordinals work they need two transactions to create a token! So there's a lot of overhead and they're actually wasting a lot of money with the only reason being to use a \"ordinals-based\" protocol.If they were simply using Counterparty or Omni, or even better, RGB or Taro (which are beta still, afaik) then they would waste much less space and fees.So this is what I think about BRC-20:I don't know if even a double facepalm is enough ...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PX-Z",
      "created_time": "May 07, 2023, 11:01:34 PM",
      "body": "It is more like dust attacks than a DDOS which is not new to bitcoin network, since then the network getting attacked for whatever reasons they have. The attack may cause bitcoin unattractive due to higher fees but the price wont go down just because of the effect and of such attack.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}