{
  "id": "topic_5409611",
  "title": "Franctoshi",
  "author": "Franctoshi",
  "created_time": "August 12, 2022, 01:18:28 PM",
  "content": "My biggest challenge was convincing my close friend looking for a long term investment (10+ years) but don't like Bitcoin and you know Bitcoin is the right option for him.I got a close friend who believes so much in me when it comes to doing profitable investment, during early May this year (2022) He asked me what kind of investment that one could go into for long term that he's looking into investing in the future and for his retirement period, He's rich and willing to spare/invest about $50000 into something that will grow over time ,that is in the long run. So when he asked me about the best investment which he could go into, I told him I'm gonna give him a feedback soon. I gave him a week to see if he's really ready on what he asked me for, within that time interval he called me that he's still waiting for my feedback. In my knowledge about Bitcoin I already knew that the best choice of investment for him in that regards is Bitcoin, then when I invited him to my house I gave him a  list of 3 asset to invest in, which are:•Bitcoin•Gold•Real EstateI went futher to explaining which asset between the 3 assets is the best, I first of told him the purpose of that Bitcoin and problem is meant to (Uses cases), that Bitcoin is scarce and would outperform the two assets and yield more returns in the long term than the two if he gives the 3 assets 10+ years period of time as he's looking into long term.I equally told him that Bitcoin is more liquid than the two asset in the sense that buyers are always there and you can liquidate your Bitcoin as easy as ABC anytime.Goiy further I equally told him that Bitcoin is revolution of money and being your own bank (the only freedom form of money in the world)That Bitcoin is more secure in the sense that you can have Bitcoin stored in hard wallets like Nano ledger wallet etc and move about with your money wherever you want to go with lesser cost of storage, While Gold for it cost you to move it around and land is immovable and will cost you more trying to secure them, in some cases in my area land may enter into dispute.To cut the whole story short he categorically said he don't like Bitcoin..... Reason due to uncertainty of Bitcoin that it might get banned today or  tomorrow, but I knew this is because of his misconception about Bitcoin and realized that I have a lot of Job to do on my friend to give him the right information he needs to know about Bitcoin. What I did  in getting him interested /convinced.So during this crash I realized that it is the best opportunity to have him invest in Bitcoin,1• Therefore I first started sending him an educational short write up of how the internet started 1999/2000 that this is a kind of thing involving with Bitcoin and Money. 2• I started sending him a link to Bitcoin YouTube videos to watch as he started asking me some questions which indicates he's beginning to have some interest , As they said a \"prophet is not of worthy except in his home town\". It's better he watches from other sources than from the only one I have been teaching him. 3• So lastly the one that spark his interest up was that recently I started by giving him list of billionaires who has invested in Bitcoin like Michael Saylor, Elon musk and other institutional investors like the world largest hedge fund manager Blackrock coming into the space.I even paid an artist who customize a very nice gold colour Bitcoin wall frame for him that has big Bitcoin Logo and name on it which I gifted him ,same like the one I got in the house which he do much love.Just yesterday I was amazed he told me that he now wants to buy the Bitcoin and I have helped him we've just started with buying 1 BTC at around $23k and the remaining balance will be bought using good dollar cost averaging (DCA).",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5409611",
  "comments": [
    {
      "author": "_act_",
      "created_time": "August 12, 2022, 01:49:00 PM",
      "body": "Nice reading this.Hope you let him know the risks involved too and safety measures?Hope you told him to use a cold wallet, like hardware wallet? You know that it is not good to use a centralized exchange for your friend will not have complete control over his own asset, also not good to use a centralized wallet for the same reason. Not good to use a close source and online/hot wallet for it, they should all be avoided. Getting a cold wallet like hardware wallet would be better and he should totally be avoiding scammers and hackers.Hope you told him to read some articles about seed phrase and private key or you well explained to him and keep on repeating it for him, that he should protect them safely and have recovery backups in a safe place, I mean the seed phrase backup.You can even advice him to use passphrase which can help him against attack, but he must lost the passphrase, having a backup for the passphrase would be best and recommended.But I would have adviced him to just put 50% on bitcoin while others on gold or real estate. But that does not mean that bitcoin will not increase in price than gold and real estate, but to just diversify.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Maus0728",
      "created_time": "August 12, 2022, 01:57:51 PM",
      "body": "Convincing him to get into bitcoin is a pretty good move as long as you also educate your friend how to properly secure his asset. Because if not, I am certain that you'll be having a bad day when those bitcoin gets lost either by getting hacked or losing the seed phrase.Teach him at least some basic cyber hygiene.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tbct_mt2",
      "created_time": "August 12, 2022, 02:07:59 PM",
      "body": "Quote from: Franctoshi on August 12, 2022, 01:18:28 PMHe's rich and willing to spare/invest about $50000 into something that will grow over time ,that is in the long run.Nice story.You would be very well in convincing your friend if you are not rich. If you are rich too, it would be easier for you to convince your friend. Usually your friend will have more reasons to believe you if you get rich by your investment in Bitcoin. Real story, real investment, real get rich story, it is more convincing for your friend.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AicecreaME",
      "created_time": "August 12, 2022, 02:18:42 PM",
      "body": "Quote from: tbct_mt2 on August 12, 2022, 02:07:59 PMQuote from: Franctoshi on August 12, 2022, 01:18:28 PMHe's rich and willing to spare/invest about $50000 into something that will grow over time ,that is in the long run.Nice story.You would be very well in convincing your friend if you are not rich. If you are rich too, it would be easier for you to convince your friend. Usually your friend will have more reasons to believe you if you get rich by your investment in Bitcoin. Real story, real investment, real get rich story, it is more convincing for your friend.I agree.People won't believe in you unless you show them your money, I don't know why but it always work. People loves money, and I think that's the reason why they get scammed most of the time. I think if your friend believe in you when you told him about Bitcoin even though you're just beginning your journey in Bitcoin, that's great, because your friend will surely grow with you and hopefully makes a lot of money in Bitcoin with you in the long run. Investing in Bitcoin is much better than saving your cash in a bank. Bank is just using your money for loan with a high interest while they only gives their users pennies in return. Bitcoin is gonna give you profits much bigger in the long run.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Franctoshi",
      "created_time": "August 12, 2022, 02:20:07 PMLast edit: August 12, 2022, 07:45:52 PM by Franctoshi",
      "body": "Quote from: _act_ on August 12, 2022, 01:49:00 PMHope you let him know the risks involved too and safety measures?Hope you told him to use a cold wallet, like hardware wallet? I have already started giving him all necessary information he needs to know about Bitcoin and what really caught my attention was him actually looking for long term 10+ years investment, Therefore with 12+ years Bitcoin in existence and performance gave me a bit confidence about Bitcoin as best option.Quote from: _act_ on August 12, 2022, 01:49:00 PMBut I would have adviced him to just put 50% on bitcoin while others on gold or real estate. But that does not mean that bitcoin will not increase in price than gold and real estate, but to just diversify.Equally a good idea to diversify in order to compare the 3 assets performance towards that time and at the end of his investment, like I said we only bought 1 BTC already and proper DCA is in place too. Quote from: mk4 on August 12, 2022, 05:36:12 PMHopefully you also told your friend that he doesn't necessarily need to invest in one of the three choices. If he's so unsure he can simply allocate 33.33% on 3 assets(screw gold though, go 50% on BTC and real estate instead) to spread out risk.This is another great idea as I will be taking it into consideration as we still have some cash left over.Quote from: KennyR on August 12, 2022, 06:07:58 PMWhat you've done to your friend is really good. At the same time you could've said about the risks. I believe you could've failed to mention it on the thread.I did tell him about the risk involved though I didn't mention it on the thread , he did some research on Bitcoin before he decided.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Solosanz",
      "created_time": "August 12, 2022, 02:24:51 PM",
      "body": "I'm not really sure how good is this, convincing your friend about Bitcoin when he's not like Bitcoin or doesn't have intention to learn it yourself is risky move.If his investment will work like the previous history where Bitcoin price will increase after 4 years cycle, then your friends wouldn't mad and call Bitcoin is scam. But when it does wrong, he might say Bitcoin is scam and even more don't want to become your friend anymore. I have met such people in my life and that's the reason why I don't want to speak or discuss about Bitcoin even though he is my close friend etc.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Upgrade00",
      "created_time": "August 12, 2022, 02:26:37 PM",
      "body": "Great read. It's best that your friend got interested on their own, with the information provided.First point to note; I assume that since they are investing for the long term (10- years), then they are not putting in money they urgently need. One should never invest amounts they cannot afford to lose, especially into a high risk asset.Second point; How to secure the asset is more important than acquiring it.For a purchase of that amount, your friend should definitely get a hardware wallet for cold storage. They should also preferably be privacy cautious when buying, or sending to their different addresses.Back ups are also an important factor.Thirdly, they should be aware of taxes regulations in their area.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "posi",
      "created_time": "August 12, 2022, 02:38:46 PM",
      "body": "And the next thing you should teach him how to manage and store this digital asset, since he decided to keep it for up to 10 years, it is not a bad idea to introduce a hardware wallet. It doesn't matter how much bitcoin he holds, what matters is that he is still a newbie entrant in the market, so you will be the one who is always by his side, cheering him on during his holding time, once a bear market occurs, he will lose his will and panic sell them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cheezcarls",
      "created_time": "August 12, 2022, 02:56:06 PM",
      "body": "Quote from: Franctoshi on August 12, 2022, 01:18:28 PMMy biggest challenge was convincing my close friend looking for a long term investment (10+ years) but don't like Bitcoin and you know Bitcoin is the right option for him.I got a close friend who believes so much in me when it comes to doing profitable investment, during early May this year (2022) He asked me what kind of investment that one could go into for long term that he's looking into investing in the future and for his retirement period, He's rich and willing to spare/invest about $50000 into something that will grow over time ,that is in the long run. So when he asked me about the best investment which he could go into, I told him I'm gonna give him a feedback soon. I gave him a week to see if he's really ready on what he asked me for, within that time interval he called me that he's still waiting for my feedback. In my knowledge about Bitcoin I already knew that the best choice of investment for him in that regards is Bitcoin, then when I invited him to my house I gave him a  list of 3 asset to invest in, which are:•Bitcoin•Gold•Real EstateI went futher to explaining which asset between the 3 assets is the best, I first of told him the purpose of that Bitcoin and problem is meant to (Uses cases), that Bitcoin is scarce and would outperform the two assets and yield more returns in the long term than the two if he gives the 3 assets 10+ years period of time as he's looking into long term.I equally told him that Bitcoin is more liquid than the two asset in the sense that buyers are always there and you can liquidate your Bitcoin as easy as ABC anytime.Goiy further I equally told him that Bitcoin is revolution of money and being your own bank (the only freedom form of money in the world)That Bitcoin is more secure in the sense that you can have Bitcoin stored in hard wallets like Nano ledger wallet etc and move about with your money wherever you want to go with lesser cost of storage, While Gold for it cost you to move it around and land is immovable and will cost you more trying to secure them, in some cases in my area land may enter into dispute.To cut the whole story short he categorically said he don't like Bitcoin..... Reason due to uncertainty of Bitcoin that it might get banned today or  tomorrow, but I knew this is because of his misconception about Bitcoin and realized that I have a lot of Job to do on my friend to give him the right information he needs to know about Bitcoin. What I did  in getting him interested /convinced.So during this crash I realized that it is the best opportunity to have him invest in Bitcoin,1• Therefore I first started sending him an educational short write up of how the internet started 1999/2000 that this is a kind of thing involving with Bitcoin and Money. 2• I started sending him a link to Bitcoin YouTube videos to watch as he started asking me some questions which indicates he's beginning to have some interest , As they said a \"prophet is not of worthy except in his home town\". It's better he watches from other sources than from the only one I have been teaching him. 3• So lastly the one that spark his interest up was that recently I started by giving him list of billionaires who has invested in Bitcoin like Michael Saylor, Elon musk and other institutional investors like the world largest hedge fund manager Blackrock coming into the space.I even paid an artist who customize a very nice gold colour Bitcoin wall frame for him that has big Bitcoin Logo and name on it which I gifted him ,same like the one I got in the house which he do much love.Just yesterday I was amazed he told me that he now wants to buy the Bitcoin and I have helped him we've just started with buying 1 BTC at around $23k and the remaining balance will be bought using good dollar cost averaging (DCA).I acknowledged the fact that you have convinced your long time close friend to put his $50,000 into Bitcoin for his retirement. But did you also informed him of the risks as well like there are no promises or astronomical guaranteed returns in investing into Bitcoin? And did he also bought a hardware wallet like the Ledger Nano S?I assume that your close friend is so new about Bitcoin and the world of crypto based on my own understanding because of sharing some of the popular names, companies, etc. Anyways, great job for introducing him to Bitcoin though.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jody.Drummer",
      "created_time": "August 12, 2022, 03:18:10 PM",
      "body": "Positive points I can take from the story of how you convinced a friend to like bitcoin and invest in it. With such a large amount of money, at least he is aware of the risks, not only because Bitcoin is now common in the news. Although investing in Bitcoin doesn't have to be rushed, there's still time to learn, get to know and spark an inner interest. It's not at the instigation of someone else that buying Bitcoin in the wrong place where he doesn't know a safe exchange and how to buy in the right area would be quite a hassle for you. Trust your friend that what he bought today has a much greater value in the future.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kryptqnick",
      "created_time": "August 12, 2022, 03:47:02 PM",
      "body": "I guess the problem is that if a person is rich enough to risk $50k, this person probably doesn't need to think about retirement and doesn't really need any profits he'll get from the long-term Bitcoin investment, whereas a person who should be worried won't have nearly as much, so making a difference would be hard for that person because of not being rich. I am happy your friend decided to go for it, and I think it will highly likely bring great long-term profits. I just hope that if he can spare $50k on an experiment, he's also doing something good for society (like a socially responsible business, a charity, educational/healthcare project etc).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "salad daging",
      "created_time": "August 12, 2022, 04:09:26 PM",
      "body": "You give good advice to your friends about how bitcoin will be in the future although this is not certain but we see the history of bitcoin is always a new record for a long time.I think your friend doesn't have to invest everything in bitcoin and in my opinion gold, Real Estate is also a good choice even though the return is not like bitcoin but in the second investment it is safe and stable so there will be no doubt except bitcoin.From this story your friend already has bitcoin, which means he will wait for the price of $100k if it happens then he will be a high profit compared to other investments.But still take the good side of him and let him do what he does best.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "marcotheminer",
      "created_time": "August 12, 2022, 04:22:41 PM",
      "body": "DCA over the next year or two could be a good idea with 50k.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AbuBhakar",
      "created_time": "August 12, 2022, 04:30:58 PM",
      "body": "I respect people like OP that have a balls to convinced there friends to invest something big on Bitcoin and assuring them for the return. I myself is afraid to do it because it might backfire to our friendship once the result didn't go exactly what we want since this money is a retirement fund not just a free money for investment.I'm looking on the part that you warn your friend for risk involved because we can't assure that the price will above the current 10 years from now. I hope you consider telling him the risk so that you can protect your personal relationship with him if something wrong happened.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stomachgrowls",
      "created_time": "August 12, 2022, 05:17:50 PM",
      "body": "Quote from: AbuBhakar on August 12, 2022, 04:30:58 PMI respect people like OP that have a balls to convinced there friends to invest something big on Bitcoin and assuring them for the return. I myself is afraid to do it because it might backfire to our friendship once the result didn't go exactly what we want since this money is a retirement fund not just a free money for investment.I'm looking on the part that you warn your friend for risk involved because we can't assure that the price will above the current 10 years from now. I hope you consider telling him the risk so that you can protect your personal relationship with him if something wrong happened.Giving out some assurances is somewhat risky yet you are really that putting that friendship or relation to others at risk specially if the market would be experiencing deep declines or very bearish marketwhich it would really be impossible that friend of yours wont really be panicking unless if you told him about the risk factor which he do able to make himself that prepared on these kind of times.But its really a good gesture and initiative for someone to tell about Bitcoin and invest on long term but they shouldnt forget about risk taking thing because not everything looksgood would end up to be good on future years to come but we know bitcoins potential which is something that cant really be resisted.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "August 12, 2022, 05:36:12 PM",
      "body": "Quote from: Franctoshi on August 12, 2022, 01:18:28 PM•Bitcoin•Gold•Real EstateHopefully you also told your friend that he doesn't necessarily need to invest in one of the three choices. If he's so unsure he can simply allocate 33.33% on 3 assets(screw gold though, go 50% on BTC and real estate instead) to spread out risk.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Asiska02",
      "created_time": "August 12, 2022, 05:57:55 PM",
      "body": "This is great news OP. I'm so amazed on how well you were able to persuade your friend and help him see the benefits of investing in bitcoin. Making him conduct his own research is a fantastic idea as well because he now understands what he is investing in and what he will gain in the long run. The idea of DCA is a very good as he is investing a huge sum of money into bitcoin. This will enable him to lessen the effects of volatility and increase the value of his investment. As a beginner that he is, and also if he is less bothered about the technical aspect of the market, DCA is the best option.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "KennyR",
      "created_time": "August 12, 2022, 06:07:58 PM",
      "body": "What you've done to your friend is really good. At the same time you could've said about the risks. I believe you could've failed to mention it on the thread. If you haven't, then brief him with real time examples of people experiencing the profit as well as loss. This lets your friend understand the reality and get going with it than just having a mind of profiting alone.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lionheart78",
      "created_time": "August 12, 2022, 06:14:15 PM",
      "body": "Why am I seeing that your friend doesn't need 10 years to harvest his profits?It is really a wise decision that your friend decided to invest in Bitcoin even though he has fear because of future uncertainty due to government regulation.  I bet it is hard for you to encourage your friend since he has negative connotations on Bitcoin.  I am glad your explanation made sense to him.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}