{
  "id": "topic_5463246",
  "title": "Shortmaster",
  "author": "Shortmaster",
  "created_time": "August 14, 2023, 02:42:27 PM",
  "content": "Yes paypal use crypto but instead of eth many users was expecting the TRON blockchain its faster cheaper and more used.Eth transactions still too expensive i hope they start use TRON soon",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5463246",
  "comments": [
    {
      "author": "dimonstration",
      "created_time": "August 14, 2023, 02:46:13 PM",
      "body": "Quote from: Shortmaster on August 14, 2023, 02:42:27 PMYes paypal use crypto but instead of eth many users was expecting the TRON blockchain its faster cheaper and more used.Eth transactions still too expensive i hope they start use TRON soon Tron is bullshit blockchain network and too centralized since Justin control the majority of the validators using his VC project that he is connected. Tron is the most shady blockchain network including his huobi and stablecoin. So far, despite of high price of ETH transaction fee they are still one pf therrusted and safest blockchain to rely on. I think BSC has more chance to be use by financial institution since CZ is very good on working with them as already proven when many multiple huge hack was stopped due to their fast action.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jawhead999",
      "created_time": "August 14, 2023, 02:50:11 PM",
      "body": "Dude? Tron network isn't faster and cheaper anymore, since the last year you need to pay around $2 as the fee. If you send Tron coin, it's definitely cheap, but if you send a token that run in Tron network, it's expensive.ETH and Tron fee are nothing different, actually Bitcoin fee is way more cheaper even though it's decentralized and has huge volume.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nwada001",
      "created_time": "August 14, 2023, 03:01:23 PM",
      "body": "Quote from: Shortmaster on August 14, 2023, 02:42:27 PMYes paypal use crypto but instead of eth many users was expecting the TRON blockchain its faster cheaper and more used.Eth transactions still too expensive i hope they start use TRON soon Tron is not the most used blockchain; it might be among the blockchains with the cheapest transaction fee, but still, people find other blockchains more user-friendly than Tron. In terms of choosing which blockchain one needs to make use of, I believe institutions need to look beyond the cheap transaction fee and check on other criteria that can be favorable to them in terms of partnership, security, etc.The new PayPal stablecoin (PYUSD) is said to be under the Etheruem network, and I believe they have reason for that choice as it might be the best option for their business, as Eth has much more popularity than the Tron blockchain. Tron needs to do more in terms of development, management, and control if they want to see individual and institutional investors use their chain more often.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Adbitco",
      "created_time": "August 14, 2023, 03:21:58 PM",
      "body": "From my experience so far I don't see anything to be wrong with tron network, it depends on the kind of transaction you want to make. Like for example, if you want to transfer some thousands of bitcoin and the fee could be much you may decides to narrow it down by converting all every to trx and withdraw them and send to the receiver, all the receiver could do is to quickly sell and buy back their bitcoin to secure their funds since trx is altcoin and I don't encourage hold altcoin for long since they are too unpredictable.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rat03gopoh",
      "created_time": "August 14, 2023, 03:57:03 PM",
      "body": "The ETH network has more integrity for years without any problems. Even Vitalik, the founder who is known for not doing as much in the shady business as other network founders who aren't going to destroy his own crypto ecosystem.QuoteRe: It's good that financial instutions Understood that they need to use cryptoIt is certainly no different from institutions that operate centrally, adopting crypto for them only trying to benefit from the innocence of users.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "superman184",
      "created_time": "August 14, 2023, 04:27:55 PM",
      "body": "Quote from: Shortmaster on August 14, 2023, 02:42:27 PMYes paypal use crypto but instead of eth many users was expecting the TRON blockchain its faster cheaper and more used.Eth transactions still too expensive i hope they start use TRON soon I rarely use the network from any altcoin now and also very rarely use paypal, so I just hope that the Bitcoin network itself can be faster and also cheaper when making transactions. I don't know how many enthusiasts and users of the TRON blockchain are at the moment so you say there are people who hope to use the TRON blockchain more, because I think everyone who uses something must be because there is a need for something. If they didn't need the TRON blockchain, they certainly wouldn't use it either.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "avikz",
      "created_time": "August 14, 2023, 04:48:21 PM",
      "body": "Quote from: Shortmaster on August 14, 2023, 02:42:27 PMYes paypal use crypto but instead of eth many users was expecting the TRON blockchain its faster cheaper and more used.Eth transactions still too expensive i hope they start use TRON soon I am sure you are referring to their recent move to create a new stablecoin. It's just a survival strategy of PayPal. After the wide acceptance of cryptocurrencies, the requirement for PayPal as a payment processor has gone down drastically. So they are also trying to join the crypto bandwagon to save and reduce cost. So if that is their goal, I don't see a need of using either ETH or Tron blockchain. Rather, they need to move to create their own blockchain to support the volume. Some members said that Tron is not decentralized and blah blah blah. That's fine! Because Paypal is not decentralized either. They are trying to use a blockchain service to reduce their cross-border money transfer cost. Tron serves that need quite well, for now!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Faisal2202",
      "created_time": "August 14, 2023, 05:31:11 PM",
      "body": "Quote from: Shortmaster on August 14, 2023, 02:42:27 PMYes paypal use crypto but instead of eth many users was expecting the TRON blockchain its faster cheaper and more used.Eth transactions still too expensive i hope they start use TRON soon Every platform has there own agenda and benefits to achieve and here I think we all know ETH is not some decentralized thing and why they did not use Tron because indirectly it is related to CZ and the important thing is the company pexos which delist BUSD is the one which issued PYUSD. Well, I think Pexos was just following the orders of the US government but I think they should also not move to Tron because they must have something or surprising thing for Tron too because Tron's CEO was also sued a lot of times for manipulating Tron's price. Well, these are just my assumption nothing personal just ideas I have so far from my readings and the time that I have spent here. Coming back, We all have read many storied or statements explaining how PYUSD has some backdoor code that could stop someone's money like they have full control over the customer's money.Then tell me is it not true that ETH also progressing to make its platform as centralized as possible even though they are increasing the validators to themselves only or I should say they are limiting the number of validators too? This proofs that they would not take huge steps first because centralization is everything for them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "el kaka22",
      "created_time": "August 15, 2023, 06:32:46 PM",
      "body": "I believe that it was inevitable, it's something that is very much used everywhere around the world already and should be considered as important as it gets. I get that people may not feel the same in most cases but that is the situation we are in right now and need to be understood perfectly well.Oeople are already aware mostly, but companies do not have any type of mechanism where they can continue without caring about crypto or looking at it. Specially ones like paypal where they are directly correlated and they are a payment company, if they keep on ignoring it, then it would have been bad for them and this is why they have taken a look at it and doing something about it in order to get the attention people have towards crypto.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wimex",
      "created_time": "August 16, 2023, 01:56:21 AM",
      "body": "Quote from: el kaka22 on August 15, 2023, 06:32:46 PMI believe that it was inevitable, it's something that is very much used everywhere around the world already and should be considered as important as it gets. I get that people may not feel the same in most cases but that is the situation we are in right now and need to be understood perfectly well.Oeople are already aware mostly, but companies do not have any type of mechanism where they can continue without caring about crypto or looking at it. Specially ones like paypal where they are directly correlated and they are a payment company, if they keep on ignoring it, then it would have been bad for them and this is why they have taken a look at it and doing something about it in order to get the attention people have towards crypto.It is that cryptocurrencies have become so popular in the world that it was obvious that many institutions began to use them, even though in many countries they cannot be used freely due to the legal restrictions that remain, these same territories have decided to implement their own system using this type of technology for their own benefit trying to create their own digital currencies, but with the difference of being able to control them, sooner or later they will realize that despite the fact that this option is not so bad, people will continue looking for the decentralized in order to have freedom, so banks and other institutions that carry out transactions will end up choosing these cryptocurrencies that can give them a better benefit, specifically they will be redirected to bitcoin as it is the most potential and with solid foundations and of course for having the better significant value  the most demanded.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BALIK",
      "created_time": "August 16, 2023, 02:25:33 AM",
      "body": "Quote from: dimonstration on August 14, 2023, 02:46:13 PMQuote from: Shortmaster on August 14, 2023, 02:42:27 PMYes paypal use crypto but instead of eth many users was expecting the TRON blockchain its faster cheaper and more used.Eth transactions still too expensive i hope they start use TRON soon Tron is bullshit blockchain network and too centralized since Justin control the majority of the validators using his VC project that he is connected. Tron is the most shady blockchain network including his huobi and stablecoin. So far, despite of high price of ETH transaction fee they are still one pf therrusted and safest blockchain to rely on. I think BSC has more chance to be use by financial institution since CZ is very good on working with them as already proven when many multiple huge hack was stopped due to their fast action.LOL, if you have criticized the Tron blockchain as being centralized and largely controlled by Justin, then BSC is not much better. Although CZ is more appreciated than Justin but the BSC blockchain is also controlled almost entirely by CZ, and it is also completely centralized, all rights are decided by CZ. But no matter how centralized or shady Tron is, it is still the most used by users to trade USDT, and I bet you will also use the Tron network every time you trade USDT.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sim_card",
      "created_time": "August 16, 2023, 04:10:25 AM",
      "body": "Quote from: Shortmaster on August 14, 2023, 02:42:27 PMYes paypal use crypto but instead of eth many users was expecting the TRON blockchain its faster cheaper and more used.Eth transactions still too expensive i hope they start use TRON soon There is a reason for PayPal to accept using Eth instead of Tron. I don't see any problem here using ETH which they feel is more transparent thanTron. I believe that PayPal must be following some directions from the US and that is why it is like this. Tron is also a good coins and both of the them have transaction fees are similar. I don't think that it is the transaction fee that was considered before PayPal chose to use ETH but there are some other factors that was considered.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mindrust",
      "created_time": "August 16, 2023, 04:29:50 AM",
      "body": "Quote from: Shortmaster on August 14, 2023, 02:42:27 PMYes paypal use crypto but instead of eth many users was expecting the TRON blockchain its faster cheaper and more used.Eth transactions still too expensive i hope they start use TRON soon TRON is a good alternative but if they (paypal) think ETH works, then there is no harm in using eth. Maybe they will change their minds in the future when they see that ETH clearly doesn't work. What are the other institutions like paypal that use crypto? Notice that though, I am saying \"use crypto\", not \"hold crypto\". Tesla and Microstrategy hold crypto too but they don't use them. They are just holders. Paypal on the other hand, they are using crypto which is way better than holding crypto. Holding is fine but using crypto brings more adoption than holding and more adoption brings better prices.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husires",
      "created_time": "August 16, 2023, 06:51:40 AM",
      "body": "Quote from: Shortmaster on August 14, 2023, 02:42:27 PMYes paypal use crypto but instead of eth many users was expecting the TRON blockchain its faster cheaper and more used.Eth transactions still too expensive i hope they start use TRON soon A company like Paypal will not bet on losing their money or jeopardizing their investment in a highly centralized blockchain like TRON with relatively high fees and without any independent development compared to a blockchain like Ethereum.If you omit USDT then TRON is a dead network and will not have any big trading volumes, but Ethereum has value and tokens add extra value to it. They may change their policy in the future and add more blockchains, and then the additional options may be TRON, but it is not the first choice.Quote from: Sim_card on August 16, 2023, 04:10:25 AMI believe that PayPal must be following some directions from the US and that is why it is like this. Tron is also a good coins and both of the them have transaction fees are similar. I don't think that it is the transaction fee that was considered before PayPal chose to use ETH but there are some other factors that was considered.If they following some directions from the US then will choose some central blockchains",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "asriloni",
      "created_time": "August 16, 2023, 09:06:31 AM",
      "body": "Quote from: Shortmaster on August 14, 2023, 02:42:27 PMYes paypal use crypto but instead of eth many users was expecting the TRON blockchain its faster cheaper and more used.It's bullshit. Why does paypal need to trust a coin that owned by arrogant and irresponsible CEO like justin sun? it was only destroying the reputation of paypal. It's not faster but it has average TPS like another one or second layer blockchains that are available in the market right now. Did you say many users? Who the heck those users are? You? Tron was security.   it's blacklisted in US.  Quote from: Shortmaster on August 14, 2023, 02:42:27 PMEth transactions still too expensive i hope they start use TRON soon It's quite cheaper as long as you avoid to transfer in the busy hours. So many people were using this trick and it's worked. You can also use L2 as it's even faster than tron too. How can paypal needs to accept a coin which is not fully transparent? that reminds me with the case between sun vs oikos community.https://en.cryptonomist.ch/2020/07/03/justin-sun-distances-from-oikos/A few years have already passed but this story is still in my mind.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LittleBitFunny",
      "created_time": "August 16, 2023, 09:50:33 AM",
      "body": "Quote from: Jawhead999 on August 14, 2023, 02:50:11 PMDude? Tron network isn't faster and cheaper anymore, since the last year you need to pay around $2 as the fee. If you send Tron coin, it's definitely cheap, but if you send a token that run in Tron network, it's expensive.ETH and Tron fee are nothing different, actually Bitcoin fee is way more cheaper even though it's decentralized and has huge volume.Is this right? A few days ago, I did a transaction on Poloniex, and the Tron network transaction fee is still just $1 for USDT and the transaction fee will be less than $1 if you use Trx tokens. ETH still hasn't solved the problem of high gas fees since they switched to POS and they say that some more major updates are needed to solve the gas fee issue. There is a huge difference in ETH and Tron fees, mate.As for bitcoin fees, it can be said to be high or low depending on the time. But when you want to transact with a large amount of bitcoin, it won't be cheaper than the Tron network.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DeathAngel",
      "created_time": "August 16, 2023, 11:22:02 AM",
      "body": "They’re all slowly coming on board but it’s still a long way until absolute worldwide adoption. Banks are starting to offer crypto services, eventually they all will or risk becoming obsolete. Bitcoin will have a huge part to play in the future of finance so it’s a good idea to buy as much as you can now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "odunybiz",
      "created_time": "August 16, 2023, 03:37:06 PM",
      "body": "Quote from: Jawhead999 on August 14, 2023, 02:50:11 PMDude? Tron network isn't faster and cheaper anymore, since the last year you need to pay around $2 as the fee. If you send Tron coin, it's definitely cheap, but if you send a token that run in Tron network, it's expensive.I think OP is talking about Tron token itself and not Tron USDT or token built on Tron network. Transferring Tron token itself in most exchange is cheap as it cost just few cent.ETH and Tron fee are nothing different, actually Bitcoin fee is way more cheaper even though it's decentralized and has huge volume.Bitcoin should have been the best for any organization but since OP is trying to talk about cheap transaction here, I think BNB may be a better option.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dothebeats",
      "created_time": "August 17, 2023, 02:22:40 AM",
      "body": "Quote from: DeathAngel on August 16, 2023, 11:22:02 AMThey’re all slowly coming on board but it’s still a long way until absolute worldwide adoption. Banks are starting to offer crypto services, eventually they all will or risk becoming obsolete. Bitcoin will have a huge part to play in the future of finance so it’s a good idea to buy as much as you can now.It probably will someday, but it will still take some time. As ideal as it is, especially for us who have known and understand Bitcoin and the system, there are a lot of factors that need to be considered and will come into play in terms of absolute worldwide adoption. The most prominent one is of course the legality of it. Some, if not most, governments will either fully be against it or be 50-50 with the idea. It will take years as legal discussions and debates will surround this. It will happen but it will take a long time from now, and hopefully a more understanding legal system for each country.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}