{
  "id": "topic_5408593",
  "title": "348Judah",
  "author": "348Judah",
  "created_time": "August 03, 2022, 12:42:54 PM",
  "content": "We must feel relentless while informing crypto users of the dangers associated with the type of wallet used in securing thier crypto assets and i will like to give a strong warning about using an online hot wallet, there's a lot of risk in using a wallet that is closed source like hot wallet, it deprives you of your access at anytime because they have control over your wallet than you and when they were attacked as well, you both loose an unrecoverable asset, with the reason that it has high vulnerability for an attack which is beyond the exchange used itself, they have in possession all the credentials that you could use to access your wallet (private keys) and the only means to which one has is through the exchange while this is the last option with highest risk, know that the exchange can be hacked at any point in time and all users asset be stolen within a blink of an eye, here's the current situation with those investing on altcoins like Solana to be precise, over 8,000 users accounts have been hacked and many had suffered a victim of these https://www.coindesk.com/markets/2022/08/03/phantom-wallet-exploit-drains-millions-in-sol-tokens/What should you do right now to stay safe1. Quickly transfer all your coins from hot wallet if you use one2. I recommend the use of cold storage, hardware wallet to be precise which is open source3. Invest less on altcoins or majorly base your investment with bitcoin5. If you have control (keys) over your digital assets then its yours but if you don't, you're not safeI will advise basically on maintaining privacy and insecurities by avoiding hot wallets and altcoins investment if you want to have a good rest of mind with your cryptocurrency investment, invest in bitcoin except you're able to go for the ultimate risk in altcoins, avoid centralized exchanges, make use of a cold storage for the safety of your digital assets by using hardware wallets which are best well recommended.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5408593",
  "comments": [
    {
      "author": "bitmover",
      "created_time": "August 03, 2022, 02:18:24 PM",
      "body": "Quote from: 348Judah on August 03, 2022, 12:42:54 PM2. I recommend the use of cold storage, hardware wallet to be precise which is open sourceI believe this is the best advice to basically any user out there.If you are investing more than 2000 usd, there is no reason not to buy a hardware wallet.It is good and better to be open source code, but ledger nano is also a very good and safe option and it isn't open source. Quote3. Invest less on altcoins or majorly base your investment with bitcoinBitcoin is much safer than any other altcoin, and the best coin out there.It still have a high potential to grow",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Apocollapse",
      "created_time": "August 03, 2022, 03:05:12 PM",
      "body": "Quote from: 348Judah on August 03, 2022, 12:42:54 PMI will advise basically on maintaining privacy and insecurities by avoiding hot wallets and altcoins investment if you want to have a good rest of mind with your cryptocurrency investment, invest in bitcoin except you're able to go for the ultimate risk in altcoins, avoid centralized exchanges, make use of a cold storage for the safety of your digital assets by using hardware wallets which are best well recommended. If you're talking to maintaining privacy, then it's not recommended to use centralized hardware wallet since when you're want to order a hardware wallet, you need to write your full name, location, etc etc that would kill your privacy. Even there's a guide to bought a hardware wallet without losing your privacy, but not all countries offer that and sometime they're asking your ID when you want to pick up your package.The best way to have cold storage and wouldn't harm your privacy, is making your own cold storage but it's really hard, you can read it yourself [Guide] Secure air-gapped crypto wallet storage method",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dkbit98",
      "created_time": "August 03, 2022, 06:57:03 PM",
      "body": "Quote from: 348Judah on August 03, 2022, 12:42:54 PMI recommend the use of cold storage, hardware wallet to be precise which is open sourceI don't think it matters how you store shitcoins like solana, and even hardware wallets like ledger disabled their nodes, explorer and you can't move it from ledger, strange ''coincidence''.As far as I know there are no open source hardware wallet that is supporting crap like solana (Trezor is not supporting it for sure), and it's just waste of time and resources.Just use Bitcoin, it is supported by all hardware wallets and you are not going to see shitshows like this in development.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kamvreto",
      "created_time": "August 03, 2022, 07:48:03 PM",
      "body": "Quote from: 348Judah on August 03, 2022, 12:42:54 PM5. If you have control (keys) over your digital assets then its yours but if you don't, you're not safethere are still many suggestions that can be used to stay safe. About having control for Lock over your digital assets, it is very necessary to do. You are the one who holds the key, then it is your asset and only you can fully control it.If you use exchange storage you have no control whatsoever. It is best to hold your own keys by storing them in a hardware wallet. Storing on an exchange wallet will run the risk of losing it in the event of a hack because you have no control whatsoever.The best option is to invest in Bitcoin and everyone recommends bitcoin. Do not invest in altcoins that are not necessarily well developed. Bitcoin is the best digital asset, even stablecoins cannot be trusted at this time because the possibility of a crash will occur like UST.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Falconer",
      "created_time": "August 03, 2022, 08:52:13 PM",
      "body": "Quote from: 348Judah on August 03, 2022, 12:42:54 PMWhat should you do right now to stay safe1. Quickly transfer all your coins from hot wallet if you use one2. I recommend the use of cold storage, hardware wallet to be precise which is open source3. Invest less on altcoins or majorly base your investment with bitcoin5. If you have control (keys) over your digital assets then its yours but if you don't, you're not safeI want to know, where is your 4th point?Quote3. Invest less on altcoins or majorly base your investment with bitcoinI understand why many people think that way. If it's just about potential, I think bitcoin has always been considered the frontrunner in the long term. But when it comes to risk, bitcoin and altcoin are equally risky when it comes to investing. I don't want you to say what other people say, you need to have good knowledge and understanding to choose which asset is best for you. Altcoin also have potential and I really don't want to ignore them even though bitcoin is the first choice.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nakamura12",
      "created_time": "August 03, 2022, 09:29:47 PM",
      "body": "I understand that it is a precautions to keep your crypto safe. In short, if you can afford to buy hardware wallet then go ahead since you have money to spend but if you don't have spare money to buy hardware wallet then why not use the free ones because you can still keep your crypto safe. There are many ways to keep your crypto safe without buying hardware wallet either buying hardware wallet or use free wallet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sunsilk",
      "created_time": "August 03, 2022, 11:26:35 PM",
      "body": "Quote from: 348Judah on August 03, 2022, 12:42:54 PM3. Invest less on altcoins or majorly base your investment with bitcoinThis is a good advise although we really can't stop everyone and dictate them to decrease their investments in altcoins and focused more with bitcoin. They've got reasons in investing on altcoins and investing less in bitcoin because of its price. That's the first reason that I see why they're investing less in bitcoin.Soon, they'll realize how it is important to invest more in bitcoin and have it a huge part of their portfolios and nothing stops them from investing in alts but advises to lessen it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitMaxz",
      "created_time": "August 03, 2022, 11:36:48 PM",
      "body": "Quote from: Apocollapse on August 03, 2022, 03:05:12 PMIf you're talking to maintaining privacy, then it's not recommended to use centralized hardware wallet since when you're want to order a hardware wallet, you need to write your full name, location, etc etc that would kill your privacy. Even there's a guide to bought a hardware wallet without losing your privacy, but not all countries offer that and sometime they're asking your ID when you want to pick up your package.Are you talking about shipping this hardware wallet in your house that requires all of your personal documents?That wouldn't be a problem the hardware wallet itself is randomly generating a wallet it won't include your full name and it doesn't need IDs before you can able to use the hardware wallet. So you just surrender your privacy on where you bought the hardware wallet but the hardware wallet itself does not have such's full name and IDs to submit before you can able to use it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Darker45",
      "created_time": "August 04, 2022, 01:03:58 AM",
      "body": "Such a long post for only a couple of simple points.1. Avoid hot wallets. Choose a hardware wallet if possible.2. Avoid altcoins. Choose Bitcoin.Anyway, the funny thing is that Solana (SOL) is actually in green right now and it still remains in the top 10 as far as Coingecko is concerned. Quote from: bitmover on August 03, 2022, 02:18:24 PMIf you are investing more than 2000 usd, there is no reason not to buy a hardware wallet.$2,000 is too big a limit. I'd say, even if you only have $500 or $300 in Bitcoin right now, buy one. First, there's high probability that you will continue to stack Sats. Second, those hundreds of dollars in Bitcoin would become thousands of dollars in the near future. It is worth keeping.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "noorman0",
      "created_time": "August 04, 2022, 07:12:55 AM",
      "body": "Maybe this is a type of hacking via wallet access authorization, such as the cases of previous smartcontract exploitation. Surprisingly, if the user has more than 8K, which I believe does not involve only 1 to 2 platforms.I don't think that some of them use non-custody wallets only for security purposes. In fact, they do not equip themselves also with good management and care knowledge.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cheezcarls",
      "created_time": "August 04, 2022, 12:37:07 PM",
      "body": "Quote from: 348Judah on August 03, 2022, 12:42:54 PMWe must feel relentless while informing crypto users of the dangers associated with the type of wallet used in securing thier crypto assets and i will like to give a strong warning about using an online hot wallet, there's a lot of risk in using a wallet that is closed source like hot wallet, it deprives you of your access at anytime because they have control over your wallet than you and when they were attacked as well, you both loose an unrecoverable asset, with the reason that it has high vulnerability for an attack which is beyond the exchange used itself, they have in possession all the credentials that you could use to access your wallet (private keys) and the only means to which one has is through the exchange while this is the last option with highest risk, know that the exchange can be hacked at any point in time and all users asset be stolen within a blink of an eye, here's the current situation with those investing on altcoins like Solana to be precise, over 8,000 users accounts have been hacked and many had suffered a victim of these https://www.coindesk.com/markets/2022/08/03/phantom-wallet-exploit-drains-millions-in-sol-tokens/What should you do right now to stay safe1. Quickly transfer all your coins from hot wallet if you use one2. I recommend the use of cold storage, hardware wallet to be precise which is open source3. Invest less on altcoins or majorly base your investment with bitcoin5. If you have control (keys) over your digital assets then its yours but if you don't, you're not safeI will advise basically on maintaining privacy and insecurities by avoiding hot wallets and altcoins investment if you want to have a good rest of mind with your cryptocurrency investment, invest in bitcoin except you're able to go for the ultimate risk in altcoins, avoid centralized exchanges, make use of a cold storage for the safety of your digital assets by using hardware wallets which are best well recommended. Because of what happened in Solana exploit lately that targets users with Phantom Wallet or any other hot wallets out there, I have immediately transferred my USDC from my Phantom Wallet to Binance and then decided to exchange it to immediate cash via P2P. I tried to add Solana to my hardware wallet but there’s not enough space anymore as I am maintaining my Bitcoin balance. It consumes more space than other blockchains such as Binance Smart Chain, MATIC, etc., which they only average around 2 to 3 KB, whereas Solana is around 35 KB. I just don’t want to repeat the same mistake again like last time in which I am too complacent about storing my BUSD and other assets in Metamask and Trust Wallets respectively. Despite that they are non-custodial, they are still created in the internet and can be subject to exploit if we are not careful. It’s better to disconnect or revoke all permissions to be safe if you don’t have plans of using that certain website or app for long.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Apocollapse",
      "created_time": "August 04, 2022, 02:49:02 PM",
      "body": "Quote from: BitMaxz on August 03, 2022, 11:36:48 PMSo you just surrender your privacy on where you bought the hardware wallet but the hardware wallet itself does not have such's full name and IDs to submit before you can able to use it. Yeah that's what I wanted to say and I think we both agree if buying a hardware wallet will lose our privacy, I wouldn't think I'm completely 100% safe if I ever did share my identity to a stranger that have a relation with Bitcoin since anyone always think Bitcoin enthusiast is a millionaire.I would be love if in the future any hardware wallet company can accept P2P Bitcoin payment, so we don't need to create an account on online marketplace and much safer about our privacy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "August 05, 2022, 03:43:51 AM",
      "body": "I'd argue that you shouldn't \"invest\" in altcoins in first place to want to look for a cold storage.Altcoins are most suited for short term trading which means they should be stored on exchanges so that you have quick access to them when you want to quickly sell them before they dump it too much so that you lost a large portion of your initial investment.This is even more important when you see the number of confirmations some exchanges want for some of the altcoins which could take hours before they credit your account and by then price could have reached the bottom of the dump and it would be too late.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "348Judah",
      "created_time": "August 05, 2022, 07:50:02 AM",
      "body": "Quote from: bitmover on August 03, 2022, 02:18:24 PMI believe this is the best advice to basically any user out there.If you are investing more than 2000 usd, there is no reason not to buy a hardware wallet.exactly on point, the amount to use in purchasing a hardware wallet is too small than risking the entire asset to nothing, if truly one needs protection then it must be gotten at all cost because it will give a rest of mind. Quote from: bitmover on August 03, 2022, 02:18:24 PMIt is good and better to be open source code, but ledger nano is also a very good and safe option and it isn't open source.good idea, it also has a compactibility with mobile devices as well (ledger nono x) Quote from: Apocollapse on August 03, 2022, 03:05:12 PMIf you're talking to maintaining privacy, then it's not recommended to use centralized hardware wallet since when you're want to order a hardware wallet, you need to write your full name, location, etc etc that would kill your privacy. Even there's a guide to bought a hardware wallet without losing your privacy, but not all countries offer that and sometime they're asking your ID when you want to pick up your package.The best way to have cold storage and wouldn't harm your privacy, is making your own cold storage but it's really hard, you can read it yourself [Guide] Secure air-gapped crypto wallet storage methodThanks for this informative idea, many couldn't have thought about this as one of the ways we can get ourselves been exposed, this seems a salient aspect users may overlooked to mean nothing but one can actually be tracked down, going decentralized really means 100% KYC free. Quote from: dkbit98 on August 03, 2022, 06:57:03 PMAs far as I know there are no open source hardware wallet that is supporting crap like solana (Trezor is not supporting it for sure), and it's just waste of time and resources.Just use Bitcoin, it is supported by all hardware walletI'd thought about it as well on several occasions, bitcoin is generally acceptable by any kind of wallet while shitty coins don't have the support of the reputed wallets, some could have sensed this before now where Solana belong, everything about bitcoin has just been made perfect. Quote from: Falconer on August 03, 2022, 08:52:13 PMQuote from: 348Judah on August 03, 2022, 12:42:54 PMWhat should you do right now to stay safe1. Quickly transfer all your coins from hot wallet if you use one2. I recommend the use of cold storage, hardware wallet to be precise which is open source3. Invest less on altcoins or majorly base your investment with bitcoin5. If you have control (keys) over your digital assets then its yours but if you don't, you're not safeI want to know, where is your 4th point?Lol... Its an omission in numbering   but thanks for the observation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}