{
  "id": "topic_5467359",
  "title": "_act_",
  "author": "_act_",
  "created_time": "September 19, 2023, 06:13:05 PM",
  "content": "Yes, fingerprint bitcoin wallet unlock is the worst, but did you know that fingerprint unlock can still benefit you? I am an Android user but I think this can be done on iOS. iOS users can let us know if it can be done. This is it:Only enable pin or password unlock on your bitcoin wallet. Do not enable fingerprint because it will override your pin or password unlock and that is bad for your security because it makes your wallet not secure.After you enable pin or password unlock on your wallet. On your Android phone, go to security and enable the app lock for the apps that you want to be using fingerprint to be opening. If you do this and you enable fingerprint on your phone, the apps you enable will first demand for fingerprint unlock, follow by the pin or password unlock.Is this a good idea?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5467359",
  "comments": [
    {
      "author": "Findingnemo",
      "created_time": "September 19, 2023, 06:22:57 PM",
      "body": "Just another layer of security that is good on any platform, by this method you are opting out both fingerprint and PIN/password to enter into your wallet instead of one.This is not going to protect against malware attacks or anything like that but surely it is good to tackle in a situation when someone is trying to access your phone physically without your permission.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EL MOHA",
      "created_time": "September 19, 2023, 06:41:34 PM",
      "body": "This isn’t possible with iPhone later than XR because they don’t support fingerprint. This idea is a bit tricky because I think you need another app called the app lock to be able to use this procedure you stated. If it is so, isn’t it a very bad idea to have you wallet embedded into another app again. You never know what details that could be exposed to the app lock",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BIT-BENDER",
      "created_time": "September 19, 2023, 06:48:40 PM",
      "body": "This maybe a good idea to some but still glitch can happen, technological devices aren't immune from malfunction and glitches, like I said before my friend has at a time used his finger print to unlock my device although this happened only on one trial it did happen.I have not used the finger print option to Unlock my wallet and I have always felt completely safe, I think it's not much of a special security we should work ourselves over for.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nakamura12",
      "created_time": "September 19, 2023, 07:04:01 PM",
      "body": "This id exactly what I do which is to use the app lock feature in an android phone where you can't access or open the app because it requires you to input the pin or fingerprint before the app will open. For wallet, I haven't done this in my phone since I am not using the wallet installed in my phone very much or you could say It is not used all the time. I also think that this is much more okay than using only the fingerprint and no lock feature.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mpamaegbu",
      "created_time": "September 19, 2023, 07:25:37 PM",
      "body": "Quote from: _act_ on September 19, 2023, 06:13:05 PMOnly enable pin or password unlock on your bitcoin wallet. Do not enable fingerprint because it will override your pin or password unlock and that is bad for your security because it makes your wallet not secure.I use both (password & fingerprint) on my wallet and I haven't had any issues with such till date. What I'm reluctant to use is facelock and I've my reason for that. The fingerprint feature saves me the stress of hiding my phone from people in order to open it. All I do is stylishly slide my hand to the back of my phone and it's done, and I'm able to access my wallet. Anyone using the fingerprint option should enndeavour to have a manual password in addition to others. Sometimes, shit can happen and the finger goes numb, the phone not being able to read and grant access to the device.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "_act_",
      "created_time": "September 19, 2023, 07:36:31 PM",
      "body": "Quote from: EL MOHA on September 19, 2023, 06:41:34 PMThis idea is a bit tricky because I think you need another app called the app lock to be able to use this procedure you stated. If it is so, isn’t it a very bad idea to have you wallet embedded into another app again. You never know what details that could be exposed to the app lock I have been seen it on Android since I have been using Android many years ago, you will see it under security under settings.Quote from: BIT-BENDER on September 19, 2023, 06:48:40 PMThis maybe a good idea to some but still glitch can happen, technological devices aren't immune from malfunction and glitches, like I said before my friend has at a time used his finger print to unlock my device although this happened only on one trial it did happen.If the fingerprint is passed, pin or password would be needed to fully unlock the wallet. It is just an extra layer of protection.I have been using this with the little amount of coins I have on my mobile wallets and I like it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AprilioMP",
      "created_time": "September 19, 2023, 07:43:49 PM",
      "body": "Quote from: _act_ on September 19, 2023, 06:13:05 PM✂️Only enable pin or password unlock on your bitcoin wallet. Do not enable fingerprint because it will override your pin or password unlock and that is bad for your security because it makes your wallet not secure.After you enable pin or password unlock on your wallet. On your Android phone, go to security and enable the app lock for the apps that you want to be using fingerprint to be opening. If you do this and you enable fingerprint on your phone, the apps you enable will first demand for fingerprint unlock, follow by the pin or password unlock.What do you mean by providing a PIN to the coin storage wallet application or is it the same as providing a PIN to all applications installed on Android after turning on the screen?If that's what you really mean, I implemented it on the Android I use. This is effective for protecting our Android from the possibility of other people trying to tamper with our Android.I use two different pins on my android. The first PIN is to open the screen and the second PIN is to open the application.Quote from: _act_ on September 19, 2023, 06:13:05 PMIs this a good idea? For me it's good for a security layer.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hatchy",
      "created_time": "September 19, 2023, 07:50:58 PM",
      "body": "It's a good thing, that wallets these days have different categories of security before you can access them.my mobile wallet usually requires me to input pin before I'm able to access it's interface although it has a fingerprint feature which I haven't tried till now. I like the idea that when ever I exist or minize the app and return it also require me to input my password again. This will help a lot incase someone deceide to use my phone without my knowledge they won't be able to access my mobile wallet even if they want to. Again, we should always remember to use different types of password categories on our wallet and phone unlock system. This might be because if someone use same password to lock his phone and wallet. It would be easier for an invader to possibly spy you phones password and reuse same password to access your wallet. We have to be security consious",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Stedsm",
      "created_time": "September 19, 2023, 08:55:30 PM",
      "body": "I've also seen some wallets allowing face unlock, whereas fingerprint unlocks have been there since about 3-5 years IIRC. TBH, it's a 50-50 for me as, while it is convenient enough to just open up our wallet through the tap of our fingerprint instead of typing the wallet password or pin, it actually exposes us to the risk of getting robbed easily if the bad guys near you know that you're using crypto and if they ever see you using your fingerprint to open it up. Some wallets provide an extra layer of security by giving you an option to either add 2fa to your wallet when sending funds or just keep using fingerprint, and at that time too if you choose your fingerprint, then my friend, you're putting yourself in trouble.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Queentoshi",
      "created_time": "September 19, 2023, 09:03:47 PM",
      "body": "Quote from: _act_ on September 19, 2023, 06:13:05 PMThis is it:Only enable pin or password unlock on your bitcoin wallet. Do not enable fingerprint because it will override your pin or password unlock and that is bad for your security because it makes your wallet not secure.After you enable pin or password unlock on your wallet. On your Android phone, go to security and enable the app lock for the apps that you want to be using fingerprint to be opening. If you do this and you enable fingerprint on your phone, the apps you enable will first demand for fingerprint unlock, follow by the pin or password unlock.Is this a good idea? App lock is always a good feature to stop people from accessing various private applications on your phone, even when they have access to use your phone. I see the idea as a good one because it provides you extra security in form of a fingerprint to access the application first and then password or pin to open up the application after access. Plenty layers of security are always something that can frustrate anyone who has a plan to access these private applications you have like your wallet. With this idea, I will apply it and give my wallet an extra layer of secuirty.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nelson4lov",
      "created_time": "September 19, 2023, 10:22:39 PM",
      "body": "Quote from: _act_ on September 19, 2023, 06:13:05 PMYes, fingerprint bitcoin wallet unlock is the worst, but did you know that fingerprint unlock can still benefit you? I am an Android user but I think this can be done on iOS. iOS users can let us know if it can be done. This is it:Only enable pin or password unlock on your bitcoin wallet. Do not enable fingerprint because it will override your pin or password unlock and that is bad for your security because it makes your wallet not secure.After you enable pin or password unlock on your wallet. On your Android phone, go to security and enable the app lock for the apps that you want to be using fingerprint to be opening. If you do this and you enable fingerprint on your phone, the apps you enable will first demand for fingerprint unlock, follow by the pin or password unlock.Is this a good idea? The benefits for this isn't that much. Albeit, extra layer for authentication before the wallet can be accessed. If anything, it's a good idea as anything that pumps up the security of a system is good practice. But I wouldn't recommended relying 100% on such setup as Mobile wallet management is easily one of the most vulnerable wallet implementations. (not talking about vulnerabilities due to code/technical spec but inherent risks for physically held mobile wallets).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sokani",
      "created_time": "September 19, 2023, 10:42:01 PM",
      "body": "I've fingerprint security lock added to my electrum wallet as a second layer of security, and I also added password security when creating my wallet. So whenever I want to access my funds, I'll be required to enter my fingerprint and then the password to my wallet. The fingerprint lock is a good practice to ward off unauthorized access not just to your wallet but other apps installed on your phones. However, someone that's tech savvy can deactivate this feature by opening the app lock and turn it off or force stop it and clear the data.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hatshepsut93",
      "created_time": "September 19, 2023, 11:49:18 PM",
      "body": "Quote from: Findingnemo on September 19, 2023, 06:22:57 PMbut surely it is good to tackle in a situation when someone is trying to access your phone physically without your permission.A pin is already a solid defense against that, and adding a fingerprint strengthens the security, but doesn't make it impenetrable. The attacker might use their finger while the victim sleeps - a realistic scenario if the attacker is a close person to the victim. So no matter how good is the phone wallet security, it's only suitable for small amounts and not for all Bitcoin savings.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MusaMohamed",
      "created_time": "September 20, 2023, 12:41:56 AM",
      "body": "Quote from: _act_ on September 19, 2023, 06:13:05 PMYes, fingerprint bitcoin wallet unlock is the worst, but did you know that fingerprint unlock can still benefit you? Only enable pin or password unlock on your bitcoin wallet. Do not enable fingerprint because it will override your pin or password unlock and that is bad for your security because it makes your wallet not secure.After you enable pin or password unlock on your wallet. On your Android phone, go to security and enable the app lock for the apps that you want to be using fingerprint to be opening. If you do this and you enable fingerprint on your phone, the apps you enable will first demand for fingerprint unlock, follow by the pin or password unlock.Is this a good idea? I think it is a bad idea.The way Bitcoin blockchain and Bitcoin wallet are designed to protect Bitcoin holders are perfect. Protect your private keys, keep your devices clean, you are safe.You don't have to top up additional security layers to protect your wallet especially it is a wallet on your phone. Fingerprints, retina, face biometrics can not keep your devices safely from hacks. Think how safe or risky it is if you store big amount of bitcoin on your phone, with bigger value than the phone value?On phones, mobile devices, store very small amount of bitcoin, use it as your small hot wallet and honestly, if I lose my phone, I will regret because I lose the phone, not because I store high value of bitcoin on it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "1miau",
      "created_time": "September 20, 2023, 01:20:45 AM",
      "body": "Quote from: MusaMohamed on September 20, 2023, 12:41:56 AMOn phones, mobile devices, store very small amount of bitcoin, use it as your small hot wallet and honestly, if I lose my phone, I will regret because I lose the phone, not because I store high value of bitcoin on it.+1Very important point. I have heard from so many hacks from crypto stored on phones because it's always an easy target for hackers due to lack of security, like Trust wallet, Slope (Solana shitcoin) and many personal wallets, where we don't even hear from. Storing any sort of crypto on a phone is a big risk to get hacked. It is very insecure and should be avoided, phone is not a good location, where crypto should be stored.  Unfortunately, it seems to be very widespread for many countries, where people need to rely on their phones also for storing crypto, don't have another option, and get hacked easily.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lovesmayfamilis",
      "created_time": "September 20, 2023, 09:37:22 AM",
      "body": "If you are talking about security, the best is, of course, a separate hardware wallet. But in its absence, using a wallet on a mobile phone should be extremely careful. Everyone knows that a phone cannot be saved from viruses if the owner likes to install a bunch of applications, and even if he has a fingerprint unlock, viruses inside the phone will easily transfer all the information to hackers. In addition to maintaining online security, maintaining personal security, such as not disclosing your cryptocurrency affiliation, will also be important. Since we all know that if scammers are interested in the property inside the phone, applying their finger using brute force will not be difficult.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dunamisx",
      "created_time": "September 20, 2023, 10:11:17 AM",
      "body": "Quote from: _act_ on September 19, 2023, 06:13:05 PMYes, fingerprint bitcoin wallet unlock is the worst, but did you know that fingerprint unlock can still benefit you? I think there's one more advanced way that one can use without any stress to safeguard his wallet, this may not require the use of fingerprint or password, it's when you avoid your device being taken or accessed by any other person, when you completely make your device itself private and personal to you, there's no need to struggle yourself on security measures that much, if an hacker should have access to your device, they can unlock it no matter how the fingerprint or password was set, the priority first should be our seeds, private keys and then the device itself, if all these are taken care of, there's lower chances of being hacked except for a malicious malware on the device.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dr.Bitcoin_Strange",
      "created_time": "September 22, 2023, 08:58:06 PM",
      "body": "Usually, there is a cold wallet and a hot wallet. As a Bitcoiner, you always need to have those two wallets so that for your cold wallet, since you know it's going to hold a significant amount of Bitcoin, you don't need to sing into the wallet on your mobile Bitcoin wallet app again. You can just save your wallet address so that any time you want to deposit, you can do so without importing the wallet. But for your hot wallet too, since it's not also going to hold a huge amount, you don't really need to bother much about the fingerprint setup, but don't just allow unauthorized people to handle your phone. For me, I do have my hot wallet on mobile, and the app is bound by three different security lockups. You will need to open the first password, and it will still require another one, up to three different passwords. How I did it was that the first security was from the phone, and the second and third were two different app locker applications that I downloaded.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}