{
  "id": "topic_5471131",
  "title": "DVlog",
  "author": "DVlog",
  "created_time": "October 21, 2023, 10:57:05 AM",
  "content": "It sounds illogical to ask for a Bengali sub board for Bengali translation and press release because we don't have any local boards yet. But the way the Bengali board is hammered with translated topics and news source posts, it looks like spamming to many of us. I am not against translating informative topics created by global members with permission, but some members are using it as a loophole to rank up quickly. Every time someone translates a topic their post has been rewarded with 10 to 20 merits. As a native speaker, I can say that very few translators met the translation standard, and most of the translation was done by Google Translator and later edited a little bit and reposted. I can not blame global members for contributing to those topics, as they can not speak the language and have little understanding of it. There is nothing bad about ranking up but this loophole has been noticed by many new members who are also trying to use the same kind of tactics to attract merit sources, which leads to spamming the board. There are countless informative topics on the global board that can be translated into every local language, but that doesn't mean we need to translate them all at once. Translation should be done when the necessity of that topic arises.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5471131",
  "comments": [
    {
      "author": "jokers10",
      "created_time": "October 21, 2023, 11:33:53 AM",
      "body": "Quote from: DVlog on October 21, 2023, 10:57:05 AMTranslation should be done when the necessity of that topic arises.The more I look at this situation the more I see that motivating on a translation of some topics usually doesn't lead to what is expected. Right, there appears some translated text, but if a translator is not really interested in what he translated, then he doesn't support the topic, has nothing to unswer on appearing questions, etc. And the topic goes down, meating with very few interest and only on the start.For a topic to be active it should be kept up. So the OP should be interested in what he writes (or translates). Even if some topic is really infortmative but is not kept up, it will be forgotten really soon.The positive result of any topic including the translated one is when it is talked for weeks, months and even years. And not when it was only translated once and forgotten right after that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DVlog",
      "created_time": "October 21, 2023, 11:42:01 AM",
      "body": "Quote from: jokers10 on October 21, 2023, 11:33:53 AMQuote from: DVlog on October 21, 2023, 10:57:05 AMTranslation should be done when the necessity of that topic arises.The more I look at this situation the more I see that motivating on a translation of some topics usually doesn't lead to what is expected. Right, there appears some translated text, but if a translator is not really interested in what he translated, then he doesn't support the topic, has nothing to unswer on appearing questions, etc. And the topic goes down, meating with very few interest and only on the start.For a topic to be active it should be kept up. So the OP should be interested in what he writes (or translates). Even if some topic is really infortmative but is not kept up, it will be forgotten really soon.The positive result of any topic including the translated one is when it is talked for weeks, months and even years. And not when it was only translated once and forgotten right after that.As I have mentioned, most of the translators are using it as a loophole to rank up. Most of them have no interest in creating value from their translation. It seems they have found a easy way to attract some merit source. If global members stop sharing merit on translated topics, I bet the translation rate will decrease to 90%. TBH, I don't have any problem with the translation, but the way they are using it. It is not hard to differentiate between a translation done by Google Translate and an organic translation if you are a native speaker.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rikafip",
      "created_time": "October 21, 2023, 11:46:16 AMLast edit: October 21, 2023, 01:47:26 PM by Rikafip",
      "body": "Quote from: DVlog on October 21, 2023, 10:57:05 AMAs a native speaker, I can say that very few translators met the translation standard, and most of the translation was done by Google Translator and later edited a little bit and reposted.Have you reported that to the creators of the original topics as those are usually the ones that give most of the merit to them and as far as I know, they usually mention that use of automatic translation tools is forbidden. On top of that, its also against forum forum rules.Quote from: mprep on July 21, 2014, 05:27:51 PM27. Using automated translation tools to post translated content in Local boards is not allowed",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DVlog",
      "created_time": "October 21, 2023, 11:57:53 AMLast edit: October 22, 2023, 06:49:58 AM by DVlog",
      "body": "Quote from: Rikafip on October 21, 2023, 11:46:16 AMQuote from: DVlog on October 21, 2023, 10:57:05 AMAs a native speaker, I can say that very few translators met the translation standard, and most of the translation was done by Google Translator and later edited a little bit and reposted.Have you reported that to the creators of the original topics as those are usually the ones that give most of the merit to them and as far as I know, they usually mention that use of automatic translation tools is forbidden. On top of that, its also against forum forum rules.Quote from: mprep on July 21, 2014, 05:27:51 PM27. Using automated translation tools to post translated content in Local boards is not allowed.No, I didn't. There are so many of them. Here is just one example that I believe was translated through google Translate and later edited. I don't want to discourage these new members, but ignoring them about what they are doing can be bad for the future. I want them to be more helpful and want to see them contributing to the forum one day. I really do, but not this way. OP remove the link",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rikafip",
      "created_time": "October 21, 2023, 12:07:41 PM",
      "body": "Quote from: DVlog on October 21, 2023, 11:57:53 AMI don't want to discourage these new members, but ignoring them about what they are doing can be bad for the future. I want them to be more helpful and want to see them contributing to the forum one day.Well, there's no other way to make them stop other than calling them out and telling original creators what's going on and unless you do it, they will just keep doing that. Quote from: DVlog on October 21, 2023, 11:57:53 AMhttps://bitcointalk.org/index.php?topic=631891.msg63029027#msg63029027Its pretty obvious that this guy's English is not on the adequate level to even think about translating so no wonder that you suspect he uses Google translate.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "October 21, 2023, 12:09:37 PM",
      "body": "Quote from: DVlog on October 21, 2023, 10:57:05 AMThere is nothing bad about ranking up but this loophole has been noticed by many new members who are also trying to use the same kind of tactics to attract merit sources, which leads to spamming the board. There are countless informative topics on the global board that can be translated into every local language, but that doesn't mean we need to translate them all at once. Translation should be done when the necessity of that topic arises.Thanks for the warning. For a long time, I thought that this local board was a small group of 5-10 people with several alt accounts.I would be more careful before sending Merits to that board, but if you speak Bengali, can you add some samples of texts that were written with Google Translate or Keywords or anything that would help someone who does not speak that language doubt the quality of translations, or is that impossible?Send a PM to that Merit source if you suspect any behavior",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rat03gopoh",
      "created_time": "October 21, 2023, 12:15:51 PM",
      "body": "Quote from: DVlog on October 21, 2023, 10:57:05 AMEvery time someone translates a topic their post has been rewarded with 10 to 20 merits. Are your local smeriters not native speakers?Granting the new local board's request won't change this practice. I think the main problem isn't the translators, but you have a compulsive local smeriter. Try to conducive to this point first. I support providing your local board but not for the sole reason of wanting to prevent users from ranking up.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Solosanz",
      "created_time": "October 21, 2023, 12:18:57 PM",
      "body": "If theymos still not yet willing to create a dedicated board for Bengali, I'm really doubt he will do this request. Actually there's pinned message where it's forbidden to post translated content from your local thread.Quote from: https://bitcointalk.org/index.php?topic=2589999.0It is prohibited to create translated ICO threads for Local Languages that don't have their own sub boards. Due to abuse, it is also prohibited for users to create threads outside of their Local Thread. This sub forum is for those languages that don't have a local board to have their own thread to discuss bitcoin in; it is not a place for account farmers and spammers to easily abuse campaigns. If you post threads outside of your own local thread you will be banned.Quote from: hugeblack on October 21, 2023, 12:09:37 PMSend a PM to that Merit source if you suspect any behaviorSeems not really effective, @OP need to learn how to leave a feedback, he can leave a neutral feedback with a description of Google translate usage on the account, so other users can be more cautious before sending their merit.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DVlog",
      "created_time": "October 21, 2023, 12:27:02 PMLast edit: October 22, 2023, 06:49:09 AM by DVlog",
      "body": "Quote from: hugeblack on October 21, 2023, 12:09:37 PMQuote from: DVlog on October 21, 2023, 10:57:05 AMThere is nothing bad about ranking up but this loophole has been noticed by many new members who are also trying to use the same kind of tactics to attract merit sources, which leads to spamming the board. There are countless informative topics on the global board that can be translated into every local language, but that doesn't mean we need to translate them all at once. Translation should be done when the necessity of that topic arises.Thanks for the warning. For a long time, I thought that this local board was a small group of 5-10 people with several alt accounts.I would be more careful before sending Merits to that board, but if you speak Bengali, can you add some samples of texts that were written with Google Translate or Keywords or anything that would help someone who does not speak that language doubt the quality of translations, or is that impossible?Send a PM to that Merit source if you suspect any behaviorI can show you an example of two translations in which one can be suspected of being translated through google Translate and one is natural. I can also mention some words, but it can lead a non-native speaker to the wrong conclusion. Bengali is a tricky language, and sometimes the meaning of a word changes based on the way it is used in a sentence. It requires a separate topic and time to create. As an example if you follow this translation: OP remove the linkIt is verbatim correct, but it sounds like google Translation has been used. The structure of the sentence is not correct.Quote from: hugeblack on October 21, 2023, 12:09:37 PMthat would help someone who does not speak that language doubt the quality of translations, or is that impossible?It requires a separate topic and time to create.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lovesmayfamilis",
      "created_time": "October 21, 2023, 12:55:14 PM",
      "body": "Quote from: hugeblack on October 21, 2023, 12:09:37 PMThanks for the warning. For a long time, I thought that this local board was a small group of 5-10 people with several alt accounts.I still think that way. See what local users are saying about the influx of new accounts. Google Translate does a good job of making it clear that they're all probably here for the upcoming pumpkin contest that a bunch of accounts were so successful at last year and where they were actively passing merits on to each other.Quote from: Z_MBFM on October 07, 2023, 04:26:47 PMQuote from: Shishir99 on October 07, 2023, 03:31:05 PM আমাদের বাংলাদেশ থ্রেড টা কেনো জানি সোশ্যাল মিডিয়ার মতো মনে হচ্ছে। দরকারি তেমন কোনো পোস্ট চোখে পড়ছে না। থ্রেড এ ঢুকে কমেন্ট করার মতো ইন্টারেস্টিং তেমন কিছু চোখে পড়ছে না। এখানে যেকোনো বিষয় নিয়ে পোস্ট করক যাবে এটা জানি, কিন্তু তার মানে কি এই যে ম্যাক্সিমাম পোস্ট হবে এই সোর্স সেই সোর্স থেকে? রাজনীতি, খেলাধুলা সব ই আছে এখানে, নেই শুধু ক্রিপ্টো রিলেটেড পোস্ট গুলো। এই ব্যাপারে সবার সচেতন হওয়া জরুরী। সবাই যদি এভানে আবোল তাবোল পোস্ট করি, ভালো পোস্ট আসবে কই থেকে? সব তো আমরা আমরাই, বাইরের লোক এসে তো পোস্ট করে দিয়ে যাবে না। এগুলা হওয়ার কারন আছে এখানে বলার মতো তেমন কেউ নাই আর দুই এক জন যারা চিল্লায় তাদের চিল্লানোর কোনো দাম নাই। ইদানিং কেন নতুন একাউন্ট এর সংখ্যা এত বেড়ে চলেছে আর কেনইবা তারা শুধুমাত্র সোর্স পোস্ট করে যাইতেছে তা আমি খুব স্পষ্টভাবেই বুঝতে পারতেছি। তবে কিছুই করার নাই কারণ আমরাতো বাঙালি জাতি আমরা এইসব ছাড়তে পারবোনা কখনই। এখন যে নতুন অ্যাকাউন্টগুলো এখানে আসতেছে আমি গ্যারান্টি দিয়ে বলতে পারি এই সবগুলোই মাল্টি একাউন্ট এইগুলা কোনোটাই নতুন কোনো সদস্য না।আপনাদের কি মনে আছে অক্টোবর মাসে Halloween আর এই হ্যালোইনের উপলক্ষে ফোরামে একটা কুমড়া কনটেস্ট হবে। আর এ কারণেই এসব অ্যাকাউন্ট তৈরি করা হইতেছে কুমড়া কন্টেস্টে জয়েন কইরা মেরিট ফারমিং করার জন্য। আমি যা বললাম এগুলো সবাই নোট করে রাখতে পারেন এবারের কুমড়া কনটেস্টে হয়তোবা এমনও হতে পারে যে আমাগো বাংলাদেশ বোর্ড খ্যাতির চোদনে সোনার মেডেল পাবে। কথাটা হয়তোবা অনেকেই বুঝতে পারছেন। চিল্লাইয়া কোনো লাভ নাই তাই চিল্লান বাদ দিতেছি ধীরে ধীরে। Quote from: Learn Bitcoin on October 09, 2023, 12:46:04 PM আমাদের প্রধান সমস্যা গুলোর মধ্যে একটা হলো অন্য কে অতিরিক্ত ফলো করা। আমরা ভালো কিছু ফলো করি না। আমরা শুধু চেক করি অই লোক টা মেরিট পেলো কোন পোস্ট থেকে? কিভাবে পেলো? কি করে পেলো? এই ফলো করার রেজাল্ট অনেক ভয়াবহ। একজন একটা কাজ করে মেরিট পেয়েছে বলে যে আপনি করলে আপনি পাবেন, ব্যাপার টা সেরকম না। প্রায় অনেকদিন আগে একটা থ্রেড দেখলাম পোস্ট করলেই সেই থ্রেড এর ক্রিয়েটর ১০ টা করে মেরিট দিচ্ছে। তো বাংলাদেশের অনেক মানুষ সেখানে পোস্ট করেছে এবং অনেকে মেরিট ও পেয়েছে। কয়েক সপ্তাহ আগে দেখলাম সেটা নিয়ে গ্লোবালে থ্রেড ওপেন করে একজন বলছে যে এই একাউন্ট গুলো এক জনের। নইলে সবাই মিলে এই থ্রেড এ পোস্ট করলো কেনো আর সবাইকে থ্রেড ক্রিয়েটর মেরিট দিলো কেনো? সব সময় ফলো করা ভালো রেজাল্ট নিয়ে আসে না। মাঝে মাঝে খারাপ রেজাল্ট ও নিয়ে আসে। সুতরাং, মেরিট দেখলেই ঝাপিয়ে পড়ার দরকার নাই। In addition, they create low-quality themes, adding only a link and a picture. A newcomer who knows about forum image hosting from the very first days brings a smile. To stop this chaos, I have tagged a few enterprising people who post news simply by copying and pasting, and as soon as they stop doing this, I will remove the neutral tag from them. The forum is not against alternative accounts, but when it looks very defiant and shameless, you need to respond somehow.I've gathered some who signed up in October. You can find a lot of similarities in their posts and design posts. Also, check their stories; not a single account will make you feel like this is the person’s first time on the forum.https://bitcointalk.org/index.php?action=profile;u=3578442 Synonyms September 16, 2023, 07:00:07 PMhttps://bitcointalk.org/index.php?action=profile;u=3581193 cryptoWODL October 01, 2023, 05:49:44 PMhttps://bitcointalk.org/index.php?action=profile;u=3581291 BTC_pokaop  October 02, 2023, 10:48:36 AMhttps://bitcointalk.org/index.php?action=profile;u=3582693 Glaxe October 09, 2023, 08:29:26 AMhttps://bitcointalk.org/index.php?action=profile;u=3583714 Learn Crypto October 13, 2023, 04:27:08 PMhttps://bitcointalk.org/index.php?action=profile;u=3584075 theorys October 15, 2023, 09:37:48 AMhttps://bitcointalk.org/index.php?action=profile;u=3584158 DT_MEMBER October 15, 2023, 08:50:51 PMhttps://bitcointalk.org/index.php?action=profile;u=3585154 sportbitcoin October 20, 2023, 02:51:11 PM",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Shishir99",
      "created_time": "October 21, 2023, 01:15:51 PM",
      "body": "Quote from: DVlog on October 21, 2023, 12:27:02 PMAs an example if you follow this translation: https://bitcointalk.org/index.php?topic=631891.msg63029027#msg63029027It is verbatim correct, but it sounds like google Translation has been used. The structure of the sentence is not correct.I have reported the post already. It's obvious that the guy used a Google translator to translate the topic. The problem is that users saw that some members got merits by translating a few threads and they started to follow the same pattern to rank up quickly. Now there are some conflicts created in the local thread as well. Sometimes authors need to be careful when they approve translations. If they approve translations from newbies, more newbies will be interested to doing these things. Recently a user created a topic about Bitcoin and Gambling and got a merit from that topic which inspired him to create another account and create same topic to firm merits. This is typical behavior of bengali users.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Z_MBFM",
      "created_time": "October 21, 2023, 01:45:24 PM",
      "body": "Quote from: lovesmayfamilis on October 21, 2023, 12:55:14 PMIn addition, they create low-quality themes, adding only a link and a picture. A newcomer who knows about forum image hosting from the very first days brings a smile. To stop this chaos, I have tagged a few enterprising people who post news simply by copying and pasting, and as soon as they stop doing this, I will remove the neutral tag from them. The forum is not against alternative accounts, but when it looks very defiant and shameless, you need to respond somehow.Some of the shitposters and those who only post source link I already left them a natural tag which remains only as a feedback you can see in my trust option. I am a Bengali and regularly read Bengali board posts so I keep an eye on them.  And when they do the same thing again after I warn them several times, I tag themThere are many such shitposters and spammers not only in bangla board but in whole forum so I don't think we can blame whole bangladesh topic for them.  I always give instant feedback to users I suspect or have evidence of posting shit on the local board, which I will always continue to do.Pizza, Pie Baking Contest, Pumpkin Contest, WO topic,  have taken advantage of these and many accounts have ranked up among them who have less knowledge about other thing and they constantly post shitposts for complete signature requirement  And they create multiple accounts and transfer merit from one account to another and start signature hunting by making many accounts Full Members + rank",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lovesmayfamilis",
      "created_time": "October 21, 2023, 01:47:20 PM",
      "body": "They say that everything repeats itself in the world. I also remember the words of The Sceptical Chymist that if something can be misapplied on the forum, there will always be those who will do it. The Russian section also had a topic on translations. The same struggle was going on there; merits were given for translations, and many suddenly became translators, thereby quickly rising in rank. Similarly, there were accusations that someone used Google Translate. You can look at the topic; the hunt for merit is always obvious.https://bitcointalk.org/index.php?topic=3251187.3240 There were a lot of misunderstandings about translations. I think GazetaBitcoin has a good understanding of who can translate correctly and who is just looking for a good translator to avoid detection. Quote from: BD Technical on October 20, 2023, 04:23:57 PMবাংলায় অনুবাদ করার জন্য গুগল ট্রান্সলেটর বাদে আমি অন্য কি উপায়ে অনুবাদ করতে পারি যদি কেউ একটু বুঝিয়ে বলতেন? অগ্রিম ধন্যবাদ।",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "October 21, 2023, 01:47:49 PM",
      "body": "Quote from: DVlog on October 21, 2023, 12:27:02 PMIt requires a separate topic and time to create. If you have time that would be great or at least create a similar topic to -----> AI Spam Report Reference Thread (Bengali Spam Report Reference Thread)Quote from: lovesmayfamilis on October 21, 2023, 12:55:14 PMI've gathered some who signed up in October. You can find a lot of similarities in their posts and design posts. Also, check their stories; not a single account will make you feel like this is the person’s first time on the forum.This sounds great, but since the main goal of all these accounts is profit, if this group was of random people from Bangladesh, I think some of them would report bad posts in the hope of getting merits, so creating a separate topic in reputation board would be appropriate.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DVlog",
      "created_time": "October 21, 2023, 02:08:09 PM",
      "body": "Quote from: hugeblack on October 21, 2023, 01:47:49 PMQuote from: DVlog on October 21, 2023, 12:27:02 PMIt requires a separate topic and time to create. If you have time that would be great or at least create a similar topic to -----> AI Spam Report Reference Thread (Bengali Spam Report Reference Thread)I really wanted to, but it requires time and energy to moderate such a topic. My current profession requires most of my attention, so I think I will not be able to do that. But there are other members of our local board who have the expertise and knowledge to maintain such a topic. Learn Bitcoin, LDL, Little Mouse are some potential candidates to moderate such topics. I hope one of them or someone from our local board will start doing a thread like this.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Shishir99",
      "created_time": "October 21, 2023, 02:43:09 PM",
      "body": "Quote from: lovesmayfamilis on October 21, 2023, 01:47:20 PMI think GazetaBitcoin has a good understanding of who can translate correctly and who is just looking for a good translator to avoid detection. LOL. How did you find this post? I am kinda regular there but I did not notice this one before now. That user was looking for another tool to translate it so it does not look like he has used Google translator. It's like I am searching for a tool so it does not look like I have used a tool. Similar to generate a content using AI and using spinbot that will shuffle those words so AI detectors cannot detect it as AI written post. This is funny and sad at the same time. We are not going to learn these things. All we want is how we can do things easily and faster and we expect maximum result.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DVlog",
      "created_time": "October 21, 2023, 02:56:31 PM",
      "body": "Quote from: Shishir99 on October 21, 2023, 02:43:09 PMQuote from: lovesmayfamilis on October 21, 2023, 01:47:20 PMI think GazetaBitcoin has a good understanding of who can translate correctly and who is just looking for a good translator to avoid detection. LOL. How did you find this post? I am kinda regular there but I did not notice this one before now. That user was looking for another tool to translate it so it does not look like he has used Google translator. It's like I am searching for a tool so it does not look like I have used a tool. Similar to generate a content using AI and using spinbot that will shuffle those words so AI detectors cannot detect it as AI written post. This is funny and sad at the same time. We are not going to learn these things. All we want is how we can do things easily and faster and we expect maximum result. His intention was obvious. He figured out that using Google translator won't help him create organic translation and he must be thinking all those quality translations were done through tools which is not true. I assume he already looked for one on Google, but it wasn't better than google Translator, so asking an experienced translator is the easiest and most logical.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DYING_S0UL",
      "created_time": "October 21, 2023, 03:39:22 PM",
      "body": "Quote from: lovesmayfamilis on October 21, 2023, 01:47:20 PMI think GazetaBitcoin has a good understanding of who can translate correctly and who is just looking for a good translator to avoid detection. I have done multiple translations for Gazeta and he was always pleased with my work. To be honest, as a translator myself, I know that there is no magical tool to translate any content organically. None!!! I always had to use my own words. Sometimes I would even write down my translations on my diary in order to review them later properly. Yes, whenever I was stuck, I would PM him and use google to understand what it meant. But no copying, of course.But some users are abusing this system in order to earn quick merits, which is kinda sad.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Faisal2202",
      "created_time": "October 21, 2023, 04:30:04 PM",
      "body": "Quote from: DVlog on October 21, 2023, 10:57:05 AMIt sounds illogical to ask for a Bengali sub board for Bengali translation and press release because we don't have any local boards yet. But the way the Bengali board is hammered with translated topics and news source posts, it looks like spamming to many of us. I am not against translating informative topics created by global members with permission, but some members are using it as a loophole to rank up quickly. Every time someone translates a topic their post has been rewarded with 10 to 20 merits. As a native speaker, I can say that very few translators met the translation standard, and most of the translation was done by Google Translator and later edited a little bit and reposted. I can not blame global members for contributing to those topics, as they can not speak the language and have little understanding of it. There is nothing bad about ranking up but this loophole has been noticed by many new members who are also trying to use the same kind of tactics to attract merit sources, which leads to spamming the board. There are countless informative topics on the global board that can be translated into every local language, but that doesn't mean we need to translate them all at once. Translation should be done when the necessity of that topic arises.Your statement of \"Translation should be done when the necessity of that topic arises\" is totally wrong, like, I do agree with you that, many new members or old members try to translate topics even in my community many members try to do that, but I don't think the factor of necessity is worth to be mention here. Because there is no necessity at all but it's an open opportunity. If you think newcomers are doing wrong work, like using translators to translate the topics into the local language, and if that is against the rules of the OP of the topic, then you can open a case of it, easily. Or you can tell the OP of the topic about it.Besides all that, the reward that those OPs gave, either of 10 merits or 20, it is obviously not fixed, of course, they will reward you if they would like your work, but overall, you should encourage your local guys, to be creative and be legit too while translating the topics. If they still ignore you, just open a case and leave it to the moderators or DTs of the forum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}