{
  "id": "topic_5407320",
  "title": "Robert518",
  "author": "Robert518",
  "created_time": "July 23, 2022, 07:00:29 AM",
  "content": "Ishan Wahi, a former product manager at Coinbase Global Inc., his brother, Nikhil Wahi, and Ishan’s friend Sameer Ramani, have been charged with the first ever crypto insider trading tipping scheme.Damian Williams, the United States Attorney for the Southern District of New York, and Michael J. Driscoll, the Assistant Director-in-Charge of the New York Field Office of the Federal Bureau of Investigation (“FBI”) disclosed the information on Thursday.They alleged that the three were involved in “a wired fraud and wire fraud in connection with a scheme to commit insider trading in cryptocurrency assets by using confidential Coinbase information about which crypto assets were scheduled to be listed on Coinbase’s exchanges.”“Today’s charges are a further reminder that Web3 is not a law-free zone.  Just last month, I announced the first ever insider trading case involving NFTs, and today I announce the first ever insider trading case involving cryptocurrency markets.  Our message with these charges is clear: fraud is fraud, whether it occurs on the blockchain or on Wall Street.  And the Southern District of New York will continue to be relentless in bringing fraudsters to justice, wherever we may find them,” said US Attorney Darmian Williams.The FBI Assistant Director Michael J. Driscoll also expressed the FBI’s commitment to the protection of the integrity of all financial markets, regardless of the era.According to Driscoll, “Although the allegations in this case relate to transactions made in a crypto exchange – rather than a more traditional financial market – they still constitute insider trading.  As alleged, the defendants made illegal trades in at least 25 different crypto assets and realized ill-gotten gains totaling approximately $1.5 million.  Today’s action should demonstrate the FBI’s commitment to protecting the integrity of all financial markets – both ‘old’ and ‘new.’” Continue Reading: https://mycryptoparadise.com/ex-coinbase-manager-two-others-charged-with-crypto-insider-trading/",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5407320",
  "comments": [
    {
      "author": "DeathAngel",
      "created_time": "July 23, 2022, 08:37:27 AM",
      "body": "I understand why they’re in trouble but surely we must have consistency in these type of arrests & charges.  I mean for example why is Nancy Pelosi still walking free with her & her husbands obvious insider trading.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}