{
  "id": "topic_5440942",
  "title": "martyns",
  "author": "martyns",
  "created_time": "February 23, 2023, 08:20:27 AM",
  "content": "Technology has made life somehow easy for us today.In the days of our father,they had no idea about working online,all their work to make money were done physically,and with strength,either they engaged in mini or mega business that will provide money for them.We thank God for bitcoin,that came as a messiah,to enrich the hopeful.Now my father asks me about my shop,and where it's located,I told him I'm bitcointalking,and he doesn't know what I'm talking.What do yours tell you?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5440942",
  "comments": [
    {
      "author": "cryptoaddictchie",
      "created_time": "February 23, 2023, 08:26:27 AM",
      "body": "Quote from: martyns on February 23, 2023, 08:20:27 AMTechnology has made life somehow easy for us today.In the days of our father,they had no idea about working online,all their work to make money were done physically,and with strength,either they engaged in mini or mega business that will provide money for them.We thank God for bitcoin,that came as a messiah,to enrich the hopeful.Now my father asks me about my shop,and where it's located,I told him I'm bitcointalking,and he doesn't know what I'm talking.What do yours tell you?Theres no need to emphasize that their era isnt comparable today that are digital. Yes not much on their time but you must remember that your parents bled for you to be able to study and attain something in life. Yes bitcoin is now on hit globally but it doesnt mean our parents are stupid enough not to notice that world is changing. Lets not brag that we can do bitcoin talk or any money making online cause traditional business always work best in their own interest.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Plaguedeath",
      "created_time": "February 23, 2023, 08:34:20 AM",
      "body": "Quote from: martyns on February 23, 2023, 08:20:27 AMWe thank God for bitcoin,that came as a messiah,to enrich the hopeful.Now my father asks me about my shop,and where it's located,I told him I'm bitcointalking,and he doesn't know what I'm talking.God has nothing to do with Bitcoin and Bitcoin isn't created to make you or everyone else rich.It's make sense how your father don't understand about bitcointalking because your answer didn't even clear, it will raise many questions: does Bitcoin can talking? do you create a video about Bitcoin e.g. influencer, or exploring this forum (bitcointalk-ing).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NeuroticFish",
      "created_time": "February 23, 2023, 08:46:04 AM",
      "body": "Quote from: martyns on February 23, 2023, 08:20:27 AMWe thank God for bitcoin,that came as a messiah,to enrich the hopeful.As said, bitcoin was not made to make people rich. However, I cannot deny it, it can provide now and then easy jobs with quick and flawless payments.Quote from: martyns on February 23, 2023, 08:20:27 AMNow my father asks me about my shop,and where it's located,I told him I'm bitcointalking,and he doesn't know what I'm talking.What do yours tell you?Well, I think that you're doing it wrong. \"Bitcointalking\" is not supposed to be a job. Relying on posting on a forum as a stable source of income can easily lead to big problems.Lying your family about your job is imho even worse, although I clearly don't expect them to understand all this.Imho the proper way should be to have a stable job (maybe at a shop) and whatever (and whenever) you get some extra from campaigns on bitcointalk... treat is as a bonus, because that's what it is.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rikafip",
      "created_time": "February 23, 2023, 08:46:22 AM",
      "body": "Quote from: martyns on February 23, 2023, 08:20:27 AMNow my father asks me about my shop,and where it's located,I told him I'm bitcointalking,and he doesn't know what I'm talking.I don't think I know what you are talking about either. What do you mean by \"bitcointalking\"? Do you mean that you are advertising your services via bitcointalk or that you consider being in a signature campaign as a job and that's actually \"bitcointalking\". I can understand the former, but seeing latter as a full time job is a very dangerous thing, even if you are from a 3rd world country. Btw, I think that you just made up a new word lol.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Botnake",
      "created_time": "February 23, 2023, 09:07:35 AM",
      "body": "Quote from: Rikafip on February 23, 2023, 08:46:22 AMQuote from: martyns on February 23, 2023, 08:20:27 AMNow my father asks me about my shop,and where it's located,I told him I'm bitcointalking,and he doesn't know what I'm talking.I don't think I know what you are talking about either. What do you mean by \"bitcointalking\"? Do you mean that you are advertising your services via bitcointalk or that you consider being in a signature campaign as a job and that's actually \"bitcointalking\". I can understand the former, but seeing latter as a full time job is a very dangerous thing, even if you are from a 3rd world country. Btw, I think that you just made up a new word lol.  It’s a new word for me too. Thanks to OP lol.We all know relying from this signature campaign alone is totally risky, but believe it or not, posting in a signature campaign has given me bigger source of income compared to my day job, certainly because I’m just a minimum wage earner. However, I believe this bitcointalking should not be our only source of income. It’s good as a side hustle, but will never guarantee a stable job. Otherwise, you might struggle financially in the future once this bitcointalking will never be in demand.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "February 23, 2023, 09:07:51 AM",
      "body": "@martyns, do not see this forum as a job, you need alternatives even if some of your posts and activeness are providing some money for your through this forum. Look for other means of making money. I guess you are from a third world country, even this forum can create an opportunity for you to start your own work which can be an alternative. Just do not depend only on this forum is my advice.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Taskford",
      "created_time": "February 23, 2023, 10:55:04 AM",
      "body": "Quote from: martyns on February 23, 2023, 08:20:27 AMTechnology has made life somehow easy for us today.In the days of our father,they had no idea about working online,all their work to make money were done physically,and with strength,either they engaged in mini or mega business that will provide money for them.We thank God for bitcoin,that came as a messiah,to enrich the hopeful.Now my father asks me about my shop,and where it's located,I told him I'm bitcointalking,and he doesn't know what I'm talking.What do yours tell you?There era is different to what currently we have at the moment, They are been introduce to physical jobs since modern technology is not so famous at that time and work loads are manually done by workers. If your father ask about that out of curiosity maybe try to make him understand about latest trend of technology where people can work at home and for sure he understand that this is the new evolution of work force and will not be ignorant if they here this information to other people.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "UchihaSarada",
      "created_time": "February 23, 2023, 11:14:38 AM",
      "body": "Quote from: martyns on February 23, 2023, 08:20:27 AMNow my father asks me about my shop,and where it's located,I told him I'm bitcointalking,and he doesn't know what I'm talking.Bitcointalk is not ATM for you and you can not work here forever.If you are young, you can work in Bitcointalk and learn to work at other working locations, shops, companies, super markets or work as free-lancer but don't depend on Bitcointalk. If you only work here, when Bitcointalk shuts down, you will be burned.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cointxz",
      "created_time": "February 23, 2023, 11:21:13 AM",
      "body": "Quote from: martyns on February 23, 2023, 08:20:27 AMTechnology has made life somehow easy for us today.In the days of our father,they had no idea about working online,all their work to make money were done physically,and with strength,either they engaged in mini or mega business that will provide money for them.We thank God for bitcoin,that came as a messiah,to enrich the hopeful.Now my father asks me about my shop,and where it's located,I told him I'm bitcointalking,and he doesn't know what I'm talking.What do yours tell you?I’m surprised that you are using the forum as main source of income especially that you are still a full member since the pay rate is low per post. I’m Legendary rank here and enrolled on one of the prestigious signature campaign here but I still work on a corporate with above minimum wage salary and do business at the same time that managed by my wife just to have a good savings and a better future for my daughter.It’s still good to have a main job that can give you a fixed salary instead on focusing here and just do nothing after finishing your post quota. Just use the forum as a side hustle so that you can have a better savings in the future.What I’m saying to my parents? None because I can earn decent money on my salary even when I don’t have business and use the forum earning for my personal leisure time such as gambling and buying things online.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zaguru12",
      "created_time": "February 23, 2023, 11:28:57 AM",
      "body": "Bitcointalk earnings has no doubt help some people meet up with some expenses mostly for people living in the third world countries where their cost of living isn’t expensive. But this is just a forum and the campaign run on them could end so one needs to diversify by making income off the forum. A side work apart from anything related to bitcoin or cryptocurrency is should be a better alternative. Your dad questioning of your shop simply signifies that he is curious of where you got the money you spent comes from. And from this explanation of yours I still think he might still be doubtful because older generations tend to associate every earn from the internet to cybercrime. So you might need a better way to convince him",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "February 23, 2023, 11:40:44 AM",
      "body": "Quote from: Rikafip on February 23, 2023, 08:46:22 AM~snip~I can understand the former, but seeing latter as a full time job is a very dangerous thing, even if you are from a 3rd world country. The OP is from one of those countries that (at least judging by the forum activities) is not one of those that really offer any great opportunities in life, so I understand why some people treat the forum as a place where they generate their main income. Some data say that the minimum wage in Nigeria is about $75 or even less, or about $0.40 per hour. It's not that I don't agree that it's a bad idea to rely on the forum as a main source of income, but sometimes people just don't have much choice.Quote from: UchihaSarada on February 23, 2023, 11:14:38 AM~snip~If you are young, you can work in Bitcointalk and learn to work at other working locations, shops, companies, super markets or work as free-lancer but don't depend on Bitcointalk. If you only work here, when Bitcointalk shuts down, you will be burned.You seem pretty confident that the forum will shut down, although I don't think there's any reason for that to happen as long as there's interest in Bitcoin and all other cryptocurrency-related activities in general. Things could change in the future when people no longer want to communicate in this way, and then the forum could simply slowly fade into oblivion - and maybe it will become the subject of study by some historians and we will all end up in some digital museum",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Saisher",
      "created_time": "February 23, 2023, 12:18:16 PM",
      "body": "Quote from: martyns on February 23, 2023, 08:20:27 AMTechnology has made life somehow easy for us today.In the days of our father,they had no idea about working online,all their work to make money were done physically,and with strength,either they engaged in mini or mega business that will provide money for them.We thank God for bitcoin,that came as a messiah,to enrich the hopeful.Now my father asks me about my shop,and where it's located,I told him I'm bitcointalking,and he doesn't know what I'm talking.What do yours tell you?Your father may not aware that there is such a thing as work from home or online work because he is not well acquainted in the internet he is a traditional worker who worked 8 to 5, its better to explain this to your father, its your father, he has the right to know what his son's work and where he works and you can also explain to your father what Bitcoin is and internet if he still do not know how things work in the internet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pandu Geddon",
      "created_time": "February 23, 2023, 12:39:23 PM",
      "body": "Quote from: martyns on February 23, 2023, 08:20:27 AMWhat do yours tell you?do not mean to demean your father, but from what you described at the beginning, it seems that your father is quite old and may not keep up with technological developments. it doesn't matter, but you still have to explain in simple terms how you work and earn money.so you are a full time person in Bitcoin trading?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lovesmayfamilis",
      "created_time": "February 23, 2023, 12:48:10 PM",
      "body": "Quote from: Lucius on February 23, 2023, 11:40:44 AMQuote from: Rikafip on February 23, 2023, 08:46:22 AM~snip~I can understand the former, but seeing latter as a full time job is a very dangerous thing, even if you are from a 3rd world country. The OP is from one of those countries that...You said that I, having read posts before yours, also wanted to answer. We often read that young people in Nigeria, even after education, still cannot get a good job, and participation in a subscription company is still better than just sitting around doing nothing. Other than that, I think that the OP is not just writing posts, but reading the forum day by day and gaining new knowledge.  Namely, knowledge is a good companion for further job search.But as for the parents, OP, I think that even telling them that you get paid to post on the forum will be difficult for your father to understand, since the older generation is used to working physically. Just like my parents, who are very suspicious of the computer, seeing it only as a toy as they watch their grandchildren play on it,",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "un_rank",
      "created_time": "February 23, 2023, 01:06:00 PM",
      "body": "Remote work was a thing before bitcoin, with platforms like Elance were one could find remote work dating back to 1999, far before bitcoin was launched. When you put it into perspective that remote workers existed before such platforms and were available in some business, you understand that the previous generation contributed to laying the foundation we have today.Quote from: martyns on February 23, 2023, 08:20:27 AMbitcoin,that came as a messiah,to enrich the hopeful.Bitcoin was invented to allow unregulated transactions without the need for a third party. Any other benefit is a plus.- Jay -",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Renampun",
      "created_time": "February 23, 2023, 01:31:25 PMLast edit: February 23, 2023, 03:03:15 PM by Renampun",
      "body": "Quote from: martyns on February 23, 2023, 08:20:27 AMTechnology has made life somehow easy for us today.In the days of our father,they had no idea about working online,all their work to make money were done physically,and with strength,either they engaged in mini or mega business that will provide money for them.We thank God for bitcoin,that came as a messiah,to enrich the hopeful.based on the religion that I believe in, humans and everything created by humans was created by god (that means including bitcoin), bitcoin is a change and also proof that humans continue to live and develop, bitcoin is a miracle.Quote from: martyns on February 23, 2023, 08:20:27 AMNow my father asks me about my shop,and where it's located,I told him I'm bitcointalking,and he doesn't know what I'm talking.What do yours tell you?@OP, are you really making this forum your full-time job, I think it's too risky! back to your question, if I were you, I would explain to my dad slowly about bitcoin, and show videos from youtube that can be easily understood by people who have never even heard of what online business is - cryptocurrency - digital currency (I've done this to my father).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rikafip",
      "created_time": "February 23, 2023, 01:44:01 PM",
      "body": "Quote from: Botnake on February 23, 2023, 09:07:35 AMWe all know relying from this signature campaign alone is totally risky, but believe it or not, posting in a signature campaign has given me bigger source of income compared to my day job, certainly because I’m just a minimum wage earner.I am not surprised at all that some people make more money via signature campaigns than they do via their rl jobs and I think that's one of the great things about bitcointalk. Even theymos is aware of the fact that many people depend on bitcointalk and that's one of the reasons why I don't think that signature/bounty campaigns are going anywhere.Quote from: Lucius on February 23, 2023, 11:40:44 AMThe OP is from one of those countries that (at least judging by the forum activities) is not one of those that really offer any great opportunities in life, so I understand why some people treat the forum as a place where they generate their main income. I am well aware of that and who knows, maybe I would do the same if I was in their position but I think that whoever is \"bitcointalking\" only by doing signatures campaigns is limiting himself as there is a whole section where you can offer your services (from the most simple things Telegram/Discord admin that anyone with smartphone can do, to more demanding ones like design etc ).I would compare it to a bounty hunter issue, but just on a higher level because both of those groups of members are limiting themselves instead of trying to get out of their comfort zone and put more effort into developing skills that can make them more competitive on the job market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "salad daging",
      "created_time": "February 23, 2023, 02:39:20 PM",
      "body": "It's the same with my parents, with an age range of 50/60 years now, what is clear is that they used to earn money by means of physical work because the technology is not as sophisticated as it is now and you understand that working in a shop is the most common job, while they are still beginning to technology on the internet sometimes parents also don't believe they can make money from it while sitting at the computer.Because I don't just rely on forums with my own signature campaign I'm still working in a company and opening a small business so my parents don't ask that deeper because I know I'm still in that circle so no longer questions about what they want to know my side job here.If your parents keep asking about your work, then you only rely on it on the forum as income, then just say that I get paid for promoting on the bitcointalk forum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Doan9269",
      "created_time": "February 23, 2023, 02:50:38 PM",
      "body": "Quote from: martyns on February 23, 2023, 08:20:27 AMTechnology has made life somehow easy for us today.In the days of our father,they had no idea about working online,all their work to make money were done physically,and with strength,either they engaged in mini or mega business that will provide money for them.We thank God for bitcoin,that came as a messiah,to enrich the hopeful.Now my father asks me about my shop,and where it's located,I told him I'm bitcointalking,and he doesn't know what I'm talking.What do yours tell you?Bitcointalk community can actually provide you with many expositions to opportunities in this current digital economy of finance, aside from the bitcoin investment it positions your eyes to see and know how to do, you can also get an opportunity in participating from a signature campaign but that isn't the main purpose for the forum, but rather an added advantages, you learn and acquire knowledge here that applies to your bitcoin investment and personal life in general, the richest people are not the ones that do hard labour, but yet during their time they make effective utilization of every potentials they've got to make a financial freedom and our present generation got everything improved than before with the introduction of bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}