{
  "id": "topic_5455216",
  "title": "Perfectbaby",
  "author": "Perfectbaby",
  "created_time": "June 05, 2023, 07:59:19 PM",
  "content": "Greetings my people una good evening oo, how una dey and how you dey see the new government for your side.Abeg make una no vex, i know say this questions looks very silly but i need to know something wey me no sabi. Like this e get small small things i dey see for the forum which i need to know make e no be like say me dey jones.Like wetin be the acronym for DT1, and DT2.You fit drop am here nd also write down somethings wey you know say we suppose sabi but due to the abbreviations e dey confused beginner like us, so like this i go want make una drop here for this thread so that even newbies like us and more to come fit get OT wey those things be for the forum.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5455216",
  "comments": [
    {
      "author": "Hyphen(-)",
      "created_time": "June 05, 2023, 08:29:27 PM",
      "body": "The full meaning of DT na Default Trust.DT1 na person wey Theymos wey be the forum administrator trust.DT2 na if person wey Theymos trust come trust another person, that person na him be DT2.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Doan9269",
      "created_time": "June 07, 2023, 03:03:30 PM",
      "body": "Talking about the issue on DT matters, it's not a must you must be a DT member before you ca be trusted, you will gain people's trust the more they see you often performing well at doing what you can do best, being a DT does not place you more knowledgeable than other non DT members, you have to the right to customize your own trust list and list anyone you trusted there, the reason for that is on fare and accurate judgement needed from you whenever matters arising happened that needs a fair and free judgement.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptSafe",
      "created_time": "June 08, 2023, 10:08:53 AM",
      "body": "Wow I think this is a good point you made  OP.  Knowing the meaning of acronyms here matters alot as not all would be able to start writing long grammers that can be easily written in short form. I did something of that nature while reading through the beginners and help board. Mostly newbies are curious about these as they frequent this platform as it would help them understand things hereHere is the link to the topic where newbies can easily access the  acronyms and their meanings.I think this would be of great help for all.https://bitcointalk.org/index.php?topic=5455635.msg62370045#msg62370045",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Smartvirus",
      "created_time": "June 08, 2023, 11:13:27 PM",
      "body": "Quote from: Hyphen(-) on June 05, 2023, 08:29:27 PMThe full meaning of DT na Default Trust.DT1 na person wey Theymos wey be the forum administrator trust.DT2 na if person wey Theymos trust come trust another person, that person na him be DT2.Our brother here don talk am well but still, I go like add say, the DT thing na only for forum here na em e dey. Na here e start and end. E no really follow for the crypto matter but, we dey carty am for forum here dey regulate some kind misbehaviours like person spam posting, scamming other users, put hand for watin go drag quality of content down for the forum like plagiarism, give directives on who be better person and who you need dey carry better eye look before you deal with am. The position no be ultimate but, e don help to put plenty things in check and e dey serve as deterrent to anybody way dey plan or hope say, e fit do as e like and go free, say nothing go happen. Your account go just red.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mate2237",
      "created_time": "June 09, 2023, 09:14:35 PM",
      "body": "Quote from: Hyphen(-) on June 05, 2023, 08:29:27 PMThe full meaning of DT na Default Trust.DT1 na person wey Theymos wey be the forum administrator trust.DT2 na if person wey Theymos trust come trust another person, that person na him be DT2.Op Hyphen(-) don give justice to do mata or di question wey u carry come here. You tried for bringing it 2 di local level so dat u go do well in di general boards. DT people nai dey give trust, neutral and red (negative) feedbacks. Though other people sef fit give but their own nai sure pass. Like as Hyphen(-) tok am na so di matter just be. So take am like dat. Any other questions wey u know sae wan ask be feel free to ask because na from there u go dey learn fast.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Igebotz",
      "created_time": "June 11, 2023, 06:44:37 PMLast edit: June 11, 2023, 10:39:51 PM by Igebotz",
      "body": "Quote from: Hyphen(-) on June 05, 2023, 08:29:27 PMThe full meaning of DT na Default Trust.DT1 na person wey Theymos wey be the forum administrator trust.DT2 na if person wey Theymos trust come trust another person, that person na him be DT2.This is not how the DT system works, I'm a DT1 and I'm not on theymos trust list, for you to be eligible for the DT1 election you must obtain this 7 requirements",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptopreneurBrainboss",
      "created_time": "June 11, 2023, 07:34:45 PM",
      "body": "Quote from: Hyphen(-) on June 05, 2023, 08:29:27 PMThe full meaning of DT na Default Trust.DT1 na person wey Theymos wey be the forum administrator trust.DT2 na if person wey Theymos trust come trust another person, that person na him be DT2.If I dey mark you, ur first point correct and the third point correct somehow but wetin spoil am na the second point. For people wey no understand wetin Igebotz dun talk, the Trust system been dun change and even since new criteria dun come wey dey make D1 dey change monthly. Every first week of the month (mostly 1st of the month) we dey get new dt1 members which some old members dey still dey among but atleast we dey get some new additional dt 1 member because of the criteria wey Igebotz dun explained. As DT 1 dey change monthly that means DT 2 they also change, currently you no need theymos before you fit qualify for any of the dt levels DT na people wey DT1 dem trust but if person been dun exclude you from their custom trust list then you go need atleast two DT 1 to trust you before you fit become dt2. If you dey very active for scam bursting and people trust your feedback or your face show for the forum via merits and been included in others people custom trust list because dem trust your judgement then, you go fit make am into DT 1. Basically na something like politics now, you go need dey active, get a specific amount of merit and then atleast 10 people go include you form their custom trust list before you become DT 1 member. (Read more for the link wey Igebotz drop).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sexylizzy2813",
      "created_time": "July 04, 2023, 03:43:24 AM",
      "body": "True true person wey dy ask questions no dy ever miss road for this life, I thank una wey open eye create this local board like this. See nah, if not for this board where abi nah who I wan go ask for this big Forum say \"what's the meaning of DT1 or DT2?\" wey them no go laugh me first before I get answer.Oga IGEBOTZ and CRYPTOPRENEURBRAINBOSS with other piple wey give better meaning to this DT1 and DT2, I thank una plenty.Ma see if I go fit follow for the next DT1 DT2 election as IGEBOTZ talk😂OP me I thank you specially for bringing this up...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "July 04, 2023, 02:14:29 PM",
      "body": "Quote from: Sexylizzy2813 on July 04, 2023, 03:43:24 AMSee nah, if not for this board where abi nah who I wan go ask for this big Forum say \"what's the meaning of DT1 or DT2?\" wey them no go laugh me first before I get answer.This is kind of off-topic. You can ask question on English board on this forum too, if you have a valid question to ask. There are questions like this on the English board which are also answered perfectly and no one laugh at the people that ask the question. Helping others is what a forum meant to be and that is one of the reasons Bitcointalk is existing. Even if you do not want people to know that you are the one that ask a question, just create a new account to ask the question which is not against any rule on this forum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Agbe",
      "created_time": "July 04, 2023, 03:52:43 PM",
      "body": "As for me the main Default Trust System is not even the DT1/2 trusting themselves but how the forum users trust you from their minds. Some of the DT members wey theymos trust dey misuse di trust system and di same goes to di DT2. Some of di DT members wey been dey do well for di forum now e don dey walks with some bad eggs. So with all dis nonsense wey dey happen for di forum, DT system e no dey like that again. Na di one wey di people trust na be the DT now. I really like wey Igebotz tok 4 won of di post. I love am well well.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "letteredhub",
      "created_time": "July 05, 2023, 09:03:06 PM",
      "body": "Quote from: Agbe on July 04, 2023, 03:52:43 PMAs for me the main Default Trust System is not even the DT1/2 trusting themselves but how the forum users trust you from their minds. Some of the DT members wey theymos trust dey misuse di trust system and di same goes to di DT2. Some of di DT members wey been dey do well for di forum now e don dey walks with some bad eggs. So with all dis nonsense wey dey happen for di forum, DT system e no dey like that again. Na di one wey di people trust na be the DT now. I really like wey Igebotz tok 4 won of di post. I love am well well.For Theymos to give any member DT1 then that mean say that member don really work him time for the forum to earn such default trust from Theymos. Wether other DT1 dem the abuse the trust gibine to them like you call am bad eggs, that one na their own wahala. The truth for life be say in every 12 there must be a Judas. The DT system in my opinion still dey make sense for the forum as an organized system.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Igebotz",
      "created_time": "July 05, 2023, 10:52:55 PM",
      "body": "Quote from: Sexylizzy2813 on July 04, 2023, 03:43:24 AMOga IGEBOTZ and CRYPTOPRENEURBRAINBOSS with other piple wey give better meaning to this DT1 and DT2, I thank una plenty.Ma see if I go fit follow for the next DT1 DT2 election as IGEBOTZ talk😂Anyone from full member rank who meets the seven requirements listed above is eligible for DT1 voting . It is recommended that you create your own trust list, and not being on the DT should not prevent you from giving out feedback where and when it is appropriate; it may not be visible now, but one day you will make it into the DT and all your tags will be visible to the community. I started handing out tags even before I joined the DT; it's a nice habit to get into.Quote from: letteredhub on July 05, 2023, 09:03:06 PMQuote from: Agbe on July 04, 2023, 03:52:43 PMAs for me the main Default Trust System is not even the DT1/2 trusting themselves but how the forum users trust you from their minds. Some of the DT members wey theymos trust dey misuse di trust system and di same goes to di DT2. Some of di DT members wey been dey do well for di forum now e don dey walks with some bad eggs. So with all dis nonsense wey dey happen for di forum, DT system e no dey like that again. Na di one wey di people trust na be the DT now. I really like wey Igebotz tok 4 won of di post. I love am well well.For Theymos to give any member DT1 then that mean say that member don really work him time for the forum to earn such default trust from Theymos. Wether other DT1 dem the abuse the trust gibine to them like you call am bad eggs, that one na their own wahala. The truth for life be say in every 12 there must be a Judas. The DT system in my opinion still dey make sense for the forum as an organized system. theymos do not appoint or elect DT1 members; the system is decentralised, and the community votes for DT1 election. If theymos has DT1 position, anybody he adds to his trust becomes a DT2, exactly like every DT1. theymos have no authority to choose or moderate the DT system.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "letteredhub",
      "created_time": "July 06, 2023, 09:05:03 AM",
      "body": "Quote from: Igebotz on July 05, 2023, 10:52:55 PMQuote from: Sexylizzy2813 on July 04, 2023, 03:43:24 AMOga IGEBOTZ and CRYPTOPRENEURBRAINBOSS with other piple wey give better meaning to this DT1 and DT2, I thank una plenty.Ma see if I go fit follow for the next DT1 DT2 election as IGEBOTZ talk😂Anyone from full member rank who meets the seven requirements listed above is eligible for DT1 voting . It is recommended that you create your own trust list, and not being on the DT should not prevent you from giving out feedback where and when it is appropriate; it may not be visible now, but one day you will make it into the DT and all your tags will be visible to the community. I started handing out tags even before I joined the DT; it's a nice habit to get into.Quote from: letteredhub on July 05, 2023, 09:03:06 PMQuote from: Agbe on July 04, 2023, 03:52:43 PMAs for me the main Default Trust System is not even the DT1/2 trusting themselves but how the forum users trust you from their minds. Some of the DT members wey theymos trust dey misuse di trust system and di same goes to di DT2. Some of di DT members wey been dey do well for di forum now e don dey walks with some bad eggs. So with all dis nonsense wey dey happen for di forum, DT system e no dey like that again. Na di one wey di people trust na be the DT now. I really like wey Igebotz tok 4 won of di post. I love am well well.For Theymos to give any member DT1 then that mean say that member don really work him time for the forum to earn such default trust from Theymos. Wether other DT1 dem the abuse the trust gibine to them like you call am bad eggs, that one na their own wahala. The truth for life be say in every 12 there must be a Judas. The DT system in my opinion still dey make sense for the forum as an organized system. theymos do not appoint or elect DT1 members; the system is decentralised, and the community votes for DT1 election. If theymos has DT1 position, anybody he adds to his trust becomes a DT2, exactly like every DT1. theymos have no authority to choose or moderate the DT system.Alright mate. I appreciate the clarification about the whole DT system and how's been done. I otherwise thought He Theymos has such authority but now seeing it a a democratic procedure of attainment it now makes more sense.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaNNy001",
      "created_time": "July 06, 2023, 02:24:03 PM",
      "body": "Quote from: Igebotz on July 05, 2023, 10:52:55 PMQuote from: Sexylizzy2813 on July 04, 2023, 03:43:24 AMOga IGEBOTZ and CRYPTOPRENEURBRAINBOSS with other piple wey give better meaning to this DT1 and DT2, I thank una plenty.Ma see if I go fit follow for the next DT1 DT2 election as IGEBOTZ talk😂Anyone from full member rank who meets the seven requirements listed above is eligible for DT1 voting . It is recommended that you create your own trust list, and not being on the DT should not prevent you from giving out feedback where and when it is appropriate; it may not be visible now, but one day you will make it into the DT and all your tags will be visible to the community. I started handing out tags even before I joined the DT; it's a nice habit to get into.Before now I never truly understood how the whole DT system works but all what you said and explained am pretty sure how its works and before now I specifically thought theymos actually selected DT members himself which from the reading of  your reference link dropped I now its all about a system and certain criteria must be reached before actually someone can be a DT member. I think I will start my own trust list maybe someday like you said I might end up being a DT member too who know?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SmartGold01",
      "created_time": "July 07, 2023, 07:15:41 PM",
      "body": "Like this like this I don use style tap something for this thread oo, but we dey learn on code even though some people no wan ask make e no be like say them jones but let the truth be told.Our people say anybody wey always ask questions no dey miss road, so e go better we remove shame asked questions them wey we know say we no sabi or way go hard for this forum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mate2237",
      "created_time": "July 15, 2023, 12:57:26 PM",
      "body": "People wey I like and respect in the forum dey abuse di DT system. Dem just dey give people neutral tag and red tag with just small thing or mistake other people do. I was not expecting most of dem to do like that. A DT 1 member wey just enter di DT system recently, who was very good with newbies now dey hunt people with fault to tag dem either neutral tag or negative tag. And other people wey I been dey like well well e come dey do like others. Di whole DT system now dey won kind.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Igebotz",
      "created_time": "July 15, 2023, 01:45:54 PM",
      "body": "Quote from: Mate2237 on July 15, 2023, 12:57:26 PMPeople wey I like and respect in the forum dey abuse di DT system. Dem just dey give people neutral tag and red tag with just small thing or mistake other people do. I was not expecting most of dem to do like that. A DT 1 member wey just enter di DT system recently, who was very good with newbies now dey hunt people with fault to tag dem either neutral tag or negative tag. And other people wey I been dey like well well e come dey do like others. Di whole DT system now dey won kind.Complaining will not solve it if you see anyone abusing his DT power, create your custom trust list and distrust the person ( your vote will not hold much water as you're not a DT member yet ) but you could become one tomorrow who knows. Normalize voting out DT abuser  that's the only way to save the system.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}