{
  "id": "topic_5405416",
  "title": "Question:",
  "author": "ingiltere",
  "created_time": "July 06, 2022, 05:56:10 PM",
  "content": "Önceden tenis konumuz vardı diye hatırlıyordum ama bulamadım. Forumda tenisi takip eden üyeler olarak Grand Slam turnuvaları hakkında konuşmak için bu konuyu açıyorum. Bu sene Avustralya Açık ve Fransa Açık şampiyonu Rafael Nadal oldu. Şu anda Wimbledon oynanıyor ve çeyrek finaller devam ediyor.Wimbledon'da son dört turnuvanın şampiyonu Djokovic olmuştu. 2020 yılında ise pandemiden dolayı turnuva yapılmamıştı. Bu sene de yine yarı finale yükselmeyi başardı Djokovic. Çeyrek finalde dün Sinner'e karşı 2-0 geriden gelip inanılmaz bir geri dönüş yaparak maçı kazandı ve yarı finalde Norrie'nin rakibi oldu. Diğer yarı finalistler bugün belli olacak.Bir de anket açalım. Sizce bu sene Wimbledon'ı kim kazanacak?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5405416",
  "comments": [
    {
      "author": "judas",
      "created_time": "July 06, 2022, 08:26:49 PM",
      "body": "Konuyu açtığınız için teşekkürler. Zaman buldukça ben de Wimbledon'ı takip ediyordum ve forumumuzda da bunun için bir konunun yer aldığını görmek güzel. En son çeyrek finalde sizin de belirttiğiniz gibi Djokovic mükemmel bir geri dönüşle 2-0'dan dönüp 3-2 kazanmayı başardı. Maçtan sonraki açıklamalarında, rakibinin 2-0'dan sonra kaybedecek çok şeyi olduğundan dolayı bir açığını gördüğünü ve ondan faydalandığını falan söylemiş ama yine de o iş o kadar kolay olmuyor tabi.  Nadal da Fritz'i 3-2 mağlup etmeyi başardı ama o da zorlandı diyebilirim. Sürekli setlerde geriye düşmesine rağmen eşitliği sağladı ve 3-2 kazanmayı başardı.2 gün sonra Djokovic - Norrie ve Kyrgios - Nadal yarı final maçları var. Benim turnuvadaki favorim Djokovic.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ingiltere",
      "created_time": "July 09, 2022, 09:46:34 PM",
      "body": "Tek kadınlarda şampiyon Elena Rybakina oldu. Hem Rybakina hem Jabeur ilk kez Grand Slam finali oynadı ve Rybakina aynı zamanda Grand Slam kazanan ilk Kazak tenisçi oldu.Tek erkeklerde ise final bugün saat 16'da başlayacak ve Norrie'yi geçen Novak Đoković ile Nadal'ın çekilmesiyle doğrudan finale yükselen Nick Kyrgios arasında oynanacak.  Formula 1 ile aynı saatte olması biraz üzücü ama muhtemelen yarış bittikten sonra bu maç hala üçüncü set civarında olacaktır, en azından sonunu kesin olarak izleyebileceğiz. Đoković'in maçlarda geç açılması nedeniyle ilk setler biraz sıkıntılı geçiyor. Ben yine beşinci set ihtimali olduğunu düşünüyorum. Kyrgios daha çok dinlenme fırsatı buldu ama Đoković'in ne kadar dayanıklı olduğunu biliyoruz. Güzel bir final olacaktır.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "eightdots",
      "created_time": "July 10, 2022, 03:15:53 PMLast edit: July 10, 2022, 04:30:54 PM by eightdots",
      "body": "Şu an 2-1 Djokovic önde ama Kyrgios seyircinin birine tilt olmuş durumda. Her puandan sonra oraya dönüp bir şeyler söylüyor. Tam böyle durumlarda mental üstünlüğünü koruyan maçı da alacak ve Djokovic gibi duruyor. Şunu söylemeden de geçemeyeceğim, ben izlerken bile tilt oldum orada illa ki bir problem var ve hakemin çözmesi lazımdı. Kyrgios genel olarak böyle konuşuyormuş belki adamın itici kuvveti budur bilemiyorum ama finalde böyle şeylerin olması benim açımdan zevkini kaçırıyor. Spikerin dediğine göre daha önce böyle bir durumla karşılaşmışlar ve seyirciyi dışarı çıkarmamışlar. Böyle bir finalde orada önemli olan 2 adam var ve sahadalar. Dışarı çıkarılması taraftarıyım. Tabii kraliyet locasındaysa eğer o tilt olduğu kişi pek yemez dışarı çıkarmak orası ayrı.Federer ile arasında 1 şampiyonluk fark kaldı ve bence Djokovic o rekora ortak olacak. Bize tenisi sevdiren adam Federer olduğu için pek istemesem de gerçekleşecek gibi Maç sonu açıklamalarında ortam yumuşadı ve Djokovic Kyrgios için tekrar finallere çıkacaksın gibisinden konuşma yaptı. İzlemesi keyifli ve bir o kadar da gergin bir oyundu. Bir dahaki finalde görüşmek üzere.Djokovic'in üst üste 4. şampiyonluğu için tebrikler.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "judas",
      "created_time": "July 10, 2022, 08:14:32 PM",
      "body": "Novak Djokovic çok iyi bir iş çıkararak rakibini 4-6, 6-3, 6-4 ve 7-6'lık setlerle 3-1 mağlup etmeyi başardı ve Wimbledon turnuvasının da şampiyonu oldu.Bence çok güzel bir maç oldu ve 3 saat 4 dakikalık bir sürenin ardından şampiyon belli oldu. Toplamda 45 ace (Djokovic - 15, Kyrgios - 30) gördüğümüz bir maç oldu aynı zamanda. Aslında ben 3-2 gibi bir skorla Djokovic'in şampiyonluğunu alacağını düşünüyordum ama işini daha fazla uzatmadı. Dünya sıralamasında Djokovic hala Medvedev ve Zverev'in ardında üçüncü sıradaki yerini koruyor. Bu başarısını sürdürebilirse yeniden 1 numaraya çıkma şansının olduğunu düşünüyorum. Nadal için de üzüldüğümü söylemeliyim. Sakatlığı olmasa belki de finalde o olacaktı.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ingiltere",
      "created_time": "July 10, 2022, 09:02:44 PM",
      "body": "Final maçı beşinci sete gitmedi ama tahmin ettiğim gibi Đoković geç açıldı ve ilk seti kaybetti. Ondan sonra ise oyuna ağırlığını koydu ve başa baş giden maçın önemli kırılma anlarında hep doğruyu yapmayı başardı. Kyrgios'un seyircilere fazla takılması ve hakemle tartışması konsantrasyon kaybına neden oldu. Bunu yapan oyuncuların bugüne kadar kendine avantaj sağladığını görmedim. Kyrgios için rüya gibi bir turnuvaydı, Nadal ile oynamadan doğrudan finale çıkmıştı ama tecrübe galip geldi. Büyük üçlü emekli olana kadar turnuvalara ambargo uygulamaya devam edecekler gibi görünüyor. Grand Slam sayıları 22-21-20 oldu.Bu sene Grand Slam takviminde son turnuva Amerika Açık olacak ve iki ay sonra oynanacak.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ingiltere",
      "created_time": "August 27, 2022, 09:59:35 PM",
      "body": "Bu sene Amerikan Açık'ta Novak Đoković olmayacak. Yine covid-19 aşısı tartışmaları ortaya çıktı ve ABD geçen sene Avustralya'nın yaptığını yaptı. Tenis adına utanç verici bu kararla tarihin en büyük oyuncusu bir turnuva daha kaçırıyor. Bu yasaklar olmasa Đoković çoktan en çok Grand Slam kazanan oyuncu olmuş ve rakiplerine fark atmıştı.Daniil Medvedev ve Nick Kyrgios favoriler arasında gösteriliyor. Büyükler ortada yokken son dönemin formda ismi Kyrgios fırsatları iyi değerlendirirse ilk Grand Slam'ini kazanabilir.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ajanwalker",
      "created_time": "August 28, 2022, 06:49:31 PM",
      "body": "Quote from: ingiltere on August 27, 2022, 09:59:35 PMBu sene Amerikan Açık'ta Novak Đoković olmayacak. Yine covid-19 aşısı tartışmaları ortaya çıktı ve ABD geçen sene Avustralya'nın yaptığını yaptı. Tenis adına utanç verici bu kararla tarihin en büyük oyuncusu bir turnuva daha kaçırıyor. Bu yasaklar olmasa Đoković çoktan en çok Grand Slam kazanan oyuncu olmuş ve rakiplerine fark atmıştı.Daniil Medvedev ve Nick Kyrgios favoriler arasında gösteriliyor. Büyükler ortada yokken son dönemin formda ismi Kyrgios fırsatları iyi değerlendirirse ilk Grand Slam'ini kazanabilir.Djokovic yoksa kyrgios benim favorim olur.Medvedev bence boş bir tenisçi. Daha öteye gideceğini zannetmiyorum. ABD ve Avustralya Djokovic için özel bir parantez açabilirdi. Hocam , Nadal da çok fazla sakatlıkla boğuştu ve hâlâ da devam ediyor. Eğer o da bu durumu yaşamasa sanki Djokovic bir tık geride kalabilirdi.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}