{
  "id": "topic_5421157",
  "title": "Atrax",
  "author": "Atrax",
  "created_time": "November 15, 2022, 07:15:50 PM",
  "content": "Cleaned an old Bitmain Antminer S3 from its dust, plugged it in, and it is hashing 496.1GH/s. I remember that, in the past, it consumed about 366W - which was considered ultra low. For knowing what batteries I need for running the device with solar power, I started to measure the consumption. And it is constantly between 68.5 and 70.4W.Either I am doing something totally wrong, or some magic turned my device into a super-device? Any ideas?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5421157",
  "comments": [
    {
      "author": "BitMaxz",
      "created_time": "November 15, 2022, 11:30:05 PM",
      "body": "What pool do you mine? You might be trying to mine in the Asicboost pool which is not compatible with the S3 unit.Access through IP its should have a dashboard then look for mining logs and post them here.We should see the issue under that logs and don't forget to put all logs inside the code tag its a # button when editing a post here.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Atrax",
      "created_time": "November 15, 2022, 11:55:37 PM",
      "body": "I'm afraid I don't understand where to get the mining logs... you mean ssh into the miner?Mining at stratum+tcp://eu.stratum.braiins.com:3333 which is the Stratum V1 pool, right?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Daltonik",
      "created_time": "November 21, 2022, 02:36:09 PM",
      "body": "Quote from: Atrax on November 15, 2022, 11:55:37 PMI'm afraid I don't understand where to get the mining logs... you mean ssh into the miner?Mining at stratum+tcp://eu.stratum.braiins.com:3333 which is the Stratum V1 pool, right?Well it seems to me that your device does not support the V2 firmware that you switched to braiins.com you need a firmware on your ASICs that supports the V2 protocol, but it supports devices starting from S9 https://ru.braiins.com/os/plus#support-and-docs",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hZti",
      "created_time": "November 21, 2022, 02:42:07 PM",
      "body": "Can you see what hashrate arrives at the pool? If it is the same as before you really have a super miner now. Most likely the miner is actually not running and the 70 watts are just from the control board and fans.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Atrax",
      "created_time": "November 21, 2022, 05:43:57 PM",
      "body": "Quote from: hZti on November 21, 2022, 02:42:07 PMCan you see what hashrate arrives at the pool? If it is the same as before you really have a super miner now. Most likely the miner is actually not running and the 70 watts are just from the control board and fans.It really is weird. Bitmain's specs say:Quote\"The Bitmain Antminer S3 (478Gh) is a Bitcoin miner. It mines the SHA-256 algorithm, with a maximum hashrate of 478 Gh/s and a power consumption of 366 W.\"I measured power consumption and hash rate over some days, also comparing what hashrate is shown on the miner's dashboard and what hashrate arrives at the pool.The average was 65,7 Watt with 410.1GH/s arriving at the pool. That really, really is weird.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "November 22, 2022, 11:52:40 AM",
      "body": "Quote from: Atrax on November 15, 2022, 07:15:50 PMEither I am doing something totally wrong, or some magic turned my device into a super-device? Any ideas?First thing first, how did you measure this consumption, and did you check with a different device to see if it's accurate?You connected this mine alone as a single worker to the pool and it gets accepted shares at that hashrate?Second, no, even with this \"magic\", you still have 140W pe Th/s, 5 times less efficient than a standard s19.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Atrax",
      "created_time": "November 22, 2022, 01:15:09 PM",
      "body": "Quote from: ETFbitcoin on November 22, 2022, 11:44:05 AMHow exactly do you measure power consumption? Only using software which read built-in sensor (i don't remember whether S3 has one)? Anyway, whether it consume 366W or 65.7W, you're mining at massive loss.Source: https://www.asicminervalue.com/miners/bitmain/antminer-s3, with $0.1/KWh setting.I measured with two different volt-meters, they both showed the same value.And yes, basically, I'm mining with a loss (although: electricity is free because it is excess power from my solar installation).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joniboini",
      "created_time": "November 22, 2022, 05:12:33 PM",
      "body": "Quote from: Atrax on November 22, 2022, 01:15:09 PMI measured with two different volt-meters, they both showed the same value.Maybe try using another testing tool or make sure it is really connected to the miner and not something else by accident. Also, do you not have a monitoring panel for your solar panel installation? If something like that exists it would make it easier to double-check the actual power consumption. At the end of the day does it matter for you since it uses a battery? Unless you also use your batter to power something else.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Digitolife",
      "created_time": "November 23, 2022, 10:04:57 AM",
      "body": "What does it mean when referring to low power consumption with regard to BTC mining?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaveF",
      "created_time": "November 23, 2022, 12:36:52 PM",
      "body": "Quote from: ETFbitcoin on November 23, 2022, 12:13:00 PMQuote from: Atrax on November 22, 2022, 01:15:09 PMI measured with two different volt-meters, they both showed the same value.Have you checked whether your volt-meters could show correct measurement on other electronic device?Quote from: Atrax on November 22, 2022, 01:15:09 PMAnd yes, basically, I'm mining with a loss (although: electricity is free because it is excess power from my solar installation).But since you probably make only <$1/month, you probably wasting your time for setup/maintain your ASIC. And depending on where you live and how much excess power you create, you have option to sell it to government.If you take a look at the OPs other thread here: https://bitcointalk.org/index.php?topic=5420302It's not running in a location that can sell power back. I agree with you in the fact that running the miner is loosing time and money, but I can also see it as a I am going to do this because I can, not because its going to generate any money.As for the oddball power consumption, take the miner back to where you can plug it in and run it on power company power and see what it says in terms on consumption. I have seen some solar, and other inverters, cause some power meters to give really odd results. As in, running a 100W bulb would pull 50 watts or 500 watts according to the meter and the inverter. Had an electronics guy try to explain it to me but never really understood it. -Dave",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fennic",
      "created_time": "December 21, 2022, 05:52:29 PM",
      "body": "Quote from: Atrax on November 15, 2022, 07:15:50 PMCleaned an old Bitmain Antminer S3 from its dust, plugged it in, and it is hashing 496.1GH/s. I remember that, in the past, it consumed about 366W - which was considered ultra low. For knowing what batteries I need for running the device with solar power, I started to measure the consumption. And it is constantly between 68.5 and 70.4W.Either I am doing something totally wrong, or some magic turned my device into a super-device? Any ideas?Hi bro you are using Antminer 3 that is so much old and it's only using 366 watts power that is too less. And You are not using Antminer s19 pro that uses almost 10x that are using and that's sucks so much power. And that's why your mining power is negligible too. You should use higher miners so that you can earn much more and I do not know that what are using and I think you would be loss by running that's too old machine.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Atrax",
      "created_time": "December 29, 2022, 05:34:58 PM",
      "body": "Quote from: DaveF on November 23, 2022, 12:36:52 PMAs for the oddball power consumption, take the miner back to where you can plug it in and run it on power company power and see what it says in terms on consumption. I have seen some solar, and other inverters, cause some power meters to give really odd results. As in, running a 100W bulb would pull 50 watts or 500 watts according to the meter and the inverter. Had an electronics guy try to explain it to me but never really understood it. Did this. And yes, other devices show the correct value, so I assume it is correct with the miner, too.Well, it may be one of those unsolved technical miracles",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}