{
  "id": "topic_5519495",
  "title": "robertcarlyle",
  "author": "robertcarlyle",
  "created_time": "November 15, 2024, 05:36:18 PM",
  "content": "How many people in the u.s. were wise enough to buy 1000 usd worth of bitcoin on January 1, 2011? Would January 1, 2011 been the only day in which if one bought this much bitcoin, one would have maxed out for this given amount? What about in 2010?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5519495",
  "comments": [
    {
      "author": "Jon_Hodl",
      "created_time": "November 15, 2024, 05:48:33 PM",
      "body": "I don't think there were many exchanges at that time so I would say that almost nobody bought 1000 USD on those dates. It was almost all miners back then.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Odusko",
      "created_time": "November 15, 2024, 06:02:20 PM",
      "body": "Quote from: robertcarlyle on November 15, 2024, 05:36:18 PMHow many people in the u.s. were wise enough to buy 1000 usd worth of bitcoin on January 1, 2011? Would January 1, 2011 been the only day in which if one bought this much bitcoin, one would have maxed out for this given amount? What about in 2010?The question is how many U.S. citizens believe bitcoin or even know about bitcoin at that time, being able to answer that question will help us to figure out how the purchasing power and motivations of those around that time in bitcoin, besides not many believe bitcoin to become such a global payments system like bitcoin and so for that those around that time will definitely not have such high motivations to throw $1000 on bitcoin so for sure we may likely fine it hard to make such statistics of those who bought large quantities of bitcoin at that time.But regardless of the above posibilities we still have those that earn quntom of bitcoin through their activities in the bitcoin network and those rewards at that time may have low $$ value since the operation of exchange and other access point in buying bitcoin was very low to no existence at that time so this will be hard to stay.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "November 15, 2024, 06:18:23 PM",
      "body": "Quote from: robertcarlyle on November 15, 2024, 05:36:18 PMHow many people in the u.s. were wise enough to buy 1000 usd worth of bitcoin on January 1, 2011? Would January 1, 2011 been the only day in which if one bought this much bitcoin, one would have maxed out for this given amount? What about in 2010?why are you obsessed with asking many posts about january first 2011 and $1000bitcoin was $0.30 on that date, meaning 3333btchowever even if people put in $1000 at a different date, they could have still accumilated more than 3333 before nowEGimaging using $1000 in 2012 ($6/btc) meaning 166btcthey could have day traded agaisnt ltc and turned it into 500btc before the 2013 ATHsold 500btc at $1100 to get $550000used $550,000 to buy 1,375btc ($400/btc)sold 1375btc in 2017's ath at ~$19k to get $26,125,000used $26,125,000 to buy 13,062btc ($2000/btc)thus end up having 13k btc instead of 3333... and it didnt cost you any other real money out of pocket, just traded fiat-btc on exchanges",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fiatless",
      "created_time": "November 15, 2024, 06:21:56 PM",
      "body": "Quote from: robertcarlyle on November 15, 2024, 05:36:18 PMHow many people in the u.s. were wise enough to buy 1000 usd worth of bitcoin on January 1, 2011? Would January 1, 2011 been the only day in which if one bought this much bitcoin, one would have maxed out for this given amount? What about in 2010?By this time only a few people would have known about Bitcoin. And there were also limited means of acquiring Bitcoin. If someone had offered me Bitcoin at that time, maybe I wouldn't have been interested since it was strange and looked like a joke. Only people who understood the viability of Bitcoin would have acquired it then.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mia Chloe",
      "created_time": "November 15, 2024, 06:53:37 PM",
      "body": "Quote from: robertcarlyle on November 15, 2024, 05:36:18 PMHow many people in the u.s. were wise enough to buy 1000 usd worth of bitcoin on January 1, 2011? Would January 1, 2011 been the only day in which if one bought this much bitcoin, one would have maxed out for this given amount? What about in 2010?Firstly let's evaluate the effect of inflation generally. Comparing the level of inflation from around periods of 2010 to 2011 till now, 1000 USD was actually what more then than it is now I wouldn't blame people that didn't invest in Bitcoin buy then Simply because of the fact that it was still the very first cryptocurrency and crypto wasn't that much believed in at that time So it was more like carrying out a huge risk of rather taking on a huge risk of investing with such a huge amount.As at early periods of around 2009 to even 2012 when bitcoin was recently launched, literally many persons never thought of buying at that time infact majority of them that are whales today got their coins from either giveaways back then or mining during those first four years when mining was still very profitable and and hashing was easy with smaller hardwares.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "robertcarlyle",
      "created_time": "November 15, 2024, 09:29:42 PM",
      "body": "But if someone wanted to buy 1000 usd of bitcoin back on january 1, how would they pay for it then?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ambatman",
      "created_time": "November 15, 2024, 09:58:49 PM",
      "body": "Quote from: robertcarlyle on November 15, 2024, 09:29:42 PMBut if someone wanted to buy 1000 usd of bitcoin back on january 1, how would they pay for it then?Exchanges were existing during that time and Bitcoin was listed in MT GOX around 2010 and other exchanges like CampBX, Tradehill  picked it up.Most and if not all are no longer available. But Pre it's listing it could only be mined or gotten from Free Faucet or exchange for nothing. Your persistent question makes it seem like you a BOt.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "robertcarlyle",
      "created_time": "November 15, 2024, 10:54:41 PM",
      "body": "It was free back then?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitcoinpro",
      "created_time": "November 16, 2024, 09:31:43 AM",
      "body": "Quote from: robertcarlyle on November 15, 2024, 10:54:41 PMIt was free back then?No it was some kind of MKUltra projectIt was not easy to buy and many exchanges went bustIt was flooded with scammersEven back then you were likely to lose your moneyTrying to purchase 50 Bitcoins for $50",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zigabel",
      "created_time": "November 16, 2024, 02:26:58 PM",
      "body": "Unlike now the hassle around making a purchase on btc then was such that was enough to discourage people from buying and even some list money trying to buy and didn't bother giving it a second try, but it's benefits would have been actually endless if they were able to get it as at then, unlike now in split seconds you can easily get a portfolio in Bitcoin and you are on in as an investor of trader.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SquirrelJulietGarden",
      "created_time": "November 16, 2024, 02:49:13 PM",
      "body": "Quote from: robertcarlyle on November 15, 2024, 05:36:18 PMHow many people in the u.s. were wise enough to buy 1000 usd worth of bitcoin on January 1, 2011? Would January 1, 2011 been the only day in which if one bought this much bitcoin, one would have maxed out for this given amount? What about in 2010?You can know about addresses used in 2011, but you can not know how many people owned bitcoin in 2011 and how many of them had bitcoin in 2011 from buying it, not from mining Bitcoin.Bitcoin addresses holding bitcoins by year.https://www.bitcoinmagazinepro.com/charts/addresses-holding-x-btc-by-year/Bitcoin rich list.https://bitinfocharts.com/top-100-richest-bitcoin-addresses.html",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "robertcarlyle",
      "created_time": "November 16, 2024, 02:59:07 PM",
      "body": "So to buy bitcoin like today in 2011 or 2012, 1000 usd worth of it assuming it was worth millions today, wouldnt have been feasibly practical to purchase?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "November 16, 2024, 03:05:28 PM",
      "body": "Quote from: robertcarlyle on November 15, 2024, 05:36:18 PMHow many people in the u.s. were wise enough to buy 1000 usd worth of bitcoin on January 1, 2011? Would January 1, 2011 been the only day in which if one bought this much bitcoin, one would have maxed out for this given amount? What about in 2010?Honestly during that time bitcoin was not really noticed and if ever there are people who bought at that figure probably due to enthusiasm at all. Bitcoin value has been seen becoming worth during the time it was already moving couple of dollar in terms of price.Well who wouldnt have thought even me or some of my known crypto enthusiasts will see the potential of it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tbct_mt2",
      "created_time": "November 16, 2024, 03:27:11 PM",
      "body": "Quote from: cryptoaddictchie on November 16, 2024, 03:05:28 PMHonestly during that time bitcoin was not really noticed and if ever there are people who bought at that figure probably due to enthusiasm at all. Bitcoin value has been seen becoming worth during the time it was already moving couple of dollar in terms of price.Well who wouldnt have thought even me or some of my known crypto enthusiasts will see the potential of it. The first Bitcoin exchange was launched in December 2009, it is NewLibertyStandard exchange.People lacked of interests in Bitcoin in its early years and perhaps started to pay more attention on Bitcoin after its first halving and bull run as well as a famous trade pizza for bitcoins in 2010.We can not go backwards to 2009, 2010 or 2011 to buy cheap bitcoin, but we are luckily to know of Bitcoin, invested in Bitcoin earlier than many late comers, late participants in this market. The rest part for us to succeed is whether we can have strong belief then strong hands to hold our bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bettercrypto",
      "created_time": "November 16, 2024, 04:23:40 PM",
      "body": "Quote from: robertcarlyle on November 15, 2024, 05:36:18 PMHow many people in the u.s. were wise enough to buy 1000 usd worth of bitcoin on January 1, 2011? Would January 1, 2011 been the only day in which if one bought this much bitcoin, one would have maxed out for this given amount? What about in 2010?At that time, people were not very aware of Bitcoin; at that time, people were too busy looking for opportunities online in network marketing systems and Ponzi schemes, not in digital currency or blockchain.The number of communities suddenly flocked to bitcoin when they saw that bitcoin hit $1200 each. But I can really say that the winners are those who bought bitcoin at a low price and held it for a few years because they are the ones who can say if they really got rich from bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Aanuoluwatofunmi",
      "created_time": "November 16, 2024, 04:24:20 PM",
      "body": "Quote from: robertcarlyle on November 15, 2024, 05:36:18 PMHow many people in the u.s. were wise enough to buy 1000 usd worth of bitcoin on January 1, 2011? Would January 1, 2011 been the only day in which if one bought this much bitcoin, one would have maxed out for this given amount? What about in 2010?Even after 2011 was when some people invested on bitcoin and they are still making it to this time, the value and probability as at then was so high, starting from when bitcoin was nothing in value to when it becomes a valuable asset and can be transferred on an exchange, this same thing does not applies to US citizens only, but every other person who had witnessed bitcoin right from inception, what are the necessary steps they have taken, and now where are they standing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FatFork",
      "created_time": "November 17, 2024, 06:43:53 PM",
      "body": "Quote from: robertcarlyle on November 15, 2024, 09:29:42 PMBut if someone wanted to buy 1000 usd of bitcoin back on january 1, how would they pay for it then?Almost the same as they pay today. Even then, there were different ways to transfer money electronically, for example credit cards and PayPal. (In fact, I believe the first BTC-to-fiat transaction was done through PayPal.)  Another option is to buy in person and pay in cash.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "passwordnow",
      "created_time": "November 17, 2024, 07:25:56 PM",
      "body": "Quote from: robertcarlyle on November 16, 2024, 02:59:07 PMSo to buy bitcoin like today in 2011 or 2012, 1000 usd worth of it assuming it was worth millions today, wouldnt have been feasibly practical to purchase?  It's because no one has ever known how it will be priced in and valuable in the upcoming years. That's why the early holders were the real enthusiasts and believers of Bitcoin. They're not just there for the price but the literal words about \"for the tech\" - blockchain.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pi-network314159",
      "created_time": "November 17, 2024, 07:40:50 PM",
      "body": "Quote from: robertcarlyle on November 15, 2024, 05:36:18 PMHow many people in the u.s. were wise enough to buy 1000 usd worth of bitcoin on January 1, 2011? Would January 1, 2011 been the only day in which if one bought this much bitcoin, one would have maxed out for this given amount? What about in 2010?Bitcoin was almost nothing back then, and I Doubt if majority of people even believed in bitcoin back then. Bitcoin only became recognised by many after bitcoin proved itself to be the most volatile asset to ever existed. As at then people would not want to spend that amount of money to invest in bitcoin. Even Laszlo exchange 10000 bitcoin for two pizzas at around $41 meaning the rate of bitcoin by then $1000 would have have bought BTC300k+ worth of bitcoin meaning few investor would have bought all bitcoin together if they have known the future.  The truth of the matter is that no body is ready to risk something you don't know how the outcome will be.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}