{
  "id": "topic_5416754",
  "title": "Dr.Bitcoin_Strange",
  "author": "Dr.Bitcoin_Strange",
  "created_time": "October 11, 2022, 04:59:54 PM",
  "content": "As a newbie, I thought there's a special way of welcoming newbie like myself to the forum but my search for welcome message gave me this result: Board Etiquette (Please read first.)  Apart from that, I have read series of threads created by some newbies on guide to begin posting/security means to be protected from scam, theft and hacker. two Opinions I learned from to avoid scamQuote from: Coin_trader on October 09, 2022, 12:13:11 PMSimple, Trust no one here! This is the best method to avoid being scam by scammer here since you have less knowledge. Do your own research by browsing on useful threads hre in the forum before you interact with someone for discussion.During my newbie days, I didn't trust anyone despite I’m doing a p2p trading of altcoins here inthe marketplace section. I use escrow or transact with small amount only to those user that I think as high risk. I grow my knowledge slowly by trading on many user here. There are times that I experienced being scam with small amount but I take that lesson to become more cautious on my next transaction. My experience is much riskier than newbie nowadays since Centralized exchange is now reputable compared to my newbie days.You can use the link I attached for list of good threads here related for security and privacy.https://bitcointalk.org/index.php?topic=5239098.msg54186093#msg54186093Trust no one until am more familiar here. Quote from: Upgrade00 on October 09, 2022, 12:38:24 PMScammers don't rush on newbies, they would attempt to rip off literally anyone, the only difference is some users are more easily accessible, cause they leave details about themselves all around.• Email addresses while signing up for airdrops,• Phone number and KYC information when using exchanges,• Social profiles when joining bounty projects etc.All these can be used to access and create a personalized scam, targeted against a user.You avoid this by staying private, as much as is possible, and also being cautious; everything is a scan until proven otherwise.I must keep my information private From Newbies - Read before posting, I got a great warning about Altcoins; QuoteA warning about Alt-Coins: Almost all of the alt-coins out there are going to be a waste of time. They're being created to take advantage of people who get super excited about different things and then get pumped and dumped. Be careful about wasting time with too many alt coins. Be careful about downloading files, seems like there's plenty of wallet stealers around hidden as alt coin miners.Since there's no special way of welcoming newbie, I hope am already welcome. Can the three Quotes above guide me as a newbie? I want to learn about Bitcoin and tech and also teach others who are eager to learn too. I know am new but I believe one day I shall contribute just like some legendary memebers I admire their productive knowledge in the forum.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5416754",
  "comments": [
    {
      "author": "Cantsay",
      "created_time": "October 11, 2022, 05:08:38 PM",
      "body": "Op you're welcome to the forum I hope you enjoy your stay here. And it seems like you already know your way around the forum which means you might have come across the Forum rules, make sure you familiarize yourself with it. Quote from: Dr.Bitcoin_Strange on October 11, 2022, 04:59:54 PM[...] I want to learn about Bitcoin and tech and also teach others who are eager to learn too. I know am new but I believe one day I shall contribute just like some legendary memebers I admire their productive knowledge in the forum.You could check out this thread, it contains so many information that might be of help to you. Beginners & Help EncyclopediaTerminology",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Aanuoluwatofunmi",
      "created_time": "October 12, 2022, 10:07:57 PM",
      "body": "The first welcoming a newbie should accept is in total alignments to the forum rules and regulations, if you're abiding enough to adhere to a given instructions then here the forum welcomes you to and you can choose to stay, learning and growing are without boarders when you look out for knowledge regarding cryptocurrency and the bitcoin community at large, we must not forget that our character is the first thing that chase away newbies from being adapted to the forum and even cryptocurrency as a whole, also let me drop you the official one on Writing a welcome message from the forum Admin, Theymos.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "notocactus",
      "created_time": "October 13, 2022, 05:57:38 AM",
      "body": "Some topics for newbies including you.[Guide] Searching effectively. Above is a topic about Read before posting but to read effectively, you must search effectively. Read and search and read before posting.Hidden pages/ features on the forum. There are some hidden pages that are unknown by many users, exclusively old members and not only restrict to newbies.Bitcointalk's important historic changes.Topic title is important as it is a first one readers will look at.Make your topic title, posts more attractiveTopic title style guide",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sandra_hakeem",
      "created_time": "October 13, 2022, 07:20:12 AM",
      "body": "We have always welcomed newbies right from inception and that's -- like a culture to us -- you're welcome.I'm always happy to see newbies like you, getting registered and trying to summon up that tenacity and ofcourse, oppress inferiority complexI was once a newbie,just like everyone else. Who knew that I had some potentials untill I showed up? No fuckin' body.; the above is one of the antecedents that barriers forum growth. It's a grand rule in here that everyone's in liberty to express their self-opinionated points, no exceptions are made and I don't think we need to reprimand that.All I'll ask is that you follow the rules first Buddy. You seeee.... It seems that we gets things wrong at times and the more we try to pretend/claim to be right, it turns out more erroneous. Avoid first, anything that'll terminate your stay in here.Then finally, tranthidung has shown you to some simple threads to guide; follow suit.See ya out there.Sandra 👩‍🦱",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pmalek",
      "created_time": "October 13, 2022, 07:53:18 AM",
      "body": "It might seem like a lot to take in at first, but take it one step at a time, be patient, and eventually it will start making sense. Scams are easy to spot if you apply logic and common sense. Whenever you see an offer that seems too good, try to think if something like that exists in the real world, outside of this forum and the crypto niche. How many times has a complete stranger walked up to you and given you money, gold, or other valuables? Never, right? It's not going to happen in crypto either. People are concerned about improving their own life and financial wellbeing, not that of others. Some consider scamming as one way to do it. So keep your eyes open and don't be gullible.   I am going to share two excellent resources with you. Read, watch, listen, and learn when you have the time.Jameson Lopp Bitcoin ResourcesBitcoin for Beginners by Andreas Antonopoulos",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Apocollapse",
      "created_time": "October 13, 2022, 08:42:52 AM",
      "body": "Actually theymos aka forum administrator were write a welcome message for newbie in this thread Writing a welcome message but many users disagree since the thread is too long and contain a lot information that unnecessary as a welcome message. But to be honest his welcome message are contain a very important information like the most common rule violations, scams and about language barrier.You just need to familiarize this forum day by day and don't rush to post in every thread, just start slowly until you're already comfortable enough in this forum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}