{
  "id": "topic_5403412",
  "title": "TrueColorsBby",
  "author": "TrueColorsBby",
  "created_time": "June 21, 2022, 12:47:23 AM",
  "content": "So most of us know about the CEO's and leaders in the crypto space like Vitalik Buterin, CZ, Emin Gun Sirer and the likes. Being the faces of their respective crypto projects they are constantly in the public eye through Twitter, conferences, and so on. While they get most of the attention, we hear much less about the developers who are doing the actual coding behind these projects. So my question is: Who are the most prominent developers in the crypto space these days and historically?? And btw, I guess some of the CEO's/leaders do some developing as well but they are also tied up to all other kinds of tasks. So my question pertains to those developers who mainly do developing and not much else",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5403412",
  "comments": [
    {
      "author": "Hetadrop",
      "created_time": "June 21, 2022, 01:46:02 AM",
      "body": "I know about Andre Cronje, he's huge in DeFi because he invented it! After inventing DeFi, Andre Cronje invented Yearn Finance. Andre Cronje has written such a good code and enabled a really decentralized finance. It was very huge but somehow people forgot about it...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "X-ray",
      "created_time": "June 21, 2022, 03:55:12 AM",
      "body": "This must be satoshi nakamoto. He was only developing bitcoin and after he has finished his development and then he was disappearing unlike any other developers or CEO in the crypto that were taking the advantage to make bunch of money. Satoshi is the most prominent developer in the crypto. If bitcoin was not exist and there will be no the name like vitalik butterin, andre conje and many more. This must be a key.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "June 21, 2022, 05:44:44 AM",
      "body": "I think Andre Cronje is one of those famous defi guy who really work into building. Some are just popular due to their standing or asset. But this guy started from scratch and started to boom all of his work. Now Im not sure if he stull building in secret while he announced that he is leaving fantom and decided to out.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}