{
  "id": "topic_5477224",
  "title": "jarvbtc90",
  "author": "jarvbtc90",
  "created_time": "December 09, 2023, 10:28:47 PM",
  "content": "Hello,Is there a way/product to trade BTC leverage on exchanges without paying funding every 8h?Thanks",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5477224",
  "comments": [
    {
      "author": "Oshosondy",
      "created_time": "December 09, 2023, 10:41:27 PM",
      "body": "I do not know about how futures quarterly trading is charged, but I know that it is different from perpetual futures. With quarterly, you can open a position for up to 100 days, but depending on the exchange. But with it, there is nothing like funding rate. I see the funding rate not to be a problem because it is 0.01 or less in percentage every 8 hours. It may even be in your favor in a way that you will earn it instead.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitcoinTurk",
      "created_time": "December 09, 2023, 10:55:24 PM",
      "body": "Quote from: jarvbtc90 on December 09, 2023, 10:28:47 PMHello,Is there a way/product to trade BTC leverage on exchanges without paying funding every 8h?ThanksUnfortunately, it isn’t possible to carry out futures transactions without a funding fee because although there is no direct debit, futures transactions provide the opportunity to trade with a balance above one's own capital. Naturally, this also has a price and this price is reflected to you within several different time periods depending on the preferred cryptocurrency.In short, it isn’t possible to carry out forward transactions without paying the funding rate because in the simplest terms, borrowing is performed for the transactions and with this borrowing the transaction is carried out with an amount several times the current balance.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GreatArkansas",
      "created_time": "December 10, 2023, 12:27:47 AM",
      "body": "As I remember before, there are some exchanges that offer like this, but you will trade in Spot.Then the pair is like multiplied by 2x, 5x, 10x, and so on.It's like a token you will buy in a spot but the price is calculated as multiplied so it's more likely you are trading with leverage and not paying a funding fee. I don't remember what they call that about. (I saw this in FTX Exchange before)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nelson4lov",
      "created_time": "December 10, 2023, 12:37:57 AM",
      "body": "Quote from: jarvbtc90 on December 09, 2023, 10:28:47 PMHello,Is there a way/product to trade BTC leverage on exchanges without paying funding every 8h?ThanksYou can't evade the funding fees for perpetual contracts leverage trades. What  you could do is to do a quick research on other exchanges that offer leverage trading but with lower funding rate. The last time I checked; Bybit, Kucoin, and some others I can't get at the top of my head right now had lower funding rates compared to binance. You can also try out some perpetual protocols in DeFi. However, you'll be subjected to gas fees and I don't know if they have funding rate — I have the assumption that they just have protocol + gas fees.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cakravothy",
      "created_time": "December 10, 2023, 12:39:00 AM",
      "body": "Quote from: jarvbtc90 on December 09, 2023, 10:28:47 PMHello,Is there a way/product to trade BTC leverage on exchanges without paying funding every 8h?Thanks i think is nothing btc trade with leverage wthout pay funding feebecause you trading use leverage this mean you loan coin and another member can get benefit in get lending fee if have coin and follow lending program",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "adaseb",
      "created_time": "December 10, 2023, 01:49:39 AM",
      "body": "Every Perp exchange has Futures instead of Perps, usually there is 4 futures per year, every season. These don't have any funding fees.However, they have a premium or discount. So if you buy a March 2024 future today, you will pay a 3-4% premium if you hold till expiry. So its similar to funding rate. However if you plan on keeping the trade short then the premium will still hold, unless there is a massive shift in market trend. Since you want leverage, there is no other way. Because unless you are buying spot, you will pay either interest on margin, or funding fees for perps, or pay a premium to buy the futures. No other way around these fees.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bounceback",
      "created_time": "December 10, 2023, 02:58:20 AM",
      "body": "Quote from: Oshosondy on December 09, 2023, 10:41:27 PMI do not know about how futures quarterly trading is charged, but I know that it is different from perpetual futures. With quarterly, you can open a position for up to 100 days, but depending on the exchange. But with it, there is nothing like funding rate. I see the funding rate not to be a problem because it is 0.01 or less in percentage every 8 hours. It may even be in your favor in a way that you will earn it instead.Depend kinds of coins and how much percentage of leverage for funding fees in future trading, if you see some coins have limited x125 leverage have more higher funding fee each 8 hours. I don' think any exchange without funding fees in future trading but so far I used Binance only and there have not bigger funding fees. Seems the funding fees depend on each 8 hours and will be for longer time when our position short or long until close the position. Have disadvantage with future trading because we need to pay funding fee and not worth for long term holding short or long position there, but if there are any exchange without funding fee will be interested.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "December 10, 2023, 04:19:16 AM",
      "body": "It's possible, by trading against consensus(longing shorting depending on funding rate so you wouldn't be paying longs/shorts). I'd imagine this is not what you're looking for though, so no. Not paying funding rate in general is like asking for loans without interest.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EarnOnVictor",
      "created_time": "December 10, 2023, 11:39:36 AM",
      "body": "Quote from: jarvbtc90 on December 09, 2023, 10:28:47 PMIs there a way/product to trade BTC leverage on exchanges without paying funding every 8h?I believe you are basically talking about the transaction fees with the futures trading, well, I've ever thought of this before, It's a negligible amount you shouldn't worry about as well. But if you are so desired for a reduced transaction fee, you might want to consider changing an exchange. I do hear good news about MEXC in terms of the transaction fees, you might want to try your luck with them also.However, the two most important things I consider more than anything else in my crypto trading are the trust of the exchange/broker and the number of years I've used them without them failing me. I base these factors more importantly than the amount they charge me and I urge you to consider this.After all, the average charges I know are not much, not for someone like me who has been well exploited by traditional brokers in the past.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jarvbtc90",
      "created_time": "December 10, 2023, 01:56:01 PM",
      "body": "Quote from: adaseb on December 10, 2023, 01:49:39 AMEvery Perp exchange has Futures instead of Perps, usually there is 4 futures per year, every season. These don't have any funding fees.However, they have a premium or discount. So if you buy a March 2024 future today, you will pay a 3-4% premium if you hold till expiry. So its similar to funding rate. However if you plan on keeping the trade short then the premium will still hold, unless there is a massive shift in market trend. Since you want leverage, there is no other way. Because unless you are buying spot, you will pay either interest on margin, or funding fees for perps, or pay a premium to buy the futures. No other way around these fees.That is perfect, thank you veruy much its exactly what I was looking for! I could trade leverage now with futures, hold my trade for days/weeks without worring about any funding fees.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jarvbtc90",
      "created_time": "December 10, 2023, 03:54:36 PM",
      "body": "Quote from: Oshosondy on December 09, 2023, 10:41:27 PMI do not know about how futures quarterly trading is charged, but I know that it is different from perpetual futures. With quarterly, you can open a position for up to 100 days, but depending on the exchange. But with it, there is nothing like funding rate. I see the funding rate not to be a problem because it is 0.01 or less in percentage every 8 hours. It may even be in your favor in a way that you will earn it instead.Thanks for your reply, I checked the quarterly contracts and indeed no funding and can hold my leverage  trade for weeks/daysas @adaseb suggested too Thanks for your input",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "borovichok",
      "created_time": "December 19, 2023, 05:07:14 AM",
      "body": "Quote from: Oshosondy on December 09, 2023, 10:41:27 PMI do not know about how futures quarterly trading is charged, but I know that it is different from perpetual futures. With quarterly, you can open a position for up to 100 days, but depending on the exchange. But with it, there is nothing like funding rate. I see the funding rate not to be a problem because it is 0.01 or less in percentage every 8 hours. It may even be in your favor in a way that you will earn it instead.We earned and also make losses in the system, that alone shown that evidence of consistent trying. We plan our day when it comes to trading Bitcoin which happens to be one of the project that consists of high volatility in the system. Bitcoin and cryptocurrency is broad, we can't helped each other if one don't work together to achieved a particular goal for anyone. The funding rate doesn't concern any trader, the activities concern should be the activities that involved the eexchanged. Trading is for the main traders  who specifically knows what he or she doing in the space.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tvplus006",
      "created_time": "December 19, 2023, 09:05:33 PM",
      "body": "Quote from: jarvbtc90 on December 09, 2023, 10:28:47 PMIs there a way/product to trade BTC leverage on exchanges without paying funding every 8h?There is nothing easier and for this you just need to close your order a few minutes before the funding rate is calculated and after this calculation, you can open your position again. But you need to do this only if it is you who will pay for the funding. For example, you have a long position open, while the funding is negative, in this case you will pay a commission to those who have a short position open.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}