{
  "id": "topic_5425994",
  "title": "Hydrogen",
  "author": "Hydrogen",
  "created_time": "December 06, 2022, 02:10:52 PM",
  "content": "QuoteDec 1 (Reuters) - Victims of the Uvalde mass shooting that killed 19 children and two teachers at a Texas elementary school in May have filed a $27 billion class-action lawsuit against an array of public entities and officials, seeking damages for ongoing trauma.The suit filed on Tuesday in U.S. District Court for the Western District of Texas names the city of Uvalde, its police department, the school district, the state Department of Public Safety and several police and school officials, alleging they failed to follow protocols for an active shooter.The May 24 tragedy rocked the United States as the slaughtered schoolchildren were aged 9 to 11 and police waited more than an hour, while some children called for help, before storming the classroom and killing the shooter.It was the deadliest U.S. school shooting in almost a decade, and many children were wounded.The class-action suit seeks damages for the survivors including parents whose children were killed and kids who witnessed the massacre, said attorney Charles Bonner, whose California law firm brought the suit. Anyone else in the \"zone of danger\" could join the suit, Bonner said.\"Parents were telling us that kids are threatening suicide, they're totally changed from what they were on May 23, the day before the incident,\" Bonner told reporters in Uvalde on Wednesday.\"One child is having the nightmare that she's having a heart attack. In fact two children. The parents are traumatized because they've seen this totally night-and-day change.\"A spokesperson for the city of Uvalde said on Thursday the city had not been served with the lawsuit and would not comment on pending litigation.Representatives for the Uvalde Police Department, the Uvalde Consolidated Independent School District, the Department of Public Safety and the former chief of the school district's police force did not immediately respond to requests for comment.Bonner said he was working with the gun violence prevention advocates Everytown in conjunction with a separate suit that Everytown filed on Monday against many of the same defendants plus Daniel Defense, the maker of the AR-15-style firearm used by the 18-year-old shooter.Daniel Defense did not immediately respond to a request for comment.Separately, the city of Uvalde on Thursday sued District Attorney Christina Mitchell for not handing over investigative materials related to the shooting. The city is asking a state judge to compel Mitchell's office to hand over records from all law enforcement agencies.The district attorney's office said it had no comment on the lawsuit.https://www.reuters.com/legal/uvalde-shooting-victims-file-27-billion-class-action-suit-2022-12-01/....At first glance, I thought \"$27 billion\" in damages was a typo. They meant to say \"$27 million\". But its not, they actually are seeking $27 billion in damages. QuoteEverytown filed on Monday against many of the same defendants plus Daniel Defense, the maker of the AR-15-style firearm used by the 18-year-old shooter.They are also attempting to sue the manufacturer who produced the AR-15 used in the attack. I wonder if at some point americans will begin to take notice of events like this occurring in their country. Or perhaps this news is too negative and depressing. And it is better for mental health to simply pay no attention to it?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5425994",
  "comments": [
    {
      "author": "BADecker",
      "created_time": "December 06, 2022, 05:00:29 PM",
      "body": "They should file against everybody who kept teachers from open carry in the classroom, with authorization to shoot to kill any armed assailant. Of course, that would probably be themselves that they would be filing against... at least some of them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hispo",
      "created_time": "December 06, 2022, 10:47:40 PM",
      "body": "Huh, I also thought they were seeking to get 27 million.27 Billion is a lot of money, but I get I am not in the position to judge on the amount they are demanding, after all, losing a little child in shooting like this must be horrible beyond words.The fact the article even mentions the nightmares and suicidal thoughts of one of the survivor is also disturbing. Looking forward to see if this case will get dismissed of will proceed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cmg777",
      "created_time": "December 06, 2022, 11:50:44 PM",
      "body": "Quote from: BADecker on December 06, 2022, 05:00:29 PMThey should file against everybody who kept teachers from open carry in the classroom, with authorization to shoot to kill any armed assailant. Of course, that would probably be themselves that they would be filing against... at least some of them.Hell yeah BADecker. Gas station in Philly are hiring private guards to protect their property:https://www.fox29.com/news/philadelphia-gas-station-owner-hires-heavily-armed-guards-to-protect-business-we-are-tired-of-this-nonsense?taid=638f394ec7dd5a000108f6b7Quote from: Hydrogen on December 06, 2022, 02:10:52 PMQuoteDec 1 (Reuters) - Victims of the Uvalde mass shooting that killed 19 children and two teachers at a Texas elementary school in May have filed a $27 billion class-action lawsuit against an array of public entities and officials, seeking damages for ongoing trauma.The suit filed on Tuesday in U.S. District Court for the Western District of Texas names the city of Uvalde, its police department, the school district, the state Department of Public Safety and several police and school officials, alleging they failed to follow protocols for an active shooter.The May 24 tragedy rocked the United States as the slaughtered schoolchildren were aged 9 to 11 and police waited more than an hour, while some children called for help, before storming the classroom and killing the shooter.It was the deadliest U.S. school shooting in almost a decade, and many children were wounded.The class-action suit seeks damages for the survivors including parents whose children were killed and kids who witnessed the massacre, said attorney Charles Bonner, whose California law firm brought the suit. Anyone else in the \"zone of danger\" could join the suit, Bonner said.\"Parents were telling us that kids are threatening suicide, they're totally changed from what they were on May 23, the day before the incident,\" Bonner told reporters in Uvalde on Wednesday.\"One child is having the nightmare that she's having a heart attack. In fact two children. The parents are traumatized because they've seen this totally night-and-day change.\"A spokesperson for the city of Uvalde said on Thursday the city had not been served with the lawsuit and would not comment on pending litigation.Representatives for the Uvalde Police Department, the Uvalde Consolidated Independent School District, the Department of Public Safety and the former chief of the school district's police force did not immediately respond to requests for comment.Bonner said he was working with the gun violence prevention advocates Everytown in conjunction with a separate suit that Everytown filed on Monday against many of the same defendants plus Daniel Defense, the maker of the AR-15-style firearm used by the 18-year-old shooter.Daniel Defense did not immediately respond to a request for comment.Separately, the city of Uvalde on Thursday sued District Attorney Christina Mitchell for not handing over investigative materials related to the shooting. The city is asking a state judge to compel Mitchell's office to hand over records from all law enforcement agencies.The district attorney's office said it had no comment on the lawsuit.https://www.reuters.com/legal/uvalde-shooting-victims-file-27-billion-class-action-suit-2022-12-01/....At first glance, I thought \"$27 billion\" in damages was a typo. They meant to say \"$27 million\". But its not, they actually are seeking $27 billion in damages. QuoteEverytown filed on Monday against many of the same defendants plus Daniel Defense, the maker of the AR-15-style firearm used by the 18-year-old shooter.They are also attempting to sue the manufacturer who produced the AR-15 used in the attack. I wonder if at some point americans will begin to take notice of events like this occurring in their country. Or perhaps this news is too negative and depressing. And it is better for mental health to simply pay no attention to it?  It is depressing... to have children in schools without the armed protection that they need. Sure we could take all the guns but then the criminals and government would be the only ones that would be able to own them. We have an elite class of people that want to take our rights away so they can take over in a dictatorship that will be disguised as a democracy in a once Constitutional Republic known as the United States. They are coming hard against the first amendment and in this case the second amendment. Lawyers already sued Remington out of business ages ago what good does that do beside enrich a bunch of greedy lawyers and satisfies the bidding of the ruling elite that want us to OWN NOTHING and BE HAPPY...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "worldofcoins",
      "created_time": "December 14, 2022, 10:14:21 AM",
      "body": "This is what is called a sense of responsibility towards the state. I found nothing wrong with this post. People of every country should take notice of such events in their countries.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}