{
  "id": "topic_5460804",
  "title": "letteredhub",
  "author": "letteredhub",
  "created_time": "July 23, 2023, 05:41:21 PM",
  "content": "I have heard and read about people gambling because they had no source of income,  a job or they wanted to add gambling as part of their streams of income. Whatever your category the bottom line is that we all gamble to make money though some group claim it's mainly for fun. But who would want to be losing money all in the idea of catching fun!There are gamblers that don't place their bet not until they have gotten a certain amount as their potential win. Some do this based on their financial challenge with the anticipation that just one win they may get on such amount is a life changer for them.  My main focus on this thread is in this question: as a gambler do you place your bet according to the weight of your financial need or you're always okay with whatever amount that comes out as potential win no matter how small amount?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5460804",
  "comments": [
    {
      "author": "Cantsay",
      "created_time": "July 23, 2023, 05:50:12 PM",
      "body": "Like I have said in my previous posts currently I'm on hold using bookmaker so I haven't placed any bets on sports games. But for the others like crash limbo and the rest you can't actually cumulate the odds there, except you want to play an extra risky game that gives you a 5% chance of winning that's the only time you get a high win from there. So for sometimes I can place a bet on a game with 1.6odds and high percentage of winning which means I don't actually wait until I see a high odd game before placing a bet or looking for a game that one win will change my life forever. Another reason why I prefer using low odds it makes me spend more time since my money won't get exhausted in just a few minutes. But sometimes I still follow the high odd but good chance of winning.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "virasog",
      "created_time": "July 23, 2023, 05:57:20 PM",
      "body": "Quote from: letteredhub on July 23, 2023, 05:41:21 PMMy main focus on this thread is in this question: as a gambler do you place your bet according to the weight of your financial need or you're always okay with whatever amount that comes out as potential win no matter how small amount? Before placing a bet, we should do all the math as how much amount we will lose if the bet goes against our plan and how much we gain in case of a win. I would never risk my money on bets with very low amounts as my risk reward ratio will be disturbed.In gambling, you need to make sure you get enough rewards that make you satisfied because you are risking your money in the gamble or bet. People with no plan or no money management sense will bet blindly and may not be profitable in the long run (although they may get some wins in the short term as they never calculate the risk reward ratio and jump in every game)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fivestar4everMVP",
      "created_time": "July 23, 2023, 05:58:31 PM",
      "body": "Well, So far, all my bets in gambling have always been random, that is, what ever comes, ive never had to place a bet with the potential winning amount based on an amount i think will solve all my problems if i win it, for all i know, life's problems can never be solved to the fullest, this is because the higher you go financially, the higher your needs and wants becomes. So lets assume you place a bet with the potential winning amount based on the amount you feel will solve all your life problems, and luckily for you, you win it, does that mean you wont have to ever playing gambling/bet again all your life? cus all your problems are solved? are all your problems truly solved?.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oshosondy",
      "created_time": "July 23, 2023, 06:14:26 PM",
      "body": "Quote from: letteredhub on July 23, 2023, 05:41:21 PMMy main focus on this thread is in this question: as a gambler do you place your bet according to the weight of your financial need or you're always okay with whatever amount that comes out as potential win no matter how small amount? Gambling is not the source of my financial need. I do not consider how much I win because gambling is very risky and you are likely not to win than to lose. I set a weekly budget, if I win more I take the profit, but if I lose and the weekly money is lost, I stopped for that week.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dimonstration",
      "created_time": "July 23, 2023, 06:34:52 PM",
      "body": "Quote from: letteredhub on July 23, 2023, 05:41:21 PMMy main focus on this thread is in this question: as a gambler do you place your bet according to the weight of your financial need or you're always okay with whatever amount that comes out as potential win no matter how small amount? Relying on gambling as source of financial need is very bad idea because you might suffer more losses than getting extra money for your financial needs. It’s better to save the money instead of placing it on gambling.I always have a target profit which is x2 of my bankroll. No matter what is my bankroll. Potential profit is least of your concern in gambling since you might be prioritizing stop loss when playing since there’s a high chance of losing than winning.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitcoinGirl.Club",
      "created_time": "July 23, 2023, 06:37:17 PM",
      "body": "Quote from: letteredhub on July 23, 2023, 05:41:21 PMI have heard and read about people gambling because they had no source of income,  a job or they wanted to add gambling as part of their streams of income. When someone is thinking gambling as their source of income without having a day job or a business then I think it's really an unrealistic choice. I saw many people who lost their car, house and found themselves as a homeless. These people really needs rehabilitation.Gambling should be an entertainment, no more than that. Quote from: Oshosondy on July 23, 2023, 06:14:26 PMI do not consider how much I win because gambling is very risky and you are likely not to win than to lose. I set a weekly budget, if I win more I take the profit, but if I lose and the weekly money is lost, I stopped for that week.When I feel lucky I deposit in the sites. Most of the time when I am bored I spend time in gambling. If I win then I continue, try to withdraw but if I lose the deposit then I logout and forget about it for few weeks or months before depositing again.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yahoo62278",
      "created_time": "July 23, 2023, 06:41:32 PM",
      "body": "Quote from: letteredhub on July 23, 2023, 05:41:21 PMI have heard and read about people gambling because they had no source of income,  a job or they wanted to add gambling as part of their streams of income. Whatever your category the bottom line is that we all gamble to make money though some group claim it's mainly for fun. But who would want to be losing money all in the idea of catching fun!There are gamblers that don't place their bet not until they have gotten a certain amount as their potential win. Some do this based on their financial challenge with the anticipation that just one win they may get on such amount is a life changer for them.  My main focus on this thread is in this question: as a gambler do you place your bet according to the weight of your financial need or you're always okay with whatever amount that comes out as potential win no matter how small amount? If you are betting based on your financial need, you probably do not need to be gambling. You should be betting for fun and maybe win a few dollars if you are lucky. The last sentence only applies to regular casino games. If you are a knowledgeable person on a certain sporting event, you have a better chance of making money betting sports IMO.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mr.suevie",
      "created_time": "July 23, 2023, 06:43:10 PM",
      "body": "Quote from: BitcoinGirl.Club on July 23, 2023, 06:37:17 PMWhen I feel lucky I deposit in the sites. Most of the time when I am bored I spend time in gambling. If I win then I continue, try to withdraw but if I lose the deposit then I logout and forget about it for few weeks or months before depositing again.Thats a very good self control as the same might be very different with other gambler because they will feel pain after losing that first try and then the spree of deposits Begin trying to chase that first money which they deposited not trying to even win etra money again and I know this out of past ugly experience and it wasn't easy but I have tried my best to regulate such habit of mine.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gozie51",
      "created_time": "July 23, 2023, 06:45:19 PM",
      "body": "Quote from: letteredhub on July 23, 2023, 05:41:21 PMMy main focus on this thread is in this question: as a gambler do you place your bet according to the weight of your financial need or you're always okay with whatever amount that comes out as potential win no matter how small amount? Need is something that is insatiable so to bet according to need means the person is betting with greed and will be taking alot of risk that he can not carry. People who bet with their needs in mind are doing that if they see gambling as the only source of income. I don't advise people to bet that way but to bet according to their financial straight at that time and to bet as they can bear. Use some possible odds with few games then you are good to go.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "swogerino",
      "created_time": "July 23, 2023, 07:00:39 PM",
      "body": "Quote from: letteredhub on July 23, 2023, 05:41:21 PMI have heard and read about people gambling because they had no source of income,  a job or they wanted to add gambling as part of their streams of income. Whatever your category the bottom line is that we all gamble to make money though some group claim it's mainly for fun. But who would want to be losing money all in the idea of catching fun!There are gamblers that don't place their bet not until they have gotten a certain amount as their potential win. Some do this based on their financial challenge with the anticipation that just one win they may get on such amount is a life changer for them.  My main focus on this thread is in this question: as a gambler do you place your bet according to the weight of your financial need or you're always okay with whatever amount that comes out as potential win no matter how small amount? I start gambling with zero to little expectations of having a win,I have seen this pattern of losing money several times and that is why I am not at all hopeful to be a winner when I begin my session  .However I have stopped playing slots in favor of sport betting and I must admit I am doing better here in sport betting because a win in a parlay ticket gives you a nice boost to your earnings.My objective is clear though,to be able to get that well over x10.000 multiplier in slots with minimum bet no problem or at sport betting parlays to get an x100-x1000 with a really nice base amount which would be a life changer for every one for example to hit that x1000 with 100-500 dollar bet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mahanton",
      "created_time": "July 23, 2023, 07:52:23 PM",
      "body": "Quote from: letteredhub on July 23, 2023, 05:41:21 PMI have heard and read about people gambling because they had no source of income,  a job or they wanted to add gambling as part of their streams of income. Whatever your category the bottom line is that we all gamble to make money though some group claim it's mainly for fun. But who would want to be losing money all in the idea of catching fun!There are gamblers that don't place their bet not until they have gotten a certain amount as their potential win. Some do this based on their financial challenge with the anticipation that just one win they may get on such amount is a life changer for them.  My main focus on this thread is in this question: as a gambler do you place your bet according to the weight of your financial need or you're always okay with whatever amount that comes out as potential win no matter how small amount? As a gambler or that someone who had been dealing with gambling then speaking about potential winning limit then this is something that pertains about sky is the limit.Why? There's no such thing about those numbers on which it would be making someone to leave out the casino or their playing time or sessions specially they are on the winning phase or state. This is the most hardest time for you to decide on stopping midway because we know that on the time that we do win up bets then adrenalines rushing out overall the body and this would really be pushing up yourself to play even more and the main thing that you would be having in mind is that if you have able to win then for sure you would be thinking on betting more to win more. A very common behavior of a gambler and this is why most of the time all of those winners becomes losers on the time that thecasino would really be taking back those winnings and would really be having that kind of situation on the time that they would be chasing their losses and this would really be a never ending cycle on this industryon which this is the sole reason on why its really that a profitable business due to that common human being act and behavior.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Issa56",
      "created_time": "July 23, 2023, 08:01:52 PM",
      "body": "Quote from: letteredhub on July 23, 2023, 05:41:21 PMI have heard and read about people gambling because they had no source of income,  a job or they wanted to add gambling as part of their streams of income. Whatever your category the bottom line is that we all gamble to make money though some group claim it's mainly for fun.When you start taking gambling as source of income, then that’s just the beginning of your problem, because you might end up wasting everything you are having on gambling without achieving anything. When gambling just have it in mind that whenever you win, then you are going to make sure of the win to solve any problem you are having at that moment, but you shouldn’t have plans ahead of the bet you haven’t won yet. Quote from: letteredhub on July 23, 2023, 05:41:21 PMBut who would want to be losing money all in the idea of catching fun!You can’t just be gambling anyhow, even people that gamble for fun won’t still want to lose, that’s why they also have to do analysis before gambling, because when gambling their is always joy when you are winning even if you are not after the money you are going to win. Gambling should be taken just for fun, your main target when gambling shouldn’t be because of the money, you should have source of income and you shouldn’t have it in mind that you are going to make money with it, it should be taken as something you do for relaxation that’s why you should be cautious when gambling, don’t go beyond your limit.Quote from: letteredhub on July 23, 2023, 05:41:21 PMMy main focus on this thread is in this question: as a gambler do you place your bet according to the weight of your financial need or you're always okay with whatever amount that comes out as potential win no matter how small amount? When gambling you have to be satisfied with what comes out as your potential need even if it’s small. It’s really wrong if you think you can gamble and solve all your financial needs, because your financial needs might just end up getting bigger because you will be wasting the little you are having on gambling.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Blitzboy",
      "created_time": "July 23, 2023, 08:03:58 PM",
      "body": "First of all, bro, despite what all those quick-rich-schemes claim, gambling is not a reliable way to make money in the long run. From my research, I can assure you that there are far more tales of financial devastation for every tale of \"rags to riches.\"Its a sick game in which the casino always comes out ahead and the gamblers can never get ahead of the action. Also, its true that some people have an egotistical streak that makes them think they're special. But bro, thats wishful thinking at best. The only people you're helping are the casino's owners. Incredible, right?Putting your money where your mouth is, so to speak? Even terrible than I thought. Expecting a wild lion to act like a housecat is like trying to catch a falling knife. You cant risk your family's financial security any longer. Bet low and play for enjoyment. When the fun stops being funny, you should go.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oilacris",
      "created_time": "July 23, 2023, 08:10:40 PM",
      "body": "Quote from: yahoo62278 on July 23, 2023, 06:41:32 PMQuote from: letteredhub on July 23, 2023, 05:41:21 PMI have heard and read about people gambling because they had no source of income,  a job or they wanted to add gambling as part of their streams of income. Whatever your category the bottom line is that we all gamble to make money though some group claim it's mainly for fun. But who would want to be losing money all in the idea of catching fun!There are gamblers that don't place their bet not until they have gotten a certain amount as their potential win. Some do this based on their financial challenge with the anticipation that just one win they may get on such amount is a life changer for them.  My main focus on this thread is in this question: as a gambler do you place your bet according to the weight of your financial need or you're always okay with whatever amount that comes out as potential win no matter how small amount? If you are betting based on your financial need, you probably do not need to be gambling. You should be betting for fun and maybe win a few dollars if you are lucky. The last sentence only applies to regular casino games. If you are a knowledgeable person on a certain sporting event, you have a better chance of making money betting sports IMO.Nothing beats out on dealing with something which you could really take out advantage like into those betting games which you could really be able to apply some strategies which is something that would really be that pertaining about sports betting on which you could really make winnings at the same time you could really be having that entertainment but still not would be an enough reason for you to consider out on making a living with it. Usually people do end up on getting addicted or losing huge sums of money due to the reason that they did make out bad decisions and insights on what gambling is, its not a job or income source but there are ones who do really pushes up this kind of idea or thing in mind and ending up on a disaster.People wont really be stopping in doing so until they would really be proven out to themselves and this what makes them desperate until they would realize on the wrong thingsthat they've been doing.Well, this had been a common behavior on most people specially to those noobs who do have this kind of impression.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Crypto Library",
      "created_time": "July 23, 2023, 08:22:19 PM",
      "body": "Quote from: letteredhub on July 23, 2023, 05:41:21 PMMy main focus on this thread is in this question: as a gambler do you place your bet according to the weight of your financial need or you're always okay with whatever amount that comes out as potential win no matter how small amount? For your question answer firstly I want to say that I am not that kind of a hardcore gambler I just gamble or bet for my entertainment purpose. But when I gamble there is a strategy in advance that I will not spend more than a certain amount of money on today's or this month's gambling. I actually don't gamble much in Casino, most of the time I spend my gambling time on sports betting. And in this case, I may not take more than two or three matches when I bet, because of this, you can also say that the bet is diversified for winning. However, I think that gambling should not be done in order to win some certain amount, because gambling completely depends on your luck, like one day you can gain your expected amount and on the others hand you can continuously lose you winning fund for gaining that certain amount. There are many people who have lost everything to win such a certain amount.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "darkangel11",
      "created_time": "July 23, 2023, 08:34:49 PM",
      "body": "Quote from: letteredhub on July 23, 2023, 05:41:21 PMwe all gamble to make money though some group claim it's mainly for fun. But who would want to be losing money all in the idea of catching fun!Funny that you ask. Some people have so much money they don't need to make more. They can, but if this doesn't happen it's fine by them. You don't get it because you've never had that kind of money. As for the second part of your question, have you ever heard of people who bungee jump, skydive, and so on? All of these people pay big money to have some fun. Gamblers have their own way of doing it.I'm OK with whatever amount. I usually place low bets because I'm happy with the win. regardless of how big it is.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AmoreJaz",
      "created_time": "July 23, 2023, 09:02:17 PMLast edit: July 23, 2023, 09:15:01 PM by AmoreJaz",
      "body": "Quote from: darkangel11 on July 23, 2023, 08:34:49 PMQuote from: letteredhub on July 23, 2023, 05:41:21 PMwe all gamble to make money though some group claim it's mainly for fun. But who would want to be losing money all in the idea of catching fun!Funny that you ask. Some people have so much money they don't need to make more. They can, but if this doesn't happen it's fine by them. You don't get it because you've never had that kind of money. As for the second part of your question, have you ever heard of people who bungee jump, skydive, and so on? All of these people pay big money to have some fun. Gamblers have their own way of doing it.I'm OK with whatever amount. I usually place low bets because I'm happy with the win. regardless of how big it is. i guess, i can classify myself as someone who will just bet whatever amount i can afford at that time. am not into aiming of a certain win as i bet. because i don't want to be disappointed if such win won't happen. better accept the results of your bet whatever it is. but of course once you place your bet, you know the odds, so you can already roughly estimate your winnings if in case you win. but in my experience, i don't count my winnings up until the money is already in my own wallet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Unbunplease",
      "created_time": "July 23, 2023, 09:08:52 PM",
      "body": "Quote from: Oilacris on July 23, 2023, 08:10:40 PMNothing beats out on dealing with something which you could really take out advantage like into those betting games which you could really be able to apply some strategies which is something that would really be that pertaining about sports betting on which you could really make winnings at the same time you could really be having that entertainment but still not would be an enough reason for you to consider out on making a living with it. Usually people do end up on getting addicted or losing huge sums of money due to the reason that they did make out bad decisions and insights on what gambling is, its not a job or income source but there are ones who do really pushes up this kind of idea or thing in mind and ending up on a disaster.People wont really be stopping in doing so until they would really be proven out to themselves and this what makes them desperate until they would realize on the wrong thingsthat they've been doing.Well, this had been a common behavior on most people specially to those noobs who do have this kind of impression.What about professional poker players, for example? For many of them, poker is their main source of income. Yes, to make money, you need strong nerves, good intuition, mathematical knowledge, diligence, the ability to bluff - but people make money. That's a fact. And those who can control themselves - they do not stay in the gaming world, because after a while they have nothing to play for",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "goaldigger",
      "created_time": "July 23, 2023, 09:19:13 PM",
      "body": "Quote from: letteredhub on July 23, 2023, 05:41:21 PMMy main focus on this thread is in this question: as a gambler do you place your bet according to the weight of your financial need or you're always okay with whatever amount that comes out as potential win no matter how small amount? Whatever the result of my bet, I’ll still be happy since I do gamble not for the profit and its just for an entertainment although there are times that I bet because for me its a sure win for the team and winning can also happen to me. There’s no limit, as long as my budget is still available and there’s still a chance to have a win, then why not.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}