{
  "id": "topic_5405846",
  "title": "acroman08",
  "author": "acroman08",
  "created_time": "July 11, 2022, 04:46:39 AM",
  "content": "Recently someone in our country just won a whopping 401Million Pesos(7+Million dollars) from our 6/55 Grand Lotto and another Winner of 5.9Million Pesos(105k Dollars) from our 6/42 Lotto draw. I am happy for these two winners but I am a little worried since the Lotto Organizer mentioned what city they are from. I hope that the Lotto organizer never mentions their names since these people who just had a life-changing experience could be in danger if they ever revealed their names.here's the link if you are curious about the article https://www.pna.gov.ph/articles/1178611",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5405846",
  "comments": [
    {
      "author": "Don Pedro Dinero",
      "created_time": "July 11, 2022, 05:42:53 AM",
      "body": "Quote from: acroman08 on July 11, 2022, 04:46:39 AMI am happy for these two winners but I am a little worried since the Lotto Organizer mentioned what city they are from. I hope that the Lotto organizer never mentions their names since these people who just had a life-changing experience could be in danger if they ever revealed their names.There are people who win the lottery and even voluntarily go on the news because they like everyone to know about it, when they are putting themselves in the crosshairs of criminals. In this case, if they have only said the city, it is not a problem, but the winners can also put themselves in the target of criminals if they make ostentatious expenses.I certainly wouldn't voluntarily appear on the news showing my face to let everyone know that I have won many millions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "harizen",
      "created_time": "July 11, 2022, 05:59:49 AM",
      "body": "Quote from: acroman08 on July 11, 2022, 04:46:39 AMI hope that the Lotto organizer never mentions their names since these people who just had a life-changing experience could be in danger if they ever revealed their names.Prior to that, there are several people who won the jackpot too within just a few months.Don't worry, if you are not used to following the PCSO lottery, they never ever tell or mentioned the names of the jackpot winner in the public. I'm sure you are watching some news before and you don't remember that PCSO named the jackpot winners.If they will be in danger, then they can't control it anymore. They just have to keep it secret as much as they can and always be safe. But personally, for me, that's not the issue they will face but surely, if they will be known as a jackpot winner, lots of people and strangers might try to ask for \"balato\" on their home. Another one is, and that's common here in PH, they will be having more relatives if you know what I mean.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "davis196",
      "created_time": "July 11, 2022, 06:20:37 AM",
      "body": "Mentioning the winner's city isn't revealing his full identity. What if the winner lives in a big city?Revealing the winner's identity, when he or she lives in a small city could become a problem.The crime rates in the Philippines must be really high, so the lottery winners have to be extra cautious. There isn't such problem in my country and most of the people, who won the national lottery reveal their identity without any hesitation(even though this is completely voluntary).I assume that the Lotto organizer isn't allowed by the law to mention the winner's names unless they give him permission.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Maus0728",
      "created_time": "July 11, 2022, 06:22:09 AM",
      "body": "QuoteThe PCSO gives the jackpot prize as a lump-sum amount—you can’t receive it in installmentsLink to postWell, if this is the case, I think PCSO would transfer the amount of money in cheque thru their affiliated banks for the security of winner. Another option would be to hire a lawyer when claiming the cash prize at their office especially when you are really in doubt.But the funny thing is, most of the Filipinos who won lotteries loses their cash winning due to the suckers in their family as well as poor financial management. And personally, winners should be more afraid to the people who know them personally.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitcoinPanther",
      "created_time": "July 11, 2022, 06:34:06 AM",
      "body": "I think there is nothing to worry about if the Lotto Organizer mentions their places.  I think it is an SOP to announce where are the winning ticket and the outlet that sells it. I am sure they will keep the name of the winners in private since it is also one of the SOP unless the winners expose themselves.Quote from: Maus0728 on July 11, 2022, 06:22:09 AMBut the funny thing is, most of the Filipinos who won lotteries loses their cash winning due to the suckers in their family as well as poor financial management. And personally, winners should be more afraid to the people who know them personally.True that, because those winners lack financial education and aren't ready to handle huge amount of money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "swogerino",
      "created_time": "July 11, 2022, 06:46:06 AM",
      "body": "Quote from: acroman08 on July 11, 2022, 04:46:39 AMRecently someone in our country just won a whopping 401Million Pesos(7+Million dollars) from our 6/55 Grand Lotto and another Winner of 5.9Million Pesos(105k Dollars) from our 6/42 Lotto draw. I am happy for these two winners but I am a little worried since the Lotto Organizer mentioned what city they are from. I hope that the Lotto organizer never mentions their names since these people who just had a life-changing experience could be in danger if they ever revealed their names.here's the link if you are curious about the article https://www.pna.gov.ph/articles/1178611I am very happy for them.I feel them,I imagine their excitement,I always play my favorite state lotto here 6 from 49 and I never managed to won more than some lower prizes,worthless prizes compared to the person who has won the 6 numbers correctly.I don't know how often they organize the lotto in your country but here is different every time based on the amount of the tickets sold,usually we have it once every two weeks but some times even weekly when sales keep going on better than predicted.The problem here is that the winners are every time in TV to get the check to their bank account,however up until now no one has been kidnapped for ransom hopefully this will be the same even in your country.I agree though it would be better for full anonymity of the winner/s.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Baofeng",
      "created_time": "July 11, 2022, 07:27:21 AM",
      "body": "In a country like ours? yeah, might be good to hide their names and faces because they might be a target for criminals here. But I think there are countries who exposes their lottery winners, maybe just to proved that someone really won their lottery and it's not rigged or something. So it's really up to the winners on how they are going to protect themselves and their winnings too. They might be a target for their relatives hehehe, we know how Filipinos are, who have a lot of extended families. Hopefully, the winner will learn where to invest the money they have won so that they can live a better life with their children and their next generation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "KennyR",
      "created_time": "July 11, 2022, 08:31:42 AM",
      "body": "In my opinion it is always good to keep the names hidden from the rest of the world. It is not just because of criminal threat, but the people close to them will also start expecting. I've seen people helping the one that helped them in their hard days. In such a way helping others and giving on request is different. For many reasons what the lottery firm have decided to do is really good.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Doell",
      "created_time": "July 11, 2022, 09:17:23 AM",
      "body": "Amazing congratulations to that person, I think the winner now is already hiding from various threats, besides the villain, I think a lots of gambler friend in the blankets that come out when they smell money . Agreed it's actually better to be anonymous but the Lotto organizers also need a proof to show that public they are legit, so that other gamblers don't have to worry about the prize funds, because usually a lot of gamblers have questions on that side.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ethereumhunter",
      "created_time": "July 11, 2022, 09:25:37 AM",
      "body": "Hopefully the Lotto organizers can learn from this experience so that in the next event, they will not mention the name of the winner and which city they are from. This can trigger crimes committed by people with bad intentions to steal money or rob their homes.Winning the Lotto prize requires a lot of luck and not everyone can get it. These Lotto winners will surely fulfill their dreams by buying the things they want.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Beparanf",
      "created_time": "July 11, 2022, 09:30:43 AM",
      "body": "Quote from: acroman08 on July 11, 2022, 04:46:39 AMRecently someone in our country just won a whopping 401Million Pesos(7+Million dollars) from our 6/55 Grand Lotto and another Winner of 5.9Million Pesos(105k Dollars) from our 6/42 Lotto draw. I am happy for these two winners but I am a little worried since the Lotto Organizer mentioned what city they are from. I hope that the Lotto organizer never mentions their names since these people who just had a life-changing experience could be in danger if they ever revealed their names.here's the link if you are curious about the article https://www.pna.gov.ph/articles/1178611I was one of those who bet for that jackpot but no luck to win. Haha. I’m not a regular lottery bettor but I always purchased ticket every year whenever the jackpot price was already close to half billion pesos. Since this is a government lottery, Sometimes I wonder if they are cheating the result or not since they have the power to do it considering how many corrupt people has high position on government agency.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kotajikikox",
      "created_time": "July 11, 2022, 09:35:46 AM",
      "body": "Quote from: acroman08 on July 11, 2022, 04:46:39 AMRecently someone in our country just won a whopping 401Million Pesos(7+Million dollars) from our 6/55 Grand Lotto and another Winner of 5.9Million Pesos(105k Dollars) from our 6/42 Lotto draw. I am happy for these two winners but I am a little worried since the Lotto Organizer mentioned what city they are from. I hope that the Lotto organizer never mentions their names since these people who just had a life-changing experience could be in danger if they ever revealed their names.here's the link if you are curious about the article https://www.pna.gov.ph/articles/1178611I think they are just trying to tell people that there is a  legit winner though its bad for the security of the said winners, but what i also see in other countries that the lotto winner shad been announced their  cities or provinces .but congratulations to those winners ,I hope that they are deserving that wins and will spend in rightful manners than just another gambling activities.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "noormcs5",
      "created_time": "July 11, 2022, 10:02:18 AM",
      "body": "Quote from: acroman08 on July 11, 2022, 04:46:39 AMRecently someone in our country just won a whopping 401Million Pesos(7+Million dollars) from our 6/55 Grand Lotto and another Winner of 5.9Million Pesos(105k Dollars) from our 6/42 Lotto draw. I am happy for these two winners but I am a little worried since the Lotto Organizer mentioned what city they are from. I hope that the Lotto organizer never mentions their names since these people who just had a life-changing experience could be in danger if they ever revealed their names.here's the link if you are curious about the article https://www.pna.gov.ph/articles/1178611This is too much money for anyone living in the Philippines and they should remain vigilant for the next few days and weeks. Criminals and thieves are looking for such people but since this news is public, they should not try to mess up here.I am afraid that their names won't remain hidden for long as they will need to present their identity in order to get the checks and someone will reveal their identity to the outside world.QuoteThey can claim their checks at the PCSO main office in Mandaluyong City upon presentation of the winning tickets and two identification cards.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kakmakr",
      "created_time": "July 11, 2022, 11:19:41 AM",
      "body": "I think by revealing only the city name, the casino are not endangering the players real identity. In the 2020 census, Iloilo City had a population of 457,626 inhabitants, with a 0.42% population annual growth rate. For the metropolitan area, the total population is 1,109,649 inhabitants. Source : https://artsandculture.google.com/entity/iloilo-city/m04wdb1?hl=en (So finding a single Lotto winner in a metro with 1,109,649 people will be extremely hard)Some winners even allow the Lotto operators to publish their name, without the surname for promotion and publicity, because it gives some credibility to the lotto operation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rruchi man",
      "created_time": "July 11, 2022, 11:26:05 AM",
      "body": "Quote from: acroman08 on July 11, 2022, 04:46:39 AMI am happy for these two winners but I am a little worried since the Lotto Organizer mentioned what city they are from. I hope that the Lotto organizer never mentions their names since these people who just had a life-changing experience could be in danger if they ever revealed their names.The wise thing to do after winning such a huge money  to me is usually to change your location as quickly as possible to avoid issues. After collecting your earnings, for safety reasons do not be stingy and decide to stay in your home that everyone knows, you know good news travels fast, to avoid being robbed or unnecessary billing(demand) from people, stay in a hotel and tell only very few trusted friends your whereabouts, after a few days in the hotel, make arrangement to travel, or move to another city or location to start afresh away from the eyes of people who know your story.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blockman",
      "created_time": "July 11, 2022, 11:27:16 AM",
      "body": "Congratulations to both of them and I wish that they'll spend that money wisely and they won't go broke after a few years just like what I've watched with those past lotto winners. I think it's also possible that the announcement where they've won could also be a trick and not serious to hide the identity of the winner. But if it is for real, it should be kept confidential.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "robelneo",
      "created_time": "July 11, 2022, 11:41:04 AM",
      "body": "Quote from: acroman08 on July 11, 2022, 04:46:39 AMRecently someone in our country just won a whopping 401Million Pesos(7+Million dollars) from our 6/55 Grand Lotto and another Winner of 5.9Million Pesos(105k Dollars) from our 6/42 Lotto draw. I am happy for these two winners but I am a little worried since the Lotto Organizer mentioned what city they are from. I hope that the Lotto organizer never mentions their names since these people who just had a life-changing experience could be in danger if they ever revealed their names.here's the link if you are curious about the article https://www.pna.gov.ph/articles/1178611The lotto organization in that country I'm sure it's from the Philippines has no record of mention of their names they name a city but never the exact names, its the policy of the lottery and other countries are implementing full anonymity unless the winners stated that his name be exposed, they in fact have guidelines for winners they even gave them a lesson on how to handle their winnings but the lottery organization can do what's on their policy, it's the winner's money he can do whatever he wants to do with his money and how he will manage it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "madnessteat",
      "created_time": "July 11, 2022, 11:41:32 AM",
      "body": "I'm glad someone is lucky enough to win such sums in gambling. On the one hand I support the situation when personal data about the winner is hidden for security purposes, but on the other hand I would like more transparency for users.This is what is good about cryptocurrencies, because you can always see the transaction of sending money to the winner.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wexnident",
      "created_time": "July 11, 2022, 11:52:39 AM",
      "body": "O you don't have to worry about it that much, there's been a bunch of winners in the past and they haven't really (afaik) released any personal info pertaining to the winners. City isn't really a problem since there's a LOT of people out there living in the same city most likely. And I don't think the winners don't know the risks involved with them winning. They're probably off preparing a bunch of stuff already to maybe move out or temporarily live somewhere else.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}