{
  "id": "topic_5462205",
  "title": "weplaygames",
  "author": "weplaygames",
  "created_time": "August 05, 2023, 08:37:45 PM",
  "content": "For our new e-gaming project (innovative casino) we are looking for Live Support manager and ModeratorRequirements- experience in communication with customers (welcome is experience in casino field)- be able to help customers on live chat (Intercom)- be able to moderate onsite chat (as moderator)Our offer:- Payment weekly or bi-weekly in cryptoWe are looking for guy(s) who is able provide support to customers and moderate site with all customers (backend access). Contact us if you are interested in this vacancy: https://t.me/redkeyservicesBtw. Drop contact on Telegram and you can be part of new project. (more details will be provided on TG)",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5462205",
  "comments": [
    {
      "author": "shasan",
      "created_time": "August 06, 2023, 02:19:43 AM",
      "body": "Quote from: weplaygames on August 05, 2023, 08:37:45 PMFor our new e-gaming project (innovative casino) we are looking for Live Support manager and ModeratorRequirements- experience in communication with customers (welcome is experience in casino field)- be able to help customers on live chat (Intercom)- be able to moderate onsite chat (as moderator)Our offer:- Payment weekly or bi-weekly in cryptoWe are looking for guy(s) who is able provide support to customers and moderate site with all customers (backend access). Contact us if you are interested in this vacancy: https://t.me/redkeyservicesBtw. Drop contact on Telegram and you can be part of new project. (more details will be provided on TG)I am able to work as a moderator and live chat manager. Would you like to send me a pm on the forum or details on here or send a message to me on my telegram? My telegram ID is mentioned on my profile and also I am posting my telegram ID here. My telegram ID is t.me/shasan32 Never rely on any message who send first pretending me.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yahoo62278",
      "created_time": "August 06, 2023, 04:20:02 AM",
      "body": "I have also sent a message regarding your post. yahoo62278 is my telegram handle. I noticed you are looking for testers of your games as well, I may be interested in helping with all your needs as I have a few contacts who have been good mods for me in the past.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}