{
  "id": "topic_5418814",
  "title": "Flexystar",
  "author": "Flexystar",
  "created_time": "October 30, 2022, 11:09:44 AM",
  "content": "I am sure this might have discussed already or may be not?But I am so excited to see that the word HODL was actually invented on the Bitcointalk Forum on December 18, 2013. Actually I was reading through medium article regarding top historical events of bitcoin which changed many things in the world of crypto. So the fellow member @GameKyuubi who seems to be oldest player; however less active on the forum these days actually invented this phrase and word. This was literally happened due to he was whiskey drunk and made mistake while creating thread titled I am Holding rather typed HODLING. This was sweet mistake and it literally gone viral and now we actually use it for real. I literally found out it today  Did everyone else already knew this was bitcointalk forum member itself?QuoteI type d that tyitle twice because I knew it was wrong the first time.  Still wrong.  w/e.  GF's out at a lesbian bar, BTC crashing WHY AM I HOLDING? I'LL TELL YOU WHY.  It's because I'm a bad trader and I KNOW I'M A BAD TRADER.  Yeah you good traders can spot the highs and the lows pit pat piffy wing wong wang just like that and make a millino bucks sure no problem bro.  Likewise the weak hands are like OH NO IT'S GOING DOWN I'M GONNA SELL he he he and then they're like OH GOD MY ASSHOLE when the SMART traders who KNOW WHAT THE FUCK THEY'RE DOING buy back in but you know what?  I'm not part of that group.  When the traders buy back in I'm already part of the market capital so GUESS WHO YOU'RE CHEATING day traders NOT ME~!  Those taunt threads saying \"OHH YOU SHOULD HAVE SOLD\" YEAH NO SHIT.  NO SHIT I SHOULD HAVE SOLD.  I SHOULD HAVE SOLD MOMENTS BEFORE EVERY SELL AND BOUGHT MOMENTS BEFORE EVERY BUY BUT YOU KNOW WHAT NOT EVERYBODY IS AS COOL AS YOU.  You only sell in a bear market if you are a good day trader or an illusioned noob.  The people inbetween hold.  In a zero-sum game such as this, traders can only take your money if you sell.so i've had some whiskeyactually on the bottle it's spelled whiskyw/esue me(but only if it's payable in BTC) The Original Post Goes Here.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5418814",
  "comments": [
    {
      "author": "Kakmakr",
      "created_time": "October 30, 2022, 11:25:03 AM",
      "body": "Yes, I saw that ...... it was actually just a typo ..and someone saw that and thought it was catchy.. and they continued doing it. Some people seem to believe that it is the abbreviation for \"hold on for dear life\"  https://www.investopedia.com/terms/h/hodl.asp  .... I also saw a guy with a T-shirt in a Crypto movie that said \"Hodl\" ..the name of the movie is \"Bitcon\" - https://www.imdb.com/title/tt14463198/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fiulpro",
      "created_time": "October 30, 2022, 06:25:42 PM",
      "body": "I am pretty sure that it was a typo as well but no one knew how it created a movement but HOLDING and HORDING when combined might have given rise to this funny word that does not exist in Oxford dictionary. I also got to know about the invention of this word few years ago, this was definitely interesting since now we are seeing loads of people using it. It's not just holding your coins, it's also collecting all that you can and making sure you don't give into the demands of the high price.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wiwo",
      "created_time": "October 30, 2022, 06:49:43 PM",
      "body": "Several of us here including myself have made this a trend, and the word hodling is not the only one derived from this forum. Bitcointalk members also use a few other concepts derived from this forum as well. This realization occurred to me some months ago and it goes a long way to demonstrate how creative forum members are when they take the positive vibes that come from a user mistake and turn them into a slogan that has become the talk of the town.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OgNasty",
      "created_time": "October 30, 2022, 07:35:10 PM",
      "body": "Quote from: OgNasty on October 29, 2022, 08:39:15 PMI made a thread some time ago with what I felt were 10 of the most classic Bitcointalk posts.  I'll link to it below.  It's not a bad place to start if you're wanting to learn more about what has gone on here over the years, especially the highlights.  Throughout the thread you'll find that other people have also listed some threads that they feel were important.  Feel free to add to their suggestions if you think there's been a thread that hasn't been represented.  Happy reading.  Enjoy! TEN CLASSIC Bitcointalk posts:https://bitcointalk.org/index.php?topic=2822621.0I made this post on a similar topic that is still on these boards.  Bitcointalk has had a lot of great Bitcoin moments.  In fact, most of the events that happened in Bitcoin before around 2014 all happened here.  This site was once pretty much the entire Bitcoin economy.  When the market cap was below $20 million dollars it seemed almost like this was the workplace for the Bitcoin company.  We all cheered each others efforts and creations.  So much support and positivity.  It was an absolute paradise before the scammers and get rich quick folks found there way here.  Worth reading some of the classic posts...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "boyptc",
      "created_time": "October 30, 2022, 07:46:20 PM",
      "body": "Too many historical moments and words have been made through the forum and they will never get old.The greatest contributions have been from this forum. From satoshi, to Vitalik who was also became a member of the forum offered writing down articles for $5 worth of bitcoin, cmiiw.Also the greatest first buy of bitcoin pizzas, to the tracking of silkroads owner, they're all from here, this forum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nullama",
      "created_time": "October 30, 2022, 11:02:27 PM",
      "body": "Yes, this forum is full of great content.Although a lot of people in the outside don't really understand it.For example, they think hodl means \"hold on for dear life\", that just shows they have no idea about the origin of it, they probably don't know about the lesbian bar or whisky, etc...Also they think Laszlo selling 10,000 BTC for 2 pizzas was wasting a fortune, ignoring the fact that BTC was almost worthless at the time, that he got those coins by mining with his PC (so basically free pizza), that he published the first GPU miner, and that he continued to get pizzas for Bitcoin for a while. He even got more pizzas with lightning a few years ago. Yet people still see this event as a horrible mistake or something like that.Lots of people just don't get it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yudi09",
      "created_time": "October 31, 2022, 01:49:08 AM",
      "body": "Due to a typo, HODL has become a very well-known term to this day.HODL is also an attitude that needs to be applied in living life amidst uncertainty, not only useful in trading activities such as the current situation.I AM HODLING despite many sins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fundamentals Of",
      "created_time": "October 31, 2022, 02:06:52 AM",
      "body": "I already knew this years ago. I discovered this not anywhere else but within the forum itself. I just cannot remember how though. I think many users have already known this story also. If you notice the original post where the world hodl came from, you will see that it has received so many merits. At the time this post was made, the merit wasn't implemented yet. So all this merit came much later. All I'm saying is that this is already a celebrated post.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Despairo",
      "created_time": "October 31, 2022, 02:09:12 AM",
      "body": "He was drunk during make that's post, so it's a high likely was a typo \"HODLING\" instead of \"HOLDING\". But everyone keep repeating word of HODLING and that's the become phenomenal in this forum. Quote from: nullama on October 30, 2022, 11:02:27 PMAlso they think Laszlo selling 10,000 BTC for 2 pizzas was wasting a fortune, ignoring the fact that BTC was almost worthless at the time, that he got those coins by mining with his PC (so basically free pizza), that he published the first GPU miner, and that he continued to get pizzas for Bitcoin for a while. He even got more pizzas with lightning a few years ago. Yet people still see this event as a horrible mistake or something like that.Actually Laszlo is help the Satoshi vision who create Bitcoin as a currency, Laszlo use Bitcoin as a currency at that time to buy 2 pizza with 10,000 BTC. If Laszlo never did that, Bitcoin price might worth for small amount since people don't see it as a currency.Everyone should thank to Laszlo for his initial move to use Bitcoin as a currency, not by a mistake.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "1miau",
      "created_time": "October 31, 2022, 02:12:58 AM",
      "body": "Looks like GameKyuubi, \"inventor\" of HODL was well \"aware\" of Bitcoins natural cycles. At least it paid out for him obviously.  Bitcoin's fundamentals make it very suited to HODL, but I would expect that due to less impacts by halvings (Block rewards are only 6.25 compared to 50 BTC per Block earlier) and more adoption, Bitcoin's natural cycles will become less volatile. Which is also beneficial of course.  And there's a famous meme about trade vs. HODL:",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}