{
  "id": "topic_5509947",
  "title": "Ziskinberg",
  "author": "Ziskinberg",
  "created_time": "September 22, 2024, 03:11:19 AM",
  "content": "Just recently, the 50 basis point rate cut was approved, lowering the target federal funds rate to a range of 4.75% to 5%.For those who haven't read about it, here's a quick definition:\"A 50 basis point rate cut means a reduction in interest rates by 0.50% (since 1 basis point equals 0.01%). When the Federal Reserve or any other central bank cuts rates by 50 basis points, they are reducing the cost of borrowing by half a percentage point.\"In short, with lower interest rates, people have more opportunities to invest. Since Bitcoin is one of the most popular investments right now, many are linking this rate cut as one of the reasons why Bitcoin’s price surged.Read more. https://coinpedia.org/news/cryptocurrency-news-today-sept-21st-2024-bitcoin-price-at-63k-bnb-coin-becomes-top-gainer/https://news.abplive.com/business/crypto/crypto-price-today-september-19-check-global-market-cap-bitcoin-btc-ethereum-doge-solana-litecoin-ckb-sei-live-tv-1718349",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5509947",
  "comments": [
    {
      "author": "asriloni",
      "created_time": "September 22, 2024, 03:23:39 AM",
      "body": "It's Saylor who has anything to do with Bitcoin pump, not Fed rate cut. Saylor's buy made Fed rate cut effects become obsolete for bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oshosondy",
      "created_time": "September 22, 2024, 07:12:17 AM",
      "body": "The two reasons associated with the recent bull run that I read on the news are:The Bank of Japan’s maintenance on steady interest ratesThe United States Federal Reserve’s recent rate cut.So I will say that you are still correct.Quote from: asriloni on September 22, 2024, 03:23:39 AMIt's Saylor who has anything to do with Bitcoin pump, not Fed rate cut. There are times Saylor bought bitcoin but bitcoin price did not increase. It could also be part of the reasons this time as all news were positive but saying the US federal rate cut is not part of it is wrong.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ambatman",
      "created_time": "September 22, 2024, 07:35:52 AM",
      "body": "Yeah it had something or part of the reason it pumped.Reducing interest rate makes investment more attractive and unlike those buy the rumor and sell the newsThis is different and the effect is gradually creeping in.Many countries are taking interest rate to a level that could encourage investment like the ECD did.I'm quite positive for the remaining month of this year.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "September 22, 2024, 07:36:15 AM",
      "body": "Although interest rates have been cut, the interest rate is still high, with the range between 4.75% and 5% still high, but in the long run it is good news that the interest rate will be lower and therefore there is more liquidity flowing into the market, some of this liquidity may go to Bitcoin.It is a long term effect and all short term effects are psychological factors.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Iranus",
      "created_time": "September 22, 2024, 09:03:28 AM",
      "body": "In theory, the Fed's rate cut means that inflation is under control, the economy has recovered, and monetary policy will be loosened in the coming period. So this can be considered as the most important news for our economy and that is why the news of Fed rate cut received global attention. Not only bitcoin, if you look at the gold market, stocks...you will also see that gold has broken the peak, stock indexes have reached ATH. It's all part of the economy so there's no denying that rate cuts have had an impact on bitcoin's recent growth.This also shows that the government has a significant impact on the development of bitcoin as well as the cryptocurrency industry, but many people still believe that bitcoin does not need government support or is not affected by government policies.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "September 22, 2024, 10:21:35 AM",
      "body": "Pump?!!!Price barely went up 1%-2%, that is not even considered a tiny rise let alone be a \"pump\". Not to mention that bitcoin is not a pump and dump shitcoin to have pumps and dumps...This is just the continuation of the recovery from the crash we had back in August when price dropped down from $65k all the way down to $52k. Since September 6, the price has been recovering from that bottom and has slowly been inching back toward $65k again (currently $62k-ish).A \"pump\" the way you have in mind would be price rising up above $70k level.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "September 22, 2024, 10:25:13 AM",
      "body": "I thought that the reason was that the great crypto messiah watched some two incompetents try to buy something with Bitcoin, and then they attributed the transaction to him, which is somehow tragic, the man doesn't even know what QR codes are What have we come to when people think that a price increase of 4-5% should be called a pump...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ziskinberg",
      "created_time": "September 22, 2024, 11:33:05 AM",
      "body": "Quote from: asriloni on September 22, 2024, 03:23:39 AMIt's Saylor who has anything to do with Bitcoin pump, not Fed rate cut. Saylor was really optimistic about buying Bitcoin because he believes the \"iShares Bitcoin Trust (IBIT)\" will be trading on NASDAQ soon. This could lead to more institutional adoption, which he says will stabilize the price. In a way, it still feels connected to the government since we’re talking about institutional investors here.Quote from: hugeblack on September 22, 2024, 07:36:15 AMAlthough interest rates have been cut, the interest rate is still high, with the range between 4.75% and 5% still high, but in the long run it is good news that the interest rate will be lower and therefore there is more liquidity flowing into the market, some of this liquidity may go to Bitcoin.It is a long term effect and all short term effects are psychological factors.We need more organic investors for Bitcoin, real people driving massive adoption----not just institutions that would end up in control at the top and likely manipulate the market. That's something we definitely don't want to see.Quote from: pooya87 on September 22, 2024, 10:21:35 AMPump?!!!I might have chosen the wrong words, but I think we’re seeing a pretty significant increase right now--------enough to stir up some hype and make people believe that the bull run is back again.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dr.Bitcoin_Strange",
      "created_time": "September 22, 2024, 11:36:35 AM",
      "body": "Lately, there have been many coincidental event which I can not state the one that must have contributed to the price pump. @OP, apart from this event that you have described, I read that micro strategy acquired about 18,300 Bitcoin just between last month and the 12th day of this month. We also see the news that is every where concerning Trump paying for a burger with Bitcoin, which he was not even the one that made the payment himself. Any of those news must have caused the price to pump.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Catenaccio",
      "created_time": "September 22, 2024, 12:11:19 PM",
      "body": "Quote from: pooya87 on September 22, 2024, 10:21:35 AMPump?!!!Price barely went up 1%-2%, that is not even considered a tiny rise let alone be a \"pump\". Not to mention that bitcoin is not a pump and dump shitcoin to have pumps and dumps...Bitcoin is not a pump and dump coin, and it will never be.Pump and dump are for altcoins, or in other words shitcoins and scam coins that are created easily with premined, mint functions and they are all easily die.Of the over 24,000 cryptocurrencies listed on CoinGecko since 2014, 14,039 have died.If Bitcoin pumps because of FED rate cut decision, it will dump when FED announces a technical recession or a recession. We all know that whole world are in recession, and technical recession term is used by some governments recent months, is only a misleading word to minimize severity of recession and panic in community.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zaguru12",
      "created_time": "September 22, 2024, 02:29:33 PM",
      "body": "Quote from: asriloni on September 22, 2024, 03:23:39 AMIt's Saylor who has anything to do with Bitcoin pump, not Fed rate cut. Saylor's buy made Fed rate cut effects become obsolete for bitcoin. In as much as both of them can’t directly influence a pump directly they can actually influence the market sentiment, Michael Saylor has always been buying bitcoin at every dip price and it isn’t moving anyone, the announcement of him get a new purchase was done a day after the fed rate cuts, bitcoin had a spike to $63k from $59k after the Fed rate announcement so he isn’t actually influencing anything. Quote from: Catenaccio on September 22, 2024, 12:11:19 PMIf Bitcoin pumps because of FED rate cut decision, it will dump when FED announces a technical recession or a recession. We all know that whole world are in recession, and technical recession term is used by some governments recent months, is only a misleading word to minimize severity of recession and panic in community.Should I say that the news of either actually caused a little shift of market sentiment, I could recall in August when it was announced that there is a possibility of recession, the looming recession news caused a little dip then and just as how the market reacted to the fed cut again. The question actually is whether this little movement are actually worthy of been called a pump or dump which I don’t agree on. A significant movement should be a movement of $10k plus movement.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JeromeTash",
      "created_time": "September 22, 2024, 02:46:37 PM",
      "body": "Just the usual expected price movements, not a pump in my opinion, and I don't think it has anything to do with the US Fed rate cut. At this rate we are going to reach a point where if Bitcoin price changes by 0.5%, then it has something to do with some Government decision or stuff like that  By the time of the conference, the price was already on its way up from the most recent dip if you look at the longer time frames on the chart.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fuguebtc",
      "created_time": "September 22, 2024, 02:56:59 PM",
      "body": "Quote from: Catenaccio on September 22, 2024, 12:11:19 PMIf Bitcoin pumps because of FED rate cut decision, it will dump when FED announces a technical recession or a recession. We all know that whole world are in recession, and technical recession term is used by some governments recent months, is only a misleading word to minimize severity of recession and panic in community.That is definitely going to happen, I believe bitcoin will be dumped heavily if the economy goes into recession because bitcoin is not an effective inflation hedge or safe haven. Remember 2022 when inflation hit our economy? Bitcoin has also dropped to $15k and lost 70% of its value while assets considered as the top inflation hedge like gold have held their value very well and even increased. So I wouldn't be surprised to see bitcoin prices do even worse if a global recession hits.If bitcoin can operate independently of the global economy and is not affected by any macro news, then I am more convinced that every move of bitcoin is manipulated, and that's worse than it becoming a part of the global economy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SamReomo",
      "created_time": "September 22, 2024, 03:09:34 PM",
      "body": "Quote from: Ziskinberg on September 22, 2024, 03:11:19 AMIn short, with lower interest rates, people have more opportunities to invest. Since Bitcoin is one of the most popular investments right now, many are linking this rate cut as one of the reasons why Bitcoin’s price surged.Well, there's chance that the price cut that you mentioned might be the cause of Bitcoin's price appreciation, however, no one knows well the real reason behind the growing value of Bitcoin. I guess, we're at the end of September and there's chance to see Bitcoin going even higher in value in month of October. But, the recent news of FTX crediting might cause some dips in the market and if that happen then it will take market some time to recover itself.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Solosanz",
      "created_time": "September 22, 2024, 03:13:17 PM",
      "body": "Quote from: fuguebtc on September 22, 2024, 02:56:59 PMThat is definitely going to happen, I believe bitcoin will be dumped heavily if the economy goes into recession because bitcoin is not an effective inflation hedge or safe haven. Remember 2022 when inflation hit our economy? Bitcoin has also dropped to $15k and lost 70% of its value while assets considered as the top inflation hedge like gold have held their value very well and even increased. So I wouldn't be surprised to see bitcoin prices do even worse if a global recession hits.If bitcoin can operate independently of the global economy and is not affected by any macro news, then I am more convinced that every move of bitcoin is manipulated, and that's worse than it becoming a part of the global economy.It's more like a Bitcoin's pattern instead of macro economy news. Take a look with 2017 ATH, in the next year Bitcoin price drop without any reason.It's similar to 2021, in the next year Bitcoin price drop too.So, if Bitcoin make new ATH in the next year, I wouldn't be surprised to see Bitcoin dump in the next two years because that's the pattern.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MarjorieZimmermanGinger",
      "created_time": "September 22, 2024, 04:21:24 PM",
      "body": "Quote from: Ziskinberg on September 22, 2024, 03:11:19 AMIn short, with lower interest rates, people have more opportunities to invest. Since Bitcoin is one of the most popular investments right now, many are linking this rate cut as one of the reasons why Bitcoin’s price surged.That is much more likely because with lower interest rates, people will have the opportunity to invest and automatically there will be a lot of liquidity flowing in the market. This is what is called polarization towards the long term is much better because there are some conditions where interest rates are lower even though it can be said that it is not too low for interest rates overall. But maybe we should also remember that bitcoin is not the same as other coins where there is a pump under certain conditions.The recovery point may continue to be maintained and even if the downward scenario occurs again, it will not go beyond the limit. Bitcoin is more attractive and strong now so many people are coming to take part and that is why bitcoin will continue to be the best investment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ImThour",
      "created_time": "September 22, 2024, 04:40:20 PM",
      "body": "It was definitely US Fed Rate Cut as a good news always pumps up the Bitcoin Price however it was also price action, those who are not into Technical Analysis will never agree to this however there are very important support and resistance zones when you look at the Bitcoin Chart. Bitcoin was at the Support Range and I even made a thread about it. So, it was just waiting for one bullish news to execute.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cryptomultiplier",
      "created_time": "September 22, 2024, 05:04:46 PM",
      "body": "Firstly, I think the price of BTC is still expected to pump irrespective of the various volatilities that could have contributed to the current pump. The halving already happened and we are still seeing the price rise to about $83,000 before or during the U.S elections in November.Yes, the U.S Fed rate cut, among other reasons like Trump making a public use of #1000 in Bitcoin to purchase some burger and drinks, and even Michael Saylor of Microstrategy purchasing bitcoin and owning about 1.2% of the total Bitcoin circulation, could be all reasons for the pump.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackHatCoiner",
      "created_time": "September 22, 2024, 05:33:17 PM",
      "body": "It could be interest rates. Or Michael buying just a regular billion, with his morning coffee. Or Trump realizing that Bitcoin is beyond \"computer coin\"; it's a currency! Or recovery. Or maybe a secret billionaire entered the space.Or maybe we have no damn clue what happened. It's a \"small pump\". Wake me up when we experience more than 10% \"pump\".",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}