{
  "id": "topic_5462078",
  "title": "Riverbank",
  "author": "Riverbank",
  "created_time": "August 04, 2023, 03:29:09 PM",
  "content": "Private crypto hedge fund project developement here.All assets Will be bough by DCA Buying the dip and sell on highs.After each selling investors getting payed their return  % I need few helpers on this becouse i dont have any money myself only idea vision and experince on trading and Investment i Lost all money myself for return i got experience and knowledge.Im looking for Few people who Will invest first so i get things ready like little bit marketing and other things to get it done.Im looking for Asap becouse i dont have any Job and Even if have Job Im in massive debt there is no way out other way then just make my life different all most over night. I been borrowing money a lot many times to test financial markets i been losing a lot but debt need to be payed and % Also i allready lost my home becouse of debt.For now Im looking for first investors who Will invest some little money like few hundred bucs each that Will keep me going to work with project and i can survive and working with project. Im in my life at point when i must do or die situation there is no hope for me anymore only way i either get super success or my life Will be miserble soon i could be probably homeless or alcholic becouse with regular ways i cant get up again anymore.My only way to survive Will be super success. The average ways like a regular job can't help me anymore i been losing all my money my bank accounts Are blocked i own debt to my family my friends the Banks and many other people aswell and me myself i have Zero money in my pockets and i have Lost many friends becouse of my life they all blame me but nobody dont Even think about what enourmous ammount of knowledge i do have becouse all of this experince... becouse most of my social circle people have and no had any dreams they Are very Limited on their minds but not me Im not like that limited minded i know that i can do great things.So that's my story and only thing Im sure i can Do is crypto hedge fund i can help others this way aswell.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5462078",
  "comments": [
    {
      "author": "WillyAp",
      "created_time": "August 04, 2023, 10:21:47 PM",
      "body": "Quote from: Riverbank on August 04, 2023, 03:29:09 PMPrivate crypto hedge fund project developement here.Do you actually know what a hedge fund is? You need to be highly connected to lead a hedge fund.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rat03gopoh",
      "created_time": "August 05, 2023, 12:47:11 PM",
      "body": "Quote from: Riverbank on August 04, 2023, 03:29:09 PMI need few helpers on this becouse i dont have any money myself only idea vision and experince on trading and Investment i Lost all money myself for return i got experience and knowledge.Im looking for Few people who Will invest first so i get things ready like little bit marketing and other things to get it done.Im looking for Asap becouse i dont have any Job and Even if have Job Im in massive debt there is no way out other way then just make my life different all most over night. I been borrowing money a lot many times to test financial markets i been losing a lot but debt need to be payed and % Also i allready lost my home becouse of debt.Even if you say you have good portfolio growth, people won't simply believe you. Here you say your preference which seems like you have a  poor management and results history (I think you're being honest but a funny offer). Think logically, how are you gonna help others while you haven't managed to improve your finances?Well, good luck.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "August 06, 2023, 10:42:58 AM",
      "body": "Quote from: Riverbank on August 04, 2023, 03:29:09 PMI need few helpers on this becouse i dont have any money myself only idea vision and experince on trading and Investment i Lost all money myself for return i got experience and knowledge.~snip~It seems to me that you are an alt account from the guy who recently asked for something similar, and as a reference he states that he lost everything he could lose, except for the house he supposedly bought for his parents. Even if you're not the same person, you share the same failed visions about how to achieve success - but that's pretty useless on this forum where most don't even have enough money for basic life needs, and those who have been around for a long time and have some savings are not naive who fall for such cheap tricks.If there is any truth in what you wrote, I suggest that you start from scratch and start solving your mess, but not in a way that asks for money from others.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}