{
  "id": "topic_5446776",
  "title": "notanewbie757",
  "author": "notanewbie757",
  "created_time": "March 29, 2023, 12:51:50 PM",
  "content": "Hoping someone can shed some light on this. Been using btc since 2015, so not my first rodeo. But this one is above my pay grade and has never happened before.Using electrum wallet. Was expecting a payment. Sender notified me payment was sent. I looked in the wallet and there was in fact a transaction in there. However, when I hovered the cursor over the transaction, the message said \"this transaction is only available on your local machine\". It said the network is unaware of the transaction and instructed me to either rebroadcast or remove the transaction. Also suggested connecting to a different server.Again, I'm the recipient.I tried different servers and even though I'm the recipient tried rebroadcast options but that didn't work.Finally, I removed the transaction from the local machine.Before I did that, I was able to view the details of the transaction and there was a transaction ID. I was able to search the transaction ID on Blockchain.com's explorer and it showed up as an INVALID transaction and unconfirmed. It showed the sender sending to my address as well as a much larger amount to another address. When clicking on my address and the other address, BOTH addresses showed a balance of zero and no activity/transactions.Lastly, when searching other block chain explorers with the tramsaction/hash ID the transaction does NOT come up. It only shows up on blockchain.com's search.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5446776",
  "comments": [
    {
      "author": "Charles-Tim",
      "created_time": "March 29, 2023, 01:05:24 PM",
      "body": "How long as the transaction been stuck? I mean in days. Likely the transaction is no more in mempool. You need to tell the sender to rebroadcast the inputs again. Never accept a transaction that has not been confirmed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "notanewbie757",
      "created_time": "March 29, 2023, 01:19:43 PM",
      "body": "This was roughly 24 hours ago.But the fact that it shows on blockchain,com's blockchain explorer and no others, combined with the fact that it showed up on my local machine is what makes this particularly confusing to me.I've had unconfirmed transactions here and there over the years that showed as such in the wallet and eventually confirmed. But nothing like this where it's only showing up as an invalid transaction in one place.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nc50lc",
      "created_time": "March 29, 2023, 01:30:23 PM",
      "body": "Quote from: notanewbie757 on March 29, 2023, 12:51:50 PM-snip- However, when I hovered the cursor over the transaction, the message said \"this transaction is only available on your local machine\". It said the network is unaware of the transaction and instructed me to either rebroadcast or remove the transaction. Also suggested connecting to a different server.The transaction was turned into a \"local transaction\" because the server that you're using can't find it in its mempool.And since you can't also find it in any blockexplorer, chances that it's dropped, replaced or has a replaced parent is high.Of course, providing the Transaction ID may help us determine if it's possibly intentional or not.The only course of action here is to inform the sender that his transaction was dropped so that he can send you another one.Additionally, if you're in a deal, waiting for at least 1 confirmation (more if valuable) is a must before finalizing the deal.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "notanewbie757",
      "created_time": "March 29, 2023, 01:42:16 PM",
      "body": "Is there a way I can send the transaction ID via private message?Could you help me understand how a sender could intentionally do this if in fact that was the case?I've thought about the potential of it being done intentionally but can't see how that works for the sender as the bottom line is that when you check the address provided (mine) it shows no funds received EVER and no transactions ever.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nc50lc",
      "created_time": "March 29, 2023, 02:01:31 PM",
      "body": "Quote from: notanewbie757 on March 29, 2023, 01:42:16 PMCould you help me understand how a sender could intentionally do this if in fact that was the case?Okay, there a few pointers:if the transaction's input was spent in another transaction with a different output, then it's certainly intentional.if the transaction's parent transaction was replaced which invalidated your (child) transaction, there's a chance that it's intentional or not.It depends if the sender just bumped the fee through rbf which unintentionally invalidated all of its child transactions.if it's for having a very low fee rate, it may not be intentional but with today's average mempools size, even 1sat/vB shouldn't be evicted from most mempools.Note: These are only possible with unconfirmed transactions.Quote from: notanewbie757 on March 29, 2023, 01:42:16 PMI've thought about the potential of it being done intentionally but can't see how that works for the sender as the bottom line is that when you check the address provided (mine) it shows no funds received EVER and no transactions ever.I have zero info about the deal so I can't comment on that.But please remember my note above about waiting for a confirmation before finalizing a deal.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pmalek",
      "created_time": "March 30, 2023, 02:07:01 PM",
      "body": "Quote from: nc50lc on March 29, 2023, 02:01:31 PMif it's for having a very low fee rate, it may not be intentional but with today's average mempools size, even 1sat/vB shouldn't be evicted from most mempools. That was the case in pre-ordinals times. I am sure it's all messed up since January, and (some, many, all, no idea how many) nodes are purging transactions to free up space. For example, mempool space currently shows that anything below 2.10 sat/vByte is getting purged.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nc50lc",
      "created_time": "March 30, 2023, 05:33:41 PM",
      "body": "Quote from: Pmalek on March 30, 2023, 02:07:01 PM-snip-I was talking about the timeframe when the said transaction was gone missing.Even with the ordinals bloating the blockchain, there are still a lot of time when the mempools do not reach the default maximum size, like right now or yesterday.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "khaled0111",
      "created_time": "March 30, 2023, 08:47:29 PM",
      "body": "Quote from: notanewbie757 on March 29, 2023, 01:19:43 PMBut the fact that it shows on blockchain,com's blockchain explorer and no others, combined with the fact that it showed up on my local machine is what makes this particularly confusing to me.As soon as the sender broadcasts the transaction, it will show up on your Electrum wallet and your balance will get updated accordingly. You can also see the transaction on blockexplorers as unconfirmed. What you need to know is that as long as the transaction is still unconfirmed, the received coins are not yours, not yet!Quote from: notanewbie757 on March 29, 2023, 01:42:16 PMCould you help me understand how a sender could intentionally do this if in fact that was the case?It's most likely the case. An unconfirmed transaction can easily be canceled by the sender while it's still unconfirmed and it's flagged as rbf (replaceable). You can do this within a click of a button. This is why I said unconfirmed balance is not yours.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "notanewbie757",
      "created_time": "March 30, 2023, 10:56:54 PM",
      "body": "Thanks for the replies. This was a case of someone I have transacted with once or twice before sending me an amount that was owed. The beauty of the blockchain is that both parties know the address that it was supposed to be sent to and we can both view it. If you view the address and there's a zero balance, then you didn't pay me. Period.I never did find out whether or not they cancelled the initial transaction or perhaps sent multiple payments without being properly funded. But they resent the transaction and all is well. I'm certain it wasn't malicious.What threw me was that I have used several different wallets since 2015 including electrum and I have never had a transaction show up on only my local machine and having it also show on only one blockchain explorer (as invalid) and not others I checked seemed even more strange.It's an eye opener for sure as I could see how someone, perhaps selling goods or services that was not well versed with btc transactions and confirmations could be made to think they received a transaction when in fact they didn't.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dzungmobile",
      "created_time": "March 31, 2023, 05:23:31 AM",
      "body": "Bank transfer or Bitcoin transactions, you must see payment in your account balance (bank transfer) and in your wallet (Bitcoin). With Bitcoin transactions, you must see at least one confirmation before complete your trade with your trade partner.If the trade is high in value, you can wait for 3 confirmations. Need to say, a first confirmation is hardest and longest to wait because it is related to its fee rate and mempools. After a first confirmation, later confirmations will be added by each next block and it will no longer relate to fee rate of that transaction.How many Bitcoin confirmations is enough?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nc50lc",
      "created_time": "March 31, 2023, 06:03:16 AM",
      "body": "Quote from: notanewbie757 on March 30, 2023, 10:56:54 PMWhat threw me was that I have used several different wallets since 2015 including electrum and I have never had a transaction show up on only my local machine and having it also show on only one blockchain explorer (as invalid) and not others I checked seemed even more strange.Yeah, blockexplorers don't actually have 100% identical data, they mostly rely on their own copy of each coins' blockchains.As for still showing invalid transaction, it's their unique \"feature\" to keep those data that aren't in their mempool or blockchain.It's actually useful in cases like this.Quote from: notanewbie757 on March 30, 2023, 10:56:54 PMI never did find out whether or not they cancelled the initial transaction or perhaps sent multiple payments without being properly funded. But they resent the transaction and all is well. I'm certain it wasn't malicious.So the transaction wasn't replaced by another with a different output and just had a replaced parent (rbf to bump the fee) or dropped from mempools..Glad to see that it went well.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}