{
  "id": "topic_5452561",
  "title": "Little Mouse",
  "author": "Little Mouse",
  "created_time": "May 13, 2023, 03:26:47 AM",
  "content": "With the recent surge in BTC on-chain transaction fees, Binance increased its withdrawal fee to 0.001 BTC from 0.0002 BTC. That's too high considering they do batch payments and don't require all these fees to process a transaction. Well, I know the withdrawal fee is another form of profit for exchanges, and I don't have a problem with that but what I really don't get is why they don't decrease the fee when the on-chain fee has decreased. They didn't take a long time to increase the fee when the on-chain fee was increased. I was in real trouble today lol.So, basically, it's not only the miners but also the exchanges get happy to see a surge in on-chain transaction fees. When they charged 0.0002 BTC per withdrawal, they would take for example 0.0001 BTC as profit while now, with charging a 0.001 BTC withdrawal fee, they are taking 0.0008 BTC profit from every single BTC withdrawal.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5452561",
  "comments": [
    {
      "author": "Oshosondy",
      "created_time": "May 13, 2023, 07:02:42 AM",
      "body": "Binance is centralized and they can do whatever they like to their customers. There are other exchanges that you can use instead if you think the fee is too high. I checked Kucoin, the withdrawal fee is 0.001 BTC which is $26.74 0.00042 BTC on OKX which is 11.2356. But there is lightning withdrawal also. 0.001 BTC on Huobi Global0.0005 BTC fee on BybitI still prefer OKX to withdraw bitcoin. But exchanges have the history of using bitcoin withdrawal fee to make money from their customers.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tabas",
      "created_time": "May 13, 2023, 08:30:01 AM",
      "body": "That's really high. They've made this note for it to make someone understand and think that fees are really that high.QuoteNetwork fee0.0000039 ~ 0.001 BTCWhile looking at the withdrawal fee is actually 0.001BTC, the other 2 options are to withdraw it in the form of BEP20 and ERC20. But I see the obvious of what they're trying to do. They want users to withdraw it through BSC network(BEP20) because the fee is just around $0.1 while them taking the actual BTC in replacement of their BTC(BEP20).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "May 13, 2023, 12:25:04 PM",
      "body": "There is already a discussion about it here -----> https://bitcointalk.org/index.php?topic=5451909.msg62212034#msg62212034Through it, I explained that the increase in fees in the interest of Binance has several aspects, the first of which is more money for them, and secondly, encouraging users to use their BSC, as increasing the withdrawal fees for bitcoins will make some beginners withdraw using WBTC in BSC.Therefore, increasing the fees is good for them, and they will try to make it much more because it brings them direct and indirect profits.Direct earnings example:Quote from: stompix on May 07, 2023, 04:27:25 PMHere is an example of Binance doing a tx:https://mempool.space/tx/e097cd778c171aee685baf67f63a96a09f0160685108c2d13ec65c83980b0332297 sat/vB  Fee   575,000 sat $166.56  and it has 78 outputs.So it has paid $166/78 > around $2.12 for each withdrawal.Or in Satoshi, they are charging  20000 and paying right now 7300 for each payment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaveF",
      "created_time": "May 13, 2023, 12:50:51 PM",
      "body": "This has been going on for years. Withdrawals are a profit center for exchanges. And as blockchain fees increased they had to increase their withdrawal fees to keep the profits going. You're dealing with a centralized for profit entity, why would anyone think that they're not going to do everything possible to keep profits as high as possible? Also, as silly as this might be, it's a customer service thing also. You charge insanely high fees, use a portion of them to pay insanely high fees to process customer withdrawals, and you don't have to deal with customers asking why they're not getting their coins. -Dave",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rby",
      "created_time": "May 13, 2023, 10:20:53 PM",
      "body": "Quote from: Little Mouse on May 13, 2023, 03:26:47 AMSo, basically, it's not only the miners but also the exchanges get happy to see a surge in on-chain transaction fees. When they charged 0.0002 BTC per withdrawal, they would take for example 0.0001 BTC as profit while now, with charging a 0.001 BTC withdrawal fee, they are taking 0.0008 BTC profit from every single BTC withdrawal.Well, without Binance being heavily affected by the mempool issues that led to transaction fees hike; when things were very much normal, exchanges add their services fee + other hidden charges and call it transaction fee. We have been styled to this, such that many newbies who never used a wallet never knew that you can conduct a transaction for a few cents.So, if on a normal circumstance, Binance transaction fee is higher, now they have reasons to go high, do we expect them to do the reverse? They bit and they pet. They charge you high and show you alternative.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "doomloop",
      "created_time": "May 14, 2023, 06:18:30 AM",
      "body": "Quote from: Oshosondy on May 13, 2023, 07:02:42 AMBinance is centralized and they can do whatever they like to their customers. There are other exchanges that you can use instead if you think the fee is too high. I checked Kucoin, the withdrawal fee is 0.001 BTC which is $26.74 0.00042 BTC on OKX which is 11.2356. But there is lightning withdrawal also. 0.001 BTC on Huobi Global0.0005 BTC fee on BybitI still prefer OKX to withdraw bitcoin. But exchanges have the history of using bitcoin withdrawal fee to make money from their customers.Which exchange one would use is totally based on where they have their funds, if someone is having Bitcoins in Binance, they obviously can't use another exchange, and the only way to tackle such high fees is to simply wait for the situation to get normal and then make your transactions using Bitcoin since every platform is using this opportunity for their own benefit, especially the centralized ones.We don't really get a say about how much an exchange or a platform should charge or why they are charging such high fees since they are the ones who are in total control of such things and they will obviously manipulate them and take profit.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oshosondy",
      "created_time": "May 14, 2023, 06:46:35 AM",
      "body": "Quote from: doomloop on May 14, 2023, 06:18:30 AMWhich exchange one would use is totally based on where they have their funds, if someone is having Bitcoins in Binance, they obviously can't use another exchange, and the only way to tackle such high fees is to simply wait for the situation to get normal and then make your transactions using Bitcoin since every platform is using this opportunity for their own benefit, especially the centralized ones.Bitcoin withdrawal fee on Binance is 0.001 BTC. I can see OKX withdraw at 0.00016 BTC which is lower as the mempool is getting decongested. Assuming I have money on Binance, I can convert it to a an altcoin which has very low or minute fee, then convert it back to bitcoin on OKX or any other exchange of lower fee to withdraw the bitcoin. Binance does not support lightning network too, but OKX does.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ethereumhunter",
      "created_time": "May 14, 2023, 08:42:39 AM",
      "body": "That's not surprising since Binance or any other exchange can increase or decrease their transaction fees anytime they want, including during the current situation. Exchanges are raising those transaction fees in anticipation of a spike in fees that could be higher than before, so they don't have to increase their fees again. But still, it's actually unwise to raise the cost to so high; unfortunately, we can't do anything about it either. Let's hope that after the transaction fees return to normal, Binance also lowers the fees to how they were before. But we also can use other exchanges if we mind the high transaction fees used by Binance.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yamane_Keto",
      "created_time": "May 14, 2023, 10:14:14 AM",
      "body": "As a user, all you can do is complain to the support team about the high fees and try to put pressure on social media to reduce their fees. Binance  care about customers’ money, and if hot money decide to leave the exchange, they will inevitably cut part of withdrawal profits in order to attract or maintain users. The above solution is practical, but it requires a lot of time and may not work. Therefore, search for the least altcoin with low withdrawal fees and high liquidity, which you can find in most exchanges. Withdraw your coins and deposit it to the new exchange that has the lowest Bitcoin withdrawal fees.If Binance notices that users will stop using exchange because of high withdrawal fees fees, it will inevitably reduce them, but they will not sacrifice these free profits easily.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rat03gopoh",
      "created_time": "May 14, 2023, 10:56:19 AM",
      "body": "Still, this isn't a new opinion due to the fact that the practice of charging withdrawal fees 5 to 10 times than onchain fees seems to have become commonplace even by developing exchanges. It's worth noting that the exchange also takes deposit sweep fees out of that withdrawal fee as well, although I don't know if they also have a way to save fees like batch sending.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "khaled0111",
      "created_time": "May 14, 2023, 09:17:07 PM",
      "body": "As other members mentioned above, it's a custodial service and they can charge whatever fees they want. You are free to choose whether to use their services or not, though.I'm just wondering why only withdrawal fees for bitcoin are too high, not only on binance but on almost all exchanges? It seems, for whatever reason, like they don't want customers to withdraw bitcoins and want to keep them on their wallets for as long as possible.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Little Mouse",
      "created_time": "May 16, 2023, 04:45:15 PM",
      "body": "Quote from: khaled0111 on May 14, 2023, 09:17:07 PMI'm just wondering why only withdrawal fees for bitcoin are too high, not only on binance but on almost all exchanges? It seems, for whatever reason, like they don't want customers to withdraw bitcoins and want to keep them on their wallets for as long as possible. Most exchanges charge far higher fees than the actual network fee. I can't remember if I have seen few exchanges which only charge the network fee. If I can remember correctly, Coinbase don't charge a lot of fees in their wallet service.FTX was offering almost free withdrawal (limted withdrawal, 1 per day if I can remember) but they couldn't survive. Right now, OKX charges 0.00027 BTC per withdrawal which is fair enough (considering what other exchange charges) though the network fee isn't that high right now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}