{
  "id": "topic_5452400",
  "title": "Bd officer",
  "author": "Bd officer",
  "created_time": "May 11, 2023, 04:06:56 PM",
  "content": "One of my close friends his name is Naher. He came to visit my house. Once while discussing with him, I mentioned the name of bitcoin. He wanted to know what bitcoin is? I was telling him that bitcoin is a digital cryptocurrency coin launched in 2009 by a man named satoshi. I tell him Bitcoin has been around for 14 years. I give him more idea about Bitcoin. At one point he expressed his interest in investing in bitcoin, I told him that there is a possibility of not only profit but also loss from investment.To invest you have to take risk. My friend invests in bitcoin knowing profit loss. He works for a salary of about $400 per month. He invested about $500 in Bitcoins. I didn't show my friend interest in investing in bitcoin. He himself knowingly invested in bitcoin.  Did I give my friend the right advice?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5452400",
  "comments": [
    {
      "author": "Ever-young",
      "created_time": "May 11, 2023, 04:39:27 PM",
      "body": "Firstly, their is no point in mentioning your guys name, another thing base on your explanation you told him the risk involve and how he shouldn't only be expecting profit both can also get losses sometimes which is also a good start. It's always good to tell people what they should be expecting and not just the advantage.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nwada001",
      "created_time": "May 11, 2023, 04:50:32 PM",
      "body": "Quote from: Bd officer on May 11, 2023, 04:06:56 PMI told him that there is a possibility of not only profit but also loss from investment.To invest you have to take risk. My friend invests in bitcoin knowing profit loss. OP, you have done well. I also want to ask you a question: since you have explained the inflation part to your friend in question, did you also explain the risk involved part and how to protect and maintain his funds? Buying funds is one thing; protecting those funds is another. I will advise you to also educate your friend regarding fund protection.How to protect his private key, which wallet is best, how to avoid some untrusted sites and links from unknown sources. If he is using a centralized platform, it should be temporary until he familiarizes himself with the blockchain and makes his own choice of security. He is 100% in charge of his own security; you should educate him on that so as not to hold you liable if he loses his funds in any way. I just think it's very important to point this out to anyone we are inviting into the crypto community.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "panganib999",
      "created_time": "May 11, 2023, 05:10:01 PM",
      "body": "Did you tell him to do uis own research and weigh his options before jumping the gun? If no is your answer then I can’t really say you gave your friend good advice. What he invested is more than a month’s worth of paycheck. If he could afford losing that in one go then coolsies. If not then he’s in for a bad run. It’s really tempting to invest in bitcoin with the premise of high profits, especially when bull runs come. But you have to also keep in mind that its volatile nature had left millions of people around the world with busted savings and debts that they probably are still paying for now. So be smart, invest what you can afford to lose, have him weigh his options, and only by then will I consider your advice a great financial suggestion. It’s not enough to tell them that there are risks, you have to show them how risky it could be.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bd officer",
      "created_time": "May 11, 2023, 05:41:23 PM",
      "body": "Quote from: Nwada001 on May 11, 2023, 04:50:32 PMHow to protect his private key, which wallet is best, how to avoid some untrusted sites and links from unknown sources. If he is using a centralized platform, it should be temporary until he familiarizes himself with the blockchain and makes his own choice of security. I told him a lot about safety, imparted knowledge in various ways. Since the investment will last for a long time. I recommend the Electrum Wallet wallet. He is using Electrum wallet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ReiMomo",
      "created_time": "May 11, 2023, 05:46:34 PM",
      "body": "My friend has already invested in Bitcoin with my advice. I clearly told about that Bitcoin is a good investment and how to secure the investment. I also explained the risk involved in this, but still he is interested he invested in Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "m2017",
      "created_time": "May 11, 2023, 06:04:08 PM",
      "body": "Quote from: Bd officer on May 11, 2023, 04:06:56 PMOne of my close friends his name is Naher. He came to visit my house. Once while discussing with him, I mentioned the name of bitcoin. He wanted to know what bitcoin is? I was telling him that bitcoin is a digital cryptocurrency coin launched in 2009 by a man named satoshi. I tell him Bitcoin has been around for 14 years. I give him more idea about Bitcoin. At one point he expressed his interest in investing in bitcoin, I told him that there is a possibility of not only profit but also loss from investment.To invest you have to take risk. My friend invests in bitcoin knowing profit loss. He works for a salary of about $400 per month. He invested about $500 in Bitcoins. I didn't show my friend interest in investing in bitcoin. He himself knowingly invested in bitcoin.  Did I give my friend the right advice? Another topic dedicated to the story of investing mother-father-brother? I believe, believe, and this is the truth. Ok. Your story would be more complete with the provision of supporting information (of course, one that can be shared online). It's your friend and I don't think there could be a problem with that, right. I'm sure you can explain to him the desire to share this with the bitcoin-community.If you told your friend about bitcoin, it would be wrong to keep silent about the bitcointalk forum. Help him create an account here and let him delve into the basics of BTC. It will be useful for him, because he's are interested in btc, as you say.500$ for the first investment in bitcoin. Isn't it too risky? And if a newbie friend makes a mistake with the address or something else, it will be a shame. Why not try with a small amount first to practice?By the way, when did your friend buy btc? Were there high transaction fees back then?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Furious 7",
      "created_time": "May 11, 2023, 06:08:21 PM",
      "body": "Quote from: Bd officer on May 11, 2023, 04:06:56 PMDid I give my friend the right advice? When in the context of discussions and talking about it and deciding to be in bitcoin then indeed I think it's pretty good, but in this case I would prefer to emphasize that things like this are not as easy as they seem. Telling bitcoin is indeed a pretty good step towards greater adoption of course, but on the other hand we also have to emphasize that even if it's good but nothing is certain in this case and your friend should research more about it.Even if nothing is in vain in the end when talking about bitcoin, but your friend is a beginner, it would be better to find information and learn more than to invest directly here because of course we know that the risk is also quite large.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackHatCoiner",
      "created_time": "May 11, 2023, 06:20:53 PM",
      "body": "You shouldn't listen to Internet strangers for financial advice (except from staying away from them, lol), so there isn't much to be said here. Time will tell if your friend made the right choice, which happens to be almost everyone's choice in this forum. If I were you, I'd have clarified he shouldn't be expecting profit in the short term, and that he is entirely responsible for his wallet's integrity; there is no company to address for that matter. So I'd guide him at start, on what wallet software to choose, how to securely airgap a device etc. I'd also advice him to stay away from centralized exchanges; at least not leave funds there.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sunsilk",
      "created_time": "May 11, 2023, 06:24:34 PM",
      "body": "Well, if you've said the potential for him to lose and to profit and so I guess that's enough already for your friend to understand that Bitcoin isn't just an overnight investment that people have been misleading of. If you didn't convinced him and you just told and introduced him to Bitcoin, it's not your fault if you see him or he actually sees that the market is dropping and his entire portfolio or purchased Bitcoin starts to drop in value. You've explained well to him that he could profit and lose from it, so, that's all about he has need to know. It's also possible that he had made his research even before you've mentioned it to him or just after he heard it from you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hatchy",
      "created_time": "May 11, 2023, 06:25:16 PM",
      "body": "Telling your friend about Bitcoin, is a way to help increase the Bitcoin community, Weldone mate. But I don't think your friend should have invested on Bitcoin just yet. He barley understands the risk involved. As his friend, you should have advised him to exercise little patience and start investing when he has taken his own time to learn about trading.Jumping into investment could put his money at risk and later on he could run back balming you for this. 500$ is a big amount, hope he is not thinking that Bitcoin is a get rich quick program? Because if yes then that would be a fault from his end. Also, I think you should Invite your friend to this forum  BITCOINTALK so he would at least be able to ask questions if need be. And from time to time check on him. So he wouldn't loos his funds to scammers through various means.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptSafe",
      "created_time": "May 11, 2023, 06:32:48 PM",
      "body": "OP you have had the experience with bitcoin so I must say all you must have told your friend about bitcoin must be genuine without ill intentions. You should also tell your friend not to click on links he sees or received via email on any device on which he stored his asset because scammers and hackers are always alert looking for who to invade their privacy as to get access to their informations and details to steal their assets and funds.Lastly, do well to recommend good and well secured wallet for your friend to store his bitcoin, advise him on the dangers in holding his assets and funds with third party exchange as they are not safe and trustworthy to hold funds and assets.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Vaskiy",
      "created_time": "May 11, 2023, 06:58:51 PM",
      "body": "From the discussion pattern and the way OP's friend have decided to invest in bitcoin, it looks like OP's friend have heard about bitcoin earlier through someone else or through some source. When OP too spoke about it, the friend might've built confidence on investing into bitcoin. Nothing seems to be the fault of OP, it is our responsibility to spread the word. OP have done it and he hadn't compelled his friend to invest into bitcoin or other cryptocurrencies.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "alastantiger",
      "created_time": "May 11, 2023, 07:24:38 PM",
      "body": "Quote from: Bd officer on May 11, 2023, 04:06:56 PMMy friend invests in bitcoin knowing profit loss. He works for a salary of about $400 per month. He invested about $500 in Bitcoins. I didn't show my friend interest in investing in bitcoin. He himself knowingly invested in bitcoin.  Did I give my friend the right advice? Investing $500 in bitcoin as a novice is too especially at this time. It is good enough that you told him about bitcoin but you should have counselled him properly. There are a lot of things missing... why did he try the Dollar Cost Average method. Imagine if he had only invested $50 instead of $500. How do you think he would feel if his invested dropped from $50 to $30 as opposed to a drop from $500 to $90. I hope you see the point in my example. So you still have to educate him.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bangjoe",
      "created_time": "May 11, 2023, 07:27:27 PM",
      "body": "Quote from: ReiMomo on May 11, 2023, 05:46:34 PMMy friend has already invested in Bitcoin with my advice. I clearly told about that Bitcoin is a good investment and how to secure the investment. I also explained the risk involved in this, but still he is interested he invested in Bitcoin. That is a good thing, you will not be mistaken if he makes a mistake in his investment after you explain the risk and suggest how to invest in bitcoin safely.Your friend may have learned bitcoin outside what you have given that makes it confident with the opportunity.I have also done what you did, but what I have explained to my friend he did not remember what was concerned in the investment of Bitcoin, one day he had panicked in his investment and forcibly selling Bitcoin in last year and suffered sufficient losses Quite large, and strangely he blamed me and acting Victim playing, he made me who plunged him to the loss he experienced, it made me disappointed and lazy when my friend asked and asked for guidance.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Agbe",
      "created_time": "May 11, 2023, 07:44:00 PM",
      "body": "You explain give your friend about Bitcoin, and he made up his mind to jump onto Bitcoin investments, you try tell your about the risk involved, It’s not enough to tell your friend that there are risks, you have to show them how risky it could be. And tell him  some more things that you supposed to tell him things like, invest what you can afford to lose, don't fear or panic on the market price speculating, don't discouraged when other are panic, if you fear you lose more, focusing on what you are investing, know when to buy and to sell, and not hurry in investments. Informed him this too how to protect his private key, which wallet is best, how to avoid some untrusted sites and links from unknown sources. You should also inform your friend not to click on anyhow links that he sees or received via email on any device on which he stored his asset because scammers and hackers are always alert looking for who to invade their privacy as to get access to their informations and details to steal their assets and funds.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Silberman",
      "created_time": "May 11, 2023, 07:44:36 PM",
      "body": "Quote from: Bd officer on May 11, 2023, 04:06:56 PMOne of my close friends his name is Naher. He came to visit my house. Once while discussing with him, I mentioned the name of bitcoin. He wanted to know what bitcoin is? I was telling him that bitcoin is a digital cryptocurrency coin launched in 2009 by a man named satoshi. I tell him Bitcoin has been around for 14 years. I give him more idea about Bitcoin. At one point he expressed his interest in investing in bitcoin, I told him that there is a possibility of not only profit but also loss from investment.To invest you have to take risk. My friend invests in bitcoin knowing profit loss. He works for a salary of about $400 per month. He invested about $500 in Bitcoins. I didn't show my friend interest in investing in bitcoin. He himself knowingly invested in bitcoin.  Did I give my friend the right advice? You were honest with your friend and that is what matters, you told him a little bit about the history of bitcoin and you were open about the possibly of earning and losing money as well, if your friend then decided to invest on their own and they lose some money that is on them and in my opinion you hold no moral responsibility if that were to happen, but at the same time your friend could still blame you so you need to be careful about this scenario as you could potentially lose a friend.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sakanwa",
      "created_time": "May 11, 2023, 07:53:32 PM",
      "body": "Quote from: Bd officer on May 11, 2023, 04:06:56 PMOne of my close friends his name is Naher. He came to visit my house. Once while discussing with him, I mentioned the name of bitcoin. He wanted to know what bitcoin is? I was telling him that bitcoin is a digital cryptocurrency coin launched in 2009 by a man named satoshi. I tell him Bitcoin has been around for 14 years. I give him more idea about Bitcoin. At one point he expressed his interest in investing in bitcoin, I told him that there is a possibility of not only profit but also loss from investment.To invest you have to take risk. My friend invests in bitcoin knowing profit loss. He works for a salary of about $400 per month. He invested about $500 in Bitcoins. I didn't show my friend interest in investing in bitcoin. He himself knowingly invested in bitcoin.  Did I give my friend the right advice? First I really appreciate you trying to make him invest and letting him know about bitcoin,for him to per-take in the moving train. But the wrong side about it is that you didn't explain to him broad about bitcoin and how it works.The fact there is that it shouldn't come to his lost days and come saying bitcoin is a scam,for because the bitcoin I know is never a scam it just what you have to learn and get more knowledge about. My advise now to you is for you to call your friend and explain to him perfectly well on how bitcoin works and how he made his Invertement in it, then if you don't have much knowledge you can advise him to do some research to know more. But I most confess you did well by telling him about bitcoin 👍",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Obari",
      "created_time": "May 11, 2023, 07:56:52 PM",
      "body": "Well I wouldn't have to condem your story but I will say that your stories don't look rely impressive  to me though you're not here to impress  or please anyone but I'm just saying that your story don'took very real to me and please pardon me if that got so hard on you 😌 I just had to say it.I also want to know how much knowledge  you have of bitcoin  and you shouldn't  have allowed your friend rush into investing simply because he has some money to invest at the moment  and if there was any need for investment now, then it should be investing in the knowledge  of bitcoin  rather than buying the bitcoin  now. Whatever they are might be, since nothing is certain in bitcoin  and  many people already believe  that we should be expecting  a bull run most especially  after this attack on mempool so we hope his investment yields profit for him and not lead to regrets.I think you should minimize  your effort of spreading  the news of what you're still trying to figure out so as not to get into any troubles if things suddenly goes sour.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hyphen(-)",
      "created_time": "May 11, 2023, 08:00:20 PM",
      "body": "Quote from: Bd officer on May 11, 2023, 04:06:56 PMDid I give my friend the right advice? Yes, but before investing in Bitcoin, you could have told him to do more research about Bitcoin by referring him to some books to read and gain more knowledge about Bitcoin.Most importantly, he needs a solid background and understanding of keys and addresses because this is the first step before investing in order to avoid losing the entire Bitcoin he purchased.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}