{
  "id": "topic_5400319",
  "title": "MARK21",
  "author": "MARK21",
  "created_time": "May 26, 2022, 07:05:05 PM",
  "content": "Me he encontrado esta noticia desafortunada para los amigos que usan el ETH, donde: QuoteLas preocupaciones macroeconómicas que se avecinan y el vencimiento de USD 1,000 millones en opciones de ETH esta semana amenazan con mantener el precio de Ethereum por debajo del soporte de USD 1,800.Se ha demostrado que el rendimiento del ETH en los últimos 3 meses no ha sido prometedor, se puede observar en el siguiente grafico:Gráfico de velas de 1 día del par Ether/USD (Kraken).QuoteLos alcistas colocaron sus apuestas en USD 2,100 y másLa caída por debajo de los USD 1,800 tomo por sorpresa a los alcistas porque prácticamente ninguna de las opciones de compra para el 27 de mayo se ha colocado por debajo de ese nivel de precios. Se puede demostrar en la siguiente grafica: Interés abierto total en las opciones de Ether para el 27 de mayo.Noticia de: https://es.cointelegraph.com/news/ethereum-price-dips-below-the-1-8k-support-as-bears-prepare-for-friday-s-1b-options-expiry",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5400319",
  "comments": [
    {
      "author": "famososMuertos",
      "created_time": "May 27, 2022, 07:15:39 PMLast edit: May 29, 2022, 06:48:37 PM by famososMuertos",
      "body": "Creo que una caída de precio y su posterior recuperación (solo ocurre en el mercado cripto    ) siempre es una buena prueba para ciertas monedas, bitcoin ha resistido caídas de hasta +60% y no solo se mantiene si no que los inversionistas han creído en la referencia de su valor y sus posteriores recuperaciones han superado los precios anteriores (ATH) en digamos un periodo corto si analizamos que los volúmenes de mercado en tales casos han sido de miles de millones en perdidas, sorprendente.Muchas criptos \"sobreviven\" sus debacles pero se quedan estancadas en el llamado modo Zombie, en mi particular opinión ETH no ha sido desbancada del primer lugar[1] por la misma realidad del mercado cripto, hay mucha basura cripto, ojo no es que ETH tenga mi apreciación de mal proyecto, pero si que en si mismo ayudado bastante(a crear basura), de hecho como lo dije hace tiempo a pesar de tener (problemas) unos fees altos sus usuarios se mantienen ahí y lejos de ir en decadencia de uso han incrementado su precio.Este no es un monto rojo extraño para ETH, pero si que es una gran prueba dada la situación en el cambio reciente, al menos referido al gas.Edit:[1]En lo referido a que es la reina de las Alts.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "danadc",
      "created_time": "May 28, 2022, 06:35:14 AM",
      "body": "Cuando el BTC cayó bastante de precio el ETH también lo hizo y muy fuerte,es normal que ETH caiga si BTC va hacia abajo,los problemas en esta criptomoneda aumenta progresivamente,ya se habla que los mineros busquen otra moneda o vendan:Quote    Ethereum estuvo en planes de sustituir PoW por PoS en su protocolo desde sus inicios.    Ethereum Classic no está entre las criptomonedas más rentables para minar al día de hoy.y el origen de todo es:QuoteA pesar de todos los retrasos que ha sufrido la llegada de la nueva versión de Ethereum con prueba de participación, no cabe duda que está cada vez más cerca de lograr esa meta. Además, no hay indicios en su directiva de querer cambiar de planes; por lo que, sea para el 2023 o para más adelante, los mineros de ETH deben ir preparando el nuevo camino que han de tomar minando otra criptomoneda o dedicándose a otra actividad.Fuente: https://www.criptonoticias.com/mineria/ethereum-arrincona-mineros-migrar-otra-moneda-vender-despedirse/El artículo da nombres de otras opciones para los mineros de EHT,pero si ya están pensando en estas <pérdidas> para esta moneda,los mineros donde van a parar si ETH es una de las mejores monedas para minar,yo misma estaba pensando en  minar ETH,con todo esto se me están quitando las ganas.La volatilidad se está llevando a muchas monedas,ya LUNA murió porque no confiaría en  una mejora a esa moneda o token,ahora lo de ETH.Cada vez se convencerán que BTC es la inversion segura.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Don Pedro Dinero",
      "created_time": "May 28, 2022, 02:58:02 PM",
      "body": "Quote from: danadc on May 28, 2022, 06:35:14 AMCuando el BTC cayó bastante de precio el ETH también lo hizo y muy fuerte,es normal que ETH caiga si BTC va hacia abajo,los problemas en esta criptomoneda aumenta progresivamente,ya se habla que los mineros busquen otra moneda o vendan:Si no recuerdo mal, ETH es la única altcoin que se mantine entre las 10 primeras en coinmarketcap desde 2017, que fue cuando empecé a enterarme e investigar sobre el bitcoin y las criptomonedas. Parece fuerte y con muchos proyectos ligados a ella, pero no sería de extrañar que en un par de años esté fuera del top 10, y a mí no me sabría mal. Recuerdo que en 2017 el bitcoin bajó mucho en dominancia en el market cap y ETH fue de las alts la que más le comía el terreno, con lo que se llegó a especular con lo que se llamó el \"flippening\". También hubieron un par de hard forks que en aquella época dudabas de si se mantendrían fuertes o le podrían plantar cara al bitcoin.Todo este rollo lo estoy soltando para decir que, al final, la única moneda que se ha mantenido ahí arriba es el bitcoin. Los hard forks se fueron a la mierda, no hubo flippening y creo que la market cap hoy en día no es tan importante, y la única moneda que en realidad es descentralizada, autónoma y con un límite total a su producció es el bitcoin. Por eso es la mejor.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}