{
  "id": "topic_5473063",
  "title": "AbuBhakar",
  "author": "AbuBhakar",
  "created_time": "November 06, 2023, 12:32:41 PM",
  "content": "I play slot games but I always avoid high volatility slot games such as hacksaw and nolimit because this provider often gives more lose bets without hitting anything big even with bonus round. I’m not how did some players manage to become successful hitting huge multiplier from this provider.Are betting fixed amount of spin on each game then move on to the next slot game after the you reach your target spin count or you wait to hit something big before you switch games.In an event that you hit early huge multiplier, do you still play using same game or you immediately switch different game?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5473063",
  "comments": [
    {
      "author": "Oshosondy",
      "created_time": "November 06, 2023, 12:37:02 PM",
      "body": "Not all the games in casinos are for everyone to play. Do not understand me wrong, I just mean you should just choose the ones that you think that is best for you. As for me, I prefer to go for games that I believe will give me higher return with higher chances of winning. But it is casino, know that no games is not also risky, but if I see the risk not to go with the odd, I stop playing such game.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Beparanf",
      "created_time": "November 06, 2023, 12:45:20 PM",
      "body": "Quote from: Oshosondy on November 06, 2023, 12:37:02 PMNot all the games in casinos are for everyone to play. Do not understand me wrong, I just mean you should just choose the ones that you think that is best for you. As for me, I prefer to go for games that I believe will give me higher return with higher chances of winning. But it is casino, know that no games is not also risky, but if I see the risk not to go with the odd, I stop playing such game.Very true. High volatility games are for those player that can endure initial losses until they hit the high multiplier to have a profit and recover part of their losses.I’m not a hardcore slot player so I usually skip this kind of game and play only the games I’m comfortable with. Aiming higher multiplier means you are risking a lot since the percentage on hitting is very low. It’s high risk high reward game.Quote from: AbuBhakar on November 06, 2023, 12:32:41 PMIn an event that you hit early huge multiplier, do you still play using same game or you immediately switch different game?I’m not sure if switching games will matter since the slot games result is always random. You can hit multiple big multiplier with short gap though. I believe it depends if you still enjoy playing that game or not before you switch.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Latviand",
      "created_time": "November 06, 2023, 12:50:33 PM",
      "body": "Quote from: AbuBhakar on November 06, 2023, 12:32:41 PMI play slot games but I always avoid high volatility slot games such as hacksaw and nolimit because this provider often gives more lose bets without hitting anything big even with bonus round. I’m not how did some players manage to become successful hitting huge multiplier from this provider.Are betting fixed amount of spin on each game then move on to the next slot game after the you reach your target spin count or you wait to hit something big before you switch games.In an event that you hit early huge multiplier, do you still play using same game or you immediately switch different game?What does moving to another slots game do though? Will that make any difference? Because if I recall, slots are pretty random and they don't have any set number of spin before any wins so I don't think that your ritual is really doing you any favors. Aren't most slots regardless of the volatility still the same to the core? So I'm stumped why would someone change to a different game if it's essentially the same game as any other slots?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tusandii",
      "created_time": "November 06, 2023, 01:10:25 PM",
      "body": "I am not an active slot gambler since I often lose in slot games, I decided to leave this game and switch to sports betting, but from my experience there is no strategy for playing high volatility slots, all I know is just enter a game that makes me comfortable after doing a few spins. If I feel that several spins don't have a good enough return and my balance drains more quickly, I will move to another game that has a smaller minimum bet amount to enjoy every spin I make.I do this because of my awareness that slot games are random and cannot be predicted and if I feel uncomfortable I move to another game, not just to chase multipliers, but to still be able to enjoy betting with the budget I have, at least I can play for 1 hour even if I lose. that's my goal to try my luck so there is no goal whatsoever.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "danherbias07",
      "created_time": "November 06, 2023, 01:13:14 PM",
      "body": "Usually, I wait for something big to happen. My reason, I don't want to cut the chance of getting it in the next bet. That what-ifs of a gambler. What if in your next 10 bets, it will come out? I think many gamblers have that kind of attitude and that is why we either lose more or we win big despite the lower chance. When I hit a big multi in my past betting experiences I always continue to bet until the winning amount is halved. Now, I am trying a different strategy which is escaping the game and jumping to another. It doesn't work either. 2 days ago I hit x584 and then I changed the game but sadly all of those profits are gone and it didn't even take a day for me to deplete it all. I don't think we can escape that reality. They will take it back no matter what and worse, they will take more from your starting capital until you are zeroed.The best thing to do is escape the gambling site and then return after 2 days or more. Maybe that way the system will reset and you will start fresh. I also tried changing seeds, but it doesn't work either.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "freedomgo",
      "created_time": "November 06, 2023, 01:15:29 PM",
      "body": "In this type of game, we need to adopt a short-term strategy to increase our chances of winning. With the house edge, the longer we play, the greater the likelihood of losing. So, if we're fortunate, we should be more aggressive with our betting but also maintain the discipline to stop when necessary. This game primarily relies on luck; we don't employ skills but rather exercise discipline in betting, knowing when to stop when we're already in a profitable position.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "_act_",
      "created_time": "November 06, 2023, 01:18:28 PM",
      "body": "Quote from: tusandii on November 06, 2023, 01:10:25 PMI am not an active slot gambler since I often lose in slot games, I decided to leave this game and switch to sports betting, but from my experience there is no strategy for playing high volatility slots, all I know is just enter a game that makes me comfortable after doing a few spins. If I feel that several spins don't have a good enough return and my balance drains more quickly, I will move to another game that has a smaller minimum bet amount to enjoy every spin I make.Have you not tried other games in the casino? Try blackjack, roulettes and baccarat and you will like it. There are high chance of losing matches in sport betting too, examples are the horse and dog racing. In sport betting like football, it is risky too. The sport I like most in sport gambling is table tennis, the chance to win is higher.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Natsuu",
      "created_time": "November 06, 2023, 01:31:44 PM",
      "body": "Well whether to continue playing the same game or switch to a different one after hitting an early huge multiplier depends on your risk tolerance I think. Staying with the same game might offer you the chance to capitalize on your luck and potentially win even more but switching to a different game could diversify your gameplay and reduce the risk of losing everything in case your luck changes. I prefer the latter. Id rather try to play on everything. It ultimately boils down to your personal choice and comfort level with risk.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "junder",
      "created_time": "November 06, 2023, 01:51:17 PM",
      "body": "Quote from: Natsuu on November 06, 2023, 01:31:44 PMWell whether to continue playing the same game or switch to a different one after hitting an early huge multiplier depends on your risk tolerance I think. Staying with the same game might offer you the chance to capitalize on your luck and potentially win even more but switching to a different game could diversify your gameplay and reduce the risk of losing everything in case your luck changes. I prefer the latter. Id rather try to play on everything. It ultimately boils down to your personal choice and comfort level with risk. Well that's right, it's best that we should immediately leave and move to another place if you have a big enough win, not only that because of course we also have to switch to find another place or game if the round is going very badly, it will be useful to further minimize your risk. But basically it also depends on the decision of each gambler, if indeed they care about their betting money then I think there is nothing wrong with doing some actions that will be very useful to minimize your risk. Staying in the same game because the spin is pretty good is indeed a good choice but in my opinion we have to be really careful because it is very possible that without realizing the spin turns very bad and you don't realize it. Honestly, I have experienced such conditions, because the initial round was very good and I continued to play and force it even though the round had turned bad but with a sense of not accepting that my balance was reduced, I continued to play and yes, maybe you already know that finally my winnings were depleted just because I stayed in one game.So if the potential and opportunities seem to have been lost then it's better to just move on, find another game that you think is good. Honestly lately I also prefer to divide my betting money on many games, it can increase your chances.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AbuBhakar",
      "created_time": "November 06, 2023, 02:23:24 PM",
      "body": "Quote from: Latviand on November 06, 2023, 12:50:33 PMQuote from: AbuBhakar on November 06, 2023, 12:32:41 PM-What does moving to another slots game do though? Will that make any difference? Because if I recall, slots are pretty random and they don't have any set number of spin before any wins so I don't think that your ritual is really doing you any favors. Aren't most slots regardless of the volatility still the same to the core? So I'm stumped why would someone change to a different game if it's essentially the same game as any other slots?I honestly don’t have any idea that’s why I’m asking.   I always notice this strategy on streamers that playing slot games which they frequently change slot games after playing a couple of bonus buy in random basis. I didn’t get what’s the reason behind since streamers doesn’t explain well how they game play strategy work.I post this inquiry here to get some information and explanations on this kind of slot strategy. I just want to have a basic knowledge on strategy so that I will be comfortable using it unlike using it blindly.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mauser",
      "created_time": "November 06, 2023, 02:55:11 PM",
      "body": "Quote from: AbuBhakar on November 06, 2023, 12:32:41 PMAre betting fixed amount of spin on each game then move on to the next slot game after the you reach your target spin count or you wait to hit something big before you switch games.In an event that you hit early huge multiplier, do you still play using same game or you immediately switch different game?I always just bet a fixed amount when it comes to slots, because I have a certain limit in mind and don't want to risk going over it. This means that I only have a limited amount of spins per evening before I stop. To increase my playtime I try to focus on games that grant free spins. My goal is to hit a big jackpot and for that I feel I need to play as many rounds as possible. In other casino games I usually follow the martingale approach, increasing my bet size with every loss. Let's say I get lucky early on and win a lot of free spins, then I would probably switch slot games after all the free spins. Mathematically the winning chances are likely always the same, but I feel like I used my luck for the one game and would probably not repeat the same win again during the evening.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "topbitcoin",
      "created_time": "November 06, 2023, 05:14:51 PM",
      "body": "Slots provide various types of games and everyone has their own favorite types of games. I personally rarely change games and I prefer to play from start to finish with the same type of game, regardless of winning and losing because this has become part of a gambling game. However, on several occasions I have also changed the game, because I thought that the previous game was very monotonous and there was no change at all, so the sensation of playing the game decreased. And if in that game I get a big enough win, then I prefer to immediately withdraw from the ongoing game round. compared to having to go back to playing slots with a different type of game. Because if we continue the game, it will only show an endless slot game with the same cycle.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitcoinPanther",
      "created_time": "November 06, 2023, 05:37:35 PM",
      "body": "Quote from: AbuBhakar on November 06, 2023, 12:32:41 PMI play slot games but I always avoid high volatility slot games such as hacksaw and nolimit because this provider often gives more lose bets without hitting anything big even with bonus round. I’m not how did some players manage to become successful hitting huge multiplier from this provider.I also avoid high to extreme volatility slots game. I prefer a medium one where a small win frequently appears.  The frequent small wins will ensure that we can last longer in the gameplay.QuoteAre betting fixed amount of spin on each game then move on to the next slot game after the you reach your target spin count or you wait to hit something big before you switch games.I set a fixed number of spin, win or lose, I move to another slots.  This way I can avoid in getting hooked on a single slot game.QuoteIn an event that you hit early huge multiplier, do you still play using same game or you immediately switch different game?I withdraw the initial bankroll plus the percentage of the winnings, depending on how huge or small is the amount.  I leave some fund to the bankroll to continue the fun until it gets depleted.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "iv4n",
      "created_time": "November 06, 2023, 07:14:35 PM",
      "body": "There's no strategy for high volatility slots... we either get lucky or not. We can discuss whether is it better to play normal spins or to buy a bonus right away, but from my experience, we can't make any real conclusions... it's on us to try it and we will see how lucky we are. High volatility slots are crazy and colorful, it's easy to get addicted to slots where every spin can give some crazy high multiplier... but the downside is that we can experience crazy long-losing streaks as well! Bonus rounds that pay nothing... As always, we should gamble only with the money we can afford to lose! And with slots, it should have even more meaning... Slots can give, but they can take a lot more!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Juse14",
      "created_time": "November 06, 2023, 08:01:25 PM",
      "body": "I'm not interested enough to play gambling slot, so I don't have any special tricks or strategies to win this type of gambling. However, I know and understand that most of the revenue of a casino is from slot games and slot games have contributed almost seventy percent more than the total revenue of a casino. And from here we can imagine that how many people have lost in this type of gambling game, while those who get lucky and win a sum of money in this type of gambling are only a handful of people. Because the more people who lose in gambling, the greater the profit a casino will get.So I consider that there is no point in making or learning a special strategy to be able to win gambling that only depends on luck, luck for a small number of people who participate in the game.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Tuturtinular",
      "created_time": "November 06, 2023, 08:23:43 PM",
      "body": "Quote from: AbuBhakar on November 06, 2023, 12:32:41 PMIn an event that you hit early huge multiplier, do you still play using same game or you immediately switch different game?I also like playing slots. One of the slot games that I always avoid is no limit, playing at this provider we have to be mentally and financially ready, because every time we play we are guaranteed to lose. I don't dare play no limit anymore, it's too brutal for thin wallet players. I often play on PragmaticPlay, I don't know why but I think their game displays are good, although lately I'm quite bored with this provider. I play using feeling, so sometimes I will play the same slot for some time or sometimes I will change if I feel that my feeling is not good with that slot. I like playing on slot machines that have a buy-in feature, usually I will buy freespins up to 2 or 3 times, if the results are too bad then I will change to another slot machine",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "wiss19",
      "created_time": "November 08, 2023, 07:18:50 AM",
      "body": "Quote from: Juse14 on November 06, 2023, 08:01:25 PMI'm not interested enough to play gambling slot, so I don't have any special tricks or strategies to win this type of gambling. However, I know and understand that most of the revenue of a casino is from slot games and slot games have contributed almost seventy percent more than the total revenue of a casino. And from here we can imagine that how many people have lost in this type of gambling game, while those who get lucky and win a sum of money in this type of gambling are only a handful of people. Because the more people who lose in gambling, the greater the profit a casino will get.So I consider that there is no point in making or learning a special strategy to be able to win gambling that only depends on luck, luck for a small number of people who participate in the game.I was like that till few years back. No interest on this game but eventually I tried and start liking it. And like the OP I got curious if there are tricks on it despite knowing that it's a game of chance or luck. I found some in Youtube and also here in the forum, but I think there is no 100% proof that they work. I applied some of them and the results are still the same. Sometimes I win but most of the time lose.You are right about revenue if the casino has a slot game. That is because slots has the highest house edge. But it's only normal that more people lost in gambling than the winners because the game is set to favor in the owner. This is why it's not advisable to treat gambling as a source of income.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Crypt0Gore",
      "created_time": "November 08, 2023, 10:11:16 AM",
      "body": "Quote from: AbuBhakar on November 06, 2023, 12:32:41 PMI play slot games but I always avoid high volatility slot games such as hacksaw and nolimit because this provider often gives more lose bets without hitting anything big even with bonus round. I’m not how did some players manage to become successful hitting huge multiplier from this provider.Are betting fixed amount of spin on each game then move on to the next slot game after the you reach your target spin count or you wait to hit something big before you switch games.In an event that you hit early huge multiplier, do you still play using same game or you immediately switch different game?How much are you risking on every rounds? I don't bother losing all my money on Slots in a day, I have constantly lose money like you and one day I won good amount, that's the trick, you don't have to give up and if you are feeling like giving up check the amount you are risking, it is more than you can afford to lose, so lower the amount.After I reach my target spin I quit for that day, I don't have to win on that day, and I don't put my mind on winning, because that's the way casino is programmed, like I've said, if you are feeling like you aren't getting anywhere with gambling, you have less understanding about gambling it is and also you are risking more than you can afford to lose.If you win you aren't suppose to keep playing, it doesn't cost a thing to get brainwashed at that moment, thinking you will win the next round again and if you lose guide you can even risk all the amount on playing again and that's how you will lose everything again. My gambling rules is simple, take your win out and quiet gambling, it's not the end it's just the beginning, but luck works like a karma sometimes,  you have won but you aren't satisfied, it's greed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "swogerino",
      "created_time": "November 08, 2023, 10:16:42 AM",
      "body": "Quote from: AbuBhakar on November 06, 2023, 12:32:41 PMI play slot games but I always avoid high volatility slot games such as hacksaw and nolimit because this provider often gives more lose bets without hitting anything big even with bonus round. I’m not how did some players manage to become successful hitting huge multiplier from this provider.Are betting fixed amount of spin on each game then move on to the next slot game after the you reach your target spin count or you wait to hit something big before you switch games.In an event that you hit early huge multiplier, do you still play using same game or you immediately switch different game?I am stuck playing another provider Pragmatic Play and the so called Enhanced RTP which have nothing of enhanced,playing Sweet Fiesta,analog of Sweet Bonanza but supposedly with better RTP and is a game with a really high volatility and I keep losing in consecutive sessions.So those guys either they have a preset spin amount and they keep buying the bonus with that amount together with playing a really long time otherwise you don't get the max win.When you switch games I have had the same results as playing just one slot.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}