{
  "id": "topic_5446937",
  "title": "alastantiger",
  "author": "alastantiger",
  "created_time": "March 30, 2023, 07:19:24 PM",
  "content": "Neymar lost €1m (£900,000) in just an hour of online casino as he streamed it live on his Twitch channel. The Twitter post reads that \"Crying at first, he then laughs, remembering it's just a week's pay!\" I was very livid reading this and seeing screenshots of his reaction. Because it is very deceitful. Imagine a gambling who may have lost thousands of dollars today reading this. Instead of feeling bad or remorseful and looking for a way to change, this may even fuel his addiction the more. Sadly, he won't remember that he is not like Neymar who earns £3.2m-per-month. These celebrities and public figures should be  fined for trying to glorify gambling without stating the negative aspects when it is over done. Story Source+ https://twitter.com/PartnersLoro/status/1641169797319733250?s=20+ https://www.dailymail.co.uk/sport/football/article-11919169/Neymar-hilariously-reacts-losing-900-000-hour-online-casino-session.html",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5446937",
  "comments": [
    {
      "author": "Kemarit",
      "created_time": "March 30, 2023, 07:34:21 PM",
      "body": "Quote from: alastantiger on March 30, 2023, 07:19:24 PMNeymar lost €1m (£900,000) in just an hour of online casino as he streamed it live on his Twitch channel. The Twitter post reads that \"Crying at first, he then laughs, remembering it's just a week's pay!\" I was very livid reading this and seeing screenshots of his reaction. Because it is very deceitful. For athletes like him who earn a lot of money, yeah, this is just a lunch money for them and with that kind of emotions and reaction, it seems that he just enjoyed the game.Quote from: alastantiger on March 30, 2023, 07:19:24 PMImagine a gambling who may have lost thousands of dollars today reading this. Instead of feeling bad or remorseful and looking for a way to change, this may even fuel his addiction the more. Sadly, he won't remember that he is not like Neymar who earns £3.2m-per-month. I don't think gamblers should compare themselves with sports personalities or anyone that has a lot of money to begin it. That is the wrong aspect for someone, why fuel gambling addiction is very different from each one of us.Quote from: alastantiger on March 30, 2023, 07:19:24 PMThese celebrities and public figures should be  fined for trying to glorify gambling without stating the negative aspects when it is over done. Again just like you and me who has money to burn in gambling, it's the people who've seen them is the problem and not this public figures. Everyone knows the negative aspects of gambling, they don't need to tell that to the public.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coolcoinz",
      "created_time": "March 30, 2023, 07:54:28 PM",
      "body": "I don't like people who throw money away like that and laugh at it. Imagine that he's Brazilian and the minimum wage in his country is some $200 a month. Some people are earning that and watching him laugh after losing a million, money they will never have in their lives. These rich guys are so spoiled it's painful to watch. Completely no respect for money. They're wiping their asses with $ bills and laughing at the rest of us. I'm not saying they don't have the right to do it, or shouldn't have the money they have, but I find the lack of respect and his attitude repulsive.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blockman",
      "created_time": "March 30, 2023, 08:01:42 PM",
      "body": "He's able and that's why he just laughed at it. But honestly, that's a lot of money to waste, yeah, it might just his one week salary but we know that everyone in here won't be wasting that much even if you're a bitcoin millionaire or a billionaire and you're able, I am sure that there will be some regret and remorse with that type of loss. Anyway, these celebrities and athletes will just keep on losing millions if they're just easy money because they know that they'll earn that money so fast and that's why even if they lose millions a week or a month or even a day, they won't be feeling bad about it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitbollo",
      "created_time": "March 30, 2023, 08:04:54 PM",
      "body": "I read an article that referred to some sort of prank made by the player and not such a leak. yes it is certainly not a life changing amount for him, but considering how much expenses one has when leading this lifestyle I think this is not a small loss in any case",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oshosondy",
      "created_time": "March 30, 2023, 08:07:17 PM",
      "body": "Quote from: blockman on March 30, 2023, 08:01:42 PMHe's able and that's why he just laughed at it. But honestly, that's a lot of money to waste, yeah, it might just his one week salary but we know that everyone in here won't be wasting that much even if you're a bitcoin millionaire or a billionaire and you're able, I am sure that there will be some regret and remorse with that type of loss.According to what I saw on Twitter, it is just one week of his salary, which means he is able to make even more. If this kind of loss is just infrequent, that should not be a big deal, but if he continues to lose more and more in short period of time, that would be a problem. If you see his reaction, he did not feel so good about it, that is gambling and life continues.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dimonstration",
      "created_time": "March 30, 2023, 08:10:11 PM",
      "body": "I believe his twitch earnings and a potential partnership from the casino will not gonna leave him empty handed. Drake losses more than that on his stream as if the money is just a paper. This people doesn’t value much money they are losing which is why watching them lose doesn’t gave me any sympathy because they are doing that kind of staged play for views and other person interest.There’s a big chance that he might be endorsing the casino as a partner.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rdluffy",
      "created_time": "March 30, 2023, 08:21:40 PM",
      "body": "I saw this news today and went to find out if it was true or not, after all it is a bit strange that he would bet and lose 1 million that easy.I know Neymar likes to play poker, and he probably plays with high values, but in this case it wasn't making much sense.I found a source, but it is in Portuguese, that says that everything was just a marketing move, and the value probably wasn't Neymar's, so there was no investment on his part and no loss of money.Source here: https://ge.globo.com/blogs/brasil-mundial-fc/post/2023/03/29/neymar-chora-ao-perder-1-milhao-de-euros-em-poquer-assista.ghtmlThe funny thing in the end is that the marketing works, after all there are a lot of people commenting on this news today, and even here we are talking about hehehe.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "madnessteat",
      "created_time": "March 30, 2023, 08:28:29 PM",
      "body": "Quote from: alastantiger on March 30, 2023, 07:19:24 PM~snip~It seems to me that Neymar with his action once again reminded us all how you can lose money very quickly in gambling. I also don't really like that celebrities show their followers gambling, but only because it can be seen by underage children. Although on the other hand it's their personal choice and we can't influence this situation in any way.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ShowOff",
      "created_time": "March 30, 2023, 08:34:31 PM",
      "body": "For Neymar it's not a big deal, but it could fuel more of a desire to fight the system in order for him to succeed in winning back his lost money. I don't know what game he played that cost him $1M in an hour, obviously that's bad even though he has another suitcase in the safe.This is a ridiculous story about Neymar, I don't think he is a smart gambler but just looks like he wants to have fun.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kawetsriyanto",
      "created_time": "March 30, 2023, 08:48:16 PM",
      "body": "Quote from: Kemarit on March 30, 2023, 07:34:21 PMFor athletes like him who earn a lot of money, yeah, this is just a lunch money for them and with that kind of emotions and reaction, it seems that he just enjoyed the game.Sure, it is not really big money for Neymar, so it won't be a serious problem for him. But his strange reaction implies he is unsatisfied with the result. Most people only enjoy the game when they won or experience an interesting game. However, it is a bit difficult to feel happy if they lose a big amount of money. Well, £900k or €1M isn't a big amount for Neymar but it is still a big money for sure.Quote from: ShowOff on March 30, 2023, 08:34:31 PMI don't know what game he played that cost him $1M in an hour, obviously that's bad even though he has another suitcase in the safe.According to the source, it may be Poker.He loves Poker. But in the article, we can't see a detailed explanation about the game which make him lose $1M.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blockman",
      "created_time": "March 30, 2023, 08:55:05 PM",
      "body": "Quote from: Oshosondy on March 30, 2023, 08:07:17 PMQuote from: blockman on March 30, 2023, 08:01:42 PMHe's able and that's why he just laughed at it. But honestly, that's a lot of money to waste, yeah, it might just his one week salary but we know that everyone in here won't be wasting that much even if you're a bitcoin millionaire or a billionaire and you're able, I am sure that there will be some regret and remorse with that type of loss.According to what I saw on Twitter, it is just one week of his salary, which means he is able to make even more. If this kind of loss is just infrequent, that should not be a big deal, but if he continues to lose more and more in short period of time, that would be a problem. If you see his reaction, he did not feel so good about it, that is gambling and life continues.Yes, it's also indicated in the OP and it's why the recovery from that loss will just be easy on him. Well, that's his reaction and if this continues, we all know where it is heading.It's a bunch of money and even if you're earning well and a superstar, still it's a big loss and no one will ever feel good about it.  But yeah, if he can have it back within a week as his salary, still it cannot change the fact that he lost that amount in an hour.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rhomelmabini",
      "created_time": "March 30, 2023, 08:58:57 PM",
      "body": "Quote from: alastantiger on March 30, 2023, 07:19:24 PMNeymar lost €1m (£900,000) in just an hour of online casino as he streamed it live on his Twitch channel. The Twitter post reads that \"Crying at first, he then laughs, remembering it's just a week's pay!\" I was very livid reading this and seeing screenshots of his reaction. Because it is very deceitful. I wish he learns a thing or two from Ronaldinho that with lavish lifestyle and partying had led to somehow end his career and now Neymar is getting into gambling addiction. Addiction is not something you can tell at the very first but it goes through steps and it's just a matter of time before you get hung up on that. Hate to say it but Mane is the best player out there that instead of spending his salary onto things that won't matter, he donates it to those who needs it. Yeah, it's not our money in the first place, I'm just stating an opinion.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Joca97",
      "created_time": "March 30, 2023, 09:07:08 PM",
      "body": "Neymar dosent care about the one miliom,he earns so much that he can waste every month one million and still make a ton more from the club and from sponsoring deals. But still he is a heavy gambler when it comes to poker but didnt expect him to bet such a huge amount.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Doell",
      "created_time": "March 30, 2023, 09:08:20 PM",
      "body": "Someone above has already found out all the facts about this news because it is a form of marketing, but I think if it was Neymar money he wouldn't be too sad either. Why Neymar laughed, at there was a joke that made him laugh on his live stream. As a gambler, I'm also sad when I lose with money which I think is quite big, but then I laugh at what I do and I think that's normal because we seek pleasure in gambling.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "execijutiere",
      "created_time": "March 30, 2023, 09:14:12 PM",
      "body": "Footballers like Neymar don't cry for this money. Such footballers are already earning good money in the teams they play for, they have received good money from sponsorship deals and other deals they have made so far. This loss of money has been an experience for him, but I don't know if it will continue. Maybe he will not want to take such a risk again. For someone who earns about 3.5 million dollars a month, we can say that losing 1 million dollars in an hour is not a big deal. For those who bet in this style, it will be moral for some and sad for others.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "virasisog",
      "created_time": "March 30, 2023, 09:25:59 PM",
      "body": "I think he's just trying to cover up his emotions after losing such a big amount. It's too disappointing and upsetting for him but he has to look strong since he is streaming. He will them realize and regret things later on. Losing such an amount in just an hour is an indication that he's a compulsive gambler. I don't think he would take that case as a lesson since he's an irresponsible gambler. There's a possibility that the same thing could happen to him in the future.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nara1892",
      "created_time": "March 30, 2023, 09:28:24 PM",
      "body": "that kind of money is spent so quickly it's crazy but indeed on the other hand this is Neymar who does lose money for a week like this it won't have much impact on his life and we don't need to force to be compared to billionaires like him in gambling because this is the comparison very far. we also don't need to feel this is an act that reflects arrogance by saying this is unfair to other people because of him just because he is a public figure. it is his money and he is free to do whatever with the money he has.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "crzy",
      "created_time": "March 30, 2023, 09:29:24 PM",
      "body": "We actually don’t know if its a paid advertisement, since losing that much is very unusual especially if we know that he is not into gambling but upon reading this, he looks more addicted to gambling after losing that much. He earns a lot of money but if he will be more careless like this, he might experience bankruptcy. Though, the post is not to encourage everyone to gambling, his influence can still affect many people especially the young ones, he should be more careful on posting like this next time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TimeTeller",
      "created_time": "March 30, 2023, 09:33:27 PM",
      "body": "Quote from: crzy on March 30, 2023, 09:29:24 PMWe actually don’t know if its a paid advertisement, since losing that much is very unusual especially if we know that he is not into gambling but upon reading this, he looks more addicted to gambling after losing that much. He earns a lot of money but if he will be more careless like this, he might experience bankruptcy. Though, the post is not to encourage everyone to gambling, his influence can still affect many people especially the young ones, he should be more careful on posting like this next time. We don't know if that live stream was indeed a paid advertisement.But in any case, this may give a different approach to some people.Neymar is earning a lot of money, but people should not imitate his reaction as he can very well afford such loss even if it is his own money.And yes, if he will continue to be in gambling, he may likely lose a lot, even his retirement funds as he is going big in casinos.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}