{
  "id": "topic_5449044",
  "title": "jbgsmininggmbh",
  "author": "jbgsmininggmbh",
  "created_time": "April 16, 2023, 02:34:59 PM",
  "content": "In this day and age, more and more people are looking for ways to generate passive income. One of the most promising methods is Bitcoin mining. In this blog post, we would like to present a concrete example and analyse the potential profitability of such an investment.First of all, what is Bitcoin mining? Mining is the process of generating new Bitcoins and confirming transactions on the Bitcoin network. Miners provide their computing power to solve complex mathematical problems and are rewarded with new Bitcoins and transaction fees.Now for an example: Let's say you invest $51,480 in 20 WhatsMiner M50s, each with a price of $2,574 (price as of 16.04.2023, current prices can be requested via our contact form: https://www.jbgsmining.com/en/kontakt). According to the scenario, these miners would generate a monthly profit of $4,715.09 when operated in a hosting facility with an electricity price of 4.4 cents per kilowatt hour.(source: https://www.nicehash.com/profitability-calculator/microbt-whatsminer-m50)To calculate the return on investment (ROI), we divide the monthly profit by the total investment amount and multiply the result by 100 to get a percentage:ROI = ($4,715.09 / $51,480) * 100 = 9.16%.This means that with this example, you would earn back about 9.16% of your investment within one month. If profitability remained the same, it would take about 10.9 months to recoup the entire investment amount. It is important to note that this is only an estimate and the actual results may vary depending on various factors such as fluctuations in the bitcoin price or mining difficulty.   A crucial factor in the profitability of Bitcoin mining is the price of electricity. The cheaper the electricity, the higher the potential return. Therefore, it is advisable to look for hosting facilities that offer cheap electricity prices. (cheap locations can be found here: https://www.jbgsmining.com/en/hosting-locations)In conclusion, Bitcoin mining is an interesting way to earn passive income. With the right equipment and a favourable electricity price, it may be possible to earn attractive returns. However, it is important to be aware of the risks and possible fluctuations and to weigh the investment carefully before jumping into the Bitcoin mining adventure.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5449044",
  "comments": [
    {
      "author": "stompix",
      "created_time": "April 16, 2023, 02:54:48 PM",
      "body": "Quote from: jbgsmininggmbh on April 16, 2023, 02:34:59 PM However, it is important to be aware of the risks and possible fluctuations and to weigh the investment carefully before jumping into the Bitcoin mining adventure.There are far more risks involved in such a \"hassle-free passive profits' scheme\"For example the risks here:The risk of NOT actually owning your mining hardware.and many more- the company you would buy the gear for might be a scam and not actually buy it and run with the money- the company claiming colocation might not pay you one cent from the earnings- the company selling you this investment plan might simply overcharge you and change the ToS to make your own money because of costs- the company assets might get seized like in the scenario aboveAlso, it's highly possible that the company which claims to :QuoteJB GS Mining GmbH was founded in 2022 by Jonathan Buck and Gitte Schlappner. The two shared a passion for blockchain technology and saw the potential in bitcoin mining, hosting services, and financial and business consultingG.although the domain is 5 days old and might have cropped the datacenter's pictures fromhttps://www.bitkern.com/en/bitcoin-miningwhich sounds a bit scammy to me.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "philipma1957",
      "created_time": "April 16, 2023, 02:57:56 PM",
      "body": "Quote from: jbgsmininggmbh on April 16, 2023, 02:34:59 PMIn this day and age, more and more people are looking for ways to generate passive income. One of the most promising methods is Bitcoin mining. In this blog post, we would like to present a concrete example and analyse the potential profitability of such an investment.First of all, what is Bitcoin mining? Mining is the process of generating new Bitcoins and confirming transactions on the Bitcoin network. Miners provide their computing power to solve complex mathematical problems and are rewarded with new Bitcoins and transaction fees.Now for an example: Let's say you invest $51,480 in 20 WhatsMiner M50s, each with a price of $2,574 (price as of 16.04.2023, current prices can be requested via our contact form: https://www.jbgsmining.com/en/kontakt). According to the scenario, these miners would generate a monthly profit of $4,715.09 when operated in a hosting facility with an electricity price of 4.4 cents per kilowatt hour.(source: https://www.nicehash.com/profitability-calculator/microbt-whatsminer-m50)To calculate the return on investment (ROI), we divide the monthly profit by the total investment amount and multiply the result by 100 to get a percentage:ROI = ($4,715.09 / $51,480) * 100 = 9.16%.This means that with this example, you would earn back about 9.16% of your investment within one month. If profitability remained the same, it would take about 10.9 months to recoup the entire investment amount. It is important to note that this is only an estimate and the actual results may vary depending on various factors such as fluctuations in the bitcoin price or mining difficulty.   A crucial factor in the profitability of Bitcoin mining is the price of electricity. The cheaper the electricity, the higher the potential return. Therefore, it is advisable to look for hosting facilities that offer cheap electricity prices. (cheap locations can be found here: https://www.jbgsmining.com/en/hosting-locations)In conclusion, Bitcoin mining is an interesting way to earn passive income. With the right equipment and a favourable electricity price, it may be possible to earn attractive returns. However, it is important to be aware of the risks and possible fluctuations and to weigh the investment carefully before jumping into the Bitcoin mining adventure.Dude if you own the miners it is not passive income.Not my definition the governments. (USA) and many other governments define it as an active business.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptoHFs",
      "created_time": "April 16, 2023, 02:59:55 PMLast edit: April 16, 2023, 03:11:15 PM by CryptoHFs",
      "body": "Quote from: philipma1957 on April 16, 2023, 02:57:56 PMQuote from: jbgsmininggmbh on April 16, 2023, 02:34:59 PMIn this day and age, more and more people are looking for ways to generate passive income. One of the most promising methods is Bitcoin mining. In this blog post, we would like to present a concrete example and analyse the potential profitability of such an investment.First of all, what is Bitcoin mining? Mining is the process of generating new Bitcoins and confirming transactions on the Bitcoin network. Miners provide their computing power to solve complex mathematical problems and are rewarded with new Bitcoins and transaction fees.Now for an example: Let's say you invest $51,480 in 20 WhatsMiner M50s, each with a price of $2,574 (price as of 16.04.2023, current prices can be requested via our contact form: https://www.jbgsmining.com/en/kontakt). According to the scenario, these miners would generate a monthly profit of $4,715.09 when operated in a hosting facility with an electricity price of 4.4 cents per kilowatt hour.(source: https://www.nicehash.com/profitability-calculator/microbt-whatsminer-m50)To calculate the return on investment (ROI), we divide the monthly profit by the total investment amount and multiply the result by 100 to get a percentage:ROI = ($4,715.09 / $51,480) * 100 = 9.16%.This means that with this example, you would earn back about 9.16% of your investment within one month. If profitability remained the same, it would take about 10.9 months to recoup the entire investment amount. It is important to note that this is only an estimate and the actual results may vary depending on various factors such as fluctuations in the bitcoin price or mining difficulty.   A crucial factor in the profitability of Bitcoin mining is the price of electricity. The cheaper the electricity, the higher the potential return. Therefore, it is advisable to look for hosting facilities that offer cheap electricity prices. (cheap locations can be found here: https://www.jbgsmining.com/en/hosting-locations)In conclusion, Bitcoin mining is an interesting way to earn passive income. With the right equipment and a favourable electricity price, it may be possible to earn attractive returns. However, it is important to be aware of the risks and possible fluctuations and to weigh the investment carefully before jumping into the Bitcoin mining adventure.Dude if you own the miners it is not passive income.Not my definition the governments. (USA) and many other governments define it as an active business,his website is 5 days old https://bitcointalk.org/index.php?topic=5448711.msg62085436#msg62085436",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jbgsmininggmbh",
      "created_time": "April 16, 2023, 04:40:49 PM",
      "body": "\"Dude if you own the miners it is not passive income.Not my definition the governments. (USA) and many other governments define it as an active business.\"the definition according to google is: Passive income includes regular earnings from a source other than an employer or contractor. So thats definitely a source of passive income.\"although the domain is 5 days old and might have cropped the datacenter's pictures fromhttps://www.bitkern.com/en/bitcoin-miningwhich sounds a bit scammy to me.  Wink\"True our domain is 5 days old, but we are a legal business and have been registered in the german commercial register since 2022.Secondly, we are working together with bitkern so thats why we are using the same pictures.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptoHFs",
      "created_time": "April 16, 2023, 04:45:23 PM",
      "body": "Quote from: jbgsmininggmbh on April 16, 2023, 04:40:49 PM\"Dude if you own the miners it is not passive income.Secondly, we are working together with bitkern so thats why we are using the same pictures.in that case we can work with bitkern directly.. why bother working through you?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jbgsmininggmbh",
      "created_time": "April 16, 2023, 04:48:28 PM",
      "body": "\"There are far more risks involved in such a \"hassle-free passive profits' scheme\"For example the risks here:The risk of NOT actually owning your mining hardware.and many more- the company you would buy the gear for might be a scam and not actually buy it and run with the money- the company claiming colocation might not pay you one cent from the earnings- the company selling you this investment plan might simply overcharge you and change the ToS to make your own money because of costs- the company assets might get seized like in the scenario above\"That's right there are a lot of risks involved. But with a proper due dilligence all of those risked can be reduced.For example in our company we have no access to the earnings of the miners. Our customers set up a mining pool account and have full overview of their earnings and control of their bitcoin. Also, we make official legally binding contracts. Our customers buy their machines so they own them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jbgsmininggmbh",
      "created_time": "April 16, 2023, 04:55:01 PM",
      "body": "Quote from: CryptoHFs on April 16, 2023, 04:45:23 PMQuote from: jbgsmininggmbh on April 16, 2023, 04:40:49 PM\"Dude if you own the miners it is not passive income.Secondly, we are working together with bitkern so thats why we are using the same pictures.in that case we can work with bitkern directly.. why bother working through you?You could also work with bitkern directly. I would be happy for them if you would.You could also buy your shoes directly from nike and not from the shoe shop.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jbgsmininggmbh",
      "created_time": "April 17, 2023, 10:26:21 AM",
      "body": "Yes this is my company @etfbitcoin",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "April 17, 2023, 10:40:29 AM",
      "body": "Quote from: jbgsmininggmbh on April 16, 2023, 04:40:49 PMSecondly, we are working together with bitkern so thats why we are using the same pictures.So because I sell Nike shoes should I post on my website pictures of Nike's factories? Does it seem right?Quote from: jbgsmininggmbh on April 16, 2023, 04:40:49 PMAlso, we make official legally binding contracts. Our customers buy their machines so they own them.Legal binding contracts must (funny enough!) respect the law also, since you're a German company it does sound weird you're offering contracts for colocation in Russia, what guarantee would your customers have the same thing that happened to Compas Mining or SBI won't happen to you?Quote from: jbgsmininggmbh on April 16, 2023, 04:40:49 PMYou could also work with bitkern directly. I would be happy for them if you would.You could also buy your shoes directly from nike and not from the shoe shop.If that was a try at getting a sarcasm reply done right then you might need to know you CAN buy Nike shoes directly from them.Common, how about you come clean, you're just a reseller that negotiates with Bitkern and you make money out of the difference, you don't own a data center, you don't own a farm, you have nothing but business relations you want to profit from why fleecing a bit more your customers.You started on the wrong foot here, you might want to address that!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sam00",
      "created_time": "April 17, 2023, 02:27:29 PM",
      "body": "Quote from: stompix on April 17, 2023, 10:40:29 AMLegal binding contracts must (funny enough!) respect the law also, since you're a German company it does sound weird you're offering contracts for colocation in Russia, what guarantee would your customers have the same thing that happened to Compas Mining or SBI won't happen to you?If any of their partners go bankrupt and worst case they go bankrupt / insolvent aswell then the company is dead but since it's a \"GmbH\" that means that the customers can only ask for the money they have and noone will be liable with their private money/savings.Meaning that you would have to trust the company aswell as far as im concerned.Op would have to clarify here if they take full responsibility for their partners actions and if they have the capital to replace any damages caused by Bitkern for example.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lakai01",
      "created_time": "April 17, 2023, 05:44:47 PMLast edit: April 17, 2023, 05:58:14 PM by Lakai01",
      "body": "Quote from: sam00 on April 17, 2023, 02:27:29 PMIf any of their partners go bankrupt and worst case they go bankrupt / insolvent aswell then the company is dead but since it's a \"GmbH\" that means that the customers can only ask for the money they have and noone will be liable with their private money/savings.Meaning that you would have to trust the company aswell as far as im concerned.Basically yes, in more detail it looks like this:The US/UK counterpart of a so called GmbH is a \"limited liability company\", the definition of a GmbH is as follows: QuoteThe main feature of the GmbH is its limited liability – shareholders cannot be held liable for damages with their private assets. A GmbH is the non-profit counterpart of a regular limited liability company. [...]The financial risk for the shareholder is much easier to calculate since they are liable only with the amount of share capital (Stammeinlage) that is recorded in the GmbH’s articles of associationSourceSo the owner of the company has to bring in a so called \"Stammeinlage\" (which is around 25k) and if the company goes bankrupt he/she is only liable with this amount of money. In return, of course, this also means that as a creditor you will most likely come out with a large loss in the event of insolvency. Nevertheless, running a company as \"GmbH\" is quite common and nothing special or someone has to worry about!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jbgsmininggmbh",
      "created_time": "April 26, 2023, 02:01:17 PM",
      "body": "Hey sorry for the late reply.Here are the answers to the questions:Mining Hosting FAQ1. is there insurance for the mining equipment?USA: Yes, for a fee of USD 25 per device per year (policies are readily available)Russia (Northern Europe and Asia): No, but armed security and 24/7 staff, alarm systems and camera surveillance.Venezuela: Insurance coverage in organisation (available in approx. 4-8 weeks)2. how is the mining equipment secured?All sites: camera surveillanceRussia: additional alarm system and armed guard serviceVenezuela: 24/7 guard service on site3. where exactly are the machines located?5 locations in Venezuela2 locations in Russia (Krasnoyarsk and Karelia)2 locations in the USA (North Carolina and Pennsylvania)1 location in Paraguay*Exact addresses will only be provided after signature and payment for security reasons.4. How are the miners air-conditioned?All sites use an air-cooling system to cool the miners.5. Is there remote maintenance and can I change my pool?Customers can monitor and control the miners in the pool account. If changes are required, our remote tech team is happy to help and usually implements changes within a few hours. A ticket system will be introduced soon.6. which pool do you use and do you have access to the coins?We use the mining pool viaBTC.com. We do not have access to coins at any time.7. what happens if a miner is defective?If a miner is defective within the warranty period (usually 12 months), we automatically take care of the repair process with the manufacturer. However, if a miner fails outside the manufacturer's warranty, the device is first examined in one of our repair centres to identify the fault. Afterwards, customers receive a cost estimate for the repair, which they can agree to. (Depending on the fault, this costs between USD 100-600.8. Can I see photos or videos of the installation?We can provide photos upon request.9. who is the owner of the miners?From the fulfilment of the purchase contract, the customers become the legal owners of the mining hardware, and this status remains regardless of the hosting partner.On the subject of the insolvency of our partner Bitkern:Bitkern has been successfully active as a service provider in the field of crypto mining worldwide for over 6 years. For security reasons, the Bitkern group consists of several companies, so in the unlikely event that one of the companies goes bankrupt, Bitkern will continue to be fully functional.In the event of insolvency, we would offer various options in consultation with clients, such as shipping the miners to another of our facilities, selling the miners on behalf of the client, or shipping the equipment to the client or another desired location. In theory, there is no loss to the client, only lost profits from Bitcoins not being mined during this time. On the subject of sending miners there: Is possible, but only if the minimum order quantity of 10-20 (depending on location and model) is reached.I hope this clarifies all questions.Have a nice day",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "serveria.com",
      "created_time": "April 26, 2023, 08:27:04 PM",
      "body": "Quote from: stompix on April 16, 2023, 02:54:48 PMQuote from: jbgsmininggmbh on April 16, 2023, 02:34:59 PM However, it is important to be aware of the risks and possible fluctuations and to weigh the investment carefully before jumping into the Bitcoin mining adventure.There are far more risks involved in such a \"hassle-free passive profits' scheme\"For example the risks here:The risk of NOT actually owning your mining hardware.and many more- the company you would buy the gear for might be a scam and not actually buy it and run with the money- the company claiming colocation might not pay you one cent from the earnings- the company selling you this investment plan might simply overcharge you and change the ToS to make your own money because of costs- the company assets might get seized like in the scenario aboveAlso, it's highly possible that the company which claims to :QuoteJB GS Mining GmbH was founded in 2022 by Jonathan Buck and Gitte Schlappner. The two shared a passion for blockchain technology and saw the potential in bitcoin mining, hosting services, and financial and business consultingG.although the domain is 5 days old and might have cropped the datacenter's pictures fromhttps://www.bitkern.com/en/bitcoin-miningwhich sounds a bit scammy to me.  Great post, I hope it will come helpful for some forum members. Because of these reasons, I only invest in things I have full control over. In any other case you're not investing - you're sponsoring somebody's business and completely rely on them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "panganib999",
      "created_time": "April 30, 2023, 06:45:16 PM",
      "body": "Quote from: stompix on April 16, 2023, 02:54:48 PMQuote from: jbgsmininggmbh on April 16, 2023, 02:34:59 PM However, it is important to be aware of the risks and possible fluctuations and to weigh the investment carefully before jumping into the Bitcoin mining adventure.There are far more risks involved in such a \"hassle-free passive profits' scheme\"For example the risks here:The risk of NOT actually owning your mining hardware.and many more- the company you would buy the gear for might be a scam and not actually buy it and run with the money- the company claiming colocation might not pay you one cent from the earnings- the company selling you this investment plan might simply overcharge you and change the ToS to make your own money because of costs- the company assets might get seized like in the scenario aboveAlso, it's highly possible that the company which claims to :QuoteJB GS Mining GmbH was founded in 2022 by Jonathan Buck and Gitte Schlappner. The two shared a passion for blockchain technology and saw the potential in bitcoin mining, hosting services, and financial and business consultingG.although the domain is 5 days old and might have cropped the datacenter's pictures fromhttps://www.bitkern.com/en/bitcoin-miningwhich sounds a bit scammy to me.   Most of these \"risks\" as you put it are pretty much just either pessimistic viewpoints or things that could be solved by a little google search. In my opinion, Co-owning a mining hardware is just stupid. You basically wanted to own the profits with little to no risks of capital lost. Might as well stick to reputable pools and manufacturers. Don't gamble on your miner just because what you're seeing right now from godknowswhothisminingcorporationis.com is relatively cheaper than the market SRP. Buy from sources that are already established and are trustworthy, and in my opinion, don't co-own a mining hardware. The risks outweigh the benefits.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}