{
  "id": "topic_5456871",
  "title": "bonfire66",
  "author": "bonfire66",
  "created_time": "June 19, 2023, 01:37:04 PMLast edit: August 25, 2023, 02:08:10 PM by Xal0lex",
  "content": "Это все весьма просто. Для этого достаточно всего лишь регулярно посещать данный раздел форума, а также раздел «Политика», внимательно меня читать, конспектировать, и заносить полученные данные в ChatGPT. И на выходе вам будет счастье и удача. Ведь все так просто.  Вставлять и заносить. Или – наоборот.  Не важно.      Хотя…  в реальности не все так просто. Бздительные модераторы не дадут так просто обойти каноны и препоны. Они наблюдают и подсекают, чтобы юзеры не использовали ИИ. А старались думать сами. Как они (модераторы) это делают – я не знаю, но не суть важно.Чтобы быть троллем, нужно иметь вдохновение. И креативность. И ссучность. И склонность к творчеству. Не всякий начинающий тролль способен это потянуть (или морально выдержать). Нужно иметь стальные нервы и железные яйца. Либо наоборот. Подтверждаю это, как пользователь соцсетей с примерно 25 летним стажем. Это не считая предыдущего периода рассвета BBS.       Но не всем эта опция доступна. Рано или поздно, тролль не выдерживает, сдувается, сдается, просирается и выдает себя как тролля.  Чем губит и противно поносит славную плеяду супертроллей, которые, умело скрываясь и маскируясь, продолжают свою подрывную деятельность внутри сетей и форумов. И я никак не могу их не осуждать. Новорегов-новтороллей.      Тролли – санитары форумов. Они, и только они могут троллить и отсекать всех нежизнеспособных и неокрепших морально юзеров, которые, почему-то,  возомнили себя монстрами, способными вершить чужие судьбы.  Однако, это не так. Чтобы стать истинным, настоящим «троллем  форума», необходимо принять «мое благословление» и занести 0.05 биткоинов на мой счет. После этого факта «посвящение в тролли» будет считаться свершенным, и соответствующий сертификат посвященному, будет незамедлительно выдан и засвидетельствован.       Обращайтесь если что. Первым 5-и обратившимся будет благословлена 10% скидка. Аминь!Как распознать бота или тролля.      А очень просто. Достаточно поставить специальное расширение для браузера. Я не специалист – ничего рекламировать не буду. Но, у меня стоит одно такое (порекомендовали надежные люди). Суть этого расширения в том, что оно показывает, сколько подписчиков у того чела, который пишет, например, в ютюб. И если чел пишет треш и гавно, и подписчиков у него ноль-1-2-3, то это точно тролль и бот. Проверено 10000 раз.   Просто потому, что тот, кто смог потом и кровью привлечь к себе хотя бы  100-200-300 сторонников-подписчиков, никогда не будет заниматься троллингом и хейтерством. И рисковать быть забаненым гуглом и потерять ВСЕ. Потому что, если что, его могут забанить конкретно и окончательно за ботоводство и троллинг. И все его труды пойдут насмарку. А вот владельцам ОДНОРАЗОВЫХ свежезарегистрированных аккаунтов – тем все пофигу. Забанят – тут же зарегят новый акканут. Это универсальный совет по распознаванию опасности в инете. Каждый раз, когда кто-то вам пишет – проверяйте того, кто пишет. Это поможет вам избежать проблем.   Поэтому – сразу же УНИВЕРСАЛЬНЫЙ совет. Как только кто-то к вам пристает с любы предложением – типа «дать рекламу» или «вложите денег в крипту» - сразу начинайте его гуглить. Если не гуглится – требуйте дополнительных параметров для гугления. Например, ИНН или регистрацию ООО. Типа да. Вы предлагаете влошиться в вашу пирамиду. И уже типа заработали денег. И показали мне видео с фантиками из банка приколов. А вот теперь, покажите мне выписку из НАЛОГОВОЙ, что типа вы уже честно заплатили, за всю эту вашу прибыль, и за все необходимые налоги. Слабо? Только так, и никак иначе!   Я тут (на форуме) тусуюсь уже почти 6 лет. И еще НИ РАЗУ не ошибся в своем поиске жуликов или троллей или скамных проектов. Ну, то есть, если я когда-то сказал, что такая-то криптовалюта является скамом и разводом – то ТАК оно и происходило. Рано или поздно. Я еще НИ РАЗУ не ошибся. Если вы знаете что-то про те случаи, когда я кого-то обозвал скамом, и этот проект не оказался скамом – пишите, готов буду обсудить!   Если что – я готов организовать мастер-класс по защите от скама и развода. Ищу продюсеров. Ибо сам один лично не потяну. Не хватает умений (не знаний). Если что – это конкретная тема для инета. Кто-то разводит, и зарабатывает на этом бабло, а кто-то защищает от разводов, и тоже зарабатывает на этом бабло. Вечная борьба Добра и Зла.Искусство унижать.       Вот только прямо сегодня появилась у меня идея написать книгу. Да, книги мне еще не приходилось писать, хотя многочисленные статьи и обзоры в бумажных журналах – запросто. Эта книга должна быть про искусство инет-троллинга. Нет, не того троллинга. Который идет за счет финансирования из денег Пригожина, а самого натурального, независимого, вольного и свободного инет-троллинга. Просто из-за любви к искусству обосрать с подвыподпердом. Да, это не всякому дано, я лично уже несколько лет пытаюсь обосновать и оформить в виде тезисов основную концепцию данной книги. И пока все идет весьма медленно, но продвигается.        Вот, например, некто А. Невзоров написал книгу «Искусство оскорблять»  Хорошая книга. Я правда – не читал, хотя видел на видео отрывки. Но я хочу его превзойти. Ибо я моложе и бодрее. Почему бы и не попробовать? Поэтому я замахнулся на более глобальную тему – про унижения.         Если вы вступаете с кем-то в спор, то ваша первейшая задача – не победить оппонента в споре, но унизить его. Если вы не видите этой задачи – то вам лучше ничего не делать, забиться под матрас и там похрюкивать в тряпочку. В споре с единичным представителем плебса не нужно задавать глобальных задач по установлению мирового господства. Окружающие этого не поймут. Другое дело срач в инете. Но про это у меня будет скоро отдельная глава. Я об этом так тщательно собираю материал, как не собирал его, например, по моей любимой теме тиофосфорорганической химии биологически активных соединений. Тема, близкая к теме «новичка», если что....       Но если вы просто хотите обосрать кого-то, с кем общаетесь на форуме – то проще всего будет применить мой метод под названием «искусство унижать».  Да, это именно так. Сейчас в мире каждый день происходят такие события, под «соусом» которых унижать и оскорблять доверчивых лохов просто не представляет никаких проблем. Достаточно нести любую дичь, делать фейковые новости, а потом злорадно смотреть, как на форумах бьются комментаторы, пытаясь высосать «истину» из этого дерьма.       Каждому – по заслугам, каждому – по потребностям.  Именно примерно так звучит главный лозунг коммунистов всех времен. И только те, кто сильны духом, телом и разумом, те, кто имеют в кошельках достаточное количество криптовалюты, только те смогут устоять, даже хотя бы не прямо сейчас, но вообще. Устоять от потока говноинфы, которая валится на вас со всех источников информации, включая данный текст. Но вам нужно, сразу и конкретно выбрать, с кем вы? С левыми барыгами-разводилами, либо с честными принципиальными «искусителями унижения», вроде меня.         Подписывайтесь на мои каналы, ставьте лайки, шлите донаты, унижайте униженных и оскорбляете оскорбленных. Если вы этого не сделаете, то, в итоге, оскорбят и унизят лично вас! Как-то так, ИМХО....        Тут главное, действовать по методу Доктора Геббельса. «Чем круче и безумнее ложь – тем быстрее люди в нее поверят». Как-то так, ИМХО!   Следите за публикациями, не пропадайте! Я гарантирую что тут всегда будет весело и прикольно! Jedem das Seine!Добавлена инфо из удалённого подобного по смыслу топика автора.Модератор.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5456871",
  "comments": [
    {
      "author": "Wynether123",
      "created_time": "June 26, 2023, 07:14:32 AM",
      "body": "необходимо принять «мое благословление» и занести 0.05 биткоинов на мой счетэто первый урок?)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bonfire66",
      "created_time": "June 26, 2023, 09:00:47 AM",
      "body": "уроки стоят денег, как известно. Переведите биткоины, и будете автоматически зачислены на второй курс.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "amantmaitresse",
      "created_time": "December 18, 2023, 09:22:58 AM",
      "body": "Как научиться? Находишь ватных поцреотов в соц сетях и начинаешь спор, научишься за сутки на этхи существах",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PatrikStar",
      "created_time": "January 05, 2024, 12:06:58 PM",
      "body": "Вольнова можете посмотреть и его пранки, только старые записи, ибо как началась война он слишком токсично стал вести свою деятельность.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dominatordom",
      "created_time": "January 25, 2024, 09:01:13 AM",
      "body": "В Зэт пабликах можешь поучиться, там токсичные и обиженные жихнью люди (мб фейки или боты) любят на всех гнать.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "natotech",
      "created_time": "January 30, 2024, 07:47:28 AM",
      "body": "Чтобы убедиться на все 100% даже есть ресурсы, куда ссылочку кидаешь например из ВК и все видно о боте или фейке) В ВК тьма их.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GlacierBIT",
      "created_time": "February 13, 2024, 07:34:05 PM",
      "body": "Судя по всему это целая профессия уже, еще и обучаться нужно для этого)) троллинг это в первую очередь оскорбление человека, да вам кажется это безобидно, но тот кому это достается может сильно огорчиться, главное не переборщить с этим, будьте умнее, троллинг может оказаться опасной штукой.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MillerMike",
      "created_time": "March 07, 2024, 08:55:14 AM",
      "body": "Quote from: Dominatordom on January 25, 2024, 09:01:13 AMВ Зэт пабликах можешь поучиться, там токсичные и обиженные жихнью люди (мб фейки или боты) любят на всех гнать.Это ребята, которые продались за 15 копеек и за деньги строчат всякую ерунду, унижая себя и других людей. Хотя сами явно понимают, что они не правы как и их хозяева.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}