{
  "id": "topic_5436325",
  "title": "Crypt0Gore",
  "author": "Crypt0Gore",
  "created_time": "January 22, 2023, 05:54:21 AM",
  "content": "Assuming in the future time many countries have fully embraced crypto adoption and in fact, many countries are using the country fund to invest in Bitcoin just like what El Salvador is doing right now and something bad starts happening to the wallet they store their fund? Imagine a hacker stealing Bitcoin that belongs to a country, how do you think the situation will be handled? Do not take this too seriously as it's just a fun thought, since this has nothing to do with Banks I am just thinking about how they will handle the situation, launch a red alert or something. Go after the hacker big time with all they have? Or use the Centralised power on the exchange?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5436325",
  "comments": [
    {
      "author": "un_rank",
      "created_time": "January 22, 2023, 06:06:35 AM",
      "body": "Probably put all exchanges on high alert in expectation of the hacker moving it through them. This could be extended to mixers as well which they think the hacker would try to move it through first.In their characteristic fashion, they would likely try damage control as public funds are involved, and shift the blame to how the crypto system is set up which lead to the loss and encourage people to save with banks instead.- Jay -",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitKongy",
      "created_time": "January 22, 2023, 08:13:34 AM",
      "body": "Sorry I don't believe that crypto wallets get hacked, it's always someone doing something stupid, if this happens then it's the fault of the person in charge of the wallet storing the country's fund. I believe the hunt should start from him, what he did last, which transaction he authorised and which smart contract he interact with.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EarnOnVictor",
      "created_time": "January 22, 2023, 08:28:19 AM",
      "body": "Bitcoin and other cryptos have their advantages and disadvantages, and what you have just narrated is so possible, which is what I term \"one of the risks of owning cryptos.\" Fiat too is susceptible to hacking, but highly traceable and recoverable, unlike crypto where mixers, wallets and exchanges could be complicit in the perpetration. I don't trust anyone or company no matter how they seem to be innocent, the underworld has its networks too, so it might be easier to get away with some hacking and stealing at times depending on the crypto in question. As time goes on, more underworld schemes would be devised, and more efforts would be deployed to trade stolen coins, but it's not all either side that would be successful.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "January 22, 2023, 08:59:55 AM",
      "body": "Quote from: EarnOnVictor on January 22, 2023, 08:28:19 AMunlike crypto where mixers, wallets and exchanges could be complicit in the perpetration. I don't trust anyone or company no matter how they seem to be innocent, the underworld has its networks too, so it might be easier to get away with some hacking and stealing at times depending on the crypto in question.If it is bitcoin that is stolen, the coin can be useless for the hackers because the address will be blacklisted and everywhere the coin is transferred to would be seen and also blacklisted if the government response is fast against the attack. They will try all possible means to trace the coin to the hacker or having the control over the coin back.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rat03gopoh",
      "created_time": "January 22, 2023, 09:21:52 AM",
      "body": "Depending on how far the government can reach out to all those crypto companies to help including convincing decentralized services that they should step in. Or with the second option, give the hacker some \"good deals\".That's too complex a scenario for the average Joes to think about. What is clear is that such cases will be an indication of whether a country deserves to restart their investment or not.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Don Pedro Dinero",
      "created_time": "January 22, 2023, 09:34:05 AM",
      "body": "Quote from: Crypt0Gore on January 22, 2023, 05:54:21 AMImagine a hacker stealing Bitcoin that belongs to a country, how do you think the situation will be handled? It seems to me that you imagine too much. Unless they are morons, which I don't rule out in the case of politicians in office, it is normal for them to have them in several wallets and not just one, and with multi-sig systems. If they have all or part of the bitcoin deposited in a company, it is reasonable that it is a financially stable company, liable, and also with insurance.There are a thousand things that can be done to minimise risks.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CageMabok",
      "created_time": "January 22, 2023, 09:50:18 AM",
      "body": "Quote from: Crypt0Gore on January 22, 2023, 05:54:21 AMAssuming in the future time many countries have fully embraced crypto adoption and in fact, many countries are using the country fund to invest in Bitcoin just like what El Salvador is doing right now and something bad starts happening to the wallet they store their fund? If you give an example to El Salvador, then the answer might be slightly different because El Salvador would have already understood the risks so that El Salvador would not carelessly store their Bitcoins in a wallet that had not been tested for security. This means that El Salvador is also seriously considering the wallet that they will use for a long time to store Bitcoins. And not all of El Salvador's money is placed into Bitcoin even though the country has recognized Bitcoin as a legal currency to pay for anything there.QuoteImagine a hacker stealing Bitcoin that belongs to a country, how do you think the situation will be handled? I can't imagine that because there are definitely a lot of them, but I'm sure that the countries that are victims of the hack use wallets that are not tested or that are easily broken by hackers, so the country must bear the risk.QuoteDo not take this too seriously as it's just a fun thought, since this has nothing to do with Banks I am just thinking about how they will handle the situation, launch a red alert or something. Go after the hacker big time with all they have? Or use the Centralised power on the exchange? That is a very difficult situation to imagine and also if you have to chase a hacker it will certainly take more time and a centralized exchange also cannot be responsible for this because to store Bitcoins is not recommended in any exchange except in a very reliable wallet, so it is the use of the wallet that needs to be really guarded and chosen properly.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BRINIRHA",
      "created_time": "January 22, 2023, 09:59:38 AM",
      "body": "What is certain to be the government's main concern when this happens is to try to improve their security system as soon as possible. because if the country's wallet is successfully hacked then surely the country's security is very bad and there are several loopholes. and concurrent with improvement efforts in increasing the level of cyber security of their countries. of course the next step for the country is to immediately hold emergency deliberations and contact every exchange and all sectors including mixers to work together in narrowing the paths that the hacker might take to sell his stolen goods.But some fud would prefer to blame the security of the wallet or crypto itself and ignore the security of the country which is actually problematic. it's just my imagination.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Awaklara",
      "created_time": "January 22, 2023, 10:18:11 AM",
      "body": "Quote from: BRINIRHA on January 22, 2023, 09:59:38 AMWhat is certain to be the government's main concern when this happens is to try to improve their security system as soon as possible. what do you mean by the security of state apparatus to access the wallet where they keep their Bitcoins? I'm sure a country that has adopted Bitcoin like El Salvador has thought about the security of the wallet they use to store their Bitcoin assets.they wouldn't be stupid to keep it on the exchange. or cooperate with exchanges legal in their countries to manage State finances. I think, if something like this happens, it is likely that those who do it are those who work to manage or store these assets. and creating hacking scenarios against country wallets.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "palle11",
      "created_time": "January 22, 2023, 12:04:48 PM",
      "body": "Quote from: un_rank on January 22, 2023, 06:06:35 AMProbably put all exchanges on high alert in expectation of the hacker moving it through them. This could be extended to mixers as well which they think the hacker would try to move it through first.Well this is a possibility and something that could be watched out on but what I'm thinking is that the hacker may still decide not to go through such means and sell gradually through P2P. I believe though that the address may be identified but nothing much may come out of it. Don't make mistake of being hacked.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zaguru12",
      "created_time": "January 22, 2023, 12:29:18 PM",
      "body": "Quote from: Awaklara on January 22, 2023, 10:18:11 AMwhat do you mean by the security of state apparatus to access the wallet where they keep their Bitcoins? I'm sure a country that has adopted Bitcoin like El Salvador has thought about the security of the wallet they use to store their Bitcoin assets.they wouldn't be stupid to keep it on the exchange. or cooperate with exchanges legal in their countries to manage State finances. I think, if something like this happens, it is likely that those who do it are those who work to manage or store these assets. and creating hacking scenarios against country wallets.In a situation like this and with huge amounts of funds stated by the OP this scenario shouldn’t be something that can’t happen but I wouldn’t put it has a hack but rather an embezzlement of funds by the officials involved. Because should they decide to use a wallet for storing such amonut then it could be a Multi sig if at all the government care for the security of the funds from onset Quote from: Awaklara on January 22, 2023, 10:18:11 AMthey wouldn't be stupid to keep it on the exchange. There’s a chance they could try it out. We know how politicians try out dirty tricks to gain profits, so there is tendency they could even be using some lending or future trading’s features on exchanges but I know any exchanges they will deal with be those that they can hold accountable for any lose and they could go to any length to get their funds back from them if the exchange runs into trouble",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Saisher",
      "created_time": "January 22, 2023, 02:10:10 PM",
      "body": "Quote from: Crypt0Gore on January 22, 2023, 05:54:21 AMAssuming in the future time many countries have fully embraced crypto adoption and in fact, many countries are using the country fund to invest in Bitcoin just like what El Salvador is doing right now and something bad starts happening to the wallet they store their fund? Imagine a hacker stealing Bitcoin that belongs to a country, how do you think the situation will be handled? Do not take this too seriously as it's just a fun thought, since this has nothing to do with Banks I am just thinking about how they will handle the situation, launch a red alert or something. Go after the hacker big time with all they have? Or use the Centralised power on the exchange? I think by that time there are safety parameters for every country and there will be an international organization to protect  Bitcoin of every holder from hacking and the exchanges and the whole stakeholders will unite to fight this scenario, countries will have multi signatures so they can protect their national treasury from being stolen.Hackers can steal from people and exchanges but it's going to be different if they are stealing from a country much more than a powerful country like China, they cannot get away with it, so I think hackers will not dare touch the country's stored Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bbigtart",
      "created_time": "January 22, 2023, 03:50:21 PM",
      "body": "Quote from: CageMabok on January 22, 2023, 09:50:18 AMI can't imagine that because there are definitely a lot of them, but I'm sure that the countries that are victims of the hack use wallets that are not tested or that are easily broken by hackers, so the country must bear the risk.Yes, I think that the country of El Salvador, which is ready to invest in bitcoin, has studied the best and proven security system for storing bitcoin assets from hacking. El Salvador has thought carefully about every decision it makes and it can't be that reckless.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pixie85",
      "created_time": "January 22, 2023, 04:41:39 PM",
      "body": "Quote from: Crypt0Gore on January 22, 2023, 05:54:21 AMImagine a hacker stealing Bitcoin that belongs to a country, how do you think the situation will be handled? Why are you so concerned about bitcoin belonging to a country and not other important information. Countries have nuclear arsenal. Hacking into the exact locations of their nukes would be more deadly. What about names of all their spies in other countries, or emails of the president? The current banking system can also be hacked to allow cash withdrawals from ATMs. Bitcoin is much safer than that if kept in cold storage. Nobody can hack it and take it from you. A country would have to be completely careless to hold it in a hot wallet and allow it to be stolen.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "January 22, 2023, 04:44:37 PM",
      "body": "Quote from: Charles-Tim on January 22, 2023, 08:59:55 AMIf it is bitcoin that is stolen, the coin can be useless for the hackers because the address will be blacklisted and everywhere the coin is transferred to would be seen and also blacklisted if the government response is fast against the attack.Bruh, you just destroyed the whole idea of being your own bank and securing your assets with bitcoin with this!If the government would be able to completely blacklist and stop everyone from accepting your coins, then it makes no sense whatsoever to store your coins, they could simply blacklist all addresses that are not registered with name and full KYC in their database from every transferring fund to exchanges or to ATMs or to merchants and that's it for bitcoin.Fortunately enough, blacklists don't work, and governments won't be able to do shit about it right now unless the people themselves give up and accept and lay along with this kind of stuff.Quote from: Saisher on January 22, 2023, 02:10:10 PMHackers can steal from people and exchanges but it's going to be different if they are stealing from a country much more than a powerful country like China, they cannot get away with it, so I think hackers will not dare touch the country's stored Bitcoin.Except when the \"hackers\" are the CCP,  and this would be the actual problem, who will control those coins, and who will decide how they are used!And if someone talks about transparency, having the coins in marked accounts, visible to everyone that browses the blockchain, can somebody tell me which one is the address that holds Salvador funds? And any proof they are still there or at least they have been at one point?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cyber_Alien",
      "created_time": "January 22, 2023, 07:48:16 PM",
      "body": "That wouldn't just happen. It's a truly awful imagination, but how could the government be so stupid as to keep all of the nation assets in a single wallet? If that actually happened, I believe the address would be flagged red, which means no transactions would be performed on the address because no one would want to be traced with a fraudulent address.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "drwhobox",
      "created_time": "January 22, 2023, 09:38:41 PM",
      "body": "Quote from: Cyber_Alien on January 22, 2023, 07:48:16 PMThat wouldn't just happen. It's a truly awful imagination, but how could the government be so stupid as to keep all of the nation assets in a single wallet? If that actually happened, I believe the address would be flagged red, which means no transactions would be performed on the address because no one would want to be traced with a fraudulent address.No, that isn't an awful imagination. Governments can be so stupid or otherwise, they also can move the money elsewhere and announces that the reserve is hacked. QuoteIf that actually happened, I believe the address would be flagged red, which means no transactions would be performed on the address because no one would want to be traced with a fraudulent address.Lol   Are you sure getting flagged on an address will stop the scammer from selling or making transactions from their wallet? I am just curious to know how I can flag a bitcoin wallet address and stop the owner from making any transaction. Please Enlighten Me!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ojima-ojo",
      "created_time": "January 22, 2023, 11:04:55 PM",
      "body": "Quote from: Crypt0Gore on January 22, 2023, 05:54:21 AMAssuming in the future time many countries have fully embraced crypto adoption and in fact, many countries are using the country fund to invest in Bitcoin just like what El Salvador is doing right now and something bad starts happening to the wallet they store their fund? Imagine a hacker stealing Bitcoin that belongs to a country, how do you think the situation will be handled? Can we just stop imagining and start to face the reality and how best to eradicate hackers from the system not only in crypto but all other online services were hackers are keeping an eye and looking for way to get access into personal account or institutional accounts such as governments. And for countries that have large Bitcoin reserves am sure there will already have tech professionals that have good knowledge of wallet management to stay ahead of hackers.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Keyreysek",
      "created_time": "January 23, 2023, 12:28:42 AM",
      "body": "the first step is for sure they will find the cause of the damage or weakness of the hacked system, and as much as possible they will look for the perpetrator.but that is very unlikely, the system that runs on bitcoin and crypto is very different from the usual internet system, and makes it difficult to find out if there is a hack.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}