{
  "id": "topic_5447973",
  "title": "iv4n",
  "author": "iv4n",
  "created_time": "April 07, 2023, 07:41:09 PM",
  "content": "QuoteWhen costs go up, so do profits? That’s not how capitalism is supposed to work, but that is the recent trend. For over a year now, consumers and businesses, both in the U.S. and worldwide, have struggled with stubborn inflation. But the soaring costs haven’t prevented corporations from raking in record profits. The companies in last year’s Fortune 500 alone generated an all-time high $1.8 trillion in profit on $16.1 trillion in revenue. ‘We may be looking at the end of capitalism’: One of the world’s oldest and largest investment banks warns ‘Greedflation’ has gone too farInteresting article, the term \"Greedflation\" especially. This is the first time I come across this term and I like it. I understand that someone wants to be rich, but when is enough? Is there enough?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5447973",
  "comments": [
    {
      "author": "Orpichukwu",
      "created_time": "April 07, 2023, 07:55:51 PM",
      "body": "Quote from: iv4n on April 07, 2023, 07:41:09 PMbut when is enough? Is there enough?There is never enough, human are driving by greed. Business men have voracious appetite, always hungry for more.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "passwordnow",
      "created_time": "April 07, 2023, 08:07:24 PM",
      "body": "There will be an end to all of this but we'll never know who's going to be ending up first. It could them or us, with our lives. Anyway, I believe that these all evil or what these conspiracies were actually right after all. And the government don't do anything about it and recently, just another news about OPEC limiting the supply daily and that's giving a global impact. Why these world leaders and these oligarchs can just stop it, they'll just say that they have no control on it but it seems that even before they admit that, it's obvious for everyone that there are people at the top of it that controls almost everything and just like with OPEC, they've just added another wave of an awaiting price increase a.k.a inflation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ever-young",
      "created_time": "April 07, 2023, 08:27:26 PM",
      "body": "QuoteWhen costs go up, so do profits? That’s not how capitalism is supposed to work, but that is the recent trend. trillion in profit on $16.1 trillion in revenue.  Capitalism is working same way it should, their is no law that band traders from making profit, capitalism is thoroughly the system where private individuals/companies owners manage and control how goods and services are being produced, the price to which they should also be purchased.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dr.Bitcoin_Strange",
      "created_time": "April 07, 2023, 08:33:55 PM",
      "body": "OP, I must say it's the first time I've thought about this word; I even typed it into an English dictionary, but there's no word like that. Obviously, it's self-explanatory that it's a kind of inflation that arises from human greed for more excessive profit in their businesses.Greedflation in my country is more common among retail sellers and also some wholesalers who really want to make more profit. One of the causes of this is the lack of a price regulation union or agency among those sellers or private owners of their resources.based on the chain of indirect distribution, which involves many intermediaries such as distributors, wholesalers, and retailers. If there are no price regulation agencies, all of the intermediaries in the chain of distribution will definitely sell at a different price, at which they will earn a higher profit.In my country, there is the PPPRA (petroleum products pricing regulation agency) and also other agencies and a smaller union for price regulation, which makes sure that all wholesalers are not selling with greed but in a profitable amount based on their costs. Despite having these agencies, there are still some products or businesses in my country that don't have them, and those businesses are prone to greedflation, and all retailers and whole sellers are just selling at different prices that they wish to.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gyfts",
      "created_time": "April 07, 2023, 08:40:48 PM",
      "body": "Albert Edwards, a self proclaimed \"global strategist\" or just an outright socialist opining on economic matters in which he will conflate his own political opinions in place of objective economic principles.\"Greedflation\" is a myth. 2020-2021 saw trillions of dollars of new currency injected into the economy causing demand to rise. With demand rising and limited supply, prices will go up.And we know that because the producers price index dramatically rose in 2020 following the COVID spending spree and lockdowns of almost every major economy in the world: https://fred.stlouisfed.org/series/PPIACOFor \"greedflation\" to actually exist, it would require there to be a large disconnect between the cost of raw materials and the final end sale price to the consumer. Even the ratio of raw material costs and final sale price would not be an accurate reflection of \"greed\" because it's possible for company to make the same amount of profit if the cost to manufacture/sell goods increases. Most of 2020-2021, the government would subsidize unemployment so it created an artificial labor shortage, only compounding the problem.You might ask yourself why it was that corporations became greedy in 2021 oppose to any other year. Surely it could not be because of incompetent government spending/money printing. Albert Edwards is deflecting government recklessness and targeting capitalism as if it was capitalism that dictated COVID policy. Lockdowns are and social welfare states are anti-capitalistic.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "un_rank",
      "created_time": "April 07, 2023, 08:41:27 PM",
      "body": "It is a curious circumstance. Businesses which are worth billions and trillions of dollars would not be willing to take any losses when inflation kicks in and would either push a price increase on the customers, drop the quality of their product to reduce the cost of production and some overhead cost (like laying off workers and overworking the rest).The way I see it, a multi-billion dollar company can more easily cushion a drop in profits than the majority of the customers. Greedflation is a fitting word to describe the incessant craving for more profit.There are a few companies that made little to no adjustments to prices to accommodate inflation, but they are very few in comparison with those that did.- Jay -",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "arallmuus",
      "created_time": "April 07, 2023, 08:43:52 PM",
      "body": "Quote from: iv4n on April 07, 2023, 07:41:09 PMInteresting article, the term \"Greedflation\" especially. This is the first time I come across this term and I like it. I understand that someone wants to be rich, but when is enough? Is there enough?Isnt this actually better though. If companies can keep this up that means there is abundance of demands for their product which is better than shortage of demands because that would lead to other various stuff however we all know that inflation is pretty much the beginning of recession so the after effect of any inflation would be devastating at some point",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "serjent05",
      "created_time": "April 07, 2023, 08:59:07 PM",
      "body": "Greed is a human nature.  People are always aiming for greater heights upon reaching their goals.  People may see the bad side of capitalization but it will never cease because the power belongs to the wealthy.  No matter how factful the article is presenting the statistics, the government can only abide to the likes of these wealthy people unless the kind of government is shifted to dictatorship and alike, this kind of system will continue to exist.Quote from: Dr.Bitcoin_Strange on April 07, 2023, 08:33:55 PMOP, I must say it's the first time I've thought about this word; I even typed it into an English dictionary, but there's no word like that. Obviously, it's self-explanatory that it's a kind of inflation that arises from human greed for more excessive profit in their businesses.Greedflation in my country is more common among retail sellers and also some wholesalers who really want to make more profit. One of the causes of this is the lack of a price regulation union or agency among those sellers or private owners of their resources.based on the chain of indirect distribution, which involves many intermediaries such as distributors, wholesalers, and retailers. If there are no price regulation agencies, all of the intermediaries in the chain of distribution will definitely sell at a different price, at which they will earn a higher profit.In my country, there is the PPPRA (petroleum products pricing regulation agency) and also other agencies and a smaller union for price regulation, which makes sure that all wholesalers are not selling with greed but in a profitable amount based on their costs. Despite having these agencies, there are still some products or businesses in my country that don't have them, and those businesses are prone to greedflation, and all retailers and whole sellers are just selling at different prices that they wish to.In my country even with price regulation, huge companies are still free to dictate their pricing especially when they monopolize the industry.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dr.Bitcoin_Strange",
      "created_time": "April 07, 2023, 09:08:06 PMLast edit: April 07, 2023, 09:19:31 PM by Dr.Bitcoin_Strange",
      "body": "Why are groceries or food items much more expensive?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nwada001",
      "created_time": "April 07, 2023, 09:11:19 PM",
      "body": "Yea, that's the world we find ourselves in now. Something that seems like a disadvantage to others is now an opportunity to entrepreneurs who want to make good use of every chance that they get. This is less common among retailers and more common among producers. Let's say for instance they usually buy production material for about $5 after production process they sell at $7 - all there expenses.  Now if the price of goods for production increases to $6, they will not just want to increase the goods' price by adding $1 to it, but they will use that opportunity to double the price from $7; you see, when production cost was $5, what you will then see is $8–10; that's in all the products. They won't just decrease the percentage of the added amount, but they will increase the total cost of goods by adding the additional amount to each of them with the claim for production cost increase. This has been the nature of business for the past year, and when producers are making all high gains, distributors will continue from there, and then whole sellers follow by becoming retailers. It's just business as usual for them. Even with a regulatory body as @Dr.btc has suggested, it won't still stop the price hike. Because when an opposing body is raised, those entrepreneurs also raise an association that will go against this body in favor of their own interests with claims that those bodies don't actually know what's happening in the market and as such they can't impose a sales price on a particular good. The best they can do is come to an arrangement for everyone to get the same selling amount on all products, with no one selling less or more. We never really know when this will all end because, if there is one thing I understand about markets, when prices are racing up, it's hard for them to bring them back down because they have tested all the good profit.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Captain Corporate",
      "created_time": "April 07, 2023, 09:46:51 PM",
      "body": "The system is built in a way that if one company made 16 billion in profit one year, and 1 billion the next year, there will be some questions asked and possibly even change of the board as well to make sure it never happens again. Which means that companies need to grow constantly, if they make 16 billion this year, they need to make at least %5 more than that next year. This can't go on forever, by logic they would have to just take ALL of our money. This is why the system doesn't work, specially during inflation years because money loses value so they need to make record breaking profits to say they beat inflation rate. Its just not a possible method to continue for too long.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "suzanne5223",
      "created_time": "April 07, 2023, 10:06:45 PM",
      "body": "Honestly, we are living in a world where corporations are manipulating their workers and consumer and this is the scenario, Senator Bernie Sanders and his team are battling for the last couple of months with companies like the largest producer of eggs in the US, Starbucks, Moderna, Youtube Music, etc.If the corporation's executives continue swimming in billions of dollars while making things hard for their workers and the consumer we may see the end of capitalism soon.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hatshepsut93",
      "created_time": "April 07, 2023, 11:44:19 PM",
      "body": "This is very interesting, did the researchers find the cause of these anomalous profit margins? According to theory, the company that lowers the prices will have more sales and will capture larger market share. Unless all market participants conspire to keep the prices high. Is that what's happening right now?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "STT",
      "created_time": "April 07, 2023, 11:51:33 PM",
      "body": "The end of capitalism is when we mistook central bank issuance of currency as valid, its obviously misdirected and compromised by politics on a regular basis.   The value of currency is given to essentially serve the ongoing deficit fiscal spending and continual debt of a central government.  Every person in the country is worse off when the currency they earned yesterday, last week, month or year become worth less through no fault of their own.    Capital with the people not a central bank, its quite clear the central banking system we have is not reliable in maintaining value so the common worker every year is worse off.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sarah Azhari",
      "created_time": "April 08, 2023, 04:00:13 AM",
      "body": "Quote from: iv4n on April 07, 2023, 07:41:09 PMInteresting article, the term \"Greedflation\" especially. This is the first time I come across this term and I like it. I understand that someone wants to be rich, but when is enough? Is there enough?the concept they use behind it is economic growth, they always use that word (\"economic growth\") for all purposes of deception like printing money, or fiat. because the fiat circulation supply is out of control then there is inflation. Greedflation is happening after they print money for stimulus strategy but they didn't think of the effect after.I don't surprise the next time there will be new words besides Greedflation, maybe the next viral is Whalesflation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Free Market Capitalist",
      "created_time": "April 08, 2023, 04:24:08 AM",
      "body": "Quote from: iv4n on April 07, 2023, 07:41:09 PM‘We may be looking at the end of capitalism’: One of the world’s oldest and largest investment banks warns ‘Greedflation’ has gone too farIn other words, a communist economist, of which there are some, predicts the end of capitalism as Marx did more than 150 years ago, just before the very system he criticized so much gave way to the highest levels of development and welfare of mankind. A little earlier, another enlightened man, Malthus, also predicted the catastrophe due to the fact that humans were supposedly growing in geometric progression while humans were growing in arithmetic progression.The result today is that there are almost 8 billion people living on earth, compared to 1 billion in 1800. That hunger in the world has been drastically reduced and that in most of the poor countries where half a century ago people were starving, today they have an obesity problem. Communist economists like this one don't want to learn that companies can be as greedy as they want, that if they are too greedy it backfires on them, but just his predicting the end of capitalism for the umpteenth time should make us think.Quote from: Dr.Bitcoin_Strange on April 07, 2023, 09:08:06 PMWhy are groceries or food items much more expensive? It's not so much that prices are going up as that money is worth less and less.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "adaseb",
      "created_time": "April 08, 2023, 04:56:21 AM",
      "body": "It’s happening because people are actually paying these high prices. Look at cars. The average cost of a car is $50K and not only that but there are marks up or mandatory add ons which the dealer adds. Then there is interests rates. So a $50K car is like $1000 a month for 5-6 years.You would think they would lower prices because it’s too expensive. But guess what . People are actually paying these prices and the dealers and auto makers basically will keep doing what works to make money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Strongkored",
      "created_time": "April 08, 2023, 05:02:46 AM",
      "body": "Looking for information on the internet about greedflation but being directed to gradation so this is not a common word for people so they don't really understand what it means except reading the article that Op includesNever been enough, that's what humans always feel, especially a company controlled by capitalists. They never even think about whether people will still be able to buy their products because capitalists believe price increases will be followed by other things so that people can still afford to buy products. Capitalists will not reduce profit margins just because they want their product to be purchased more and more, for them they stick to their rules with a predetermined profit margin if the product is not selling well they will choose to waste it because contributing to society is not the main goal of capitalists, but taking as much profit as possible is the main focus.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "karmamiu",
      "created_time": "April 08, 2023, 05:19:47 AM",
      "body": "Quote from: Sarah Azhari on April 08, 2023, 04:00:13 AMQuote from: iv4n on April 07, 2023, 07:41:09 PMInteresting article, the term \"Greedflation\" especially. This is the first time I come across this term and I like it. I understand that someone wants to be rich, but when is enough? Is there enough?the concept they use behind it is economic growth, they always use that word (\"economic growth\") for all purposes of deception like printing money, or fiat. because the fiat circulation supply is out of control then there is inflation. Greedflation is happening after they print money for stimulus strategy but they didn't think of the effect after.I don't surprise the next time there will be new words besides Greedflation, maybe the next viral is Whalesflation.Hahahaha that's an interesting word to be added next to the dictionary  . Anyway, they kept using those words \"economic growth\" or something similar to lure people into saving more money or for them to actually sold out all those money like they are offering some kind of valuable treasure. They wanted people to think that more money means more influence. It is partially true that someone who has more money has more influence and more power over the other, that is when the term \"greed\" enters, since both parties wants the authority and influence, they will keep competing without thinking what trap they have fallen into. It just feels like a game that only those boss monsters are fighting while those low-level players (average income to low income) get affected and suffers tremendously.Even if what I have said is just my own speculation, there's no need to see the proofs to notice what our society has become because of that competition, and I am sure that you guys have noticed that too.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}