{
  "id": "topic_5406132",
  "title": "2020GD",
  "author": "2020GD",
  "created_time": "July 13, 2022, 01:42:29 PMLast edit: July 20, 2022, 05:55:57 AM by 2020GD",
  "content": "Why do people play in casinos? For the sake of adrenaline? Self-satisfaction? For the sake of winning! It is the generous winnings that encourage players to bet in the casino and take risks over and over again in the hope of catching luck by the tail.Our FoggyStar Casino has had more than one amazing win, and we want to share them with you here! We welcome your opinions on your BIG winnings here! Do not hesitate to share your experience and emotions.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5406132",
  "comments": [
    {
      "author": "tabas",
      "created_time": "July 13, 2022, 11:18:09 PM",
      "body": "Quote from: 2020GD on July 13, 2022, 01:42:29 PMWhy do people play in casinos? For the sake of adrenaline? Self-satisfaction? Most likely for the self satisfaction. We do say that many are for the entertainment and that's part of self satisfaction.Quote from: 2020GD on July 13, 2022, 01:42:29 PMFor the sake of winning! It is the generous winnings that encourage players to bet in the casino and take risks over and over again in the hope of catching luck by the tail.Everyone wants to win and even you're for the entertainment, you'll want to make sure that after you enjoy, there's still some hole for winning.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DoublerHunter",
      "created_time": "July 13, 2022, 11:58:19 PM",
      "body": "Quote from: 2020GD on July 13, 2022, 01:42:29 PM~snip~Why do people play in casinos? For the sake of adrenaline? Self-satisfaction? ^ Self-satisfaction and of course, profit.Many people gamble not only for entertainment, or for the sake of adrenaline, but it is also for the sake of money hoping that it will double quickly. Inside my head just wondering if the casino will continue its generosity in winning, it will be able to survive in the long run? Because when a gambler heard that there is a generous winning, they will think it will surely they can take advantage and get profit.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hispo",
      "created_time": "July 14, 2022, 01:29:02 AM",
      "body": "Probably self satisfaction and for the chance of some winnings.I am assuming this is the ANN of your casino, perhaps you would like to offer some kind of bonus or extra for those who join through this thread here in the forum?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coinerer",
      "created_time": "July 14, 2022, 04:13:18 AM",
      "body": "Quote from: 2020GD on July 13, 2022, 01:42:29 PMWhy do people play in casinos? For the sake of adrenaline? Self-satisfaction? For the sake of winning! It is the generous winnings that encourage players to bet in the casino and take risks over and over again in the hope of catching luck by the tail.Our FoggyStar Casino has had more than one amazing win, and we want to share them with you here! We welcome your opinions on FoggyStar Casino winnings here, and we will also talk about new winnings! Do not hesitate to share your opinion on this topic here. I seen FoggyStar Casino have a Announcement thread on Gambling section. So I don't think it's necessary to give any new updates here again. This is considered spam.  And it's bumping their site. If they have any kind of update or anything else then op should post it on there Announcement thread. No need to create any new topics again on another section",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "swogerino",
      "created_time": "July 14, 2022, 06:09:12 AM",
      "body": "Quote from: DoublerHunter on July 13, 2022, 11:58:19 PMQuote from: 2020GD on July 13, 2022, 01:42:29 PM~snip~Why do people play in casinos? For the sake of adrenaline? Self-satisfaction? ^ Self-satisfaction and of course, profit.Many people gamble not only for entertainment, or for the sake of adrenaline, but it is also for the sake of money hoping that it will double quickly. Inside my head just wondering if the casino will continue its generosity in winning, it will be able to survive in the long run? Because when a gambler heard that there is a generous winning, they will think it will surely they can take advantage and get profit.It always depends at which point in time you play in a slot machine for example.If the casino has for example the daily RTP,weekly and monthly updated every couple of minutes which can tell the player such stats then the possibility is there to get a profit.Usually from my personal experience is when a slot machine is 188% in the RTP daily and also weekly over 100% most likely it will continue to be generous to the players until it hits the peak and then start to go down in RTP until it reaches the house edge.Where many people get confused is if they see that the RTP is less than 80% daily or weekly they think it is time for the slot to start giving which is not true.It will adjust over time to the RTP defined by the provider for example like 96% as advertised.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "michellee",
      "created_time": "July 14, 2022, 06:17:54 AM",
      "body": "People play in casinos for adrenaline, gratification, curiosity, and wanting to make money from casinos. Gamblers bravely risk losing it and don't think about what will happen to them so they keep using more money. But for wise gamblers, they will not like that but will manage the use of their money to play gambling. They are looking for fun but also think about how much money they have to spend just to gamble and not cross the line.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "danherbias07",
      "created_time": "July 14, 2022, 06:26:14 AM",
      "body": "I thought there will be some examples of big winners when I saw the title. It will be more interesting if OP inserted that so it won't look like a clickbait thing. It might help attract players and share all their winnings here, if that's your goal for this discussion.It's also defeating the house that gives satisfaction. Profits and adrenaline are given but how many times did we think we cannot defeat the house. Our losses could answer that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "2020GD",
      "created_time": "July 14, 2022, 12:26:46 PMLast edit: July 19, 2022, 04:07:44 PM by mprep",
      "body": "Quote from: tabas on July 13, 2022, 11:18:09 PMQuote from: 2020GD on July 13, 2022, 01:42:29 PMWhy do people play in casinos? For the sake of adrenaline? Self-satisfaction? Most likely for the self satisfaction. We do say that many are for the entertainment and that's part of self satisfaction.Quote from: 2020GD on July 13, 2022, 01:42:29 PMFor the sake of winning! It is the generous winnings that encourage players to bet in the casino and take risks over and over again in the hope of catching luck by the tail.Everyone wants to win and even you're for the entertainment, you'll want to make sure that after you enjoy, there's still some hole for winning.Agree! Any significant success brings great satisfaction. It raises our self-confidence and motivates us to continue doing this business.Quote from: DoublerHunter on July 13, 2022, 11:58:19 PMQuote from: 2020GD on July 13, 2022, 01:42:29 PM~snip~Why do people play in casinos? For the sake of adrenaline? Self-satisfaction? ^ Self-satisfaction and of course, profit.Many people gamble not only for entertainment, or for the sake of adrenaline, but it is also for the sake of money hoping that it will double quickly. Inside my head just wondering if the casino will continue its generosity in winning, it will be able to survive in the long run? Because when a gambler heard that there is a generous winning, they will think it will surely they can take advantage and get profit.It seems to us that any player and casino should reasonably calculate their strength. So, the player should realise how far they can go, risking losing a large amount. And the casino should understand how generous winnings it can offer to lucky players. Quote from: Hispo on July 14, 2022, 01:29:02 AMProbably self satisfaction and for the chance of some winnings.I am assuming this is the ANN of your casino, perhaps you would like to offer some kind of bonus or extra for those who join through this thread here in the forum?Here we would like to discuss players' winnings, get their valuable experience, and share emotions! We started a discussion so that different users would tell us why they were playing and what were their most important winnings.  Quote from: coinerer on July 14, 2022, 04:13:18 AMQuote from: 2020GD on July 13, 2022, 01:42:29 PMWhy do people play in casinos? For the sake of adrenaline? Self-satisfaction? For the sake of winning! It is the generous winnings that encourage players to bet in the casino and take risks over and over again in the hope of catching luck by the tail.Our FoggyStar Casino has had more than one amazing win, and we want to share them with you here! We welcome your opinions on FoggyStar Casino winnings here, and we will also talk about new winnings! Do not hesitate to share your opinion on this topic here. I seen FoggyStar Casino have a Announcement thread on Gambling section. So I don't think it's necessary to give any new updates here again. This is considered spam.  And it's bumping their site. If they have any kind of update or anything else then op should post it on there Announcement thread. No need to create any new topics again on another section Thank you for your message, we would like to discuss the players’ winnings here. Moreover, here the players can share their successes. It is not necessary to discuss only the winnings in our Marathons and Tournaments. Any experience is welcome  We will listen to your words, as we did not want to break any rules or cause the users’ displeasure.  Quote from: Wapfika on July 14, 2022, 05:39:31 AMQuote from: coinerer on July 14, 2022, 04:13:18 AMQuote from: 2020GD on July 13, 2022, 01:42:29 PMWhy do people play in casinos? For the sake of adrenaline? Self-satisfaction? For the sake of winning! It is the generous winnings that encourage players to bet in the casino and take risks over and over again in the hope of catching luck by the tail.Our FoggyStar Casino has had more than one amazing win, and we want to share them with you here! We welcome your opinions on FoggyStar Casino winnings here, and we will also talk about new winnings! Do not hesitate to share your opinion on this topic here. I seen FoggyStar Casino have a Announcement thread on Gambling section. So I don't think it's necessary to give any new updates here again. This is considered spam.  And it's bumping their site. If they have any kind of update or anything else then op should post it on there Announcement thread. No need to create any new topics again on another section I agree on some part of your statement, This thread should be titled properly if the OP wants a discussion about the topic he brought up. He seems not knowledgeable enough on forum rules even if he is already a full member. He should change the title and remove the background because this thread is just a promotion for the casino and not a discussion.The OP has some valid discussion topic on title which this thread is not yet removed but this should be edit or else this be deleted soon.Thank you so much for your suggestion. We would not want to violate any rules of this forum, so we will take your words into account  We would really like to raise the discussion of winnings and motivate people to share their experiences. Quote from: swogerino on July 14, 2022, 06:09:12 AMQuote from: DoublerHunter on July 13, 2022, 11:58:19 PMQuote from: 2020GD on July 13, 2022, 01:42:29 PM~snip~Why do people play in casinos? For the sake of adrenaline? Self-satisfaction? ^ Self-satisfaction and of course, profit.Many people gamble not only for entertainment, or for the sake of adrenaline, but it is also for the sake of money hoping that it will double quickly. Inside my head just wondering if the casino will continue its generosity in winning, it will be able to survive in the long run? Because when a gambler heard that there is a generous winning, they will think it will surely they can take advantage and get profit.It always depends at which point in time you play in a slot machine for example.If the casino has for example the daily RTP,weekly and monthly updated every couple of minutes which can tell the player such stats then the possibility is there to get a profit.Usually from my personal experience is when a slot machine is 188% in the RTP daily and also weekly over 100% most likely it will continue to be generous to the players until it hits the peak and then start to go down in RTP until it reaches the house edge.Where many people get confused is if they see that the RTP is less than 80% daily or weekly they think it is time for the slot to start giving which is not true.It will adjust over time to the RTP defined by the provider for example like 96% as advertised.Wow, it's so cool that you share such knowledge! Would you tell us what motivates you to gamble? Quote from: michellee on July 14, 2022, 06:17:54 AMPeople play in casinos for adrenaline, gratification, curiosity, and wanting to make money from casinos. Gamblers bravely risk losing it and don't think about what will happen to them so they keep using more money. But for wise gamblers, they will not like that but will manage the use of their money to play gambling. They are looking for fun but also think about how much money they have to spend just to gamble and not cross the line.We completely agree with you and believe that wisdom comes with experience. It is much more difficult for inexperienced players to control themselves and stop in time. Wise players always know when to stop gambling. Quote from: danherbias07 on July 14, 2022, 06:26:14 AMI thought there will be some examples of big winners when I saw the title. It will be more interesting if OP inserted that so it won't look like a clickbait thing. It might help attract players and share all their winnings here, if that's your goal for this discussion.It's also defeating the house that gives satisfaction. Profits and adrenaline are given but how many times did we think we cannot defeat the house. Our losses could answer that.  That's right, our goal is to motivate gamers to share their rich experience and the winnings they had! Moreover, we would like to discuss what makes gamblers keep playing and taking risks. Indeed, many players, first of all, are motivated by the adrenaline and the opportunity to win with minimal chances. [moderator's note: consecutive posts merged]",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Text",
      "created_time": "July 14, 2022, 01:04:11 PM",
      "body": "Each gambler has their reasons why they want to play and bet. Often it is the risk of winning a big prize because such a huge prize is really attractive. Who wouldn’t be thrilled when you win big, right? But it's better that even if you don't win, don't be discouraged if you know the possible outcome.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fiulpro",
      "created_time": "July 14, 2022, 03:17:34 PM",
      "body": "If I would have succeeded in winning big, I would have indeed left the whole forum and would have retired on a vacation as well. For me the winning big point was when I converted 10$ to 100$ and that is it. At the end of the day it was a great day for me, since the country I was in was going through extreme recession therefore at the end of the day, I ended up being able to pay for all the food 🥑 and drinks for the whole month, ofcourse after adding some more money from the forum, but every drop counts doesn't it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ethereumhunter",
      "created_time": "July 14, 2022, 11:20:38 PM",
      "body": "Quote from: fiulpro on July 14, 2022, 03:17:34 PMIf I would have succeeded in winning big, I would have indeed left the whole forum and would have retired on a vacation as well. For me the winning big point was when I converted 10$ to 100$ and that is it. At the end of the day it was a great day for me, since the country I was in was going through extreme recession therefore at the end of the day, I ended up being able to pay for all the food 🥑 and drinks for the whole month, ofcourse after adding some more money from the forum, but every drop counts doesn't it. That very rarely happens to most people. Only a few people can get like that while the rest have experienced losing their money. But if we win so much money, we will be tempted to continue gambling and most of us will do that and do not know when we need to stop. Besides that, we all want to win big but unfortunately, not many of us can get it but only lose more money. It is not easy to leave the temptations because it is a whisper in our ears to keep playing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tabas",
      "created_time": "July 14, 2022, 11:58:10 PM",
      "body": "Quote from: 2020GD on July 14, 2022, 12:26:46 PMQuote from: tabas on July 13, 2022, 11:18:09 PMQuote from: 2020GD on July 13, 2022, 01:42:29 PMFor the sake of winning! It is the generous winnings that encourage players to bet in the casino and take risks over and over again in the hope of catching luck by the tail.Everyone wants to win and even you're for the entertainment, you'll want to make sure that after you enjoy, there's still some hole for winning.Agree! Any significant success brings great satisfaction. It raises our self-confidence and motivates us to continue doing this business.And will add to your positivity for the next day because you've won. But it also contributes that negativity if opposite happens to you. Well, it's a go to or go home scenario at most times.You'll just choose which mood you're in for today as you gamble because that affects your emotion very well and your decisiveness for your bets that you do on that exact situation you're in.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "2020GD",
      "created_time": "July 15, 2022, 01:18:10 PMLast edit: July 19, 2022, 04:08:36 PM by mprep",
      "body": "Quote from: Text on July 14, 2022, 01:04:11 PMEach gambler has their reasons why they want to play and bet. Often it is the risk of winning a big prize because such a huge prize is really attractive. Who wouldn’t be thrilled when you win big, right? But it's better that even if you don't win, don't be discouraged if you know the possible outcome.We agree with you. You rightly pointed out that it is wonderful to feel a sense of excitement when you win big. In real life, we are always subject to risk, and you shouldn't get upset if you don't succeed. If we don't take risks, then we won't learn certain life skills or get a taste of what life tastes like. Quote from: fiulpro on July 14, 2022, 03:17:34 PMIf I would have succeeded in winning big, I would have indeed left the whole forum and would have retired on a vacation as well. For me the winning big point was when I converted 10$ to 100$ and that is it. At the end of the day it was a great day for me, since the country I was in was going through extreme recession therefore at the end of the day, I ended up being able to pay for all the food  and drinks for the whole month, ofcourse after adding some more money from the forum, but every drop counts doesn't it. It is wonderful that you have been fortunate in a difficult moment for you and the country you were in. It is at times like this that luck and the cumulative effect of good decisions make us realize that there is more to be gained by taking risks.  Quote from: ethereumhunter on July 14, 2022, 11:20:38 PMQuote from: fiulpro on July 14, 2022, 03:17:34 PMIf I would have succeeded in winning big, I would have indeed left the whole forum and would have retired on a vacation as well. For me the winning big point was when I converted 10$ to 100$ and that is it. At the end of the day it was a great day for me, since the country I was in was going through extreme recession therefore at the end of the day, I ended up being able to pay for all the food  and drinks for the whole month, ofcourse after adding some more money from the forum, but every drop counts doesn't it. That very rarely happens to most people. Only a few people can get like that while the rest have experienced losing their money. But if we win so much money, we will be tempted to continue gambling and most of us will do that and do not know when we need to stop. Besides that, we all want to win big but unfortunately, not many of us can get it but only lose more money. It is not easy to leave the temptations because it is a whisper in our ears to keep playing.Indeed, the feeling of temptation always pushes us to do frivolous things. If you have been hit by temptation, it is important to stop in time and accept the situation. However, it is important to understand that we can always calculate our moves and expenditures beforehand, and then make decisions accordingly, taking into account possible losses. Quote from: tabas on July 14, 2022, 11:58:10 PMQuote from: 2020GD on July 14, 2022, 12:26:46 PMQuote from: tabas on July 13, 2022, 11:18:09 PMQuote from: 2020GD on July 13, 2022, 01:42:29 PMFor the sake of winning! It is the generous winnings that encourage players to bet in the casino and take risks over and over again in the hope of catching luck by the tail.Everyone wants to win and even you're for the entertainment, you'll want to make sure that after you enjoy, there's still some hole for winning.Agree! Any significant success brings great satisfaction. It raises our self-confidence and motivates us to continue doing this business.And will add to your positivity for the next day because you've won. But it also contributes that negativity if opposite happens to you. Well, it's a go to or go home scenario at most times.You'll just choose which mood you're in for today as you gamble because that affects your emotion very well and your decisiveness for your bets that you do on that exact situation you're in.We agree with you and hold the same position. It is important to control your emotions and set yourself up for good and positive thinking, which can help you cope with resentment if you lose. Critical thinking also plays an important role, which can keep you from obsessive and frivolous ideas. It is good if you have found your balance and rhythm, through which you are able to survive this or that situation.[moderator's note: consecutive posts merged]",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gianluca95",
      "created_time": "July 15, 2022, 01:28:15 PM",
      "body": "I think that gamblers play only for fan and to have some adrenaline. Only few of them play for big winnings and have any kind of problem. I also have had big winnings but with sportsbook and not with a casino, and aboutyou I've also asked if you're going to open a Sportsbook section but I hadn't any reply at the moment. Hope yes naturally, It would attract many players.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tabas",
      "created_time": "July 15, 2022, 11:34:55 PM",
      "body": "Quote from: 2020GD on July 15, 2022, 01:21:35 PMQuote from: tabas on July 14, 2022, 11:58:10 PMAnd will add to your positivity for the next day because you've won. But it also contributes that negativity if opposite happens to you. Well, it's a go to or go home scenario at most times.You'll just choose which mood you're in for today as you gamble because that affects your emotion very well and your decisiveness for your bets that you do on that exact situation you're in.We agree with you and hold the same position. It is important to control your emotions and set yourself up for good and positive thinking, which can help you cope with resentment if you lose. Critical thinking also plays an important role, which can keep you from obsessive and frivolous ideas. It is good if you have found your balance and rhythm, through which you are able to survive this or that situation.That's where many gamblers are falling in that situation when they allow their emotions to do the control on them instead of them controlling their emotions.Losing big and getting greedier when they're about to recover their losses. You're like gone in the wild when you're in a losing streak because all you think about is your money back and that's the uncontrollable emotion that has overcome the gambler.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fullhdpixel",
      "created_time": "July 16, 2022, 06:09:37 PM",
      "body": "Quote from: tabas on July 13, 2022, 11:18:09 PMQuote from: 2020GD on July 13, 2022, 01:42:29 PMWhy do people play in casinos? For the sake of adrenaline? Self-satisfaction? Most likely for the self satisfaction. We do say that many are for the entertainment and that's part of self satisfaction.And I think the adrenaline is also part of self satisfaction. On the second part of your sentence, yes that's true and that's me. When I play I will only deposit small amounts but I think I am too wise enough because I will still divide this small capital on two different games. One is for risky game and also a fast paced game. The other is for a fun game.Although this game has a fast animation but I will slowly bust on it because the risk is only moderate. If my luck strikes on me, I can also take home some dollars playing this game. There's nothing better than enjoying and then earning a profit. This is the best combo in my opinion when gambling.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "len01",
      "created_time": "July 16, 2022, 06:53:59 PM",
      "body": "Quote from: ethereumhunter on July 14, 2022, 11:20:38 PMQuote from: fiulpro on July 14, 2022, 03:17:34 PMIf I would have succeeded in winning big, I would have indeed left the whole forum and would have retired on a vacation as well. For me the winning big point was when I converted 10$ to 100$ and that is it. At the end of the day it was a great day for me, since the country I was in was going through extreme recession therefore at the end of the day, I ended up being able to pay for all the food 🥑 and drinks for the whole month, ofcourse after adding some more money from the forum, but every drop counts doesn't it. That very rarely happens to most people. Only a few people can get like that while the rest have experienced losing their money. But if we win so much money, we will be tempted to continue gambling and most of us will do that and do not know when we need to stop. Besides that, we all want to win big but unfortunately, not many of us can get it but only lose more money. It is not easy to leave the temptations because it is a whisper in our ears to keep playing.controlling yourself to stop gambling when you win big is impossible in the world of gambling. a lot of gamblers win at gambling earn a lot of money but after that they lose all their money again. because in us when playing gambling will appear adrenaline and a sense of emotion when we get a defeat or victory.when we win at gambling, of course we will have the desire to win more and continue gambling games until defeat arrives.but for me it can all be prevented when you win in gambling immediately withdraw your money half of what you get and stop for a moment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tabas",
      "created_time": "July 16, 2022, 11:25:48 PM",
      "body": "Quote from: fullhdpixel on July 16, 2022, 06:09:37 PMQuote from: tabas on July 13, 2022, 11:18:09 PMQuote from: 2020GD on July 13, 2022, 01:42:29 PMWhy do people play in casinos? For the sake of adrenaline? Self-satisfaction? Most likely for the self satisfaction. We do say that many are for the entertainment and that's part of self satisfaction.And I think the adrenaline is also part of self satisfaction. On the second part of your sentence, yes that's true and that's me. When I play I will only deposit small amounts but I think I am too wise enough because I will still divide this small capital on two different games. One is for risky game and also a fast paced game. The other is for a fun game.Although this game has a fast animation but I will slowly bust on it because the risk is only moderate. If my luck strikes on me, I can also take home some dollars playing this game. There's nothing better than enjoying and then earning a profit. This is the best combo in my opinion when gambling.That's your strategy on how you're dividing your bankroll and that's actually good if you ask me. There are gamblers that can't manage to budget the money that they've got for gambling.So, in the end, they're out too early and can't reach that climax that every gambler wants to have. And that's to have at least a good run and winning some despite losing all.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "2020GD",
      "created_time": "July 18, 2022, 11:17:43 AM",
      "body": "Quote from: Gianluca95 on July 15, 2022, 01:28:15 PMI think that gamblers play only for fan and to have some adrenaline. Only few of them play for big winnings and have any kind of problem. I also have had big winnings but with sportsbook and not with a casino, and aboutyou I've also asked if you're going to open a Sportsbook section but I hadn't any reply at the moment. Hope yes naturally, It would attract many players.Most players only play for fun, but there are many people who win large sums. Luck or talent? Who knows. Nevertheless, it is always nice to see how the players' dreams come true. This motivates other people to try their hands. You probably didn't notice our answer on the main thread  But it's okay, we'll answer here again: we are going to start the betting shops section in the future because this will open up many more amazing opportunities for players!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}