{
  "id": "topic_5432357",
  "title": "EarnOnVictor",
  "author": "EarnOnVictor",
  "created_time": "December 30, 2022, 08:39:27 AMLast edit: December 30, 2022, 01:08:17 PM by EarnOnVictor",
  "content": "It was a rude shock to me when I read the announcement of the Central Bank of Nigeria (CBN) on the banning of cryptocurrency in February 2021. This caused panic amongst crypto users and enthusiasts, to the point that companies were forced to shut down as the apex bank and its allies were clamping down on some accounts with little to no warning. This subsequently generated some debates for clarity, which made the CBN clarify that Nigerians could own and operate with cryptocurrencies, but can't deal with Nigerian banks with its transactions. Initially, I must say that I panicked, thankfully, the P2P system saved the day, and it's still doing it perfectly well.Now, what surprises me are the recent events unfolding barely a year after the announcement, to the point that the so-called ban looks like a mirage. Those companies that shut down in the wake of the announcement are coming back, while many more are even joining to make the matter even more surprising.Those that are conversant with Binance, for example, could testify that it rushed to stop the local deposit and withdraw at that time. But now, Binance is again operating the same service under 'Cashlink.' This is one among multiple others to save us time.While the last of the surprises was the desperation of Paybis in breaking back into the Nigerian crypto market, a Scottish company that does not have a known address in Nigeria now offers a deposit into Nigerian banks in an exchange for cryptocurrencies. This was what the so-called CBN claimed to have targeted by their ban, but it's now obvious that it's more dominant in the banking system and now only targets the commoners.Maybe the ban is now for the poor masses or some small companies, who knows? Regardless, the crypto masses will win, at last. I hope the fight for cryptocurrency by Rep/Senate sees the light of day.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5432357",
  "comments": [
    {
      "author": "Charles-Tim",
      "created_time": "December 30, 2022, 10:25:22 AM",
      "body": "The ban is not only for the poor, even the average and rich people (or people with high amount of money) were the ones that CBN targeted to the extent I remember one that resulted to court case that was won when court order CBN to unfreeze Risevest bank accounts that were freezed. This was also discussed on Nigeria local thread before.Nigerian fintech, Risevest wins court order to unfreeze its bank accountsAbout the bank transfer, like Cashlink, they are also peer-to-peer, not that Cashlink is directly involved in crypto payment, or are they? If not directly involved in crypto payment, it is peer-to-peer. Not that different from other peer-to-peer.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wiwo",
      "created_time": "December 30, 2022, 02:42:27 PM",
      "body": "First in my opinion on CBN banned on Crypto/Bank interference is that the CBN was in a rush to announce the banned without taking the time to thoroughly look into the issues and their many advantages and disadvantages. And you have been following up with CBN policy recently since the new CBN governor came on board, you will see that there have been so many policies from the apex bank that are faulty and lack the merits to operate in a financial system that will enable economic growth and cryptocurrency banned is one of such policy that has greatly failed in Nigeria since P2P can do the needful for the cryptocurrency community in Nigeria, I also believe that the government through the central bank will hace a readjustment in this policy as time goes by since the government will definitely look for ways to get an income tax on crypto which will be a huge source of revenue for the government. I don't believe cryptocurrency will remain on tax for long in Nigeria and if by any chance there is a change of government whose head is versatile in economic and financial policy, there will definitely look for ways to tax cryptocurrency in the long run. This will give cryptocurrency some form of legitimacy in the economy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptopreneurBrainboss",
      "created_time": "December 30, 2022, 02:58:06 PM",
      "body": "Quote from: EarnOnVictor on December 30, 2022, 08:39:27 AMbut it's now obvious that it's more dominant in the banking system and now only targets the commoners. Maybe the ban is now for the poor masses or some small companies, who knows? Regardless, the crypto masses will win, at last. I hope the fight for cryptocurrency by Rep/Senate sees the light of day.Actually ehh just as Charles talk, the poor masses weren't the targeted audiences from day one na just say people no dey get sense. Why you go dey input crypto related words when claiming to be transacting decentralized. Na dis people wey implicate themselves wey banks closed and e no affect all their banks instead just the specific banks wey dem received those crypto related transaction in. But you see for business wey the world know say dem dey involved in the crypto business, government follow dem bumper to bumper to make sure dem go out of business resulting to many running away. Binance get sense and I no believe dem get license yet to operate for Nigeria so anytime wey you dey see anything wey relate to Nigeria for that platform na backyard door wey dem dey use. This Cash link na P2P service providers and Binance no dey work with banks directly as Charles-Tim talk. Just browse am and you go get all the answers to understand wetin dey sup. The best wey to benefit from this industry as a Nigerian na to built your own P2P service providers app and watch as companies go dey knock for ur door.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EarnOnVictor",
      "created_time": "January 12, 2023, 02:59:15 PM",
      "body": "Quote from: Charles-Tim on December 30, 2022, 10:25:22 AMThe ban is not only for the poor, even the average and rich people (or people with high amount of money) were the ones that CBN targeted to the extent I remember one that resulted to court case that was won when court order CBN to unfreeze Risevest bank accounts that were freezed. This was also discussed on Nigeria local thread before.Nigerian fintech, Risevest wins court order to unfreeze its bank accountsAbout the bank transfer, like Cashlink, they are also peer-to-peer, not that Cashlink is directly involved in crypto payment, or are they? If not directly involved in crypto payment, it is peer-to-peer. Not that different from other peer-to-peer.Quote from: CryptopreneurBrainboss on December 30, 2022, 02:58:06 PMActually ehh just as Charles talk, the poor masses weren't the targeted audiences from day one na just say people no dey get sense. Why you go dey input crypto related words when claiming to be transacting decentralized. Na dis people wey implicate themselves wey banks closed and e no affect all their banks instead just the specific banks wey dem received those crypto related transaction in. But you see for business wey the world know say dem dey involved in the crypto business, government follow dem bumper to bumper to make sure dem go out of business resulting to many running away. Binance get sense and I no believe dem get license yet to operate for Nigeria so anytime wey you dey see anything wey relate to Nigeria for that platform na backyard door wey dem dey use. This Cash link na P2P service providers and Binance no dey work with banks directly as Charles-Tim talk. Just browse am and you go get all the answers to understand wetin dey sup. The best wey to benefit from this industry as a Nigerian na to built your own P2P service providers app and watch as companies go dey knock for ur door. Well understood and thanks for shedding more light. Yet, my plight was not when the ban was still hot, but now that it looks cold. The \"Risevest\" you made mentioned had the money to challenge them in court, can the poor do the same? My question was figurative, which was why I was kinda neutral about my disposition while asking it. The whole scenario now where the big guys are back in the crypto business directly with the bank is alarming, while the poor are getting scared to unmask themselves.And yes, Cashlink might be guiltless of the CBN ban on second thought, I just read more about them, it's more or less a P2P settlement, another way to use other people to make money as the rich people do since they have the resources. Nonetheless, I don't think \"Paybis\" which is my second example can be guiltless of the ban as they handle the payment all by themselves, and it's just one out of many others.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}