{
  "id": "topic_5474191",
  "title": "SAHASAN",
  "author": "SAHASAN",
  "created_time": "November 15, 2023, 03:07:25 PM",
  "content": "A friend of mine is not interested in buying Bitcoin even after learning about it.Because according to him Bitcoin is a small number of people who have a lot of Bitcoin. They can easily go down on the bitcoin market if they want to.Example: Cz. Craig wright & Michel Sailor etc. Looking forward to the well thought out opinion of the experienced in this regard.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5474191",
  "comments": [
    {
      "author": "Don Pedro Dinero",
      "created_time": "November 15, 2023, 03:19:21 PM",
      "body": "If he is already rich enough, he may not need bitcoin, although I find your argument too simplistic and I would like to know your friend's level of 'rich'. Do you know approximately how much wealth he has? Anyway, it is a bad idea to try to change people's minds on financial matters.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "_act_",
      "created_time": "November 15, 2023, 03:22:40 PM",
      "body": "Just wallet that hold worth of one millions of dollar of cm bitcoin got to 81,000 wallet addresses recently. More people hold bitcoin which are not up to $1 million dollars. Bitcoin was at $36000 when this report was out. https://cointelegraph.com/news/bitcoin-millionaire-wallets-triple-this-yearYou can check some information about addresses on glassnode. There are many people, including institutions that are holding bitcoin. He thought institutions do not have a reason for holding bitcoin? I hope it is not too late when he will realized what the value of bitcoin could be in some years to come.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Xal0lex",
      "created_time": "November 15, 2023, 03:25:06 PM",
      "body": "If he doesn't see the point, he probably has enough of the wealth he has. He is happy without bitcoin. I agree with the previous opinion, there is no need to impose your opinion in financial matters. You could lose a friend.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Don Pedro Dinero",
      "created_time": "November 15, 2023, 03:32:21 PM",
      "body": "Quote from: SAHASAN on November 15, 2023, 03:30:20 PMThank you so much Sir. I hope your comments will be very useful.Do you have any answer to the question I asked you earlier?Quote from: Don Pedro Dinero on November 15, 2023, 03:19:21 PMDo you know approximately how much wealth he has?  If you could tell us in your words, how rich he is.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GreatArkansas",
      "created_time": "November 15, 2023, 03:33:16 PM",
      "body": "Quote from: SAHASAN on November 15, 2023, 03:07:25 PM(....)Because according to him Bitcoin is a small number of people who have a lot of Bitcoin. They can easily go down on the bitcoin market if they want to.Example: Cz. Craig wright & Michel Sailor etc. (....)I don't think so. Because Bitcoin was created as decentralized. Billions already are floating right now in the Bitcoin market and we have already more than 10 years but why no one else try to do it or like take it down?For me, big companies are already in the market and they are not dumb enough not to think this kind of reason.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "KiaKia",
      "created_time": "November 15, 2023, 03:47:50 PM",
      "body": "That's a made up excuse, maybe because he is already rich, he should have just said that he is not interested in Bitcoin, all the names you mentioned came late to the game, many nobodies bought Bitcoin before these popular people.He lacks some facts about Bitcoin, it's easy to see that, I could remember few of these names saying bad things about Bitcoin years ago, but let's put that aside, isn't he curious why these people are now buying after saying bad stuffs about Bitcoin? I think you should ask him this question. How smart is this rich guy of yours OP? Because I don't believe that he his smarter than all these people you made mention, he is the one lacking lots of knowledge and he will miss out really big if he didn't buy Bitcoin, he has the money, what could possibly go wrong if he risk small amount of money? Never mind, leave him be and don't let him confuse you, that's all I have to say.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yamane_Keto",
      "created_time": "November 15, 2023, 03:58:30 PM",
      "body": "When I first learned about Bitcoin, one of my friends told me that it belonged to a group of Chinese miners who owned all the Bitcoins. Would you like to invest in something like this? If we assume that Cz owns a million Bitcoins and Michel Sailor company has open data, and I think they have 360,000, and if we continue listing the list, we may find that some conglomerates own 5 million Bitcoins, and we still have more than 3 times this number. Either smaller conglomerates or unknown people, and even the list of rich addresses do not all belong to one alliance.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "leonair",
      "created_time": "November 15, 2023, 04:02:17 PM",
      "body": "Quote from: SAHASAN on November 15, 2023, 03:07:25 PMA friend of mine is not interested in buying Bitcoin even after learning about it.Because according to him Bitcoin is a small number of people who have a lot of Bitcoin. They can easily go down on the bitcoin market if they want to.Example: Cz. Craig wright & Michel Sailor etc. Looking forward to the well thought out opinion of the experienced in this regard.We invest in Bitcoin because we want to profit from it and become financially stronger. this is why we use bitcoin investment as a source of income.  But if your friend has enough money then investing in Bitcoin may not be a motivation for him. Because maybe he has some alternative business or job from which he earns enough money to live a luxurious life.  So the benefits of Bitcoin have not encouraged him so far",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Tuturtinular",
      "created_time": "November 15, 2023, 04:05:57 PM",
      "body": "Quote from: SAHASAN on November 15, 2023, 03:07:25 PMA friend of mine is not interested in buying Bitcoin even after learning about it.Because according to him Bitcoin is a small number of people who have a lot of Bitcoin. They can easily go down on the bitcoin market if they want to.Example: Cz. Craig wright & Michel Sailor etc. Looking forward to the well thought out opinion of the experienced in this regard.It doesn't matter if your friend doesn't want to buy and hold bitcoin because that's his choice. I don't think the price of bitcoin will be affected by whether your friends buy bitcoin or notIn my opinion, lowering the price of bitcoin by selling bitcoin en masse is difficult. No one wants to sell bitcoin en masse if it has the potential for higher prices in the future. Apart from that, if they sell bitcoin en masse then just wait until the price of bitcoin goes up again because the number of bitcoins is limited and many people want to own bitcoins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "iBaba",
      "created_time": "November 15, 2023, 04:06:21 PM",
      "body": "Quote from: SAHASAN on November 15, 2023, 03:07:25 PMA friend of mine is not interested in buying Bitcoin even after learning about it.Because according to him Bitcoin is a small number of people who have a lot of Bitcoin. They can easily go down on the bitcoin market if they want to.Example: Cz. Craig wright & Michel Sailor etc. Looking forward to the well thought out opinion of the experienced in this regard.I don't think his assertions are correct on this note. This is just a perspective he's giving to it but he hasn't really go deep in the whole Bitcoin technology. Truth of the matter is, Bitcoin is not owned or controlled by a small number of people like he portrayed but Bitcoin is a growing technology that has developed a large number of individuals from across the globe. Because of the anonymous nature of Bitcoin and the crypto world, it becomes very difficult to simply put that Bitcoin is owned by the above-mentioned names. That cannot be the case.There are an estimated number of 400 million plus owners of Crypto wallets with over 219 million of those numbers owning Bitcoin private wallets and the trading value of 17 billion dollars traded in just 24 hours as of August this year Source.So I think it will be too simple to come to that assertion about the number of those who control the decentralized market. Although, your friend has all the options to stick to his choices, but if really he's that stinkingly rich and he's an investor, he would love to have a major share in the Bitcoin market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NeilLostBitCoin",
      "created_time": "November 15, 2023, 04:07:59 PM",
      "body": "Quote from: SAHASAN on November 15, 2023, 03:07:25 PMA friend of mine is not interested in buying Bitcoin even after learning about it.Because according to him Bitcoin is a small number of people who have a lot of Bitcoin. They can easily go down on the bitcoin market if they want to.Example: Cz. Craig wright & Michel Sailor etc. He is right but why haven't the people with a lot of bitcoin sold any? Some continue to accumulate even with a significant amount. When it comes to bitcoin investment its important to understand that not everyone might feel comfortable investing in it. If you have a friend who is hesitant to invest in bitcoin, its best to approach the topic with an understanding attitude and provide them with as much information as possible about bitcoin and its potential risks and benefits. The decision to invest in bitcoin must be left to the individual. Its not necessary to force anyone to invest in something they're not comfortable with.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "November 15, 2023, 04:18:36 PM",
      "body": "Quote from: SAHASAN on November 15, 2023, 03:07:25 PMA friend of mine is not interested in buying Bitcoin even after learning about it.Because according to him Bitcoin is a small number of people who have a lot of Bitcoin. They can easily go down on the bitcoin market if they want to.Well you should know and also tell them that Bitcoin is not an investment, it is a currency and its purpose is not to give you profit. It is made to give you financial sovereignty. By converting your centralized censorable fiat to the decentralized censorship resistant bitcoin you can freely use your money without having someone else's hands in your pocket.Quote from: SAHASAN on November 15, 2023, 03:07:25 PMExample: Cz. Craig wright & Michel Sailor etc. The fact that your \"friend\" thinks a scammer like Wright has a lot of bitcoin shows how little he understands of the Bitcoin world. They are probably better off not having any bitcoins at all.  Such people can be easily fooled and be taken advantage of.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaveF",
      "created_time": "November 15, 2023, 04:33:43 PM",
      "body": "Some car people not interested in FerrariSome foodies not interested in French pastriesSome landlords not interested in house boats.And so on. Many people are never going to want to be involved in BTC / crypto.That's fine. Same way you can pick any of the examples above where a lot of people are making / spending a lot of money and have no interest in certain things that are associated with what they are doing.-Dave",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Don Pedro Dinero",
      "created_time": "November 15, 2023, 04:37:09 PM",
      "body": "Quote from: DaveF on November 15, 2023, 04:33:43 PMSome car people not interested in FerrariSome foodies not interested in French pastriesSome landlords not interested in house boats.And so on. Yeah, and some people are not interested in answer simple questions to threads they open, asked to them in the first comment, which leads some to think that the story is made up, especially if we look at the OP's post history. It seems that not having much success in the bounties section drives some people to this section.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wapfika",
      "created_time": "November 15, 2023, 04:40:32 PM",
      "body": "Quote from: SAHASAN on November 15, 2023, 03:07:25 PMA friend of mine is not interested in buying Bitcoin even after learning about it.Because according to him Bitcoin is a small number of people who have a lot of Bitcoin. They can easily go down on the bitcoin market if they want to.Example: Cz. Craig wright & Michel Sailor etc. This is nonsense, there are tons of whale holders including institutional investors, exchange, VC and crazy rich person. I’m not sure what kind of nonsense he is talking but even on stock exchange has this kind of share holders that holds the majority of the stocks.I believe the real reason why many rich people don’t want to invest on Bitcoin is because they are afraid on the volatility. They already have a decent source of income that makes them rich, entering a much riskier investment will surely turn them off unless they are risky type rich that wants more aside from their original investment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "moneystery",
      "created_time": "November 15, 2023, 04:52:39 PM",
      "body": "whether he is interested or not interested in investing in bitcoin is his choice and i have no right to change his views. but such a simple reason doesn't make sense to me, does he think that such a large global economy is not controlled by just a few institutions, families and people? he was too naive.and moreover, why did he immediately conclude that bitcoin was only held by a few people and institutions when he just learned about it? which website did he see that made him say that? because as far as i know the global distribution of bitcoin is not centralized in just a few people and it would be very difficult for them to control this market as a whole.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ajiz138",
      "created_time": "November 15, 2023, 04:55:26 PM",
      "body": "Does he not understand the concept of bitcoin despite having studied it? Maybe he already considers himself rich and is afraid of being cheated when investing with bitcoin because of the people mentioned, let people like this even I myself will not respond if I have friends like that.He will not believe in bitcoin even though he knows, but he will regret it when the price is high, no matter how rich the person will certainly need a profitable investment but with this mindset he tends to ignore other thoughts, I think he did not have an interest from the start even though he had studied it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hamza2424",
      "created_time": "November 15, 2023, 05:04:27 PM",
      "body": "Quote from: SAHASAN on November 15, 2023, 03:07:25 PMA friend of mine is not interested in buying Bitcoin even after learning about it.Because according to him Bitcoin is a small number of people who have a lot of Bitcoin. They can easily go down on the bitcoin market if they want to.Example: Cz. Craig wright & Michel Sailor etc. Looking forward to the well thought out opinion of the experienced in this regard.Haha, OP, you got me all mixed up with the name! When I saw the notification for the new topic started by [SAHASAN], I was totally expecting something else. Anyway, whether it's Shasan or Sahasan, doesn't matter!  But hey, sometimes it does matter, right? .Anyway, according to your friend, there are fewer people with more Bitcoins and a fact, but there's a large community just waiting for a drop to accumulate this is what we call the reliability and Bitcoin's strength. even if the market drops there are huge potential buyers to pull back the market to the same level. Weather to invest or not in the Bitocin is totally a person's choice bu before making any decision better analyze the community views, Historical events and upcoming potential adoption.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TheUltraElite",
      "created_time": "November 15, 2023, 05:09:29 PM",
      "body": "Quote from: Don Pedro Dinero on November 15, 2023, 03:32:21 PMIf you could tell us in your words, how rich he is.  You should lower your expectation level mate, I dont think the OP here is interested in that discussion rather trying to \"fish\" for other forum related \"goodies\".No offense to the OP though, but I and most members here have seen more number of threads like this and we all know how real these \"friends\" are. In either case if they think that a few people owning big amounts of bitcoin means they control it, you are explaining it wrongly - focus on what decentralization is and how bitcoin is minted and the supply. Show them how charts have been changing and what happens when price rise or dump starts.If they still dont understand it, dont force it. It is their money and they are free to use it as they wish.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}