{
  "id": "topic_5406633",
  "title": "ronaldo1223",
  "author": "ronaldo1223",
  "created_time": "July 17, 2022, 04:22:43 PM",
  "content": "https://www.youtube.com/watch?v=ZFCglrxg_9kHey anyone know anything about this guy? Found him on youtube seems to be a good gambling tipster who knows how to beat the casino and sportsbooks. Anyone ever follow him? Thinking of placing a wager on the Warriors based on this advice.Lemme know, thanks",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5406633",
  "comments": [
    {
      "author": "Jemzx00",
      "created_time": "July 17, 2022, 05:48:02 PM",
      "body": "Nope, we don't know him. I guess the person on the video is either you or someone you know that you would want to advertise here at the forum. PS. I don't think is that great for me to be convinced to bet on GSW. Also, I think he is a warriors fans",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ulven",
      "created_time": "July 17, 2022, 06:03:15 PM",
      "body": "No, I don't know him. He doesn't have a lot of followers to be famous. And I don't think he can beat the casino in the long run because gambling depends only on luck. If you're not lucky you can't win the jackpot. I advise you to search on popular channels because such people are always looking for new ways to deceive, so pay attention!!!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rruchi man",
      "created_time": "July 17, 2022, 06:24:05 PM",
      "body": "Quote from: Jemzx00 on July 17, 2022, 05:48:02 PMNope, we don't know him. I guess the person on the video is either you or someone you know that you would want to advertise here at the forum. I'm always extra careful of the links i click, so I didn't even bother clicking to watch the clip, but if that's not the case as said (strategy for advertisement)...i'd advice that you generally be careful with tips from tipsters, especially the one's you find on YouTube. The make these videos sometimes just to gather views just so you be reminded.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "swogerino",
      "created_time": "July 17, 2022, 06:43:55 PM",
      "body": "Quote from: ronaldo1223 on July 17, 2022, 04:22:43 PMhttps://www.youtube.com/watch?v=ZFCglrxg_9kHey anyone know anything about this guy? Found him on youtube seems to be a good gambling tipster who knows how to beat the casino and sportsbooks. Anyone ever follow him? Thinking of placing a wager on the Warriors based on this advice.Lemme know, thanksNo I don't know him,first time in fact that I see him but based on the number of views and subscribers doesn't look like he is some genius of a tipster either.Anyone can get a couple of games right or even more than that but I have not seen anyone maintain a winning profit even in sport betting while betting in the long run.I think this guy is no exception to such rule.I used a tipping service before,I guess it was called premiumtipping.com or dot something,they used to tell us that with 9.99 GBP monthly we would always be in profit,and I soon found out that this was not the case,sure the first month I made money with them but the months after I lost really big,that is why I don't trust any tipping service or tipster anymore since then.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "edgycorner",
      "created_time": "July 17, 2022, 07:36:22 PM",
      "body": ">A GSW fan saying GSW is gonna winThis isn't a gambling tip :pIt will be stupid to bet on the champion even before the league begins.NBA is ridden with injuries. Doesn't matter how strong the core is, someone's going to get injured as the season progress which skews the odds. And you ain't fooling anyone by acting like you aren't him",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Doell",
      "created_time": "July 17, 2022, 07:45:07 PM",
      "body": "I also don't know the man on video, he has only 130 subscribers doesn't prove he's an expert. I just want to suggest that when you see a new tipster, don't immediately trust someone you don't know, it's better to research your gambling from yourself rather than to try your luck in the hands of others people.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "acroman08",
      "created_time": "July 17, 2022, 07:47:03 PM",
      "body": "aside from the other members saying that you are the man on the video or know the man on the video, do you have any reason why you think he is a good tipster? just like what the others have said, I too don't know the guy nor do I think he is a good tipster(no offence if you are the guy on the video or if you know the guy in the video).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jating",
      "created_time": "July 17, 2022, 07:50:27 PM",
      "body": "Obviously, experienced NBA bettors here will not simply \"trust\" some random guy in youtube for his tips. And not sure if the OP knows the supposedly tipster or not. I also didn't click the link, but if he is talking about the Warriors next season as NBA winner, then why not? I mean they just won the championship and they all have momentum. Although most of its player that help is gone now, GPII moving to Portland, Otto Porter to Toronto, JTA to Lakers etc. But their core is still intact.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitcoinAccepted",
      "created_time": "July 17, 2022, 07:56:08 PM",
      "body": "Tipster services can be very lucrative. I always wonder why people use it. Does it never occur to those people to think that valuable information is much better used for their own efforts than instead of sharing it with other people? If 1000 people are going to bet on the bet on a certain gambling site, then all alarm bells will ring at that gambling site with all the consequences that entails. On the other hand, such tipster services make good money that way. And no risks.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jemzx00",
      "created_time": "July 17, 2022, 08:25:05 PM",
      "body": "Quote from: Rruchi man on July 17, 2022, 06:24:05 PM Quote from: Jemzx00 on July 17, 2022, 05:48:02 PMNope, we don't know him. I guess the person on the video is either you or someone you know that you would want to advertise here at the forum. I'm always extra careful of the links i click, so I didn't even bother clicking to watch the clip, but if that's not the case as said (strategy for advertisement)...i'd advice that you generally be careful with tips from tipsters, especially the one's you find on YouTube. The make these videos sometimes just to gather views just so you be reminded.Not clicking on the link is the right move and to avoid wasting your time. But since OP even bothered to post it here at the forum, I've checked and watched it for him. The youtube channel only has a few subscribers and viewers. Also, the youtube link included is very unprofessional to be taken in as an advice, it only last for less than 2 mins since \"he accidentally stop recording\" another video has been posted as part 2. He didn't even bother editing it as one video instead",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ronaldo1223",
      "created_time": "July 17, 2022, 09:10:23 PM",
      "body": "Quote from: acroman08 on July 17, 2022, 07:47:03 PMaside from the other members saying that you are the man on the video or know the man on the video, do you have any reason why you think he is a good tipster? just like what the others have said, I too don't know the guy nor do I think he is a good tipster(no offence if you are the guy on the video or if you know the guy in the video). Yah my reasoning was that he seems to know a great deal about the team and how the coach improves players over time in \"Steve Kerr's system\" as he calls it. If this information isn't widely known, or the information isn't valued properly by the betting markets then it would seem to be a good bet.But others have made good points like injuries are so common, tough to say whether its a good bet.There's some other videos though, like of card counting at blackjack in casinos, another thing that is very tough to do but possible to win at if you do properly",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Slow death",
      "created_time": "July 17, 2022, 09:25:36 PM",
      "body": "Quote from: ronaldo1223 on July 17, 2022, 04:22:43 PMhttps://www.youtube.com/watch?v=ZFCglrxg_9kHey anyone know anything about this guy? Found him on youtube seems to be a good gambling tipster who knows how to beat the casino and sportsbooks. Anyone ever follow him? Thinking of placing a wager on the Warriors based on this advice.Lemme know, thankswell I'll repeat what some have already said and I'll add a few things:1 - this guy from the youtube channel has few subscribers, maybe he's not someone who wants fame and that's why he doesn't try to have many subscribers or maybe what he says doesn't hit anything2 - you have doubts and that's why you posted this here, you don't need to put your money in some game because this guy made a prediction, you can look at the guy's prediction and go watch the game without betting anything, with that you'll see if this guy from the youtube channel got it right or not. and then watch more games than he predicts, but always without placing a bet, do it for at least 10 games and then you can already have the answer you're looking for",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Erdogan",
      "created_time": "July 17, 2022, 09:50:59 PM",
      "body": "Quote from: ronaldo1223 on July 17, 2022, 04:22:43 PM~Writing that someone is a good tipster I can understand, but that someone is able to beat a casino is a dream.I have never heard of this person and I have a very strong impression that this post is not here to actually find out anything, but it is a hidden advertisement. Either way, I'd be very careful.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sterbens",
      "created_time": "July 17, 2022, 10:24:18 PM",
      "body": "Will you be lucky with advice like this every time you gamble?and become his loyal followers? Gambling is not a decision or advice from people who have other goals. Don't let your bets depend on other people. Just visit the casino and place bets wherever you want. Gambling to be enjoyed based on your wishes, because if you lose you will not blame others. What if you follow his gambling advice, then you lose and blame the advice he gave? doesn't that sound childish?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yogee",
      "created_time": "July 17, 2022, 10:36:10 PM",
      "body": "You can just wait and watch for the results if he actually got it right. I would personally give him at least five matches and then compare his win-loss ratio before considering to place bet on his tips. Or you could just try to follow his calls with a few bucks. If his picks wins then you're good. If not then you're still fine since it's only a small amount and you also got to settle your curiosity.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "passwordnow",
      "created_time": "July 17, 2022, 10:46:50 PM",
      "body": "You don't trust a YouTuber with their tips and classify them as a good tipster. Honestly, there have been good tipsters in the forum but also they're not accurate at all times. Some are offering payment in or outside the forum depending on how good they are but I haven't joined any of them. I've read from those who availed such an offer is that they're just like the same us that do predict matches and sometimes not hitting those picks.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "robelneo",
      "created_time": "July 17, 2022, 10:59:04 PM",
      "body": "Quote from: ronaldo1223 on July 17, 2022, 04:22:43 PMhttps://www.youtube.com/watch?v=ZFCglrxg_9kHey anyone know anything about this guy? Found him on youtube seems to be a good gambling tipster who knows how to beat the casino and sportsbooks. Anyone ever follow him? Thinking of placing a wager on the Warriors based on this advice.Lemme know, thanksI don't know this guy he only has 130 subscribers so he is not really that popular There are so many of these on Youtube anyone can put up tips on Youtube and you use the word seems so you are not really that sure how good he is because you have not tested how good he is, the guy is talking about the obvious and based on reason some tipster will also give that kind of advice, nothing really new or great about his advice but why not bet on him to see how good his advice are.Do you check the comments on his other videos if you can see people praising and thanking him.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Vaskiy",
      "created_time": "July 17, 2022, 11:08:54 PM",
      "body": "More number of tipsters can be see around. You can't rely on them for the winning out of casino and sports betting. Everything is upto you, because you spend your money. Whenever there is a win, the tipster will take the credit and this might've happened as a coincidence. If the bet is lost, then these tipsters might give reasons. Doing your own analysis and placing the bet is good.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Slow death",
      "created_time": "July 17, 2022, 11:40:00 PM",
      "body": "Quote from: Chahan on July 17, 2022, 09:28:03 PMQuote from: ronaldo1223 on July 17, 2022, 04:22:43 PMhttps://www.youtube.com/watch?v=ZFCglrxg_9kHey anyone know anything about this guy? Found him on youtube seems to be a good gambling tipster who knows how to beat the casino and sportsbooks. Anyone ever follow him? Thinking of placing a wager on the Warriors based on this advice.Lemme know, thanksI bet this is your own account, haha.Guy has 4 videos and \"seems to be a good tipster\", yeah right.Of course this can be a great possibility, because the guy has few views so it would be very difficult for the OP to find this youtube channel out of coincidence, but I gave the OP the benefit of the doubt and gave him the advice to keep watching each this guy's prediction if the guy really hits something. I personally always prefer to trust myself. I do my analysis and I bet, I don't make bets based on other people's guesses",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}