{
  "id": "topic_5413834",
  "title": "audrey12",
  "author": "audrey12",
  "created_time": "September 17, 2022, 05:32:48 AM",
  "content": "I need some thoughts about this group I've joined a week a go. They are giving free signals for trading and I actually start earning since day 1. Are there really group like this? or Am I on the right trading group. We trade in Batex anf U-koala.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5413834",
  "comments": [
    {
      "author": "mk4",
      "created_time": "September 17, 2022, 05:41:54 AM",
      "body": "You're really unlikely to earn money unless you figure out a strategy to outplay the pump and dumpers. In the first place, no one in the right mind would give out free information if he/she is actually good at his/her craft.Chances are, it's probably just a typical pump and dump group(or a trading group that would soon ask you for \"premium\" membership), and that you've lucked out a few times.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "September 17, 2022, 05:57:16 AM",
      "body": "Quote from: audrey12 on September 17, 2022, 05:32:48 AMI need some thoughts about this group I've joined a week a go. They are giving free signals for trading and I actually start earning since day 1. Are there really group like this? or Am I on the right trading group. We trade in Batex anf U-koala.If your earning then good for you. But I am little but curious if they are really giving accurate and helpful information especially its free. But lets say its free and legit then cool, just consolidate your gains with it and maybe while doing that try to learn on your own so you could also do soms trading without any help and youll probably feel much better eaenung base on your own data interpretation and  chart predictions",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rat03gopoh",
      "created_time": "September 17, 2022, 06:17:39 AM",
      "body": "Quote from: audrey12 on September 17, 2022, 05:32:48 AMWe trade in Batex anf U-koala.You mentioned 2 exchanges I've never heard of, did the signal channel owner just point you to that exchanges? If so, try withdrawing your funds to ensure that you areb't being fooled. Beware of something free.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mindrust",
      "created_time": "September 17, 2022, 06:36:07 AM",
      "body": "\"If you are not paying for the product, then you are the product.\"There is no free lunch. Those groups only have one aim, they want to scam their followers. You may make some money by following their \"signals\" but it is just dumb luck. You may flip a coin and win some money too.If you were losing money, do you think they would give you an excuse? No. They would just close down the group and disappear. Don't fall for this scam.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LogitechMouse",
      "created_time": "September 17, 2022, 06:38:30 AM",
      "body": "Quote from: audrey12 on September 17, 2022, 05:32:48 AMI need some thoughts about this group I've joined a week a go. They are giving free signals for trading and I actually start earning since day 1. Are there really group like this? or Am I on the right trading group. We trade in Batex anf U-koala.Well, as long as you are earning thru their free signals then I think it's good for you.On the other hand, just beware and don't go all in on their free signals because you might lose all of your profits in one signal that they will give. If you can, don't be greedy and don't rely too much on their free signals because there will be a time that those free signals that they're giving will fail and might cause you losses. The 2 exchanges that you shared isn't that familiar to me so maybe both exchanges has low daily trading volume thus, traders can just pump and dump coins out there easier.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dimonstration",
      "created_time": "September 17, 2022, 06:49:10 AM",
      "body": "Quote from: audrey12 on September 17, 2022, 05:32:48 AMI need some thoughts about this group I've joined a week a go. They are giving free signals for trading and I actually start earning since day 1. Are there really group like this? or Am I on the right trading group. We trade in Batex anf U-koala.If you are earning consistent profit for multiple trades using the group signal then its working and you should utilize on it for the time it still working. There’s really a legit signal group existing but you should put extra care on all of your trading and never all in because you never know when shit will gonna happened. I’m not familiar on the exchange that you guys using so I’m more concerned whether you can withdraw your profit instead of worrying to your trade.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "audrey12",
      "created_time": "September 17, 2022, 07:04:09 AMLast edit: September 20, 2022, 01:41:07 AM by Mr. Big",
      "body": "Quote from: rat03gopoh on September 17, 2022, 06:17:39 AMQuote from: audrey12 on September 17, 2022, 05:32:48 AMWe trade in Batex anf U-koala.You mentioned 2 exchanges I've never heard of, did the signal channel owner just point you to that exchanges? If so, try withdrawing your funds to ensure that you areb't being fooled. Beware of something free.Yes, they are actually the one who choose on which exchanges we will trade. In addition to that, I noticed that all coins they were asking us to buy/sell are not presence in other known platforms like Binance..Quote from: dimonstration on September 17, 2022, 06:49:10 AMQuote from: audrey12 on September 17, 2022, 05:32:48 AMI need some thoughts about this group I've joined a week a go. They are giving free signals for trading and I actually start earning since day 1. Are there really group like this? or Am I on the right trading group. We trade in Batex anf U-koala.If you are earning consistent profit for multiple trades using the group signal then its working and you should utilize on it for the time it still working. There’s really a legit signal group existing but you should put extra care on all of your trading and never all in because you never know when shit will gonna happened. I’m not familiar on the exchange that you guys using so I’m more concerned whether you can withdraw your profit instead of worrying to your trade.That is actually my reason of joining since I'm already trading to Binance. I was actually planning to use their signals in other platforms but I find out those signal are only applicable on that particular trading site.I am earning right now. But I'm a bit afraid I might leading to a big failure.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "|MINER|",
      "created_time": "September 17, 2022, 07:26:13 AM",
      "body": "I see that you have posted two consecutively, it is actually outside the rules of the forum, you can quote in one post and reply by this.Now let's talk about those group of crypto trading signal , there are lots of paid  unpaid group like this . But becare full if you are new in crypto trading then my first advise to earn knowledge about analysis then go for trading because most of case these type of signal aren't work and bring a big loss. So it is better to you don't rely on them and trade by your own knowledge otherwise you may have face loss",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rat03gopoh",
      "created_time": "September 17, 2022, 07:55:27 AM",
      "body": "Quote from: audrey12 on September 17, 2022, 07:04:09 AMYes, they are actually the one who choose on which exchanges we will trade. In addition to that, I noticed that all coins they were asking us to buy/sell are not presence in other known platforms like Binance.Ok, that's a scam. period",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MArsland",
      "created_time": "September 17, 2022, 08:31:41 AM",
      "body": "Quote from: audrey12 on September 17, 2022, 05:32:48 AMI need some thoughts about this group I've joined a week a go. They are giving free signals for trading and I actually start earning since day 1. Are there really group like this? or Am I on the right trading group. We trade in Batex anf U-koala.Is the profit factor that you really get from the group and absorb the information carefully? Are you unsure about your own trading abilities?Don't just rely on the signals offered in the group as most of them won't help you much. Try to be more confident and develop your trading skills. Maybe you can enjoy it more. Because if you depend on such a signal group, what will you be proud of yourself?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blockman",
      "created_time": "September 17, 2022, 09:03:40 AM",
      "body": "Quote from: audrey12 on September 17, 2022, 05:32:48 AMI need some thoughts about this group I've joined a week a go. They are giving free signals for trading and I actually start earning since day 1. Are there really group like this? or Am I on the right trading group. We trade in Batex anf U-koala.In which exchange and what coin they've signaled you to buy and you've made a profit? Let us consider if there are groups like that and it's for free then there's no other way that they'll be making money other than from the exchange they've told you to trade and then with the coin they're shilling to you guys. It may be good at the beginning but, you'll see in the midst of it that everyone will be rekt and lose money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Maus0728",
      "created_time": "September 17, 2022, 09:56:13 AM",
      "body": "A simple search about Batex Exchange leads me to ASJ Forex Global Limited which is a company that SEC advised the public to be very careful with.QuoteASJ FOREX GLOBAL LIMITEDThe public is advised NOT TO INVEST or STOP INVESTING in any investment scheme being offered by ASJ FOREX GLOBAL LIMITED - https://www.sec.gov.ph/advisories-2022/asj-forex-global-limited/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zilon",
      "created_time": "September 17, 2022, 10:52:16 AMLast edit: September 17, 2022, 11:02:50 AM by Zilon",
      "body": "Quote from: audrey12 on September 17, 2022, 05:32:48 AMI need some thoughts about this group I've joined a week a go. They are giving free signals for trading and I actually start earning since day 1. Are there really group like this? or Am I on the right trading group. We trade in Batex anf U-koala.Every channel that gives free signals have their motive. If op claims it's paying it's simple enjoy the offer while it last but be vigilant to know exactly when it's turning out to become a scam. Most scammers use different format the try to buy the trust of their to be victims and once the succeed they strike. Quote from: audrey12 on September 17, 2022, 07:08:48 AMI am earning right now. But I'm a bit afraid I might leading to a big failure.They are providing you with free signals and at the same time limiting the tokens you trade and still choose a platform for your trade and all this is without any incentive, it's obvious this will not end well. For me it's best you quit",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "palle11",
      "created_time": "September 17, 2022, 10:55:30 AM",
      "body": "Quote from: audrey12 on September 17, 2022, 07:08:48 AMThat is actually my reason of joining since I'm already trading to Binance. I was actually planning to use their signals in other platforms but I find out those signal are only applicable on that particular trading site.If you don't find the pair that the group has been recommending, be sure one day you won't find your deposit you have on the site again. This may be an exit scam and the signs are clear for you to figure out yourself.Quote from: audrey12 on September 17, 2022, 07:08:48 AMI am earning right now. But I'm a bit afraid I might leading to a big failure.Stay that way as being afraid should tell you something is not right. If you are afraid then stay out because your mind is not at peace with what you are doing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Potato Chips",
      "created_time": "September 17, 2022, 11:59:46 AM",
      "body": "Relying on signals + using no one has heard of exchanges is the perfect combination to lose money since they're both likely to be shitting on you.Keep in mind that there's a popular fake exchange scam where scammers makes made up profits to keep their victims trapped. From your posts, this could be the case for you... I suggest withdrawing your funds ASAP. Who knows, it could still work. Good luck op! let's stick with reputable exchanges",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "danherbias07",
      "created_time": "September 17, 2022, 12:14:31 PM",
      "body": "Haven't heard of those exchange that was mentioned. Try to withdraw in a small amount and let's see if you can get out. If you can then try at a higher amount, if you can't then there goes the problem. Scammers are wise now. They will let you out with little amount so that you would think it's real. Once their victim thinks they have a good reputation then they start adding more funds to maximize their profits using the given signals. They do this because the old school strategy is not working anymore which is asking for fees after the signal works.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "goinmerry",
      "created_time": "September 17, 2022, 02:05:59 PM",
      "body": "Quote from: audrey12 on September 17, 2022, 05:32:48 AMI need some thoughts about this group I've joined a week a go. They are giving free signals for trading and I actually start earning since day 1. Are there really group like this? or Am I on the right trading group. We trade in Batex anf U-koala.As long as you are not paying for it, then you should be fine. In most cases, trading groups are giving free signals then, later on, they will now ask you for a paid subscription for you to be kept in that group. You don't need trading signals as you can learn trading from yourselves.Anyways, I'm not aware of those trading platforms you have mentioned, Batex and U-koala. Are those really legit based on your view?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "chaser15",
      "created_time": "September 17, 2022, 02:13:00 PM",
      "body": "Quote from: audrey12 on September 17, 2022, 05:32:48 AMI need some thoughts about this group I've joined a week a go. They are giving free signals for trading and I actually start earning since day 1. Are there really group like this? or Am I on the right trading group. We trade in Batex anf U-koala.Just be vigilant. Since you are earning, for now, take advantage of it. Don't ever pay for trading signals and put that in your mind.But I am more concerned about those exchanges you just told us about. Did a quick search and these platforms are quite new. Why does the group you belong to choose non-famous trading exchanges as your trading place instead of those big and popular already like Binance?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "michellee",
      "created_time": "September 17, 2022, 02:42:04 PM",
      "body": "Quote from: audrey12 on September 17, 2022, 05:32:48 AMI need some thoughts about this group I've joined a week a go. They are giving free signals for trading and I actually start earning since day 1. Are there really group like this? or Am I on the right trading group. We trade in Batex anf U-koala.If you can earn from that free signal group, you can go ahead but be careful because you don't know how long they will offer the free signals. I don't know if trading groups that share free signals exist and provide free signals without any other intention. As far as I know, later, they will offer a paid signal package where you have to pay a certain amount of money to get more and more reliable signals.As for a place to trade, I wonder why you don't trade on the well-known Binance but instead choose the exchange. But maybe you have other reasons but whatever the place of exchange is, you also have to be careful and don't use money that you can't afford to lose.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}