{
  "id": "topic_5457103",
  "title": "Forever101",
  "author": "Forever101",
  "created_time": "June 21, 2023, 02:25:00 PM",
  "content": "As we all know that bitcoins is best productive for investors when they go for long term investment, what do you think about  investors who are affected by the economic situation of their country. should such person keep holding even when things are upside down knowing fully that the only hope is to sell their bitcoins even when it has not yield any substantial profit so that they can meet up with life. Share your thought as regarding this matter.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5457103",
  "comments": [
    {
      "author": "Charles-Tim",
      "created_time": "June 21, 2023, 02:37:44 PMLast edit: June 21, 2023, 04:41:01 PM by Charles-Tim",
      "body": "I guess you are indirectly referring to Nigeria, because naira that was around $150 ₦150 in 8 years ago is around $752 ₦752 today, despite that United States dollars depreciated in price. The better options that Nigerians are going for is domiciliary account and the use of cryptocurrencies, predominantly bitcoin. Bitcoin has been the best in the crypto market, while most altcoins have shown how gambling they are to investors. Bitcoin has bull and bear time which some experienced people can speculate on. Holding bitcoin in a time the price is low and wait for all-time-high and then convert back to naira. Naira continue to depreciate. This is the reason people prefer to convert to foreign currencies like United States dollars, pound sterling or euro. This can be done with the use of domiciliary account. The restriction cause by the suspended CBN governor has been removed, like having certain amount that you can deposit. Some people have preferred to go for stable coins like USDT, USDC, USDP, TUSD, BUSD, DIA and others, which their value is backed by United States dollar. It is good because of conveniences, but having your money directly in domiciliary account is safer than coins pegged with dollar. Dollar, pounds sterling and euro price can depreciate too, but they can not be as worse as currencies in developing nations.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Doan9269",
      "created_time": "June 21, 2023, 03:54:30 PM",
      "body": "Quote from: Forever101 on June 21, 2023, 02:25:00 PMAs we all know that bitcoins is best productive for investors when they go for long term investment, what do you think about  investors who are affected by the economic situation of their country. should such person keep holding even when things are upside down knowing fully that the only hope is to sell their bitcoins even when it has not yield any substantial profit so that they can meet up with life. Share your thought as regarding this matter.If you're going to be a good bitcoin holder, then you must learn to develop a better confidence more than ever before and had earlier good understanding of what you're holding, why you're holding it and so on, you don't have to be moved by what the economical market says because the bitcoin you're investing is not dependent on any of thos crisis ongoing, all you need is to buy the dip, save keep in your personal decentralized wallet, avoid uncertainties and news for fear of missing out.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gozie51",
      "created_time": "June 21, 2023, 04:13:51 PM",
      "body": "Quote from: Forever101 on June 21, 2023, 02:25:00 PMwhat do you think about  investors who are affected by the economic situation of their country. should such person keep holding even when things are upside down knowing fully that the only hope is to sell their bitcoins even when it has not yield any substantial profit so that they can meet up with life. Share your thought as regarding this matter.I think this your question dey straight forward and no need to dey bend on it. You simply dey ask say person wey no get cash and hunger dey wire him or him family and the person get btc wey dey one place for him wallet whether exchange wallet or him personal wallet and him dey hodl am say make d tin rise before him go sell am abi? My guy, I go sell the btc or part of it to take care of the issue especially if na health wahala. And if God provide for me and go still invest, bitcoin investment no dey finish.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptoHeadlineNews",
      "created_time": "June 21, 2023, 04:22:20 PM",
      "body": "Quote from: Charles-Tim on June 21, 2023, 02:37:44 PMI guess you are indirectly referring to Nigeria, because naira that was around $150 in 8 years ago is around $752 today,Seeing this statement just made me laugh my own Oga \"Charles Tim\",  because you made mention of Naira and went about using a dollar sign for the two figures (#150 and #752), which I'm sure is a typographical error.So in regards to O.P's question, I will start by saying that \"investing is for the living\", that is, it is only people who are alive that can invest, the dead can never invest, and as such, if you happens to encounter difficult hard times and your Bitcoin is your only means of survival, please sell, buy food and eat, because it's only the living that could invest, because if you can't today, there will always be another opportunity, because a wise man once said \"Only invest with an amount you can always afford to lose\" and it could also mean \"Only invest with an amount of fund you know you can always do without\", and not your entire capital. Because only if had you invested with an amount of money you can always do without, I'm sure you should have had some funds to take care of tough times like this.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "June 21, 2023, 04:39:07 PM",
      "body": "Quote from: CryptoHeadlineNews on June 21, 2023, 04:22:20 PMSeeing this statement just made me laugh my own Oga \"Charles Tim\",  because you made mention of Naira and went about using a dollar sign for the two figures (#150 and #752), which I'm sure is a typographical error.My bad! Thanks for the correction. Edited. I thought that I used ₦.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Forever101",
      "created_time": "June 21, 2023, 07:26:58 PM",
      "body": "Quote from: Charles-Tim on June 21, 2023, 02:37:44 PMI guess you are indirectly referring to Nigeria, because naira that was around $150 ₦150 in 8 years ago is around $752 ₦752 today, despite that United States dollars depreciated in price. The better options that Nigerians are going for is domiciliary account and the use of cryptocurrencies, predominantly bitcoin. Bitcoin has been the best in the crypto market, while most altcoins have shown how gambling they are to investors. Bitcoin has bull and bear time which some experienced people can speculate on. Holding bitcoin in a time the price is low and wait for all-time-high and then convert back to naira. Naira continue to depreciate. This is the reason people prefer to convert to foreign currencies like United States dollars, pound sterling or euro. This can be done with the use of domiciliary account. The restriction cause by the suspended CBN governor has been removed, like having certain amount that you can deposit. Some people have preferred to go for stable coins like USDT, USDC, USDP, TUSD, BUSD, DIA and others, which their value is backed by United States dollar. It is good because of conveniences, but having your money directly in domiciliary account is safer than coins pegged with dollar. Dollar, pounds sterling and euro price can depreciate too, but they can not be as worse as currencies in developing nations.This is great sir, please can you give me steps to creating a domiciliary account?. This will save me the stress of confuse Google searched results .",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "June 21, 2023, 07:56:37 PM",
      "body": "Quote from: Forever101 on June 21, 2023, 07:26:58 PMThis is great sir, please can you give me steps to creating a domiciliary account?. This will save me the stress of confuse Google searched results .You will go to the commercial bank that you have an account with to create domiciliary account. But you can create it on some commercial bank's online banking. The inconveniences is the reason some people have preferred stable coins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Merit.s",
      "created_time": "June 21, 2023, 09:57:46 PM",
      "body": "The truth be say na bad thing say you dey hungry and you get money wet you put for investment wet never mature for profit. The only option na to sell part of your coins take chop so that you go fit live to see bitcoin price rise and maybe also follow make little profit later. Na who dey alive go live to enjoy tomorrow. If you no won change your bitcoin use take care of yourself,what If bitcoin price go down pass before. You go let hunger kill you,remember say health is wealth. This is why we are always advised to only use funds that we can afford to lose to invest and not funds for important things.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptopreneurBrainboss",
      "created_time": "June 21, 2023, 10:44:15 PM",
      "body": "Quote from: Forever101 on June 21, 2023, 02:25:00 PMAs we all know that bitcoins is best productive for investors when they go for long term investment, what do you think about  investors who are affected by the economic situation of their country. should such person keep holding even when things are upside down knowing fully that the only hope is to sell their bitcoins even when it has not yield any substantial profit so that they can meet up with life. Share your thought as regarding this matter.Bitcoin isn't a business no dey expect passive income from am, it's an investment and investment are to be done with spare chas that you won't need urgently. If you're using funds that'll require you to sell your investment prematurely then you're investing wrongly. Funds use for investment shoudn't be emergency funds but funds you won't need in a very long time. When you invest like this you no go get all this problem wey you dey talk about. In no life threatening condition should you sell your investment and no dey put yourself in situations why go make you sell your investment when the time wey you plan for the investment to take mature never reach, you dey program your mindset wrongly by so doing. Invest as your pockets reach, if na 10k wey you go fit keep aside and use am do investment wey be say you no go reason am until e dun mature then use only 10k enter market. No go use 100k wey e be say immediatetly you enter any small money problem you dun rush go sell. You no dey do anybody na only yourself wey you dey do. The condition of the country hard no be lie but try use your hand so something for yourself commot eye for your investment because when that investment mature for future na you go still enjoy am.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Stable090",
      "created_time": "June 21, 2023, 11:33:35 PM",
      "body": "Quote from: Forever101 on June 21, 2023, 02:25:00 PMAs we all know that bitcoins is best productive for investors when they go for long term investment, what do you think about  investors who are affected by the economic situation of their country. should such person keep holding even when things are upside down knowing fully that the only hope is to sell their bitcoins even when it has not yield any substantial profit so that they can meet up with life. Share your thought as regarding this matter.If we dey plan invest in bitcoin, make we ready to hold am for long term, but if we come get problem, e no mean say make we no sell bitcoin use to money solve the problem.  Make we talk true ooo, investment no be by force, and no suffer yourself because you self wan invest, I know say investment good ooo but na person wey don chop belle full na him dey invest. You get money for bitcoin and your family dey suffer, you better go commot your money and use am take care of yourself even if you dey for little loss, if you see say wetin u wan use am do worth am, then make u sell am, if you later get money wey you know say you no go need for that moment then you can invest back, but no put yourself and your family members for hunger because you wan invest in bitcoin ooo.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "omgitsmehehe",
      "created_time": "June 22, 2023, 10:58:29 PM",
      "body": "Quote from: Forever101 on June 21, 2023, 02:25:00 PMAs we all know that bitcoins is best productive for investors when they go for long term investment, what do you think about  investors who are affected by the economic situation of their country. should such person keep holding even when things are upside down knowing fully that the only hope is to sell their bitcoins even when it has not yield any substantial profit so that they can meet up with life. Share your thought as regarding this matter.Before someone should start investing in Bitcoin, such person should know if he be long term or short term investor, crypto as a whole is not for the weak or a money earn quick platform. If their is a a need for him to sell off his assets for food, that's no a problem, if holding is good for him while he had other source of income, that's also fine. But I would assured you that, bitcoin is not something you buy and get rich that very moment, nah, that's false.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Doan9269",
      "created_time": "June 23, 2023, 07:41:54 AM",
      "body": "Quote from: omgitsmehehe on June 22, 2023, 10:58:29 PMQuote from: Forever101 on June 21, 2023, 02:25:00 PMAs we all know that bitcoins is best productive for investors when they go for long term investment, what do you think about  investors who are affected by the economic situation of their country. should such person keep holding even when things are upside down knowing fully that the only hope is to sell their bitcoins even when it has not yield any substantial profit so that they can meet up with life. Share your thought as regarding this matter.Before someone should start investing in Bitcoin, such person should know if he be long term or short term investor, crypto as a whole is not for the weak or a money earn quick platform. If their is a a need for him to sell off his assets for food, that's no a problem, if holding is good for him while he had other source of income, that's also fine. But I would assured you that, bitcoin is not something you buy and get rich that very moment, nah, that's false.Yes, try to take an analysis on your plan wether to go short or long, try to study the bitcoin market price over the years, apply some learning strategies to trading, get used to some of its indicators, speculate on the price on weekly candles on chart, try to learn about this trading strategies and understand them, habe a little experience in using of of them before concluding wether to to for any of your choice base on experience.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SmartGold01",
      "created_time": "June 23, 2023, 08:54:32 AM",
      "body": "Quote from: Forever101 on June 21, 2023, 02:25:00 PMAs we all know that bitcoins is best productive for investors when they go for long term investment, what do you think about  investors who are affected by the economic situation of their country. should such person keep holding even when things are upside down knowing fully that the only hope is to sell their bitcoins even when it has not yield any substantial profit so that they can meet up with life. Share your thought as regarding this matter.As investor you should know that it's your duty to have some spare cash with you after making your investment, reason because you need to guide your investment till maturity and not by terminating it half way. Most investors always provides a backup plans for them selves meaning they won't go after they have invested in bitcoin because we all believed than for someone to make profits from bitcoin it requires at least holding it for about 1 years or possible 4 years times to experience the recycling period known to be the bitcoin halving.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "letteredhub",
      "created_time": "June 24, 2023, 10:59:13 AM",
      "body": "To be a bitcoin hold for a long term period of time isn't an easy decision to keep as on the long run you might be tempted by difficult situations that needs money to solve when it arises and that's why it good to have a financial contingency plan should in case you find yourself in a situation that's demanding of you to withdraw from your holding. But so far as the economic hardship doesn't kill you, you just have to endure having in mind what's ahead as a profit to you if you keep holding.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "omgitsmehehe",
      "created_time": "June 24, 2023, 11:49:36 PM",
      "body": "Quote from: Doan9269 on June 23, 2023, 07:41:54 AMYes, try to take an analysis on your plan wether to go short or long, try to study the bitcoin market price over the years, apply some learning strategies to trading, get used to some of its indicators, speculate on the price on weekly candles on chart, try to learn about this trading strategies and understand them, habe a little experience in using of of them before concluding wether to to for any of your choice base on experience. Yeah you are right but do you think a long term investor should know all these indicators and analysis, to me this things no dey necessary for long term investors, because they are only waiting for Bull run to occur while they take their profits, daily traders are the ones wey know all these analysis for their daily earnings, I be long term investor for real but got no knowledge about all these, my holding for long works best for me far more better than people wey sabi all these chart stuffs, that's it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blackened515",
      "created_time": "June 25, 2023, 07:26:05 PM",
      "body": "Quote from: letteredhub on June 24, 2023, 10:59:13 AMTo be a bitcoin hold for a long term period of time isn't an easy decision to keep as on the long run you might be tempted by difficult situations that needs money to solve when it arises and that's why it good to have a financial contingency plan should in case you find yourself in a situation that's demanding of you to withdraw from your holding. But so far as the economic hardship doesn't kill you, you just have to endure having in mind what's ahead as a profit to you if you keep holding.Endurance in all difficult conditions, getting back on our feet and collecting the necessary profits. Everything in the space is significant; just because a project isn't pumping right now does not mean it won't in the future; trust me, these projects have their own timetable. I'm not going to touch my bitcoin until I make 30 times the money I put into the enterprise. I know we confront crucial obstacles every day, but it doesn't make us abandon the advantageous hope we had for tomorrow; no one knows if bitcoin will dump or pump, but it's worth taking the risks; bitcoin remains the top project that deserves high focus from investors.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Marykeller",
      "created_time": "June 27, 2023, 05:51:52 PM",
      "body": "As we kukuma know sae bitcoin is best productive if we are to hodl for long-term goals. Why then will such a person sell em bitcoin holding along the line due economic situation? Em no think about the economic situation wey go arise during the time of investment of bitcoin? Was he carried away by the future profits that bitcoin brings and forget to invest with em spare money and have some cash saved in the bank because of the matter of urgency? Em forget all these things and went ahead to have Bitcoin as an investment tool. Now wey things don turn upside down, em wan sell em bitcoin asset as the only option available for him. Anyway, make em sell am sha because em get as em dey for peso to advised am not to sell em bitcoin since na bitcoin be em last hope. But next time, make such a peso no carry all em resources put for bitcoin and forget sae life urgent matter go fit arise in the future wey be sae the cash wey em hold for hand em go use am solve the urgent matter. investing in bitcoin na with spare cash. If an investor no fit invest with spare em money, make avoid entering the crypto market because of issues of selling bitcoin at a loss price",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zanab247",
      "created_time": "June 27, 2023, 06:57:34 PM",
      "body": "That is why dey always advise us not to invest what we will not afford to lose in BTC investment. If you don't have any way to solve the situation at the moment, you can sell your BTC to save your life because another opportunity will surely come that will make you not to allow mistakes to repeat itself again. Long term holding required a strong mind because, I have heard about some BTC holders who hold BTC more than 5 or 6 before dey are satisfied with the current market few months ago to earn a huge amount of money because, he stood on his ground that no condition that will make him to sell BTC until his price desire come to pass.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}