{
  "id": "topic_5451350",
  "title": "Findingnemo",
  "author": "Findingnemo",
  "created_time": "May 05, 2023, 01:03:42 PM",
  "content": "Sorry for another topic about the recent issue going related to bitcoin network congestion but I really want to know that Bitcoin ordinals so called NFTs is really going to change the fee required for the transaction in the future?Because I didn't witness such kind of clog since 2017 but by that time there is no segwit, exchanges are clogging the network purposely and so on but later for so many years the fee issue isn't really there but all of a sudden we have to pay over 100 sats for over transaction to get into the block may create a bad image and it will create the FUD and may initiate the price drop.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5451350",
  "comments": [
    {
      "author": "tbct_mt2",
      "created_time": "May 05, 2023, 01:35:20 PM",
      "body": "Quote from: Findingnemo on May 05, 2023, 01:03:42 PMSorry for another topic about the recent issue going related to bitcoin network congestion but I really want to know that Bitcoin ordinals so called NFTs is really going to change the fee required for the transaction in the future?There will be more changes and upgrades for Bitcoin. Don't worry.Before any upgrade comes, make your plans to consolidate your small inputs and make your necessary transactions whenever fee rate is cheap for you.QuoteBecause I didn't witness such kind of clog since 2017 but by that time there is no segwit, exchanges are clogging the network purposely and so on but later for so many years the fee issue isn't really there but all of a sudden we have to pay over 100 sats for over transaction to get into the block may create a bad image and it will create the FUD and may initiate the price drop.Segwit did not have good adoption since its appearance in 2017. I recalled that Segwit only started to use more since 2019 and at least back in that year, some campaign managers in bitcointalk began to force their participants to use Segwit address for receiving payments.However, Segwit adoption globally increased one or two years after what happened in Bitcointalk.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "logfiles",
      "created_time": "May 05, 2023, 01:39:21 PM",
      "body": "It's not a big worry at the moment. Transaction fee rates still drop to even below 10 sats/vbyte if you are not in a hurry. Guess we will wait and see what happens in a bull market, but I think these NFTs will die a natural death once people realize that they are useless as ICOs, STOs, IDOs, IEOs were.It's just a matter of time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FatFork",
      "created_time": "May 05, 2023, 03:47:59 PM",
      "body": "I believe that the current congestion issue is a minor setback that the Bitcoin network can easily overcome, given its track record of resilience in the past. I'm not worried about the impact of Bitcoin ordinals on transaction fees in the long run. However, I do think that NFTs are just a passing fad and should not have been allowed on the Bitcoin network in the first place. Nonetheless, I'm confident that this trend will eventually die down and be replaced by more useful and sustainable use cases.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaveF",
      "created_time": "May 05, 2023, 04:15:46 PM",
      "body": "Quote from: logfiles on May 05, 2023, 01:39:21 PMIt's not a big worry at the moment. Transaction fee rates still drop to even below 10 sats/vbyte if you are not in a hurry. Guess we will wait and see what happens in a bull market, but I think these NFTs will die a natural death once people realize that they are useless as ICOs, STOs, IDOs, IEOs were.It's just a matter of time.Exactly. Fees have spiked before, and have always come down.When the NFT insanity hit ETH it was the same story.People are spending a fortune on them now so adding a bunch of money to the price for TX fees is really not a big deal.Eventually the idiots who get their financial advice from Twitter / YouTube / Reddit / and so on will go off to the next thing and tx fess will drop back to normal. As has been said a few posts up and many times over the last few weeks. If you are not in a rush, just set a 10 sat / VB and it will probably go through in 24 to 28 hours.-Dave",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gunhell16",
      "created_time": "May 05, 2023, 04:38:18 PM",
      "body": "Quote from: Findingnemo on May 05, 2023, 01:03:42 PMSorry for another topic about the recent issue going related to bitcoin network congestion but I really want to know that Bitcoin ordinals so called NFTs is really going to change the fee required for the transaction in the future?Because I didn't witness such kind of clog since 2017 but by that time there is no segwit, exchanges are clogging the network purposely and so on but later for so many years the fee issue isn't really there but all of a sudden we have to pay over 100 sats for over transaction to get into the block may create a bad image and it will create the FUD and may initiate the price drop.Almost all of us here are shocked by this incident because of the ordinal nature of Bitcoin or NFT on the blockchain. But from what I see, it seems like it's only an experimental or trial, so it doesn't seem like it's because we're already affected by the transaction fee.Maybe everything will be fixed like what happened with Ethereum before where the fees were too high but later it also decreased I hope it won't take that long to fix this problem.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Uruhara",
      "created_time": "May 05, 2023, 05:04:05 PM",
      "body": "I was quite surprised by the high network fees when I tried to send my bitcoins. it's 2x bigger since I last shipped it last week.can anyone explain the reason behind the current skyrocketing network fees?but 2 days ago i tried to transmit by changing the network fee to the lowest level. it worked just that it took more time to wait for the confirmation to finish more than 24 hours to finish.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tabas",
      "created_time": "May 05, 2023, 05:26:13 PM",
      "body": "Quote from: Findingnemo on May 05, 2023, 01:03:42 PMSorry for another topic about the recent issue going related to bitcoin network congestion but I really want to know that Bitcoin ordinals so called NFTs is really going to change the fee required for the transaction in the future?Because I didn't witness such kind of clog since 2017 but by that time there is no segwit, exchanges are clogging the network purposely and so on but later for so many years the fee issue isn't really there but all of a sudden we have to pay over 100 sats for over transaction to get into the block may create a bad image and it will create the FUD and may initiate the price drop.I thought that by today the fees are going to be much lesser than yesterday but it doesn't look like that. As of checking, the amount for the fees set on the mempool is more expensive right now, yes today it's much more expensive. IIRC, the fee during 2017 bull run, it was more than this.But during that time, it was bull run and right now it is not yet bull run. And those that don't want to have their transaction take long, you have no choice but to pay for the suggested fee as priority.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Aanuoluwatofunmi",
      "created_time": "May 05, 2023, 05:30:38 PM",
      "body": "Quote from: Findingnemo on May 05, 2023, 01:03:42 PMSorry for another topic about the recent issue going related to bitcoin network congestion but I really want to know that Bitcoin ordinals so called NFTs is really going to change the fee required for the transaction in the future?You need to understand that nothing is perman in life as change, this was not in place before now that everyone start to experience bitcoin ordinals, maybe anything new can comes up later to change the whole story again, but now we can still work our way out already with the help of tracking the mempool to when it's less congested for a lower transaction fee, which in most cases comes in during the weekends.Quote from: Findingnemo on May 05, 2023, 01:03:42 PMBecause I didn't witness such kind of clog since 2017 You could relate this to a number of challenges before the introduction of lightning network and the reason why the LN got in place, there will always be a solution to every challenges in due time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ever-young",
      "created_time": "May 05, 2023, 05:44:53 PM",
      "body": "Quote from: logfiles on May 05, 2023, 01:39:21 PMbut I think these NFTs will die a natural death once people realize that they are useless as ICOs, STOs, IDOs, IEOs were.It's just a matter of time.People just seems to be running into any new trend on the crypto space not realizing how perishable those new hype can be, I can recall when all this NFT of a thing started some few sold for millions of dollars which I'm not even sure how much is their market worth currently now again. Most people who are really diving into this NFT of a thing under Bitcoin are people I believe they think they have seen greater opportunity to make few dollars from recent trend which sometimes end really negative for them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wakate",
      "created_time": "May 05, 2023, 06:57:00 PM",
      "body": "Quote from: Uruhara on May 05, 2023, 05:04:05 PMI was quite surprised by the high network fees when I tried to send my bitcoins. it's 2x bigger since I last shipped it last week.can anyone explain the reason behind the current skyrocketing network fees?but 2 days ago i tried to transmit by changing the network fee to the lowest level. it worked just that it took more time to wait for the confirmation to finish more than 24 hours to finish. This is really devastating and I still don't know how long this will take for the network issue to be back to the normal fee. I tried sending some unit of Bitcoin and I was so surprised the amount of money they charged me for fee. The fee is too exorbitant for us to be spending to send just small about of Bitcoin when it's not Ethereum Blockchain. I just hope this fee will reduce as soon as possible because a lot of newbies have beginning to be having another strange feeling if whether not to invest in Bitcoin switching altcoin since the network fee has skyrocket.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "darkangel11",
      "created_time": "May 05, 2023, 07:58:55 PM",
      "body": "There's no clog, only a lot of people trying to outbid each other for the first block transaction. Every time this happens there's a spike in fees, but there are many ways to go around it, or simply ignore it. One of them is to use LN, the other is to opt out of the race and pay much less fee than required to be in the fist block. I never overpay and it's completely fine for me to wait 30min. Just going from 0 to 25 min lowers your fee by 40%. 25 min is nothing, I can make myself lunch in that time, or take a dump and a shower afterwards and be back to see my TX confirmed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "May 05, 2023, 08:38:49 PM",
      "body": "Quote from: darkangel11 on May 05, 2023, 07:58:55 PMThere's no clog, only a lot of people trying to outbid each other for the first block transaction. Every time this happens there's a spike in fees, but there are many ways to go around it, or simply ignore it. One of them is to use LN, the other is to opt out of the race and pay much less fee than required to be in the fist block. I never overpay and it's completely fine for me to wait 30min. Just going from 0 to 25 min lowers your fee by 40%. 25 min is nothing, I can make myself lunch in that time, or take a dump and a shower afterwards and be back to see my TX confirmed. telling people bitcoin is completely fine to wait longer.. and then advertise people should instead use another network. is not a great way to promote bitcoinimagine if my bank (it does instant transfers uk-uk and uk-eu) told me that instead of being in and out of the bank branch in 10 minutes i should go home take a dump, have a shower and come back later to check the wire transfer complete.. id change my bankthere are reasons people hate banks already. and your advocating that bitcoin should be a high fee system of delayed transfers.. and then advertise some other system .. shameful mindset you havei guess your not a bitcoiner anymore",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jating",
      "created_time": "May 05, 2023, 08:44:11 PM",
      "body": "As others have said, if you are not in hurry then you can still used a lowest fee and it can be confirmed within the day.I know that we are not getting used to it, the last time this happen to us is 2017. And with the whole ordinals spamming, sooner or later it will die down and fees going back to normal again. They can't sustain that run for a long time. Just monitor mempool and see what will be the best time for you to do your transaction.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lonerangerh",
      "created_time": "May 05, 2023, 08:54:48 PM",
      "body": "Quote from: Findingnemo on May 05, 2023, 01:03:42 PMSorry for another topic about the recent issue going related to bitcoin network congestion but I really want to know that Bitcoin ordinals so called NFTs is really going to change the fee required for the transaction in the future?Because I didn't witness such kind of clog since 2017 but by that time there is no segwit, exchanges are clogging the network purposely and so on but later for so many years the fee issue isn't really there but all of a sudden we have to pay over 100 sats for over transaction to get into the block may create a bad image and it will create the FUD and may initiate the price drop.Back in the day when Bitcoin was not very popular and NFT was not around, there weren't many users, so the fees were low and there were no network congestions.But now that the popularity of Bitcoin and NFTs has grown tremendously, there are a lot more people searching for and using them, which is causing the network to become congested.Moreover, new projects that mint NFTs or offer presales on the first-come, first-served basis require people to set high gas fees to increase their chances of getting a slot.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Baofeng",
      "created_time": "May 05, 2023, 09:13:00 PM",
      "body": "Quote from: Findingnemo on May 05, 2023, 01:03:42 PMSorry for another topic about the recent issue going related to bitcoin network congestion but I really want to know that Bitcoin ordinals so called NFTs is really going to change the fee required for the transaction in the future?Because I didn't witness such kind of clog since 2017 but by that time there is no segwit, exchanges are clogging the network purposely and so on but later for so many years the fee issue isn't really there but all of a sudden we have to pay over 100 sats for over transaction to get into the block may create a bad image and it will create the FUD and may initiate the price drop.Who wouldn't worry? I mean it's alarming to see the network again being congested. However, we don't known if Bitcoin ordinals are going to change the network fee. We all know that NFT is hype, just like the rest of what we have seen before. Eventually, it will die down a natural death.2017 is different though, as far as I can remember there were network spams early that year and then the congestion was due to the bull run itself. And most likely there are a lot of us here who are newbie that time and we don't know what's happening. So we will see how we are going to adapt in the next bull run if Ordinals are still are thing that time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "serjent05",
      "created_time": "May 05, 2023, 09:13:48 PM",
      "body": "Quote from: Findingnemo on May 05, 2023, 01:03:42 PMSorry for another topic about the recent issue going related to bitcoin network congestion but I really want to know that Bitcoin ordinals so called NFTs is really going to change the fee required for the transaction in the future?We do not need the wait for the future, the Bitcoin Ordinals had been affecting the network traffic and the transaction fee.  It is too obvious that the Bitcoin Ordinals is creating a problem to the regular users.Quote from: Findingnemo on May 05, 2023, 01:03:42 PMBecause I didn't witness such kind of clog since 2017 but by that time there is no segwit, exchanges are clogging the network purposely and so on but later for so many years the fee issue isn't really there but all of a sudden we have to pay over 100 sats for over transaction to get into the block may create a bad image and it will create the FUD and may initiate the price drop.I think the Bitcoin network become smooth after the implementation of Segwit and the lightning network.  There are seldom cases like this until Bitcoin Ordinal is introduced and I agree, this will create a negative sentiment on the Bitcoin market because users who are not used to this kind of problem will get stressed and will look for alternatives just like the previous year when we experience the same kind of problem.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Findingnemo",
      "created_time": "May 06, 2023, 03:12:10 PM",
      "body": "Quote from: logfiles on May 05, 2023, 01:39:21 PMIt's not a big worry at the moment. Transaction fee rates still drop to even below 10 sats/vbyte if you are not in a hurry. Guess we will wait and see what happens in a bull market, but I think these NFTs will die a natural death once people realize that they are useless as ICOs, STOs, IDOs, IEOs were.It's just a matter of time.The hype of NFT is already over and particularly in this period the blockchain is under attack intentionally in my opinion. Even though I thought the fee will drop after fee days but throughout the week it is getting higher along with the number of unconfirmed transactions. As of now, we have over 300K transactions but the time between each block is 10 minutes so there is no worry about the loss of miners but the network is being clogged and that is the reality, hopefully it will be resolved soon.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "be.open",
      "created_time": "May 06, 2023, 03:26:46 PM",
      "body": "Quote from: franky1 on May 05, 2023, 08:38:49 PMQuote from: darkangel11 on May 05, 2023, 07:58:55 PMThere's no clog, only a lot of people trying to outbid each other for the first block transaction. Every time this happens there's a spike in fees, but there are many ways to go around it, or simply ignore it. One of them is to use LN, the other is to opt out of the race and pay much less fee than required to be in the fist block. I never overpay and it's completely fine for me to wait 30min. Just going from 0 to 25 min lowers your fee by 40%. 25 min is nothing, I can make myself lunch in that time, or take a dump and a shower afterwards and be back to see my TX confirmed. telling people bitcoin is completely fine to wait longer.. and then advertise people should instead use another network. is not a great way to promote bitcoinimagine if my bank (it does instant transfers uk-uk and uk-eu) told me that instead of being in and out of the bank branch in 10 minutes i should go home take a dump, have a shower and come back later to check the wire transfer complete.. id change my bankthere are reasons people hate banks already. and your advocating that bitcoin should be a high fee system of delayed transfers.. and then advertise some other system .. shameful mindset you havei guess your not a bitcoiner anymoreIt would be great if there was a censorship mechanism in the bitcoin network that sorted all transactions in the mempool into those that Franky would like and those that Franky would not like, and would allow miners to confirm only the first ones. But no, wait, it's some kind of crap.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "May 06, 2023, 03:50:51 PM",
      "body": "Quote from: franky1 on May 05, 2023, 08:38:49 PMQuote from: darkangel11 on May 05, 2023, 07:58:55 PMThere's no clog, only a lot of people trying to outbid each other for the first block transaction. Every time this happens there's a spike in fees, but there are many ways to go around it, or simply ignore it. One of them is to use LN, the other is to opt out of the race and pay much less fee than required to be in the fist block. I never overpay and it's completely fine for me to wait 30min. Just going from 0 to 25 min lowers your fee by 40%. 25 min is nothing, I can make myself lunch in that time, or take a dump and a shower afterwards and be back to see my TX confirmed. telling people bitcoin is completely fine to wait longer.. and then advertise people should instead use another network. is not a great way to promote bitcoinLN is not even going to help in this scenario as even the L1 contact points are swamped with transactions, so on-chain settlement will take a long an unknown amount of time.Quote from: serjent05 on May 05, 2023, 09:13:48 PMQuote from: Findingnemo on May 05, 2023, 01:03:42 PMSorry for another topic about the recent issue going related to bitcoin network congestion but I really want to know that Bitcoin ordinals so called NFTs is really going to change the fee required for the transaction in the future?We do not need the wait for the future, the Bitcoin Ordinals had been affecting the network traffic and the transaction fee.  It is too obvious that the Bitcoin Ordinals is creating a problem to the regular users.Ordinals are not the reason for the current congestion, before BRC20 it was normal for transaction fees to be 20/30 sats per byte, and now we all know how exorbitant the fees are now. BRC20 is using the same protocol loophole as Ordinals but it is not using any Ordinals software.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}