{
  "id": "topic_5397737",
  "title": "TheGhostMan",
  "author": "TheGhostMan",
  "created_time": "May 08, 2022, 12:45:07 AMLast edit: May 08, 2022, 01:00:20 AM by TheGhostMan",
  "content": "QuoteThe US remains a world leader in the regulation and adoption of the cryptocurrency industry, but the Stablecoin TRUST Act may set some barriers for newcomers.Quote The US president announced a “whole of government” approach to regulating cryptocurrencies in a general executive order directing various government agencies to answer specific questions about cryptocurrencies.We can see that this country shows some interest in helping cryptocurrencies, perhaps to facilitate the operation of these platforms, either for its own benefit or for its citizens.QuoteThe so-called Stablecoin TRUST Act for short, makes the US probably the only country, or at least the only Western country, that fully regulates and accepts stablecoins as an official part of the financial and banking system.We must emphasize that, as the name implies, Stablecoins are stable payment currencies, so they can be converted directly into fiat currency. What does this mean? Because this will have the advantage of being more controllable and the issuing government will be able to more reliably process the supply of credit, liquidity and interest rates.With this we can deduce that this law practically encourages in a certain way the issuers of Stablecoins to abide by certain rules. For example, these people will need to acquire or have in order the OCC license and a traditional banking charter, and when operating such stablecoins, they will need to ensure regular audits, spell out clear exchange policies, and specify what actually backs the stablecoins they use. .¿What do you think of the direction the US is taking with stablecoin regulation?Information extracted from: https://cointelegraph.com/news/the-united-states-turns-its-attention-to-stablecoin-regulation",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5397737",
  "comments": [
    {
      "author": "Darker45",
      "created_time": "May 08, 2022, 01:08:26 AM",
      "body": "This kind of policy is long overdue. I hope this Act will be signed into law sooner rather than later. For quite a while already, the likes of Tether's USDT thrives in the market without much regulations. The stablecoin has reached tens of billions in value despite its shady and questionable reputation. Transparency is wanting. With this Stablecoin TRUST Act, stablecoin issuers will have to shape up or else they won't be issued with a license.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dansus021",
      "created_time": "May 08, 2022, 01:23:02 AM",
      "body": "\"The so-called Stablecoin TRUST Act for short, makes the US probably the only country, or at least the only Western country, that fully regulates and accepts stablecoins as an official part of the financial and banking system.\"so in short they accept stablecoin for payment, i do aggree if they gonna accept crypto especially stable one but they also need to run full audit to stablecoin before they start accepting it for financial and banking system",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hispo",
      "created_time": "May 08, 2022, 01:37:51 AM",
      "body": "So did the USA government realize that stablecoins are already a big foe to their incoming digital-Dollar or they are planning to integrate stablecoins to their future digital dollar?Also, what do they plan to do about decentralized stablecoins? Will they force Centralized exchanges only to operate with \"licensed\" stablecoins or else they get in trouble?I can easily see Binance and Coinbase announcing they would cease to work with DAI because the suits told them so.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "May 08, 2022, 03:50:43 AM",
      "body": "Quote from: TheGhostMan on May 08, 2022, 12:45:07 AMWe can see that this country shows some interest in helping cryptocurrencies, perhaps to facilitate the operation of these platforms, either for its own benefit or for its citizens.Governments have never shown any interest in helping anything that is \"decentralized\" that would reduce their power and control over money. None of the things they would ever do is going to help anything in decentralized world, specially the US government that has never looked kindly on those who would go against the USD dominance.When it comes to stablecoins, they are simply printing money which is illegal. So if anything the government is going to shut them down in the name of \"regulations\".Quote from: Hispo on May 08, 2022, 01:37:51 AMAlso, what do they plan to do about decentralized stablecoins? They don't exist.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "May 08, 2022, 04:47:04 AM",
      "body": "Quote from: pooya87 on May 08, 2022, 03:50:43 AMGovernments have never shown any interest in helping anything that is \"decentralized\" that would reduce their power and control over money. None of the things they would ever do is going to help anything in decentralized world, specially the US government that has never looked kindly on those who would go against the USD dominance.When it comes to stablecoins, they are simply printing money which is illegal. So if anything the government is going to shut them down in the name of \"regulations\".They probably won't even do anything about Tether USD which has long been accused of being a market manipulation tool of Bitfinex (its parent company). But if this aspect inconveniences the payment processors too much - the ones who will integrate  it like  PayPal for example - they would simply shut it down or at least prevent it from operating in the USA (I still can't see PP  adding USDT coins to its features ever).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "May 08, 2022, 05:01:57 AM",
      "body": "Quote from: NotATether on May 08, 2022, 04:47:04 AM(I still can't see PP  adding USDT coins to its features ever).I wouldn't be surprised to see something like PUSD token created by PayPal to compete with USDT and similar centralized shitcoins. There is a good profit in processing payments while having full control over the shitcoin's network considering the huge altcoin trading volume that uses stablecoins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Free Market Capitalist",
      "created_time": "May 08, 2022, 06:25:20 AM",
      "body": "Quote from: Hispo on May 08, 2022, 01:37:51 AMSo did the USA government realize that stablecoins are already a big foe to their incoming digital-Dollar or they are planning to integrate stablecoins to their future digital dollar?That's what I was wondering. The thing is that the CBDC digital dollar is still years away from being launched and I guess regulation will do until then but once it is in place, I don't see much point in a stablecoins pegged to the USD if you are going to have a shitcoin issued by the FED which is the USD. Better the original than the copy, I'd say.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bbc.reporter",
      "created_time": "May 08, 2022, 07:18:04 AM",
      "body": "There has been some people telling this to everyone already. I am not certain if everyone was listening, however. But it was already beginning to become clear that the American government will regulate stablecoins and deputize them to become a gateway in and out of the cryptospace. This will be very much similar to what the American government did with online gambling where they deputized the credit card companies and some payment processors to be the gateway in and out of online gambling.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DooMAD",
      "created_time": "May 08, 2022, 12:03:09 PM",
      "body": "Anyone holding stablecoins at the moment needs to seriously consider their options.  Centralised entities are easy targets for regulators and law enforcement.  If they identify impropriety and decide to take action, some of these so-called currencies could easily be shut down.  You don't want to be holding them when that happens.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Baofeng",
      "created_time": "May 08, 2022, 12:19:48 PM",
      "body": "I think with the whole Tether fiasco in the past, US should have been in it's coat tail already. So I would say yes, this is kinda late though, when the whole stable coin is still very hot issue. Nevertheless, we will see what the US regulators will have for us. They should at least look if these stable coins are running on fractional reserves.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DapanasFruit",
      "created_time": "May 08, 2022, 12:50:40 PM",
      "body": "In my own humble opinion, one of the big reasons why I am supporting good regulations with anything that has something to do with cryptocurrency and to some extent stablecoins is because I am sure that with a regulatory framework we can start to weed out bad players and all players in the market will have to be careful because they can then be openly prosecuted by the law in case there will be violations or if some people can be victimized by the operators. We just have to make sure that regulations are not in there to kill the industry but to make it even more alive and well...with a level playing field for all.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kryptqnick",
      "created_time": "May 08, 2022, 02:55:58 PM",
      "body": "I don't use stablecoins and I do think there's a special danger in them, so I think it's good they'll be regulated. The danger comes from the fact that it's not hard to look and see how volatile cryptos are, and to realize that buying them and hodling them involves certain risks. With stablecoins, however, the situation is very different. They seem to not be volatile, so people believe in their stability. However, they're not stable due to strong state budget and financial policies behind them (unlike fiat), and they are not fully supported by any valuable resources like gold, so they can collapse if there's enough panic going on or if something fishy is done by their creators/dev teams.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Luzin",
      "created_time": "May 08, 2022, 03:26:04 PM",
      "body": "Quote from: TheGhostMan on May 08, 2022, 12:45:07 AMWe can see that this country shows some interest in helping cryptocurrencies, perhaps to facilitate the operation of these platforms, either for its own benefit or for its citizens.They are trying to regulate and supervise crypto. They are trying to match it with innovation in the hope that crypto cannot develop. In addition, the actual stable in the market today is not so attractive to investors. At least indeed they support crypto, but they also do not want to let go by regulating and like that is very contrary to decentralization. Let's wait to see how their system will work. I'm sure they don't want their fiat to be displaced by other technologies.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "UmerIdrees",
      "created_time": "May 08, 2022, 03:27:43 PM",
      "body": "Quote from: NotATether on May 08, 2022, 04:47:04 AMQuote from: pooya87 on May 08, 2022, 03:50:43 AMGovernments have never shown any interest in helping anything that is \"decentralized\" that would reduce their power and control over money. None of the things they would ever do is going to help anything in decentralized world, specially the US government that has never looked kindly on those who would go against the USD dominance.When it comes to stablecoins, they are simply printing money which is illegal. So if anything the government is going to shut them down in the name of \"regulations\".They probably won't even do anything about Tether USD which has long been accused of being a market manipulation tool of Bitfinex (its parent company). But if this aspect inconveniences the payment processors too much - the ones who will integrate  it like  PayPal for example - they would simply shut it down or at least prevent it from operating in the USA (I still can't see PP  adding USDT coins to its features ever).So If they want to regulate the stable coins, does it also means that they may take serious action against the Tether USD which is not being properly backed by the US dollar. If this happens, it will create the biggest panic ever in the history of cryptocurrencies. I do hope that in all these stablecoin regulations, there is not any hidden agenda to put a dent in the growth of cryptocurrencies.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Argoo",
      "created_time": "May 08, 2022, 05:21:45 PM",
      "body": "Quote from: Hispo on May 08, 2022, 01:37:51 AMSo did the USA government realize that stablecoins are already a big foe to their incoming digital-Dollar or they are planning to integrate stablecoins to their future digital dollar?Also, what do they plan to do about decentralized stablecoins? Will they force Centralized exchanges only to operate with \"licensed\" stablecoins or else they get in trouble?I can easily see Binance and Coinbase announcing they would cease to work with DAI because the suits told them so.  Yes, there are still a lot of questions. You need to know the essence of the upcoming stablecoin trust law before commenting on it. It seemed to me that states, in any case, would be unfriendly to private and commercial stablecoins using their currency as collateral. In any case, government regulation of these stablecoins is necessary, because only in this way can we get rid of the recurring abuse scandals in this area and increase their credibility.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hispo",
      "created_time": "May 08, 2022, 11:41:33 PM",
      "body": "Quote from: Poker Player on May 08, 2022, 06:25:20 AMQuote from: Hispo on May 08, 2022, 01:37:51 AMSo did the USA government realize that stablecoins are already a big foe to their incoming digital-Dollar or they are planning to integrate stablecoins to their future digital dollar?That's what I was wondering. The thing is that the CBDC digital dollar is still years away from being launched and I guess regulation will do until then but once it is in place, I don't see much point in a stablecoins pegged to the USD if you are going to have a shitcoin issued by the FED which is the USD. Better the original than the copy, I'd say.The way I see it, there is no warranty the CBDC's will provide the liquidity to the crypto market that the stablecoins have, not even mention that CBDC's wallets will likely be associated to a person (name, nationality, residence, social security number) while stablecoins only require a crypto-address. Obviously, the government of the United Stated would be happy if they could replace stablecoins with their incoming digital coin on exchanges, that would be helpful for them to catch tax-evasion, criminals and whatnot at cost of our privacy, that is.If they are planning something like that, they have a quite a long way to go before they achieve it, who knows, perhaps a Tether/Stablecoin scandal would come handy for them to accelerate things and convince us we are better withdrawing our gains directly to our new, nice and clean centralized CBDC wallet. I would expect stablecoin FUD in the near future.Quote from: Argoo on May 08, 2022, 05:21:45 PMQuote from: Hispo on May 08, 2022, 01:37:51 AMSo did the USA government realize that stablecoins are already a big foe to their incoming digital-Dollar or they are planning to integrate stablecoins to their future digital dollar?Also, what do they plan to do about decentralized stablecoins? Will they force Centralized exchanges only to operate with \"licensed\" stablecoins or else they get in trouble?I can easily see Binance and Coinbase announcing they would cease to work with DAI because the suits told them so.  Yes, there are still a lot of questions. You need to know the essence of the upcoming stablecoin trust law before commenting on it. It seemed to me that states, in any case, would be unfriendly to private and commercial stablecoins using their currency as collateral. In any case, government regulation of these stablecoins is necessary, because only in this way can we get rid of the recurring abuse scandals in this area and increase their credibility.I would not like if they tried to exclude decentralized options like DAI off exchanges because a -license-.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bbc.reporter",
      "created_time": "May 09, 2022, 03:15:05 AM",
      "body": "Quote from: DooMAD on May 08, 2022, 12:03:09 PMAnyone holding stablecoins at the moment needs to seriously consider their options.  Centralised entities are easy targets for regulators and law enforcement.  If they identify impropriety and decide to take action, some of these so-called currencies could easily be shut down.  You don't want to be holding them when that happens. Agreed. This is why I was always very cautious on Tether. However, I speculate that there might be 1 or 2 stablecoin issuers that will be favored by the American government. One of them might be USDC. It is centralized but Fidelity and Blackrock appear to be confident that the regulators will not use regulatory pressure to shut it down. They know the market more than us.Circle Internet Financial, a global internet finance firm and the issuer of USD Coin (USDC), today announced it has entered into an agreement for a $400M funding round with investments from BlackRock, Inc., Fidelity Management and Research, Marshall Wace LLP and Fin Capital. The funding round is expected to close in the second quarter.Source https://www.prnewswire.com/news-releases/circle-announces-400m-funding-round-301523647.html",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DooMAD",
      "created_time": "May 09, 2022, 03:06:51 PM",
      "body": "Quote from: bbc.reporter on May 09, 2022, 03:15:05 AMOne of them might be USDC. It is centralized but Fidelity and Blackrock appear to be confident that the regulators will not use regulatory pressure to shut it down. They know the market more than us.Circle Internet Financial, a global internet finance firm and the issuer of USD Coin (USDC), today announced it has entered into an agreement for a $400M funding round with investments from BlackRock, Inc., Fidelity Management and Research, Marshall Wace LLP and Fin Capital. The funding round is expected to close in the second quarter.Source https://www.prnewswire.com/news-releases/circle-announces-400m-funding-round-301523647.htmlEew.  Not a fan of Circle.  Their first foray into running an exchange was a spectacular failure.  Then they had the gall to try to blame Bitcoin developers for their own lack of success.  After that, they took over Poloniex, which immediately plummeted in popularity.  Everything they touch turns to shit.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bbc.reporter",
      "created_time": "May 10, 2022, 03:32:40 AM",
      "body": "@DooMAD. Agreed, however, the insiders of Blackrock and Fidelity might be thinking about this differently if they are investing in USDC.In any case, are you following the news on UST's depegging? It also appears that this might become a storyline where the regulators can argue for a ban on all stablecoins instead of regulating them hehehe. This will certainly reduce the market size of the cryptospace in America.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}