{
  "id": "topic_5472766",
  "title": "Rockson1",
  "author": "Rockson1",
  "created_time": "November 03, 2023, 09:20:25 PM",
  "content": "The way the country dey go so, many people way put their minds to invest into Bitcoin based on how the country economy dey very hard so them just live to invest in Bitcoin and use their capitals take do other things wey them think say go help them immediately (wrong mentality)Some of them way try to invest into Bitcoin earlier and with the help of the kind of strategy way dem dey use they accumulate freely before, now when things dey hard even those people self they find am difficult to accumulate more Bitcoin, e dey hard to get money and e still dey easy to spend am, so me I reason am outside the box say, this our country economy done dey affect the common people way just start to invest into Bitcoin.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5472766",
  "comments": [
    {
      "author": "Mr.suevie",
      "created_time": "November 03, 2023, 09:37:34 PM",
      "body": "Quote from: Rockson1 on November 03, 2023, 09:20:25 PMThe way the country dey go so, many people way put their minds to invest into Bitcoin based on how the country economy dey very hard so them just live to invest in Bitcoin and use their capitals take do other things wey them think say go help them immediately (wrong mentality)Some of them way try to invest into Bitcoin earlier and with the help of the kind of strategy way dem dey use they accumulate freely before, now when things dey hard even those people self they find am difficult to accumulate more Bitcoin, e dey hard to get money and e still dey easy to spend am, so me I reason am outside the box say, this our country economy done dey affect the common people way just start to invest into Bitcoin. My brother Bitcoin investment no be by force oo and e no be something wey go guarantee everybody success because e dey take time sef to guarantee profits depending on how the market dey go, e no be some kind of get-rich-scheme wey supposed give us escape from our financial problems all of a sudden. Bitcoin investment na something wey need time and discipline because even if we don successful hold Bitcoin wey our financial status no dey sustainable, with time we go just temper with am and then before you know use some of our holdings.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mate2237",
      "created_time": "November 03, 2023, 10:38:27 PM",
      "body": "Quote from: Rockson1 on November 03, 2023, 09:20:25 PMThe way the country dey go so, many people way put their minds to invest into Bitcoin based on how the country economy dey very hard so them just live to invest in Bitcoin and use their capitals take do other things wey them think say go help them immediately (wrong mentality)Some of them way try to invest into Bitcoin earlier and with the help of the kind of strategy way dem dey use they accumulate freely before, now when things dey hard even those people self they find am difficult to accumulate more Bitcoin, e dey hard to get money and e still dey easy to spend am, so me I reason am outside the box say, this our country economy done dey affect the common people way just start to invest into Bitcoin. I dont know why all di threads wey I dey comment today e dey similar, di won wey comment before dis one sef na di same economic palava with bitcoin. to say di truth, the economy disturb investors well well. I also discovered one big problem for this bitcoin investment matter and the thing be say, many people wey like to invest in bitcoin have no idea on the technology, what I mean be say, dem no know the basic knowlege of bitcoin so e dey difficult for dem to invest in the coin. And dat dollar dey go down na di gud time to invest.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Makus",
      "created_time": "November 04, 2023, 07:25:20 AM",
      "body": "Quote from: Rockson1 on November 03, 2023, 09:20:25 PMThe way the country dey go so, many people way put their minds to invest into Bitcoin based on how the country economy dey very hard so them just live to invest in Bitcoin and use their capitals take do other things wey them think say go help them immediately (wrong mentality)Some of them way try to invest into Bitcoin earlier and with the help of the kind of strategy way dem dey use they accumulate freely before, now when things dey hard even those people self they find am difficult to accumulate more Bitcoin, e dey hard to get money and e still dey easy to spend am, so me I reason am outside the box say, this our country economy done dey affect the common people way just start to invest into Bitcoin. Bro I thank God say you first use the word say the economy hard, so if person don get wattin dey very essential for life wey e need and e important pass Bitcoin at that moment make the person sef no even hesitate to package am, because na only who dey alive naim dey invest for Bitcoin oo, the dead no get any thing to do with Bitcoin. Bitcoin nor be do or die affair, normally our economy dey really dey affect Bitcoin investment, money wey person suppose to use take invest now the cost of fuel, food and living don high, the thing dey really dey touch everybody wey dey under the economy but that one no mean say we go come forfeit important things for survival go invest for Bitcoin, person wet do that kind thing go still sell em coin within short period of time to still settle those things wey e leave, so wattin come be the reason to stress our self for wattin we go still reverse.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Roseline492",
      "created_time": "November 04, 2023, 08:30:14 AM",
      "body": "Quote from: Rockson1 on November 03, 2023, 09:20:25 PMThe way the country dey go so, many people way put their minds to invest into Bitcoin based on how the country economy dey very hard so them just live to invest in Bitcoin and use their capitals take do other things wey them think say go help them immediately (wrong mentality)Investment on Bitcoin is actually not a do or die investment, however one of the major challenges most people normally have is the fear of missing out to buy Bitcoin because there are people that whenever they see others investing on Bitcoin they start panicking and feeling that they could be the last to invest on Bitcoin while others are taking advantage of the market now, and perhaps before you know they will use all they have to accumulate Bitcoin without a reserve funds for them in case of emergency. And later on due to pressing needs they would be left with no option but to sell off there investment, so this is one of the reasons why most people easily get affected by there investment, so in as much as is very important to invest on Bitcoin we should be very mindful of the funds we have and the funds are to be used on the investment to avoid future panicking.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "November 04, 2023, 09:07:22 AM",
      "body": "Quote from: Rockson1 on November 03, 2023, 09:20:25 PMnow when things dey hard even those people self they find am difficult to accumulate more Bitcoin, e dey hard to get money and e still dey easy to spend amNigerians have always been complaining that the economy is hard, but you will be surprised when someone you know buy a car and build a house and continue to live. What that is most important is that you should have a business. If you have a business that you know about, what you are selling or offering will also be increasing in price as inflation continues in a way that you will not lose but still be able to buy bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Adams0001",
      "created_time": "November 04, 2023, 10:11:12 PM",
      "body": "Quote from: Charles-Tim on November 04, 2023, 09:07:22 AMQuote from: Rockson1 on November 03, 2023, 09:20:25 PMnow when things dey hard even those people self they find am difficult to accumulate more Bitcoin, e dey hard to get money and e still dey easy to spend amNigerians have always been complaining that the economy is hard, but you will be surprised when someone you know buy a car and build a house and continue to live. What that is most important is that you should have a business. If you have a business that you know about, what you are selling or offering will also be increasing in price as inflation continues in a way that you will not lose but still be able to buy bitcoin.I think what some people don't understand is that if you want to invest in bitcoin, you need to have a business or any other place where you can make money and use that money to invest in bitcoin meaning the profits. That's why they say you should only invest what you can afford to lose, because even if the price drops, you won't feel bad about it and you won't be afraid to leave it for a long time because people who invest their capital in bitcoin are afraid of losing money because know any source of generating funds.Bitcoin where you dey see like this know be something where people go dey rush am because any amount you fit invest am with confidence that you will make profit, but some people will struggle to get money and dey don't have any place that dey generate income dey will go and invest or try to do trading in bitcoin because dey see people doing it dey will say let them try it and later if dey lose dey will start complaining and dey will be thinking where dey go get another money because dey risk there money that dey will use for something else.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kelward",
      "created_time": "November 04, 2023, 10:51:47 PM",
      "body": "Truth of di matter be say bitcoin investment and oda types of investment na secondary need dem be, so if person don chop, still get some wey im go eat tomorrow, keep transportation for work, remove rent for di month and at least health de bam, den di person fit to de talk about investment. If you no invest in bitcoin today, tomorrow or next year, di coin no de run go anywhere. After dis coming halving and ATH, other ones go still happen E no too good say make we de put our sef through unnecessary pressure sake of say we wan do investment. Make person no go get BP come suffer stroke or die because of investment wey  go still de if di person die.Actually di economy no de friendly now, di cost of living just de skyrocket everyday, because of the rate wey naira take de devalue. Di good thing wey me i don understand about bitcoin be say na investment wey you fit to de top up, meaning say as extra money enter your hand small, you go just buy small bitcoin hold join di one wey you get. No pressure from anyone to force you to invest, because na only you get the sole autonomy to your bitcoin investment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "adultcrypto",
      "created_time": "November 05, 2023, 08:44:05 AM",
      "body": "Quote from: Rockson1 on November 03, 2023, 09:20:25 PMThe way the country dey go so, many people way put their minds to invest into Bitcoin based on how the country economy dey very hard so them just live to invest in Bitcoin and use their capitals take do other things wey them think say go help them immediately (wrong mentality)Some of them way try to invest into Bitcoin earlier and with the help of the kind of strategy way dem dey use they accumulate freely before, now when things dey hard even those people self they find am difficult to accumulate more Bitcoin, e dey hard to get money and e still dey easy to spend am, so me I reason am outside the box say, this our country economy done dey affect the common people way just start to invest into Bitcoin. Na true say the economy dey affect people in many ways, plenty people dey focus more on food first make them fit chop f9rst before anything. I know plenty people wey don suspend their projects them because the money no does before unto say things do cost well well. Investment for Bitcoin also collect from the bad economy because plenty people wey suppose invest in Bitcoin never see food chop before them talk about investment. I go advise say make wey no too reason the economy sha, make e no stop us from investing in Bitcoin even if na N20k per week or month, we fit dey run am and hunger no go kill us. Money no dey do person, the small we fit dey save now fit save us tomorrow.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rachael9385",
      "created_time": "November 05, 2023, 06:50:53 PM",
      "body": "Me I know see Bitcoin investment as any political something way go be say if person no do am e go con encounter any penalty, to join Bitcoin investment no be by force and Bitcoin nah for people way get good source of living, if any investor no get were em dey receive salaries from, then there is no need for the person to invest in Bitcoin.Some of the investors way no get any source of steady income no go fit invest in Bitcoin freely because e no go take more than a month or 2 months for the person to sell em coins off, more especially when Bitcoin just increase small, the person go rush sell them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mate2237",
      "created_time": "November 05, 2023, 07:37:23 PM",
      "body": "Quote from: Rockson1 on November 03, 2023, 09:20:25 PMThe way the country dey go so, many people way put their minds to invest into Bitcoin based on how the country economy dey very hard so them just live to invest in Bitcoin and use their capitals take do other things wey them think say go help them immediately (wrong mentality)Some of them way try to invest into Bitcoin earlier and with the help of the kind of strategy way dem dey use they accumulate freely before, now when things dey hard even those people self they find am difficult to accumulate more Bitcoin, e dey hard to get money and e still dey easy to spend am, so me I reason am outside the box say, this our country economy done dey affect the common people way just start to invest into Bitcoin. Anyone wey get money and fear to invest in bitcoin lack the understanding of bitcoin and dem need very serious teaching on bitcoin. And that is why people are saying that bitcoin no bi for everyone. Now there is another wey we need to know be say. You have  know the good part of bitcoin and the bad part of bitcoin before u start di journey if not you go dey crash because all your mind be say you won Hama. No bi like dat oh. The going up and down of the price sef go make you vex. And one thing be say, you go dey patient to do am if not you go vex one day and sell everything and leave di matter for matayas.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Promocodeudo",
      "created_time": "November 06, 2023, 12:06:46 AM",
      "body": "OP, I dont think that the economy has anything to do with Bitcoin investment, if you don't have money, no one will persuade you to invest, so let's not see this bitcoin investment of a thing as a must for everyone, it is reasonable for people to invest in bitcoin when they have another source of income, don't investment your only savings, if you do that, what will you use as sustenance, we shouldn't blame everything on the economy, there are other little things we can do to make money for ourselves, it must necessarily be Bitcoin, and who even tell people that when you invest in Bitcoin, you must make money, if anyone encourage this kind of mindset he or she might be disappointed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Miles2006",
      "created_time": "November 06, 2023, 03:18:10 PM",
      "body": "I no know how people dey do am oh but for me anything investment or bitcoin investment, who no get better work or wetin he dey do for a living no suppose put body for bitcoin investment, this one wey you dey call economy I no see anything wey concern bitcoin investment and economy why? Person wey no get money no fit invest no be by force sha but any person wey get little business fit start to invest regardless of the economy. I saw one thread yesterday, Akara seller don save money to start up bitcoin investment so I con surprise because even the least person wey like to invest go invest",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jegileman",
      "created_time": "November 06, 2023, 05:01:57 PM",
      "body": "Quote from: Rockson1 on November 03, 2023, 09:20:25 PMThe way the country dey go so, many people way put their minds to invest into Bitcoin based on how the country economy dey very hard so them just live to invest in Bitcoin and use their capitals take do other things wey them think say go help them immediately (wrong mentality)You are also wrong mentally if you think that you can make investment in bitcoin and get help immediately. Everything takes time and a good investment takes long to reap a long lasting profit. Investing in bitcoin na just like investing in any other projects, gold, real estates and the rest. What is more important to know here is that, with bitcoin investment, you’ll be assured of a good profit in the future when you invest and hold for a long time to reap the profit.QuoteSome of them way try to invest into Bitcoin earlier and with the help of the kind of strategy way dem dey use they accumulate freely before, now when things dey hard even those people self they find am difficult to accumulate more Bitcoin, e dey hard to get money and e still dey easy to spend am, so me I reason am outside the box say, this our country economy done dey affect the common people way just start to invest into Bitcoin. You no dey wrong for dis your statement but we no go make our weakness make us no make d right decision to make for investment wey go profit us wella in d future. With this economy situation, we no suppose for miss on the right approach wey we suppose use do d investment. The DCA method na him many people suggest and na for people wey no too get plenty money to put for d investment. Economy hard but if you fit still struggle, you go still make some money to put inside d investment. No excuse for missing out now, and not a must to d the undoable becos say you make investment too.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EluguHcman",
      "created_time": "November 06, 2023, 09:55:15 PM",
      "body": "Quote from: Rockson1 on November 03, 2023, 09:20:25 PMThe way the country dey go so, many people way put their minds to invest into Bitcoin based on how the country economy dey very hard so them just live to invest in Bitcoin and use their capitals take do other things wey them think say go help them immediately (wrong mentality) It takes two categorical visions in considering on where, when and how to invest your money which is basically \"one who is investing with the hope to solve immediate problems with the profits considering shorter term goals\" and \"the one who is aimed to get rich over time Considering long term goals\"So according to hardness of the economy, most investors are insighting on the goal of shorter term Investments because they certainly don't have enough to invest and let go just as you OP inspired that they fails to invest on Bitcoin.Meanwhile... Those as said who nvested on other means for quick income were on the right track even though it may not work out as thought because there are measures of investments that proffers the opportunities to quick incomes such as hand products, conventional trading and contracting etc.While significantly, Bitcoin investments is a trading platform that is required its investors patient whether in a short-term or a long-term investment goal as long one is aimed to make profits because the profitablity in Bitcoin investments is not gazed by individual skills but just patient.Quote from: Rockson1 on November 03, 2023, 09:20:25 PMSome of them way try invest into Bitcoin earlier and with the help of the kind of strategy way dem dey use they accumulate freely before, now when things dey hard even those people self they find am difficult to accumulate more Bitcoin, e dey hard to get money and e still dey easy to spend am, so me I reason am outside the box say, this our country economy done dey affect the common people way just start to invest into Bitcoin. Of course there is a raise of reasonable capital effect to Investors who are willing to Invest in Bitcoin due to the current economic situation whereby it is being uneasy to raise the least of #500 to kickstart in investing on Bitcoin and comparing the local currency naira to USD ($) that the supply for Bitcoin is being determined with.So it is either discouraging on how an individual would struggle to realize a specific amount of capital in naira to Invest in Bitcoin but on the go every efforts would seems effortless over the inferiority of naira to USD.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Justbillywitt",
      "created_time": "November 08, 2023, 02:59:01 PM",
      "body": "QuoteNigerians have always been complaining that the economy is hard, but you will be surprised when someone you know buy a car and build a house and continue to live. What that is most important is that you should have a business. If you have a business that you know about, what you are selling or offering will also be increasing in price as inflation continues in a way that you will not lose but still be able to buy bitcoin.My broda no be lie you talk, since dem born me reach now I never hear the time wey Nigerians every talk say the country economy good. Infact last year is always better than present year and next year. But sill inside the country you go see people dey do lavished birthdays, marry wives, build houses, go clubs and do dorime for clubs. Nothing comot for watin you talk if person dey do something economically the person go still see food chop, buy cloths and still do investment. If person no dey work or do business and no dey provide any form of service why the country no go hard am? Many people wey dey shout say country hard, economy do this and that na people wey no dey work or do anything. Investment na mindset and if you dey make small money from work or business you go just invest. So me I no too believe say economy do anything.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Antotena",
      "created_time": "November 08, 2023, 09:43:33 PM",
      "body": "Quote from: Rockson1 on November 03, 2023, 09:20:25 PMThe way the country dey go so, many people way put their minds to invest into Bitcoin based on how the country economy dey very hard so them just live to invest in Bitcoin and use their capitals take do other things wey them think say go help them immediately (wrong mentality)Some of them way try to invest into Bitcoin earlier and with the help of the kind of strategy way dem dey use they accumulate freely before, now when things dey hard even those people self they find am difficult to accumulate more Bitcoin, e dey hard to get money and e still dey easy to spend am, so me I reason am outside the box say, this our country economy done dey affect the common people way just start to invest into Bitcoin. Only a man that has food to eat have a means to invest, don't blame people that failed to buy Bitcoin because Bitcoin is not the end of the road if they don't buy. It's a privilege if you have the means that's okay but know that not everyone have the means to invest in it. You know there is a saying that don't invest what you can't afford to lose, when the economy hit hard on some people, the only thing that comes to there mind is how to survive and how do you do that? You need food and shelter, if you find a solution for food and shelter, then you can think of investment.Do you know that in Nigeria today, if calculate our cumulative inflation rate since the Nigeria government change government, we rise in inflation in numbers than the USA, so you should know that the cost of goods and service are not smiling on faces of people, so when you see people change and make other decisions that you think violate Bitcoin way, it's Nigeria problem even though it's not suppose to be like that in the first place.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Agbamoni",
      "created_time": "November 08, 2023, 10:27:14 PM",
      "body": "You never survive finish with the business wey him they do or the personal handwork for this our country nah to they put hope for Bitcoin wey be say our country never really accept am. For this our country nah only few people they invest in Bitcoin. People wey be say better money done enter their hand before they even think of to invests in Bitcoin. And OP make you also understand say no be everybody for this our country wey hold Bitcoin be potential investors most of them nah day to day traders or exchanges.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptopreneurBrainboss",
      "created_time": "November 09, 2023, 08:31:01 AM",
      "body": "Quote from: Rockson1 on November 03, 2023, 09:20:25 PMSome of them way try to invest into Bitcoin earlier and with the help of the kind of strategy way dem dey use they accumulate freely before, now when things dey hard even those people self they find am difficult to accumulate more Bitcoin, e dey hard to get money and e still dey easy to spend am, so me I reason am outside the box say, this our country economy done dey affect the common people way just start to invest into Bitcoin. As e dey here na so e dey for other places, make we no dey believe wetin we dey read for news or see on social media because when you ask those wey don japa dem go tell you that side no easy too. The worlds economy has been suffering especially after the COVID-19 outbreak wey make many companies dey low on cash flow and come dey sack their workers. Investing in Bitcoin no get any particular amount limitations wey be say if no be so so amount you no go fit invest. Na because we get big eye and we wan dey Invest money wey we no get na why e dey affect us. Your ₦10,000 you fit dey invest am weekly or monthly and e no matter wetin you dey earn, you fit dey commot the least and they accumulating Bitcoin. You no go see the benefits now but for future na when you go happy say you dey take the decision. I dey always tell people wey meet me for advise say use Bitcoin as your savings accounts. Quote from: Agbamoni on November 08, 2023, 10:27:14 PMYou never survive finish with the business wey him they do or the personal handwork for this our country nah to they put hope for Bitcoin wey be say our country never really accept am. For this our country nah only few people they invest in Bitcoin. People wey be say better money done enter their hand before they even think of to invests in Bitcoin. And OP make you also understand say no be everybody for this our country wey hold Bitcoin be potential investors most of them nah day to day traders or exchanges.To dey trade or exchange as you talk, you need to Invest first by buying Bitcoin but for the matter of investing, you no need finish with business wey you dey do to invest. That mindset go make you miss many opportunity for life and no be only Bitcoin. I dey this industry when Bitcoin cheap pass like this about ₦400,000 per Bitcoin but then I no too strong sha as I be student and never get work wey dey pay but I dun reason am say even though na ₦10,000 wey I been dey Invest, my story now for dun different. Make we no dey use Bitcoin dey play oh. You dey see that ₦100,000,000 wey people dey think say Bitcoin no for reach that's $100,000 e go just shock us like film as we go reach am pass self. Our country no need to accept Bitcoin before we invest inside, just know our politicians no get our best interest at heart so na for we to look after ourselves.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rachael9385",
      "created_time": "November 09, 2023, 12:40:47 PM",
      "body": "Quote from: Antotena on November 08, 2023, 09:43:33 PMQuote from: Rockson1 on November 03, 2023, 09:20:25 PMThe way the country dey go so, many people way put their minds to invest into Bitcoin based on how the country economy dey very hard so them just live to invest in Bitcoin and use their capitals take do other things wey them think say go help them immediately (wrong mentality)Some of them way try to invest into Bitcoin earlier and with the help of the kind of strategy way dem dey use they accumulate freely before, now when things dey hard even those people self they find am difficult to accumulate more Bitcoin, e dey hard to get money and e still dey easy to spend am, so me I reason am outside the box say, this our country economy done dey affect the common people way just start to invest into Bitcoin. Only a man that has food to eat have a means to invest, don't blame people that failed to buy Bitcoin because Bitcoin is not the end of the road if they don't buy. It's a privilege if you have the means that's okay but know that not everyone have the means to invest in it. You know there is a saying that don't invest what you can't afford to lose, when the economy hit hard on some people, the only thing that comes to there mind is how to survive and how do you do that? You need food and shelter, if you find a solution for food and shelter, then you can think of investment.Do you know that in Nigeria today, if calculate our cumulative inflation rate since the Nigeria government change government, we rise in inflation in numbers than the USA, so you should know that the cost of goods and service are not smiling on faces of people, so when you see people change and make other decisions that you think violate Bitcoin way, it's Nigeria problem even though it's not suppose to be like that in the first place. You made me laugh when you said this Only a man that has food to eat have a means to invest, however what you said is the truth, if one doesn't have any means of survival then there is also no need for him/her to invest in Bitcoin, as we already know that Bitcoin investing is not a must, so many people that doesn't have the opportunities for now to invest in Bitcoin shouldn't think that they should talk their life's by starving them sf till death just because they want to invest in Bitcoin.I am beginning to think that it is only those that are so dem greedy just want to invest even with borrow money or someone's money.One should look for a better way way he or she can put food in their tables before they think to invest because if they don't have any means of feeding them selfs they will just sell of the little coins if they are frustrated.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}