{
  "id": "topic_5414579",
  "title": "Ojima-ojo",
  "author": "Ojima-ojo",
  "created_time": "September 23, 2022, 07:40:36 AM",
  "content": "Quote from: Ojima-ojo on May 17, 2022, 09:39:13 PMAm still new in this space both in cryptocurrency and in this forum and seeing what is happening even to stable coins lately make me decide to put all my investment funds into Bitcoin since Bitcoin has never crashed or a billion coins getting minted out of no we're and dump into the market just like Luna tereUSTD did, so for your peace of mind I advise newbies to rely only on highly decentralized crypto Bitcoin. Until you learn enough to decide which risk to take and which not to.After making the above quoted thread, to show my enthusiasm and commitment to Bitcoin accumulation as a newbie I did not rush myself or getting myself work up with the price of Bitcoin rather I concentrated on on building my knowledge on Bitcoin and it development over time and how the market behavior has been and after gaining some level of knowledge i then started my Bitcoin accumulation bits by bits no matter how small I could and today my I have 1 million Satoshi in my wallet making me to be ranked among the Satoshi millionaires, even though my achievement of becoming a Satoshi millionaire may sound as a small achievement to most people here. I am super excited to have become a Satoshi millionaire today and am going to hold on to this and also accumulate more subsequently.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5414579",
  "comments": [
    {
      "author": "Upgrade00",
      "created_time": "September 23, 2022, 07:47:05 AM",
      "body": "Quote from: Ojima-ojo on September 23, 2022, 07:40:36 AMI am super excited to have become a Satoshi millionaire today and am going to hold on to this and also accumulate more subsequently.It is advicable to keep any future accumulations private. How much BTC you own is not something you publicly announce here on the forum, or anywhere else, especially to people who know you personally.Another advice would be storage methods. Since you're on the forum, you'll probably know the most recommended wallet softwares are electrum and Bitcoin core. For higher amounts of Bitcoin, it would be wise to invest in a hardware wallet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "September 23, 2022, 07:53:49 AM",
      "body": "Quote from: Upgrade00 on September 23, 2022, 07:47:05 AMIt is advicable to keep any future accumulations private. How much BTC you own is not something you publicly announce here on the forum, or anywhere else, especially to people who know you personally.Exactly, it is good to be private.Quote from: Upgrade00 on September 23, 2022, 07:47:05 AMAnother advice would be storage methods. Since you're on the forum, you'll probably know the most recommended wallet softwares are electrum and Bitcoin core. For higher amounts of Bitcoin, it would be wise to invest in a hardware wallet.For frequent transactions, hardware wallet would be advisable. Or a watch-only wallet (watch-only wallet for tracking transaction, generating unsigned transaction and also for broadcasting signed transaction), and its cold storage (for transaction signing).For save keeping, also other cold wallets generated on airgapped devices are recommendable. I mean paper wallet generated on airgapped device, and also a wallet on airgapped device. As long as the person is not spending from it. He can just be tracking transactions with watch-only wallet using master public key import.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitbollo",
      "created_time": "September 23, 2022, 08:01:39 AM",
      "body": "Congratulations to have reached this first milestone! If I can give you my advice, now try to consolidate the various inputs you have received. As soon as the mempool has a few TXs to process, send them to a new address of your property to minimize the fees to be paid (likewise just 1 sat/byte).Find below some information about that...https://bitcoinbriefly.com/utxo-consolidation-explained/https://buybitcoinworldwide.com/fee-calculator/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "September 23, 2022, 08:37:45 AM",
      "body": "Congratulations, now it's time to go for 2 million.May your case be a lesson to most people who think 1 whole bitcoin is \"expensive\" because of its unit price, even though you don't necessarily need to buy 1 unit in one go.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cuda911",
      "created_time": "September 23, 2022, 08:45:01 AM",
      "body": "For everyone saying its good to be private how the heck will I look for Ojima-ojo contact and track him to his house? Or do Bitcoin profile have home address filling the gap that I don't know about? Or you can now trace someone account to their home land?.. This forum is privacy on its own, no vital information that can put users at risk.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lafu",
      "created_time": "September 23, 2022, 09:10:18 AM",
      "body": "Quote from: Cuda911 on September 23, 2022, 08:45:01 AMFor everyone saying its good to be private how the heck will I look for Ojima-ojo contact and track him to his house? Or do Bitcoin profile have home address filling the gap that I don't know about? Or you can now trace someone account to their home land?.. This forum is privacy on its own, no vital information that can put users at risk.As long as the User dosnt post his Home adress or contact Information here or somewhere else you cant track him down where he is living and home.You are only that much Privacy as you show all others and allow others to know , In special cases of crime and fraud i guess with the chainalysis software and help from other services its possible to find the IP and more details.@Ojima-ojoCongrats for your first Goal in the Cryptospace.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DeathAngel",
      "created_time": "September 23, 2022, 09:15:13 AM",
      "body": "Congratulations OP, now is not the time to stop though. Keep accumulating, you can always add to your stash. Dollar cost average every single month, keep going. Nobody has enough bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joniboini",
      "created_time": "September 23, 2022, 09:52:21 AM",
      "body": "Quote from: Cuda911 on September 23, 2022, 08:45:01 AMOr do Bitcoin profile have home address filling the gap that I don't know about? Or you can now trace someone account to their home land?.. This forum is privacy on its own, no vital information that can put users at risk.It is better to be safe anyway. Who knows, we are prone to fault. Sometimes we put our throwaway social media accounts but then one or two of them are connected to our main one for example, or we forgot to put our e-mail private, or in the worst case scenario there might be a database leak from the forum in the future. Scammers then use the info to send phishing e-mail or hack into our PC because we said we own some BTC, and so on. Btw congrats OP, may you own 1 BTC soon.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "September 23, 2022, 10:28:10 AM",
      "body": "Small or big we acquired satoshi I think we are all lucky to be this early on being affiliated to bitcoin. Having more knowledge is essential but experience is also a key to be on this game. Most of the users are simply doing dca and this is good chance for us since the price of bitcoin is tanking. We dont know how long it will stay at that price so we just keep accumulating until the price appreciated and we could sell and gain some sats in a longer period. Bear will not be forever, so lets just be patience. Congrats OP for being proud of your holding.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Darker45",
      "created_time": "September 23, 2022, 10:50:28 AM",
      "body": "You've done a great job. Congratulations! While it is indeed a lot better to have known Bitcoin much earlier and bought much, there is nothing we can do about it. So instead of crying over spilled milk, it is better to do something now. The right time, after all, is always now. We don't even have to make up for the time that we missed. We don't have to spend so much or even borrow or take a loan just to become a full-Bitcoin HODLer. There's no need to reach for the stars right away. It is enough to do things little by little.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FatFork",
      "created_time": "September 23, 2022, 11:45:34 AM",
      "body": "OP, congratulations on reaching the million mark. As they say, the first million is the hardest.  Your next milestone is ten million satoshi. Good luck!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JangoUnchained",
      "created_time": "September 23, 2022, 11:46:25 AM",
      "body": "You've performed the right thing, I can't dream of a better crypto portfolio without BTC being a part, it's what we called incomplete, now your next target should be 2/million, do not give up on this journey as it will reward extremely in the near future, one step at a time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "salad daging",
      "created_time": "September 23, 2022, 12:04:35 PM",
      "body": "I'm happy to hear that you have owned a Satoshi millionaire, it proves that you have been consistent in investing and believe in the only coin, namely Bitcoin, compared to others, I'm glad to hear that you have reached the first stage and hope to continue to accumulate Bitcoin in the future.I myself am still at the bottom stage to reach 1 million Satoshi but I keep doing this with DCA strategy every week I invest, but still too far to reach 1 BTC but I hope I will also soon to have a Satoshi millionaire like you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ultrloa",
      "created_time": "September 23, 2022, 12:30:33 PM",
      "body": "Quote from: Ojima-ojo on September 23, 2022, 07:40:36 AMQuote from: Ojima-ojo on May 17, 2022, 09:39:13 PMAm still new in this space both in cryptocurrency and in this forum and seeing what is happening even to stable coins lately make me decide to put all my investment funds into Bitcoin since Bitcoin has never crashed or a billion coins getting minted out of no we're and dump into the market just like Luna tereUSTD did, so for your peace of mind I advise newbies to rely only on highly decentralized crypto Bitcoin. Until you learn enough to decide which risk to take and which not to.After making the above quoted thread, to show my enthusiasm and commitment to Bitcoin accumulation as a newbie I did not rush myself or getting myself work up with the price of Bitcoin rather I concentrated on on building my knowledge on Bitcoin and it development over time and how the market behavior has been and after gaining some level of knowledge i then started my Bitcoin accumulation bits by bits no matter how small I could and today my I have 1 million Satoshi in my wallet making me to be ranked among the Satoshi millionaires, even though my achievement of becoming a Satoshi millionaire may sound as a small achievement to most people here. I am super excited to have become a Satoshi millionaire today and am going to hold on to this and also accumulate more subsequently. Good achievement to have but its best to follow what @Upgrade stated since showing off your profits or your balances can sometimes trigger more attention to scammers and might you can get unwanted proposal which can cause you financial loss. So better keep your profit in private so that there's no disturbance on your growth and you can continue what you are doing smoothly away from people who always want to take advantage on newbies who's exploring more opportunities and exploit them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Shamm",
      "created_time": "September 23, 2022, 02:05:55 PM",
      "body": "Quote from: Ojima-ojo on September 23, 2022, 07:40:36 AMQuote from: Ojima-ojo on May 17, 2022, 09:39:13 PMAm still new in this space both in cryptocurrency and in this forum and seeing what is happening even to stable coins lately make me decide to put all my investment funds into Bitcoin since Bitcoin has never crashed or a billion coins getting minted out of no we're and dump into the market just like Luna tereUSTD did, so for your peace of mind I advise newbies to rely only on highly decentralized crypto Bitcoin. Until you learn enough to decide which risk to take and which not to.After making the above quoted thread, to show my enthusiasm and commitment to Bitcoin accumulation as a newbie I did not rush myself or getting myself work up with the price of Bitcoin rather I concentrated on on building my knowledge on Bitcoin and it development over time and how the market behavior has been and after gaining some level of knowledge i then started my Bitcoin accumulation bits by bits no matter how small I could and today my I have 1 million Satoshi in my wallet making me to be ranked among the Satoshi millionaires, even though my achievement of becoming a Satoshi millionaire may sound as a small achievement to most people here. I am super excited to have become a Satoshi millionaire today and am going to hold on to this and also accumulate more subsequently. Congratulations Op for reaching your first 1million satoshi and i think that is nor enough for you and your next target is to get 2 millions and above to became a instant millionaire. But what upgrade00 said to you that its better to keep quiet and hold your satoshi or BTC privately because not just compulsory that you will be announce what you've reach or how many BTC you have in your wallet and its better to be safe because nowadays if we talk about money many people will interested to scam you even your closet friends so you need to be careful and double your security.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "$crypto$",
      "created_time": "September 23, 2022, 03:45:02 PM",
      "body": "You have managed to do it by continuing to accumulate satoshi until it reached 1 million satoshi today, I know what a great achievement you can do it even though we are still trying to continue to hoard as much bitcoin as possible sometimes there are some obstacles that cause the satoshi to be pulled back for on sale, but with you saying like this can be a motivation for all of them who want to have 1 million satoshi or 1 Bitcoin.There is still a long time we can still do it to continue to get Bitcoin from the lowest price again.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "isaac_clarke22",
      "created_time": "September 23, 2022, 04:23:30 PM",
      "body": "Quote from: Upgrade00 on September 23, 2022, 07:47:05 AM~True. I can quite relate on this back when I mentioned in a long dead thread in here where I was backstabbed by one of my \"fake friends\" when they knew that I was holding a certain amount of Bitcoin and they realized that its price is waaaay insane when converted to our local currency.I believe that at least would be the acceptable thing to happen, because I know there are some worse case scenario where they would attempt to steal everything from me for obvious reasons of like hitting the lottery and suddenly everyone becomes your friend. In social media, it is better to shut up anyway.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Doan9269",
      "created_time": "September 23, 2022, 04:27:44 PM",
      "body": "You've done yourself well and very good OP for choosing the right path with bitcoin and taking away your eyes off the side attractions of altcoins, know that this is a privilege you've got not to constitute a number of newbies investing on shitcoins and loosing some of their money daily, its also a good thing that you've given yourself open for learning, especially in the particular areas of your investment at large, all i could advise is to keep growing and holding till you are satisfied with evident convinctions to sell at the appropriate time you desire.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ojima-ojo",
      "created_time": "September 23, 2022, 05:22:36 PM",
      "body": "Thank you, and the fact that I could accumulate by bits without haven't to buy the whole unit of Bitcoin serve as a great tool in the process.Quote from: mk4 on September 23, 2022, 08:37:45 AMCongratulations, now it's time to go for 2 million.May your case be a lesson to most people who think 1 whole bitcoin is \"expensive\" because of its unit price, even though you don't necessarily need to buy 1 unit in one go.I started accumulating since I gained adequate knowledge of the market.Quote from: Ojima-ojo on July 26, 2022, 03:54:34 PMJust came across this on Reddit and thought it will be helpful here.Source:https://www.reddit.com/r/Bitcoin/comments/w85wvx/guide_to_stackin_sats/?utm_medium=android_app&utm_source=shareThis article helped also to better understand how the Bitcoin units work and what to expects.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}