{
  "id": "topic_5407799",
  "title": "snel0026.",
  "author": "snel0026.",
  "created_time": "July 27, 2022, 11:49:54 AM",
  "content": "I've ordered to pay bitcoins to an other server.The other server has nothing received.The TxID is unknown but in Electrum is it gone.How is that possible?Thanks for hulp.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5407799",
  "comments": [
    {
      "author": "LoyceV",
      "created_time": "July 27, 2022, 11:53:31 AM",
      "body": "You're going to have to provide more details. Bitcoins aren't paid to \"servers\", and TXIDs don't usually disappear from Electrum.I noticed that since 2018, it's almost an annual event for you to lose your Bitcoins and open a topic about it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "July 27, 2022, 12:04:12 PMLast edit: July 27, 2022, 12:17:53 PM by Charles-Tim",
      "body": "Quote from: snel0026. on July 27, 2022, 11:49:54 AMThe TxID is unknown but in Electrum is it gone.The txid would definitely be there, even if you import the seed phrase that have previous transaction history.Check your transaction history on Electrum. Click on the history tab to check your transaction history, you will be able to know what exactly happened.Make sure your wallet sycn with the blockchain by having good internet connection.Edit:Hope you are also using the latest version of Electrum?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitMaxz",
      "created_time": "July 27, 2022, 01:43:11 PM",
      "body": "Are you talking about the lightning network where you open a channel and then later you decided to close the channel?If this is what you talking about then better to wait for your funds to get refunded because it takes a while before you receive the amount you funded recently from LN channel unless if it is stuck the same happens to other users here?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hZti",
      "created_time": "July 27, 2022, 04:08:40 PM",
      "body": "You need to go on mempool.space and type in the address that the bitcoin would originally be stored in. If you see them in the balance than they are still there. If you don't see them you can look up the transaction history to see where they went. Nothing can disappear without being send somewhere.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "snel0026.",
      "created_time": "July 27, 2022, 09:35:07 PM",
      "body": "Electrum said that de amount is paid (followed by a green checkmark)But how can i see to where the amount is sent?The txid is 3JmXrH5YDpEBiMgXuQ94czGJ83nWFm1Gag.Bitvavo can't find payment.where can I see where my bitcoins have gone?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Xal0lex",
      "created_time": "July 27, 2022, 09:49:38 PM",
      "body": "Quote from: snel0026. on July 27, 2022, 09:35:07 PM3JmXrH5YDpEBiMgXuQ94czGJ83nWFm1GagThere has been no movement at this address. What else do you want?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LoyceV",
      "created_time": "July 28, 2022, 05:45:55 AM",
      "body": "Quote from: snel0026. on July 27, 2022, 09:35:07 PMElectrum said that de amount is paid (followed by a green checkmark)Where did you download this \"Electrum\" version? It sounds like something's seriously wrong with your system. I'd say download Tails, but it onto a DVD, reboot your PC from that DVD, restore your Electrum from seed phrase, and see from there what happened to your Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "July 28, 2022, 05:53:04 AM",
      "body": "Quote from: snel0026. on July 27, 2022, 09:35:07 PMBut how can i see to where the amount is sent?The txid is 3JmXrH5YDpEBiMgXuQ94czGJ83nWFm1Gag.That is an address, not a txid. You have to right-click on the transaction in Electrum and select \"Details\" and look for the long hexadecimal string (it's much longer than an address) at the top - that is your txid.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "snel0026.",
      "created_time": "July 28, 2022, 08:08:21 AM",
      "body": "Quote from: NotATether on July 28, 2022, 05:53:04 AMThat is an address, not a txid. You have to right-click on the transaction in Electrum and select \"Details\" and look for the long hexadecimal string (it's much longer than an address) at the top - that is your txid.When i rightclick on the transaction en chose for copy transaction-id then i see:ad93721616286afc2c0253c52d9e539b28ef771ecc8423de5fd6a83ceade7036Is that what you mean?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LoyceV",
      "created_time": "July 28, 2022, 08:13:07 AM",
      "body": "Quote from: snel0026. on July 28, 2022, 08:08:21 AMad93721616286afc2c0253c52d9e539b28ef771ecc8423de5fd6a83ceade7036Enter it into Blockchair.com's search bar: it doesn't exist. That means, whatever happened, only happened for you, and not for the rest of the Bitcoin network.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Crypt0S0ul",
      "created_time": "July 28, 2022, 10:20:01 AM",
      "body": "Quote from: NotATether on July 28, 2022, 05:53:04 AMThat is an address, not a txid. You have to right-click on the transaction in Electrum and select \"Details\" and look for the long hexadecimal string (it's much longer than an address) at the top - that is your txid.I never used Electrum as well. Does the electrum need an internet connection to complete the transactions? I use Atomic wallet and I was downloading the blocks with Bitcoin Core 22.0. As far as I know, Both Wallet (Atomic and Bitcoin Core) Need an internet connection to complete the transactions. IDK What happened with OP? Maybe he is trying offline or anything else?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o_e_l_e_o",
      "created_time": "July 28, 2022, 11:17:18 AM",
      "body": "Quote from: snel0026. on July 28, 2022, 08:08:21 AMWhen i rightclick on the transaction en chose for copy transaction-id then i see:ad93721616286afc2c0253c52d9e539b28ef771ecc8423de5fd6a83ceade7036Your transaction has not been broadcast to the network. First check that Electrum has a green circle at the bottom right to show that it is connected. Then try double clicking on your transaction to open the transaction window, and first Sign then Broadcast the transaction using the buttons at the bottom right of this new window.Quote from: Crypt0S0ul on July 28, 2022, 10:20:01 AMDoes the electrum need an internet connection to complete the transactions?It does not need an internet connection to create or sign the transaction, but it obviously needs an internet connection to be able to broadcast it to the network.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nc50lc",
      "created_time": "July 28, 2022, 03:08:00 PM",
      "body": "Quote from: snel0026. on July 27, 2022, 09:35:07 PMElectrum said that de amount is paid (followed by a green checkmark)Have you checked the icon in front of that transaction if it changed from a \"green check\" () into a \"blue computer\" () icon?Because if it do, you can just \"Right-click->Remove\" it if you want its locally-locked funds to be spendable again.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "snel0026.",
      "created_time": "July 28, 2022, 04:09:17 PM",
      "body": "Quote from: nc50lc on July 28, 2022, 03:08:00 PMQuote from: snel0026. on July 27, 2022, 09:35:07 PMElectrum said that de amount is paid (followed by a green checkmark)Have you checked the icon in front of that transaction if it changed from a \"green check\" (https://raw.githubusercontent.com/spesmilo/electrum/master/electrum/gui/icons/confirmed.png) into a \"blue computer\" (https://raw.githubusercontent.com/spesmilo/electrum/master/electrum/gui/icons/offline_tx.png) icon?Because if it do, you can just \"Right-click->Remove\" it if you want its locally-locked funds to be spendable again.I've removed it. In front of that transaction stoot a blue computer.Does that means that the transaction has failed?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o_e_l_e_o",
      "created_time": "July 28, 2022, 04:23:33 PM",
      "body": "Not so much failed as never really existed in the first place. You created it but then saved it locally (indicated by the blue computer icon), and never broadcast it to the network. No one else in the world ever knew anything about that transaction. The bitcoin it tried to spend have not moved and will still be in your wallet available for you to spend in a new transaction. With any new transaction you need to make sure to sign and broadcast it using the relevant buttons, and not just save it locally.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "snel0026.",
      "created_time": "July 28, 2022, 05:02:44 PM",
      "body": "OK, That's clear to me.Thanks you all.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitMaxz",
      "created_time": "July 28, 2022, 11:19:52 PM",
      "body": "Quote from: snel0026. on July 28, 2022, 04:09:17 PMI've removed it. In front of that transaction stoot a blue computer.Does that means that the transaction has failed?That transaction is local if it's blue not the green check, you can still able to broadcast the transaction if you want then just double-click that transaction and look for the export button at the bottom left and then copy to the clipboard and paste it to any pushTX sites. You can paste the raw transaction to any of these below.- https://www.blockchain.com/btc/pushtx- https://blockchair.com/broadcast- https://coinb.in/#broadcastNow you can see that transaction live in any block explorer and you should see the transaction in your Bitvavo account.Also, take note of the circle bottom right of the Electrum if it's green or red there might be an internet problem that causes your transaction to be created locally.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nc50lc",
      "created_time": "July 29, 2022, 04:45:31 AM",
      "body": "Quote from: snel0026. on July 28, 2022, 04:09:17 PMQuote from: nc50lc on July 28, 2022, 03:08:00 PMQuote from: snel0026. on July 27, 2022, 09:35:07 PMElectrum said that de amount is paid (followed by a green checkmark)Have you checked the icon in front of that transaction if it changed from a \"green check\" () into a \"blue computer\" () icon?I've removed it. In front of that transaction stoot a blue computer.Does that means that the transaction has failed?Hmm, if it showed a green checkmark before, the transaction should've been proceeded with 6 or more confirmations already.It's very unlikely for a transaction that was included deeply in the blockchain to get dropped so you must have just mistook the icons before.Anyway, since it was a \"blue computer\" before you removed it, that means that it's only locally saved in your walleteither due to dropped/replaced parent transaction, you haven't broadcast it or it's dropped from the selected server's mempool.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "snel0026.",
      "created_time": "August 22, 2022, 09:42:34 PM",
      "body": "The problem has been solved. The transaction was stored locally and I was able to carry out the assignment again and now successfully, thanks to your comments.Thanks all.Wim",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}