{
  "id": "topic_5446864",
  "title": "Chukzy1992",
  "author": "Chukzy1992",
  "created_time": "March 30, 2023, 06:28:23 AM",
  "content": "Yes talents is big differents from skills, so many people are mistaken skills from talents.  Talents is inborn, it is also referred as \"God\" giving ability, talents can be acquired through genetics and heredity, it begins to surface in the early stage of one's life;some talents remain undiscovered and unexplored until later in life.     Skills is the acquired, learned and practiced ability that makes and individual capable of performing tasks sucessfully, it is a combination of ability, cleverness, and practical knowledge.Skills are acquired and developed over time repeatedly.   In conclusion; talents by definition is the quality or inborn of an individual, people with talents do things with ease without stressing themselves, why skills from the definition can be referred to as learning experience.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5446864",
  "comments": [
    {
      "author": "Raceonsucced",
      "created_time": "March 31, 2023, 02:18:57 PM",
      "body": "Yes, talent is a gift given by God. and we also have to try. seek knowledge, practice it, and share knowledge with each other. human skills vary in general. everyone has their own role. but have to keep trying.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mich",
      "created_time": "April 07, 2023, 04:24:55 AM",
      "body": "Well I think these are 2 different things you have. Skills are with training and talent is something that one just knows how to do.   Talents are like in music you take a singer that can carry a tune and the skill that a singer must do is perfecting that note. Then you have a chef who has a special talent. They have that talent of knowing how to cook and there is that skill to make sure that a menu is set for its restaurant patrons. It takes this talent to perfect his skill, it is not something that just any person will know how to do.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Shielding2002",
      "created_time": "April 07, 2023, 08:15:27 AM",
      "body": "To me talent and skills are different.You have to learn a skill to be good at itBut talent is not something you learn or get trained for, it's just  inbuilt.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "monedauno",
      "created_time": "May 10, 2023, 10:39:37 AM",
      "body": "I agree, both skill and talents have unique traits or qualities or qualities that cannot be separated without taking into account all the characteristics you mentioned before.   One should take a look at the above, because all the things that have been given to one life require different skill and talent.  In short, I do think it depends on how and what people are capable of.   One can acquire a skill by studying, reading, writing, and doing stuff with ease, but it may be impossible to gain this knowledge, because it takes some time and effort. If a person is lucky enough to acquire a skill, maybe they do this skill, but if they have a talent, they can acquire it and practice it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Albert_09",
      "created_time": "May 10, 2023, 05:12:36 PM",
      "body": "I believe that these are two different conceptsSkills-you build up by hard work over a long period of time. Talent-it doesn't take much effort and practice if you're gifted with it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}