{
  "id": "topic_5432417",
  "title": "Fivestar4everMVP",
  "author": "Fivestar4everMVP",
  "created_time": "December 30, 2022, 07:26:48 PMLast edit: December 16, 2023, 06:40:20 PM by Fivestar4everMVP",
  "content": "Like the subject say, we can now buy Bitcoin using apple pay and Google pay through binance. Though this was made possible by a centralized exchange, I still think it's worth mentioning and recognizing.To remember that Google, together with several other social networks once banned bitcoin and cryptocurrency ads, I think makes this news a bit more interesting.Little by little, ease of transacting in/with bitcoin is gradually entering into the mainstream tech world as with this new development, converting fiat to Bitcoin just got easier for billions of Android and iPhone users.Source :https://twitter.com/BTC_Archive/status/1608542623270146048?t=9jxxgCX9tUht4opOsBqfEw&s=19What do you think of this development?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5432417",
  "comments": [
    {
      "author": "Asiska02",
      "created_time": "December 30, 2022, 07:37:04 PM",
      "body": "Even though it is a centralized exchange, it is a welcome development. This development has, in some way, been able to bridge the barrier of difficulty in purchasing bitcoin; things have simply gotten easier. For some people, a little more convenience is just worth it if they want to capitalize on something worthwhile of their investments.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "December 30, 2022, 08:06:07 PM",
      "body": "Interesting feature to have available for those who want to try it out. Knowing the massive tech giant that Binance is, I'd expect them to already have this option though — not sure what took them so long.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptoHeadlineNews",
      "created_time": "December 30, 2022, 08:17:16 PM",
      "body": "Quote from: Fivestar4everMVP on December 30, 2022, 07:26:48 PMLike the subject say, we can now buy Bitcoin using apple pay and Google pay through binance. Though this was made possible by a centralized exchange, I still think it's worth mentioning and recognizing.To remember that Google, together with several other social networks once banned bitcoin and cryptocurrency ads, I think makes this news a bit more interesting.Yes.. it's really nice to know that Google has finally recognize it's mistake, knowing that Bitcoin is an industry worth investing in, because I think banning it's ads back then must have been one of it's biggest mistake so far, for such an industry worth trillions of dollars. But hearing this news now, is a great sign 2023 is going to be a very good year for Bitcoin, as we anticipate for the next halving and price increase.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mendace",
      "created_time": "December 30, 2022, 08:38:38 PM",
      "body": "I think it's the most wrong thing you can do when you care about your privacy.  First of all, it is wrong to buy bitcoins from centralized exchanges, there are better ways to do it, for example Bisq.  Secondly, it is wrong to pay with services such as Google Pay which will keep track of your payments and hand everything over to the authorities if they put pressure.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jackg",
      "created_time": "December 30, 2022, 08:56:06 PM",
      "body": "Quote from: mendace on December 30, 2022, 08:38:38 PMSecondly, it is wrong to pay with services such as Google Pay which will keep track of your payments and hand everything over to the authorities if they put pressure.That'll probably take a lot of pressure these days. Companies that make money off people's data (like Google) make the most of the data they collect by storing it themselves and having only them being able to access it.This kinda brings binance in line with a lot of stock apps that do this sort of thing already. I'm not sure how well trusted those stock apps are and what that might say about binance but that's not the debate for now...I wonder if apple and binance put this pressure on Google too since they seemed quite anti crypto. There's a chance they can use this to fuel more negative news about crypto (maybe get market insights too from binance that they could spin how they like).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Falconer",
      "created_time": "December 30, 2022, 09:37:26 PM",
      "body": "Quote from: Fivestar4everMVP on December 30, 2022, 07:26:48 PMWhat do you think of this development?I haven't realized it yet, but thanks for your information. It seems to me and probably most other people that this is a great move by Binance to make it easier for people to buy bitcoin. I'm not sure if they managed to reach the target they wanted to achieve, but given the increasing number of android users, of course they expect a lot of interest in this service.I just think their efforts will make bitcoin more and more known, it's a benefit of what Binance is doing right now. I even get email from them almost every day regarding promotions, so Binance's success in achieving the target may come true. Only one thing, no matter how one buys bitcoin on a centralized exchange they should consider their own wallet for long term storage.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dothebeats",
      "created_time": "December 30, 2022, 10:03:58 PM",
      "body": "Just checked it on my phone and it's still unavailable for me (APAC region). Any move that opens cryptocurrencies to a wider public is a welcome one, also considering that these two companies used to block anything related to cryptocurrencies. Now they are enabling their services to open an avenue for people to get in on the crypto train. I'd never thought Apple and Google will give in to cryptocurrencies, but they just did and it's even their payment gateways that they opened. Also mad props to Binance for making this happen, as they are the only exchange that will have this enabled currently. CZ may not be the most likeable person in the crypto industry, but you can see how he's trying to push the limits and break barriers in order for crypto to be accessible to a wider audience. Quote from: mendace on December 30, 2022, 08:38:38 PMI think it's the most wrong thing you can do when you care about your privacy.  First of all, it is wrong to buy bitcoins from centralized exchanges, there are better ways to do it, for example Bisq.  Secondly, it is wrong to pay with services such as Google Pay which will keep track of your payments and hand everything over to the authorities if they put pressure.For us who has been around the cryptospace for quite some time, we may not really trust centralized services to handle things on our behalf. But what Binance is doing is helping those who wanted to try crypto for themselves. For sure people are aware how their data is being handled nowadays, and they still don't care. A lot are still succumbing to social media which farms a lot of your information, so what difference will it make if they decided to not use this and go the hard route just to try cryptocurrencies? Not that I'm advocating centralization. It's just that the ease of use and access to cryptocurrencies is far greater when you opt to go the centralized route.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "minime0105",
      "created_time": "December 30, 2022, 10:20:05 PM",
      "body": "Quote from: Asiska02 on December 30, 2022, 07:37:04 PMEven though it is a centralized exchange, it is a welcome development. This development has, in some way, been able to bridge the barrier of difficulty in purchasing bitcoin; things have simply gotten easier. For some people, a little more convenience is just worth it if they want to capitalize on something worthwhile of their investments.Do you know that application of centralization process of buying Bitcoin with application or those application you mentioned will put Bitcoin in disvalue function, but really it's good to have centralized way of buying Bitcoin because of reduction of stresse, but what i want you to know that with centralized system of buying Bitcoin many people will disregard bitcoin with that and it can be easily to be track when it enters in danger.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jrrsparkles",
      "created_time": "December 31, 2022, 08:28:22 AM",
      "body": "Quote from: mk4 on December 30, 2022, 08:06:07 PMInteresting feature to have available for those who want to try it out. Knowing the massive tech giant that Binance is, I'd expect them to already have this option though — not sure what took them so long.Governments and their regulations made it tough for their implementation, however this feature is already available since a long back on wazirx exchange which is owned by Binance as well but in recent days they have problems with the payment processor so they halted the features even the wire transfer and only allow p2p buying now in that exchange.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Minecache",
      "created_time": "December 31, 2022, 08:43:54 AM",
      "body": "Quote from: mendace on December 30, 2022, 08:38:38 PMI think it's the most wrong thing you can do when you care about your privacy.  First of all, it is wrong to buy bitcoins from centralized exchanges, there are better ways to do it, for example Bisq.  Secondly, it is wrong to pay with services such as Google Pay which will keep track of your payments and hand everything over to the authorities if they put pressure.If you use them to buy bitcoins, your privacy will be compromised. But after all that is happening in the market, I can assure you that, like it or not, centralized services are still part of the market, and it is the biggest contributor to the growth and popularity of bitcoin. We want bitcoin to be adopted globally and become a means of payment worldwide, and we want privacy. That seems like a very difficult thing to achieve, we can only choose.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "m2017",
      "created_time": "December 31, 2022, 09:01:18 AM",
      "body": "What can be thought of any development? Of course, these are changes for the better and progress that should be celebrated.Many dislike centralized platforms like Binance, but as you can see, they still make an indispensable contribution to the dissemination and popularization of bitcoin. I think this is a big push in the development of btc, yes, that’s right, with an unpleasant aftertaste of centralization, but still it allows you to attract new btc users. Buying bitcoin using Apple pay/Google pay is a couple of clicks that will be positively evaluated by users. Although I don't like the fact that btc will be stored on Binance's wallets, but these funds can be withdrawn to your wallets. Of course, the addresses will not be pseudo-anonymous and will require unnecessary actions in the future, but the first step to bitcoin for beginners using Apple pay/Google pay will be easier.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sheaila",
      "created_time": "December 31, 2022, 11:05:59 AM",
      "body": "Quote from: Fivestar4everMVP on December 30, 2022, 07:26:48 PMLike the subject say, we can now buy Bitcoin using apple pay and Google pay through binance. Though this was made possible by a centralized exchange, I still think it's worth mentioning and recognizing.To remember that Google, together with several other social networks once banned bitcoin and cryptocurrency ads, I think makes this news a bit more interesting.Little by little, ease of transacting in/with bitcoin is gradually entering into the mainstream tech world as with this new development, converting fiat to Bitcoin just got easier for billions of Android and iPhone users.Didn't google ban them because of how many shitty projects were just scams? Or did Google at one point really hated Bitcoin/Crypto in general? I guess it's a good option, pretty much further cements Binance being the best cex among the ones in existence. It's convenient I guess, but with the amount of options that are already convenient in place originally, it doesn't add that much in terms of that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "December 31, 2022, 12:56:45 PM",
      "body": "Can you give a better source or more details than just a tweet that could be deleted later?Better source ---> https://www.binance.com/en/feed/post/141143QuoteDespite the usefulness of the payment integrations, there will be a certain number of users that are not able to utilize the services due to Apple Pay and Google Pay not working in all countries.It seems that not all countries will get these features, and therefore it is a good option for those who do not want to go through the complications of payment, which provides an additional advantage for them.They did not disclose the list of countries that will have this feature.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cabron",
      "created_time": "December 31, 2022, 01:05:54 PM",
      "body": "Quote from: hugeblack on December 31, 2022, 12:56:45 PMCan you give a better source or more details than just a tweet that could be deleted later?Better source ---> https://www.binance.com/en/feed/post/141143QuoteDespite the usefulness of the payment integrations, there will be a certain number of users that are not able to utilize the services due to Apple Pay and Google Pay not working in all countries.It seems that not all countries will get these features, and therefore it is a good option for those who do not want to go through the complications of payment, which provides an additional advantage for them.They did not disclose the list of countries that will have this feature.Apple and Google play are also not available in other countries. Just like Paypal, they have also not allowed certain countries to register to this payment platform. Mobile wallets are making it easy for people to own digital assets and Binance will take advantage to fast track and be part of thier growing platform as they aim to monopolize this market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AbuBhakar",
      "created_time": "December 31, 2022, 01:24:42 PM",
      "body": "I hope google and apple can launch there own apps that user can buy bitcoin by just connecting there pay app without the need of creating account like shapeshift.io before. Using CEX is pain in the ass due to the transaction fee when withdrawing the balance from CEX to wallet.Some of mobile fiat wallet here in our country already introducing new feature that can buy crypto directly inside the wallet. This is much better than purchasing on CEX using 3rd party wallet provider. It’s too much centralization.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "romero121",
      "created_time": "December 31, 2022, 01:35:19 PM",
      "body": "Long back itself through the P2P trading it is possible to use Gpay and Apple Pay. Now this has been added to the direct buying. Binance have got more features added, but I don't know how far those were used. Being the global leader in centralized cryptocurrency exchange services it does many changes to the platform.The market is getting widened and Binance keeps acquiring the small exchanges functioning on specific locations. So the service is being extended, through some way it is helping common man invest into cryptocurrencies.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "livingfree",
      "created_time": "December 31, 2022, 02:00:09 PM",
      "body": "The reason I think why both of them have been aggressively banned bitcoin advertisements were due to the proliferation of bitcoin ad scams and that's the action that they have to do to lessen it.Well, yeah they're centralized platforms but still a good update and innovation that we're seeing since the market is already on the mainstream.It's very likely that these centralized companies and tech giants has to obliged with the said innovation that they can't stop.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bittraffic",
      "created_time": "December 31, 2022, 02:22:51 PM",
      "body": "Quote from: livingfree on December 31, 2022, 02:00:09 PMThe reason I think why both of them have been aggressively banned bitcoin advertisements were due to the proliferation of bitcoin ad scams and that's the action that they have to do to lessen it.Well, yeah they're centralized platforms but still a good update and innovation that we're seeing since the market is already on the mainstream.It's very likely that these centralized companies and tech giants has to obliged with the said innovation that they can't stop.I think it was also during the bear market n in 2018 when they ban the crypto ad. Facebook also joined them in banning crypto. After the announcement, the prices indeed declined terribly. But it's cool to see their payment system is allowing BTC transactions. There are millions of users from them that will potentially add to pull the price up in the bull run. The next bull market is going to 100K and 2023 I guess might be exciting.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Leviathan.007",
      "created_time": "December 31, 2022, 04:23:46 PM",
      "body": "Quote from: Fivestar4everMVP on December 30, 2022, 07:26:48 PMLike the subject say, we can now buy Bitcoin using apple pay and Google pay through binance. Though this was made possible by a centralized exchange, I still think it's worth mentioning and recognizing.To remember that Google, together with several other social networks once banned bitcoin and cryptocurrency ads, I think makes this news a bit more interesting.Little by little, ease of transacting in/with bitcoin is gradually entering into the mainstream tech world as with this new development, converting fiat to Bitcoin just got easier for billions of Android and iPhone users.Source :https://twitter.com/BTC_Archive/status/1608542623270146048?t=9jxxgCX9tUht4opOsBqfEw&s=19What do you think of this development? Recently I can see SZ and his company Binance are trying to get progress and be even more famous, especially after what happened to FTX we saw many people withdrawing their money from exchanges to be safe, and even during this time, SZ announced that in Binance users withdrawing their money because of losing their trust to the centralized exchanges so maybe this action from them is to attract more users for their platform.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}