{
  "id": "topic_5467693",
  "title": "Michael0410",
  "author": "Michael0410",
  "created_time": "September 22, 2023, 09:25:31 AMLast edit: September 22, 2023, 10:11:23 AM by Michael0410",
  "content": "Hi everyone, I am a newbie.I started trading BTCUSDT P. and testing a 1 minute scalping strategy (including several indicators) at the moment.So far... I don't manage to gain any profits from the trades that I did place lately. I do manage to win trades, but the issue is that the fees killing my profits!I am wondering if you have any suggestions regarding the above?Maybe I should move to longer timeframe and not scalping in order to make profits?Many thanksMike",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5467693",
  "comments": [
    {
      "author": "Oshosondy",
      "created_time": "September 22, 2023, 09:41:13 AM",
      "body": "You ask similar question just nit long ago: https://bitcointalk.org/index.php?topic=5467688.msg62884510#msg62884510Read what I posted there. If it is derivative market, the fee on Bybit for makers is 0.02%, but for takers it is 0.06% which can be too much for you. On OKX: Marker fee is 0.02%. Taker fee is 0.05%On Binance which I have advised you to use, it has lower fee, especially the taker fee of 0.04% or lower.If you want to gain more, set taje profit so that (using limit order if available) so that only maker fee would be deducted from you after you make the profit amount you want to make.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "palle11",
      "created_time": "September 22, 2023, 09:44:52 AM",
      "body": "I don't think that fees should be your problem or that it is your problem. Scalping is not also your problem if it is working for you and you are making the little profit you are making. How are you sure to keep winning if you extent the duration time for your trade ? Consistency is important in trade and to keep to what works is surely a good way to trade. Coaches don't usually change their winning team in a match, that is a lesson. So you don't have to be greedy, don't allow greed have a better part of you. Keep winning.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Michael0410",
      "created_time": "September 22, 2023, 10:02:26 AM",
      "body": "Quote from: Oshosondy on September 22, 2023, 09:41:13 AMYou ask similar question just nit long ago: https://bitcointalk.org/index.php?topic=5467688.msg62884510#msg62884510Read what I posted there. If it is derivative market, the fee on Bybit for makers is 0.02%, but for takers it is 0.06% which can be too much for you. On OKX: Marker fee is 0.02%. Taker fee is 0.05%On Binance which I have advised you to use, it has lower fee, especially the taker fee of 0.04% or lower.If you want to gain more, set taje profit so that (using limit order if available) so that only maker fee would be deducted from you after you make the profit amount you want to make. Thanks for your reply!Double checking things: You suggested to place a \"limit\" order instead of a \"market\" order, etc. + set the \"Take Profit-Trigger by ROI (%)\" (ByBit)? This way it will only take a maker fee?Till know I placed \"market\" orders and being charged fees twice: once for the order placed and another time for a closing order.Thanks!Mike",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Patrol69",
      "created_time": "September 22, 2023, 10:03:47 AM",
      "body": "Quote from: Michael0410 on September 22, 2023, 09:25:31 AMI am wondering if you have any suggestions regarding the above?Maybe I should move to longer timeframe and not scalping in order to make profits?How much profit you can make in trading or how much success you can achieve in trading will depend on your trading skills. Scalping is only an indicator, it is not important at all, scalping is used as per the understanding. There are many who use 15-minute scalping and there are many who use one-hour scalping, that is, they use it in a way that is easy to understand. If you are comfortable with understanding 15 minute scalping then you don't need to use hourly or other time scalping. You must be patient by investing at the right time, if you sell an investment shortly after taking it but you cannot profit from it you must be patient and wait for good time. If you can be patient and wait for a good time then surely you will succeed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "September 22, 2023, 10:08:23 AM",
      "body": "Quote from: Michael0410 on September 22, 2023, 09:25:31 AMMaybe I should move to longer timeframe and not scalping in order to make profits?Ratimov had a nice topic about this:Scalping is the most controversial way to make money. My experience for 4 yearsIt pretty much depends on what your available time looks like and what your expectations are, but if you;re looking at making a killing out of it in a short span you've chosen the wrong one.Quote from: Patrol69 on September 22, 2023, 10:03:47 AMScalping is only an indicator, it is not important at all,Scalping is a strategy not an indicator!Quote from: palle11 on September 22, 2023, 09:44:52 AMI don't think that fees should be your problem or that it is your problem. He's playing with small time frames scalping, already the method is about large volume and small profits ratio, when you put on top of that low volatility and high fees you might end up with zero profit even if you have placed and closed a winning trade.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EarnOnVictor",
      "created_time": "September 22, 2023, 11:21:44 AM",
      "body": "Quote from: Michael0410 on September 22, 2023, 09:25:31 AMI am wondering if you have any suggestions regarding the above?Maybe I should move to longer timeframe and not scalping in order to make profits?It's nice to know your strategy is working, but note that a 1-minute timeframe poses its own issues as well, and one of them is the fee as you might be paying the fee or barely paid it when a reversal signal would be seen against your position which you don't have an option than to close it, or else you lose more money.This is why I advise you to change to a higher timeframe, and note that the lower the timeframe, the more the issue you might encounter. And if your strategy is working fine on the 1-minute chart, it should also work on the higher charts. Of course with little adjustments from you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hamphser",
      "created_time": "September 22, 2023, 11:49:10 AM",
      "body": "Quote from: Michael0410 on September 22, 2023, 09:25:31 AMHi everyone, I am a newbie.I started trading BTCUSDT P. and testing a 1 minute scalping strategy (including several indicators) at the moment.So far... I don't manage to gain any profits from the trades that I did place lately. I do manage to win trades, but the issue is that the fees killing my profits!I am wondering if you have any suggestions regarding the above?Maybe I should move to longer timeframe and not scalping in order to make profits?Many thanksMike  Take some swing trade and just dont touch up daytrade/scalping because even veterans on trading wont really be easily touching up this space,considering that its never been that easy or simple dealing with volatilitywhich is way more worst compared to those traditional markets like forex and stocks but we know that the more volatility it do have the more chances or making profits would really be that possible in a short timebut of course it would really be depending or basing up on how well you do really make out trades. When it comes to fees, then it would really be killing you or would really be even negative because it would really be just that normal that platforms would really be having that kind of slice on every positions that you would be closing and its business all the way.Never make yourself rush with scalping because even myself have a hard time on trying to snip out those movements in a short time. 1M to 5M kind of timeframe is never beenthat simple but well there are people who do really know on how to play with the movements.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "logfiles",
      "created_time": "September 22, 2023, 01:17:54 PM",
      "body": "If your account is not huge enough to get those VIP level marker and taker fee discounts, then do less of scalp trading. The exchange is going to make a ton of money out of you. This is the bitter truth. Been there.Use this tool to see how trading fees will affect your profits in the long term (ignore Bybit's old trading fees) and use the current ones - https://www.winrate.io/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "goaldigger",
      "created_time": "September 22, 2023, 01:31:54 PM",
      "body": "Quote from: Michael0410 on September 22, 2023, 09:25:31 AMI am wondering if you have any suggestions regarding the above?Maybe I should move to longer timeframe and not scalping in order to make profits?Many thanksMike  Yes, change your strategy and trade with a longer timeframe.You're still a beginner and you still need to learn a lot of things about trading, you don't need to rush and aim for an instant profit.This is actually the mistake of most of the newbies, they trade instantly without investing on their own knowledge first. Learn from that mistake and start doing the right thing. Don't expect to make profit in scalping if you have low capital, it can only works to those who have enough capital to trade with.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Michael0410",
      "created_time": "September 22, 2023, 02:38:13 PM",
      "body": "Quote from: goaldigger on September 22, 2023, 01:31:54 PMQuote from: Michael0410 on September 22, 2023, 09:25:31 AMI am wondering if you have any suggestions regarding the above?Maybe I should move to longer timeframe and not scalping in order to make profits?Many thanksMike  Yes, change your strategy and trade with a longer timeframe.You're still a beginner and you still need to learn a lot of things about trading, you don't need to rush and aim for an instant profit.This is actually the mistake of most of the newbies, they trade instantly without investing on their own knowledge first. Learn from that mistake and start doing the right thing. Don't expect to make profit in scalping if you have low capital, it can only works to those who have enough capital to trade with.Thanks for your reply!Any suggestions regarding a longer timeframe that I can use?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Eternad",
      "created_time": "September 22, 2023, 02:43:17 PM",
      "body": "Quote from: Michael0410 on September 22, 2023, 09:25:31 AMHi everyone, I am a newbie.I started trading BTCUSDT P. and testing a 1 minute scalping strategy (including several indicators) at the moment.So far... I don't manage to gain any profits from the trades that I did place lately. I do manage to win trades, but the issue is that the fees killing my profits!I am wondering if you have any suggestions regarding the above?Maybe I should move to longer timeframe and not scalping in order to make profits?Many thanksMike  Maybe you are using a small margin and you are taking a profit less than the trading fee charged by the exchange. It's odd to see 1 min scalping trading because it's very short unless you are using high leverage such as x100 which surely gives you enough profit per scalp trade but this is obviously risky and a waste of time since the fee will eat most of your little profit.Better to choose a much longer time frame to scalp since price action usually happens every hour or longer time frame not in minutes. You will end up just paying for fees er trade.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "terrific",
      "created_time": "September 22, 2023, 03:36:46 PM",
      "body": "I guess that you've just gained with a couple of bucks and that's not really enough to call a day if that's the little profit you've made.The fees aren't that much really but it is that you're just not content with the outcome of how much you've made with that scalped trade you've made.I'd say that keep on testing any other strategy that you can do and just enjoy the journey that you're doing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Faisal2202",
      "created_time": "September 22, 2023, 03:51:29 PM",
      "body": "Quote from: Michael0410 on September 22, 2023, 09:25:31 AMHi everyone, I am a newbie.I started trading BTCUSDT P. and testing a 1 minute scalping strategy (including several indicators) at the moment.So far... I don't manage to gain any profits from the trades that I did place lately. I do manage to win trades, but the issue is that the fees killing my profits!I am wondering if you have any suggestions regarding the above?Maybe I should move to a longer timeframe and not scalping to make profits.Many thanksMike  I'm amazed to see that even if you are a newbie here you are making profits in calling which is the most hard trading type in my opinion. Maybe I am overreacting but I think you as a newbie should not be testing scalping with real money. But I am not saying that's not a good practice because you will learn nothing until you try to do practical work and you are doing practical. You should increase the scalping period but please keep in mind that in scalping you have to be more careful and have to control your emotions and also never edit or modify the stop loss that you have set while or after the creation of trade. And if you didn't make any SL then please prefer one because sometimes the market takes unexpected turns and can lead you to a dead end and you will lose all of your funds. You have to increase your profits to overcome the transaction fee or you have to find an exchange that will deduct lesser fees on each transaction. It would be great if you would share on which exchange you are making these trades. But in my thought, Binance is the best but still, I did not face any issue like this on Binance maybe because I always made a bigger profit than the TX fee the opposite of it (make lose).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Beerwizzard",
      "created_time": "September 22, 2023, 04:03:28 PM",
      "body": "Quote from: Michael0410 on September 22, 2023, 09:25:31 AMHi everyone, I am a newbie.I started trading BTCUSDT P. and testing a 1 minute scalping strategy (including several indicators) at the moment.So far... I don't manage to gain any profits from the trades that I did place lately. I do manage to win trades, but the issue is that the fees killing my profits!I am wondering if you have any suggestions regarding the above?Maybe I should move to longer timeframe and not scalping in order to make profits?Many thanksMike  Make your own trading plan before you start trading. In order to get profits you need to have risk-reward ratio over 2,5:2 and open orders accordingly. If your strategy works you gonna make the profit. If you still don't make the money then you need to make a new strategy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Franctoshi",
      "created_time": "September 22, 2023, 04:37:38 PM",
      "body": "Quote from: Michael0410 on September 22, 2023, 09:25:31 AMand testing a 1-minute scalping strategy (including several indicators) at the moment.but the issue is that the fees killing my profits!Maybe I should move to a longer timeframe and not scalping to make profits. Stay away from using a 1-minute chart to trade, it will do you more harm than good. Trading in a bigger time frame such as the 30 Minutes,1HR, and H4 will increase your potential to make a profit, thereby helping you cover the fees. Quote from: Michael0410 on September 22, 2023, 09:25:31 AMI am wondering if you have any suggestions regarding the above.And for the high fees, the platform that I have experienced such high charges is trading on Binance Futures, which led me to quit trading futures on their exchange, Now I use Bybit, So for low trading fees you should try out the Bybit platform to see if you would find them ok in terms of fees.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ZAINmalik75",
      "created_time": "September 22, 2023, 05:59:27 PM",
      "body": "Quote from: Michael0410 on September 22, 2023, 09:25:31 AMI am wondering if you have any suggestions regarding the above?Maybe I should move to longer timeframe and not scalping in order to make profits?Many thanksMike  I don't know who advised you to start scalping, and I also don't know how much capital you had or how much you have invested. But you should not start scalping on your first day of work. Try to blend in and try to observe others, i.e., traders, holders, and crypto enthusiasts, and learn from them how they manage their funds, manage risk, and, at the same time, make a profit by doing scalping.I prefer to do simple spot trading because that would be more useful for you, even if the market went down the path it should not,  your assets or tokens would be the same, but they would lose their value and not liquidate like they would in perpetual trading.I am quite shocked to read that you, as a newbie, started future trading and are also trying to scalp the market. Both need a lot of experience and analysis and without any of them, you can't make enough profits. You must be booking profits whenever you see the PNL going green. Which indicates that you don't have any expected profit in your mind and you are just blindly making trades.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ScamViruS",
      "created_time": "September 22, 2023, 06:35:23 PM",
      "body": "How much profit you can make depends on your trading skill, because trading skill will give you an idea about what market outcome will be. 1 min scalping strategy is not a good strategy in trading, because trading by following this chart will involve big risk. If you don't have huge amount of funds in your trading account and can't upgrade to vip then you can't reduce the fee. So avoid over trading to avoid paying huge fees to the exchange. Definitely try to avoid 1 min scalping, as there is a huge risk that will wipe your trading account to zero before you even know it. Therefore, maximum attention will be paid to the money risk management of the trading account along with the fees, so that no unexpected events occur.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hypnosis00",
      "created_time": "September 22, 2023, 09:38:27 PM",
      "body": "I believe that there is a good time to trade. When using a scalping strategy we must also consider the situation as it works in a time where we can see highly volatile. In fact, 1 minute is quite long when scalping it is probably because there is a problem on your side or the exchange that you are using. Tried to use huge exchanges with high trade volume as I can expect you can make a profit from there but of course, don't make withdrawals right away but rather accumulate more profit and then withdraw just to save the fees.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "taufik123",
      "created_time": "September 22, 2023, 10:30:33 PM",
      "body": "If you're complaining about costs, then look at how much capital you're using to trade scalping, as scalping requires a large amount of capital in order to make a profit that's worth the cost. Scalping is continuous and will not stop when accumulated profits are not collected. If no profit is made, then you need to change your strategy. But in general, if scalping is done correctly and the capital supports it, it will generate good profits. You are also required to have good trading skills, and do technical analysis. if you are a beginner then you must be familiar with fast analysis and determine when to enter and exit.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}