{
  "id": "topic_5456856",
  "title": "svgisawmn",
  "author": "svgisawmn",
  "created_time": "June 19, 2023, 11:52:42 AM",
  "content": "Hey guys! Have you ever had experience with earning passive crypto income? It's quite interesting subject but I need to be Sure where to put my money cuz there are many platforms that just bankrupt and users never get their money backWould be grateful to hear your experience!",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5456856",
  "comments": [
    {
      "author": "Oshosondy",
      "created_time": "June 19, 2023, 12:03:48 PM",
      "body": "Invest in bitcoin. Investment in bitcoin in a time like this is good because bitcoin price is still low compared to its ATH. Just invest and hold it for months or years to see your coins grow in value.Do not invest in any organization, buy bitcoin and hold it in your self-custody or self-hosted wallet which is the right thing that you will do. You should be in control of your coins. If you want to be safer, you can use hardware wallet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Aanuoluwatofunmi",
      "created_time": "June 19, 2023, 12:06:32 PM",
      "body": "If you're dealing with bitcoin in cryptocurrency then try as much as possible to make use of a cold storage for your bitcoin, that should be the permanent means through which you could store your bitcoin on the blockchain if you don't want to loose having control over it by rendering it's control over centralized exchanges to have in custody your private keys to unlocking those coins on the blockchain, if you must use an exchange, then probably for trading or exchange of currencies and not for storing your whole asset or bitcoin investment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BVeyron",
      "created_time": "June 19, 2023, 12:27:51 PM",
      "body": "Quote from: svgisawmn on June 19, 2023, 11:52:42 AMHey guys! Have you ever had experience with earning passive crypto income? It's quite interesting subject but I need to be Sure where to put my money cuz there are many platforms that just bankrupt and users never get their money backWould be grateful to hear your experience! I assume that all the income you can get in crypto is passive, so called long-term hodling. Cryptorading requires much time and a bit of luck, so the money earned by trading is a bit tough money. As for hodling, luck is needed too, but the overall time spent matters. So IMHO buying BTC and/or some top alts is a good idea. There is also one thing everyone should decide personally: the sum of money affordable to buy crypto. Investment strategy is affected heavily by this decision.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "posi",
      "created_time": "June 19, 2023, 12:31:41 PM",
      "body": "Quote from: svgisawmn on June 19, 2023, 11:52:42 AMHey guys! Have you ever had experience with earning passive crypto income? It's quite interesting subject but I need to be Sure where to put my money cuz there are many platforms that just bankrupt and users never get their money backWould be grateful to hear your experience! Passive income, bankrupt platforms...? what you said makes me think you are looking to stake your money to generate passive income with centralized platforms.If my speculation is correct, then I advise you that nothing is certain or will guarantee you. If you want to earn high profits, you must accept high risks, if you want to do nothing and still have income from staking, you must take the risk of losing everything. As far as I can see, you are a complete newbie and don't have any knowledge or experience. What you need now is not a rush to make a profit but knowledge.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jawhead999",
      "created_time": "June 19, 2023, 12:45:45 PM",
      "body": "Can you define what's crypto passive income first?If you define crypto passive income is you stake/lend your coins in a centralized site/pool and you will earn more coin, you has a chance to get scammed.If you define crypto passive income is where you will earn more money in fiat equivalent due to rising of the coin price, you will not get scammed if you invest in decentralized coin and hold it on your non custodial wallet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BD Crypto",
      "created_time": "June 19, 2023, 12:49:13 PM",
      "body": "Quote from: svgisawmn on June 19, 2023, 11:52:42 AMHey guys! Have you ever had experience with earning passive crypto income? It's quite interesting subject but I need to be Sure where to put my money cuz there are many platforms that just bankrupt and users never get their money backAnyway there are a lot of ways to earn crypto passive income. I also have some experiences like I have joined several retroactive airdrops and I try to join popular exchange campaigns. Like Poloniex sometimes offer trading competition or deposit bonus, you can join there and have some decent amount of passive income. I will not say that you may earn a good amount but a decent amount. There are also some retroactive airdrops and genuine airdrops ongoing, you may find them in YouTube or Airdrop related Telegram channels. So that is also a good source of passive income. Another way is to join Bounties in this forum. You can visit Bounties (Altcoins) board to see all running Bounties and can join them easily. Many people are generating a decent amount from the bounty payments. But Remember one thing that all the bounties will not pay you or all aren't worthy. So do some research and join Good Projects.Best Wishes for you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jawhead999",
      "created_time": "June 19, 2023, 01:00:25 PM",
      "body": "Quote from: BD Crypto on June 19, 2023, 12:49:13 PMLike Poloniex sometimes offer trading competition or deposit bonus, you can join there and have some decent amount of passive income. I will not say that you may earn a good amount but a decent amount. There are also some retroactive airdrops and genuine airdrops ongoing, you may find them in YouTube or Airdrop related Telegram channels. So that is also a good source of passive income. Another way is to join Bounties in this forum. You can visit Bounties (Altcoins) board to see all running Bounties and can join them easily. Many people are generating a decent amount from the bounty payments. But Remember one this all the bounties will not pay you or all aren't worthy. So do some research and join Good Projects.Passive income and making money without cost are completely different.Trading competition, you need to watch the candlestick and active for 24/7 because if you miss the moment, you will not win the competition or meet the minimum requirement to withdraw.Bounties, you're need to post, retweet, comment, like, share, translate, creating content, follow, completing KYC which is you're working, not just waiting and you will make money.If you have do some research, it doesn't mean you will prevent of getting scammed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sunsilk",
      "created_time": "June 19, 2023, 01:10:13 PM",
      "body": "Quote from: svgisawmn on June 19, 2023, 11:52:42 AMHey guys! Have you ever had experience with earning passive crypto income? It's quite interesting subject but I need to be Sure where to put my money cuz there are many platforms that just bankrupt and users never get their money backWould be grateful to hear your experience! Proof of stake coins are the ones that will allow you to earn passively. So, it's like an interest that you'll earn which is called APY that you'll earn a percentage annually. Exchanges do offer this but there's the risk on it because you are not the one who's holding the key.Investing in Bitcoin is also gonna earn you passively by its value increasing over time. So if you buy like a hundred bucks of Bitcoin today, you'll earn more than that depending on the future increased price of it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "20kevin20",
      "created_time": "June 19, 2023, 01:17:47 PM",
      "body": "Quote from: sunsilk on June 19, 2023, 01:10:13 PMProof of stake coins are the ones that will allow you to earn passively. So, it's like an interest that you'll earn which is called APY that you'll earn a percentage annually. Exchanges do offer this but there's the risk on it because you are not the one who's holding the key.Sure, if you wanna call a coin decreasing in value by half every year but giving you 17% APY ”passive income” then go ahead and call it that way, but I’m quite less than 10% of the staking tokens actually overperform their own inflation lol. Then if you take a chart of that token against BTC you’ll see it’s only losing value constantly.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Agbe",
      "created_time": "June 19, 2023, 01:50:07 PM",
      "body": "Quote from: svgisawmn on June 19, 2023, 11:52:42 AMHey guys! Have you ever had experience with earning passive crypto income? It's quite interesting subject but I need to be Sure where to put my money cuz there are many platforms that just bankrupt and users never get their money backWould be grateful to hear your experience!  There are three (3) places you can put your money as investment the first place is investment, second is trading and last place is mining. In these three categories you can invest in any one. But before you start any of those ones, make sure you make a good research and if possible learn more about them so that you will loss your money. Always learn from an experience person. It is only exchanges went into bankrupt so you can keep your coins or funds in non custodian wallet for safety purpose.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hd49728",
      "created_time": "June 19, 2023, 01:57:57 PM",
      "body": "Quote from: svgisawmn on June 19, 2023, 11:52:42 AMHave you ever had experience with earning passive crypto income?If your passive income comes from holding your bitcoin and get passive profit from its growth, it is healthy.However if your passive income is promised to come from 'staking' your bitcoin on a platform, it is unhealthy and like a Ponzi. Because, Bitcoin is Proof of Work, not Proof of Stake and when a platform provides such promises, they will have to attract people to send bitcoins to their platform but at the same time, will have to pay money to people who want to withdraw their coins including passive profit.So far you can easily see it is a Ponzi scheme because no guarantee that all people will withdraw their coins when price at withdrawal time is higher than price when they stake it. So if the coin as investment itself is not in profit, the platform has to pay profit to users. It is unsustainable and unhealthy scheme.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PytagoraZ",
      "created_time": "June 19, 2023, 02:01:42 PM",
      "body": "You need the ability to generate passive income from crypto. If you want to play it safe and have a proven profit. Bitcoin is the easiest, buy bitcoin.Investments anywhere have risks, crypto has high risks and high returns too. You can read this before starting trading crypto:What Can Happen If You Want to Trade Cryptocurrencies, but You Don’t Know How?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TheUltraElite",
      "created_time": "June 20, 2023, 10:09:16 AM",
      "body": "Quote from: svgisawmn on June 19, 2023, 11:52:42 AM(snip)...but I need to be Sure where to put my money cuz there are many platforms that just bankrupt and users never get their money back I would remind you the same thing. These platforms dont work as they say they would. Any sort of \"passive income\" generation ends up with your coins vanishing in thin air or the setup getting hacked and your coins are in limbo.I do suggest investing in casino bankroll, which is different from gambling your money, there have been some yield farming projects but most of them are only shitcoins and the time to recover your capital is huge. You would be better off putting your money in bitcoin for long term or just in a fiat bank deposit.You cant be sure that the platform would not go bankrupt. Only you can never go bankrupt if you are keeping bitcoin's stored.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sunsilk",
      "created_time": "June 20, 2023, 01:13:31 PM",
      "body": "Quote from: 20kevin20 on June 19, 2023, 01:17:47 PMQuote from: sunsilk on June 19, 2023, 01:10:13 PMProof of stake coins are the ones that will allow you to earn passively. So, it's like an interest that you'll earn which is called APY that you'll earn a percentage annually. Exchanges do offer this but there's the risk on it because you are not the one who's holding the key.Sure, if you wanna call a coin decreasing in value by half every year but giving you 17% APY ”passive income” then go ahead and call it that way, but I’m quite less than 10% of the staking tokens actually overperform their own inflation lol. Then if you take a chart of that token against BTC you’ll see it’s only losing value constantly.Well, that's the counterpart on these staking coins. You can't expect majority of them to perform very well and if there are some that really does then that's good but won't be the same the next months or year.Another one is the decreasing APY that it gives, while it's still fresh the APY that they'll give is quite high but it's not permanent and will change over time when there are more people that does stake it.On this thing, it's not that really sustainable at all with high percentages and that's why we see most of them drop their rates.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "asriloni",
      "created_time": "June 20, 2023, 04:03:01 PM",
      "body": "Quote from: svgisawmn on June 19, 2023, 11:52:42 AMHey guys! Have you ever had experience with earning passive crypto income? It's quite interesting subject but I need to be Sure where to put my money cuz there are many platforms that just bankrupt and users never get their money backAll of staking platforms were centralized platforms. It's BS if they called their platforms as truly decentralized platforms. I just rely on the capital gain. It's quite better rather than im loosing all of money at once. You must be careful when sending your token for staking purpose. Please, learn from celsius and so many lending platforms were dead. They were offering passive income through staking your money. I can only recommend you to stake your money in centralized exchange site for a short term period if you are wanna dealing with very big risk decision. It's not even recommended anymore to stake in the decentralized platform, celsius and so many platforms were collapse has proven if decentralized platforms were even worse compared with cex.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "livingfree",
      "created_time": "June 20, 2023, 09:48:35 PM",
      "body": "Quote from: asriloni on June 20, 2023, 04:03:01 PMAll of staking platforms were centralized platforms. It's BS if they called their platforms as truly decentralized platforms. I just rely on the capital gain. It's quite better rather than im loosing all of money at once. You must be careful when sending your token for staking purpose. True, it tends out that many decentralized platforms that have been labelling themselves as is are actually semi-centralized or wholly centralized at all.Quote from: asriloni on June 20, 2023, 04:03:01 PMPlease, learn from celsius and so many lending platforms were dead. They were offering passive income through staking your money. And people thought that it's gonna be free money forever but sustaining such feature is unbearable. Most of these lending platforms and those that focuses these passive income for their users through staking struggles.Quote from: asriloni on June 20, 2023, 04:03:01 PMI can only recommend you to stake your money in centralized exchange site for a short term period if you are wanna dealing with very big risk decision. Although there's still risk here and that is you're not holding your keys. So both has risk and you choose what risk you wanna take.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SirLancelot",
      "created_time": "June 21, 2023, 01:54:54 PM",
      "body": "Quote from: svgisawmn on June 19, 2023, 11:52:42 AMHave you ever had experience with earning passive crypto income? It's quite interesting subject but I need to be Sure where to put my money cuz there are many platforms that just bankrupt and users never get their money backWould be grateful to hear your experience! There is nothing like passive income in cryptocurrencies, if there is a person or a website that is telling you that you can earn passive income by investing a specific amount of money with them, you need to keep a fair distance from them because they are just trying to scam you and will run away with your money and you will regret it later. There are also a lot of websites that promise great returns on investments but they are all scams.What you can do with cryptocurrencies to earn genuine profit is trading, you need to learn how to trade, how you can read charts and do analysis and then you should do trading yourself without having anyone else involved, that is the only way you may get profit but it also has its risks, you need to make sure you follow risk-management techniques as well.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dunfida",
      "created_time": "June 21, 2023, 11:27:55 PM",
      "body": "Quote from: svgisawmn on June 19, 2023, 11:52:42 AMHey guys! Have you ever had experience with earning passive crypto income? It's quite interesting subject but I need to be Sure where to put my money cuz there are many platforms that just bankrupt and users never get their money backWould be grateful to hear your experience! Better not to make yourself that too desperate on having that passive income because passive means that it do make out that fixed generated income without doing nothing which it could really be attained through real estate or property which is really that generating some income.If we do speak about crypto investment then it would really be an another story if we do speak about passive income. There's no way that we could attain passive income aside from holding our coins or staking which is something that make that passive but it would really be depending on the market on how it would behave.Better store or accumulate Bitcoin for long term and some top altcoins in the market on which it would be worth than on investing on some altcoins in the market or totally shit which you would be losing money instead of earning.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dansus021",
      "created_time": "June 25, 2023, 02:20:54 AM",
      "body": "Really Passive Income in crypto in my opinion would be mining or staking and both of them require a lot of money. Take example is ETH to run validor node you need 32 ETH in today price it would be ~ $60K which a lot and you do require some technical if solo staking if you choose the other than solo staking you need require less eth but you dont have total control of it and the APY is around 4% but the inflation rate now is more than 4    yo do the math",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}