{
  "id": "topic_5408950",
  "title": "~|cryptogirl.bd|~",
  "author": "~|cryptogirl.bd|~",
  "created_time": "August 06, 2022, 07:12:58 PM",
  "content": "Hello forum member, I actually new in Cryptocurrency gambling. I made a few bet on sport's by fiat on 1xbet I'm also seeing scam accusation against 1xbit there is a similarity on there name I wanna know are they connect ? I also wanna know the which Cryptocurrency based casino is best for me ? Because I saw lots of casino here .",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5408950",
  "comments": [
    {
      "author": "|MINER|",
      "created_time": "August 06, 2022, 07:35:32 PM",
      "body": "Quote from: ~|cryptogirl.bd|~ on August 06, 2022, 07:12:58 PM I made a few bet on sport's by fiat on 1xbet I'm also seeing scam accusation against 1xbit there is a similarity on there name I wanna know are they connect ?You can see below post and I will advise you to avoid both casinoQuote from: hellocrex on February 11, 2022, 12:28:58 PMFor those who doubt that 1xbet == 1xbit. Of course they are different sites but they are under the same brand 1X (which is trademark and the owner is Bryansksoft LLC that developed Crex24.com) and they use different schemes of business - 1xbit uses crypto to be hidden.Also, look at domains they used under same IPs:1. https://bgp.he.net/net/83.147.204.0/22#_dns2. https://www.virustotal.com/gui/ip-address/94.242.237.253/relations3. https://www.virustotal.com/gui/ip-address/213.183.44.21/relations4. https://www.virustotal.com/gui/ip-address/213.183.44.130/relations5. https://www.virustotal.com/gui/ip-address/213.183.44.21/relationsThe reason is that 1X is blocked in Russian internet and they always have to use lots of mirrors to work in RussiaAlso, look at domain names. There are lots of 1xbet and 1xbit similar names under the same IP, so they are managed by the same company.QuoteI also wanna know the which Cryptocurrency based casino is best for me ? Because I seeing lots of casino here .Before choosing a casino, keep in mind about the minimum withdrawal and withdrawal fees. Also visit this post to check about license  - Information of Crypto Casinos License and KYC requirementsAnd visit this to know about the withdrawal amount and fees- Withdrawal Fees and Withdrawal Amounts on Crypto CasinosPersonally I will suggest these casino these are well reputable and cheap in min withdrawal and fees and also supports alt-coins-StakeBetplayBlackJack.FunCloudbetROLLBIT",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blockman",
      "created_time": "August 06, 2022, 07:49:52 PM",
      "body": "Posted as above, there are too many complaints about 1xbit=1xbet and that's why if you don't want to experience it, you should leave them already. Quote from: ~|cryptogirl.bd|~ on August 06, 2022, 07:12:58 PMI also wanna know the which Cryptocurrency based casino is best for me ? Because I saw lots of casino here . Stake has various games that you may like so you should try it. Aside from it, if you have other types of game that you want to play, check the others as well.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Eureka_07",
      "created_time": "August 06, 2022, 07:54:33 PM",
      "body": "Quote from: ~|cryptogirl.bd|~ on August 06, 2022, 07:12:58 PMHello forum member, I actually new in Cryptocurrency gambling. I made a few bet on sport's by fiat on 1xbet I'm also seeing scam accusation against 1xbit there is a similarity on there name I wanna know are they connect ? I also wanna know the which Cryptocurrency based casino is best for me ? Because I saw lots of casino here . These two casinos (1xbit and 1xbet) are sister companies. Both are from Russia. Also both has very bad reputation here as well as on other forums and reputable review sites. Just like what others said, I will advice you to assess them properly. Avoid playing and making your next deposits there before your decision. Roobet, Duelbits, Rollbit, and Stake are few of those that you can play with less/no problem. Goodluck, do some background checking first too before depositing any amount.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yahoo62278",
      "created_time": "August 06, 2022, 08:10:57 PM",
      "body": "Scroll through the gambling section of the forum(ps its the section you posted this thread in) and you will find many different casinos that are reputable. Avoid 1xbit/1xbet if you like money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rruchi man",
      "created_time": "August 06, 2022, 08:26:38 PM",
      "body": "Quote from: ~|cryptogirl.bd|~ on August 06, 2022, 07:12:58 PMI also wanna know the which Cryptocurrency based casino is best for me ? Because I saw lots of casino here . Welcome, it's a good thing you are doing your research before choosing an online casino to use their services, many people make the mistake of not acting like you have and they learn bitter lessons which tarnishes the image of other credible online casinos. There are many credible casino's here with very transparent service. Quote from: |MINER| on August 06, 2022, 07:35:32 PMPersonally I will suggest these casino these are well reputable and cheap in min withdrawal and fees and also supports alt-coins-StakeBetplayBlackJack.FunCloudbetROLLBITThis List cannot be complete without Livecasino.io. I endorse them not just because I promote them, but because I play on their casino and have won a couple of times, their payout to your wallet is very fast as well.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "swogerino",
      "created_time": "August 06, 2022, 08:30:03 PM",
      "body": "A simple scroll here will let you know which one is good and which one is bad.Normally all the casinos have a big thread with many pages here which is called their ANN (Announcement thread) and you can scroll there to see what other people are saying about them,if you see a lot of good writing for the specific casino it means it is a trusted and reputable one,if you see unresolved scam accusations then you will need to avoid this type of casino at all costs.Another thing,a better casino is the one who rewards you for every bet you make,by offering you rakeback,bonuses and VIP levels.Some types of these casinos are Stake and Sportsbet to name a few.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DoublerHunter",
      "created_time": "August 06, 2022, 08:37:07 PM",
      "body": "Quote from: ~|cryptogirl.bd|~ on August 06, 2022, 07:12:58 PMHello forum member, I actually new in Cryptocurrency gambling. I made a few bet on sport's by fiat on 1xbet I'm also seeing scam accusation against 1xbit there is a similarity on there name I wanna know are they connect ? I also wanna know the which Cryptocurrency based casino is best for me ? Because I saw lots of casino here . ^Good thing that you realize earlier about that casino that they are a scam. It probably has not yet happened to you but in the end, when you will hit a big prize they will become have a problem and most likely the complaints are, not processing your withdrawal request. Here is the link to a list of all gambling casinos that has an honest review from the community and their ratings too and I think the best thing is you will do your own research too. It is a gamblingbro.comhttps://bitcointalk.org/index.php?topic=5335097.0",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nakamura12",
      "created_time": "August 06, 2022, 08:56:07 PM",
      "body": "1xbit and 1xbet are connected more like a sister company if you want to know how connected both are. If you check the thread in this board then you will see that there is a forum member posted about 1xbit not paying. So if 1xbit have many accusation going on so 1xbet won't be an exception since both are connected not just by almost similar gambling site name. Try the list that are given, there are known  casinos in Bitcointalk forum that has good reputation and beint legit.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "uneng",
      "created_time": "August 06, 2022, 09:06:13 PM",
      "body": "There are many legit and popular crypto casinos being advertised on this forum through their official threads or through our signature banners.I advise you to check each of them by yourself, so you can take your own conclusions about each of them until you find your favorite one.In my signature banner you will find Stake casino. It's a pretty famous one, going beyond crypto universe and partnering with celebrities and sportsmen who promote the company internationally. You can check what I'm saying by searching them on google or by searching on youtube for gambling content. There are lots of videos displaying Stake platform, which are posted very frequently.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "decodx",
      "created_time": "August 06, 2022, 09:12:29 PM",
      "body": "Quote from: uneng on August 06, 2022, 09:06:13 PMThere are many legit and popular crypto casinos being advertised on this forum through their official threads or through our signature banners.I advise you to check each of them by yourself, so you can take your own conclusions about each of them until you find your favorite one.Yeah. Just like any other platform you'll probably have to take time to see if it's suitable for your gambling needs. Ultimately, the choice is up to you. With so many options available, I would hope that you can find a casino that not only meets your needs, but also pleases your tastes. Hopefully these reviews and listings can help make that process easier.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dunamisx",
      "created_time": "August 06, 2022, 09:22:28 PM",
      "body": "Quote from: ~|cryptogirl.bd|~ on August 06, 2022, 07:12:58 PMHello forum member, I actually new in Cryptocurrency gambling. I made a few bet on sport's by fiat on 1xbet I'm also seeing scam accusation against 1xbit there is a similarity on there name I wanna know are they connect ? I also wanna know the which Cryptocurrency based casino is best for me ? Because I saw lots of casino here . The ones on the forum forum here were most of a reputable ones except for the one you mentioned, and if you notice by clicking it, there will be a warning message reporting their scam danger to you, those are the types that had been tagged with red flags on the forum and if you also gibe more closer look, you will discover that all the established and reputed members of the community stay off their campaign, you can as well make use of the search engine to get more informations on areas that needed more explanation about the forum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coin-investor",
      "created_time": "August 06, 2022, 09:38:35 PM",
      "body": "Quote from: ~|cryptogirl.bd|~ on August 06, 2022, 07:12:58 PMHello forum member, I actually new in Cryptocurrency gambling. I made a few bet on sport's by fiat on 1xbet I'm also seeing scam accusation against 1xbit there is a similarity on there name I wanna know are they connect ? You're lucky to see those accusations they are all true and documented 1XBIT and 1XBET are already established as under one company if you're still playing stop you could be the next victim if you continue to play here, they are notorious scammers here and don't show mercy on people they scam.QuoteI also wanna know the which Cryptocurrency based casino is best for me ? Because I saw lots of casino here . Stake.com Betfury Betcoin.ag are three of the casinos that have established their reputation here in Bitcointalk over the years, you can be sure you can have peace of mind, that's what we all want when playing in casinos.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dothebeats",
      "created_time": "August 06, 2022, 09:39:11 PM",
      "body": "I'm still wondering how you guys are able to land on 1xbit and 1xbet first before you look for other reliable casinos   A lot of newbies in the forum seem to pick up these two platforms online and play on them, albeit the platforms not having an aggressive marketing strategy at all. There are a lot of reputable platforms in the forum if you look into the Gambling section. You can sign up for the platform under my signature and get started on your gambling journey with crypto without hassle and without worries that you'll be scammed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "seoincorporation",
      "created_time": "August 06, 2022, 09:50:45 PM",
      "body": "If you are new in the crypto betting world you should try the most trusted casinos, right now from my point of view they are:Roobet.comStake.comIn those sites you will not have any kind of problem if you win big and want to withdraw all the money.But there are tons of casinos and lots of them with a long history, you should keep an eye in this boards and the ones with more activity and trusted feedback are the good ones.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "robelneo",
      "created_time": "August 06, 2022, 09:54:17 PM",
      "body": "Quote from: ~|cryptogirl.bd|~ on August 06, 2022, 07:12:58 PMHello forum member, I actually new in Cryptocurrency gambling. I made a few bet on sport's by fiat on 1xbet I'm also seeing scam accusation against 1xbit there is a similarity on there name I wanna know are they connect ? I also wanna know the which Cryptocurrency based casino is best for me ? Because I saw lots of casino here . Newbies should be like you, they need to do research when they are started to play or already playing because they have no idea what casinos are trusted or not, not because they are advertised they will just accept and play on that casino if all newbies are like you, we'll have these scam casinos out of business, and now since you asked about what casino or casinos are best for you always look for trust associated with their name and Duelbits is one casino that has already established that and I can proudly recommend it to you and to everybody looking for a good casino to play.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Saint-loup",
      "created_time": "August 06, 2022, 09:54:41 PM",
      "body": "Quote from: coin-investor on August 06, 2022, 09:38:35 PMQuote from: ~|cryptogirl.bd|~ on August 06, 2022, 07:12:58 PMHello forum member, I actually new in Cryptocurrency gambling. I made a few bet on sport's by fiat on 1xbet I'm also seeing scam accusation against 1xbit there is a similarity on there name I wanna know are they connect ? You're lucky to see those accusations they are all true and documented 1XBIT and 1XBET are already established as under one company if you're still playing stop you could be the next victim if you continue to play here, they are notorious scammers here and don't show mercy on people they scam.QuoteI also wanna know the which Cryptocurrency based casino is best for me ? Because I saw lots of casino here . Stake.com Betfury Betcoin.ag are three of the casinos that have established their reputation here in Bitcointalk over the years, you can be sure you can have peace of mind, that's what we all want when playing in casinos.You shouldn't use those words, nobody should \"have peace of mind\" when he plays at a custodial casino and especially if he manages to make some profits, most of custodial casinos are likely to lock your funds with unfair reasons when you start to withdraw big amounts of winnings. That's why it's better to always stay cautious and avoid to let winnings accumulating on your account without withdrawing them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coupable",
      "created_time": "August 06, 2022, 10:09:15 PM",
      "body": "You are not the only one who finds it difficult to choose the right platform even when you come here to the forum, which is the largest gathering of crypto slots.My advice to you and all newcomers is to rely on one of these two sites which combine almost all the top gambling platforms and casinos with honest reviews of any of them. Both sites are run by trusted members of the Bitcointalk forum and almost all reviews are fair enough.The first site is https://www.btcgosu.com and it has the advantage that it can provide you with a list of platforms that support your country without the need to modify the search characteristics.The second site is https://gamblingbro.com and it contains reviews from many users, where you can also check scam sites and leave your assessment for the platforms you use.Note: Both sites do not require registration or any information to use them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AmoreJaz",
      "created_time": "August 06, 2022, 10:51:07 PM",
      "body": "Quote from: coupable on August 06, 2022, 10:09:15 PMYou are not the only one who finds it difficult to choose the right platform even when you come here to the forum, which is the largest gathering of crypto slots.My advice to you and all newcomers is to rely on one of these two sites which combine almost all the top gambling platforms and casinos with honest reviews of any of them. Both sites are run by trusted members of the Bitcointalk forum and almost all reviews are fair enough.The first site is https://www.btcgosu.com and it has the advantage that it can provide you with a list of platforms that support your country without the need to modify the search characteristics.The second site is https://gamblingbro.com and it contains reviews from many users, where you can also check scam sites and leave your assessment for the platforms you use.Note: Both sites do not require registration or any information to use them.i can agree with those 2 gambling review sites about their fairness when it comes to the reviews. aside from that, since the OP is already here in the forum, he can basically roam around the gambling board and check the respective threads of the casinos. if he has a lot of time, he can browse and read the thread and see for himself about the feedback of their players. he can already get insights about how the site is treating their players and what aspect of the casino he wants to explore with.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wexnident",
      "created_time": "August 06, 2022, 11:14:54 PM",
      "body": "Take your time to read and scroll through the various threads and discussions to pick the best casino that you'd like among the many casinos out there. Just make sure to visit their ANN thread and scour around to see whether they're reputable or not. I'd upvote on trying to check out https://www.btcgosu.com/, it's a pretty good site imo with a pretty long and reputable list of casinos that you can find and play on. If it's a matter of KYC then you can refer to this thread:https://bitcointalk.org/index.php?topic=5381143.0Happy gambling!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}