{
  "id": "topic_5462121",
  "title": "bitmover",
  "author": "bitmover",
  "created_time": "August 04, 2023, 10:39:18 PMLast edit: August 22, 2023, 09:48:17 AM by bitmover",
  "content": "Autor: GazetaBitcoinTópico Original: The Crypto Anarchist Manifesto - We all should read itSeguindo o tópico do bitmover, outro artigo obrigatório é The Crypto Anarchist Manifesto (Manifesto Cripto Anarquista), escrito por Tim May.[/i]O ensaio foi tornado público pela primeira vez em 1988 (4 anos antes do artigo de Eric Hughes, A Cypherpunk Manifesto), na conferência Crypto '88 e retrata a visão extraordinária de Tim May sobre alguns aspectos que se tornaram reais 30 anos depois.O manuscrito detalha como a tecnologia baseada em criptografia e sistemas de reputação mudarão o mundo como o conhecemos, incluindo governos, impostos ou controle econômico:\"A tecnologia do computador está prestes a fornecer a capacidade de indivíduos e grupos se comunicarem e interagirem uns com os outros de maneira totalmente anônima. Duas pessoas podem trocar mensagens, conduzir negócios e negociar contratos eletrônicos sem nunca saber o Nome Verdadeiro ou a identidade legal da outra. As interações nas redes não serão rastreáveis, por meio de amplo reencaminhamento de pacotes criptografados e caixas à prova de violação que implementam protocolos criptográficos com garantia quase perfeita contra qualquer adulteração. As reputações serão de importância central, muito mais importantes nos negócios do que até mesmo as classificações de crédito de hoje. Esses desenvolvimentos alterarão completamente a natureza da regulamentação governamental, a capacidade de tributar e controlar as interações econômicas, a capacidade de manter as informações em segredo e até mesmo alterar a natureza da confiança e da reputação.\".A visão de May certamente pode ser apreciada em cripto com a visão de Júlio Verne na ficção científica.Com tão poucas palavras, ele expressou tantos desenvolvimentos tecnológicos reais, como contratos inteligentes, Tor, a tecnologia do Bitcoin ou o sistema de reputação (usado, por exemplo, no Bitcointalk como os sistemas Merit e Trust).A referência ao \"Nome Verdadeiro\" pode ser inspirada no romance \"Nomes Verdadeiros\" de Vernor Vinge (1981), que é uma bela obra de arte.Ele também previu o aparecimento de mercados negros e a luta dos governantes para impedir que a informação chegasse ao povo:\"O Estado certamente tentará retardar ou deter a disseminação dessa tecnologia, citando questões de segurança nacional, uso da tecnologia por traficantes de drogas e sonegadores de impostos e temores de desintegração social. Muitas dessas preocupações serão válidas; a cripto anarquia permitirá que segredos nacionais sejam negociados livremente e materiais ilícitos e roubados sejam negociados. Um mercado computadorizado anônimo possibilitará até mercados abomináveis para assassinatos e extorsão. Vários elementos criminosos e estrangeiros serão usuários ativos da CryptoNet. Mas isso não impedirá a disseminação da cripto anarquia.\".O ensaio termina com \"Levante-se, você não tem nada a perder a não ser suas cercas de arame farpado!\". As cercas de arame farpado são bastante conhecidas pelos americanos. Eles fazem parte de sua história: os territórios do oeste eram cercados de arame farpado e os vaqueiros, que queriam liberdade, cortavam os arames. É um chamado para lutar contra a corrupção e a opressão dos governantes. Contra os esforços das agências secretas para fechar as informações.Todos nós devemos continuar o trabalho dos Cypherpunks e lutar pela liberdade!",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5462121",
  "comments": [
    {
      "author": "joker_josue",
      "created_time": "August 04, 2023, 11:45:08 PM",
      "body": "Quote from: bitmover on August 04, 2023, 10:39:18 PMEscrito em 1992, o texto de Timothy May é brilhante e assustadoramente real. É impressionante como o bitcoin caiu como uma luva nesse manifesto, e mostra como a chegada do bitcoin era inevitável, e não pode ser contida de forma alguma.Fui pesquisar um pouco sobre o May (não conhecia - ou não me lembrava de quem era), e foi interessante notar que a revista Reason o disse no seu obituário que ele foi uma \"influência significativa tanto no bitcoin quanto no WikiLeaks\".Ele foi engenheiro sénior na Intel, e morreu com 66 anos em 2018. Poderá ter sido ele o Satoshi? Alguma vez surgiu teorias sobre isso?Sabe se ele escreveu alguma coisa sobre o Bitcoin?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Disruptivas",
      "created_time": "August 05, 2023, 12:16:44 AM",
      "body": "É um texto lindissimo!Não sei se todos conhecem, mas há alguns anos eu fundei junto à um colega, o movimento Cypherpunks Brasil, focado exatamente em traduzir artigos classicos. Esse foi um dos primeiros artigos que traduzimos.Caso alguém tenha interesse em conhecer mais sobre, tem dezenas de artigos traduzidos. Hoje nem eu nem ele mais fazemos parte dos que mantem, mas o projeto continua super forte. Vou deixar o link pra vocês, tem artigos lindissimos traduzidos já.Channel Telegram: https://t.me/CypherpunksBrasilSite: https://cypherpunks.com.brGroup: https://t.me/+wBi42tQxtw80YjRhGithub: https://github.com/cypherpunksbrLBRY: https://lbry.tv/@CypherpunksBrasilEsse ano também fui convidada pra palestrar na CryptoRave e ganhei de presente um livrinho com vários desses artigos classicos. Recomendo a leitura a todos.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "darkv0rt3x",
      "created_time": "August 05, 2023, 10:16:50 AMLast edit: August 05, 2023, 05:08:46 PM by Adriano",
      "body": "Quote from: joker_josue on August 04, 2023, 11:45:08 PMQuote from: bitmover on August 04, 2023, 10:39:18 PMEscrito em 1992, o texto de Timothy May é brilhante e assustadoramente real. É impressionante como o bitcoin caiu como uma luva nesse manifesto, e mostra como a chegada do bitcoin era inevitável, e não pode ser contida de forma alguma.Fui pesquisar um pouco sobre o May (não conhecia - ou não me lembrava de quem era), e foi interessante notar que a revista Reason o disse no seu obituário que ele foi uma \"influência significativa tanto no bitcoin quanto no WikiLeaks\".Ele foi engenheiro sénior na Intel, e morreu com 66 anos em 2018. Poderá ter sido ele o Satoshi? Alguma vez surgiu teorias sobre isso?Sabe se ele escreveu alguma coisa sobre o Bitcoin?Já conhecia o Tim May há algum tempo, como entusiasta do movimento cripto-anarquista que sou. Li o manifesto e achei também o mesmo e foi por aí que comecei a interessar-me pelo movimento e também por tudo o que representa e pela ligação que tem com uma boa parte das propriedades de Bitcoin.Eu apostaria até que Tim May, Adam Back eventualmente conheceriam Jim Bell que temos falado em outra thread! É porque me parece estar tudo relacionado!Não sei se conhecem uma plataforma online que apoia movimentos alternativos políticos, chamada RiseUp. Eles têm vários serviços mas aquilo não me parece muito movimentado. No entanto, acho que nasceram ali alguns movimentos engraçados!Tentei lá criar um canto para Bitcoin mas disseram-me que só aceitavam movimentos políticos. Não percebi porque Bitcoin tem tudo a ver com política! lolhttps://riseup.net/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GazetaBitcoin",
      "created_time": "August 07, 2023, 02:52:33 PM",
      "body": "Obrigado bitmover por envolver esta causa e por partilhar a sabedoria de Tim May entre os falantes de lingua portuguesa! Este ensaio é uma ilustração maravilhosa do trabalho de Tim May, e é incrível como seus pensamentos, expressos há mais de 30 anos, agora fazem parte de nossa realidade.A quem ainda não leu o manifesto, sugiro que o leia. É curto e contém tantos valores...Tim May era um visionário e fazia parte do núcleo do movimento Cypherpunk. Graças ao seu trabalho, agora temos acesso a criptografia livre, comunicações privadas e Bitcoin. Satoshi foi, talvez, um dos últimos Cypherpunks. Os trabalhos deles o inspiraram e o ajudaram a desenvolver esta incrível invenção chamada Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "August 18, 2023, 01:37:04 PM",
      "body": "Quote from: GazetaBitcoin on August 07, 2023, 02:52:33 PMObrigado bitmover por envolver esta causa e por partilhar a sabedoria de Tim May entre os falantes de lingua portuguesa! Este ensaio é uma ilustração maravilhosa do trabalho de Tim May, e é incrível como seus pensamentos, expressos há mais de 30 anos, agora fazem parte de nossa realidade.A quem ainda não leu o manifesto, sugiro que o leia. É curto e contém tantos valores...Tim May era um visionário e fazia parte do núcleo do movimento Cypherpunk. Graças ao seu trabalho, agora temos acesso a criptografia livre, comunicações privadas e Bitcoin. Satoshi foi, talvez, um dos últimos Cypherpunks. Os trabalhos deles o inspiraram e o ajudaram a desenvolver esta incrível invenção chamada Bitcoin.@GazetaBitcoin O tópico original foi editado, com uma tradução fidegina do seu artigo.Saudações.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "l3pox",
      "created_time": "November 02, 2023, 03:16:22 PM",
      "body": "bem interessante! valeu por compartilharestava com esse aberto aqui faz semanas e não tinha lido ainda por achar que era bem mais longo do que é.vários cruzamentos ideológicos com o \"second realm\" que a @Disruptivas já comentou algumas vezes aquinessa linha o que mais acham que vale a pena ler?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Paredao",
      "created_time": "November 02, 2023, 08:06:59 PM",
      "body": "Quote from: Lucasgabd on November 02, 2023, 03:16:22 PMnessa linha o que mais acham que vale a pena ler?Eu recomendo o livro que acabou de ser lançado de um grande \"mestre\" brasileiro Paulo Kogos. Esse sujeito é um prodígio. Será um futuro best-sellers. Quem sabe se ele não ganha o próximo prêmio Nobel de Literatura. Deverá ser o primeiro brasileiro laureado com tal importante premio.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}