{
  "id": "topic_5436175",
  "title": "Cryptomiles1",
  "author": "Cryptomiles1",
  "created_time": "January 20, 2023, 08:57:01 PM",
  "content": "Hello all,I want to know from people's opinion about their reaction towards a signature post.Like for instance, you join a campaign and you are required to post about 20 or 25, but due to some reasons you decided to add additional  post to about 28 or even 29 post out of 25 required post. At last during weekly update you notice about your 5 to 10 post were disqualified.What would be your reactions?Do you think other managers who doesn't disqualify post aren't knowledgeable enough or they are just being friendly or knowing that not all that are fluent with english.I have joined lot of well known managers campaign but they hardly rejects post.I am curious to know why only 1 or 2 managers do rejected post and remove participants without any note or comments on their spreadsheet.What do we called thisBeing rude or not being friendly?Note very clearly that I don't mention anyone but if you think this post  is directly pointing at you then you have to be compassionate with your participants as we all are humans despite you are a manager doesn't mean you should toy with peoples time and efforts.Lets discuss.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5436175",
  "comments": [
    {
      "author": "yahoo62278",
      "created_time": "January 20, 2023, 09:33:27 PM",
      "body": "Campaign manager decides whether a post is quality or not. If you cannot handle their rules or opinion then leave the campaign. What you view as quality doesn't matter. It's what the manager views as quality. You can pm the manager and ask what posts were not counted and why. They should offer you some sort of explanation, but in the end their count is their count.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Awaklara",
      "created_time": "January 20, 2023, 09:41:58 PM",
      "body": "You need to know, each campaign manager has criteria and standards regarding post quality. believe me, when you are accepted, they put their hope that you will play a role in the campaign they are running.if your post is not accepted by the campaign manager, you can ask the reason. it might be due to a board the campaign manager disliked or excluded.Or if you don't like how the campaign manager works the way you mean it, you can leave and find one that's friendlier to you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cryptomiles1",
      "created_time": "January 20, 2023, 09:49:30 PM",
      "body": "@Yahoo62278 sincerely speaking I m very grateful seeing that a good Manager like you responded to this post, I have been given a chance to join your campaign previous but you were very fair with us. I don't think you have for one day rejected any of my post or other participants either remove us without any reasons. Does this means you are not knowledgeable enough to reject post?Appart from merits rules you sets which in turns was so much appreciated to know the best quality poster.I would love more managers to comment here so that we can know their reasos because I believe some are very rude while sending pm to them.How is your health sir, Trust there is a positive results towards you?Sorry I asked here but your response here made me to recall about your health.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yahoo62278",
      "created_time": "January 20, 2023, 09:58:39 PM",
      "body": "Quote from: Cryptomiles1 on January 20, 2023, 09:49:30 PM@Yahoo62278 sincerely speaking I m very grateful seeing that a good Manager like you responded to this post, I have been given a chance to join your campaign previous but you were very fair with us. I don't think you have for one day rejected any of my post or other participants either remove us without any reasons. Does this means you are not knowledgeable enough to reject post?Appart from merits rules you sets which in turns was so much appreciated to know the best quality poster.I would love more managers to comment here so that we can know their reasos because I believe some are very rude while sending pm to them.How is your health sir, Trust there is a positive results towards you?Sorry I asked here but your response here made me to recall about your health.Every manager has a different idea of what is considered quality. I have been a little more relaxed on quality as I have other issues on my mind. I can be more strict if you would like? Otherwise, as long as participants are mostly on topic and they meet the other rule requirements, I count the post.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Saisher",
      "created_time": "January 20, 2023, 10:26:17 PM",
      "body": "Quote from: Cryptomiles1 on January 20, 2023, 08:57:01 PMHello all,I want to know from people's opinion about their reaction towards a signature post.Like for instance, you join a campaign and you are required to post about 20 or 25, but due to some reasons you decided to add additional  post to about 28 or even 29 post out of 25 required post. At last during weekly update you notice about your 5 to 10 post were disqualified.What would be your reactions?Do you think other managers who doesn't disqualify post aren't knowledgeable enough or they are just being friendly or knowing that not all that are fluent with english.I have joined lot of well known managers campaign but they hardly rejects post.I am curious to know why only 1 or 2 managers do rejected post and remove participants without any note or comments on their spreadsheet.What do we called thisBeing rude or not being friendly?Note very clearly that I don't mention anyone but if you think this post  is directly pointing at you then you have to be compassionate with your participants as we all are humans despite you are a manager doesn't mean you should toy with peoples time and efforts.Lets discuss.I have worked with some of the managers here and I never encounter any issues if I have issues with my post count I send a pm to my manager or a place where he wants me to contact him, you have to address it if you think the post count is not fair, maybe you are posting in sections that are not counted or you are participating in a mega thread or your post is redundant, by asking him for feedback about your post count, you can improve your posting habit.Managers are not only counting posts they are also checking if your post has substance and is within topic.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Aanuoluwatofunmi",
      "created_time": "January 21, 2023, 08:28:28 AM",
      "body": "Quote from: Cryptomiles1 on January 20, 2023, 08:57:01 PMbut due to some reasons you decided to add additional  post to about 28 or even 29 post out of 25 required post. At last during weekly update you notice about your 5 to 10 post were disqualified.What would be your reactions?What you considered reading the campaign rules over and over again that you're sure that you meet up with the required standard for posting, incase you forgot let me remind you of some common ones, post must not be less than 125 characters with semantic meaning, post in some board where signature will not be displayed will not count, we start and week week end time, minimum posting requirements, minimum and maximum board posting requirements, if your post was not counted as required by you then you must have fall a victim of any of the above rules i mentioned, check yourself and not the campaign manager.Quote from: Cryptomiles1 on January 20, 2023, 08:57:01 PMDo you think other managers who doesn't disqualify post aren't knowledgeable enough or they are just being friendly or knowing that not all that are fluent with english.I think all you need here is to understand that each manager has his own campaign rules and it's better you stop comparison one one campaign from the other and work towards their posting requirements to get paid, the thing is plain you can see all through your post history if you meet those requirements or not.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fullcoinese",
      "created_time": "January 21, 2023, 09:03:58 AM",
      "body": "OP, if you're dedicating this thread to getting more feedback from the manager campaign, maybe you could also send them a PM to give their opinion on your concerns. although I'm not sure some of them will come here.because from your description above it seems very clear it refers to a BTC-paid signature campaign. because for the signature bounty campaign, I don't think the post calculation will be that detailed.but anyway campaign managers have their rules. they manage the campaign with what they want and also requests from clients. each bounty manager has his assessment regarding post quality. some even limit the maximum number of posts that can be made in certain threads such as gambling and local boards.I hope you can study the problem, and try to adapt it to the character of your campaign manager. if all of that goes against you, maybe avoiding the manager as well as the project he's working on is the only solution.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LoyceV",
      "created_time": "January 21, 2023, 09:39:37 AM",
      "body": "Quote from: Cryptomiles1 on January 20, 2023, 08:57:01 PMyou join a campaign and you are required to post about 20 or 25That's your first mistake: don't join a campaign that requires a minimum number of posts.Quotebut due to some reasons you decided to add additional  post to about 28 or even 29 post out of 25 required post.Great! You should post because this is a forum, not because it's a job.QuoteAt last during weekly update you notice about your 5 to 10 post were disqualified.What would be your reactions?I don't see a problem. I'm totally fine with posts not qualifying for payment, as long as the campaign manager doesn't tell me what I can or can't post.QuoteDo you think other managers who doesn't disqualify post aren't knowledgeable enough or they are just being friendly or knowing that not all that are fluent with english.Most campaign managers, and especially the ones who pay in made-up tokens instead of Bitcoin, don't care about spam.QuoteI have joined lot of well known managers campaign but they hardly rejects post.A good campaign manager wouldn't need to reject a lot of posts, as they wouldn't allow shitposters to join in the first place.QuoteI am curious to know why only 1 or 2 managers do rejected post and remove participants without any note or comments on their spreadsheet.What do we called thisBeing rude or not being friendly?Or maybe they're just doing their job. Can you show examples?Quoteyou have to be compassionate with your participantsThat's not how most of the job market works, unfortunately.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Adbitco",
      "created_time": "January 21, 2023, 10:08:52 AM",
      "body": "It mostly depends on the managers and some are very strict with their rules but most of them doesn't really care about post, in as much you posted at the required sections (board) then all your post would be counted towards your paid for the week. Hence, most of the managers gives a max post they can paid for, perhaps whenever you exceeded the maximum they required the rest post wouldn't be counted and will not paid for it.Maybe next try to ask your manager to explain and throw more lights to you. What i understood is that you didn't get the rules correctly.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Beparanf",
      "created_time": "January 21, 2023, 10:20:48 AM",
      "body": "Just my 2 cents. Probably campaign manager knew someone who can replace you with a much more quality post base on his own criteria. The competition for signature campaign is increasing due to new good users that climb up their rank while the number of open signature campaigns is only a few. Btw why not reach the campaign manager personally so that you knew exactly what the reason is and you can improve to join again on his campaign in the future? Doing this will not gonna change your CM decision while you are just limiting yourself on joining his campaigns. You should reach out since we are just the worker here.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "YOSHIE",
      "created_time": "January 21, 2023, 10:38:59 AM",
      "body": "Quote from: Cryptomiles1 on January 20, 2023, 08:57:01 PMLets discuss.Each manager has different (Rules and Requirements) for their campaign participants, some are super strict (required), some are mediocre, some managers do consider/prioritize quality posts, not quantity for participants. there are also managers who warn 1-2 times for participants that posts must comply with the requirements and there are also those who immediately cut their campaign participants, if they do not suit the wishes of the manager and the campaign, maybe that's too cruel.As you said, the manager is also a human being, my understanding, if the participants do not match what the manager suggests in the campaign, the best way to give a warning is better, rather than cutting blindly, if it doesn't suit the manager's wishes, 1-2 warnings don't change either, maybe an action must be decided, the point is: human character is different, everything can be discussed, it has a noble heart.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Getmon",
      "created_time": "January 21, 2023, 10:45:44 AM",
      "body": "The best way to find out why your posts were deemed unqualified is to message the manager and inquire about it. Once a manager determines whether a post is a quality or not, participants really have nothing to do, in my opinion. Managers adhere to their own set of standards and are knowledgeable. They will not last long as managers and get to work on numerous campaigns if they are not knowledgeable. However, if the manager is just beginning his services, participants may be able to make suggestions, but this does not guarantee that the manager will implement them. Let us keep in mind that this is their campaign, so they set their rules. We follow or we can simply leave if we do not like it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Little Mouse",
      "created_time": "January 21, 2023, 11:02:02 AM",
      "body": "Quote from: Cryptomiles1 on January 20, 2023, 09:49:30 PMI don't think you have for one day rejected any of my post or other participants either remove us without any reasons. Does this means you are not knowledgeable enough to reject post?I don't think that proves yahoo62278 is knowledgeable or not. That proves yahoo62278 has their own way of evaluating a post and so does the other campaign manager has too. Check Chipmixer, though I have never checked participants post purposely but I'm sure Darkstar sometime count a post which can be very small or sometimes reject a post which is lengthy.Anyway, I think you should move on. If you don't like a campaign manager's post count, ignore his campaign. In addition, follow what LoyceV said. Try to avoid campaign which requires x amount of posts to be paid.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SatoPrincess",
      "created_time": "January 21, 2023, 11:59:57 AM",
      "body": "Quote from: Cryptomiles1 on January 20, 2023, 08:57:01 PMHello all,I want to know from people's opinion about their reaction towards a signature post.Like for instance, you join a campaign and you are required to post about 20 or 25, but due to some reasons you decided to add additional  post to about 28 or even 29 post out of 25 required post. At last during weekly update you notice about your 5 to 10 post were disqualified.What would be your reactions?Do you think other managers who doesn't disqualify post aren't knowledgeable enough or they are just being friendly or knowing that not all that are fluent with english.I have joined lot of well known managers campaign but they hardly rejects post.I am curious to know why only 1 or 2 managers do rejected post and remove participants without any note or comments on their spreadsheet.What do we called thisBeing rude or not being friendly?Note very clearly that I don't mention anyone but if you think this post  is directly pointing at you then you have to be compassionate with your participants as we all are humans despite you are a manager doesn't mean you should toy with peoples time and efforts.Lets discuss.So much drama in reputation board. Soon we will have topics about  “why this campaign pay more than others”  If you don’t like the rules of a campaign you should quietly leave the campaign or not apply in the first place. Every manager and campaign have preferences where they want their participants to post, amount of posts and gap between post(burst posting) the most popular is 5 posts a day. These rules are on the campaign thread, it’s your fault if you don’t read them before applying. I don’t think any manager would reject your posts if they meet the campaign criteria.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FatFork",
      "created_time": "January 21, 2023, 12:16:53 PM",
      "body": "Quote from: Cryptomiles1 on January 20, 2023, 08:57:01 PMLike for instance, you join a campaign and you are required to post about 20 or 25, If I understand correctly, you are participating in a pay-per-post campaign, which means that even though some of your posts were rejected, you were still compensated for the remaining ones. I wouldn't be upset about that, as it is typical for a manager to have stricter rules in such a campaign.Quote from: Cryptomiles1 on January 20, 2023, 08:57:01 PMDo you think other managers who doesn't disqualify post aren't knowledgeable enough or they are just being friendly or knowing that not all that are fluent with english.I have joined lot of well known managers campaign but they hardly rejects post.Personally, I wouldn't mind if managers paid more attention to the quality of their participants' posts, particularly in the Gambling section, where there seems to be a lot of spam. (I want to make it clear that I haven't checked your posts, and I'm not saying they were spam.)Quote from: Cryptomiles1 on January 20, 2023, 08:57:01 PMI am curious to know why only 1 or 2 managers do rejected post and remove participants without any note or comments on their spreadsheet.What do we called thisBeing rude or not being friendly?I recall having a similar discussion a few years ago when I was just starting my journey in this community. I was inexperienced and naive (in terms of this forum) and the manager's actions offended and hurt me emotionally. But over time, you learn to develop a thicker skin and not be affected by such things as much. Looking back, today I would say that everyone has the right to hold their own opinion, and even if it differs from yours, it's important to learn to respect it. The only thing within your control is your own actions, and working on bettering yourself and proving them wrong, as I have done, is the best course of action. As others have pointed out already, this is their party, they make the rules. Either you dance to their tune or you can always leave the dance floor.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SatoPrincess",
      "created_time": "January 21, 2023, 12:42:00 PM",
      "body": "I can see from your campaign spreadsheet, the campaign manager denied 5 posts reducing hour eligible post count to 23. From your words, I can sense you must be really hurt by this. I checked your post for that week and could easily find the posts that didn’t meet signature requirements. The campaign rules are clear, only 10 posts in gambling board were counted as eligible, your posts in off-topic weren’t counted and the others that didn’t meet 150 characters length or wasn’t considered constructive was denied as well. You can do the review again yourself and be the judge.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "January 21, 2023, 01:14:00 PM",
      "body": "The rules are the rules. If there is a rule that allows them to do so, and you agreed to the terms before joining, you cannot object.The thing that can be objected to is if the campaign manager writes comments about the quality of your posts or asks you to develop them because I think he is asking you to improve the quality of spam, otherwise why did he appoint you in the first place if your posts are good or at least it is better to write such tips in private.In general, you can contact the owner and explain to him the behavior of the campaign manager. If your point of view is correct, they may change the campaign manager.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "robelneo",
      "created_time": "January 21, 2023, 01:33:13 PM",
      "body": "Quote from: Cryptomiles1 on January 20, 2023, 08:57:01 PMI am curious to know why only 1 or 2 managers do rejected post and remove participants without any note or comments on their spreadsheet.What do we called thisBeing rude or not being friendly?When it doubt ask, or forever hold your grudge, the managers already laid out the rules when they start the campaign, your duty as a part of the campaign is to check that you are within that rules if you think that you have followed the rules and you are taken out of the campaign then you have the right to know and the bounty manager will give it to you if you ask him, by not naming the manager you put some of the managers questioning their reputation so to relieve the other managers better name the manager if you have the guts to do it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yahoo62278",
      "created_time": "January 21, 2023, 01:45:40 PM",
      "body": "Quote from: LoyceV on January 21, 2023, 09:39:37 AMQuotebut due to some reasons you decided to add additional  post to about 28 or even 29 post out of 25 required post.Great! You should post because this is a forum, not because it's a job.You can definitely tell who is here for a job and who is here posting because they are interested in a topic. There are multiple users who do the exact number of posts required and they get mad as hell if they don't get paid because 1 doesn't meet quality standards or a post was deleted.Regardless, the managers decision is final and users need to realize that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}