{
  "id": "topic_5407739",
  "title": "ChiBitCTy",
  "author": "ChiBitCTy",
  "created_time": "July 27, 2022, 01:52:40 AM",
  "content": "I’m sure this topic has been talked about before on here many times, but not sure I’ve ever seen anyone start a thread about it. I’ve read through many of Satoshis threads over the years (some more than once), studied everything about him I have been able to find etc, and one aspect of his creation I find really fascinating is that he left the project when he did. I’m convinced he knew from day one he was going to leave the project like he did. That fact that there’s no face to bitcoin lends so much to its value as a currency and asset. Do you feel the same way, or have a different take on it?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5407739",
  "comments": [
    {
      "author": "Dave1",
      "created_time": "July 27, 2022, 02:35:23 AMLast edit: July 27, 2022, 04:24:00 AM by Dave1",
      "body": "Quote from: ChiBitCTy on July 27, 2022, 01:52:40 AMI’m sure this topic has been talked about before on here many times, but not sure I’ve ever seen anyone start a thread about it. I’ve read through many of Satoshis threads over the years (some more than once), studied everything about him I have been able to find etc, and one aspect of his creation I find really fascinating is that he left the project when he did. I’m convinced he knew from day one he was going to leave the project like he did. That fact that there’s no face to bitcoin lends so much to its value as a currency and asset. Do you feel the same way, or have a different take on it? In my opinion, he didn't plan to leave bitcoin in the beginning, based on this quote:Quote from: satoshi on December 11, 2010, 11:39:16 PMIt would have been nice to get this attention in any other context.  WikiLeaks has kicked the hornet's nest, and the swarm is headed towards us.So the way I interpret it, perhaps he thinks of slowing down first or totally leaving the project in which he did. And Satoshi could have been right, because months after, Gavin will visit the CIA.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "July 27, 2022, 03:47:59 AM",
      "body": "I think there is only a small chance that Satoshi planned his leave from the start. However, there is a bigger chance that the circumstances forced him to leave for good such as Gavin's visiting the CIA that @Dave1 mentioned and was very alarming for someone who wanted to protect his privacy and didn't want to be pressured into doing stuff to bitcoin that were against the ideology that bitcoin stands for.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oluwa-btc",
      "created_time": "July 27, 2022, 04:12:29 AM",
      "body": "Sometimes, I ponder what would have happened to him if he hadn't gone so low,by keeping he's real identity a secret. I haven't real dug into Satoshi in general readings but he's done a big one for those who knows and see's the importance/ futuristic views of Bitcoin.Those fiat currencies are Fvcked up day after day, backed up by nothing just the government and the media won't say shit about it. ( So much sorry cause that was off T ) but, gathering those cheap SATs while they're cheap would be worth it.  Real Life; I'll want to meet Satoshi Nakamoto in Person. Possibility ?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "odolvlobo",
      "created_time": "July 27, 2022, 05:17:49 AM",
      "body": "Quote from: ChiBitCTy on July 27, 2022, 01:52:40 AMI’m convinced he knew from day one he was going to leave the project like he did.I think that your claim would gain more support if you would just provide something to back it up.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TheNineClub",
      "created_time": "July 27, 2022, 05:36:22 AM",
      "body": "Whether or not it was a planed leave, it's completly understandable that people change their goals in life and do not align with the path that they are taking at the miment. Burn out, wanting to start something new, or just a wish to let things go to see what can happen of it, all legit resons to step back. It could have been planed, but not necesseraly as it looks to be some well thought out plan to keep BTC creation anonymous.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mindrust",
      "created_time": "July 27, 2022, 05:44:03 AM",
      "body": "Quote from: ChiBitCTy on July 27, 2022, 01:52:40 AMI’m sure this topic has been talked about before on here many times, but not sure I’ve ever seen anyone start a thread about it. I’ve read through many of Satoshis threads over the years (some more than once), studied everything about him I have been able to find etc, and one aspect of his creation I find really fascinating is that he left the project when he did. I’m convinced he knew from day one he was going to leave the project like he did. That fact that there’s no face to bitcoin lends so much to its value as a currency and asset. Do you feel the same way, or have a different take on it? The way I see it, he left us the basics of the blockchain tech and wanted us to improve it.Think it like this:When you are in school (preferably primary school), the teacher asks you a math question, sometimes you just can't even move a finger and freeze. However, when the teacher gives you a hint, then everything becomes clear as day and you answer the question in a second.That's what satoshi did. He gave us a hint. The basics of a blockchain. He wanted the other people to figure out the rest.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Don Pedro Dinero",
      "created_time": "July 27, 2022, 06:02:32 AM",
      "body": "Regardless of whether he had planned it from the beginning or not, what he was clear about was the risks he faced, and so he took precautions not to be identified. To create a new P2P currency against the establishment in order to create a system that does not depend on central banks and governments is to put himself in the bull's eye. The creation of currencies is reserved for governments through central banks. It can be argued that the Fed is a private entity, but the US government has influence over it and in the case of the ECB it is a public institution. Creating a new currency and proposing it as an alternative system to this one is punishable by imprisonment. Although today, if Satoshi were to come out, I don't know if he would have problems, because despite what he wrote in the White Paper, bitcoin has been considered a financial asset, and not a currency, so I don't think he could technically be prosecuted.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "romero121",
      "created_time": "July 27, 2022, 06:13:10 AMLast edit: July 27, 2022, 06:23:12 AM by romero121",
      "body": "Only Satoshi know whether he planned for an exit from the beginning or it happened by chance. According to my view on his innovation, his identity could've been a problem by now. During the initial stages this could've been never been into consideration. Right now the growth is big, even without any form of promotion. Everything we experience by now have taken place through word of mouth spreading. Beyond certain point the involvement of corporate have made it popular for their business revenue. Right now the technology is much discussed as an innovation for transparency. Accordingly the transparency could cause a big change in the governance. So this could've been a threat and governments too might keep looking for Satoshi.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "July 27, 2022, 08:28:00 AMLast edit: July 27, 2022, 08:43:44 AM by franky1",
      "body": "Quote from: ChiBitCTy on July 27, 2022, 01:52:40 AMI’m sure this topic has been talked about before on here many times, but not sure I’ve ever seen anyone start a thread about it. I’ve read through many of Satoshis threads over the years (some more than once), studied everything about him I have been able to find etc, and one aspect of his creation I find really fascinating is that he left the project when he did. I’m convinced he knew from day one he was going to leave the project like he did. That fact that there’s no face to bitcoin lends so much to its value as a currency and asset. Do you feel the same way, or have a different take on it? he never planned to be the decision maker. the central point of failure and it seemed from his earlier messages he never had a exit plan scheduled. although he did have an idea that other peoples contributions would mean he can/would walk away at anytime. but it didnt seem like he planned when/why to leave as a schedule.when he left it seemed like a decision he made at the time of leaving rather then a scheduled exit planned from the start.he still had idea's flowing of things that bitcoin could become and wanted to help right up until the end, so it didnt seem like he was ready to leave in a sceduled way where he was wrapping things up ready to retire. but ended up leaving because it all just got too much risk for bitcoin/himself if he stayed as it will going to break his philosophy of bitcoin by staying any longer.parts of the reasons he left were not just wikileaks or silkroad or gavin talking at a CIA presentation. it was that other devs were asking satoshi if they could/should add things, as if he was a decision maker. which he did not like being thought of as a central point.i feel like he had a light bulb moment at the end where he realised he was becoming a central point. EG not liking wikileaks/cia presentation. and realising if he starts to dictate what others should do, visit, accept. aswell as continue to pat people on the back for contributing, or weighing in on patch idea's too managerially, he would be breaking his own philosophy, so he just leftas for the leaving 'lending so much to its value as a currency and asset'.. not really.the non-requirement of a central guy/core(central point not brand) team should be part of bitcoins value, although recent years people have foolishly become reliant on a core team(brand and central point)the real value is this.after 13 years. satoshi still has coin associated with certain public keys. anyone can see these. and yet after 13 years.no one has been able to hack that value, or use the public data to associate to a human persons birth certified identity. now thats the true value indicator of a good currency that offers value store protection and identity dis-association.. not the fact that he left, but the fact that others cant use/abuse thecoins he left(ontop of this block reward address of block9 is a 're-used' spend address, yet 13 years later no-one has been able to use the FUD of 're-used address risk' to gain anything out of satoshi)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Doan9269",
      "created_time": "July 27, 2022, 09:00:57 AM",
      "body": "Quote from: ChiBitCTy on July 27, 2022, 01:52:40 AMaspect of his creation I find really fascinating is that he left the projectWe may not really concluded about saying Satoshi left the project because right from day one he started the forum he wad active not until after some while he left, situation may warrant that for him to left, or create an alts that has an entire different name just to remain more anonymous, but his major reason is best known to him since he never on any thread stated why, but am much convinced that Satoshi is there busy developing more solution to bitcoin application and coverage scope just as it may be in the case of metaverse for instance, he may stay mute as appearing to us but the consequences of his actions were felt all over the world.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yazher",
      "created_time": "July 27, 2022, 09:11:18 AM",
      "body": "Seems possible but I think he decided to hide when bitcoins were quickly recognized and more people are becoming interested in them at the same time there are lots of agencies all around the world who wanted to track him and the moment he felt he is being monitored, he didn't waste a time and quickly hide forever. The guy was actively participating in this community and posting as if he was just a common user but I think when it was time to disappear, he really made a vow not to post anything forever. If he is still alive, he might be here with us using a different name but he won't gonna tell us.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "darkangel11",
      "created_time": "July 27, 2022, 09:30:06 AM",
      "body": "I believe in the theory of a tragic accident. Every day thousands of people die in car accidents and around the time he disappeared there were tsunamis in Asia. If he never shared details of his work with friends and family it's possible they threw away his computer or wiped it and sold it thinking there's some boring math and code in there for a project he never finished. Maybe he died a lonely man and there was nobody to inherit his belongings. Maybe they were lost in his accident, burned in his car or plane crash...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "July 27, 2022, 09:41:51 AM",
      "body": "Quote from: yazher on July 27, 2022, 09:11:18 AMSeems possible but I think he decided to hide when bitcoins were quickly recognized and more people are becoming interested in them at the same time there are lots of agencies all around the world who wanted to track him and the moment he felt he is being monitored,in 2008 he did fear that creating 'new money', would get him into legal trouble. thus its why he hid himself from the start. however he did quickly come to the understanding that bitcoin was unstoppable and he had no 'backdoor' key that an agency could torture out of him to break bitcoin so by the end that fear of torture/arrest was not his main fear. he just didnt like idea's of bitcoin being corrupted into the illegal realms of where governmentsa. wont allow bitcoin to growEG try to stop bitcoin due to associations with wikileaks/silkroad.orb.where other devs would get corrupted by governmetn agensies(bribed, employed, coerced) where governments gain control of bitcoin via becoming/using 'insider' devs tweaking code to government preferred utility.but he didnt want to dictate the path bitcoin should follow to avoid getting bad reputations. so his end decision appeared more to do with not wanting to be seen as the manager/dictator of bitcoins future, for his personal philosophy reasons of what bitcoin should be(open and free of centralisation)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaveF",
      "created_time": "July 27, 2022, 10:58:51 AM",
      "body": "As an opinion, yes from the beginning Satoshi planned at some time to drop off the radar so to speak.For the when and how, no I think it was more along the lines of when and how would be a good time to leave and let BTC be it's own thing. Had Satoshi thought having a big going away party with a reveal as to who they were in Vegas was better then that could have just as easily happened.Was there external influence, probably some.Since Satoshi always maintained anonymity it mattered less.Just my view.-Dave",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tbct_mt2",
      "created_time": "July 27, 2022, 11:09:13 AM",
      "body": "Satoshi likely did not make an exit plan at start but did make a solid plan to maintain privacy and anonymity. You can be doxed then exit if you want to leave but with Satoshi Nakamoto, nobody can know real identity of Satoshi after many years.If Satoshi did not seriously care about identity, something would have been leaked in cypherpunk group, in sourcefoge forum or in this forum. In fact nothing was leak that could destroy his privacy and anonymity.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Accardo",
      "created_time": "July 27, 2022, 12:57:42 PM",
      "body": "Satoshi must have concealed his intentions on bitcoin, he constructed the network in a way it can run without his presence. So his intention in my veiw was to disappears and stay clear from too many interviews and disputes. Since the project can run without Satoshi what need is it to keep worrying about him, knowing he is fine in any of his location. The project he invented is doing perfectly well and getting the attention of the world on daily basis. Imagine what Zuckerberg pass through for owning Facebook, Satoshi would have been in a bigger mess for owning bitcoin and sticks around, he won't be safe or sleep well due to distraction from the Government personnel trying to change his mind on the regulation of bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackHatCoiner",
      "created_time": "July 27, 2022, 02:04:19 PM",
      "body": "Quote from: ChiBitCTy on July 27, 2022, 01:52:40 AMI’m convinced he knew from day one he was going to leave the project like he did.So how did he leave? I only know that he left, not the reason. Sure, CIA must have put some pressure as pooya87 pointed out, but that's not how he justified it. From the last conversation he had with Mike Hearn, he said he's moved on to other things. Completely unknown, though.Full conversation here: https://plan99.net/%7Emike/satoshi-emails/thread5.html",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NeuroticFish",
      "created_time": "July 27, 2022, 02:18:25 PM",
      "body": "Quote from: ChiBitCTy on July 27, 2022, 01:52:40 AMDo you feel the same way, or have a different take on it? He may have had plans to step back at some point, sooner or later, but from my knowledge, Gavin's visit at CIA has greatly rushed the things.I'm not even convinced whether he has \"left\" willingly or not...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PX-Z",
      "created_time": "July 27, 2022, 02:24:05 PM",
      "body": "Quote from: ChiBitCTy on July 27, 2022, 01:52:40 AMI’m convinced he knew from day one he was going to leave the project like he did. I guess every developer of a certain open source project will do the same that's the very reason of being an open source project.What i actually observed based on the previous discussions by him and the community. He doesn't want to leave that early as the bitcoin project is still on its very early stage of development. But I know he has exit plan (as I mentioned above as a developer of an open source projet). Though the very reason why he leave so early and force him to do it is because of the wikiLeaks incident.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}