{
  "id": "topic_5398530",
  "title": "James68",
  "author": "James68",
  "created_time": "May 13, 2022, 02:12:52 PM",
  "content": "First, web 3.0 racing competition and earn passive incomeVirtual marathon races permit athletes to finish their race on a treadmill, however, most virtual marathon races require GPS or cell phone application following to confirm the fulfillment of the full distance. When the user can run on a treadmill, their GPS can calculate the number of steps and get rewards like every 100 steps can earn 1 marathon token, a native token named MAR and a winner can get a 10,000 utility MRACE token which is used for a governance token, also have a compatible function for winners they can sell these at a premium price and trade they’re like an EVM compatible blockchain like Ethereum, avalanche smart contract, fantom opera, and polygon. Several other different marathon categories are to be defined;Beginner Marathon where they have to run at least 12 KM’s and 1 token for every 50 steps for all and once they are done or finish they will get rewards of 500 MRACE tokens.Gainer Marathon where they have to run at least 25 KM’s and 1 token for every 25 steps for all and once they are done or finish they will get rewards of 1200 MRACE tokens.Strong Marathon where they have to run at least 40 KM’s and 1 token for every 15 steps for all and once they are done or finish they will get rewards of 2500 MRACE tokens.Expert Marathon where they have to run at least 50+ KM’s and 1 token for every 12 steps for all and once they are done or finish they will get rewards of 4000 MRACE tokens and also known as a hybrid marathon because it’s a mixer of hiking and normal marathon on road.Marathon Competitionsa) Cycle marathon competitions use Gym cycles with VR headsets instead of physical cyclingThe plan of VR headsets exergames, so they are agreeable and drawing in, for various age gatherings, is as of now under-explored. While numerous cyclists might be longing for nature, indoor cycling has its advantages, following advancement is exact and you don’t have to stress over nasty weather conditions.b) Swimming marathon competition using VRThe capability of underwater computer-generated simulation exercises is unlimited. By using VR, a swimming marathon is a new way of exciting for the athletes to enroll and gain such a tremendous experience underwater, athletes can also calculate each lap by using GPS which will help the individual performances.c) Road marathon competition using VROn a hot, bright day, the actual demonstration of running up a slope might be seen to be harder than running at a similar grade and distance on a treadmill. However, if surveying the genuine, instead of seen, advantages of running, open-air running will normally dominate the competition. Regardless of whether you run at a similar speed on a treadmill, you will by and large exhaust more energy running outside.d) Trail marathon competition using VRUnlike street running and track running, it usually happens on climbing trails, frequently in the rocky territory, where there can be a lot bigger climbs and plunges. It is hard to conclusively recognize trail running from cross-country running.NFTs MarketplaceThe following are detailed categories of NFTs marketplace that need to be defined:For Shoes:A Category Shoes: 100 MRACE TokensB Category Shoes: 75 MRACE TokensC Category Shoes: 50 MRACE TokensFor Bottles:Red bull: 25 MRACE TokensJuice Bottle: 20 MRACE TokensCold Water Bottle: 10 MRACE TokensFor Sunglasses:Sunglasses: 5 MRACE TokensMission and VisionTeam development plays a serious role in the future expansion because, in fast-moving markets, traditional hierarchical structures are giving way to agile teams that can respond quickly to new challenges, solve problems and innovate at speed. Team development also achieves the most engagement, and success which gets marvellous achievements like app development, which are the most useful asset in the field of Move2Earn or Race2Earn sector like shoes, digital and non-digital collectibles water, and much more, and that team has also shown tremendous achievements in the future aspects as well which will change the face of blockchain and its implementation at every sector. The promotion and several other policies which will help the use and adoption of blockchain technology, and its main purpose is to keep a degree of greatness and principles in all projects that will give the discussion public and global importance. Team development will be to learn and find the groundbreaking capability of Blockchain Technology and its capacity to change the life of common people.Social Media Linkshttps://twitter.com/Marathoncashhttps://www.reddit.com/user/Marathoncashhttps:https://marathoncash.com/https://github.com/Marathoncashhttps://marathoncash.medium.com/https://www.instagram.com/marathon.cash/https://www.facebook.com/Marathoncashhttps://discord.gg/bCCFagxNCr",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5398530",
  "comments": []
}